{
    "main_text": "Metaphysics: Matter and Motion, Cause and Effect\n2. Metaphysics: Matter and Motion, Cause and Effect\n\n\nThe metaphysical position with which Holbach is most often associated\nis a negative one: atheism. Although indeed Holbach devotes the entire\nsecond volume of Système de la nature and all\nof Le Bon Sens to the defense of atheism and the criticism of\nparticular claims about God, his views do not hold great philosophical\ninterest. They emphasize well worn topics such as the problem of evil,\nthe impossibility of discussing intelligibly what is unknowable, the\nsuspect psychological origins of religious belief, and the confusion\nof traditional descriptions of God in terms that are simply the\nnegation of genuine descriptive terms: for example, to say that God is\ninfinite is just to deny that God is finite. None of these arguments\nis unique to Holbach or especially well presented by him. His positive\nmetaphysics, on the other hand, has been somewhat overshadowed by his\nlong and loud expressions of atheism, and it will be the focus of this\ndiscussion.\n\n\nHolbach takes nature to consist in matter and motion and nothing else.\nNature is known to us, when it can be known, as a sequence of causes\nand effects: \nThe universe, that vast assemblage of every thing that\nexists, presents only matter and motion: the whole offers to our\ncontemplation nothing but an immense, an uninterrupted succession of\ncauses and effects. [System of Nature, 15]\n\n\nHolbach’s metaphysics, then, is mechanistic, in that any correct\nexplanation of an event will refer only to matter, motion, and the\nlaws which describe their combination. Holbach’s ambitious attempt to\ndraw from this sparse metaphysics answers to questions often thought\nto involve something more than this, his Système de la\nnature, is badly marred, in some places, by over-simplification\nand, in others, by dogmatism. Indeed Goethe in his memoirs\n(Dichtung und Wahrheit vol. 9, 490–492) credits the\naccount of nature in this work with forever turning him away from\nFrench philosophy. Nevertheless, Holbach’s metaphysics does form the\nbasis for his engaging religious, ethical, and political views, and it\ndoes so by means of an innovative recasting of a traditional account\nof the properties of matter. \n\n\nHolbach’s account of matter may best be understood against the\nbackground of the Lockean account, which is more familiar and from\nwhich in large part it is developed. (Israel 2006 traces the sources\nof the views of Holbach and the coterie in detail.) On Locke’s\naccount of bodies (Book 2, Chapter 8 of his Essay), all\nbodies possess “real” or “primary” qualities\n(solidity, extension, figure, number, and motion). Real qualities are\nthose which are “inseparable” from the bodies\nthemselves. To take Locke’s example (Essay 2.8.9), a\ngrain of wheat will have solidity, extension, figure and so on when it\nis intact, and it will retain these properties whatever happens to\nit. Locke distinguishes primary qualities from powers in bodies to\nproduce sensations in observers, which he calls secondary\nqualities. Secondary qualities, for example, are color, sound, taste,\nand so on. Because he hesitates to call secondary qualities real\nqualities, it is clear that Locke takes them to have a metaphysical\nstatus different from that he gives primary qualities.\n\n\nThere may be several different ways of accounting for Locke’s\ndistinction between primary and secondary qualities. The important\naspect of the distinction for the present discussion is that on\nLocke’s view we ought always to explain a secondary quality in terms of\na primary quality by which it produces the relevant sensation in us.\nColors, sounds, smells and so on are on Locke’s account powers that a\nbody has as a result of its particular shape, motion, and so on which\nproduce the relevant sensations in observers: “[Secondary\nqualities] are only Powers to act differently upon other things, which\nPowers result from the different Modifications of those primary\nqualities” (Essay 2.8.23). For example, in arguing that some,\napparently more genuine properties of fire, such as heat, are really on\nthe same footing with qualities such as the tendency to melt wax that\nare more obviously relational, Locke holds that each of these qualities\nalike are powers that a body has in virtue of its primary qualities to\nproduce certain effects[my emphasis added]: “…the power in fire to\nproduce a new color, or consistency in wax or clay by its primary\nqualities is as much a quality in fire, as the power it has to\nproduce in me a new idea or sensation of warmth or burning”\n(Essay 2.8.10). For Locke, then, all bodies have primary\nqualities, and any secondary qualities that they have are to be\nunderstood in terms of the primary qualities that produce them.\n\n\nHolbach maintains something like Locke’s distinction between primary\nand secondary qualities, but he does not insist that the properties of\nbodies that Locke calls secondary qualities, are properties that bodies\npossess in virtue of particular primary qualities. Matter, for Holbach,\nis whatever makes up bodies and causes the sense impressions that we\nhave of them. Matter, in general, may be said to have properties in the\nsense that there are some properties that anything which is matter will\npossess. These properties are roughly the Lockean primary qualities\n(with the important exception of motion, of which more below). However,\nHolbach holds that matter is a class, rather than a particular thing,\nsince different objects may possess different properties as well:\nA satisfactory definition of matter has not yet been\ngiven…[Man] looked upon it as a unique being…whilst he ought to\nhave contemplated it as a genus of beings, of which the\nindividuals, although they might possess some common properties, such\nas extent, divisibility, figure, etc., should not, however, be all\nranked in the same class, nor comprised under the same\ndenomination.\n\n\nSo we may say that both a fire and a building have extent,\ndivisibility and so on, but that a building has some properties, such\nas grayness, that fire lacks and that fire has some properties, such as\nluminance, that the building lacks. It may be that some of the\nproperties that some but not all particular bodies have are to be\nunderstood in terms of primary qualities, but Holbach does not insist\non this point. The properties which Locke called secondary qualities\nare not distinguished from primary qualities by the fact that they are\nrightly understood in terms of them. Rather, the only distinction\nbetween these properties and primary qualities is that primary\nqualities are in all matter alike and secondary qualities are in only\nsome bodies. Of fire, for example, Holbach writes:\nFire, besides these general properties common to all\nmatter, enjoys also the peculiar property of being put into activity by\na motion producing on our organs of feeling the sensation of heat and\nby another, which communicates to our visual organs the sensation of\nlight. [System of Nature, 24]\n\n\nFire, in other words, besides having figure, extension and the other\nproperties of matter in general, has also the “peculiar”\nproperties of heat and luminance. These further properties are,\nmetaphysically, no different from the properties common to all matter,\non Holbach’s view, and they belong to fire in just as basic and\njust as mysterious a way as its extent and figure. \n\n\nHolbach’s choice of example reflects a likely familiarity with\ncriticisms of the Lockean basis for the distinction between primary and\nsecondary qualities found in the writings of Berkeley and Holbach’s\nfriend and correspondent, Hume. Both of these authors use the example\nof the feeling of pain in heat (Berkeley, Three Dialogues I;\nHume Treatise 1.4.4, 3) as a first step in demonstrating the\nmind-dependence of all properties of body alike and so of casting into\ndoubt any supposed difference in kind between primary and secondary\nqualities.\n\n\nHolbach’s recasting of the distinction between primary and secondary\nqualities in terms of properties that matter possesses universally and\nproperties that only some bodies possess helps him to avoid the\nBerkeleyan criticism of the distinction. Holbach never claims, as Locke\ndoes, that properties such as color and sound have a metaphysical\nstatus different from that of the primary qualities. Lockean secondary\nqualities are, for Holbach, basic, inexplicable qualities of matter on\na par with extension and solidity and distinguished from them only on\nthe grounds that they are possessed by some bodies and not others.\nBecause Holbach allows that some matter possesses qualities that other\nmatter does not possess, his notion of matter is more varied than\nLocke’s. For Locke, all matter is homogenous, in the sense that it\npossesses all of the primary qualities and no other real qualities\nbesides. For Holbach, matter is heterogenous. It is a\ngenus of beings, of which the individuals, although they\nmight possess some common properties, such as extent, divisibility,\nfigure, etc., should not, however, be all ranked in the same class, nor\ncomprised under the same general denomination. [System of\nNature, 3]\n\n\nThe heterogeneity of matter in Holbach’s metaphysics puts him at a\ndisadvantage to the traditional Lockean view, in a sense. Locke’s\naccount of matter, if true, is simpler and has great explanatory power:\nthe full panoply of sensations that we encounter are to be explained by\nan account of our sensory organs, a short list of primary qualities,\nand the laws which govern their interaction. Holbach, on the other\nhand, requires separate explanations for each perceived property. He\npromises an explanation of all phenomena in terms of matter and motion,\nbut delivers not even a framework for such an explanation.\n\n\nIn another sense, though, the heterogeneity of matter is helpful to\nHolbach’s project. Materialistic accounts of human nature are often\nthought to fail just because human beings seem to have properties, such\nas thought and freedom, that matter does not have. In making matter a\ngenus of varied beings, Holbach creates a view flexible enough to\naccommodate an account of human nature more robust than that of many\nother materialists:\n…Man is, as a whole, the result of a certain\ncombination of matter, endowed with particular properties, competent\nto give, capable of receiving, certain impulses, the arrangement of\nwhich is called organization, of which the essence is, to feel, to\nthink, to act, to move, after a manner distinguished from other beings\nwith which he can be compared. Man, therefore, ranks in an order, in a\nsystem, in a class by himself, which differs from that of other\nanimals, in whom we do not perceive those properties of which he is\npossessed. [System of Nature 15]\n\n\nHolbach’s naturalism requires that human nature be understood in terms\nof laws and that human action be comprehended under universal\ndeterminism. But it allows that, in many ways, human beings may differ\nin kind from other bodies, even animals, and it allows that human\nbeings may have many properties, notably thought, that have\ntraditionally been denied to matter. \n\n\nThe heterogeneity of matter in Holbach’s account contributes to the\nvagueness of that designation. Matter can to some extent be understood in\nthe ordinary sense of anything that has extention, figure, and so on.\nHowever, because matter also may or may not have any number of\nproperties not ordinarily understood to belong to matter, such as\nthought, it is not entirely clear what may not be matter. Motion is\nlikewise and for similar reasons a vague term in Holbach. Where matter\nis understood simply as extension and some other very simple\nproperties, motion may be thought of in similarly simple terms, as a\nvelocity, acceleration or, perhaps, as an impulse with a certain\ndirection. Once matter is thought of, after the manner of Holbach, as\nsomething with properties which are perhaps best not understood in\nspatial terms, its motion may be much more difficult to define.\nAlthough he sometimes speaks of matter and motion in narrower senses,\nHolbach’s tendency is simply to identify matter and motion with the\ngeneral terms cause and effect. Holbach typically identifies bodies\nwith causes and motions with effects, but he also allows that motions\nmay be causes:\nA cause is a being which puts another in motion,\nor which produces some change in it. The effect is the change\nproduced in one body by the motion or presence of another. [System\nof Nature 16]\n\n\nTo understand human beings and human society in terms of matter and\nmotion, then, is simply to understand them in terms of causes and\neffects. Holbach’s naturalism in ethics and political theory\nextends to a commitment to ground those disciplines in an account of\nhuman nature understood in terms of lawlike regularities, most\nimportantly, psychological laws. But Holbach is not a naturalist in\nthe stricter sense of attempting to understand human beings in terms\nof the same laws that explain the rest of nature. Determinism is\nuniversal, in Holbach’s view, but different sorts of bodies may\nhave peculiar properties that require peculiar explanations. Despite\nhis avowed materialism, Holbach does not demand the sorts of reductive\nexplanations of mental events that materialism might ordinarily seem\nto require. \n",
    "section_title": "2. Metaphysics: Matter and Motion, Cause and Effect",
    "entry_title": "Paul-Henri Thiry (Baron) d’Holbach",
    "hierarchy_title": "Paul-Henri Thiry (Baron) d’Holbach || Metaphysics: Matter and Motion, Cause and Effect",
    "tokenized_text": [
        "metaphysics",
        "matter",
        "motion",
        "cause",
        "effect",
        "metaphysics",
        "matter",
        "motion",
        "cause",
        "effect",
        "metaphysical",
        "position",
        "holbach",
        "often",
        "associated",
        "negative",
        "one",
        "atheism",
        "although",
        "indeed",
        "holbach",
        "devotes",
        "entire",
        "second",
        "volume",
        "système",
        "de",
        "la",
        "nature",
        "le",
        "bon",
        "sen",
        "defense",
        "atheism",
        "criticism",
        "particular",
        "claim",
        "god",
        "view",
        "hold",
        "great",
        "philosophical",
        "interest",
        "emphasize",
        "well",
        "worn",
        "topic",
        "problem",
        "evil",
        "impossibility",
        "discussing",
        "intelligibly",
        "unknowable",
        "suspect",
        "psychological",
        "origin",
        "religious",
        "belief",
        "confusion",
        "traditional",
        "description",
        "god",
        "term",
        "simply",
        "negation",
        "genuine",
        "descriptive",
        "term",
        "example",
        "say",
        "god",
        "infinite",
        "deny",
        "god",
        "finite",
        "none",
        "argument",
        "unique",
        "holbach",
        "especially",
        "well",
        "presented",
        "positive",
        "metaphysics",
        "hand",
        "somewhat",
        "overshadowed",
        "long",
        "loud",
        "expression",
        "atheism",
        "focus",
        "discussion",
        "holbach",
        "take",
        "nature",
        "consist",
        "matter",
        "motion",
        "nothing",
        "else",
        "nature",
        "known",
        "u",
        "known",
        "sequence",
        "cause",
        "effect",
        "universe",
        "vast",
        "assemblage",
        "every",
        "thing",
        "exists",
        "present",
        "matter",
        "motion",
        "whole",
        "offer",
        "contemplation",
        "nothing",
        "immense",
        "uninterrupted",
        "succession",
        "cause",
        "effect",
        "system",
        "nature",
        "holbach",
        "metaphysics",
        "mechanistic",
        "correct",
        "explanation",
        "event",
        "refer",
        "matter",
        "motion",
        "law",
        "describe",
        "combination",
        "holbach",
        "ambitious",
        "attempt",
        "draw",
        "sparse",
        "metaphysics",
        "answer",
        "question",
        "often",
        "thought",
        "involve",
        "something",
        "système",
        "de",
        "la",
        "nature",
        "badly",
        "marred",
        "place",
        "oversimplification",
        "others",
        "dogmatism",
        "indeed",
        "goethe",
        "memoir",
        "dichtung",
        "und",
        "wahrheit",
        "vol",
        "credit",
        "account",
        "nature",
        "work",
        "forever",
        "turning",
        "away",
        "french",
        "philosophy",
        "nevertheless",
        "holbach",
        "metaphysics",
        "form",
        "basis",
        "engaging",
        "religious",
        "ethical",
        "political",
        "view",
        "mean",
        "innovative",
        "recasting",
        "traditional",
        "account",
        "property",
        "matter",
        "holbach",
        "account",
        "matter",
        "may",
        "best",
        "understood",
        "background",
        "lockean",
        "account",
        "familiar",
        "large",
        "part",
        "developed",
        "israel",
        "trace",
        "source",
        "view",
        "holbach",
        "coterie",
        "detail",
        "locke",
        "account",
        "body",
        "book",
        "chapter",
        "essay",
        "body",
        "posse",
        "real",
        "primary",
        "quality",
        "solidity",
        "extension",
        "figure",
        "number",
        "motion",
        "real",
        "quality",
        "inseparable",
        "body",
        "take",
        "locke",
        "example",
        "essay",
        "grain",
        "wheat",
        "solidity",
        "extension",
        "figure",
        "intact",
        "retain",
        "property",
        "whatever",
        "happens",
        "locke",
        "distinguishes",
        "primary",
        "quality",
        "power",
        "body",
        "produce",
        "sensation",
        "observer",
        "call",
        "secondary",
        "quality",
        "secondary",
        "quality",
        "example",
        "color",
        "sound",
        "taste",
        "hesitates",
        "call",
        "secondary",
        "quality",
        "real",
        "quality",
        "clear",
        "locke",
        "take",
        "metaphysical",
        "status",
        "different",
        "give",
        "primary",
        "quality",
        "may",
        "several",
        "different",
        "way",
        "accounting",
        "locke",
        "distinction",
        "primary",
        "secondary",
        "quality",
        "important",
        "aspect",
        "distinction",
        "present",
        "discussion",
        "locke",
        "view",
        "ought",
        "always",
        "explain",
        "secondary",
        "quality",
        "term",
        "primary",
        "quality",
        "produce",
        "relevant",
        "sensation",
        "u",
        "color",
        "sound",
        "smell",
        "locke",
        "account",
        "power",
        "body",
        "result",
        "particular",
        "shape",
        "motion",
        "produce",
        "relevant",
        "sensation",
        "observer",
        "secondary",
        "quality",
        "power",
        "act",
        "differently",
        "upon",
        "thing",
        "power",
        "result",
        "different",
        "modification",
        "primary",
        "quality",
        "essay",
        "example",
        "arguing",
        "apparently",
        "genuine",
        "property",
        "fire",
        "heat",
        "really",
        "footing",
        "quality",
        "tendency",
        "melt",
        "wax",
        "obviously",
        "relational",
        "locke",
        "hold",
        "quality",
        "alike",
        "power",
        "body",
        "virtue",
        "primary",
        "quality",
        "produce",
        "certain",
        "effect",
        "emphasis",
        "added",
        "the",
        "power",
        "fire",
        "produce",
        "new",
        "color",
        "consistency",
        "wax",
        "clay",
        "primary",
        "quality",
        "much",
        "quality",
        "fire",
        "power",
        "produce",
        "new",
        "idea",
        "sensation",
        "warmth",
        "burning",
        "essay",
        "locke",
        "body",
        "primary",
        "quality",
        "secondary",
        "quality",
        "understood",
        "term",
        "primary",
        "quality",
        "produce",
        "holbach",
        "maintains",
        "something",
        "like",
        "locke",
        "distinction",
        "primary",
        "secondary",
        "quality",
        "insist",
        "property",
        "body",
        "locke",
        "call",
        "secondary",
        "quality",
        "property",
        "body",
        "posse",
        "virtue",
        "particular",
        "primary",
        "quality",
        "matter",
        "holbach",
        "whatever",
        "make",
        "body",
        "cause",
        "sense",
        "impression",
        "matter",
        "general",
        "may",
        "said",
        "property",
        "sense",
        "property",
        "anything",
        "matter",
        "posse",
        "property",
        "roughly",
        "lockean",
        "primary",
        "quality",
        "important",
        "exception",
        "motion",
        "however",
        "holbach",
        "hold",
        "matter",
        "class",
        "rather",
        "particular",
        "thing",
        "since",
        "different",
        "object",
        "may",
        "posse",
        "different",
        "property",
        "well",
        "satisfactory",
        "definition",
        "matter",
        "yet",
        "given",
        "man",
        "looked",
        "upon",
        "unique",
        "beingwhilst",
        "ought",
        "contemplated",
        "genus",
        "being",
        "individual",
        "although",
        "might",
        "posse",
        "common",
        "property",
        "extent",
        "divisibility",
        "figure",
        "etc",
        "however",
        "ranked",
        "class",
        "comprised",
        "denomination",
        "may",
        "say",
        "fire",
        "building",
        "extent",
        "divisibility",
        "building",
        "property",
        "grayness",
        "fire",
        "lack",
        "fire",
        "property",
        "luminance",
        "building",
        "lack",
        "may",
        "property",
        "particular",
        "body",
        "understood",
        "term",
        "primary",
        "quality",
        "holbach",
        "insist",
        "point",
        "property",
        "locke",
        "called",
        "secondary",
        "quality",
        "distinguished",
        "primary",
        "quality",
        "fact",
        "rightly",
        "understood",
        "term",
        "rather",
        "distinction",
        "property",
        "primary",
        "quality",
        "primary",
        "quality",
        "matter",
        "alike",
        "secondary",
        "quality",
        "body",
        "fire",
        "example",
        "holbach",
        "writes",
        "fire",
        "besides",
        "general",
        "property",
        "common",
        "matter",
        "enjoys",
        "also",
        "peculiar",
        "property",
        "put",
        "activity",
        "motion",
        "producing",
        "organ",
        "feeling",
        "sensation",
        "heat",
        "another",
        "communicates",
        "visual",
        "organ",
        "sensation",
        "light",
        "system",
        "nature",
        "fire",
        "word",
        "besides",
        "figure",
        "extension",
        "property",
        "matter",
        "general",
        "also",
        "peculiar",
        "property",
        "heat",
        "luminance",
        "property",
        "metaphysically",
        "different",
        "property",
        "common",
        "matter",
        "holbach",
        "view",
        "belong",
        "fire",
        "basic",
        "mysterious",
        "way",
        "extent",
        "figure",
        "holbach",
        "choice",
        "example",
        "reflects",
        "likely",
        "familiarity",
        "criticism",
        "lockean",
        "basis",
        "distinction",
        "primary",
        "secondary",
        "quality",
        "found",
        "writing",
        "berkeley",
        "holbach",
        "friend",
        "correspondent",
        "hume",
        "author",
        "use",
        "example",
        "feeling",
        "pain",
        "heat",
        "berkeley",
        "three",
        "dialogue",
        "hume",
        "treatise",
        "first",
        "step",
        "demonstrating",
        "minddependence",
        "property",
        "body",
        "alike",
        "casting",
        "doubt",
        "supposed",
        "difference",
        "kind",
        "primary",
        "secondary",
        "quality",
        "holbach",
        "recasting",
        "distinction",
        "primary",
        "secondary",
        "quality",
        "term",
        "property",
        "matter",
        "posse",
        "universally",
        "property",
        "body",
        "posse",
        "help",
        "avoid",
        "berkeleyan",
        "criticism",
        "distinction",
        "holbach",
        "never",
        "claim",
        "locke",
        "property",
        "color",
        "sound",
        "metaphysical",
        "status",
        "different",
        "primary",
        "quality",
        "lockean",
        "secondary",
        "quality",
        "holbach",
        "basic",
        "inexplicable",
        "quality",
        "matter",
        "par",
        "extension",
        "solidity",
        "distinguished",
        "ground",
        "possessed",
        "body",
        "others",
        "holbach",
        "allows",
        "matter",
        "posse",
        "quality",
        "matter",
        "posse",
        "notion",
        "matter",
        "varied",
        "locke",
        "locke",
        "matter",
        "homogenous",
        "sense",
        "posse",
        "primary",
        "quality",
        "real",
        "quality",
        "besides",
        "holbach",
        "matter",
        "heterogenous",
        "genus",
        "being",
        "individual",
        "although",
        "might",
        "posse",
        "common",
        "property",
        "extent",
        "divisibility",
        "figure",
        "etc",
        "however",
        "ranked",
        "class",
        "comprised",
        "general",
        "denomination",
        "system",
        "nature",
        "heterogeneity",
        "matter",
        "holbach",
        "metaphysics",
        "put",
        "disadvantage",
        "traditional",
        "lockean",
        "view",
        "sense",
        "locke",
        "account",
        "matter",
        "true",
        "simpler",
        "great",
        "explanatory",
        "power",
        "full",
        "panoply",
        "sensation",
        "encounter",
        "explained",
        "account",
        "sensory",
        "organ",
        "short",
        "list",
        "primary",
        "quality",
        "law",
        "govern",
        "interaction",
        "holbach",
        "hand",
        "requires",
        "separate",
        "explanation",
        "perceived",
        "property",
        "promise",
        "explanation",
        "phenomenon",
        "term",
        "matter",
        "motion",
        "delivers",
        "even",
        "framework",
        "explanation",
        "another",
        "sense",
        "though",
        "heterogeneity",
        "matter",
        "helpful",
        "holbach",
        "project",
        "materialistic",
        "account",
        "human",
        "nature",
        "often",
        "thought",
        "fail",
        "human",
        "being",
        "seem",
        "property",
        "thought",
        "freedom",
        "matter",
        "making",
        "matter",
        "genus",
        "varied",
        "being",
        "holbach",
        "creates",
        "view",
        "flexible",
        "enough",
        "accommodate",
        "account",
        "human",
        "nature",
        "robust",
        "many",
        "materialist",
        "man",
        "whole",
        "result",
        "certain",
        "combination",
        "matter",
        "endowed",
        "particular",
        "property",
        "competent",
        "give",
        "capable",
        "receiving",
        "certain",
        "impulse",
        "arrangement",
        "called",
        "organization",
        "essence",
        "feel",
        "think",
        "act",
        "move",
        "manner",
        "distinguished",
        "being",
        "compared",
        "man",
        "therefore",
        "rank",
        "order",
        "system",
        "class",
        "differs",
        "animal",
        "perceive",
        "property",
        "possessed",
        "system",
        "nature",
        "holbach",
        "naturalism",
        "requires",
        "human",
        "nature",
        "understood",
        "term",
        "law",
        "human",
        "action",
        "comprehended",
        "universal",
        "determinism",
        "allows",
        "many",
        "way",
        "human",
        "being",
        "may",
        "differ",
        "kind",
        "body",
        "even",
        "animal",
        "allows",
        "human",
        "being",
        "may",
        "many",
        "property",
        "notably",
        "thought",
        "traditionally",
        "denied",
        "matter",
        "heterogeneity",
        "matter",
        "holbach",
        "account",
        "contributes",
        "vagueness",
        "designation",
        "matter",
        "extent",
        "understood",
        "ordinary",
        "sense",
        "anything",
        "extention",
        "figure",
        "however",
        "matter",
        "also",
        "may",
        "may",
        "number",
        "property",
        "ordinarily",
        "understood",
        "belong",
        "matter",
        "thought",
        "entirely",
        "clear",
        "may",
        "matter",
        "motion",
        "likewise",
        "similar",
        "reason",
        "vague",
        "term",
        "holbach",
        "matter",
        "understood",
        "simply",
        "extension",
        "simple",
        "property",
        "motion",
        "may",
        "thought",
        "similarly",
        "simple",
        "term",
        "velocity",
        "acceleration",
        "perhaps",
        "impulse",
        "certain",
        "direction",
        "matter",
        "thought",
        "manner",
        "holbach",
        "something",
        "property",
        "perhaps",
        "best",
        "understood",
        "spatial",
        "term",
        "motion",
        "may",
        "much",
        "difficult",
        "define",
        "although",
        "sometimes",
        "speaks",
        "matter",
        "motion",
        "narrower",
        "sens",
        "holbach",
        "tendency",
        "simply",
        "identify",
        "matter",
        "motion",
        "general",
        "term",
        "cause",
        "effect",
        "holbach",
        "typically",
        "identifies",
        "body",
        "cause",
        "motion",
        "effect",
        "also",
        "allows",
        "motion",
        "may",
        "cause",
        "cause",
        "put",
        "another",
        "motion",
        "produce",
        "change",
        "effect",
        "change",
        "produced",
        "one",
        "body",
        "motion",
        "presence",
        "another",
        "system",
        "nature",
        "understand",
        "human",
        "being",
        "human",
        "society",
        "term",
        "matter",
        "motion",
        "simply",
        "understand",
        "term",
        "cause",
        "effect",
        "holbach",
        "naturalism",
        "ethic",
        "political",
        "theory",
        "extends",
        "commitment",
        "ground",
        "discipline",
        "account",
        "human",
        "nature",
        "understood",
        "term",
        "lawlike",
        "regularity",
        "importantly",
        "psychological",
        "law",
        "holbach",
        "naturalist",
        "stricter",
        "sense",
        "attempting",
        "understand",
        "human",
        "being",
        "term",
        "law",
        "explain",
        "rest",
        "nature",
        "determinism",
        "universal",
        "holbach",
        "view",
        "different",
        "sort",
        "body",
        "may",
        "peculiar",
        "property",
        "require",
        "peculiar",
        "explanation",
        "despite",
        "avowed",
        "materialism",
        "holbach",
        "demand",
        "sort",
        "reductive",
        "explanation",
        "mental",
        "event",
        "materialism",
        "might",
        "ordinarily",
        "seem",
        "require"
    ]
}