{
    "main_text": "Why Holist Explanations are Indispensable || The Argument from Social Phenomena as Causes\n2.1 The Argument from Social Phenomena as Causes\n\nThe argument from social phenomena as causes takes it that holist\nexplanations are indispensable if social phenomena are causally\neffective. The basic structure of the argument is as follows. First, a\ncharacterization of social phenomena as causally effective is\npresented. Next, it is maintained that in order to explain the events\ngenerated by the causally effective social phenomena, holist\nexplanations must be offered: holist explanations alone state how\nsocial phenomena bring about certain events. Lastly, it is concluded\nthat since the events brought about by social phenomena should not be\nleft unexplained, holist explanations are indispensable. The argument\ncomes in various versions set apart by the way in which they\ncharacterize social phenomena as causally effective.\n\nAccording to one line of reasoning, social entities like nations and\nsocieties have causal powers that are independent of, and override,\nthe causal powers of the individuals who comprise these entities. For\ninstance, it is held that nations develop in such a way so as to\nrealize some goal, yet without the implicated individuals having any\ninfluence on this development. Alternatively, it is contended that\nsocietal structures may ensure that individuals perform certain\nfunctions in society; the individuals have no choice in this matter.\nHowever specified, social phenomena that have these independent and\noverriding causal powers produce effects that cannot be accounted for\nby offering individualist explanations; individuals are simply not\ncausally responsible for these effects. The explanation of such social\nphenomena is only possible by way of holist explanations that lay out\nhow the phenomena brought about the effects in question.\n\nThe contention that social entities have independent and overriding\ncausal powers is often ascribed to Comte, Hegel, Marx, and their\nfollowers. Today the claim enjoys very few adherents. One important\nreason for this is that the claim is regarded as incompatible with the\nwidely held view that social phenomena are noncausally determined by\nindividuals and their properties, and sometimes by material artifacts\ntoo. Particularly since the 1980s, the notions of supervenience,\nrealization, and emergence have received a lot of attention as ways of\nspelling out this non-causal dependency relation between social\nphenomena, on the one hand, and individuals and their properties, on\nthe other. These notions have served as the basis for alternative\nversions of the argument from social phenomena as causes.\n\nConsider first the notions of supervenience and realization.\nSupervenience is a relationship between properties, kinds, or facts.\nRoughly speaking, social properties supervene upon individualist\nproperties if and only if there can be no change at the level of\nsocial properties unless there is also a change at the level of\nindividualist properties. Otherwise put, the individualist properties\nfix the social properties. Too see how this works, assume that a\nfootball club supervenes on a constellation of individuals with\ncertain beliefs, bearing certain relations to each other, and so on.\nThis being the case, the football club cannot transform into a golf\nclub, say, unless the individuals change some of their beliefs, the\nrelations they stand in, or the like. The individuals’ beliefs,\nrelations, etc. fix the property of their being a football club. The\nnotion of supervenience is often used interchangeably with the notion\nof realization. Thus, it is said that a constellation of individuals\nwith certain beliefs, relationships, etc. realizes the property of\nbeing a football club. Several moderate methodological holists have,\nin varying ways, expanded on the account of social properties as\nsupervenient properties by presenting considerations in support of\nsupervenient social properties being, in certain cases, causally\neffective properties (see e.g., Kincaid 1997, 2009; List and\nSpiekermann 2013; Sawyer 2003, 2005). Their reflections are a response\nto the so-called exclusion argument, which states that supervenient\nproperties are epiphenomenal because all the causal work is done by\nthe properties that they supervene upon (on this argument, see e.g.,\nKim 2005). Here is how Christian List and Kai Spiekermann purport to\nestablish that some supervenient social properties are causally\neffective (List and Spiekermann 2013).\n\nList and Spiekermann begin by appealing to the difference-making or\ncounterfactual conception of causation, which asserts that “a\nproperty C (within a system of interest) is the cause of\nanother property E if and only if C systematically\nmakes a difference to E” (2013: 636). By implication, a\nsupervenient social property, S, qualifies as a cause of\nE, when S makes a systematic difference to\nE. This means that, other things being equal, if S\noccurred E would do so too, and that if S did not\noccur, then neither would E. Now assume that S is\nmicrorealization-robust: S would also have brought about\nE if it had been realized by a compound of individualist\nproperties other than the one that actually realizes it. In situations\nof this sort, the compound of individualist properties that realizes\nS does not make a systematic difference to E. While\nit is the case that if the particular compound occurred then so would\nE, it is not the case that if the compound did not occur,\nE would not occur either. Hence it is S, rather than\nthe compound of individualist properties realizing S, that\nqualifies as the cause of E. List and Spiekermann underline\nthat in these circumstances, a holist explanation—that is, an\nexplanation describing how a given supervenient social property\nbrought about some effect—is needed.\n\nAs an anecdotal illustration of these points, they refer to the failed\nclimate summit in Copenhagen in 2010 (2013: 637). They suggest that\nthe summit failed at least in part because there were so many parties,\nand no common interest. Moreover, they note that these—and\nother—social properties of the situation are\nmicrorealization-robust: even had they been realized by individuals\nwith somewhat different individualist properties, the social\nproperties would have still resulted in a failed summit. The social\nproperties of the meeting should thus be regarded as the cause of the\nfailure; that is, a holist explanation must be offered in order to\nexplain why the summit was unsuccessful.\n\nTurn now to the notion of emergence. While emergent properties are\nsometimes regarded as identical to, or as a special class of,\nsupervenient properties, emergent properties may also be differently\ncharacterized. These alternative specifications of social properties\nas emergent properties have similarly served as the basis for\ninsisting that holist explanations are indispensable. Currently, this\nline of reasoning is often associated with the social scientific\nschool of Critical Realism, founded by Roy Bhaskar and further\ndeveloped by many others (see e.g., Archer 1995, 2000; Bhaskar 1979,\n1982; Elder-Vass 2007, 2010, 2014). Main representatives of the\nmovement have offered a variety of specifications of the notion of\nemergence. Among these, Dave Elder-Vass’ account will be briefly\ndiscussed.\n\nAccording to Elder-Vass, social entities like firms and universities\nare composed of individuals (and sometimes material things as well)\nthat stand in certain relations to one another (Elder-Vass 2007: 31).\nIn virtue of being composed, at a given moment in time, of\ninterrelated individuals, social entities have various causally\neffective social properties. Most notably, they have emergent social\nproperties, of which there are two kinds. The first is constituted by\nemergent social properties that are ascribed to social entities as\nwholes. These are exemplified by a government’s power to\nintroduce a new tax, or a quartet’s ability to deliver a\nharmonized performance. The second kind consists in emergent social\nproperties that are ascribed to individuals. These are illustrated by\na boss’s power to hire or fire employees. Individuals have these\nproperties in virtue of being interrelated so as to form a social\nentity, and that’s why they constitute emergent social\nproperties (Elder-Vass 2010: 74). Individuals who form part of social\nentities have non-emergent properties too. These are the causally\neffective properties, like the ability to read or talk, which\nindividuals have independently of being, at a given moment in time,\npart of a social entity. From these reflections, Elder-Vass contends,\nit follows that holist explanations cannot be dispensed with. The\neffects of emergent social properties should be explained. To this\nend, it is necessary to offer holist explanations—that is,\nexplanations that state how a social property partially brought about\nsome effect. Individualist explanations are not up to this task\ninasmuch as they are confined to describing how individuals, in virtue\nof their non-emergent properties, partially brought about some effect.\nSimply pointing to the properties that individuals have independently\nof being, at a given moment in time, part of social entities, does not\nadd up to an explanation of the effects of emergent social properties\n(see 2010: 66).\n\nContemporary moderate methodological holists largely agree that social\nphenomena are non-causally determined by individuals and their\nproperties, and occasionally by material artifacts too. As illustrated\nin the foregoing, some defend the claim that thus conceived, social\nphenomena are causally effective, while such defenses often depend\nheavily on the particular notion of causation espoused. Many moderate\nmethodological holists, however, see no need for arguments in support\nof social phenomena being causally effective. They simply assume this\nto be the case while pursuing alternative strategies in the attempt to\nestablish that holist explanations are indispensable.\n",
    "section_title": "2.1 The Argument from Social Phenomena as Causes",
    "entry_title": "Methodological Holism in the Social Sciences",
    "hierarchy_title": "Methodological Holism in the Social Sciences || Why Holist Explanations are Indispensable || The Argument from Social Phenomena as Causes",
    "tokenized_text": [
        "holist",
        "explanation",
        "indispensable",
        "argument",
        "social",
        "phenomenon",
        "cause",
        "argument",
        "social",
        "phenomenon",
        "cause",
        "argument",
        "social",
        "phenomenon",
        "cause",
        "take",
        "holist",
        "explanation",
        "indispensable",
        "social",
        "phenomenon",
        "causally",
        "effective",
        "basic",
        "structure",
        "argument",
        "follows",
        "first",
        "characterization",
        "social",
        "phenomenon",
        "causally",
        "effective",
        "presented",
        "next",
        "maintained",
        "order",
        "explain",
        "event",
        "generated",
        "causally",
        "effective",
        "social",
        "phenomenon",
        "holist",
        "explanation",
        "must",
        "offered",
        "holist",
        "explanation",
        "alone",
        "state",
        "social",
        "phenomenon",
        "bring",
        "certain",
        "event",
        "lastly",
        "concluded",
        "since",
        "event",
        "brought",
        "social",
        "phenomenon",
        "left",
        "unexplained",
        "holist",
        "explanation",
        "indispensable",
        "argument",
        "come",
        "various",
        "version",
        "set",
        "apart",
        "way",
        "characterize",
        "social",
        "phenomenon",
        "causally",
        "effective",
        "according",
        "one",
        "line",
        "reasoning",
        "social",
        "entity",
        "like",
        "nation",
        "society",
        "causal",
        "power",
        "independent",
        "override",
        "causal",
        "power",
        "individual",
        "comprise",
        "entity",
        "instance",
        "held",
        "nation",
        "develop",
        "way",
        "realize",
        "goal",
        "yet",
        "without",
        "implicated",
        "individual",
        "influence",
        "development",
        "alternatively",
        "contended",
        "societal",
        "structure",
        "may",
        "ensure",
        "individual",
        "perform",
        "certain",
        "function",
        "society",
        "individual",
        "choice",
        "matter",
        "however",
        "specified",
        "social",
        "phenomenon",
        "independent",
        "overriding",
        "causal",
        "power",
        "produce",
        "effect",
        "accounted",
        "offering",
        "individualist",
        "explanation",
        "individual",
        "simply",
        "causally",
        "responsible",
        "effect",
        "explanation",
        "social",
        "phenomenon",
        "possible",
        "way",
        "holist",
        "explanation",
        "lay",
        "phenomenon",
        "brought",
        "effect",
        "question",
        "contention",
        "social",
        "entity",
        "independent",
        "overriding",
        "causal",
        "power",
        "often",
        "ascribed",
        "comte",
        "hegel",
        "marx",
        "follower",
        "today",
        "claim",
        "enjoys",
        "adherent",
        "one",
        "important",
        "reason",
        "claim",
        "regarded",
        "incompatible",
        "widely",
        "held",
        "view",
        "social",
        "phenomenon",
        "noncausally",
        "determined",
        "individual",
        "property",
        "sometimes",
        "material",
        "artifact",
        "particularly",
        "since",
        "s",
        "notion",
        "supervenience",
        "realization",
        "emergence",
        "received",
        "lot",
        "attention",
        "way",
        "spelling",
        "noncausal",
        "dependency",
        "relation",
        "social",
        "phenomenon",
        "one",
        "hand",
        "individual",
        "property",
        "notion",
        "served",
        "basis",
        "alternative",
        "version",
        "argument",
        "social",
        "phenomenon",
        "cause",
        "consider",
        "first",
        "notion",
        "supervenience",
        "realization",
        "supervenience",
        "relationship",
        "property",
        "kind",
        "fact",
        "roughly",
        "speaking",
        "social",
        "property",
        "supervene",
        "upon",
        "individualist",
        "property",
        "change",
        "level",
        "social",
        "property",
        "unless",
        "also",
        "change",
        "level",
        "individualist",
        "property",
        "otherwise",
        "put",
        "individualist",
        "property",
        "fix",
        "social",
        "property",
        "see",
        "work",
        "assume",
        "football",
        "club",
        "supervenes",
        "constellation",
        "individual",
        "certain",
        "belief",
        "bearing",
        "certain",
        "relation",
        "case",
        "football",
        "club",
        "transform",
        "golf",
        "club",
        "say",
        "unless",
        "individual",
        "change",
        "belief",
        "relation",
        "stand",
        "like",
        "individual",
        "belief",
        "relation",
        "etc",
        "fix",
        "property",
        "football",
        "club",
        "notion",
        "supervenience",
        "often",
        "used",
        "interchangeably",
        "notion",
        "realization",
        "thus",
        "said",
        "constellation",
        "individual",
        "certain",
        "belief",
        "relationship",
        "etc",
        "realizes",
        "property",
        "football",
        "club",
        "several",
        "moderate",
        "methodological",
        "holists",
        "varying",
        "way",
        "expanded",
        "account",
        "social",
        "property",
        "supervenient",
        "property",
        "presenting",
        "consideration",
        "support",
        "supervenient",
        "social",
        "property",
        "certain",
        "case",
        "causally",
        "effective",
        "property",
        "see",
        "eg",
        "kincaid",
        "list",
        "spiekermann",
        "sawyer",
        "reflection",
        "response",
        "socalled",
        "exclusion",
        "argument",
        "state",
        "supervenient",
        "property",
        "epiphenomenal",
        "causal",
        "work",
        "done",
        "property",
        "supervene",
        "upon",
        "argument",
        "see",
        "eg",
        "kim",
        "christian",
        "list",
        "kai",
        "spiekermann",
        "purport",
        "establish",
        "supervenient",
        "social",
        "property",
        "causally",
        "effective",
        "list",
        "spiekermann",
        "list",
        "spiekermann",
        "begin",
        "appealing",
        "differencemaking",
        "counterfactual",
        "conception",
        "causation",
        "asserts",
        "property",
        "c",
        "within",
        "system",
        "interest",
        "cause",
        "another",
        "property",
        "e",
        "c",
        "systematically",
        "make",
        "difference",
        "e",
        "implication",
        "supervenient",
        "social",
        "property",
        "qualifies",
        "cause",
        "e",
        "make",
        "systematic",
        "difference",
        "e",
        "mean",
        "thing",
        "equal",
        "occurred",
        "e",
        "would",
        "occur",
        "neither",
        "would",
        "e",
        "assume",
        "microrealizationrobust",
        "would",
        "also",
        "brought",
        "e",
        "realized",
        "compound",
        "individualist",
        "property",
        "one",
        "actually",
        "realizes",
        "situation",
        "sort",
        "compound",
        "individualist",
        "property",
        "realizes",
        "make",
        "systematic",
        "difference",
        "e",
        "case",
        "particular",
        "compound",
        "occurred",
        "would",
        "e",
        "case",
        "compound",
        "occur",
        "e",
        "would",
        "occur",
        "either",
        "hence",
        "rather",
        "compound",
        "individualist",
        "property",
        "realizing",
        "qualifies",
        "cause",
        "e",
        "list",
        "spiekermann",
        "underline",
        "circumstance",
        "holist",
        "explanationthat",
        "explanation",
        "describing",
        "given",
        "supervenient",
        "social",
        "property",
        "brought",
        "effectis",
        "needed",
        "anecdotal",
        "illustration",
        "point",
        "refer",
        "failed",
        "climate",
        "summit",
        "copenhagen",
        "suggest",
        "summit",
        "failed",
        "least",
        "part",
        "many",
        "party",
        "common",
        "interest",
        "moreover",
        "note",
        "theseand",
        "othersocial",
        "property",
        "situation",
        "microrealizationrobust",
        "even",
        "realized",
        "individual",
        "somewhat",
        "different",
        "individualist",
        "property",
        "social",
        "property",
        "would",
        "still",
        "resulted",
        "failed",
        "summit",
        "social",
        "property",
        "meeting",
        "thus",
        "regarded",
        "cause",
        "failure",
        "holist",
        "explanation",
        "must",
        "offered",
        "order",
        "explain",
        "summit",
        "unsuccessful",
        "turn",
        "notion",
        "emergence",
        "emergent",
        "property",
        "sometimes",
        "regarded",
        "identical",
        "special",
        "class",
        "supervenient",
        "property",
        "emergent",
        "property",
        "may",
        "also",
        "differently",
        "characterized",
        "alternative",
        "specification",
        "social",
        "property",
        "emergent",
        "property",
        "similarly",
        "served",
        "basis",
        "insisting",
        "holist",
        "explanation",
        "indispensable",
        "currently",
        "line",
        "reasoning",
        "often",
        "associated",
        "social",
        "scientific",
        "school",
        "critical",
        "realism",
        "founded",
        "roy",
        "bhaskar",
        "developed",
        "many",
        "others",
        "see",
        "eg",
        "archer",
        "bhaskar",
        "eldervass",
        "main",
        "representative",
        "movement",
        "offered",
        "variety",
        "specification",
        "notion",
        "emergence",
        "among",
        "dave",
        "eldervass",
        "account",
        "briefly",
        "discussed",
        "according",
        "eldervass",
        "social",
        "entity",
        "like",
        "firm",
        "university",
        "composed",
        "individual",
        "sometimes",
        "material",
        "thing",
        "well",
        "stand",
        "certain",
        "relation",
        "one",
        "another",
        "eldervass",
        "virtue",
        "composed",
        "given",
        "moment",
        "time",
        "interrelated",
        "individual",
        "social",
        "entity",
        "various",
        "causally",
        "effective",
        "social",
        "property",
        "notably",
        "emergent",
        "social",
        "property",
        "two",
        "kind",
        "first",
        "constituted",
        "emergent",
        "social",
        "property",
        "ascribed",
        "social",
        "entity",
        "whole",
        "exemplified",
        "government",
        "power",
        "introduce",
        "new",
        "tax",
        "quartet",
        "ability",
        "deliver",
        "harmonized",
        "performance",
        "second",
        "kind",
        "consists",
        "emergent",
        "social",
        "property",
        "ascribed",
        "individual",
        "illustrated",
        "bos",
        "power",
        "hire",
        "fire",
        "employee",
        "individual",
        "property",
        "virtue",
        "interrelated",
        "form",
        "social",
        "entity",
        "constitute",
        "emergent",
        "social",
        "property",
        "eldervass",
        "individual",
        "form",
        "part",
        "social",
        "entity",
        "nonemergent",
        "property",
        "causally",
        "effective",
        "property",
        "like",
        "ability",
        "read",
        "talk",
        "individual",
        "independently",
        "given",
        "moment",
        "time",
        "part",
        "social",
        "entity",
        "reflection",
        "eldervass",
        "contends",
        "follows",
        "holist",
        "explanation",
        "dispensed",
        "effect",
        "emergent",
        "social",
        "property",
        "explained",
        "end",
        "necessary",
        "offer",
        "holist",
        "explanationsthat",
        "explanation",
        "state",
        "social",
        "property",
        "partially",
        "brought",
        "effect",
        "individualist",
        "explanation",
        "task",
        "inasmuch",
        "confined",
        "describing",
        "individual",
        "virtue",
        "nonemergent",
        "property",
        "partially",
        "brought",
        "effect",
        "simply",
        "pointing",
        "property",
        "individual",
        "independently",
        "given",
        "moment",
        "time",
        "part",
        "social",
        "entity",
        "add",
        "explanation",
        "effect",
        "emergent",
        "social",
        "property",
        "see",
        "contemporary",
        "moderate",
        "methodological",
        "holists",
        "largely",
        "agree",
        "social",
        "phenomenon",
        "noncausally",
        "determined",
        "individual",
        "property",
        "occasionally",
        "material",
        "artifact",
        "illustrated",
        "foregoing",
        "defend",
        "claim",
        "thus",
        "conceived",
        "social",
        "phenomenon",
        "causally",
        "effective",
        "defense",
        "often",
        "depend",
        "heavily",
        "particular",
        "notion",
        "causation",
        "espoused",
        "many",
        "moderate",
        "methodological",
        "holists",
        "however",
        "see",
        "need",
        "argument",
        "support",
        "social",
        "phenomenon",
        "causally",
        "effective",
        "simply",
        "assume",
        "case",
        "pursuing",
        "alternative",
        "strategy",
        "attempt",
        "establish",
        "holist",
        "explanation",
        "indispensable"
    ]
}