{
    "main_text": "Religion and Morality\n9. Religion and Morality\n\nRichard Bentley, the first Boyle lecturer, neatly states the view that\nmany theists hold concerning the relationship between religion and\nmorality:\n\nAnd if Atheism should be supposed to become universal in this\nnation… farewell all ties of friendship and principles of\nhonor; all love for our country and loyalty to our prince; nay,\nfarewell all government and society itself, all professions and arts,\nand conveniences of life, all that is laudable or valuable in the\nworld. [Bentley, Folly of Atheism, in Works, III,\n25]\n\n\nThe general view defended by Bentley, and many other apologists for\nreligion, is that without religious principles and institutions to\nguide and motivate us, the moral world will collapse into nihilism,\negoism and the arbitrary rule of power. This view of things was\nfurther confirmed, as Hume’s near contemporaries saw it, by the\nphilosophy of Hobbes. Hobbes’s basic philosophical project was\nto advance a secular, scientific account of moral and political life.\nThe foundation of this, however, rests with egoism and moral\nscepticism. That is to say, according to Hobbes, human nature is\ndriven by psychological egoism and there is no real distinction\nbetween good and evil, right and wrong, just or unjust. It was a major\ntask of Hume’s philosophy — particularly as presented in\nthe Treatise — to reconstruct Hobbes’s secular,\nscientific account of morality while at the same time avoiding the\nextreme (undiluted) elements of moral scepticism and egoism present in\nit. Another way of stating these aims, is to say that Hume wanted to\nshow that “speculative atheism” did not imply\n“practical atheism” or moral licentiousness.\n\nAs already noted, Hume’s Treatise appears to be\nmodelled after the same plan as Hobbes’s project of a\n“science of man” as presented in The Elements of\nLaw and Leviathan. On the basis of a naturalistic and\nnecessitarian conception of human nature, Hume aims to show how moral\nmotivation and practice is possible (i.e., to describe the possibility\nand reality of “virtuous atheism”). There are several key\nelements in Hume’s system of secular ethics. One important\nelement is the role of the indirect passions in accounting for the\nsanctions and support provided to moral life. On Hume’s theory\nthe virtues and vices are understood as simply pleasurable or painful\nqualities of mind (cp. T, 3.1.2). A vicious character, he argues,\nproduces hate and humility (dishonour and shame) that makes us\nunhappy. In contrast with this, virtue produces love and pride, which\nmakes us happy. This is the fundamental mechanism by which virtue is\nrewarded and vice is punished. This mechanism operates no less\neffectively among atheists, who have no belief in God or a future\nstate, as it does among those with traditional theistic beliefs.\n\nAnother key element in Hume’s system of secular ethics is the\nrole of sympathy. We are naturally constituted, Hume maintains, to\nshare the emotions of our fellow human beings. The closer our\nrelationship, and the more we resemble each other, the stronger the\ncommunication of emotion will be (T, 2.1.11;\n2.2.5.14–21/362–5). By means of this principle of\nsympathy, human beings naturally take an interest in the happiness and\nwelfare of others — especially our family, friends and\nneighbours. Hume denies, therefore, that human nature is wholly\nselfish or without any benevolent concerns or dispositions. At the\nsame time, Hume also emphasizes the point that our sympathetic and\nbenevolent tendencies are limited and highly partial — both of\nwhich pose serious obstacles for social peace and cooperation. Hume\ndenies, in particular, that there is any “such passion in human\nminds, as love of mankind, merely as such, independent of personal\nqualities, of services, or of relation to oneself” (T, 3.2.1.12/\n481). In this way, while Hume plainly rejects Hobbist egoism and\nallows that we are naturally social beings in a number of significant\nrespects (i.e., family, friends etc.), he also insists that our human\nnature is such that self-love and partiality are extremely strong and\ncan and do lead to competition and conflict. This is something that we\nmust find a solution to if we are to be able to live together in\ngroups larger than families and small clans.\n\nOur human nature, combining both passions and reason, provides a\nremedy for this problem. In the first place, Hume denies that we lack\nany real standard of right and wrong or good and evil. The relevant\nstandard depends on our sentiments of pleasure and uneasiness (T,\n3.1.1.26 / 469). More specifically, our moral sentiments, understood\nas calm forms of love and hate, enable us to draw the relevant\ndistinctions in this sphere. Hume also claims that in forming these\njudgments we place ourselves in “a steady and general point of\nview”, which prevents partiality and variation in our\ncircumstances from prejudicing or distorting our moral evaluations (T,\n3.3.1.15–18 / 581–3).\n\nIt is evident that Hume aims to describe a standard of merit and\ndemerit that, although it depends on our given human nature, is in no\nway arbitrary or without rational constraints. At the same time,\nHume’s account of justice and the artificial virtues does point\nto the importance of human conventions, which create or invent the\ninstitutions and practices associated with property and promising.\nThere are no obligations that we have in respect of these institutions\nand practices that are prior to or independent of these conventions.\nThe general basis of our commitment to these conventions is that they\nserve our individual and collective interest. Failing this, we would\nhave no relevant motive to obey these rules of justice. Clearly, then,\nwith respect to property, there are no natural rights or claims of\njustice outside our created, conventional practices. It is in this\nsense that Hume’s views on justice and the artificial virtues\nfollow the same general lines of thought already laid down by Hobbes\nand his followers.\n\nThe details and specifics of Hume’s system of secular ethics are\nnot our particular concern in this context. What is our concern,\nhowever, is to make clear that what Hume aims at, in both the\nTreatise and the second Enquiry, is to defend the\n“autonomy” of morality in relation to religion. On this\nview of things, God and a future state are wholly unnecessary for\nmoral life and human society. The relevant foundation for moral life\nand conduct rests with the key elements of human nature that we have\nmentioned — pride, sympathy, moral sense, and conventions.\nMoreover, the psychological mechanisms involved are strong and steady\nenough in their influence to ensure that there exists a reliable\ncorrelation between virtue and happiness and vice and misery. By these\nmeans, we find that human beings are constituted in such a way that\nthey are capable of moral conduct and able to sustain social\ncooperation and harmony. In so far as religion plays any role here,\nHume maintains, it is more likely to corrupt and disturb, than to\ncontribute, to morality or social stability.\n\nHume’s account of the autonomy of morals and its foundations in\nhuman nature constitutes the constructive aspect of his views on the\nreligion/morality relationship. In developing this account, Hume draws\nheavily from earlier work by other freethinking, irreligious, and\nradical philosophers, such as Hobbes, Spinoza, Bayle, and (especially)\nShaftesbury. There is, however, a much more critical aspect to\nHume’s views on the religion/morality relationship. While it is\nevident that Hume believes that religion is not necessary for\nmorality, he stops short of claiming that religion is always\ndestructive of morality — even though this is a view that would\nbe no more extreme than the contrary view frequently advanced by\nreligious apologists (i.e., that atheists are incapable of moral\nconduct etc.). Nevertheless, in a variety of contexts, Hume does\nmaintain that religion — especially monotheism — has\npernicious and corrupting tendencies.\n\nOne of the most sustained discussions of this general theme is in\nThe Natural History of Religion, where Hume compares the\neffects of polytheism and theism on their believers (Sects. IX-XIV).\nIn this context., Hume points out that while theism may avoid some of\nthe absurdities and barbarisms of polytheism, it is by no means free\nof these problems. On the contrary, it is Hume’s view that\ntheism is prone to intolerance and persecution of its opponents; that\nit encourages its followers to abase themselves and pursue useless\nforms of self-denial; that it corrupts and perverts philosophy; that\nalthough it is plagued with doubts, it presents a dogmatic attitude to\nthe world; and, finally, that it breeds serious moral vices, including\nhypocrisy, fraud and cruelty. The tendencies of theism that most\nconcern Hume, however, are its intolerance and opposition to liberty,\nits distorted moral standard, and its willingness to sanction the\n“greatest crimes” in the name of piety and devotion (NHR,\n14.7). Hume leaves his readers with the clear view that religion, far\nfrom being a source of support for moral practice, is in fact a major\nsource of moral sickness in the world.\n\nHume returns to these same general themes in the closing passages of\nthe Dialogues. In this context Philo emphasizes the point\nthat the doctrine of a future state has little practical influence\nover human conduct (D, 12.13–20/220–23).\n\nThis is well understood in the world; and none but fools ever repose\nless trust in a man, because they hear, that from study and\nphilosophy, he has entertained some speculative doubts with regard to\ntheological subjects. And when we have to do with a man, who makes a\ngreat profession of religion and devotion; has this any other effect\nupon several, who pass for prudent, than to put them on their guard,\nlest they be cheated and deceived by him? (D, 12.14/221)\n\n\nHume makes the further observation that even if religion does not put\nitself “in direct opposition to morality”, it nevertheless\nputs forward a “frivolous species of merit” that suggests\n“a preposterous distribution” of praise and blame based\nupon a perverted moral standard that is disconnected from any real\nhuman needs and interests (D, 12.16/222; cp. EM, 3.38 199; 9.3/ 270;\n9.15 / 279). Beyond all this, he also points out the particular\ndangers to society of the clergy when they gain too much power and\ninfluence (D, 12.21/223). This is a theme that Hume also touches on\nthroughout many of his other writings, including The Natural\nHistory of Religion, several of his essays, and his History\nof England. (See, e.g., NHR, 9.6; “Of National\nCharacters,” ESY, 199n3; and HE, III,135f.)\n\nThe relationship between religion and morality on Hume’s account\nseems clear. At best, religion has little practical influence in\nguiding or supporting moral conduct. The most effective and reliable\nlevers for this purpose rest with various elements of human nature\nthat operate independently from our religious beliefs (i.e., pride,\nsympathy, moral sense etc.). At its worst, which is how we commonly\nfind it, religious principles and institutions disturb and pervert\nthat natural and reasonable moral standards that human nature has\nprovided us with. \n",
    "section_title": "9. Religion and Morality",
    "entry_title": "Hume on Religion",
    "hierarchy_title": "Hume on Religion || Religion and Morality",
    "tokenized_text": [
        "religion",
        "morality",
        "religion",
        "morality",
        "richard",
        "bentley",
        "first",
        "boyle",
        "lecturer",
        "neatly",
        "state",
        "view",
        "many",
        "theist",
        "hold",
        "concerning",
        "relationship",
        "religion",
        "morality",
        "atheism",
        "supposed",
        "become",
        "universal",
        "nation",
        "farewell",
        "tie",
        "friendship",
        "principle",
        "honor",
        "love",
        "country",
        "loyalty",
        "prince",
        "nay",
        "farewell",
        "government",
        "society",
        "profession",
        "art",
        "convenience",
        "life",
        "laudable",
        "valuable",
        "world",
        "bentley",
        "folly",
        "atheism",
        "work",
        "iii",
        "general",
        "view",
        "defended",
        "bentley",
        "many",
        "apologist",
        "religion",
        "without",
        "religious",
        "principle",
        "institution",
        "guide",
        "motivate",
        "u",
        "moral",
        "world",
        "collapse",
        "nihilism",
        "egoism",
        "arbitrary",
        "rule",
        "power",
        "view",
        "thing",
        "confirmed",
        "hume",
        "near",
        "contemporary",
        "saw",
        "philosophy",
        "hobbes",
        "hobbes",
        "basic",
        "philosophical",
        "project",
        "advance",
        "secular",
        "scientific",
        "account",
        "moral",
        "political",
        "life",
        "foundation",
        "however",
        "rest",
        "egoism",
        "moral",
        "scepticism",
        "say",
        "according",
        "hobbes",
        "human",
        "nature",
        "driven",
        "psychological",
        "egoism",
        "real",
        "distinction",
        "good",
        "evil",
        "right",
        "wrong",
        "unjust",
        "major",
        "task",
        "hume",
        "philosophy",
        "particularly",
        "presented",
        "treatise",
        "reconstruct",
        "hobbes",
        "secular",
        "scientific",
        "account",
        "morality",
        "time",
        "avoiding",
        "extreme",
        "undiluted",
        "element",
        "moral",
        "scepticism",
        "egoism",
        "present",
        "another",
        "way",
        "stating",
        "aim",
        "say",
        "hume",
        "wanted",
        "show",
        "speculative",
        "atheism",
        "imply",
        "practical",
        "atheism",
        "moral",
        "licentiousness",
        "already",
        "noted",
        "hume",
        "treatise",
        "appears",
        "modelled",
        "plan",
        "hobbes",
        "project",
        "science",
        "man",
        "presented",
        "element",
        "law",
        "leviathan",
        "basis",
        "naturalistic",
        "necessitarian",
        "conception",
        "human",
        "nature",
        "hume",
        "aim",
        "show",
        "moral",
        "motivation",
        "practice",
        "possible",
        "ie",
        "describe",
        "possibility",
        "reality",
        "virtuous",
        "atheism",
        "several",
        "key",
        "element",
        "hume",
        "system",
        "secular",
        "ethic",
        "one",
        "important",
        "element",
        "role",
        "indirect",
        "passion",
        "accounting",
        "sanction",
        "support",
        "provided",
        "moral",
        "life",
        "hume",
        "theory",
        "virtue",
        "vice",
        "understood",
        "simply",
        "pleasurable",
        "painful",
        "quality",
        "mind",
        "cp",
        "vicious",
        "character",
        "argues",
        "produce",
        "hate",
        "humility",
        "dishonour",
        "shame",
        "make",
        "u",
        "unhappy",
        "contrast",
        "virtue",
        "produce",
        "love",
        "pride",
        "make",
        "u",
        "happy",
        "fundamental",
        "mechanism",
        "virtue",
        "rewarded",
        "vice",
        "punished",
        "mechanism",
        "operates",
        "le",
        "effectively",
        "among",
        "atheist",
        "belief",
        "god",
        "future",
        "state",
        "among",
        "traditional",
        "theistic",
        "belief",
        "another",
        "key",
        "element",
        "hume",
        "system",
        "secular",
        "ethic",
        "role",
        "sympathy",
        "naturally",
        "constituted",
        "hume",
        "maintains",
        "share",
        "emotion",
        "fellow",
        "human",
        "being",
        "closer",
        "relationship",
        "resemble",
        "stronger",
        "communication",
        "emotion",
        "mean",
        "principle",
        "sympathy",
        "human",
        "being",
        "naturally",
        "take",
        "interest",
        "happiness",
        "welfare",
        "others",
        "especially",
        "family",
        "friend",
        "neighbour",
        "hume",
        "denies",
        "therefore",
        "human",
        "nature",
        "wholly",
        "selfish",
        "without",
        "benevolent",
        "concern",
        "disposition",
        "time",
        "hume",
        "also",
        "emphasizes",
        "point",
        "sympathetic",
        "benevolent",
        "tendency",
        "limited",
        "highly",
        "partial",
        "pose",
        "serious",
        "obstacle",
        "social",
        "peace",
        "cooperation",
        "hume",
        "denies",
        "particular",
        "passion",
        "human",
        "mind",
        "love",
        "mankind",
        "merely",
        "independent",
        "personal",
        "quality",
        "service",
        "relation",
        "oneself",
        "way",
        "hume",
        "plainly",
        "reject",
        "hobbist",
        "egoism",
        "allows",
        "naturally",
        "social",
        "being",
        "number",
        "significant",
        "respect",
        "ie",
        "family",
        "friend",
        "etc",
        "also",
        "insists",
        "human",
        "nature",
        "selflove",
        "partiality",
        "extremely",
        "strong",
        "lead",
        "competition",
        "conflict",
        "something",
        "must",
        "find",
        "solution",
        "able",
        "live",
        "together",
        "group",
        "larger",
        "family",
        "small",
        "clan",
        "human",
        "nature",
        "combining",
        "passion",
        "reason",
        "provides",
        "remedy",
        "problem",
        "first",
        "place",
        "hume",
        "denies",
        "lack",
        "real",
        "standard",
        "right",
        "wrong",
        "good",
        "evil",
        "relevant",
        "standard",
        "depends",
        "sentiment",
        "pleasure",
        "uneasiness",
        "specifically",
        "moral",
        "sentiment",
        "understood",
        "calm",
        "form",
        "love",
        "hate",
        "enable",
        "u",
        "draw",
        "relevant",
        "distinction",
        "sphere",
        "hume",
        "also",
        "claim",
        "forming",
        "judgment",
        "place",
        "steady",
        "general",
        "point",
        "view",
        "prevents",
        "partiality",
        "variation",
        "circumstance",
        "prejudicing",
        "distorting",
        "moral",
        "evaluation",
        "evident",
        "hume",
        "aim",
        "describe",
        "standard",
        "merit",
        "demerit",
        "although",
        "depends",
        "given",
        "human",
        "nature",
        "way",
        "arbitrary",
        "without",
        "rational",
        "constraint",
        "time",
        "hume",
        "account",
        "justice",
        "artificial",
        "virtue",
        "point",
        "importance",
        "human",
        "convention",
        "create",
        "invent",
        "institution",
        "practice",
        "associated",
        "property",
        "promising",
        "obligation",
        "respect",
        "institution",
        "practice",
        "prior",
        "independent",
        "convention",
        "general",
        "basis",
        "commitment",
        "convention",
        "serve",
        "individual",
        "collective",
        "interest",
        "failing",
        "would",
        "relevant",
        "motive",
        "obey",
        "rule",
        "justice",
        "clearly",
        "respect",
        "property",
        "natural",
        "right",
        "claim",
        "justice",
        "outside",
        "created",
        "conventional",
        "practice",
        "sense",
        "hume",
        "view",
        "justice",
        "artificial",
        "virtue",
        "follow",
        "general",
        "line",
        "thought",
        "already",
        "laid",
        "hobbes",
        "follower",
        "detail",
        "specific",
        "hume",
        "system",
        "secular",
        "ethic",
        "particular",
        "concern",
        "context",
        "concern",
        "however",
        "make",
        "clear",
        "hume",
        "aim",
        "treatise",
        "second",
        "enquiry",
        "defend",
        "autonomy",
        "morality",
        "relation",
        "religion",
        "view",
        "thing",
        "god",
        "future",
        "state",
        "wholly",
        "unnecessary",
        "moral",
        "life",
        "human",
        "society",
        "relevant",
        "foundation",
        "moral",
        "life",
        "conduct",
        "rest",
        "key",
        "element",
        "human",
        "nature",
        "mentioned",
        "pride",
        "sympathy",
        "moral",
        "sense",
        "convention",
        "moreover",
        "psychological",
        "mechanism",
        "involved",
        "strong",
        "steady",
        "enough",
        "influence",
        "ensure",
        "exists",
        "reliable",
        "correlation",
        "virtue",
        "happiness",
        "vice",
        "misery",
        "mean",
        "find",
        "human",
        "being",
        "constituted",
        "way",
        "capable",
        "moral",
        "conduct",
        "able",
        "sustain",
        "social",
        "cooperation",
        "harmony",
        "far",
        "religion",
        "play",
        "role",
        "hume",
        "maintains",
        "likely",
        "corrupt",
        "disturb",
        "contribute",
        "morality",
        "social",
        "stability",
        "hume",
        "account",
        "autonomy",
        "moral",
        "foundation",
        "human",
        "nature",
        "constitutes",
        "constructive",
        "aspect",
        "view",
        "religionmorality",
        "relationship",
        "developing",
        "account",
        "hume",
        "draw",
        "heavily",
        "earlier",
        "work",
        "freethinking",
        "irreligious",
        "radical",
        "philosopher",
        "hobbes",
        "spinoza",
        "bayle",
        "especially",
        "shaftesbury",
        "however",
        "much",
        "critical",
        "aspect",
        "hume",
        "view",
        "religionmorality",
        "relationship",
        "evident",
        "hume",
        "belief",
        "religion",
        "necessary",
        "morality",
        "stop",
        "short",
        "claiming",
        "religion",
        "always",
        "destructive",
        "morality",
        "even",
        "though",
        "view",
        "would",
        "extreme",
        "contrary",
        "view",
        "frequently",
        "advanced",
        "religious",
        "apologist",
        "ie",
        "atheist",
        "incapable",
        "moral",
        "conduct",
        "etc",
        "nevertheless",
        "variety",
        "context",
        "hume",
        "maintain",
        "religion",
        "especially",
        "monotheism",
        "pernicious",
        "corrupting",
        "tendency",
        "one",
        "sustained",
        "discussion",
        "general",
        "theme",
        "natural",
        "history",
        "religion",
        "hume",
        "compare",
        "effect",
        "polytheism",
        "theism",
        "believer",
        "sect",
        "ixxiv",
        "context",
        "hume",
        "point",
        "theism",
        "may",
        "avoid",
        "absurdity",
        "barbarism",
        "polytheism",
        "mean",
        "free",
        "problem",
        "contrary",
        "hume",
        "view",
        "theism",
        "prone",
        "intolerance",
        "persecution",
        "opponent",
        "encourages",
        "follower",
        "abase",
        "pursue",
        "useless",
        "form",
        "selfdenial",
        "corrupts",
        "pervert",
        "philosophy",
        "although",
        "plagued",
        "doubt",
        "present",
        "dogmatic",
        "attitude",
        "world",
        "finally",
        "breed",
        "serious",
        "moral",
        "vice",
        "including",
        "hypocrisy",
        "fraud",
        "cruelty",
        "tendency",
        "theism",
        "concern",
        "hume",
        "however",
        "intolerance",
        "opposition",
        "liberty",
        "distorted",
        "moral",
        "standard",
        "willingness",
        "sanction",
        "greatest",
        "crime",
        "name",
        "piety",
        "devotion",
        "nhr",
        "hume",
        "leaf",
        "reader",
        "clear",
        "view",
        "religion",
        "far",
        "source",
        "support",
        "moral",
        "practice",
        "fact",
        "major",
        "source",
        "moral",
        "sickness",
        "world",
        "hume",
        "return",
        "general",
        "theme",
        "closing",
        "passage",
        "dialogue",
        "context",
        "philo",
        "emphasizes",
        "point",
        "doctrine",
        "future",
        "state",
        "little",
        "practical",
        "influence",
        "human",
        "conduct",
        "well",
        "understood",
        "world",
        "none",
        "fool",
        "ever",
        "repose",
        "le",
        "trust",
        "man",
        "hear",
        "study",
        "philosophy",
        "entertained",
        "speculative",
        "doubt",
        "regard",
        "theological",
        "subject",
        "man",
        "make",
        "great",
        "profession",
        "religion",
        "devotion",
        "effect",
        "upon",
        "several",
        "pas",
        "prudent",
        "put",
        "guard",
        "lest",
        "cheated",
        "deceived",
        "hume",
        "make",
        "observation",
        "even",
        "religion",
        "put",
        "direct",
        "opposition",
        "morality",
        "nevertheless",
        "put",
        "forward",
        "frivolous",
        "specie",
        "merit",
        "suggests",
        "preposterous",
        "distribution",
        "praise",
        "blame",
        "based",
        "upon",
        "perverted",
        "moral",
        "standard",
        "disconnected",
        "real",
        "human",
        "need",
        "interest",
        "cp",
        "em",
        "beyond",
        "also",
        "point",
        "particular",
        "danger",
        "society",
        "clergy",
        "gain",
        "much",
        "power",
        "influence",
        "theme",
        "hume",
        "also",
        "touch",
        "throughout",
        "many",
        "writing",
        "including",
        "natural",
        "history",
        "religion",
        "several",
        "essay",
        "history",
        "england",
        "see",
        "eg",
        "nhr",
        "national",
        "character",
        "esy",
        "n",
        "iiif",
        "relationship",
        "religion",
        "morality",
        "hume",
        "account",
        "seems",
        "clear",
        "best",
        "religion",
        "little",
        "practical",
        "influence",
        "guiding",
        "supporting",
        "moral",
        "conduct",
        "effective",
        "reliable",
        "lever",
        "purpose",
        "rest",
        "various",
        "element",
        "human",
        "nature",
        "operate",
        "independently",
        "religious",
        "belief",
        "ie",
        "pride",
        "sympathy",
        "moral",
        "sense",
        "etc",
        "worst",
        "commonly",
        "find",
        "religious",
        "principle",
        "institution",
        "disturb",
        "pervert",
        "natural",
        "reasonable",
        "moral",
        "standard",
        "human",
        "nature",
        "provided",
        "u"
    ]
}