{
    "main_text": "Context\n1. Context\n\nHume’s aesthetic theory received limited attention until the\nsecond half of the Twentieth Century, when interest in the full range\nof Hume’s thought was enlivened by the gradual recognition of\nhis importance among philosophers writing in English. Unfortunately,\nmany discussions of Hume’s aesthetics concentrate on a single\nlate essay, “Of the Standard of Taste” (1757). This\nemphasis misrepresents the degree to which Hume’s aesthetic\ntheory is integrated into his philosophical system. This\nmisrepresentation has been countered by recent monographs on\nHume’s general aesthetic theory by Dabney Townsend (2001) and\nTimothy Costelloe (2007).\n\nThe “Advertisement” to his first publication, A\nTreatise of Human Nature, promises that if the first two volumes\nfind suitable “approbation,” the project will conclude\nwith “the examination of morals, politics, and criticism; which\nwill compleat this Treatise of human nature” (T, Adv, xii).\nSadly, the Treatise was not a success and Hume limited the\nthird and final volume to the topic “Of Morals.” He never\nproduced his systematic treatment of politics and criticism and so\nnever completed his new “science” of human nature. Those\ntopics would be handled piecemeal in several collections of short\nessays, the “polite” writing that brought him the\npublishing success he desired.\n\nHume’s concept of criticism is not interchangeable with either\naesthetics or philosophy of art. These now-familiar labels were not\navailable to Hume when he published his Treatise in 1739 and\n1740. The Abbé Charles Batteux did not defend the idea of\ngrouping the arts together in an investigation of fine art until 1746.\nHowever, Hume knew and drew from the French tradition leading to\nBatteux’s work. Under this general influence, his essays\noccasionally refer to the “the finer arts” of painting,\nmusic, sculpture, and poetry (CL, 158; SOT 278; OT, 264; C, 289).\nThere is no direct evidence that Hume read Batteux, but they agree in\nidentifying the fine arts as mimetic “arts of luxury” that\nexist primarily for the sake of our enjoyment (C, 289). Although\ncontemporaries such as Alexander Gerard and Lord Kames (Henry Home)\nboth use the phrase “fine art,” Hume’s books and\nletters never use that expression. Hume was probably not aware of\nAlexander Baumgarten’s Reflections on Poetry of 1735,\nthe work that introduced the term “aesthetics.” The thesis\nthat aesthetic judgments are completely distinct from moral judgments\nwould not receive its modern formulation until Immanuel Kant’s\nCritique of Judgment (1790), after Hume’s death in\n1776. So Hume’s reflections on aesthetics occupy a pivotal niche\nbetween the appearance of fine art theory and Kant’s defense of\nan independent aesthetic judgment in the Critique of Judgment\n– a defense clearly influenced by Kant’s reading of\nHume’s essays and An Enquiry Concerning the Principles of\nMorals.\n\nHume’s theory is most firmly rooted in the work of Joseph\nAddison, Francis Hutcheson, and, to a lesser extent, Shaftesbury\n(Anthony Ashley Cooper). The specific connections are detailed in Kivy\n(2003), Townsend (2001), and Costelloe (2007). From the older\ntradition, elegantly expounded by Addison in numerous essays written\nbetween 1709 and 1715, Hume retains the idea that the values within\nthe scope of criticism are essentially pleasures of the human\nimagination. Although Hume acknowledges cases where beauty seems a\nmerely sensory pleasure, he emphasizes beauty’s status as a\ncognitive pleasure. Taking beauty as his paradigm case of such a\nvalue, Hume combines Addison’s theory of taste as an operation\nof imagination with Hutcheson’s proposal that emotions are the\nfoundation of moral judgment. Elaborating on the “inner\nsense” theory, Hume endorses Hutcheson’s stance on the\ngeneral question of the nature of both moral and aesthetic value.\nValue judgments are expressions of taste rather than reasoned\nanalysis. Values cannot be addressed except in the context of a\ngeneral theory about our shared human nature. Although recognition of\naesthetic and moral beauty is a manifestation of taste (and perhaps\nthey cannot ultimately be distinguished from one another), taste must\nnot be dismissed as subjective, idiosyncratic preference.\n\nGranted, Hume has many other influences. He drew on classical sources,\nincluding Cicero. His celebrated essay on taste draws heavily on\nFrench thought, particularly on that of the Abbé Jean-Baptiste\nDubos(1748). (See\n Section 4\n below.) So does the essay on tragedy. (See\n Section 5\n below.) Detailed accounts of Hume’s debt to Dubos are provided\nin Jones (2009) and Townsend (2011, pp. 76–85).\n\nWithin this framework of concerns and influences, Hume is neither\ninterested in working out a theory of art (in contributing to\nphilosophy of art) nor in analyzing aesthetic properties (in doing\naesthetics). Although he is aware of debates about the nature of the\nsublime and recognizes it as a category of artistic achievement (SOT,\n281), he offers no theory of the sublime. An attempt to pull together\na Humean account is made by Hipple (1967, pp. 42–44). Due to the\nseamless connection Hume posits between moral and aesthetic value,\nmuch of his technical discussion of aesthetics appears only as an\nillustration of his moral theory. Other details of Hume’s\naesthetics emerge in contexts where he expounds his theory of\nimaginative association (EHUa, 102–7), elaborates on the value\nof delicacy of taste (DOT), and denies that his appeal to sentiment\nleads to skepticism about value distinctions (S, 217–19).\nConsequently, a reading that emphasizes “Of the Standard of\nTaste” at the expense of the Treatise and\nEnquiries shortchanges the theory’s complexity.\n\nThus, the two essays that appear to summarize Hume’s aesthetics\nare best understood as applications of a larger philosophical account\nof human nature, including our social nature. The construction of each\nessay suggests a purpose of working out details of the larger project\nin the face of an obvious counterexample. Those counterexamples are\nthe relativity of taste (SOT) and the pleasure we take in tragic\nfiction (OT). Yet their limited purpose does not detract from their\ncontinuing importance. They provide insight into perennial problems\nand so serve as the historical foundation for subsequent attempts to\ndefend a subjectivist aesthetic theory.\n\nUnfortunately, numerous interpretative challenges arise from\nHume’s scattered presentation, his range of references, and his\neighteenth-century assumptions about art. Like many of his\ncontemporaries, Hume regards “poetry and the polite\nauthors” as the most important arts (PW 3, 19). Timothy\nCostelloe (2018, chap. 4) consequently constructs an excellent survey\nof Humean aesthetics by canvassing the full range of Hume’s\ncomments on poets and poetry. However, poetry differs from the more\npractical arts in being designed for the primary purpose of giving\npleasure (SOT, 277). When using the terms “art” and\n“artist,” Hume sometimes means any human artifice and any\nskilled designer (in one context, an “artist” is someone\nwho repairs a clock (EHU, 87)). In contexts where he can only be taken\nto be interested in the narrower category of fine art, Hume variously\nmentions painting, statuary, architecture, dance, poetry, and music.\nBut he places poetry among the arts of eloquent public discourse.\nEloquence includes sermons, essays, argumentative discourse, and other\ncategories that we today would regard as too overtly didactic to be\nfine art (E).\n\nHume assumes that every product of human labor has some definite\npurpose, with only a limited subset of art being produced for the sake\nof pleasure alone. (He is skeptical about appeals to teleological or\nfinal causes in nature.) Houses will be designed and built apart from\nany need to satisfy our taste for beauty, and representational art\nwill be produced in order to provide visual information. The\ninteresting questions are why houses and visual representations also\nappeal to taste, and what this appeal tells us about the relative\ncontributions of human nature and education as conditions for\nappropriate responses to our surroundings.\n\nSo what label best summarizes Hume’s theory of moral and\naesthetic taste? It may be easier to specify which labels do not fit\nhis theory than to attach one to it. He rejects normative realism.\n(There is considerable controversy on the question of whether Hume is\na realist regarding matters of fact. Putting that issue to one side,\nhe clearly denies that normative judgments have the same degree of\nobjectivity that holds for matters of fact.) Hume is equally at pains\nto deny that reason provides an adequate foundation for judgments of\ntaste. Is he therefore a subjectivist? Not if subjectivism implies\nthat such judgments are arbitrary. He is not a relativist, for the\nmain point of the essay on taste is that some judgments of taste are\nsuperior to others. Nor, in his own terms, is he a skeptic regarding\naesthetic properties and value judgments. Despite his philosophical\nview that beauty is not a real property of things, Hume never\nquestions the meaningfulness of general practice of making aesthetic\njudgments. Because the verdicts of taste are sentiments, devoid of\ntruth-value, there is no opportunity for the conflicts and failures of\nreason that give rise to philosophical skepticism.\n\nHume is an inner sense theorist who treats aesthetic pleasure as an\ninstinctive and natural human response. Successful art exploits our\nnatural sentiments by employing appropriate composition and design.\nOnly empirical inquiry can establish reliable ways to elicit the\napproval of taste.\n",
    "section_title": "1. Context",
    "entry_title": "Hume’s Aesthetics",
    "hierarchy_title": "Hume’s Aesthetics || Context",
    "tokenized_text": [
        "context",
        "context",
        "hume",
        "aesthetic",
        "theory",
        "received",
        "limited",
        "attention",
        "second",
        "half",
        "twentieth",
        "century",
        "interest",
        "full",
        "range",
        "hume",
        "thought",
        "enlivened",
        "gradual",
        "recognition",
        "importance",
        "among",
        "philosopher",
        "writing",
        "english",
        "unfortunately",
        "many",
        "discussion",
        "hume",
        "aesthetic",
        "concentrate",
        "single",
        "late",
        "essay",
        "standard",
        "taste",
        "emphasis",
        "misrepresents",
        "degree",
        "hume",
        "aesthetic",
        "theory",
        "integrated",
        "philosophical",
        "system",
        "misrepresentation",
        "countered",
        "recent",
        "monograph",
        "hume",
        "general",
        "aesthetic",
        "theory",
        "dabney",
        "townsend",
        "timothy",
        "costelloe",
        "advertisement",
        "first",
        "publication",
        "treatise",
        "human",
        "nature",
        "promise",
        "first",
        "two",
        "volume",
        "find",
        "suitable",
        "approbation",
        "project",
        "conclude",
        "examination",
        "moral",
        "politics",
        "criticism",
        "compleat",
        "treatise",
        "human",
        "nature",
        "adv",
        "xii",
        "sadly",
        "treatise",
        "success",
        "hume",
        "limited",
        "third",
        "final",
        "volume",
        "topic",
        "morals",
        "never",
        "produced",
        "systematic",
        "treatment",
        "politics",
        "criticism",
        "never",
        "completed",
        "new",
        "science",
        "human",
        "nature",
        "topic",
        "would",
        "handled",
        "piecemeal",
        "several",
        "collection",
        "short",
        "essay",
        "polite",
        "writing",
        "brought",
        "publishing",
        "success",
        "desired",
        "hume",
        "concept",
        "criticism",
        "interchangeable",
        "either",
        "aesthetic",
        "philosophy",
        "art",
        "nowfamiliar",
        "label",
        "available",
        "hume",
        "published",
        "treatise",
        "abbé",
        "charles",
        "batteux",
        "defend",
        "idea",
        "grouping",
        "art",
        "together",
        "investigation",
        "fine",
        "art",
        "however",
        "hume",
        "knew",
        "drew",
        "french",
        "tradition",
        "leading",
        "batteux",
        "work",
        "general",
        "influence",
        "essay",
        "occasionally",
        "refer",
        "finer",
        "art",
        "painting",
        "music",
        "sculpture",
        "poetry",
        "cl",
        "sot",
        "ot",
        "c",
        "direct",
        "evidence",
        "hume",
        "read",
        "batteux",
        "agree",
        "identifying",
        "fine",
        "art",
        "mimetic",
        "art",
        "luxury",
        "exist",
        "primarily",
        "sake",
        "enjoyment",
        "c",
        "although",
        "contemporary",
        "alexander",
        "gerard",
        "lord",
        "kames",
        "henry",
        "home",
        "use",
        "phrase",
        "fine",
        "art",
        "hume",
        "book",
        "letter",
        "never",
        "use",
        "expression",
        "hume",
        "probably",
        "aware",
        "alexander",
        "baumgarten",
        "reflection",
        "poetry",
        "work",
        "introduced",
        "term",
        "aesthetics",
        "thesis",
        "aesthetic",
        "judgment",
        "completely",
        "distinct",
        "moral",
        "judgment",
        "would",
        "receive",
        "modern",
        "formulation",
        "immanuel",
        "kant",
        "critique",
        "judgment",
        "hume",
        "death",
        "hume",
        "reflection",
        "aesthetic",
        "occupy",
        "pivotal",
        "niche",
        "appearance",
        "fine",
        "art",
        "theory",
        "kant",
        "defense",
        "independent",
        "aesthetic",
        "judgment",
        "critique",
        "judgment",
        "defense",
        "clearly",
        "influenced",
        "kant",
        "reading",
        "hume",
        "essay",
        "enquiry",
        "concerning",
        "principle",
        "moral",
        "hume",
        "theory",
        "firmly",
        "rooted",
        "work",
        "joseph",
        "addison",
        "francis",
        "hutcheson",
        "lesser",
        "extent",
        "shaftesbury",
        "anthony",
        "ashley",
        "cooper",
        "specific",
        "connection",
        "detailed",
        "kivy",
        "townsend",
        "costelloe",
        "older",
        "tradition",
        "elegantly",
        "expounded",
        "addison",
        "numerous",
        "essay",
        "written",
        "hume",
        "retains",
        "idea",
        "value",
        "within",
        "scope",
        "criticism",
        "essentially",
        "pleasure",
        "human",
        "imagination",
        "although",
        "hume",
        "acknowledges",
        "case",
        "beauty",
        "seems",
        "merely",
        "sensory",
        "pleasure",
        "emphasizes",
        "beauty",
        "status",
        "cognitive",
        "pleasure",
        "taking",
        "beauty",
        "paradigm",
        "case",
        "value",
        "hume",
        "combine",
        "addison",
        "theory",
        "taste",
        "operation",
        "imagination",
        "hutcheson",
        "proposal",
        "emotion",
        "foundation",
        "moral",
        "judgment",
        "elaborating",
        "inner",
        "sense",
        "theory",
        "hume",
        "endorses",
        "hutcheson",
        "stance",
        "general",
        "question",
        "nature",
        "moral",
        "aesthetic",
        "value",
        "value",
        "judgment",
        "expression",
        "taste",
        "rather",
        "reasoned",
        "analysis",
        "value",
        "addressed",
        "except",
        "context",
        "general",
        "theory",
        "shared",
        "human",
        "nature",
        "although",
        "recognition",
        "aesthetic",
        "moral",
        "beauty",
        "manifestation",
        "taste",
        "perhaps",
        "ultimately",
        "distinguished",
        "one",
        "another",
        "taste",
        "must",
        "dismissed",
        "subjective",
        "idiosyncratic",
        "preference",
        "granted",
        "hume",
        "many",
        "influence",
        "drew",
        "classical",
        "source",
        "including",
        "cicero",
        "celebrated",
        "essay",
        "taste",
        "draw",
        "heavily",
        "french",
        "thought",
        "particularly",
        "abbé",
        "jeanbaptiste",
        "dubos",
        "see",
        "section",
        "essay",
        "tragedy",
        "see",
        "section",
        "detailed",
        "account",
        "hume",
        "debt",
        "dubos",
        "provided",
        "jones",
        "townsend",
        "pp",
        "within",
        "framework",
        "concern",
        "influence",
        "hume",
        "neither",
        "interested",
        "working",
        "theory",
        "art",
        "contributing",
        "philosophy",
        "art",
        "analyzing",
        "aesthetic",
        "property",
        "aesthetic",
        "although",
        "aware",
        "debate",
        "nature",
        "sublime",
        "recognizes",
        "category",
        "artistic",
        "achievement",
        "sot",
        "offer",
        "theory",
        "sublime",
        "attempt",
        "pull",
        "together",
        "humean",
        "account",
        "made",
        "hipple",
        "pp",
        "due",
        "seamless",
        "connection",
        "hume",
        "posit",
        "moral",
        "aesthetic",
        "value",
        "much",
        "technical",
        "discussion",
        "aesthetic",
        "appears",
        "illustration",
        "moral",
        "theory",
        "detail",
        "hume",
        "aesthetic",
        "emerge",
        "context",
        "expounds",
        "theory",
        "imaginative",
        "association",
        "ehua",
        "elaborates",
        "value",
        "delicacy",
        "taste",
        "dot",
        "denies",
        "appeal",
        "sentiment",
        "lead",
        "skepticism",
        "value",
        "distinction",
        "consequently",
        "reading",
        "emphasizes",
        "standard",
        "taste",
        "expense",
        "treatise",
        "enquiry",
        "shortchanges",
        "theory",
        "complexity",
        "thus",
        "two",
        "essay",
        "appear",
        "summarize",
        "hume",
        "aesthetic",
        "best",
        "understood",
        "application",
        "larger",
        "philosophical",
        "account",
        "human",
        "nature",
        "including",
        "social",
        "nature",
        "construction",
        "essay",
        "suggests",
        "purpose",
        "working",
        "detail",
        "larger",
        "project",
        "face",
        "obvious",
        "counterexample",
        "counterexample",
        "relativity",
        "taste",
        "sot",
        "pleasure",
        "take",
        "tragic",
        "fiction",
        "ot",
        "yet",
        "limited",
        "purpose",
        "detract",
        "continuing",
        "importance",
        "provide",
        "insight",
        "perennial",
        "problem",
        "serve",
        "historical",
        "foundation",
        "subsequent",
        "attempt",
        "defend",
        "subjectivist",
        "aesthetic",
        "theory",
        "unfortunately",
        "numerous",
        "interpretative",
        "challenge",
        "arise",
        "hume",
        "scattered",
        "presentation",
        "range",
        "reference",
        "eighteenthcentury",
        "assumption",
        "art",
        "like",
        "many",
        "contemporary",
        "hume",
        "regard",
        "poetry",
        "polite",
        "author",
        "important",
        "art",
        "pw",
        "timothy",
        "costelloe",
        "chap",
        "consequently",
        "construct",
        "excellent",
        "survey",
        "humean",
        "aesthetic",
        "canvassing",
        "full",
        "range",
        "hume",
        "comment",
        "poet",
        "poetry",
        "however",
        "poetry",
        "differs",
        "practical",
        "art",
        "designed",
        "primary",
        "purpose",
        "giving",
        "pleasure",
        "sot",
        "using",
        "term",
        "art",
        "artist",
        "hume",
        "sometimes",
        "mean",
        "human",
        "artifice",
        "skilled",
        "designer",
        "one",
        "context",
        "artist",
        "someone",
        "repair",
        "clock",
        "ehu",
        "context",
        "taken",
        "interested",
        "narrower",
        "category",
        "fine",
        "art",
        "hume",
        "variously",
        "mention",
        "painting",
        "statuary",
        "architecture",
        "dance",
        "poetry",
        "music",
        "place",
        "poetry",
        "among",
        "art",
        "eloquent",
        "public",
        "discourse",
        "eloquence",
        "includes",
        "sermon",
        "essay",
        "argumentative",
        "discourse",
        "category",
        "today",
        "would",
        "regard",
        "overtly",
        "didactic",
        "fine",
        "art",
        "e",
        "hume",
        "assumes",
        "every",
        "product",
        "human",
        "labor",
        "definite",
        "purpose",
        "limited",
        "subset",
        "art",
        "produced",
        "sake",
        "pleasure",
        "alone",
        "skeptical",
        "appeal",
        "teleological",
        "final",
        "cause",
        "nature",
        "house",
        "designed",
        "built",
        "apart",
        "need",
        "satisfy",
        "taste",
        "beauty",
        "representational",
        "art",
        "produced",
        "order",
        "provide",
        "visual",
        "information",
        "interesting",
        "question",
        "house",
        "visual",
        "representation",
        "also",
        "appeal",
        "taste",
        "appeal",
        "tell",
        "u",
        "relative",
        "contribution",
        "human",
        "nature",
        "education",
        "condition",
        "appropriate",
        "response",
        "surroundings",
        "label",
        "best",
        "summarizes",
        "hume",
        "theory",
        "moral",
        "aesthetic",
        "taste",
        "may",
        "easier",
        "specify",
        "label",
        "fit",
        "theory",
        "attach",
        "one",
        "reject",
        "normative",
        "realism",
        "considerable",
        "controversy",
        "question",
        "whether",
        "hume",
        "realist",
        "regarding",
        "matter",
        "fact",
        "putting",
        "issue",
        "one",
        "side",
        "clearly",
        "denies",
        "normative",
        "judgment",
        "degree",
        "objectivity",
        "hold",
        "matter",
        "fact",
        "hume",
        "equally",
        "pain",
        "deny",
        "reason",
        "provides",
        "adequate",
        "foundation",
        "judgment",
        "taste",
        "therefore",
        "subjectivist",
        "subjectivism",
        "implies",
        "judgment",
        "arbitrary",
        "relativist",
        "main",
        "point",
        "essay",
        "taste",
        "judgment",
        "taste",
        "superior",
        "others",
        "term",
        "skeptic",
        "regarding",
        "aesthetic",
        "property",
        "value",
        "judgment",
        "despite",
        "philosophical",
        "view",
        "beauty",
        "real",
        "property",
        "thing",
        "hume",
        "never",
        "question",
        "meaningfulness",
        "general",
        "practice",
        "making",
        "aesthetic",
        "judgment",
        "verdict",
        "taste",
        "sentiment",
        "devoid",
        "truthvalue",
        "opportunity",
        "conflict",
        "failure",
        "reason",
        "give",
        "rise",
        "philosophical",
        "skepticism",
        "hume",
        "inner",
        "sense",
        "theorist",
        "treat",
        "aesthetic",
        "pleasure",
        "instinctive",
        "natural",
        "human",
        "response",
        "successful",
        "art",
        "exploit",
        "natural",
        "sentiment",
        "employing",
        "appropriate",
        "composition",
        "design",
        "empirical",
        "inquiry",
        "establish",
        "reliable",
        "way",
        "elicit",
        "approval",
        "taste"
    ]
}