{
    "main_text": "\nBut to proceed in this reconciling project with regard to the question of liberty and necessity; the most contentious question of metaphysics, the most contentious science… —David Hume (EU 8.23/95)\nIt is widely accepted that David Hume’s contribution to the free will debate is one of the most influential statements of the “compatibilist” position, where this is understood as the view that human freedom and moral responsibility can be reconciled with (causal) determinism. Hume’s arguments on this subject are found primarily in the sections titled “Of liberty and necessity”, as first presented in A Treatise of Human Nature (2.3.1–2) and, later, in a slightly amended form, in the Enquiry concerning Human Understanding (sec. 8). Although both contributions share the same title, there are, nevertheless, some significant differences between them. This includes, for example, some substantial additions in the Enquiry discussion as it relates to problems of religion, such as predestination and divine foreknowledge. These differences should not, however, be exaggerated. Hume’s basic strategy and compatibilist commitments remain much the same in both works.\nThis article will be arranged around a basic contrast between two alternative interpretations of Hume’s compatibilist strategy: the “classical” and “naturalistic” interpretations. According to the classical account, Hume’s effort to articulate the conditions of moral responsibility, and the way they relate to the free will problem, should be understood primarily in terms of his views about the logic of  the concepts of “liberty” and “necessity”. In contrast with this, the naturalistic approach maintains that what is essential to Hume’s account of the nature and conditions of responsible conduct is his description of the role that moral sentiment plays in this sphere. How we interpret Hume’s core arguments relating to the free will debate must be understood, on this view, with reference to these psychological claims and concerns (which also accounts for the use of the label “naturalism” in this context). On either account, the contrast between these two interpretations will be of importance, not only for our general understanding of Hume’s philosophical system, but also for any adequate assessment of the contemporary value and relevance of Hume’s views on this subject.\nThe first two sections of this article present and contrast the classical and naturalistic interpretations. Hume’s views on causation and necessity are highly relevant to both these interpretations. The following three sections sections consider the contemporary significance of Hume’s contribution, particularly as interpreted by the naturalistic account. The sixth and final section examines the relevance of Hume’s views on free will for matters of religion.\n",
    "section_title": "Preamble",
    "entry_title": "Hume on Free Will",
    "hierarchy_title": "Hume on Free Will || Preamble",
    "tokenized_text": [
        "proceed",
        "reconciling",
        "project",
        "regard",
        "question",
        "liberty",
        "necessity",
        "contentious",
        "question",
        "metaphysics",
        "contentious",
        "science",
        "david",
        "hume",
        "eu",
        "widely",
        "accepted",
        "david",
        "hume",
        "contribution",
        "free",
        "debate",
        "one",
        "influential",
        "statement",
        "compatibilist",
        "position",
        "understood",
        "view",
        "human",
        "freedom",
        "moral",
        "responsibility",
        "reconciled",
        "causal",
        "determinism",
        "hume",
        "argument",
        "subject",
        "found",
        "primarily",
        "section",
        "titled",
        "liberty",
        "necessity",
        "first",
        "presented",
        "treatise",
        "human",
        "nature",
        "later",
        "slightly",
        "amended",
        "form",
        "enquiry",
        "concerning",
        "human",
        "understanding",
        "sec",
        "although",
        "contribution",
        "share",
        "title",
        "nevertheless",
        "significant",
        "difference",
        "includes",
        "example",
        "substantial",
        "addition",
        "enquiry",
        "discussion",
        "relates",
        "problem",
        "religion",
        "predestination",
        "divine",
        "foreknowledge",
        "difference",
        "however",
        "exaggerated",
        "hume",
        "basic",
        "strategy",
        "compatibilist",
        "commitment",
        "remain",
        "much",
        "work",
        "article",
        "arranged",
        "around",
        "basic",
        "contrast",
        "two",
        "alternative",
        "interpretation",
        "hume",
        "compatibilist",
        "strategy",
        "classical",
        "naturalistic",
        "interpretation",
        "according",
        "classical",
        "account",
        "hume",
        "effort",
        "articulate",
        "condition",
        "moral",
        "responsibility",
        "way",
        "relate",
        "free",
        "problem",
        "understood",
        "primarily",
        "term",
        "view",
        "logic",
        "concept",
        "liberty",
        "necessity",
        "contrast",
        "naturalistic",
        "approach",
        "maintains",
        "essential",
        "hume",
        "account",
        "nature",
        "condition",
        "responsible",
        "conduct",
        "description",
        "role",
        "moral",
        "sentiment",
        "play",
        "sphere",
        "interpret",
        "hume",
        "core",
        "argument",
        "relating",
        "free",
        "debate",
        "must",
        "understood",
        "view",
        "reference",
        "psychological",
        "claim",
        "concern",
        "also",
        "account",
        "use",
        "label",
        "naturalism",
        "context",
        "either",
        "account",
        "contrast",
        "two",
        "interpretation",
        "importance",
        "general",
        "understanding",
        "hume",
        "philosophical",
        "system",
        "also",
        "adequate",
        "assessment",
        "contemporary",
        "value",
        "relevance",
        "hume",
        "view",
        "subject",
        "first",
        "two",
        "section",
        "article",
        "present",
        "contrast",
        "classical",
        "naturalistic",
        "interpretation",
        "hume",
        "view",
        "causation",
        "necessity",
        "highly",
        "relevant",
        "interpretation",
        "following",
        "three",
        "section",
        "section",
        "consider",
        "contemporary",
        "significance",
        "hume",
        "contribution",
        "particularly",
        "interpreted",
        "naturalistic",
        "account",
        "sixth",
        "final",
        "section",
        "examines",
        "relevance",
        "hume",
        "view",
        "free",
        "matter",
        "religion"
    ]
}