{
    "main_text": "Issues from Hume’s Predecessors\n1. Issues from Hume’s Predecessors\n\n\nHume inherits from his predecessors several controversies about\nethics and political philosophy.\n\n\nOne is a question of moral epistemology: how do human beings become\naware of, or acquire knowledge or belief about, moral good and evil,\nright and wrong, duty and obligation? Ethical theorists and\ntheologians of the day held, variously, that moral good and evil are\ndiscovered: (a) by reason in some of its uses (Hobbes, Locke, Clarke),\n(b) by divine revelation (Filmer), (c) by conscience or reflection on\none’s (other) impulses (Butler), or (d) by a moral sense: an emotional\nresponsiveness manifesting itself in approval or disapproval\n(Shaftesbury, Hutcheson). Hume sides with the moral sense theorists:\nwe gain awareness of moral good and evil by experiencing the pleasure\nof approval and the uneasiness of disapproval when we contemplate a\ncharacter trait or action from an imaginatively sensitive and unbiased\npoint of view. Hume maintains against the rationalists that, although\nreason is needed to discover the facts of any concrete situation and\nthe general social impact of a trait of character or a practice over\ntime, reason alone is insufficient to yield a judgment that something\nis virtuous or vicious. In the last analysis, the facts as known must\ntrigger a response by sentiment or “taste.”\n\n\nA related but more metaphysical controversy would be stated thus\ntoday: what is the source or foundation of moral norms? In Hume’s day\nthis is the question what is the ground of moral obligation (as\ndistinct from what is the faculty for acquiring moral knowledge or\nbelief). Moral rationalists of the period such as Clarke (and in some\nmoods, Hobbes and Locke) argue that moral standards or principles are\nrequirements of reason — that is, that the very rationality of\nright actions is the ground of our obligation to perform them. Divine\nvoluntarists of the seventeenth and eighteenth centuries such as Samuel\nPufendorf claim that moral obligation or requirement, if not every sort\nof moral standard, is the product of God’s will. The moral sense\ntheorists (Shaftesbury and Hutcheson) and Butler see all requirements\nto pursue goodness and avoid evil as consequent upon human nature,\nwhich is so structured that a particular feature of our consciousness\n(whether moral sense or conscience) evaluates the rest. Hume sides with\nthe moral sense theorists on this question: it is because we are the\nkinds of creatures we are, with the dispositions we have for pain and\npleasure, the kinds of familial and friendly interdependence that make\nup our life together, and our approvals and disapprovals of these, that\nwe are bound by moral requirements at all.\n\n\nClosely connected with the issue of the foundations of moral norms is\nthe question whether moral requirements are natural or conventional.\nHobbes and Mandeville see them as conventional, and Shaftesbury,\nHutcheson, Locke, and others see them as natural. Hume mocks\nMandeville’s contention that the very concepts of vice and virtue are\nfoisted on us by scheming politicians trying to manage us\nmore easily. If there were nothing in our experience and no sentiments\nin our minds to produce the concept of virtue, Hume says, no\nlavish praise of heroes could generate it. So to a degree moral requirements have a natural origin. Nonetheless,Hume thinks natural impulses of humanity and dispositions to approve\ncannot entirely account for our virtue of justice; a correct analysis\nof that virtue reveals that mankind, an “inventive\nspecies,” has cooperatively constructed rules of property and\npromise. Thus he takes an intermediate position: some virtues are\nnatural, and some are the products of convention. \n\n\nLinked with these meta-ethical controversies is the dilemma of\nunderstanding the ethical life either as the “ancients” do,\nin terms of virtues and vices of character, or as the\n“moderns” do, primarily in terms of principles of duty or\nnatural law. While even so law-oriented a thinker as Hobbes has a good\ndeal to say about virtue, the ethical writers of the seventeenth and\neighteenth centuries predominantly favor a rule- or law-governed\nunderstanding of morals, giving priority to laws of nature or\nprinciples of duty. The chief exception here is the moral sense school,\nwhich advocates an analysis of the moral life more like that of the\nGreek and Hellenistic thinkers, in terms of settled traits of character\n— although they too find a place for principles in their ethics.\nHume explicitly favors an ethic of character along\n“ancient” lines. Yet he insists on a role for rules of duty\nwithin the domain of what he calls the artificial virtues.\n\n\nHume’s predecessors famously took opposing positions on whether human\nnature was essentially selfish or benevolent, some arguing that man\nwas so dominated by self-interested motives that for moral\nrequirements to govern us at all they must serve our interests in some\nway, and others arguing that uncorrupted human beings naturally care\nabout the weal and woe of others and here morality gets its hold. Hume\nroundly criticizes Hobbes for his insistence on psychological egoism\nor something close to it, and for his dismal, violent picture of a\nstate of nature. Yet Hume resists the view of Hutcheson that all moral\nprinciples can be reduced to our benevolence, in part because he\ndoubts that benevolence can sufficiently overcome our perfectly normal\nacquisitiveness. According to Hume’s observation, we are both selfish\nand humane. We possess greed, and also “limited\ngenerosity” — dispositions to kindness and liberality\nwhich are more powerfully directed toward kin and friends and less\naroused by strangers. While for Hume the condition of humankind in the\nabsence of organized society is not a war of all against all, neither\nis it the law-governed and highly cooperative domain imagined by\nLocke. It is a hypothetical condition in which we would care for our\nfriends and cooperate with them, but in which self-interest and\npreference for friends over strangers would make any wider cooperation\nimpossible.  Hume’s empirically-based thesis that we are fundamentally\nloving, parochial, and also selfish creatures underlies his political\nphilosophy.\n\n\nIn the realm of politics, Hume again takes up an intermediate\nposition. He objects both to the doctrine that a subject must\npassively obey his government no matter how tyrannical it is and to\nthe Lockean thesis that citizens have a natural right to revolution\nwhenever their rulers violate their contractual commitments to the\npeople. He famously criticizes the notion that all political duties\narise from an implicit contract that binds later generations who were\nnot party to the original explicit agreement. Hume maintains that the\nduty to obey one’s government has an independent origin that parallels\nthat of promissory obligation: both are invented to enable people to\nlive together successfully. On his view, human beings can create a\nsociety without government, ordered by conventional rules of\nownership, transfer of property by consent, and promise-keeping. We\nsuperimpose government on such a pre-civil society when it grows large\nand prosperous; only then do we need to use political power to enforce\nthese rules of justice in order to preserve social cooperation. So the\nduty of allegiance to government, far from depending on the duty to\nfulfill promises, provides needed assurance that promises of all sorts\nwill be kept. The duty to submit to our rulers comes into being\nbecause reliable submission is necessary to preserve order. Particular\ngovernments are legitimate because of their usefulness in preserving\nsociety, not because those who wield power were chosen by God or\nreceived promises of obedience from the people. In a long-established\ncivil society, whatever ruler or type of government happens to be in\nplace and successfully maintaining order and justice is legitimate,\nand is owed allegiance. However, there is some legitimate recourse for\nvictims of tyranny: the people may rightly overthrow any government\nthat is so oppressive as not to provide the benefits (peace and\nsecurity from injustice) for which governments are formed. In his\npolitical essays Hume certainly advocates the sort of constitution\nthat protects the people’s liberties, but he justifies it not based on individual natural rights or contractual obligations but based on the\ngreater long-range good of society.\n",
    "section_title": "1. Issues from Hume’s Predecessors",
    "entry_title": "Hume’s Moral Philosophy",
    "hierarchy_title": "Hume’s Moral Philosophy || Issues from Hume’s Predecessors",
    "tokenized_text": [
        "issue",
        "hume",
        "predecessor",
        "issue",
        "hume",
        "predecessor",
        "hume",
        "inherits",
        "predecessor",
        "several",
        "controversy",
        "ethic",
        "political",
        "philosophy",
        "one",
        "question",
        "moral",
        "epistemology",
        "human",
        "being",
        "become",
        "aware",
        "acquire",
        "knowledge",
        "belief",
        "moral",
        "good",
        "evil",
        "right",
        "wrong",
        "duty",
        "obligation",
        "ethical",
        "theorist",
        "theologian",
        "day",
        "held",
        "variously",
        "moral",
        "good",
        "evil",
        "discovered",
        "reason",
        "us",
        "hobbes",
        "locke",
        "clarke",
        "b",
        "divine",
        "revelation",
        "filmer",
        "c",
        "conscience",
        "reflection",
        "one",
        "impulse",
        "butler",
        "moral",
        "sense",
        "emotional",
        "responsiveness",
        "manifesting",
        "approval",
        "disapproval",
        "shaftesbury",
        "hutcheson",
        "hume",
        "side",
        "moral",
        "sense",
        "theorist",
        "gain",
        "awareness",
        "moral",
        "good",
        "evil",
        "experiencing",
        "pleasure",
        "approval",
        "uneasiness",
        "disapproval",
        "contemplate",
        "character",
        "trait",
        "action",
        "imaginatively",
        "sensitive",
        "unbiased",
        "point",
        "view",
        "hume",
        "maintains",
        "rationalist",
        "although",
        "reason",
        "needed",
        "discover",
        "fact",
        "concrete",
        "situation",
        "general",
        "social",
        "impact",
        "trait",
        "character",
        "practice",
        "time",
        "reason",
        "alone",
        "insufficient",
        "yield",
        "judgment",
        "something",
        "virtuous",
        "vicious",
        "last",
        "analysis",
        "fact",
        "known",
        "must",
        "trigger",
        "response",
        "sentiment",
        "taste",
        "related",
        "metaphysical",
        "controversy",
        "would",
        "stated",
        "thus",
        "today",
        "source",
        "foundation",
        "moral",
        "norm",
        "hume",
        "day",
        "question",
        "ground",
        "moral",
        "obligation",
        "distinct",
        "faculty",
        "acquiring",
        "moral",
        "knowledge",
        "belief",
        "moral",
        "rationalist",
        "period",
        "clarke",
        "mood",
        "hobbes",
        "locke",
        "argue",
        "moral",
        "standard",
        "principle",
        "requirement",
        "reason",
        "rationality",
        "right",
        "action",
        "ground",
        "obligation",
        "perform",
        "divine",
        "voluntarists",
        "seventeenth",
        "eighteenth",
        "century",
        "samuel",
        "pufendorf",
        "claim",
        "moral",
        "obligation",
        "requirement",
        "every",
        "sort",
        "moral",
        "standard",
        "product",
        "god",
        "moral",
        "sense",
        "theorist",
        "shaftesbury",
        "hutcheson",
        "butler",
        "see",
        "requirement",
        "pursue",
        "goodness",
        "avoid",
        "evil",
        "consequent",
        "upon",
        "human",
        "nature",
        "structured",
        "particular",
        "feature",
        "consciousness",
        "whether",
        "moral",
        "sense",
        "conscience",
        "evaluates",
        "rest",
        "hume",
        "side",
        "moral",
        "sense",
        "theorist",
        "question",
        "kind",
        "creature",
        "disposition",
        "pain",
        "pleasure",
        "kind",
        "familial",
        "friendly",
        "interdependence",
        "make",
        "life",
        "together",
        "approval",
        "disapproval",
        "bound",
        "moral",
        "requirement",
        "closely",
        "connected",
        "issue",
        "foundation",
        "moral",
        "norm",
        "question",
        "whether",
        "moral",
        "requirement",
        "natural",
        "conventional",
        "hobbes",
        "mandeville",
        "see",
        "conventional",
        "shaftesbury",
        "hutcheson",
        "locke",
        "others",
        "see",
        "natural",
        "hume",
        "mock",
        "mandeville",
        "contention",
        "concept",
        "vice",
        "virtue",
        "foisted",
        "u",
        "scheming",
        "politician",
        "trying",
        "manage",
        "u",
        "easily",
        "nothing",
        "experience",
        "sentiment",
        "mind",
        "produce",
        "concept",
        "virtue",
        "hume",
        "say",
        "lavish",
        "praise",
        "hero",
        "could",
        "generate",
        "degree",
        "moral",
        "requirement",
        "natural",
        "origin",
        "nonetheless",
        "hume",
        "think",
        "natural",
        "impulse",
        "humanity",
        "disposition",
        "approve",
        "entirely",
        "account",
        "virtue",
        "justice",
        "correct",
        "analysis",
        "virtue",
        "reveals",
        "mankind",
        "inventive",
        "specie",
        "cooperatively",
        "constructed",
        "rule",
        "property",
        "promise",
        "thus",
        "take",
        "intermediate",
        "position",
        "virtue",
        "natural",
        "product",
        "convention",
        "linked",
        "metaethical",
        "controversy",
        "dilemma",
        "understanding",
        "ethical",
        "life",
        "either",
        "ancient",
        "term",
        "virtue",
        "vice",
        "character",
        "modern",
        "primarily",
        "term",
        "principle",
        "duty",
        "natural",
        "law",
        "even",
        "laworiented",
        "thinker",
        "hobbes",
        "good",
        "deal",
        "say",
        "virtue",
        "ethical",
        "writer",
        "seventeenth",
        "eighteenth",
        "century",
        "predominantly",
        "favor",
        "rule",
        "lawgoverned",
        "understanding",
        "moral",
        "giving",
        "priority",
        "law",
        "nature",
        "principle",
        "duty",
        "chief",
        "exception",
        "moral",
        "sense",
        "school",
        "advocate",
        "analysis",
        "moral",
        "life",
        "like",
        "greek",
        "hellenistic",
        "thinker",
        "term",
        "settled",
        "trait",
        "character",
        "although",
        "find",
        "place",
        "principle",
        "ethic",
        "hume",
        "explicitly",
        "favor",
        "ethic",
        "character",
        "along",
        "ancient",
        "line",
        "yet",
        "insists",
        "role",
        "rule",
        "duty",
        "within",
        "domain",
        "call",
        "artificial",
        "virtue",
        "hume",
        "predecessor",
        "famously",
        "took",
        "opposing",
        "position",
        "whether",
        "human",
        "nature",
        "essentially",
        "selfish",
        "benevolent",
        "arguing",
        "man",
        "dominated",
        "selfinterested",
        "motif",
        "moral",
        "requirement",
        "govern",
        "u",
        "must",
        "serve",
        "interest",
        "way",
        "others",
        "arguing",
        "uncorrupted",
        "human",
        "being",
        "naturally",
        "care",
        "weal",
        "woe",
        "others",
        "morality",
        "get",
        "hold",
        "hume",
        "roundly",
        "criticizes",
        "hobbes",
        "insistence",
        "psychological",
        "egoism",
        "something",
        "close",
        "dismal",
        "violent",
        "picture",
        "state",
        "nature",
        "yet",
        "hume",
        "resists",
        "view",
        "hutcheson",
        "moral",
        "principle",
        "reduced",
        "benevolence",
        "part",
        "doubt",
        "benevolence",
        "sufficiently",
        "overcome",
        "perfectly",
        "normal",
        "acquisitiveness",
        "according",
        "hume",
        "observation",
        "selfish",
        "humane",
        "posse",
        "greed",
        "also",
        "limited",
        "generosity",
        "disposition",
        "kindness",
        "liberality",
        "powerfully",
        "directed",
        "toward",
        "kin",
        "friend",
        "le",
        "aroused",
        "stranger",
        "hume",
        "condition",
        "humankind",
        "absence",
        "organized",
        "society",
        "war",
        "neither",
        "lawgoverned",
        "highly",
        "cooperative",
        "domain",
        "imagined",
        "locke",
        "hypothetical",
        "condition",
        "would",
        "care",
        "friend",
        "cooperate",
        "selfinterest",
        "preference",
        "friend",
        "stranger",
        "would",
        "make",
        "wider",
        "cooperation",
        "impossible",
        "hume",
        "empiricallybased",
        "thesis",
        "fundamentally",
        "loving",
        "parochial",
        "also",
        "selfish",
        "creature",
        "underlies",
        "political",
        "philosophy",
        "realm",
        "politics",
        "hume",
        "take",
        "intermediate",
        "position",
        "object",
        "doctrine",
        "subject",
        "must",
        "passively",
        "obey",
        "government",
        "matter",
        "tyrannical",
        "lockean",
        "thesis",
        "citizen",
        "natural",
        "right",
        "revolution",
        "whenever",
        "ruler",
        "violate",
        "contractual",
        "commitment",
        "people",
        "famously",
        "criticizes",
        "notion",
        "political",
        "duty",
        "arise",
        "implicit",
        "contract",
        "bind",
        "later",
        "generation",
        "party",
        "original",
        "explicit",
        "agreement",
        "hume",
        "maintains",
        "duty",
        "obey",
        "one",
        "government",
        "independent",
        "origin",
        "parallel",
        "promissory",
        "obligation",
        "invented",
        "enable",
        "people",
        "live",
        "together",
        "successfully",
        "view",
        "human",
        "being",
        "create",
        "society",
        "without",
        "government",
        "ordered",
        "conventional",
        "rule",
        "ownership",
        "transfer",
        "property",
        "consent",
        "promisekeeping",
        "superimpose",
        "government",
        "precivil",
        "society",
        "grows",
        "large",
        "prosperous",
        "need",
        "use",
        "political",
        "power",
        "enforce",
        "rule",
        "justice",
        "order",
        "preserve",
        "social",
        "cooperation",
        "duty",
        "allegiance",
        "government",
        "far",
        "depending",
        "duty",
        "fulfill",
        "promise",
        "provides",
        "needed",
        "assurance",
        "promise",
        "sort",
        "kept",
        "duty",
        "submit",
        "ruler",
        "come",
        "reliable",
        "submission",
        "necessary",
        "preserve",
        "order",
        "particular",
        "government",
        "legitimate",
        "usefulness",
        "preserving",
        "society",
        "wield",
        "power",
        "chosen",
        "god",
        "received",
        "promise",
        "obedience",
        "people",
        "longestablished",
        "civil",
        "society",
        "whatever",
        "ruler",
        "type",
        "government",
        "happens",
        "place",
        "successfully",
        "maintaining",
        "order",
        "justice",
        "legitimate",
        "owed",
        "allegiance",
        "however",
        "legitimate",
        "recourse",
        "victim",
        "tyranny",
        "people",
        "may",
        "rightly",
        "overthrow",
        "government",
        "oppressive",
        "provide",
        "benefit",
        "peace",
        "security",
        "injustice",
        "government",
        "formed",
        "political",
        "essay",
        "hume",
        "certainly",
        "advocate",
        "sort",
        "constitution",
        "protects",
        "people",
        "liberty",
        "justifies",
        "based",
        "individual",
        "natural",
        "right",
        "contractual",
        "obligation",
        "based",
        "greater",
        "longrange",
        "good",
        "society"
    ]
}