{
    "main_text": "Virtue, Luck and “the Morality System”\n4. Virtue, Luck and “the Morality System”\nWe have noted that the classical and naturalistic interpretations differ in how they account for the relationship between freedom and responsibility. According to the classical interpretation responsibility may be analysed directly in terms of free action, where this is understood simply in terms of an agent acting according to her own will or desires. While classical compatibilists reject the incompatibilist suggestion that free and responsible action requires indeterminism or any special form of “moral causation” they are, nevertheless, both agreed that a person can be held responsible if and only if she acts freely. On the naturalistic interpretation, however, Hume rejects this general doctrine, which we may call “voluntarism”.\nHume maintains that it is a matter of “the utmost importance” for moral philosophy that action must be indicative of durable qualities of mind if a person is to be held accountable for it (T 3.3.1.4/575). This claim is part of Hume’s more general claim that our indirect passions (including our moral sentiments) are aroused and sustained only when the pleasurable or painful qualities concerned (e.g. the virtues and vices) stand in a durable or constant relation with the person who is their object (T 2.1.6.7/292–3; DP 2.11). In the case of actions, which are “temporary and perishing”, no such lasting relation is involved unless action is suitably tied to character traits of some kind. Two important issues arise out of this that need to be carefully distinguished.\n\n(1) Does Hume hold that all aspects of virtue for which a person is subject to moral evaluation (i.e., approval and disapproval) must be voluntarily expressed? That is to say, are virtues and vices to be assessed entirely on the basis of an agent’s deliberate choices and intentional actions?\n(2) Granted that virtues and vices are to be understood in terms of a person’s pleasant or painful qualities of mind, to what extent are these traits of character voluntarily acquired (i.e., acquired through the agent’s own will and choices)?\n\nHume’s answer to both questions is clear. He denies that voluntary or intentional action is the sole basis on which we may assess a person’s virtues and vices. Furthermore he also maintains that moral character is, for the most part, involuntarily acquired. The second claim does not, of course, commit him to the first. Nor does the first commit him to the second, since a person could voluntarily acquire traits that, once acquired, may be involuntarily expressed or manifest. Plainly the combination of claims that Hume embraces on this issue commits him to a position that radically deflates the significance and importance of voluntariness in relation to virtue – certainly in comparison with some familiar alternative accounts (e.g. as in Aristotle).\nLet us consider, first, the relevance of voluntariness to the expression of character. As we have already noted, Hume does take the view that actions serve as the principal way in which we learn about a person’s character (T 3.3.1.5/575). Action is produced by the causal influence of our desires and willings. The interpretation and evaluation of action must, therefore, take note of the particular intention with which an action was undertaken. Failing this, we are liable to attribute character traits to the agent that he does not possess (and consequently unjustly praise or blame him). Although intention and action do have a significant and important role to play in the assessment of moral character, Hume also maintains that there are other channels through which character may be expressed. More specifically, a virtuous or vicious character can be distinguished by reference to a person’s “wishes and sentiments,” as well as by the nature of the person’s will (T 3.3.1.5/575). Feelings, desires and sentiments manifest themselves in a wide variety of ways – not just through willing and acting. A person’s “countenance and conversation” (T 2.1.11.3/317), deportment or “carriage” (EU 8.15/88), gestures (EU 8.9/85), or simply her look and expression, may all serve as signs of character and qualities of mind that may be found to be pleasant or painful. Although we may enjoy some limited degree of control over our desires and passions, as well as how they are expressed, for the most part our emotional states and attitudes arise in us involuntarily and may even be manifest or expressed against our will.\nWe may now turn to the further question concerning Hume’s understanding of the way in which virtues and vices are acquired and, in particular, to what extent they are shaped and conditioned by our own choices. It is Hume’s view that, by and large, our character is conditioned and determined by factors independent of our will. In the sections “Of liberty and necessity” (T 2.3.1–2; EU 8) he argues that not only do we observe how certain characters will act in specific circumstances, we also observe how circumstances condition character. Among the factors that determine character, he claims, are bodily condition, age, sex, occupation and social station, climate, religion, government, and education (T 2.3.1.5–10/401–03; EU 8.7–15/83–8; see esp. EU 8.11/85–6: “Are the manners ...”). These various causal influences account for “the diversity of characters, prejudices, and opinions” (EU 8.10/85). Any accurate moral philosophy, it is argued, must acknowledge and take note of the forces that “mould the human mind from its infancy” and which account for “the gradual change in our sentiments and inclinations” through time (EU 8.11/86). The general force of these observations is to establish that “the fabric and constitution of our mind no more depends on our choice, than that of our body” (ESY 168; see also T 3.3.4.3/608; ESY 140, 160, 579).\nCritics of Hume’s position on this subject will argue that if a person has little or no control over the factors that shape her character then virtue and vice really would be, in these circumstances, matters of mere good or bad fortune and no more a basis for moral concern than bodily beauty or ugliness. (See Reid 1969: 261: “What was, by an ancient author, said of Cato…”.) If people are responsible for the character that their actions and feelings express, then they must have acquired that character voluntarily. Hume’s reply to this line of criticism is that we can perfectly well distinguish virtue and vice without making any reference to the way that character is acquired. Our moral sentiments are reactions or responses to the moral qualities and character traits that people manifest in their behavior and conduct, and thus need not be withdrawn simply because people do not choose or voluntarily acquire these moral characteristics. Hume does recognize, of course, that we do have some limited ability to amend and alter our character. In particular, Hume acknowledges that we can cultivate and improve our moral character, in some measure, through self-criticism and self-understanding. Nevertheless, the points he emphasizes are that all such efforts are limited in their scope and effect (ESY 169) and that, beyond this, “a man must be, before-hand, tolerably virtuous” for such efforts of “reformation” to be undertaken in the first place.\nHume’s views about the relationship between virtue and voluntariness do much to explain one of the most controversial aspects of his theory of virtue: his view that the natural abilities should be incorporated into the virtues and vices (T 3.3.4; EM App 4). With respect to this issue he makes two key points. The first is that natural abilities (i.e., intelligence, imagination, memory, wit, etc.) and moral virtues more narrowly understood are “equally mental qualities” (T 3.3.4.1/606). Second, both of them “equally produce pleasure” and thus have “an equal tendency to produce the love and esteem of mankind” (T 3.3.4.1/606–07). In common life, people “naturally praise or blame whatever pleases or displeases them and thus regard penetration as much a virtue as justice” (T 3.3.4.4/609). (See, e.g., Hume’s sardonic observation at EM App. 4.5/315: “It is hard to tell...”) Beyond all this, as already noted, any distinction between the natural abilities and moral virtues cannot be based on the consideration that the natural abilities are for the most part involuntarily acquired, since this also holds true for the moral virtues more narrowly conceived. It is, nevertheless, Hume’s view that the voluntary/involuntary distinction helps to explain “why moralists have invented” the distinction between natural abilities and moral virtues. Unlike moral qualities, natural abilities “are almost invariable by any art or industry” (T 3.3.4.4/609). In contrast with this, moral qualities, “or at least, the actions that proceed from them, may be chang’d by the motives of rewards and punishments, praise and blame” (T 3.3.4.4/609). In this way, according to Hume, the significance of the voluntary/involuntary distinction is largely limited to our concern with the regulation of conduct in society. To confine our understanding of virtue and vice to these frontiers is, however, to distort and misrepresent its very nature and foundation in human life and experience. (For more on Hume’s views on virtue in relation to his position on free will see Russell, 2013.)\nThese observations regarding Hume and the doctrine of voluntarism are of considerable relevance to the contemporary ethical debate as it concerns what Bernard Williams has described as “the morality system” (Williams, 1985: Chp. 10). Although Williams’ (hostile) account of the morality system is multifaceted and defies easy summary, its core features are clear enough. The concept that Williams identifies as fundamental to the morality system is its special notion of obligation. Flowing from this special concept of obligation are the related concepts of right and wrong, blame and voluntariness. When agents voluntarily violate their obligations they do wrong and are liable to blame and some measure of retribution. To this extent the morality system, so conceived, involves what Williams calls “the blame system”, which focuses on particular acts (Williams, 1985: 194). According to Williams there is pressure within the blame system “to require a voluntariness that will be total and will cut through character and psychological or social determinism, and allocate blame and responsibility on the ultimately fair basis of the agent’s own contribution, no more and no less” (Williams, 1985: 194).\nOne reason why the morality system places great weight on the importance of voluntariness is that it aspires to show that morality – and moral responsibility in particular – somehow “transcends luck” (Williams, 1985: 195). This is required to ensure that blame is allocated in a way that is “ultimately fair”. Despite the obvious challenges this requirement poses, compatibilists have typically tried to satisfy these aspiration of the morality system by way of offering a variety of argument to show that compatibilist commitments do not render us vulnerable to the play of fate or luck in our moral lives (e.g. Dennett, 1984). Hume, however, makes little effort to satisfy these aspirations. (A point that Williams notes in Williams, 1995: 20n12.) In the final analysis, Hume claims, just as every body or material object “is determin’d by an absolute fate to a certain degree and direction of its motion, and can no more depart from that precise line, in which it moves, than it can convert itself into an angel, or spirit, or any superior substance” (T 2.3.1.3/400), so too our conduct and character is similarly subject to an “absolute fate” as understood in terms of the inescapable “bonds of necessity” (T 2.3.2.2/408). In these fundamental respects, therefore, Hume takes the view, along with Williams, that morality does not elude either fate or luck. In this Hume, perhaps, shares more with the ancient Greeks than he does with those moderns who embrace the aspirations of the morality system (see, e.g., Williams, 1993).\n",
    "section_title": "4. Virtue, Luck and “the Morality System”",
    "entry_title": "Hume on Free Will",
    "hierarchy_title": "Hume on Free Will || Virtue, Luck and “the Morality System”",
    "tokenized_text": [
        "virtue",
        "luck",
        "morality",
        "system",
        "virtue",
        "luck",
        "morality",
        "system",
        "noted",
        "classical",
        "naturalistic",
        "interpretation",
        "differ",
        "account",
        "relationship",
        "freedom",
        "responsibility",
        "according",
        "classical",
        "interpretation",
        "responsibility",
        "may",
        "analysed",
        "directly",
        "term",
        "free",
        "action",
        "understood",
        "simply",
        "term",
        "agent",
        "acting",
        "according",
        "desire",
        "classical",
        "compatibilists",
        "reject",
        "incompatibilist",
        "suggestion",
        "free",
        "responsible",
        "action",
        "requires",
        "indeterminism",
        "special",
        "form",
        "moral",
        "causation",
        "nevertheless",
        "agreed",
        "person",
        "held",
        "responsible",
        "act",
        "freely",
        "naturalistic",
        "interpretation",
        "however",
        "hume",
        "reject",
        "general",
        "doctrine",
        "may",
        "call",
        "voluntarism",
        "hume",
        "maintains",
        "matter",
        "utmost",
        "importance",
        "moral",
        "philosophy",
        "action",
        "must",
        "indicative",
        "durable",
        "quality",
        "mind",
        "person",
        "held",
        "accountable",
        "claim",
        "part",
        "hume",
        "general",
        "claim",
        "indirect",
        "passion",
        "including",
        "moral",
        "sentiment",
        "aroused",
        "sustained",
        "pleasurable",
        "painful",
        "quality",
        "concerned",
        "eg",
        "virtue",
        "vice",
        "stand",
        "durable",
        "constant",
        "relation",
        "person",
        "object",
        "dp",
        "case",
        "action",
        "temporary",
        "perishing",
        "lasting",
        "relation",
        "involved",
        "unless",
        "action",
        "suitably",
        "tied",
        "character",
        "trait",
        "kind",
        "two",
        "important",
        "issue",
        "arise",
        "need",
        "carefully",
        "distinguished",
        "hume",
        "hold",
        "aspect",
        "virtue",
        "person",
        "subject",
        "moral",
        "evaluation",
        "ie",
        "approval",
        "disapproval",
        "must",
        "voluntarily",
        "expressed",
        "say",
        "virtue",
        "vice",
        "assessed",
        "entirely",
        "basis",
        "agent",
        "deliberate",
        "choice",
        "intentional",
        "action",
        "granted",
        "virtue",
        "vice",
        "understood",
        "term",
        "person",
        "pleasant",
        "painful",
        "quality",
        "mind",
        "extent",
        "trait",
        "character",
        "voluntarily",
        "acquired",
        "ie",
        "acquired",
        "agent",
        "choice",
        "hume",
        "answer",
        "question",
        "clear",
        "denies",
        "voluntary",
        "intentional",
        "action",
        "sole",
        "basis",
        "may",
        "ass",
        "person",
        "virtue",
        "vice",
        "furthermore",
        "also",
        "maintains",
        "moral",
        "character",
        "part",
        "involuntarily",
        "acquired",
        "second",
        "claim",
        "course",
        "commit",
        "first",
        "first",
        "commit",
        "second",
        "since",
        "person",
        "could",
        "voluntarily",
        "acquire",
        "trait",
        "acquired",
        "may",
        "involuntarily",
        "expressed",
        "manifest",
        "plainly",
        "combination",
        "claim",
        "hume",
        "embrace",
        "issue",
        "commits",
        "position",
        "radically",
        "deflates",
        "significance",
        "importance",
        "voluntariness",
        "relation",
        "virtue",
        "certainly",
        "comparison",
        "familiar",
        "alternative",
        "account",
        "eg",
        "aristotle",
        "let",
        "u",
        "consider",
        "first",
        "relevance",
        "voluntariness",
        "expression",
        "character",
        "already",
        "noted",
        "hume",
        "take",
        "view",
        "action",
        "serve",
        "principal",
        "way",
        "learn",
        "person",
        "character",
        "action",
        "produced",
        "causal",
        "influence",
        "desire",
        "willing",
        "interpretation",
        "evaluation",
        "action",
        "must",
        "therefore",
        "take",
        "note",
        "particular",
        "intention",
        "action",
        "undertaken",
        "failing",
        "liable",
        "attribute",
        "character",
        "trait",
        "agent",
        "posse",
        "consequently",
        "unjustly",
        "praise",
        "blame",
        "although",
        "intention",
        "action",
        "significant",
        "important",
        "role",
        "play",
        "assessment",
        "moral",
        "character",
        "hume",
        "also",
        "maintains",
        "channel",
        "character",
        "may",
        "expressed",
        "specifically",
        "virtuous",
        "vicious",
        "character",
        "distinguished",
        "reference",
        "person",
        "wish",
        "sentiment",
        "well",
        "nature",
        "person",
        "feeling",
        "desire",
        "sentiment",
        "manifest",
        "wide",
        "variety",
        "way",
        "willing",
        "acting",
        "person",
        "countenance",
        "conversation",
        "deportment",
        "carriage",
        "eu",
        "gesture",
        "eu",
        "simply",
        "look",
        "expression",
        "may",
        "serve",
        "sign",
        "character",
        "quality",
        "mind",
        "may",
        "found",
        "pleasant",
        "painful",
        "although",
        "may",
        "enjoy",
        "limited",
        "degree",
        "control",
        "desire",
        "passion",
        "well",
        "expressed",
        "part",
        "emotional",
        "state",
        "attitude",
        "arise",
        "u",
        "involuntarily",
        "may",
        "even",
        "manifest",
        "expressed",
        "may",
        "turn",
        "question",
        "concerning",
        "hume",
        "understanding",
        "way",
        "virtue",
        "vice",
        "acquired",
        "particular",
        "extent",
        "shaped",
        "conditioned",
        "choice",
        "hume",
        "view",
        "large",
        "character",
        "conditioned",
        "determined",
        "factor",
        "independent",
        "section",
        "liberty",
        "necessity",
        "eu",
        "argues",
        "observe",
        "certain",
        "character",
        "act",
        "specific",
        "circumstance",
        "also",
        "observe",
        "circumstance",
        "condition",
        "character",
        "among",
        "factor",
        "determine",
        "character",
        "claim",
        "bodily",
        "condition",
        "age",
        "sex",
        "occupation",
        "social",
        "station",
        "climate",
        "religion",
        "government",
        "education",
        "eu",
        "see",
        "esp",
        "eu",
        "manner",
        "various",
        "causal",
        "influence",
        "account",
        "diversity",
        "character",
        "prejudice",
        "opinion",
        "eu",
        "accurate",
        "moral",
        "philosophy",
        "argued",
        "must",
        "acknowledge",
        "take",
        "note",
        "force",
        "mould",
        "human",
        "mind",
        "infancy",
        "account",
        "gradual",
        "change",
        "sentiment",
        "inclination",
        "time",
        "eu",
        "general",
        "force",
        "observation",
        "establish",
        "fabric",
        "constitution",
        "mind",
        "depends",
        "choice",
        "body",
        "esy",
        "see",
        "also",
        "esy",
        "critic",
        "hume",
        "position",
        "subject",
        "argue",
        "person",
        "little",
        "control",
        "factor",
        "shape",
        "character",
        "virtue",
        "vice",
        "really",
        "would",
        "circumstance",
        "matter",
        "mere",
        "good",
        "bad",
        "fortune",
        "basis",
        "moral",
        "concern",
        "bodily",
        "beauty",
        "ugliness",
        "see",
        "reid",
        "ancient",
        "author",
        "said",
        "cato",
        "people",
        "responsible",
        "character",
        "action",
        "feeling",
        "express",
        "must",
        "acquired",
        "character",
        "voluntarily",
        "hume",
        "reply",
        "line",
        "criticism",
        "perfectly",
        "well",
        "distinguish",
        "virtue",
        "vice",
        "without",
        "making",
        "reference",
        "way",
        "character",
        "acquired",
        "moral",
        "sentiment",
        "reaction",
        "response",
        "moral",
        "quality",
        "character",
        "trait",
        "people",
        "manifest",
        "behavior",
        "conduct",
        "thus",
        "need",
        "withdrawn",
        "simply",
        "people",
        "choose",
        "voluntarily",
        "acquire",
        "moral",
        "characteristic",
        "hume",
        "recognize",
        "course",
        "limited",
        "ability",
        "amend",
        "alter",
        "character",
        "particular",
        "hume",
        "acknowledges",
        "cultivate",
        "improve",
        "moral",
        "character",
        "measure",
        "selfcriticism",
        "selfunderstanding",
        "nevertheless",
        "point",
        "emphasizes",
        "effort",
        "limited",
        "scope",
        "effect",
        "esy",
        "beyond",
        "man",
        "must",
        "beforehand",
        "tolerably",
        "virtuous",
        "effort",
        "reformation",
        "undertaken",
        "first",
        "place",
        "hume",
        "view",
        "relationship",
        "virtue",
        "voluntariness",
        "much",
        "explain",
        "one",
        "controversial",
        "aspect",
        "theory",
        "virtue",
        "view",
        "natural",
        "ability",
        "incorporated",
        "virtue",
        "vice",
        "em",
        "app",
        "respect",
        "issue",
        "make",
        "two",
        "key",
        "point",
        "first",
        "natural",
        "ability",
        "ie",
        "intelligence",
        "imagination",
        "memory",
        "wit",
        "etc",
        "moral",
        "virtue",
        "narrowly",
        "understood",
        "equally",
        "mental",
        "quality",
        "second",
        "equally",
        "produce",
        "pleasure",
        "thus",
        "equal",
        "tendency",
        "produce",
        "love",
        "esteem",
        "mankind",
        "common",
        "life",
        "people",
        "naturally",
        "praise",
        "blame",
        "whatever",
        "plea",
        "displeases",
        "thus",
        "regard",
        "penetration",
        "much",
        "virtue",
        "justice",
        "see",
        "eg",
        "hume",
        "sardonic",
        "observation",
        "em",
        "app",
        "hard",
        "tell",
        "beyond",
        "already",
        "noted",
        "distinction",
        "natural",
        "ability",
        "moral",
        "virtue",
        "based",
        "consideration",
        "natural",
        "ability",
        "part",
        "involuntarily",
        "acquired",
        "since",
        "also",
        "hold",
        "true",
        "moral",
        "virtue",
        "narrowly",
        "conceived",
        "nevertheless",
        "hume",
        "view",
        "voluntaryinvoluntary",
        "distinction",
        "help",
        "explain",
        "moralist",
        "invented",
        "distinction",
        "natural",
        "ability",
        "moral",
        "virtue",
        "unlike",
        "moral",
        "quality",
        "natural",
        "ability",
        "almost",
        "invariable",
        "art",
        "industry",
        "contrast",
        "moral",
        "quality",
        "least",
        "action",
        "proceed",
        "may",
        "chang",
        "motif",
        "reward",
        "punishment",
        "praise",
        "blame",
        "way",
        "according",
        "hume",
        "significance",
        "voluntaryinvoluntary",
        "distinction",
        "largely",
        "limited",
        "concern",
        "regulation",
        "conduct",
        "society",
        "confine",
        "understanding",
        "virtue",
        "vice",
        "frontier",
        "however",
        "distort",
        "misrepresent",
        "nature",
        "foundation",
        "human",
        "life",
        "experience",
        "hume",
        "view",
        "virtue",
        "relation",
        "position",
        "free",
        "see",
        "russell",
        "observation",
        "regarding",
        "hume",
        "doctrine",
        "voluntarism",
        "considerable",
        "relevance",
        "contemporary",
        "ethical",
        "debate",
        "concern",
        "bernard",
        "williams",
        "described",
        "morality",
        "system",
        "williams",
        "chp",
        "although",
        "williams",
        "hostile",
        "account",
        "morality",
        "system",
        "multifaceted",
        "defies",
        "easy",
        "summary",
        "core",
        "feature",
        "clear",
        "enough",
        "concept",
        "williams",
        "identifies",
        "fundamental",
        "morality",
        "system",
        "special",
        "notion",
        "obligation",
        "flowing",
        "special",
        "concept",
        "obligation",
        "related",
        "concept",
        "right",
        "wrong",
        "blame",
        "voluntariness",
        "agent",
        "voluntarily",
        "violate",
        "obligation",
        "wrong",
        "liable",
        "blame",
        "measure",
        "retribution",
        "extent",
        "morality",
        "system",
        "conceived",
        "involves",
        "williams",
        "call",
        "blame",
        "system",
        "focus",
        "particular",
        "act",
        "williams",
        "according",
        "williams",
        "pressure",
        "within",
        "blame",
        "system",
        "require",
        "voluntariness",
        "total",
        "cut",
        "character",
        "psychological",
        "social",
        "determinism",
        "allocate",
        "blame",
        "responsibility",
        "ultimately",
        "fair",
        "basis",
        "agent",
        "contribution",
        "le",
        "williams",
        "one",
        "reason",
        "morality",
        "system",
        "place",
        "great",
        "weight",
        "importance",
        "voluntariness",
        "aspires",
        "show",
        "morality",
        "moral",
        "responsibility",
        "particular",
        "somehow",
        "transcends",
        "luck",
        "williams",
        "required",
        "ensure",
        "blame",
        "allocated",
        "way",
        "ultimately",
        "fair",
        "despite",
        "obvious",
        "challenge",
        "requirement",
        "pose",
        "compatibilists",
        "typically",
        "tried",
        "satisfy",
        "aspiration",
        "morality",
        "system",
        "way",
        "offering",
        "variety",
        "argument",
        "show",
        "compatibilist",
        "commitment",
        "render",
        "u",
        "vulnerable",
        "play",
        "fate",
        "luck",
        "moral",
        "life",
        "eg",
        "dennett",
        "hume",
        "however",
        "make",
        "little",
        "effort",
        "satisfy",
        "aspiration",
        "point",
        "williams",
        "note",
        "williams",
        "n",
        "final",
        "analysis",
        "hume",
        "claim",
        "every",
        "body",
        "material",
        "object",
        "determin",
        "absolute",
        "fate",
        "certain",
        "degree",
        "direction",
        "motion",
        "depart",
        "precise",
        "line",
        "move",
        "convert",
        "angel",
        "spirit",
        "superior",
        "substance",
        "conduct",
        "character",
        "similarly",
        "subject",
        "absolute",
        "fate",
        "understood",
        "term",
        "inescapable",
        "bond",
        "necessity",
        "fundamental",
        "respect",
        "therefore",
        "hume",
        "take",
        "view",
        "along",
        "williams",
        "morality",
        "elude",
        "either",
        "fate",
        "luck",
        "hume",
        "perhaps",
        "share",
        "ancient",
        "greek",
        "modern",
        "embrace",
        "aspiration",
        "morality",
        "system",
        "see",
        "eg",
        "williams"
    ]
}