{
    "main_text": "Hutcheson’s Metaethics || Attack on Rationalism\n1.4 Attack on Rationalism\n\nHowever we understand the ontological status of moral properties in\nHutcheson’s sentimentalism, it is clear that Hutcheson made it\nhis business to insist that the foundation of morality is not\nto be found in our rational capacities, or capacities for the\ndetermination of truth and reason (see Gill 2006: ch. 12). This put\nHutcheson at odds with his rationalist contemporaries, most\nimportantly John Balguy, Samuel Clarke, and William Wollaston. In the\nIllustrations on the Moral Sense (which was published with\nthe Essay), Hutcheson offers a sustained critique of these\nauthors and other forms of rationalism (cf. Essay,\n137–155).\n\nAt this point, however, it would\ndo to say a little bit about how rationalism is understood by\nHutcheson’s interlocutors. According to Clarke, the virtue\nand/or vice of particular actions is determined by the “eternal\nrelations” of “fitness and unfitness”. More\nspecifically, Clarke writes: \n\n\nthere is a fitness or suitableness of certain circumstances to certain\npersons, and an unsuitableness of others; founded in the nature of\nthings and the qualifications of persons, antecedent to all positive\nappointment whatsoever; also that from the different relations of\ndifferent person one to another, there necessarily arises a fitness or\nunfitness of certain manners of behaviour of some persons towards\nothers: it is as manifest, as that the properties which flow from the\nessences of different mathematical figures, have different congruities\nor incongruities between themselves; or that, in mechanics, certain\nweights or powers have very different forces…. (Clarke 1706\n[BM: 192–3]) \n\n\nOne way in which this “fitness” seems to work, for Clarke,\nis that there is a “fitness” in humans worshiping God;\nthere is a “fitness” in behaving benevolently toward\nothers, and so forth. But these “fitnesses” are not known\nvia, nor are they the product of, any moral sense—they\nare “eternal and immutable” and are discoverable by\nrational inquiry.\n\nBalguy, another rationalist, takes a somewhat different approach.\nAccording to Balguy, \n\n\nVIRTUE, or moral goodness, is the conformity of our moral\nactions to the reasons of things. VICE the contrary…The\nCONFORMITY of such actions to REASON, or the RECTITUDE of them, is\ntheir agreeableness to the nature and circumstances of the agents and\ntheir objects.—A social action is then right,\nwhen it is suitable to the nature and relations of the person\nconcerned. Thus a person obliged acts rightly and\nreasonably, when his actions are answerable to the relation\nof gratitude between him and his benefactor. (Balguy 1728 [BM:\n398]) \n\n\nFinally, Wollaston suggests a different variety of rationalism,\naccording to which the rightness and wrongness of action is determined\nby their interference or otherwise with “truth”. Wollaston\nwrites:\n\n\nI lay this down then as as fundamental maxim, that whoever acts as\nif things were so, or not so, doth by his acts declare, that they are\nso, or not so; as plainly as he could by words, and with more\nreality…No act (whether word or deed) of any\nbeing, to whom moral good and evil are imputable, that interferes with\nany true proposition, or denies any thing to be as it is, can be\nright…Every act therefore of such a being, as\nis before described, and all those omissions, which interfere with\ntruth (i.e., deny any proposition to be true, which is true; or\nsuppose any thing not to be what it is, in any regard) are morally\nevil, in some degree or other: the forbearing such acts, and the\nacting in opposition to such omissions are morally good: and when any\nthing may be either done, or not done, equally without the violation\nof true, that thing is indifferent. (Wollaston 1724 [BM: 243, 250])\n\n\nIn each case, the rationalist seems to suggest that there are certain\nactions that, antecedent to our approval of them, or\nsentiments toward them, have certain qualities, i.e., they are\nreasonable, fit, true, and so forth. However, Hutcheson believes that\nall such positions are fundamentally confused. His general line of\nattack on rationalism is to disambiguate a number of potential\nreadings of rationalism, showing that each is either absurd on its\nface, or else surreptitiously relies on the existence of a moral sense\nor sentiment. “But what”, asks Hutcheson, “is this\nConformity of Actions to Reason?” (Here he clearly has\nin mind the view championed by Balguy.) And here he provides two\npossible answers. \n\n\nWhen we ask the Reason of an Action we sometimes mean, “What\ntruth shews a Quality in the Action, exciting the Agent to do\nit?” Thus, why does a Luxurious Man pursue\nWealth? The Reason is given by this Truth, “Wealth is\nuseful to purchase Pleasures”. (Essay, 138) \n\n\nAlternatively, Hutcheson distinguishes another way an action might be\nconformable to reason: \n\n\nSometimes for a Reason of Actions we shew the truth expressing a\nQuality, engaging our Approbation. Thus the Reason of\nhazarding Life in just War, is, that ‘it tends to preserve our\nhonest Countrymen, or evidences publick Spirit…The former sort\nof Reasons we will call exciting, and the latter\njustifying. (Essay, 138) \n\n\nHere Hutcheson is making reference to the, now commonplace,\ndistinction between explanatory reasons (i.e., why did a person do\nsuch a thing? what was her motivation?) and normative reasons (i.e.,\nwhy should this person have done that thing? what does this thing have\nto say for itself?, and so on).\n\nIn examining the nature of exciting reasons, Hutcheson rejects the\nclaim that such reasons could be antecedent to our sentiments or\naffections. For Hutcheson, our motivations must be a result of our\naffections, and cannot arise without them.\n\nWhen it comes to justifying reasons, Hutcheson believes that one\ncannot genuinely justify an action without reference to a moral sense.\nAs Hutcheson notes, one cannot justify an action simply by noting that\nit conforms to a true proposition, as this would justify every\npossible action (Essay, 144). Furthermore, even if we focus\non particular truths that may be said about particular\nactions (such as, e.g., “a Truth shewing an Action to be fit to\nattain an End”), these truths do not genuinely justify\nwithout some reference to the moral quality of the end\nitself. But for this we must advert to a moral sense. Simply\ndiscerning truths about particular ends will not tell us whether those\nends are morally justified:\n\n\nWe have got some strange Phrases, “that some things are\nantecedently reasonable in the Nature of the thing”, which\nsome insist upon: “That otherwise, they say, if before Man was\ncreated, any Nature without a moral Sense had existed, this\nNature would not have approved as morally good in the Deity, his\nconstituting our Sense as it is as present”. Very true; and what\nnext? If there had been no moral Sense in that Nature, there\nwould have been no Perception of Morality. But “could\nnot such Natures have seen something reasonable in one\nConstitution more than in another?”…They would have\nreasoned about both, and found out Truths:\nare both Constitutions alike reasonable to these Observers?\nNo, they say, “the benevolent one is\nreasonable, and the malicious unreasonable:”\nAnd yet these Observers reasoned and discovered\nTruths about both: An Action then is called by us\nreasonable when ’tis benevolent, and\nunreasonable when malicious. This is plainly making\nthe Word reasonable denote whatever is approved by\nour moral Sense, without Relation to true Propositions.\n(Essay, 153–4)\n\n\nHutcheson also spends considerable time examining the positions of\nClarke and Wollaston in detail. For Clarke, moral distinctions derive\nfrom the relations of fitness and unfitness, which are themselves\neternal. For Hutcheson, any construal of such relations as morally\nsignificant must presuppose a moral sense. As Hutcheson notes, we do\nnot morally praise the relations between, e.g., the natural numbers as\nin mathematics, or the fitness of certain chemical compositions. The\nfitness of a sword to end someone’s life is in and of itself\nmorally neutral. And the fitness of an action to its end is also\nmorally neutral—some actions are just as fit to human misery as\nother actions are fit to human happiness. Of course, one might hold\nthat the fitness relation is simply to be applied (in a morally\ninteresting sense) to the ultimate end of action. Happiness, in other\nwords, is “fit”; misery “unfit”. But,\naccording to Hutcheson, what does this mean? It cannot be\n“fit” to, say, give rise to some other\nthing—that’s what makes it an ultimate end. But\nany explication that would render some particular end as\n“fit” seems, according to Hutcheson to presuppose an\nindependent evaluation beyond its “fitness”.\n(Though for a reading of Hutcheson that suggests significant\ncontinuity between Hutcheson and Clarke, see Sheridan 2007.)\n\nHutcheson saves his most biting criticism for Wollaston’s view,\nhowever. According to Hutcheson, there is no plausibility to be had\nthat moral distinctions can be derived by the tendencies of our\nactions to signify truth or falsity. Depending upon what one\nunderstands to be “significance”, or how one understands\nWollaston’s “[acting] as if things were so, or not\nso”, we would declare as immoral such benign acts as leaving\none’s lights on at night, or traveling, as a noble,\n“without Coronets”, or walking in plainclothes despite\nbeing clergy, or writing plays or “Epicks”\n(Essay, 164–66). In addition, according to Hutcheson,\nWollaston’s system cannot distinguish between degrees of virtue\nor vice. Assuming it makes some sense to say that particular actions\nsignify truth or falsehood, this appears to be a binary\nproperty—it either does or does not. But virtue is scalar: some\nactions are horribly vicious, others are heroic, others are relatively\nmorally insignificant (Essay, 170; see also\n §2.2).\n Ultimately, then, Hutcheson concludes that Wollaston (and every other\nrationalist he considers) is really smuggling in some sort of moral\nsense in disguise, whether this is by means of a reference to the\n“reasonableness” of particular actions, a reference to\ntheir “fitness” or reference to their “significance\nof truth or falsity”.\n",
    "section_title": "1.4 Attack on Rationalism",
    "entry_title": "Francis Hutcheson",
    "hierarchy_title": "Francis Hutcheson || Hutcheson’s Metaethics || Attack on Rationalism",
    "tokenized_text": [
        "hutcheson",
        "metaethics",
        "attack",
        "rationalism",
        "attack",
        "rationalism",
        "however",
        "understand",
        "ontological",
        "status",
        "moral",
        "property",
        "hutcheson",
        "sentimentalism",
        "clear",
        "hutcheson",
        "made",
        "business",
        "insist",
        "foundation",
        "morality",
        "found",
        "rational",
        "capacity",
        "capacity",
        "determination",
        "truth",
        "reason",
        "see",
        "gill",
        "ch",
        "put",
        "hutcheson",
        "odds",
        "rationalist",
        "contemporary",
        "importantly",
        "john",
        "balguy",
        "samuel",
        "clarke",
        "william",
        "wollaston",
        "illustration",
        "moral",
        "sense",
        "published",
        "essay",
        "hutcheson",
        "offer",
        "sustained",
        "critique",
        "author",
        "form",
        "rationalism",
        "cf",
        "essay",
        "point",
        "however",
        "would",
        "say",
        "little",
        "bit",
        "rationalism",
        "understood",
        "hutcheson",
        "interlocutor",
        "according",
        "clarke",
        "virtue",
        "andor",
        "vice",
        "particular",
        "action",
        "determined",
        "eternal",
        "relation",
        "fitness",
        "unfitness",
        "specifically",
        "clarke",
        "writes",
        "fitness",
        "suitableness",
        "certain",
        "circumstance",
        "certain",
        "person",
        "unsuitableness",
        "others",
        "founded",
        "nature",
        "thing",
        "qualification",
        "person",
        "antecedent",
        "positive",
        "appointment",
        "whatsoever",
        "also",
        "different",
        "relation",
        "different",
        "person",
        "one",
        "another",
        "necessarily",
        "arises",
        "fitness",
        "unfitness",
        "certain",
        "manner",
        "behaviour",
        "person",
        "towards",
        "others",
        "manifest",
        "property",
        "flow",
        "essence",
        "different",
        "mathematical",
        "figure",
        "different",
        "congruity",
        "incongruity",
        "mechanic",
        "certain",
        "weight",
        "power",
        "different",
        "forces",
        "clarke",
        "bm",
        "one",
        "way",
        "fitness",
        "seems",
        "work",
        "clarke",
        "fitness",
        "human",
        "worshiping",
        "god",
        "fitness",
        "behaving",
        "benevolently",
        "toward",
        "others",
        "forth",
        "fitness",
        "known",
        "via",
        "product",
        "moral",
        "sensethey",
        "eternal",
        "immutable",
        "discoverable",
        "rational",
        "inquiry",
        "balguy",
        "another",
        "rationalist",
        "take",
        "somewhat",
        "different",
        "approach",
        "according",
        "balguy",
        "virtue",
        "moral",
        "goodness",
        "conformity",
        "moral",
        "action",
        "reason",
        "thing",
        "vice",
        "contrarythe",
        "conformity",
        "action",
        "reason",
        "rectitude",
        "agreeableness",
        "nature",
        "circumstance",
        "agent",
        "objectsa",
        "social",
        "action",
        "right",
        "suitable",
        "nature",
        "relation",
        "person",
        "concerned",
        "thus",
        "person",
        "obliged",
        "act",
        "rightly",
        "reasonably",
        "action",
        "answerable",
        "relation",
        "gratitude",
        "benefactor",
        "balguy",
        "bm",
        "finally",
        "wollaston",
        "suggests",
        "different",
        "variety",
        "rationalism",
        "according",
        "rightness",
        "wrongness",
        "action",
        "determined",
        "interference",
        "otherwise",
        "truth",
        "wollaston",
        "writes",
        "lay",
        "fundamental",
        "maxim",
        "whoever",
        "act",
        "thing",
        "doth",
        "act",
        "declare",
        "plainly",
        "could",
        "word",
        "realityno",
        "act",
        "whether",
        "word",
        "deed",
        "moral",
        "good",
        "evil",
        "imputable",
        "interferes",
        "true",
        "proposition",
        "denies",
        "thing",
        "rightevery",
        "act",
        "therefore",
        "described",
        "omission",
        "interfere",
        "truth",
        "ie",
        "deny",
        "proposition",
        "true",
        "true",
        "suppose",
        "thing",
        "regard",
        "morally",
        "evil",
        "degree",
        "forbearing",
        "act",
        "acting",
        "opposition",
        "omission",
        "morally",
        "good",
        "thing",
        "may",
        "either",
        "done",
        "done",
        "equally",
        "without",
        "violation",
        "true",
        "thing",
        "indifferent",
        "wollaston",
        "bm",
        "case",
        "rationalist",
        "seems",
        "suggest",
        "certain",
        "action",
        "antecedent",
        "approval",
        "sentiment",
        "toward",
        "certain",
        "quality",
        "ie",
        "reasonable",
        "fit",
        "true",
        "forth",
        "however",
        "hutcheson",
        "belief",
        "position",
        "fundamentally",
        "confused",
        "general",
        "line",
        "attack",
        "rationalism",
        "disambiguate",
        "number",
        "potential",
        "reading",
        "rationalism",
        "showing",
        "either",
        "absurd",
        "face",
        "else",
        "surreptitiously",
        "relies",
        "existence",
        "moral",
        "sense",
        "sentiment",
        "asks",
        "hutcheson",
        "conformity",
        "action",
        "reason",
        "clearly",
        "mind",
        "view",
        "championed",
        "balguy",
        "provides",
        "two",
        "possible",
        "answer",
        "ask",
        "reason",
        "action",
        "sometimes",
        "mean",
        "truth",
        "shews",
        "quality",
        "action",
        "exciting",
        "agent",
        "thus",
        "luxurious",
        "man",
        "pursue",
        "wealth",
        "reason",
        "given",
        "truth",
        "wealth",
        "useful",
        "purchase",
        "pleasure",
        "essay",
        "alternatively",
        "hutcheson",
        "distinguishes",
        "another",
        "way",
        "action",
        "might",
        "conformable",
        "reason",
        "sometimes",
        "reason",
        "action",
        "shew",
        "truth",
        "expressing",
        "quality",
        "engaging",
        "approbation",
        "thus",
        "reason",
        "hazarding",
        "life",
        "war",
        "tends",
        "preserve",
        "honest",
        "countryman",
        "evidence",
        "publick",
        "spiritthe",
        "former",
        "sort",
        "reason",
        "call",
        "exciting",
        "latter",
        "justifying",
        "essay",
        "hutcheson",
        "making",
        "reference",
        "commonplace",
        "distinction",
        "explanatory",
        "reason",
        "ie",
        "person",
        "thing",
        "motivation",
        "normative",
        "reason",
        "ie",
        "person",
        "done",
        "thing",
        "thing",
        "say",
        "examining",
        "nature",
        "exciting",
        "reason",
        "hutcheson",
        "reject",
        "claim",
        "reason",
        "could",
        "antecedent",
        "sentiment",
        "affection",
        "hutcheson",
        "motivation",
        "must",
        "result",
        "affection",
        "arise",
        "without",
        "come",
        "justifying",
        "reason",
        "hutcheson",
        "belief",
        "one",
        "genuinely",
        "justify",
        "action",
        "without",
        "reference",
        "moral",
        "sense",
        "hutcheson",
        "note",
        "one",
        "justify",
        "action",
        "simply",
        "noting",
        "conforms",
        "true",
        "proposition",
        "would",
        "justify",
        "every",
        "possible",
        "action",
        "essay",
        "furthermore",
        "even",
        "focus",
        "particular",
        "truth",
        "may",
        "said",
        "particular",
        "action",
        "eg",
        "truth",
        "shewing",
        "action",
        "fit",
        "attain",
        "end",
        "truth",
        "genuinely",
        "justify",
        "without",
        "reference",
        "moral",
        "quality",
        "end",
        "must",
        "advert",
        "moral",
        "sense",
        "simply",
        "discerning",
        "truth",
        "particular",
        "end",
        "tell",
        "u",
        "whether",
        "end",
        "morally",
        "justified",
        "got",
        "strange",
        "phrase",
        "thing",
        "antecedently",
        "reasonable",
        "nature",
        "thing",
        "insist",
        "upon",
        "otherwise",
        "say",
        "man",
        "created",
        "nature",
        "without",
        "moral",
        "sense",
        "existed",
        "nature",
        "would",
        "approved",
        "morally",
        "good",
        "deity",
        "constituting",
        "sense",
        "present",
        "true",
        "next",
        "moral",
        "sense",
        "nature",
        "would",
        "perception",
        "morality",
        "could",
        "nature",
        "seen",
        "something",
        "reasonable",
        "one",
        "constitution",
        "another",
        "they",
        "would",
        "reasoned",
        "found",
        "truth",
        "constitution",
        "alike",
        "reasonable",
        "observer",
        "say",
        "benevolent",
        "one",
        "reasonable",
        "malicious",
        "unreasonable",
        "yet",
        "observer",
        "reasoned",
        "discovered",
        "truth",
        "action",
        "called",
        "u",
        "reasonable",
        "ti",
        "benevolent",
        "unreasonable",
        "malicious",
        "plainly",
        "making",
        "word",
        "reasonable",
        "denote",
        "whatever",
        "approved",
        "moral",
        "sense",
        "without",
        "relation",
        "true",
        "proposition",
        "essay",
        "hutcheson",
        "also",
        "spends",
        "considerable",
        "time",
        "examining",
        "position",
        "clarke",
        "wollaston",
        "detail",
        "clarke",
        "moral",
        "distinction",
        "derive",
        "relation",
        "fitness",
        "unfitness",
        "eternal",
        "hutcheson",
        "construal",
        "relation",
        "morally",
        "significant",
        "must",
        "presuppose",
        "moral",
        "sense",
        "hutcheson",
        "note",
        "morally",
        "praise",
        "relation",
        "eg",
        "natural",
        "number",
        "mathematics",
        "fitness",
        "certain",
        "chemical",
        "composition",
        "fitness",
        "sword",
        "end",
        "someone",
        "life",
        "morally",
        "neutral",
        "fitness",
        "action",
        "end",
        "also",
        "morally",
        "neutralsome",
        "action",
        "fit",
        "human",
        "misery",
        "action",
        "fit",
        "human",
        "happiness",
        "course",
        "one",
        "might",
        "hold",
        "fitness",
        "relation",
        "simply",
        "applied",
        "morally",
        "interesting",
        "sense",
        "ultimate",
        "end",
        "action",
        "happiness",
        "word",
        "fit",
        "misery",
        "unfit",
        "according",
        "hutcheson",
        "mean",
        "fit",
        "say",
        "give",
        "rise",
        "thingthat",
        "make",
        "ultimate",
        "end",
        "explication",
        "would",
        "render",
        "particular",
        "end",
        "fit",
        "seems",
        "according",
        "hutcheson",
        "presuppose",
        "independent",
        "evaluation",
        "beyond",
        "fitness",
        "though",
        "reading",
        "hutcheson",
        "suggests",
        "significant",
        "continuity",
        "hutcheson",
        "clarke",
        "see",
        "sheridan",
        "hutcheson",
        "save",
        "biting",
        "criticism",
        "wollaston",
        "view",
        "however",
        "according",
        "hutcheson",
        "plausibility",
        "moral",
        "distinction",
        "derived",
        "tendency",
        "action",
        "signify",
        "truth",
        "falsity",
        "depending",
        "upon",
        "one",
        "understands",
        "significance",
        "one",
        "understands",
        "wollaston",
        "acting",
        "thing",
        "would",
        "declare",
        "immoral",
        "benign",
        "act",
        "leaving",
        "one",
        "light",
        "night",
        "traveling",
        "noble",
        "without",
        "coronet",
        "walking",
        "plainclothes",
        "despite",
        "clergy",
        "writing",
        "play",
        "epicks",
        "essay",
        "addition",
        "according",
        "hutcheson",
        "wollaston",
        "system",
        "distinguish",
        "degree",
        "virtue",
        "vice",
        "assuming",
        "make",
        "sense",
        "say",
        "particular",
        "action",
        "signify",
        "truth",
        "falsehood",
        "appears",
        "binary",
        "propertyit",
        "either",
        "virtue",
        "scalar",
        "action",
        "horribly",
        "vicious",
        "others",
        "heroic",
        "others",
        "relatively",
        "morally",
        "insignificant",
        "essay",
        "see",
        "also",
        "ultimately",
        "hutcheson",
        "concludes",
        "wollaston",
        "every",
        "rationalist",
        "considers",
        "really",
        "smuggling",
        "sort",
        "moral",
        "sense",
        "disguise",
        "whether",
        "mean",
        "reference",
        "reasonableness",
        "particular",
        "action",
        "reference",
        "fitness",
        "reference",
        "significance",
        "truth",
        "falsity"
    ]
}