{
    "main_text": "General Approaches to Hyperintensionality || Two-Dimensional Semantics\n4.1 Two-Dimensional Semantics\n\nTwo-dimensional semantic theories (see entry on\n two-dimensional semantics)\n build on standard possible worlds semantics to handle a range of\nrepresentational hyperintensional phenomena. Originating in\ntwo-dimensional modal logic (Segerberg 1973; van Fraassen 1977; Davies\n& Humberstone 1980), versions of the view have been presented by\nKaplan (1989), Jackson (1994), and Chalmers (1996). (Stalnaker [1978]\nis a key pioneer of the approach, but he applied it to the pragmatics\nof communication, rather than to provide a hyperintensional semantics:\nsee Stalnaker 2004.)\n\nSometimes what a word picks out depends on context. Indexicals\n(“I”, “you”, “here”,\n“yesterday”) and demonstratives (“this”,\n“that”, “over there”) are obvious cases: which\nthing someone refers to using “this” depends on what they\nare demonstrating at the time. Kaplan (1989) proposed that these\nexpressions function as rigid designators on occasions of use: whether\nthe proposition expressed by a sentence including one is true at a\npossible world depends on how things stand with the object, if any,\nreferred to in the actual world. If on 5 March 2020 I say\n“Yesterday it was sunny”, I express a proposition true at\na possible world iff it is sunny on 4 March 2020 in that world. Elvis\nsays “I was born in 1935”: that is true at a possible\nworld iff Elvis was born in 1935 there.\n\nOn this view, “I am Elvis”, said by Elvis, is true just in\ncase Elvis is Elvis, thus necessarily true. Ditto for “Yesterday\nwas 4 March 2020”, said on 5 March 2020, which is true just in\ncase 4 March 2020 is 4 March 2020. Expressing those necessary truths\ncan, however, give contingent information to hearers who already knew\nthings are self-identical. To capture the difference between “I\nam Elvis” and “Elvis is Elvis”, when uttered by\nElvis as well as by someone else—say, Aretha—we would need\na story about the meaning of “I” that did not treat it as\na name. Kaplan took such meaning as a function from a context of\nutterance to an object, selecting the speaker as the object.\nSimilarly, the meaning of “yesterday” is a function from\nthe day of utterance, selecting the day before. This function is\ncalled the character of the expression. My knowing the\ncharacter (and facts about context) lets me take new information from\nthe utterances. I know “I” picks out the speaker and that\nthe speaker said “I am Elvis”. If I trust him, I can work\nout the speaker is Elvis. I might not have known that before,\nalthough I knew that Elvis is Elvis.\n\nMeanings, in this view, have two components: a character and\na content. The content is normally given via possible worlds.\nThe character is a function from contexts of utterance to contents.\nThe content of “I am Elvis”, uttered by Elvis, is the\ntotal set of worlds, since Elvis couldn’t but be Elvis. The\ncharacter is a function from the context’s speaker to the\ncontent that that person is Elvis. So it is a function from Elvis to\nthe content that Elvis is Elvis, from Aretha to the content that\nAretha is Elvis, etc.\n\nTraditionally, philosophers have found it useful to represent this\ninteraction of character and content with a two-dimensional matrix,\nhence the expression “two dimensional semantics”. Let us\nillustrate with a small example. In \\(W_1\\), Elvis is singing but\nAretha is not, and in \\(W_2\\), Aretha is singing but Elvis is not, and\nin \\(W_3\\), neither is singing. Consider the sentence “I am\nsinging”, with two possible speakers, Elvis and Aretha. We get\nthe following six scenarios, depending on which speaker is speaking\nand which world the resulting content is being evaluated at:\n\n\n\n \n\\(W_1\\)\n\\(W_2\\)\n\\(W_3\\) \n\nElvis\nT\nF\nF \n\nAretha\nF\nT\nF  \n\n\nEach horizontal line (row) of the matrix represents a content that can\nbe associated with “I am singing”, with different rows\nrepresenting the different contents produced by different contexts\n(due to different speakers, in this case). The entire matrix\nrepresents facts about the character of a sentence. These\ntwo-dimensional matrices become more interesting when more complex\nconstructions are discussed, but the key ideas for current purposes\nare more easily presentable without further using matrices.\n\nNow some proponents of two-dimensional semantics extend this setting\nbeyond indexicals and demonstratives, e.g., to proper names\nand natural kind terms. Take “Robin Hood”. Its\ncontent, suppose, is just Robin. But its character is a function from\ncontexts to such contents. In a world where our use of “Robin\nHood” derives in the right kind of way from Robin, the character\ndelivers our Robin as the content of “Robin Hood”. In a\nworld where Richard leads a band of outlaws in Sherwood, uses\n“Robin Hood” as an alias, is famous for robbing for the\nrich to give to the poor, the character of “Robin Hood”\npicks out Richard. Similarly for expression\n“water” and H2O in our world, or\n“XYZ” in Twin Earth: the character of “water”\npicks out different substances in different contexts.\n\nCharacter-sensitive expressions can give rise to hyperintensionality.\nTake “It is a priori that”: It is a\npriori that Hesperus is Hesperus; it is not a priori\nthat Hesperus is Phosphorus. Although “Hesperus” and\n“Phosphorus” have the same content (the planet Venus),\nthey can differ in character. There may be contingent a\npriori cases: Elvis says “I am here now” in a context\nwhere the assigned content is that Elvis Presley is in Graceland on\nnoon of 25 December 1975. “I am here now”, some claim, can\nbe known a priori by Elvis, but he cannot know a\npriori that Elvis is in Graceland on noon of 25 December\n1975.\n\nPropositional attitude contexts make for a salient case. The Sheriff\nof Nottingham believes Robin Hood is a dangerous outlaw. He does not\nbelieve that Robin of Locksley is a dangerous outlaw, although Robin\nHood is Locksley. We can explain this if we take “believes\nthat” as character-sensitive. “Robin Hood is a dangerous\noutlaw” and “Robin of Locksley is a dangerous\noutlaw” coincide in content (they are true in the same worlds).\nBut we can assign different characters to “Robin Hood” and\n“Robin of Locksley” by looking at differences in how they\nare typically acquired, in the causal history leading back to their\nfirst uses, or if we tie them to how the Sheriff sees the world. This\ncan be generalized to so-called intensional transitive verbs. The\nSheriff can be looking for Robin Hood but not looking for Robin of\nLocksley if “looking for” is sensitive to character.\n\nTwo-dimensional approaches are somewhat controversial when they move\nbeyond indexicals and demonstratives. (See the papers in\nGarcía-Carpintero and Maciá 2006 for arguments for and\nagainst two-dimensional semantics.) But they can account for the\napparent hyperintensionality of “it is a priori\nthat…” or “… believes that…”\nwithout straying too far from a traditional possible-worlds framework.\nContents keep being sets of possible worlds. Qua functions from\ncontexts to contents, characters are familiar from standard treatments\nof context-dependent expressions such as Kaplan’s.\n\nTwo-dimensional semantics also has a nice story on the behavior of\nindexicals in belief contexts. “I believe you are Elvis”,\nsaid addressing Elvis, appears to mean something different from\n“I believe Elvis is Elvis”. I would happily utter the\nlatter but not the former if I believe I am facing an Elvis\nimpersonator. It is hard to avoid the impression that the character of\nexpressions like “you” (or, “yesterday”,\n“that car”, etc.) makes the difference in such cases.\n\nTwo-dimensional semantic theories cannot easily offer a general\naccount of hyperintensionality. Worldly hyperintensionality is\nespecially recalcitrant. When, e.g., talk of essence is employed, and\nwe say that Socrates is essentially human but is not essentially\n(human and \\(2 + 2 = 4)\\), or not essentially (human and either bats\nhave wings or it is not the case that bats have wings), those two\nalternatives to “human” both have the same two-dimensional\nintension as “human”. Any context will pick out the same\ncontent for the predicates “is human”, “is human and\nsuch that \\(2 + 2 = 4\\)”, and “is human and either bats\nhave wings or it is not the case that bats have wings”.\n\nThe full range of non-trivial counterpossible conditionals are not\neasily handled either. Take “If Hobbes had squared the circle,\nHobbes would have proved an impressive mathematical result”.\nThis is plausibly true, whereas “If Archimedes had squared the\ncircle, Hobbes would have proved an impressive mathematical\nresult” is false: Archimedes lived well before Hobbes and so\nwould have beaten him to it, and Hobbes did not otherwise prove any\nimpressive results. The necessary falsehoods “Hobbes squared the\ncircle” and “Archimedes squared the circle” seem to\ndeliver different truth values as antecedents in same-consequent\ncounterfactuals. Functions from contexts to contents taken as the\nusual sets of possible worlds don’t deliver the desired result:\nwhichever other person a context picks out for “Hobbes”,\nit is hard to see how “\\(x\\) squared the circle” could\npick out a contingent proposition that would be useful. Prospects are\nnot quite hopeless here: approaches that employ two-dimensionalism as\nat least part of the picture about indicative conditionals\nhave been suggested by Weatherson (2001) and Nolan (2003). One might\nhope for an extension to counterfactuals. Or perhaps some other\napproach might work: recent work on counter-analytic conditionals done\nby Locke (forthcoming) and Kocurek, Jerzak, and Rudolph (2020) is\npromising.\n\nTwo-dimensionalism may be appealing as an account of some\nhyperintensional phenomena even if it cannot be generalized: it can be\nseen as one tool among others for constructing semantic theories for\nhyperintensional expressions, if one is willing to forego a\none-size-fits all approach.\n",
    "section_title": "4.1 Two-Dimensional Semantics",
    "entry_title": "Hyperintensionality",
    "hierarchy_title": "Hyperintensionality || General Approaches to Hyperintensionality || Two-Dimensional Semantics",
    "tokenized_text": [
        "general",
        "approach",
        "hyperintensionality",
        "twodimensional",
        "semantics",
        "twodimensional",
        "semantics",
        "twodimensional",
        "semantic",
        "theory",
        "see",
        "entry",
        "twodimensional",
        "semantics",
        "build",
        "standard",
        "possible",
        "world",
        "semantics",
        "handle",
        "range",
        "representational",
        "hyperintensional",
        "phenomenon",
        "originating",
        "twodimensional",
        "modal",
        "logic",
        "segerberg",
        "van",
        "fraassen",
        "davy",
        "humberstone",
        "version",
        "view",
        "presented",
        "kaplan",
        "jackson",
        "chalmers",
        "stalnaker",
        "key",
        "pioneer",
        "approach",
        "applied",
        "pragmatic",
        "communication",
        "rather",
        "provide",
        "hyperintensional",
        "semantics",
        "see",
        "stalnaker",
        "sometimes",
        "word",
        "pick",
        "depends",
        "context",
        "indexicals",
        "yesterday",
        "demonstrative",
        "obvious",
        "case",
        "thing",
        "someone",
        "refers",
        "using",
        "depends",
        "demonstrating",
        "time",
        "kaplan",
        "proposed",
        "expression",
        "function",
        "rigid",
        "designators",
        "occasion",
        "use",
        "whether",
        "proposition",
        "expressed",
        "sentence",
        "including",
        "one",
        "true",
        "possible",
        "world",
        "depends",
        "thing",
        "stand",
        "object",
        "referred",
        "actual",
        "world",
        "march",
        "say",
        "yesterday",
        "sunny",
        "express",
        "proposition",
        "true",
        "possible",
        "world",
        "iff",
        "sunny",
        "march",
        "world",
        "elvis",
        "say",
        "born",
        "true",
        "possible",
        "world",
        "iff",
        "elvis",
        "born",
        "view",
        "elvis",
        "said",
        "elvis",
        "true",
        "case",
        "elvis",
        "elvis",
        "thus",
        "necessarily",
        "true",
        "ditto",
        "yesterday",
        "march",
        "said",
        "march",
        "true",
        "case",
        "march",
        "march",
        "expressing",
        "necessary",
        "truth",
        "however",
        "give",
        "contingent",
        "information",
        "hearer",
        "already",
        "knew",
        "thing",
        "selfidentical",
        "capture",
        "difference",
        "elvis",
        "elvis",
        "elvis",
        "uttered",
        "elvis",
        "well",
        "someone",
        "elsesay",
        "arethawe",
        "would",
        "need",
        "story",
        "meaning",
        "treat",
        "name",
        "kaplan",
        "took",
        "meaning",
        "function",
        "context",
        "utterance",
        "object",
        "selecting",
        "speaker",
        "object",
        "similarly",
        "meaning",
        "yesterday",
        "function",
        "day",
        "utterance",
        "selecting",
        "day",
        "function",
        "called",
        "character",
        "expression",
        "knowing",
        "character",
        "fact",
        "context",
        "let",
        "take",
        "new",
        "information",
        "utterance",
        "know",
        "pick",
        "speaker",
        "speaker",
        "said",
        "elvis",
        "trust",
        "work",
        "speaker",
        "elvis",
        "might",
        "known",
        "although",
        "knew",
        "elvis",
        "elvis",
        "meaning",
        "view",
        "two",
        "component",
        "character",
        "content",
        "content",
        "normally",
        "given",
        "via",
        "possible",
        "world",
        "character",
        "function",
        "context",
        "utterance",
        "content",
        "content",
        "elvis",
        "uttered",
        "elvis",
        "total",
        "set",
        "world",
        "since",
        "elvis",
        "elvis",
        "character",
        "function",
        "context",
        "speaker",
        "content",
        "person",
        "elvis",
        "function",
        "elvis",
        "content",
        "elvis",
        "elvis",
        "aretha",
        "content",
        "aretha",
        "elvis",
        "etc",
        "traditionally",
        "philosopher",
        "found",
        "useful",
        "represent",
        "interaction",
        "character",
        "content",
        "twodimensional",
        "matrix",
        "hence",
        "expression",
        "two",
        "dimensional",
        "semantics",
        "let",
        "u",
        "illustrate",
        "small",
        "example",
        "w_",
        "elvis",
        "singing",
        "aretha",
        "w_",
        "aretha",
        "singing",
        "elvis",
        "w_",
        "neither",
        "singing",
        "consider",
        "sentence",
        "singing",
        "two",
        "possible",
        "speaker",
        "elvis",
        "aretha",
        "get",
        "following",
        "six",
        "scenario",
        "depending",
        "speaker",
        "speaking",
        "world",
        "resulting",
        "content",
        "evaluated",
        "w_",
        "w_",
        "w_",
        "elvis",
        "f",
        "f",
        "aretha",
        "f",
        "f",
        "horizontal",
        "line",
        "row",
        "matrix",
        "represents",
        "content",
        "associated",
        "singing",
        "different",
        "row",
        "representing",
        "different",
        "content",
        "produced",
        "different",
        "context",
        "due",
        "different",
        "speaker",
        "case",
        "entire",
        "matrix",
        "represents",
        "fact",
        "character",
        "sentence",
        "twodimensional",
        "matrix",
        "become",
        "interesting",
        "complex",
        "construction",
        "discussed",
        "key",
        "idea",
        "current",
        "purpose",
        "easily",
        "presentable",
        "without",
        "using",
        "matrix",
        "proponent",
        "twodimensional",
        "semantics",
        "extend",
        "setting",
        "beyond",
        "indexicals",
        "demonstrative",
        "eg",
        "proper",
        "name",
        "natural",
        "kind",
        "term",
        "take",
        "robin",
        "hood",
        "content",
        "suppose",
        "robin",
        "character",
        "function",
        "context",
        "content",
        "world",
        "use",
        "robin",
        "hood",
        "derives",
        "right",
        "kind",
        "way",
        "robin",
        "character",
        "delivers",
        "robin",
        "content",
        "robin",
        "hood",
        "world",
        "richard",
        "lead",
        "band",
        "outlaw",
        "sherwood",
        "us",
        "robin",
        "hood",
        "alias",
        "famous",
        "robbing",
        "rich",
        "give",
        "poor",
        "character",
        "robin",
        "hood",
        "pick",
        "richard",
        "similarly",
        "expression",
        "water",
        "ho",
        "world",
        "xyz",
        "twin",
        "earth",
        "character",
        "water",
        "pick",
        "different",
        "substance",
        "different",
        "context",
        "charactersensitive",
        "expression",
        "give",
        "rise",
        "hyperintensionality",
        "take",
        "priori",
        "priori",
        "hesperus",
        "hesperus",
        "priori",
        "hesperus",
        "phosphorus",
        "although",
        "hesperus",
        "phosphorus",
        "content",
        "planet",
        "venus",
        "differ",
        "character",
        "may",
        "contingent",
        "priori",
        "case",
        "elvis",
        "say",
        "context",
        "assigned",
        "content",
        "elvis",
        "presley",
        "graceland",
        "noon",
        "december",
        "claim",
        "known",
        "priori",
        "elvis",
        "know",
        "priori",
        "elvis",
        "graceland",
        "noon",
        "december",
        "propositional",
        "attitude",
        "context",
        "make",
        "salient",
        "case",
        "sheriff",
        "nottingham",
        "belief",
        "robin",
        "hood",
        "dangerous",
        "outlaw",
        "believe",
        "robin",
        "locksley",
        "dangerous",
        "outlaw",
        "although",
        "robin",
        "hood",
        "locksley",
        "explain",
        "take",
        "belief",
        "charactersensitive",
        "robin",
        "hood",
        "dangerous",
        "outlaw",
        "robin",
        "locksley",
        "dangerous",
        "outlaw",
        "coincide",
        "content",
        "true",
        "world",
        "assign",
        "different",
        "character",
        "robin",
        "hood",
        "robin",
        "locksley",
        "looking",
        "difference",
        "typically",
        "acquired",
        "causal",
        "history",
        "leading",
        "back",
        "first",
        "us",
        "tie",
        "sheriff",
        "see",
        "world",
        "generalized",
        "socalled",
        "intensional",
        "transitive",
        "verb",
        "sheriff",
        "looking",
        "robin",
        "hood",
        "looking",
        "robin",
        "locksley",
        "looking",
        "sensitive",
        "character",
        "twodimensional",
        "approach",
        "somewhat",
        "controversial",
        "move",
        "beyond",
        "indexicals",
        "demonstrative",
        "see",
        "paper",
        "garcíacarpintero",
        "maciá",
        "argument",
        "twodimensional",
        "semantics",
        "account",
        "apparent",
        "hyperintensionality",
        "priori",
        "that",
        "belief",
        "that",
        "without",
        "straying",
        "far",
        "traditional",
        "possibleworlds",
        "framework",
        "content",
        "keep",
        "set",
        "possible",
        "world",
        "qua",
        "function",
        "context",
        "content",
        "character",
        "familiar",
        "standard",
        "treatment",
        "contextdependent",
        "expression",
        "kaplan",
        "twodimensional",
        "semantics",
        "also",
        "nice",
        "story",
        "behavior",
        "indexicals",
        "belief",
        "context",
        "believe",
        "elvis",
        "said",
        "addressing",
        "elvis",
        "appears",
        "mean",
        "something",
        "different",
        "believe",
        "elvis",
        "elvis",
        "would",
        "happily",
        "utter",
        "latter",
        "former",
        "believe",
        "facing",
        "elvis",
        "impersonator",
        "hard",
        "avoid",
        "impression",
        "character",
        "expression",
        "like",
        "yesterday",
        "car",
        "etc",
        "make",
        "difference",
        "case",
        "twodimensional",
        "semantic",
        "theory",
        "easily",
        "offer",
        "general",
        "account",
        "hyperintensionality",
        "worldly",
        "hyperintensionality",
        "especially",
        "recalcitrant",
        "eg",
        "talk",
        "essence",
        "employed",
        "say",
        "socrates",
        "essentially",
        "human",
        "essentially",
        "human",
        "essentially",
        "human",
        "either",
        "bat",
        "wing",
        "case",
        "bat",
        "wing",
        "two",
        "alternative",
        "human",
        "twodimensional",
        "intension",
        "human",
        "context",
        "pick",
        "content",
        "predicate",
        "human",
        "human",
        "human",
        "either",
        "bat",
        "wing",
        "case",
        "bat",
        "wing",
        "full",
        "range",
        "nontrivial",
        "counterpossible",
        "conditionals",
        "easily",
        "handled",
        "either",
        "take",
        "hobbes",
        "squared",
        "circle",
        "hobbes",
        "would",
        "proved",
        "impressive",
        "mathematical",
        "result",
        "plausibly",
        "true",
        "whereas",
        "archimedes",
        "squared",
        "circle",
        "hobbes",
        "would",
        "proved",
        "impressive",
        "mathematical",
        "result",
        "false",
        "archimedes",
        "lived",
        "well",
        "hobbes",
        "would",
        "beaten",
        "hobbes",
        "otherwise",
        "prove",
        "impressive",
        "result",
        "necessary",
        "falsehood",
        "hobbes",
        "squared",
        "circle",
        "archimedes",
        "squared",
        "circle",
        "seem",
        "deliver",
        "different",
        "truth",
        "value",
        "antecedent",
        "sameconsequent",
        "counterfactuals",
        "function",
        "context",
        "content",
        "taken",
        "usual",
        "set",
        "possible",
        "world",
        "deliver",
        "desired",
        "result",
        "whichever",
        "person",
        "context",
        "pick",
        "hobbes",
        "hard",
        "see",
        "x",
        "squared",
        "circle",
        "could",
        "pick",
        "contingent",
        "proposition",
        "would",
        "useful",
        "prospect",
        "quite",
        "hopeless",
        "approach",
        "employ",
        "twodimensionalism",
        "least",
        "part",
        "picture",
        "indicative",
        "conditionals",
        "suggested",
        "weatherson",
        "nolan",
        "one",
        "might",
        "hope",
        "extension",
        "counterfactuals",
        "perhaps",
        "approach",
        "might",
        "work",
        "recent",
        "work",
        "counteranalytic",
        "conditionals",
        "done",
        "locke",
        "forthcoming",
        "kocurek",
        "jerzak",
        "rudolph",
        "promising",
        "twodimensionalism",
        "may",
        "appealing",
        "account",
        "hyperintensional",
        "phenomenon",
        "even",
        "generalized",
        "seen",
        "one",
        "tool",
        "among",
        "others",
        "constructing",
        "semantic",
        "theory",
        "hyperintensional",
        "expression",
        "one",
        "willing",
        "forego",
        "onesizefits",
        "approach"
    ]
}