{
    "main_text": "Bio, Works, Sources and Influences\n1. Bio, Works, Sources and Influences\n\n\nJewish Neoplatonist Solomon ben Judah Ibn Gabirol (Shelomoh ben\nYehudah Ibn Gabirol in Hebrew; Abu Ayyub Sulaiman ibn Yahya Ibn\nJubayrol (or Ibn\n Jabirul)[1]\nin Arabic; Avicebron / Avicembron / Avicenbrol /\nAvencebrol in Latin) was born in Málaga Spain in 1021/2 (Guttman\noffers 1026) and died, most likely in Valencia, most likely in 1057/8\n(Guttman offers 1050; Sirat offers 1054–8; Joseph Ibn Zaddik\noffers\n 1070).[2]\nFrom his own\nautobiographical remarks in his poems, it appears that this important\npoet-philosopher was orphaned, infirm and unattractive (it seems he\nsuffered a disfiguring skin\n ailment).[3]\nWhile there was a time during which he was\ninvolved with a circle of Jewish intellectuals in Saragossa, and while\nhe did enjoy the patronage of a respected (though, eventually murdered)\nJewish patron for a short while, it is also clear that Ibn Gabirol had\nan anti-social\n disposition[4]\nand a mostly strained relationship with the Jewish community. This\nlatter point has perhaps been overemphasized to full blown misanthropy\ndue to a translation error: in his sharp criticism of Ibn Gabirol's\nphilosophy (as repetitive, wrong-headed and unconvincing), Ibn Daud\nconcludes (in his ha-Emûnah ha-Ramah) that through his\nphilosophy Ibn Gabirol “led the Jewish people into error,”\nwhich through a mistranslation of the Arabic into Hebrew got wrongly\nconveyed as the claim that he slandered the Jewish people\n(dîber sarah gedôlah al ha-ûma) (see Pines\n1977a; for brief discussion in English, see Sirat 1985, p. 81). That\naside, a poem he wrote upon leaving Saragossa does lambast the\ncommunity (“…giants they deem themselves, for me to rate\nno more than grasshoppers…I am away, beneath my feet like mire\nI stamp them hard…”) (for translation and references for\nthis poem, see Loewe 1989, p. 21, and footnote 9, p. 170), and it does\nseem that he had a hard time finding patrons and friends (legend tells\nof his having created some sort of female automaton for house chores\n[apparently this story circulated in the 17th century; see Ashkenazi\n1629, part 1, 9; see Bargebuhr 1976, p. 62; Loewe 1989 fn. 9\np. 170]—perhaps a legend built on his reputation as having had\nfew companions). Perhaps we may root his generally surly disposition\nin his rather hard life or, on the other hand, in his self-assured\nsense of what was, to be sure, his own keen intellect and poetic\ngenius. On this latter point, we might consider another Ibn Gabirol\nlegend—a mythic tale of his death: killed by a jealous poet, Ibn\nGabirol's remains are discovered when curious townsmen dig under a fig\ntree to determine why its flowers, fruit, and fragrance exceed the\nbeauty of anything they've ever experienced (see Loewe 1989, p. 23\nwith reference details in footnote 14, p. 170).\n\n\nComplementing a vast corpus of Hebrew poetry (see section 7 below),\nIbn Gabirol's most expansive work is his philosophical treatise,\nthe Fons Vitae (The Fountain of Life, or\nyanbû‘ al-hayâh in\n Arabic,[5]\nand the meqôr\nhayyîm in its later Hebrew\n translation).[6]\nOriginally written in Arabic in\nthe 11th century in the form of a dialogue between a teacher and his\nstudent, the Fons Vitae was translated into Latin in the 12th\ncentury by the translation team of Dominicus Gundissalinus and John of\nSpain (Johannes\n Hispanus),[7]\nand made into an abridged Hebrew version (one\nwhich loses the dialogue format and is something more of a summary of\nthe original) by Shem Tov Ibn Falaquera in the 13th century. The\noriginal Arabic text is lost to us, though we do have some extant\nfragments in the form of citations of the original Arabic version in\nthe Arabic language texts of other Jewish medieval\n philosophers.[8]\nBecause the Arabic\nfragments are sparse, the main version of the text is the Latin 12th\ncentury translation—it is considered more true to the original\nthan the later 13th century Hebrew translation both because it is an\nearlier translation, but also because unlike the Hebrew summary\ntranslation, the Latin edition is (ostensibly) a complete translation,\nmaintaining—as the Hebrew summary does not—the original\ndialogue format of Ibn Gabirol's original text. That said, it is\nworth noting that sometimes the 13th century Hebrew translation is more\nhelpful than the Latin because it is able to resonate with various\nHebrew terms at play in Ibn Gabirol's own vast corpus of Hebrew\npoetry which is often helpful in shedding light on some given\nphilosophical point in the Fons Vitae.\n\n\nIbn Gabirol also authored (in Arabic) On the Improvement of the\nMoral Qualities (islâh al-’akhlâq in\nthe Arabic, or tîkkûn mîdôt ha-nefesh,\nthe Hebrew title of the translation by Judah Ibn Tibbon) a blend of\nphysiological and philosophical insights on the nature of the human\nsoul. We also have evidence in other medieval Jewish authors of what\nmight be part of an allegorical commentary on the Bible by Ibn Gabirol\n(as found in Abraham ibn Ezra's commentary on the Bible; see\nFriedlaender 1877, p. 40; Kaufmann 1899, p. 63ff.; for English see\nSirat 1985, p. 79), and it is debated whether he might also be the\nauthor of Choice of Pearls (mukhtâr\nal-jawâhir, lit. Choice (or: Selection) of Jewels;\nor Mivhar ha-Penînîm, Choice of Pearls, in its\nHebrew\n translation),[9]\na collection of maxims aimed at cultivating a\nvirtuous soul. It might be further noted that there are medieval lists\nby later thinkers enumerating a total 21 treatises by Ibn Gabirol (see\nLoewe 1989, pp. 24–5) including an entire [non-extant] treatise on\nDivine Will to which Ibn Gabirol himself alludes in his Fons\nVitae. All this, of course, in addition to his having authored a\nvast corpus of Hebrew poetry, including a number of lengthy\nphilosophical poems (see section 7).\n\n\nAlthough we are not certain of what traditions most influenced his\nwork, we might certainly see in the pages of his philosophy and poetry\na unique blend of Jewish, Islamic, Neoplatonic, Pythagorean,\nphilosophical, Biblical, and mystical (Jewish and Islamic) source\nmaterials. We find overt use of Biblical quotes throughout his poetry,\nthough (and this is something for which other Jewish thinkers\ncriticized him) no overt references to the Bible or Jewish tradition in\nhis Fons Vitae (though the title arguably references\nPsalms 36:10). In his notion of a Divine Word (in the Fons\nVitae), we might hear resonances of the Longer Theology of\nAristotle; in his interest in a Divine Throne (in the Fons\nVitae and in his Keter Malkhût [Kingdom's\nCrown] poem), we might hear resonances of Muslim and Jewish\n“Throne\n theologies”;[10]\nin his reference to God creating out of letters, we might hear resonances of the\nSêfer Yezîrah (The Book of Formation,\npossibly known to Ibn Gabirol through the commentary edition of Saadya\nGaon; for discussion of Sêfer Yezîrah and Ibn\nGabirol, see Schlanger 1965 and Liebes 1987); in his causal\nmetaphysical hierarchy we might discern the influence of the Liber\n de Causis;[11]\nand in his emphasis on a principle called “al-‘unsur\nal-awwal” in his Arabic writing (generally translated as\nfirst matter) and called “yesôd”\n(foundation) in his Hebrew poetry, we might hear resonances of a\ntradition which scholars have dubbed “Pseudo Empedoclean”—an \nimprecisely understood tradition of ideas found in an\neclectic array of medieval Jewish and Islamic texts (where authors\nsometimes refer overtly to Empedocles by name) in which there emerges a\nnotable focus on a principle of pure supernal matter\n(al-‘unsur al-awwal, literally “the first\nelement”) at the core of being which is itself either coupled\nwith a principle of first form or described as itself composite of the\nduality of “love and strife.” The exact nature of this\ntradition or traditions remains unclear, but can be found in\nal-Shahrastani, al-Shahrazuri, Ps. Ammonius, and al-Amiri (for\nreferences, see the entry on “anbaduklîs”—the \nArabic transliteration of “Empedocles”—in \nEncyclopedia of Islam), in some medieval Hebrew\nKabbalistic\n traditions,[12]\nand has been linked to ideas in Ibn Masarra (see Asín-Palacios\n1978), Isaac Israeli and Ibn Hasday (See Stern 1983a). Linking Ibn\nGabirol to this tradition seems warranted not only in light of his own\nemphasis on al-‘unsur al-awwal (followed in turn by an\nunusual focus on the role of matter/s in the cosmos), but in light of\na claim by his 13th century translator Shem Tov Ibn\nFalaquera who in the introduction to his Hebrew edition\nof Meqôr Hayyîm (Fons Vitae) writes that\nIbn Gabirol seems to have been influenced by\n“Empedocles' Book of the Five Substances”\n(cf. Falaquera in Fons Vitae 1962, p. 435). Leaving aside what\nthis might refer to (scholars debate both the title as well as what it\nrefers to), it does seem that Ibn Falaquera was right to note some\nlink between Ibn Gabirol's Fons Vitae and some set of ideas\ncirculating under the name of\n Empedocles.[13]\n\n\nWhile some later medieval Jewish thinkers—such as Shem Tov\nIbn Falaquera, Moses Ibn Ezra, Abraham Ibn Daud, Joseph ibn Zaddik and\nIsaac and Judah Abrabanel—were familiar with his philosophy,\nIbn Gabirol is probably most well-known among medieval and modern\nJewish authors for his Hebrew poetry, the best known of which being the\nKeter Malkhût (variously translated as\nKingdom's Crown, The Kingly Crown, The\nRoyal Crown, et\n al.),[14]\na long devotional poem exploring the ineffable\nsplendor of the divine and tracing God's presence throughout the\nvarious cosmological spheres which make up the universe. In fact, this\npoem is included in many Jewish prayer books for recitation on\nYôm Kippûr (The Day of Atonement), the highest of\nJewish holy days.\n\n\nThe Fons Vitae is arguably the most influential of his\nworks, though mostly among medieval Christians. Available in Hebrew\nsummary form by the 13th century, and quoted in Arabic in\nMoses Ibn Ezra's\n work,[15]\nthe Fons Vitae left its strongest\nimprint not on medieval Jews but on the medieval Christian world.\nTranslated into Latin in the 12th century, and circulating\nno longer under Ibn Gabirol's name per se, but now under the\nLatinized version of his name (variously as Avicebron, Avicembron,\nAvicenbrol and Avencebrol), the Fons Vitae was engaged\n(variously criticized and hallowed) by centuries of medieval Christian\nscholars, who either assumed the author to be a Muslim or a Christian,\nnone suspecting the author to be the accomplished medieval Jewish poet,\nSolomon Ibn Gabirol.\n\n\nFollowing the Christian reception of Ibn Gabirol's text\nfurther, we might note that whole groups of medieval Christian\nphilosophers assumed the text to have been written in particular by an\nAugustinian Christian. Taken up by many Franciscan philosophers in just\nthis way, Ibn Gabirol's Fons Vitae text became a\ncornerstone in many theologically charged debates between Franciscans\nand Dominicans, the Franciscans pointing to many of the Fons\nVitae doctrines in support of what they took to be true, untainted\nChristian ideas as laid out by Augustine—in contrast to the\nmore heavily Aristotelianized ideas of Dominicans like St. Thomas\nAquinas. It was not until the middle of the 19th century\nthat the Fons Vitae began its return to its Jewish roots when\nSolomon Munk uncovered the 13th century Hebrew summary by\nShem Tov Ibn Falaquera in which the text is attributed to Solomon Ibn\nGabirol. In this way, Munk recognized the Fons Vitae to have\nin fact been penned by the 11th century Jewish poet.\n\n\nIt is worth noting that in spite of this discovery, many scholars\ncontinue to tacitly read Ibn Gabirol's Fons Vitae\nthrough Augustinian and other inappropriate lenses. (See section 2 on\nmethodology below).\n",
    "section_title": "1. Bio, Works, Sources and Influences",
    "entry_title": "Solomon Ibn Gabirol [Avicebron]",
    "hierarchy_title": "Solomon Ibn Gabirol [Avicebron] || Bio, Works, Sources and Influences",
    "tokenized_text": [
        "bio",
        "work",
        "source",
        "influence",
        "bio",
        "work",
        "source",
        "influence",
        "jewish",
        "neoplatonist",
        "solomon",
        "ben",
        "judah",
        "ibn",
        "gabirol",
        "shelomoh",
        "ben",
        "yehudah",
        "ibn",
        "gabirol",
        "hebrew",
        "abu",
        "ayyub",
        "sulaiman",
        "ibn",
        "yahya",
        "ibn",
        "jubayrol",
        "ibn",
        "jabirul",
        "arabic",
        "avicebron",
        "avicembron",
        "avicenbrol",
        "avencebrol",
        "latin",
        "born",
        "málaga",
        "spain",
        "guttman",
        "offer",
        "died",
        "likely",
        "valencia",
        "likely",
        "guttman",
        "offer",
        "sirat",
        "offer",
        "joseph",
        "ibn",
        "zaddik",
        "offer",
        "autobiographical",
        "remark",
        "poem",
        "appears",
        "important",
        "poetphilosopher",
        "orphaned",
        "infirm",
        "unattractive",
        "seems",
        "suffered",
        "disfiguring",
        "skin",
        "ailment",
        "time",
        "involved",
        "circle",
        "jewish",
        "intellectual",
        "saragossa",
        "enjoy",
        "patronage",
        "respected",
        "though",
        "eventually",
        "murdered",
        "jewish",
        "patron",
        "short",
        "also",
        "clear",
        "ibn",
        "gabirol",
        "antisocial",
        "disposition",
        "mostly",
        "strained",
        "relationship",
        "jewish",
        "community",
        "latter",
        "point",
        "perhaps",
        "overemphasized",
        "full",
        "blown",
        "misanthropy",
        "due",
        "translation",
        "error",
        "sharp",
        "criticism",
        "ibn",
        "gabirol",
        "s",
        "philosophy",
        "repetitive",
        "wrongheaded",
        "unconvincing",
        "ibn",
        "daud",
        "concludes",
        "haemûnah",
        "haramah",
        "philosophy",
        "ibn",
        "gabirol",
        "led",
        "jewish",
        "people",
        "error",
        "mistranslation",
        "arabic",
        "hebrew",
        "got",
        "wrongly",
        "conveyed",
        "claim",
        "slandered",
        "jewish",
        "people",
        "dîber",
        "sarah",
        "gedôlah",
        "al",
        "haûma",
        "see",
        "pine",
        "a",
        "brief",
        "discussion",
        "english",
        "see",
        "sirat",
        "p",
        "aside",
        "poem",
        "wrote",
        "upon",
        "leaving",
        "saragossa",
        "lambast",
        "community",
        "giants",
        "deem",
        "rate",
        "grasshoppersi",
        "away",
        "beneath",
        "foot",
        "like",
        "mire",
        "stamp",
        "hard",
        "translation",
        "reference",
        "poem",
        "see",
        "loewe",
        "p",
        "footnote",
        "p",
        "seem",
        "hard",
        "time",
        "finding",
        "patron",
        "friend",
        "legend",
        "tell",
        "created",
        "sort",
        "female",
        "automaton",
        "house",
        "chore",
        "apparently",
        "story",
        "circulated",
        "th",
        "century",
        "see",
        "ashkenazi",
        "part",
        "see",
        "bargebuhr",
        "p",
        "loewe",
        "fn",
        "p",
        "perhaps",
        "legend",
        "built",
        "reputation",
        "companion",
        "perhaps",
        "may",
        "root",
        "generally",
        "surly",
        "disposition",
        "rather",
        "hard",
        "life",
        "hand",
        "selfassured",
        "sense",
        "sure",
        "keen",
        "intellect",
        "poetic",
        "genius",
        "latter",
        "point",
        "might",
        "consider",
        "another",
        "ibn",
        "gabirol",
        "legenda",
        "mythic",
        "tale",
        "death",
        "killed",
        "jealous",
        "poet",
        "ibn",
        "gabirol",
        "s",
        "remains",
        "discovered",
        "curious",
        "townsman",
        "dig",
        "fig",
        "tree",
        "determine",
        "flower",
        "fruit",
        "fragrance",
        "exceed",
        "beauty",
        "anything",
        "ve",
        "ever",
        "experienced",
        "see",
        "loewe",
        "p",
        "reference",
        "detail",
        "footnote",
        "p",
        "complementing",
        "vast",
        "corpus",
        "hebrew",
        "poetry",
        "see",
        "section",
        "ibn",
        "gabirol",
        "s",
        "expansive",
        "work",
        "philosophical",
        "treatise",
        "fons",
        "vitae",
        "fountain",
        "life",
        "yanbû",
        "alhayâh",
        "arabic",
        "meqôr",
        "hayyîm",
        "later",
        "hebrew",
        "translation",
        "originally",
        "written",
        "arabic",
        "th",
        "century",
        "form",
        "dialogue",
        "teacher",
        "student",
        "fons",
        "vitae",
        "translated",
        "latin",
        "th",
        "century",
        "translation",
        "team",
        "dominicus",
        "gundissalinus",
        "john",
        "spain",
        "johannes",
        "hispanus",
        "made",
        "abridged",
        "hebrew",
        "version",
        "one",
        "loses",
        "dialogue",
        "format",
        "something",
        "summary",
        "original",
        "shem",
        "tov",
        "ibn",
        "falaquera",
        "th",
        "century",
        "original",
        "arabic",
        "text",
        "lost",
        "u",
        "though",
        "extant",
        "fragment",
        "form",
        "citation",
        "original",
        "arabic",
        "version",
        "arabic",
        "language",
        "text",
        "jewish",
        "medieval",
        "philosopher",
        "arabic",
        "fragment",
        "sparse",
        "main",
        "version",
        "text",
        "latin",
        "th",
        "century",
        "translationit",
        "considered",
        "true",
        "original",
        "later",
        "th",
        "century",
        "hebrew",
        "translation",
        "earlier",
        "translation",
        "also",
        "unlike",
        "hebrew",
        "summary",
        "translation",
        "latin",
        "edition",
        "ostensibly",
        "complete",
        "translation",
        "maintainingas",
        "hebrew",
        "summary",
        "notthe",
        "original",
        "dialogue",
        "format",
        "ibn",
        "gabirol",
        "s",
        "original",
        "text",
        "said",
        "worth",
        "noting",
        "sometimes",
        "th",
        "century",
        "hebrew",
        "translation",
        "helpful",
        "latin",
        "able",
        "resonate",
        "various",
        "hebrew",
        "term",
        "play",
        "ibn",
        "gabirol",
        "s",
        "vast",
        "corpus",
        "hebrew",
        "poetry",
        "often",
        "helpful",
        "shedding",
        "light",
        "given",
        "philosophical",
        "point",
        "fons",
        "vitae",
        "ibn",
        "gabirol",
        "also",
        "authored",
        "arabic",
        "improvement",
        "moral",
        "quality",
        "islâh",
        "al",
        "akhlâq",
        "arabic",
        "tîkkûn",
        "mîdôt",
        "hanefesh",
        "hebrew",
        "title",
        "translation",
        "judah",
        "ibn",
        "tibbon",
        "blend",
        "physiological",
        "philosophical",
        "insight",
        "nature",
        "human",
        "soul",
        "also",
        "evidence",
        "medieval",
        "jewish",
        "author",
        "might",
        "part",
        "allegorical",
        "commentary",
        "bible",
        "ibn",
        "gabirol",
        "found",
        "abraham",
        "ibn",
        "ezra",
        "s",
        "commentary",
        "bible",
        "see",
        "friedlaender",
        "p",
        "kaufmann",
        "p",
        "ff",
        "english",
        "see",
        "sirat",
        "p",
        "debated",
        "whether",
        "might",
        "also",
        "author",
        "choice",
        "pearl",
        "mukhtâr",
        "aljawâhir",
        "lit",
        "choice",
        "selection",
        "jewel",
        "mivhar",
        "hapenînîm",
        "choice",
        "pearl",
        "hebrew",
        "translation",
        "collection",
        "maxim",
        "aimed",
        "cultivating",
        "virtuous",
        "soul",
        "might",
        "noted",
        "medieval",
        "list",
        "later",
        "thinker",
        "enumerating",
        "total",
        "treatise",
        "ibn",
        "gabirol",
        "see",
        "loewe",
        "pp",
        "including",
        "entire",
        "nonextant",
        "treatise",
        "divine",
        "ibn",
        "gabirol",
        "alludes",
        "fons",
        "vitae",
        "course",
        "addition",
        "authored",
        "vast",
        "corpus",
        "hebrew",
        "poetry",
        "including",
        "number",
        "lengthy",
        "philosophical",
        "poem",
        "see",
        "section",
        "although",
        "certain",
        "tradition",
        "influenced",
        "work",
        "might",
        "certainly",
        "see",
        "page",
        "philosophy",
        "poetry",
        "unique",
        "blend",
        "jewish",
        "islamic",
        "neoplatonic",
        "pythagorean",
        "philosophical",
        "biblical",
        "mystical",
        "jewish",
        "islamic",
        "source",
        "material",
        "find",
        "overt",
        "use",
        "biblical",
        "quote",
        "throughout",
        "poetry",
        "though",
        "something",
        "jewish",
        "thinker",
        "criticized",
        "overt",
        "reference",
        "bible",
        "jewish",
        "tradition",
        "fons",
        "vitae",
        "though",
        "title",
        "arguably",
        "reference",
        "psalm",
        "notion",
        "divine",
        "word",
        "fons",
        "vitae",
        "might",
        "hear",
        "resonance",
        "longer",
        "theology",
        "aristotle",
        "interest",
        "divine",
        "throne",
        "fons",
        "vitae",
        "keter",
        "malkhût",
        "kingdom",
        "s",
        "crown",
        "poem",
        "might",
        "hear",
        "resonance",
        "muslim",
        "jewish",
        "throne",
        "theology",
        "reference",
        "god",
        "creating",
        "letter",
        "might",
        "hear",
        "resonance",
        "sêfer",
        "yezîrah",
        "book",
        "formation",
        "possibly",
        "known",
        "ibn",
        "gabirol",
        "commentary",
        "edition",
        "saadya",
        "gaon",
        "discussion",
        "sêfer",
        "yezîrah",
        "ibn",
        "gabirol",
        "see",
        "schlanger",
        "liebes",
        "causal",
        "metaphysical",
        "hierarchy",
        "might",
        "discern",
        "influence",
        "liber",
        "de",
        "causis",
        "emphasis",
        "principle",
        "called",
        "al",
        "unsur",
        "alawwal",
        "arabic",
        "writing",
        "generally",
        "translated",
        "first",
        "matter",
        "called",
        "yesôd",
        "foundation",
        "hebrew",
        "poetry",
        "might",
        "hear",
        "resonance",
        "tradition",
        "scholar",
        "dubbed",
        "pseudo",
        "empedoclean",
        "an",
        "imprecisely",
        "understood",
        "tradition",
        "idea",
        "found",
        "eclectic",
        "array",
        "medieval",
        "jewish",
        "islamic",
        "text",
        "author",
        "sometimes",
        "refer",
        "overtly",
        "empedocles",
        "name",
        "emerges",
        "notable",
        "focus",
        "principle",
        "pure",
        "supernal",
        "matter",
        "al",
        "unsur",
        "alawwal",
        "literally",
        "first",
        "element",
        "core",
        "either",
        "coupled",
        "principle",
        "first",
        "form",
        "described",
        "composite",
        "duality",
        "love",
        "strife",
        "exact",
        "nature",
        "tradition",
        "tradition",
        "remains",
        "unclear",
        "found",
        "alshahrastani",
        "alshahrazuri",
        "p",
        "ammonius",
        "alamiri",
        "reference",
        "see",
        "entry",
        "anbaduklîs",
        "the",
        "arabic",
        "transliteration",
        "empedocles",
        "in",
        "encyclopedia",
        "islam",
        "medieval",
        "hebrew",
        "kabbalistic",
        "tradition",
        "linked",
        "idea",
        "ibn",
        "masarra",
        "see",
        "asínpalacios",
        "isaac",
        "israeli",
        "ibn",
        "hasday",
        "see",
        "stern",
        "a",
        "linking",
        "ibn",
        "gabirol",
        "tradition",
        "seems",
        "warranted",
        "light",
        "emphasis",
        "al",
        "unsur",
        "alawwal",
        "followed",
        "turn",
        "unusual",
        "focus",
        "role",
        "matters",
        "cosmos",
        "light",
        "claim",
        "th",
        "century",
        "translator",
        "shem",
        "tov",
        "ibn",
        "falaquera",
        "introduction",
        "hebrew",
        "edition",
        "meqôr",
        "hayyîm",
        "fons",
        "vitae",
        "writes",
        "ibn",
        "gabirol",
        "seems",
        "influenced",
        "empedocles",
        "book",
        "five",
        "substance",
        "cf",
        "falaquera",
        "fons",
        "vitae",
        "p",
        "leaving",
        "aside",
        "might",
        "refer",
        "scholar",
        "debate",
        "title",
        "well",
        "refers",
        "seem",
        "ibn",
        "falaquera",
        "right",
        "note",
        "link",
        "ibn",
        "gabirol",
        "s",
        "fons",
        "vitae",
        "set",
        "idea",
        "circulating",
        "name",
        "empedocles",
        "later",
        "medieval",
        "jewish",
        "thinkerssuch",
        "shem",
        "tov",
        "ibn",
        "falaquera",
        "moses",
        "ibn",
        "ezra",
        "abraham",
        "ibn",
        "daud",
        "joseph",
        "ibn",
        "zaddik",
        "isaac",
        "judah",
        "abrabanelwere",
        "familiar",
        "philosophy",
        "ibn",
        "gabirol",
        "probably",
        "wellknown",
        "among",
        "medieval",
        "modern",
        "jewish",
        "author",
        "hebrew",
        "poetry",
        "best",
        "known",
        "keter",
        "malkhût",
        "variously",
        "translated",
        "kingdom",
        "s",
        "crown",
        "kingly",
        "crown",
        "royal",
        "crown",
        "et",
        "al",
        "long",
        "devotional",
        "poem",
        "exploring",
        "ineffable",
        "splendor",
        "divine",
        "tracing",
        "god",
        "s",
        "presence",
        "throughout",
        "various",
        "cosmological",
        "sphere",
        "make",
        "universe",
        "fact",
        "poem",
        "included",
        "many",
        "jewish",
        "prayer",
        "book",
        "recitation",
        "yôm",
        "kippûr",
        "day",
        "atonement",
        "highest",
        "jewish",
        "holy",
        "day",
        "fons",
        "vitae",
        "arguably",
        "influential",
        "work",
        "though",
        "mostly",
        "among",
        "medieval",
        "christian",
        "available",
        "hebrew",
        "summary",
        "form",
        "th",
        "century",
        "quoted",
        "arabic",
        "moses",
        "ibn",
        "ezra",
        "s",
        "work",
        "fons",
        "vitae",
        "left",
        "strongest",
        "imprint",
        "medieval",
        "jew",
        "medieval",
        "christian",
        "world",
        "translated",
        "latin",
        "th",
        "century",
        "circulating",
        "longer",
        "ibn",
        "gabirol",
        "s",
        "name",
        "per",
        "se",
        "latinized",
        "version",
        "name",
        "variously",
        "avicebron",
        "avicembron",
        "avicenbrol",
        "avencebrol",
        "fons",
        "vitae",
        "engaged",
        "variously",
        "criticized",
        "hallowed",
        "century",
        "medieval",
        "christian",
        "scholar",
        "either",
        "assumed",
        "author",
        "muslim",
        "christian",
        "none",
        "suspecting",
        "author",
        "accomplished",
        "medieval",
        "jewish",
        "poet",
        "solomon",
        "ibn",
        "gabirol",
        "following",
        "christian",
        "reception",
        "ibn",
        "gabirol",
        "s",
        "text",
        "might",
        "note",
        "whole",
        "group",
        "medieval",
        "christian",
        "philosopher",
        "assumed",
        "text",
        "written",
        "particular",
        "augustinian",
        "christian",
        "taken",
        "many",
        "franciscan",
        "philosopher",
        "way",
        "ibn",
        "gabirol",
        "s",
        "fons",
        "vitae",
        "text",
        "became",
        "cornerstone",
        "many",
        "theologically",
        "charged",
        "debate",
        "franciscan",
        "dominican",
        "franciscan",
        "pointing",
        "many",
        "fons",
        "vitae",
        "doctrine",
        "support",
        "took",
        "true",
        "untainted",
        "christian",
        "idea",
        "laid",
        "augustinein",
        "contrast",
        "heavily",
        "aristotelianized",
        "idea",
        "dominican",
        "like",
        "st",
        "thomas",
        "aquinas",
        "middle",
        "th",
        "century",
        "fons",
        "vitae",
        "began",
        "return",
        "jewish",
        "root",
        "solomon",
        "munk",
        "uncovered",
        "th",
        "century",
        "hebrew",
        "summary",
        "shem",
        "tov",
        "ibn",
        "falaquera",
        "text",
        "attributed",
        "solomon",
        "ibn",
        "gabirol",
        "way",
        "munk",
        "recognized",
        "fons",
        "vitae",
        "fact",
        "penned",
        "th",
        "century",
        "jewish",
        "poet",
        "worth",
        "noting",
        "spite",
        "discovery",
        "many",
        "scholar",
        "continue",
        "tacitly",
        "read",
        "ibn",
        "gabirol",
        "s",
        "fons",
        "vitae",
        "augustinian",
        "inappropriate",
        "lens",
        "see",
        "section",
        "methodology"
    ]
}