{
    "main_text": "Poetry and the Science of the Soul\n8. Poetry and the Science of the Soul\n\n\nFor Ibn Ezra, the human soul is the only unchanging, eternal entity in\nthe universe; it is the only thing that can be said to be similar, in\nsome sense, to God. For example, the opening sentence in Sefer\nTzahut (a grammatical treatise!) states: “Because the human\nsoul was created in the image of God, her actions are similar to\nhis” (Levin 1985, 379). At the end of Yesod Mora (Cohen\n2002, 200–201) he cites the five points of resemblance between the\nsoul and God noted in the Talmud; and he implies that Shi‘ur\nQoma professes a similar doctrine. Ibn Ezra takes these\nsimilarities rather literally, as it seems.\n\n\nGiven this state of affairs, it is no surprise that “the science\nof the soul” is the branch of philosophy concerning which Ibn\nEzra has the most to say. Ibn Ezra evinces little interest in the\nmetaphysics of the theologians—that is, questions of divine\nattributes, substance and accident, and so forth. Psychology was his\nmetaphysics; it and it alone delved into questions beyond the material\nworld and approaching the godhead. In a revealing remark he calls Ibn\nGabirol “a great sage in the secret (sod) of the\nsoul.” It comes as no surprise, then, that penetrating studies\nof Ibn Ezra’s thought, such as Wolfson 1990, Tanenbaum 1990, Hughes\n2009, and Labaton 2013, dwell at length on the Ibn Ezra’s conceptions\nof soul.\n\n\nIbn Ezra’s attitude towards psychology emerges mainly from his\npoetry; it is not simply copied from some sterile classification\nscheme. His poetry, more than anything, has nourished his image as a\nneoplatonist in the scholarly literature. In fact, psychology was one\narena of sharp conflict between philosophers\nand mutakallimūn. If, as we have suggested, Ibn Ezra\nwas mainly influenced by Sa‘adiah and\nother gaonim—and thus also by the kalamists—many\nof his ideas about the soul derive from the traditions of Hebrew\npoetry in Spain. Unlike the kalam, which has little interest in\npsychology, and is not obsessed with release from this world, the\nHebrew poets as a rule identify with the classical neoplatonists in\nseeking salvation and release of the soul from its mundane\ncaptivity.\n\n\nEven Ibn Ezra’s prose pronouncements concerning the soul’s\nlonging to return to her source tend towards the lyrical (and in fact\nhas some small but clear borrowings from a long liturgy by\nHalevi). Consider this passage from the introduction to the commentary\nto Ecclesiastes: \n\n Just as the passerby, who has been taken prisoner, longs to return to\nhis homeland and to be with his family, so does the intellectizing\nspirit yearn to grab hold of the higher rungs, until she ascends to\nthe formations of the living God, which do not dwell in material\nhouses…This will transpire if the spirit whitens, sanctifying\nherself above the impurities of disgusting bodily lusts which sully\nwhat is holy…then what is distant will be like what is near,\nand night like day; then she will be configured to know the real\ntruth, which will be inscribed upon her in such a way so as not be\nerased when she departs the body, for the script is the writing of\nGod. She was brought here in order to be shown, and for that reason\nshe was imprisoned until the end of her term….(Levin 1985, 288)\n \n\n\nThis prose exposition is replete with imagery but devoid, like similar\naccounts in Ibn Ezra’s writings, of any thorough discussion of the\nsoul’s structure, origins, and path to liberation, of the kind that\none does find in the Islamic neoplatonic tradition, including Jewish\nworks such as pseudo-Bahya. It is really a reworking in rhymed\nprose—the medium of Ibn Gabirol’s liturgical masterpiece,\nKeter Malkhut—of the same themes that inspire Ibn\nEzra’s poems. Nonetheless, Ibn Ezra undoubtedly impresses his readers\nwith the great pathos and obvious sincerity of his liturgies. His\nhymn, “Tzom’ah nafshi” (“My soul\nthirsts”) is one of the most powerful expressions of longing for\nthe divine in Hebrew letters. Ibn Ezra experienced deeply and fully\nthe soul’s alienation in this world and her longing for divine\nredemption, and his poetic expressions of these awesome feelings\nserved better as credentials for his expertise in matters of his soul\nthan could any academic diploma.\n9. Excursus on the Soul in a Comment to Ecclesiastes\n\n\nThe best way to grasp all that has been said so far about Ibn Ezra’s\ninterests, influences, and style, is to have look at a sample passage\nwhere the peculiarities of his writing and the difficulties of piecing\ntogether his “philosophy” can be examined in\nsitu, so to speak. The lengthy excursus on the structure of the\nhuman soul in his commentary to Ecclesiastes 7:9 offers such an\nopportunity. Ibn Ezra briefly notes the tripartite division of the\nsoul into vegetable, animal, and rational. This, he tells us, is the\nscheme adopted by “the scholars who [base their claims upon]\nproofs” (hakhmei ha-ra’ayot).  One can achieve a\nfull understanding only after reading “many books”. There\nis no specific lexical or grammatical problem that requires the\nexegete to go to any length here. However, an inquiry into the soul is\nmandated because this verse is one of the places in Ecclesiastes where\nKing Solomon has, on the face of it, contradicted himself, and\ntherefore the verse requires explication. After citing at length some\nof the apparent contradictions, Ibn Ezra proposes an alternative\npsychology to that of the “scholars”, employing a\ndifferent tripartite scheme and different terminology: nefesh\n(appetite and lust), ru’ah (sensation and domineering),\nand neshamah (wisdom). He intimates that this switch is only\nfor the sake of convenience, though the truth appears to be otherwise. Ibn\nEzra notes in passing that Sa‘adiah too employed this second\nclassification.\n10. Rationale for the Commandments: Yesod Mora\n\n\nThe most systematic formulation of Ibn Ezra’s philosophical ideas is\nfound in Yesod Mora (The Foundation of Reverence)\n(Cohen 2002). Significantly, this is a monograph on the rationale of\nthe commandments, perhaps the key field (along with biblical\ninterpretation, with which it overlaps somewhat) for the development\nof a specifically Judaic philosophy. Like his other writings, it is\nvery short, contains not a few cryptic passages whose meaning has\nnever been satisfactorily fleshed out, and does not always sit well\nwith his pronouncements in other writings. There is good reason to\nbelieve that Yesod Mora was written shortly before Ibn Ezra’s\ndeath, and it thus may comprise his final statement on the issues.\n\n\nThe beginning of Yesod Mora contains a valuable survey of the\nsciences. This is not a formal classification of the type written by\nal-Fârâbî and many others, whose aim is to put in\ntheir proper place all of the sciences. Instead, Ibn Ezra critically\nreviews the various branches of learning which are favored by groups\nof Jewish scholars. There are those whose “entire wisdom”\nconsists in masora, the traditional inventory of letters and phonetic\nmarkings in Scripture. Some are interested only in Hebrew grammar;\nothers study only the Bible, yet others are interested only in the\nTalmud. None of these groups can achieve the wisdom they seek,\nhowever, without studying astronomy (hokhmat ha-mazalot).\nAstronomy in turn requires a foundation in geometry (hokhmat\nha-middot).  Also mandatory are psychology (hokhmat\nha-nefesh), which in turn has a perquisite physics, or perhaps\nmore accurately, physiology (toledet ha-shamayim, literally\n“that which is produced [or induced] by the heavens”;\ntoledet refers generally to transformations of matter, but,\nin Ibn Ezra’s usage, it is almost always applied to biological\nprocesses). Finally, logic (hokhmatha-mivta), “the\nbalance of all wisdom” is also indispensable.\n\n\nTowards the end of this disquisition, theosophy of some sort (sod\nha-merkaba, shi‘ur qoma) is mentioned; Ibn Ezra\nseems to approve of it, if approached properly. At the very end of the\npassage, Ibn Ezra tries to tie everything together into a coherent\nstudy plan: “How can someone attempt to know something more\nsublime than he, if he knows neither his soul nor his body? Only he\nwho knows physics (or physiology?) and all of its proofs and logic can\nknow the universals that are preserved like a seal. Astronomy can be\nknown by means of clear proofs drawn from arithmetic (hokhmat\nha-heshbon), geometry (hokhmat ha-middot), and\nproportions (hokhmat ha-‘arakhim).  Only then will he\nbe able to ascend high above, and to know the secret of the soul, the\nsupernal angels, and the world to come.” The plan calls for\nstudy of the body and soul, and astronomy as well, with the aim of\nsecuring universals. One can then move beyond the stars to “the\nsecret of the soul” and the world or worlds beyond our own. The\norder in which the sciences are to be studied is clear enough, the\nconnection between them far less so.\n\n\nIbn Ezra never makes a clean break between traditional or religious\nsciences; quite the contrary, he urges all along that the sciences\nthat we would call secular are mandatory for understanding scriptural,\nlegal, and other issues of concern to Jews, not the least of which, of\ncourse, is self-fulfillment. In the course of a long list of examples\nthat illustrating this need, astrology (mishpatei ha-mazalot)\nis mentioned only once. Clearly, in this key text at least, Ibn Ezra\ndoes not accord to astrology the major standing it holds in his\nlegacy.  Moreover, none of the disciplines named seems to stand for\n“philosophy”, though psychology, some sort of natural\nphilosophy, and theosophy are all mentioned separately. (See: What is\n“Philosophy” for Ibn Ezra?) In any case, the separate\nlisting of psychology lends credence to our claim that Ibn Ezra’s\nclear interest in the science of the soul is independent of, and by no\nmeans indicative of, any strong interest in philosophy in general.\n\n\nThe second chapter begins with an encomium to logic: “How noble\nis the science of logic, and it commences with knowledge of the five\nwords (millot).” Ibn Ezra seems to be referring to the\nquinque voces; he names here “high universal”,\n“lower universal” or “high species”, and\n“low species”. Understanding species and other such groups\nare of great use in classifying commandments, as well as in resolving\nsome apparent contradictions between biblical texts. However, the\nlogic applied is extremely basic, and once again, we have no evidence\nthat Ibn Ezra knew more than the basic terminology.\n\n\nThe discussion then moves on to commandments that are contingent,\ninsofar as they depend upon, or are limited to, a certain group (e.g.\npriests), an institution (e.g. temple sacrifices), gender specific\n(e.g. circumcision). This sifting allows Ibn Ezra, in chapter five, to\nget at those commandments that are absolute, “principles that do\nnot depend upon a given time, a given place, or anything else.”\nThese commandments, “planted in the heart”, were known by\nmeans of reason even before the giving of the Torah. Ibn Ezra himself\nthus inserts, at the heart of this very Jewish, and legalistic,\ntreatise, the rational, humanistic outlook that marks his philosophy:\nthe core demands of Judaism depend not upon revelation but upon innate\nhuman reason, and they are no different from the rules that must\ngovern every human. \n11. Philosophical Allegory: Hayy ben Meqitz\n\n\nIbn Ezra has left us one writing that undoubtedly fits into a very\nspecial medieval philosophical tradition: a visionary recital, or\ninitiatory tale, in rhymed Hebrew prose, Hayy ben Meqitz\n(Levin 1985, 119–132). The great tenth century philosopher Ibn Sina\nwrote a philosophical allegory Hayy bin Yaqzân, and the\nAndalusian Ibn Tufayl, as well as the Persian expatriate Suhrawardi\npenned distinct versions, each tale suited to the message that its\nauthor wished to convey. Ibn Ezra’s Hebrew composition fits into this\nspecial theme of philosophical allegory.\n\n\n In Ibn Ezra’s version, Hayy is the guide—an old man on whom\ntime has not taken its toll. The narrator, who has fled his home,\nmeets Hayy, who enchants him with words of wisdom, then invites him to\nimmerse himself in the fountain of life and imbibe its waters. Hayy\nthen guides the narrator through eight “kingdoms,” that\nis, the stellar spheres, describing their astrological associations in\nvivid imagery, then to the angelic realm. The narrator asks if is\nthere anything beyond, something that he cannot see? Hayy replies\npositively; there is “the One, who has no second”, sublime\nand invisible. However, he continues, if the narrator will follow in\nHayy’s path, he will yet be able to know and see Him.\n\n\nThis philosophical tale further complicates the question of Ibn\nEzra’s doctrinal allegiances. Issues such as the structure of\nthe soul or the contours of union with the divine, which are not\ntreated systematically or uniformly elsewhere, cannot be fully\nharmonized with Ibn Ezra’s pronouncements\nelsewhere. Hayy is the only one of Ibn Ezra’s\nphilosophical ventures that has no intrinsic connection to Judaism.\nSnippets of biblical verses are skillfully woven into Hayy,\nmaking the poem amenable to the Jewish reader and making it easier for\nthe reader to answer the invitation—if one is indeed\nextended—to join the excursion under Hayy’s guidance. On\nthe other hand, the ritual immersion in the nude that the narrator\nperforms, while not totally foreign to Judaism, must have seemed to\ncarry Christian overtones to some readers. It should be borne in mind\nthat Ibn Ezra wrote Hayy at the request of Samuel Ibn Jami, a learned\nand philosophically inclined North African Jew, himself a poet. Is\nHayy the response to a literary challenge?\n\n \nGreive (1973, 103–114) characterizes Hayy as “a\nreligious-philosophical work, expressed in a mystical fashion.”\nIt is part of a tradition of Himmelsreisen that stretches\nback to antiquity and is open to a number of interpretations. Three\ncentral moments can be discerned: (1) The soul’s imprisonment in\nthe terrestrial world, which is foreign to her; (2) the role of\nself-knowledge (i.e. coming to know one’s true, other-worldly\nself) in the process of liberation; (3) wisdom as the means to this\nliberation.  Greive explores in particular, the literary connections\nwith Avicenna’s recital, also called ‘Hayy’, as well\nas Ibn Gabirol’s liturgical masterpiece, Keter\nMalkhut.\n\n \nMore recently, Aaron Hughes (2004, 186) has strongly emphasized the\nneoplatonic aesthetics at play in Hayy, asserting that\naesthetics and poetry are “currency whereby the imagination and\nphilosophy are able to tease out and subsequently map the various\nrelationships between the physical and the metaphysical”.",
    "section_title": "8. Poetry and the Science of the Soul",
    "entry_title": "Abraham Ibn Ezra",
    "hierarchy_title": "Abraham Ibn Ezra || Poetry and the Science of the Soul",
    "tokenized_text": [
        "poetry",
        "science",
        "soul",
        "poetry",
        "science",
        "soul",
        "ibn",
        "ezra",
        "human",
        "soul",
        "unchanging",
        "eternal",
        "entity",
        "universe",
        "thing",
        "said",
        "similar",
        "sense",
        "god",
        "example",
        "opening",
        "sentence",
        "sefer",
        "tzahut",
        "grammatical",
        "treatise",
        "state",
        "human",
        "soul",
        "created",
        "image",
        "god",
        "action",
        "similar",
        "levin",
        "end",
        "yesod",
        "mora",
        "cohen",
        "cite",
        "five",
        "point",
        "resemblance",
        "soul",
        "god",
        "noted",
        "talmud",
        "implies",
        "shi",
        "ur",
        "qoma",
        "professes",
        "similar",
        "doctrine",
        "ibn",
        "ezra",
        "take",
        "similarity",
        "rather",
        "literally",
        "seems",
        "given",
        "state",
        "affair",
        "surprise",
        "science",
        "soul",
        "branch",
        "philosophy",
        "concerning",
        "ibn",
        "ezra",
        "say",
        "ibn",
        "ezra",
        "evinces",
        "little",
        "interest",
        "metaphysics",
        "theologiansthat",
        "question",
        "divine",
        "attribute",
        "substance",
        "accident",
        "forth",
        "psychology",
        "metaphysics",
        "alone",
        "delved",
        "question",
        "beyond",
        "material",
        "world",
        "approaching",
        "godhead",
        "revealing",
        "remark",
        "call",
        "ibn",
        "gabirol",
        "great",
        "sage",
        "secret",
        "sod",
        "soul",
        "come",
        "surprise",
        "penetrating",
        "study",
        "ibn",
        "ezra",
        "thought",
        "wolfson",
        "tanenbaum",
        "hughes",
        "labaton",
        "dwell",
        "length",
        "ibn",
        "ezra",
        "conception",
        "soul",
        "ibn",
        "ezra",
        "attitude",
        "towards",
        "psychology",
        "emerges",
        "mainly",
        "poetry",
        "simply",
        "copied",
        "sterile",
        "classification",
        "scheme",
        "poetry",
        "anything",
        "nourished",
        "image",
        "neoplatonist",
        "scholarly",
        "literature",
        "fact",
        "psychology",
        "one",
        "arena",
        "sharp",
        "conflict",
        "philosopher",
        "mutakallimūn",
        "suggested",
        "ibn",
        "ezra",
        "mainly",
        "influenced",
        "sa",
        "adiah",
        "gaonimand",
        "thus",
        "also",
        "kalamistsmany",
        "idea",
        "soul",
        "derive",
        "tradition",
        "hebrew",
        "poetry",
        "spain",
        "unlike",
        "kalam",
        "little",
        "interest",
        "psychology",
        "obsessed",
        "release",
        "world",
        "hebrew",
        "poet",
        "rule",
        "identify",
        "classical",
        "neoplatonist",
        "seeking",
        "salvation",
        "release",
        "soul",
        "mundane",
        "captivity",
        "even",
        "ibn",
        "ezra",
        "prose",
        "pronouncement",
        "concerning",
        "soul",
        "longing",
        "return",
        "source",
        "tend",
        "towards",
        "lyrical",
        "fact",
        "small",
        "clear",
        "borrowing",
        "long",
        "liturgy",
        "halevi",
        "consider",
        "passage",
        "introduction",
        "commentary",
        "ecclesiastes",
        "passerby",
        "taken",
        "prisoner",
        "longs",
        "return",
        "homeland",
        "family",
        "intellectizing",
        "spirit",
        "yearn",
        "grab",
        "hold",
        "higher",
        "rung",
        "ascends",
        "formation",
        "living",
        "god",
        "dwell",
        "material",
        "housesthis",
        "transpire",
        "spirit",
        "whitens",
        "sanctifying",
        "impurity",
        "disgusting",
        "bodily",
        "lust",
        "sully",
        "holythen",
        "distant",
        "like",
        "near",
        "night",
        "like",
        "day",
        "configured",
        "know",
        "real",
        "truth",
        "inscribed",
        "upon",
        "way",
        "erased",
        "departs",
        "body",
        "script",
        "writing",
        "god",
        "brought",
        "order",
        "shown",
        "reason",
        "imprisoned",
        "end",
        "term",
        "levin",
        "prose",
        "exposition",
        "replete",
        "imagery",
        "devoid",
        "like",
        "similar",
        "account",
        "ibn",
        "ezra",
        "writing",
        "thorough",
        "discussion",
        "soul",
        "structure",
        "origin",
        "path",
        "liberation",
        "kind",
        "one",
        "find",
        "islamic",
        "neoplatonic",
        "tradition",
        "including",
        "jewish",
        "work",
        "pseudobahya",
        "really",
        "reworking",
        "rhymed",
        "prosethe",
        "medium",
        "ibn",
        "gabirol",
        "liturgical",
        "masterpiece",
        "keter",
        "malkhutof",
        "theme",
        "inspire",
        "ibn",
        "ezra",
        "poem",
        "nonetheless",
        "ibn",
        "ezra",
        "undoubtedly",
        "impress",
        "reader",
        "great",
        "pathos",
        "obvious",
        "sincerity",
        "liturgy",
        "hymn",
        "tzom",
        "ah",
        "nafshi",
        "soul",
        "thirst",
        "one",
        "powerful",
        "expression",
        "longing",
        "divine",
        "hebrew",
        "letter",
        "ibn",
        "ezra",
        "experienced",
        "deeply",
        "fully",
        "soul",
        "alienation",
        "world",
        "longing",
        "divine",
        "redemption",
        "poetic",
        "expression",
        "awesome",
        "feeling",
        "served",
        "better",
        "credential",
        "expertise",
        "matter",
        "soul",
        "could",
        "academic",
        "diploma",
        "excursus",
        "soul",
        "comment",
        "ecclesiastes",
        "best",
        "way",
        "grasp",
        "said",
        "far",
        "ibn",
        "ezra",
        "interest",
        "influence",
        "style",
        "look",
        "sample",
        "passage",
        "peculiarity",
        "writing",
        "difficulty",
        "piecing",
        "together",
        "philosophy",
        "examined",
        "situ",
        "speak",
        "lengthy",
        "excursus",
        "structure",
        "human",
        "soul",
        "commentary",
        "ecclesiastes",
        "offer",
        "opportunity",
        "ibn",
        "ezra",
        "briefly",
        "note",
        "tripartite",
        "division",
        "soul",
        "vegetable",
        "animal",
        "rational",
        "tell",
        "u",
        "scheme",
        "adopted",
        "scholar",
        "base",
        "claim",
        "upon",
        "proof",
        "hakhmei",
        "hara",
        "ayot",
        "one",
        "achieve",
        "full",
        "understanding",
        "reading",
        "many",
        "book",
        "specific",
        "lexical",
        "grammatical",
        "problem",
        "requires",
        "exegete",
        "go",
        "length",
        "however",
        "inquiry",
        "soul",
        "mandated",
        "verse",
        "one",
        "place",
        "ecclesiastes",
        "king",
        "solomon",
        "face",
        "contradicted",
        "therefore",
        "verse",
        "requires",
        "explication",
        "citing",
        "length",
        "apparent",
        "contradiction",
        "ibn",
        "ezra",
        "proposes",
        "alternative",
        "psychology",
        "scholar",
        "employing",
        "different",
        "tripartite",
        "scheme",
        "different",
        "terminology",
        "nefesh",
        "appetite",
        "lust",
        "ru",
        "ah",
        "sensation",
        "domineering",
        "neshamah",
        "wisdom",
        "intimate",
        "switch",
        "sake",
        "convenience",
        "though",
        "truth",
        "appears",
        "otherwise",
        "ibn",
        "ezra",
        "note",
        "passing",
        "sa",
        "adiah",
        "employed",
        "second",
        "classification",
        "rationale",
        "commandment",
        "yesod",
        "mora",
        "systematic",
        "formulation",
        "ibn",
        "ezra",
        "philosophical",
        "idea",
        "found",
        "yesod",
        "mora",
        "foundation",
        "reverence",
        "cohen",
        "significantly",
        "monograph",
        "rationale",
        "commandment",
        "perhaps",
        "key",
        "field",
        "along",
        "biblical",
        "interpretation",
        "overlap",
        "somewhat",
        "development",
        "specifically",
        "judaic",
        "philosophy",
        "like",
        "writing",
        "short",
        "contains",
        "cryptic",
        "passage",
        "whose",
        "meaning",
        "never",
        "satisfactorily",
        "fleshed",
        "always",
        "sit",
        "well",
        "pronouncement",
        "writing",
        "good",
        "reason",
        "believe",
        "yesod",
        "mora",
        "written",
        "shortly",
        "ibn",
        "ezra",
        "death",
        "thus",
        "may",
        "comprise",
        "final",
        "statement",
        "issue",
        "beginning",
        "yesod",
        "mora",
        "contains",
        "valuable",
        "survey",
        "science",
        "formal",
        "classification",
        "type",
        "written",
        "alfârâbî",
        "many",
        "others",
        "whose",
        "aim",
        "put",
        "proper",
        "place",
        "science",
        "instead",
        "ibn",
        "ezra",
        "critically",
        "review",
        "various",
        "branch",
        "learning",
        "favored",
        "group",
        "jewish",
        "scholar",
        "whose",
        "entire",
        "wisdom",
        "consists",
        "masora",
        "traditional",
        "inventory",
        "letter",
        "phonetic",
        "marking",
        "scripture",
        "interested",
        "hebrew",
        "grammar",
        "others",
        "study",
        "bible",
        "yet",
        "others",
        "interested",
        "talmud",
        "none",
        "group",
        "achieve",
        "wisdom",
        "seek",
        "however",
        "without",
        "studying",
        "astronomy",
        "hokhmat",
        "hamazalot",
        "astronomy",
        "turn",
        "requires",
        "foundation",
        "geometry",
        "hokhmat",
        "hamiddot",
        "also",
        "mandatory",
        "psychology",
        "hokhmat",
        "hanefesh",
        "turn",
        "perquisite",
        "physic",
        "perhaps",
        "accurately",
        "physiology",
        "toledet",
        "hashamayim",
        "literally",
        "produced",
        "induced",
        "heaven",
        "toledet",
        "refers",
        "generally",
        "transformation",
        "matter",
        "ibn",
        "ezra",
        "usage",
        "almost",
        "always",
        "applied",
        "biological",
        "process",
        "finally",
        "logic",
        "hokhmathamivta",
        "balance",
        "wisdom",
        "also",
        "indispensable",
        "towards",
        "end",
        "disquisition",
        "theosophy",
        "sort",
        "sod",
        "hamerkaba",
        "shi",
        "ur",
        "qoma",
        "mentioned",
        "ibn",
        "ezra",
        "seems",
        "approve",
        "approached",
        "properly",
        "end",
        "passage",
        "ibn",
        "ezra",
        "try",
        "tie",
        "everything",
        "together",
        "coherent",
        "study",
        "plan",
        "someone",
        "attempt",
        "know",
        "something",
        "sublime",
        "know",
        "neither",
        "soul",
        "body",
        "know",
        "physic",
        "physiology",
        "proof",
        "logic",
        "know",
        "universal",
        "preserved",
        "like",
        "seal",
        "astronomy",
        "known",
        "mean",
        "clear",
        "proof",
        "drawn",
        "arithmetic",
        "hokhmat",
        "haheshbon",
        "geometry",
        "hokhmat",
        "hamiddot",
        "proportion",
        "hokhmat",
        "ha",
        "arakhim",
        "able",
        "ascend",
        "high",
        "know",
        "secret",
        "soul",
        "supernal",
        "angel",
        "world",
        "come",
        "plan",
        "call",
        "study",
        "body",
        "soul",
        "astronomy",
        "well",
        "aim",
        "securing",
        "universal",
        "one",
        "move",
        "beyond",
        "star",
        "secret",
        "soul",
        "world",
        "world",
        "beyond",
        "order",
        "science",
        "studied",
        "clear",
        "enough",
        "connection",
        "far",
        "le",
        "ibn",
        "ezra",
        "never",
        "make",
        "clean",
        "break",
        "traditional",
        "religious",
        "science",
        "quite",
        "contrary",
        "urge",
        "along",
        "science",
        "would",
        "call",
        "secular",
        "mandatory",
        "understanding",
        "scriptural",
        "legal",
        "issue",
        "concern",
        "jew",
        "least",
        "course",
        "selffulfillment",
        "course",
        "long",
        "list",
        "example",
        "illustrating",
        "need",
        "astrology",
        "mishpatei",
        "hamazalot",
        "mentioned",
        "clearly",
        "key",
        "text",
        "least",
        "ibn",
        "ezra",
        "accord",
        "astrology",
        "major",
        "standing",
        "hold",
        "legacy",
        "moreover",
        "none",
        "discipline",
        "named",
        "seems",
        "stand",
        "philosophy",
        "though",
        "psychology",
        "sort",
        "natural",
        "philosophy",
        "theosophy",
        "mentioned",
        "separately",
        "see",
        "philosophy",
        "ibn",
        "ezra",
        "case",
        "separate",
        "listing",
        "psychology",
        "lends",
        "credence",
        "claim",
        "ibn",
        "ezra",
        "clear",
        "interest",
        "science",
        "soul",
        "independent",
        "mean",
        "indicative",
        "strong",
        "interest",
        "philosophy",
        "general",
        "second",
        "chapter",
        "begin",
        "encomium",
        "logic",
        "noble",
        "science",
        "logic",
        "commences",
        "knowledge",
        "five",
        "word",
        "millot",
        "ibn",
        "ezra",
        "seems",
        "referring",
        "quinque",
        "vox",
        "name",
        "high",
        "universal",
        "lower",
        "universal",
        "high",
        "specie",
        "low",
        "specie",
        "understanding",
        "specie",
        "group",
        "great",
        "use",
        "classifying",
        "commandment",
        "well",
        "resolving",
        "apparent",
        "contradiction",
        "biblical",
        "text",
        "however",
        "logic",
        "applied",
        "extremely",
        "basic",
        "evidence",
        "ibn",
        "ezra",
        "knew",
        "basic",
        "terminology",
        "discussion",
        "move",
        "commandment",
        "contingent",
        "insofar",
        "depend",
        "upon",
        "limited",
        "certain",
        "group",
        "eg",
        "priest",
        "institution",
        "eg",
        "temple",
        "sacrifice",
        "gender",
        "specific",
        "eg",
        "circumcision",
        "sifting",
        "allows",
        "ibn",
        "ezra",
        "chapter",
        "five",
        "get",
        "commandment",
        "absolute",
        "principle",
        "depend",
        "upon",
        "given",
        "time",
        "given",
        "place",
        "anything",
        "else",
        "commandment",
        "planted",
        "heart",
        "known",
        "mean",
        "reason",
        "even",
        "giving",
        "torah",
        "ibn",
        "ezra",
        "thus",
        "insert",
        "heart",
        "jewish",
        "legalistic",
        "treatise",
        "rational",
        "humanistic",
        "outlook",
        "mark",
        "philosophy",
        "core",
        "demand",
        "judaism",
        "depend",
        "upon",
        "revelation",
        "upon",
        "innate",
        "human",
        "reason",
        "different",
        "rule",
        "must",
        "govern",
        "every",
        "human",
        "philosophical",
        "allegory",
        "hayy",
        "ben",
        "meqitz",
        "ibn",
        "ezra",
        "left",
        "u",
        "one",
        "writing",
        "undoubtedly",
        "fit",
        "special",
        "medieval",
        "philosophical",
        "tradition",
        "visionary",
        "recital",
        "initiatory",
        "tale",
        "rhymed",
        "hebrew",
        "prose",
        "hayy",
        "ben",
        "meqitz",
        "levin",
        "great",
        "tenth",
        "century",
        "philosopher",
        "ibn",
        "sina",
        "wrote",
        "philosophical",
        "allegory",
        "hayy",
        "bin",
        "yaqzân",
        "andalusian",
        "ibn",
        "tufayl",
        "well",
        "persian",
        "expatriate",
        "suhrawardi",
        "penned",
        "distinct",
        "version",
        "tale",
        "suited",
        "message",
        "author",
        "wished",
        "convey",
        "ibn",
        "ezra",
        "hebrew",
        "composition",
        "fit",
        "special",
        "theme",
        "philosophical",
        "allegory",
        "ibn",
        "ezra",
        "version",
        "hayy",
        "guidean",
        "old",
        "man",
        "time",
        "taken",
        "toll",
        "narrator",
        "fled",
        "home",
        "meet",
        "hayy",
        "enchants",
        "word",
        "wisdom",
        "invite",
        "immerse",
        "fountain",
        "life",
        "imbibe",
        "water",
        "hayy",
        "guide",
        "narrator",
        "eight",
        "kingdom",
        "stellar",
        "sphere",
        "describing",
        "astrological",
        "association",
        "vivid",
        "imagery",
        "angelic",
        "realm",
        "narrator",
        "asks",
        "anything",
        "beyond",
        "something",
        "see",
        "hayy",
        "reply",
        "positively",
        "one",
        "second",
        "sublime",
        "invisible",
        "however",
        "continues",
        "narrator",
        "follow",
        "hayy",
        "path",
        "yet",
        "able",
        "know",
        "see",
        "philosophical",
        "tale",
        "complicates",
        "question",
        "ibn",
        "ezra",
        "doctrinal",
        "allegiance",
        "issue",
        "structure",
        "soul",
        "contour",
        "union",
        "divine",
        "treated",
        "systematically",
        "uniformly",
        "elsewhere",
        "fully",
        "harmonized",
        "ibn",
        "ezra",
        "pronouncement",
        "elsewhere",
        "hayy",
        "one",
        "ibn",
        "ezra",
        "philosophical",
        "venture",
        "intrinsic",
        "connection",
        "judaism",
        "snippet",
        "biblical",
        "verse",
        "skillfully",
        "woven",
        "hayy",
        "making",
        "poem",
        "amenable",
        "jewish",
        "reader",
        "making",
        "easier",
        "reader",
        "answer",
        "invitationif",
        "one",
        "indeed",
        "extendedto",
        "join",
        "excursion",
        "hayy",
        "guidance",
        "hand",
        "ritual",
        "immersion",
        "nude",
        "narrator",
        "performs",
        "totally",
        "foreign",
        "judaism",
        "must",
        "seemed",
        "carry",
        "christian",
        "overtone",
        "reader",
        "borne",
        "mind",
        "ibn",
        "ezra",
        "wrote",
        "hayy",
        "request",
        "samuel",
        "ibn",
        "jami",
        "learned",
        "philosophically",
        "inclined",
        "north",
        "african",
        "jew",
        "poet",
        "hayy",
        "response",
        "literary",
        "challenge",
        "greive",
        "characterizes",
        "hayy",
        "religiousphilosophical",
        "work",
        "expressed",
        "mystical",
        "fashion",
        "part",
        "tradition",
        "himmelsreisen",
        "stretch",
        "back",
        "antiquity",
        "open",
        "number",
        "interpretation",
        "three",
        "central",
        "moment",
        "discerned",
        "soul",
        "imprisonment",
        "terrestrial",
        "world",
        "foreign",
        "role",
        "selfknowledge",
        "ie",
        "coming",
        "know",
        "one",
        "true",
        "otherworldly",
        "self",
        "process",
        "liberation",
        "wisdom",
        "mean",
        "liberation",
        "greive",
        "explores",
        "particular",
        "literary",
        "connection",
        "avicenna",
        "recital",
        "also",
        "called",
        "hayy",
        "well",
        "ibn",
        "gabirol",
        "liturgical",
        "masterpiece",
        "keter",
        "malkhut",
        "recently",
        "aaron",
        "hughes",
        "strongly",
        "emphasized",
        "neoplatonic",
        "aesthetic",
        "play",
        "hayy",
        "asserting",
        "aesthetic",
        "poetry",
        "currency",
        "whereby",
        "imagination",
        "philosophy",
        "able",
        "tease",
        "subsequently",
        "map",
        "various",
        "relationship",
        "physical",
        "metaphysical"
    ]
}