{
    "main_text": "Place\n8. Place\n\nAristotle holds that place is something but it is neither form nor\nmatter. He gives several reasons against place being either of the two\nand argues, for instance, “If a thing’s place is in the\nthing (as it must be if it is either its form or its matter), place\nwill be in place” (Phys. IV.2, 210a5–6) and the\nresult is absurd. The passage causes Averroes to depart from the\nsubject and he first considers the following propositions concerning\nplace:\n\n\nFirst, form and matter move by means of the body composed of them\nboth. Second, in so far as they move, they need to be in place. Third\nif one of them is place, place must be in place. The second and third\npropositions are true, the first is not. (LC 129B TC20)\n\n\nAverroes reminds us that in Book VII, Aristotle says that the proper\nsubject of change and motion is body, not its matter or its form.\nMatter and form are in place accidentally and “it is not\nimpossible that place is in place accidentally, per\naccidens” (LC 129C). What is accidental divides into two\ncategories, always accidental or rarely so. Matter and form always\nmove together with the body, therefore place belongs to the category\nof always accident, and if it is constant, place is in place all the\ntime, but it is obvious that place is not always in place, either\nessentially or accidentally. The argument makes an exception: the\nplace of the outermost body, the place embracing the last body,\nbecause it moves together with the outermost body, and in this case it\nis in place accidentally and raro, rarely (LC 129E).\n\nAlexander of Aphrodisias objected because place is related to\nquantity: Place is equal to the thing that it contains. If a body\nmoves, it moves into a place that is equal to it, and for this reason\nform or matter are in place essentially. Alexander’s commentary\non the Physics has not reached us, and we have to rely on\nAverroes’ account. He admits: “that which Alexander said\nis not free of doubt” (LC 129F).\n\nLater on (LC 133H TC30) Averroes refers again to Alexander; he\ncomments on Phys. IV 210b31–211a6, and makes five\nstatements concerning ‘place’ that he considers to be\nAristotelian:\n\nPlace contains what is in place and is different from it;\nPlace is equal to what is in place;\nPlace is separate from what is in place, and Averroes quotes\nAristotle: “it is also devoid of any kind of particulars and is\nseparated from them”, extra quodcunque singularium, et\nseparatur ab eis;\nAbove and below are the directions of place;\nPlace is that toward which what is in place naturally moves.\n\n\nAccording to Averroes, Alexander read in statement 3: “It\n[place] is not devoid of any particulars and is\nseparated”, instead of the affirmative sentence “It is\nalso devoid of any particulars and is separated from them” (LC\n133H). Averroes should have read Isḥāq Ibn\nḤunayn’s translation. The Arabic translation of\nIsḥāq reads here “[Place] is devoid of any aspects\nand it is separable” (Aristotle, Ṭabīʻa\n[1964: 302: 9–10]), and it coincides with Ross’ edition\n(apoleipesthai ekastou, 211a2; [Ross 1936]). Averroes thinks\nthat Alexander’s reading is “more true, but it is not\nknown per se”, and that Alexander would choose this\nreading to oppose those who pretend the place to be the void.\n\nSince place is neither matter nor form nor extension,\ndimensio, i.e., an extension that is always independent from\nthat of the movable, Aristotle concludes that place has to be the\nlimit of the surrounding body (peras tou periekhontos\nsōmatos, Phys. IV.4, 212a2–6). Place does not\nmove essentially, and Averroes says that Aristotle gave a renowned\nargument, rationemfamosam, to support his tenet (LC 140F\nTC42; Phys. 212a21–30). The surface surrounding the\nlast sphere of universe is the absolute above, and the center of the\nuniverse, i.e., the earth, the absolute below and just as the center\nis stable, the outmost surface is too; they cannot move at all.\nAverroes adds that the air is above and the water below “but not\nabsolutely”, since Aristotle could mention fire also, as being\nlight. The argument can be organized as a syllogism of the second\nfigure, and two affirmative propositions: “The highest [body] has to\nbe stable, fixum; the outermost circulating [body] is stable;\nergo, the highest [body] is the outermost circulating” (LC\n140G).\n\n1) Averroes now faces a great question, magna quaestio, in\nrelation to Phys. IV.5, 212a31–b3, a passage where\nAristotle mentions the circular motion in the universe (his\ncommentary, TC43, occupies LC 141C through LC 143C). We know that the\noutermost sphere moves with the daily rotation but “as a whole\nit does not simultaneously change its place, though it moves in a\ncircle: for this place is the place of its parts”. Only their\nparts, the four elements, change place (Phys. 212b1). For\nthis accidental reason, Aristotle grants it some kind of place. The\nAristotelian passage remained obscure and discussions about the place\nof the universe arose.\n\nAverroes expresses the dilemma: “We have the choice between either of\ntwo options: either we affirm that something moving is not in place,\nor we affirm that place is the void, and it is extension” (LC 141F\nTC43). Averroes mentions the views of John Philoponus (d. 570 CE) and\nThemistius (d. 387 CE). For Philoponus, the solution to the dilemma\nconsisted in taking place as extension, dimensio, and\naccepting the existence of the void. Averroes seems to have had access\nto Philoponus’ Corollary on Place, the Greek original\nof which is extant (Philoponus CAG 17: 557–585) and has been\ntranslated into English (1991). We will see below that Averroes\nrejects the existence of the void.\n\n2) For Themistius, the celestial body is in a place “not in\naccordance with the whole but with the parts” (secundum\npartes, LC 141F TC43), and Averroes explains that “It means\nin accordance with the spheres that the largest sphere\ncontains”, and we should understand that Themistius skipped the\nfive elements. Averroes interprets that the latter is the sphere of\nthe fixed stars, which is not surrounded by anything else and the\nconcavity of which surrounds everything. Moreover he refers to the\n“natural science” of his time that proved that there is a\nninth sphere, the one of the daily motion, and if so, we can affirm\nthat the motion of the latter is “the essential motion of the\nwhole universe, orbis” (essentialiter, LC 141H\nT43).\n\n3) The magna quaestio is many-sided. Averroes recalls a\npassage in Physics VI, 240a29–b7, where Aristotle\nrefuted Zeno’s fourth argument against motion and asserted that\nthe sphere moves in accordance with the whole as well as with the\nparts. Therefore, if Themistius claimed that the sphere is in place\nnot in accordance with the whole but only with the parts, because he\nthought that only its parts change place, he would contradict\nAristotle’s views (LC 141I).\n\nAverroes says that Themistius could argue that Aristotle in\nPhysics VI meant the same as here in Physics IV,\ni.e., that the sphere does not change its place as a whole\n(Phys. 212a35). Averroes restricts the assertion to the\nspherical body of the universe. Other spheres move because of their\nparts, which change their places, and the parts are all the celestial\nbodies:\n\n\nWhen he said “but it can move in a circle” (alio modo\nmovetur circulariter 212a35–b1) he meant that the circular\nmotion is predicated of the whole because of certain of its parts,\ni.e., the celestial bodies, in the same manner as rectilinear motion\nis predicated of them because of the motion of the elements, which are\nalso some parts of them. (LC 141K TC43)\n\n\nThemistius interpreted that since Aristotle said that the heavenly\nbody (coelum) is in place per accidens, he assumed\nanother heavenly body to be in place (I add, per se) and\nAverroes explains “another heavenly body” as all celestial\nspheres, orbium. According to Themistius, per\naccidens is such a wide category that the commentators before him\ndid not find the term adequate and they said the heavenly body to be\nin a place because of its parts. Themistius and Averroes share the\nview that Aristotle here was using the term per accidens\nfreely (LC 141M). Themistius is a highly regarded authority but\nAverroes will formulate his own solution.\n\nAccording to Aristotle—so he understands him—the\nrectilinearly moving bodies are in place per se, essentially,\nthe rotating bodies, accidentally, per accidens, and the\nwhole universe is in place because of its parts, and parts mean the\nfive elementary bodies (LC 142CD TC43). But before reaching his\nconclusion Averroes has to clear the way refuting Avempace’s\ndoctrine:\n\n4) Avempace (d. 1138) had his own view on the issue. The sphere is not\nin place because nothing encloses it from outside. “The place of\nthe sphere that is envisioned by this, in so far as it is sphere, is\nthe convexity of the center, around which it rotates” (LC 142A\nT43). Avempace would take Aristotle’s definition of place as\nthat which surrounds the body and apply it to the external surface of\nthe bodies moving rectilinearly and to the internal surface of the\nbodies rotating. Averroes conjectures that Avempace borrowed his view\nfrom al-Fārābī (d. c. 950) who refuted the opinions of\nJoannes Philoponus on place but al-Fārābī’s book\n“did not fall into our hands”, he says.\n\nAverroes expounded Avempace’s view in the Short (SC\n53:10–56:10; Lettinck 1994: 316), and the Middle Commentary at\nlength (MC Kalonymos L 45vº22–47rº23) but he also\nrefers to it in the LC where he rejects it because Avempace\n“abandoned Aristotle’s discourse and erred heavily”\n(LC 142K TC43). Avempace and al-Fārābī should maintain\nthat the sphere is in place essentially, and Averroes’\nsummarizing words in the MC may be worth of being translated:\n\n\nWhat we told about place of the sphere is that which Abū Bakr Ibn\nal-Ṣā’igh and Abū Naṣr\n[al-Fārābī] before him, considered, i.e., that its\nparts are in place essentially, i.e., by means of its center. Place is\nsaid by equivocity with regard to the place of the spherical body and\nto the place of the body [moving] in straight lines. Indeed, it\nappears [to me] that it is most reasonable to say that the sphere is\nin place accidentally by means of its center which [the sphere]\nsurrounds because what is in place essentially is surrounded, not\nsurrounding. But that which surrounds matches (maqbil) to\nthat which is surrounded. It may be said that which surrounds is\nin that which is surrounded. Since the body of the\nheavens does not have anything surrounding it, it is not in place\nessentially, but it is in place by means of that surrounded by it, and\nthis is accidentally. (MC Kalonymos L 47rº2–10; O\n37vº–38rº)\n\n\n5) Averroes disagrees with Avempace and he still has some reflections\non the magna quaestio. He explains that the rectilinearly\nmoving bodies are in place essentially, the rotating bodies,\naccidentally, and that the whole universe is in place because of its\nparts, as said before (LC 142CD).\n\nHe states: “That which is in place is equal to the place”\n(LC 142D TC43; cf. Phys. IV.4, 212a29–30). This means,\nin its proper sense, that the contents of both have to be equal, but\nthe surface of the concave sphere is not equal to the surfaces of the\nembraced spheres. Averroes refers to their content, and says\n“that equality is impossible, unless place were the void”\n(ista aequalitas non est vera de loco, nisi inane esset, LC\n142E TC43). Averroes looks for an answer. The universe is at rest as a\nwhole. The earth is the center of the universe and the center is at\nrest, and it is in place essentially. The heavenly body\n(coelum) is not at rest in so far as its parts, i.e., the\nvarious spheres, move but it does not translocate, non\ntransmutatur, and for this reason it is in place accidentally (LC\n142G T43). His reference is Aristotle, but Bekker’s edition of\nthe passage 212b7–13 simply reads that “some things [are]\nin place accidentally like the soul and the heavenly\n body”.[7]\n\nIf the heavenly body is in place accidentally, per accidens,\nthe following objection could be raised: Is its motion also\naccidental? (LC 142K TC43). And if its motion is accidental, since the\nmotion of the heavenly body precedes all other motions, an accidental\nmotion will precede any essential motion. Averroes answers the\nobjection saying that all “that move by themselves need something at\nrest, around which they move, as Aristotle says in the Book about the\nlocal motions of the animals,” (De motu animalium, LC 142L\nTC43) but it does not matter whether a body is at rest essentially or\naccidentally.\n\nAverroes believes this to be the solution and does understand why\nAlexander of Aphrodisias held the view that the sphere of the fixed\nstars is not in a place. Besides he thinks that Alexander influenced\nAvicenna to deny that the heavenly body is in place and to affirm that\nits motion is only “positional”, it changes only its\nposition (situale, LC 144H–I TC47). Averroes final\nposition is read at the beginning of TC44 that comments on\nPhysics IV.4, 212b3–6:\n\n\nSome bodies are in place essentially, and they are those outside of\nwhich there is some surrounding body, and some are in place because\ntheir parts are in place, and this is the condition of the body of the\nAll, and some are in place accidentally, like that which moves\ncircularly. (LC 143E)\n\n",
    "section_title": "8. Place",
    "entry_title": "Ibn Rushd’s Natural Philosophy",
    "hierarchy_title": "Ibn Rushd’s Natural Philosophy || Place",
    "tokenized_text": [
        "place",
        "place",
        "aristotle",
        "hold",
        "place",
        "something",
        "neither",
        "form",
        "matter",
        "give",
        "several",
        "reason",
        "place",
        "either",
        "two",
        "argues",
        "instance",
        "thing",
        "place",
        "thing",
        "must",
        "either",
        "form",
        "matter",
        "place",
        "place",
        "phys",
        "iv",
        "a",
        "result",
        "absurd",
        "passage",
        "cause",
        "averroes",
        "depart",
        "subject",
        "first",
        "considers",
        "following",
        "proposition",
        "concerning",
        "place",
        "first",
        "form",
        "matter",
        "move",
        "mean",
        "body",
        "composed",
        "second",
        "far",
        "move",
        "need",
        "place",
        "third",
        "one",
        "place",
        "place",
        "must",
        "place",
        "second",
        "third",
        "proposition",
        "true",
        "first",
        "lc",
        "b",
        "tc",
        "averroes",
        "reminds",
        "u",
        "book",
        "vii",
        "aristotle",
        "say",
        "proper",
        "subject",
        "change",
        "motion",
        "body",
        "matter",
        "form",
        "matter",
        "form",
        "place",
        "accidentally",
        "impossible",
        "place",
        "place",
        "accidentally",
        "per",
        "accidens",
        "lc",
        "c",
        "accidental",
        "divide",
        "two",
        "category",
        "always",
        "accidental",
        "rarely",
        "matter",
        "form",
        "always",
        "move",
        "together",
        "body",
        "therefore",
        "place",
        "belongs",
        "category",
        "always",
        "accident",
        "constant",
        "place",
        "place",
        "time",
        "obvious",
        "place",
        "always",
        "place",
        "either",
        "essentially",
        "accidentally",
        "argument",
        "make",
        "exception",
        "place",
        "outermost",
        "body",
        "place",
        "embracing",
        "last",
        "body",
        "move",
        "together",
        "outermost",
        "body",
        "case",
        "place",
        "accidentally",
        "raro",
        "rarely",
        "lc",
        "e",
        "alexander",
        "aphrodisia",
        "objected",
        "place",
        "related",
        "quantity",
        "place",
        "equal",
        "thing",
        "contains",
        "body",
        "move",
        "move",
        "place",
        "equal",
        "reason",
        "form",
        "matter",
        "place",
        "essentially",
        "alexander",
        "commentary",
        "physic",
        "reached",
        "u",
        "rely",
        "averroes",
        "account",
        "admits",
        "alexander",
        "said",
        "free",
        "doubt",
        "lc",
        "f",
        "later",
        "lc",
        "h",
        "tc",
        "averroes",
        "refers",
        "alexander",
        "comment",
        "phys",
        "iv",
        "ba",
        "make",
        "five",
        "statement",
        "concerning",
        "place",
        "considers",
        "aristotelian",
        "place",
        "contains",
        "place",
        "different",
        "place",
        "equal",
        "place",
        "place",
        "separate",
        "place",
        "averroes",
        "quote",
        "aristotle",
        "also",
        "devoid",
        "kind",
        "particular",
        "separated",
        "extra",
        "quodcunque",
        "singularium",
        "et",
        "separatur",
        "ab",
        "eis",
        "direction",
        "place",
        "place",
        "toward",
        "place",
        "naturally",
        "move",
        "according",
        "averroes",
        "alexander",
        "read",
        "statement",
        "place",
        "devoid",
        "particular",
        "separated",
        "instead",
        "affirmative",
        "sentence",
        "also",
        "devoid",
        "particular",
        "separated",
        "lc",
        "h",
        "averroes",
        "read",
        "isḥāq",
        "ibn",
        "ḥunayn",
        "translation",
        "arabic",
        "translation",
        "isḥāq",
        "read",
        "place",
        "devoid",
        "aspect",
        "separable",
        "aristotle",
        "ṭabīʻa",
        "coincides",
        "ross",
        "edition",
        "apoleipesthai",
        "ekastou",
        "a",
        "ross",
        "averroes",
        "think",
        "alexander",
        "reading",
        "true",
        "known",
        "per",
        "se",
        "alexander",
        "would",
        "choose",
        "reading",
        "oppose",
        "pretend",
        "place",
        "void",
        "since",
        "place",
        "neither",
        "matter",
        "form",
        "extension",
        "dimensio",
        "ie",
        "extension",
        "always",
        "independent",
        "movable",
        "aristotle",
        "concludes",
        "place",
        "limit",
        "surrounding",
        "body",
        "peras",
        "tou",
        "periekhontos",
        "sōmatos",
        "phys",
        "iv",
        "a",
        "place",
        "move",
        "essentially",
        "averroes",
        "say",
        "aristotle",
        "gave",
        "renowned",
        "argument",
        "rationemfamosam",
        "support",
        "tenet",
        "lc",
        "f",
        "tc",
        "phys",
        "a",
        "surface",
        "surrounding",
        "last",
        "sphere",
        "universe",
        "absolute",
        "center",
        "universe",
        "ie",
        "earth",
        "absolute",
        "center",
        "stable",
        "outmost",
        "surface",
        "move",
        "averroes",
        "add",
        "air",
        "water",
        "absolutely",
        "since",
        "aristotle",
        "could",
        "mention",
        "fire",
        "also",
        "light",
        "argument",
        "organized",
        "syllogism",
        "second",
        "figure",
        "two",
        "affirmative",
        "proposition",
        "highest",
        "body",
        "stable",
        "fixum",
        "outermost",
        "circulating",
        "body",
        "stable",
        "ergo",
        "highest",
        "body",
        "outermost",
        "circulating",
        "lc",
        "g",
        "averroes",
        "face",
        "great",
        "question",
        "magna",
        "quaestio",
        "relation",
        "phys",
        "iv",
        "ab",
        "passage",
        "aristotle",
        "mention",
        "circular",
        "motion",
        "universe",
        "commentary",
        "tc",
        "occupies",
        "lc",
        "c",
        "lc",
        "c",
        "know",
        "outermost",
        "sphere",
        "move",
        "daily",
        "rotation",
        "whole",
        "simultaneously",
        "change",
        "place",
        "though",
        "move",
        "circle",
        "place",
        "place",
        "part",
        "part",
        "four",
        "element",
        "change",
        "place",
        "phys",
        "b",
        "accidental",
        "reason",
        "aristotle",
        "grant",
        "kind",
        "place",
        "aristotelian",
        "passage",
        "remained",
        "obscure",
        "discussion",
        "place",
        "universe",
        "arose",
        "averroes",
        "express",
        "dilemma",
        "choice",
        "either",
        "two",
        "option",
        "either",
        "affirm",
        "something",
        "moving",
        "place",
        "affirm",
        "place",
        "void",
        "extension",
        "lc",
        "f",
        "tc",
        "averroes",
        "mention",
        "view",
        "john",
        "philoponus",
        "d",
        "ce",
        "themistius",
        "d",
        "ce",
        "philoponus",
        "solution",
        "dilemma",
        "consisted",
        "taking",
        "place",
        "extension",
        "dimensio",
        "accepting",
        "existence",
        "void",
        "averroes",
        "seems",
        "access",
        "philoponus",
        "corollary",
        "place",
        "greek",
        "original",
        "extant",
        "philoponus",
        "cag",
        "translated",
        "english",
        "see",
        "averroes",
        "reject",
        "existence",
        "void",
        "themistius",
        "celestial",
        "body",
        "place",
        "accordance",
        "whole",
        "part",
        "secundum",
        "partes",
        "lc",
        "f",
        "tc",
        "averroes",
        "explains",
        "mean",
        "accordance",
        "sphere",
        "largest",
        "sphere",
        "contains",
        "understand",
        "themistius",
        "skipped",
        "five",
        "element",
        "averroes",
        "interprets",
        "latter",
        "sphere",
        "fixed",
        "star",
        "surrounded",
        "anything",
        "else",
        "concavity",
        "surround",
        "everything",
        "moreover",
        "refers",
        "natural",
        "science",
        "time",
        "proved",
        "ninth",
        "sphere",
        "one",
        "daily",
        "motion",
        "affirm",
        "motion",
        "latter",
        "essential",
        "motion",
        "whole",
        "universe",
        "orbis",
        "essentialiter",
        "lc",
        "h",
        "t",
        "magna",
        "quaestio",
        "manysided",
        "averroes",
        "recall",
        "passage",
        "physic",
        "vi",
        "ab",
        "aristotle",
        "refuted",
        "zeno",
        "fourth",
        "argument",
        "motion",
        "asserted",
        "sphere",
        "move",
        "accordance",
        "whole",
        "well",
        "part",
        "therefore",
        "themistius",
        "claimed",
        "sphere",
        "place",
        "accordance",
        "whole",
        "part",
        "thought",
        "part",
        "change",
        "place",
        "would",
        "contradict",
        "aristotle",
        "view",
        "lc",
        "i",
        "averroes",
        "say",
        "themistius",
        "could",
        "argue",
        "aristotle",
        "physic",
        "vi",
        "meant",
        "physic",
        "iv",
        "ie",
        "sphere",
        "change",
        "place",
        "whole",
        "phys",
        "a",
        "averroes",
        "restricts",
        "assertion",
        "spherical",
        "body",
        "universe",
        "sphere",
        "move",
        "part",
        "change",
        "place",
        "part",
        "celestial",
        "body",
        "said",
        "move",
        "circle",
        "alio",
        "modo",
        "movetur",
        "circulariter",
        "ab",
        "meant",
        "circular",
        "motion",
        "predicated",
        "whole",
        "certain",
        "part",
        "ie",
        "celestial",
        "body",
        "manner",
        "rectilinear",
        "motion",
        "predicated",
        "motion",
        "element",
        "also",
        "part",
        "lc",
        "k",
        "tc",
        "themistius",
        "interpreted",
        "since",
        "aristotle",
        "said",
        "heavenly",
        "body",
        "coelum",
        "place",
        "per",
        "accidens",
        "assumed",
        "another",
        "heavenly",
        "body",
        "place",
        "add",
        "per",
        "se",
        "averroes",
        "explains",
        "another",
        "heavenly",
        "body",
        "celestial",
        "sphere",
        "orbium",
        "according",
        "themistius",
        "per",
        "accidens",
        "wide",
        "category",
        "commentator",
        "find",
        "term",
        "adequate",
        "said",
        "heavenly",
        "body",
        "place",
        "part",
        "themistius",
        "averroes",
        "share",
        "view",
        "aristotle",
        "using",
        "term",
        "per",
        "accidens",
        "freely",
        "lc",
        "m",
        "themistius",
        "highly",
        "regarded",
        "authority",
        "averroes",
        "formulate",
        "solution",
        "according",
        "aristotleso",
        "understands",
        "himthe",
        "rectilinearly",
        "moving",
        "body",
        "place",
        "per",
        "se",
        "essentially",
        "rotating",
        "body",
        "accidentally",
        "per",
        "accidens",
        "whole",
        "universe",
        "place",
        "part",
        "part",
        "mean",
        "five",
        "elementary",
        "body",
        "lc",
        "cd",
        "tc",
        "reaching",
        "conclusion",
        "averroes",
        "clear",
        "way",
        "refuting",
        "avempace",
        "doctrine",
        "avempace",
        "d",
        "view",
        "issue",
        "sphere",
        "place",
        "nothing",
        "encloses",
        "outside",
        "place",
        "sphere",
        "envisioned",
        "far",
        "sphere",
        "convexity",
        "center",
        "around",
        "rotates",
        "lc",
        "a",
        "t",
        "avempace",
        "would",
        "take",
        "aristotle",
        "definition",
        "place",
        "surround",
        "body",
        "apply",
        "external",
        "surface",
        "body",
        "moving",
        "rectilinearly",
        "internal",
        "surface",
        "body",
        "rotating",
        "averroes",
        "conjecture",
        "avempace",
        "borrowed",
        "view",
        "alfārābī",
        "d",
        "c",
        "refuted",
        "opinion",
        "joannes",
        "philoponus",
        "place",
        "alfārābī",
        "book",
        "fall",
        "hand",
        "say",
        "averroes",
        "expounded",
        "avempace",
        "view",
        "short",
        "sc",
        "lettinck",
        "middle",
        "commentary",
        "length",
        "mc",
        "kalonymos",
        "l",
        "vºrº",
        "also",
        "refers",
        "lc",
        "reject",
        "avempace",
        "abandoned",
        "aristotle",
        "discourse",
        "erred",
        "heavily",
        "lc",
        "k",
        "tc",
        "avempace",
        "alfārābī",
        "maintain",
        "sphere",
        "place",
        "essentially",
        "averroes",
        "summarizing",
        "word",
        "mc",
        "may",
        "worth",
        "translated",
        "told",
        "place",
        "sphere",
        "abū",
        "bakr",
        "ibn",
        "alṣā",
        "igh",
        "abū",
        "naṣr",
        "alfārābī",
        "considered",
        "ie",
        "part",
        "place",
        "essentially",
        "ie",
        "mean",
        "center",
        "place",
        "said",
        "equivocity",
        "regard",
        "place",
        "spherical",
        "body",
        "place",
        "body",
        "moving",
        "straight",
        "line",
        "indeed",
        "appears",
        "reasonable",
        "say",
        "sphere",
        "place",
        "accidentally",
        "mean",
        "center",
        "sphere",
        "surround",
        "place",
        "essentially",
        "surrounded",
        "surrounding",
        "surround",
        "match",
        "maqbil",
        "surrounded",
        "may",
        "said",
        "surround",
        "surrounded",
        "since",
        "body",
        "heaven",
        "anything",
        "surrounding",
        "place",
        "essentially",
        "place",
        "mean",
        "surrounded",
        "accidentally",
        "mc",
        "kalonymos",
        "l",
        "rº",
        "vºrº",
        "averroes",
        "disagrees",
        "avempace",
        "still",
        "reflection",
        "magna",
        "quaestio",
        "explains",
        "rectilinearly",
        "moving",
        "body",
        "place",
        "essentially",
        "rotating",
        "body",
        "accidentally",
        "whole",
        "universe",
        "place",
        "part",
        "said",
        "lc",
        "cd",
        "state",
        "place",
        "equal",
        "place",
        "lc",
        "d",
        "tc",
        "cf",
        "phys",
        "iv",
        "a",
        "mean",
        "proper",
        "sense",
        "content",
        "equal",
        "surface",
        "concave",
        "sphere",
        "equal",
        "surface",
        "embraced",
        "sphere",
        "averroes",
        "refers",
        "content",
        "say",
        "equality",
        "impossible",
        "unless",
        "place",
        "void",
        "ista",
        "aequalitas",
        "non",
        "est",
        "vera",
        "de",
        "loco",
        "nisi",
        "inane",
        "esset",
        "lc",
        "e",
        "tc",
        "averroes",
        "look",
        "answer",
        "universe",
        "rest",
        "whole",
        "earth",
        "center",
        "universe",
        "center",
        "rest",
        "place",
        "essentially",
        "heavenly",
        "body",
        "coelum",
        "rest",
        "far",
        "part",
        "ie",
        "various",
        "sphere",
        "move",
        "translocate",
        "non",
        "transmutatur",
        "reason",
        "place",
        "accidentally",
        "lc",
        "g",
        "t",
        "reference",
        "aristotle",
        "bekker",
        "edition",
        "passage",
        "b",
        "simply",
        "read",
        "thing",
        "place",
        "accidentally",
        "like",
        "soul",
        "heavenly",
        "body",
        "heavenly",
        "body",
        "place",
        "accidentally",
        "per",
        "accidens",
        "following",
        "objection",
        "could",
        "raised",
        "motion",
        "also",
        "accidental",
        "lc",
        "k",
        "tc",
        "motion",
        "accidental",
        "since",
        "motion",
        "heavenly",
        "body",
        "precedes",
        "motion",
        "accidental",
        "motion",
        "precede",
        "essential",
        "motion",
        "averroes",
        "answer",
        "objection",
        "saying",
        "move",
        "need",
        "something",
        "rest",
        "around",
        "move",
        "aristotle",
        "say",
        "book",
        "local",
        "motion",
        "animal",
        "de",
        "motu",
        "animalium",
        "lc",
        "l",
        "tc",
        "matter",
        "whether",
        "body",
        "rest",
        "essentially",
        "accidentally",
        "averroes",
        "belief",
        "solution",
        "understand",
        "alexander",
        "aphrodisia",
        "held",
        "view",
        "sphere",
        "fixed",
        "star",
        "place",
        "besides",
        "think",
        "alexander",
        "influenced",
        "avicenna",
        "deny",
        "heavenly",
        "body",
        "place",
        "affirm",
        "motion",
        "positional",
        "change",
        "position",
        "situale",
        "lc",
        "hi",
        "tc",
        "averroes",
        "final",
        "position",
        "read",
        "beginning",
        "tc",
        "comment",
        "physic",
        "iv",
        "b",
        "body",
        "place",
        "essentially",
        "outside",
        "surrounding",
        "body",
        "place",
        "part",
        "place",
        "condition",
        "body",
        "place",
        "accidentally",
        "like",
        "move",
        "circularly",
        "lc",
        "e"
    ]
}