{
    "main_text": "The Metaphysics of the Rational Soul; Practical Philosophy\n4. The Metaphysics of the Rational Soul; Practical Philosophy\n\nAvicenna’s rationalist empiricism is the main reason why he strove in his philosophy on the one hand to perfect and fine-tune logical method and on the other to study, at an unprecedented level of sophistication and precision, the human (rational) soul and cognitive processes which provide knowledge through the application of rational empirical methods. In section after section and chapter after chapter in numerous works he analyzes not only questions of formal logic but also the mechanics through which the rational soul acquires knowledge, and in particular the conditions operative in the process of hitting upon the middle term: how one can work for it and where to look for it, and what the apparatus and operations of the soul are that bring it about (Gutas 2001). This entailed detailed study of the operations of the soul in its totality and in all its functions, whether rational, animal, or vegetative. He charts in great detail the operations of all the senses, both the five external senses and especially the five internal senses located in the brain—common sense, imagery (where the forms of things are stored), imagination, estimation (judging the imperceptible significance or connotations for us of sensed objects, like friendship and enmity, which also includes instinctive sensing), and memory—and how they can help or hinder the intellect in hitting upon the middle term and perceiving intelligibles more generally. When, at the end of all these operations just described, the intellect hits upon a middle term or just perceives an intelligible that it had not been thinking about before, it acquires the intelligible in question (hence the appellation of this stage of intellection, “acquired intellect,” al-ʿaql al-mustafād ), or, otherwise expressed, acquires it from the active intellect which thinks it eternally and atemporally since the active intellect is, in effect, the locus of all intelligibles, there being no other place for them to be always in actual existence. The human intellect can think an intelligible for some time, but then it disappears, it being impossible for the immaterial intellect to “store” it, or have memory of it, as opposed to the two internal senses, imagery and memory, which have a storage function for their particular oblects (forms and connotational attributes) because they have a material base in the brain. Avicenna calls this process of acquisition or apprehension of the intelligibles a “contact” (ittiṣāl) between the human and active \n intellects.[7] \n In the emanative language which he inherited from the Neoplatonic tradition, and which he incorporated in his own understanding of the cosmology of the concentric spheres of the universe with their intercommunicating intellects and souls, he referred to the flow of knowledge from the supernal world to the human intellect as “divine effluence” (al-fayḍ al-ilāhī). The reason that this is possible at all is again the consubstantiality and congeneric nature of all intellects, human and celestial alike. Only, as already mentioned, because of their varied circumstances, the latter think of the intelligibles directly, permanently, and atemporally, while the human intellect has to advance from potentiality to actuality in time by technical means leading to the discovery of the middle term as it is assisted by all the other faculties of the soul and body. \n\nThe wording itself of this acquisition of knowledge by the human intellect—“contact with the active intellect,” or receiving the “divine effluence”—has misled students of Avicenna into thinking that this “flow” of knowledge from the divine to the human intellect is automatic and due to God’s grace, or it is ineffable and mystical. But this is groundless; the “flow” has nothing mystical about it; it just means that the intelligibles are permanently available to human intellects who seek a middle term or other intelligibles at the end of a thinking process by means of abstraction and syllogisms. Avicenna is quite explicit about the need for the human intellect to be prepared and to demand to hit upon a middle term, or actively to seek an intelligible, in order to receive it. He says specifically, “The active principle [i.e. the active intellect] lets flow upon the [human rational] soul form after form in accordance with the demand by the soul; and when the soul turns away from it [the active intellect], then the effluence is broken off” (GS 5, De anima, 245–246; transl. Gutas 2014a, 377; cf. Hasse 2013, 118).\n\nThe same applies to other forms of communication from the supernal world. In the case of the prophet, he acquires all the intelligibles comprising knowledge, complete with middle terms as already mentioned, because the intellective capacity of his rational soul to hit upon the middle terms and acquire the intelligibles is extraordinarily high; this capacity is coupled with an equally highly developed internal sense of imagination that can translate this intellective knowledge into language and images (in the form of a revealed book) that the vast majority of humans can easily understand. But in addition to intelligible knowledge, the divine effluence from the intellects and the souls of the celestial spheres also includes information about events on earth, past, present, and future—what Avicenna calls “the unseen” (al-ghayb)—, for all of which the intellects and souls of the celestial spheres are directly responsible. This information can also be received by humans in various forms—as waking or sleeping dreams, as visions, as messages to soothsayers—depending on the level of the humoral equilibrium of the recipient, the proper functioning of his internal and external senses, and the readiness of his intellect. Somebody whose internal sense of imagination or estimation is overactive, for example, may be hindered thereby in the clear reception of dream images so that his dreams would require interpretation, while someone else not so afflicted may get clearer messages; or a soothsayer who wishes to receive information about the future has to run long and hard in order to bring about such a humoral equilibrium through the exertion, thereby preparing his intellect to receive the message.\n\nThe logistics of the reception of information from the supernal world thus varies in accordance with what is being communicated and who is receiving it, but in all cases the recipient has to be ready and predisposed to receive it. All humans have both the physical and mental apparatus to acquire intelligible and supernal knowledge and the means to do so, but they have to work for it, just as they have to prepare for their bliss in afterlife while their immortal rational souls are still affiliated with the body. There is no free emanation of the intelligibles on “couch-potato” humans, or afterlife contemplation for them of eternal realities in the company of the celestial spheres (Avicenna’s paradise). To have thought so would have negated the entire philosophical project Avicenna so painstakingly constructed.\n\nThis analysis and understanding of the rational soul, precisely elaborated on the basis of the Aristotelian theory but also going much beyond it, enable Avicenna to engage systematically primarily with all aspects of religion, cognitive and social alike, and secondarily with what we would call paranormal phenomena (prognostication of the future, telekinesis, evil eye, etc.). All issues relating to the cognitive side of religion he added to the traditional contents of metaphysics, and those relating to the social side he added to the practical sciences. In the former case he created a veritable metaphysics of the rational soul (Gutas 2012b), which he added to the traditional treatment of metaphysics (being as such, first philosophy, natural theology) as an additional subject, called “theological” (al-ʿilm al-ilāhī, al-ṣināʿa al-ilāhiyya). Its contents can be seen in his extensive treatment of it all at the end of the metaphysics part of The Cure, as follows.\n\nBook 9, Chapter 7: Destination of the rational soul in the afterlife and its bliss and misery; real happiness is the perfection of the rational soul through knowledge. \n\nBook 10, Chapter 1: Celestial effects on the world: inspiration, dreams, prayer, celestial punishment, prophecy, astrology.\n\nOn the social side of religion, he added a fourth subdivision to practical philosophy (in addition to ethics, household management, and politics) which he called “the discipline of legislating” (al-ṣināʿa al-shāriʿa, Kaya 2012; Kaya 2014; Gutas 2014a, 470–471, 497). As mentioned above, the prophet, through his supremely developed ability to hit upon the middle of terms of syllogisms, acquires all knowledge (all the intelligibles actually thought by the active intellect) “either at once or nearly so.” This acquisition “is not an uncritical reception [of this knowledge] merely on authority, but rather occurs in an order which includes the middle terms: for beliefs accepted on authority concerning those things which are known only through their causes possess no intellectual certainty” (GS 5, De anima, 249–250; transl. Gutas 2014a, 183–184). With this secure and syllogistically verified knowledge, the prophet then is in a position to legislate and regulate social life as well as have a legitimate ground for gaining consent. The subjects of all parts of practical philosophy are covered briefly also at the very end of The Cure, as follows:\n\nBook 10, Chapter 2: Proof of prophecy on the basis of the need for laws, to be enacted by the prophet legislator, in order to regulate social life which is necessary for human survival.\n\nChapter 3: Acts of worship as reminders of the afterlife and as exercises predisposing the rational soul to engage in intellection (cf. Gutas 2014a, 206–208).\n\nChapter 4: Household management.\n\nChapter 5: Politics (the caliphate and legislation); ethics.\n\nFor further reading, see the entries on\n Ibn Sina’s metaphysics\nand\n Ibn Sina’s natural philosophy.\n\n",
    "section_title": "4. The Metaphysics of the Rational Soul; Practical Philosophy",
    "entry_title": "Ibn Sina [Avicenna]",
    "hierarchy_title": "Ibn Sina [Avicenna] || The Metaphysics of the Rational Soul; Practical Philosophy",
    "tokenized_text": [
        "metaphysics",
        "rational",
        "soul",
        "practical",
        "philosophy",
        "metaphysics",
        "rational",
        "soul",
        "practical",
        "philosophy",
        "avicenna",
        "rationalist",
        "empiricism",
        "main",
        "reason",
        "strove",
        "philosophy",
        "one",
        "hand",
        "perfect",
        "finetune",
        "logical",
        "method",
        "study",
        "unprecedented",
        "level",
        "sophistication",
        "precision",
        "human",
        "rational",
        "soul",
        "cognitive",
        "process",
        "provide",
        "knowledge",
        "application",
        "rational",
        "empirical",
        "method",
        "section",
        "section",
        "chapter",
        "chapter",
        "numerous",
        "work",
        "analyzes",
        "question",
        "formal",
        "logic",
        "also",
        "mechanic",
        "rational",
        "soul",
        "acquires",
        "knowledge",
        "particular",
        "condition",
        "operative",
        "process",
        "hitting",
        "upon",
        "middle",
        "term",
        "one",
        "work",
        "look",
        "apparatus",
        "operation",
        "soul",
        "bring",
        "gutas",
        "entailed",
        "detailed",
        "study",
        "operation",
        "soul",
        "totality",
        "function",
        "whether",
        "rational",
        "animal",
        "vegetative",
        "chart",
        "great",
        "detail",
        "operation",
        "sens",
        "five",
        "external",
        "sens",
        "especially",
        "five",
        "internal",
        "sens",
        "located",
        "braincommon",
        "sense",
        "imagery",
        "form",
        "thing",
        "stored",
        "imagination",
        "estimation",
        "judging",
        "imperceptible",
        "significance",
        "connotation",
        "u",
        "sensed",
        "object",
        "like",
        "friendship",
        "enmity",
        "also",
        "includes",
        "instinctive",
        "sensing",
        "memoryand",
        "help",
        "hinder",
        "intellect",
        "hitting",
        "upon",
        "middle",
        "term",
        "perceiving",
        "intelligibles",
        "generally",
        "end",
        "operation",
        "described",
        "intellect",
        "hit",
        "upon",
        "middle",
        "term",
        "perceives",
        "intelligible",
        "thinking",
        "acquires",
        "intelligible",
        "question",
        "hence",
        "appellation",
        "stage",
        "intellection",
        "acquired",
        "intellect",
        "alʿaql",
        "almustafād",
        "otherwise",
        "expressed",
        "acquires",
        "active",
        "intellect",
        "think",
        "eternally",
        "atemporally",
        "since",
        "active",
        "intellect",
        "effect",
        "locus",
        "intelligibles",
        "place",
        "always",
        "actual",
        "existence",
        "human",
        "intellect",
        "think",
        "intelligible",
        "time",
        "disappears",
        "impossible",
        "immaterial",
        "intellect",
        "store",
        "memory",
        "opposed",
        "two",
        "internal",
        "sens",
        "imagery",
        "memory",
        "storage",
        "function",
        "particular",
        "oblects",
        "form",
        "connotational",
        "attribute",
        "material",
        "base",
        "brain",
        "avicenna",
        "call",
        "process",
        "acquisition",
        "apprehension",
        "intelligibles",
        "contact",
        "ittiṣāl",
        "human",
        "active",
        "intellect",
        "emanative",
        "language",
        "inherited",
        "neoplatonic",
        "tradition",
        "incorporated",
        "understanding",
        "cosmology",
        "concentric",
        "sphere",
        "universe",
        "intercommunicating",
        "intellect",
        "soul",
        "referred",
        "flow",
        "knowledge",
        "supernal",
        "world",
        "human",
        "intellect",
        "divine",
        "effluence",
        "alfayḍ",
        "alilāhī",
        "reason",
        "possible",
        "consubstantiality",
        "congeneric",
        "nature",
        "intellect",
        "human",
        "celestial",
        "alike",
        "already",
        "mentioned",
        "varied",
        "circumstance",
        "latter",
        "think",
        "intelligibles",
        "directly",
        "permanently",
        "atemporally",
        "human",
        "intellect",
        "advance",
        "potentiality",
        "actuality",
        "time",
        "technical",
        "mean",
        "leading",
        "discovery",
        "middle",
        "term",
        "assisted",
        "faculty",
        "soul",
        "body",
        "wording",
        "acquisition",
        "knowledge",
        "human",
        "intellect",
        "contact",
        "active",
        "intellect",
        "receiving",
        "divine",
        "effluence",
        "has",
        "misled",
        "student",
        "avicenna",
        "thinking",
        "flow",
        "knowledge",
        "divine",
        "human",
        "intellect",
        "automatic",
        "due",
        "god",
        "grace",
        "ineffable",
        "mystical",
        "groundless",
        "flow",
        "nothing",
        "mystical",
        "mean",
        "intelligibles",
        "permanently",
        "available",
        "human",
        "intellect",
        "seek",
        "middle",
        "term",
        "intelligibles",
        "end",
        "thinking",
        "process",
        "mean",
        "abstraction",
        "syllogism",
        "avicenna",
        "quite",
        "explicit",
        "need",
        "human",
        "intellect",
        "prepared",
        "demand",
        "hit",
        "upon",
        "middle",
        "term",
        "actively",
        "seek",
        "intelligible",
        "order",
        "receive",
        "say",
        "specifically",
        "active",
        "principle",
        "ie",
        "active",
        "intellect",
        "let",
        "flow",
        "upon",
        "human",
        "rational",
        "soul",
        "form",
        "form",
        "accordance",
        "demand",
        "soul",
        "soul",
        "turn",
        "away",
        "active",
        "intellect",
        "effluence",
        "broken",
        "g",
        "de",
        "anima",
        "transl",
        "gutas",
        "a",
        "cf",
        "hasse",
        "applies",
        "form",
        "communication",
        "supernal",
        "world",
        "case",
        "prophet",
        "acquires",
        "intelligibles",
        "comprising",
        "knowledge",
        "complete",
        "middle",
        "term",
        "already",
        "mentioned",
        "intellective",
        "capacity",
        "rational",
        "soul",
        "hit",
        "upon",
        "middle",
        "term",
        "acquire",
        "intelligibles",
        "extraordinarily",
        "high",
        "capacity",
        "coupled",
        "equally",
        "highly",
        "developed",
        "internal",
        "sense",
        "imagination",
        "translate",
        "intellective",
        "knowledge",
        "language",
        "image",
        "form",
        "revealed",
        "book",
        "vast",
        "majority",
        "human",
        "easily",
        "understand",
        "addition",
        "intelligible",
        "knowledge",
        "divine",
        "effluence",
        "intellect",
        "soul",
        "celestial",
        "sphere",
        "also",
        "includes",
        "information",
        "event",
        "earth",
        "past",
        "present",
        "futurewhat",
        "avicenna",
        "call",
        "unseen",
        "alghayb",
        "intellect",
        "soul",
        "celestial",
        "sphere",
        "directly",
        "responsible",
        "information",
        "also",
        "received",
        "human",
        "various",
        "formsas",
        "waking",
        "sleeping",
        "dream",
        "vision",
        "message",
        "soothsayersdepending",
        "level",
        "humoral",
        "equilibrium",
        "recipient",
        "proper",
        "functioning",
        "internal",
        "external",
        "sens",
        "readiness",
        "intellect",
        "somebody",
        "whose",
        "internal",
        "sense",
        "imagination",
        "estimation",
        "overactive",
        "example",
        "may",
        "hindered",
        "thereby",
        "clear",
        "reception",
        "dream",
        "image",
        "dream",
        "would",
        "require",
        "interpretation",
        "someone",
        "else",
        "afflicted",
        "may",
        "get",
        "clearer",
        "message",
        "soothsayer",
        "wish",
        "receive",
        "information",
        "future",
        "run",
        "long",
        "hard",
        "order",
        "bring",
        "humoral",
        "equilibrium",
        "exertion",
        "thereby",
        "preparing",
        "intellect",
        "receive",
        "message",
        "logistics",
        "reception",
        "information",
        "supernal",
        "world",
        "thus",
        "varies",
        "accordance",
        "communicated",
        "receiving",
        "case",
        "recipient",
        "ready",
        "predisposed",
        "receive",
        "human",
        "physical",
        "mental",
        "apparatus",
        "acquire",
        "intelligible",
        "supernal",
        "knowledge",
        "mean",
        "work",
        "prepare",
        "bliss",
        "afterlife",
        "immortal",
        "rational",
        "soul",
        "still",
        "affiliated",
        "body",
        "free",
        "emanation",
        "intelligibles",
        "couchpotato",
        "human",
        "afterlife",
        "contemplation",
        "eternal",
        "reality",
        "company",
        "celestial",
        "sphere",
        "avicenna",
        "paradise",
        "thought",
        "would",
        "negated",
        "entire",
        "philosophical",
        "project",
        "avicenna",
        "painstakingly",
        "constructed",
        "analysis",
        "understanding",
        "rational",
        "soul",
        "precisely",
        "elaborated",
        "basis",
        "aristotelian",
        "theory",
        "also",
        "going",
        "much",
        "beyond",
        "enable",
        "avicenna",
        "engage",
        "systematically",
        "primarily",
        "aspect",
        "religion",
        "cognitive",
        "social",
        "alike",
        "secondarily",
        "would",
        "call",
        "paranormal",
        "phenomenon",
        "prognostication",
        "future",
        "telekinesis",
        "evil",
        "eye",
        "etc",
        "issue",
        "relating",
        "cognitive",
        "side",
        "religion",
        "added",
        "traditional",
        "content",
        "metaphysics",
        "relating",
        "social",
        "side",
        "added",
        "practical",
        "science",
        "former",
        "case",
        "created",
        "veritable",
        "metaphysics",
        "rational",
        "soul",
        "gutas",
        "b",
        "added",
        "traditional",
        "treatment",
        "metaphysics",
        "first",
        "philosophy",
        "natural",
        "theology",
        "additional",
        "subject",
        "called",
        "theological",
        "alʿilm",
        "alilāhī",
        "alṣināʿa",
        "alilāhiyya",
        "content",
        "seen",
        "extensive",
        "treatment",
        "end",
        "metaphysics",
        "part",
        "cure",
        "follows",
        "book",
        "chapter",
        "destination",
        "rational",
        "soul",
        "afterlife",
        "bliss",
        "misery",
        "real",
        "happiness",
        "perfection",
        "rational",
        "soul",
        "knowledge",
        "book",
        "chapter",
        "celestial",
        "effect",
        "world",
        "inspiration",
        "dream",
        "prayer",
        "celestial",
        "punishment",
        "prophecy",
        "astrology",
        "social",
        "side",
        "religion",
        "added",
        "fourth",
        "subdivision",
        "practical",
        "philosophy",
        "addition",
        "ethic",
        "household",
        "management",
        "politics",
        "called",
        "discipline",
        "legislating",
        "alṣināʿa",
        "alshāriʿa",
        "kaya",
        "kaya",
        "gutas",
        "a",
        "mentioned",
        "prophet",
        "supremely",
        "developed",
        "ability",
        "hit",
        "upon",
        "middle",
        "term",
        "syllogism",
        "acquires",
        "knowledge",
        "intelligibles",
        "actually",
        "thought",
        "active",
        "intellect",
        "either",
        "nearly",
        "so",
        "acquisition",
        "uncritical",
        "reception",
        "knowledge",
        "merely",
        "authority",
        "rather",
        "occurs",
        "order",
        "includes",
        "middle",
        "term",
        "belief",
        "accepted",
        "authority",
        "concerning",
        "thing",
        "known",
        "cause",
        "posse",
        "intellectual",
        "certainty",
        "g",
        "de",
        "anima",
        "transl",
        "gutas",
        "a",
        "secure",
        "syllogistically",
        "verified",
        "knowledge",
        "prophet",
        "position",
        "legislate",
        "regulate",
        "social",
        "life",
        "well",
        "legitimate",
        "ground",
        "gaining",
        "consent",
        "subject",
        "part",
        "practical",
        "philosophy",
        "covered",
        "briefly",
        "also",
        "end",
        "cure",
        "follows",
        "book",
        "chapter",
        "proof",
        "prophecy",
        "basis",
        "need",
        "law",
        "enacted",
        "prophet",
        "legislator",
        "order",
        "regulate",
        "social",
        "life",
        "necessary",
        "human",
        "survival",
        "chapter",
        "act",
        "worship",
        "reminder",
        "afterlife",
        "exercise",
        "predisposing",
        "rational",
        "soul",
        "engage",
        "intellection",
        "cf",
        "gutas",
        "a",
        "chapter",
        "household",
        "management",
        "chapter",
        "politics",
        "caliphate",
        "legislation",
        "ethic",
        "reading",
        "see",
        "entry",
        "ibn",
        "sina",
        "metaphysics",
        "ibn",
        "sina",
        "natural",
        "philosophy"
    ]
}