{
    "main_text": "Alteration, Growth, Nutrition\n14. Alteration, Growth, Nutrition\n\nThe Middle Commentary on De generatione et corruptione is\nsystematic in organizing Aristotle’s original. As in the case of\nthe Middle Commentary on the Physics, Averroes draws a\nsynopsis, where he divides the content into the 2 books,\nmaqāla, each one into sections, jumla, and some\nof the jumla into chapters, faṣl, following\nthe method of the divisio textus. Averroes paraphrases GC\n314a 1–4 in I.1 and writes that Aristotle’s purpose was\n“to explain the causes that are common to all naturally\n(bi-l-ṭabʻ) generable and corruptible\nthings to explain as well the causes of growth and alteration”,\n(Averroes, MC GC Ar, 2: 3–4) (MC GC En, \n 4).[14]\nNatural here opposes artificial.\n\nTherefore, Averroes and Aristotle agree in separating change in place\nfrom the three other kinds, and they want to look into the common\ncauses of the three. Coming-to-be has been analyzed above, alteration\nand growth remain to be. Alteration (istiḥālah) is\nchange in quality, in which the underlying subject, or substratum\n(mawḍūʻ) remains one and the same throughout\nthe process. The mawḍūʻ is “a definite\nthing existing in actuality” and there are plenty of examples\n(Averroes, MC GC En, 24) (MC GC Ar , 30: 6). There is not much\ndiscussion about alteration.\n\nGrowth and its opposite, diminution, come to the fore and are easy to\nunderstand, because they affect the animated beings\n(emphsykha) and these changes are at the very essence of life\nand death. Aristotle treated the subject in other places, De\nanima, Generation of the Animals, Parts of the Animals,\nbut in GC I.5, 320a 5 – 322a 33, he discussed growth in contrast\nto coming-to-be and alteration. The passage was commented by\nAlexander, whose text was known to Averroes but not to us; we have to\nrely on Philoponus who also discusses the issue of growth at length in\nhis own commentary on GC (Philoponus GC Gr 1897, 69: 27–123: 26), as\nan indirect source.\n\nAny explanation has to look for the material, formal and efficient\ncause of the investigated object. Aristotle observed that\n“Matter in the chief and strictest sense of the word is the\nsubstratum which admits of coming-to-be and passing-away; but the\nsubstratum of the other kinds of change is also in a sense\nmatter” (GC 320a 2–4) (GC Forster 1955, 203), but as for\n“in which sense” he left the question open. Maybe this was\nthe reason why Averroes introduced the notion of corporeality in\nanswering it:\n\nThe corporeality (jismīya) which is common to all that\nis generated in substance, is one in number in potentiality, not in\nactuality, while the corporeality which is the substratum for\nalteration is one in number in actuality (Averroes, MC GC Ar, 32: 2–4)\n(MC GC En, 26).\n\n\nThe editor, Eichner, as well as the translator, Kurland, draw the\nattention of the reader to the fact that the whole paragraph\n(Averroes, MC GC Ar 2005, 32: 1–12) is missing in the Hebrew and Latin\ntranslations, and in the Arabic manuscript (Oxford Bodleian 34) and\nthat it appears in the body of one Arabic manuscript (Paris 1009) and\nin the margin of another (Modena 13), so that one doubts whether\nAverroes is the real author but, in any case, the explanation is\nhalf-finished.\n\nPhiloponus had said “The matter of corporeal substance is one\nthing, that of growth another (Philoponus GC En 2013, 116)”, but\nhe saw that the distinction was purely “in definition”\n(tōi logōi) following Aristotle GC 320b 24.\nAverroes knew it and sets forth that growth takes place “out of\na body existent in act” (MC GC Ar 2005, 38: 6). He then\nconsiders the difficulties already raised by Aristotle because of this\nstatement. The solution to the problem is obtained by means of\nexamining how growth occurs. Aristotle discerns three characteristics:\n\n\n(a) Every part of the growing magnitude is larger—for instance,\nif flesh grows, every part of flesh grows; (b) it grows by the\naccession of something; and (c) that it grows because that which grows\nis preserved (sōzomenon) and remains (Aristotle, GC\nForster 1955, 213).\n\nIn Averroes’ paraphrase of the passage, (a) reads more specific\n“every drop and every perceptible part grows in the same manner,\nand likewise, when it diminishes, it does in every perceptible\npart”. Characteristic (c) reads also differently: “the\nthing which is characterized by growth and diminution must be definite\n(mushār ilayhi) and remain identical” (Averroes, MC GC Ar\n2005, 39). Averroes makes clear that growth is not an increase in\nvolume, and that the homoeomerous bodies play the key role.\n\nThe Aristotelian tradition consider the organic tissues, like blood,\nflesh, or bones, but also, minerals, like gold or silver, homoeomerous\nbodies. They are composed of the four elements and the composition is\nin accordance with a blend specific to each body. The living being\ngrows when their tissues, i.e., their homoeomerous bodies, increase\ntheir size. Certainly, the existence of principles or causes is known\nin the case of growth as it was made clear in the case of the four\nelements: they were the material, formal and efficient cause. \n\nAverroes understands that growth occurs primarily (awwalan)\nin the homoeomerous bodies, which are matter for the organic\n(āliyah) bodies, while these organs, or limbs, grow\nthrough growth occurring in the homoeomerous tissues (Averroes, MC GC\nEn, 33) (MC GC Ar, 41: 9–10). And so, Aristotle saw that the\nhomoeomerous bodies interact as material and formal causes, “for\nthe form as well as the matter is called flesh or bone” (GC 321b\n20–22).\n\nMatter is fluid (sā’il) and form, persistent\n(thābit) and so, form is determinant; the form of flesh\nor bone determines the homoeomerous body. As the magnitude is not\nunchanging, growth needs food to be brought in from the outside, and\nfood must give up its specific form and become flesh or bone\n“through a process of mixture” (Averroes, MC GC En,\n39).\n\nAverroes faces an objection by Alexander of Aphrodisias concerning the\nassimilation of the food; the passage has been thoroughly studied by\nEichner (Averroes, MC GC Ar 2005) who translated all the relevant\ntexts. Alexander was awfully admired by Averroes but was criticized by\nthe latter in his Middle Commentary. Alexander—according to\nAverroes—sustained that there is a moisture, or humidity\ndispersed (mabthūtha) throughout all of the limbs, that\nthe incoming food mixes with it and that as a result, food is\ntransformed into the “nature of this\nmoisture” (ṭabīʽa tilka\nl-ruṭūba) (MC GC Ar 2005, 44: 2). Its increase is\ngrowth and its decrease, diminution, but the shape of the limbs is\nstable. If this account—such as it is given in the Middle\nCommentary—were Alexander’s, then Averroes’ critique\nwould be permissible from his point of view, because the doctrine\nwould be valid only for things undergoing mixture (MC GC Ar, 48: 16).\nIt seems more adequate to regard Alexander’s physiological\nexplanation as insufficient.\n\nPhysiology set apart from the discussion, philosophy is that which\nmust give a comprehensive explanation using the instruments available\nto the philosopher, i.e., the distinction between matter and form,\nbetween being itself, per se and qua,  min\njihatin mā, and between quality and quantity. Form per\nse does not grow but insofar as it is quantity endowed with form,\nit does (MC GC Ar, 45: 2). Matter qua matter, i.e., per\nse cannot grow but in so far as any perceptible part possesses\nmatter, it is needed and present. Averroes concludes:\n\nThe Master indeed did not mean to say that growth takes place in the\nform to the exclusion of the matter, nor in the matter to the\nexclusion of the form, but he did mean to say that growth takes place\nin all parts of the growing thing due to their form, not due to their\nmatter by virtue of which they are parts (Averroes, MC GC Ar 2005, 46\n18 – 47 2) (MC GC En 1958, 37).\n\n\nSince the participation of the material and formal principle has been\nclarified, we should proceed with analyzing the efficient cause with\nrespect to growth, that Aristotle considered in GC 320b 17–22 and\nagain in GC 322a 28–33. Let us not forget that Aristotle placed the\nprinciple of motion, (arkhē tēs kinēseōs,\nmabda’ al-taḥrīk ) i.e., the efficient cause\nof alteration and of growth in the thing which undergoes alteration or\ngrowth (321b 6–10). \n\nGrowth and nutrition are intrinsically linked to life, and require the\nvegetative soul investigated by Aristotle in De anima II 4\n(416b 18–31). The vegetative soul is also generative\n(psykhē genetikē), producing the power to grow\n(dynamis auxētikē). Joachim identified the form of\nthe growing thing with this power in his commentary on GC 322a 28–33\n(GC Joachim 1926, 135–136) and so did Averroes. He says that the\ngrowing thing has a power due to which it has a form. It is\n“endowed with form” (dhū ṣūra),\nso that “Were it not for the presence of that force in the\ngrowing thing, growth in all the sensible parts of the growing thing\nwould be impossible” (Averroes, MC GC En 1958, 38) (Averroes, MC\nGC Ar 2005, 48 13–15) .\n\nOn the other side, Aristotle mentioned the efficient cause of\ncoming-to-be in 320b 17–22, although in a generic way. Philoponus\ninterpretated it as something applicable to growth too (Philoponus\n2013, 114–115) and introduced the strict term, poiētikon\naition (Philoponus CAG 1897, 83: 25–26).\nAverroes follows him and compares coming-to-be and growth with respect\nto the efficient cause (sabab fā‛il) (MC GC Ar,\n37: 9–15) arriving at the conclusion that the efficient cause is not\nonly in the growing thing but also of the same species as its parts.\nAverroes has set forth the material, formal and efficient causes in\nthe processes of growth, and diminution, as close as possible to\nAristotle, which was his purpose. The preeminence of form has shown in\nmany aspects, that of principle of life being indisputable.\n",
    "section_title": "14. Alteration, Growth, Nutrition",
    "entry_title": "Ibn Rushd’s Natural Philosophy",
    "hierarchy_title": "Ibn Rushd’s Natural Philosophy || Alteration, Growth, Nutrition",
    "tokenized_text": [
        "alteration",
        "growth",
        "nutrition",
        "alteration",
        "growth",
        "nutrition",
        "middle",
        "commentary",
        "de",
        "generatione",
        "et",
        "corruptione",
        "systematic",
        "organizing",
        "aristotle",
        "original",
        "case",
        "middle",
        "commentary",
        "physic",
        "averroes",
        "draw",
        "synopsis",
        "divide",
        "content",
        "book",
        "maqāla",
        "one",
        "section",
        "jumla",
        "jumla",
        "chapter",
        "faṣl",
        "following",
        "method",
        "divisio",
        "textus",
        "averroes",
        "paraphrase",
        "gc",
        "a",
        "i",
        "writes",
        "aristotle",
        "purpose",
        "explain",
        "cause",
        "common",
        "naturally",
        "bilṭabʻ",
        "generable",
        "corruptible",
        "thing",
        "explain",
        "well",
        "cause",
        "growth",
        "alteration",
        "averroes",
        "mc",
        "gc",
        "ar",
        "mc",
        "gc",
        "en",
        "natural",
        "opposes",
        "artificial",
        "therefore",
        "averroes",
        "aristotle",
        "agree",
        "separating",
        "change",
        "place",
        "three",
        "kind",
        "want",
        "look",
        "common",
        "cause",
        "three",
        "comingtobe",
        "analyzed",
        "alteration",
        "growth",
        "remain",
        "alteration",
        "istiḥālah",
        "change",
        "quality",
        "underlying",
        "subject",
        "substratum",
        "mawḍūʻ",
        "remains",
        "one",
        "throughout",
        "process",
        "mawḍūʻ",
        "definite",
        "thing",
        "existing",
        "actuality",
        "plenty",
        "example",
        "averroes",
        "mc",
        "gc",
        "en",
        "mc",
        "gc",
        "ar",
        "much",
        "discussion",
        "alteration",
        "growth",
        "opposite",
        "diminution",
        "come",
        "fore",
        "easy",
        "understand",
        "affect",
        "animated",
        "being",
        "emphsykha",
        "change",
        "essence",
        "life",
        "death",
        "aristotle",
        "treated",
        "subject",
        "place",
        "de",
        "anima",
        "generation",
        "animal",
        "part",
        "animal",
        "gc",
        "i",
        "a",
        "a",
        "discussed",
        "growth",
        "contrast",
        "comingtobe",
        "alteration",
        "passage",
        "commented",
        "alexander",
        "whose",
        "text",
        "known",
        "averroes",
        "u",
        "rely",
        "philoponus",
        "also",
        "discus",
        "issue",
        "growth",
        "length",
        "commentary",
        "gc",
        "philoponus",
        "gc",
        "gr",
        "indirect",
        "source",
        "explanation",
        "look",
        "material",
        "formal",
        "efficient",
        "cause",
        "investigated",
        "object",
        "aristotle",
        "observed",
        "matter",
        "chief",
        "strictest",
        "sense",
        "word",
        "substratum",
        "admits",
        "comingtobe",
        "passingaway",
        "substratum",
        "kind",
        "change",
        "also",
        "sense",
        "matter",
        "gc",
        "a",
        "gc",
        "forster",
        "sense",
        "left",
        "question",
        "open",
        "maybe",
        "reason",
        "averroes",
        "introduced",
        "notion",
        "corporeality",
        "answering",
        "corporeality",
        "jismīya",
        "common",
        "generated",
        "substance",
        "one",
        "number",
        "potentiality",
        "actuality",
        "corporeality",
        "substratum",
        "alteration",
        "one",
        "number",
        "actuality",
        "averroes",
        "mc",
        "gc",
        "ar",
        "mc",
        "gc",
        "en",
        "editor",
        "eichner",
        "well",
        "translator",
        "kurland",
        "draw",
        "attention",
        "reader",
        "fact",
        "whole",
        "paragraph",
        "averroes",
        "mc",
        "gc",
        "ar",
        "missing",
        "hebrew",
        "latin",
        "translation",
        "arabic",
        "manuscript",
        "oxford",
        "bodleian",
        "appears",
        "body",
        "one",
        "arabic",
        "manuscript",
        "paris",
        "margin",
        "another",
        "modena",
        "one",
        "doubt",
        "whether",
        "averroes",
        "real",
        "author",
        "case",
        "explanation",
        "halffinished",
        "philoponus",
        "said",
        "matter",
        "corporeal",
        "substance",
        "one",
        "thing",
        "growth",
        "another",
        "philoponus",
        "gc",
        "en",
        "saw",
        "distinction",
        "purely",
        "definition",
        "tōi",
        "logōi",
        "following",
        "aristotle",
        "gc",
        "b",
        "averroes",
        "knew",
        "set",
        "forth",
        "growth",
        "take",
        "place",
        "body",
        "existent",
        "act",
        "mc",
        "gc",
        "ar",
        "considers",
        "difficulty",
        "already",
        "raised",
        "aristotle",
        "statement",
        "solution",
        "problem",
        "obtained",
        "mean",
        "examining",
        "growth",
        "occurs",
        "aristotle",
        "discerns",
        "three",
        "characteristic",
        "every",
        "part",
        "growing",
        "magnitude",
        "largerfor",
        "instance",
        "flesh",
        "grows",
        "every",
        "part",
        "flesh",
        "grows",
        "b",
        "grows",
        "accession",
        "something",
        "c",
        "grows",
        "grows",
        "preserved",
        "sōzomenon",
        "remains",
        "aristotle",
        "gc",
        "forster",
        "averroes",
        "paraphrase",
        "passage",
        "read",
        "specific",
        "every",
        "drop",
        "every",
        "perceptible",
        "part",
        "grows",
        "manner",
        "likewise",
        "diminishes",
        "every",
        "perceptible",
        "part",
        "characteristic",
        "c",
        "read",
        "also",
        "differently",
        "thing",
        "characterized",
        "growth",
        "diminution",
        "must",
        "definite",
        "mushār",
        "ilayhi",
        "remain",
        "identical",
        "averroes",
        "mc",
        "gc",
        "ar",
        "averroes",
        "make",
        "clear",
        "growth",
        "increase",
        "volume",
        "homoeomerous",
        "body",
        "play",
        "key",
        "role",
        "aristotelian",
        "tradition",
        "consider",
        "organic",
        "tissue",
        "like",
        "blood",
        "flesh",
        "bone",
        "also",
        "mineral",
        "like",
        "gold",
        "silver",
        "homoeomerous",
        "body",
        "composed",
        "four",
        "element",
        "composition",
        "accordance",
        "blend",
        "specific",
        "body",
        "living",
        "grows",
        "tissue",
        "ie",
        "homoeomerous",
        "body",
        "increase",
        "size",
        "certainly",
        "existence",
        "principle",
        "cause",
        "known",
        "case",
        "growth",
        "made",
        "clear",
        "case",
        "four",
        "element",
        "material",
        "formal",
        "efficient",
        "cause",
        "averroes",
        "understands",
        "growth",
        "occurs",
        "primarily",
        "awwalan",
        "homoeomerous",
        "body",
        "matter",
        "organic",
        "āliyah",
        "body",
        "organ",
        "limb",
        "grow",
        "growth",
        "occurring",
        "homoeomerous",
        "tissue",
        "averroes",
        "mc",
        "gc",
        "en",
        "mc",
        "gc",
        "ar",
        "aristotle",
        "saw",
        "homoeomerous",
        "body",
        "interact",
        "material",
        "formal",
        "cause",
        "form",
        "well",
        "matter",
        "called",
        "flesh",
        "bone",
        "gc",
        "b",
        "matter",
        "fluid",
        "sā",
        "il",
        "form",
        "persistent",
        "thābit",
        "form",
        "determinant",
        "form",
        "flesh",
        "bone",
        "determines",
        "homoeomerous",
        "body",
        "magnitude",
        "unchanging",
        "growth",
        "need",
        "food",
        "brought",
        "outside",
        "food",
        "must",
        "give",
        "specific",
        "form",
        "become",
        "flesh",
        "bone",
        "process",
        "mixture",
        "averroes",
        "mc",
        "gc",
        "en",
        "averroes",
        "face",
        "objection",
        "alexander",
        "aphrodisia",
        "concerning",
        "assimilation",
        "food",
        "passage",
        "thoroughly",
        "studied",
        "eichner",
        "averroes",
        "mc",
        "gc",
        "ar",
        "translated",
        "relevant",
        "text",
        "alexander",
        "awfully",
        "admired",
        "averroes",
        "criticized",
        "latter",
        "middle",
        "commentary",
        "alexanderaccording",
        "averroessustained",
        "moisture",
        "humidity",
        "dispersed",
        "mabthūtha",
        "throughout",
        "limb",
        "incoming",
        "food",
        "mix",
        "result",
        "food",
        "transformed",
        "nature",
        "moisture",
        "ṭabīʽa",
        "tilka",
        "lruṭūba",
        "mc",
        "gc",
        "ar",
        "increase",
        "growth",
        "decrease",
        "diminution",
        "shape",
        "limb",
        "stable",
        "accountsuch",
        "given",
        "middle",
        "commentarywere",
        "alexander",
        "averroes",
        "critique",
        "would",
        "permissible",
        "point",
        "view",
        "doctrine",
        "would",
        "valid",
        "thing",
        "undergoing",
        "mixture",
        "mc",
        "gc",
        "ar",
        "seems",
        "adequate",
        "regard",
        "alexander",
        "physiological",
        "explanation",
        "insufficient",
        "physiology",
        "set",
        "apart",
        "discussion",
        "philosophy",
        "must",
        "give",
        "comprehensive",
        "explanation",
        "using",
        "instrument",
        "available",
        "philosopher",
        "ie",
        "distinction",
        "matter",
        "form",
        "per",
        "se",
        "qua",
        "min",
        "jihatin",
        "mā",
        "quality",
        "quantity",
        "form",
        "per",
        "se",
        "grow",
        "insofar",
        "quantity",
        "endowed",
        "form",
        "mc",
        "gc",
        "ar",
        "matter",
        "qua",
        "matter",
        "ie",
        "per",
        "se",
        "grow",
        "far",
        "perceptible",
        "part",
        "posse",
        "matter",
        "needed",
        "present",
        "averroes",
        "concludes",
        "master",
        "indeed",
        "mean",
        "say",
        "growth",
        "take",
        "place",
        "form",
        "exclusion",
        "matter",
        "matter",
        "exclusion",
        "form",
        "mean",
        "say",
        "growth",
        "take",
        "place",
        "part",
        "growing",
        "thing",
        "due",
        "form",
        "due",
        "matter",
        "virtue",
        "part",
        "averroes",
        "mc",
        "gc",
        "ar",
        "mc",
        "gc",
        "en",
        "since",
        "participation",
        "material",
        "formal",
        "principle",
        "clarified",
        "proceed",
        "analyzing",
        "efficient",
        "cause",
        "respect",
        "growth",
        "aristotle",
        "considered",
        "gc",
        "b",
        "gc",
        "a",
        "let",
        "u",
        "forget",
        "aristotle",
        "placed",
        "principle",
        "motion",
        "arkhē",
        "tēs",
        "kinēseōs",
        "mabda",
        "altaḥrīk",
        "ie",
        "efficient",
        "cause",
        "alteration",
        "growth",
        "thing",
        "undergoes",
        "alteration",
        "growth",
        "b",
        "growth",
        "nutrition",
        "intrinsically",
        "linked",
        "life",
        "require",
        "vegetative",
        "soul",
        "investigated",
        "aristotle",
        "de",
        "anima",
        "ii",
        "b",
        "vegetative",
        "soul",
        "also",
        "generative",
        "psykhē",
        "genetikē",
        "producing",
        "power",
        "grow",
        "dynamis",
        "auxētikē",
        "joachim",
        "identified",
        "form",
        "growing",
        "thing",
        "power",
        "commentary",
        "gc",
        "a",
        "gc",
        "joachim",
        "averroes",
        "say",
        "growing",
        "thing",
        "power",
        "due",
        "form",
        "endowed",
        "form",
        "dhū",
        "ṣūra",
        "presence",
        "force",
        "growing",
        "thing",
        "growth",
        "sensible",
        "part",
        "growing",
        "thing",
        "would",
        "impossible",
        "averroes",
        "mc",
        "gc",
        "en",
        "averroes",
        "mc",
        "gc",
        "ar",
        "side",
        "aristotle",
        "mentioned",
        "efficient",
        "cause",
        "comingtobe",
        "b",
        "although",
        "generic",
        "way",
        "philoponus",
        "interpretated",
        "something",
        "applicable",
        "growth",
        "philoponus",
        "introduced",
        "strict",
        "term",
        "poiētikon",
        "aition",
        "philoponus",
        "cag",
        "averroes",
        "follows",
        "compare",
        "comingtobe",
        "growth",
        "respect",
        "efficient",
        "cause",
        "sabab",
        "fāil",
        "mc",
        "gc",
        "ar",
        "arriving",
        "conclusion",
        "efficient",
        "cause",
        "growing",
        "thing",
        "also",
        "specie",
        "part",
        "averroes",
        "set",
        "forth",
        "material",
        "formal",
        "efficient",
        "cause",
        "process",
        "growth",
        "diminution",
        "close",
        "possible",
        "aristotle",
        "purpose",
        "preeminence",
        "form",
        "shown",
        "many",
        "aspect",
        "principle",
        "life",
        "indisputable"
    ]
}