{
    "main_text": "Medieval Physics || Nature\n1.2 Nature\n\nClosely related to causes and principles is the notion of a nature\n(Gk. phusis, Ar. ṭabīʿa), for\nAristotle defined a nature as “a principle of being moved and\nbeing at rest in that to which it belongs primarily, not accidentally\nbut essentially” (Aristotle, Physics, 2.1,\n192b21–3). Before commenting Aristotle’s definition of\nnature, Avicenna begins his chapter “On Defining Nature”\nfrom The Cure (Avicenna, [Ph], 1.5) by distinguishing between\nthe motions and actions that proceed from a substance owing to\nexternal causes and those that proceed from a substance owing to the\nsubstance itself. For instance, water becomes hot as a result of some\nexternal heat sources, whereas it becomes cool of itself. Avicenna\nnext identifies two sets of parameters for describing those motions\nand actions that proceed from a substance owing to that substance\nitself. They may either proceed from the substance as a result of\nvolition or without volition. Additionally they may proceed either\nuniformly without deviation or non-uniformly with deviation. Thus\nthere are four very general ways for dividing and describing all the\nmotions and actions that are found in the cosmos.\n\n\n\n \nvolitional\nnon-volitional \n\nnon-uniform\nanimal soul\nplant soul \n\nuniform\ncelestial soul\nnature  \n\n\n(1) Motions and actions may proceed as a result of volition and do so\nin a uniform and unvarying way, such as the motion of the heavenly\nbodies. The internal cause in these cases, Avicenna tells us, is a\ncelestial\n soul.[2]\n (2) Other motions and actions may proceed as a result of volition but\ndo so in a non-uniform and varying way, like the motions and actions\nof animals; the internal cause in these cases is an animal soul. (3)\nAgain, other motions and actions may not proceed as a result of\nvolition and are non-uniform and varying, like plant growth; the\ninternal cause in these cases is a plant soul. Finally (4) some\nmotions and actions may proceed without volition while doing so in a\nuniform and unvarying way, like the downward motion of a clod of earth\nand the heating of fire; the internal cause in these cases is a\nnature.\n\nNext, he turns to Aristotle’s own account of nature and begins\nby chiding Aristotle for his cavalier assertion that trying to prove\nthat natures exist is a fool’s errand, since it is self-evident\nthat things have such (internal) causes. While we are immediately\naware of motions and actions that seemingly proceed from substances of\nthemselves, that there truly exist internal causes of these\nactions and motions is certainly in need of demonstration. Indeed, one\nwho first encounters the motion of a magnet, Avicenna gives as an\nexample, might imagine that its motion is a result solely of itself\nrather than of iron in the vicinity. Moreover, during Avicenna’s\ntime the question of whether natures existed at all was a hotly\ndebated topic between philosophers in the Graeco-Arabic tradition,\nlike Avicenna, and thinkers in the Kalām tradition, the tradition\nof Islamic speculative theology and cosmology.\n\nProponents of the Kalām tradition, such as\nal-Bāqillānī (950–1013) and\n al-Ghazālī\n (1058–1111), had a two-stage critique. First, anticipating Hume\nby at least 700 years, these thinkers noted that observation alone\ncould not distinguish between causal connections and mere constant\nconjunctions. (A contemporary example often found in statistic classes\nis that the summer sun’s heat seems to be causally connected\nwith ice cream’s melting, whereas eating ice cream is only\nconstantly conjoined, at least in the US, with an increase in violent\ncrimes.) Observation alone, these thinkers warn us, cannot determine,\nfor example, whether the cotton’s burning, which follows upon\nplacing fire in the cotton, or intoxication, which follows upon\nimbibing alcohol, is causally connected with the natures of fire and\nalcohol respectively, or whether these sets of events are merely\nconstantly conjoined. Indeed the concurrence of two events may be a\nresult of God’s habit or custom (ʿāda or\nsunna) of causing the one event together with the other.\nWhile one might think that appealing to God to explain the various\nmundane events that we constantly observe around us is extravagant,\nKalām thinkers countered that it was in fact the philosophers who\nare ontologically profligate, for the theologians assume only one\nclass of causes, namely, willful agent(s), whereas the philosophers\nare committed to two ontologically distinct classes of causes, if not\nmore. This point leads to the second stage of the Kalām critique\nof natures. God’s (omnipotent) causal power extends to every\nactual or even possible event. God’s causal power is either\nsufficient to produce these effects or it is not. If God’s power\nis not sufficient, then either the deity needs the added\n“boost” of natural powers, or it needs natures as a tool\nor instrument, etc. This later position flirts with impiety. If,\nhowever, God’s causal power is sufficient to produce every\neffect and there are also natures, functioning as internal causes,\nevery event is over-determined. Indeed it is not clear at all what\ncausal role natures have to play. A principle of parsimony, so the\nKalām critique concludes, suggests that natures be jettisoned and\none reserve all causal power to God alone. While Avicenna addresses\nthe issue of the existence of natures and offers up a demonstration\nfor their existence in the Metaphysics (4.2, 9.2 & 9.5;\nalso see Dadikhuda 2019), he also notes that the science of physics is\nnot the proper place to undertake such an enterprise. That is because\nthe existence of a science’s subject matter, Avicenna notes\nfollowing Aristotle, is never demonstrated within that very science\nitself but only in a higher science.\n\nHaving set aside the issue of whether natures exist and for present\npurposes posits that they do, Avicenna now unpacks Aristotle’s\ndefinition. Before considering his analysis, however, it should be\nnoted that there is a certain ambiguity in Aristotle’s overall\ntreatment of nature. The ambiguity involves whether nature should be\ntaken in a passive sense: is nature a cause of a substance’s\nbeing moved? Or, alternatively, should nature be taken in an\nactive sense: is a nature a cause of a substance’s (self)\nmotion? In Physics, 2.1, the text where Aristotle defines\nnature, he suggests, although does not explicitly claim, that nature\ncan be understood in both senses: a passive nature, which corresponds\nwith a substance’s matter, and an active nature, which\ncorresponds with the form of that substance, and so is a cause of its\nmotion. In contrast, later in the Physics, he argues that\nnatures should be understood exclusively as passive (Aristotle,\nPhysics, 8.4, 225b29–256a3). This conclusion follows\nupon Aristotle’s principle that everything that is moved must be\nmoved by something, which he established at Physics, 7. The\nprinciple is significant for a key element in Aristotle’s his\nnatural philosophy, namely, his proof for an unmoved mover. (The\nunmoved mover is intended to explain why there is motion at all.) The\naforementioned principle is significant because if all natural\nsubstances were capable of self motion, it is no longer clear that\nthere is a need for an unmoved mover to account for the motion of the\ncosmos. This ambiguity in Aristotle account of nature, namely, whether\nnature is an active source of moving or a passive factor of being\nmoved, was the source of much discussion among Aristotle’s\nsubsequent Greek commentators, who included\n Alexander of Aphrodisias\n (ca. 200 CE) and the late Christian, Neoplatonic Philosopher\n John Philoponus\n (ca. 490–570). (For more detailed studies of this tradition see\nMacierowski & Hassing 1988, Lang 1992, 97–124 and Lammer\n2015, 2018, ch. 4).\n\nAristotle’s definition of nature as it came down to Avicenna in\nArabic literally translates into English as “the primary\nprinciple of motion and rest in that to which it belongs essentially\nrather than accidentally” (quoted in Avicenna, [Ph], 1.5\n [4]).[3]\n A “principle of motion,” Avicenna tells us, means\n“an efficient cause from which proceeds the production of motion\nin another, namely, the moved body” (ibid). Immediately we\nrecognize that a nature for Avicenna can be understood as an active\ncause that produces motion. Such a position is to be contrasted with\nAristotle’s claim at Physics 8.4 that a nature is not\nan internal cause of a thing’s motion, but of its being\n moved.[4]\n Next we learn that “primary” in the definition means that\nthe nature causes the motion in the body without some further\nintermediary cause. As for “essentially,” (Gk. kath\nhauto, Ar. bi-dhātihi) it is an equivocal notion\nwith two senses, Avicenna tells us. In one sense,\n“essentially” is predicated relative to the mover, while\nin another sense it is predicated relative to what is subject to\nmotion, namely, the body. Thus, on the one hand, when\n“essentially” is said relative to the mover, a\nsubstance’s nature, as efficient cause, essentially produces\nthose motions and actions that typify the substance as the kind that\nit is. On the other hand, when “essentially” is said\nrelative to the body, it refers to the body’s essentially being\nsubject to those naturally characteristic motions and actions. In\neffect, by distinguishing the two relative senses of\n“essentially,” Avicenna has made room for\nAristotle’s definition to include nature as an active and as\npassive principle. To sum up, for Avicenna, a substance’s nature\nis the immediate efficient cause for all of the naturally\ncharacteristic actions and motions it produces (active nature) as well\nas explaining why the body is subject to those characteristic actions\nand motions (passive nature).\n",
    "section_title": "1.2 Nature",
    "entry_title": "Ibn Sina’s Natural Philosophy",
    "hierarchy_title": "Ibn Sina’s Natural Philosophy || Medieval Physics || Nature",
    "tokenized_text": [
        "medieval",
        "physic",
        "nature",
        "nature",
        "closely",
        "related",
        "cause",
        "principle",
        "notion",
        "nature",
        "gk",
        "phusis",
        "ar",
        "ṭabīʿa",
        "aristotle",
        "defined",
        "nature",
        "principle",
        "moved",
        "rest",
        "belongs",
        "primarily",
        "accidentally",
        "essentially",
        "aristotle",
        "physic",
        "b",
        "commenting",
        "aristotle",
        "definition",
        "nature",
        "avicenna",
        "begin",
        "chapter",
        "defining",
        "nature",
        "cure",
        "avicenna",
        "ph",
        "distinguishing",
        "motion",
        "action",
        "proceed",
        "substance",
        "owing",
        "external",
        "cause",
        "proceed",
        "substance",
        "owing",
        "substance",
        "instance",
        "water",
        "becomes",
        "hot",
        "result",
        "external",
        "heat",
        "source",
        "whereas",
        "becomes",
        "cool",
        "avicenna",
        "next",
        "identifies",
        "two",
        "set",
        "parameter",
        "describing",
        "motion",
        "action",
        "proceed",
        "substance",
        "owing",
        "substance",
        "may",
        "either",
        "proceed",
        "substance",
        "result",
        "volition",
        "without",
        "volition",
        "additionally",
        "may",
        "proceed",
        "either",
        "uniformly",
        "without",
        "deviation",
        "nonuniformly",
        "deviation",
        "thus",
        "four",
        "general",
        "way",
        "dividing",
        "describing",
        "motion",
        "action",
        "found",
        "cosmos",
        "volitional",
        "nonvolitional",
        "nonuniform",
        "animal",
        "soul",
        "plant",
        "soul",
        "uniform",
        "celestial",
        "soul",
        "nature",
        "motion",
        "action",
        "may",
        "proceed",
        "result",
        "volition",
        "uniform",
        "unvarying",
        "way",
        "motion",
        "heavenly",
        "body",
        "internal",
        "cause",
        "case",
        "avicenna",
        "tell",
        "u",
        "celestial",
        "soul",
        "motion",
        "action",
        "may",
        "proceed",
        "result",
        "volition",
        "nonuniform",
        "varying",
        "way",
        "like",
        "motion",
        "action",
        "animal",
        "internal",
        "cause",
        "case",
        "animal",
        "soul",
        "motion",
        "action",
        "may",
        "proceed",
        "result",
        "volition",
        "nonuniform",
        "varying",
        "like",
        "plant",
        "growth",
        "internal",
        "cause",
        "case",
        "plant",
        "soul",
        "finally",
        "motion",
        "action",
        "may",
        "proceed",
        "without",
        "volition",
        "uniform",
        "unvarying",
        "way",
        "like",
        "downward",
        "motion",
        "clod",
        "earth",
        "heating",
        "fire",
        "internal",
        "cause",
        "case",
        "nature",
        "next",
        "turn",
        "aristotle",
        "account",
        "nature",
        "begin",
        "chiding",
        "aristotle",
        "cavalier",
        "assertion",
        "trying",
        "prove",
        "nature",
        "exist",
        "fool",
        "errand",
        "since",
        "selfevident",
        "thing",
        "internal",
        "cause",
        "immediately",
        "aware",
        "motion",
        "action",
        "seemingly",
        "proceed",
        "substance",
        "truly",
        "exist",
        "internal",
        "cause",
        "action",
        "motion",
        "certainly",
        "need",
        "demonstration",
        "indeed",
        "one",
        "first",
        "encounter",
        "motion",
        "magnet",
        "avicenna",
        "give",
        "example",
        "might",
        "imagine",
        "motion",
        "result",
        "solely",
        "rather",
        "iron",
        "vicinity",
        "moreover",
        "avicenna",
        "time",
        "question",
        "whether",
        "nature",
        "existed",
        "hotly",
        "debated",
        "topic",
        "philosopher",
        "graecoarabic",
        "tradition",
        "like",
        "avicenna",
        "thinker",
        "kalām",
        "tradition",
        "tradition",
        "islamic",
        "speculative",
        "theology",
        "cosmology",
        "proponent",
        "kalām",
        "tradition",
        "albāqillānī",
        "alghazālī",
        "twostage",
        "critique",
        "first",
        "anticipating",
        "hume",
        "least",
        "year",
        "thinker",
        "noted",
        "observation",
        "alone",
        "could",
        "distinguish",
        "causal",
        "connection",
        "mere",
        "constant",
        "conjunction",
        "contemporary",
        "example",
        "often",
        "found",
        "statistic",
        "class",
        "summer",
        "sun",
        "heat",
        "seems",
        "causally",
        "connected",
        "ice",
        "cream",
        "melting",
        "whereas",
        "eating",
        "ice",
        "cream",
        "constantly",
        "conjoined",
        "least",
        "u",
        "increase",
        "violent",
        "crime",
        "observation",
        "alone",
        "thinker",
        "warn",
        "u",
        "determine",
        "example",
        "whether",
        "cotton",
        "burning",
        "follows",
        "upon",
        "placing",
        "fire",
        "cotton",
        "intoxication",
        "follows",
        "upon",
        "imbibing",
        "alcohol",
        "causally",
        "connected",
        "nature",
        "fire",
        "alcohol",
        "respectively",
        "whether",
        "set",
        "event",
        "merely",
        "constantly",
        "conjoined",
        "indeed",
        "concurrence",
        "two",
        "event",
        "may",
        "result",
        "god",
        "habit",
        "custom",
        "ʿāda",
        "sunna",
        "causing",
        "one",
        "event",
        "together",
        "one",
        "might",
        "think",
        "appealing",
        "god",
        "explain",
        "various",
        "mundane",
        "event",
        "constantly",
        "observe",
        "around",
        "u",
        "extravagant",
        "kalām",
        "thinker",
        "countered",
        "fact",
        "philosopher",
        "ontologically",
        "profligate",
        "theologian",
        "assume",
        "one",
        "class",
        "cause",
        "namely",
        "willful",
        "agent",
        "whereas",
        "philosopher",
        "committed",
        "two",
        "ontologically",
        "distinct",
        "class",
        "cause",
        "point",
        "lead",
        "second",
        "stage",
        "kalām",
        "critique",
        "nature",
        "god",
        "omnipotent",
        "causal",
        "power",
        "extends",
        "every",
        "actual",
        "even",
        "possible",
        "event",
        "god",
        "causal",
        "power",
        "either",
        "sufficient",
        "produce",
        "effect",
        "god",
        "power",
        "sufficient",
        "either",
        "deity",
        "need",
        "added",
        "boost",
        "natural",
        "power",
        "need",
        "nature",
        "tool",
        "instrument",
        "etc",
        "later",
        "position",
        "flirt",
        "impiety",
        "however",
        "god",
        "causal",
        "power",
        "sufficient",
        "produce",
        "every",
        "effect",
        "also",
        "nature",
        "functioning",
        "internal",
        "cause",
        "every",
        "event",
        "overdetermined",
        "indeed",
        "clear",
        "causal",
        "role",
        "nature",
        "play",
        "principle",
        "parsimony",
        "kalām",
        "critique",
        "concludes",
        "suggests",
        "nature",
        "jettisoned",
        "one",
        "reserve",
        "causal",
        "power",
        "god",
        "alone",
        "avicenna",
        "address",
        "issue",
        "existence",
        "nature",
        "offer",
        "demonstration",
        "existence",
        "metaphysics",
        "also",
        "see",
        "dadikhuda",
        "also",
        "note",
        "science",
        "physic",
        "proper",
        "place",
        "undertake",
        "enterprise",
        "existence",
        "science",
        "subject",
        "matter",
        "avicenna",
        "note",
        "following",
        "aristotle",
        "never",
        "demonstrated",
        "within",
        "science",
        "higher",
        "science",
        "set",
        "aside",
        "issue",
        "whether",
        "nature",
        "exist",
        "present",
        "purpose",
        "posit",
        "avicenna",
        "unpacks",
        "aristotle",
        "definition",
        "considering",
        "analysis",
        "however",
        "noted",
        "certain",
        "ambiguity",
        "aristotle",
        "overall",
        "treatment",
        "nature",
        "ambiguity",
        "involves",
        "whether",
        "nature",
        "taken",
        "passive",
        "sense",
        "nature",
        "cause",
        "substance",
        "moved",
        "alternatively",
        "nature",
        "taken",
        "active",
        "sense",
        "nature",
        "cause",
        "substance",
        "self",
        "motion",
        "physic",
        "text",
        "aristotle",
        "defines",
        "nature",
        "suggests",
        "although",
        "explicitly",
        "claim",
        "nature",
        "understood",
        "sens",
        "passive",
        "nature",
        "corresponds",
        "substance",
        "matter",
        "active",
        "nature",
        "corresponds",
        "form",
        "substance",
        "cause",
        "motion",
        "contrast",
        "later",
        "physic",
        "argues",
        "nature",
        "understood",
        "exclusively",
        "passive",
        "aristotle",
        "physic",
        "ba",
        "conclusion",
        "follows",
        "upon",
        "aristotle",
        "principle",
        "everything",
        "moved",
        "must",
        "moved",
        "something",
        "established",
        "physic",
        "principle",
        "significant",
        "key",
        "element",
        "aristotle",
        "natural",
        "philosophy",
        "namely",
        "proof",
        "unmoved",
        "mover",
        "unmoved",
        "mover",
        "intended",
        "explain",
        "motion",
        "aforementioned",
        "principle",
        "significant",
        "natural",
        "substance",
        "capable",
        "self",
        "motion",
        "longer",
        "clear",
        "need",
        "unmoved",
        "mover",
        "account",
        "motion",
        "cosmos",
        "ambiguity",
        "aristotle",
        "account",
        "nature",
        "namely",
        "whether",
        "nature",
        "active",
        "source",
        "moving",
        "passive",
        "factor",
        "moved",
        "source",
        "much",
        "discussion",
        "among",
        "aristotle",
        "subsequent",
        "greek",
        "commentator",
        "included",
        "alexander",
        "aphrodisia",
        "ca",
        "ce",
        "late",
        "christian",
        "neoplatonic",
        "philosopher",
        "john",
        "philoponus",
        "ca",
        "detailed",
        "study",
        "tradition",
        "see",
        "macierowski",
        "hassing",
        "lang",
        "lammer",
        "ch",
        "aristotle",
        "definition",
        "nature",
        "came",
        "avicenna",
        "arabic",
        "literally",
        "translates",
        "english",
        "primary",
        "principle",
        "motion",
        "rest",
        "belongs",
        "essentially",
        "rather",
        "accidentally",
        "quoted",
        "avicenna",
        "ph",
        "principle",
        "motion",
        "avicenna",
        "tell",
        "u",
        "mean",
        "efficient",
        "cause",
        "proceeds",
        "production",
        "motion",
        "another",
        "namely",
        "moved",
        "body",
        "ibid",
        "immediately",
        "recognize",
        "nature",
        "avicenna",
        "understood",
        "active",
        "cause",
        "produce",
        "motion",
        "position",
        "contrasted",
        "aristotle",
        "claim",
        "physic",
        "nature",
        "internal",
        "cause",
        "thing",
        "motion",
        "moved",
        "next",
        "learn",
        "primary",
        "definition",
        "mean",
        "nature",
        "cause",
        "motion",
        "body",
        "without",
        "intermediary",
        "cause",
        "essentially",
        "gk",
        "kath",
        "hauto",
        "ar",
        "bidhātihi",
        "equivocal",
        "notion",
        "two",
        "sens",
        "avicenna",
        "tell",
        "u",
        "one",
        "sense",
        "essentially",
        "predicated",
        "relative",
        "mover",
        "another",
        "sense",
        "predicated",
        "relative",
        "subject",
        "motion",
        "namely",
        "body",
        "thus",
        "one",
        "hand",
        "essentially",
        "said",
        "relative",
        "mover",
        "substance",
        "nature",
        "efficient",
        "cause",
        "essentially",
        "produce",
        "motion",
        "action",
        "typify",
        "substance",
        "kind",
        "hand",
        "essentially",
        "said",
        "relative",
        "body",
        "refers",
        "body",
        "essentially",
        "subject",
        "naturally",
        "characteristic",
        "motion",
        "action",
        "effect",
        "distinguishing",
        "two",
        "relative",
        "sens",
        "essentially",
        "avicenna",
        "made",
        "room",
        "aristotle",
        "definition",
        "include",
        "nature",
        "active",
        "passive",
        "principle",
        "sum",
        "avicenna",
        "substance",
        "nature",
        "immediate",
        "efficient",
        "cause",
        "naturally",
        "characteristic",
        "action",
        "motion",
        "produce",
        "active",
        "nature",
        "well",
        "explaining",
        "body",
        "subject",
        "characteristic",
        "action",
        "motion",
        "passive",
        "nature"
    ]
}