{
    "main_text": "Psychology\n5. Psychology\n\nIn the Aristotelian tradition, Ibn Rushd postulates a special sort of\nsubstantial form—a soul—to account for living substances.\nEven in the mundane case of plants, the complexities of their\noperations require a special principle beyond what would be adequate\nfor nonliving things: nutrition, for instance, “is ascribed to\nthe soul because it is impossible for it to be ascribed to the powers\nof the elements” (LongAnima II.14). His theory of the\nsoul’s operations distinguishes, most basically, between the\nnutritive, sensory, and rational levels. Judging from his casually\nflexible terminology, he sees no real difference between treating\nthese as different souls within a single living thing or as parts of a\nsingle soul—parts characterized as a power (quwwa) or\nprinciple (mabdaʾ). Judging again from his varying\nformulations, he thinks there can be no definitive list of how many\nsuch powers of the soul there are. The question he does regard as\nmeaningful is whether a power is distinguished solely in terms of its\nfunction, or also in terms of its substrate—as he puts it,\nwhether it “differs from the other powers in subject as well as\nin intention (maʿnā), or only in intention”\n(LongAnima III.1; ParaAnima ¶276). Each of the\nfive external senses, for instance, has its own subject, a sensory\norgan, whereas some of the higher sensory operations have dedicated\norgans, in the brain, whereas other operations, such as recollection\n(Black 1996) and choice (Phillipson 2013), are mere functions produced\nby multiple powers working in conjunction. This question of\n“subject” is particularly vexed, as we will see, for the\npowers of intellect.\n\nThe “foundation” of cognition at all levels is its\npassivity (LongAnima II.54). This is particularly clear for\nthe five external senses, which have as their objects the material\nqualities of the external world. Color, for instance, the proper\nobject of sight, is an elemental mixture on the surface of bodies\n(ParaParv I.10 {15}), which acts on an illuminated medium and\nthen the organ of the eye, making its recipient at each stage be like\nthe color itself. The general (although not perfect) reliability of\nthe process—that a sense with respect to its proper sense object\n“does not err in regard to it for the most part”\n(LongAnima II.63)—is a product of the natural\nworld’s causal regularity. Indeed, the passivity of the five\nsenses is such that Ibn Rushd, when speaking most carefully, seems to\ntreat these organs as themselves simply the corporeal media through\nwhich sensible qualities are conveyed to the one true principle of\nsensation, the common sense (al-ḥiss al-mushtarak). He\nwrites, for instance, that “through the innermost of all the\ncurtains of the eye, the common sense can perceive the form”\n(ParaParv I.19 {30}); here is where we pass from a purely\ncorporeal stage to “the first of the spiritual stages”\n(ParaParv II.26 {42–3}). The lesson he draws from\nAristotle’s notoriously obscure treatment of common sense\n(De anima 425b12ff) is that the principle of sensation is\n“one in number and multiple in extremities and organs,”\nlike a point at the center of a circle (ParaAnima ¶260).\nOnly here is perception both self-aware and capable of assimilating\nthe objects of multiple sensory modalities. All subsequent cognition\nis dependent on the information collected at this stage. (See Black\n2019 for the theory’s strict empiricism.)\n\nTo account for the functional role of common sense, Ibn Rushd accepts\nits traditional—even antiquated—location at the heart,\nwith the concession that common sense has its origin there, but\nterminates in the brain (ParaParv II.36 {59}). This brings\nsensible forms to the higher sensory powers, of which he recognizes\nthree that are distinct within the human brain both in function and in\nsubject:\n\nimagination (al-mutakhayyila, al-khayāl);\nthe cogitative power (al-mufakkira, al-mumayyiza);\nmemory (al-ḥāfiẓa,\nal-dhākira).\n\n\nThese faculties, listed in order from the anterior to the posterior of\nthe brain’s supposed three chambers (ParaParv II.26\n{42}), account for much of human cognition. Most basically (for\ndetails see LongAnima II.63, III.6; Blaustein 1984;\nHansberger 2019), imagination allows us to form sensory images taken\nfrom sensation even when we are not presently sensing an object. The\ncogitative power refines these images so as to allow a distinct grasp\nof the “individual contents” (al-maʿānī\nal-shakhṣiya, known in the Latin tradition as\n“intentions”) that are confusedly contained within sensory\nexperience. Memory stores and recalls these images. Ibn Rushd\nexplicitly argues (Incoherence II.2 {546-7}) that the\ncogitative power can do all the work that Ibn Sīnā had split\nbetween a cogitative power and a further estimative power\n(al-quwwa al-wahmiyya). The overall process\nis compared to the gradual “abstracting and cleansing” of\nthe rind, eventually leaving just the fruit itself (ParaParv\nII.26 {43}), these fruits being the “substantial\ndifferences” between individuals (LongAnima II.65).\nNonhuman animals, because they lack a cogitative power entirely, are\nincapable of moving beyond superficial sensory appearances\n(LongAnima III.57).\n\nIn keeping with his broadly naturalistic orientation, Ibn Rushd allows\nthe brain a much larger share of the cognitive load than one finds in\nmost premodern philosophers. But the “fruit” these\ncorporeal powers yield is always a representation of a particular\nindividual. To think abstractly—to have universal\nconcepts—requires the powers of intellect, and here is where his\nnaturalism notoriously comes to an end. Ibn Rushd, though he deploys a\nbewildering variety of terms for different aspects of intellect,\nultimately endorses just two intellectual powers distinct both in\nfunction and subject:\n\nan agent intellect (ʿaql al-faʿʿāl),\nwhich illuminates imagined intentions, making them universal;\na material intellect (ʿaql al-hayūlāni),\nwhich receives those abstracted forms and thereby\nthinks—fittingly described as “material” not because\nit is corporeal but because it is a matter-like potentiality for\nreceiving forms in the intelligible domain.\n\n\nFollowing what was then the dominant Aristotelian view, he treats the\nagent intellect as a single, separate, eternal substance, and spends\nlittle time arguing for this doctrine, or even explaining how it\n“illuminates” imagined intentions (LongAnima\nIII.17–18; Davidson 1992, pp. 315–18). In contrast, he\ndiscusses the material intellect at length in various treatises, with\nhis views evolving dramatically over time (see Taylor 2009). Here we\nfocus only on his final considered view of the subject, as set out in\nthe Long Commentary, according to which the material\nintellect, like the agent intellect, is a single, separate, eternal\nsubstance (LongAnima III.5).\n\nIbn Rushd recognized the audacity of supposing that human beings share\nin a single intellect, writing that “this claim came to me after\nlong reflection and intense care, and I have not seen it in anyone\nelse before me” (CommAlex, p. 30). Indeed, he himself\nhad once called such a view “repulsive”\n(ParaAnima ¶282). Still, we can understand why he was\neventually drawn to it in light of his commitment to three\npropositions:\n\nHuman beings think abstractly;\nAbstract thought is impossible for corporeal beings;\nHuman beings are corporeal.\n\n\nAlthough the trio is jointly contradictory, each claim is individually\nplausible: (A) seems obvious; (B) follows from the familiar\nAristotelian argument that a power capable of understanding all bodies\nmust itself contain the nature of no body (LongAnima III.4);\n(C) is a consequence of Ibn Rushd’s eventual conclusion that the\nvarious strategies for situating an immaterial power within a human\nbeing—his own and that of earlier commentators—were all\nfailures. The genius of his ultimate position was to find a way for\nall three claims to be embraced. In one sense, human beings are\nindividual composites of matter and substantial form, and so wholly\ncorporeal. Although he consistently describes both the material and\nthe agent intellect as parts of the human soul (e.g.,\nLongAnima III.5 {406}), they are souls and actualities only\nequivocally: they are not the actuality of a body (LongAnima\nII.7, II.21, III.5 {396–7}). When human beings are conceived in\nthis narrow way, (C) is true and (A) is false.\n\nBut of course there must be some sense in which (A) is true. Ibn Rushd\ninsists that, even though we all share the material intellect, its\nthinking can count as my thinking. To explain this, he\nappeals to Aristotle’s doctrine that “the soul never\nthinks without an image” (De anima III.7, 431a17;\nWirmer 2008, 367–75). The material intellect, although separate,\nis dependent both for its function and for its very existence on\nreceiving imagined intentions from individual human beings\n(CommAlex p. 29); it is eternal only because the human\nspecies is eternal (LongAnima III.5 {407}). Each of us,\ntherefore, partially controls the operation of this separate material\nintellect. Its operation is to think, but inasmuch as we each\ncontrol our imagination, and the imagination is what triggers thought,\nit is appropriate to think of the thoughts we trigger as our\nthoughts, and to think of the two shared intellects, agent and\nmaterial, as each a part of our soul (LongAnima II.60,\nIII.18, III.36 {500}). With this, Ibn Rushd offers the first developed\nstatement of the\n extended-mind\n thesis: that a being’s cognitive system extends beyond the\nindividual organism. When human beings are conceived in this extended\nway, (A) is true and (C) is false.\n\nEven if this extended conception of a human being is allowed, that\nstill leaves a question about why these two separated intellects must\neach be singular, and so shared by all human beings. Ibn Rushd’s\nanswer depends in part on an argument against private concepts: that\nwithout concepts that are literally shared, teachers could not convey\nknowledge to students (LongAnima III.5 {411–12}; Ogden\nforthcoming). He also argues that an intellect individuated by a\ncorporeal subject would receive individualized forms\n(LongAnima III.5 {402}; Ogden 2016). Accordingly, he thinks\nthe domain of actually intelligible concepts, and of the intellects in\nwhich those objects exist, must be entirely separate from the material\nrealm, and cannot be individuated by matter. And, as we have seen in\nthe previous two sections, he is for independent reasons committed to\nthe existence of such a realm, among the celestial spheres.\nAccordingly, the human intellectual powers can be identified as the\nlowest members of this hierarchy (LongAnima III.19; Davidson\n1992, 223–31; Taylor 1998).\n\nFor further information see the entry on\n Arabic and Islamic psychology and philosophy of mind.\n",
    "section_title": "5. Psychology",
    "entry_title": "Ibn Rushd [Averroes]",
    "hierarchy_title": "Ibn Rushd [Averroes] || Psychology",
    "tokenized_text": [
        "psychology",
        "psychology",
        "aristotelian",
        "tradition",
        "ibn",
        "rushd",
        "postulate",
        "special",
        "sort",
        "substantial",
        "forma",
        "soulto",
        "account",
        "living",
        "substance",
        "even",
        "mundane",
        "case",
        "plant",
        "complexity",
        "operation",
        "require",
        "special",
        "principle",
        "beyond",
        "would",
        "adequate",
        "nonliving",
        "thing",
        "nutrition",
        "instance",
        "ascribed",
        "soul",
        "impossible",
        "ascribed",
        "power",
        "element",
        "longanima",
        "ii",
        "theory",
        "soul",
        "operation",
        "distinguishes",
        "basically",
        "nutritive",
        "sensory",
        "rational",
        "level",
        "judging",
        "casually",
        "flexible",
        "terminology",
        "see",
        "real",
        "difference",
        "treating",
        "different",
        "soul",
        "within",
        "single",
        "living",
        "thing",
        "part",
        "single",
        "soulparts",
        "characterized",
        "power",
        "quwwa",
        "principle",
        "mabdaʾ",
        "judging",
        "varying",
        "formulation",
        "think",
        "definitive",
        "list",
        "many",
        "power",
        "soul",
        "question",
        "regard",
        "meaningful",
        "whether",
        "power",
        "distinguished",
        "solely",
        "term",
        "function",
        "also",
        "term",
        "substrateas",
        "put",
        "whether",
        "differs",
        "power",
        "subject",
        "well",
        "intention",
        "maʿnā",
        "intention",
        "longanima",
        "iii",
        "paraanima",
        "five",
        "external",
        "sens",
        "instance",
        "subject",
        "sensory",
        "organ",
        "whereas",
        "higher",
        "sensory",
        "operation",
        "dedicated",
        "organ",
        "brain",
        "whereas",
        "operation",
        "recollection",
        "black",
        "choice",
        "phillipson",
        "mere",
        "function",
        "produced",
        "multiple",
        "power",
        "working",
        "conjunction",
        "question",
        "subject",
        "particularly",
        "vexed",
        "see",
        "power",
        "intellect",
        "foundation",
        "cognition",
        "level",
        "passivity",
        "longanima",
        "ii",
        "particularly",
        "clear",
        "five",
        "external",
        "sens",
        "object",
        "material",
        "quality",
        "external",
        "world",
        "color",
        "instance",
        "proper",
        "object",
        "sight",
        "elemental",
        "mixture",
        "surface",
        "body",
        "paraparv",
        "i",
        "act",
        "illuminated",
        "medium",
        "organ",
        "eye",
        "making",
        "recipient",
        "stage",
        "like",
        "color",
        "general",
        "although",
        "perfect",
        "reliability",
        "processthat",
        "sense",
        "respect",
        "proper",
        "sense",
        "object",
        "err",
        "regard",
        "part",
        "longanima",
        "ii",
        "is",
        "product",
        "natural",
        "world",
        "causal",
        "regularity",
        "indeed",
        "passivity",
        "five",
        "sens",
        "ibn",
        "rushd",
        "speaking",
        "carefully",
        "seems",
        "treat",
        "organ",
        "simply",
        "corporeal",
        "medium",
        "sensible",
        "quality",
        "conveyed",
        "one",
        "true",
        "principle",
        "sensation",
        "common",
        "sense",
        "alḥiss",
        "almushtarak",
        "writes",
        "instance",
        "innermost",
        "curtain",
        "eye",
        "common",
        "sense",
        "perceive",
        "form",
        "paraparv",
        "i",
        "pas",
        "purely",
        "corporeal",
        "stage",
        "first",
        "spiritual",
        "stage",
        "paraparv",
        "ii",
        "lesson",
        "draw",
        "aristotle",
        "notoriously",
        "obscure",
        "treatment",
        "common",
        "sense",
        "de",
        "anima",
        "bff",
        "principle",
        "sensation",
        "one",
        "number",
        "multiple",
        "extremity",
        "organ",
        "like",
        "point",
        "center",
        "circle",
        "paraanima",
        "perception",
        "selfaware",
        "capable",
        "assimilating",
        "object",
        "multiple",
        "sensory",
        "modality",
        "subsequent",
        "cognition",
        "dependent",
        "information",
        "collected",
        "stage",
        "see",
        "black",
        "theory",
        "strict",
        "empiricism",
        "account",
        "functional",
        "role",
        "common",
        "sense",
        "ibn",
        "rushd",
        "accepts",
        "traditionaleven",
        "antiquatedlocation",
        "heart",
        "concession",
        "common",
        "sense",
        "origin",
        "terminates",
        "brain",
        "paraparv",
        "ii",
        "brings",
        "sensible",
        "form",
        "higher",
        "sensory",
        "power",
        "recognizes",
        "three",
        "distinct",
        "within",
        "human",
        "brain",
        "function",
        "subject",
        "imagination",
        "almutakhayyila",
        "alkhayāl",
        "cogitative",
        "power",
        "almufakkira",
        "almumayyiza",
        "memory",
        "alḥāfiẓa",
        "aldhākira",
        "faculty",
        "listed",
        "order",
        "anterior",
        "posterior",
        "brain",
        "supposed",
        "three",
        "chamber",
        "paraparv",
        "ii",
        "account",
        "much",
        "human",
        "cognition",
        "basically",
        "detail",
        "see",
        "longanima",
        "ii",
        "iii",
        "blaustein",
        "hansberger",
        "imagination",
        "allows",
        "u",
        "form",
        "sensory",
        "image",
        "taken",
        "sensation",
        "even",
        "presently",
        "sensing",
        "object",
        "cogitative",
        "power",
        "refines",
        "image",
        "allow",
        "distinct",
        "grasp",
        "individual",
        "content",
        "almaʿānī",
        "alshakhṣiya",
        "known",
        "latin",
        "tradition",
        "intention",
        "confusedly",
        "contained",
        "within",
        "sensory",
        "experience",
        "memory",
        "store",
        "recall",
        "image",
        "ibn",
        "rushd",
        "explicitly",
        "argues",
        "incoherence",
        "ii",
        "cogitative",
        "power",
        "work",
        "ibn",
        "sīnā",
        "split",
        "cogitative",
        "power",
        "estimative",
        "power",
        "alquwwa",
        "alwahmiyya",
        "overall",
        "process",
        "compared",
        "gradual",
        "abstracting",
        "cleansing",
        "rind",
        "eventually",
        "leaving",
        "fruit",
        "paraparv",
        "ii",
        "fruit",
        "substantial",
        "difference",
        "individual",
        "longanima",
        "ii",
        "nonhuman",
        "animal",
        "lack",
        "cogitative",
        "power",
        "entirely",
        "incapable",
        "moving",
        "beyond",
        "superficial",
        "sensory",
        "appearance",
        "longanima",
        "iii",
        "keeping",
        "broadly",
        "naturalistic",
        "orientation",
        "ibn",
        "rushd",
        "allows",
        "brain",
        "much",
        "larger",
        "share",
        "cognitive",
        "load",
        "one",
        "find",
        "premodern",
        "philosopher",
        "fruit",
        "corporeal",
        "power",
        "yield",
        "always",
        "representation",
        "particular",
        "individual",
        "think",
        "abstractlyto",
        "universal",
        "conceptsrequires",
        "power",
        "intellect",
        "naturalism",
        "notoriously",
        "come",
        "end",
        "ibn",
        "rushd",
        "though",
        "deploys",
        "bewildering",
        "variety",
        "term",
        "different",
        "aspect",
        "intellect",
        "ultimately",
        "endorses",
        "two",
        "intellectual",
        "power",
        "distinct",
        "function",
        "subject",
        "agent",
        "intellect",
        "ʿaql",
        "alfaʿʿāl",
        "illuminates",
        "imagined",
        "intention",
        "making",
        "universal",
        "material",
        "intellect",
        "ʿaql",
        "alhayūlāni",
        "receives",
        "abstracted",
        "form",
        "thereby",
        "thinksfittingly",
        "described",
        "material",
        "corporeal",
        "matterlike",
        "potentiality",
        "receiving",
        "form",
        "intelligible",
        "domain",
        "following",
        "dominant",
        "aristotelian",
        "view",
        "treat",
        "agent",
        "intellect",
        "single",
        "separate",
        "eternal",
        "substance",
        "spends",
        "little",
        "time",
        "arguing",
        "doctrine",
        "even",
        "explaining",
        "illuminates",
        "imagined",
        "intention",
        "longanima",
        "iii",
        "davidson",
        "pp",
        "contrast",
        "discus",
        "material",
        "intellect",
        "length",
        "various",
        "treatise",
        "view",
        "evolving",
        "dramatically",
        "time",
        "see",
        "taylor",
        "focus",
        "final",
        "considered",
        "view",
        "subject",
        "set",
        "long",
        "commentary",
        "according",
        "material",
        "intellect",
        "like",
        "agent",
        "intellect",
        "single",
        "separate",
        "eternal",
        "substance",
        "longanima",
        "iii",
        "ibn",
        "rushd",
        "recognized",
        "audacity",
        "supposing",
        "human",
        "being",
        "share",
        "single",
        "intellect",
        "writing",
        "claim",
        "came",
        "long",
        "reflection",
        "intense",
        "care",
        "seen",
        "anyone",
        "else",
        "commalex",
        "p",
        "indeed",
        "called",
        "view",
        "repulsive",
        "paraanima",
        "still",
        "understand",
        "eventually",
        "drawn",
        "light",
        "commitment",
        "three",
        "proposition",
        "human",
        "being",
        "think",
        "abstractly",
        "abstract",
        "thought",
        "impossible",
        "corporeal",
        "being",
        "human",
        "being",
        "corporeal",
        "although",
        "trio",
        "jointly",
        "contradictory",
        "claim",
        "individually",
        "plausible",
        "seems",
        "obvious",
        "b",
        "follows",
        "familiar",
        "aristotelian",
        "argument",
        "power",
        "capable",
        "understanding",
        "body",
        "must",
        "contain",
        "nature",
        "body",
        "longanima",
        "iii",
        "c",
        "consequence",
        "ibn",
        "rushd",
        "eventual",
        "conclusion",
        "various",
        "strategy",
        "situating",
        "immaterial",
        "power",
        "within",
        "human",
        "beinghis",
        "earlier",
        "commentatorswere",
        "failure",
        "genius",
        "ultimate",
        "position",
        "find",
        "way",
        "three",
        "claim",
        "embraced",
        "one",
        "sense",
        "human",
        "being",
        "individual",
        "composite",
        "matter",
        "substantial",
        "form",
        "wholly",
        "corporeal",
        "although",
        "consistently",
        "describes",
        "material",
        "agent",
        "intellect",
        "part",
        "human",
        "soul",
        "eg",
        "longanima",
        "iii",
        "soul",
        "actuality",
        "equivocally",
        "actuality",
        "body",
        "longanima",
        "ii",
        "ii",
        "iii",
        "human",
        "being",
        "conceived",
        "narrow",
        "way",
        "c",
        "true",
        "false",
        "course",
        "must",
        "sense",
        "true",
        "ibn",
        "rushd",
        "insists",
        "even",
        "though",
        "share",
        "material",
        "intellect",
        "thinking",
        "count",
        "thinking",
        "explain",
        "appeal",
        "aristotle",
        "doctrine",
        "soul",
        "never",
        "think",
        "without",
        "image",
        "de",
        "anima",
        "iii",
        "a",
        "wirmer",
        "material",
        "intellect",
        "although",
        "separate",
        "dependent",
        "function",
        "existence",
        "receiving",
        "imagined",
        "intention",
        "individual",
        "human",
        "being",
        "commalex",
        "p",
        "eternal",
        "human",
        "specie",
        "eternal",
        "longanima",
        "iii",
        "u",
        "therefore",
        "partially",
        "control",
        "operation",
        "separate",
        "material",
        "intellect",
        "operation",
        "think",
        "inasmuch",
        "control",
        "imagination",
        "imagination",
        "trigger",
        "thought",
        "appropriate",
        "think",
        "thought",
        "trigger",
        "thought",
        "think",
        "two",
        "shared",
        "intellect",
        "agent",
        "material",
        "part",
        "soul",
        "longanima",
        "ii",
        "iii",
        "iii",
        "ibn",
        "rushd",
        "offer",
        "first",
        "developed",
        "statement",
        "extendedmind",
        "thesis",
        "cognitive",
        "system",
        "extends",
        "beyond",
        "individual",
        "organism",
        "human",
        "being",
        "conceived",
        "extended",
        "way",
        "true",
        "c",
        "false",
        "even",
        "extended",
        "conception",
        "human",
        "allowed",
        "still",
        "leaf",
        "question",
        "two",
        "separated",
        "intellect",
        "must",
        "singular",
        "shared",
        "human",
        "being",
        "ibn",
        "rushd",
        "answer",
        "depends",
        "part",
        "argument",
        "private",
        "concept",
        "without",
        "concept",
        "literally",
        "shared",
        "teacher",
        "could",
        "convey",
        "knowledge",
        "student",
        "longanima",
        "iii",
        "ogden",
        "forthcoming",
        "also",
        "argues",
        "intellect",
        "individuated",
        "corporeal",
        "subject",
        "would",
        "receive",
        "individualized",
        "form",
        "longanima",
        "iii",
        "ogden",
        "accordingly",
        "think",
        "domain",
        "actually",
        "intelligible",
        "concept",
        "intellect",
        "object",
        "exist",
        "must",
        "entirely",
        "separate",
        "material",
        "realm",
        "individuated",
        "matter",
        "seen",
        "previous",
        "two",
        "section",
        "independent",
        "reason",
        "committed",
        "existence",
        "realm",
        "among",
        "celestial",
        "sphere",
        "accordingly",
        "human",
        "intellectual",
        "power",
        "identified",
        "lowest",
        "member",
        "hierarchy",
        "longanima",
        "iii",
        "davidson",
        "taylor",
        "information",
        "see",
        "entry",
        "arabic",
        "islamic",
        "psychology",
        "philosophy",
        "mind"
    ]
}