{
    "main_text": "Characterizations of his Thought\n5. Characterizations of his Thought\n\n\nIbn Ezra’s thought has been located (or fitted) into three\ntraditions. Many medieval philosophers, and opponents of philosophy as\nwell, sensed a commonality of purpose as well as the sharing of basic\ndoctrines between Ibn Ezra and Maimonides. Joint allegiance to\nMaimonides and Ibn Ezra was particularly strong in the fourteenth\ncentury. The principal vehicle for this trend of thought was the\nsupercommentaries to Ibn Ezra, which number a few dozen. These authors\nwere particularly impressed by the willingness of both sages to appeal\nto sources beyond the traditional rabbinic corpus in order to\nunderstand the biblical narratives and commandments. Rationality (in\nthe sense of seeking rationales for Judaism, its beliefs and precepts)\nbonded Ibn Ezra and Maimonides, blurring the differences between the\ntwo, most notably on the important question of the legitimacy of\nastrology.\n\n\nThe pseudepigraphic testament of Maimonides, in which he expresses his\nadmiration in the strongest terms for Ibn Ezra’s Torah commentary and\nthe “great and deep secrets” that he revealed there, is\nmost likely a product of this same trend. However, as Isadore Twersky\nhas pointed out, the fact that the “testament” is said to\nhave been written by Maimonides at the end of his life, after he had\nalready written his own works, indicates that its author wants us only\nto take note of the literary and notional parallels between the two\nthinkers; the forger is not prepared to make any stronger claims of\ninfluence (Twersky 1993, 39–40).\n\n\nJust how much, if anything, Maimonides owes to Ibn Ezra has been\ndebated for over a century, without any clear resolution. The survey\nof Twersky (1993) covers the ground well. The strongest claims extend\nIbn Ezra’s influence even to the realm of legal theory, asserting that\nthe fourteen principles enunciated by Maimonides at the beginning of\nhis Book of Commandments were inspired and to a degree\nmodeled upon the principles set down by Ibn Ezra in Yesod\nMora.  Since, by most modern accounts, Maimonides is to be\nclassified as an Aristotelian (or perhaps neo-Aristotelian), it should\nstand to reason that, were he really a follower of Ibn Ezra, the\nlatter would also be an Aristotelian. Histories of Jewish philosophy,\nas we shall see, unanimously locate Ibn Ezra in the Neoplatonist\ncamp. However, Yosef Cohen has recently argued that Ibn Ezra indeed\nfits more comfortably into the Aristotelian tradition (Cohen\n1996).\n\n\nGenerations of scholars have found the “neo-platonist”\nlabel to be most appropriate. Julius Guttmann, who may well be\nresponsible for defining medieval Jewish neoplatonism as a historical\ncategory, declared Ibn Ezra to be “the last in the line of\nJewish Neoplatonists”. Guttmann was fully aware, like all\nhistorians of Jewish thought, that Ibn Ezra was not a systematic\nthinker, and he was more precise than any later historian in\npinpointing the agreements and disagreements between Ibn Ezra and what\nmay be called standard neoplatonic teachings. Nonetheless, he averred\nthat “Ibn Ezra was moved more profoundly than most of his Jewish\npredecessors by the mysterious depths of Neoplatonism, approaching its\nmetaphysical content more closely than any of the others except\nGabirol” (Guttman 1973, 134).\n\n\nIsaac Husik marks Ibn Ezra’s role in the transmission of Andalusian\nwisdom, which consists of “grammar… mathematics and\nastronomy…the philosophy of Neo-Platonism, and the scientific\nand rationalistic spirit generally” (Husik 1969, 187). Like\nGuttmann, Husik calls attention to the affinity between Ibn Ezra and\nIbn Gabirol. In 1973, Hermann Greive published a book-length study of\nIbn Ezra under the title, Studien zum Jüdischen\nNeuplatonismus. Greive paid particular attention to Ibn Ezra’s\npsychology; this is indeed the branch of philosophy to which Ibn Ezra\nwas most strongly attracted, and the topic exploited most intensively\nby specialists in Ibn Ezra (Tanenbaum 1990;\nLevin 1992). However, Greive is well-aware that the presence of\nneoplatonic teachings in Ibn Ezra’s writings does not mean that Ibn\nEzra’s allegiance was limited to that school exclusively.\n\n\nThe trend is continued in the latest history of Jewish philosophy,\nthat by Colette Sirat, who discusses Abraham Ibn Ezra at the end of\nthe chapter on “The Neoplatonists”. However, cognizant of\nthe rich Hebrew literature of the later medieval period (much of which\nwas as yet unstudied and thus inaccessible to Guttmann), Sirat does\nnot make Ibn Ezra into the last neoplatonist. Instead she observes,\n“The neoplatonic influence clearly marked in the Jewish\nphilosophers of the thirteenth and fourteenth centuries was\nessentially expressed in terms and ideas drawn from Ibn Ezra”\n(Sirat 1985, 104).\n\n\nAaron Hughes acknowledges the problematic nature of the label\n“neoplatonic”; in a note he registers his preference to the view that\n“the Neoplatonic ‘system’ to which he subscribed\npermitted one to have many divided, and often competing,\nloyalties” (Hughes, 2002, n. 13). Nonetheless, Hughes too cannot\nresist the label. \n\n\nOne term in particular found in some key passages, kol or\n“all”, has attracted a good deal of attention of late.\nBuilding on the observations of several scholars, Elliot Wolfson\n(1990; see esp. p. 80, nn. 14–16, for references to earlier work on\nthe topic) examines closely the two different senses in which Ibn Ezra\nuses the term. At times it refers to the totality of created entities,\nbut in other passages it refers to an entity that comprises all things\nwithin itself in ideal form—not God, but the demiurge (yoser\nbereishit).  This dual meaning can be traced back to Proclus, and\nits usage highlights the neoplatonic trend in Ibn Ezra’s\nthought. Howard Kreisel (1994) has rejected this\ninterpretation. Kreisel criticizes the emphasis upon\n“neoplatonism” here; he encloses the term in quotation\nmarks, as the present writer tends to do, and for much the same\nreasons. Medieval Jewish neoplatonism is an ill-defined term, and all\nattempts to explicate Ibn Ezra’s “neoplatonism” are\nproblematic, forcing scholars to note numerous points of agreement\nbetween Ibn Ezra and the Aristotelians—which, in turn, cannot be\ndivorced from the neoplatonic interpretations informing Islamic\nAristotelianism in general. Kreisel argues that, when read closely in\ncontext, the texts in question display one meaning only for\nkol—God, the Creator God, and not the demiurge.\n\n\nHence there seems to be little profit in belaboring Ibn Ezra’s\nsupposed neoplatonism. On the other hand, Ibn Ezra’s affinities to Ibn\nGabirol (Avicebron to the Latins, and a neoplatonist for sure) are\nrelevant. Some of Ibn Gabirol’s allegorical readings of the Bible are\ncited by Ibn Ezra—indeed, he is our only source for them. Ibn\nGabirol’s Fons Vitae certainly belongs to the neoplatonic\ntradition. Significantly, however, that work (which Ibn Ezra would\npresumably have seen in the original Arabic) is not mentioned by Ibn\nEzra at all. By all indications, he would not have had the patience or\ndisposition for that text’s scholasticism.\n\n\nThe role of Ibn Gabirol is indeed pivotal. Ibn Gabirol was accused by\nhis contemporaries, and credited by modern scholars, with introducing\n“Greek” notions into his poetry. All the great Andalusian\npoets were to some degree—Ibn Ezra, quite\nsubstantially—students and imitators of Ibn Gabirol. The link\nbetween Ibn Ezra and Ibn Gabirol is significant, but the common thread\nrunning between the two, and other Andalusian Jewish poets as well who\nplunged into “the mysterious depths of Neoplatonism”, is\nto be found in their poetry, rather than in prose expositions of\nphilosophy. The soul’s longing for release from this world and\nliberation, or obliteration, in the divine, are themes which found\npowerful expression in their liturgies, and which bond them to at\nleast one important facet of neoplatonism and to each other more truly\nthan any specific doctrines that they may hold concerning the origin\nof matter or the nature of prophetic inspiration.\n\n\nHistorians of Jewish philosophy label Ibn Ezra’s thought\n“neoplatonic” also on the strength of his deep involvement\nin astrology and arithmology, as well as his deep longing for release\nfrom this world. However, the very term “neoplatonic” is\napplied imprecisely in the history of medieval Jewish philosophy, and\nit usually indicates little more than a gross bifurcation between\n“Aristotelians” and all of the rest who, as a rule, are\nlabeled neoplatonic. It is therefore appropriate to take note of Ibn\nEzra’s divergence from some widely accepted neoplatonic\nteachings. Ibn Ezra denies the existence of demons. He says nothing of\nthe soul’s descent through the celestial orbs, though this\nteaching was known to his contemporary pseudo-Bahya, and would perhaps\nnaturally have appealed to an astrologer. Finally, he says nothing of\nmusical harmonies—despite the clear Pythagoreanism of\nhis Sefer ha-Ehad (Langermann 1993, 66).   In sum, then,\nit seems most prudent to observe that Ibn Ezra makes use of mostly\nstock notions, such as the three “worlds”, that inform\nwhat has come to be known as Islamic and Jewish neoplatonism. Wolfson\nhas made the strongest case for “precise terminological\nlinks” between Ibn Ezra and Plotinus, but even he cannot trace a\npath of transmission (Wolfson, 1990, pp. 89–90).\n\n\nThe least well-known characterization, but one which has a lot to\nargue in its favor, is given by Abraham, son of the illustrious Moses\nMaimonides. In his refreshing perspective Ibn Ezra finds his place\nwithin a list of rabbis who taught the fundamental doctrines that God\nis not a body; that God does not manifest any of the properties of\nbodies; and that all problematic biblical verses must be\n(re)interpreted in order to conform to these doctrines. It is\ninteresting to note the other names on Abraham Maimonides’ list:\nSa‘adiah Gaon, Samuel ben Hofni, Isaac Alfasi, Joseph Ibn\n Migash.[2]\n Only the first of these is regarded today as a philosopher, and then\nonly in the wider sense of the word. It seems that Abraham, like his\nfather, looked upon the whole lot—Ibn Ezra included—as\nmutakallimūn, that is, kalamist religious thinkers who taught an\nacceptable (though not necessarily correct) theology, which, however,\nlacked philosophical rigor, and which contained some grave errors.\n\n\nIndeed, Sa‘adiah’s Beliefs and Opinions is the only\nextant, substantive work on Jewish philosophy that Ibn Ezra mentions\nby name. The citation occurs at the very end of the first chapter of\nYesod Mora; Ibn Ezra observes that some portions of\nSa‘adiah’s book are correct, but others are baseless. However,\nhe never tells us exactly which portions are acceptable and which not,\nnor does he engage Sa‘adiah in a pointed debate on any issue.\nThroughout his opus, but most notably in his biblical commentaries,\nIbn Ezra mentions Sa‘adiah dozens of times; though he rarely\nmentions the specific source, he seems to be referring most often to\nSa‘adiah’s own biblical commentaries. On the basis of this\nstatistic, at least, Sa‘adiah is, as noted above, the most\nimportant “influence” upon Ibn Ezra.\n",
    "section_title": "5. Characterizations of his Thought",
    "entry_title": "Abraham Ibn Ezra",
    "hierarchy_title": "Abraham Ibn Ezra || Characterizations of his Thought",
    "tokenized_text": [
        "characterization",
        "thought",
        "characterization",
        "thought",
        "ibn",
        "ezra",
        "thought",
        "located",
        "fitted",
        "three",
        "tradition",
        "many",
        "medieval",
        "philosopher",
        "opponent",
        "philosophy",
        "well",
        "sensed",
        "commonality",
        "purpose",
        "well",
        "sharing",
        "basic",
        "doctrine",
        "ibn",
        "ezra",
        "maimonides",
        "joint",
        "allegiance",
        "maimonides",
        "ibn",
        "ezra",
        "particularly",
        "strong",
        "fourteenth",
        "century",
        "principal",
        "vehicle",
        "trend",
        "thought",
        "supercommentaries",
        "ibn",
        "ezra",
        "number",
        "dozen",
        "author",
        "particularly",
        "impressed",
        "willingness",
        "sage",
        "appeal",
        "source",
        "beyond",
        "traditional",
        "rabbinic",
        "corpus",
        "order",
        "understand",
        "biblical",
        "narrative",
        "commandment",
        "rationality",
        "sense",
        "seeking",
        "rationale",
        "judaism",
        "belief",
        "precept",
        "bonded",
        "ibn",
        "ezra",
        "maimonides",
        "blurring",
        "difference",
        "two",
        "notably",
        "important",
        "question",
        "legitimacy",
        "astrology",
        "pseudepigraphic",
        "testament",
        "maimonides",
        "express",
        "admiration",
        "strongest",
        "term",
        "ibn",
        "ezra",
        "torah",
        "commentary",
        "great",
        "deep",
        "secret",
        "revealed",
        "likely",
        "product",
        "trend",
        "however",
        "isadore",
        "twersky",
        "pointed",
        "fact",
        "testament",
        "said",
        "written",
        "maimonides",
        "end",
        "life",
        "already",
        "written",
        "work",
        "indicates",
        "author",
        "want",
        "u",
        "take",
        "note",
        "literary",
        "notional",
        "parallel",
        "two",
        "thinker",
        "forger",
        "prepared",
        "make",
        "stronger",
        "claim",
        "influence",
        "twersky",
        "much",
        "anything",
        "maimonides",
        "owes",
        "ibn",
        "ezra",
        "debated",
        "century",
        "without",
        "clear",
        "resolution",
        "survey",
        "twersky",
        "cover",
        "ground",
        "well",
        "strongest",
        "claim",
        "extend",
        "ibn",
        "ezra",
        "influence",
        "even",
        "realm",
        "legal",
        "theory",
        "asserting",
        "fourteen",
        "principle",
        "enunciated",
        "maimonides",
        "beginning",
        "book",
        "commandment",
        "inspired",
        "degree",
        "modeled",
        "upon",
        "principle",
        "set",
        "ibn",
        "ezra",
        "yesod",
        "mora",
        "since",
        "modern",
        "account",
        "maimonides",
        "classified",
        "aristotelian",
        "perhaps",
        "neoaristotelian",
        "stand",
        "reason",
        "really",
        "follower",
        "ibn",
        "ezra",
        "latter",
        "would",
        "also",
        "aristotelian",
        "history",
        "jewish",
        "philosophy",
        "shall",
        "see",
        "unanimously",
        "locate",
        "ibn",
        "ezra",
        "neoplatonist",
        "camp",
        "however",
        "yosef",
        "cohen",
        "recently",
        "argued",
        "ibn",
        "ezra",
        "indeed",
        "fit",
        "comfortably",
        "aristotelian",
        "tradition",
        "cohen",
        "generation",
        "scholar",
        "found",
        "neoplatonist",
        "label",
        "appropriate",
        "julius",
        "guttmann",
        "may",
        "well",
        "responsible",
        "defining",
        "medieval",
        "jewish",
        "neoplatonism",
        "historical",
        "category",
        "declared",
        "ibn",
        "ezra",
        "last",
        "line",
        "jewish",
        "neoplatonist",
        "guttmann",
        "fully",
        "aware",
        "like",
        "historian",
        "jewish",
        "thought",
        "ibn",
        "ezra",
        "systematic",
        "thinker",
        "precise",
        "later",
        "historian",
        "pinpointing",
        "agreement",
        "disagreement",
        "ibn",
        "ezra",
        "may",
        "called",
        "standard",
        "neoplatonic",
        "teaching",
        "nonetheless",
        "averred",
        "ibn",
        "ezra",
        "moved",
        "profoundly",
        "jewish",
        "predecessor",
        "mysterious",
        "depth",
        "neoplatonism",
        "approaching",
        "metaphysical",
        "content",
        "closely",
        "others",
        "except",
        "gabirol",
        "guttman",
        "isaac",
        "husik",
        "mark",
        "ibn",
        "ezra",
        "role",
        "transmission",
        "andalusian",
        "wisdom",
        "consists",
        "grammar",
        "mathematics",
        "astronomythe",
        "philosophy",
        "neoplatonism",
        "scientific",
        "rationalistic",
        "spirit",
        "generally",
        "husik",
        "like",
        "guttmann",
        "husik",
        "call",
        "attention",
        "affinity",
        "ibn",
        "ezra",
        "ibn",
        "gabirol",
        "hermann",
        "greive",
        "published",
        "booklength",
        "study",
        "ibn",
        "ezra",
        "title",
        "studien",
        "zum",
        "jüdischen",
        "neuplatonismus",
        "greive",
        "paid",
        "particular",
        "attention",
        "ibn",
        "ezra",
        "psychology",
        "indeed",
        "branch",
        "philosophy",
        "ibn",
        "ezra",
        "strongly",
        "attracted",
        "topic",
        "exploited",
        "intensively",
        "specialist",
        "ibn",
        "ezra",
        "tanenbaum",
        "levin",
        "however",
        "greive",
        "wellaware",
        "presence",
        "neoplatonic",
        "teaching",
        "ibn",
        "ezra",
        "writing",
        "mean",
        "ibn",
        "ezra",
        "allegiance",
        "limited",
        "school",
        "exclusively",
        "trend",
        "continued",
        "latest",
        "history",
        "jewish",
        "philosophy",
        "colette",
        "sirat",
        "discus",
        "abraham",
        "ibn",
        "ezra",
        "end",
        "chapter",
        "neoplatonist",
        "however",
        "cognizant",
        "rich",
        "hebrew",
        "literature",
        "later",
        "medieval",
        "period",
        "much",
        "yet",
        "unstudied",
        "thus",
        "inaccessible",
        "guttmann",
        "sirat",
        "make",
        "ibn",
        "ezra",
        "last",
        "neoplatonist",
        "instead",
        "observes",
        "neoplatonic",
        "influence",
        "clearly",
        "marked",
        "jewish",
        "philosopher",
        "thirteenth",
        "fourteenth",
        "century",
        "essentially",
        "expressed",
        "term",
        "idea",
        "drawn",
        "ibn",
        "ezra",
        "sirat",
        "aaron",
        "hughes",
        "acknowledges",
        "problematic",
        "nature",
        "label",
        "neoplatonic",
        "note",
        "register",
        "preference",
        "view",
        "neoplatonic",
        "system",
        "subscribed",
        "permitted",
        "one",
        "many",
        "divided",
        "often",
        "competing",
        "loyalty",
        "hughes",
        "n",
        "nonetheless",
        "hughes",
        "resist",
        "label",
        "one",
        "term",
        "particular",
        "found",
        "key",
        "passage",
        "kol",
        "attracted",
        "good",
        "deal",
        "attention",
        "late",
        "building",
        "observation",
        "several",
        "scholar",
        "elliot",
        "wolfson",
        "see",
        "esp",
        "p",
        "nn",
        "reference",
        "earlier",
        "work",
        "topic",
        "examines",
        "closely",
        "two",
        "different",
        "sens",
        "ibn",
        "ezra",
        "us",
        "term",
        "time",
        "refers",
        "totality",
        "created",
        "entity",
        "passage",
        "refers",
        "entity",
        "comprises",
        "thing",
        "within",
        "ideal",
        "formnot",
        "god",
        "demiurge",
        "yoser",
        "bereishit",
        "dual",
        "meaning",
        "traced",
        "back",
        "proclus",
        "usage",
        "highlight",
        "neoplatonic",
        "trend",
        "ibn",
        "ezra",
        "thought",
        "howard",
        "kreisel",
        "rejected",
        "interpretation",
        "kreisel",
        "criticizes",
        "emphasis",
        "upon",
        "neoplatonism",
        "encloses",
        "term",
        "quotation",
        "mark",
        "present",
        "writer",
        "tends",
        "much",
        "reason",
        "medieval",
        "jewish",
        "neoplatonism",
        "illdefined",
        "term",
        "attempt",
        "explicate",
        "ibn",
        "ezra",
        "neoplatonism",
        "problematic",
        "forcing",
        "scholar",
        "note",
        "numerous",
        "point",
        "agreement",
        "ibn",
        "ezra",
        "aristotelianswhich",
        "turn",
        "divorced",
        "neoplatonic",
        "interpretation",
        "informing",
        "islamic",
        "aristotelianism",
        "general",
        "kreisel",
        "argues",
        "read",
        "closely",
        "context",
        "text",
        "question",
        "display",
        "one",
        "meaning",
        "kolgod",
        "creator",
        "god",
        "demiurge",
        "hence",
        "seems",
        "little",
        "profit",
        "belaboring",
        "ibn",
        "ezra",
        "supposed",
        "neoplatonism",
        "hand",
        "ibn",
        "ezra",
        "affinity",
        "ibn",
        "gabirol",
        "avicebron",
        "latin",
        "neoplatonist",
        "sure",
        "relevant",
        "ibn",
        "gabirol",
        "allegorical",
        "reading",
        "bible",
        "cited",
        "ibn",
        "ezraindeed",
        "source",
        "ibn",
        "gabirol",
        "fons",
        "vitae",
        "certainly",
        "belongs",
        "neoplatonic",
        "tradition",
        "significantly",
        "however",
        "work",
        "ibn",
        "ezra",
        "would",
        "presumably",
        "seen",
        "original",
        "arabic",
        "mentioned",
        "ibn",
        "ezra",
        "indication",
        "would",
        "patience",
        "disposition",
        "text",
        "scholasticism",
        "role",
        "ibn",
        "gabirol",
        "indeed",
        "pivotal",
        "ibn",
        "gabirol",
        "accused",
        "contemporary",
        "credited",
        "modern",
        "scholar",
        "introducing",
        "greek",
        "notion",
        "poetry",
        "great",
        "andalusian",
        "poet",
        "degreeibn",
        "ezra",
        "quite",
        "substantiallystudents",
        "imitator",
        "ibn",
        "gabirol",
        "link",
        "ibn",
        "ezra",
        "ibn",
        "gabirol",
        "significant",
        "common",
        "thread",
        "running",
        "two",
        "andalusian",
        "jewish",
        "poet",
        "well",
        "plunged",
        "mysterious",
        "depth",
        "neoplatonism",
        "found",
        "poetry",
        "rather",
        "prose",
        "exposition",
        "philosophy",
        "soul",
        "longing",
        "release",
        "world",
        "liberation",
        "obliteration",
        "divine",
        "theme",
        "found",
        "powerful",
        "expression",
        "liturgy",
        "bond",
        "least",
        "one",
        "important",
        "facet",
        "neoplatonism",
        "truly",
        "specific",
        "doctrine",
        "may",
        "hold",
        "concerning",
        "origin",
        "matter",
        "nature",
        "prophetic",
        "inspiration",
        "historian",
        "jewish",
        "philosophy",
        "label",
        "ibn",
        "ezra",
        "thought",
        "neoplatonic",
        "also",
        "strength",
        "deep",
        "involvement",
        "astrology",
        "arithmology",
        "well",
        "deep",
        "longing",
        "release",
        "world",
        "however",
        "term",
        "neoplatonic",
        "applied",
        "imprecisely",
        "history",
        "medieval",
        "jewish",
        "philosophy",
        "usually",
        "indicates",
        "little",
        "gross",
        "bifurcation",
        "aristotelian",
        "rest",
        "rule",
        "labeled",
        "neoplatonic",
        "therefore",
        "appropriate",
        "take",
        "note",
        "ibn",
        "ezra",
        "divergence",
        "widely",
        "accepted",
        "neoplatonic",
        "teaching",
        "ibn",
        "ezra",
        "denies",
        "existence",
        "demon",
        "say",
        "nothing",
        "soul",
        "descent",
        "celestial",
        "orb",
        "though",
        "teaching",
        "known",
        "contemporary",
        "pseudobahya",
        "would",
        "perhaps",
        "naturally",
        "appealed",
        "astrologer",
        "finally",
        "say",
        "nothing",
        "musical",
        "harmoniesdespite",
        "clear",
        "pythagoreanism",
        "sefer",
        "haehad",
        "langermann",
        "sum",
        "seems",
        "prudent",
        "observe",
        "ibn",
        "ezra",
        "make",
        "use",
        "mostly",
        "stock",
        "notion",
        "three",
        "world",
        "inform",
        "come",
        "known",
        "islamic",
        "jewish",
        "neoplatonism",
        "wolfson",
        "made",
        "strongest",
        "case",
        "precise",
        "terminological",
        "link",
        "ibn",
        "ezra",
        "plotinus",
        "even",
        "trace",
        "path",
        "transmission",
        "wolfson",
        "pp",
        "least",
        "wellknown",
        "characterization",
        "one",
        "lot",
        "argue",
        "favor",
        "given",
        "abraham",
        "son",
        "illustrious",
        "moses",
        "maimonides",
        "refreshing",
        "perspective",
        "ibn",
        "ezra",
        "find",
        "place",
        "within",
        "list",
        "rabbi",
        "taught",
        "fundamental",
        "doctrine",
        "god",
        "body",
        "god",
        "manifest",
        "property",
        "body",
        "problematic",
        "biblical",
        "verse",
        "must",
        "interpreted",
        "order",
        "conform",
        "doctrine",
        "interesting",
        "note",
        "name",
        "abraham",
        "maimonides",
        "list",
        "sa",
        "adiah",
        "gaon",
        "samuel",
        "ben",
        "hofni",
        "isaac",
        "alfasi",
        "joseph",
        "ibn",
        "migash",
        "first",
        "regarded",
        "today",
        "philosopher",
        "wider",
        "sense",
        "word",
        "seems",
        "abraham",
        "like",
        "father",
        "looked",
        "upon",
        "whole",
        "lotibn",
        "ezra",
        "includedas",
        "mutakallimūn",
        "kalamist",
        "religious",
        "thinker",
        "taught",
        "acceptable",
        "though",
        "necessarily",
        "correct",
        "theology",
        "however",
        "lacked",
        "philosophical",
        "rigor",
        "contained",
        "grave",
        "error",
        "indeed",
        "sa",
        "adiah",
        "belief",
        "opinion",
        "extant",
        "substantive",
        "work",
        "jewish",
        "philosophy",
        "ibn",
        "ezra",
        "mention",
        "name",
        "citation",
        "occurs",
        "end",
        "first",
        "chapter",
        "yesod",
        "mora",
        "ibn",
        "ezra",
        "observes",
        "portion",
        "sa",
        "adiah",
        "book",
        "correct",
        "others",
        "baseless",
        "however",
        "never",
        "tell",
        "u",
        "exactly",
        "portion",
        "acceptable",
        "engage",
        "sa",
        "adiah",
        "pointed",
        "debate",
        "issue",
        "throughout",
        "opus",
        "notably",
        "biblical",
        "commentary",
        "ibn",
        "ezra",
        "mention",
        "sa",
        "adiah",
        "dozen",
        "time",
        "though",
        "rarely",
        "mention",
        "specific",
        "source",
        "seems",
        "referring",
        "often",
        "sa",
        "adiah",
        "biblical",
        "commentary",
        "basis",
        "statistic",
        "least",
        "sa",
        "adiah",
        "noted",
        "important",
        "influence",
        "upon",
        "ibn",
        "ezra"
    ]
}