{
    "main_text": "Schopenhauer\n6. Schopenhauer\n\nArthur Schopenhauer (1788–1860) heaped a great deal of invective\non Fichte, Schelling, and Hegel. For that reason, Schopenhauer is not\nalways included among the German idealists. And indeed, nothing could\nbe further from Hegel’s version of absolute idealism than\nSchopenhauer’s theory on which behind the realm of appearances\nconstructed in accordance with our own conceptions of space, time, and\ncausality—his form of the empirical realism side of\ntranscendental idealism—there is a unitary reality that is\nutterly irrational or at least arational—his form of\nKant’s ontological realism, but flipped from practical to\ntheoretical and from rational to arational. Nevertheless, since\nSchopenhauer works within a Kantian framework, and identifies\nunderlying reality with pure activity, although of an arational rather\nthan rational kind, it is useful to think of him within the framework\nof idealism.\n\nSchopenhauer puts forward his theory in his main work The World as\nWill and Representation (Die Welt als Wille und\nVorstellung), first published in December, 1818 (with an 1819\ndate on its title page), and then in a much-expanded second edition in\n1844 and yet another expanded edition in 1857. This book had been\npreceded by a doctoral dissertation On the Fourfold Root of the\nPrinciple of Sufficient Reason (1813), which Schopenhauer\nsubsequently regarded as the introduction to his magnum opus. The\nearlier work includes Schopenhauer’s main modifications to the\nstructure of Kant’s epistemology, while the later work accepts\nKant’s idealist interpretation of this epistemology (Book I) and\nthen replaces Kant’s version of the doctrine of things in\nthemselves with Schopenhauer’s own version of the unitary\nnon-rational will underlying all appearance (Book II).\n\nSchopenhauer’s acceptance of the empirical side of Kant’s\ntranscendental idealism combined with his non-rational version of\nKant’s ontological realism is, however, on display\nthroughout The World as Will and Representation. Schopenhauer\naccepts without reservation Kant’s argument that space, time,\nand causality are forms of our own representation that we know a\npriori and impose upon the appearances of objects. He does\nprecede this acceptance with a Fichtean argument that “The world\nis my representation”, where the sheer “mineness” of\nrepresentation is supposed to be a “form…more universal\nthan any other form”, including space, time, and causality\n(WWR, §1, p. 23). Schopenhauer holds that\n\n\nno truth is more certain, no truth is more independent of all others\nand no truth is less in need of proof than this one: that everything\nthere is for cognition (i.e., the whole world) is only an object in\nrelation to a subject, an intuition of a beholder. (WWR,\n§1, pp. 23–4)\n\n\nThis simple and perhaps inescapable thought may be regarded as the\nmost fundamental epistemological motivation for any form of idealism.\nOn the basis of this proposition, Schopenhauer then tries to\ndistinguish his position from what he takes to be the skepticism of\nHume, that there is a real question about whether there is either a\nsubject or an object in addition to representations, and from the\ndogmatism of Fichte, that both of these can be proved; his own view as\ninitially stated is rather that\n\n\nthe object as such always presupposes the subject as its necessary\ncorrelate: so the subject always remains outside the jurisdiction of\nthe principle of sufficient reason. (WWR, §5, p. 35)\n\n\nBut, speaking of dogmatism, he simply accepts from Kant that\n\n\nspace and time can not only be conceived abstractly, on their own and\nindependently of their content, but they can also be intuited\nimmediately,\n\n\nand that\n\n\nThis intuition is not some phantasm derived from repeated experience;\nrather, it is something independent of experience, and to such an\nextent that experience must in fact be conceived as dependent on it,\nsince the properties of time and space, as they are known a\npriori in intuition, apply to all experience as laws that it must\nalways come out in accordance with. (WWR, §3, p. 27)\n\n\nBy this remark, Schopenhauer indicates his recognition that Kant\nderives his epistemological idealism from his understanding of the\nimplications of our a priori cognition of space and time, but\nhe does not attempt to explain Kant’s inference or to add any\nargument of his own. Schopenhauer also does not doubt that there is\nsomething other than the representing subject beyond what it\nrepresents, an underlying reality beginning with its own body as it is\nrather than as it merely appears.\n\nSchopenhauer’s fundamental departure from Kant is already\nsuggested in this passage:\n\n\nWe have immediate cognition of the thing in itself when it appears to\nus as our own body; but our cognition is only indirect when the thing\nin itself is objectified in other objects of intuition. (WWR,\n§6, pp. 40–1)\n\n\nWhat Schopenhauer means is that although we have an experience of our\nown bodies, as it were from the outside, through the same forms of\nspace, time, and causality through which we experience all other\nbodies, including other animate bodies, and in this regard we\nexperience all bodies including our own as mere appearance through the\nforms we impose on experience, we also have another experience, each\nof us of his or her own body, as it were from the inside, namely we\nhave an experience of willing an action and of our bodies as the\ninstruments of our wills, with no separation between will and action\nand thus no relevance of spatial separation, temporal succession, or\ndifference between cause and effect. However—and this is the\nargument of Book II—our immediate experience of our own bodies\nas instruments of our wills is an experience of our actions being\nimmediately determined by desire rather than by reason. “To the\npure subject of cognition as such, [his] body is a representation like\nany other among objects”, but\n\n\nwill…and this alone gives him the key to his own\nappearance, reveals to him the meaning and shows him the inner\nworkings of his essence, his deeds, his movements; (WWR,\n§18, p. 124)\n\n\nand what we discover when we look closely at our wills is that they\nare governed not by reason but by impulse, at its most fundamental\nlevel a “dark, dull driving” (WWR, §27, p.\n174), and even at its highest, most clarified level, still desires or\napparently “creative drives” that only “seem to\nperform their tasks from abstract, rational motives”\n(WWR, §27, p. 182). It is not our planning and\ncalculating drives that best express the real nature of the will but\nour genitals (WWR, §20, p. 133). Of course, it is well\nknown that following the lead of one’s genitals is a pretty good\nformula for disappointment, and for Schopenhauer this reveals the\nfrustration to which a will driven by desire ultimately leads: either\none does not get what one wants, the object of one’s desire, and\nis frustrated, or one does, but then one wants more, and either does\nnot get that, so is frustrated, or does, but then wants more, and so\non ad infinitum. Trying to truly satisfy desire is the height\nof irrationality, but for Schopenhauer there is nothing else we can\nwill—we can at best try to escape from the clutches of will\naltogether, whether through art, asceticism, or compassion.\n\nBut of course, if the underlying nature of reality, the thing in\nitself, is nothing other than will, then escape from its clutches\nshould not really be possible but should at most be apparent. And not\nonly does Schopenhauer equate our experience of ourselves “from\nthe inside” as desire-driven will with our own ultimate reality,\nour character as things in themselves; he also argues that we have no\nchoice but to think of the underlying reality of all\nappearance in this way, because this is our only form of insight\ninto—or acquaintance with—anything as a thing in itself.\nWe can only “take the key to the understanding of the essence in\nitself of things” to be the\n\n\nkey provided…by the immediate cognition of our own essence, and\napply it to [the] appearances in the inorganic [and organic] world as\nwell,\n\n\neven appearances that are more remote from us than any others.\nUltimate reality, because, Schopenhauer assumes,\n\n\nit is everywhere one and the same,…must be called will\nhere as well as there, a name signifying the being in itself of every\nthing in the world and the sole kernel of every appearance.\n(WWR, §23, pp. 142–3)\n\n\nSchopenhauer devotes many pages to empirical descriptions of the\nsimilarities between the forces at work throughout the rest of nature\nand the merely apparently rational but really non-rational character\nof our own behavior, but of course the character of things in\nthemselves cannot be inferred directly from any amount of empirical\ndata; Schopenhauer derives his conclusion not from all this empirical\nillustration but rather from our allegedly immediate rather than\nempirical insight into the character of our own wills and the very\nproblematic premise that at bottom everything is essentially one. His\nposition thus begins from an epistemological premise, namely that we\ncan know ultimate reality through knowing ourselves, and reaches an\nontological conclusion, that ultimate reality must be like ourselves,\nbut in opposition to Kant and the other German idealists he assumes\nthat our own nature is essentially non-rational and therefore that the\nultimate character of reality, although it is in a certain sense like\nthe mental, is also fundamentally non-rational.\n",
    "section_title": "6. Schopenhauer",
    "entry_title": "Idealism",
    "hierarchy_title": "Idealism || Schopenhauer",
    "tokenized_text": [
        "schopenhauer",
        "schopenhauer",
        "arthur",
        "schopenhauer",
        "heaped",
        "great",
        "deal",
        "invective",
        "fichte",
        "schelling",
        "hegel",
        "reason",
        "schopenhauer",
        "always",
        "included",
        "among",
        "german",
        "idealist",
        "indeed",
        "nothing",
        "could",
        "hegel",
        "version",
        "absolute",
        "idealism",
        "schopenhauer",
        "theory",
        "behind",
        "realm",
        "appearance",
        "constructed",
        "accordance",
        "conception",
        "space",
        "time",
        "causalityhis",
        "form",
        "empirical",
        "realism",
        "side",
        "transcendental",
        "idealismthere",
        "unitary",
        "reality",
        "utterly",
        "irrational",
        "least",
        "arationalhis",
        "form",
        "kant",
        "ontological",
        "realism",
        "flipped",
        "practical",
        "theoretical",
        "rational",
        "arational",
        "nevertheless",
        "since",
        "schopenhauer",
        "work",
        "within",
        "kantian",
        "framework",
        "identifies",
        "underlying",
        "reality",
        "pure",
        "activity",
        "although",
        "arational",
        "rather",
        "rational",
        "kind",
        "useful",
        "think",
        "within",
        "framework",
        "idealism",
        "schopenhauer",
        "put",
        "forward",
        "theory",
        "main",
        "work",
        "world",
        "representation",
        "die",
        "welt",
        "al",
        "wille",
        "und",
        "vorstellung",
        "first",
        "published",
        "december",
        "date",
        "title",
        "page",
        "muchexpanded",
        "second",
        "edition",
        "yet",
        "another",
        "expanded",
        "edition",
        "book",
        "preceded",
        "doctoral",
        "dissertation",
        "fourfold",
        "root",
        "principle",
        "sufficient",
        "reason",
        "schopenhauer",
        "subsequently",
        "regarded",
        "introduction",
        "magnum",
        "opus",
        "earlier",
        "work",
        "includes",
        "schopenhauer",
        "main",
        "modification",
        "structure",
        "kant",
        "epistemology",
        "later",
        "work",
        "accepts",
        "kant",
        "idealist",
        "interpretation",
        "epistemology",
        "book",
        "replaces",
        "kant",
        "version",
        "doctrine",
        "thing",
        "schopenhauer",
        "version",
        "unitary",
        "nonrational",
        "underlying",
        "appearance",
        "book",
        "ii",
        "schopenhauer",
        "acceptance",
        "empirical",
        "side",
        "kant",
        "transcendental",
        "idealism",
        "combined",
        "nonrational",
        "version",
        "kant",
        "ontological",
        "realism",
        "however",
        "display",
        "throughout",
        "world",
        "representation",
        "schopenhauer",
        "accepts",
        "without",
        "reservation",
        "kant",
        "argument",
        "space",
        "time",
        "causality",
        "form",
        "representation",
        "know",
        "priori",
        "impose",
        "upon",
        "appearance",
        "object",
        "precede",
        "acceptance",
        "fichtean",
        "argument",
        "world",
        "representation",
        "sheer",
        "mineness",
        "representation",
        "supposed",
        "formmore",
        "universal",
        "form",
        "including",
        "space",
        "time",
        "causality",
        "wwr",
        "p",
        "schopenhauer",
        "hold",
        "truth",
        "certain",
        "truth",
        "independent",
        "others",
        "truth",
        "le",
        "need",
        "proof",
        "one",
        "everything",
        "cognition",
        "ie",
        "whole",
        "world",
        "object",
        "relation",
        "subject",
        "intuition",
        "beholder",
        "wwr",
        "pp",
        "simple",
        "perhaps",
        "inescapable",
        "thought",
        "may",
        "regarded",
        "fundamental",
        "epistemological",
        "motivation",
        "form",
        "idealism",
        "basis",
        "proposition",
        "schopenhauer",
        "try",
        "distinguish",
        "position",
        "take",
        "skepticism",
        "hume",
        "real",
        "question",
        "whether",
        "either",
        "subject",
        "object",
        "addition",
        "representation",
        "dogmatism",
        "fichte",
        "proved",
        "view",
        "initially",
        "stated",
        "rather",
        "object",
        "always",
        "presupposes",
        "subject",
        "necessary",
        "correlate",
        "subject",
        "always",
        "remains",
        "outside",
        "jurisdiction",
        "principle",
        "sufficient",
        "reason",
        "wwr",
        "p",
        "speaking",
        "dogmatism",
        "simply",
        "accepts",
        "kant",
        "space",
        "time",
        "conceived",
        "abstractly",
        "independently",
        "content",
        "also",
        "intuited",
        "immediately",
        "intuition",
        "phantasm",
        "derived",
        "repeated",
        "experience",
        "rather",
        "something",
        "independent",
        "experience",
        "extent",
        "experience",
        "must",
        "fact",
        "conceived",
        "dependent",
        "since",
        "property",
        "time",
        "space",
        "known",
        "priori",
        "intuition",
        "apply",
        "experience",
        "law",
        "must",
        "always",
        "come",
        "accordance",
        "wwr",
        "p",
        "remark",
        "schopenhauer",
        "indicates",
        "recognition",
        "kant",
        "derives",
        "epistemological",
        "idealism",
        "understanding",
        "implication",
        "priori",
        "cognition",
        "space",
        "time",
        "attempt",
        "explain",
        "kant",
        "inference",
        "add",
        "argument",
        "schopenhauer",
        "also",
        "doubt",
        "something",
        "representing",
        "subject",
        "beyond",
        "represents",
        "underlying",
        "reality",
        "beginning",
        "body",
        "rather",
        "merely",
        "appears",
        "schopenhauer",
        "fundamental",
        "departure",
        "kant",
        "already",
        "suggested",
        "passage",
        "immediate",
        "cognition",
        "thing",
        "appears",
        "u",
        "body",
        "cognition",
        "indirect",
        "thing",
        "objectified",
        "object",
        "intuition",
        "wwr",
        "pp",
        "schopenhauer",
        "mean",
        "although",
        "experience",
        "body",
        "outside",
        "form",
        "space",
        "time",
        "causality",
        "experience",
        "body",
        "including",
        "animate",
        "body",
        "regard",
        "experience",
        "body",
        "including",
        "mere",
        "appearance",
        "form",
        "impose",
        "experience",
        "also",
        "another",
        "experience",
        "u",
        "body",
        "inside",
        "namely",
        "experience",
        "willing",
        "action",
        "body",
        "instrument",
        "will",
        "separation",
        "action",
        "thus",
        "relevance",
        "spatial",
        "separation",
        "temporal",
        "succession",
        "difference",
        "cause",
        "effect",
        "howeverand",
        "argument",
        "book",
        "iiour",
        "immediate",
        "experience",
        "body",
        "instrument",
        "will",
        "experience",
        "action",
        "immediately",
        "determined",
        "desire",
        "rather",
        "reason",
        "pure",
        "subject",
        "cognition",
        "body",
        "representation",
        "like",
        "among",
        "object",
        "willand",
        "alone",
        "give",
        "key",
        "appearance",
        "reveals",
        "meaning",
        "show",
        "inner",
        "working",
        "essence",
        "deed",
        "movement",
        "wwr",
        "p",
        "discover",
        "look",
        "closely",
        "will",
        "governed",
        "reason",
        "impulse",
        "fundamental",
        "level",
        "dark",
        "dull",
        "driving",
        "wwr",
        "p",
        "even",
        "highest",
        "clarified",
        "level",
        "still",
        "desire",
        "apparently",
        "creative",
        "drive",
        "seem",
        "perform",
        "task",
        "abstract",
        "rational",
        "motif",
        "wwr",
        "p",
        "planning",
        "calculating",
        "drive",
        "best",
        "express",
        "real",
        "nature",
        "genitals",
        "wwr",
        "p",
        "course",
        "well",
        "known",
        "following",
        "lead",
        "one",
        "genitals",
        "pretty",
        "good",
        "formula",
        "disappointment",
        "schopenhauer",
        "reveals",
        "frustration",
        "driven",
        "desire",
        "ultimately",
        "lead",
        "either",
        "one",
        "get",
        "one",
        "want",
        "object",
        "one",
        "desire",
        "frustrated",
        "one",
        "one",
        "want",
        "either",
        "get",
        "frustrated",
        "want",
        "ad",
        "infinitum",
        "trying",
        "truly",
        "satisfy",
        "desire",
        "height",
        "irrationality",
        "schopenhauer",
        "nothing",
        "else",
        "willwe",
        "best",
        "try",
        "escape",
        "clutch",
        "altogether",
        "whether",
        "art",
        "asceticism",
        "compassion",
        "course",
        "underlying",
        "nature",
        "reality",
        "thing",
        "nothing",
        "escape",
        "clutch",
        "really",
        "possible",
        "apparent",
        "schopenhauer",
        "equate",
        "experience",
        "inside",
        "desiredriven",
        "ultimate",
        "reality",
        "character",
        "thing",
        "also",
        "argues",
        "choice",
        "think",
        "underlying",
        "reality",
        "appearance",
        "way",
        "form",
        "insight",
        "intoor",
        "acquaintance",
        "withanything",
        "thing",
        "take",
        "key",
        "understanding",
        "essence",
        "thing",
        "key",
        "providedby",
        "immediate",
        "cognition",
        "essence",
        "apply",
        "appearance",
        "inorganic",
        "organic",
        "world",
        "well",
        "even",
        "appearance",
        "remote",
        "u",
        "others",
        "ultimate",
        "reality",
        "schopenhauer",
        "assumes",
        "everywhere",
        "one",
        "must",
        "called",
        "well",
        "name",
        "signifying",
        "every",
        "thing",
        "world",
        "sole",
        "kernel",
        "every",
        "appearance",
        "wwr",
        "pp",
        "schopenhauer",
        "devotes",
        "many",
        "page",
        "empirical",
        "description",
        "similarity",
        "force",
        "work",
        "throughout",
        "rest",
        "nature",
        "merely",
        "apparently",
        "rational",
        "really",
        "nonrational",
        "character",
        "behavior",
        "course",
        "character",
        "thing",
        "inferred",
        "directly",
        "amount",
        "empirical",
        "data",
        "schopenhauer",
        "derives",
        "conclusion",
        "empirical",
        "illustration",
        "rather",
        "allegedly",
        "immediate",
        "rather",
        "empirical",
        "insight",
        "character",
        "will",
        "problematic",
        "premise",
        "bottom",
        "everything",
        "essentially",
        "one",
        "position",
        "thus",
        "begin",
        "epistemological",
        "premise",
        "namely",
        "know",
        "ultimate",
        "reality",
        "knowing",
        "reach",
        "ontological",
        "conclusion",
        "ultimate",
        "reality",
        "must",
        "like",
        "opposition",
        "kant",
        "german",
        "idealist",
        "assumes",
        "nature",
        "essentially",
        "nonrational",
        "therefore",
        "ultimate",
        "character",
        "reality",
        "although",
        "certain",
        "sense",
        "like",
        "mental",
        "also",
        "fundamentally",
        "nonrational"
    ]
}