{
    "main_text": "Liberalism and Identity Politics\n4. Contemporary Philosophical Engagement with Identity Politics\n\nSince its 1970s origins, identity politics as a mode of organizing\nand set of political philosophical positions has undergone numerous\nattacks by those motivated to point to its flaws, whether by its\npragmatic exclusions or more programmatically. For many leftist\ncommentators, in particular, identity politics is something of\na bête noire, representing the capitulation to\ncultural criticism in place of analysis of the material roots of\noppression. Marxists, both orthodox and revisionist, and\nsocialists—especially those who came of age during the rise of\nthe New Left in western countries—have often interpreted the\nperceived ascendancy of identity politics as representing the end of\nradical materialist critique (see discussions in McNay 2008:\n126–161, and Kumar et al. 2018). Identity politics, for these\ncritics, is both factionalizing and depoliticizing, drawing attention\naway from the ravages of late capitalism toward superstructural\ncultural accommodations that leave economic structures unchanged. For\nexample, while allowing that both recognition and redistribution have a\nplace in contemporary politics, Nancy Fraser laments the supremacy of\nperspectives that take injustice to inhere in “cultural”\nconstructions of identity that the people to whom they are attributed\nwant to reject. Such recognition models, she argues, require remedies\nthat “valorize the group’s ‘groupness’ by\nrecognizing its specificity,” thus reifying identities that\nthemselves are products of oppressive structures. By contrast,\ninjustices of distribution require redistributive remedies that aim\n“to put the group out of business as a group” (Fraser 1997:\n19). If Fraser’s argument traces its intellectual roots to Marx\nthrough critical theory, similar arguments come via Foucauldian\ngenealogy. In her 2008 book Against Recognition, for\nexample, Lois McNay argues that identity claims that are at the heart\nof many contemporary social movements are represented as demands for\nrecognition in the context of an over-simplified account of power.\nAlthough theorists of recognition typically start from a Hegelian model\nof the subject as dialogically formed and necessarily situated, they\ntoo quickly abandon the radical consequences of such a view for subject\nformation, McNay argues. The subject of recognition becomes both\npersonalized and hypostatized—divorced from the larger social\nsystems of power that create conditions of possibility for particular\n“identities” (2008: esp. 1–23). In this way, the\ndebates around subject-formation that are at the heart of philosophical\ndiscussions of identity politics parallel conversations between\nHabermasians and Foucauldians about the possibility of a transcendental\nsubject that can ground practices of critique (see Allen 2008). This\nvaried debate has a long half-life (see Fraser 2010; 2013) and\ncontemporary manifestations. For example, Glen Coulthard (2014) argues\nthat the shift in colonial state-Indigenous relations in present-day\nCanada from unabashed assimilationism to demands for mutual recognition\n(especially of cultural distinctiveness) cannot be an adequate\ndecolonization strategy. Reading the intellectual history of the\npolitics of recognition through Hegel to Sartre to Fanon to Benhabib,\nCoulthard argues that this discourse is a reiteration (and sometimes a\ncover-up) of the patriarchal, racist, and colonial relations between\nIndigenous people and the Canadian state that it purports to\nameliorate. Instead, he defends a paradigm of critical Indigenous\nresurgence that draws on cultural history and economic practices that\nare neither essentialized nor romanticized, but that also do not rest\non concession-oriented relation-building with the existing Canadian\nstate. Audra Simpson makes a similar argument, suggesting that the\npolitics of recognition in the context of settler dispossession denies\nits own history, assuming that recognition for Indigenous people can\noccur within the context of such “largely state-driven\nperformance art” as reconciliation, which casts the injustices of\nsettler colonialism as having occurred “in the past” and\nrequiring apology, rather than acknowledging the wide-ranging material\npolitical consequences of land theft and Indigenous sovereignty (2017,\n6–7).\n\nFrom the early days, the presentation of a dichotomy (or a choice)\nbetween recognition and redistribution, or the cultural and the\neconomic, was challenged by those who pointed out that the\nintersectional politics of gender, sexuality, and race had always been\nengaged and understood through the structures of capitalism (Butler\n1997; Upping the Anti 2005; Walters 2018). Given how many\ncontexts these debates must generalize, it is hard to see how one can\ndraw any conclusions about the merits of a thing called “identity\npolitics” over and above any other kind. Nonetheless, in the\npost-2016 political world, after the Brexit referendum in the UK and\nthe election of Donald Trump in the US, as well as following the rise\nof nationalist and/or austerity right parties in many other countries,\nrecrimination from diverse political perspectives has again focused on\nthe alleged over-emphasis on “identity politics.” The\ndecline of class-based politics, the growth of economic inequality, and\nthe disaffection of working-class white men, critics suggest, was\nneglected by both political party leaderships and grassroots\norganizers, in favor of campaigning around issues attaching to\nfeminism, queer politics, and anti-racism. For example, Francis\nFukuyama argues that the twentieth century was the century of the\neconomic in politics—a contest between a left defined through\nworkers’ rights, social welfare, and robust redistribution, and\nthe right’s drive to reduce government by shrinking the public\nsector and selling publicly owned services and replacing them with\nprivate market delivery. By contrast, he suggests, the twenty-first\ncentury has seen the left focus “less on creating broad economic\nequality and more on promoting the interests of a wide variety of\nmarginalized groups, such as ethnic minorities, immigrants and\nrefugees, women, and LGBT people. The right, meanwhile, has redefined\nits core mission as the patriotic protection of traditional national\nidentity, which is often explicitly connected to race, ethnicity, or\nreligion” (Fukuyama 2018, 91). This allegedly renders the left\nless able to address trending inequality, and redirects its focus to\n“cultural issues,” and validating interiority and achieving\nrecognition—all of which racist nationalists can easily\nco-opt:\n\nToday, the American creedal national identity, which emerged in the\nwake of the Civil War, must be revived and defended against attacks\nfrom both the left and the right. On the right, white nationalists\nwould like to replace the creedal national identity with one based on\nrace, ethnicity, and religion. On the left, the champions of identity\npolitics have sought to undermine the legitimacy of the American\nnational story by emphasizing victimization, insinuating in some cases\nthat racism, gender discrimination, and other forms of systematic\nexclusion are in the country’s DNA. (108)\n\nIdentity politics, Fukuyama concludes, is the lens through which\npolitics in the US is refracted, with a turning-away from economic\ninequality on the left providing a convenient evasion for the\nright.\n\nFukuyama writes with a hostile outsider’s dismissal of the\nsocial movements he labels as identity politics, yet the bifurcation he\ndescribes between the economic and the identarian is echoed in a 2018\nspecial issue of the Marxist journal Historical Materialism,\nin which the editors’ introduction describes approvingly\nsubsequent articles that show how\n\nthe Left has abrogated the notion of identity as being materially\nrooted, and contingent on historical and geographical context. In its\nplace, we see the hegemonic acceptance of an inherently reactionary\nalternative: one which perceives race, gender and sexuality as\ndearly-held, self-fashioning, and self-justifying essences. Such a\nconcession has not only reinforced the class/identity binary, but also\nled to a stifled political imagination in which identity-based politics\ncan only be conceptualised within a liberal-capitalist logic. (Kumar et\nal. 2018, 5–6)\n\nIn response to this challenge, defenders point out again how\npolitical organizing through contemporary feminism and\nanti-racism—by way of movements like #MeToo or Black Lives\nMatter, for example—has not shied away from the economic\ncomponents to their analyses. The binary between economic critique that\nmarks discussion of “redistribution,” and discussion of\ngroup identity that characterizes “recognition,” may in\nmoments be conducted as if the two were separate. The idea, however,\nthat proponents of treating gender, sexuality, or race as intersecting\naxes of individual meaning and social stratification have consistently\nneglected the economic aspects of their analyses is hard to sustain. As\nSuzanna Danuta Walters points out, “the critique of identity\npolitics is dependent upon seeing identity as only the province of the\ndisenfranchised and marginal” as well as upon seeing white men\n(including the working-class, straight men who are the imagined\ncommunity of the neonationalist right) as somehow not having\n“identity” (Walters 2018, 477). Described by Paul Joshua as\n“anti-identity identity politics,” this position, as\nexemplified in his description of the “All Lives Matter”\nresponse to Black Lives Matter, “is predicated on the\ntaken-for-grantedness of a pre-established racist system which from\ncenturies of de jure and de facto practices is now\nfixed almost silently into the socio-political infrastructure….\nDespite its universalist pretentions, it remains a cloaked identitarian\npolitics which through a hegemonic narrative (re)presents itself as a\nradically inclusionary counter-narrative” (2019, 16).\n\nEvery time this article is revised, it is tempting to write that\n“identity politics” is an out-moded term, over-determined\nby its critics and part of a reductive political lexicon on both the\nMarxist left and the neoconservative right. Yet in 2020, still, there\nare recent iterations of the recognition versus redistribution debate,\nongoing arguments about the demands of intersectionality, and new forms\nof political resistance to the movements that circulate under the sign\n“identity politics.” Both flexible and extensible, identity\npolitical tropes continue to influence new political claims: an\nextensive literature approaches disability, for example, as a diverse\nand dynamic set of experiences of social injustice that sediment\nself-understandings among the disabled and motivate a politics that\ninsists dominant cultures change their exclusionary social practices\n(Davis 2017 [1997]; Silvers 1998, Siebers 2006, 2008; Kafer 2013).\nPerhaps most important for philosophers, any idea of identity itself\nappears to be in a period of rapid evolution. Attempts to decode human\ngenetics and shape the genetic make-up of future persons (Richardson\nand Stevens 2015), to clone human beings, or to xeno-transplant animal\norgans, and so on, all raise deep philosophical questions about the\nkind of thing a person is. As more and more people form political\nalliances using disembodied communications technologies, the kinds of\nidentities that matter seem also to shift. Behaviors, beliefs, and\nself-understandings are increasingly pathologized as syndromes and\ndisorders, including through the identification of new\n“types” of person (in turn generating possibilities for new\nforms of identity politics).\n\nIncreasingly, this long list of confounding variables for identity\npolitical thought is finding philosophical cohesion in anti-identarian\nmodels that take somatic life, affect, time, or space as organizing\nconcepts. For example, both new materialisms and neo-vitalist\nphilosophies, in their political contexts, share an emphasis\non becoming over being, a “posthumanist”\nreluctance to award ontological priority to any shared characteristics\nof human beings (Wolfe 2010), a skepticism about discourses of\nauthenticity and belonging, and a desire to focus on generative,\nforward-looking political solutions (Bhambra and Margee 2010; Coole\nand Frost 2010; Connolly 2011). The lines between humans and other\nanimals (Haraway 2007; Donaldson and Kymlicka 2014, 2016), between the\nliving and the non-living (Sharp 2011), and between objects and\nsubjects (Bennett 2009) are radically challenged. The COVID-19\npandemic shows more clearly than ever how the edges of human bodies\nare porous with our environments. To varying degrees these emphases\nare echoed in other process ontologies—whether Annemarie\nMol’s work in medical anthropology (2002), the reintroduction of\nbodies as socially and biologically dynamic and intra-active forces in\nforming political subjectivities (Protevi 2009), or the ways indirect,\ntechnologically mediated experience shapes so much of our contemporary\n“identities” (Turkle 2011). This mass of shifts and\ncontradictions might be thought to mark the end of the era of identity\npolitics. Whatever limits are inherent to identity political\nformations, however, the enduring rhetorical power of the phrase\nitself indicates the deep implication of questions of power and\nlegitimate government with demands for self-determination that are\nunlikely to fade away.\n",
    "section_title": "4. Contemporary Philosophical Engagement with Identity Politics",
    "entry_title": "Identity Politics",
    "hierarchy_title": "Identity Politics || Liberalism and Identity Politics",
    "tokenized_text": [
        "liberalism",
        "identity",
        "politics",
        "contemporary",
        "philosophical",
        "engagement",
        "identity",
        "politics",
        "since",
        "s",
        "origin",
        "identity",
        "politics",
        "mode",
        "organizing",
        "set",
        "political",
        "philosophical",
        "position",
        "undergone",
        "numerous",
        "attack",
        "motivated",
        "point",
        "flaw",
        "whether",
        "pragmatic",
        "exclusion",
        "programmatically",
        "many",
        "leftist",
        "commentator",
        "particular",
        "identity",
        "politics",
        "something",
        "bête",
        "noire",
        "representing",
        "capitulation",
        "cultural",
        "criticism",
        "place",
        "analysis",
        "material",
        "root",
        "oppression",
        "marxist",
        "orthodox",
        "revisionist",
        "socialistsespecially",
        "came",
        "age",
        "rise",
        "new",
        "left",
        "western",
        "countrieshave",
        "often",
        "interpreted",
        "perceived",
        "ascendancy",
        "identity",
        "politics",
        "representing",
        "end",
        "radical",
        "materialist",
        "critique",
        "see",
        "discussion",
        "mcnay",
        "kumar",
        "et",
        "al",
        "identity",
        "politics",
        "critic",
        "factionalizing",
        "depoliticizing",
        "drawing",
        "attention",
        "away",
        "ravage",
        "late",
        "capitalism",
        "toward",
        "superstructural",
        "cultural",
        "accommodation",
        "leave",
        "economic",
        "structure",
        "unchanged",
        "example",
        "allowing",
        "recognition",
        "redistribution",
        "place",
        "contemporary",
        "politics",
        "nancy",
        "fraser",
        "lament",
        "supremacy",
        "perspective",
        "take",
        "injustice",
        "inhere",
        "cultural",
        "construction",
        "identity",
        "people",
        "attributed",
        "want",
        "reject",
        "recognition",
        "model",
        "argues",
        "require",
        "remedy",
        "valorize",
        "group",
        "groupness",
        "recognizing",
        "specificity",
        "thus",
        "reifying",
        "identity",
        "product",
        "oppressive",
        "structure",
        "contrast",
        "injustice",
        "distribution",
        "require",
        "redistributive",
        "remedy",
        "aim",
        "put",
        "group",
        "business",
        "group",
        "fraser",
        "fraser",
        "argument",
        "trace",
        "intellectual",
        "root",
        "marx",
        "critical",
        "theory",
        "similar",
        "argument",
        "come",
        "via",
        "foucauldian",
        "genealogy",
        "book",
        "recognition",
        "example",
        "lois",
        "mcnay",
        "argues",
        "identity",
        "claim",
        "heart",
        "many",
        "contemporary",
        "social",
        "movement",
        "represented",
        "demand",
        "recognition",
        "context",
        "oversimplified",
        "account",
        "power",
        "although",
        "theorist",
        "recognition",
        "typically",
        "start",
        "hegelian",
        "model",
        "subject",
        "dialogically",
        "formed",
        "necessarily",
        "situated",
        "quickly",
        "abandon",
        "radical",
        "consequence",
        "view",
        "subject",
        "formation",
        "mcnay",
        "argues",
        "subject",
        "recognition",
        "becomes",
        "personalized",
        "hypostatizeddivorced",
        "larger",
        "social",
        "system",
        "power",
        "create",
        "condition",
        "possibility",
        "particular",
        "identity",
        "esp",
        "way",
        "debate",
        "around",
        "subjectformation",
        "heart",
        "philosophical",
        "discussion",
        "identity",
        "politics",
        "parallel",
        "conversation",
        "habermasians",
        "foucauldians",
        "possibility",
        "transcendental",
        "subject",
        "ground",
        "practice",
        "critique",
        "see",
        "allen",
        "varied",
        "debate",
        "long",
        "halflife",
        "see",
        "fraser",
        "contemporary",
        "manifestation",
        "example",
        "glen",
        "coulthard",
        "argues",
        "shift",
        "colonial",
        "stateindigenous",
        "relation",
        "presentday",
        "canada",
        "unabashed",
        "assimilationism",
        "demand",
        "mutual",
        "recognition",
        "especially",
        "cultural",
        "distinctiveness",
        "adequate",
        "decolonization",
        "strategy",
        "reading",
        "intellectual",
        "history",
        "politics",
        "recognition",
        "hegel",
        "sartre",
        "fanon",
        "benhabib",
        "coulthard",
        "argues",
        "discourse",
        "reiteration",
        "sometimes",
        "coverup",
        "patriarchal",
        "racist",
        "colonial",
        "relation",
        "indigenous",
        "people",
        "canadian",
        "state",
        "purport",
        "ameliorate",
        "instead",
        "defends",
        "paradigm",
        "critical",
        "indigenous",
        "resurgence",
        "draw",
        "cultural",
        "history",
        "economic",
        "practice",
        "neither",
        "essentialized",
        "romanticized",
        "also",
        "rest",
        "concessionoriented",
        "relationbuilding",
        "existing",
        "canadian",
        "state",
        "audra",
        "simpson",
        "make",
        "similar",
        "argument",
        "suggesting",
        "politics",
        "recognition",
        "context",
        "settler",
        "dispossession",
        "denies",
        "history",
        "assuming",
        "recognition",
        "indigenous",
        "people",
        "occur",
        "within",
        "context",
        "largely",
        "statedriven",
        "performance",
        "art",
        "reconciliation",
        "cast",
        "injustice",
        "settler",
        "colonialism",
        "occurred",
        "past",
        "requiring",
        "apology",
        "rather",
        "acknowledging",
        "wideranging",
        "material",
        "political",
        "consequence",
        "land",
        "theft",
        "indigenous",
        "sovereignty",
        "early",
        "day",
        "presentation",
        "dichotomy",
        "choice",
        "recognition",
        "redistribution",
        "cultural",
        "economic",
        "challenged",
        "pointed",
        "intersectional",
        "politics",
        "gender",
        "sexuality",
        "race",
        "always",
        "engaged",
        "understood",
        "structure",
        "capitalism",
        "butler",
        "upping",
        "anti",
        "walter",
        "given",
        "many",
        "context",
        "debate",
        "must",
        "generalize",
        "hard",
        "see",
        "one",
        "draw",
        "conclusion",
        "merit",
        "thing",
        "called",
        "identity",
        "politics",
        "kind",
        "nonetheless",
        "post",
        "political",
        "world",
        "brexit",
        "referendum",
        "uk",
        "election",
        "donald",
        "trump",
        "u",
        "well",
        "following",
        "rise",
        "nationalist",
        "andor",
        "austerity",
        "right",
        "party",
        "many",
        "country",
        "recrimination",
        "diverse",
        "political",
        "perspective",
        "focused",
        "alleged",
        "overemphasis",
        "identity",
        "politics",
        "decline",
        "classbased",
        "politics",
        "growth",
        "economic",
        "inequality",
        "disaffection",
        "workingclass",
        "white",
        "men",
        "critic",
        "suggest",
        "neglected",
        "political",
        "party",
        "leadership",
        "grassroots",
        "organizer",
        "favor",
        "campaigning",
        "around",
        "issue",
        "attaching",
        "feminism",
        "queer",
        "politics",
        "antiracism",
        "example",
        "francis",
        "fukuyama",
        "argues",
        "twentieth",
        "century",
        "century",
        "economic",
        "politicsa",
        "contest",
        "left",
        "defined",
        "worker",
        "right",
        "social",
        "welfare",
        "robust",
        "redistribution",
        "right",
        "drive",
        "reduce",
        "government",
        "shrinking",
        "public",
        "sector",
        "selling",
        "publicly",
        "owned",
        "service",
        "replacing",
        "private",
        "market",
        "delivery",
        "contrast",
        "suggests",
        "twentyfirst",
        "century",
        "seen",
        "left",
        "focus",
        "le",
        "creating",
        "broad",
        "economic",
        "equality",
        "promoting",
        "interest",
        "wide",
        "variety",
        "marginalized",
        "group",
        "ethnic",
        "minority",
        "immigrant",
        "refugee",
        "woman",
        "lgbt",
        "people",
        "right",
        "meanwhile",
        "redefined",
        "core",
        "mission",
        "patriotic",
        "protection",
        "traditional",
        "national",
        "identity",
        "often",
        "explicitly",
        "connected",
        "race",
        "ethnicity",
        "religion",
        "fukuyama",
        "allegedly",
        "render",
        "left",
        "le",
        "able",
        "address",
        "trending",
        "inequality",
        "redirects",
        "focus",
        "cultural",
        "issue",
        "validating",
        "interiority",
        "achieving",
        "recognitionall",
        "racist",
        "nationalist",
        "easily",
        "coopt",
        "today",
        "american",
        "creedal",
        "national",
        "identity",
        "emerged",
        "wake",
        "civil",
        "war",
        "must",
        "revived",
        "defended",
        "attack",
        "left",
        "right",
        "right",
        "white",
        "nationalist",
        "would",
        "like",
        "replace",
        "creedal",
        "national",
        "identity",
        "one",
        "based",
        "race",
        "ethnicity",
        "religion",
        "left",
        "champion",
        "identity",
        "politics",
        "sought",
        "undermine",
        "legitimacy",
        "american",
        "national",
        "story",
        "emphasizing",
        "victimization",
        "insinuating",
        "case",
        "racism",
        "gender",
        "discrimination",
        "form",
        "systematic",
        "exclusion",
        "country",
        "dna",
        "identity",
        "politics",
        "fukuyama",
        "concludes",
        "lens",
        "politics",
        "u",
        "refracted",
        "turningaway",
        "economic",
        "inequality",
        "left",
        "providing",
        "convenient",
        "evasion",
        "right",
        "fukuyama",
        "writes",
        "hostile",
        "outsider",
        "dismissal",
        "social",
        "movement",
        "label",
        "identity",
        "politics",
        "yet",
        "bifurcation",
        "describes",
        "economic",
        "identarian",
        "echoed",
        "special",
        "issue",
        "marxist",
        "journal",
        "historical",
        "materialism",
        "editor",
        "introduction",
        "describes",
        "approvingly",
        "subsequent",
        "article",
        "show",
        "left",
        "abrogated",
        "notion",
        "identity",
        "materially",
        "rooted",
        "contingent",
        "historical",
        "geographical",
        "context",
        "place",
        "see",
        "hegemonic",
        "acceptance",
        "inherently",
        "reactionary",
        "alternative",
        "one",
        "perceives",
        "race",
        "gender",
        "sexuality",
        "dearlyheld",
        "selffashioning",
        "selfjustifying",
        "essence",
        "concession",
        "reinforced",
        "classidentity",
        "binary",
        "also",
        "led",
        "stifled",
        "political",
        "imagination",
        "identitybased",
        "politics",
        "conceptualised",
        "within",
        "liberalcapitalist",
        "logic",
        "kumar",
        "et",
        "al",
        "response",
        "challenge",
        "defender",
        "point",
        "political",
        "organizing",
        "contemporary",
        "feminism",
        "antiracismby",
        "way",
        "movement",
        "like",
        "metoo",
        "black",
        "life",
        "matter",
        "examplehas",
        "shied",
        "away",
        "economic",
        "component",
        "analysis",
        "binary",
        "economic",
        "critique",
        "mark",
        "discussion",
        "redistribution",
        "discussion",
        "group",
        "identity",
        "characterizes",
        "recognition",
        "may",
        "moment",
        "conducted",
        "two",
        "separate",
        "idea",
        "however",
        "proponent",
        "treating",
        "gender",
        "sexuality",
        "race",
        "intersecting",
        "ax",
        "individual",
        "meaning",
        "social",
        "stratification",
        "consistently",
        "neglected",
        "economic",
        "aspect",
        "analysis",
        "hard",
        "sustain",
        "suzanna",
        "danuta",
        "walter",
        "point",
        "critique",
        "identity",
        "politics",
        "dependent",
        "upon",
        "seeing",
        "identity",
        "province",
        "disenfranchised",
        "marginal",
        "well",
        "upon",
        "seeing",
        "white",
        "men",
        "including",
        "workingclass",
        "straight",
        "men",
        "imagined",
        "community",
        "neonationalist",
        "right",
        "somehow",
        "identity",
        "walter",
        "described",
        "paul",
        "joshua",
        "antiidentity",
        "identity",
        "politics",
        "position",
        "exemplified",
        "description",
        "life",
        "matter",
        "response",
        "black",
        "life",
        "matter",
        "predicated",
        "takenforgrantedness",
        "preestablished",
        "racist",
        "system",
        "century",
        "de",
        "jure",
        "de",
        "facto",
        "practice",
        "fixed",
        "almost",
        "silently",
        "sociopolitical",
        "infrastructure",
        "despite",
        "universalist",
        "pretentions",
        "remains",
        "cloaked",
        "identitarian",
        "politics",
        "hegemonic",
        "narrative",
        "present",
        "radically",
        "inclusionary",
        "counternarrative",
        "every",
        "time",
        "article",
        "revised",
        "tempting",
        "write",
        "identity",
        "politics",
        "outmoded",
        "term",
        "overdetermined",
        "critic",
        "part",
        "reductive",
        "political",
        "lexicon",
        "marxist",
        "left",
        "neoconservative",
        "right",
        "yet",
        "still",
        "recent",
        "iteration",
        "recognition",
        "versus",
        "redistribution",
        "debate",
        "ongoing",
        "argument",
        "demand",
        "intersectionality",
        "new",
        "form",
        "political",
        "resistance",
        "movement",
        "circulate",
        "sign",
        "identity",
        "politics",
        "flexible",
        "extensible",
        "identity",
        "political",
        "trope",
        "continue",
        "influence",
        "new",
        "political",
        "claim",
        "extensive",
        "literature",
        "approach",
        "disability",
        "example",
        "diverse",
        "dynamic",
        "set",
        "experience",
        "social",
        "injustice",
        "sediment",
        "selfunderstandings",
        "among",
        "disabled",
        "motivate",
        "politics",
        "insists",
        "dominant",
        "culture",
        "change",
        "exclusionary",
        "social",
        "practice",
        "davis",
        "silver",
        "siebers",
        "kafer",
        "perhaps",
        "important",
        "philosopher",
        "idea",
        "identity",
        "appears",
        "period",
        "rapid",
        "evolution",
        "attempt",
        "decode",
        "human",
        "genetics",
        "shape",
        "genetic",
        "makeup",
        "future",
        "person",
        "richardson",
        "stevens",
        "clone",
        "human",
        "being",
        "xenotransplant",
        "animal",
        "organ",
        "raise",
        "deep",
        "philosophical",
        "question",
        "kind",
        "thing",
        "person",
        "people",
        "form",
        "political",
        "alliance",
        "using",
        "disembodied",
        "communication",
        "technology",
        "kind",
        "identity",
        "matter",
        "seem",
        "also",
        "shift",
        "behavior",
        "belief",
        "selfunderstandings",
        "increasingly",
        "pathologized",
        "syndrome",
        "disorder",
        "including",
        "identification",
        "new",
        "type",
        "person",
        "turn",
        "generating",
        "possibility",
        "new",
        "form",
        "identity",
        "politics",
        "increasingly",
        "long",
        "list",
        "confounding",
        "variable",
        "identity",
        "political",
        "thought",
        "finding",
        "philosophical",
        "cohesion",
        "antiidentarian",
        "model",
        "take",
        "somatic",
        "life",
        "affect",
        "time",
        "space",
        "organizing",
        "concept",
        "example",
        "new",
        "materialism",
        "neovitalist",
        "philosophy",
        "political",
        "context",
        "share",
        "emphasis",
        "becoming",
        "posthumanist",
        "reluctance",
        "award",
        "ontological",
        "priority",
        "shared",
        "characteristic",
        "human",
        "being",
        "wolfe",
        "skepticism",
        "discourse",
        "authenticity",
        "belonging",
        "desire",
        "focus",
        "generative",
        "forwardlooking",
        "political",
        "solution",
        "bhambra",
        "margee",
        "coole",
        "frost",
        "connolly",
        "line",
        "human",
        "animal",
        "haraway",
        "donaldson",
        "kymlicka",
        "living",
        "nonliving",
        "sharp",
        "object",
        "subject",
        "bennett",
        "radically",
        "challenged",
        "covid",
        "pandemic",
        "show",
        "clearly",
        "ever",
        "edge",
        "human",
        "body",
        "porous",
        "environment",
        "varying",
        "degree",
        "emphasis",
        "echoed",
        "process",
        "ontologieswhether",
        "annemarie",
        "mol",
        "work",
        "medical",
        "anthropology",
        "reintroduction",
        "body",
        "socially",
        "biologically",
        "dynamic",
        "intraactive",
        "force",
        "forming",
        "political",
        "subjectivity",
        "protevi",
        "way",
        "indirect",
        "technologically",
        "mediated",
        "experience",
        "shape",
        "much",
        "contemporary",
        "identity",
        "turkle",
        "mass",
        "shift",
        "contradiction",
        "might",
        "thought",
        "mark",
        "end",
        "era",
        "identity",
        "politics",
        "whatever",
        "limit",
        "inherent",
        "identity",
        "political",
        "formation",
        "however",
        "enduring",
        "rhetorical",
        "power",
        "phrase",
        "indicates",
        "deep",
        "implication",
        "question",
        "power",
        "legitimate",
        "government",
        "demand",
        "selfdetermination",
        "unlikely",
        "fade",
        "away"
    ]
}