{
    "main_text": "Identity and Moral Responsibility\n5. Identity and Moral Responsibility\n\n\nAs noted earlier, Locke thought the personal identity relation was, \nin effect, an accountability relation: what makes Y\nat t2 the same person as X at \nt1 is just what makes Y accountable\n– morally responsible – for X's actions. Now this\ngeneral account of moral responsibility won't do without immmediate\nsupplementation. After all, various excuses (e.g., brainwashing,\ninvoluntary intoxication) may serve to get one off the accountability\nhook even if one is identical to the original agent.  So let us\nsuppose, then, that Locke thought one is accountable, in the\nabsence of excuse, for all and only those actions performed by\nsomeone with whom one is identical. Is this true?\n\n\nThere is widespread agreement that identity is at least a necessary\ncondition for accountability. The way this idea is most often\nexpressed is that one can be responsible only for one's own\nactions. Sometimes this is put more expansively: I can be responsible\nfor my own actions, and I cannot be responsible for anyone else's\nactions (Sider 2001, 4, 143, 203–204; Schechtman 1996, 14; Olson\n1997, 59). But these ways of putting the matter are just supposed to\nbe a gloss on the philosophical slogan that moral responsibility\npresupposes personal identity (Butler 1736, 99–105; Reid 1785,\n107–118; DeGrazia 2005, 88–89; Glannon 1998; Parfit 1984,\n323–326; Parfit 1986, 837–843).\n\n\nNow one might think that there are obvious counterexamples to the\nslogan: parents are sometimes held responsible for the actions of\ntheir children, and accomplices are held responsible for the crimes\ncommitted by others. An easy reply, however, is that in each case the\nperson being held responsible is actually responsible only for\nwhat he or she did. For example, the parent is being held \nresponsible, not for what his child did, but for his (in)action in \nletting the child do what she did, say, or for his poor \nparenting. And the accomplice is being held responsible, not for what \nthe criminal did, but for what the accomplice did in aiding the \ncriminal. So in both cases there is some properly specified action \nfor which it seems only the person identical to the actor may be held\nresponsible.\n\n\nNevertheless, there are serious problems with the slogan.  To see why,\nnote that we are looking for an answer to the following question:\nwhat makes a past action my own for purposes of responsibility?\nThe answer given by most theorists, following Locke, is that an action\nis my own just in case I am identical to the person who performed\nit. So what account of personal identity provides the right criterion\nof what makes an action one's own? Locke's memory criterion fails, for\nsome actions can be one's own even if one no longer remembers\nperforming them, due to drunkenness, repression, trauma, or the like\n(Schechtman 2005, 12; see also Bradford and Smith 1979). In addition,\nmemory isn't sufficient for ownership of actions. Were someone else's\nmemory trace of doing something immoral copied into my brain (so that\nI “remembered” that person's action), it would be silly to\nthink that it was mine for purposes of accountability, or that I was\nsomehow thereby identical to the performer of that action (Schechtman\n2005, 12).\n\n\nWhat of the Biological Criterion?  On an application of that view, some\npast action is mine for purposes of accountability just in case I am\nbiologically continuous with its agent.  But this again seems neither\nnecessary nor sufficient for ownership.  Were my cerebrum transplanted\ninto another's biological organism, such that that person were now\nfully psychologically continuous with me, it seems that ownership of\nmy actions would have been transferred as well, such that my cerebrum\ninheritor now is eligible for accountability for my actions, despite\nhis not being biologically continuous with me.  Furthermore, were\nimmoral Johann to enter a fugue state, yielding a biological successor\n(call him Sebastian) who was nevertheless completely psychologically\ndiscontinuous with Johann, it would be hard to believe Sebastian could\ncontinue to be the owner of Johann's actions, despite their biological\ncontinuity (D. Shoemaker 2011).\n\n\nThe natural move, then, is to apply the Psychological Criterion to the\ncriterion of ownership relevant to responsibility (see, e.g., Glannon\n1998, 231, 237–243). This criterion requires a wider variety and a\ngreater number of psychological connections than does the memory\ncriterion, and so it can sidestep the worries attaching to Locke's\naccount, while also emphasizing that psychological, not biological,\nrelations are what matter for responsibility. According to this view,\nthen, some past action is my own (for purposes of accountability) just\nin case the person who performed the action is uniquely\npsychologically continuous with me (where this consists in overlapping\nchains of strong psychological connectedness).\n\n\nNevertheless, this view also has some problems. For one thing, it's\nunclear that psychological continuity alone is sufficient for\nownership. Suppose Johann's fugue state (turning into the\npsychologically very different Sebastian) developed gradually, as the\nresult of a brain tumor.  We still would likely deny that Sebastian is\nthe owner of Johann's actions, despite their now psychological\ncontinuity.  And it also seems possible that psychological continuity\nisn't necessary for ownership either. Suppose someone were to undergo\na brain trauma causing psychological discontinuity. Depending on how\nthe case were filled in, it may be that certain actions performed\nprior to the discontinuity would still be judged hers in the relevant\nsense. As long as they flowed from a central aspect of the agent's\ncharacter that remained in place, we might say, they are properly\nattributable to her regardless of the other psychological\ndiscontinuities that have taken place.\n\n\nIt is in part because of these sorts of worries that Schechtman \nsuggests abandoning the search for identity in the reidentification \nsense in favor of identity in the characterization sense. What we're \nlooking for, after all, is an account of what makes some past action \nmy own. But looking for an answer to this question via something like\nthe Psychological Criterion is too indirect: it has us attributing \nthe action to some past person first and then trying to determine \nwhether or not the person to be assessed as responsible is one and \nthe same as that past agent. But if the action cannot be attributed \nto the allegedly responsible person directly, the relation \nbetween the two person-slices just isn't strong enough to warrant \nresponses like punishment and blame (Schechtman 1996, 90–91; 2005, \n13).\n\n\nNevertheless, all of these theories, including narrative identity, fall prey to the \nfission case. Suppose X were to \nrob a bank and then undergo fission, dividing into Y and \nZ, both of whom were psychologically continuous with \nX. Both Y and Z would seem to remember \nX's theft, they would still be buzzing over the thrill of \nthe getaway chase, they would each have inherited an intention to \nspend the money on wine, women, and song, they would each persist in \nX's beliefs about the justification for the crime, and so \nforth. We would likely think the crime to be properly attributable to\nboth of them, and so hold them both (at least partially) responsible \nfor it. Yet neither could be numerically identical to \nX, and if identity is a necessary condition of \nresponsibility, neither could be morally responsible for his crime. \nBut this seems the wrong answer.\n\n\nThere are two plausible replies, both familiar by now. On the one \nhand, we can go four-dimensionalist (as does Sider 2001a), and hold that \nY and Z are indeed two people who were, \nessentially, present all along, overlapping in all their spatial \nparts during the temporal stage of the life when they were both known\nas “X.” This allows us to preserve the slogan\nthat one person cannot be responsible for the actions of another \n– in other words, it is indeed numerical identity that\nis necessary for responsibility – while also preserving the \nthought that it is the robust psychological relation that obtains \nbetween the various parties that grounds our belief that X \nhas not gotten away with his crime just by undergoing fission.\n\n\nNevertheless, this option has some uncomfortable implications. For \none thing, we think “I” uniquely refers, but \n“I” in X's mouth would, in this case, actually \nbe referring to two people, Y and Z. Or \nperhaps that is not quite right; perhaps instead “I” in \nX's mouth refers to only one person, either \nY or Z. But in that case, no one, not even\n“the” speaker, could possibly know to which one it \nreferred. And there are other worries. For instance, whether or not \nthe pre-fission X consists in two overlapping persons \ndepends entirely on what happens in the future, i.e., on whether or \nnot X goes through with the fission. So if X is \ndriving from the bank to the fission doctor and then gets cold feet, \nthere will be no fission and thus no Y or Z. But \nthen whether or not Y or Z exist at the time of\nX's cold feet depends on whether or not X even\ngets cold feet, which seems, at the very least, quite odd. Whether or\nnot “I” now consist in one or two people should not, we \nwant to say, depend on what happens to “me” in the \nfuture.\n\n\nNow these are just standard puzzles for four-dimensionalism about \npersons (see Olson 1997b, van Inwagen 2002, and the entry on  \n personal identity).\n But there are also puzzles for four-dimensionalism specific to its \ntreatment of the responsibility case. For instance, if responsibility\ndepends on identity, and identity is a transitive relation, then if \nY is responsible for the actions of X (insofar as \nY is unified with X as part of the same \nperson-worm), and Z is responsible for the actions of \nX (insofar as Z is unified with X as part \nof the same person-worm), then wouldn't Y also be \nresponsible for the actions of Z (and vice versa)? Of \ncourse, unity relations are not identity relations, but it is unclear\njust why they do not have to be transitive in the way the identity \nrelation is supposed to be (in Sider 2001a, 203, he simply insists \nthat they do not have to be, without saying why). Furthermore, the \nfour-dimensionalist solution is meant to preserve the commonsense \nslogan, but it does so in virtue of a solution that seems about as\nfar from commonsense as can be. Indeed, the slogan is about the\nresponsibility of persons, but four-dimensionalism offers \nonly a solution regarding the responsibility of \nperson-stages (Ibid.; see also Parfit 1976).\n\n\nA second reply is reductionist, and it simply denies the slogan. \nIn other words, identity is not necessary for moral \nresponsibility. Instead (the reductionist could say), what matters is\npsychological continuity (or connectedness), regardless of whether it\nobtains uniquely. This allows the reductionist to handle the fission \ncase in the following way: while neither Y nor Z is\nidentical with X, both are fully psychologically continuous \nwith him, and insofar as ownership of actions consists in \npsychological continuity with the original agent, and because \nownership is the necessary condition for responsibility, both \nY and Z may be morally responsible for X's\ncrimes.\n\n\nOf course, we already saw some worries attached to a psychological\ncontinuity account of ownership that were unrelated to its being an\naccount of numerical identity (e.g., the gradual fugue of Johann to\nSebastian, and the psychological discontinuity case). Perhaps, though,\nwe could draw from the insights regarding the characterization sense\nof identity in responding to these particular problems, and then\nconstruct an account of ownership relevant to responsibility that is\nutterly divorced from considerations of numerical identity (and\ninsofar as narrative identity depends on numerical identity, it would\nnot be an eligible contender here). Indeed, this might be one way to\nconstrue what those working on responsibility\nand identification are doing (e.g., Frankfurt 1988, 1999;\nTaylor 1983; Watson 1975; Smith 2000; D. Shoemaker 2015). Once the\naccount of ownership were complete, one could then\ncall the view an identity account if one wanted (perhaps\nbeing about practical identity), but this would just be a\nterminological overlay, and it would be clear at that point that the\nessential component of responsibility was not really identity but\nrather ownership.\n(One might wonder what the Anthropological View would say about\nmoral responsibility and personhood. As the theory stands, it does not\nengage directly with this discussion, as it is just about determining\nthe types of entities who are the appropriate targets of\naccountability assessments, and so does not purport to deliver whether\nany individual assessment is appropriate relative to identity.)\n",
    "section_title": "5. Identity and Moral Responsibility",
    "entry_title": "Personal Identity and Ethics",
    "hierarchy_title": "Personal Identity and Ethics || Identity and Moral Responsibility",
    "tokenized_text": [
        "identity",
        "moral",
        "responsibility",
        "identity",
        "moral",
        "responsibility",
        "noted",
        "earlier",
        "locke",
        "thought",
        "personal",
        "identity",
        "relation",
        "effect",
        "accountability",
        "relation",
        "make",
        "t",
        "person",
        "x",
        "t",
        "make",
        "accountable",
        "morally",
        "responsible",
        "x",
        "s",
        "action",
        "general",
        "account",
        "moral",
        "responsibility",
        "wo",
        "nt",
        "without",
        "immmediate",
        "supplementation",
        "various",
        "excuse",
        "eg",
        "brainwashing",
        "involuntary",
        "intoxication",
        "may",
        "serve",
        "get",
        "one",
        "accountability",
        "hook",
        "even",
        "one",
        "identical",
        "original",
        "agent",
        "let",
        "u",
        "suppose",
        "locke",
        "thought",
        "one",
        "accountable",
        "absence",
        "excuse",
        "action",
        "performed",
        "someone",
        "one",
        "identical",
        "true",
        "widespread",
        "agreement",
        "identity",
        "least",
        "necessary",
        "condition",
        "accountability",
        "way",
        "idea",
        "often",
        "expressed",
        "one",
        "responsible",
        "one",
        "s",
        "action",
        "sometimes",
        "put",
        "expansively",
        "responsible",
        "action",
        "responsible",
        "anyone",
        "else",
        "s",
        "action",
        "sider",
        "schechtman",
        "olson",
        "way",
        "putting",
        "matter",
        "supposed",
        "gloss",
        "philosophical",
        "slogan",
        "moral",
        "responsibility",
        "presupposes",
        "personal",
        "identity",
        "butler",
        "reid",
        "degrazia",
        "glannon",
        "parfit",
        "parfit",
        "one",
        "might",
        "think",
        "obvious",
        "counterexample",
        "slogan",
        "parent",
        "sometimes",
        "held",
        "responsible",
        "action",
        "child",
        "accomplice",
        "held",
        "responsible",
        "crime",
        "committed",
        "others",
        "easy",
        "reply",
        "however",
        "case",
        "person",
        "held",
        "responsible",
        "actually",
        "responsible",
        "example",
        "parent",
        "held",
        "responsible",
        "child",
        "action",
        "letting",
        "child",
        "say",
        "poor",
        "parenting",
        "accomplice",
        "held",
        "responsible",
        "criminal",
        "accomplice",
        "aiding",
        "criminal",
        "case",
        "properly",
        "specified",
        "action",
        "seems",
        "person",
        "identical",
        "actor",
        "may",
        "held",
        "responsible",
        "nevertheless",
        "serious",
        "problem",
        "slogan",
        "see",
        "note",
        "looking",
        "answer",
        "following",
        "question",
        "make",
        "past",
        "action",
        "purpose",
        "responsibility",
        "answer",
        "given",
        "theorist",
        "following",
        "locke",
        "action",
        "case",
        "identical",
        "person",
        "performed",
        "account",
        "personal",
        "identity",
        "provides",
        "right",
        "criterion",
        "make",
        "action",
        "one",
        "s",
        "locke",
        "s",
        "memory",
        "criterion",
        "fails",
        "action",
        "one",
        "s",
        "even",
        "one",
        "longer",
        "remembers",
        "performing",
        "due",
        "drunkenness",
        "repression",
        "trauma",
        "like",
        "schechtman",
        "see",
        "also",
        "bradford",
        "smith",
        "addition",
        "memory",
        "nt",
        "sufficient",
        "ownership",
        "action",
        "someone",
        "else",
        "s",
        "memory",
        "trace",
        "something",
        "immoral",
        "copied",
        "brain",
        "remembered",
        "person",
        "s",
        "action",
        "would",
        "silly",
        "think",
        "mine",
        "purpose",
        "accountability",
        "somehow",
        "thereby",
        "identical",
        "performer",
        "action",
        "schechtman",
        "biological",
        "criterion",
        "application",
        "view",
        "past",
        "action",
        "mine",
        "purpose",
        "accountability",
        "case",
        "biologically",
        "continuous",
        "agent",
        "seems",
        "neither",
        "necessary",
        "sufficient",
        "ownership",
        "cerebrum",
        "transplanted",
        "another",
        "s",
        "biological",
        "organism",
        "person",
        "fully",
        "psychologically",
        "continuous",
        "seems",
        "ownership",
        "action",
        "would",
        "transferred",
        "well",
        "cerebrum",
        "inheritor",
        "eligible",
        "accountability",
        "action",
        "despite",
        "biologically",
        "continuous",
        "furthermore",
        "immoral",
        "johann",
        "enter",
        "fugue",
        "state",
        "yielding",
        "biological",
        "successor",
        "call",
        "sebastian",
        "nevertheless",
        "completely",
        "psychologically",
        "discontinuous",
        "johann",
        "would",
        "hard",
        "believe",
        "sebastian",
        "could",
        "continue",
        "owner",
        "johann",
        "s",
        "action",
        "despite",
        "biological",
        "continuity",
        "d",
        "shoemaker",
        "natural",
        "move",
        "apply",
        "psychological",
        "criterion",
        "criterion",
        "ownership",
        "relevant",
        "responsibility",
        "see",
        "eg",
        "glannon",
        "criterion",
        "requires",
        "wider",
        "variety",
        "greater",
        "number",
        "psychological",
        "connection",
        "memory",
        "criterion",
        "sidestep",
        "worry",
        "attaching",
        "locke",
        "s",
        "account",
        "also",
        "emphasizing",
        "psychological",
        "biological",
        "relation",
        "matter",
        "responsibility",
        "according",
        "view",
        "past",
        "action",
        "purpose",
        "accountability",
        "case",
        "person",
        "performed",
        "action",
        "uniquely",
        "psychologically",
        "continuous",
        "consists",
        "overlapping",
        "chain",
        "strong",
        "psychological",
        "connectedness",
        "nevertheless",
        "view",
        "also",
        "problem",
        "one",
        "thing",
        "s",
        "unclear",
        "psychological",
        "continuity",
        "alone",
        "sufficient",
        "ownership",
        "suppose",
        "johann",
        "s",
        "fugue",
        "state",
        "turning",
        "psychologically",
        "different",
        "sebastian",
        "developed",
        "gradually",
        "result",
        "brain",
        "tumor",
        "still",
        "would",
        "likely",
        "deny",
        "sebastian",
        "owner",
        "johann",
        "s",
        "action",
        "despite",
        "psychological",
        "continuity",
        "also",
        "seems",
        "possible",
        "psychological",
        "continuity",
        "nt",
        "necessary",
        "ownership",
        "either",
        "suppose",
        "someone",
        "undergo",
        "brain",
        "trauma",
        "causing",
        "psychological",
        "discontinuity",
        "depending",
        "case",
        "filled",
        "may",
        "certain",
        "action",
        "performed",
        "prior",
        "discontinuity",
        "would",
        "still",
        "judged",
        "relevant",
        "sense",
        "long",
        "flowed",
        "central",
        "aspect",
        "agent",
        "s",
        "character",
        "remained",
        "place",
        "might",
        "say",
        "properly",
        "attributable",
        "regardless",
        "psychological",
        "discontinuity",
        "taken",
        "place",
        "part",
        "sort",
        "worry",
        "schechtman",
        "suggests",
        "abandoning",
        "search",
        "identity",
        "reidentification",
        "sense",
        "favor",
        "identity",
        "characterization",
        "sense",
        "re",
        "looking",
        "account",
        "make",
        "past",
        "action",
        "looking",
        "answer",
        "question",
        "via",
        "something",
        "like",
        "psychological",
        "criterion",
        "indirect",
        "u",
        "attributing",
        "action",
        "past",
        "person",
        "first",
        "trying",
        "determine",
        "whether",
        "person",
        "assessed",
        "responsible",
        "one",
        "past",
        "agent",
        "action",
        "attributed",
        "allegedly",
        "responsible",
        "person",
        "directly",
        "relation",
        "two",
        "personslices",
        "nt",
        "strong",
        "enough",
        "warrant",
        "response",
        "like",
        "punishment",
        "blame",
        "schechtman",
        "nevertheless",
        "theory",
        "including",
        "narrative",
        "identity",
        "fall",
        "prey",
        "fission",
        "case",
        "suppose",
        "x",
        "rob",
        "bank",
        "undergo",
        "fission",
        "dividing",
        "z",
        "psychologically",
        "continuous",
        "x",
        "z",
        "would",
        "seem",
        "remember",
        "x",
        "s",
        "theft",
        "would",
        "still",
        "buzzing",
        "thrill",
        "getaway",
        "chase",
        "would",
        "inherited",
        "intention",
        "spend",
        "money",
        "wine",
        "woman",
        "song",
        "would",
        "persist",
        "x",
        "s",
        "belief",
        "justification",
        "crime",
        "forth",
        "would",
        "likely",
        "think",
        "crime",
        "properly",
        "attributable",
        "hold",
        "least",
        "partially",
        "responsible",
        "yet",
        "neither",
        "could",
        "numerically",
        "identical",
        "x",
        "identity",
        "necessary",
        "condition",
        "responsibility",
        "neither",
        "could",
        "morally",
        "responsible",
        "crime",
        "seems",
        "wrong",
        "answer",
        "two",
        "plausible",
        "reply",
        "familiar",
        "one",
        "hand",
        "go",
        "fourdimensionalist",
        "sider",
        "a",
        "hold",
        "z",
        "indeed",
        "two",
        "people",
        "essentially",
        "present",
        "along",
        "overlapping",
        "spatial",
        "part",
        "temporal",
        "stage",
        "life",
        "known",
        "x",
        "allows",
        "u",
        "preserve",
        "slogan",
        "one",
        "person",
        "responsible",
        "action",
        "another",
        "word",
        "indeed",
        "numerical",
        "identity",
        "necessary",
        "responsibility",
        "also",
        "preserving",
        "thought",
        "robust",
        "psychological",
        "relation",
        "obtains",
        "various",
        "party",
        "ground",
        "belief",
        "x",
        "gotten",
        "away",
        "crime",
        "undergoing",
        "fission",
        "nevertheless",
        "option",
        "uncomfortable",
        "implication",
        "one",
        "thing",
        "think",
        "uniquely",
        "refers",
        "x",
        "s",
        "mouth",
        "would",
        "case",
        "actually",
        "referring",
        "two",
        "people",
        "z",
        "perhaps",
        "quite",
        "right",
        "perhaps",
        "instead",
        "x",
        "s",
        "mouth",
        "refers",
        "one",
        "person",
        "either",
        "z",
        "case",
        "one",
        "even",
        "speaker",
        "could",
        "possibly",
        "know",
        "one",
        "referred",
        "worry",
        "instance",
        "whether",
        "prefission",
        "x",
        "consists",
        "two",
        "overlapping",
        "person",
        "depends",
        "entirely",
        "happens",
        "future",
        "ie",
        "whether",
        "x",
        "go",
        "fission",
        "x",
        "driving",
        "bank",
        "fission",
        "doctor",
        "get",
        "cold",
        "foot",
        "fission",
        "thus",
        "z",
        "whether",
        "z",
        "exist",
        "time",
        "x",
        "s",
        "cold",
        "foot",
        "depends",
        "whether",
        "x",
        "even",
        "get",
        "cold",
        "foot",
        "seems",
        "least",
        "quite",
        "odd",
        "whether",
        "consist",
        "one",
        "two",
        "people",
        "want",
        "say",
        "depend",
        "happens",
        "future",
        "standard",
        "puzzle",
        "fourdimensionalism",
        "person",
        "see",
        "olson",
        "b",
        "van",
        "inwagen",
        "entry",
        "personal",
        "identity",
        "also",
        "puzzle",
        "fourdimensionalism",
        "specific",
        "treatment",
        "responsibility",
        "case",
        "instance",
        "responsibility",
        "depends",
        "identity",
        "identity",
        "transitive",
        "relation",
        "responsible",
        "action",
        "x",
        "insofar",
        "unified",
        "x",
        "part",
        "personworm",
        "z",
        "responsible",
        "action",
        "x",
        "insofar",
        "z",
        "unified",
        "x",
        "part",
        "personworm",
        "would",
        "nt",
        "also",
        "responsible",
        "action",
        "z",
        "vice",
        "versa",
        "course",
        "unity",
        "relation",
        "identity",
        "relation",
        "unclear",
        "transitive",
        "way",
        "identity",
        "relation",
        "supposed",
        "sider",
        "a",
        "simply",
        "insists",
        "without",
        "saying",
        "furthermore",
        "fourdimensionalist",
        "solution",
        "meant",
        "preserve",
        "commonsense",
        "slogan",
        "virtue",
        "solution",
        "seems",
        "far",
        "commonsense",
        "indeed",
        "slogan",
        "responsibility",
        "person",
        "fourdimensionalism",
        "offer",
        "solution",
        "regarding",
        "responsibility",
        "personstages",
        "ibid",
        "see",
        "also",
        "parfit",
        "second",
        "reply",
        "reductionist",
        "simply",
        "denies",
        "slogan",
        "word",
        "identity",
        "necessary",
        "moral",
        "responsibility",
        "instead",
        "reductionist",
        "could",
        "say",
        "matter",
        "psychological",
        "continuity",
        "connectedness",
        "regardless",
        "whether",
        "obtains",
        "uniquely",
        "allows",
        "reductionist",
        "handle",
        "fission",
        "case",
        "following",
        "way",
        "neither",
        "z",
        "identical",
        "x",
        "fully",
        "psychologically",
        "continuous",
        "insofar",
        "ownership",
        "action",
        "consists",
        "psychological",
        "continuity",
        "original",
        "agent",
        "ownership",
        "necessary",
        "condition",
        "responsibility",
        "z",
        "may",
        "morally",
        "responsible",
        "x",
        "s",
        "crime",
        "course",
        "already",
        "saw",
        "worry",
        "attached",
        "psychological",
        "continuity",
        "account",
        "ownership",
        "unrelated",
        "account",
        "numerical",
        "identity",
        "eg",
        "gradual",
        "fugue",
        "johann",
        "sebastian",
        "psychological",
        "discontinuity",
        "case",
        "perhaps",
        "though",
        "could",
        "draw",
        "insight",
        "regarding",
        "characterization",
        "sense",
        "identity",
        "responding",
        "particular",
        "problem",
        "construct",
        "account",
        "ownership",
        "relevant",
        "responsibility",
        "utterly",
        "divorced",
        "consideration",
        "numerical",
        "identity",
        "insofar",
        "narrative",
        "identity",
        "depends",
        "numerical",
        "identity",
        "would",
        "eligible",
        "contender",
        "indeed",
        "might",
        "one",
        "way",
        "construe",
        "working",
        "responsibility",
        "identification",
        "eg",
        "frankfurt",
        "taylor",
        "watson",
        "smith",
        "d",
        "shoemaker",
        "account",
        "ownership",
        "complete",
        "one",
        "could",
        "call",
        "view",
        "identity",
        "account",
        "one",
        "wanted",
        "perhaps",
        "practical",
        "identity",
        "would",
        "terminological",
        "overlay",
        "would",
        "clear",
        "point",
        "essential",
        "component",
        "responsibility",
        "really",
        "identity",
        "rather",
        "ownership",
        "one",
        "might",
        "wonder",
        "anthropological",
        "view",
        "would",
        "say",
        "moral",
        "responsibility",
        "personhood",
        "theory",
        "stand",
        "engage",
        "directly",
        "discussion",
        "determining",
        "type",
        "entity",
        "appropriate",
        "target",
        "accountability",
        "assessment",
        "purport",
        "deliver",
        "whether",
        "individual",
        "assessment",
        "appropriate",
        "relative",
        "identity"
    ]
}