{
    "main_text": "Identity and Applied Ethics || Embryonic Research and Abortion\n6.1 Embryonic Research and Abortion\n\n\nThere are several ways in which personal identity is taken to be \nrelevant to the debates over these topics. Consider first embryos and\nrecent disputes over the morality of stem cell research. The\nmost commonly cited argument against such research is that, in its \nmost promising form, it will involve destruction of two- to \nfive-day-old embryos (in order to harvest their inner cell mass, \nwhich is what is used for the development of stem cells). But because\nhuman beings come into existence at the “moment” of \nconception, embryos are human beings, and insofar as it is prima \nfacie immoral to kill human beings, it is prima facie immoral to kill\nembryos (see, e.g., Peters 2001, 129).\n\n\nReferences to identity in this debate come from objectors to this\nargument, who apply the argument from fission to a real life version\nof it, namely, twinning. An embryo might split any time generally\nbefore the two-week point in fetal development, and those two embryos\ncould develop into fully formed infant twins. The question for the\nadvocate of the above argument to consider is, in such a case, what\nhappens to the original human being, the embryo we will call\nAdam? There are only three possibilities: (a) either Adam survives as\nboth twins, (b) Adam survives only as one or the other of the twins,\nor (c) Adam does not survive. Option (a) cannot be right, given that\nthe twins will live distinct, individual lives, and so will clearly be\ntwo human beings, not one. Option (b) cannot be right, for what\nnon-arbitrary reason could there be for one of the twins to be Adam\nand not the other? They will both be qualitatively identical to Adam,\nafter all. The only remaining option, then, is (c), in which Adam does\nnot survive. But this has two bad implications for the above\nadvocate. First, if it is a tragedy when a human being dies, then\ntwinning involves a tragedy, and Adam's death, it seems, ought to be\nmourned. This seems absurd (McMahan 1995 and 2002, 26; although see\nOderberg 1997 for an embrace of this implication).  Second, if the\nmetaphysical analysis is right, then Adam's death brings about the\nexistence of two new human beings (call them Barney and Claire). But\nthis means that (1) it is not the case that\nall human beings come into existence at conception (some \ncome into existence at twinning), and (2) death can somehow occur \nwith no earthly remains, which is at best odd and at worst false \n(Kuhse and Singer 2002, 190).\n\n\nThere are several possible replies, though. First, it is not clear \nthat the options in twinning are exhausted by the three possibilities\narticulated above. A fourth possible option, it seems, is that of the\nfour-dimensionalist, who can maintain that the embryo is a human \nbeing from the moment of conception by saying that the pre-twinning \ntemporal parts of both Barney and Claire simply overlapped, \ni.e., what we called Adam was really a shared stage in the lives of \nboth Barney and Claire. McMahan, for one, simply dismisses this \npossibility as absurd (McMahan 2002, 26), but it is not clear why, \nespecially given that it is a straightforward application of a \npowerful metaphysical theory that has quite a bit of independent \nsupport (despite having its own set of problems, discussed earlier). \nSecond, the implications involved may not be as bad as indicated. For\none thing, “death by twinning,” while still a kind of \ndeath, may not be of a kind warranting the same sort of mourning \ntypically expected to accompany regular “bodily” death. \nFurthermore, this kind of ceasing to exist, if it is a different kind\nof event than that of regular death, perhaps should not be expected \nto have the same kind of conditions – like the leaving of \nearthly remains – as regular death either. Consider how we \nthink of the similar “deaths” of splitting amoebas \n(Ibid., 27).\n\n\nTurn now to just one way in which personal identity enters into the \nbroader debate over abortion. Perhaps the most famous anti-abortion \nargument in the philosophical literature comes from Don Marquis, who \nargues that, because it is prima facie wrong to kill any entity with \na future like ours, and because a fetus has a future like ours, it is\nprima facie wrong to kill a fetus (Marquis 1989). Peter McInerney and\nothers, however, have denied that fetuses have futures like ours by \nappealing to considerations of identity. To have a future like ours, \nfor instance, presupposes that one is identical to some person who \nwill experience said future. But a fetus is not a person, it seems, \nand so it cannot be identical to any future person. Indeed, none of \nthe relations deemed relevant to the identity of persons are \npresent between a fetus and anything else, simply because a fetus \nlacks a psychology with memories, beliefs, desires, intentions, and a\ngeneral character capable of establishing any sort of plausible \nconnection to a future experiencer, so that any experiences that \nexperiencer undergoes cannot be the fetus's future \nexperiences (McInerney 1990, Brill 2003). (The same point might be \ntrue as well for infants, but instead of taking that to be a \nreductio of the objection, one might also quite plausibly take\nit simply to be a point in favor of rejecting Marquis's criterion of \nthe wrongness of killing: given that infants also lack a future like \nours, Marquis's account is substantially incomplete, for it fails to \nexplain why killing infants is wrong, when it obviously is.)\n\n\nThis objection assumes a purely psychological criterion of identity, \nhowever, one in which, further, “person” is what's known\nas a substance concept, a term designating a kind to which an \nindividual always and essentially belongs throughout its existence. \nBut as we saw earlier, “person” might be merely a  \nphase sortal, designating a kind to which the individual belongs\n– if it does at all – for only part of its existence. \nThis could mean, then, that I, now a person, could still be \nidentical qua individual, to some organism – a fetus, \nsay – that was not a person. Thus if some past fetus is \nidentical to me – if we are one and the same animal, or \norganism – then he did indeed have a future like ours (Marquis \n1998).\n\n\nClearly, though, if it is identity alone that renders a future\nexperiencer's experiences mine, then the view runs into\ndifficulty when, once more, we consider the possibility of fission.\nIf I undergo fission, then, given the standard arguments, I will not\nsurvive (setting four-dimensionalist considerations aside).\nNevertheless, surely we want to say that I still have a\nvaluable future – indeed, it is overwhelmingly plausible to say\nI will have  two valuable futures. This only makes sense,\nthough, if we prize apart the having of a valuable future from the\nobtaining of the (numerical) identity relation (for resistance to this\npoint, see Heathwood 2011). If we do so, though, we are insisting that\nthe relations that matter in the having of a valuable future are\ndefinitely psychological, in which case, even if I am\nidentical with some past fetus (qua organism or animal), that\nis irrelevant: what matters in the having of a valuable\nfuture does not obtain between us, so while a fetus has a future, it\nreally does not have a future like ours.\n\n\nA third kind of stance taken regarding identity and abortion is that \nthere just is no relation of significance between them. Earl\nConee argues in this way, insisting that the four main attempts to \nbolster some view about abortion with metaphysical conclusions fail, \nand thus that the metaphysics simply makes no moral difference, a \nconclusion “indicative of a general epistemic irrelevance of \nmetaphysics to the moral issue” (Conee 1999, 619). But just \nbecause the various arguments fail (and Conee seems right about \nthat), it does not yet follow that metaphysics generally makes no \nmoral difference to questions about fetuses and embryos; indeed, we \nhave just discussed two cases in which it clearly does. As Timothy \nChappell puts it, Conee “does nothing to show that the \nright metaphysical doctrines – combined of course with\nthe right moral doctrines – could not give us genuine reason to\nturn one way rather than the other in debates about abortion, or \nother similar debates about the extent of the moral community” \n(Chappell 2000, 279). And so it is to one of those “similar \ndebates,” this time regarding the other end of life, that we \nnow turn.\n",
    "section_title": "6.1 Embryonic Research and Abortion",
    "entry_title": "Personal Identity and Ethics",
    "hierarchy_title": "Personal Identity and Ethics || Identity and Applied Ethics || Embryonic Research and Abortion",
    "tokenized_text": [
        "identity",
        "applied",
        "ethic",
        "embryonic",
        "research",
        "abortion",
        "embryonic",
        "research",
        "abortion",
        "several",
        "way",
        "personal",
        "identity",
        "taken",
        "relevant",
        "debate",
        "topic",
        "consider",
        "first",
        "embryo",
        "recent",
        "dispute",
        "morality",
        "stem",
        "cell",
        "research",
        "commonly",
        "cited",
        "argument",
        "research",
        "promising",
        "form",
        "involve",
        "destruction",
        "two",
        "fivedayold",
        "embryo",
        "order",
        "harvest",
        "inner",
        "cell",
        "mass",
        "used",
        "development",
        "stem",
        "cell",
        "human",
        "being",
        "come",
        "existence",
        "moment",
        "conception",
        "embryo",
        "human",
        "being",
        "insofar",
        "prima",
        "facie",
        "immoral",
        "kill",
        "human",
        "being",
        "prima",
        "facie",
        "immoral",
        "kill",
        "embryo",
        "see",
        "eg",
        "peter",
        "reference",
        "identity",
        "debate",
        "come",
        "objector",
        "argument",
        "apply",
        "argument",
        "fission",
        "real",
        "life",
        "version",
        "namely",
        "twinning",
        "embryo",
        "might",
        "split",
        "time",
        "generally",
        "twoweek",
        "point",
        "fetal",
        "development",
        "two",
        "embryo",
        "could",
        "develop",
        "fully",
        "formed",
        "infant",
        "twin",
        "question",
        "advocate",
        "argument",
        "consider",
        "case",
        "happens",
        "original",
        "human",
        "embryo",
        "call",
        "adam",
        "three",
        "possibility",
        "either",
        "adam",
        "survives",
        "twin",
        "b",
        "adam",
        "survives",
        "one",
        "twin",
        "c",
        "adam",
        "survive",
        "option",
        "right",
        "given",
        "twin",
        "live",
        "distinct",
        "individual",
        "life",
        "clearly",
        "two",
        "human",
        "being",
        "one",
        "option",
        "b",
        "right",
        "nonarbitrary",
        "reason",
        "could",
        "one",
        "twin",
        "adam",
        "qualitatively",
        "identical",
        "adam",
        "remaining",
        "option",
        "c",
        "adam",
        "survive",
        "two",
        "bad",
        "implication",
        "advocate",
        "first",
        "tragedy",
        "human",
        "dy",
        "twinning",
        "involves",
        "tragedy",
        "adam",
        "s",
        "death",
        "seems",
        "ought",
        "mourned",
        "seems",
        "absurd",
        "mcmahan",
        "although",
        "see",
        "oderberg",
        "embrace",
        "implication",
        "second",
        "metaphysical",
        "analysis",
        "right",
        "adam",
        "s",
        "death",
        "brings",
        "existence",
        "two",
        "new",
        "human",
        "being",
        "call",
        "barney",
        "claire",
        "mean",
        "case",
        "human",
        "being",
        "come",
        "existence",
        "conception",
        "come",
        "existence",
        "twinning",
        "death",
        "somehow",
        "occur",
        "earthly",
        "remains",
        "best",
        "odd",
        "worst",
        "false",
        "kuhse",
        "singer",
        "several",
        "possible",
        "reply",
        "though",
        "first",
        "clear",
        "option",
        "twinning",
        "exhausted",
        "three",
        "possibility",
        "articulated",
        "fourth",
        "possible",
        "option",
        "seems",
        "fourdimensionalist",
        "maintain",
        "embryo",
        "human",
        "moment",
        "conception",
        "saying",
        "pretwinning",
        "temporal",
        "part",
        "barney",
        "claire",
        "simply",
        "overlapped",
        "ie",
        "called",
        "adam",
        "really",
        "shared",
        "stage",
        "life",
        "barney",
        "claire",
        "mcmahan",
        "one",
        "simply",
        "dismisses",
        "possibility",
        "absurd",
        "mcmahan",
        "clear",
        "especially",
        "given",
        "straightforward",
        "application",
        "powerful",
        "metaphysical",
        "theory",
        "quite",
        "bit",
        "independent",
        "support",
        "despite",
        "set",
        "problem",
        "discussed",
        "earlier",
        "second",
        "implication",
        "involved",
        "may",
        "bad",
        "indicated",
        "one",
        "thing",
        "death",
        "twinning",
        "still",
        "kind",
        "death",
        "may",
        "kind",
        "warranting",
        "sort",
        "mourning",
        "typically",
        "expected",
        "accompany",
        "regular",
        "bodily",
        "death",
        "furthermore",
        "kind",
        "ceasing",
        "exist",
        "different",
        "kind",
        "event",
        "regular",
        "death",
        "perhaps",
        "expected",
        "kind",
        "condition",
        "like",
        "leaving",
        "earthly",
        "remains",
        "regular",
        "death",
        "either",
        "consider",
        "think",
        "similar",
        "death",
        "splitting",
        "amoeba",
        "ibid",
        "turn",
        "one",
        "way",
        "personal",
        "identity",
        "enters",
        "broader",
        "debate",
        "abortion",
        "perhaps",
        "famous",
        "antiabortion",
        "argument",
        "philosophical",
        "literature",
        "come",
        "marquis",
        "argues",
        "prima",
        "facie",
        "wrong",
        "kill",
        "entity",
        "future",
        "like",
        "fetus",
        "future",
        "like",
        "prima",
        "facie",
        "wrong",
        "kill",
        "fetus",
        "marquis",
        "peter",
        "mcinerney",
        "others",
        "however",
        "denied",
        "fetus",
        "future",
        "like",
        "appealing",
        "consideration",
        "identity",
        "future",
        "like",
        "instance",
        "presupposes",
        "one",
        "identical",
        "person",
        "experience",
        "said",
        "future",
        "fetus",
        "person",
        "seems",
        "identical",
        "future",
        "person",
        "indeed",
        "none",
        "relation",
        "deemed",
        "relevant",
        "identity",
        "person",
        "present",
        "fetus",
        "anything",
        "else",
        "simply",
        "fetus",
        "lack",
        "psychology",
        "memory",
        "belief",
        "desire",
        "intention",
        "general",
        "character",
        "capable",
        "establishing",
        "sort",
        "plausible",
        "connection",
        "future",
        "experiencer",
        "experience",
        "experiencer",
        "undergoes",
        "fetus",
        "s",
        "future",
        "experience",
        "mcinerney",
        "brill",
        "point",
        "might",
        "true",
        "well",
        "infant",
        "instead",
        "taking",
        "reductio",
        "objection",
        "one",
        "might",
        "also",
        "quite",
        "plausibly",
        "take",
        "simply",
        "point",
        "favor",
        "rejecting",
        "marquis",
        "s",
        "criterion",
        "wrongness",
        "killing",
        "given",
        "infant",
        "also",
        "lack",
        "future",
        "like",
        "marquis",
        "s",
        "account",
        "substantially",
        "incomplete",
        "fails",
        "explain",
        "killing",
        "infant",
        "wrong",
        "obviously",
        "objection",
        "assumes",
        "purely",
        "psychological",
        "criterion",
        "identity",
        "however",
        "one",
        "person",
        "s",
        "known",
        "substance",
        "concept",
        "term",
        "designating",
        "kind",
        "individual",
        "always",
        "essentially",
        "belongs",
        "throughout",
        "existence",
        "saw",
        "earlier",
        "person",
        "might",
        "merely",
        "phase",
        "sortal",
        "designating",
        "kind",
        "individual",
        "belongs",
        "part",
        "existence",
        "could",
        "mean",
        "person",
        "could",
        "still",
        "identical",
        "qua",
        "individual",
        "organism",
        "fetus",
        "say",
        "person",
        "thus",
        "past",
        "fetus",
        "identical",
        "one",
        "animal",
        "organism",
        "indeed",
        "future",
        "like",
        "marquis",
        "clearly",
        "though",
        "identity",
        "alone",
        "render",
        "future",
        "experiencer",
        "s",
        "experience",
        "mine",
        "view",
        "run",
        "difficulty",
        "consider",
        "possibility",
        "fission",
        "undergo",
        "fission",
        "given",
        "standard",
        "argument",
        "survive",
        "setting",
        "fourdimensionalist",
        "consideration",
        "aside",
        "nevertheless",
        "surely",
        "want",
        "say",
        "still",
        "valuable",
        "future",
        "indeed",
        "overwhelmingly",
        "plausible",
        "say",
        "two",
        "valuable",
        "future",
        "make",
        "sense",
        "though",
        "prize",
        "apart",
        "valuable",
        "future",
        "obtaining",
        "numerical",
        "identity",
        "relation",
        "resistance",
        "point",
        "see",
        "heathwood",
        "though",
        "insisting",
        "relation",
        "matter",
        "valuable",
        "future",
        "definitely",
        "psychological",
        "case",
        "even",
        "identical",
        "past",
        "fetus",
        "qua",
        "organism",
        "animal",
        "irrelevant",
        "matter",
        "valuable",
        "future",
        "obtain",
        "u",
        "fetus",
        "future",
        "really",
        "future",
        "like",
        "third",
        "kind",
        "stance",
        "taken",
        "regarding",
        "identity",
        "abortion",
        "relation",
        "significance",
        "earl",
        "conee",
        "argues",
        "way",
        "insisting",
        "four",
        "main",
        "attempt",
        "bolster",
        "view",
        "abortion",
        "metaphysical",
        "conclusion",
        "fail",
        "thus",
        "metaphysics",
        "simply",
        "make",
        "moral",
        "difference",
        "conclusion",
        "indicative",
        "general",
        "epistemic",
        "irrelevance",
        "metaphysics",
        "moral",
        "issue",
        "conee",
        "various",
        "argument",
        "fail",
        "conee",
        "seems",
        "right",
        "yet",
        "follow",
        "metaphysics",
        "generally",
        "make",
        "moral",
        "difference",
        "question",
        "fetus",
        "embryo",
        "indeed",
        "discussed",
        "two",
        "case",
        "clearly",
        "timothy",
        "chappell",
        "put",
        "conee",
        "nothing",
        "show",
        "right",
        "metaphysical",
        "doctrine",
        "combined",
        "course",
        "right",
        "moral",
        "doctrine",
        "could",
        "give",
        "u",
        "genuine",
        "reason",
        "turn",
        "one",
        "way",
        "rather",
        "debate",
        "abortion",
        "similar",
        "debate",
        "extent",
        "moral",
        "community",
        "chappell",
        "one",
        "similar",
        "debate",
        "time",
        "regarding",
        "end",
        "life",
        "turn"
    ]
}