{
    "main_text": "Organism-Level Functions of the Immune System || Synchronic identity\n2.2 Synchronic identity\n\nWhile diachronic identity of an organism is understood as its\npersistence though time, synchronic identity is defined in\nterms of its individuality or distinctiveness (Sober 2000: 154).\nAttempts have been made to identify distinguishing characteristics\nsuch as functional autonomy, possession of mutually interdependent\nparts, genetic homogeneity and spatial boundaries (Clarke 2010).\nOthers, pointing to the heterogeneous character of biological\nindividuals, have argued that no sole feature can serve as a universal\ndeterminant of individuality (see the entry on\n the biological notion of individual).\n Part of the contention resides in differing frames of reference of\nstudy: Most considerations of synchronic individuality focus upon\nevolutionary individuals as units of selection (Gould and\nLloyd 1999) that differs from how physiological individuals\nmight be distinguished (Pradeu 2016). Regardless of their involvement\nin evolution, organisms exhibit various levels of physiological and\nmorphological integration that makes their indivisibility problematic\n(Godfrey-Smith 2009). Immunology contributes to discussions of\nindividuality in this latter sense by considering the role of the\nimmune system in defining the boundaries of the organism by the\nfunctional measures of rejection or assimilation.\n\nPradeu formulated such criteria and proposed that the immune system\nplays the central role in determining what is included in the organism\nand what is not (Pradeu 2012). The differentiation is based on his\ncontinuity/discontinuity model, which depicts the immune system\nreacting to transient alterations in the pattern of antigen receptor\ninteractions and tolerates long-lasting modifications (Pradeu, Jaeger,\n& Vivier 2013; Pradeu & Carosella 2006a: 241, 2006b). Such a\nmechanism is based on recognizing that autoimmunity is a normal\nfunction of immunity (Tauber 2015). Because host antigens do not evoke\nan immune response, a stable, “continuity” of immune\ninteractions establishes an activation threshold that initiates an\nimmune response only upon a rapid increase in antigenic load. The\nimmune system thus distinguishes the stable state of tolerant\nrecognition of tonic signals arising from normal physiological process\nin contrast to the appearance of novel antigens, for example, arising\nfrom pathogen invasion or tissue injury (Grossman and Paul 1992;\nMyers, Zikherman and Roose 2017; Pradeu 2012: 246; Grossman 2019).\nThus the development of tolerance to frequently encountered antigens,\ncommensals, tissue grafts and anastomosed animals results in the\nestablishment of stable, integrated associations mediated by low-grade\nimmune interactions (Pradeu and Carosella 2006a, 2006b; Pradeu 2012:\n251–252). In this formulation, the immune system plays a central\nrole in defining an individual by permitting beneficial physiological\ninclusion of heterologous components.\n\nOthers refer to these stable immune interactions with microbiota to\ndeny that organisms are individuals (S. Gilbert, Sapp, and\nTauber 2012). Appreciating the ubiquity of symbiosis, the immune\nsystem from this point of view becomes a key mediator of the holobiont\nby tolerating and coordinating microbial-host relationships. On this\nbasis, these critics highlight that most of these interactions fall on\na dynamic spectrum of rejection and acceptance making it impossible,\nin principle, to determine the boundaries of individuality.\nSymbiotic interactions do not conform to a simple acceptance-rejection\nmodel. Rather, to attune its responses to microbial signals the immune\nsystem launches a broad spectrum of T-cell reactions in combination\nwith a variety of innate immune and tissue cell-derived signals\n(cytokines, hormones, neurotransmitters) in combination with complex\nregulatory controls (Eberl 2016). As suggested by Cohen, immunity is\nthe product of an active computational state that constantly assesses\nthe state of the organism’s internal state and the surroundings\nin which it lives (Cohen 2007a, 2007b). In the context of such fluid\nactivity, transitioning from one unique activation state to another\ndoes not allow definitive delineation of organismal borders. Instead,\nthe immune system acts as gatekeeper that controls the apparent\nboundary between the organism and its environment (Tauber 2008: 231; Tauber 2017; S. Gilbert, Sapp, and Tauber 2012). From this perspective, the view of immunity as protecting insularity shifts to recognizing its role in establishing and maintaining communal\nrelationships that blur the distinction of an atomistic\ninsular individuality (Skillings 2016).\n\nThe self/nonself, tolerance/response dichotomies collapse altogether,\nwhen considered in the context of mammalian pregnancy, where various\nmodalities are employed to preserve the temporary immune sanctuary of\nthe ‘foreign’ fetus (Howes 2007; A. Martin 2010). Studies\nof immune-mediated exchanges between the mother and the fetus not only\nchallenge our view of immunity as concerned with rejection and\ndefense, but also transform our understanding of biological\nindividuality (Erlebacher 2013; Howes 2008). More specifically, recent\nstudies undermine the vision of the maternal immune system as\nantagonistic to the fetus and rather point to active immune\nparticipation in the formation of an amalgamated maternal-fetal\nindividual, whose ontological status lies at the continuum between\nunification and distinctiveness (Howes 2008). Delineation of the role\nof inflammation during blastocyst implantation further supports this\ninteractive vision, demonstrating that instead of acting as a\nrejection response, inflammation promotes a mutually tolerant fusion\nbetween the embryo and the mother (Griffith et al. 2017; Mor, Aldo,\nand Alvero 2017). Indeed, the transformation of an\ninflammation-induced reaction pathway into a cell differentiation\npathway in decidual stromal cells exhibits the intimate connection of\nthe immune and reproductive systems in eutherians (G. Wagner,\nErkenbrack, and Love 2019; Nuño de la Rosa, Pavlicev, and\nEtxeberria 2019, in Other Internet Resources).\n\nIn conclusion, despite significant contributions of philosophy of\nimmunology to debates about identity, no straightforward answer to the\nquestion of how the immune system contributes to biological\nindividuality has been offered. Considering the actual\nindividualization practices in various fields of biology, it may well\nbe concluded that no single account of the biological individual\nsuffices and that the question of whether particular criteria are\nvalid or not depends on the research perspective adopted. Part of the\nconundrum may lie in the efforts to consider the issue at the\nmetaphysical, rather than at the epistemological level (Love 2018,\nLove and Brigandt 2017). As discussed below, the status of the\n“immune self” is a fecund case in point.\n 2.3 The immune self\n\nWide use of the self/nonself distinction in different clinical and\nresearch traditions (provided by the relaxed and varied meanings\nassociated with its use) has established such discrimination as the\ngoverning construct of the science (e.g., Howes 2010; Hoffman 2012;\nCohn 2015). Indeed, the “immune self” has served as\nimmunology’s foundational concept to order immune theorizing for\nthe past 70 years (Burnet and Fenner 1949; Tauber 1994). However,\ndespite the paradigm’s established standing, definition of\nimmune identity has proven elusive. As discussed above (section 2.1),\nbecause of fluctuations of immune activity over the lifespan of the\norganism, conceptualizing and modeling active tolerance have yet to\nyield criteria for defining stable identity (Bilate and LaFaille\n2012). Moreover, a consensus definition of selfhood has remained\nelusive inasmuch as different investigative frameworks promote\ndiffering characteristics of immune identity based on their respective\nstructural and functional criteria (Matzinger 1994). Critics have\ntherefore questioned the immune self’s standing and utility\n(e.g., Matzinger 1994; Tauber 2000; Pradeu 2012). The latter position\nargues that the “self” might be better regarded as only a\nmetaphor for a “figure” outlined by the immune\nsystem’s silence, i.e., its non-reactivity. Such a functionally\nflexible definition has been resisted. Defenders argue that the notion\nof stabilized discrimination correctly depicts the immune\nsystem’s organizing functions (which converge on defending a\nwell-demarcated organism), and that efforts to eliminate or modify\nthis metaphor are misguided attempts to “police” borders\nbetween science and culture (Anderson 2014; Hoffman 2012). Drawing\nfrom the philosophical canon, Howes referred to Hume to argue that\nrealism about self (immune or otherwise) can be saved despite the\ndependency of context and the ever-changing character of the\npostulated ego (Howes 1998). She suggested that the efforts to deny\nthe reality of the self are based on its non-substantial character and\nthus reflects entrenched substantialist assumptions. She proposed that\na middle ground exists between substantial self and no-self by\nadopting a processual, understanding of selfhood (Howes 1999).\n\nWhile the standing of the immune self has remained contentious,\nepistemological ambiguity and flexible polysemy has proven effective\nin sustaining the term’s powerful heuristic value as an\nidiom with many uses and meanings (Crist and Tauber 2000).\nIts versatility and pragmatic utility have effectively integrated\nclinical immune phenomena by highlighting the essential similarity or\ninterconnectedness of diverse immune-mediated processes in response to\nvarious clinical challenges. Thus nutrition, allergy, infection,\nautoimmune disease, various phenomena of tolerance, natural or\nexperimentally created chimeras (transplantation), and autoimmunity\nall become conceived as a network of interlinked or interrelated\nfunctions subject to evolutionary transformation and adaption. As\nthese topics mirror and play off one another under the rubric of\nselfhood, immunologists have a ready means by which to represent\nstates or processes that arise in the various interactions between the\norganism and its environment at different evolutionary stages and\ndevelopment.\n\nFinally, the self’s appearance in immunology served as a readily\nunderstood shorthand reference to personal identity, and the efforts\nto substantiate that extrapolation on its own terms guided the\ndiscipline for the latter half of the twentieth century (for\nhistorical case studies see Löwy 1991). After all, beyond the\nexperimental science, the interpretative context of immune selfhood\ndraws from wider social meanings of individuality and insularity\n(Tauber 2016; see below, section 5.0). The autonomous construction of\nidentity resonates with Western civic ideals and in turn supports them\nby melding laboratory findings with various extrapolated or borrowed\nphilosophical, political and psychological formulations of human\nagency. And conversely, immunology has been studied as a source of\nimportant metaphors and other tropes feeding back on the\nscience’s supporting culture to transform understanding of\nagency and communal relationships (discussed below, section 5.0).\n",
    "section_title": "2.2 Synchronic identity",
    "entry_title": "Philosophy of Immunology",
    "hierarchy_title": "Philosophy of Immunology || Organism-Level Functions of the Immune System || Synchronic identity",
    "tokenized_text": [
        "organismlevel",
        "function",
        "immune",
        "system",
        "synchronic",
        "identity",
        "synchronic",
        "identity",
        "diachronic",
        "identity",
        "organism",
        "understood",
        "persistence",
        "though",
        "time",
        "synchronic",
        "identity",
        "defined",
        "term",
        "individuality",
        "distinctiveness",
        "sober",
        "attempt",
        "made",
        "identify",
        "distinguishing",
        "characteristic",
        "functional",
        "autonomy",
        "possession",
        "mutually",
        "interdependent",
        "part",
        "genetic",
        "homogeneity",
        "spatial",
        "boundary",
        "clarke",
        "others",
        "pointing",
        "heterogeneous",
        "character",
        "biological",
        "individual",
        "argued",
        "sole",
        "feature",
        "serve",
        "universal",
        "determinant",
        "individuality",
        "see",
        "entry",
        "biological",
        "notion",
        "individual",
        "part",
        "contention",
        "resides",
        "differing",
        "frame",
        "reference",
        "study",
        "consideration",
        "synchronic",
        "individuality",
        "focus",
        "upon",
        "evolutionary",
        "individual",
        "unit",
        "selection",
        "gould",
        "lloyd",
        "differs",
        "physiological",
        "individual",
        "might",
        "distinguished",
        "pradeu",
        "regardless",
        "involvement",
        "evolution",
        "organism",
        "exhibit",
        "various",
        "level",
        "physiological",
        "morphological",
        "integration",
        "make",
        "indivisibility",
        "problematic",
        "godfreysmith",
        "immunology",
        "contributes",
        "discussion",
        "individuality",
        "latter",
        "sense",
        "considering",
        "role",
        "immune",
        "system",
        "defining",
        "boundary",
        "organism",
        "functional",
        "measure",
        "rejection",
        "assimilation",
        "pradeu",
        "formulated",
        "criterion",
        "proposed",
        "immune",
        "system",
        "play",
        "central",
        "role",
        "determining",
        "included",
        "organism",
        "pradeu",
        "differentiation",
        "based",
        "continuitydiscontinuity",
        "model",
        "depicts",
        "immune",
        "system",
        "reacting",
        "transient",
        "alteration",
        "pattern",
        "antigen",
        "receptor",
        "interaction",
        "tolerates",
        "longlasting",
        "modification",
        "pradeu",
        "jaeger",
        "vivier",
        "pradeu",
        "carosella",
        "a",
        "b",
        "mechanism",
        "based",
        "recognizing",
        "autoimmunity",
        "normal",
        "function",
        "immunity",
        "tauber",
        "host",
        "antigen",
        "evoke",
        "immune",
        "response",
        "stable",
        "continuity",
        "immune",
        "interaction",
        "establishes",
        "activation",
        "threshold",
        "initiate",
        "immune",
        "response",
        "upon",
        "rapid",
        "increase",
        "antigenic",
        "load",
        "immune",
        "system",
        "thus",
        "distinguishes",
        "stable",
        "state",
        "tolerant",
        "recognition",
        "tonic",
        "signal",
        "arising",
        "normal",
        "physiological",
        "process",
        "contrast",
        "appearance",
        "novel",
        "antigen",
        "example",
        "arising",
        "pathogen",
        "invasion",
        "tissue",
        "injury",
        "grossman",
        "paul",
        "myers",
        "zikherman",
        "roose",
        "pradeu",
        "grossman",
        "thus",
        "development",
        "tolerance",
        "frequently",
        "encountered",
        "antigen",
        "commensal",
        "tissue",
        "graft",
        "anastomosed",
        "animal",
        "result",
        "establishment",
        "stable",
        "integrated",
        "association",
        "mediated",
        "lowgrade",
        "immune",
        "interaction",
        "pradeu",
        "carosella",
        "a",
        "b",
        "pradeu",
        "formulation",
        "immune",
        "system",
        "play",
        "central",
        "role",
        "defining",
        "individual",
        "permitting",
        "beneficial",
        "physiological",
        "inclusion",
        "heterologous",
        "component",
        "others",
        "refer",
        "stable",
        "immune",
        "interaction",
        "microbiota",
        "deny",
        "organism",
        "individual",
        "s",
        "gilbert",
        "sapp",
        "tauber",
        "appreciating",
        "ubiquity",
        "symbiosis",
        "immune",
        "system",
        "point",
        "view",
        "becomes",
        "key",
        "mediator",
        "holobiont",
        "tolerating",
        "coordinating",
        "microbialhost",
        "relationship",
        "basis",
        "critic",
        "highlight",
        "interaction",
        "fall",
        "dynamic",
        "spectrum",
        "rejection",
        "acceptance",
        "making",
        "impossible",
        "principle",
        "determine",
        "boundary",
        "individuality",
        "symbiotic",
        "interaction",
        "conform",
        "simple",
        "acceptancerejection",
        "model",
        "rather",
        "attune",
        "response",
        "microbial",
        "signal",
        "immune",
        "system",
        "launch",
        "broad",
        "spectrum",
        "tcell",
        "reaction",
        "combination",
        "variety",
        "innate",
        "immune",
        "tissue",
        "cellderived",
        "signal",
        "cytokine",
        "hormone",
        "neurotransmitter",
        "combination",
        "complex",
        "regulatory",
        "control",
        "eberl",
        "suggested",
        "cohen",
        "immunity",
        "product",
        "active",
        "computational",
        "state",
        "constantly",
        "ass",
        "state",
        "organism",
        "internal",
        "state",
        "surroundings",
        "life",
        "cohen",
        "a",
        "b",
        "context",
        "fluid",
        "activity",
        "transitioning",
        "one",
        "unique",
        "activation",
        "state",
        "another",
        "allow",
        "definitive",
        "delineation",
        "organismal",
        "border",
        "instead",
        "immune",
        "system",
        "act",
        "gatekeeper",
        "control",
        "apparent",
        "boundary",
        "organism",
        "environment",
        "tauber",
        "tauber",
        "s",
        "gilbert",
        "sapp",
        "tauber",
        "perspective",
        "view",
        "immunity",
        "protecting",
        "insularity",
        "shift",
        "recognizing",
        "role",
        "establishing",
        "maintaining",
        "communal",
        "relationship",
        "blur",
        "distinction",
        "atomistic",
        "insular",
        "individuality",
        "skillings",
        "selfnonself",
        "toleranceresponse",
        "dichotomy",
        "collapse",
        "altogether",
        "considered",
        "context",
        "mammalian",
        "pregnancy",
        "various",
        "modality",
        "employed",
        "preserve",
        "temporary",
        "immune",
        "sanctuary",
        "foreign",
        "fetus",
        "howe",
        "a",
        "martin",
        "study",
        "immunemediated",
        "exchange",
        "mother",
        "fetus",
        "challenge",
        "view",
        "immunity",
        "concerned",
        "rejection",
        "defense",
        "also",
        "transform",
        "understanding",
        "biological",
        "individuality",
        "erlebacher",
        "howe",
        "specifically",
        "recent",
        "study",
        "undermine",
        "vision",
        "maternal",
        "immune",
        "system",
        "antagonistic",
        "fetus",
        "rather",
        "point",
        "active",
        "immune",
        "participation",
        "formation",
        "amalgamated",
        "maternalfetal",
        "individual",
        "whose",
        "ontological",
        "status",
        "lie",
        "continuum",
        "unification",
        "distinctiveness",
        "howe",
        "delineation",
        "role",
        "inflammation",
        "blastocyst",
        "implantation",
        "support",
        "interactive",
        "vision",
        "demonstrating",
        "instead",
        "acting",
        "rejection",
        "response",
        "inflammation",
        "promotes",
        "mutually",
        "tolerant",
        "fusion",
        "embryo",
        "mother",
        "griffith",
        "et",
        "al",
        "mor",
        "aldo",
        "alvero",
        "indeed",
        "transformation",
        "inflammationinduced",
        "reaction",
        "pathway",
        "cell",
        "differentiation",
        "pathway",
        "decidual",
        "stromal",
        "cell",
        "exhibit",
        "intimate",
        "connection",
        "immune",
        "reproductive",
        "system",
        "eutherian",
        "g",
        "wagner",
        "erkenbrack",
        "love",
        "nuño",
        "de",
        "la",
        "rosa",
        "pavlicev",
        "etxeberria",
        "internet",
        "resource",
        "conclusion",
        "despite",
        "significant",
        "contribution",
        "philosophy",
        "immunology",
        "debate",
        "identity",
        "straightforward",
        "answer",
        "question",
        "immune",
        "system",
        "contributes",
        "biological",
        "individuality",
        "offered",
        "considering",
        "actual",
        "individualization",
        "practice",
        "various",
        "field",
        "biology",
        "may",
        "well",
        "concluded",
        "single",
        "account",
        "biological",
        "individual",
        "suffices",
        "question",
        "whether",
        "particular",
        "criterion",
        "valid",
        "depends",
        "research",
        "perspective",
        "adopted",
        "part",
        "conundrum",
        "may",
        "lie",
        "effort",
        "consider",
        "issue",
        "metaphysical",
        "rather",
        "epistemological",
        "level",
        "love",
        "love",
        "brigandt",
        "discussed",
        "status",
        "immune",
        "self",
        "fecund",
        "case",
        "point",
        "immune",
        "self",
        "wide",
        "use",
        "selfnonself",
        "distinction",
        "different",
        "clinical",
        "research",
        "tradition",
        "provided",
        "relaxed",
        "varied",
        "meaning",
        "associated",
        "use",
        "established",
        "discrimination",
        "governing",
        "construct",
        "science",
        "eg",
        "howe",
        "hoffman",
        "cohn",
        "indeed",
        "immune",
        "self",
        "served",
        "immunology",
        "foundational",
        "concept",
        "order",
        "immune",
        "theorizing",
        "past",
        "year",
        "burnet",
        "fenner",
        "tauber",
        "however",
        "despite",
        "paradigm",
        "established",
        "standing",
        "definition",
        "immune",
        "identity",
        "proven",
        "elusive",
        "discussed",
        "section",
        "fluctuation",
        "immune",
        "activity",
        "lifespan",
        "organism",
        "conceptualizing",
        "modeling",
        "active",
        "tolerance",
        "yet",
        "yield",
        "criterion",
        "defining",
        "stable",
        "identity",
        "bilate",
        "lafaille",
        "moreover",
        "consensus",
        "definition",
        "selfhood",
        "remained",
        "elusive",
        "inasmuch",
        "different",
        "investigative",
        "framework",
        "promote",
        "differing",
        "characteristic",
        "immune",
        "identity",
        "based",
        "respective",
        "structural",
        "functional",
        "criterion",
        "matzinger",
        "critic",
        "therefore",
        "questioned",
        "immune",
        "self",
        "standing",
        "utility",
        "eg",
        "matzinger",
        "tauber",
        "pradeu",
        "latter",
        "position",
        "argues",
        "self",
        "might",
        "better",
        "regarded",
        "metaphor",
        "figure",
        "outlined",
        "immune",
        "system",
        "silence",
        "ie",
        "nonreactivity",
        "functionally",
        "flexible",
        "definition",
        "resisted",
        "defender",
        "argue",
        "notion",
        "stabilized",
        "discrimination",
        "correctly",
        "depicts",
        "immune",
        "system",
        "organizing",
        "function",
        "converge",
        "defending",
        "welldemarcated",
        "organism",
        "effort",
        "eliminate",
        "modify",
        "metaphor",
        "misguided",
        "attempt",
        "police",
        "border",
        "science",
        "culture",
        "anderson",
        "hoffman",
        "drawing",
        "philosophical",
        "canon",
        "howe",
        "referred",
        "hume",
        "argue",
        "realism",
        "self",
        "immune",
        "otherwise",
        "saved",
        "despite",
        "dependency",
        "context",
        "everchanging",
        "character",
        "postulated",
        "ego",
        "howe",
        "suggested",
        "effort",
        "deny",
        "reality",
        "self",
        "based",
        "nonsubstantial",
        "character",
        "thus",
        "reflects",
        "entrenched",
        "substantialist",
        "assumption",
        "proposed",
        "middle",
        "ground",
        "exists",
        "substantial",
        "self",
        "noself",
        "adopting",
        "processual",
        "understanding",
        "selfhood",
        "howe",
        "standing",
        "immune",
        "self",
        "remained",
        "contentious",
        "epistemological",
        "ambiguity",
        "flexible",
        "polysemy",
        "proven",
        "effective",
        "sustaining",
        "term",
        "powerful",
        "heuristic",
        "value",
        "idiom",
        "many",
        "us",
        "meaning",
        "crist",
        "tauber",
        "versatility",
        "pragmatic",
        "utility",
        "effectively",
        "integrated",
        "clinical",
        "immune",
        "phenomenon",
        "highlighting",
        "essential",
        "similarity",
        "interconnectedness",
        "diverse",
        "immunemediated",
        "process",
        "response",
        "various",
        "clinical",
        "challenge",
        "thus",
        "nutrition",
        "allergy",
        "infection",
        "autoimmune",
        "disease",
        "various",
        "phenomenon",
        "tolerance",
        "natural",
        "experimentally",
        "created",
        "chimera",
        "transplantation",
        "autoimmunity",
        "become",
        "conceived",
        "network",
        "interlinked",
        "interrelated",
        "function",
        "subject",
        "evolutionary",
        "transformation",
        "adaption",
        "topic",
        "mirror",
        "play",
        "one",
        "another",
        "rubric",
        "selfhood",
        "immunologist",
        "ready",
        "mean",
        "represent",
        "state",
        "process",
        "arise",
        "various",
        "interaction",
        "organism",
        "environment",
        "different",
        "evolutionary",
        "stage",
        "development",
        "finally",
        "self",
        "appearance",
        "immunology",
        "served",
        "readily",
        "understood",
        "shorthand",
        "reference",
        "personal",
        "identity",
        "effort",
        "substantiate",
        "extrapolation",
        "term",
        "guided",
        "discipline",
        "latter",
        "half",
        "twentieth",
        "century",
        "historical",
        "case",
        "study",
        "see",
        "löwy",
        "beyond",
        "experimental",
        "science",
        "interpretative",
        "context",
        "immune",
        "selfhood",
        "draw",
        "wider",
        "social",
        "meaning",
        "individuality",
        "insularity",
        "tauber",
        "see",
        "section",
        "autonomous",
        "construction",
        "identity",
        "resonates",
        "western",
        "civic",
        "ideal",
        "turn",
        "support",
        "melding",
        "laboratory",
        "finding",
        "various",
        "extrapolated",
        "borrowed",
        "philosophical",
        "political",
        "psychological",
        "formulation",
        "human",
        "agency",
        "conversely",
        "immunology",
        "studied",
        "source",
        "important",
        "metaphor",
        "trope",
        "feeding",
        "back",
        "science",
        "supporting",
        "culture",
        "transform",
        "understanding",
        "agency",
        "communal",
        "relationship",
        "discussed",
        "section"
    ]
}