{
    "main_text": "Impartiality: Its demands and scope || Impartiality, Objectivity, and Neutrality\n5.3 Impartiality, Objectivity, and Neutrality\n\nOne can agree with critics like Young in being skeptical regarding\nnaive interpretations of impartiality without wholeheartedly rejecting\nimpartiality as either unrealistic or undesirable. Even if our ability\nto empathize with others, or to genuinely put ourselves in their\nplace, is limited by psychological constraints, the attempt to do so\nmay represent an ideal that is worth aspiring to. Moreover, we need\nnot follow Young in identifying impartiality with “an unsituated\npoint of view.” An aspiration toward impartiality might instead\ninvolve an attempt to avoid parochialism by being open to as many\ndifferent voices and viewpoints as possible. Amartya Sen finds such an\naspiration in the work of Adam Smith, writing that “one of\nSmith’s major methodological concerns is the need to invoke a\nwide variety of viewpoints and outlooks based on diverse experiences\nfrom far and near, rather than remaining contented with\nencounters—actual or counterfactual—with others living in\nthe same cultural and social milieu, and with the same kind of\nexperiences, prejudices and convictions about what is reasonable and\nwhat is not, and even beliefs about what is feasible and what is\nnot” (Sen 2009, 45).\n\nIt is on this basis that Sen distinguishes between what he calls\n‘open’ and ‘closed’ impartiality. The\ndistinction “turns on whether or not the exercise of impartial\nassessment is confined … to a fixed group.” Since the\ncontractors behind the veil of ignorance are aware that they are part\nof a certain society (and do not see themselves in any sense as\nrepresenting the world as a whole), the veil of ignorance represents\nan impartial system only in the closed sense. Therefore, Sen complains\nthat “As a device of structured political analysis, the\nprocedure is not geared to addressing the need to overcome group\nprejudices” (Sen 2002, 446). By contrast, open\nimpartiality, which Sen finds recommended in the works of Adam Smith\n(see Smith 1759), demands “that the viewpoints of others,\nwhether or not belonging to some group of which one is specifically a\nmember, receive adequate attention.” Sen applies this\ndistinction to John Rawls’s view of justice as grounded in a\ncontract devised by hypothetical contractors under a veil of\nignorance, writing that:\nThe Rawlsian ‘veil of ignorance’ in the\n’original position’ is a very effective device for making\npeople see beyond their personal vested interests and goals. And yet\nit does little to ensure an open scrutiny of local and possibly\nparochial values …. The Smithian procedure includes …\nthe insistence that the exercise of impartiality must be open (rather\nthan locally closed) since “we can do this in no other way than\nby endeavoring to view them with the eyes of other people, or as other\npeople are likely to view them.” (Sen 2009, 128; Smith\n1976[1759], III, 1, 2, 110)\n\nFor Sen, the attempt to be impartial by opening conversation (and\ndirecting one’s own attention) to as many different perspectives\nas possible is closely related to aspirations to ethical objectivity:\n“to the extent that we look for ethical objectivity, the\nreasoning that is necessary has to satisfy what can be seen as the\nrequirements of impartiality” (Sen 2009, 46). Objective moral\nreasoning, that is, requires a willingness to consider arguments and\nconsiderations presented by all members of the moral community, and\nthis receptivity must ideally be extended to all on an equal basis.\nSuch impartiality, as conceived by Sen, seems closely related to the\nvirtue identified by Miranda Fricker as “testimonial\njustice,” the “specifically anti-prejudicial\ncurrent that the virtuous hearer’s sensibility needs to contain\nin order that the hearer may not be led into perpetrating testimonial\ninjustices” (Fricker 2007, 86). Testimonial injustices, as\nunderstood by Fricker, occur when people silence, ignore, or refuse to\ntake seriously other people’s views and ideas for certain sorts\nof reasons—for instance, because they have been led by their\nacceptance of a stereotype to believe that people like the speaker are\ngenerally not worth listening to. (Thus Fricker describes the central\ncase of testimonial injustice as an “identity-prejudicial\ncredibility deficit” (28).) Moreover, Sen’s comments\nabout impartiality suggest he would agree with Fricker that the\nrelevant character trait “serves not one but two ultimate\nvalues: it simultaneously protects both truth and justice”\n(Fricker, 120).)\n\nSen, as mentioned, identifies Rawlsian liberalism as one target of his\nconcern. The idea of picturing society, as Rawls and other\ncontractualists picture it, as guided by a hypothetical agreement\nbetween persons, each of whom is equally empowered to revoke the\nagreement, is to capture the idea that the rules governing society\nmust in some sense be acceptable to all, and must embody, in some deep\nway, the ideal of equal respect. Sen’s complaint about the\n’closed impartiality’ of such systems, however, draws our\nattention to the fact that this approach risks leaving those not party\nto the contract out in the cold. But surely it is plausible to think\nthat a society, in order to be just, must not only treat (and avoid\ntreating) its own citizens in certain ways, but must also\nrespect certain rules regarding its behavior towards members of other\nsocieties. As Charles Jones (1999) writes, “Unlike Rawls\n… I see no reason to restrict our moral focus to the basic\nstructure of any particular nation-state; on the contrary, if\none’s concern is with the justifiability of the institutions\nwhich determine people’s life chances, there are compelling\ngrounds for taking a wider view.” There are various responses\nopen to Rawlsian theorists. Rawls himself suggests that we imagine a\nsecond veil of ignorance behind which representatives of various\nsocieties can meet in order to set fair and impartial ground rules for\ninternational relations. Much like justice within states, Rawls\nwrites, “Justice between states is determined by the principles\nthat would be chosen in the original position so interpreted. These\nprinciples are political principles, for they govern public policies\ntoward other nations” (Rawls 1971; for relevant later\ndevelopments see Rawls 1999b).\n\nOthers, particularly feminist critics, have worried that the Rawlsian\napproach might exclude certain people within any given\nsociety. Susan Moller Okin, Martha Nussbaum, and others have pointed\nout that A Theory of Justice pays little specific attention\nto the family as an institution for structuring society; rather, it is\nsimply assumed that society will be composed of families, and while\nthe rules of justice govern relations between various “heads of\nhouseholds,” Rawls’s attitude often seems to be that as a\nprivate institution, what goes on within the family is immune to\ncriticism from the perspective of justice (Okin 1989; see also Okin\n1994). Such a view, of course, would ignore the fact that a great many\ninjustices can take place within families: neglect, child and spouse\nabuse, and inegalitarian distributions of resources and of labor, and\nvarious forms of testimonial injustice, among others. Thus, in a\nsociety in which males tend to command more power and resources than\nfemales—which, of course, describes most\nsocieties—adherence to the principles arising out of the\nOriginal Position would be insufficient to avoid certain forms of\ndiscrimination and oppression. (Here, too, Rawls modified his views\nsomewhat in later writings, in light of such criticisms (Rawls 1993,\nRawls 1999a).) More generally, feminist philosophers have frequently\nraised concerns about the ways in which liberal conceptions of\nneutrality and impartiality presuppose and reinforce traditional\nmale-dominated, individualistic approaches to moral theory, and in\ndoing so reinforce the social status quo (Gilligan 1982; Noddings\n1984; Benhabib 1987; Young 1990). As Benhabib has pointed out,\n“Universalistic moral theories in the Western tradition from\nHobbes to Rawls are substitutionalist, in the sense that the\nuniversalism they defend is defined surreptitiously by identifying the\nexperiences of a specific group of subjects as the paradigmatic case\nof the human as such. These subjects are invariably white, male adults\nwho are propertied or at least professional.” (Benhabib 1987,\n81) As a result, the dominant social positions of such parties tend to\nbe protected and even enhanced in the social and political theories\nresulting from such allegedly neutral liberal theories.\n\nThe general concern is that contractualists and others claiming to\nground moral theory in impartial considerations might smuggle in their\nown substantive moral positions and biases under the guise of\nneutrality. Rawls’s use of the veil of ignorance, for example,\nhas been criticized by Thomas Nagel and others on the basis that, by\nrequiring that agents lack knowledge of their conceptions of the good\n(a necessary stipulation of the bargainers are to achieve a\nconsensus), the veil of ignorance excludes from the original position\ninformation that is morally relevant, and indeed may put some of the\nbargainers at a disadvantage. “The original position,”\nNagel writes, “seems to presuppose not just a neutral theory of\nthe good, but a liberal, individualistic conception according to which\nthe best that can be wished for someone is the unimpeded pursuit of\nhis own path, provided it does not interfere with the rights of\nothers” (Nagel 1973; see also Teitelman 1972; Schwartz 1973;\nSandel 1982; Benhabib 1987). Such a conception, it is held, clearly\ndoes favor some conceptions of the good over others: in particular,\natomic, individualistic conceptions focusing on personal fulfillment\n(constituted, perhaps, through the acquisition of consumer goods) are\nprivileged over more communal or social ideals that focus on\nsolidarity and mutual interaction between persons (Sandel 1982; cf.\nO’Neill 1997, Chapter 1).\n\nThe problem of neutrality is a pressing one for liberals: given the\nimportance to their view of the thought that an impartial government\nmust be neutral between various moral conceptions (it must, that is,\nrespect what Rawls calls ‘the fact of pluralism’), it is\nessential to show that liberal impartialism does not simply represent\nanother such moral conception (or ‘sectarian view’) in its\nown right. Liberal impartialism, then, must turn out to be a framework\nthat can be agreed to by all relevant parties, even as they continue\nto disagree regarding particular substantive moral issues.\n\nHow is the liberal to establish this? Nagel (1987) endorses what he\ncalls ‘epistemological restraint,’ which holds that it can\nbe reasonable for an individual to hold certain beliefs yet\nsimultaneously unreasonable to attempt to decide matters of public\npolicy on the basis of such beliefs. Such beliefs, which tend to be\nmoral or religious in nature, are said to be viewed differently from\nthe inside (from which standpoint they have perfect authority) than\nfrom the outside (from which standpoint they are regarded as\nquestionable). The difficulty, as Barry (1995) and Raz (1990) have\npointed out, is to explain why doubts visible from the outside would\nnot infect the internal point of view, thus weakening these\nbeliefs’ internal authority as well. (It should be noted that\nNagel himself has expressed doubts about this argument; see Nagel\n1991.)\n\nRawls’s view appears to be similar to Nagel’s (and thus,\nsubject to the same difficulty). According to Rawls, to endorse a view\nof justice is not to claim that it is true; moreover, the\nacceptability of liberal impartialism is not to be derived from its\ntruth; rather, such a view will be accepted (it is to be hoped)\nbecause, in societies of the relevant sort, it will form a common\nelement (an ‘overlapping consensus’) in the various\ncompeting conceptions of the good that occupy the public sphere (Rawls\n1993). (Again, the criticisms contained in Raz 1990 are especially\ntrenchant.)\n\nWhile both Nagel and Rawls explicitly reject the idea that liberal\nimpartialism is to be justified on the basis of skepticism toward\nvarious conceptions of the good, Barry (1995) explicitly endorses this\nform of justification. (Barry emphasizes that the relevant form of\nskepticism does not involve eschewing one’s moral and religious\nbeliefs, but rather rejecting the claim to be certain of the\ntruth of those beliefs.) This approach has been criticized on the\nbasis that such skepticism itself constitutes a sectarian view, and\ntherefore is not neutral (Larmore 1987, Mendus 2002) However, as Barry\npoints out, the decisive issue is not whether some people would reject\nskepticism, but whether it can reasonably be rejected –\nand given Barry’s definition of skepticism, its claim to resist\nbeing so rejected seems considerably stronger than the claims of the\nvarious conceptions of the good themselves, which must indeed be\nexcluded from the public sphere.\n",
    "section_title": "5.3 Impartiality, Objectivity, and Neutrality",
    "entry_title": "Impartiality",
    "hierarchy_title": "Impartiality || Impartiality: Its demands and scope || Impartiality, Objectivity, and Neutrality",
    "tokenized_text": [
        "impartiality",
        "demand",
        "scope",
        "impartiality",
        "objectivity",
        "neutrality",
        "impartiality",
        "objectivity",
        "neutrality",
        "one",
        "agree",
        "critic",
        "like",
        "young",
        "skeptical",
        "regarding",
        "naive",
        "interpretation",
        "impartiality",
        "without",
        "wholeheartedly",
        "rejecting",
        "impartiality",
        "either",
        "unrealistic",
        "undesirable",
        "even",
        "ability",
        "empathize",
        "others",
        "genuinely",
        "put",
        "place",
        "limited",
        "psychological",
        "constraint",
        "attempt",
        "may",
        "represent",
        "ideal",
        "worth",
        "aspiring",
        "moreover",
        "need",
        "follow",
        "young",
        "identifying",
        "impartiality",
        "unsituated",
        "point",
        "view",
        "aspiration",
        "toward",
        "impartiality",
        "might",
        "instead",
        "involve",
        "attempt",
        "avoid",
        "parochialism",
        "open",
        "many",
        "different",
        "voice",
        "viewpoint",
        "possible",
        "amartya",
        "sen",
        "find",
        "aspiration",
        "work",
        "adam",
        "smith",
        "writing",
        "one",
        "smith",
        "major",
        "methodological",
        "concern",
        "need",
        "invoke",
        "wide",
        "variety",
        "viewpoint",
        "outlook",
        "based",
        "diverse",
        "experience",
        "far",
        "near",
        "rather",
        "remaining",
        "contented",
        "encountersactual",
        "counterfactualwith",
        "others",
        "living",
        "cultural",
        "social",
        "milieu",
        "kind",
        "experience",
        "prejudice",
        "conviction",
        "reasonable",
        "even",
        "belief",
        "feasible",
        "sen",
        "basis",
        "sen",
        "distinguishes",
        "call",
        "open",
        "closed",
        "impartiality",
        "distinction",
        "turn",
        "whether",
        "exercise",
        "impartial",
        "assessment",
        "confined",
        "fixed",
        "group",
        "since",
        "contractor",
        "behind",
        "veil",
        "ignorance",
        "aware",
        "part",
        "certain",
        "society",
        "see",
        "sense",
        "representing",
        "world",
        "whole",
        "veil",
        "ignorance",
        "represents",
        "impartial",
        "system",
        "closed",
        "sense",
        "therefore",
        "sen",
        "complains",
        "device",
        "structured",
        "political",
        "analysis",
        "procedure",
        "geared",
        "addressing",
        "need",
        "overcome",
        "group",
        "prejudice",
        "sen",
        "contrast",
        "open",
        "impartiality",
        "sen",
        "find",
        "recommended",
        "work",
        "adam",
        "smith",
        "see",
        "smith",
        "demand",
        "viewpoint",
        "others",
        "whether",
        "belonging",
        "group",
        "one",
        "specifically",
        "member",
        "receive",
        "adequate",
        "attention",
        "sen",
        "applies",
        "distinction",
        "john",
        "rawls",
        "view",
        "justice",
        "grounded",
        "contract",
        "devised",
        "hypothetical",
        "contractor",
        "veil",
        "ignorance",
        "writing",
        "rawlsian",
        "veil",
        "ignorance",
        "original",
        "position",
        "effective",
        "device",
        "making",
        "people",
        "see",
        "beyond",
        "personal",
        "vested",
        "interest",
        "goal",
        "yet",
        "little",
        "ensure",
        "open",
        "scrutiny",
        "local",
        "possibly",
        "parochial",
        "value",
        "smithian",
        "procedure",
        "includes",
        "insistence",
        "exercise",
        "impartiality",
        "must",
        "open",
        "rather",
        "locally",
        "closed",
        "since",
        "way",
        "endeavoring",
        "view",
        "eye",
        "people",
        "people",
        "likely",
        "view",
        "them",
        "sen",
        "smith",
        "iii",
        "sen",
        "attempt",
        "impartial",
        "opening",
        "conversation",
        "directing",
        "one",
        "attention",
        "many",
        "different",
        "perspective",
        "possible",
        "closely",
        "related",
        "aspiration",
        "ethical",
        "objectivity",
        "extent",
        "look",
        "ethical",
        "objectivity",
        "reasoning",
        "necessary",
        "satisfy",
        "seen",
        "requirement",
        "impartiality",
        "sen",
        "objective",
        "moral",
        "reasoning",
        "requires",
        "willingness",
        "consider",
        "argument",
        "consideration",
        "presented",
        "member",
        "moral",
        "community",
        "receptivity",
        "must",
        "ideally",
        "extended",
        "equal",
        "basis",
        "impartiality",
        "conceived",
        "sen",
        "seems",
        "closely",
        "related",
        "virtue",
        "identified",
        "miranda",
        "fricker",
        "testimonial",
        "justice",
        "specifically",
        "antiprejudicial",
        "current",
        "virtuous",
        "hearer",
        "sensibility",
        "need",
        "contain",
        "order",
        "hearer",
        "may",
        "led",
        "perpetrating",
        "testimonial",
        "injustice",
        "fricker",
        "testimonial",
        "injustice",
        "understood",
        "fricker",
        "occur",
        "people",
        "silence",
        "ignore",
        "refuse",
        "take",
        "seriously",
        "people",
        "view",
        "idea",
        "certain",
        "sort",
        "reasonsfor",
        "instance",
        "led",
        "acceptance",
        "stereotype",
        "believe",
        "people",
        "like",
        "speaker",
        "generally",
        "worth",
        "listening",
        "thus",
        "fricker",
        "describes",
        "central",
        "case",
        "testimonial",
        "injustice",
        "identityprejudicial",
        "credibility",
        "deficit",
        "moreover",
        "sen",
        "comment",
        "impartiality",
        "suggest",
        "would",
        "agree",
        "fricker",
        "relevant",
        "character",
        "trait",
        "serf",
        "one",
        "two",
        "ultimate",
        "value",
        "simultaneously",
        "protects",
        "truth",
        "justice",
        "fricker",
        "sen",
        "mentioned",
        "identifies",
        "rawlsian",
        "liberalism",
        "one",
        "target",
        "concern",
        "idea",
        "picturing",
        "society",
        "rawls",
        "contractualists",
        "picture",
        "guided",
        "hypothetical",
        "agreement",
        "person",
        "equally",
        "empowered",
        "revoke",
        "agreement",
        "capture",
        "idea",
        "rule",
        "governing",
        "society",
        "must",
        "sense",
        "acceptable",
        "must",
        "embody",
        "deep",
        "way",
        "ideal",
        "equal",
        "respect",
        "sen",
        "complaint",
        "closed",
        "impartiality",
        "system",
        "however",
        "draw",
        "attention",
        "fact",
        "approach",
        "risk",
        "leaving",
        "party",
        "contract",
        "cold",
        "surely",
        "plausible",
        "think",
        "society",
        "order",
        "must",
        "treat",
        "avoid",
        "treating",
        "citizen",
        "certain",
        "way",
        "must",
        "also",
        "respect",
        "certain",
        "rule",
        "regarding",
        "behavior",
        "towards",
        "member",
        "society",
        "charles",
        "jones",
        "writes",
        "unlike",
        "rawls",
        "see",
        "reason",
        "restrict",
        "moral",
        "focus",
        "basic",
        "structure",
        "particular",
        "nationstate",
        "contrary",
        "one",
        "concern",
        "justifiability",
        "institution",
        "determine",
        "people",
        "life",
        "chance",
        "compelling",
        "ground",
        "taking",
        "wider",
        "view",
        "various",
        "response",
        "open",
        "rawlsian",
        "theorist",
        "rawls",
        "suggests",
        "imagine",
        "second",
        "veil",
        "ignorance",
        "behind",
        "representative",
        "various",
        "society",
        "meet",
        "order",
        "set",
        "fair",
        "impartial",
        "ground",
        "rule",
        "international",
        "relation",
        "much",
        "like",
        "justice",
        "within",
        "state",
        "rawls",
        "writes",
        "justice",
        "state",
        "determined",
        "principle",
        "would",
        "chosen",
        "original",
        "position",
        "interpreted",
        "principle",
        "political",
        "principle",
        "govern",
        "public",
        "policy",
        "toward",
        "nation",
        "rawls",
        "relevant",
        "later",
        "development",
        "see",
        "rawls",
        "b",
        "others",
        "particularly",
        "feminist",
        "critic",
        "worried",
        "rawlsian",
        "approach",
        "might",
        "exclude",
        "certain",
        "people",
        "within",
        "given",
        "society",
        "susan",
        "moller",
        "okin",
        "martha",
        "nussbaum",
        "others",
        "pointed",
        "theory",
        "justice",
        "pay",
        "little",
        "specific",
        "attention",
        "family",
        "institution",
        "structuring",
        "society",
        "rather",
        "simply",
        "assumed",
        "society",
        "composed",
        "family",
        "rule",
        "justice",
        "govern",
        "relation",
        "various",
        "head",
        "household",
        "rawls",
        "attitude",
        "often",
        "seems",
        "private",
        "institution",
        "go",
        "within",
        "family",
        "immune",
        "criticism",
        "perspective",
        "justice",
        "okin",
        "see",
        "also",
        "okin",
        "view",
        "course",
        "would",
        "ignore",
        "fact",
        "great",
        "many",
        "injustice",
        "take",
        "place",
        "within",
        "family",
        "neglect",
        "child",
        "spouse",
        "abuse",
        "inegalitarian",
        "distribution",
        "resource",
        "labor",
        "various",
        "form",
        "testimonial",
        "injustice",
        "among",
        "others",
        "thus",
        "society",
        "male",
        "tend",
        "command",
        "power",
        "resource",
        "femaleswhich",
        "course",
        "describes",
        "societiesadherence",
        "principle",
        "arising",
        "original",
        "position",
        "would",
        "insufficient",
        "avoid",
        "certain",
        "form",
        "discrimination",
        "oppression",
        "rawls",
        "modified",
        "view",
        "somewhat",
        "later",
        "writing",
        "light",
        "criticism",
        "rawls",
        "rawls",
        "a",
        "generally",
        "feminist",
        "philosopher",
        "frequently",
        "raised",
        "concern",
        "way",
        "liberal",
        "conception",
        "neutrality",
        "impartiality",
        "presuppose",
        "reinforce",
        "traditional",
        "maledominated",
        "individualistic",
        "approach",
        "moral",
        "theory",
        "reinforce",
        "social",
        "status",
        "quo",
        "gilligan",
        "noddings",
        "benhabib",
        "young",
        "benhabib",
        "pointed",
        "universalistic",
        "moral",
        "theory",
        "western",
        "tradition",
        "hobbes",
        "rawls",
        "substitutionalist",
        "sense",
        "universalism",
        "defend",
        "defined",
        "surreptitiously",
        "identifying",
        "experience",
        "specific",
        "group",
        "subject",
        "paradigmatic",
        "case",
        "human",
        "subject",
        "invariably",
        "white",
        "male",
        "adult",
        "propertied",
        "least",
        "professional",
        "benhabib",
        "result",
        "dominant",
        "social",
        "position",
        "party",
        "tend",
        "protected",
        "even",
        "enhanced",
        "social",
        "political",
        "theory",
        "resulting",
        "allegedly",
        "neutral",
        "liberal",
        "theory",
        "general",
        "concern",
        "contractualists",
        "others",
        "claiming",
        "ground",
        "moral",
        "theory",
        "impartial",
        "consideration",
        "might",
        "smuggle",
        "substantive",
        "moral",
        "position",
        "bias",
        "guise",
        "neutrality",
        "rawls",
        "use",
        "veil",
        "ignorance",
        "example",
        "criticized",
        "thomas",
        "nagel",
        "others",
        "basis",
        "requiring",
        "agent",
        "lack",
        "knowledge",
        "conception",
        "good",
        "necessary",
        "stipulation",
        "bargainer",
        "achieve",
        "consensus",
        "veil",
        "ignorance",
        "excludes",
        "original",
        "position",
        "information",
        "morally",
        "relevant",
        "indeed",
        "may",
        "put",
        "bargainer",
        "disadvantage",
        "original",
        "position",
        "nagel",
        "writes",
        "seems",
        "presuppose",
        "neutral",
        "theory",
        "good",
        "liberal",
        "individualistic",
        "conception",
        "according",
        "best",
        "wished",
        "someone",
        "unimpeded",
        "pursuit",
        "path",
        "provided",
        "interfere",
        "right",
        "others",
        "nagel",
        "see",
        "also",
        "teitelman",
        "schwartz",
        "sandel",
        "benhabib",
        "conception",
        "held",
        "clearly",
        "favor",
        "conception",
        "good",
        "others",
        "particular",
        "atomic",
        "individualistic",
        "conception",
        "focusing",
        "personal",
        "fulfillment",
        "constituted",
        "perhaps",
        "acquisition",
        "consumer",
        "good",
        "privileged",
        "communal",
        "social",
        "ideal",
        "focus",
        "solidarity",
        "mutual",
        "interaction",
        "person",
        "sandel",
        "cf",
        "neill",
        "chapter",
        "problem",
        "neutrality",
        "pressing",
        "one",
        "liberal",
        "given",
        "importance",
        "view",
        "thought",
        "impartial",
        "government",
        "must",
        "neutral",
        "various",
        "moral",
        "conception",
        "must",
        "respect",
        "rawls",
        "call",
        "fact",
        "pluralism",
        "essential",
        "show",
        "liberal",
        "impartialism",
        "simply",
        "represent",
        "another",
        "moral",
        "conception",
        "sectarian",
        "view",
        "right",
        "liberal",
        "impartialism",
        "must",
        "turn",
        "framework",
        "agreed",
        "relevant",
        "party",
        "even",
        "continue",
        "disagree",
        "regarding",
        "particular",
        "substantive",
        "moral",
        "issue",
        "liberal",
        "establish",
        "nagel",
        "endorses",
        "call",
        "epistemological",
        "restraint",
        "hold",
        "reasonable",
        "individual",
        "hold",
        "certain",
        "belief",
        "yet",
        "simultaneously",
        "unreasonable",
        "attempt",
        "decide",
        "matter",
        "public",
        "policy",
        "basis",
        "belief",
        "belief",
        "tend",
        "moral",
        "religious",
        "nature",
        "said",
        "viewed",
        "differently",
        "inside",
        "standpoint",
        "perfect",
        "authority",
        "outside",
        "standpoint",
        "regarded",
        "questionable",
        "difficulty",
        "barry",
        "raz",
        "pointed",
        "explain",
        "doubt",
        "visible",
        "outside",
        "would",
        "infect",
        "internal",
        "point",
        "view",
        "thus",
        "weakening",
        "belief",
        "internal",
        "authority",
        "well",
        "noted",
        "nagel",
        "expressed",
        "doubt",
        "argument",
        "see",
        "nagel",
        "rawls",
        "view",
        "appears",
        "similar",
        "nagel",
        "thus",
        "subject",
        "difficulty",
        "according",
        "rawls",
        "endorse",
        "view",
        "justice",
        "claim",
        "true",
        "moreover",
        "acceptability",
        "liberal",
        "impartialism",
        "derived",
        "truth",
        "rather",
        "view",
        "accepted",
        "hoped",
        "society",
        "relevant",
        "sort",
        "form",
        "common",
        "element",
        "overlapping",
        "consensus",
        "various",
        "competing",
        "conception",
        "good",
        "occupy",
        "public",
        "sphere",
        "rawls",
        "criticism",
        "contained",
        "raz",
        "especially",
        "trenchant",
        "nagel",
        "rawls",
        "explicitly",
        "reject",
        "idea",
        "liberal",
        "impartialism",
        "justified",
        "basis",
        "skepticism",
        "toward",
        "various",
        "conception",
        "good",
        "barry",
        "explicitly",
        "endorses",
        "form",
        "justification",
        "barry",
        "emphasizes",
        "relevant",
        "form",
        "skepticism",
        "involve",
        "eschewing",
        "one",
        "moral",
        "religious",
        "belief",
        "rather",
        "rejecting",
        "claim",
        "certain",
        "truth",
        "belief",
        "approach",
        "criticized",
        "basis",
        "skepticism",
        "constitutes",
        "sectarian",
        "view",
        "therefore",
        "neutral",
        "larmore",
        "mendus",
        "however",
        "barry",
        "point",
        "decisive",
        "issue",
        "whether",
        "people",
        "would",
        "reject",
        "skepticism",
        "whether",
        "reasonably",
        "rejected",
        "given",
        "barry",
        "definition",
        "skepticism",
        "claim",
        "resist",
        "rejected",
        "seems",
        "considerably",
        "stronger",
        "claim",
        "various",
        "conception",
        "good",
        "must",
        "indeed",
        "excluded",
        "public",
        "sphere"
    ]
}