{
    "main_text": "Morality and impartiality || Moral impartiality and equality\n2.3 Moral impartiality and equality\n\nThe plausibility of identifying the moral point of view with the\nimpartial point of view, or of defining morality in terms of an\nimpartial observer, presumably lies in the thought that such views\ncapture the idea that morally speaking, every person is equally\nimportant. Whatever such conceptions may get wrong, then, one thing\nthey seem to get right is the idea that there is a close and important\nconnection between moral impartiality and equality (see especially\nNagel 1991, Chapter 7).\n\nSome clarification, however, is required. To say that from the\nimpartial point of view, no one is seen as intrinsically more\nsignificant than anyone else, is not to say that there is no reason\nwhatsoever for which a person might demand more moral attention or\nbetter treatment than others. Many moral theorists, after all, will\nsuppose that from the impartial point of view, properly conceived,\nsome individuals will count as more significant, at least in certain\nways. William Godwin (Godwin 1793) provides an influential and\ninfamous example. Fenelon, the archbishop of Cambrai, Godwin writes,\nmay be supposed to be more significant than a mere chambermaid; so in\nan emergency (Godwin imagines a building on fire) the archbishop ought\nto be rescued first. The reason, however, is not that the archbishop\nis intrinsically more significant; rather, the claim is grounded on\nthe fact that the archbishop makes greater contributions to\nsociety:\n\n[T]hat life ought to be preferred which will be most conducive to the\ngeneral good. In saving the life of Fenelon, suppose at the moment\nwhen he was conceiving the project of his immortal\nTelemachus, I should be promoting the benefit of thousands\nwho have been cured by the perusal of it of some error, vice and\nconsequent unhappiness. Nay, my benefit would extend further than\nthis, for every individual thus cured has become a better member of\nsociety and has contributed in his turn to the happiness, the\ninformation and improvement of mankind. (Godwin 1793, 41–42)\n\n\nIn Godwin’s consequentialist view, impartiality requires that we\nconsider all people who will be affected by our decision, not just\nthose who are directly affected. Thus, taking into account the\ninterests of those whom Fenelon’s writings stand to benefit, it\nis clear that the right thing to do is to save him from death. One\nclear implication of the example is that viewing persons from an\nimpartial point of view need not imply that we view them equally, in\nevery sense of the word; and it certainly does not imply that everyone\nmust receive equal treatment. In Godwin’s Archbishop\nFenelon case, if we assume that only one person can be saved, the only\nway to give the archbishop and the chambermaid equal treatment would\nbe to let them both perish in the flames.\n\nWhat impartiality requires, many would argue, is not that everyone\nreceive equal treatment, but rather that every person be treated\nas an equal (Dworkin 1977, 227). While the distinction between\nequal treatment and treatment as equals is difficult to make out with\nprecision, the main idea is fairly clear: treatment as equals requires\nthat persons are not treated equally, but rather treated in\naccordance with what rights they possess, what legitimate claims they\nput forward, and, in general, with what they deserve. (Recall\nHooker’s related distinction between impartial treatment and\nimpartial application of partiality-permitting rules). Thus, to\ninflict a one year jail sentence on all accused persons, regardless of\nwhether they are guilty or innocent, is to provide equal treatment to\nmembers of that group; but it is not to treat them as equals. As\nmentioned, however, the concept of being treated as an equal is a\nsomewhat elusive one, and there is certainly room to wonder whether\nthe chambermaid, in being sacrificed for in the interests of those who\nstand to benefit from Fenelon’s survival, truly is being treated\nas an equal. (Someone with Kantian intuitions, at any rate, is\nunlikely to think so.)\n\nThe most famous and controversial element of Godwin’s example,\nof course, is yet to come. Let’s suppose that the chambermaid is\nnot just any chambermaid, but has some relationship to the\nagent who must choose whom to save:\n\nSupposing the chambermaid had been my wife, my mother or my\nbenefactor. That would not alter the truth of the proposition. The\nlife of Fenelon would still be more valuable than that of the\nchambermaid; and justice – pure, unadulterated justice –\nwould still have preferred that which was most valuable. Justice would\nhave taught me to save the life of Fenelon at the expense of the\nother. What magic is there, in the pronoun ‘my’ to\noverturn the decisions of everlasting truth? My wife or my mother may\nbe a fool or a prostitute, malicious, lying or dishonest. If they be,\nwhat consequence is it that they are mine? (Godwin 1793, 41–42)\n\n\nOf course, since his thought experiment concerns an unusual emergency\ncase, it might be suggested that, since we are not frequently faced\nwith the choice of who to pull from a burning building, Godwin’s\nposition, as radical as it is, has few implications for everyday moral\ndecision-making. But as Singer (1972) has argued, those of us who live\nin economically privileged countries can, by choosing to donate some\nof our incomes to charity, prevent people elsewhere on the planet from\ndying of hunger, easily preventable diseases, etc.; and this seems to\nimply that we are always in the situation of choosing who lives and\nwho dies – whether or not we explicitly acknowledge the fact.\n(See also Unger 1996 and Singer 2009. Singer’s work has given\nrise to the movement popularly known as ‘effective\naltruism,’ composed of people who attempt to dedicate their\nlives to doing as much practical good as possible. One popular\nstrategy is to donate as much as possible to those charitable\norganizations judged to be most effective. Such views, like\nGodwin’s, adhere to the view that we owe as much moral attention\nand effort to those who are distant and unrelated to us as to our\nneighbors, close friends, and even family.\n\nMany have resisted the extreme position defended by Godwin, Singer,\netc. If nothing else, such positions are quite clearly incompatible\nwith the apparent existence of morally admirable partiality. (Williams\n(1981) holds that even to consider sacrificing one’s wife for\nthe sake of impersonal justice constitutes a kind of moral error in\nits own right.) Moreover, despite the fact that the ultimate\nevaluation is made on the grounds of perfectly general properties, it\nis not entirely clear that the objects of the evaluation really are\nbeing treated as equals, in the relevant sense – the fact that\nthe chambermaid’s life is to be sacrificed for the overall good\nat least suggests that her standing as a moral being is not really\nbeing taken into account, and that the suggested understanding of\nmoral impartiality is therefore deficient. Deontological prohibitions\non using people as mere means to an end may be seen as expressing a\ncommitment to a kind of impartiality in which everyone is seen to be\nequally in possession of a kind of worth that grounds inviolable\nrights against certain forms of treatment. Such prohibitions are\ncompatible with what Kant referred to as imperfect duties to\nprovide benefits to others, though they place limits on what may be\ndone while fulfilling those duties.\n\nOne need not deny the very possibility of an agent-neutral ranking of\nstates of affairs in terms of value, in order to recognize the\nexistence of deontological prohibitions of this sort. One need only\nhold that such an impersonal ranking does not in itself determine our\nmoral obligations. Philosophers such as John Taurek have taken the\nfurther step and argued that the various goods of individual persons\ncannot be added up to a total ‘overall’ good in any\nmeaningful sense, and that the traditional consequentialist conception\nof right action as maximizing the overall good is therefore incoherent\n(Taurek 1977). Indeed, Taurek claims, such decision-making actually\nfail to show equal respect for all persons concerned. (Taurek’s\ndenial that one can aggregate various individual goods can be regarded\nas a strong version of the Rawlsian claim that morality must respect a\n‘distinction between persons.’) Suppose a lifeguard must\nchoose between saving one drowning person or saving five; whomever she\nchooses not to save will drown, and she cannot save both groups. Most\nconsequentialists (and many others) would take it as obvious that, at\nleast in the absence of very special circumstances (the solitary\ndrowner’s being the potential author of Telemachus, for\ninstance) the five should be saved rather than the one. But to assume\nthis, Taurek argues, would be to fail to show the one the same respect\none shows the five: after all, this response leaves the single victim\nno chance at all of being rescued. Taurek’s controversial\nsuggestion is that the lifeguard would show equal respect by flipping\na coin, as this would offer every person involved an equal chance\n(fifty percent) of being rescued. Not surprisingly, Taurek’s\nargument has engendered a substantial amount of discussion and\ncriticism (see for instance Kamm 1993 Chapters 5 & 6, Kavka 1979,\nOtsuka 2000, Parfit 1978.)\n\n",
    "section_title": "2.3 Moral impartiality and equality",
    "entry_title": "Impartiality",
    "hierarchy_title": "Impartiality || Morality and impartiality || Moral impartiality and equality",
    "tokenized_text": [
        "morality",
        "impartiality",
        "moral",
        "impartiality",
        "equality",
        "moral",
        "impartiality",
        "equality",
        "plausibility",
        "identifying",
        "moral",
        "point",
        "view",
        "impartial",
        "point",
        "view",
        "defining",
        "morality",
        "term",
        "impartial",
        "observer",
        "presumably",
        "lie",
        "thought",
        "view",
        "capture",
        "idea",
        "morally",
        "speaking",
        "every",
        "person",
        "equally",
        "important",
        "whatever",
        "conception",
        "may",
        "get",
        "wrong",
        "one",
        "thing",
        "seem",
        "get",
        "right",
        "idea",
        "close",
        "important",
        "connection",
        "moral",
        "impartiality",
        "equality",
        "see",
        "especially",
        "nagel",
        "chapter",
        "clarification",
        "however",
        "required",
        "say",
        "impartial",
        "point",
        "view",
        "one",
        "seen",
        "intrinsically",
        "significant",
        "anyone",
        "else",
        "say",
        "reason",
        "whatsoever",
        "person",
        "might",
        "demand",
        "moral",
        "attention",
        "better",
        "treatment",
        "others",
        "many",
        "moral",
        "theorist",
        "suppose",
        "impartial",
        "point",
        "view",
        "properly",
        "conceived",
        "individual",
        "count",
        "significant",
        "least",
        "certain",
        "way",
        "william",
        "godwin",
        "godwin",
        "provides",
        "influential",
        "infamous",
        "example",
        "fenelon",
        "archbishop",
        "cambrai",
        "godwin",
        "writes",
        "may",
        "supposed",
        "significant",
        "mere",
        "chambermaid",
        "emergency",
        "godwin",
        "imago",
        "building",
        "fire",
        "archbishop",
        "ought",
        "rescued",
        "first",
        "reason",
        "however",
        "archbishop",
        "intrinsically",
        "significant",
        "rather",
        "claim",
        "grounded",
        "fact",
        "archbishop",
        "make",
        "greater",
        "contribution",
        "society",
        "hat",
        "life",
        "ought",
        "preferred",
        "conducive",
        "general",
        "good",
        "saving",
        "life",
        "fenelon",
        "suppose",
        "moment",
        "conceiving",
        "project",
        "immortal",
        "telemachus",
        "promoting",
        "benefit",
        "thousand",
        "cured",
        "perusal",
        "error",
        "vice",
        "consequent",
        "unhappiness",
        "nay",
        "benefit",
        "would",
        "extend",
        "every",
        "individual",
        "thus",
        "cured",
        "become",
        "better",
        "member",
        "society",
        "contributed",
        "turn",
        "happiness",
        "information",
        "improvement",
        "mankind",
        "godwin",
        "godwin",
        "consequentialist",
        "view",
        "impartiality",
        "requires",
        "consider",
        "people",
        "affected",
        "decision",
        "directly",
        "affected",
        "thus",
        "taking",
        "account",
        "interest",
        "fenelon",
        "writing",
        "stand",
        "benefit",
        "clear",
        "right",
        "thing",
        "save",
        "death",
        "one",
        "clear",
        "implication",
        "example",
        "viewing",
        "person",
        "impartial",
        "point",
        "view",
        "need",
        "imply",
        "view",
        "equally",
        "every",
        "sense",
        "word",
        "certainly",
        "imply",
        "everyone",
        "must",
        "receive",
        "equal",
        "treatment",
        "godwin",
        "archbishop",
        "fenelon",
        "case",
        "assume",
        "one",
        "person",
        "saved",
        "way",
        "give",
        "archbishop",
        "chambermaid",
        "equal",
        "treatment",
        "would",
        "let",
        "perish",
        "flame",
        "impartiality",
        "requires",
        "many",
        "would",
        "argue",
        "everyone",
        "receive",
        "equal",
        "treatment",
        "rather",
        "every",
        "person",
        "treated",
        "equal",
        "dworkin",
        "distinction",
        "equal",
        "treatment",
        "treatment",
        "equal",
        "difficult",
        "make",
        "precision",
        "main",
        "idea",
        "fairly",
        "clear",
        "treatment",
        "equal",
        "requires",
        "person",
        "treated",
        "equally",
        "rather",
        "treated",
        "accordance",
        "right",
        "posse",
        "legitimate",
        "claim",
        "put",
        "forward",
        "general",
        "deserve",
        "recall",
        "hooker",
        "related",
        "distinction",
        "impartial",
        "treatment",
        "impartial",
        "application",
        "partialitypermitting",
        "rule",
        "thus",
        "inflict",
        "one",
        "year",
        "jail",
        "sentence",
        "accused",
        "person",
        "regardless",
        "whether",
        "guilty",
        "innocent",
        "provide",
        "equal",
        "treatment",
        "member",
        "group",
        "treat",
        "equal",
        "mentioned",
        "however",
        "concept",
        "treated",
        "equal",
        "somewhat",
        "elusive",
        "one",
        "certainly",
        "room",
        "wonder",
        "whether",
        "chambermaid",
        "sacrificed",
        "interest",
        "stand",
        "benefit",
        "fenelon",
        "survival",
        "truly",
        "treated",
        "equal",
        "someone",
        "kantian",
        "intuition",
        "rate",
        "unlikely",
        "think",
        "famous",
        "controversial",
        "element",
        "godwin",
        "example",
        "course",
        "yet",
        "come",
        "let",
        "suppose",
        "chambermaid",
        "chambermaid",
        "relationship",
        "agent",
        "must",
        "choose",
        "save",
        "supposing",
        "chambermaid",
        "wife",
        "mother",
        "benefactor",
        "would",
        "alter",
        "truth",
        "proposition",
        "life",
        "fenelon",
        "would",
        "still",
        "valuable",
        "chambermaid",
        "justice",
        "pure",
        "unadulterated",
        "justice",
        "would",
        "still",
        "preferred",
        "valuable",
        "justice",
        "would",
        "taught",
        "save",
        "life",
        "fenelon",
        "expense",
        "magic",
        "pronoun",
        "overturn",
        "decision",
        "everlasting",
        "truth",
        "wife",
        "mother",
        "may",
        "fool",
        "prostitute",
        "malicious",
        "lying",
        "dishonest",
        "consequence",
        "mine",
        "godwin",
        "course",
        "since",
        "thought",
        "experiment",
        "concern",
        "unusual",
        "emergency",
        "case",
        "might",
        "suggested",
        "since",
        "frequently",
        "faced",
        "choice",
        "pull",
        "burning",
        "building",
        "godwin",
        "position",
        "radical",
        "implication",
        "everyday",
        "moral",
        "decisionmaking",
        "singer",
        "argued",
        "u",
        "live",
        "economically",
        "privileged",
        "country",
        "choosing",
        "donate",
        "income",
        "charity",
        "prevent",
        "people",
        "elsewhere",
        "planet",
        "dying",
        "hunger",
        "easily",
        "preventable",
        "disease",
        "etc",
        "seems",
        "imply",
        "always",
        "situation",
        "choosing",
        "life",
        "dy",
        "whether",
        "explicitly",
        "acknowledge",
        "fact",
        "see",
        "also",
        "unger",
        "singer",
        "singer",
        "work",
        "given",
        "rise",
        "movement",
        "popularly",
        "known",
        "effective",
        "altruism",
        "composed",
        "people",
        "attempt",
        "dedicate",
        "life",
        "much",
        "practical",
        "good",
        "possible",
        "one",
        "popular",
        "strategy",
        "donate",
        "much",
        "possible",
        "charitable",
        "organization",
        "judged",
        "effective",
        "view",
        "like",
        "godwin",
        "adhere",
        "view",
        "owe",
        "much",
        "moral",
        "attention",
        "effort",
        "distant",
        "unrelated",
        "u",
        "neighbor",
        "close",
        "friend",
        "even",
        "family",
        "many",
        "resisted",
        "extreme",
        "position",
        "defended",
        "godwin",
        "singer",
        "etc",
        "nothing",
        "else",
        "position",
        "quite",
        "clearly",
        "incompatible",
        "apparent",
        "existence",
        "morally",
        "admirable",
        "partiality",
        "williams",
        "hold",
        "even",
        "consider",
        "sacrificing",
        "one",
        "wife",
        "sake",
        "impersonal",
        "justice",
        "constitutes",
        "kind",
        "moral",
        "error",
        "right",
        "moreover",
        "despite",
        "fact",
        "ultimate",
        "evaluation",
        "made",
        "ground",
        "perfectly",
        "general",
        "property",
        "entirely",
        "clear",
        "object",
        "evaluation",
        "really",
        "treated",
        "equal",
        "relevant",
        "sense",
        "fact",
        "chambermaid",
        "life",
        "sacrificed",
        "overall",
        "good",
        "least",
        "suggests",
        "standing",
        "moral",
        "really",
        "taken",
        "account",
        "suggested",
        "understanding",
        "moral",
        "impartiality",
        "therefore",
        "deficient",
        "deontological",
        "prohibition",
        "using",
        "people",
        "mere",
        "mean",
        "end",
        "may",
        "seen",
        "expressing",
        "commitment",
        "kind",
        "impartiality",
        "everyone",
        "seen",
        "equally",
        "possession",
        "kind",
        "worth",
        "ground",
        "inviolable",
        "right",
        "certain",
        "form",
        "treatment",
        "prohibition",
        "compatible",
        "kant",
        "referred",
        "imperfect",
        "duty",
        "provide",
        "benefit",
        "others",
        "though",
        "place",
        "limit",
        "may",
        "done",
        "fulfilling",
        "duty",
        "one",
        "need",
        "deny",
        "possibility",
        "agentneutral",
        "ranking",
        "state",
        "affair",
        "term",
        "value",
        "order",
        "recognize",
        "existence",
        "deontological",
        "prohibition",
        "sort",
        "one",
        "need",
        "hold",
        "impersonal",
        "ranking",
        "determine",
        "moral",
        "obligation",
        "philosopher",
        "john",
        "taurek",
        "taken",
        "step",
        "argued",
        "various",
        "good",
        "individual",
        "person",
        "added",
        "total",
        "overall",
        "good",
        "meaningful",
        "sense",
        "traditional",
        "consequentialist",
        "conception",
        "right",
        "action",
        "maximizing",
        "overall",
        "good",
        "therefore",
        "incoherent",
        "taurek",
        "indeed",
        "taurek",
        "claim",
        "decisionmaking",
        "actually",
        "fail",
        "show",
        "equal",
        "respect",
        "person",
        "concerned",
        "taurek",
        "denial",
        "one",
        "aggregate",
        "various",
        "individual",
        "good",
        "regarded",
        "strong",
        "version",
        "rawlsian",
        "claim",
        "morality",
        "must",
        "respect",
        "distinction",
        "persons",
        "suppose",
        "lifeguard",
        "must",
        "choose",
        "saving",
        "one",
        "drowning",
        "person",
        "saving",
        "five",
        "whomever",
        "chooses",
        "save",
        "drown",
        "save",
        "group",
        "consequentialists",
        "many",
        "others",
        "would",
        "take",
        "obvious",
        "least",
        "absence",
        "special",
        "circumstance",
        "solitary",
        "drowner",
        "potential",
        "author",
        "telemachus",
        "instance",
        "five",
        "saved",
        "rather",
        "one",
        "assume",
        "taurek",
        "argues",
        "would",
        "fail",
        "show",
        "one",
        "respect",
        "one",
        "show",
        "five",
        "response",
        "leaf",
        "single",
        "victim",
        "chance",
        "rescued",
        "taurek",
        "controversial",
        "suggestion",
        "lifeguard",
        "would",
        "show",
        "equal",
        "respect",
        "flipping",
        "coin",
        "would",
        "offer",
        "every",
        "person",
        "involved",
        "equal",
        "chance",
        "fifty",
        "percent",
        "rescued",
        "surprisingly",
        "taurek",
        "argument",
        "engendered",
        "substantial",
        "amount",
        "discussion",
        "criticism",
        "see",
        "instance",
        "kamm",
        "chapter",
        "kavka",
        "otsuka",
        "parfit"
    ]
}