{
    "main_text": "Revolutionary paradigms: Thomas Kuhn on incommensurability || Kuhn’s subsequent development of incommensurability\n2.3 Kuhn’s subsequent development of incommensurability\n\nKuhn continued to struggle with, develop, and then refine his\nunderstanding of incommensurability until his death in 1996. Although\nhis development of incommensurability went through several stages (cf.\nHoyningen-Huene 1993, 206-222), he claimed to have made a\n“series of significant breakthroughs” beginning in 1987\n(Kuhn 2000 [1993], 228). They are described in a number of essays and\npublished lectures that were collected in (Kuhn 2000, cf. chs. 3, 4,\n5, 10 & 11), and a last as yet unpublished book by Kuhn on\nincommensurability is still pending (Conant and Haugeland 2000, 2).\nThe nature of these developments is controversial. Some commentators\nclaim that Kuhn’s incommensurability thesis underwent a\n‘major transformation’ (Sankey 1993), while others\n(including Kuhn himself) see only a more specific characterization of\nthe original core insight (Hoyningen-Huene 1993, 212; Kuhn 2000,\n[1983], 33ff.; Chen 1997). Kuhn’s original holistic\ncharacterization of incommensurability has been distinguished into two\nseparate theses. ‘Taxonomic incommensurability’ involves\nconceptual change in contrast to ‘methodological\nincommensurability’, which involves the epistemic values used to\nevaluate theories (Sankey 1991; Sankey and Hoyningen-Huene 2001; see\nSection 2.3.2 below).\n2.3.1 Taxonomic incommensurability\n\nKuhn continued to emphasize the difference between normal, cumulative\ngrowth that does not change existing concepts; such as the discovery\nof Boyle’s law, which left the concepts of gas, pressure and\nvolume and the instruments used to measure them unchanged, from\nrevolutionary discoveries that could not have been made on the basis\nof antecedently available concepts; such as the discovery of\nNewton’s theory (Kuhn 2000 [1981], 14). Such developments\nrequire replacing existing concepts with new concepts that\nare incompatible with the older ideas. To help explain the\nnature of this conceptual incompatibility, Kuhn adopted the notion of\na ‘lexical taxonomy’ or ‘lexicon‘ from\nlinguistics (2000 [1989]). A lexical taxonomy stores and structures\nthe vocabulary used to state laws and theories; or more specifically,\nthe kinds of things that they describe. It is the “mental\nmodule” in which members of a speech community store the kind\nterms prerequisite to generalization and description (2000 [1991],\n92–97; 2000 [1993], 229, 233, 238–239, 242, 244). To\ncommunicate, the terms that speakers use do not have to have the same\nmeanings, nor do speakers need to use the same criteria for\nidentifying something as a member of a particular kind (one\nornithologist might identify ducks by their beaks, another by their\ntails) (cf. Hoyningen-Huene 1993, 99). Speakers need only share\nhomologous lexical structures; that is, vocabularies incorporating the\nsame system of taxonomic classification. This suffices to ensure that\nthey refer to the same objects with the same kind terms. If two\ntheories do not share the same taxonomic lexical structure, then they\nare incommensurable (2000 [1989], 63; 2000 [1991]; cf. Sankey 1997 and\nWolf 2007).\n\nTo help explicate incommensurability in terms of taxonomic\nclassification, Kuhn developed the no-overlap principle. The\nno-overlap principle precludes cross-classification of objects into\ndifferent kinds within a theory’s taxonomy. According to the\nno-overlap principle, no two kind terms may overlap in their referents\nunless they are related as species to genus. For example, there are no\ndogs that are also cats; no gold that is also silver, and that is what\nmakes the terms ‘dogs’, ‘cats’,\n‘silver’, and ‘gold’ kind terms (Kuhn 2000\n[1991], 92). Such kind terms are used to state laws and theories and\nmust be learned together through experience (2000 [1993],\n230; cf. Barker et al. 2003, 214 ff.). There are two possibilities.\nMost kind terms must be learned as members of one or another contrast\nset. For example to learn the term ‘liquid’, one must also\nmaster the terms ‘solid’ and ‘gas’. Other\ntypes of kind terms are not learned through contrast sets, but\ntogether with closely related terms through their joint application to\nsituations that exemplify natural laws. For example, the term\n‘force’ must be learned together with terms like\n‘mass’ and ‘weight’ through an application of\nHooke’s law and either Newton’s three laws of motion or\nelse the first and third laws together with the law of gravity (2000\n[1993], 231). According to Kuhn, scientific revolutions change the\nstructural relations between pre-existing kind terms, breaking the\nno-overlap principle (2000 [1991], 92–96]. This is to say that\ntheories separated by a revolution cross-classify the same things into\nmutually exclusive sets of kinds. A kind from one taxonomy is mutually\nexclusive with another if it cannot simply be introduced into it\nbecause the objects to which it refers would be subject to different\nsets of natural laws. This would result in conflicting expectations\nabout the same objects, loss of logical relations between statements\nmade with those concepts, and ultimately incoherence and\nmiscommunication (Kuhn 2000 [1993], 232, 238). For example,\nPtolemy’s theory classifies the sun as a planet, where planets\norbit the earth, while Copernicus’ theory classifies the sun as\na star, where planets orbit stars like the sun. A correct statement\naccording to Copernican theory, such as “Planets orbit the\nsun” is incoherent in Ptolemaic vocabulary (2000 [1991], 94).\nMoreover, the Copernican claim that the planets orbit the sun could\nnot even have been made without abandoning the Ptolemaic concepts and\ndeveloping new ones to replace (and not supplement) them.\n\nFurthermore, Kuhn (in a move toward Feyerabend’s view) now\nclaims that the same types of difficulties in communication that arise\ndue to incommensurability between members of different scientific\ncommunities separated by the passage of time also occur\nbetween members of different contemporaneous sub-disciplines that\nresult from scientific revolutions (Kuhn 2000 [1993], 238). This\nrepresents a significant change to his original phase-model of\nscientific advance, and a corresponding shift in his application of\nthe notion of incommensurability. Kuhn no longer represents scientific\nadvance as a linear progression from pre-normal science to\nnormal science, through crisis to revolution that results in a new\nphase of normal science. Instead, scientific revolutions are\ncompared to the process of speciation in biology, in that they result\nin branching into sub-disciplines that resemble a\nphylogenetic tree. The application of the relation of\nincommensurability is no longer restricted to diachronic episodes of\nscientific advance in which two theories are separated by a\nrevolution. The contemporaneous sub-disciplines that result from a\nscientific revolution can also be incommensurable with each other. The\nincommensurability derives from different training required to master\nthe incompatible kind terms used to state their laws and theories.\nThese shared kind terms cross-classify the same set of objects into\ndifferent sets of kinds, resulting in mutually exclusive lexical\ntaxonomies that break the no-overlap principle. Moreover, now not only\nare both processes (scientific progress and biological evolution)\nsimilar in that they are not fixed in advance on some set goal (i.e.\ntruth), but driven from behind (i.e. away from anomalies that play an\nanalogous role to selection pressure), but also the incommensurability\nof scientific theories is presented as analogous to the isolating\nmechanisms required for speciation (Kuhn 2000 [1991],\n94–99).\n\nKuhn compared the function of such lexical taxonomies to Kant’s\na priori when taken in a relativized sense. Each lexicon\nmakes a corresponding form of life possible within which the truth or\nfalsity of propositions may be both claimed and rationally justified.\nFor example, with the Aristotelian lexicon, one can speak of the truth\nor falsity of Aristotelian assertions, but these truth values have no\nbearing on the truth of apparently similar assertions made with the\nNewtonian lexicon (Kuhn 2000 [1993], 244). A lexicon is thus\nconstitutive of the objects of knowledge (Kuhn 2000 [1993],\n245); and consequently, Kuhn rejected characterizations of scientific\nprogress according to which science zeros in on the truth:\n“no shared metric is available to compare our\nassertions … and thus to provide a basis for a claim that our\n(or, for that matter, his) are closer to the truth” (2000\n[1993], 244). Instead, the logical status of a lexical structure, like\nthat of word-meanings in general, is that of convention, and the\njustification of a lexicon or of lexical change can only be pragmatic\n(2000 [1993], 244). Kuhn thus reaffirmed his earlier claim that the\nnotion of a match or correspondence between the ontology of a theory\nand its real counterpart in nature is illusive in principle (1970,\n206; 2000 [1993], 244). The implications that incommensurability has\nfor scientific realism have been widely discussed and continue to be\ncontroversial (cf. Devitt 2001, Oberheim and Hoyningen-Huene 1997,\nSankey 2009).\n\nA lexicon is not only prerequisite to making meaningful statements, it\nalso sets limits on what can be meaningfully said within the community\nof speakers that share it: “There is, for example, no way, even\nin an enriched Newtonian vocabulary, to convey the Aristotelian\npropositions regularly misconstrued as asserting the proportionality\nof force and motion or the impossibility of a void. Using our\nconceptual lexicon, these Aristotelian propositions cannot be\nexpressed — they are simply ineffable — and we are barred\nby the no-overlap principle from access to the concepts required to\nexpress them ” (Kuhn 2000 [1993], 244; cf. 2000 [1989], 76). In\nthis way, Kuhn’s later notion of the incommensurability of\nscientific theories is based on effability. The structure of\nthe lexicon shared by a particular community determines how the world\ncan be described by its members, as well as how they will\nmisunderstand the history of their own discipline; that is, unless\nthey learn to understand older terms according to the structure of the\nolder lexicon. Where Kuhn had earlier likened the process by which\nhistorians come to understand antiquated science as a special type of\ntranslation, he retracted these claims, insisting that the process is\none of language learning, not translation (2000 [1993], 238, 244).\nKuhn often claimed that incommensurable theories are untranslatable\n(e.g. Kuhn 2000 [1991], 94). However, he also emphasized that\ntranslation is neither needed in the comparison of incommensurable\ntheories, nor in the hermeneutic historical method necessary to\nunderstand antiquated sciences (Kuhn 2000 [1993], 237, 238, 244). To\novercome the barriers posed by incommensurability to understanding\nantiquated sciences, and to understanding the special technical\nvocabulary used by contemporaneous, phylogenetically related\nsub-disciplines, it is neither necessary not possible to translate\nbetween them. Rather, one must become bilingual, learning to\nuse (and keep separate) the incongruently structured lexical\ntaxonomies underwriting different laws and theories.\n2.3.2 Methodological incommensurability\n\nAs Kuhn refined his notion of incommensurability as a special type of\nconceptual incompatibility, some commentators began to distinguish it\nfrom ‘methodological incommensurability’. Methodological\nincommensurability is the idea that there are no shared, objective\nstandards of scientific theory appraisal, so that there are no\nexternal or neutral standards that univocally determine the\ncomparative evaluation of competing theories (Sankey and\nHoyningen-Huene 2001, xiii). This idea has also been recently\ndiscussed in detail under the rubric\n“Kuhn-underdetermination” (Carrier 2008, 278). The basic\nidea was developed out of Kuhn and Feyerabend’s rejections of\nthe traditional view that a distinguishing feature of science is a\nuniform, invariant scientific method, that remains fixed throughout\nits development (Kuhn 1962, 94, 103; Feyerabend 1975, 23–32; cf.\nFarrell 2003). Feyerabend famously argued that every proposed\nmethodological rule has been fruitfully violated at some point in the\ncourse of scientific advance, and that only by breaking such rules\ncould scientists have made the progressive steps for which they are\npraised (1975). He concluded that the idea of a fixed, historically\ninvariant scientific method is a myth. There are no universally\napplicable methodological rules. The only methodological rule that is\nuniversally applicable is ‘anything goes’, which buys its\nuniversality at the cost of being completely empty (1970a, 105). Kuhn\nchallenged the traditional view of scientific method as a set of\nrules, claiming that the standards of theory appraisal, such as\nsimplicity, accuracy, consistency, scope and fruitfulness (1977, 322),\ndepend on and vary with the currently dominant paradigm. He is often\ncited for having pointed out that as in political revolutions, so in\nchoice of paradigm, there is no standard higher than the assent of the\nrelevant community (1962, 94), and as having argued that there is\n“no neutral algorithm for theory choice, no systematic decision\nprocedure which, properly applied, must lead each individual in the\ngroup to the same decision” (1970, 200). Kuhn developed the idea\nthat such epistemic standards do not function as rules that determine\nrational theory choice, but as values that merely guide it (1977,\n331). Different scientists apply these values differently, and they\nmay even pull in different directions, so that there may be rational\ndisagreement between scientists from incommensurable paradigms, who\nsupport different theories due to their weighing the same values\ndifferently.\n",
    "section_title": "2.3 Kuhn’s subsequent development of incommensurability",
    "entry_title": "The Incommensurability of Scientific Theories",
    "hierarchy_title": "The Incommensurability of Scientific Theories || Revolutionary paradigms: Thomas Kuhn on incommensurability || Kuhn’s subsequent development of incommensurability",
    "tokenized_text": [
        "revolutionary",
        "paradigm",
        "thomas",
        "kuhn",
        "incommensurability",
        "kuhn",
        "subsequent",
        "development",
        "incommensurability",
        "kuhn",
        "subsequent",
        "development",
        "incommensurability",
        "kuhn",
        "continued",
        "struggle",
        "develop",
        "refine",
        "understanding",
        "incommensurability",
        "death",
        "although",
        "development",
        "incommensurability",
        "went",
        "several",
        "stage",
        "cf",
        "hoyningenhuene",
        "claimed",
        "made",
        "series",
        "significant",
        "breakthrough",
        "beginning",
        "kuhn",
        "described",
        "number",
        "essay",
        "published",
        "lecture",
        "collected",
        "kuhn",
        "cf",
        "chs",
        "last",
        "yet",
        "unpublished",
        "book",
        "kuhn",
        "incommensurability",
        "still",
        "pending",
        "conant",
        "haugeland",
        "nature",
        "development",
        "controversial",
        "commentator",
        "claim",
        "kuhn",
        "incommensurability",
        "thesis",
        "underwent",
        "major",
        "transformation",
        "sankey",
        "others",
        "including",
        "kuhn",
        "see",
        "specific",
        "characterization",
        "original",
        "core",
        "insight",
        "hoyningenhuene",
        "kuhn",
        "ff",
        "chen",
        "kuhn",
        "original",
        "holistic",
        "characterization",
        "incommensurability",
        "distinguished",
        "two",
        "separate",
        "thesis",
        "taxonomic",
        "incommensurability",
        "involves",
        "conceptual",
        "change",
        "contrast",
        "methodological",
        "incommensurability",
        "involves",
        "epistemic",
        "value",
        "used",
        "evaluate",
        "theory",
        "sankey",
        "sankey",
        "hoyningenhuene",
        "see",
        "section",
        "taxonomic",
        "incommensurability",
        "kuhn",
        "continued",
        "emphasize",
        "difference",
        "normal",
        "cumulative",
        "growth",
        "change",
        "existing",
        "concept",
        "discovery",
        "boyle",
        "law",
        "left",
        "concept",
        "gas",
        "pressure",
        "volume",
        "instrument",
        "used",
        "measure",
        "unchanged",
        "revolutionary",
        "discovery",
        "could",
        "made",
        "basis",
        "antecedently",
        "available",
        "concept",
        "discovery",
        "newton",
        "theory",
        "kuhn",
        "development",
        "require",
        "replacing",
        "existing",
        "concept",
        "new",
        "concept",
        "incompatible",
        "older",
        "idea",
        "help",
        "explain",
        "nature",
        "conceptual",
        "incompatibility",
        "kuhn",
        "adopted",
        "notion",
        "lexical",
        "taxonomy",
        "lexicon",
        "linguistics",
        "lexical",
        "taxonomy",
        "store",
        "structure",
        "vocabulary",
        "used",
        "state",
        "law",
        "theory",
        "specifically",
        "kind",
        "thing",
        "describe",
        "mental",
        "module",
        "member",
        "speech",
        "community",
        "store",
        "kind",
        "term",
        "prerequisite",
        "generalization",
        "description",
        "communicate",
        "term",
        "speaker",
        "use",
        "meaning",
        "speaker",
        "need",
        "use",
        "criterion",
        "identifying",
        "something",
        "member",
        "particular",
        "kind",
        "one",
        "ornithologist",
        "might",
        "identify",
        "duck",
        "beak",
        "another",
        "tail",
        "cf",
        "hoyningenhuene",
        "speaker",
        "need",
        "share",
        "homologous",
        "lexical",
        "structure",
        "vocabulary",
        "incorporating",
        "system",
        "taxonomic",
        "classification",
        "suffices",
        "ensure",
        "refer",
        "object",
        "kind",
        "term",
        "two",
        "theory",
        "share",
        "taxonomic",
        "lexical",
        "structure",
        "incommensurable",
        "cf",
        "sankey",
        "wolf",
        "help",
        "explicate",
        "incommensurability",
        "term",
        "taxonomic",
        "classification",
        "kuhn",
        "developed",
        "nooverlap",
        "principle",
        "nooverlap",
        "principle",
        "precludes",
        "crossclassification",
        "object",
        "different",
        "kind",
        "within",
        "theory",
        "taxonomy",
        "according",
        "nooverlap",
        "principle",
        "two",
        "kind",
        "term",
        "may",
        "overlap",
        "referent",
        "unless",
        "related",
        "specie",
        "genus",
        "example",
        "dog",
        "also",
        "cat",
        "gold",
        "also",
        "silver",
        "make",
        "term",
        "dog",
        "cat",
        "silver",
        "gold",
        "kind",
        "term",
        "kuhn",
        "kind",
        "term",
        "used",
        "state",
        "law",
        "theory",
        "must",
        "learned",
        "together",
        "experience",
        "cf",
        "barker",
        "et",
        "al",
        "ff",
        "two",
        "possibility",
        "kind",
        "term",
        "must",
        "learned",
        "member",
        "one",
        "another",
        "contrast",
        "set",
        "example",
        "learn",
        "term",
        "liquid",
        "one",
        "must",
        "also",
        "master",
        "term",
        "solid",
        "gas",
        "type",
        "kind",
        "term",
        "learned",
        "contrast",
        "set",
        "together",
        "closely",
        "related",
        "term",
        "joint",
        "application",
        "situation",
        "exemplify",
        "natural",
        "law",
        "example",
        "term",
        "force",
        "must",
        "learned",
        "together",
        "term",
        "like",
        "mass",
        "weight",
        "application",
        "hooke",
        "law",
        "either",
        "newton",
        "three",
        "law",
        "motion",
        "else",
        "first",
        "third",
        "law",
        "together",
        "law",
        "gravity",
        "according",
        "kuhn",
        "scientific",
        "revolution",
        "change",
        "structural",
        "relation",
        "preexisting",
        "kind",
        "term",
        "breaking",
        "nooverlap",
        "principle",
        "say",
        "theory",
        "separated",
        "revolution",
        "crossclassify",
        "thing",
        "mutually",
        "exclusive",
        "set",
        "kind",
        "kind",
        "one",
        "taxonomy",
        "mutually",
        "exclusive",
        "another",
        "simply",
        "introduced",
        "object",
        "refers",
        "would",
        "subject",
        "different",
        "set",
        "natural",
        "law",
        "would",
        "result",
        "conflicting",
        "expectation",
        "object",
        "loss",
        "logical",
        "relation",
        "statement",
        "made",
        "concept",
        "ultimately",
        "incoherence",
        "miscommunication",
        "kuhn",
        "example",
        "ptolemy",
        "theory",
        "classifies",
        "sun",
        "planet",
        "planet",
        "orbit",
        "earth",
        "copernicus",
        "theory",
        "classifies",
        "sun",
        "star",
        "planet",
        "orbit",
        "star",
        "like",
        "sun",
        "correct",
        "statement",
        "according",
        "copernican",
        "theory",
        "planet",
        "orbit",
        "sun",
        "incoherent",
        "ptolemaic",
        "vocabulary",
        "moreover",
        "copernican",
        "claim",
        "planet",
        "orbit",
        "sun",
        "could",
        "even",
        "made",
        "without",
        "abandoning",
        "ptolemaic",
        "concept",
        "developing",
        "new",
        "one",
        "replace",
        "supplement",
        "furthermore",
        "kuhn",
        "move",
        "toward",
        "feyerabend",
        "view",
        "claim",
        "type",
        "difficulty",
        "communication",
        "arise",
        "due",
        "incommensurability",
        "member",
        "different",
        "scientific",
        "community",
        "separated",
        "passage",
        "time",
        "also",
        "occur",
        "member",
        "different",
        "contemporaneous",
        "subdisciplines",
        "result",
        "scientific",
        "revolution",
        "kuhn",
        "represents",
        "significant",
        "change",
        "original",
        "phasemodel",
        "scientific",
        "advance",
        "corresponding",
        "shift",
        "application",
        "notion",
        "incommensurability",
        "kuhn",
        "longer",
        "represents",
        "scientific",
        "advance",
        "linear",
        "progression",
        "prenormal",
        "science",
        "normal",
        "science",
        "crisis",
        "revolution",
        "result",
        "new",
        "phase",
        "normal",
        "science",
        "instead",
        "scientific",
        "revolution",
        "compared",
        "process",
        "speciation",
        "biology",
        "result",
        "branching",
        "subdisciplines",
        "resemble",
        "phylogenetic",
        "tree",
        "application",
        "relation",
        "incommensurability",
        "longer",
        "restricted",
        "diachronic",
        "episode",
        "scientific",
        "advance",
        "two",
        "theory",
        "separated",
        "revolution",
        "contemporaneous",
        "subdisciplines",
        "result",
        "scientific",
        "revolution",
        "also",
        "incommensurable",
        "incommensurability",
        "derives",
        "different",
        "training",
        "required",
        "master",
        "incompatible",
        "kind",
        "term",
        "used",
        "state",
        "law",
        "theory",
        "shared",
        "kind",
        "term",
        "crossclassify",
        "set",
        "object",
        "different",
        "set",
        "kind",
        "resulting",
        "mutually",
        "exclusive",
        "lexical",
        "taxonomy",
        "break",
        "nooverlap",
        "principle",
        "moreover",
        "process",
        "scientific",
        "progress",
        "biological",
        "evolution",
        "similar",
        "fixed",
        "advance",
        "set",
        "goal",
        "ie",
        "truth",
        "driven",
        "behind",
        "ie",
        "away",
        "anomaly",
        "play",
        "analogous",
        "role",
        "selection",
        "pressure",
        "also",
        "incommensurability",
        "scientific",
        "theory",
        "presented",
        "analogous",
        "isolating",
        "mechanism",
        "required",
        "speciation",
        "kuhn",
        "kuhn",
        "compared",
        "function",
        "lexical",
        "taxonomy",
        "kant",
        "priori",
        "taken",
        "relativized",
        "sense",
        "lexicon",
        "make",
        "corresponding",
        "form",
        "life",
        "possible",
        "within",
        "truth",
        "falsity",
        "proposition",
        "may",
        "claimed",
        "rationally",
        "justified",
        "example",
        "aristotelian",
        "lexicon",
        "one",
        "speak",
        "truth",
        "falsity",
        "aristotelian",
        "assertion",
        "truth",
        "value",
        "bearing",
        "truth",
        "apparently",
        "similar",
        "assertion",
        "made",
        "newtonian",
        "lexicon",
        "kuhn",
        "lexicon",
        "thus",
        "constitutive",
        "object",
        "knowledge",
        "kuhn",
        "consequently",
        "kuhn",
        "rejected",
        "characterization",
        "scientific",
        "progress",
        "according",
        "science",
        "zero",
        "truth",
        "shared",
        "metric",
        "available",
        "compare",
        "assertion",
        "thus",
        "provide",
        "basis",
        "claim",
        "matter",
        "closer",
        "truth",
        "instead",
        "logical",
        "status",
        "lexical",
        "structure",
        "like",
        "wordmeanings",
        "general",
        "convention",
        "justification",
        "lexicon",
        "lexical",
        "change",
        "pragmatic",
        "kuhn",
        "thus",
        "reaffirmed",
        "earlier",
        "claim",
        "notion",
        "match",
        "correspondence",
        "ontology",
        "theory",
        "real",
        "counterpart",
        "nature",
        "illusive",
        "principle",
        "implication",
        "incommensurability",
        "scientific",
        "realism",
        "widely",
        "discussed",
        "continue",
        "controversial",
        "cf",
        "devitt",
        "oberheim",
        "hoyningenhuene",
        "sankey",
        "lexicon",
        "prerequisite",
        "making",
        "meaningful",
        "statement",
        "also",
        "set",
        "limit",
        "meaningfully",
        "said",
        "within",
        "community",
        "speaker",
        "share",
        "example",
        "way",
        "even",
        "enriched",
        "newtonian",
        "vocabulary",
        "convey",
        "aristotelian",
        "proposition",
        "regularly",
        "misconstrued",
        "asserting",
        "proportionality",
        "force",
        "motion",
        "impossibility",
        "void",
        "using",
        "conceptual",
        "lexicon",
        "aristotelian",
        "proposition",
        "expressed",
        "simply",
        "ineffable",
        "barred",
        "nooverlap",
        "principle",
        "access",
        "concept",
        "required",
        "express",
        "kuhn",
        "cf",
        "way",
        "kuhn",
        "later",
        "notion",
        "incommensurability",
        "scientific",
        "theory",
        "based",
        "effability",
        "structure",
        "lexicon",
        "shared",
        "particular",
        "community",
        "determines",
        "world",
        "described",
        "member",
        "well",
        "misunderstand",
        "history",
        "discipline",
        "unless",
        "learn",
        "understand",
        "older",
        "term",
        "according",
        "structure",
        "older",
        "lexicon",
        "kuhn",
        "earlier",
        "likened",
        "process",
        "historian",
        "come",
        "understand",
        "antiquated",
        "science",
        "special",
        "type",
        "translation",
        "retracted",
        "claim",
        "insisting",
        "process",
        "one",
        "language",
        "learning",
        "translation",
        "kuhn",
        "often",
        "claimed",
        "incommensurable",
        "theory",
        "untranslatable",
        "eg",
        "kuhn",
        "however",
        "also",
        "emphasized",
        "translation",
        "neither",
        "needed",
        "comparison",
        "incommensurable",
        "theory",
        "hermeneutic",
        "historical",
        "method",
        "necessary",
        "understand",
        "antiquated",
        "science",
        "kuhn",
        "overcome",
        "barrier",
        "posed",
        "incommensurability",
        "understanding",
        "antiquated",
        "science",
        "understanding",
        "special",
        "technical",
        "vocabulary",
        "used",
        "contemporaneous",
        "phylogenetically",
        "related",
        "subdisciplines",
        "neither",
        "necessary",
        "possible",
        "translate",
        "rather",
        "one",
        "must",
        "become",
        "bilingual",
        "learning",
        "use",
        "keep",
        "separate",
        "incongruently",
        "structured",
        "lexical",
        "taxonomy",
        "underwriting",
        "different",
        "law",
        "theory",
        "methodological",
        "incommensurability",
        "kuhn",
        "refined",
        "notion",
        "incommensurability",
        "special",
        "type",
        "conceptual",
        "incompatibility",
        "commentator",
        "began",
        "distinguish",
        "methodological",
        "incommensurability",
        "methodological",
        "incommensurability",
        "idea",
        "shared",
        "objective",
        "standard",
        "scientific",
        "theory",
        "appraisal",
        "external",
        "neutral",
        "standard",
        "univocally",
        "determine",
        "comparative",
        "evaluation",
        "competing",
        "theory",
        "sankey",
        "hoyningenhuene",
        "xiii",
        "idea",
        "also",
        "recently",
        "discussed",
        "detail",
        "rubric",
        "kuhnunderdetermination",
        "carrier",
        "basic",
        "idea",
        "developed",
        "kuhn",
        "feyerabend",
        "rejection",
        "traditional",
        "view",
        "distinguishing",
        "feature",
        "science",
        "uniform",
        "invariant",
        "scientific",
        "method",
        "remains",
        "fixed",
        "throughout",
        "development",
        "kuhn",
        "feyerabend",
        "cf",
        "farrell",
        "feyerabend",
        "famously",
        "argued",
        "every",
        "proposed",
        "methodological",
        "rule",
        "fruitfully",
        "violated",
        "point",
        "course",
        "scientific",
        "advance",
        "breaking",
        "rule",
        "could",
        "scientist",
        "made",
        "progressive",
        "step",
        "praised",
        "concluded",
        "idea",
        "fixed",
        "historically",
        "invariant",
        "scientific",
        "method",
        "myth",
        "universally",
        "applicable",
        "methodological",
        "rule",
        "methodological",
        "rule",
        "universally",
        "applicable",
        "anything",
        "go",
        "buy",
        "universality",
        "cost",
        "completely",
        "empty",
        "a",
        "kuhn",
        "challenged",
        "traditional",
        "view",
        "scientific",
        "method",
        "set",
        "rule",
        "claiming",
        "standard",
        "theory",
        "appraisal",
        "simplicity",
        "accuracy",
        "consistency",
        "scope",
        "fruitfulness",
        "depend",
        "vary",
        "currently",
        "dominant",
        "paradigm",
        "often",
        "cited",
        "pointed",
        "political",
        "revolution",
        "choice",
        "paradigm",
        "standard",
        "higher",
        "assent",
        "relevant",
        "community",
        "argued",
        "neutral",
        "algorithm",
        "theory",
        "choice",
        "systematic",
        "decision",
        "procedure",
        "properly",
        "applied",
        "must",
        "lead",
        "individual",
        "group",
        "decision",
        "kuhn",
        "developed",
        "idea",
        "epistemic",
        "standard",
        "function",
        "rule",
        "determine",
        "rational",
        "theory",
        "choice",
        "value",
        "merely",
        "guide",
        "different",
        "scientist",
        "apply",
        "value",
        "differently",
        "may",
        "even",
        "pull",
        "different",
        "direction",
        "may",
        "rational",
        "disagreement",
        "scientist",
        "incommensurable",
        "paradigm",
        "support",
        "different",
        "theory",
        "due",
        "weighing",
        "value",
        "differently"
    ]
}