{
    "main_text": "Alternative Conceptions of Justification || Pragmatic vindication of induction\n5.3 Pragmatic vindication of induction\n\nAnother solution based on an alternative criterion for justification\nis the “pragmatic” approach initiated by Reichenbach (1938\n[2006]). Reichenbach did think Hume’s argument unassailable, but\nnonetheless he attempted to provide a weaker kind of justification for\ninduction. In order to emphasize the difference from the kind of\njustification Hume sought, some have given it a different term and\nrefer to Reichenbach’s solution as a “vindication”,\nrather than a justification of induction (Feigl 1950; Salmon\n1963).\n\nReichenbach argued that it was not necessary for the justification of\ninductive inference to show that its conclusion is true. Rather\n“the proof of the truth of the conclusion is only a sufficient\ncondition for the justification of induction, not a necessary\ncondition” (Reichenbach 2006: 348). If it could be shown, he\nsays, that inductive inference is a necessary condition of success,\nthen even if we do not know that it will succeed, we still have some\nreason to follow it. Reichenbach makes a comparison to the situation\nwhere a man is suffering from a disease, and the physician says\n“I do not know whether an operation will save the man, but if\nthere is any remedy, it is an operation” (Reichenbach 1938\n[2006: 349]). This provides some kind of justification for operating\non the man, even if one does not know that the operation will\nsucceed.\n\nIn order to get a full account, of course, we need to say more about\nwhat is meant for a method to have “success”, or to\n“work”. Reichenbach thought that this should be defined in\nrelation to the aim of induction. This aim, he thought, is\n“to find series of events whose frequency of occurrence\nconverges towards a limit” (1938 [2006: 350]).\n\nReichenbach applied his strategy to a general form of\n“statistical induction” in which we observe the relative\nfrequency \\(f_n\\) of a particular event in n observations and\nthen form expectations about the frequency that will arise when more\nobservations are made. The “inductive principle” then\nstates that if after a certain number of instances, an observed\nfrequency of \\(m/n\\) is observed, for any prolongation of the series\nof observations, the frequency will continue to fall within a small\ninterval of \\(m/n\\). Hume’s examples are special cases of this\nprinciple, where the observed frequency is 1. For example, in\nHume’s bread case, suppose bread was observed to nourish\nn times out of n (i.e. an observed frequency of\n100%), then according to the principle of induction, we expect that as\nwe observe more instances, the frequency of nourishing ones will\ncontinue to be within a very small interval of 100%. Following this\ninductive principle is also sometimes referred to as following the\n“straight rule”. The problem then is to justify the use of\nthis rule.\n\nReichenbach argued that even if Hume is right to think that we cannot\nbe justified in thinking for any particular application of the rule\nthat the conclusion is likely to be true, for the purposes of\npractical action we do not need to establish this. We can instead\nregard the inductive rule as resulting in a “posit”, or\nstatement that we deal with as if it is true. We posit a certain\nfrequency f on the basis of our evidence, and this is like\nmaking a wager or bet that the frequency is in fact f. One\nstrategy for positing frequencies is to follow the rule of\ninduction.\n\nReichenbach proposes that we can show that the rule of induction meets\nhis weaker justification condition. This does not require showing that\nfollowing the inductive principle will always work. It is possible\nthat the world is so disorderly that we cannot construct series with\nany limits. In that case, neither the inductive principle, nor any\nother method will succeed. But, he argues, if there is a limit, by\nfollowing the inductive principle we will eventually find it. There is\nsome element of a series of observations, beyond which the principle\nof induction will lead to the true value of the limit. Although the\ninductive rule may give quite wrong results early in the sequence, as\nit follows chance fluctuations in the sample frequency, it is\nguaranteed to eventually approximate the limiting frequency, if such a\nlimit exists. Therefore, the rule of induction is justified as an\ninstrument of positing because it is a method of which we know that if\nit is possible to achieve the aim of inductive inference we shall do\nso by means of this method (Reichenbach 1949: 475).\n\nOne might question whether Reichenbach has achieved his goal of\nshowing that following the inductive rule is a necessary condition of\nsuccess. In order to show that, one would also need to establish that\nno other methods can also achieve the aim. But, as Reichenbach himself\nrecognises, many other rules of inference as well as the straight rule\nmay also converge on the limit (Salmon 1966: 53). In fact, any method\nwhich converges asymptotically to the straight rule also does so. An\neasily specified class of such rules are those which add to the\ninductive rule a function \\(c_n\\) in which the \\(c_n\\) converge to\nzero with increasing n.\n\nReichenbach makes two suggestions aimed at avoiding this problem. On\nthe one hand, he claims, since we have no real way to pick between\nmethods, we might as well just use the inductive rule since it is\n“easier to handle, owing to its descriptive simplicity”.\nHe also claims that the method which embodies the “smallest\nrisk” is following the inductive rule (Reichenbach 1938 [2006:\n355–356]).\n\nThere is also the concern that there could be a completely different\nkind of rule which converges on the limit. We can consider, for\nexample, the possibility of a soothsayer or psychic who is able to\npredict future events reliably. Here Reichenbach argues that induction\nis still necessary in such a case, because it has to be used to check\nwhether the other method works. It is only by using induction,\nReichenbach says, that we could recognise the reliability of the\nalternative method, by examining its track record.\n\nIn assessing this argument, it is helpful to distinguish between\nlevels at which the principle of induction can be applied. Following\nSkyrms (2000), we may distinguish between level 1, where candidate\nmethods are applied to ordinary events or individuals, and level 2,\nwhere they are applied not to individuals or events, but to the\narguments on level 1. Let us refer to “object-induction”\nwhen the inductive principle is applied at level 1, and\n“meta-induction” when it is applied at level 2.\nReichenbach’s response does not rule out the possibility that\nanother method might do better than object-induction at level 1. It\nonly shows that the success of that other method may be recognised by\na meta-induction at level 2 (Skyrms 2000). Nonetheless,\nReichenbach’s thought was later picked up and developed into the\nsuggestion that a meta-inductivist who applies induction not only at\nthe object level to observations, but also to the success of\nothers’ methods, might by those means be able to do as well\npredictively as the alternative method (Schurz 2008; see\n section 5.5\n for more discussion of meta-induction).\n\nReichenbach’s justification is generally taken to be a pragmatic\none, since though it does not supply knowledge of a future event, it\nsupplies a sufficient reason for action (Reichenbach 1949: 481). One\nmight question whether a pragmatic argument can really deliver an\nall-purpose, general justification for following the inductive rule.\nSurely a pragmatic solution should be sensitive to differences in\npay-offs that depend on the circumstances. For example, Reichenbach\noffers the following analogue to his pragmatic justification:\n\n\nWe may compare our situation to that of a man who wants to fish in an\nunexplored part of the sea. There is no one to tell him whether or not\nthere are fish in this place. Shall he cast his net? Well, if he wants\nto fish in that place, I should advise him to cast the net, to take\nthe chance at least. It is preferable to try even in uncertainty than\nnot to try and be certain of getting nothing. (Reichenbach 1938 [2006:\n362–363])\n\n\nAs Lange points out, the argument here “presumes that there is\nno cost to trying”. In such a situation, “the fisherman\nhas everything to gain and nothing to lose by casting his net”\n(Lange 2011: 77). But if there is some significant cost to making the\nattempt, it may not be so clear that the most rational course of\naction is to cast the net. Similarly, whether or not it would make\nsense to adopt the policy of making no predictions, rather than the\npolicy of following the inductive rule, may depend on what the\npractical penalties are for being wrong. A pragmatic solution may not\nbe capable of offering rationale for following the inductive rule\nwhich is applicable in all circumstances.\n\nAnother question is whether Reichenbach has specified the aim of\ninduction too narrowly. Finding series of events whose frequency of\noccurrence converges to a limit ties the vindication to the long-run,\nwhile allowing essentially no constraint on what can be posited in the\nshort-run. Yet it is in the short run that inductive practice actually\noccurs and where it really needs justification (BonJour 1998: 194;\nSalmon 1966: 53).\n",
    "section_title": "5.3 Pragmatic vindication of induction",
    "entry_title": "The Problem of Induction",
    "hierarchy_title": "The Problem of Induction || Alternative Conceptions of Justification || Pragmatic vindication of induction",
    "tokenized_text": [
        "alternative",
        "conception",
        "justification",
        "pragmatic",
        "vindication",
        "induction",
        "pragmatic",
        "vindication",
        "induction",
        "another",
        "solution",
        "based",
        "alternative",
        "criterion",
        "justification",
        "pragmatic",
        "approach",
        "initiated",
        "reichenbach",
        "reichenbach",
        "think",
        "hume",
        "argument",
        "unassailable",
        "nonetheless",
        "attempted",
        "provide",
        "weaker",
        "kind",
        "justification",
        "induction",
        "order",
        "emphasize",
        "difference",
        "kind",
        "justification",
        "hume",
        "sought",
        "given",
        "different",
        "term",
        "refer",
        "reichenbach",
        "solution",
        "vindication",
        "rather",
        "justification",
        "induction",
        "feigl",
        "salmon",
        "reichenbach",
        "argued",
        "necessary",
        "justification",
        "inductive",
        "inference",
        "show",
        "conclusion",
        "true",
        "rather",
        "proof",
        "truth",
        "conclusion",
        "sufficient",
        "condition",
        "justification",
        "induction",
        "necessary",
        "condition",
        "reichenbach",
        "could",
        "shown",
        "say",
        "inductive",
        "inference",
        "necessary",
        "condition",
        "success",
        "even",
        "know",
        "succeed",
        "still",
        "reason",
        "follow",
        "reichenbach",
        "make",
        "comparison",
        "situation",
        "man",
        "suffering",
        "disease",
        "physician",
        "say",
        "know",
        "whether",
        "operation",
        "save",
        "man",
        "remedy",
        "operation",
        "reichenbach",
        "provides",
        "kind",
        "justification",
        "operating",
        "man",
        "even",
        "one",
        "know",
        "operation",
        "succeed",
        "order",
        "get",
        "full",
        "account",
        "course",
        "need",
        "say",
        "meant",
        "method",
        "success",
        "work",
        "reichenbach",
        "thought",
        "defined",
        "relation",
        "aim",
        "induction",
        "aim",
        "thought",
        "find",
        "series",
        "event",
        "whose",
        "frequency",
        "occurrence",
        "converges",
        "towards",
        "limit",
        "reichenbach",
        "applied",
        "strategy",
        "general",
        "form",
        "statistical",
        "induction",
        "observe",
        "relative",
        "frequency",
        "f_n",
        "particular",
        "event",
        "n",
        "observation",
        "form",
        "expectation",
        "frequency",
        "arise",
        "observation",
        "made",
        "inductive",
        "principle",
        "state",
        "certain",
        "number",
        "instance",
        "observed",
        "frequency",
        "mn",
        "observed",
        "prolongation",
        "series",
        "observation",
        "frequency",
        "continue",
        "fall",
        "within",
        "small",
        "interval",
        "mn",
        "hume",
        "example",
        "special",
        "case",
        "principle",
        "observed",
        "frequency",
        "example",
        "hume",
        "bread",
        "case",
        "suppose",
        "bread",
        "observed",
        "nourish",
        "n",
        "time",
        "n",
        "ie",
        "observed",
        "frequency",
        "according",
        "principle",
        "induction",
        "expect",
        "observe",
        "instance",
        "frequency",
        "nourishing",
        "one",
        "continue",
        "within",
        "small",
        "interval",
        "following",
        "inductive",
        "principle",
        "also",
        "sometimes",
        "referred",
        "following",
        "straight",
        "rule",
        "problem",
        "justify",
        "use",
        "rule",
        "reichenbach",
        "argued",
        "even",
        "hume",
        "right",
        "think",
        "justified",
        "thinking",
        "particular",
        "application",
        "rule",
        "conclusion",
        "likely",
        "true",
        "purpose",
        "practical",
        "action",
        "need",
        "establish",
        "instead",
        "regard",
        "inductive",
        "rule",
        "resulting",
        "posit",
        "statement",
        "deal",
        "true",
        "posit",
        "certain",
        "frequency",
        "f",
        "basis",
        "evidence",
        "like",
        "making",
        "wager",
        "bet",
        "frequency",
        "fact",
        "f",
        "one",
        "strategy",
        "positing",
        "frequency",
        "follow",
        "rule",
        "induction",
        "reichenbach",
        "proposes",
        "show",
        "rule",
        "induction",
        "meet",
        "weaker",
        "justification",
        "condition",
        "require",
        "showing",
        "following",
        "inductive",
        "principle",
        "always",
        "work",
        "possible",
        "world",
        "disorderly",
        "construct",
        "series",
        "limit",
        "case",
        "neither",
        "inductive",
        "principle",
        "method",
        "succeed",
        "argues",
        "limit",
        "following",
        "inductive",
        "principle",
        "eventually",
        "find",
        "element",
        "series",
        "observation",
        "beyond",
        "principle",
        "induction",
        "lead",
        "true",
        "value",
        "limit",
        "although",
        "inductive",
        "rule",
        "may",
        "give",
        "quite",
        "wrong",
        "result",
        "early",
        "sequence",
        "follows",
        "chance",
        "fluctuation",
        "sample",
        "frequency",
        "guaranteed",
        "eventually",
        "approximate",
        "limiting",
        "frequency",
        "limit",
        "exists",
        "therefore",
        "rule",
        "induction",
        "justified",
        "instrument",
        "positing",
        "method",
        "know",
        "possible",
        "achieve",
        "aim",
        "inductive",
        "inference",
        "shall",
        "mean",
        "method",
        "reichenbach",
        "one",
        "might",
        "question",
        "whether",
        "reichenbach",
        "achieved",
        "goal",
        "showing",
        "following",
        "inductive",
        "rule",
        "necessary",
        "condition",
        "success",
        "order",
        "show",
        "one",
        "would",
        "also",
        "need",
        "establish",
        "method",
        "also",
        "achieve",
        "aim",
        "reichenbach",
        "recognises",
        "many",
        "rule",
        "inference",
        "well",
        "straight",
        "rule",
        "may",
        "also",
        "converge",
        "limit",
        "salmon",
        "fact",
        "method",
        "converges",
        "asymptotically",
        "straight",
        "rule",
        "also",
        "easily",
        "specified",
        "class",
        "rule",
        "add",
        "inductive",
        "rule",
        "function",
        "c_n",
        "c_n",
        "converge",
        "zero",
        "increasing",
        "n",
        "reichenbach",
        "make",
        "two",
        "suggestion",
        "aimed",
        "avoiding",
        "problem",
        "one",
        "hand",
        "claim",
        "since",
        "real",
        "way",
        "pick",
        "method",
        "might",
        "well",
        "use",
        "inductive",
        "rule",
        "since",
        "easier",
        "handle",
        "owing",
        "descriptive",
        "simplicity",
        "also",
        "claim",
        "method",
        "embodies",
        "smallest",
        "risk",
        "following",
        "inductive",
        "rule",
        "reichenbach",
        "also",
        "concern",
        "could",
        "completely",
        "different",
        "kind",
        "rule",
        "converges",
        "limit",
        "consider",
        "example",
        "possibility",
        "soothsayer",
        "psychic",
        "able",
        "predict",
        "future",
        "event",
        "reliably",
        "reichenbach",
        "argues",
        "induction",
        "still",
        "necessary",
        "case",
        "used",
        "check",
        "whether",
        "method",
        "work",
        "using",
        "induction",
        "reichenbach",
        "say",
        "could",
        "recognise",
        "reliability",
        "alternative",
        "method",
        "examining",
        "track",
        "record",
        "assessing",
        "argument",
        "helpful",
        "distinguish",
        "level",
        "principle",
        "induction",
        "applied",
        "following",
        "skyrms",
        "may",
        "distinguish",
        "level",
        "candidate",
        "method",
        "applied",
        "ordinary",
        "event",
        "individual",
        "level",
        "applied",
        "individual",
        "event",
        "argument",
        "level",
        "let",
        "u",
        "refer",
        "objectinduction",
        "inductive",
        "principle",
        "applied",
        "level",
        "metainduction",
        "applied",
        "level",
        "reichenbach",
        "response",
        "rule",
        "possibility",
        "another",
        "method",
        "might",
        "better",
        "objectinduction",
        "level",
        "show",
        "success",
        "method",
        "may",
        "recognised",
        "metainduction",
        "level",
        "skyrms",
        "nonetheless",
        "reichenbach",
        "thought",
        "later",
        "picked",
        "developed",
        "suggestion",
        "metainductivist",
        "applies",
        "induction",
        "object",
        "level",
        "observation",
        "also",
        "success",
        "others",
        "method",
        "might",
        "mean",
        "able",
        "well",
        "predictively",
        "alternative",
        "method",
        "schurz",
        "see",
        "section",
        "discussion",
        "metainduction",
        "reichenbach",
        "justification",
        "generally",
        "taken",
        "pragmatic",
        "one",
        "since",
        "though",
        "supply",
        "knowledge",
        "future",
        "event",
        "supply",
        "sufficient",
        "reason",
        "action",
        "reichenbach",
        "one",
        "might",
        "question",
        "whether",
        "pragmatic",
        "argument",
        "really",
        "deliver",
        "allpurpose",
        "general",
        "justification",
        "following",
        "inductive",
        "rule",
        "surely",
        "pragmatic",
        "solution",
        "sensitive",
        "difference",
        "payoffs",
        "depend",
        "circumstance",
        "example",
        "reichenbach",
        "offer",
        "following",
        "analogue",
        "pragmatic",
        "justification",
        "may",
        "compare",
        "situation",
        "man",
        "want",
        "fish",
        "unexplored",
        "part",
        "sea",
        "one",
        "tell",
        "whether",
        "fish",
        "place",
        "shall",
        "cast",
        "net",
        "well",
        "want",
        "fish",
        "place",
        "advise",
        "cast",
        "net",
        "take",
        "chance",
        "least",
        "preferable",
        "try",
        "even",
        "uncertainty",
        "try",
        "certain",
        "getting",
        "nothing",
        "reichenbach",
        "lange",
        "point",
        "argument",
        "presumes",
        "cost",
        "trying",
        "situation",
        "fisherman",
        "everything",
        "gain",
        "nothing",
        "lose",
        "casting",
        "net",
        "lange",
        "significant",
        "cost",
        "making",
        "attempt",
        "may",
        "clear",
        "rational",
        "course",
        "action",
        "cast",
        "net",
        "similarly",
        "whether",
        "would",
        "make",
        "sense",
        "adopt",
        "policy",
        "making",
        "prediction",
        "rather",
        "policy",
        "following",
        "inductive",
        "rule",
        "may",
        "depend",
        "practical",
        "penalty",
        "wrong",
        "pragmatic",
        "solution",
        "may",
        "capable",
        "offering",
        "rationale",
        "following",
        "inductive",
        "rule",
        "applicable",
        "circumstance",
        "another",
        "question",
        "whether",
        "reichenbach",
        "specified",
        "aim",
        "induction",
        "narrowly",
        "finding",
        "series",
        "event",
        "whose",
        "frequency",
        "occurrence",
        "converges",
        "limit",
        "tie",
        "vindication",
        "longrun",
        "allowing",
        "essentially",
        "constraint",
        "posited",
        "shortrun",
        "yet",
        "short",
        "run",
        "inductive",
        "practice",
        "actually",
        "occurs",
        "really",
        "need",
        "justification",
        "bonjour",
        "salmon"
    ]
}