{
    "main_text": "Reconstruction\n2. Reconstruction\n\nHume’s argument has been presented and formulated in many\ndifferent versions. There is also an ongoing lively discussion over\nthe historical interpretation of what Hume himself intended by the\nargument. It is therefore difficult to provide an unequivocal and\nuncontroversial reconstruction of Hume’s argument. Nonetheless,\nfor the purposes of organizing the different responses to Hume’s\nproblem that will be discussed in this article, the following\nreconstruction will serve as a useful starting point.\n\nHume’s argument concerns specific inductive inferences such\nas:\n\n\nAll observed instances of A have been B.\n\nThe next instance of A will be B.\n\n\nLet us call this “inference I”. Inferences which\nfall under this type of schema are now often referred to as cases of\n“simple enumerative induction”.\n\nHume’s own example is:\n\n\nAll observed instances of bread (of a particular appearance) have been\nnourishing.\n\nThe next instance of bread (of that appearance) will be\nnourishing.\n\n\nHume’s argument then proceeds as follows (premises are labeled\nas P, and subconclusions and conclusions as C):\n\n\nP1.\nThere are only two kinds of arguments: demonstrative and probable\n(Hume’s fork).\nP2.\nInference I presupposes the Uniformity Principle\n(UP).\n\n1st horn:\n\nP3. A\ndemonstrative argument establishes a conclusion whose negation is a\ncontradiction.\nP4. The\nnegation of the UP is not a contradiction.\nC1.There is no\ndemonstrative argument for the UP (by P3 and P4).\n\n\n2nd horn:\n\nP5. Any\nprobable argument for UP presupposes UP.\nP6. An argument\nfor a principle may not presuppose the same principle\n(Non-circularity).\nC2. There is\nno probable argument for the UP (by P5 and P6).\n\n\nConsequences:\n\nC3. There is no argument\nfor the UP (by P1, C1 and C2).\nP7. If there is no\nargument for the UP, there is no chain of reasoning from the premises\nto the conclusion of any inference that presupposes the UP.\nC4. There is\nno chain of reasoning from the premises to the conclusion of inference\nI (by P2, C3 and P7).\nP8. If there\nis no chain of reasoning from the premises to the conclusion of\ninference I, the inference is not justified.\nC5. Inference\nI is not justified (by C4 and P8).\n\n\n\nThere have been different interpretations of what Hume means by\n“demonstrative” and “probable” arguments.\nSometimes “demonstrative” is equated with\n“deductive”, and probable with “inductive”\n(e.g., Salmon 1966). Then the first horn of Hume’s dilemma would\neliminate the possibility of a deductive argument, and the second\nwould eliminate the possibility of an inductive argument. However,\nunder this interpretation,\n premise P3\n would not hold, because it is possible for the conclusion of a\ndeductive argument to be a non-necessary proposition. Premise\n P3\n could be modified to say that a demonstrative (deductive) argument\nestablishes a conclusion that cannot be false if the premises are\ntrue. But then it becomes possible that the supposition that the\nfuture resembles the past, which is not a necessary proposition, could\nbe established by a deductive argument from some premises, though not\nfrom a priori premises (in contradiction to conclusion\n C1).\n\nAnother common reading is to equate “demonstrative” with\n“deductively valid with a priori premises”, and\n“probable” with “having an empirical premise”\n(e.g., Okasha 2001). This may be closer to the mark, if one thinks, as\nHume seems to have done, that premises which can be known a\npriori cannot be false, and hence are necessary. If the inference\nis deductively valid, then the conclusion of the inference from a\npriori premises must also be necessary. What the first horn of\nthe dilemma then rules out is the possibility of a deductively valid\nargument with a priori premises, and the second horn rules\nout any argument (deductive or non-deductive), which relies on an\nempirical premise.\n\nHowever, recent commentators have argued that in the historical\ncontext that Hume was situated in, the distinction he draws between\ndemonstrative and probable arguments has little to do with whether or\nnot the argument has a deductive form (Owen 1999; Garrett 2002). In\naddition, the class of inferences that establish conclusions whose\nnegation is a contradiction may include not just deductively valid\ninferences from a priori premises, but any inferences that\ncan be drawn using a priori reasoning (that is, reasoning\nwhere the transition from premises to the conclusion makes no appeal\nto what we learn from observations). It looks as though Hume does\nintend the argument of the first horn to rule out any a\npriori reasoning, since he says that a change in the course of\nnature cannot be ruled out “by any demonstrative argument or\nabstract reasoning a priori” (E. 5.2.18). On this\nunderstanding, a priori arguments would be ruled out by the\nfirst horn of Hume’s dilemma, and empirical arguments by the\nsecond horn. This is the interpretation that I will adopt for the\npurposes of this article.\n\nIn Hume’s argument, the UP plays a central role. As we will see\nin\n section 4.2,\n various authors have been doubtful about this principle. Versions of\nHume’s argument have also been formulated which do not make\nreference to the UP. Rather they directly address the question of what\narguments can be given in support of the transition from the premises\nto the conclusion of the specific inductive inference I. What\narguments could lead us, for example, to infer that the next piece of\nbread will nourish from the observations of nourishing bread made so\nfar? For the first horn of the argument, Hume’s argument can be\ndirectly applied. A demonstrative argument establishes a conclusion\nwhose negation is a contradiction. The negation of the conclusion of\nthe inductive inference is not a contradiction. It is not a\ncontradiction that the next piece of bread is not nourishing.\nTherefore, there is no demonstrative argument for the conclusion of\nthe inductive inference. In the second horn of the argument, the\nproblem Hume raises is a circularity. Even if Hume is wrong that all\ninductive inferences depend on the UP, there may still be a\ncircularity problem, but as we shall see in\n section 4.1,\n the exact nature of the circularity needs to be carefully considered.\nBut the main point at present is that the Humean argument is often\nformulated without invoking the UP.\n\nSince Hume’s argument is a dilemma, there are two main ways to\nresist it. The first is to tackle the first horn and to argue that\nthere is after all a demonstrative argument –here taken to mean\nan argument based on a priori reasoning—that can\njustify the inductive inference. The second is to tackle the second\nhorn and to argue that there is after all a probable (or empirical)\nargument that can justify the inductive inference. We discuss the\ndifferent variants of these two approaches in sections\n 3\n and\n 4.\n\nThere are also those who dispute the consequences of the dilemma. For\nexample, some scholars have denied that Hume should be read as\ninvoking a premise such\n premise P8\n at all. The reason, they claim, is that he was not aiming for an\nexplicitly normative conclusion about justification such as\n C5.\n Hume certainly is seeking a “chain of reasoning” from the\npremises of the inductive inference to the conclusion, and he thinks\nthat an argument for the UP is necessary to complete the chain.\nHowever, one could think that there is no further premise regarding\njustification, and so the conclusion of his argument is simply\n C4:\n there is no chain of reasoning from the premises to the conclusion of\nan inductive inference. Hume could then be, as Don Garrett and David\nOwen have argued, advancing a “thesis in cognitive\npsychology”, rather than making a normative claim about\njustification (Owen 1999; Garrett 2002). The thesis is about the\nnature of the cognitive process underlying the inference. According to\nGarrett, the main upshot of Hume’s argument is that there can be\nno reasoning process that establishes the UP. For Owen, the message is\nthat the inference is not drawn through a chain of ideas connected by\nmediating links, as would be characteristic of the faculty of\nreason.\n\nThere are also interpreters who have argued that Hume is merely trying\nto exclude a specific kind of justification of induction, based on a\nconception of reason predominant among rationalists of his time,\nrather than a justification in general (Beauchamp & Rosenberg\n1981; Baier 2009). In particular, it has been claimed that it is\n“an attempt to refute the rationalist belief that at least some\ninductive arguments are demonstrative” (Beauchamp &\nRosenberg 1981: xviii). Under this interpretation,\n premise P8\n should be modified to read something like:\n\nIf there is no chain of reasoning based on demonstrative arguments\nfrom the premises to the conclusion of inference I, then\ninference I is not justified.\n\n\nSuch interpretations do however struggle with the fact that\nHume’s argument is explicitly a two-pronged attack, which\nconcerns not just demonstrative arguments, but also probable\narguments.\n\nThe question of how expansive a normative conclusion to attribute to\nHume is a complex one. It depends in part on the interpretation of\nHume’s own solution to his problem. As we saw in\n section 1,\n Hume attributes the basis of inductive inference to principles of the\nimagination in the Treatise, and in the Enquiry to\n“custom”, “habit”, conceived as a kind of\nnatural instinct. The question is then whether this alternative\nprovides any kind of justification for the inference, even if not one\nbased on reason. On the face of it, it looks as though Hume is\nsuggesting that inductive inferences proceed on an entirely arational\nbasis. He clearly does not think that they do not succeed in producing\ngood outcomes. In fact, Hume even suggests that this operation of the\nmind may even be less “liable to error and mistake” than\nif it were entrusted to “the fallacious deductions of our\nreason, which is slow in its operations” (E. 5.2.22). It is also\nnot clear that he sees the workings of the imagination as completely\ndevoid of rationality. For one thing, Hume talks about the imagination\nas governed by principles. Later in the Treatise, he\neven gives “rules” and “logic” for\ncharacterizing what should count as a good causal inference (T.\n1.3.15). He also clearly sees it as possible to distinguish between\nbetter forms of such “reasoning”, as he continues to call\nit. Thus, there may be grounds to argue that Hume was not trying to\nargue that inductive inferences have no rational foundation\nwhatsoever, but merely that they do not have the specific type of\nrational foundation which is rooted in the faculty of Reason.\n\nAll this indicates that there is room for debate over the intended\nscope of Hume’s own conclusion. And thus there is also room for\ndebate over exactly what form a premise (such as\n premise P8)\n that connects the rest of his argument to a normative conclusion\nshould take. No matter who is right about this however, the fact\nremains that Hume has throughout history been predominantly read as\npresenting an argument for inductive skepticism.\n\nThere are a number of approaches which effectively, if not explicitly,\ntake issue with\n premise P8\n and argue that providing a chain of reasoning from the premises to\nthe conclusion is not a necessary condition for justification of an\ninductive inference. According to this type of approach, one may admit\nthat Hume has shown that inductive inferences are not justified in the\nsense that we have reasons to think their conclusions true, but still\nthink that weaker kinds of justification of induction are possible\n (section 5).\n Finally, there are some philosophers who do accept the skeptical\nconclusion\n C5\n and attempt to accommodate it. For example, there have been attempts\nto argue that inductive inference is not as central to scientific\ninquiry as is often thought\n (section 6).\n",
    "section_title": "2. Reconstruction",
    "entry_title": "The Problem of Induction",
    "hierarchy_title": "The Problem of Induction || Reconstruction",
    "tokenized_text": [
        "reconstruction",
        "reconstruction",
        "hume",
        "argument",
        "presented",
        "formulated",
        "many",
        "different",
        "version",
        "also",
        "ongoing",
        "lively",
        "discussion",
        "historical",
        "interpretation",
        "hume",
        "intended",
        "argument",
        "therefore",
        "difficult",
        "provide",
        "unequivocal",
        "uncontroversial",
        "reconstruction",
        "hume",
        "argument",
        "nonetheless",
        "purpose",
        "organizing",
        "different",
        "response",
        "hume",
        "problem",
        "discussed",
        "article",
        "following",
        "reconstruction",
        "serve",
        "useful",
        "starting",
        "point",
        "hume",
        "argument",
        "concern",
        "specific",
        "inductive",
        "inference",
        "observed",
        "instance",
        "b",
        "next",
        "instance",
        "b",
        "let",
        "u",
        "call",
        "inference",
        "inference",
        "fall",
        "type",
        "schema",
        "often",
        "referred",
        "case",
        "simple",
        "enumerative",
        "induction",
        "hume",
        "example",
        "observed",
        "instance",
        "bread",
        "particular",
        "appearance",
        "nourishing",
        "next",
        "instance",
        "bread",
        "appearance",
        "nourishing",
        "hume",
        "argument",
        "proceeds",
        "follows",
        "premise",
        "labeled",
        "p",
        "subconclusions",
        "conclusion",
        "c",
        "p",
        "two",
        "kind",
        "argument",
        "demonstrative",
        "probable",
        "hume",
        "fork",
        "p",
        "inference",
        "presupposes",
        "uniformity",
        "principle",
        "st",
        "horn",
        "p",
        "demonstrative",
        "argument",
        "establishes",
        "conclusion",
        "whose",
        "negation",
        "contradiction",
        "p",
        "negation",
        "contradiction",
        "cthere",
        "demonstrative",
        "argument",
        "p",
        "p",
        "nd",
        "horn",
        "p",
        "probable",
        "argument",
        "presupposes",
        "p",
        "argument",
        "principle",
        "may",
        "presuppose",
        "principle",
        "noncircularity",
        "c",
        "probable",
        "argument",
        "p",
        "p",
        "consequence",
        "c",
        "argument",
        "p",
        "c",
        "c",
        "p",
        "argument",
        "chain",
        "reasoning",
        "premise",
        "conclusion",
        "inference",
        "presupposes",
        "c",
        "chain",
        "reasoning",
        "premise",
        "conclusion",
        "inference",
        "p",
        "c",
        "p",
        "p",
        "chain",
        "reasoning",
        "premise",
        "conclusion",
        "inference",
        "inference",
        "justified",
        "c",
        "inference",
        "justified",
        "c",
        "p",
        "different",
        "interpretation",
        "hume",
        "mean",
        "demonstrative",
        "probable",
        "argument",
        "sometimes",
        "demonstrative",
        "equated",
        "deductive",
        "probable",
        "inductive",
        "eg",
        "salmon",
        "first",
        "horn",
        "hume",
        "dilemma",
        "would",
        "eliminate",
        "possibility",
        "deductive",
        "argument",
        "second",
        "would",
        "eliminate",
        "possibility",
        "inductive",
        "argument",
        "however",
        "interpretation",
        "premise",
        "p",
        "would",
        "hold",
        "possible",
        "conclusion",
        "deductive",
        "argument",
        "nonnecessary",
        "proposition",
        "premise",
        "p",
        "could",
        "modified",
        "say",
        "demonstrative",
        "deductive",
        "argument",
        "establishes",
        "conclusion",
        "false",
        "premise",
        "true",
        "becomes",
        "possible",
        "supposition",
        "future",
        "resembles",
        "past",
        "necessary",
        "proposition",
        "could",
        "established",
        "deductive",
        "argument",
        "premise",
        "though",
        "priori",
        "premise",
        "contradiction",
        "conclusion",
        "c",
        "another",
        "common",
        "reading",
        "equate",
        "demonstrative",
        "deductively",
        "valid",
        "priori",
        "premise",
        "probable",
        "empirical",
        "premise",
        "eg",
        "okasha",
        "may",
        "closer",
        "mark",
        "one",
        "think",
        "hume",
        "seems",
        "done",
        "premise",
        "known",
        "priori",
        "false",
        "hence",
        "necessary",
        "inference",
        "deductively",
        "valid",
        "conclusion",
        "inference",
        "priori",
        "premise",
        "must",
        "also",
        "necessary",
        "first",
        "horn",
        "dilemma",
        "rule",
        "possibility",
        "deductively",
        "valid",
        "argument",
        "priori",
        "premise",
        "second",
        "horn",
        "rule",
        "argument",
        "deductive",
        "nondeductive",
        "relies",
        "empirical",
        "premise",
        "however",
        "recent",
        "commentator",
        "argued",
        "historical",
        "context",
        "hume",
        "situated",
        "distinction",
        "draw",
        "demonstrative",
        "probable",
        "argument",
        "little",
        "whether",
        "argument",
        "deductive",
        "form",
        "owen",
        "garrett",
        "addition",
        "class",
        "inference",
        "establish",
        "conclusion",
        "whose",
        "negation",
        "contradiction",
        "may",
        "include",
        "deductively",
        "valid",
        "inference",
        "priori",
        "premise",
        "inference",
        "drawn",
        "using",
        "priori",
        "reasoning",
        "reasoning",
        "transition",
        "premise",
        "conclusion",
        "make",
        "appeal",
        "learn",
        "observation",
        "look",
        "though",
        "hume",
        "intend",
        "argument",
        "first",
        "horn",
        "rule",
        "priori",
        "reasoning",
        "since",
        "say",
        "change",
        "course",
        "nature",
        "ruled",
        "demonstrative",
        "argument",
        "abstract",
        "reasoning",
        "priori",
        "e",
        "understanding",
        "priori",
        "argument",
        "would",
        "ruled",
        "first",
        "horn",
        "hume",
        "dilemma",
        "empirical",
        "argument",
        "second",
        "horn",
        "interpretation",
        "adopt",
        "purpose",
        "article",
        "hume",
        "argument",
        "play",
        "central",
        "role",
        "see",
        "section",
        "various",
        "author",
        "doubtful",
        "principle",
        "version",
        "hume",
        "argument",
        "also",
        "formulated",
        "make",
        "reference",
        "rather",
        "directly",
        "address",
        "question",
        "argument",
        "given",
        "support",
        "transition",
        "premise",
        "conclusion",
        "specific",
        "inductive",
        "inference",
        "i",
        "argument",
        "could",
        "lead",
        "u",
        "example",
        "infer",
        "next",
        "piece",
        "bread",
        "nourish",
        "observation",
        "nourishing",
        "bread",
        "made",
        "far",
        "first",
        "horn",
        "argument",
        "hume",
        "argument",
        "directly",
        "applied",
        "demonstrative",
        "argument",
        "establishes",
        "conclusion",
        "whose",
        "negation",
        "contradiction",
        "negation",
        "conclusion",
        "inductive",
        "inference",
        "contradiction",
        "contradiction",
        "next",
        "piece",
        "bread",
        "nourishing",
        "therefore",
        "demonstrative",
        "argument",
        "conclusion",
        "inductive",
        "inference",
        "second",
        "horn",
        "argument",
        "problem",
        "hume",
        "raise",
        "circularity",
        "even",
        "hume",
        "wrong",
        "inductive",
        "inference",
        "depend",
        "may",
        "still",
        "circularity",
        "problem",
        "shall",
        "see",
        "section",
        "exact",
        "nature",
        "circularity",
        "need",
        "carefully",
        "considered",
        "main",
        "point",
        "present",
        "humean",
        "argument",
        "often",
        "formulated",
        "without",
        "invoking",
        "since",
        "hume",
        "argument",
        "dilemma",
        "two",
        "main",
        "way",
        "resist",
        "first",
        "tackle",
        "first",
        "horn",
        "argue",
        "demonstrative",
        "argument",
        "here",
        "taken",
        "mean",
        "argument",
        "based",
        "priori",
        "reasoningthat",
        "justify",
        "inductive",
        "inference",
        "second",
        "tackle",
        "second",
        "horn",
        "argue",
        "probable",
        "empirical",
        "argument",
        "justify",
        "inductive",
        "inference",
        "discus",
        "different",
        "variant",
        "two",
        "approach",
        "section",
        "also",
        "dispute",
        "consequence",
        "dilemma",
        "example",
        "scholar",
        "denied",
        "hume",
        "read",
        "invoking",
        "premise",
        "premise",
        "p",
        "reason",
        "claim",
        "aiming",
        "explicitly",
        "normative",
        "conclusion",
        "justification",
        "c",
        "hume",
        "certainly",
        "seeking",
        "chain",
        "reasoning",
        "premise",
        "inductive",
        "inference",
        "conclusion",
        "think",
        "argument",
        "necessary",
        "complete",
        "chain",
        "however",
        "one",
        "could",
        "think",
        "premise",
        "regarding",
        "justification",
        "conclusion",
        "argument",
        "simply",
        "c",
        "chain",
        "reasoning",
        "premise",
        "conclusion",
        "inductive",
        "inference",
        "hume",
        "could",
        "garrett",
        "david",
        "owen",
        "argued",
        "advancing",
        "thesis",
        "cognitive",
        "psychology",
        "rather",
        "making",
        "normative",
        "claim",
        "justification",
        "owen",
        "garrett",
        "thesis",
        "nature",
        "cognitive",
        "process",
        "underlying",
        "inference",
        "according",
        "garrett",
        "main",
        "upshot",
        "hume",
        "argument",
        "reasoning",
        "process",
        "establishes",
        "owen",
        "message",
        "inference",
        "drawn",
        "chain",
        "idea",
        "connected",
        "mediating",
        "link",
        "would",
        "characteristic",
        "faculty",
        "reason",
        "also",
        "interpreter",
        "argued",
        "hume",
        "merely",
        "trying",
        "exclude",
        "specific",
        "kind",
        "justification",
        "induction",
        "based",
        "conception",
        "reason",
        "predominant",
        "among",
        "rationalist",
        "time",
        "rather",
        "justification",
        "general",
        "beauchamp",
        "rosenberg",
        "baier",
        "particular",
        "claimed",
        "attempt",
        "refute",
        "rationalist",
        "belief",
        "least",
        "inductive",
        "argument",
        "demonstrative",
        "beauchamp",
        "rosenberg",
        "xviii",
        "interpretation",
        "premise",
        "p",
        "modified",
        "read",
        "something",
        "like",
        "chain",
        "reasoning",
        "based",
        "demonstrative",
        "argument",
        "premise",
        "conclusion",
        "inference",
        "inference",
        "justified",
        "interpretation",
        "however",
        "struggle",
        "fact",
        "hume",
        "argument",
        "explicitly",
        "twopronged",
        "attack",
        "concern",
        "demonstrative",
        "argument",
        "also",
        "probable",
        "argument",
        "question",
        "expansive",
        "normative",
        "conclusion",
        "attribute",
        "hume",
        "complex",
        "one",
        "depends",
        "part",
        "interpretation",
        "hume",
        "solution",
        "problem",
        "saw",
        "section",
        "hume",
        "attribute",
        "basis",
        "inductive",
        "inference",
        "principle",
        "imagination",
        "treatise",
        "enquiry",
        "custom",
        "habit",
        "conceived",
        "kind",
        "natural",
        "instinct",
        "question",
        "whether",
        "alternative",
        "provides",
        "kind",
        "justification",
        "inference",
        "even",
        "one",
        "based",
        "reason",
        "face",
        "look",
        "though",
        "hume",
        "suggesting",
        "inductive",
        "inference",
        "proceed",
        "entirely",
        "arational",
        "basis",
        "clearly",
        "think",
        "succeed",
        "producing",
        "good",
        "outcome",
        "fact",
        "hume",
        "even",
        "suggests",
        "operation",
        "mind",
        "may",
        "even",
        "le",
        "liable",
        "error",
        "mistake",
        "entrusted",
        "fallacious",
        "deduction",
        "reason",
        "slow",
        "operation",
        "e",
        "also",
        "clear",
        "see",
        "working",
        "imagination",
        "completely",
        "devoid",
        "rationality",
        "one",
        "thing",
        "hume",
        "talk",
        "imagination",
        "governed",
        "principle",
        "later",
        "treatise",
        "even",
        "give",
        "rule",
        "logic",
        "characterizing",
        "count",
        "good",
        "causal",
        "inference",
        "t",
        "also",
        "clearly",
        "see",
        "possible",
        "distinguish",
        "better",
        "form",
        "reasoning",
        "continues",
        "call",
        "thus",
        "may",
        "ground",
        "argue",
        "hume",
        "trying",
        "argue",
        "inductive",
        "inference",
        "rational",
        "foundation",
        "whatsoever",
        "merely",
        "specific",
        "type",
        "rational",
        "foundation",
        "rooted",
        "faculty",
        "reason",
        "indicates",
        "room",
        "debate",
        "intended",
        "scope",
        "hume",
        "conclusion",
        "thus",
        "also",
        "room",
        "debate",
        "exactly",
        "form",
        "premise",
        "premise",
        "p",
        "connects",
        "rest",
        "argument",
        "normative",
        "conclusion",
        "take",
        "matter",
        "right",
        "however",
        "fact",
        "remains",
        "hume",
        "throughout",
        "history",
        "predominantly",
        "read",
        "presenting",
        "argument",
        "inductive",
        "skepticism",
        "number",
        "approach",
        "effectively",
        "explicitly",
        "take",
        "issue",
        "premise",
        "p",
        "argue",
        "providing",
        "chain",
        "reasoning",
        "premise",
        "conclusion",
        "necessary",
        "condition",
        "justification",
        "inductive",
        "inference",
        "according",
        "type",
        "approach",
        "one",
        "may",
        "admit",
        "hume",
        "shown",
        "inductive",
        "inference",
        "justified",
        "sense",
        "reason",
        "think",
        "conclusion",
        "true",
        "still",
        "think",
        "weaker",
        "kind",
        "justification",
        "induction",
        "possible",
        "section",
        "finally",
        "philosopher",
        "accept",
        "skeptical",
        "conclusion",
        "c",
        "attempt",
        "accommodate",
        "example",
        "attempt",
        "argue",
        "inductive",
        "inference",
        "central",
        "scientific",
        "inquiry",
        "often",
        "thought",
        "section"
    ]
}