{
    "main_text": "Probability || Infinitude in the mathematics of probability: more advanced issues\n6.3 Infinitude in the mathematics of probability: more advanced issues\n\nTo state some of the thornier puzzles generated by the mathematics of\nprobability, we need a more formal presentation. Kolmogorov’s\n(1933/1950) axiomatization begins with a finite set \\(\\Omega\\) and an\nalgebra \\(F\\) of subsets of \\(\\Omega\\): a set closed under\ncomplementation and union. The members of \\(\\Omega\\) are known as\nstates while the members of \\(F\\) are known as\nevents. A probability function is a function from \\(F\\) to\nthe real numbers. It is non-negative, assigns 1 to \\(\\Omega\\), and it\nis (finitely) additive—the probability that one of two mutually\nexclusive events occurs is the sum of their individual\nprobabilities:\n\nFinite additivity\n\nIf \\(A\\) and \\(B\\) are disjoint sets in \\(F\\), then \\(P(A \\cup B) =\nP(A) + P(B)\\).\n\nKolmogorov goes on to generalize this to an infinite\n\\(\\Omega\\), and to a sigma-algebra \\(F\\) of subsets of\n\\(\\Omega\\): a set closed under complementation and countable\nunion. Additivity is strengthened to hold also in infinite cases:\n\nCountable additivity\n\nIf \\(\\{A_i\\}\\) is a countably infinite collection of (pairwise)\ndisjoint sets, each in \\(F\\), then \n\\[ P(\\bigcup_{n=1}^{\\infty} A_n) = \\sum_{n=1}^{\\infty} P(A_n) \\]\n\n\nSome have felt that restricting additivity to merely countable sums is\narbitrary, and is merely an artifact of the summation technique\nintroduced in section\n 3.2.\n An alternate technique for summing infinite sets of non-negative\nnumbers takes advantage of the fact that a sum of nonnegative numbers\nas defined earlier doesn’t depend on the order of the terms. We\nconsider the set of all partial sums of arbitrary finite subsets of\nthe set, and take the least upper bound of this set to represent the\nsum of the set as a whole. If this sum is some positive finite value\n\\(k\\), then we can see that at most \\(nk\\) of the terms in the set\nbeing summed can be greater than 1/\\(n\\). Since every positive real\nnumber is greater than 1/\\(n\\) for some \\(n\\), this means that the set\nof positive elements of the set is a countable union of finite sets,\nand thus must be countable. That is, if a set being summed in this way\nhas uncountably many non-zero elements, the sum must be infinite.\n\nSo if we require full (unrestricted) additivity, rather than merely\ncountable additivity, then we can see that at most countably many\nevents have positive probability, and their probabilities sum to 1. A\nprobability distribution with these features, where events of\nprobability 0 have been removed, is known as a discrete\ndistribution (such as the Poisson, geometric, or negative binomial\ndistributions). For such a distribution, the probabilities of the\nindividual states determine the probabilities of all events through\nthe use of additivity.\n\nHowever, many applications of probability require what are known as\ncontinuous distributions (such as the uniform/rectangular,\nnormal, and beta distributions), and thus require a restriction to\ncountable additivity. In a continuous distribution, there are\nuncountably many states, usually named by real numbers. Each\nindividual state has probability 0, even though events containing\nuncountably many states often have non-zero probability. (This\nviolates full additivity.) However, in the common continuous\ndistributions, there is usually a way to define a probability density\nfor each state, such that the probability of any event is the integral\nof the density over the states that make it up. In finite and discrete\ndistributions, it is standard to treat events of probability 0 as if\nthey do not happen, while in continuous distributions there is always\nsome event of probability 0 that occurs.\n\nFor finite and discrete distributions, there is a straightforward\ndefinition of a concept of conditional probability. For any two events\n\\(A\\) and \\(B\\), the probability of \\(A\\) conditional on \\(B\\),\nnotated as \\(P(A\\mid B)\\), is defined as \\(P(A \\amp B)/P(B)\\), if the\nprobability of B is non-zero, and undefined otherwise. For any fixed\n\\(B\\), the function \\(P(\\_ \\mid B)\\) is another probability function\non the same space. We can prove the Law of Total Probability. If\n\\(B_1, B_2, B_3,\\ldots\\) form a partition (that is, every outcome is\nin exactly one of the \\(B_i)\\) then: \n\\[ P(A) = \\sum_i P(B_i)P(A \\mid B_i). \\]\n\n\nThis tells us that the unconditional probability \\(P(A)\\) is a\nweighted average of the conditional probabilities \\(P(A\\mid\nB_i)\\).\n\nHowever, for distributions that are not discrete, so that the set of\nstates is uncountable in an essential way, and events of probability 0\noften occur, we can’t use this ratio definition of conditional\nprobability, since it would involve dividing by 0. However, Kolmogorov\nnotes (1933/1950, Ch. 5) that for any suitably nice partition, it is\nstill possible to come up with a definition of conditional probability\nconditional on events in this partition, satisfying a generalization\nof the Law of Total Probability, replacing the sum with an\nintegral: \n\\[ P(A) = \\int P(A \\mid B)dP(B) \\]\n\n\n(The possibility of finding a conditional probability satisfying this\nintegral formula is known as ‘disintegrability’, and it is\nequivalent to a principle known as “conglomerability”. For\nphilosophical arguments in favor of this, see Easwaran (2013b, 2019),\nRescorla (2018).) For more on determining when conditional\nprobabilities that satisfy this rule exist, see\nHoffmann-Jørgensen (1971), and for more on how to use\nprobability densities to calculate these conditional probabilities,\nsee Chang and Pollard (1997).\n\nHowever, there are some difficulties with this account of conditional\nprobability. Kolmogorov notes that if the original probability space\nis the uniform distribution of points on a sphere, and if \\(B\\) ranges\nover the set of longitudes (great circles through the poles), then\nprobability conditional on a line of longitude will not be uniform,\nbut instead will be concentrated near the equator. (This fact is known\nas the “Borel paradox”, because Emile Borel investigated\nit even before Kolmogorov’s work.) Since every great circle on a\nsphere can be viewed as a line of longitude with an appropriate choice\nof pole, this makes the probability conditional on an event depend not\nonly on which event was chosen, but also which family of alternatives\nit is contrasted with. (We can view each great circle as a\nlongitudinal line through multiple different poles, each of which\ndisagrees about where the equator is.)\n\nSome have found this consequence troubling enough that they have\nendorsed an alternative account of conditional probability that gives\nup the Law of Total Probability, and instead insists that \\(P(A|B)\\)\nhas a unique value regardless of which alternatives to \\(B\\) are under\nconsideration. However, this also has some unpalatable consequences.\nSince \\(P(A)\\) is no longer the average of \\(P(A|B)\\) where \\(B\\)\nranges over the elements of a partition, this means that there are\nsome partitions such that every element of the partition is positively\ncorrelated with \\(A\\). Furthermore, the conditional probability\nfunctions generated in this way no longer satisfy countable additivity\n(Kadane, Schervish, and Seidenfeld 1996, Seidenfeld, Schervish, and\nKadane 2001, 2013).\n\nBut some, starting with de Finetti (1937, 1972, 1974) have argued on\nother grounds that we should give up even countable additivity and\nonly accept finite additivity, with a correspondingly broader class of\nprobability distributions. One of de Finetti’s chief arguments\ninvolves an infinite lottery with each natural number appearing on\nexactly one ticket. We would like to assign each ticket the same\nprobability of being drawn. Under countable additivity, this is not\npossible. For if we assign probability 0 to each number’s being\npicked, then the sum of all these probabilities is again 0; yet the\nunion of all of these events has probability 1 (since it is guaranteed\nthat some number will be picked), and \\(1 \\ne 0\\). On the other hand,\nif we assign some (real-valued) probability \\(\\varepsilon \\gt 0\\) to\neach number being picked, then the sum of these probabilities diverges\nto \\(\\infty\\), and \\(1 \\ne \\infty\\). If we drop countable additivity,\nhowever, then we may assign 0 to each event and 1 to their union\nwithout contradiction. In the\n\nSupplement on God’s Lottery,\n\n\nwe explore how an alternative approach to Kolmogorov’s, a\nnon-Archimedean probability theory (NAP), can account for de\nFinetti’s lottery by assigning an infinitesimal probability to\neach ticket.\n\nHowever, a probability function that satisfies finite additivity\nwithout satisfying countable additivity is mathematically much more\ncomplicated than one that satisfies countable additivity. To even\nprove the existence of such a function over the algebra of subsets of\na countable set of states requires the Axiom of Choice. With countable\nadditivity, it is possible to specify a discrete probability function\nby enumerating the probabilities of the countably many states, and it\nis possible to specify a continuous probability function by\nenumerating the probabilities of the countably many rational open\nsets. But if merely finite additivity is assumed, specifying a\nprobability function even on a countable state space may require\nspecifying the probabilities of uncountably many events, rather than\ncalculating the probabilities of these events from the countably many\nprobabilities of the states. Furthermore, with such probability\nfunctions, many standard convergence results like the Strong Law of\nLarge Numbers fail.\n\nFor more on infinite probability spaces where only finitely additive\nprobability holds, see Bartha (2004), Bingham (2010), de Finetti\n(1937/1989), Dubins (1975), Easwaran (2013b), Hill and Lane (1985),\nHowson (2008), Kadane, Schervish, and Seidenfeld (1986), Schervish,\nSeidenfeld, and Kadane (1984), Seidenfeld (2001), Seidenfeld,\nSchervish, and Kadane, (2014).\n\nA lively debate concerns a further constraint on probabilities that\nmay be regarded as desirable: anything that is possible should be\nassigned positive probability. This is known as\nregularity:\n\nRegularity\n\nIf \\(X\\) is a non-empty subset of \\(\\Omega\\), then \\(P(X) \\gt 0\\).\n\nFolk thinking about probability seems to be committed to\nregularity—“if it has probability zero, it can’t\nhappen!”, as one might say.\n\nWe have seen a striking violation of regularity in de Finetti’s\nlottery: his assignment of 0 to each ticket. Regularity may\nbe preserved here by countably additive probabilities, but at the\nexpense of a uniform distribution—for example, \\(\\frac{1}{2}\\)\nto ticket 1, \\(\\frac{1}{4}\\), to ticket 2, \\(\\frac{1}{8}\\) to ticket\n3, and so on. It may be shown that if \\(F\\) is uncountable, a\nKolmogorovian (real-valued) probability distribution must violate\nregularity. (See e.g. Hájek 2003b.) This has led to a cottage\nindustry of exploring whether regularity can be preserved by allowing\nthe ranges of probability functions to be richer fields than the real\nnumbers. For example, Bernstein and Wattenberg (1969) show that there\nexists a regular hyperreal-valued probability function for\nthe dart throw at [0, 1] that we imagined earlier. Each landing point\nreceives infinitesimal probability. Williamson (2007) argues\nthat an infinite sequence of tosses of a fair coin all landing heads\nmust receive probability 0 rather than some infinitesimal probability;\nHowson (2019) challenges the argument. The debate for and against\npreserving regularity continues, with Easwaran (2014) and Pruss (2012,\n2013b, 2014) against, Benci, Horsten and Wenmackers (2012, 2016)\nfor—offering NAP as a way of doing so, again assigning\ninfinitesimal probabilities where Kolmogorov’s theory would\nassign 0’s.\n\nFor several further puzzles involving probability in infinite spaces,\nsee Arntzenius, Elga, and Hawthorne (2004) and Bartha and Hitchcock\n(1999). For more on infinitesimal probabilities in philosophical\napplications, see Benci, Horsten and Wenmackers (2012, 2018), Easwaran\n(2014), Halpern (2010), Hofweber (2014a, 2014b), Howson (2018), Kremer\n(2014), Lauvers (2017), Pruss (2012, 2013, 2014, 2018a, 2018b), van\nFraassen (1976), and Wenmackers and Horsten (2013).\n\nInfinitesimal probabilities are also appealed to in game theory. For\nexample, the concept of trembling hand perfect equilibrium\nassumes that each player in a game may make a mistake with positive\nbut negligible probability, which may be regarded as\ninfinitesimal—see Halpern and Moses (2017). We will see further\nuse of infinitesimal probabilities in decision theory, to which we now\nturn.\n",
    "section_title": "6.3 Infinitude in the mathematics of probability: more advanced issues",
    "entry_title": "Infinity",
    "hierarchy_title": "Infinity || Probability || Infinitude in the mathematics of probability: more advanced issues",
    "tokenized_text": [
        "probability",
        "infinitude",
        "mathematics",
        "probability",
        "advanced",
        "issue",
        "infinitude",
        "mathematics",
        "probability",
        "advanced",
        "issue",
        "state",
        "thornier",
        "puzzle",
        "generated",
        "mathematics",
        "probability",
        "need",
        "formal",
        "presentation",
        "kolmogorov",
        "axiomatization",
        "begin",
        "finite",
        "set",
        "omega",
        "algebra",
        "f",
        "subset",
        "omega",
        "set",
        "closed",
        "complementation",
        "union",
        "member",
        "omega",
        "known",
        "state",
        "member",
        "f",
        "known",
        "event",
        "probability",
        "function",
        "function",
        "f",
        "real",
        "number",
        "nonnegative",
        "assigns",
        "omega",
        "finitely",
        "additivethe",
        "probability",
        "one",
        "two",
        "mutually",
        "exclusive",
        "event",
        "occurs",
        "sum",
        "individual",
        "probability",
        "finite",
        "additivity",
        "a",
        "b",
        "disjoint",
        "set",
        "f",
        "p",
        "cup",
        "b",
        "p",
        "p",
        "b",
        "kolmogorov",
        "go",
        "generalize",
        "infinite",
        "omega",
        "sigmaalgebra",
        "f",
        "subset",
        "omega",
        "set",
        "closed",
        "complementation",
        "countable",
        "union",
        "additivity",
        "strengthened",
        "hold",
        "also",
        "infinite",
        "case",
        "countable",
        "additivity",
        "a_i",
        "countably",
        "infinite",
        "collection",
        "pairwise",
        "disjoint",
        "set",
        "f",
        "p",
        "bigcup_",
        "n",
        "infty",
        "a_n",
        "sum_",
        "n",
        "infty",
        "p",
        "a_n",
        "felt",
        "restricting",
        "additivity",
        "merely",
        "countable",
        "sum",
        "arbitrary",
        "merely",
        "artifact",
        "summation",
        "technique",
        "introduced",
        "section",
        "alternate",
        "technique",
        "summing",
        "infinite",
        "set",
        "nonnegative",
        "number",
        "take",
        "advantage",
        "fact",
        "sum",
        "nonnegative",
        "number",
        "defined",
        "earlier",
        "depend",
        "order",
        "term",
        "consider",
        "set",
        "partial",
        "sum",
        "arbitrary",
        "finite",
        "subset",
        "set",
        "take",
        "least",
        "upper",
        "bound",
        "set",
        "represent",
        "sum",
        "set",
        "whole",
        "sum",
        "positive",
        "finite",
        "value",
        "k",
        "see",
        "nk",
        "term",
        "set",
        "summed",
        "greater",
        "n",
        "since",
        "every",
        "positive",
        "real",
        "number",
        "greater",
        "n",
        "n",
        "mean",
        "set",
        "positive",
        "element",
        "set",
        "countable",
        "union",
        "finite",
        "set",
        "thus",
        "must",
        "countable",
        "set",
        "summed",
        "way",
        "uncountably",
        "many",
        "nonzero",
        "element",
        "sum",
        "must",
        "infinite",
        "require",
        "full",
        "unrestricted",
        "additivity",
        "rather",
        "merely",
        "countable",
        "additivity",
        "see",
        "countably",
        "many",
        "event",
        "positive",
        "probability",
        "probability",
        "sum",
        "probability",
        "distribution",
        "feature",
        "event",
        "probability",
        "removed",
        "known",
        "discrete",
        "distribution",
        "poisson",
        "geometric",
        "negative",
        "binomial",
        "distribution",
        "distribution",
        "probability",
        "individual",
        "state",
        "determine",
        "probability",
        "event",
        "use",
        "additivity",
        "however",
        "many",
        "application",
        "probability",
        "require",
        "known",
        "continuous",
        "distribution",
        "uniformrectangular",
        "normal",
        "beta",
        "distribution",
        "thus",
        "require",
        "restriction",
        "countable",
        "additivity",
        "continuous",
        "distribution",
        "uncountably",
        "many",
        "state",
        "usually",
        "named",
        "real",
        "number",
        "individual",
        "state",
        "probability",
        "even",
        "though",
        "event",
        "containing",
        "uncountably",
        "many",
        "state",
        "often",
        "nonzero",
        "probability",
        "violates",
        "full",
        "additivity",
        "however",
        "common",
        "continuous",
        "distribution",
        "usually",
        "way",
        "define",
        "probability",
        "density",
        "state",
        "probability",
        "event",
        "integral",
        "density",
        "state",
        "make",
        "finite",
        "discrete",
        "distribution",
        "standard",
        "treat",
        "event",
        "probability",
        "happen",
        "continuous",
        "distribution",
        "always",
        "event",
        "probability",
        "occurs",
        "finite",
        "discrete",
        "distribution",
        "straightforward",
        "definition",
        "concept",
        "conditional",
        "probability",
        "two",
        "event",
        "a",
        "b",
        "probability",
        "a",
        "conditional",
        "b",
        "notated",
        "p",
        "amid",
        "b",
        "defined",
        "p",
        "amp",
        "b",
        "p",
        "b",
        "probability",
        "b",
        "nonzero",
        "undefined",
        "otherwise",
        "fixed",
        "b",
        "function",
        "p",
        "_",
        "mid",
        "b",
        "another",
        "probability",
        "function",
        "space",
        "prove",
        "law",
        "total",
        "probability",
        "b_",
        "b_",
        "b_",
        "ldots",
        "form",
        "partition",
        "every",
        "outcome",
        "exactly",
        "one",
        "b_i",
        "p",
        "sum_i",
        "p",
        "b_i",
        "p",
        "mid",
        "b_i",
        "tell",
        "u",
        "unconditional",
        "probability",
        "p",
        "weighted",
        "average",
        "conditional",
        "probability",
        "p",
        "amid",
        "b_i",
        "however",
        "distribution",
        "discrete",
        "set",
        "state",
        "uncountable",
        "essential",
        "way",
        "event",
        "probability",
        "often",
        "occur",
        "use",
        "ratio",
        "definition",
        "conditional",
        "probability",
        "since",
        "would",
        "involve",
        "dividing",
        "however",
        "kolmogorov",
        "note",
        "ch",
        "suitably",
        "nice",
        "partition",
        "still",
        "possible",
        "come",
        "definition",
        "conditional",
        "probability",
        "conditional",
        "event",
        "partition",
        "satisfying",
        "generalization",
        "law",
        "total",
        "probability",
        "replacing",
        "sum",
        "integral",
        "p",
        "int",
        "p",
        "mid",
        "b",
        "dp",
        "b",
        "possibility",
        "finding",
        "conditional",
        "probability",
        "satisfying",
        "integral",
        "formula",
        "known",
        "disintegrability",
        "equivalent",
        "principle",
        "known",
        "conglomerability",
        "philosophical",
        "argument",
        "favor",
        "see",
        "easwaran",
        "b",
        "rescorla",
        "determining",
        "conditional",
        "probability",
        "satisfy",
        "rule",
        "exist",
        "see",
        "hoffmannjørgensen",
        "use",
        "probability",
        "density",
        "calculate",
        "conditional",
        "probability",
        "see",
        "chang",
        "pollard",
        "however",
        "difficulty",
        "account",
        "conditional",
        "probability",
        "kolmogorov",
        "note",
        "original",
        "probability",
        "space",
        "uniform",
        "distribution",
        "point",
        "sphere",
        "b",
        "range",
        "set",
        "longitude",
        "great",
        "circle",
        "pole",
        "probability",
        "conditional",
        "line",
        "longitude",
        "uniform",
        "instead",
        "concentrated",
        "near",
        "equator",
        "fact",
        "known",
        "borel",
        "paradox",
        "emile",
        "borel",
        "investigated",
        "even",
        "kolmogorov",
        "work",
        "since",
        "every",
        "great",
        "circle",
        "sphere",
        "viewed",
        "line",
        "longitude",
        "appropriate",
        "choice",
        "pole",
        "make",
        "probability",
        "conditional",
        "event",
        "depend",
        "event",
        "chosen",
        "also",
        "family",
        "alternative",
        "contrasted",
        "view",
        "great",
        "circle",
        "longitudinal",
        "line",
        "multiple",
        "different",
        "pole",
        "disagrees",
        "equator",
        "found",
        "consequence",
        "troubling",
        "enough",
        "endorsed",
        "alternative",
        "account",
        "conditional",
        "probability",
        "give",
        "law",
        "total",
        "probability",
        "instead",
        "insists",
        "p",
        "ab",
        "unique",
        "value",
        "regardless",
        "alternative",
        "b",
        "consideration",
        "however",
        "also",
        "unpalatable",
        "consequence",
        "since",
        "p",
        "longer",
        "average",
        "p",
        "ab",
        "b",
        "range",
        "element",
        "partition",
        "mean",
        "partition",
        "every",
        "element",
        "partition",
        "positively",
        "correlated",
        "a",
        "furthermore",
        "conditional",
        "probability",
        "function",
        "generated",
        "way",
        "longer",
        "satisfy",
        "countable",
        "additivity",
        "kadane",
        "schervish",
        "seidenfeld",
        "seidenfeld",
        "schervish",
        "kadane",
        "starting",
        "de",
        "finetti",
        "argued",
        "ground",
        "give",
        "even",
        "countable",
        "additivity",
        "accept",
        "finite",
        "additivity",
        "correspondingly",
        "broader",
        "class",
        "probability",
        "distribution",
        "one",
        "de",
        "finetti",
        "chief",
        "argument",
        "involves",
        "infinite",
        "lottery",
        "natural",
        "number",
        "appearing",
        "exactly",
        "one",
        "ticket",
        "would",
        "like",
        "assign",
        "ticket",
        "probability",
        "drawn",
        "countable",
        "additivity",
        "possible",
        "assign",
        "probability",
        "number",
        "picked",
        "sum",
        "probability",
        "yet",
        "union",
        "event",
        "probability",
        "since",
        "guaranteed",
        "number",
        "picked",
        "ne",
        "hand",
        "assign",
        "realvalued",
        "probability",
        "varepsilon",
        "gt",
        "number",
        "picked",
        "sum",
        "probability",
        "diverges",
        "infty",
        "ne",
        "infty",
        "drop",
        "countable",
        "additivity",
        "however",
        "may",
        "assign",
        "event",
        "union",
        "without",
        "contradiction",
        "supplement",
        "god",
        "lottery",
        "explore",
        "alternative",
        "approach",
        "kolmogorov",
        "nonarchimedean",
        "probability",
        "theory",
        "nap",
        "account",
        "de",
        "finetti",
        "lottery",
        "assigning",
        "infinitesimal",
        "probability",
        "ticket",
        "however",
        "probability",
        "function",
        "satisfies",
        "finite",
        "additivity",
        "without",
        "satisfying",
        "countable",
        "additivity",
        "mathematically",
        "much",
        "complicated",
        "one",
        "satisfies",
        "countable",
        "additivity",
        "even",
        "prove",
        "existence",
        "function",
        "algebra",
        "subset",
        "countable",
        "set",
        "state",
        "requires",
        "axiom",
        "choice",
        "countable",
        "additivity",
        "possible",
        "specify",
        "discrete",
        "probability",
        "function",
        "enumerating",
        "probability",
        "countably",
        "many",
        "state",
        "possible",
        "specify",
        "continuous",
        "probability",
        "function",
        "enumerating",
        "probability",
        "countably",
        "many",
        "rational",
        "open",
        "set",
        "merely",
        "finite",
        "additivity",
        "assumed",
        "specifying",
        "probability",
        "function",
        "even",
        "countable",
        "state",
        "space",
        "may",
        "require",
        "specifying",
        "probability",
        "uncountably",
        "many",
        "event",
        "rather",
        "calculating",
        "probability",
        "event",
        "countably",
        "many",
        "probability",
        "state",
        "furthermore",
        "probability",
        "function",
        "many",
        "standard",
        "convergence",
        "result",
        "like",
        "strong",
        "law",
        "large",
        "number",
        "fail",
        "infinite",
        "probability",
        "space",
        "finitely",
        "additive",
        "probability",
        "hold",
        "see",
        "bartha",
        "bingham",
        "de",
        "finetti",
        "dubins",
        "easwaran",
        "b",
        "hill",
        "lane",
        "howson",
        "kadane",
        "schervish",
        "seidenfeld",
        "schervish",
        "seidenfeld",
        "kadane",
        "seidenfeld",
        "seidenfeld",
        "schervish",
        "kadane",
        "lively",
        "debate",
        "concern",
        "constraint",
        "probability",
        "may",
        "regarded",
        "desirable",
        "anything",
        "possible",
        "assigned",
        "positive",
        "probability",
        "known",
        "regularity",
        "regularity",
        "x",
        "nonempty",
        "subset",
        "omega",
        "p",
        "x",
        "gt",
        "folk",
        "thinking",
        "probability",
        "seems",
        "committed",
        "regularity",
        "probability",
        "zero",
        "happen",
        "one",
        "might",
        "say",
        "seen",
        "striking",
        "violation",
        "regularity",
        "de",
        "finetti",
        "lottery",
        "assignment",
        "ticket",
        "regularity",
        "may",
        "preserved",
        "countably",
        "additive",
        "probability",
        "expense",
        "uniform",
        "distributionfor",
        "example",
        "frac",
        "ticket",
        "frac",
        "ticket",
        "frac",
        "ticket",
        "may",
        "shown",
        "f",
        "uncountable",
        "kolmogorovian",
        "realvalued",
        "probability",
        "distribution",
        "must",
        "violate",
        "regularity",
        "see",
        "eg",
        "hájek",
        "b",
        "led",
        "cottage",
        "industry",
        "exploring",
        "whether",
        "regularity",
        "preserved",
        "allowing",
        "range",
        "probability",
        "function",
        "richer",
        "field",
        "real",
        "number",
        "example",
        "bernstein",
        "wattenberg",
        "show",
        "exists",
        "regular",
        "hyperrealvalued",
        "probability",
        "function",
        "dart",
        "throw",
        "imagined",
        "earlier",
        "landing",
        "point",
        "receives",
        "infinitesimal",
        "probability",
        "williamson",
        "argues",
        "infinite",
        "sequence",
        "toss",
        "fair",
        "coin",
        "landing",
        "head",
        "must",
        "receive",
        "probability",
        "rather",
        "infinitesimal",
        "probability",
        "howson",
        "challenge",
        "argument",
        "debate",
        "preserving",
        "regularity",
        "continues",
        "easwaran",
        "pruss",
        "b",
        "benci",
        "horsten",
        "wenmackers",
        "foroffering",
        "nap",
        "way",
        "assigning",
        "infinitesimal",
        "probability",
        "kolmogorov",
        "theory",
        "would",
        "assign",
        "several",
        "puzzle",
        "involving",
        "probability",
        "infinite",
        "space",
        "see",
        "arntzenius",
        "elga",
        "hawthorne",
        "bartha",
        "hitchcock",
        "infinitesimal",
        "probability",
        "philosophical",
        "application",
        "see",
        "benci",
        "horsten",
        "wenmackers",
        "easwaran",
        "halpern",
        "hofweber",
        "a",
        "b",
        "howson",
        "kremer",
        "lauvers",
        "pruss",
        "a",
        "b",
        "van",
        "fraassen",
        "wenmackers",
        "horsten",
        "infinitesimal",
        "probability",
        "also",
        "appealed",
        "game",
        "theory",
        "example",
        "concept",
        "trembling",
        "hand",
        "perfect",
        "equilibrium",
        "assumes",
        "player",
        "game",
        "may",
        "make",
        "mistake",
        "positive",
        "negligible",
        "probability",
        "may",
        "regarded",
        "infinitesimalsee",
        "halpern",
        "moses",
        "see",
        "use",
        "infinitesimal",
        "probability",
        "decision",
        "theory",
        "turn"
    ]
}