{
    "main_text": "Foundations, Coherence, and Regress\n2. Foundations, Coherence, and Regress\n\nIn section 1 we looked at cases where an infinite regress is taken to\nreveal some feature that might, possibly depending on your other\ntheoretical commitments, be taken to reveal a feature of a theory\nindependent of its leading to regress that is a reason to\nreject it. But sometimes the regress itself is taken to be an\nobjectionable feature of the theory that yields it.\n\nSuppose that there is an \\(X\\) that is \\(F\\), and that to account for\nwhy \\(X\\) is \\(F\\) we need to appeal to another \\(X\\) that is\nalso \\(F\\). Now there is the question as to why this \\(X\\) is\n\\(F\\), and so we need to appeal to another \\(X\\) which is\nalso \\(F\\) …. If this proceeds ad infinitum,\nwith a new \\(X\\) invoked at each new stage in the process, there is a\nconcern that we end up without having accounted for the \\(F\\)-ness of\nany of the \\(X\\)s. If this infinite regress argument is successful\nthen our choices are either:\n\nFoundationalism: To halt the regress by taking there to be a\nfoundation—a set of \\(X\\)s whose \\(F\\)-ness is taken to\nbe basic, and by which we can account for the \\(F\\)-ness of all other\n\\(X\\)s.\n\nor:\n\nCoherentism: To resist an infinite regress by allowing a circular or\nholistic explanation of the \\(F\\)-ness of at least some \\(X\\)s.\n\nInfinite regress arguments used to motivate Foundationalism or\nCoherentism appear in many different areas of philosophy. Here are\nsome highlights:\n\nIn metaphysics:\n\nMetaphysicians have wanted to account for the very existence, or\nnature, of some things by appealing to things on which they\nontologically depend: for example, a complex object exists and is the\nway it is because its parts exist and are the way they are; a set\nexists because its members exist; etc. (See Fine 1995 and Koslicki\n2013 for discussion.) But of course the things the dependent beings\ndepend on must themselves exist as well. Some have been suspicious of\nthe idea that this can go on ad infinitum, with every thing\nbeing ontologically dependent on some new thing(s), and thus have\nargued for Metaphysical Foundationalism: the view that there is a\ncollection of absolutely\n fundamental[4]\n entities upon which all else ultimately ontologically depends.\nAquinas, e.g., holds that events are ontologically dependent on their\ncauses, and that an infinite regress of causes and effects would be an\ninfinite series of things each of which is ontologically dependent on\nthe next, and this is\n impossible.[5]\n Thus he concludes that there must be a first cause of all else that\nis itself uncaused—namely, God. We shall see more examples of\nMetaphysical Foundationalists below. See also the supplementary\ndocument on\n\nMetaphysical Foundationalism and the Well-Foundedness of Ontological Dependence.\n\n(Metaphysical Coherentism—the view that ontological dependence\ncould be a holistic phenomenon—has received few defenders, but\nsee Barnes 2018, Bliss 2014, Cameron 2022 (Chs. 4 & 5), Nolan\n2018, Priest 2014 (Chs. 11 & 12), and Thompson 2016 and 2018 for\nsome discussion.)\n\nIn epistemology:\n\nEpistemologists want to account for the justification of our beliefs.\nWe do not want to believe at random, we want our beliefs to be\njustified—that is, we want there to be a\nreason to believe the propositions we believe. But those\nreasons will be further propositions, and if our initial belief is to\nbe justified, so surely must the reasons for that belief be, and so we\nmust appeal to yet more propositions, and so on. Many—going back\nto Sextus Empiricus (Outlines of Pyrrhonism PH I,\n164–9)—have thought that this cannot proceed ad\ninfinitum, and that the only serious options are Epistemic\nFoundationalism—the view that there is a class of propositions\nwhose justification does not come via some other justified\npropositions, and that can provide a reason for everything else we\nbelieve—or Epistemic Coherentism—the view that a\ncollection of propositions can collectively be justified in virtue of\nthe web of epistemic relations they stand in to one another. Thus Sosa\n(1980, 3) says “epistemology must choose between the solid\nsecurity of the ancient foundationalist pyramid and the risky\nadventure of the new coherentist raft.” (See the entries on\n foundationalist theories of epistemic justification\n and\n coherentist theories of epistemic justification\n for surveys of Epistemic Foundationalism and Epistemic Coherentism,\nrespectively).\n\nIn ethics:\n\nAs well as asking about the source of justification for our moral\nbeliefs (see e.g., Sinnott-Armstrong 1996), moral philosophers have\nbeen concerned with distinctively moral regresses, which arise not\nwhen we attempt to account for the justification of a moral claim, but\nrather when we attempt to account for the moral status of something by\nappealing to something else of the same moral status, and so on.\nAristotle (Nicomachean Ethics, 1094a) thought that some things were\ngood because we desire them for the sake of something else that is\ngood. But if everything that is good is good simply because\nit aims at something else that is good, this would lead to a regress\nand “all desire would be futile and vain”. And so\nAristotle argues that there must be a Highest Good—something\nthat is desired for its own sake—that other things can be good\nin virtue of aiming towards this highest good. Aristotle is a Moral\nFoundationalist: there is something whose goodness does not get\nexplained by reference to anything else, by means of which the\ngoodness of other things is accounted for.\n\n(Explicit statements of anything other than Foundationalism in the\nmoral case are hard to come\n by.[6]\n But see Roberts 2017 for relevant discussion.)\n\nHowever it is also always possible to simply embrace the regress and\naccept:\n\nInfinitism: The \\(F\\)-ness of each \\(X\\) is accounted for by facts\ninvolving a new \\(X\\) that is \\(F\\), and this proceeds ad\ninfinitum.\n\nWhether in metaphysics, epistemology, or ethics, Foundationalism has\noften been seen as the default, orthodox, view, with Coherentism being\nseen as the radical alternative. Infinitism is often simply dismissed,\nor not even considered as a live option. Foundationalism and\nCoherentism are\n (often[7])\n motivated by the thought that if the \\(F\\)-ness of each \\(X\\) is\naccounted for by appeal to a new \\(X\\) that is \\(F\\) then each of\nthose infinitely many explanations fails. The thought is that each\nexplanation of the \\(F\\)-ness of an \\(X\\) would be dependent on the\nsuccess of the next, a promissory note that is never paid if that\nprocess does not end. Let’s examine this anti-Infinitist\nthought.\n\nTo focus our inquiry, consider the case of a complex object and its\nproper parts. Some metaphysicians have considered the possibility that\nthere are gunky objects: objects such that every part of them\nitself has proper parts. If \\(A\\) is gunky then it is composed of some\nthings, the \\(X\\)s, such that there is more than one of the \\(X\\)s,\nand \\(A\\) is not amongst the \\(X\\)s. Pick one of those \\(X\\)s,\n\\(X_1\\). \\(X_1\\) is composed of some things, the \\(Y\\)s, such that\nthere is more than one of the \\(Y\\)s, and neither \\(A\\) nor \\(X_1\\) is\namongst the\n \\(Y\\)s.[8]\n Pick one of those \\(Y\\)s, \\(Y_1\\). \\(Y_1\\) is composed of some\nthings, the \\(Z\\)s, such that there is more than one of the \\(Z\\)s,\nand neither \\(A\\), nor \\(X_1\\), nor \\(Y_1\\) is amongst the \\(Z\\)s. And\nso on. This process will never end: each item in the series is a\ncollection of entities (a collection containing just one thing in the\nfirst case, and more than one thing in every subsequent case), and\ngiven the transitivity of parthood each thing in each collection will\nbe a part of \\(A\\) and hence—since \\(A\\) is ex\nhypothesi gunky—will itself be composed of a collection of\nproper parts, and so we can therefore pick any member from any\ncollection to generate the next item on the list. (Of course, a thing\nneed not—and if it is gunky, will not—have a\nunique decomposition: there can be two collections of things, the\n\\(X\\)s and the \\(Y\\)s, each of which compose \\(A\\), where none of the\n\\(X\\)s is amongst the \\(Y\\)s and vice versa. But all we need is that\nthere are some such collections, from which we can pick\narbitrarily to get the next collection in the sequence.) Now take the\ninfinite series that consists of \\(A\\) as its first element, \\(X_1\\)\nas its second element, \\(Y_1\\) as its third, etc. So we form this\ninfinite sequence by taking one item from each collection that formed\nthe previous infinite sequence: namely that item which was used to\ngive us the collection of things that came next in the series.\n\nAssuming that complex objects are ontologically dependent on their\nproper parts, we now have an infinite regress of entities, each of\nwhich is ontologically dependent on the next. Such an infinite regress\nhas been thought by some metaphysicians to be objectionable, leading\nthem to reject the possibility of gunk. Leibniz, for example, argues\nthat there cannot be only “beings by aggregation” (i.e.,\ncomposite objects), because this would lead to an infinite regress,\nwith each being by aggregation being made up of further beings by\naggregation, and so on ad infinitum.\n\nLeibniz’s idea seems to be that if each thing depends on some\nother, there could not be anything at all in the first place. The\nthought is that ontologically dependent entities inherit their\nexistence, or being, from that on which they depend; so if this chain\nof dependence does not terminate, the whole process couldn’t get\noff the ground, and there would be nothing at all. Leibniz says\n(1686–87, 85):\n\n\nWhere there are only beings by aggregation [composite objects], there\nare no real beings. For every being by aggregation presupposes beings\nendowed with real unity [simples], because every being derives its\nreality only from the reality of those beings of which it is composed,\nso that it will not have any reality at all if each being of which it\nis composed is itself a being by aggregation, a being for which we\nmust still seek further grounds for its reality, grounds which can\nnever be found in this way, if we must always continue to seek for\nthem.\n\n\nBy contrast, if the dependence runs in the other direction—if we\nstart off with a fundamental entity whose being can then ground the\nbeing of each subsequent entity—there is arguably no problem if\nthat process continues ad infinitum: thus the infinite\nsequence where you start with a thing, form its singleton set, then\nform that thing’s singleton set and so on ad\ninfinitum has not been thought to be objectionable by those who\nreject gunky objects, for it is the set that is ontologically\ndependent on its members, not vice versa. (See Fine 1994 for\ndiscussion of the direction of ontological dependence. See Cameron\n2008 and Maurin 2007 for discussion of the difference between infinite\nregresses where ontological dependence runs upwards from ones where it\nruns downwards. Cf. Clark 1988, and also Johansson 2009 and the\ndiscussion in Maurin\n 2013.)[9]\n\nA contemporary sympathizer with Leibniz’s thought is Jonathan\nSchaffer (2010). Unlike Leibniz, Schaffer grants the possibility of\ngunky objects, but thinks that this possibility is precisely a reason\nto deny that complex objects are (always) ontologically\ndependent on their\n parts.[10]\n Instead, Schaffer takes the possibility of there being no simple\nthings as a reason to hold that the dependence flows in the other\ndirection: that parts are dependent on the wholes of which they are\nparts, and that every thing is thereby ontologically dependent on the\nbiggest thing that there is—the cosmos—that has everything\nelse as a proper\n part.[11]\n Since classical mereology guarantees that there is a biggest\nthing—the thing that has all else as proper parts—but it\ndoes not guarantee that there are any smallest things—things\nthat have no proper parts—it guarantees that if parts are\ndependent on the wholes of which they are parts then there will be a\nfirst, ontologically fundamental, element, whereas if wholes are\ndependent on their parts then there is the possibility of an infinite\nregress in which each thing is dependent on some further thing(s),\nwith nothing being fundamental: a possibility in which, Schaffer\n(2010, 62) says (agreeing with Leibniz), “Being would be\ninfinitely deferred, never achieved”. Leibniz and Schaffer\nadvocate Metaphysical Foundationalism: the view that there\nhave to be some things that are absolutely fundamental—dependent\non nothing—on which all else ultimately depends.\n\nBut is it true that if the \\(F\\)-ness of each \\(X\\) is dependent on\nthe next \\(X\\) in the sequence being \\(F\\), and if this goes on\nwithout end, that we cannot explain why any \\(X\\) is \\(F\\)? Schaffer\nclaims that in the case of an infinite regress of ontological\ndependence, with each entity depending on the next in the chain, and\nno independent entities, being would be “infinitely deferred,\nnever achieved”. Why think this? The idea seems to be that a\ndependent entity only has the being it has on condition of something\nelse having being. If \\(A\\) is ontologically dependent on \\(B\\) then\nthe existence of \\(A\\) is a promissory note, only paid if \\(B\\) itself\nexists. But if \\(B\\) is ontologically dependent on \\(C\\) then the\nexistence of \\(B\\) is a promissory note, only paid if \\(C\\) exists\n… and so on, so that if this process never stops, the\npromissory note is never paid, in which case, allegedly, the existence\nof all these things could never get off the ground in the first\nplace.\n\nAn analogy may help. Suppose Anne has no sugar, and needs some. She\ncan borrow a bag of sugar from Breanna. Now Anne has a bag of sugar.\nWhere did it come from? Easy—it came from Breanna, who is now a\nbag of sugar down. But suppose Breanna borrowed a bag of sugar from\nCraig in order to then pass it on to Anne. Where did Anne’s bag\nof sugar come from then? Ultimately, from Craig, who ends up a bag of\nsugar down. But suppose Craig borrowed a bag of sugar from Devi\n… and so on, ad infinitum. Then where did the bag of\nsugar come from? At the end of the infinite sequence, Anne is one bag\nof sugar up, and nobody is a bag of sugar down, for everyone after\nAnne simply borrowed a bag of sugar, and then passed it on to the next\nperson in the chain. There’s an extra bag of sugar in the system\nthat seems to have appeared as if by magic. If there is a finite\nsequence of borrowers, however long, then the last person in the chain\nends up a bag of sugar down, so that’s where the bag of sugar\nthat ends up with Anne ultimately comes from. But if the chain never\nends, Anne ends up with a bag of sugar that doesn’t seem to have\ncome from anybody, as nobody has lost any bags of sugar—they all\njust borrowed it to pass it on. The infinite regress seems to create\nsugar from nowhere: pleasant, perhaps, but metaphysically suspicious\nall the same.\n\nAs with sugar, likewise with being—or justification, or\ngoodness, or whatever feature we aim to account for. If \\(A\\) depends\non \\(B\\) and \\(B\\) is fundamental, where did \\(A\\)’s being come\nfrom? From \\(B\\). If \\(A\\) depends on \\(B\\) and \\(B\\) depends on\n\\(C\\), where did \\(A\\)’s being come from? Ultimately, from\n\\(C\\). And for any finite chain, no matter how long, we can say where\nthe being of any dependent entity ultimately comes from: from the\nfundamental thing(s) at the bottom of the chain. But if the chain is\ninfinite, the being of any thing is, arguably, as mysterious as\nAnne’s new bag of sugar. The explanation of where it came from\nis always postponed, and its presence in the system as a whole\nunexplained. So, at least, goes the regress objection.\n",
    "section_title": "2. Foundations, Coherence, and Regress",
    "entry_title": "Infinite Regress Arguments",
    "hierarchy_title": "Infinite Regress Arguments || Foundations, Coherence, and Regress",
    "tokenized_text": [
        "foundation",
        "coherence",
        "regress",
        "foundation",
        "coherence",
        "regress",
        "section",
        "looked",
        "case",
        "infinite",
        "regress",
        "taken",
        "reveal",
        "feature",
        "might",
        "possibly",
        "depending",
        "theoretical",
        "commitment",
        "taken",
        "reveal",
        "feature",
        "theory",
        "independent",
        "leading",
        "regress",
        "reason",
        "reject",
        "sometimes",
        "regress",
        "taken",
        "objectionable",
        "feature",
        "theory",
        "yield",
        "suppose",
        "x",
        "f",
        "account",
        "x",
        "f",
        "need",
        "appeal",
        "another",
        "x",
        "also",
        "f",
        "question",
        "x",
        "f",
        "need",
        "appeal",
        "another",
        "x",
        "also",
        "f",
        "proceeds",
        "ad",
        "infinitum",
        "new",
        "x",
        "invoked",
        "new",
        "stage",
        "process",
        "concern",
        "end",
        "without",
        "accounted",
        "f",
        "ness",
        "x",
        "s",
        "infinite",
        "regress",
        "argument",
        "successful",
        "choice",
        "either",
        "foundationalism",
        "halt",
        "regress",
        "taking",
        "foundationa",
        "set",
        "x",
        "whose",
        "f",
        "ness",
        "taken",
        "basic",
        "account",
        "f",
        "ness",
        "x",
        "s",
        "coherentism",
        "resist",
        "infinite",
        "regress",
        "allowing",
        "circular",
        "holistic",
        "explanation",
        "f",
        "ness",
        "least",
        "x",
        "s",
        "infinite",
        "regress",
        "argument",
        "used",
        "motivate",
        "foundationalism",
        "coherentism",
        "appear",
        "many",
        "different",
        "area",
        "philosophy",
        "highlight",
        "metaphysics",
        "metaphysicians",
        "wanted",
        "account",
        "existence",
        "nature",
        "thing",
        "appealing",
        "thing",
        "ontologically",
        "depend",
        "example",
        "complex",
        "object",
        "exists",
        "way",
        "part",
        "exist",
        "way",
        "set",
        "exists",
        "member",
        "exist",
        "etc",
        "see",
        "fine",
        "koslicki",
        "discussion",
        "course",
        "thing",
        "dependent",
        "being",
        "depend",
        "must",
        "exist",
        "well",
        "suspicious",
        "idea",
        "go",
        "ad",
        "infinitum",
        "every",
        "thing",
        "ontologically",
        "dependent",
        "new",
        "thing",
        "thus",
        "argued",
        "metaphysical",
        "foundationalism",
        "view",
        "collection",
        "absolutely",
        "fundamental",
        "entity",
        "upon",
        "else",
        "ultimately",
        "ontologically",
        "depends",
        "aquinas",
        "eg",
        "hold",
        "event",
        "ontologically",
        "dependent",
        "cause",
        "infinite",
        "regress",
        "cause",
        "effect",
        "would",
        "infinite",
        "series",
        "thing",
        "ontologically",
        "dependent",
        "next",
        "impossible",
        "thus",
        "concludes",
        "must",
        "first",
        "cause",
        "else",
        "uncausednamely",
        "god",
        "shall",
        "see",
        "example",
        "metaphysical",
        "foundationalists",
        "see",
        "also",
        "supplementary",
        "document",
        "metaphysical",
        "foundationalism",
        "wellfoundedness",
        "ontological",
        "dependence",
        "metaphysical",
        "coherentismthe",
        "view",
        "ontological",
        "dependence",
        "could",
        "holistic",
        "phenomenonhas",
        "received",
        "defender",
        "see",
        "barnes",
        "bliss",
        "cameron",
        "chs",
        "nolan",
        "priest",
        "chs",
        "thompson",
        "discussion",
        "epistemology",
        "epistemologist",
        "want",
        "account",
        "justification",
        "belief",
        "want",
        "believe",
        "random",
        "want",
        "belief",
        "justifiedthat",
        "want",
        "reason",
        "believe",
        "proposition",
        "believe",
        "reason",
        "proposition",
        "initial",
        "belief",
        "justified",
        "surely",
        "must",
        "reason",
        "belief",
        "must",
        "appeal",
        "yet",
        "proposition",
        "manygoing",
        "back",
        "sextus",
        "empiricus",
        "outline",
        "pyrrhonism",
        "ph",
        "have",
        "thought",
        "proceed",
        "ad",
        "infinitum",
        "serious",
        "option",
        "epistemic",
        "foundationalismthe",
        "view",
        "class",
        "proposition",
        "whose",
        "justification",
        "come",
        "via",
        "justified",
        "proposition",
        "provide",
        "reason",
        "everything",
        "else",
        "believeor",
        "epistemic",
        "coherentismthe",
        "view",
        "collection",
        "proposition",
        "collectively",
        "justified",
        "virtue",
        "web",
        "epistemic",
        "relation",
        "stand",
        "one",
        "another",
        "thus",
        "sosa",
        "say",
        "epistemology",
        "must",
        "choose",
        "solid",
        "security",
        "ancient",
        "foundationalist",
        "pyramid",
        "risky",
        "adventure",
        "new",
        "coherentist",
        "raft",
        "see",
        "entry",
        "foundationalist",
        "theory",
        "epistemic",
        "justification",
        "coherentist",
        "theory",
        "epistemic",
        "justification",
        "survey",
        "epistemic",
        "foundationalism",
        "epistemic",
        "coherentism",
        "respectively",
        "ethic",
        "well",
        "asking",
        "source",
        "justification",
        "moral",
        "belief",
        "see",
        "eg",
        "sinnottarmstrong",
        "moral",
        "philosopher",
        "concerned",
        "distinctively",
        "moral",
        "regress",
        "arise",
        "attempt",
        "account",
        "justification",
        "moral",
        "claim",
        "rather",
        "attempt",
        "account",
        "moral",
        "status",
        "something",
        "appealing",
        "something",
        "else",
        "moral",
        "status",
        "aristotle",
        "nicomachean",
        "ethic",
        "a",
        "thought",
        "thing",
        "good",
        "desire",
        "sake",
        "something",
        "else",
        "good",
        "everything",
        "good",
        "good",
        "simply",
        "aim",
        "something",
        "else",
        "good",
        "would",
        "lead",
        "regress",
        "desire",
        "would",
        "futile",
        "vain",
        "aristotle",
        "argues",
        "must",
        "highest",
        "goodsomething",
        "desired",
        "sakethat",
        "thing",
        "good",
        "virtue",
        "aiming",
        "towards",
        "highest",
        "good",
        "aristotle",
        "moral",
        "foundationalist",
        "something",
        "whose",
        "goodness",
        "get",
        "explained",
        "reference",
        "anything",
        "else",
        "mean",
        "goodness",
        "thing",
        "accounted",
        "explicit",
        "statement",
        "anything",
        "foundationalism",
        "moral",
        "case",
        "hard",
        "come",
        "see",
        "robert",
        "relevant",
        "discussion",
        "however",
        "also",
        "always",
        "possible",
        "simply",
        "embrace",
        "regress",
        "accept",
        "infinitism",
        "f",
        "ness",
        "x",
        "accounted",
        "fact",
        "involving",
        "new",
        "x",
        "f",
        "proceeds",
        "ad",
        "infinitum",
        "whether",
        "metaphysics",
        "epistemology",
        "ethic",
        "foundationalism",
        "often",
        "seen",
        "default",
        "orthodox",
        "view",
        "coherentism",
        "seen",
        "radical",
        "alternative",
        "infinitism",
        "often",
        "simply",
        "dismissed",
        "even",
        "considered",
        "live",
        "option",
        "foundationalism",
        "coherentism",
        "often",
        "motivated",
        "thought",
        "f",
        "ness",
        "x",
        "accounted",
        "appeal",
        "new",
        "x",
        "f",
        "infinitely",
        "many",
        "explanation",
        "fails",
        "thought",
        "explanation",
        "f",
        "ness",
        "x",
        "would",
        "dependent",
        "success",
        "next",
        "promissory",
        "note",
        "never",
        "paid",
        "process",
        "end",
        "let",
        "examine",
        "antiinfinitist",
        "thought",
        "focus",
        "inquiry",
        "consider",
        "case",
        "complex",
        "object",
        "proper",
        "part",
        "metaphysicians",
        "considered",
        "possibility",
        "gunky",
        "object",
        "object",
        "every",
        "part",
        "proper",
        "part",
        "a",
        "gunky",
        "composed",
        "thing",
        "x",
        "one",
        "x",
        "a",
        "amongst",
        "x",
        "s",
        "pick",
        "one",
        "x",
        "x_",
        "x_",
        "composed",
        "thing",
        "y",
        "one",
        "y",
        "neither",
        "a",
        "x_",
        "amongst",
        "y",
        "s",
        "pick",
        "one",
        "y",
        "y_",
        "y_",
        "composed",
        "thing",
        "z",
        "one",
        "z",
        "neither",
        "a",
        "x_",
        "y_",
        "amongst",
        "z",
        "s",
        "process",
        "never",
        "end",
        "item",
        "series",
        "collection",
        "entity",
        "collection",
        "containing",
        "one",
        "thing",
        "first",
        "case",
        "one",
        "thing",
        "every",
        "subsequent",
        "case",
        "given",
        "transitivity",
        "parthood",
        "thing",
        "collection",
        "part",
        "a",
        "hencesince",
        "a",
        "ex",
        "hypothesi",
        "gunkywill",
        "composed",
        "collection",
        "proper",
        "part",
        "therefore",
        "pick",
        "member",
        "collection",
        "generate",
        "next",
        "item",
        "list",
        "course",
        "thing",
        "need",
        "notand",
        "gunky",
        "nothave",
        "unique",
        "decomposition",
        "two",
        "collection",
        "thing",
        "x",
        "y",
        "compose",
        "a",
        "none",
        "x",
        "amongst",
        "y",
        "vice",
        "versa",
        "need",
        "collection",
        "pick",
        "arbitrarily",
        "get",
        "next",
        "collection",
        "sequence",
        "take",
        "infinite",
        "series",
        "consists",
        "a",
        "first",
        "element",
        "x_",
        "second",
        "element",
        "y_",
        "third",
        "etc",
        "form",
        "infinite",
        "sequence",
        "taking",
        "one",
        "item",
        "collection",
        "formed",
        "previous",
        "infinite",
        "sequence",
        "namely",
        "item",
        "used",
        "give",
        "u",
        "collection",
        "thing",
        "came",
        "next",
        "series",
        "assuming",
        "complex",
        "object",
        "ontologically",
        "dependent",
        "proper",
        "part",
        "infinite",
        "regress",
        "entity",
        "ontologically",
        "dependent",
        "next",
        "infinite",
        "regress",
        "thought",
        "metaphysicians",
        "objectionable",
        "leading",
        "reject",
        "possibility",
        "gunk",
        "leibniz",
        "example",
        "argues",
        "being",
        "aggregation",
        "ie",
        "composite",
        "object",
        "would",
        "lead",
        "infinite",
        "regress",
        "aggregation",
        "made",
        "being",
        "aggregation",
        "ad",
        "infinitum",
        "leibniz",
        "idea",
        "seems",
        "thing",
        "depends",
        "could",
        "anything",
        "first",
        "place",
        "thought",
        "ontologically",
        "dependent",
        "entity",
        "inherit",
        "existence",
        "depend",
        "chain",
        "dependence",
        "terminate",
        "whole",
        "process",
        "get",
        "ground",
        "would",
        "nothing",
        "leibniz",
        "say",
        "being",
        "aggregation",
        "composite",
        "object",
        "real",
        "being",
        "every",
        "aggregation",
        "presupposes",
        "being",
        "endowed",
        "real",
        "unity",
        "simple",
        "every",
        "derives",
        "reality",
        "reality",
        "being",
        "composed",
        "reality",
        "composed",
        "aggregation",
        "must",
        "still",
        "seek",
        "ground",
        "reality",
        "ground",
        "never",
        "found",
        "way",
        "must",
        "always",
        "continue",
        "seek",
        "contrast",
        "dependence",
        "run",
        "directionif",
        "start",
        "fundamental",
        "entity",
        "whose",
        "ground",
        "subsequent",
        "entitythere",
        "arguably",
        "problem",
        "process",
        "continues",
        "ad",
        "infinitum",
        "thus",
        "infinite",
        "sequence",
        "start",
        "thing",
        "form",
        "singleton",
        "set",
        "form",
        "thing",
        "singleton",
        "set",
        "ad",
        "infinitum",
        "thought",
        "objectionable",
        "reject",
        "gunky",
        "object",
        "set",
        "ontologically",
        "dependent",
        "member",
        "vice",
        "versa",
        "see",
        "fine",
        "discussion",
        "direction",
        "ontological",
        "dependence",
        "see",
        "cameron",
        "maurin",
        "discussion",
        "difference",
        "infinite",
        "regress",
        "ontological",
        "dependence",
        "run",
        "upwards",
        "one",
        "run",
        "downwards",
        "cf",
        "clark",
        "also",
        "johansson",
        "discussion",
        "maurin",
        "contemporary",
        "sympathizer",
        "leibniz",
        "thought",
        "jonathan",
        "schaffer",
        "unlike",
        "leibniz",
        "schaffer",
        "grant",
        "possibility",
        "gunky",
        "object",
        "think",
        "possibility",
        "precisely",
        "reason",
        "deny",
        "complex",
        "object",
        "always",
        "ontologically",
        "dependent",
        "part",
        "instead",
        "schaffer",
        "take",
        "possibility",
        "simple",
        "thing",
        "reason",
        "hold",
        "dependence",
        "flow",
        "direction",
        "part",
        "dependent",
        "whole",
        "part",
        "every",
        "thing",
        "thereby",
        "ontologically",
        "dependent",
        "biggest",
        "thing",
        "isthe",
        "cosmosthat",
        "everything",
        "else",
        "proper",
        "part",
        "since",
        "classical",
        "mereology",
        "guarantee",
        "biggest",
        "thingthe",
        "thing",
        "else",
        "proper",
        "partsbut",
        "guarantee",
        "smallest",
        "thingsthings",
        "proper",
        "partsit",
        "guarantee",
        "part",
        "dependent",
        "whole",
        "part",
        "first",
        "ontologically",
        "fundamental",
        "element",
        "whereas",
        "whole",
        "dependent",
        "part",
        "possibility",
        "infinite",
        "regress",
        "thing",
        "dependent",
        "thing",
        "nothing",
        "fundamental",
        "possibility",
        "schaffer",
        "say",
        "agreeing",
        "leibniz",
        "would",
        "infinitely",
        "deferred",
        "never",
        "achieved",
        "leibniz",
        "schaffer",
        "advocate",
        "metaphysical",
        "foundationalism",
        "view",
        "thing",
        "absolutely",
        "fundamentaldependent",
        "nothingon",
        "else",
        "ultimately",
        "depends",
        "true",
        "f",
        "ness",
        "x",
        "dependent",
        "next",
        "x",
        "sequence",
        "f",
        "go",
        "without",
        "end",
        "explain",
        "x",
        "f",
        "schaffer",
        "claim",
        "case",
        "infinite",
        "regress",
        "ontological",
        "dependence",
        "entity",
        "depending",
        "next",
        "chain",
        "independent",
        "entity",
        "would",
        "infinitely",
        "deferred",
        "never",
        "achieved",
        "think",
        "idea",
        "seems",
        "dependent",
        "entity",
        "condition",
        "something",
        "else",
        "a",
        "ontologically",
        "dependent",
        "b",
        "existence",
        "a",
        "promissory",
        "note",
        "paid",
        "b",
        "exists",
        "b",
        "ontologically",
        "dependent",
        "c",
        "existence",
        "b",
        "promissory",
        "note",
        "paid",
        "c",
        "exists",
        "process",
        "never",
        "stop",
        "promissory",
        "note",
        "never",
        "paid",
        "case",
        "allegedly",
        "existence",
        "thing",
        "could",
        "never",
        "get",
        "ground",
        "first",
        "place",
        "analogy",
        "may",
        "help",
        "suppose",
        "anne",
        "sugar",
        "need",
        "borrow",
        "bag",
        "sugar",
        "breanna",
        "anne",
        "bag",
        "sugar",
        "come",
        "easyit",
        "came",
        "breanna",
        "bag",
        "sugar",
        "suppose",
        "breanna",
        "borrowed",
        "bag",
        "sugar",
        "craig",
        "order",
        "pas",
        "anne",
        "anne",
        "bag",
        "sugar",
        "come",
        "ultimately",
        "craig",
        "end",
        "bag",
        "sugar",
        "suppose",
        "craig",
        "borrowed",
        "bag",
        "sugar",
        "devi",
        "ad",
        "infinitum",
        "bag",
        "sugar",
        "come",
        "end",
        "infinite",
        "sequence",
        "anne",
        "one",
        "bag",
        "sugar",
        "nobody",
        "bag",
        "sugar",
        "everyone",
        "anne",
        "simply",
        "borrowed",
        "bag",
        "sugar",
        "passed",
        "next",
        "person",
        "chain",
        "extra",
        "bag",
        "sugar",
        "system",
        "seems",
        "appeared",
        "magic",
        "finite",
        "sequence",
        "borrower",
        "however",
        "long",
        "last",
        "person",
        "chain",
        "end",
        "bag",
        "sugar",
        "bag",
        "sugar",
        "end",
        "anne",
        "ultimately",
        "come",
        "chain",
        "never",
        "end",
        "anne",
        "end",
        "bag",
        "sugar",
        "seem",
        "come",
        "anybody",
        "nobody",
        "lost",
        "bag",
        "sugarthey",
        "borrowed",
        "pas",
        "infinite",
        "regress",
        "seems",
        "create",
        "sugar",
        "nowhere",
        "pleasant",
        "perhaps",
        "metaphysically",
        "suspicious",
        "sugar",
        "likewise",
        "beingor",
        "justification",
        "goodness",
        "whatever",
        "feature",
        "aim",
        "account",
        "a",
        "depends",
        "b",
        "b",
        "fundamental",
        "a",
        "come",
        "b",
        "a",
        "depends",
        "b",
        "b",
        "depends",
        "c",
        "a",
        "come",
        "ultimately",
        "c",
        "finite",
        "chain",
        "matter",
        "long",
        "say",
        "dependent",
        "entity",
        "ultimately",
        "come",
        "fundamental",
        "thing",
        "bottom",
        "chain",
        "chain",
        "infinite",
        "thing",
        "arguably",
        "mysterious",
        "anne",
        "new",
        "bag",
        "sugar",
        "explanation",
        "came",
        "always",
        "postponed",
        "presence",
        "system",
        "whole",
        "unexplained",
        "least",
        "go",
        "regress",
        "objection"
    ]
}