{
    "main_text": "Teleosemantic and other richer concepts\n3. Teleosemantic and other richer concepts\nAs noted above, several philosophers and biologists have argued\nthat much informational talk about genes uses a richer concept than\nShannon’s, but this concept can be given a naturalistic\nanalysis.  The aim has been to make sense of the idea that\ngenes semantically specify their normal products, in a sense\nsimilar to that seen in some paradigm cases of symbolic phenomena.\nIf genes are seen as “carrying a message” in this\nsense, the message apparently has a prescriptive or imperative\ncontent, as opposed to a descriptive or indicative one. Their\n“direction of fit” to their effects is such that if the\ngenes and the eventual structure produced (the phenotype) do not\nmatch, what we have is a case of unfulfilled instructions rather than\ninaccurate descriptions.  Alternatively, perhaps it is possible to\nthink that the genes are telling the developing phenotype the\nenvironment it can expect. For the gene pool from which those genes\nhave been drawn has been filtered by selection. In arid regions of\nAustralia, genes which contributed to the development of leaves whose\nshape and surface restricted water loss have become common. Hence\nperhaps we can see these genes as telling the trees: conditions will\nbe dry (for this line of thought, see Shea 2011, 2013).\nIn making sense of these ideas, the usual way to proceed has been\nto make use of a rich concept of biological function, in\nwhich the function of an entity derives from a history of natural\nselection (see Teleological Notions in\nBiology).  This move is familiar from the philosophy of mind,\nwhere similar problems arise in the explanation of the semantic\nproperties of mental states (Millikan 1984). When an entity has been\nsubject to and shaped by a history of natural selection, this can\nprovide the grounding for a kind of purposive or normative description\nof the causal capacities of that entity. To use the standard example\n(Wright 1973), the function of a heart is to pump blood, not to make\nthumping sounds, because it is the former effect that has led to\nhearts being favored by natural selection. The hope is that a similar\n“teleofunctional” strategy might help make sense of the\nsemantic properties of genes, and perhaps other biological structures\nwith semantic properties.\nThe idea of a teleosemantic approach to genetic information was\ndeveloped in an early form by Sterelny et al. (1996); see also\nMaclaurin (1998). The eminent biologist John Maynard Smith took a\nsimilar approach, when he tried to make sense of his own enthusiasm\nfor informational concepts in biology (Maynard Smith 2000; and see\nalso the commentaries that follow Maynard Smith’s article). Eva\nJablonka has also defended a version of this idea (Jablonka 2002). Her\ntreatment is more unorthodox, as she seeks to treat environmental\nsignals as having semantic information, along with genes, if they are\nused by the organism in an appropriate way. Nick Shea has developed\nthe most sophisticated teleosemantic treatment of genes to date (see\nShea 2007a,b, 2011, 2013).\nOne way of developing these ideas is to focus on the evolved\nfunctions of the genetic machinery as a whole (Godfrey-Smith\n1999). Carl Bergstrom and Martin Rosvall take this approach,\nemphasising the adapted, impressively engineered features of\nintergenerational gene flow in developing their “transmission\nsense of information”. Bergstron and Rosvall point out that\nintergeneration gene flow is structured so as to make possible the\ntransmission of arbitrary sequences (so the message is relatively\nunconstrained by the medium); that information is stored compactly and\nstably; that the bandwidth is large and indefinitely extendable. DNA\nsequences are reliably replicable with very high fidelity, so\ntransmission is accurate, yet the mapping between DNA and amino acid sequence seems\noptimised to reduce the impact of those errors that do occur. Many\npoint mutations are mapped onto the same or a chemically similar amino\nacid. Bergstrom and Rosvall conclude both that DNA replication is an\nexquisitely designed information channel, and that we can tell this\nfrom the characteristics of the DNA-amino acid system itself. We do\nnot need to know what signals from the parental generation say to the\noffspring generation, in order to know that the characteristics of DNA\nreplication are explained by its information-carrying capacities\n(Bergstrom and Rosvall 2011).\nThe more usual route, and the one taken both by Sterelny et\nal. (1996) and by Maynard Smith (2000) is to focus on the natural\nselection of particular genetic elements. That view faces an\nimmediate problem, for the fact that specific genetic elements (or the\ngenetic system as a whole) have an evolved function is clearly not\nsufficient for genes to carry semantic information.  Legs are for\nwalking, but they do not represent walking. Enzymes are for catalyzing\nreactions, but they do not instruct this activity. There are things\nthat legs and enzymes are supposed to do, but this does not\nmake them into information-carriers, in a rich beyond-Shannon\nsense. Why should it do so for genes? Sterelny, Smith and Dickison\n(1996), suggested that the differences between genes and legs is that\ngenes have been selected to play a causal role\nin developmental processes. They add, however, that any\nnon-genetic factors that have a similar developmental role, and have\nbeen selected to play that role, also have semantic properties. So\nSterelny, Smith and Dickison want to ascribe very rich semantic\nproperties to genes, but not only to genes. Some non-genetic factors\nhave the same status. Even so, many quite plausible cases turn out not\nto be informational on this view: prolactin, like most hormones, does\nnot have a specifically developmental function, so it would not count\nas carrying information to the mammary glands. This is one reason why\nLevy thinks of talk of information as merely metaphorical (Levy\n2011). In contrast to the views of Sterelny, Smith and Dickison, in\nhis 2000 paper, John Maynard Smith argued that only genes carry\nsemantic information about phenotypes. He suggested that in contrast\nto other developmental resources, the relationship between adapted\ngene and phenotypic outcome is arbitrary; the gene-trait relationship\nis like the word-object relationship. This idea is intriguing but hard\nto make precise. One problem is that any causal relation can look\n“arbitrary” if it operates via many intervening links, for\nthere are many possible interventions on those links which would\nchange the product of the causal chain. The problem of arbitrariness\nis discussed further in section 4.\nTo distinguish between ordinary biological functions and\nrepresentational functions, Nicholas Shea draws upon the more\nelaborate machinery of Ruth Millikan’s teleosemantic theory. For\nMillikan, any object that has semantic properties plays a role that\ninvolves a kind of mediation between two “cooperating\ndevices”, a producer and a consumer device. In the case of an\nindicative signal or representation, the representation is supposed to\naffect the activities of the consumer in a way that will only further\nthe performance of the consumer’s biological functions if some\nstate of affairs obtains. In the case of an imperative representation,\nthe representation is supposed to affect the activities of the\nconsumer by inducing them to bring some state of affairs about. Shea\ntreats genetic messages as having both indicative and imperative\ncontent, and depending on both producers and consumers (Shea 2007b,\n2011, 2013). Where Shea follows Millikan in emphasizing the roles of\nboth producers and consumers, Jablonka (2002) tries to achieve as much\nas possible with an emphasis on consumer mechanisms alone. It seems\nclear that the attention to producer and consumer mechanisms is a step\nforward in this discussion, but we will see\nin section 5 that it also poses problems. In\nthinking about both inheritance and development, it turns out to be\nunclear whether there are independently identifiable mechanisms which\ncount as senders and receivers, producers and consumers.\nThe overall picture envisaged by the teleosemantic approach has\nundeniably appealing structural features. If this program succeeds, we\nwould have an uncontroversial sense of information, via Shannon, that\napplies to all sorts of physical correlations. This picture can then\nbe developed by identifying a subset of cases in which these signals\nhave been co-opted or produced to drive biological processes. In\naddition, perhaps we can appeal to rich semantic properties in cases\nwhere we have the right kind of history of natural selection to\nexplain the distinctive role of genes, and perhaps other factors, in\ndevelopment.  Genes and a handful of non-genetic factors would have\nthese properties; most environmental features that have a causal role\nin biological development would not. There remain many problems of\ndetail, but the appeal of the overall picture provides, at least for\nsome, good reason to persevere with some account along these\nlines.\n",
    "section_title": "3. Teleosemantic and other richer concepts",
    "entry_title": "Biological Information",
    "hierarchy_title": "Biological Information || Teleosemantic and other richer concepts",
    "tokenized_text": [
        "teleosemantic",
        "richer",
        "concept",
        "teleosemantic",
        "richer",
        "concept",
        "noted",
        "several",
        "philosopher",
        "biologist",
        "argued",
        "much",
        "informational",
        "talk",
        "gene",
        "us",
        "richer",
        "concept",
        "shannon",
        "concept",
        "given",
        "naturalistic",
        "analysis",
        "aim",
        "make",
        "sense",
        "idea",
        "gene",
        "semantically",
        "specify",
        "normal",
        "product",
        "sense",
        "similar",
        "seen",
        "paradigm",
        "case",
        "symbolic",
        "phenomenon",
        "gene",
        "seen",
        "carrying",
        "message",
        "sense",
        "message",
        "apparently",
        "prescriptive",
        "imperative",
        "content",
        "opposed",
        "descriptive",
        "indicative",
        "one",
        "direction",
        "fit",
        "effect",
        "gene",
        "eventual",
        "structure",
        "produced",
        "phenotype",
        "match",
        "case",
        "unfulfilled",
        "instruction",
        "rather",
        "inaccurate",
        "description",
        "alternatively",
        "perhaps",
        "possible",
        "think",
        "gene",
        "telling",
        "developing",
        "phenotype",
        "environment",
        "expect",
        "gene",
        "pool",
        "gene",
        "drawn",
        "filtered",
        "selection",
        "arid",
        "region",
        "australia",
        "gene",
        "contributed",
        "development",
        "leaf",
        "whose",
        "shape",
        "surface",
        "restricted",
        "water",
        "loss",
        "become",
        "common",
        "hence",
        "perhaps",
        "see",
        "gene",
        "telling",
        "tree",
        "condition",
        "dry",
        "line",
        "thought",
        "see",
        "shea",
        "making",
        "sense",
        "idea",
        "usual",
        "way",
        "proceed",
        "make",
        "use",
        "rich",
        "concept",
        "biological",
        "function",
        "function",
        "entity",
        "derives",
        "history",
        "natural",
        "selection",
        "see",
        "teleological",
        "notion",
        "biology",
        "move",
        "familiar",
        "philosophy",
        "mind",
        "similar",
        "problem",
        "arise",
        "explanation",
        "semantic",
        "property",
        "mental",
        "state",
        "millikan",
        "entity",
        "subject",
        "shaped",
        "history",
        "natural",
        "selection",
        "provide",
        "grounding",
        "kind",
        "purposive",
        "normative",
        "description",
        "causal",
        "capacity",
        "entity",
        "use",
        "standard",
        "example",
        "wright",
        "function",
        "heart",
        "pump",
        "blood",
        "make",
        "thumping",
        "sound",
        "former",
        "effect",
        "led",
        "heart",
        "favored",
        "natural",
        "selection",
        "hope",
        "similar",
        "teleofunctional",
        "strategy",
        "might",
        "help",
        "make",
        "sense",
        "semantic",
        "property",
        "gene",
        "perhaps",
        "biological",
        "structure",
        "semantic",
        "property",
        "idea",
        "teleosemantic",
        "approach",
        "genetic",
        "information",
        "developed",
        "early",
        "form",
        "sterelny",
        "et",
        "al",
        "see",
        "also",
        "maclaurin",
        "eminent",
        "biologist",
        "john",
        "maynard",
        "smith",
        "took",
        "similar",
        "approach",
        "tried",
        "make",
        "sense",
        "enthusiasm",
        "informational",
        "concept",
        "biology",
        "maynard",
        "smith",
        "see",
        "also",
        "commentary",
        "follow",
        "maynard",
        "smith",
        "article",
        "eva",
        "jablonka",
        "also",
        "defended",
        "version",
        "idea",
        "jablonka",
        "treatment",
        "unorthodox",
        "seek",
        "treat",
        "environmental",
        "signal",
        "semantic",
        "information",
        "along",
        "gene",
        "used",
        "organism",
        "appropriate",
        "way",
        "nick",
        "shea",
        "developed",
        "sophisticated",
        "teleosemantic",
        "treatment",
        "gene",
        "date",
        "see",
        "shea",
        "a",
        "b",
        "one",
        "way",
        "developing",
        "idea",
        "focus",
        "evolved",
        "function",
        "genetic",
        "machinery",
        "whole",
        "godfreysmith",
        "carl",
        "bergstrom",
        "martin",
        "rosvall",
        "take",
        "approach",
        "emphasising",
        "adapted",
        "impressively",
        "engineered",
        "feature",
        "intergenerational",
        "gene",
        "flow",
        "developing",
        "transmission",
        "sense",
        "information",
        "bergstron",
        "rosvall",
        "point",
        "intergeneration",
        "gene",
        "flow",
        "structured",
        "make",
        "possible",
        "transmission",
        "arbitrary",
        "sequence",
        "message",
        "relatively",
        "unconstrained",
        "medium",
        "information",
        "stored",
        "compactly",
        "stably",
        "bandwidth",
        "large",
        "indefinitely",
        "extendable",
        "dna",
        "sequence",
        "reliably",
        "replicable",
        "high",
        "fidelity",
        "transmission",
        "accurate",
        "yet",
        "mapping",
        "dna",
        "amino",
        "acid",
        "sequence",
        "seems",
        "optimised",
        "reduce",
        "impact",
        "error",
        "occur",
        "many",
        "point",
        "mutation",
        "mapped",
        "onto",
        "chemically",
        "similar",
        "amino",
        "acid",
        "bergstrom",
        "rosvall",
        "conclude",
        "dna",
        "replication",
        "exquisitely",
        "designed",
        "information",
        "channel",
        "tell",
        "characteristic",
        "dnaamino",
        "acid",
        "system",
        "need",
        "know",
        "signal",
        "parental",
        "generation",
        "say",
        "offspring",
        "generation",
        "order",
        "know",
        "characteristic",
        "dna",
        "replication",
        "explained",
        "informationcarrying",
        "capacity",
        "bergstrom",
        "rosvall",
        "usual",
        "route",
        "one",
        "taken",
        "sterelny",
        "et",
        "al",
        "maynard",
        "smith",
        "focus",
        "natural",
        "selection",
        "particular",
        "genetic",
        "element",
        "view",
        "face",
        "immediate",
        "problem",
        "fact",
        "specific",
        "genetic",
        "element",
        "genetic",
        "system",
        "whole",
        "evolved",
        "function",
        "clearly",
        "sufficient",
        "gene",
        "carry",
        "semantic",
        "information",
        "leg",
        "walking",
        "represent",
        "walking",
        "enzyme",
        "catalyzing",
        "reaction",
        "instruct",
        "activity",
        "thing",
        "leg",
        "enzyme",
        "supposed",
        "make",
        "informationcarriers",
        "rich",
        "beyondshannon",
        "sense",
        "gene",
        "sterelny",
        "smith",
        "dickison",
        "suggested",
        "difference",
        "gene",
        "leg",
        "gene",
        "selected",
        "play",
        "causal",
        "role",
        "developmental",
        "process",
        "add",
        "however",
        "nongenetic",
        "factor",
        "similar",
        "developmental",
        "role",
        "selected",
        "play",
        "role",
        "also",
        "semantic",
        "property",
        "sterelny",
        "smith",
        "dickison",
        "want",
        "ascribe",
        "rich",
        "semantic",
        "property",
        "gene",
        "gene",
        "nongenetic",
        "factor",
        "status",
        "even",
        "many",
        "quite",
        "plausible",
        "case",
        "turn",
        "informational",
        "view",
        "prolactin",
        "like",
        "hormone",
        "specifically",
        "developmental",
        "function",
        "would",
        "count",
        "carrying",
        "information",
        "mammary",
        "gland",
        "one",
        "reason",
        "levy",
        "think",
        "talk",
        "information",
        "merely",
        "metaphorical",
        "levy",
        "contrast",
        "view",
        "sterelny",
        "smith",
        "dickison",
        "paper",
        "john",
        "maynard",
        "smith",
        "argued",
        "gene",
        "carry",
        "semantic",
        "information",
        "phenotype",
        "suggested",
        "contrast",
        "developmental",
        "resource",
        "relationship",
        "adapted",
        "gene",
        "phenotypic",
        "outcome",
        "arbitrary",
        "genetrait",
        "relationship",
        "like",
        "wordobject",
        "relationship",
        "idea",
        "intriguing",
        "hard",
        "make",
        "precise",
        "one",
        "problem",
        "causal",
        "relation",
        "look",
        "arbitrary",
        "operates",
        "via",
        "many",
        "intervening",
        "link",
        "many",
        "possible",
        "intervention",
        "link",
        "would",
        "change",
        "product",
        "causal",
        "chain",
        "problem",
        "arbitrariness",
        "discussed",
        "section",
        "distinguish",
        "ordinary",
        "biological",
        "function",
        "representational",
        "function",
        "nicholas",
        "shea",
        "draw",
        "upon",
        "elaborate",
        "machinery",
        "ruth",
        "millikan",
        "teleosemantic",
        "theory",
        "millikan",
        "object",
        "semantic",
        "property",
        "play",
        "role",
        "involves",
        "kind",
        "mediation",
        "two",
        "cooperating",
        "device",
        "producer",
        "consumer",
        "device",
        "case",
        "indicative",
        "signal",
        "representation",
        "representation",
        "supposed",
        "affect",
        "activity",
        "consumer",
        "way",
        "performance",
        "consumer",
        "biological",
        "function",
        "state",
        "affair",
        "obtains",
        "case",
        "imperative",
        "representation",
        "representation",
        "supposed",
        "affect",
        "activity",
        "consumer",
        "inducing",
        "bring",
        "state",
        "affair",
        "shea",
        "treat",
        "genetic",
        "message",
        "indicative",
        "imperative",
        "content",
        "depending",
        "producer",
        "consumer",
        "shea",
        "b",
        "shea",
        "follows",
        "millikan",
        "emphasizing",
        "role",
        "producer",
        "consumer",
        "jablonka",
        "try",
        "achieve",
        "much",
        "possible",
        "emphasis",
        "consumer",
        "mechanism",
        "alone",
        "seems",
        "clear",
        "attention",
        "producer",
        "consumer",
        "mechanism",
        "step",
        "forward",
        "discussion",
        "see",
        "section",
        "also",
        "pose",
        "problem",
        "thinking",
        "inheritance",
        "development",
        "turn",
        "unclear",
        "whether",
        "independently",
        "identifiable",
        "mechanism",
        "count",
        "sender",
        "receiver",
        "producer",
        "consumer",
        "overall",
        "picture",
        "envisaged",
        "teleosemantic",
        "approach",
        "undeniably",
        "appealing",
        "structural",
        "feature",
        "program",
        "succeeds",
        "would",
        "uncontroversial",
        "sense",
        "information",
        "via",
        "shannon",
        "applies",
        "sort",
        "physical",
        "correlation",
        "picture",
        "developed",
        "identifying",
        "subset",
        "case",
        "signal",
        "coopted",
        "produced",
        "drive",
        "biological",
        "process",
        "addition",
        "perhaps",
        "appeal",
        "rich",
        "semantic",
        "property",
        "case",
        "right",
        "kind",
        "history",
        "natural",
        "selection",
        "explain",
        "distinctive",
        "role",
        "gene",
        "perhaps",
        "factor",
        "development",
        "gene",
        "handful",
        "nongenetic",
        "factor",
        "would",
        "property",
        "environmental",
        "feature",
        "causal",
        "role",
        "biological",
        "development",
        "would",
        "remain",
        "many",
        "problem",
        "detail",
        "appeal",
        "overall",
        "picture",
        "provides",
        "least",
        "good",
        "reason",
        "persevere",
        "account",
        "along",
        "line"
    ]
}