{
    "main_text": "Concepts of information || Technical Definitions of the Concept of Information\n1.2 Technical Definitions of the Concept of Information\n\nIn the twentieth century various proposals for formalisation of\nconcepts of information were made. The proposed concepts cluster\naround two central properties: \n\n\nInformation is extensive. Central is the concept of\nadditivity: the combination of two independent datasets with\nthe same amount of information contains twice as much\ninformation as the separate individual datasets. The mathematical\noperation of taking the logarithm captures this notion of\nextensiveness exactly as it reduces multiplication to addition: \\(\\log\na \\times b = \\log a + \\log b\\).\n\nThe notion of extensiveness emerges naturally in our interactions with\nthe world around us when we count and measure objects and structures.\nBasic conceptions of more abstract mathematical entities, like sets,\nmultisets and sequences, were developed early in history on the basis\nof structural rules for the manipulation of symbols (Schmandt-Besserat\n1992). The mathematical formalisation of extensiveness in terms of the\nlog function took place in the context of research in to\nthermodynamics in the nineteenth and early twentieth century. The\ndifferent notions of entropy defined in physics are mirrored in\nvarious proposals for concepts of information. We mention\nBoltzmann Entropy (Boltzmann, 1866) closely related to the\nHartley Function (Hartley 1928), Gibbs Entropy (Gibbs 1906)\nformally equivalent to Shannon entropy and various generalizations\nlike Tsallis Entropy (Tsallis 1988) and Rényi\nEntropy (Rényi 1961). When coded in terms of more advanced\nmulti-dimensional numbers systems (complex numbers, quaternions,\noctonions) the concept of extensiveness generalizes in to more subtle\nnotions of additivity that do not meet our everyday intuitions. Yet\nthey play an important role in recent developments of information\ntheory based on quantum physics (Von Neumann 1932; Redei &\nStöltzner 2001, see entry on\n quantum entanglement and information).\n \n\nInformation reduces uncertainty. The amount of\ninformation we get grows linearly with the amount by which it reduces\nour uncertainty until the moment that we have received all possible\ninformation and the amount of uncertainty is zero. The relation\nbetween uncertainty and information was probably first formulated by\nthe empiricists (Locke 1689; Hume 1748). Hume explicitly observes that\na choice from a larger selection of possibilities gives more\ninformation. This observation reached its canonical mathematical\nformulation in the function proposed by Hartley (1928) that defines\nthe amount of information we get when we select an element from a\nfinite set. The only mathematical function that unifies these two\nintuitions about extensiveness and probability is the one that defines\nthe information in terms of the negative log of the probability:\n\\(I(A)= -\\log P(A)\\) (Shannon 1948; Shannon & Weaver 1949,\nRényi 1961). \n\n\nWe give a concise overview of some relevant definitions: \n\nQuantitative Theories of Information\n\nNyquist’s function: Nyquist (1924) was\nprobably the first to express the amount of “intelligence”\nthat could be transmitted given a certain line speed of a telegraph\nsystems in terms of a log function: \\(W= k \\log m\\), where W is\nthe speed of transmission, K is a constant, and m are\nthe different voltage levels one can choose from. The fact that\nNyquist used the term intelligence for his measure illustrates\nthe fluidity of terminology at the start of the twentieth century.\n\nFisher information: the amount of information\nthat an observable random variable X carries about an unknown\nparameter \\(\\theta\\) upon which the probability of X depends\n(Fisher 1925).\nThe Hartley function: (Hartley 1928, Rényi\n1961, Vigo 2012). The amount of information we get when we select an\nelement \\(e\\) from a finite set S under uniform distribution is\nthe logarithm of the cardinality of that set: \\(I(e \\mid S) = \\log_a\n|S| \\). \nShannon information: the entropy, H, of a\ndiscrete random variable X is a measure of the amount of\nuncertainty associated with the value of X: \\(I(A)= -\\log\nP(A)\\) (Shannon 1948; Shannon & Weaver 1949). Shannon information\nis the best known quantitative definition of information but it is a\nrather weak concept that does not capture the the notion of\ndisorder that intuitively is essential for the thermodynamic\nconcept of entropy: the string \\(0000011111\\) contains just as much\nShannon information as the string \\(1001011100\\) because it has the\nsame number of ones and zeros. \nAlgorithmic complexity (also know as Kolmogorov\ncomplexity): the information in a binary string x is the length\nof the shortest program p that produces x on a reference\nuniversal Turing machine U (Turing 1937; Solomonoff 1960,\n1964a,b, 1997; 1965; Chaitin 1969, 1987). Algorithmic complexity is\nconceptually more powerful than Shannon information: it does recognise\nthat the string \\(1100100100001111110110101010001000100001\\) contains\nlittle information (because it gives the first 40 bits of the\nnumber π), whereas Shannon’s theory would consider\nthis string to have almost maximal information. This power comes at a\nprice. Kolmogorov complexity quantifies over all possible computer\nprograms shorter than the data set. We cannot run all these programs\nin finite time since a lot of them will never terminate. This implies\nthat Kolmogorov complexity is uncomputable. The measurements\nwe make are all dependent on our choice of reference universal Turing\nmachine. The nature of algorithmic complexity as a measure of\ninformation is guaranteed by the universality of Turing\nmachines as a model of computation and by the so-called invariance\ntheorem: in the limit the the complexity assigned to a dataset by\ntwo different universal Turing machines only differs by a constant.\nAlgorithmic complexity is consequently an asymptotic measure\nthat does not tell us much about small finite datasets. Its practical\nvalue for everyday research is limited, although it has relevance from\na philosophical perspective and as a mathematical tool. \n\nInformation in Physics\n\nLandaur’s Principle: the minimum energy\nneeded to erase one bit of information is proportional to the\ntemperature at which the system is operating (Landauer 1961, 1991).\n\nQuantum Information: The qubit is a\ngeneralization of the classical bit and is described by a quantum\nstate in a two-state quantum-mechanical system, which is formally\nequivalent to a two-dimensional vector space over the complex numbers\n(Von Neumann 1932; Redei & Stöltzner 2001).\n\nQualitative Theories of Information\n\nSemantic Information: Bar-Hillel and Carnap\ndeveloped a theory of semantic Information (1953). Floridi (2002,\n2003, 2011) defines semantic information as well-formed, meaningful\nand truthful data (Long 2014; Lundgren 2019). Formal entropy based\ndefinitions of information (Fisher, Shannon, Quantum, Kolmogorov) work\non a more general level and do not necessarily measure information in\nmeaningful truthful datasets, although one might defend the view that\nin order to be measurable the data must be well-formed (for a\ndiscussion see\n section 6.6 on Logic and Semantic Information).\n Semantic information is close to our everyday naive notion of\ninformation as something that is conveyed by true statements about the\nworld. \nInformation as a state of an agent: the formal\nlogical treatment of notions like knowledge and belief was initiated\nby Hintikka (1962, 1973). Dretske (1981) and van Benthem & van\nRooij (2003) studied these notions in the context of information\ntheory, cf. van Rooij (2003) on questions and answers, or Parikh &\nRamanujam (2003) on general messaging. Also Dunn seems to have this\nnotion in mind when he defines information as “what is left of\nknowledge when one takes away belief, justification and truth”\n(Dunn 2001: 423; 2008). Vigo proposed a Structure-Sensitive Theory of\nInformation based on the complexity of concept acquisition by agents\n(Vigo 2011, 2012). \n\n\n\nThe overview shows a domain of research in development in which the\ncontext of justification is not yet fully separated from the context\nof discovery. Many proposals have an engineering flavour and rely on\nnarratives (sending messages, selecting elements from a set, Turing\nmachines as abstract models human computers) that do not do justice to\nthe fundamental nature of the underlying concepts. Other proposals\nhave deeper roots in philosphy but are formulated in such a way that\nembedding in scientific research is problematic. Take three\ninfluential proposals and their definiens for\ninformation (Shannon-probability; Kolmogorov-computation;\nFloridi-truth) and observe that they have next to nothing in common.\nSome are even conflicting (truth vs. probability, deterministic\ncomputing vs. probability). A similar situation exists in the context\nof thermodynamics and information theory: they use the same formulas\nto describe fundamentally different phenomena (distribution velocities\nof particles in a gas vs. distribution of probabilities over sets of\nmessages).\n\nUntil recently the possibility of a unification of these theories was\ngenerally doubted (Adriaans & van Benthem 2008a), but after two\ndecades of research, perspectives for unification seem better. Various\nquantitative concepts of information are associated with different\nnarratives (counting, receiving messages, gathering information,\ncomputing) rooted in the same basic mathematical framework. Many\nproblems in philosophy of information center around related problems\nin philosophy of mathematics. Conversions and reductions between\nvarious formal models have been studied (Cover & Thomas 2006;\nGrünwald & Vitányi 2008; Bais & Farmer 2008). The\nsituation that seems to emerge is not unlike the concept of energy:\nthere are various formal sub-theories about energy (kinetic,\npotential, electrical, chemical, nuclear) with well-defined\ntransformations between them. Apart from that, the term\n“energy” is used loosely in colloquial speech. The\nemergence of a coherent theory to measure information quantitatively\nin the twentieth century is closely related to the development of the\ntheory of computing. Central in this context are the notions of\nUniversality, Turing equivalence and\nInvariance: because the concept of a Turing system\ndefines the notion of a universal programmable computer, all universal\nmodels of computation seem to have the same power. This implies that\nall possible measures of information definable for universal models of\ncomputation (Recursive Functions, Turing Machine, Lambda Calculus\netc.) are invariant modulo an additive constant. \n\nAdriaans (2020, 2021) proposed a unifying research program implied by\nthis insight under the name of Differential Information\nTheory (DIT): a purely mathematical non-algorithmic\ndescriptive theory of information, based on 1) measuring\ninformation in natural numbers using the log function (see\n section 5.1.7\n for an in-depth discussion) and 2) the concept of the information\nefficiency of recursive functions. Other quantitative proposals\nsuch a Shannon information and Kolmogorov complexity can be placed in\nthis purely descriptive framework as forms of Applied Information\nTheory involving semi-physical systems existing in domains where\na concept of time exists. A big advantage of DIT is the fact that\nrecursive functions are defined axiomatically. This allow for the\ndevelopment of a theory of information as a rigid discipline in line\nwith central concepts of mathematics and physics. Using differential\ninformation theory the creation and destruction of information of\ncomputational, stochastic (and mixed processes like game playing, or\ncreative processes) can be studied. \n",
    "section_title": "1.2 Technical Definitions of the Concept of Information",
    "entry_title": "Information",
    "hierarchy_title": "Information || Concepts of information || Technical Definitions of the Concept of Information",
    "tokenized_text": [
        "concept",
        "information",
        "technical",
        "definition",
        "concept",
        "information",
        "technical",
        "definition",
        "concept",
        "information",
        "twentieth",
        "century",
        "various",
        "proposal",
        "formalisation",
        "concept",
        "information",
        "made",
        "proposed",
        "concept",
        "cluster",
        "around",
        "two",
        "central",
        "property",
        "information",
        "extensive",
        "central",
        "concept",
        "additivity",
        "combination",
        "two",
        "independent",
        "datasets",
        "amount",
        "information",
        "contains",
        "twice",
        "much",
        "information",
        "separate",
        "individual",
        "datasets",
        "mathematical",
        "operation",
        "taking",
        "logarithm",
        "capture",
        "notion",
        "extensiveness",
        "exactly",
        "reduces",
        "multiplication",
        "addition",
        "log",
        "times",
        "b",
        "log",
        "log",
        "b",
        "notion",
        "extensiveness",
        "emerges",
        "naturally",
        "interaction",
        "world",
        "around",
        "u",
        "count",
        "measure",
        "object",
        "structure",
        "basic",
        "conception",
        "abstract",
        "mathematical",
        "entity",
        "like",
        "set",
        "multisets",
        "sequence",
        "developed",
        "early",
        "history",
        "basis",
        "structural",
        "rule",
        "manipulation",
        "symbol",
        "schmandtbesserat",
        "mathematical",
        "formalisation",
        "extensiveness",
        "term",
        "log",
        "function",
        "took",
        "place",
        "context",
        "research",
        "thermodynamics",
        "nineteenth",
        "early",
        "twentieth",
        "century",
        "different",
        "notion",
        "entropy",
        "defined",
        "physic",
        "mirrored",
        "various",
        "proposal",
        "concept",
        "information",
        "mention",
        "boltzmann",
        "entropy",
        "boltzmann",
        "closely",
        "related",
        "hartley",
        "function",
        "hartley",
        "gibbs",
        "entropy",
        "gibbs",
        "formally",
        "equivalent",
        "shannon",
        "entropy",
        "various",
        "generalization",
        "like",
        "tsallis",
        "entropy",
        "tsallis",
        "rényi",
        "entropy",
        "rényi",
        "coded",
        "term",
        "advanced",
        "multidimensional",
        "number",
        "system",
        "complex",
        "number",
        "quaternion",
        "octonions",
        "concept",
        "extensiveness",
        "generalizes",
        "subtle",
        "notion",
        "additivity",
        "meet",
        "everyday",
        "intuition",
        "yet",
        "play",
        "important",
        "role",
        "recent",
        "development",
        "information",
        "theory",
        "based",
        "quantum",
        "physic",
        "von",
        "neumann",
        "redei",
        "stöltzner",
        "see",
        "entry",
        "quantum",
        "entanglement",
        "information",
        "information",
        "reduces",
        "uncertainty",
        "amount",
        "information",
        "get",
        "grows",
        "linearly",
        "amount",
        "reduces",
        "uncertainty",
        "moment",
        "received",
        "possible",
        "information",
        "amount",
        "uncertainty",
        "zero",
        "relation",
        "uncertainty",
        "information",
        "probably",
        "first",
        "formulated",
        "empiricist",
        "locke",
        "hume",
        "hume",
        "explicitly",
        "observes",
        "choice",
        "larger",
        "selection",
        "possibility",
        "give",
        "information",
        "observation",
        "reached",
        "canonical",
        "mathematical",
        "formulation",
        "function",
        "proposed",
        "hartley",
        "defines",
        "amount",
        "information",
        "get",
        "select",
        "element",
        "finite",
        "set",
        "mathematical",
        "function",
        "unifies",
        "two",
        "intuition",
        "extensiveness",
        "probability",
        "one",
        "defines",
        "information",
        "term",
        "negative",
        "log",
        "probability",
        "log",
        "p",
        "shannon",
        "shannon",
        "weaver",
        "rényi",
        "give",
        "concise",
        "overview",
        "relevant",
        "definition",
        "quantitative",
        "theory",
        "information",
        "nyquist",
        "function",
        "nyquist",
        "probably",
        "first",
        "express",
        "amount",
        "intelligence",
        "could",
        "transmitted",
        "given",
        "certain",
        "line",
        "speed",
        "telegraph",
        "system",
        "term",
        "log",
        "function",
        "w",
        "k",
        "log",
        "m",
        "w",
        "speed",
        "transmission",
        "k",
        "constant",
        "different",
        "voltage",
        "level",
        "one",
        "choose",
        "fact",
        "nyquist",
        "used",
        "term",
        "intelligence",
        "measure",
        "illustrates",
        "fluidity",
        "terminology",
        "start",
        "twentieth",
        "century",
        "fisher",
        "information",
        "amount",
        "information",
        "observable",
        "random",
        "variable",
        "x",
        "carry",
        "unknown",
        "parameter",
        "theta",
        "upon",
        "probability",
        "x",
        "depends",
        "fisher",
        "hartley",
        "function",
        "hartley",
        "rényi",
        "vigo",
        "amount",
        "information",
        "get",
        "select",
        "element",
        "e",
        "finite",
        "set",
        "uniform",
        "distribution",
        "logarithm",
        "cardinality",
        "set",
        "e",
        "mid",
        "log_a",
        "s",
        "shannon",
        "information",
        "entropy",
        "h",
        "discrete",
        "random",
        "variable",
        "x",
        "measure",
        "amount",
        "uncertainty",
        "associated",
        "value",
        "x",
        "log",
        "p",
        "shannon",
        "shannon",
        "weaver",
        "shannon",
        "information",
        "best",
        "known",
        "quantitative",
        "definition",
        "information",
        "rather",
        "weak",
        "concept",
        "capture",
        "notion",
        "disorder",
        "intuitively",
        "essential",
        "thermodynamic",
        "concept",
        "entropy",
        "string",
        "contains",
        "much",
        "shannon",
        "information",
        "string",
        "number",
        "one",
        "zero",
        "algorithmic",
        "complexity",
        "also",
        "know",
        "kolmogorov",
        "complexity",
        "information",
        "binary",
        "string",
        "x",
        "length",
        "shortest",
        "program",
        "p",
        "produce",
        "x",
        "reference",
        "universal",
        "turing",
        "machine",
        "u",
        "turing",
        "solomonoff",
        "a",
        "b",
        "chaitin",
        "algorithmic",
        "complexity",
        "conceptually",
        "powerful",
        "shannon",
        "information",
        "recognise",
        "string",
        "contains",
        "little",
        "information",
        "give",
        "first",
        "bit",
        "number",
        "π",
        "whereas",
        "shannon",
        "theory",
        "would",
        "consider",
        "string",
        "almost",
        "maximal",
        "information",
        "power",
        "come",
        "price",
        "kolmogorov",
        "complexity",
        "quantifies",
        "possible",
        "computer",
        "program",
        "shorter",
        "data",
        "set",
        "run",
        "program",
        "finite",
        "time",
        "since",
        "lot",
        "never",
        "terminate",
        "implies",
        "kolmogorov",
        "complexity",
        "uncomputable",
        "measurement",
        "make",
        "dependent",
        "choice",
        "reference",
        "universal",
        "turing",
        "machine",
        "nature",
        "algorithmic",
        "complexity",
        "measure",
        "information",
        "guaranteed",
        "universality",
        "turing",
        "machine",
        "model",
        "computation",
        "socalled",
        "invariance",
        "theorem",
        "limit",
        "complexity",
        "assigned",
        "dataset",
        "two",
        "different",
        "universal",
        "turing",
        "machine",
        "differs",
        "constant",
        "algorithmic",
        "complexity",
        "consequently",
        "asymptotic",
        "measure",
        "tell",
        "u",
        "much",
        "small",
        "finite",
        "datasets",
        "practical",
        "value",
        "everyday",
        "research",
        "limited",
        "although",
        "relevance",
        "philosophical",
        "perspective",
        "mathematical",
        "tool",
        "information",
        "physic",
        "landaur",
        "principle",
        "minimum",
        "energy",
        "needed",
        "erase",
        "one",
        "bit",
        "information",
        "proportional",
        "temperature",
        "system",
        "operating",
        "landauer",
        "quantum",
        "information",
        "qubit",
        "generalization",
        "classical",
        "bit",
        "described",
        "quantum",
        "state",
        "twostate",
        "quantummechanical",
        "system",
        "formally",
        "equivalent",
        "twodimensional",
        "vector",
        "space",
        "complex",
        "number",
        "von",
        "neumann",
        "redei",
        "stöltzner",
        "qualitative",
        "theory",
        "information",
        "semantic",
        "information",
        "barhillel",
        "carnap",
        "developed",
        "theory",
        "semantic",
        "information",
        "floridi",
        "defines",
        "semantic",
        "information",
        "wellformed",
        "meaningful",
        "truthful",
        "data",
        "long",
        "lundgren",
        "formal",
        "entropy",
        "based",
        "definition",
        "information",
        "fisher",
        "shannon",
        "quantum",
        "kolmogorov",
        "work",
        "general",
        "level",
        "necessarily",
        "measure",
        "information",
        "meaningful",
        "truthful",
        "datasets",
        "although",
        "one",
        "might",
        "defend",
        "view",
        "order",
        "measurable",
        "data",
        "must",
        "wellformed",
        "discussion",
        "see",
        "section",
        "logic",
        "semantic",
        "information",
        "semantic",
        "information",
        "close",
        "everyday",
        "naive",
        "notion",
        "information",
        "something",
        "conveyed",
        "true",
        "statement",
        "world",
        "information",
        "state",
        "agent",
        "formal",
        "logical",
        "treatment",
        "notion",
        "like",
        "knowledge",
        "belief",
        "initiated",
        "hintikka",
        "dretske",
        "van",
        "benthem",
        "van",
        "rooij",
        "studied",
        "notion",
        "context",
        "information",
        "theory",
        "cf",
        "van",
        "rooij",
        "question",
        "answer",
        "parikh",
        "ramanujam",
        "general",
        "messaging",
        "also",
        "dunn",
        "seems",
        "notion",
        "mind",
        "defines",
        "information",
        "left",
        "knowledge",
        "one",
        "take",
        "away",
        "belief",
        "justification",
        "truth",
        "dunn",
        "vigo",
        "proposed",
        "structuresensitive",
        "theory",
        "information",
        "based",
        "complexity",
        "concept",
        "acquisition",
        "agent",
        "vigo",
        "overview",
        "show",
        "domain",
        "research",
        "development",
        "context",
        "justification",
        "yet",
        "fully",
        "separated",
        "context",
        "discovery",
        "many",
        "proposal",
        "engineering",
        "flavour",
        "rely",
        "narrative",
        "sending",
        "message",
        "selecting",
        "element",
        "set",
        "turing",
        "machine",
        "abstract",
        "model",
        "human",
        "computer",
        "justice",
        "fundamental",
        "nature",
        "underlying",
        "concept",
        "proposal",
        "deeper",
        "root",
        "philosphy",
        "formulated",
        "way",
        "embedding",
        "scientific",
        "research",
        "problematic",
        "take",
        "three",
        "influential",
        "proposal",
        "definiens",
        "information",
        "shannonprobability",
        "kolmogorovcomputation",
        "floriditruth",
        "observe",
        "next",
        "nothing",
        "common",
        "even",
        "conflicting",
        "truth",
        "vs",
        "probability",
        "deterministic",
        "computing",
        "vs",
        "probability",
        "similar",
        "situation",
        "exists",
        "context",
        "thermodynamics",
        "information",
        "theory",
        "use",
        "formula",
        "describe",
        "fundamentally",
        "different",
        "phenomenon",
        "distribution",
        "velocity",
        "particle",
        "gas",
        "vs",
        "distribution",
        "probability",
        "set",
        "message",
        "recently",
        "possibility",
        "unification",
        "theory",
        "generally",
        "doubted",
        "adriaans",
        "van",
        "benthem",
        "a",
        "two",
        "decade",
        "research",
        "perspective",
        "unification",
        "seem",
        "better",
        "various",
        "quantitative",
        "concept",
        "information",
        "associated",
        "different",
        "narrative",
        "counting",
        "receiving",
        "message",
        "gathering",
        "information",
        "computing",
        "rooted",
        "basic",
        "mathematical",
        "framework",
        "many",
        "problem",
        "philosophy",
        "information",
        "center",
        "around",
        "related",
        "problem",
        "philosophy",
        "mathematics",
        "conversion",
        "reduction",
        "various",
        "formal",
        "model",
        "studied",
        "cover",
        "thomas",
        "grünwald",
        "vitányi",
        "bai",
        "farmer",
        "situation",
        "seems",
        "emerge",
        "unlike",
        "concept",
        "energy",
        "various",
        "formal",
        "subtheories",
        "energy",
        "kinetic",
        "potential",
        "electrical",
        "chemical",
        "nuclear",
        "welldefined",
        "transformation",
        "apart",
        "term",
        "energy",
        "used",
        "loosely",
        "colloquial",
        "speech",
        "emergence",
        "coherent",
        "theory",
        "measure",
        "information",
        "quantitatively",
        "twentieth",
        "century",
        "closely",
        "related",
        "development",
        "theory",
        "computing",
        "central",
        "context",
        "notion",
        "universality",
        "turing",
        "equivalence",
        "invariance",
        "concept",
        "turing",
        "system",
        "defines",
        "notion",
        "universal",
        "programmable",
        "computer",
        "universal",
        "model",
        "computation",
        "seem",
        "power",
        "implies",
        "possible",
        "measure",
        "information",
        "definable",
        "universal",
        "model",
        "computation",
        "recursive",
        "function",
        "turing",
        "machine",
        "lambda",
        "calculus",
        "etc",
        "invariant",
        "modulo",
        "additive",
        "constant",
        "adriaans",
        "proposed",
        "unifying",
        "research",
        "program",
        "implied",
        "insight",
        "name",
        "differential",
        "information",
        "theory",
        "dit",
        "purely",
        "mathematical",
        "nonalgorithmic",
        "descriptive",
        "theory",
        "information",
        "based",
        "measuring",
        "information",
        "natural",
        "number",
        "using",
        "log",
        "function",
        "see",
        "section",
        "indepth",
        "discussion",
        "concept",
        "information",
        "efficiency",
        "recursive",
        "function",
        "quantitative",
        "proposal",
        "shannon",
        "information",
        "kolmogorov",
        "complexity",
        "placed",
        "purely",
        "descriptive",
        "framework",
        "form",
        "applied",
        "information",
        "theory",
        "involving",
        "semiphysical",
        "system",
        "existing",
        "domain",
        "concept",
        "time",
        "exists",
        "big",
        "advantage",
        "dit",
        "fact",
        "recursive",
        "function",
        "defined",
        "axiomatically",
        "allow",
        "development",
        "theory",
        "information",
        "rigid",
        "discipline",
        "line",
        "central",
        "concept",
        "mathematics",
        "physic",
        "using",
        "differential",
        "information",
        "theory",
        "creation",
        "destruction",
        "information",
        "computational",
        "stochastic",
        "mixed",
        "process",
        "like",
        "game",
        "playing",
        "creative",
        "process",
        "studied"
    ]
}