{
    "main_text": "Information, Modes of Presentation, and Meaning\n2. Information, Modes of Presentation, and Meaning\n\nTheories of meaning that turn on modes of presentation have been\ncommon in philosophy in one way or another since Frege’s\nSense and Reference. The story is as follows. There must be\nmore to the meaning of a referring term than its referent, since terms\ncan co-refer. For example, James Newell Osterberg Jr. and\nIggy Pop both refer to the same individual. In spite of this\nthe intuition that they do not mean the same thing is strong.\n“Iggy Pop is Iggy Pop” and “Iggy Pop is James Newell\nOsterberg Jr.” do not seem to mean the same thing.\nSimilarly, it seems to be the case that “Alice believes that\nIggy Pop was the singer in The Stooges” might true, whilst\n“Alice believes that James Newell Osterberg Jr. was the singer\nin The Stooges” might be false, at least on one natural reading\nthat is in line with our intuitions with regard to meanings.\n\nFrege’s well known response is that both the referent and the\nsense of a referring term play a role in specifying its semantic\ncontent. But what is the sense of a term? Frege’s own way of\ncashing out the notion of sense is in terms of a mode of\npresentation (MOP), an idea used by many later philosophers. The\nMOP of a referring term is the way in which the putative referent of\nthe term is presented to us by our phenomenology. MOPs are what we\nwould use in an attempt to identify or locate the referent of a\nreferring term whose meaning we grasp. Many contemporary theories of\nmeaning that turn on information, incorporate MOPs in one way or\nanother. The reason for this is that although reducing the meaning of\na term to the information carried or transmitted by it alone is\nattractive, it has proven to be fraught.\n\nThe temptation to take meaning and information to amount to pretty\nmuch the same thing is a result of the following idea. The idea is\nthat the word ‘cat’ denotes the property of being a cat,\nand that it means cat because it expresses the concept cat,\nand the concept cat\nmeans cat. The concept cat means\ncat because it carries the information\n\\(\\langle\\)cat\\(\\rangle\\), and cat carries the\ninformation \\(\\langle\\)cat\\(\\rangle\\) because its instances or\ntokenings are caused, by and large, by cats. This is a nice idea. By\ntying meaning and information together and telling a causal\nstory about them, we have a naturalistic story to tell about the\ninformation that we get from our environment, and hence a naturalistic\nstory to tell about meaning. Such information-transmitting causal\nrelationships are information channels—causal\nconnections that facilitate the flow of information between the source\nof information and the receiver. We should take care to note this\nstory is telling an informationally semantic story about\nsub-propositionally located pieces of information such as the\npredicate ‘cat’ and paradigmatic uses of singular terms.\nAs such it sits outside of the domain described by the theories of\nsemantic and strongly semantic information described above. In spite\nof this, we will see that a refinement of this story turns on tracking\naccuracy, if not truth itself.\n\nIn a series of influential works on this area of informational\nsemantics, Jerry Fodor (1990), and Fred Dretske (1981) proposed a\ntheory of semantics very much like the one outlined above (see the\nentry on\n causal theories of mental content).\n A noted problem for such an informational semantics has come to be\nknown commonly as the disjunction problem. The disjunction\nproblem is as follows. cat tokens are not\nalways caused by cats, they are sometimes caused by other things like\nsmall dogs for example (or by thoughts about balls of yarn or\nwhatever). Given this fact, if the story above is correct, then why\ndoes cat mean cat and not cat or\ndog? Fodor’s (1990) response is in two stages.\n\nFirstly, Fodor’s initial proposal is that non cat-caused tokens\nof cat are asymmetrically dependent on\ncat-caused tokens of cat. That is, there would\nnot be any non cat-caused tokens of cat had\nthere not been any cat-caused tokens of cat.\nSecondly, on Fodor’s picture, meaning and information come\napart. The information carried by a token of a concept\ncovaries with its cause, whereas the meaning of a token is\nwhat all of the concept’s tokenings have in common—the\ninner vehicles of our cat tokenings, or their\nMOPs. Note that Fodor is not, strictly speaking, subsuming information\nas part of meaning, but rather teasing them apart. Our failure to\nappreciate that meaning and information come apart is, according to\nFodor, a consequence of the fact that firstly, they are very often\ncoextensive, and that secondly, ‘means’ is a homonym for\nboth semantic content (meaning) and information-carrying. Consider the\nfollowing two uses of “means”:\n\nSmoke means fire.\n‘Smoke’ means smoke.\n\n\nOn Fodor’s view, the first use is in the sense of\ninformation-carrying only. Smoke carries the information that there is\nfire, but that is not what it means semantically. What\n‘smoke’ means, in the semantic sense, is smoke,\nand this is captured by the latter use of “means” above.\nOn Fodor’s story, just as with ‘cat’ above,\n‘smoke’ means smoke because it expresses smoke,\nand tokenings of smoke\nare caused paradigmatically (but not always!)\nby smoke itself. The “not always” qualification is covered\nby the asymmetric dependence condition above. So far so good, but what\nabout non-existent objects such as bunyips? Non bunyip-caused bunyip\ntokens of bunyip cannot be asymmetrically\ndependent on bunyip-caused bunyip tokens of bunyip\nbecause there are no bunyips around to cause\nanything at all.\n\nIn light of non-existent objects such as bunyips, and the\nmeaningfulness of bunyip tokens in spite of\nthere being no bunyips, Fodor adjusts his proposal so that meaning now\nrests on asymmetrical dependences among nomological relations\namong properties—the property of being a bunyip for\nexample—as opposed to actual causal relations between\nindividuals. Nomological relations are cashed out in terms of\ncounterfactuals, so what we have now is an informational semantics\nalong the lines of the following—bunyip\nmeans bunyip because if there were bunyips, bunyips\nwould be the cause of bunyip tokens\non which all other causes would depend asymmetrically.\n\nRecall again that Fodor is teasing meaning and information apart.\nGareth Evans (1982) formulates a similar informational theory of\nmeaning, but one where information and MOPs are both subsumed within\nthe semantic story itself. For Evans, a full story about the meaning\nof thoughts about particular objects that are—putatively at\nleast—in the world, needs to take account of both the causal\norigins of the thought, as well as the MOP engendered by it. Evans\ncalls such thoughts information based particular thoughts,\nand such thoughts will be well grounded if and only if the\nobject satisfying the MOP and the object at the source-end of the\ncausal route are one and the same thing.\n\nWhat the Fodor/Dretske and Evans theories of informational semantics\nhave in common, is that they recognise that the meaning or\ncontent/object of a thought is robust across causal variation:\n\n\nWe want to be able to say that two informational states (states of\ndifferent persons) embody the same information, provided that they\nresult from the same initial informational event. (Evans 1982:\n128–129)\n\nInformational theories…appeal to reliable covariances while\nquantifying over the causal mechanisms by which these covariances are\nsustained. By doing so, they explain why information (indeed, why the\nvery same information ) can be transmitted over so many different\nkinds of channels. (Fodor 1990: 100)\n\n\nMoreover, although Evans did not put things in quite these terms,\nFodor, Dretske, and Evans all recognise information channels\nas robust entities in their own right.\n\nFrançois Recanati (2012, 2016), has proposed a detailed version\nof informational semantics, his mental files theory, within\nwhich information channels play a central role. Recanati’s\nmental files are cognitive counterparts to singular terms, and as such\nare referring concepts. Recanati’s view looks very similar to\nEvan’s information based particular thoughts at first glance.\nHowever, on Recanati’s view, metal files contain information\nin the form of MOPs of an object—be they given directly\nand experientially, or indirectly via descriptions—their\nreference is not fixed by the information that they contain/their\nmodes of presentation. Rather, the reference of a metal file is fixed\nby the relations on which this file is based, and the\nreferent of a mental file will be the entity or object with which we\nare acquainted correctly in virtue of such relations obtaining. So\nRecanati is allowing that MOPs contain information themselves, rather\nthan restrict the role of information to the reference fixing relation\nitself (as do Evans and Fodor). The feature that identifies these\nrelations is that they are epistemically rewarding (ER)\nrelations. For Recanati, a relation is an ER relation in virtue of the\nfact that it is the sort of relation that makes the flow of\ninformation possible. In other words, ER relations are\ninformation channels.\n\nRecanati’s ER relations draw heavily on Lewis’s (1983)\nrelations of “epistemic rapport”—causal chains that\nwould permit information flow, or information channels under another\nname. Both Recanati and Lewis recognise the disjunction problem by\nallowing that both information and misinformation may be transmitted\nalong information channels. Recanati’s take is that the\nreference of a mental file is fixed by the object that sits at the\ndistal end of the information channel that contributes to the\ninformation that the mental file contains, irrespectively of the\n“fit”. Fit may of course be bad on account of noisy\nchannels and/or misidentification on the agent’s behalf. As\nRecanati puts it:\n\n\nThe role of a mental file based on a certain acquaintance relation is\nto store information acquired in virtue of that relation. The\ninformation in question need not be veridical; we can think of it in\nterms, simply, of a list of predicates which the subject takes the\nreferent to satisfy. The referent need not actually satisfy the\npredicates in question, since the subject may be mistaken. Such\nmistakes are possible because what determines the reference is not the\ncontent of the file but the relevant relation to the object. The file\ncorresponds to an information channel, and the reference is the object\nfrom which the information derives, whether that information is\ngenuine information or misinformation. (2012: 37–38)\n\n\nIt reads here as though Recanati is conflating a mental file on the\none hand, with the information channel that carries its informational\npayload. Indeed Recanati goes on to argue that there are two sensible\nand “distinct notions of file” (p. 82). The first notion\nis simply a repository of evolving information that appears to be and\nmay be about a single distinct object. The second notion of file, what\nRecanati calls the “proper notion”, involves both\na specific relevant information channel, and the repository\nof information acquired via that channel.\n\nAlong with Fodor, Dretske, Evans, Recanati, and Lewis, Frank Jackson\n(2010) also articulates a semantic theory based upon information\nchannels that supervene on causal relations, along with MOPs.\nJackson’s MOPs are identified with descriptions.\nJackson’s description theory of reference for proper names turns\non information channels, which are articulated in terms of causal\nlinks that underpin information flow. Jackson’s motivating idea\nis that names are by and large sources of information about the\nentities that they name. The descriptive dimension is a function of\ntheir (the descriptions) being specified in terms of\ninformation-carrying causal connections—information\nchannels.\n\nFor Jackson, language is, in general, a representational system that\ntransmits information about the way that things are taken to be to\nthose who comprehend the language. When names are used in declarative\nsentences, speakers are representing things as being a certain way.\nThe use of names in such contexts is to deliver putative information\nabout the way things are to other speakers in the language community.\nAccording to Jackson, names do this as a function of their being parts\nof information channels that exist between users of the language, and\nthe world. In order for us to track the information channel itself for\nthe purposes of getting information from it, we must understand the\nstructured connection between linguistic items (words and sentences),\nand ways that the world might be. Names themselves facilitate this\npractice in virtue of their being elements in the information channels\nthat exist between us and the world. These channels are created by\nconventions of language use and established practices of baptism.\n\nGiven the ubiquity of information channels in the theories above, it\nis no surprise that information channels have become a topic of study\non their own terms. The theory of information channels has made\ncontributions to information-based analysis of natural language and\nformal semantics.\n",
    "section_title": "2. Information, Modes of Presentation, and Meaning",
    "entry_title": "Semantic Conceptions of Information",
    "hierarchy_title": "Semantic Conceptions of Information || Information, Modes of Presentation, and Meaning",
    "tokenized_text": [
        "information",
        "mode",
        "presentation",
        "meaning",
        "information",
        "mode",
        "presentation",
        "meaning",
        "theory",
        "meaning",
        "turn",
        "mode",
        "presentation",
        "common",
        "philosophy",
        "one",
        "way",
        "another",
        "since",
        "frege",
        "sense",
        "reference",
        "story",
        "follows",
        "must",
        "meaning",
        "referring",
        "term",
        "referent",
        "since",
        "term",
        "corefer",
        "example",
        "james",
        "newell",
        "osterberg",
        "jr",
        "iggy",
        "pop",
        "refer",
        "individual",
        "spite",
        "intuition",
        "mean",
        "thing",
        "strong",
        "iggy",
        "pop",
        "iggy",
        "pop",
        "iggy",
        "pop",
        "james",
        "newell",
        "osterberg",
        "jr",
        "seem",
        "mean",
        "thing",
        "similarly",
        "seems",
        "case",
        "alice",
        "belief",
        "iggy",
        "pop",
        "singer",
        "stooge",
        "might",
        "true",
        "whilst",
        "alice",
        "belief",
        "james",
        "newell",
        "osterberg",
        "jr",
        "singer",
        "stooge",
        "might",
        "false",
        "least",
        "one",
        "natural",
        "reading",
        "line",
        "intuition",
        "regard",
        "meaning",
        "frege",
        "well",
        "known",
        "response",
        "referent",
        "sense",
        "referring",
        "term",
        "play",
        "role",
        "specifying",
        "semantic",
        "content",
        "sense",
        "term",
        "frege",
        "way",
        "cashing",
        "notion",
        "sense",
        "term",
        "mode",
        "presentation",
        "mop",
        "idea",
        "used",
        "many",
        "later",
        "philosopher",
        "mop",
        "referring",
        "term",
        "way",
        "putative",
        "referent",
        "term",
        "presented",
        "u",
        "phenomenology",
        "mop",
        "would",
        "use",
        "attempt",
        "identify",
        "locate",
        "referent",
        "referring",
        "term",
        "whose",
        "meaning",
        "grasp",
        "many",
        "contemporary",
        "theory",
        "meaning",
        "turn",
        "information",
        "incorporate",
        "mop",
        "one",
        "way",
        "another",
        "reason",
        "although",
        "reducing",
        "meaning",
        "term",
        "information",
        "carried",
        "transmitted",
        "alone",
        "attractive",
        "proven",
        "fraught",
        "temptation",
        "take",
        "meaning",
        "information",
        "amount",
        "pretty",
        "much",
        "thing",
        "result",
        "following",
        "idea",
        "idea",
        "word",
        "cat",
        "denotes",
        "property",
        "cat",
        "mean",
        "cat",
        "express",
        "concept",
        "cat",
        "concept",
        "cat",
        "mean",
        "cat",
        "concept",
        "cat",
        "mean",
        "cat",
        "carry",
        "information",
        "langle",
        "cat",
        "rangle",
        "cat",
        "carry",
        "information",
        "langle",
        "cat",
        "rangle",
        "instance",
        "tokenings",
        "caused",
        "large",
        "cat",
        "nice",
        "idea",
        "tying",
        "meaning",
        "information",
        "together",
        "telling",
        "causal",
        "story",
        "naturalistic",
        "story",
        "tell",
        "information",
        "get",
        "environment",
        "hence",
        "naturalistic",
        "story",
        "tell",
        "meaning",
        "informationtransmitting",
        "causal",
        "relationship",
        "information",
        "channelscausal",
        "connection",
        "facilitate",
        "flow",
        "information",
        "source",
        "information",
        "receiver",
        "take",
        "care",
        "note",
        "story",
        "telling",
        "informationally",
        "semantic",
        "story",
        "subpropositionally",
        "located",
        "piece",
        "information",
        "predicate",
        "cat",
        "paradigmatic",
        "us",
        "singular",
        "term",
        "sits",
        "outside",
        "domain",
        "described",
        "theory",
        "semantic",
        "strongly",
        "semantic",
        "information",
        "described",
        "spite",
        "see",
        "refinement",
        "story",
        "turn",
        "tracking",
        "accuracy",
        "truth",
        "series",
        "influential",
        "work",
        "area",
        "informational",
        "semantics",
        "jerry",
        "fodor",
        "fred",
        "dretske",
        "proposed",
        "theory",
        "semantics",
        "much",
        "like",
        "one",
        "outlined",
        "see",
        "entry",
        "causal",
        "theory",
        "mental",
        "content",
        "noted",
        "problem",
        "informational",
        "semantics",
        "come",
        "known",
        "commonly",
        "disjunction",
        "problem",
        "disjunction",
        "problem",
        "follows",
        "cat",
        "token",
        "always",
        "caused",
        "cat",
        "sometimes",
        "caused",
        "thing",
        "like",
        "small",
        "dog",
        "example",
        "thought",
        "ball",
        "yarn",
        "whatever",
        "given",
        "fact",
        "story",
        "correct",
        "cat",
        "mean",
        "cat",
        "cat",
        "dog",
        "fodor",
        "response",
        "two",
        "stage",
        "firstly",
        "fodor",
        "initial",
        "proposal",
        "non",
        "catcaused",
        "token",
        "cat",
        "asymmetrically",
        "dependent",
        "catcaused",
        "token",
        "cat",
        "would",
        "non",
        "catcaused",
        "token",
        "cat",
        "catcaused",
        "token",
        "cat",
        "secondly",
        "fodor",
        "picture",
        "meaning",
        "information",
        "come",
        "apart",
        "information",
        "carried",
        "token",
        "concept",
        "covaries",
        "cause",
        "whereas",
        "meaning",
        "token",
        "concept",
        "tokenings",
        "commonthe",
        "inner",
        "vehicle",
        "cat",
        "tokenings",
        "mop",
        "note",
        "fodor",
        "strictly",
        "speaking",
        "subsuming",
        "information",
        "part",
        "meaning",
        "rather",
        "teasing",
        "apart",
        "failure",
        "appreciate",
        "meaning",
        "information",
        "come",
        "apart",
        "according",
        "fodor",
        "consequence",
        "fact",
        "firstly",
        "often",
        "coextensive",
        "secondly",
        "mean",
        "homonym",
        "semantic",
        "content",
        "meaning",
        "informationcarrying",
        "consider",
        "following",
        "two",
        "us",
        "mean",
        "smoke",
        "mean",
        "fire",
        "smoke",
        "mean",
        "smoke",
        "fodor",
        "view",
        "first",
        "use",
        "sense",
        "informationcarrying",
        "smoke",
        "carry",
        "information",
        "fire",
        "mean",
        "semantically",
        "smoke",
        "mean",
        "semantic",
        "sense",
        "smoke",
        "captured",
        "latter",
        "use",
        "mean",
        "fodor",
        "story",
        "cat",
        "smoke",
        "mean",
        "smoke",
        "express",
        "smoke",
        "tokenings",
        "smoke",
        "caused",
        "paradigmatically",
        "always",
        "smoke",
        "always",
        "qualification",
        "covered",
        "asymmetric",
        "dependence",
        "condition",
        "far",
        "good",
        "nonexistent",
        "object",
        "bunyips",
        "non",
        "bunyipcaused",
        "bunyip",
        "token",
        "bunyip",
        "asymmetrically",
        "dependent",
        "bunyipcaused",
        "bunyip",
        "token",
        "bunyip",
        "bunyips",
        "around",
        "cause",
        "anything",
        "light",
        "nonexistent",
        "object",
        "bunyips",
        "meaningfulness",
        "bunyip",
        "token",
        "spite",
        "bunyips",
        "fodor",
        "adjusts",
        "proposal",
        "meaning",
        "rest",
        "asymmetrical",
        "dependence",
        "among",
        "nomological",
        "relation",
        "among",
        "propertiesthe",
        "property",
        "bunyip",
        "exampleas",
        "opposed",
        "actual",
        "causal",
        "relation",
        "individual",
        "nomological",
        "relation",
        "cashed",
        "term",
        "counterfactuals",
        "informational",
        "semantics",
        "along",
        "line",
        "followingbunyip",
        "mean",
        "bunyip",
        "bunyips",
        "bunyips",
        "would",
        "cause",
        "bunyip",
        "token",
        "cause",
        "would",
        "depend",
        "asymmetrically",
        "recall",
        "fodor",
        "teasing",
        "meaning",
        "information",
        "apart",
        "gareth",
        "evans",
        "formulates",
        "similar",
        "informational",
        "theory",
        "meaning",
        "one",
        "information",
        "mop",
        "subsumed",
        "within",
        "semantic",
        "story",
        "evans",
        "full",
        "story",
        "meaning",
        "thought",
        "particular",
        "object",
        "areputatively",
        "leastin",
        "world",
        "need",
        "take",
        "account",
        "causal",
        "origin",
        "thought",
        "well",
        "mop",
        "engendered",
        "evans",
        "call",
        "thought",
        "information",
        "based",
        "particular",
        "thought",
        "thought",
        "well",
        "grounded",
        "object",
        "satisfying",
        "mop",
        "object",
        "sourceend",
        "causal",
        "route",
        "one",
        "thing",
        "fodordretske",
        "evans",
        "theory",
        "informational",
        "semantics",
        "common",
        "recognise",
        "meaning",
        "contentobject",
        "thought",
        "robust",
        "across",
        "causal",
        "variation",
        "want",
        "able",
        "say",
        "two",
        "informational",
        "state",
        "state",
        "different",
        "person",
        "embody",
        "information",
        "provided",
        "result",
        "initial",
        "informational",
        "event",
        "evans",
        "informational",
        "theoriesappeal",
        "reliable",
        "covariance",
        "quantifying",
        "causal",
        "mechanism",
        "covariance",
        "sustained",
        "explain",
        "information",
        "indeed",
        "information",
        "transmitted",
        "many",
        "different",
        "kind",
        "channel",
        "fodor",
        "moreover",
        "although",
        "evans",
        "put",
        "thing",
        "quite",
        "term",
        "fodor",
        "dretske",
        "evans",
        "recognise",
        "information",
        "channel",
        "robust",
        "entity",
        "right",
        "françois",
        "recanati",
        "proposed",
        "detailed",
        "version",
        "informational",
        "semantics",
        "mental",
        "file",
        "theory",
        "within",
        "information",
        "channel",
        "play",
        "central",
        "role",
        "recanati",
        "mental",
        "file",
        "cognitive",
        "counterpart",
        "singular",
        "term",
        "referring",
        "concept",
        "recanati",
        "view",
        "look",
        "similar",
        "evan",
        "information",
        "based",
        "particular",
        "thought",
        "first",
        "glance",
        "however",
        "recanati",
        "view",
        "metal",
        "file",
        "contain",
        "information",
        "form",
        "mop",
        "objectbe",
        "given",
        "directly",
        "experientially",
        "indirectly",
        "via",
        "descriptionstheir",
        "reference",
        "fixed",
        "information",
        "containtheir",
        "mode",
        "presentation",
        "rather",
        "reference",
        "metal",
        "file",
        "fixed",
        "relation",
        "file",
        "based",
        "referent",
        "mental",
        "file",
        "entity",
        "object",
        "acquainted",
        "correctly",
        "virtue",
        "relation",
        "obtaining",
        "recanati",
        "allowing",
        "mop",
        "contain",
        "information",
        "rather",
        "restrict",
        "role",
        "information",
        "reference",
        "fixing",
        "relation",
        "evans",
        "fodor",
        "feature",
        "identifies",
        "relation",
        "epistemically",
        "rewarding",
        "er",
        "relation",
        "recanati",
        "relation",
        "er",
        "relation",
        "virtue",
        "fact",
        "sort",
        "relation",
        "make",
        "flow",
        "information",
        "possible",
        "word",
        "er",
        "relation",
        "information",
        "channel",
        "recanati",
        "er",
        "relation",
        "draw",
        "heavily",
        "lewis",
        "relation",
        "epistemic",
        "rapport",
        "causal",
        "chain",
        "would",
        "permit",
        "information",
        "flow",
        "information",
        "channel",
        "another",
        "name",
        "recanati",
        "lewis",
        "recognise",
        "disjunction",
        "problem",
        "allowing",
        "information",
        "misinformation",
        "may",
        "transmitted",
        "along",
        "information",
        "channel",
        "recanati",
        "take",
        "reference",
        "mental",
        "file",
        "fixed",
        "object",
        "sits",
        "distal",
        "end",
        "information",
        "channel",
        "contributes",
        "information",
        "mental",
        "file",
        "contains",
        "irrespectively",
        "fit",
        "fit",
        "may",
        "course",
        "bad",
        "account",
        "noisy",
        "channel",
        "andor",
        "misidentification",
        "agent",
        "behalf",
        "recanati",
        "put",
        "role",
        "mental",
        "file",
        "based",
        "certain",
        "acquaintance",
        "relation",
        "store",
        "information",
        "acquired",
        "virtue",
        "relation",
        "information",
        "question",
        "need",
        "veridical",
        "think",
        "term",
        "simply",
        "list",
        "predicate",
        "subject",
        "take",
        "referent",
        "satisfy",
        "referent",
        "need",
        "actually",
        "satisfy",
        "predicate",
        "question",
        "since",
        "subject",
        "may",
        "mistaken",
        "mistake",
        "possible",
        "determines",
        "reference",
        "content",
        "file",
        "relevant",
        "relation",
        "object",
        "file",
        "corresponds",
        "information",
        "channel",
        "reference",
        "object",
        "information",
        "derives",
        "whether",
        "information",
        "genuine",
        "information",
        "misinformation",
        "read",
        "though",
        "recanati",
        "conflating",
        "mental",
        "file",
        "one",
        "hand",
        "information",
        "channel",
        "carry",
        "informational",
        "payload",
        "indeed",
        "recanati",
        "go",
        "argue",
        "two",
        "sensible",
        "distinct",
        "notion",
        "file",
        "p",
        "first",
        "notion",
        "simply",
        "repository",
        "evolving",
        "information",
        "appears",
        "may",
        "single",
        "distinct",
        "object",
        "second",
        "notion",
        "file",
        "recanati",
        "call",
        "proper",
        "notion",
        "involves",
        "specific",
        "relevant",
        "information",
        "channel",
        "repository",
        "information",
        "acquired",
        "via",
        "channel",
        "along",
        "fodor",
        "dretske",
        "evans",
        "recanati",
        "lewis",
        "frank",
        "jackson",
        "also",
        "articulates",
        "semantic",
        "theory",
        "based",
        "upon",
        "information",
        "channel",
        "supervene",
        "causal",
        "relation",
        "along",
        "mop",
        "jackson",
        "mop",
        "identified",
        "description",
        "jackson",
        "description",
        "theory",
        "reference",
        "proper",
        "name",
        "turn",
        "information",
        "channel",
        "articulated",
        "term",
        "causal",
        "link",
        "underpin",
        "information",
        "flow",
        "jackson",
        "motivating",
        "idea",
        "name",
        "large",
        "source",
        "information",
        "entity",
        "name",
        "descriptive",
        "dimension",
        "function",
        "description",
        "specified",
        "term",
        "informationcarrying",
        "causal",
        "connectionsinformation",
        "channel",
        "jackson",
        "language",
        "general",
        "representational",
        "system",
        "transmits",
        "information",
        "way",
        "thing",
        "taken",
        "comprehend",
        "language",
        "name",
        "used",
        "declarative",
        "sentence",
        "speaker",
        "representing",
        "thing",
        "certain",
        "way",
        "use",
        "name",
        "context",
        "deliver",
        "putative",
        "information",
        "way",
        "thing",
        "speaker",
        "language",
        "community",
        "according",
        "jackson",
        "name",
        "function",
        "part",
        "information",
        "channel",
        "exist",
        "user",
        "language",
        "world",
        "order",
        "u",
        "track",
        "information",
        "channel",
        "purpose",
        "getting",
        "information",
        "must",
        "understand",
        "structured",
        "connection",
        "linguistic",
        "item",
        "word",
        "sentence",
        "way",
        "world",
        "might",
        "name",
        "facilitate",
        "practice",
        "virtue",
        "element",
        "information",
        "channel",
        "exist",
        "u",
        "world",
        "channel",
        "created",
        "convention",
        "language",
        "use",
        "established",
        "practice",
        "baptism",
        "given",
        "ubiquity",
        "information",
        "channel",
        "theory",
        "surprise",
        "information",
        "channel",
        "become",
        "topic",
        "study",
        "term",
        "theory",
        "information",
        "channel",
        "made",
        "contribution",
        "informationbased",
        "analysis",
        "natural",
        "language",
        "formal",
        "semantics"
    ]
}