{
    "main_text": "Introduction || Monism, Holism, and Multiple Systems views\n1.3 Monism, Holism, and Multiple Systems views\n\nThe increasing focus by biologists on DNA as a “master\nmolecule” containing coded genetic information, after the\ndiscovery of the double helix structure in 1953, on the one hand, and\nthe gene-selectionist view articulated in 1966 by George Williams in\nhis book Adaptation and Natural Selection, which culminated\nin the “replicator” concept in philosophy of biology\n(Dawkins 1976; Hull 1980, see entry:\n Replication and Reproduction),\n on the other, led to a tendency to view biological inheritance as\nconsisting of a single channel of transmission. This channel is\nunderstood to involve the inheritance of genetic information encoded\nin DNA (or, in some viruses in RNA), a view often referred to as\n“geno-centrism”. It should be noted that the replicator\nconcept itself does not rule out non-genetic replicators (Dawkins\n1976, see also the discussion by Sterelny, Smith, & Dickison\n1996). The dual-inheritance model of biological and cultural evolution\nwhich is based on two types of replicators, genes and memes, is a\nparadigmatic example that is based on the replicator framework, and\nthat involves both more than one channel of inheritance and\nnon-genetic inheritance (for detailed discussion of the notion of\ncultural inheritance see the entry on\n cultural evolution).\n Accounts of heredity that are based on the notion of replicators may\napproach non-genetic inheritance by characterizing multiple\nkinds of replicators (e.g., memes), each of which is supposed\nto underlie a different channel of non-genetic inheritance. John\nMaynard Smith and Eörs Szathmáry’s account of\nMajor Transitions in Evolution is organized around\ntransitions to new kinds of ways in which information is stored and\ntransmitted, understood as transitions to new kinds of replicating\nentities (Maynard Smith & Szathmáry 1995), and multiple\ntypes of replicators are embraced by the notion of the extended\nreplicator (Sterelny 2001; Sterelny et al. 1996, see entry:\n Replication and Reproduction)\n discussed below. More typically, however, non-genetic forms of\ninheritance, with the possible exception of cultural inheritance in a\nfew groups of higher animals, are often ruled out as not fulfilling\nthe requirements imposed by the definition of a replicator (regarding\nthe debate whether human cultural evolution is best understood through\napplying a replicator framework to learning and imitation, see Lewens\n2015, chps. 1 and 2). It should be emphasized that the replicator view\nposited replicators, typically genes, as the unit of selection; the\nwork discussed in this entry is concerned with the biological\nprocesses and mechanisms involved in inheritance, and is not concerned\ndirectly with the debate about the unit of selection. Implications\nregarding selection are elaborated in\n section 4.1.\n\nApproaches that rule out or ignore non-genetic inheritance might be\ncharacterized as “monist” in their treatment of the\nquestion of the existence and significance of multiple inheritance\nsystems. Monist tendencies may be traced back already to Wilhelm\nJohannsen’s work at the beginning of the 20th century. While\nJohannsen invented the term “gene” in order to remain\nuncommitted to a specific view about the material constitution of\nhereditary factors, both this term and the notion of\n“genotype” that he developed suggest a monist view of\ninheritance. This tendency was reinforced by molecular genetics and\nthe replicator framework.\n\nHow do monist views handle the other forms of inheritance that are\nknown to exist? Consider the mitochondria. Monist accounts regard the\nmaternal inheritance of organelles such as the mitochondria, which\nmight conceivably be thought to constitute a separate inheritance\nchannel, if not system, to be of marginal conceptual importance.\nFirst, it can be argued that being based on genetically coded\ninformation (DNA sequence), the similarities with nuclear inheritance\nallows it to be seen as not involving a distinct inheritance system,\nif this notion is understood to refer to the way hereditary\ninformation is stored and transmitted. Indeed, views that focus on\nmultiple inheritance systems may, for the very same reason, not\nconsider the inheritance of plastids as based on a distinct\ninheritance system. Second, it is assumed that the evolution of\ncomplex organismal traits is to be explained by natural selection\nacting on variation in genetic information in the nucleus. Thus,\nmitchondrial inheritance, and plastid inheritance more generally, are\nconsidered to be of limited explanatory value when trying to give a\ngeneral account of the evolution of the organism (beyond the early\nstages of endosymbiogenesis), and is of interest mainly when\nconsidering the evolution of the mitochonrdia themselves, in which\ncase there is yet again a single inheritance system that is relevant,\nthat of the mitochondrial genome. Similar reasoning is applied more\ngenerally to reject forms of supposedly extra-genetic inheritance that\nare not based on the transmission of DNA, by claiming either that the\ninheritance fails to be the transmission of information or that the\ninformation that can be transmitted is limited and thus not\nevolutionarily significant, and is merely the transmission of material\nresources or infrastructure. Cashed out in the terms of the replicator\nframework, arguments against supposed cases of extra-genetic\ninheritance are that they do not lead to the establishment of\nreplicators, which are entities that are faithfully copied and passed\ndown multiple generations, yet replicators are necessary for evolution\nby natural selection, or that extra-genetic inheritance leads to\nreplicators that are limited in the repertoire of variants they\nsupport (see Godfrey-Smith 2000). Proponents of the multiple\ninheritance systems view and of holistic views about inheritance argue\nthat these requirements are either unnecessary or too strong, and lead\nto a distorted understanding of evolution (see Griffiths & Gray\n2001; Jablonka 2001).\n\nIn contrast to monist views, proponents of “Developmental\nSystems Theory” (DST) (Griffiths & Gray 1994, 2001) offer a\nradical reformulation of evolutionary theory, including the notion of\ninheritance and the treatment of extra-genetic inheritance. DST\napplies the notion of inheritance to any developmental resource that\nis reliably present in successive generations, and which is part of\nthe explanation of the similarity between generations (Griffiths &\nGray 2001). While embracing the existence of non-genetic inheritance,\nand its significance for evolutionary accounts, these researchers\nargue against separating these phenomena into multiple channels or\nsystems of inheritance (Griffiths & Gray 2001): Inheritance\nphenomena are so intertwined in their effects on development, and each\nrelies on others to have its developmental effect, that it is both\nmore realistic and scientifically more productive not to separate them\ninto distinct channels, systems, or replicator types. The DST approach\nmight be characterized as “holistic” in its treatment of\ninheritance.\n\nIn contrast to monism and holism, the views discussed in this entry\nidentify and classify various mechanisms and processes of inheritance,\nthe types of hereditary information that are passed on by each, the\nfunction and interaction of the different systems, and the\nevolutionary consequences of these properties. Contemporary views on\nevolution that stress the role of multiple systems of inheritance have\nbeen greatly influenced by the work Eva Jablonka and Marion Lamb, in\nparticular their arguments about the evolutionary role of epigenetic\ninheritance (Jablonka 2001, 2002; Jablonka & Lamb 1995, 2005/2014,\n2006) . In addition to the line of work influenced by Jablonka and\nLamb, extra-genetic inheritance is stressed by DST, albeit in the form\nof holism about inheritance, and in the “extended\nreplicator” framework elaborated by Kim Sterelny et al.\n(Sterelny 2001; Sterelny et al. 1996).\n\nResponding to pressure from DST, the extended replicator approach\nelaborates the account of non-genetic replicators provided by the\nreplicator framework (Dawkins 1976; Hull 1980) to include non-genetic\nreplicators, while retaining the replicator/interactor distinction\nwhich both the holism of DST and the multiple systems view of Jablonka\nand Lamb reject: Replicators form lineages, while interactors, through\nwhich replicators interact with the environment, are ephemeral (see\n section 2.2\n for discussion). Sterelny et al. (1996) emphasize the distinction\nbetween genes as factors having “a distinctive informational\nrole in inheritance” and other reliably present developmental\nresources. According to them, this distinctive informational role\nexplains why genes, and not just any resource, represent the\nphenotype and have a special developmental role. They embrace other\ncases of biological replication if they can be informational in the\nstrong sense their account demands. In a nutshell, the main\nrequirements are that the replicator have the biofunction (i.e.,\nproper function or evolutionarily selected function) of representing\nthe phenotype (or aspects of it) and that it play a causal role in the\nproduction of the phenotype. Genes according to this view do not have\na unique or privileged role in determining the phenotype; however,\nthey do have a distinctive informational role (see\n section 2.4).\n Whether other types of replicators exist is an empirical matter, and\nviewing various biological processes as replication may be\nscientifically productive according to Sterelny et al. (1996). In more\nrecent work, Griffiths appeals to causal specificity for roughly the\nsame purpose. He frames the debate as being about the extent to which\nnon-genetic inheritance is involved in the precise determination of\nthe phenotype, or how specific the causal relation is (see\n section 2.4).\n",
    "section_title": "1.3 Monism, Holism, and Multiple Systems views",
    "entry_title": "Inheritance Systems",
    "hierarchy_title": "Inheritance Systems || Introduction || Monism, Holism, and Multiple Systems views",
    "tokenized_text": [
        "introduction",
        "monism",
        "holism",
        "multiple",
        "system",
        "view",
        "monism",
        "holism",
        "multiple",
        "system",
        "view",
        "increasing",
        "focus",
        "biologist",
        "dna",
        "master",
        "molecule",
        "containing",
        "coded",
        "genetic",
        "information",
        "discovery",
        "double",
        "helix",
        "structure",
        "one",
        "hand",
        "geneselectionist",
        "view",
        "articulated",
        "george",
        "williams",
        "book",
        "adaptation",
        "natural",
        "selection",
        "culminated",
        "replicator",
        "concept",
        "philosophy",
        "biology",
        "dawkins",
        "hull",
        "see",
        "entry",
        "replication",
        "reproduction",
        "led",
        "tendency",
        "view",
        "biological",
        "inheritance",
        "consisting",
        "single",
        "channel",
        "transmission",
        "channel",
        "understood",
        "involve",
        "inheritance",
        "genetic",
        "information",
        "encoded",
        "dna",
        "virus",
        "rna",
        "view",
        "often",
        "referred",
        "genocentrism",
        "noted",
        "replicator",
        "concept",
        "rule",
        "nongenetic",
        "replicators",
        "dawkins",
        "see",
        "also",
        "discussion",
        "sterelny",
        "smith",
        "dickison",
        "dualinheritance",
        "model",
        "biological",
        "cultural",
        "evolution",
        "based",
        "two",
        "type",
        "replicators",
        "gene",
        "meme",
        "paradigmatic",
        "example",
        "based",
        "replicator",
        "framework",
        "involves",
        "one",
        "channel",
        "inheritance",
        "nongenetic",
        "inheritance",
        "detailed",
        "discussion",
        "notion",
        "cultural",
        "inheritance",
        "see",
        "entry",
        "cultural",
        "evolution",
        "account",
        "heredity",
        "based",
        "notion",
        "replicators",
        "may",
        "approach",
        "nongenetic",
        "inheritance",
        "characterizing",
        "multiple",
        "kind",
        "replicators",
        "eg",
        "meme",
        "supposed",
        "underlie",
        "different",
        "channel",
        "nongenetic",
        "inheritance",
        "john",
        "maynard",
        "smith",
        "eörs",
        "szathmáry",
        "account",
        "major",
        "transition",
        "evolution",
        "organized",
        "around",
        "transition",
        "new",
        "kind",
        "way",
        "information",
        "stored",
        "transmitted",
        "understood",
        "transition",
        "new",
        "kind",
        "replicating",
        "entity",
        "maynard",
        "smith",
        "szathmáry",
        "multiple",
        "type",
        "replicators",
        "embraced",
        "notion",
        "extended",
        "replicator",
        "sterelny",
        "sterelny",
        "et",
        "al",
        "see",
        "entry",
        "replication",
        "reproduction",
        "discussed",
        "typically",
        "however",
        "nongenetic",
        "form",
        "inheritance",
        "possible",
        "exception",
        "cultural",
        "inheritance",
        "group",
        "higher",
        "animal",
        "often",
        "ruled",
        "fulfilling",
        "requirement",
        "imposed",
        "definition",
        "replicator",
        "regarding",
        "debate",
        "whether",
        "human",
        "cultural",
        "evolution",
        "best",
        "understood",
        "applying",
        "replicator",
        "framework",
        "learning",
        "imitation",
        "see",
        "lewens",
        "chps",
        "emphasized",
        "replicator",
        "view",
        "posited",
        "replicators",
        "typically",
        "gene",
        "unit",
        "selection",
        "work",
        "discussed",
        "entry",
        "concerned",
        "biological",
        "process",
        "mechanism",
        "involved",
        "inheritance",
        "concerned",
        "directly",
        "debate",
        "unit",
        "selection",
        "implication",
        "regarding",
        "selection",
        "elaborated",
        "section",
        "approach",
        "rule",
        "ignore",
        "nongenetic",
        "inheritance",
        "might",
        "characterized",
        "monist",
        "treatment",
        "question",
        "existence",
        "significance",
        "multiple",
        "inheritance",
        "system",
        "monist",
        "tendency",
        "may",
        "traced",
        "back",
        "already",
        "wilhelm",
        "johannsen",
        "work",
        "beginning",
        "th",
        "century",
        "johannsen",
        "invented",
        "term",
        "gene",
        "order",
        "remain",
        "uncommitted",
        "specific",
        "view",
        "material",
        "constitution",
        "hereditary",
        "factor",
        "term",
        "notion",
        "genotype",
        "developed",
        "suggest",
        "monist",
        "view",
        "inheritance",
        "tendency",
        "reinforced",
        "molecular",
        "genetics",
        "replicator",
        "framework",
        "monist",
        "view",
        "handle",
        "form",
        "inheritance",
        "known",
        "exist",
        "consider",
        "mitochondrion",
        "monist",
        "account",
        "regard",
        "maternal",
        "inheritance",
        "organelle",
        "mitochondrion",
        "might",
        "conceivably",
        "thought",
        "constitute",
        "separate",
        "inheritance",
        "channel",
        "system",
        "marginal",
        "conceptual",
        "importance",
        "first",
        "argued",
        "based",
        "genetically",
        "coded",
        "information",
        "dna",
        "sequence",
        "similarity",
        "nuclear",
        "inheritance",
        "allows",
        "seen",
        "involving",
        "distinct",
        "inheritance",
        "system",
        "notion",
        "understood",
        "refer",
        "way",
        "hereditary",
        "information",
        "stored",
        "transmitted",
        "indeed",
        "view",
        "focus",
        "multiple",
        "inheritance",
        "system",
        "may",
        "reason",
        "consider",
        "inheritance",
        "plastid",
        "based",
        "distinct",
        "inheritance",
        "system",
        "second",
        "assumed",
        "evolution",
        "complex",
        "organismal",
        "trait",
        "explained",
        "natural",
        "selection",
        "acting",
        "variation",
        "genetic",
        "information",
        "nucleus",
        "thus",
        "mitchondrial",
        "inheritance",
        "plastid",
        "inheritance",
        "generally",
        "considered",
        "limited",
        "explanatory",
        "value",
        "trying",
        "give",
        "general",
        "account",
        "evolution",
        "organism",
        "beyond",
        "early",
        "stage",
        "endosymbiogenesis",
        "interest",
        "mainly",
        "considering",
        "evolution",
        "mitochonrdia",
        "case",
        "yet",
        "single",
        "inheritance",
        "system",
        "relevant",
        "mitochondrial",
        "genome",
        "similar",
        "reasoning",
        "applied",
        "generally",
        "reject",
        "form",
        "supposedly",
        "extragenetic",
        "inheritance",
        "based",
        "transmission",
        "dna",
        "claiming",
        "either",
        "inheritance",
        "fails",
        "transmission",
        "information",
        "information",
        "transmitted",
        "limited",
        "thus",
        "evolutionarily",
        "significant",
        "merely",
        "transmission",
        "material",
        "resource",
        "infrastructure",
        "cashed",
        "term",
        "replicator",
        "framework",
        "argument",
        "supposed",
        "case",
        "extragenetic",
        "inheritance",
        "lead",
        "establishment",
        "replicators",
        "entity",
        "faithfully",
        "copied",
        "passed",
        "multiple",
        "generation",
        "yet",
        "replicators",
        "necessary",
        "evolution",
        "natural",
        "selection",
        "extragenetic",
        "inheritance",
        "lead",
        "replicators",
        "limited",
        "repertoire",
        "variant",
        "support",
        "see",
        "godfreysmith",
        "proponent",
        "multiple",
        "inheritance",
        "system",
        "view",
        "holistic",
        "view",
        "inheritance",
        "argue",
        "requirement",
        "either",
        "unnecessary",
        "strong",
        "lead",
        "distorted",
        "understanding",
        "evolution",
        "see",
        "griffith",
        "gray",
        "jablonka",
        "contrast",
        "monist",
        "view",
        "proponent",
        "developmental",
        "system",
        "theory",
        "dst",
        "griffith",
        "gray",
        "offer",
        "radical",
        "reformulation",
        "evolutionary",
        "theory",
        "including",
        "notion",
        "inheritance",
        "treatment",
        "extragenetic",
        "inheritance",
        "dst",
        "applies",
        "notion",
        "inheritance",
        "developmental",
        "resource",
        "reliably",
        "present",
        "successive",
        "generation",
        "part",
        "explanation",
        "similarity",
        "generation",
        "griffith",
        "gray",
        "embracing",
        "existence",
        "nongenetic",
        "inheritance",
        "significance",
        "evolutionary",
        "account",
        "researcher",
        "argue",
        "separating",
        "phenomenon",
        "multiple",
        "channel",
        "system",
        "inheritance",
        "griffith",
        "gray",
        "inheritance",
        "phenomenon",
        "intertwined",
        "effect",
        "development",
        "relies",
        "others",
        "developmental",
        "effect",
        "realistic",
        "scientifically",
        "productive",
        "separate",
        "distinct",
        "channel",
        "system",
        "replicator",
        "type",
        "dst",
        "approach",
        "might",
        "characterized",
        "holistic",
        "treatment",
        "inheritance",
        "contrast",
        "monism",
        "holism",
        "view",
        "discussed",
        "entry",
        "identify",
        "classify",
        "various",
        "mechanism",
        "process",
        "inheritance",
        "type",
        "hereditary",
        "information",
        "passed",
        "function",
        "interaction",
        "different",
        "system",
        "evolutionary",
        "consequence",
        "property",
        "contemporary",
        "view",
        "evolution",
        "stress",
        "role",
        "multiple",
        "system",
        "inheritance",
        "greatly",
        "influenced",
        "work",
        "eva",
        "jablonka",
        "marion",
        "lamb",
        "particular",
        "argument",
        "evolutionary",
        "role",
        "epigenetic",
        "inheritance",
        "jablonka",
        "jablonka",
        "lamb",
        "addition",
        "line",
        "work",
        "influenced",
        "jablonka",
        "lamb",
        "extragenetic",
        "inheritance",
        "stressed",
        "dst",
        "albeit",
        "form",
        "holism",
        "inheritance",
        "extended",
        "replicator",
        "framework",
        "elaborated",
        "kim",
        "sterelny",
        "et",
        "al",
        "sterelny",
        "sterelny",
        "et",
        "al",
        "responding",
        "pressure",
        "dst",
        "extended",
        "replicator",
        "approach",
        "elaborates",
        "account",
        "nongenetic",
        "replicators",
        "provided",
        "replicator",
        "framework",
        "dawkins",
        "hull",
        "include",
        "nongenetic",
        "replicators",
        "retaining",
        "replicatorinteractor",
        "distinction",
        "holism",
        "dst",
        "multiple",
        "system",
        "view",
        "jablonka",
        "lamb",
        "reject",
        "replicators",
        "form",
        "lineage",
        "interactors",
        "replicators",
        "interact",
        "environment",
        "ephemeral",
        "see",
        "section",
        "discussion",
        "sterelny",
        "et",
        "al",
        "emphasize",
        "distinction",
        "gene",
        "factor",
        "distinctive",
        "informational",
        "role",
        "inheritance",
        "reliably",
        "present",
        "developmental",
        "resource",
        "according",
        "distinctive",
        "informational",
        "role",
        "explains",
        "gene",
        "resource",
        "represent",
        "phenotype",
        "special",
        "developmental",
        "role",
        "embrace",
        "case",
        "biological",
        "replication",
        "informational",
        "strong",
        "sense",
        "account",
        "demand",
        "nutshell",
        "main",
        "requirement",
        "replicator",
        "biofunction",
        "ie",
        "proper",
        "function",
        "evolutionarily",
        "selected",
        "function",
        "representing",
        "phenotype",
        "aspect",
        "play",
        "causal",
        "role",
        "production",
        "phenotype",
        "gene",
        "according",
        "view",
        "unique",
        "privileged",
        "role",
        "determining",
        "phenotype",
        "however",
        "distinctive",
        "informational",
        "role",
        "see",
        "section",
        "whether",
        "type",
        "replicators",
        "exist",
        "empirical",
        "matter",
        "viewing",
        "various",
        "biological",
        "process",
        "replication",
        "may",
        "scientifically",
        "productive",
        "according",
        "sterelny",
        "et",
        "al",
        "recent",
        "work",
        "griffith",
        "appeal",
        "causal",
        "specificity",
        "roughly",
        "purpose",
        "frame",
        "debate",
        "extent",
        "nongenetic",
        "inheritance",
        "involved",
        "precise",
        "determination",
        "phenotype",
        "specific",
        "causal",
        "relation",
        "see",
        "section"
    ]
}