{
    "main_text": "Empirical Findings and Theories || Physical Objects\n2.2 Physical Objects\n\n\nAs adults, we recognize physical objects as bounded entities that\npersist through space and time; they ‘hold together’ as\nunits, and their paths, when they move, are continuous. In addition, objects causally interact upon contact\nwith each other. Do we learn these properties of objects by\nexperience, and if so, by what sort of\nexperience? Empiricist thinkers have argued that these properties\nare learned, and have proposed several different types of experience as\nrequisite input to such learning. Helmholtz (1867/1962) suggested\nthat moving around objects and manipulating them were necessary for\nbuilding a concept of an object. Quine (1960) looked to language\nas the relevant source of information, and Piaget (1954)\nproposed that sensorimotor coordinations led to construction of the\nconcept of a physical object. Indeed, Piaget famously argued that\ninfants altogether lack object permanence (1977), the\nunderstanding that objects persist in time and space, until the latter\nhalf of the second year of life.\n2.2.1 Folk physics\n\nObject permanence. In the last 35 years,\nthe baby’s representation of objects has been re-explored with\nstriking results. A landmark study (Baillargeon et al. 1985) used\nthe violation-of-expectancy paradigm to test the Piagetian claim that\ninfants lack object permanence. Five-month-old infants were shown\na screen that rotated 180 degrees up from the surface of a table and\nback again to its initial position. In the habituation phase, the babies\ngot used to the screen motion and their looking time decreased,\nevidence that they no longer found the screen’s movement to be\nnovel. In the test phase, an object was placed in the path of the\nscreen as the screen moved downward to the table’s surface.\nIn one outcome, the screen rotated down until it touched the object and\nthen rotated back up to its initial position, an event that adults\nrecognize as possible. In the other outcome, the screen continued\nits downward trajectory to the table, at first hiding the object and\nthen apparently moving right through the space occupied by the object,\nan event that adults recognize as physically impossible. The\nlogic here is straightforward: babies will see the second outcome as\nsurprising only if (i) they represent the object as continuing to exist\neven when it can no longer be seen behind the screen, and (ii) they\nassume that two objects cannot occupy the same space at the same\ntime. Only then should they look longer at what adults recognize\nas an impossible event. If, however, young infants lack object\npermanence or have no constraints about two physical objects occupying\nthe same space, the impossible event will not constitute a\nviolation of any expectation. The results were clear; babies\nlooked longer at the impossible event, indicating that it violated\ntheir expectation of objects. The same finding was later\ndemonstrated with 4-month-olds (Baillargeon 1987). These findings\noffer evidence that very young infants represent objects as persisting\neven when they are no longer in view, an understanding of object\npermanence thoroughly at odds with the claims of Piaget and\nQuine. One may still ask what exactly the child\nknows or represents (Burge 2010 is especially\npertinent here), but the point is that there is something in\nthe child’s cognitive apparatus that is sufficient to generate\nthis expectation, and the burden of explanation is on the view that\nthis is learned from experience. Moreover, these infants also\nexpect that two objects will not occupy the same space at the same\ntime.\n\nSpatiotemporal continuity of objects. As adults, we know that\nobjects are spatiotemporally continuous; an object that appears at\npoint \\(A\\) and then at point \\(B\\) must have traversed a\ncontinuous path between these points. Here too the violation of\nexpectancy looking time paradigm has been used to test the Empiricist\nclaim that such knowledge requires an extended learning period. In one\nstudy (Spelke et al. 1995), 4.5-month-olds were shown a stage with 2 screens on it, with a\nvisible gap between the screens. In the discontinuous motion\ncondition, each screen has an object hidden behind\nit. First, the object behind the left screen is moved further\nleft so that the baby sees it, then it is moved back behind that same\nscreen. The object behind the right screen is shown in the same\nway, so that during these displays only one object has been visible at\na time and no object has ever been shown to cross the gap between the\ntwo screens. Adults seeing this display infer that there are 2\nobjects involved. To find out if babies make the same inference,\nthe screens are removed and the infant is shown either one object or\ntwo objects. The result is that infants look longer at the\none-object display, presumably expecting, like adults, that there had\nto be two objects; otherwise, the object would have been visible\ncrossing the gap. In a follow-up study, a continuous motion\ncondition was used. This condition is identical to the previous\ncondition except that, between the alternating trials, an object\nis seen crossing the gap. In this condition babies\nlooked longer at the display of two objects. Like\nadults, they presumably assumed there was a single object moving back\nand forth (Aguiar & Baillargeon 1999 report similar findings\nwith 2-month-olds).  Generally, by 2-months, and perhaps earlier, infants expect that objects persist through time, move continuously, have parts that cohere, and are solid (Spelke 1990).  Recent work (Rips & Hespos 2015) shows that by 6-months, babies already have different expectations for rigid bodies, soft objects, and liquids.\n2.2.2 Animals and the representation of objects\n\n\nIf the representation of spatiotemporally continuous objects is part\nof our evolutionary endowment, we might expect to find such\nrepresentation in the newborn of other species, and indeed we\ndo. Newborn chicks, for example, display a striking ability to\nrepresent spatiotemporally continuous objects (see Spelke 1998 for\nreview). In one study, newborn chicks spent their first day of\nlife in a homogeneous environment containing only one inanimate object.\nOn their second day, the object was moved fully out of view\nbehind one of two screens. Though they had never before seen an\nobject hidden behind another, they reliably searched behind the correct\nscreen where the object was hidden. Indeed they even did so when\nthey had to turn away from the object in order to reach it (Regolin et\nal. 1995; Regolin et al. 2000). Chicks, it seems, have object\npermanence from birth. Although this does not show that\nobject permanence is innate in humans, it does show that in at least\none animal, evolution has succeeded in building it in.\nSo Nativists can claim an existence proof of an innately endowed\nrepresentation of objects as permanent.\n2.2.3 Babies’ representations of objects support addition and subtraction\n\n\nWynn (1992) showed that young babies represent objects as not only\npersisting in time and space, but also as subject to addition and\nsubtraction. In that study, babies were habituated to a display\nof a single object on a stage. Then a screen came up and hid the\nobject completely. Now a hand was seen to bring in another\n(identical) object and move behind the screen, from which the hand then\nwithdrew empty. The question was: do the babies now represent 2\nobjects behind the screen? Test displays consisted of 1 object, 2\nobjects, and 3 objects. Again, in line with Nativist claims,\nbabies showed longer looking times to all displays except the\n2-object display. In this respect, babies showed the same\nexpectations that adults do. Further testing showed that babies\nare not only capable of ‘adding up’ the number of hidden\nobjects (at least to 3), but are also capable of\n‘subtraction’ of the same number of hidden objects as well.\nThis finding has been replicated in 4- and 5-month-olds as well\n(Simon et al. 1995; Koechlin et al. 1998).\n\n\nIt may be tempting to see the infant’s ability to add and\nsubtract the number of objects in a display as evidence that infants\nalready have something close to the adult concept of number, but a\nseries of studies suggests that this is not the case. Most\ntelling is the extremely limited set size (about 3 objects) over which\nthe baby can add or subtract. To illustrate this set size limit,\nwhich has emerged in a variety of experiments, consider the following\nstudy that used crawling, rather than violation-of-expectancy, as an\nindicator of the baby’s representation (Feigenson & Carey\n2005). In this study, babies watched as graham crackers were\nplaced, one at time, into 2 separate boxes. The babies were then\nallowed to crawl to the box of their choice and retrieve the\ncrackers. When one box had 1 cracker and the other box had 2,\nbabies crawled to the box with 2. Similarly, when one box had 3\ncrackers and the other had 2 or had 1, they crawled to the box with\n3. The surprising finding, however, is that babies failed with 4\nversus 3, 4 versus 2, and even 4 versus 1. Apparently, the\nability to represent and keep track of exactly 4 objects is beyond the\nbaby’s capability. Given the set size limit of 3 objects,\nit is arguable that the baby’s competence should be understood as\nan ability to track 3 different objects in working memory. One\nmight argue that the baby can succeed in adding and subtracting very\nsmall numbers of objects without having a general concept of number\nor any general numerical competence. We return to this issue\nin section 2.3.\n2.2.4 Intermodal representation\n\n\nAs mentioned above, Piaget (1954) proposed that sensorimotor\ncoordinations gradually lead to construction of the object\nconcept. Establishing these coordinations between different modes\nof perceptual experience—vision and touch, for\nexample—would take time, and Piaget proposes that it is not until\nthe child is 18–24 months that these coordinations have been\nconstructed. Meltzoff\n& Moore 1977 provide counter-evidence to this claim. This study shows that newborn infants\ncan imitate the facial movements of an experimenter, clearly revealing\nthe coordination of their own movements (along with the attendant\nfeelings of their muscles) and their visual perception of the\nexperimenter’s facial movements. The following video links\n(Ferrari et al. 2006,  videos S1 and S2)\nprovide some evidence\nthat newborn rhesus macaques have this ability as well. Insofar\nas these coordinations of different modes of perceptual experience are\npresent at birth in humans and in monkeys, they simply could not be the\nproducts of learning. \n",
    "section_title": "2.2 Physical Objects",
    "entry_title": "Innateness and Contemporary Theories of Cognition",
    "hierarchy_title": "Innateness and Contemporary Theories of Cognition || Empirical Findings and Theories || Physical Objects",
    "tokenized_text": [
        "empirical",
        "finding",
        "theory",
        "physical",
        "object",
        "physical",
        "object",
        "adult",
        "recognize",
        "physical",
        "object",
        "bounded",
        "entity",
        "persist",
        "space",
        "time",
        "hold",
        "together",
        "unit",
        "path",
        "move",
        "continuous",
        "addition",
        "object",
        "causally",
        "interact",
        "upon",
        "contact",
        "learn",
        "property",
        "object",
        "experience",
        "sort",
        "experience",
        "empiricist",
        "thinker",
        "argued",
        "property",
        "learned",
        "proposed",
        "several",
        "different",
        "type",
        "experience",
        "requisite",
        "input",
        "learning",
        "helmholtz",
        "suggested",
        "moving",
        "around",
        "object",
        "manipulating",
        "necessary",
        "building",
        "concept",
        "object",
        "quine",
        "looked",
        "language",
        "relevant",
        "source",
        "information",
        "piaget",
        "proposed",
        "sensorimotor",
        "coordination",
        "led",
        "construction",
        "concept",
        "physical",
        "object",
        "indeed",
        "piaget",
        "famously",
        "argued",
        "infant",
        "altogether",
        "lack",
        "object",
        "permanence",
        "understanding",
        "object",
        "persist",
        "time",
        "space",
        "latter",
        "half",
        "second",
        "year",
        "life",
        "folk",
        "physic",
        "object",
        "permanence",
        "last",
        "year",
        "baby",
        "representation",
        "object",
        "reexplored",
        "striking",
        "result",
        "landmark",
        "study",
        "baillargeon",
        "et",
        "al",
        "used",
        "violationofexpectancy",
        "paradigm",
        "test",
        "piagetian",
        "claim",
        "infant",
        "lack",
        "object",
        "permanence",
        "fivemonthold",
        "infant",
        "shown",
        "screen",
        "rotated",
        "degree",
        "surface",
        "table",
        "back",
        "initial",
        "position",
        "habituation",
        "phase",
        "baby",
        "got",
        "used",
        "screen",
        "motion",
        "looking",
        "time",
        "decreased",
        "evidence",
        "longer",
        "found",
        "screen",
        "movement",
        "novel",
        "test",
        "phase",
        "object",
        "placed",
        "path",
        "screen",
        "screen",
        "moved",
        "downward",
        "table",
        "surface",
        "one",
        "outcome",
        "screen",
        "rotated",
        "touched",
        "object",
        "rotated",
        "back",
        "initial",
        "position",
        "event",
        "adult",
        "recognize",
        "possible",
        "outcome",
        "screen",
        "continued",
        "downward",
        "trajectory",
        "table",
        "first",
        "hiding",
        "object",
        "apparently",
        "moving",
        "right",
        "space",
        "occupied",
        "object",
        "event",
        "adult",
        "recognize",
        "physically",
        "impossible",
        "logic",
        "straightforward",
        "baby",
        "see",
        "second",
        "outcome",
        "surprising",
        "represent",
        "object",
        "continuing",
        "exist",
        "even",
        "longer",
        "seen",
        "behind",
        "screen",
        "ii",
        "assume",
        "two",
        "object",
        "occupy",
        "space",
        "time",
        "look",
        "longer",
        "adult",
        "recognize",
        "impossible",
        "event",
        "however",
        "young",
        "infant",
        "lack",
        "object",
        "permanence",
        "constraint",
        "two",
        "physical",
        "object",
        "occupying",
        "space",
        "impossible",
        "event",
        "constitute",
        "violation",
        "expectation",
        "result",
        "clear",
        "baby",
        "looked",
        "longer",
        "impossible",
        "event",
        "indicating",
        "violated",
        "expectation",
        "object",
        "finding",
        "later",
        "demonstrated",
        "montholds",
        "baillargeon",
        "finding",
        "offer",
        "evidence",
        "young",
        "infant",
        "represent",
        "object",
        "persisting",
        "even",
        "longer",
        "view",
        "understanding",
        "object",
        "permanence",
        "thoroughly",
        "odds",
        "claim",
        "piaget",
        "quine",
        "one",
        "may",
        "still",
        "ask",
        "exactly",
        "child",
        "know",
        "represents",
        "burge",
        "especially",
        "pertinent",
        "point",
        "something",
        "child",
        "cognitive",
        "apparatus",
        "sufficient",
        "generate",
        "expectation",
        "burden",
        "explanation",
        "view",
        "learned",
        "experience",
        "moreover",
        "infant",
        "also",
        "expect",
        "two",
        "object",
        "occupy",
        "space",
        "time",
        "spatiotemporal",
        "continuity",
        "object",
        "adult",
        "know",
        "object",
        "spatiotemporally",
        "continuous",
        "object",
        "appears",
        "point",
        "a",
        "point",
        "b",
        "must",
        "traversed",
        "continuous",
        "path",
        "point",
        "violation",
        "expectancy",
        "looking",
        "time",
        "paradigm",
        "used",
        "test",
        "empiricist",
        "claim",
        "knowledge",
        "requires",
        "extended",
        "learning",
        "period",
        "one",
        "study",
        "spelke",
        "et",
        "al",
        "montholds",
        "shown",
        "stage",
        "screen",
        "visible",
        "gap",
        "screen",
        "discontinuous",
        "motion",
        "condition",
        "screen",
        "object",
        "hidden",
        "behind",
        "first",
        "object",
        "behind",
        "left",
        "screen",
        "moved",
        "left",
        "baby",
        "see",
        "moved",
        "back",
        "behind",
        "screen",
        "object",
        "behind",
        "right",
        "screen",
        "shown",
        "way",
        "display",
        "one",
        "object",
        "visible",
        "time",
        "object",
        "ever",
        "shown",
        "cross",
        "gap",
        "two",
        "screen",
        "adult",
        "seeing",
        "display",
        "infer",
        "object",
        "involved",
        "find",
        "baby",
        "make",
        "inference",
        "screen",
        "removed",
        "infant",
        "shown",
        "either",
        "one",
        "object",
        "two",
        "object",
        "result",
        "infant",
        "look",
        "longer",
        "oneobject",
        "display",
        "presumably",
        "expecting",
        "like",
        "adult",
        "two",
        "object",
        "otherwise",
        "object",
        "would",
        "visible",
        "crossing",
        "gap",
        "followup",
        "study",
        "continuous",
        "motion",
        "condition",
        "used",
        "condition",
        "identical",
        "previous",
        "condition",
        "except",
        "alternating",
        "trial",
        "object",
        "seen",
        "crossing",
        "gap",
        "condition",
        "baby",
        "looked",
        "longer",
        "display",
        "two",
        "object",
        "like",
        "adult",
        "presumably",
        "assumed",
        "single",
        "object",
        "moving",
        "back",
        "forth",
        "aguiar",
        "baillargeon",
        "report",
        "similar",
        "finding",
        "montholds",
        "generally",
        "months",
        "perhaps",
        "earlier",
        "infant",
        "expect",
        "object",
        "persist",
        "time",
        "move",
        "continuously",
        "part",
        "cohere",
        "solid",
        "spelke",
        "recent",
        "work",
        "rip",
        "hespos",
        "show",
        "months",
        "baby",
        "already",
        "different",
        "expectation",
        "rigid",
        "body",
        "soft",
        "object",
        "liquid",
        "animal",
        "representation",
        "object",
        "representation",
        "spatiotemporally",
        "continuous",
        "object",
        "part",
        "evolutionary",
        "endowment",
        "might",
        "expect",
        "find",
        "representation",
        "newborn",
        "specie",
        "indeed",
        "newborn",
        "chick",
        "example",
        "display",
        "striking",
        "ability",
        "represent",
        "spatiotemporally",
        "continuous",
        "object",
        "see",
        "spelke",
        "review",
        "one",
        "study",
        "newborn",
        "chick",
        "spent",
        "first",
        "day",
        "life",
        "homogeneous",
        "environment",
        "containing",
        "one",
        "inanimate",
        "object",
        "second",
        "day",
        "object",
        "moved",
        "fully",
        "view",
        "behind",
        "one",
        "two",
        "screen",
        "though",
        "never",
        "seen",
        "object",
        "hidden",
        "behind",
        "another",
        "reliably",
        "searched",
        "behind",
        "correct",
        "screen",
        "object",
        "hidden",
        "indeed",
        "even",
        "turn",
        "away",
        "object",
        "order",
        "reach",
        "regolin",
        "et",
        "al",
        "regolin",
        "et",
        "al",
        "chick",
        "seems",
        "object",
        "permanence",
        "birth",
        "although",
        "show",
        "object",
        "permanence",
        "innate",
        "human",
        "show",
        "least",
        "one",
        "animal",
        "evolution",
        "succeeded",
        "building",
        "nativist",
        "claim",
        "existence",
        "proof",
        "innately",
        "endowed",
        "representation",
        "object",
        "permanent",
        "baby",
        "representation",
        "object",
        "support",
        "addition",
        "subtraction",
        "wynn",
        "showed",
        "young",
        "baby",
        "represent",
        "object",
        "persisting",
        "time",
        "space",
        "also",
        "subject",
        "addition",
        "subtraction",
        "study",
        "baby",
        "habituated",
        "display",
        "single",
        "object",
        "stage",
        "screen",
        "came",
        "hid",
        "object",
        "completely",
        "hand",
        "seen",
        "bring",
        "another",
        "identical",
        "object",
        "move",
        "behind",
        "screen",
        "hand",
        "withdrew",
        "empty",
        "question",
        "baby",
        "represent",
        "object",
        "behind",
        "screen",
        "test",
        "display",
        "consisted",
        "object",
        "object",
        "object",
        "line",
        "nativist",
        "claim",
        "baby",
        "showed",
        "longer",
        "looking",
        "time",
        "display",
        "except",
        "object",
        "display",
        "respect",
        "baby",
        "showed",
        "expectation",
        "adult",
        "testing",
        "showed",
        "baby",
        "capable",
        "adding",
        "number",
        "hidden",
        "object",
        "least",
        "also",
        "capable",
        "subtraction",
        "number",
        "hidden",
        "object",
        "well",
        "finding",
        "replicated",
        "montholds",
        "well",
        "simon",
        "et",
        "al",
        "koechlin",
        "et",
        "al",
        "may",
        "tempting",
        "see",
        "infant",
        "ability",
        "add",
        "subtract",
        "number",
        "object",
        "display",
        "evidence",
        "infant",
        "already",
        "something",
        "close",
        "adult",
        "concept",
        "number",
        "series",
        "study",
        "suggests",
        "case",
        "telling",
        "extremely",
        "limited",
        "set",
        "size",
        "object",
        "baby",
        "add",
        "subtract",
        "illustrate",
        "set",
        "size",
        "limit",
        "emerged",
        "variety",
        "experiment",
        "consider",
        "following",
        "study",
        "used",
        "crawling",
        "rather",
        "violationofexpectancy",
        "indicator",
        "baby",
        "representation",
        "feigenson",
        "carey",
        "study",
        "baby",
        "watched",
        "graham",
        "cracker",
        "placed",
        "one",
        "time",
        "separate",
        "box",
        "baby",
        "allowed",
        "crawl",
        "box",
        "choice",
        "retrieve",
        "cracker",
        "one",
        "box",
        "cracker",
        "box",
        "baby",
        "crawled",
        "box",
        "similarly",
        "one",
        "box",
        "cracker",
        "crawled",
        "box",
        "surprising",
        "finding",
        "however",
        "baby",
        "failed",
        "versus",
        "versus",
        "even",
        "versus",
        "apparently",
        "ability",
        "represent",
        "keep",
        "track",
        "exactly",
        "object",
        "beyond",
        "baby",
        "capability",
        "given",
        "set",
        "size",
        "limit",
        "object",
        "arguable",
        "baby",
        "competence",
        "understood",
        "ability",
        "track",
        "different",
        "object",
        "working",
        "memory",
        "one",
        "might",
        "argue",
        "baby",
        "succeed",
        "adding",
        "subtracting",
        "small",
        "number",
        "object",
        "without",
        "general",
        "concept",
        "number",
        "general",
        "numerical",
        "competence",
        "return",
        "issue",
        "section",
        "intermodal",
        "representation",
        "mentioned",
        "piaget",
        "proposed",
        "sensorimotor",
        "coordination",
        "gradually",
        "lead",
        "construction",
        "object",
        "concept",
        "establishing",
        "coordination",
        "different",
        "mode",
        "perceptual",
        "experiencevision",
        "touch",
        "examplewould",
        "take",
        "time",
        "piaget",
        "proposes",
        "child",
        "month",
        "coordination",
        "constructed",
        "meltzoff",
        "moore",
        "provide",
        "counterevidence",
        "claim",
        "study",
        "show",
        "newborn",
        "infant",
        "imitate",
        "facial",
        "movement",
        "experimenter",
        "clearly",
        "revealing",
        "coordination",
        "movement",
        "along",
        "attendant",
        "feeling",
        "muscle",
        "visual",
        "perception",
        "experimenter",
        "facial",
        "movement",
        "following",
        "video",
        "link",
        "ferrari",
        "et",
        "al",
        "video",
        "s",
        "s",
        "provide",
        "evidence",
        "newborn",
        "rhesus",
        "macaque",
        "ability",
        "well",
        "insofar",
        "coordination",
        "different",
        "mode",
        "perceptual",
        "experience",
        "present",
        "birth",
        "human",
        "monkey",
        "simply",
        "could",
        "product",
        "learning"
    ]
}