{
    "main_text": "Chomsky's Case against Skinner\n1. Chomsky's Case against Skinner\n\n\nThe behaviorist psychologist B.F. Skinner was the first theorist to \npropose a fully fledged theory of language acquisition in his book, \nVerbal Behavior (Skinner 1957). His theory of learning was \nclosely related to his theory of linguistic behavior itself. He \nargued that human linguistic behavior (that is, our own utterances \nand our responses to the utterances of others) is determined by two \nfactors: (i) the current features of the environment impinging on the\nspeaker, and (ii) the speaker's history of reinforcement (i.e., the \ngiving or withholding of rewards and/or punishments in response to \nprevious linguistic behaviors). Eschewing talk of the mental as \nunscientific, Skinner argued that ‘knowing’ a language is\nreally just a matter of having a certain set of behavioral \ndispositions: dispositions to say (and do) appropriate things in \nresponse to the world and the utterances of others. Thus, knowing \nEnglish is, in small part, a matter of being disposed to utter \n“Please close the door!” when one is cold as a result of \na draught from an open door, and of being disposed (other things \nbeing equal) to utter “OK” and go shut a door in response\nto someone else's utterance of that formula.\n\n\nGiven his view that knowing a language is just a matter of having a \ncertain set of behavioral dispositions, Skinner believed that \nlearning a language just amounts to acquiring that set of \ndispositions. He argued that this occurs through a process that he \ncalled operant conditioning. (‘Operants’ are \nbehaviors that have no discernible law-like relation to particular \nenvironmental conditions or ‘eliciting stimuli.’ They are\nto be contrasted with ‘respondents,’ which are reliable \nor reflex responses to particular stimuli. Thus, blinking when \nsomeone pokes at your eye is a respondent; episodes of infant \nbabbling are operants.) Skinner held that most human verbal behaviors\nare operants: they start off unconnected with any particular stimuli.\nHowever, they can acquire connections to stimuli (or other behaviors)\nas a result of conditioning. In conditioning, the behavior in \nquestion is made more (or in some paradigms less) likely to occur in \nresponse to a given environmental cue by the imposition of an \nappropriate ‘schedule of reinforcement’: rewards or \npunishments are given or withheld as the subject's response to the \ncue varies over time.\n\n\nAccording to Skinner, language is learned when children's verbal \noperants are brought under the ‘control’ of environmental\nconditions as a result of training by their caregivers. They are \nrewarded (by, e.g., parental approval) or punished (by, say, a \nfailure of comprehension) for their various linguistic productions \nand as a result, their dispositions to verbal behavior gradually \nconverge on those of the wider language community. Likewise, Skinner \nheld, ‘understanding’ the utterances of others is a \nmatter of being trained to perform appropriate behaviors in response \nto them: one understands ‘Shut the door!’ to the extent \nthat one responds appropriately to that utterance.\n\n\nIn his famous review of Skinner's book, Chomsky (1959) effectively \ndemolishes Skinner's theories of both language mastery and language \nlearning. First, Chomsky argued, mastery of a language is not merely \na matter of having one's verbal behaviors ‘controlled’ by\nvarious elements of the environment, including others' utterances. \nFor language use is (i) stimulus independent and (ii) historically \nunbound. Language use is stimulus independent: virtually any\nwords can be spoken in response to any environmental stimulus, \ndepending on one's state of mind. Language use is also \nhistorically unbound: what we say is not determined by our \nhistory of reinforcement, as is clear from the fact that we can and \ndo say things that we have not been trained to say.\n\n\nThe same points apply to comprehension. We can understand sentences \nwe have never heard before, even when they are spoken in odd or \nunexpected situations. And how we react to the utterances of others \nis again dependent largely on our state of mind at the time, rather \nthan any past history of training. There are linguistic conventions \nin abundance, to be sure, but as Chomsky rightly pointed out, human \n‘verbal behavior’ is quite disanalogous to a pigeon's \ndisk-pecking or a rat's maze-running.. Mastery of language is not a \nmatter of having a bunch of mere behavioral dispositions. Instead, it\ninvolves a wealth of pragmatic, semantic and syntactic knowledge. \nWhat we say in a given circumstance, and how we respond to what \nothers say, is the result of a complex interaction between our \nhistory, our beliefs about our current situation, our desires, \nand our knowledge of how our language works. Skinner's first\nbig mistake, then, was in failing to recognize that language mastery \ninvolves knowledge (or, as Chomsky later called it \n‘cognizance’) of linguistic rules and conventions.\n\n\nHis second big mistake was related to this one: he failed to \nrecognize that acquiring mastery of a language is not a matter of \nbeing trained what to say. It's simply false, says Chomsky, that \n“a careful arrangement of contingencies of reinforcement by the\nverbal community is a necessary condition of language \nlearning.” (1959:39) First, children learning language do not \nappear to be being ‘conditioned’ at all! Explicit \ntraining (such as a dog receives when learning to bark on command) is\nsimply not a feature of language acquisition. It's only comparatively\nrarely that parents correct (or explicitly reward) their children's \nlinguistic sorties; children learn much of what they know about \nlanguage from watching TV or passively listening to adults; immigrant\nchildren learn a second language to native speaker fluency in the \nschool playground; and even very young children are capable of \nlinguistic innovation, saying things undreamt of by their parents. As\nChomsky concludes: “It is simply not true that children can \nlearn language only through ‘meticulous care’ on the part\nof adults who shape their verbal repertoire through careful \ndifferential reinforcement.” (1959:42)\n\n\nSecondly, Chomsky argued — and here we see his first invocation\nof the famous ‘poverty of the stimulus’ argument, to be \ndiscussed in more detail in §2.2 below — it is unclear \nthat conditioning could even in principle give rise to a set\nof dispositions rich enough to generate the full range of a person's \nlinguistic behavior. In order, for example, to acquire the \nappropriate set of dispositions concerning the word car, one\nwould have to be trained on vast numbers of sentences containing that\nword: one would have to hear car in object position and \ncar in subject position; car modified by adjectives\nand car unmodified; car embedded in opaque contexts\n(e.g. in propositional attitude ascriptions) and car used \ntransparently; and so on. But the ‘primary linguistic \ndata,’ usually referred to as the ‘pld’ \nand comprising the set of sentences to which a child is exposed \nduring language learning (plus any analysis performed by the child on\nthose sentences; see below), simply cannot be assumed to contain \nenough of these ‘minimally differing sentences’ to fully \ndetermine a person's dispositions with respect to that word. Instead,\nChomsky argued, what determines one's dispositions to use \ncar is one's knowledge of that word's syntactic and semantic\nproperties (e.g., car is a noun referring to cars), together\nwith one's knowledge of how elements with those properties function \nin the language as a whole. So even if language mastery were (in \npart) a matter of having dispositions concerning car, the \nmechanism of conditioning would be unable to give rise to them. The \ntraining set to which children have access is simply too limited: it \ndoesn't contain enough of the right sorts of exemplars.\n\n\nIn sum: Skinner was mistaken on all counts. Language mastery is not \nmerely a matter of having a set of bare behavioral dispositions. \nInstead, it involves intricate and detailed knowledge of the \nproperties of one's language. And language learning is not a matter \nof being trained what to say. Instead, children learn language just \nfrom hearing it spoken around them, and they learn it effortlessly, \nrapidly, and without much in the way of overt instruction.\n\n\nThese insights were to drive linguistic theorizing for the next fifty\nyears, and it's worth emphasizing just how radical and exciting they \nwere at the time. First, the idea that explaining language use \ninvolves attributing knowledge to speakers flouted the \nprevailing behaviorist view that talking about mental states was \nunscientific because mental states are unobservable. It also raised \nseveral pressing empirical question that linguists are still \ndebating. For example, what is the content of speakers' \nknowledge of \n language?[3]\n What sorts of facts about language are represented in speakers' \nheads? And how does this knowledge actually function in the \npsychological processes of language production and comprehension: \nwhat are the mechanisms of language use?\n\n\nSecondly, the idea that children learn language essentially on their \nown was a radical challenge to the prevailing behaviorist idea that \nall learning involves reinforcement. In addition, it made clear our \nneed for a more ‘cognitive’ or ‘mentalistic’ \nconception of how language learning occurs, and vividly raised the \nquestion — our focus in this article — of what might be \nthe preconditions for that process. As we will see in the \nnext section, Chomsky was ready with a theory addressing each of \nthese points.\n",
    "section_title": "1. Chomsky's Case against Skinner",
    "entry_title": "Innateness and Language",
    "hierarchy_title": "Innateness and Language || Chomsky's Case against Skinner",
    "tokenized_text": [
        "chomsky",
        "s",
        "case",
        "skinner",
        "chomsky",
        "s",
        "case",
        "skinner",
        "behaviorist",
        "psychologist",
        "bf",
        "skinner",
        "first",
        "theorist",
        "propose",
        "fully",
        "fledged",
        "theory",
        "language",
        "acquisition",
        "book",
        "verbal",
        "behavior",
        "skinner",
        "theory",
        "learning",
        "closely",
        "related",
        "theory",
        "linguistic",
        "behavior",
        "argued",
        "human",
        "linguistic",
        "behavior",
        "utterance",
        "response",
        "utterance",
        "others",
        "determined",
        "two",
        "factor",
        "current",
        "feature",
        "environment",
        "impinging",
        "speaker",
        "ii",
        "speaker",
        "s",
        "history",
        "reinforcement",
        "ie",
        "giving",
        "withholding",
        "reward",
        "andor",
        "punishment",
        "response",
        "previous",
        "linguistic",
        "behavior",
        "eschewing",
        "talk",
        "mental",
        "unscientific",
        "skinner",
        "argued",
        "knowing",
        "language",
        "really",
        "matter",
        "certain",
        "set",
        "behavioral",
        "disposition",
        "disposition",
        "say",
        "appropriate",
        "thing",
        "response",
        "world",
        "utterance",
        "others",
        "thus",
        "knowing",
        "english",
        "small",
        "part",
        "matter",
        "disposed",
        "utter",
        "please",
        "close",
        "door",
        "one",
        "cold",
        "result",
        "draught",
        "open",
        "door",
        "disposed",
        "thing",
        "equal",
        "utter",
        "ok",
        "go",
        "shut",
        "door",
        "response",
        "someone",
        "else",
        "s",
        "utterance",
        "formula",
        "given",
        "view",
        "knowing",
        "language",
        "matter",
        "certain",
        "set",
        "behavioral",
        "disposition",
        "skinner",
        "believed",
        "learning",
        "language",
        "amount",
        "acquiring",
        "set",
        "disposition",
        "argued",
        "occurs",
        "process",
        "called",
        "operant",
        "conditioning",
        "operants",
        "behavior",
        "discernible",
        "lawlike",
        "relation",
        "particular",
        "environmental",
        "condition",
        "eliciting",
        "stimuli",
        "contrasted",
        "respondent",
        "reliable",
        "reflex",
        "response",
        "particular",
        "stimulus",
        "thus",
        "blinking",
        "someone",
        "poke",
        "eye",
        "respondent",
        "episode",
        "infant",
        "babbling",
        "operants",
        "skinner",
        "held",
        "human",
        "verbal",
        "behavior",
        "operants",
        "start",
        "unconnected",
        "particular",
        "stimulus",
        "however",
        "acquire",
        "connection",
        "stimulus",
        "behavior",
        "result",
        "conditioning",
        "conditioning",
        "behavior",
        "question",
        "made",
        "paradigm",
        "le",
        "likely",
        "occur",
        "response",
        "given",
        "environmental",
        "cue",
        "imposition",
        "appropriate",
        "schedule",
        "reinforcement",
        "reward",
        "punishment",
        "given",
        "withheld",
        "subject",
        "s",
        "response",
        "cue",
        "varies",
        "time",
        "according",
        "skinner",
        "language",
        "learned",
        "child",
        "s",
        "verbal",
        "operants",
        "brought",
        "control",
        "environmental",
        "condition",
        "result",
        "training",
        "caregiver",
        "rewarded",
        "eg",
        "parental",
        "approval",
        "punished",
        "say",
        "failure",
        "comprehension",
        "various",
        "linguistic",
        "production",
        "result",
        "disposition",
        "verbal",
        "behavior",
        "gradually",
        "converge",
        "wider",
        "language",
        "community",
        "likewise",
        "skinner",
        "held",
        "understanding",
        "utterance",
        "others",
        "matter",
        "trained",
        "perform",
        "appropriate",
        "behavior",
        "response",
        "one",
        "understands",
        "shut",
        "door",
        "extent",
        "one",
        "responds",
        "appropriately",
        "utterance",
        "famous",
        "review",
        "skinner",
        "s",
        "book",
        "chomsky",
        "effectively",
        "demolishes",
        "skinner",
        "s",
        "theory",
        "language",
        "mastery",
        "language",
        "learning",
        "first",
        "chomsky",
        "argued",
        "mastery",
        "language",
        "merely",
        "matter",
        "one",
        "s",
        "verbal",
        "behavior",
        "controlled",
        "various",
        "element",
        "environment",
        "including",
        "others",
        "utterance",
        "language",
        "use",
        "stimulus",
        "independent",
        "ii",
        "historically",
        "unbound",
        "language",
        "use",
        "stimulus",
        "independent",
        "virtually",
        "word",
        "spoken",
        "response",
        "environmental",
        "stimulus",
        "depending",
        "one",
        "s",
        "state",
        "mind",
        "language",
        "use",
        "also",
        "historically",
        "unbound",
        "say",
        "determined",
        "history",
        "reinforcement",
        "clear",
        "fact",
        "say",
        "thing",
        "trained",
        "say",
        "point",
        "apply",
        "comprehension",
        "understand",
        "sentence",
        "never",
        "heard",
        "even",
        "spoken",
        "odd",
        "unexpected",
        "situation",
        "react",
        "utterance",
        "others",
        "dependent",
        "largely",
        "state",
        "mind",
        "time",
        "rather",
        "past",
        "history",
        "training",
        "linguistic",
        "convention",
        "abundance",
        "sure",
        "chomsky",
        "rightly",
        "pointed",
        "human",
        "verbal",
        "behavior",
        "quite",
        "disanalogous",
        "pigeon",
        "s",
        "diskpecking",
        "rat",
        "s",
        "mazerunning",
        "mastery",
        "language",
        "matter",
        "bunch",
        "mere",
        "behavioral",
        "disposition",
        "instead",
        "involves",
        "wealth",
        "pragmatic",
        "semantic",
        "syntactic",
        "knowledge",
        "say",
        "given",
        "circumstance",
        "respond",
        "others",
        "say",
        "result",
        "complex",
        "interaction",
        "history",
        "belief",
        "current",
        "situation",
        "desire",
        "knowledge",
        "language",
        "work",
        "skinner",
        "s",
        "first",
        "big",
        "mistake",
        "failing",
        "recognize",
        "language",
        "mastery",
        "involves",
        "knowledge",
        "chomsky",
        "later",
        "called",
        "cognizance",
        "linguistic",
        "rule",
        "convention",
        "second",
        "big",
        "mistake",
        "related",
        "one",
        "failed",
        "recognize",
        "acquiring",
        "mastery",
        "language",
        "matter",
        "trained",
        "say",
        "s",
        "simply",
        "false",
        "say",
        "chomsky",
        "careful",
        "arrangement",
        "contingency",
        "reinforcement",
        "verbal",
        "community",
        "necessary",
        "condition",
        "language",
        "learning",
        "first",
        "child",
        "learning",
        "language",
        "appear",
        "conditioned",
        "explicit",
        "training",
        "dog",
        "receives",
        "learning",
        "bark",
        "command",
        "simply",
        "feature",
        "language",
        "acquisition",
        "s",
        "comparatively",
        "rarely",
        "parent",
        "correct",
        "explicitly",
        "reward",
        "child",
        "s",
        "linguistic",
        "sortie",
        "child",
        "learn",
        "much",
        "know",
        "language",
        "watching",
        "tv",
        "passively",
        "listening",
        "adult",
        "immigrant",
        "child",
        "learn",
        "second",
        "language",
        "native",
        "speaker",
        "fluency",
        "school",
        "playground",
        "even",
        "young",
        "child",
        "capable",
        "linguistic",
        "innovation",
        "saying",
        "thing",
        "undreamt",
        "parent",
        "chomsky",
        "concludes",
        "simply",
        "true",
        "child",
        "learn",
        "language",
        "meticulous",
        "care",
        "part",
        "adult",
        "shape",
        "verbal",
        "repertoire",
        "careful",
        "differential",
        "reinforcement",
        "secondly",
        "chomsky",
        "argued",
        "see",
        "first",
        "invocation",
        "famous",
        "poverty",
        "stimulus",
        "argument",
        "discussed",
        "detail",
        "unclear",
        "conditioning",
        "could",
        "even",
        "principle",
        "give",
        "rise",
        "set",
        "disposition",
        "rich",
        "enough",
        "generate",
        "full",
        "range",
        "person",
        "s",
        "linguistic",
        "behavior",
        "order",
        "example",
        "acquire",
        "appropriate",
        "set",
        "disposition",
        "concerning",
        "word",
        "car",
        "one",
        "would",
        "trained",
        "vast",
        "number",
        "sentence",
        "containing",
        "word",
        "one",
        "would",
        "hear",
        "car",
        "object",
        "position",
        "car",
        "subject",
        "position",
        "car",
        "modified",
        "adjective",
        "car",
        "unmodified",
        "car",
        "embedded",
        "opaque",
        "context",
        "eg",
        "propositional",
        "attitude",
        "ascription",
        "car",
        "used",
        "transparently",
        "primary",
        "linguistic",
        "data",
        "usually",
        "referred",
        "pld",
        "comprising",
        "set",
        "sentence",
        "child",
        "exposed",
        "language",
        "learning",
        "plus",
        "analysis",
        "performed",
        "child",
        "sentence",
        "see",
        "simply",
        "assumed",
        "contain",
        "enough",
        "minimally",
        "differing",
        "sentence",
        "fully",
        "determine",
        "person",
        "s",
        "disposition",
        "respect",
        "word",
        "instead",
        "chomsky",
        "argued",
        "determines",
        "one",
        "s",
        "disposition",
        "use",
        "car",
        "one",
        "s",
        "knowledge",
        "word",
        "s",
        "syntactic",
        "semantic",
        "property",
        "eg",
        "car",
        "noun",
        "referring",
        "car",
        "together",
        "one",
        "s",
        "knowledge",
        "element",
        "property",
        "function",
        "language",
        "whole",
        "even",
        "language",
        "mastery",
        "part",
        "matter",
        "disposition",
        "concerning",
        "car",
        "mechanism",
        "conditioning",
        "would",
        "unable",
        "give",
        "rise",
        "training",
        "set",
        "child",
        "access",
        "simply",
        "limited",
        "nt",
        "contain",
        "enough",
        "right",
        "sort",
        "exemplar",
        "sum",
        "skinner",
        "mistaken",
        "count",
        "language",
        "mastery",
        "merely",
        "matter",
        "set",
        "bare",
        "behavioral",
        "disposition",
        "instead",
        "involves",
        "intricate",
        "detailed",
        "knowledge",
        "property",
        "one",
        "s",
        "language",
        "language",
        "learning",
        "matter",
        "trained",
        "say",
        "instead",
        "child",
        "learn",
        "language",
        "hearing",
        "spoken",
        "around",
        "learn",
        "effortlessly",
        "rapidly",
        "without",
        "much",
        "way",
        "overt",
        "instruction",
        "insight",
        "drive",
        "linguistic",
        "theorizing",
        "next",
        "fifty",
        "year",
        "s",
        "worth",
        "emphasizing",
        "radical",
        "exciting",
        "time",
        "first",
        "idea",
        "explaining",
        "language",
        "use",
        "involves",
        "attributing",
        "knowledge",
        "speaker",
        "flouted",
        "prevailing",
        "behaviorist",
        "view",
        "talking",
        "mental",
        "state",
        "unscientific",
        "mental",
        "state",
        "unobservable",
        "also",
        "raised",
        "several",
        "pressing",
        "empirical",
        "question",
        "linguist",
        "still",
        "debating",
        "example",
        "content",
        "speaker",
        "knowledge",
        "language",
        "sort",
        "fact",
        "language",
        "represented",
        "speaker",
        "head",
        "knowledge",
        "actually",
        "function",
        "psychological",
        "process",
        "language",
        "production",
        "comprehension",
        "mechanism",
        "language",
        "use",
        "secondly",
        "idea",
        "child",
        "learn",
        "language",
        "essentially",
        "radical",
        "challenge",
        "prevailing",
        "behaviorist",
        "idea",
        "learning",
        "involves",
        "reinforcement",
        "addition",
        "made",
        "clear",
        "need",
        "cognitive",
        "mentalistic",
        "conception",
        "language",
        "learning",
        "occurs",
        "vividly",
        "raised",
        "question",
        "focus",
        "article",
        "might",
        "precondition",
        "process",
        "see",
        "next",
        "section",
        "chomsky",
        "ready",
        "theory",
        "addressing",
        "point"
    ]
}