{
    "main_text": "The Chomskyan Revolution in Linguistics || The Nativist Turn\n1.1 The Nativist Turn\n1.1.1 Behaviorism and Nativism\n\n\nThe reigning experimental paradigms in mid-20th century\nAmerican psychology were for the most part variants of\nBehaviorism. B.F. Skinner’s behaviorist account of language\nacquisition and use (Skinner 1957) in many ways marks the end of this\ndominance—or at least the beginning of the end—because it\nwas the target of a very influential attack by Chomsky (1959). This\nattack convinced many of the inherent limits of behaviorist theorizing\n(see Cowie 2010 for details).\n\n\nThe defining feature of Behaviorism is its\nanti-mentalism—the methodological claim that one can\n(must) provide a psychological account of human beings without\nreferencing internal mental states. Chomsky’s attack on\nSkinner zeroes in on this\n anti-mentalism.[2]\nThe connection between Behaviorism and\nNativism, on the other hand, is typically given less\nprominence. Although Behaviorism is closely tied to Empiricist\nassociationism and is therefore ‘officially’ anti-Nativist,\ntheories like Skinner’s do incorporate significant Nativist\nelements. Specifically, Skinner took it for granted that every\nanimal has a range of naturally emitted behaviors. Some of these\nbehaviors are responses to stimuli (Skinner’s\nrespondents—e.g., the baby’s suckling response),\nwhile others are just emitted (Skinner’s\noperants—e.g., the baby’s babbling). These\nbehaviors are the raw materials that can be shaped by\nexperience—Skinner’s conditioning and the law\nof effect. So the notion of an innate behavioral repertoire,\nand of innately specified links between environmental stimuli and\nelements of that repertoire, are very much part of the Behaviorist\npicture. This innate repertoire was, as any good Darwinian would\nexpect, highly information rich, because it was shaped by the history\nof problem solving by the animal’s forebears. All parties\ntake it for granted that babies babble, and suckle in the presence of\nthe right stimuli, because such behaviors are part of their biological\nheritage. There might be disagreements about the underlying mechanisms\nand epistemological standing of that heritage, but it is hard to deny\nthat humans are in some sense pre-informed that they need to\nsuck to get milk from the breast. This is a ‘factory\nsettings’ for babies. So if we set aside the controversy\nover the subject matter of psychology (behavior or the\ninternal mind?), and the controversy over the right explanatory\nconstructs (schedules of reinforcement or cognitive\nprocesses?), we find that Behaviorism is actually\ncommitted to innateness claims, and doctrinally\nopposed to any kind of ‘blank-slate-ism’.\nBut this isn’t how things actually played out. Behaviorism\nwas for the most part truer to its affiliations with philosophical\nEmpiricism and Associationism, and its Nativist commitments were\nobscured. One important lesson is that in the Nativism-Empiricism\ndebate we are often dealing with ideology, not theory (Pinker\n2002).\n1.1.2 The Chomskyan paradigm\n\n\nThe impact of Chomsky on linguistics and cognitive science has been\nmuch discussed. Here we briefly review some of the elements\ncritical to the resurgence of\n Nativism.[3]\nChomsky focused attention on two facts about\nhuman languages: (1) that they are very complex, and (2) that children\ncome to master them without much systematic training. The second\nfact is fairly obvious, but the first is not. A very important\nstep, as far as Nativism is concerned, was Chomsky’s notion of a\ngenerative grammar as a framework for articulating the\ncomplexity of a language. A generative grammar of a particular\nlanguage is a system of rules that generates all (and only) the\nsentences of that language, along with a characterization of how each\nsentence sounds and what it means. Chomskyan linguistics is the\nproject of discovering the elements and structure of such rule\nsystems.\n\n\nThe link between linguistics and innateness comes in a second\nimportant move: the psychologization of grammars. Chomsky argued\nthat every speaker of a language has a mental representation of its\ngrammar. This sets up a natural question—how did the\ngrammar get into the speaker’s head?—and two\ntraditional answers immediately present themselves. The\nEmpiricist would aim to show that the grammar (if it indeed is\nin the head) could be learned from experience in much the way one\nlearns other facts about the world. The Nativist, in contrast, is ready to\nconsider that learning a language—now reconceived as a matter of\ngrammar acquisition—depends in some way on a language-specific\ninnate endowment. This brings us to the third important\nstep. Chomsky argued that a comparison of (i) the grammar that\nhas to be acquired, and (ii) the idiosyncrasies of the acquisition\nprocess and the data presented to the language-learner, favors the\nNativist approach.\n\n\nSo Chomsky did more than simply point to language learning as an\narea in which the Nativist case might be\n built.[4]\nHis framework for\nspecifying the grammatical rules that the child has to master\nsharpened the debate between Empiricism and Nativism in something like\nthe way that the mathematicization of physics in the 17th\ncentury revolutionized the empirical sciences.\n\n\nPart of this sharpening is the result of Chomsky’s important\nmethodological distinction between competence and\nperformance. Chomsky argued that a scientific approach\nto language needed to focus on the specific mental representations that\nunderlie linguistic behavior (‘linguistic\ncompetence’), and not on the behavior itself\n(‘linguistic performance’). Linguistic\nperformance, he argued, is scientifically intractable, because it is\nthe result of too many idiosyncratic interacting factors. We\nwould do better to take on the much more circumscribed question: what\nis the system of rules (the grammar) that generates all the allowable\nsentences? It soon became clear that even if we set aside the\nperformance systems involved in real linguistic behavior, the rules of\nthe grammar were themselves very complicated, often unintuitive, and\nabstract, in that they involved categories and constructs that\nwere at a significant remove from the data. The idea that children\ncould simply ‘pick up’ these rules by attending to what is\nassociated with what in their language environment was just not\nplausible (but we will see in section 3 that this claim continues to be challenged). Yet every normal child does in fact learn a language,\nand so does somehow master these rules. So either the general\nlearning system that the child wields is somehow more powerful than the\nAssociationist-Empiricist had assumed, or the Nativist is right and\nthere is some innate language-specific information that ‘greases\nthe wheels’ of language acquisition. To resist the Nativist\nconclusion, the Empiricist has to return to the drawing board to\ndevelop a more powerful general learning theory. Chomsky\ndeveloped the Nativist position and termed the innate information\n‘universal grammar’ or ‘linguistic\ntheory’. This is the essence of Chomsky’s famous\nPoverty of the Stimulus argument, which in an important way\nprovided a measure of the challenge that Empiricism faces.\nThe Empiricist-Nativist debate was no longer\n‘you-say-experience-I-say-innate’ affair; it looked to many\nto be a matter of ‘put up or shut up’, and the burden was\non the Empiricist to do the putting up.\n\n\nThere was significant controversy about all the elements of this\nparadigm shift: philosophical tangles about the notion of\nrepresentation (in what sense is the grammar ‘in the\nhead’?), technical linguistic debates about the structure and\ncharacter of grammars for specific languages and about the nature of\nuniversal grammar, controversies in psychology about the relevance of\nChomskyan formalisms to experimental studies of child learners and\nadult speakers of a language, and on and on. But the shift\nheld. Linguistics went from a backwater to a central player (as a\nmodel and as an integrator) in the development of cognitive science as\na multi-disciplinary approach to aspects of cognition and mind.\nDevelopmental psycholinguistics, a field more or less born out of these\nupheavals, set out to investigate experimentally whether the details\nabout language acquisition actually supported the Chomskyan Nativist\nhypotheses, and in time, many developmental psychologists broke from\nthe reigning Empiricist paradigm and began to deploy Poverty of the\nStimulus arguments in other areas of cognitive development.\n1.1.3 Nativism as natural science\n\n\nBefore Chomsky, Nativism suffered from two disabilities. The\nolder charge, which we alluded to briefly at the start, was that the\ndoctrine was in some way incompatible with a naturalistic or scientific\napproach to the world. It is true that the Nativist view, as\ndefended by many early modern Rationalists including Descartes\n(1996/1641 and 1911/1647) and Leibniz (1981/1764), did contain (what we\nnow regard as) a supernaturalist element: what was innate was\npresumed to have been placed in us by God. But beside this taint\nof anti-naturalism, there seemed to be another problem, highlighted by\nLocke: simplicity. Locke (1979/1690) argued that, all things being\nequal, we ought to prefer the simpler Empiricist doctrine, which posits\nonly sense experience and general associationist learning, to the\nNativist view, which adds inborn materials. It is this\npresumption in favor of Empiricism that was inherited by modern\nversions of Associationist psychology; it was taken for granted that if\nthere were equally good Empiricist and Nativist accounts, the\nEmpiricist account would be methodologically preferable on the grounds\nof simplicity.\n\n\nIn light of all this, it is important to recognize that\nChomsky’s advances undercut both these supposed shortcomings of\nNativism. On the first point, Chomsky repeatedly stressed that\nclaims about internalized grammars and universal grammar were\nunexceptional empirical hypotheses about the internal causes\nof the observational evidence. The question of what is built in\nand what needs to be learned is a straightforward scientific\nquestion. It goes without saying that there is no hint of the\nsupernatural in Chomsky’s linguistics: we have the innate\nstructures we do because we are evolved biological organisms.\n\n\nThis Nativist connection to evolution raises a natural question: why\ndid the resurgence of Nativism have to wait for Chomskyan linguistics;\nwhy didn’t the theory of evolution, developed more than a\nhalf-century earlier, undermine Empiricism and resurrect\nNativism? The Empiricist paradigm, after all, has always promoted\nitself in terms of its very austere view of human knowers: we perceive\nthe world, and learn all we know on the basis of our perceptual\nexperience of it. But as we noted earlier, the Darwinian\nRevolution made it plain that as a general rule, evolutionary\nforces shape organisms to fit into their niche. Such\nshaping, at least in the animal kingdom, was obviously a matter of\npre-organizing the animal’s behavior-producing\nmachinery—the processing that goes on in its brain—so that,\nfor example, birds know that they should eat worms and build nests out\nof twigs and not vice versa. No one tries to explain the\nbird’s competences (and birds’ natural competences extend\nfar beyond this trivial example) purely in terms of the bird’s\nperceptual experience. Birds are not blank slates at birth.\nBut we humans grow from the same evolutionary branches as the animals\naround us. This line of thought leaves us with a few\npossibilities. One is that all the innate preparedness\npainstakingly established in our evolutionary ancestors was somehow\ndiscarded, and we humans were redesigned—from scratch, as it\nwere—as blank slates with a uniquely powerful learning capability\nto make up for our meager initial holdings. This is, arguably,\nthe traditional Empiricist approach. Another is that we inherited\na good deal of what evolution had established in the cognitive systems\nof the organisms from which we evolved, but that our further advance\nwas, to a first approximation, based not on innate factors but on\nlearning. A third view—the Nativist position—is that\nmore was added in the course of our own evolution, and that we too are\nin some way pre-informed about at least some matters most critical for\nour survival. These possibilities are too vague to be taken as\nhypotheses, but the Nativist view seems at least as initially plausible\nas the Empiricist approach. The important point is that it\nshould have been that plausible a century ago. Somehow the\nNativist implications of evolutionary theorizing were\nalso\n obscured.[5]\nEmpiricists\nmight argue that these implications are not relevant to the Nativist\ntradition that they oppose, but the point is that the issue was hardly\nraised. One suspects that a deep cultural and intellectual bias\nwas at work.[6]\n\n\nThe upshot of this last point is that the presumed advantage of\nsimplicity that Empiricism claimed for itself was illusory. Once\nwe include in our measurement of simplicity how well a hypothesis fits\nwith other established theories, the simpler hypothesis is that human\nbeings are part of the natural biological order, and that like all\nother organisms they are to some degree pre-shaped by evolution to fit\ninto their distinctive ecological niche. The naturalistic view of\nhuman beings ushered in by Darwin should have, all by itself,\nrevived\n Nativism.[7]\nWe might go a step further and ask whether Empiricism itself missed a\ngolden opportunity to deploy evolutionary theory as a vindication\nof Empiricism. A more enterprising Empiricism might\nhave noted that evolutionary theory commits us to the idea that\nwhatever is innate in us was, at least in one sense, shaped by\nexperience. Experience here would be ancestral\nexperience, not the experience of the individual subject, but such a\nview would still ground knowledge in experience. In other words,\nthe range of ‘learning from experience’, the\nEmpiricist’s core commitment, would simply be extended to cover\nnot only individual learning but species-based learning as well.\nBut this opportunity was for the most part missed.\n",
    "section_title": "1.1 The Nativist Turn",
    "entry_title": "Innateness and Contemporary Theories of Cognition",
    "hierarchy_title": "Innateness and Contemporary Theories of Cognition || The Chomskyan Revolution in Linguistics || The Nativist Turn",
    "tokenized_text": [
        "chomskyan",
        "revolution",
        "linguistics",
        "nativist",
        "turn",
        "nativist",
        "turn",
        "behaviorism",
        "nativism",
        "reigning",
        "experimental",
        "paradigm",
        "midth",
        "century",
        "american",
        "psychology",
        "part",
        "variant",
        "behaviorism",
        "bf",
        "skinner",
        "behaviorist",
        "account",
        "language",
        "acquisition",
        "use",
        "skinner",
        "many",
        "way",
        "mark",
        "end",
        "dominanceor",
        "least",
        "beginning",
        "endbecause",
        "target",
        "influential",
        "attack",
        "chomsky",
        "attack",
        "convinced",
        "many",
        "inherent",
        "limit",
        "behaviorist",
        "theorizing",
        "see",
        "cowie",
        "detail",
        "defining",
        "feature",
        "behaviorism",
        "antimentalismthe",
        "methodological",
        "claim",
        "one",
        "must",
        "provide",
        "psychological",
        "account",
        "human",
        "being",
        "without",
        "referencing",
        "internal",
        "mental",
        "state",
        "chomsky",
        "attack",
        "skinner",
        "zero",
        "antimentalism",
        "connection",
        "behaviorism",
        "nativism",
        "hand",
        "typically",
        "given",
        "le",
        "prominence",
        "although",
        "behaviorism",
        "closely",
        "tied",
        "empiricist",
        "associationism",
        "therefore",
        "officially",
        "antinativist",
        "theory",
        "like",
        "skinner",
        "incorporate",
        "significant",
        "nativist",
        "element",
        "specifically",
        "skinner",
        "took",
        "granted",
        "every",
        "animal",
        "range",
        "naturally",
        "emitted",
        "behavior",
        "behavior",
        "response",
        "stimulus",
        "skinner",
        "respondentseg",
        "baby",
        "suckling",
        "response",
        "others",
        "emitted",
        "skinner",
        "operantseg",
        "baby",
        "babbling",
        "behavior",
        "raw",
        "material",
        "shaped",
        "experienceskinner",
        "conditioning",
        "law",
        "effect",
        "notion",
        "innate",
        "behavioral",
        "repertoire",
        "innately",
        "specified",
        "link",
        "environmental",
        "stimulus",
        "element",
        "repertoire",
        "much",
        "part",
        "behaviorist",
        "picture",
        "innate",
        "repertoire",
        "good",
        "darwinian",
        "would",
        "expect",
        "highly",
        "information",
        "rich",
        "shaped",
        "history",
        "problem",
        "solving",
        "animal",
        "forebear",
        "party",
        "take",
        "granted",
        "baby",
        "babble",
        "suckle",
        "presence",
        "right",
        "stimulus",
        "behavior",
        "part",
        "biological",
        "heritage",
        "might",
        "disagreement",
        "underlying",
        "mechanism",
        "epistemological",
        "standing",
        "heritage",
        "hard",
        "deny",
        "human",
        "sense",
        "preinformed",
        "need",
        "suck",
        "get",
        "milk",
        "breast",
        "factory",
        "setting",
        "baby",
        "set",
        "aside",
        "controversy",
        "subject",
        "matter",
        "psychology",
        "behavior",
        "internal",
        "mind",
        "controversy",
        "right",
        "explanatory",
        "construct",
        "schedule",
        "reinforcement",
        "cognitive",
        "process",
        "find",
        "behaviorism",
        "actually",
        "committed",
        "innateness",
        "claim",
        "doctrinally",
        "opposed",
        "kind",
        "blankslateism",
        "thing",
        "actually",
        "played",
        "behaviorism",
        "part",
        "truer",
        "affiliation",
        "philosophical",
        "empiricism",
        "associationism",
        "nativist",
        "commitment",
        "obscured",
        "one",
        "important",
        "lesson",
        "nativismempiricism",
        "debate",
        "often",
        "dealing",
        "ideology",
        "theory",
        "pinker",
        "chomskyan",
        "paradigm",
        "impact",
        "chomsky",
        "linguistics",
        "cognitive",
        "science",
        "much",
        "discussed",
        "briefly",
        "review",
        "element",
        "critical",
        "resurgence",
        "nativism",
        "chomsky",
        "focused",
        "attention",
        "two",
        "fact",
        "human",
        "language",
        "complex",
        "child",
        "come",
        "master",
        "without",
        "much",
        "systematic",
        "training",
        "second",
        "fact",
        "fairly",
        "obvious",
        "first",
        "important",
        "step",
        "far",
        "nativism",
        "concerned",
        "chomsky",
        "notion",
        "generative",
        "grammar",
        "framework",
        "articulating",
        "complexity",
        "language",
        "generative",
        "grammar",
        "particular",
        "language",
        "system",
        "rule",
        "generates",
        "sentence",
        "language",
        "along",
        "characterization",
        "sentence",
        "sound",
        "mean",
        "chomskyan",
        "linguistics",
        "project",
        "discovering",
        "element",
        "structure",
        "rule",
        "system",
        "link",
        "linguistics",
        "innateness",
        "come",
        "second",
        "important",
        "move",
        "psychologization",
        "grammar",
        "chomsky",
        "argued",
        "every",
        "speaker",
        "language",
        "mental",
        "representation",
        "grammar",
        "set",
        "natural",
        "questionhow",
        "grammar",
        "get",
        "speaker",
        "head",
        "and",
        "two",
        "traditional",
        "answer",
        "immediately",
        "present",
        "empiricist",
        "would",
        "aim",
        "show",
        "grammar",
        "indeed",
        "head",
        "could",
        "learned",
        "experience",
        "much",
        "way",
        "one",
        "learns",
        "fact",
        "world",
        "nativist",
        "contrast",
        "ready",
        "consider",
        "learning",
        "languagenow",
        "reconceived",
        "matter",
        "grammar",
        "acquisitiondepends",
        "way",
        "languagespecific",
        "innate",
        "endowment",
        "brings",
        "u",
        "third",
        "important",
        "step",
        "chomsky",
        "argued",
        "comparison",
        "grammar",
        "acquired",
        "ii",
        "idiosyncrasy",
        "acquisition",
        "process",
        "data",
        "presented",
        "languagelearner",
        "favor",
        "nativist",
        "approach",
        "chomsky",
        "simply",
        "point",
        "language",
        "learning",
        "area",
        "nativist",
        "case",
        "might",
        "built",
        "framework",
        "specifying",
        "grammatical",
        "rule",
        "child",
        "master",
        "sharpened",
        "debate",
        "empiricism",
        "nativism",
        "something",
        "like",
        "way",
        "mathematicization",
        "physic",
        "th",
        "century",
        "revolutionized",
        "empirical",
        "science",
        "part",
        "sharpening",
        "result",
        "chomsky",
        "important",
        "methodological",
        "distinction",
        "competence",
        "performance",
        "chomsky",
        "argued",
        "scientific",
        "approach",
        "language",
        "needed",
        "focus",
        "specific",
        "mental",
        "representation",
        "underlie",
        "linguistic",
        "behavior",
        "linguistic",
        "competence",
        "behavior",
        "linguistic",
        "performance",
        "linguistic",
        "performance",
        "argued",
        "scientifically",
        "intractable",
        "result",
        "many",
        "idiosyncratic",
        "interacting",
        "factor",
        "would",
        "better",
        "take",
        "much",
        "circumscribed",
        "question",
        "system",
        "rule",
        "grammar",
        "generates",
        "allowable",
        "sentence",
        "soon",
        "became",
        "clear",
        "even",
        "set",
        "aside",
        "performance",
        "system",
        "involved",
        "real",
        "linguistic",
        "behavior",
        "rule",
        "grammar",
        "complicated",
        "often",
        "unintuitive",
        "abstract",
        "involved",
        "category",
        "construct",
        "significant",
        "remove",
        "data",
        "idea",
        "child",
        "could",
        "simply",
        "pick",
        "rule",
        "attending",
        "associated",
        "language",
        "environment",
        "plausible",
        "see",
        "section",
        "claim",
        "continues",
        "challenged",
        "yet",
        "every",
        "normal",
        "child",
        "fact",
        "learn",
        "language",
        "somehow",
        "master",
        "rule",
        "either",
        "general",
        "learning",
        "system",
        "child",
        "wields",
        "somehow",
        "powerful",
        "associationistempiricist",
        "assumed",
        "nativist",
        "right",
        "innate",
        "languagespecific",
        "information",
        "grease",
        "wheel",
        "language",
        "acquisition",
        "resist",
        "nativist",
        "conclusion",
        "empiricist",
        "return",
        "drawing",
        "board",
        "develop",
        "powerful",
        "general",
        "learning",
        "theory",
        "chomsky",
        "developed",
        "nativist",
        "position",
        "termed",
        "innate",
        "information",
        "universal",
        "grammar",
        "linguistic",
        "theory",
        "essence",
        "chomsky",
        "famous",
        "poverty",
        "stimulus",
        "argument",
        "important",
        "way",
        "provided",
        "measure",
        "challenge",
        "empiricism",
        "face",
        "empiricistnativist",
        "debate",
        "longer",
        "yousayexperienceisayinnate",
        "affair",
        "looked",
        "many",
        "matter",
        "put",
        "shut",
        "burden",
        "empiricist",
        "putting",
        "significant",
        "controversy",
        "element",
        "paradigm",
        "shift",
        "philosophical",
        "tangle",
        "notion",
        "representation",
        "sense",
        "grammar",
        "head",
        "technical",
        "linguistic",
        "debate",
        "structure",
        "character",
        "grammar",
        "specific",
        "language",
        "nature",
        "universal",
        "grammar",
        "controversy",
        "psychology",
        "relevance",
        "chomskyan",
        "formalism",
        "experimental",
        "study",
        "child",
        "learner",
        "adult",
        "speaker",
        "language",
        "shift",
        "held",
        "linguistics",
        "went",
        "backwater",
        "central",
        "player",
        "model",
        "integrator",
        "development",
        "cognitive",
        "science",
        "multidisciplinary",
        "approach",
        "aspect",
        "cognition",
        "mind",
        "developmental",
        "psycholinguistics",
        "field",
        "le",
        "born",
        "upheaval",
        "set",
        "investigate",
        "experimentally",
        "whether",
        "detail",
        "language",
        "acquisition",
        "actually",
        "supported",
        "chomskyan",
        "nativist",
        "hypothesis",
        "time",
        "many",
        "developmental",
        "psychologist",
        "broke",
        "reigning",
        "empiricist",
        "paradigm",
        "began",
        "deploy",
        "poverty",
        "stimulus",
        "argument",
        "area",
        "cognitive",
        "development",
        "nativism",
        "natural",
        "science",
        "chomsky",
        "nativism",
        "suffered",
        "two",
        "disability",
        "older",
        "charge",
        "alluded",
        "briefly",
        "start",
        "doctrine",
        "way",
        "incompatible",
        "naturalistic",
        "scientific",
        "approach",
        "world",
        "true",
        "nativist",
        "view",
        "defended",
        "many",
        "early",
        "modern",
        "rationalist",
        "including",
        "descartes",
        "leibniz",
        "contain",
        "regard",
        "supernaturalist",
        "element",
        "innate",
        "presumed",
        "placed",
        "u",
        "god",
        "beside",
        "taint",
        "antinaturalism",
        "seemed",
        "another",
        "problem",
        "highlighted",
        "locke",
        "simplicity",
        "locke",
        "argued",
        "thing",
        "equal",
        "ought",
        "prefer",
        "simpler",
        "empiricist",
        "doctrine",
        "posit",
        "sense",
        "experience",
        "general",
        "associationist",
        "learning",
        "nativist",
        "view",
        "add",
        "inborn",
        "material",
        "presumption",
        "favor",
        "empiricism",
        "inherited",
        "modern",
        "version",
        "associationist",
        "psychology",
        "taken",
        "granted",
        "equally",
        "good",
        "empiricist",
        "nativist",
        "account",
        "empiricist",
        "account",
        "would",
        "methodologically",
        "preferable",
        "ground",
        "simplicity",
        "light",
        "important",
        "recognize",
        "chomsky",
        "advance",
        "undercut",
        "supposed",
        "shortcoming",
        "nativism",
        "first",
        "point",
        "chomsky",
        "repeatedly",
        "stressed",
        "claim",
        "internalized",
        "grammar",
        "universal",
        "grammar",
        "unexceptional",
        "empirical",
        "hypothesis",
        "internal",
        "cause",
        "observational",
        "evidence",
        "question",
        "built",
        "need",
        "learned",
        "straightforward",
        "scientific",
        "question",
        "go",
        "without",
        "saying",
        "hint",
        "supernatural",
        "chomsky",
        "linguistics",
        "innate",
        "structure",
        "evolved",
        "biological",
        "organism",
        "nativist",
        "connection",
        "evolution",
        "raise",
        "natural",
        "question",
        "resurgence",
        "nativism",
        "wait",
        "chomskyan",
        "linguistics",
        "theory",
        "evolution",
        "developed",
        "halfcentury",
        "earlier",
        "undermine",
        "empiricism",
        "resurrect",
        "nativism",
        "empiricist",
        "paradigm",
        "always",
        "promoted",
        "term",
        "austere",
        "view",
        "human",
        "knower",
        "perceive",
        "world",
        "learn",
        "know",
        "basis",
        "perceptual",
        "experience",
        "noted",
        "earlier",
        "darwinian",
        "revolution",
        "made",
        "plain",
        "general",
        "rule",
        "evolutionary",
        "force",
        "shape",
        "organism",
        "fit",
        "niche",
        "shaping",
        "least",
        "animal",
        "kingdom",
        "obviously",
        "matter",
        "preorganizing",
        "animal",
        "behaviorproducing",
        "machinerythe",
        "processing",
        "go",
        "brainso",
        "example",
        "bird",
        "know",
        "eat",
        "worm",
        "build",
        "nest",
        "twig",
        "vice",
        "versa",
        "one",
        "try",
        "explain",
        "bird",
        "competence",
        "bird",
        "natural",
        "competence",
        "extend",
        "far",
        "beyond",
        "trivial",
        "example",
        "purely",
        "term",
        "bird",
        "perceptual",
        "experience",
        "bird",
        "blank",
        "slate",
        "birth",
        "human",
        "grow",
        "evolutionary",
        "branch",
        "animal",
        "around",
        "u",
        "line",
        "thought",
        "leaf",
        "u",
        "possibility",
        "one",
        "innate",
        "preparedness",
        "painstakingly",
        "established",
        "evolutionary",
        "ancestor",
        "somehow",
        "discarded",
        "human",
        "redesignedfrom",
        "scratch",
        "wereas",
        "blank",
        "slate",
        "uniquely",
        "powerful",
        "learning",
        "capability",
        "make",
        "meager",
        "initial",
        "holding",
        "arguably",
        "traditional",
        "empiricist",
        "approach",
        "another",
        "inherited",
        "good",
        "deal",
        "evolution",
        "established",
        "cognitive",
        "system",
        "organism",
        "evolved",
        "advance",
        "first",
        "approximation",
        "based",
        "innate",
        "factor",
        "learning",
        "third",
        "viewthe",
        "nativist",
        "positionis",
        "added",
        "course",
        "evolution",
        "way",
        "preinformed",
        "least",
        "matter",
        "critical",
        "survival",
        "possibility",
        "vague",
        "taken",
        "hypothesis",
        "nativist",
        "view",
        "seems",
        "least",
        "initially",
        "plausible",
        "empiricist",
        "approach",
        "important",
        "point",
        "plausible",
        "century",
        "ago",
        "somehow",
        "nativist",
        "implication",
        "evolutionary",
        "theorizing",
        "also",
        "obscured",
        "empiricist",
        "might",
        "argue",
        "implication",
        "relevant",
        "nativist",
        "tradition",
        "oppose",
        "point",
        "issue",
        "hardly",
        "raised",
        "one",
        "suspect",
        "deep",
        "cultural",
        "intellectual",
        "bias",
        "work",
        "upshot",
        "last",
        "point",
        "presumed",
        "advantage",
        "simplicity",
        "empiricism",
        "claimed",
        "illusory",
        "include",
        "measurement",
        "simplicity",
        "well",
        "hypothesis",
        "fit",
        "established",
        "theory",
        "simpler",
        "hypothesis",
        "human",
        "being",
        "part",
        "natural",
        "biological",
        "order",
        "like",
        "organism",
        "degree",
        "preshaped",
        "evolution",
        "fit",
        "distinctive",
        "ecological",
        "niche",
        "naturalistic",
        "view",
        "human",
        "being",
        "ushered",
        "darwin",
        "revived",
        "nativism",
        "might",
        "go",
        "step",
        "ask",
        "whether",
        "empiricism",
        "missed",
        "golden",
        "opportunity",
        "deploy",
        "evolutionary",
        "theory",
        "vindication",
        "empiricism",
        "enterprising",
        "empiricism",
        "might",
        "noted",
        "evolutionary",
        "theory",
        "commits",
        "u",
        "idea",
        "whatever",
        "innate",
        "u",
        "least",
        "one",
        "sense",
        "shaped",
        "experience",
        "experience",
        "would",
        "ancestral",
        "experience",
        "experience",
        "individual",
        "subject",
        "view",
        "would",
        "still",
        "ground",
        "knowledge",
        "experience",
        "word",
        "range",
        "learning",
        "experience",
        "empiricist",
        "core",
        "commitment",
        "would",
        "simply",
        "extended",
        "cover",
        "individual",
        "learning",
        "speciesbased",
        "learning",
        "well",
        "opportunity",
        "part",
        "missed"
    ]
}