{
    "main_text": "Integrity as a Virtue\n6. Integrity as a Virtue\n\nIf integrity is a virtue, the key questions are what sort of virtue it\nis; what is its object and characteristic motivation? Bernard Williams\n(1981a, 49) claims that integrity is not a virtue because:\n\n… while it is an admirable human property, it is not related to\nmotivation as the virtues are. It is not a disposition which itself\nyields motivations, as generosity and benevolence do; nor is it a\nvirtue of that type, sometimes called ‘executive’ virtues,\nwhich do not themselves yield a characteristic motive, but are\nnecessary for that relation to oneself and the world which enables one\nto act from desirable motives in desirable ways — the type that\nincludes courage and self-control.\n\n\nWilliams also contends that integrity does not dispose its possessors\ntowards a characteristic thought—there is nothing in particular\nthat integrity leads those who possess it to attend to. He writes\n“If integrity had to be provided with a characteristic thought,\nthere would be nothing for the thought to be about but\noneself—but there is no such characteristic thought, only\nthoughts associated with projects, in carrying out which a man may\ndisplay his integrity” (Williams 1981a, 49). Williams holds this\nview because he sees integrity as steadfast maintenance of\nidentity-conferring commitments, a view we discussed in section 2.\nNonetheless, Williams sets out a clear challenge for those who hold\nintegrity to be a virtue. They should either set out the\ncharacteristic motivations and thoughts of those who possess the\nvirtue or explain why it is that integrity is an anomalous virtue, one\nnot associated with characteristic motivations and thoughts. There are\ntwo main ways this has been approached. One is to claim that the\nvirtue of integrity need not involve characteristic motivations or\nthoughts because it is a special kind of virtue; the other is to claim\nthat integrity is a cluster concept and thus involves multiple\nmotivations and thoughts.\n\nScherkoske (2011, 2012a and 2012b) suggests that integrity is an\nepistemic virtue, broadly conceived. In his view this explains why\nintegrity appears not to furnish its possessor with a characteristic\nsort of motivation or thought. According to Scherkoske, epistemic\nvirtues are distinct from moral virtues in just this way: they neither\ndispose agents to particular motivations or characteristic thoughts.\n“In the same way that epistemic virtues such as accuracy,\nopen-mindedness and analytical insightfulness do not specify any\nparticular content, integrity does not supply a characteristic\nthought, either” (Scherkoske 2011, 201). However, it seems that\nepistemic virtues do furnish characteristic motivations. An\nepistemically virtuous person, it seems, is motivated to discover the\ntruth, the most justified belief, or something along these lines. A\nvirtuously open minded person, for example, is not motivated to\nentertain new ideas merely because they are new, they are motivated by\nthe possibility that in new ideas lie new insights and new\npossibilities for encountering the truth. A benevolent person is\nmotivated by the needs of particular others and characteristically\nthinks of what will answer these needs. An epistemically virtuous\nperson is motivated by the search for truth or justification and\ncharacteristically thinks of what will answer this quest.\nScherkoske’s contrast between moral and epistemic virtues may\ntherefore be overdrawn. Scherkoske’s view was discussed in\nsection 3.\n\nAn alternative view is that the concept of integrity is a cluster\nconcept, tying together different overlapping qualities of character\nunder the one term. Cox, La Caze and Levine (2003) argue that\nintegrity is a virtue, but not one that is reducible to the workings\nof a single moral capacity (in the way that, say, courage is) or the\nwholehearted pursuit of an identifiable moral end (in the way that,\nsay, benevolence is). On this view, integrity is a complex and thick\nvirtue term. One gains a fair grasp of the variety of ways in which\npeople properly use the term ‘integrity’ by examining\nconditions commonly accepted to defeat or diminish a person’s\nintegrity. Integrity stands as a mean to various excesses. On the one\nside we have character traits and ways of behaving and thinking that\ntend to maintain the status quo even where acting with integrity\ndemands a change. These are things like arrogance, dogmatism,\nfanaticism, monomania, preciousness, sanctimoniousness, and rigidity.\nThese are all traits that can defeat integrity in so far as they\nundermine and suppress attempts by an individual to critically assess\nand balance their desires, commitments, wishes, changing goals and\nother factors. Thus, refusing to acknowledge that circumstance in a\nmarriage, or one’s passionate desire to write a novel, have\ndramatically changed (for whatever reasons) may indicate a lack of\nintegrity—a giving in to cowardice for example, and a refusal to\nacknowledge new or overriding commitments. These same factors can\ndefeat one’s integrity, or an aspect of one’s integrity,\nwhether one decides to stay with a marriage or abandon it. In one case\nstaying may indicate a lack of integrity, while in a different case,\nabandoning the marriage would indicate such a lack.\n\nOn the other side, a different set of characteristics undermine\nintegrity. These do not undermine the status quo as much as they make\nit impossible to discern stable features in one’s life, and in\none’s relations to others, that are necessary if one is to act\nwith integrity. In this category are capriciousness, wantonness,\ntriviality, disintegration, weakness of will, self deception,\nself-ignorance, mendacity, hypocrisy, indifference. Although the\nsecond of these lists dominates contemporary reflection on the nature\nof integrity, the first may also represent an ever present threat to\nour integrity. The person of integrity lives in a fragile balance\nbetween every one of these all-too-human traits (Cox, La Caze, Levine\n2003, p. 41). It is not that integrity stands as a mean\nbetween the vices that are represented in these two lists.\nRather, the person of integrity will find a mean between the excesses\nof each one of these vices, or traits or practices that can\nundermine—that do undermine—integrity. Some people will be\nmore prone to a certain set of practices or character traits that\nundermine integrity than others. The defeaters of integrity are\nperson-relative, and may even be situation-relative.\n\nOne worry with this kind of grab-all approach to integrity is that it\nfails to issue in clear moral judgment of individual cases. Robert\nAudi and Patrick Murphy call this the blunt instrument problem (Audi\nand Murphy 2006, 8). Attributions of integrity leave too much\nunspecified to afford clear and determinate ethical judgments, either\nof character or action. In saying that a person or an organization\nacted with integrity, for example, we fail to pass a clear and\nunambiguous moral judgment upon their action. Audi and Murphy’s\nsuggestion is that the term should be used as a complement to other,\nmore specific, moral terms drawn from theories like utilitarianism and\nKantianism. Self-standing attributions of integrity are of little\npractical or intellectual value in their view (Audi and Murphy 2006,\n11). Audi and Murphy are surely right that ethical judgment of action\nis rarely if ever settled by observing that agents have acted with\nintegrity. The question remains open, however, about the work that\nintegrity attributions do. Is there anything in general that\nattributions of integrity specifically commend in a person?\n\nOn the assumption that integrity is a cluster concept of some kind,\nthe question turns on whether anything ties together the various\ntraits associated with integrity in a coherent overarching conception\nof integrity, one that makes it a clear virtue. One possibility is\nthat the traits of integrity are tied together by the idea of\nsuccessfully taking one’s life seriously either in all its\nimportant aspects (personal, intimate, social, professional,\naesthetic, intellectual and emotional) or in some of them. The variety\nof qualities that Cox, La Caze and Levine claim are needed for\nintegrity might not be an awkwardly heterogeneous collection they seem\nto be at first sight if they contribute in recognizable ways to the\nbusiness of successfully taking one’s life—in itself and\nas lived with others— seriously. Such a view requires\ndevelopment of the idea of taking one’s life seriously, but it\nmight posses certain advantages. It might have an advantage over\nintegrationist views, for example, because it promises an explanation\nof why integration seems both important to integrity and also\nsometimes in tension with it. Audi and Murphy explicitly deny this\ntension—they deny that a person of integrity will experience\nvery much self-conflict except over clashing prima facie duties (Audi\nand Murphy 2006, 18). However, the idea that integrity is compatible\nwith substantial self-conflict is defended by a number of authors (see\nthe discussion of integrity as self-integration in section 1).\n\nCentral to the idea of integrity as the virtue of taking one’s\nlife seriously would be the idea that a pursuit of integrity involves\nsomehow taking account of one’s changing values, convictions,\ncommitments, desires, knowledge, beliefs and so on over time.\nIntegrity would thus require a robustly successful kind of\nself-examination (an examined life). Further understanding of this\naspect of integrity would likely involve examining the so-called moral\nemotions or emotions of self-assessment: regret; remorse; guilt;\nshame. These are central to the kind of self-monitoring that would be\npart of what it means to have the virtue of integrity, understood as\nthe virtue of successfully approaching one’s life seriously. Far\nfrom being either unnecessary or undesirable, such emotions may be\nessential to integrity. (Pugmire (2005) discusses integrity and the\nemotions.)\n\nThis account of integrity makes it appear that integrity is much more\ndifficult to achieve than is sometimes thought. It makes integrity a\nquality of character that one may have to a greater or lesser extent,\nin certain ways but not others, and in certain aspects or areas of\none’s life but not others. Having integrity is not on this view\nan all or nothing thing. To say a person has integrity is to make an\n“all things considered” judgment: something that we may\nsay of people if we know—and even if they know—that in\ncertain ways and about certain things, they lack integrity.\n\nA conception of integrity as a virtue—either developed along the\nlines described above or along different lines—is compatible\nwith the existence of constraints on the content of the norms the\nperson of integrity is committed to. Profound moral failure may be an\nindependent defeater of integrity, just as hypocrisy, fanaticism and\nthe like are defeaters of integrity. One might judge as internal to\nsuch a conception of the virtue the idea that integrity is\nincompatible with major failures of moral imagination or moral\ncourage, or with the maintenance of wholly unreasonable moral\nprinciples or opinions. On such a view, the Nazi could not, all things\nconsidered, be a regarded as person of integrity. The Nazi may be\nself-deceiver and a liar (which is highly probable), but even if he is\nnot, his principles and his actions are not rationally defensible\nunder any coherent moral view. And this latter fact may by itself\njustify the judgment that the Nazi lacks the virtue of integrity.\n",
    "section_title": "6. Integrity as a Virtue",
    "entry_title": "Integrity",
    "hierarchy_title": "Integrity || Integrity as a Virtue",
    "tokenized_text": [
        "integrity",
        "virtue",
        "integrity",
        "virtue",
        "integrity",
        "virtue",
        "key",
        "question",
        "sort",
        "virtue",
        "object",
        "characteristic",
        "motivation",
        "bernard",
        "williams",
        "a",
        "claim",
        "integrity",
        "virtue",
        "admirable",
        "human",
        "property",
        "related",
        "motivation",
        "virtue",
        "disposition",
        "yield",
        "motivation",
        "generosity",
        "benevolence",
        "virtue",
        "type",
        "sometimes",
        "called",
        "executive",
        "virtue",
        "yield",
        "characteristic",
        "motive",
        "necessary",
        "relation",
        "oneself",
        "world",
        "enables",
        "one",
        "act",
        "desirable",
        "motif",
        "desirable",
        "way",
        "type",
        "includes",
        "courage",
        "selfcontrol",
        "williams",
        "also",
        "contends",
        "integrity",
        "dispose",
        "possessor",
        "towards",
        "characteristic",
        "thoughtthere",
        "nothing",
        "particular",
        "integrity",
        "lead",
        "posse",
        "attend",
        "writes",
        "integrity",
        "provided",
        "characteristic",
        "thought",
        "would",
        "nothing",
        "thought",
        "oneselfbut",
        "characteristic",
        "thought",
        "thought",
        "associated",
        "project",
        "carrying",
        "man",
        "may",
        "display",
        "integrity",
        "williams",
        "a",
        "williams",
        "hold",
        "view",
        "see",
        "integrity",
        "steadfast",
        "maintenance",
        "identityconferring",
        "commitment",
        "view",
        "discussed",
        "section",
        "nonetheless",
        "williams",
        "set",
        "clear",
        "challenge",
        "hold",
        "integrity",
        "virtue",
        "either",
        "set",
        "characteristic",
        "motivation",
        "thought",
        "posse",
        "virtue",
        "explain",
        "integrity",
        "anomalous",
        "virtue",
        "one",
        "associated",
        "characteristic",
        "motivation",
        "thought",
        "two",
        "main",
        "way",
        "approached",
        "one",
        "claim",
        "virtue",
        "integrity",
        "need",
        "involve",
        "characteristic",
        "motivation",
        "thought",
        "special",
        "kind",
        "virtue",
        "claim",
        "integrity",
        "cluster",
        "concept",
        "thus",
        "involves",
        "multiple",
        "motivation",
        "thought",
        "scherkoske",
        "a",
        "b",
        "suggests",
        "integrity",
        "epistemic",
        "virtue",
        "broadly",
        "conceived",
        "view",
        "explains",
        "integrity",
        "appears",
        "furnish",
        "possessor",
        "characteristic",
        "sort",
        "motivation",
        "thought",
        "according",
        "scherkoske",
        "epistemic",
        "virtue",
        "distinct",
        "moral",
        "virtue",
        "way",
        "neither",
        "dispose",
        "agent",
        "particular",
        "motivation",
        "characteristic",
        "thought",
        "way",
        "epistemic",
        "virtue",
        "accuracy",
        "openmindedness",
        "analytical",
        "insightfulness",
        "specify",
        "particular",
        "content",
        "integrity",
        "supply",
        "characteristic",
        "thought",
        "either",
        "scherkoske",
        "however",
        "seems",
        "epistemic",
        "virtue",
        "furnish",
        "characteristic",
        "motivation",
        "epistemically",
        "virtuous",
        "person",
        "seems",
        "motivated",
        "discover",
        "truth",
        "justified",
        "belief",
        "something",
        "along",
        "line",
        "virtuously",
        "open",
        "minded",
        "person",
        "example",
        "motivated",
        "entertain",
        "new",
        "idea",
        "merely",
        "new",
        "motivated",
        "possibility",
        "new",
        "idea",
        "lie",
        "new",
        "insight",
        "new",
        "possibility",
        "encountering",
        "truth",
        "benevolent",
        "person",
        "motivated",
        "need",
        "particular",
        "others",
        "characteristically",
        "think",
        "answer",
        "need",
        "epistemically",
        "virtuous",
        "person",
        "motivated",
        "search",
        "truth",
        "justification",
        "characteristically",
        "think",
        "answer",
        "quest",
        "scherkoske",
        "contrast",
        "moral",
        "epistemic",
        "virtue",
        "may",
        "therefore",
        "overdrawn",
        "scherkoske",
        "view",
        "discussed",
        "section",
        "alternative",
        "view",
        "concept",
        "integrity",
        "cluster",
        "concept",
        "tying",
        "together",
        "different",
        "overlapping",
        "quality",
        "character",
        "one",
        "term",
        "cox",
        "la",
        "caze",
        "levine",
        "argue",
        "integrity",
        "virtue",
        "one",
        "reducible",
        "working",
        "single",
        "moral",
        "capacity",
        "way",
        "say",
        "courage",
        "wholehearted",
        "pursuit",
        "identifiable",
        "moral",
        "end",
        "way",
        "say",
        "benevolence",
        "view",
        "integrity",
        "complex",
        "thick",
        "virtue",
        "term",
        "one",
        "gain",
        "fair",
        "grasp",
        "variety",
        "way",
        "people",
        "properly",
        "use",
        "term",
        "integrity",
        "examining",
        "condition",
        "commonly",
        "accepted",
        "defeat",
        "diminish",
        "person",
        "integrity",
        "integrity",
        "stand",
        "mean",
        "various",
        "excess",
        "one",
        "side",
        "character",
        "trait",
        "way",
        "behaving",
        "thinking",
        "tend",
        "maintain",
        "status",
        "quo",
        "even",
        "acting",
        "integrity",
        "demand",
        "change",
        "thing",
        "like",
        "arrogance",
        "dogmatism",
        "fanaticism",
        "monomania",
        "preciousness",
        "sanctimoniousness",
        "rigidity",
        "trait",
        "defeat",
        "integrity",
        "far",
        "undermine",
        "suppress",
        "attempt",
        "individual",
        "critically",
        "ass",
        "balance",
        "desire",
        "commitment",
        "wish",
        "changing",
        "goal",
        "factor",
        "thus",
        "refusing",
        "acknowledge",
        "circumstance",
        "marriage",
        "one",
        "passionate",
        "desire",
        "write",
        "novel",
        "dramatically",
        "changed",
        "whatever",
        "reason",
        "may",
        "indicate",
        "lack",
        "integritya",
        "giving",
        "cowardice",
        "example",
        "refusal",
        "acknowledge",
        "new",
        "overriding",
        "commitment",
        "factor",
        "defeat",
        "one",
        "integrity",
        "aspect",
        "one",
        "integrity",
        "whether",
        "one",
        "decides",
        "stay",
        "marriage",
        "abandon",
        "one",
        "case",
        "staying",
        "may",
        "indicate",
        "lack",
        "integrity",
        "different",
        "case",
        "abandoning",
        "marriage",
        "would",
        "indicate",
        "lack",
        "side",
        "different",
        "set",
        "characteristic",
        "undermine",
        "integrity",
        "undermine",
        "status",
        "quo",
        "much",
        "make",
        "impossible",
        "discern",
        "stable",
        "feature",
        "one",
        "life",
        "one",
        "relation",
        "others",
        "necessary",
        "one",
        "act",
        "integrity",
        "category",
        "capriciousness",
        "wantonness",
        "triviality",
        "disintegration",
        "weakness",
        "self",
        "deception",
        "selfignorance",
        "mendacity",
        "hypocrisy",
        "indifference",
        "although",
        "second",
        "list",
        "dominates",
        "contemporary",
        "reflection",
        "nature",
        "integrity",
        "first",
        "may",
        "also",
        "represent",
        "ever",
        "present",
        "threat",
        "integrity",
        "person",
        "integrity",
        "life",
        "fragile",
        "balance",
        "every",
        "one",
        "alltoohuman",
        "trait",
        "cox",
        "la",
        "caze",
        "levine",
        "p",
        "integrity",
        "stand",
        "mean",
        "vice",
        "represented",
        "two",
        "list",
        "rather",
        "person",
        "integrity",
        "find",
        "mean",
        "excess",
        "one",
        "vice",
        "trait",
        "practice",
        "underminethat",
        "undermineintegrity",
        "people",
        "prone",
        "certain",
        "set",
        "practice",
        "character",
        "trait",
        "undermine",
        "integrity",
        "others",
        "defeaters",
        "integrity",
        "personrelative",
        "may",
        "even",
        "situationrelative",
        "one",
        "worry",
        "kind",
        "graball",
        "approach",
        "integrity",
        "fails",
        "issue",
        "clear",
        "moral",
        "judgment",
        "individual",
        "case",
        "robert",
        "audi",
        "patrick",
        "murphy",
        "call",
        "blunt",
        "instrument",
        "problem",
        "audi",
        "murphy",
        "attribution",
        "integrity",
        "leave",
        "much",
        "unspecified",
        "afford",
        "clear",
        "determinate",
        "ethical",
        "judgment",
        "either",
        "character",
        "action",
        "saying",
        "person",
        "organization",
        "acted",
        "integrity",
        "example",
        "fail",
        "pas",
        "clear",
        "unambiguous",
        "moral",
        "judgment",
        "upon",
        "action",
        "audi",
        "murphy",
        "suggestion",
        "term",
        "used",
        "complement",
        "specific",
        "moral",
        "term",
        "drawn",
        "theory",
        "like",
        "utilitarianism",
        "kantianism",
        "selfstanding",
        "attribution",
        "integrity",
        "little",
        "practical",
        "intellectual",
        "value",
        "view",
        "audi",
        "murphy",
        "audi",
        "murphy",
        "surely",
        "right",
        "ethical",
        "judgment",
        "action",
        "rarely",
        "ever",
        "settled",
        "observing",
        "agent",
        "acted",
        "integrity",
        "question",
        "remains",
        "open",
        "however",
        "work",
        "integrity",
        "attribution",
        "anything",
        "general",
        "attribution",
        "integrity",
        "specifically",
        "commend",
        "person",
        "assumption",
        "integrity",
        "cluster",
        "concept",
        "kind",
        "question",
        "turn",
        "whether",
        "anything",
        "tie",
        "together",
        "various",
        "trait",
        "associated",
        "integrity",
        "coherent",
        "overarching",
        "conception",
        "integrity",
        "one",
        "make",
        "clear",
        "virtue",
        "one",
        "possibility",
        "trait",
        "integrity",
        "tied",
        "together",
        "idea",
        "successfully",
        "taking",
        "one",
        "life",
        "seriously",
        "either",
        "important",
        "aspect",
        "personal",
        "intimate",
        "social",
        "professional",
        "aesthetic",
        "intellectual",
        "emotional",
        "variety",
        "quality",
        "cox",
        "la",
        "caze",
        "levine",
        "claim",
        "needed",
        "integrity",
        "might",
        "awkwardly",
        "heterogeneous",
        "collection",
        "seem",
        "first",
        "sight",
        "contribute",
        "recognizable",
        "way",
        "business",
        "successfully",
        "taking",
        "one",
        "lifein",
        "lived",
        "others",
        "seriously",
        "view",
        "requires",
        "development",
        "idea",
        "taking",
        "one",
        "life",
        "seriously",
        "might",
        "posse",
        "certain",
        "advantage",
        "might",
        "advantage",
        "integrationist",
        "view",
        "example",
        "promise",
        "explanation",
        "integration",
        "seems",
        "important",
        "integrity",
        "also",
        "sometimes",
        "tension",
        "audi",
        "murphy",
        "explicitly",
        "deny",
        "tensionthey",
        "deny",
        "person",
        "integrity",
        "experience",
        "much",
        "selfconflict",
        "except",
        "clashing",
        "prima",
        "facie",
        "duty",
        "audi",
        "murphy",
        "however",
        "idea",
        "integrity",
        "compatible",
        "substantial",
        "selfconflict",
        "defended",
        "number",
        "author",
        "see",
        "discussion",
        "integrity",
        "selfintegration",
        "section",
        "central",
        "idea",
        "integrity",
        "virtue",
        "taking",
        "one",
        "life",
        "seriously",
        "would",
        "idea",
        "pursuit",
        "integrity",
        "involves",
        "somehow",
        "taking",
        "account",
        "one",
        "changing",
        "value",
        "conviction",
        "commitment",
        "desire",
        "knowledge",
        "belief",
        "time",
        "integrity",
        "would",
        "thus",
        "require",
        "robustly",
        "successful",
        "kind",
        "selfexamination",
        "examined",
        "life",
        "understanding",
        "aspect",
        "integrity",
        "would",
        "likely",
        "involve",
        "examining",
        "socalled",
        "moral",
        "emotion",
        "emotion",
        "selfassessment",
        "regret",
        "remorse",
        "guilt",
        "shame",
        "central",
        "kind",
        "selfmonitoring",
        "would",
        "part",
        "mean",
        "virtue",
        "integrity",
        "understood",
        "virtue",
        "successfully",
        "approaching",
        "one",
        "life",
        "seriously",
        "far",
        "either",
        "unnecessary",
        "undesirable",
        "emotion",
        "may",
        "essential",
        "integrity",
        "pugmire",
        "discus",
        "integrity",
        "emotion",
        "account",
        "integrity",
        "make",
        "appear",
        "integrity",
        "much",
        "difficult",
        "achieve",
        "sometimes",
        "thought",
        "make",
        "integrity",
        "quality",
        "character",
        "one",
        "may",
        "greater",
        "lesser",
        "extent",
        "certain",
        "way",
        "others",
        "certain",
        "aspect",
        "area",
        "one",
        "life",
        "others",
        "integrity",
        "view",
        "nothing",
        "thing",
        "say",
        "person",
        "integrity",
        "make",
        "thing",
        "considered",
        "judgment",
        "something",
        "may",
        "say",
        "people",
        "knowand",
        "even",
        "knowthat",
        "certain",
        "way",
        "certain",
        "thing",
        "lack",
        "integrity",
        "conception",
        "integrity",
        "virtueeither",
        "developed",
        "along",
        "line",
        "described",
        "along",
        "different",
        "linesis",
        "compatible",
        "existence",
        "constraint",
        "content",
        "norm",
        "person",
        "integrity",
        "committed",
        "profound",
        "moral",
        "failure",
        "may",
        "independent",
        "defeater",
        "integrity",
        "hypocrisy",
        "fanaticism",
        "like",
        "defeaters",
        "integrity",
        "one",
        "might",
        "judge",
        "internal",
        "conception",
        "virtue",
        "idea",
        "integrity",
        "incompatible",
        "major",
        "failure",
        "moral",
        "imagination",
        "moral",
        "courage",
        "maintenance",
        "wholly",
        "unreasonable",
        "moral",
        "principle",
        "opinion",
        "view",
        "nazi",
        "could",
        "thing",
        "considered",
        "regarded",
        "person",
        "integrity",
        "nazi",
        "may",
        "selfdeceiver",
        "liar",
        "highly",
        "probable",
        "even",
        "principle",
        "action",
        "rationally",
        "defensible",
        "coherent",
        "moral",
        "view",
        "latter",
        "fact",
        "may",
        "justify",
        "judgment",
        "nazi",
        "lack",
        "virtue",
        "integrity"
    ]
}