{
    "main_text": "Integrity as Moral Purpose\n5. Integrity as Moral Purpose\n\nAnother way of thinking about integrity places moral constraints upon\nthe kinds of commitment to which a person of integrity must remain\ntrue. There are several ways of doing this. Elizabeth Ashford argues\nfor a virtue she calls ‘objective integrity’. Objective\nintegrity requires that agents have a sure grasp of their real moral\nobligations (Ashford 2000, 246). A person of integrity cannot,\ntherefore, be morally mistaken. Understood in this way, one only\nproperly ascribes integrity to a person with whom one finds oneself\ncompletely in moral agreement. This concept of integrity does not,\nhowever, closely match ordinary use of the term. The point of\nattributing integrity to another is not always to signal unambiguous\nmoral agreement. It is often to ameliorate criticism of\nanother’s moral judgment. For example, we may disagree strongly\nwith the Pope’s views of the role of women in the Church, take\nthis to be a significant moral criticism of him, and yet admit that he\nis a man of integrity. In such a case it is largely the point of\nattributing integrity to open a space for substantial moral\ndisagreement without launching a wholesale attack upon another’s\nmoral character.\n\nMark Halfon offers a different way of defining integrity in terms of\nmoral purpose. Halfon describes integrity in terms of a person’s\ndedication to the pursuit of a moral life and their intellectual\nresponsibility in seeking to understand the demands of such a life. He\nwrites that persons of integrity:\n\n…embrace a moral point of view that urges them to be\nconceptually clear, logically consistent, apprised of relevant\nempirical evidence, and careful about acknowledging as well as\nweighing relevant moral considerations. Persons of integrity impose\nthese restrictions on themselves since they are concerned, not simply\nwith taking any moral position, but with pursuing a commitment to do\nwhat is best. (Halfon 1989, 37)\n\n\nHalfon’s view allows that integrity is not necessarily\n‘objective’, as Ashford claims, and is similar in a number\nof respects to Calhoun’s. Both see integrity as centrally\nconcerned with deliberation about how to live. However, Halfon\nconceives this task in more narrowly moral terms and ties integrity to\npersonal intellectual virtues exercised in pursuit of a morally good\nlife. Halfon speaks of a person confronting ‘all relevant moral\nconsiderations’, but this turns out to be quite a formal\nconstraint. What counts as a relevant moral consideration, on\nHalfon’s view, depends upon the moral point of view of the\nagent. Persons of integrity may thus be responsible for acts others\nwould regard as grossly immoral. What is important is that they act\nwith moral purpose and display intellectual integrity in moral\ndeliberation. This leads Halfon to admit that, on his conception of\nintegrity, it is possible for a Nazi bent on genocide of the entire\nJewish people to be a person of moral integrity. Halfon thinks it\npossible, but not at all likely (Halfon 1989, 134–36).\n\nOther philosophers object to this consequence. If the genocidal Nazi\nis a possible object of ascriptions of moral integrity, then we can\nproperly ascribe integrity to people whose moral viewpoint is\nbizarrely remote from any we find intelligible or defensible. (See\nMcFall 1987 and Cox, La Caze and Levine 2003, 56–68. Putnam 1996\ndraws on the work of Carol Gilligan 1982 to suggest a different way of\novercoming the problem of the Nazi of integrity.) Moral constraints\nupon attributions of integrity need not take the form of\nAshford’s ‘moralized’ view or Halfon’s more\nlimited formal view. One might say instead that attributions of\nintegrity involve the judgment that an agent acts from a moral point\nof view those attributing integrity find intelligible and defensible\n(though not necessarily right) —and that this formal constraint\ndoes have substantive implications. It prohibits attributing integrity\nto, for example, those who advocate genocide, or deny the moral\nstanding of people on, for example, sex-based or racial grounds. There\nare things which a person of integrity cannot do. The Nazis and other\nperpetrators of great evil were either committed to what they were\ndoing, in which case they were profoundly immoral (or not moral agents\nat all) and lacked integrity; or else they lacked integrity because\nthey were self-deceived or dissembling and never actually had the Nazi\ncommitments they claimed to have. Judgments of integrity would thus\ninvolve judgment about the reasonableness of others’ moral\npoints of view, rather than the absolute correctness of their view\n(Ashford) or the intellectual responsibility with which they generally\napproach the task of thinking about moral questions (Halfon).\n\nMcFall (1987) contains an interesting discussion of the nature of the\nconstraints on proper attributions of integrity. She asks ‘Are\nthere no constraints on the content of the principles or\ncommitments a person of integrity may hold?’ and then invites us\nto consider the following statements (McFall 1987, 9).\n\nSally is a person of principle: pleasure.\nHarold demonstrates great integrity in his single-minded pursuit\nof approval.\nJohn was a man of uncommon integrity. He let nothing, not\nfriendship, not justice, not truth stand in the way of his amassment\nof wealth.\n\n\nMcFall holds that the fact that ‘none of these claims can be\nmade with a straight face suggests that integrity is inconsistent with\nsuch principles.’ (McFall 1987, p. 9) The question, however, is\nwhether this is due to the formal constraints or substantive\nconstraints; that is, whether attributions of integrity are\nconstrained by the content of principles a person maintains, or by way\ncertain kinds of principle fail to meet formal constraints on the way\npersons of integrity hold to their principles. McFall appears to\nsuggest the latter interpretation.\n\nIn providing reasons for our dismissal of [i] to [iii] she says (1987,\n9–10)\n\nA person of integrity is willing to bear the consequences of her\nconvictions, even when this is difficult … A person whose only\nprinciple is ‘Seek my own pleasure’ is not a candidate for\nintegrity because there is no possibility of conflict—between\npleasure and principle—in which integrity could be lost. Where\nthere is no possibility of its loss, integrity cannot exist. Similarly\nin the case of the approval seeker. The single-minded pursuit of\napproval is inconsistent with integrity … A commitment to\nspinelessness does not vitiate its spinelessness—another of\nintegrity’s contraries. The same may be said for the ruthless\nseeker of wealth. A person whose only aim is to increase his bank\nbalance is a person for whom nothing is ruled out: duplicity, theft,\nmurder. Expedience is contrasted to a life of principle, so\nan ascription of integrity is out of place. Like the pleasure seeker\nand the approval seeker, he lacks a ‘core,’ the kind of\ncommitments that give a person character and that make a loss of\nintegrity possible. In order to sell one’s soul, one must have\nsomething to sell.\n\n\nThis is an argument that invokes formal incompatibility between\nparticular principles or goals and the proper attribution of\nintegrity. The argument is not conclusive, however. Seeking pleasure,\napproval or wealth, is not always easy and it seems possible that\nconflict could arise, for example, between determinations to pursue\nhigher or lower pleasures, long-term pleasures or immediate\ngratifications. The ruthless seeker of wealth seems to have a\n‘core,’—albeit a nasty one—along with a set of\nprinciples of a sort and a set of actions that are ruled out on\nprinciple. If integrity requires a conflict between pleasure and\nprinciple, that would explain why a pure pleasure seeker lacks\nintegrity. But in this case, it seems that a perfectly virtuous agent\ndoes not possess, or need to possess, integrity. For instance,\nAristotle’s model of a virtuous agent contrasts with merely\nenkratic agents who must struggle to act virtuously. The fully\nvirtuous Aristotelean agent would have no need of integrity if\nintegrity were about the struggle between pleasure and principle. (But\nsee Kristján Kristjánsson, 2019.) The idea that a fully\nvirtuous agent lacks integrity does not seem plausible, however, and\nthis suggests that integrity cannot merely reside in the triumph of\nprinciple over pleasure.\n\nAccording to McFall, we judge people to be of integrity only if they\nhave commitments which a reasonable person could accept as important.\nShe writes, ‘Whether we grant or deny personal integrity, then,\nseems to depend on our own conceptions of what is important. And since\nmost of our conceptions are informed if not dominated by moral\nconceptions of the good, it is natural that this should be reflected\nin our judgments of personal integrity’ (1987, 11).\n\nHowever, she also draws a distinction between personal and moral\nintegrity (McFall 1987, 14). On her view, a person who, in acting on\nsome morally deficient principle, does morally abhorrent things may\nhave personal integrity even if not moral integrity. McFall gives the\nexample of a utilitarian lover of literature who is willing to stop\npeople burning books by killing them. She says of the utilitarian\nkiller (1987, 14), ‘Although we may find his actions morally\nabhorrent, we may still be inclined to grant him the virtue of\npersonal integrity. We would not, however, hold him up as a paragon of\nmoral integrity.’\n\nIt may be, then, that a certain kind of integrity — moral\nintegrity — should be defined in terms of moral purpose (perhaps\nalong the lines laid out by Ashford or by Halfon) and another kind of\nintegrity — personal integrity — defined in terms of other\nqualities adumbrated by theorists discussed previously. Defining the\noverall integrity of character in terms of moral purpose has the\nadvantage of capturing intuitions of the moral seriousness of\nquestions of integrity. However, the approach may also be too narrow.\nHalfon’s identification of integrity and moral integrity appears\nto leave out important personal aspects of integrity, aspects better\ncaptured by the other views of integrity we have examined. Integrity\ndoes not seem to be exclusively a matter of how people approach\nplainly moral concerns. Other matters like love, friendship and\npersonal projects appear highly relevant to judgments of integrity.\nImagine a person who sets great store in writing a novel, but who\npostpones the writing of it for years on one excuse or another and\nthen abandons the idea of novel-writing after one difficult experience\nwith a first chapter. We would think this person’s integrity\ndiminished by their failure to make a serious attempt to see the\nproject through, yet the writing of a novel need not be a moral\nproject.\n",
    "section_title": "5. Integrity as Moral Purpose",
    "entry_title": "Integrity",
    "hierarchy_title": "Integrity || Integrity as Moral Purpose",
    "tokenized_text": [
        "integrity",
        "moral",
        "purpose",
        "integrity",
        "moral",
        "purpose",
        "another",
        "way",
        "thinking",
        "integrity",
        "place",
        "moral",
        "constraint",
        "upon",
        "kind",
        "commitment",
        "person",
        "integrity",
        "must",
        "remain",
        "true",
        "several",
        "way",
        "elizabeth",
        "ashford",
        "argues",
        "virtue",
        "call",
        "objective",
        "integrity",
        "objective",
        "integrity",
        "requires",
        "agent",
        "sure",
        "grasp",
        "real",
        "moral",
        "obligation",
        "ashford",
        "person",
        "integrity",
        "therefore",
        "morally",
        "mistaken",
        "understood",
        "way",
        "one",
        "properly",
        "ascribes",
        "integrity",
        "person",
        "one",
        "find",
        "oneself",
        "completely",
        "moral",
        "agreement",
        "concept",
        "integrity",
        "however",
        "closely",
        "match",
        "ordinary",
        "use",
        "term",
        "point",
        "attributing",
        "integrity",
        "another",
        "always",
        "signal",
        "unambiguous",
        "moral",
        "agreement",
        "often",
        "ameliorate",
        "criticism",
        "another",
        "moral",
        "judgment",
        "example",
        "may",
        "disagree",
        "strongly",
        "pope",
        "view",
        "role",
        "woman",
        "church",
        "take",
        "significant",
        "moral",
        "criticism",
        "yet",
        "admit",
        "man",
        "integrity",
        "case",
        "largely",
        "point",
        "attributing",
        "integrity",
        "open",
        "space",
        "substantial",
        "moral",
        "disagreement",
        "without",
        "launching",
        "wholesale",
        "attack",
        "upon",
        "another",
        "moral",
        "character",
        "mark",
        "halfon",
        "offer",
        "different",
        "way",
        "defining",
        "integrity",
        "term",
        "moral",
        "purpose",
        "halfon",
        "describes",
        "integrity",
        "term",
        "person",
        "dedication",
        "pursuit",
        "moral",
        "life",
        "intellectual",
        "responsibility",
        "seeking",
        "understand",
        "demand",
        "life",
        "writes",
        "person",
        "integrity",
        "embrace",
        "moral",
        "point",
        "view",
        "urge",
        "conceptually",
        "clear",
        "logically",
        "consistent",
        "apprised",
        "relevant",
        "empirical",
        "evidence",
        "careful",
        "acknowledging",
        "well",
        "weighing",
        "relevant",
        "moral",
        "consideration",
        "person",
        "integrity",
        "impose",
        "restriction",
        "since",
        "concerned",
        "simply",
        "taking",
        "moral",
        "position",
        "pursuing",
        "commitment",
        "best",
        "halfon",
        "halfon",
        "view",
        "allows",
        "integrity",
        "necessarily",
        "objective",
        "ashford",
        "claim",
        "similar",
        "number",
        "respect",
        "calhoun",
        "see",
        "integrity",
        "centrally",
        "concerned",
        "deliberation",
        "live",
        "however",
        "halfon",
        "conceives",
        "task",
        "narrowly",
        "moral",
        "term",
        "tie",
        "integrity",
        "personal",
        "intellectual",
        "virtue",
        "exercised",
        "pursuit",
        "morally",
        "good",
        "life",
        "halfon",
        "speaks",
        "person",
        "confronting",
        "relevant",
        "moral",
        "consideration",
        "turn",
        "quite",
        "formal",
        "constraint",
        "count",
        "relevant",
        "moral",
        "consideration",
        "halfon",
        "view",
        "depends",
        "upon",
        "moral",
        "point",
        "view",
        "agent",
        "person",
        "integrity",
        "may",
        "thus",
        "responsible",
        "act",
        "others",
        "would",
        "regard",
        "grossly",
        "immoral",
        "important",
        "act",
        "moral",
        "purpose",
        "display",
        "intellectual",
        "integrity",
        "moral",
        "deliberation",
        "lead",
        "halfon",
        "admit",
        "conception",
        "integrity",
        "possible",
        "nazi",
        "bent",
        "genocide",
        "entire",
        "jewish",
        "people",
        "person",
        "moral",
        "integrity",
        "halfon",
        "think",
        "possible",
        "likely",
        "halfon",
        "philosopher",
        "object",
        "consequence",
        "genocidal",
        "nazi",
        "possible",
        "object",
        "ascription",
        "moral",
        "integrity",
        "properly",
        "ascribe",
        "integrity",
        "people",
        "whose",
        "moral",
        "viewpoint",
        "bizarrely",
        "remote",
        "find",
        "intelligible",
        "defensible",
        "see",
        "mcfall",
        "cox",
        "la",
        "caze",
        "levine",
        "putnam",
        "draw",
        "work",
        "carol",
        "gilligan",
        "suggest",
        "different",
        "way",
        "overcoming",
        "problem",
        "nazi",
        "integrity",
        "moral",
        "constraint",
        "upon",
        "attribution",
        "integrity",
        "need",
        "take",
        "form",
        "ashford",
        "moralized",
        "view",
        "halfon",
        "limited",
        "formal",
        "view",
        "one",
        "might",
        "say",
        "instead",
        "attribution",
        "integrity",
        "involve",
        "judgment",
        "agent",
        "act",
        "moral",
        "point",
        "view",
        "attributing",
        "integrity",
        "find",
        "intelligible",
        "defensible",
        "though",
        "necessarily",
        "right",
        "and",
        "formal",
        "constraint",
        "substantive",
        "implication",
        "prohibits",
        "attributing",
        "integrity",
        "example",
        "advocate",
        "genocide",
        "deny",
        "moral",
        "standing",
        "people",
        "example",
        "sexbased",
        "racial",
        "ground",
        "thing",
        "person",
        "integrity",
        "nazi",
        "perpetrator",
        "great",
        "evil",
        "either",
        "committed",
        "case",
        "profoundly",
        "immoral",
        "moral",
        "agent",
        "lacked",
        "integrity",
        "else",
        "lacked",
        "integrity",
        "selfdeceived",
        "dissembling",
        "never",
        "actually",
        "nazi",
        "commitment",
        "claimed",
        "judgment",
        "integrity",
        "would",
        "thus",
        "involve",
        "judgment",
        "reasonableness",
        "others",
        "moral",
        "point",
        "view",
        "rather",
        "absolute",
        "correctness",
        "view",
        "ashford",
        "intellectual",
        "responsibility",
        "generally",
        "approach",
        "task",
        "thinking",
        "moral",
        "question",
        "halfon",
        "mcfall",
        "contains",
        "interesting",
        "discussion",
        "nature",
        "constraint",
        "proper",
        "attribution",
        "integrity",
        "asks",
        "constraint",
        "content",
        "principle",
        "commitment",
        "person",
        "integrity",
        "may",
        "hold",
        "invite",
        "u",
        "consider",
        "following",
        "statement",
        "mcfall",
        "sally",
        "person",
        "principle",
        "pleasure",
        "harold",
        "demonstrates",
        "great",
        "integrity",
        "singleminded",
        "pursuit",
        "approval",
        "john",
        "man",
        "uncommon",
        "integrity",
        "let",
        "nothing",
        "friendship",
        "justice",
        "truth",
        "stand",
        "way",
        "amassment",
        "wealth",
        "mcfall",
        "hold",
        "fact",
        "none",
        "claim",
        "made",
        "straight",
        "face",
        "suggests",
        "integrity",
        "inconsistent",
        "principles",
        "mcfall",
        "p",
        "question",
        "however",
        "whether",
        "due",
        "formal",
        "constraint",
        "substantive",
        "constraint",
        "whether",
        "attribution",
        "integrity",
        "constrained",
        "content",
        "principle",
        "person",
        "maintains",
        "way",
        "certain",
        "kind",
        "principle",
        "fail",
        "meet",
        "formal",
        "constraint",
        "way",
        "person",
        "integrity",
        "hold",
        "principle",
        "mcfall",
        "appears",
        "suggest",
        "latter",
        "interpretation",
        "providing",
        "reason",
        "dismissal",
        "iii",
        "say",
        "person",
        "integrity",
        "willing",
        "bear",
        "consequence",
        "conviction",
        "even",
        "difficult",
        "person",
        "whose",
        "principle",
        "seek",
        "pleasure",
        "candidate",
        "integrity",
        "possibility",
        "conflictbetween",
        "pleasure",
        "principlein",
        "integrity",
        "could",
        "lost",
        "possibility",
        "loss",
        "integrity",
        "exist",
        "similarly",
        "case",
        "approval",
        "seeker",
        "singleminded",
        "pursuit",
        "approval",
        "inconsistent",
        "integrity",
        "commitment",
        "spinelessness",
        "vitiate",
        "spinelessnessanother",
        "integrity",
        "contrary",
        "may",
        "said",
        "ruthless",
        "seeker",
        "wealth",
        "person",
        "whose",
        "aim",
        "increase",
        "bank",
        "balance",
        "person",
        "nothing",
        "ruled",
        "duplicity",
        "theft",
        "murder",
        "expedience",
        "contrasted",
        "life",
        "principle",
        "ascription",
        "integrity",
        "place",
        "like",
        "pleasure",
        "seeker",
        "approval",
        "seeker",
        "lack",
        "core",
        "kind",
        "commitment",
        "give",
        "person",
        "character",
        "make",
        "loss",
        "integrity",
        "possible",
        "order",
        "sell",
        "one",
        "soul",
        "one",
        "must",
        "something",
        "sell",
        "argument",
        "invokes",
        "formal",
        "incompatibility",
        "particular",
        "principle",
        "goal",
        "proper",
        "attribution",
        "integrity",
        "argument",
        "conclusive",
        "however",
        "seeking",
        "pleasure",
        "approval",
        "wealth",
        "always",
        "easy",
        "seems",
        "possible",
        "conflict",
        "could",
        "arise",
        "example",
        "determination",
        "pursue",
        "higher",
        "lower",
        "pleasure",
        "longterm",
        "pleasure",
        "immediate",
        "gratification",
        "ruthless",
        "seeker",
        "wealth",
        "seems",
        "core",
        "albeit",
        "nasty",
        "onealong",
        "set",
        "principle",
        "sort",
        "set",
        "action",
        "ruled",
        "principle",
        "integrity",
        "requires",
        "conflict",
        "pleasure",
        "principle",
        "would",
        "explain",
        "pure",
        "pleasure",
        "seeker",
        "lack",
        "integrity",
        "case",
        "seems",
        "perfectly",
        "virtuous",
        "agent",
        "posse",
        "need",
        "posse",
        "integrity",
        "instance",
        "aristotle",
        "model",
        "virtuous",
        "agent",
        "contrast",
        "merely",
        "enkratic",
        "agent",
        "must",
        "struggle",
        "act",
        "virtuously",
        "fully",
        "virtuous",
        "aristotelean",
        "agent",
        "would",
        "need",
        "integrity",
        "integrity",
        "struggle",
        "pleasure",
        "principle",
        "see",
        "kristján",
        "kristjánsson",
        "idea",
        "fully",
        "virtuous",
        "agent",
        "lack",
        "integrity",
        "seem",
        "plausible",
        "however",
        "suggests",
        "integrity",
        "merely",
        "reside",
        "triumph",
        "principle",
        "pleasure",
        "according",
        "mcfall",
        "judge",
        "people",
        "integrity",
        "commitment",
        "reasonable",
        "person",
        "could",
        "accept",
        "important",
        "writes",
        "whether",
        "grant",
        "deny",
        "personal",
        "integrity",
        "seems",
        "depend",
        "conception",
        "important",
        "since",
        "conception",
        "informed",
        "dominated",
        "moral",
        "conception",
        "good",
        "natural",
        "reflected",
        "judgment",
        "personal",
        "integrity",
        "however",
        "also",
        "draw",
        "distinction",
        "personal",
        "moral",
        "integrity",
        "mcfall",
        "view",
        "person",
        "acting",
        "morally",
        "deficient",
        "principle",
        "morally",
        "abhorrent",
        "thing",
        "may",
        "personal",
        "integrity",
        "even",
        "moral",
        "integrity",
        "mcfall",
        "give",
        "example",
        "utilitarian",
        "lover",
        "literature",
        "willing",
        "stop",
        "people",
        "burning",
        "book",
        "killing",
        "say",
        "utilitarian",
        "killer",
        "although",
        "may",
        "find",
        "action",
        "morally",
        "abhorrent",
        "may",
        "still",
        "inclined",
        "grant",
        "virtue",
        "personal",
        "integrity",
        "would",
        "however",
        "hold",
        "paragon",
        "moral",
        "integrity",
        "may",
        "certain",
        "kind",
        "integrity",
        "moral",
        "integrity",
        "defined",
        "term",
        "moral",
        "purpose",
        "perhaps",
        "along",
        "line",
        "laid",
        "ashford",
        "halfon",
        "another",
        "kind",
        "integrity",
        "personal",
        "integrity",
        "defined",
        "term",
        "quality",
        "adumbrated",
        "theorist",
        "discussed",
        "previously",
        "defining",
        "overall",
        "integrity",
        "character",
        "term",
        "moral",
        "purpose",
        "advantage",
        "capturing",
        "intuition",
        "moral",
        "seriousness",
        "question",
        "integrity",
        "however",
        "approach",
        "may",
        "also",
        "narrow",
        "halfon",
        "identification",
        "integrity",
        "moral",
        "integrity",
        "appears",
        "leave",
        "important",
        "personal",
        "aspect",
        "integrity",
        "aspect",
        "better",
        "captured",
        "view",
        "integrity",
        "examined",
        "integrity",
        "seem",
        "exclusively",
        "matter",
        "people",
        "approach",
        "plainly",
        "moral",
        "concern",
        "matter",
        "like",
        "love",
        "friendship",
        "personal",
        "project",
        "appear",
        "highly",
        "relevant",
        "judgment",
        "integrity",
        "imagine",
        "person",
        "set",
        "great",
        "store",
        "writing",
        "novel",
        "postpones",
        "writing",
        "year",
        "one",
        "excuse",
        "another",
        "abandon",
        "idea",
        "novelwriting",
        "one",
        "difficult",
        "experience",
        "first",
        "chapter",
        "would",
        "think",
        "person",
        "integrity",
        "diminished",
        "failure",
        "make",
        "serious",
        "attempt",
        "see",
        "project",
        "yet",
        "writing",
        "novel",
        "need",
        "moral",
        "project"
    ]
}