{
    "main_text": "Plato\n4. Plato\n\nThroughout his dialogues, Plato emphasizes the relational character of\nvarious mental states: sight, hearing, touch and perception generally,\nmemory, belief, knowledge, concepts, speech, love (Tht.\n152c, 160a–b,\n163e, 188d–189b;\nRep.\nV, 476e, 478b;\nParm. 132b–c;\nSoph. 262e,\n263c; Symp. 199d).\nIn each case, Socrates (or the other main\nspeaker) asks whether the mental state in question is “of\nsomething or of nothing”, and the interlocutors agree that it is\nalways of something – it is impossible for such a state\nnot to be of anything at all. In the Charmides, Socrates gets\nCritias to agree to something stronger, namely, that many of these\nstates – seeing, hearing, and other forms of perception, desire,\nintention, love, fear, and belief – must have an object\nother than themselves; and he suggests that it would be odd\nif knowledge were not like this as well (167c–168a).\nBut in this\nregard, mental states do not differ from other relatives, as he\nhimself emphasizes: Socrates sometimes adds nonintentional cases, such\nas siblings, parents and children, and doubles and halves, in order to\nillustrate his point. In some of the passages above, Socrates follows\nup this question with a further one, which has bearing only for the\nmental states, namely, whether they are always of something\n“that is” rather than something “that is not”.\nAlthough the speakers readily agree that these states must always be\nof something that is, the problem of intentionality already looms,\nmerely by his raising the possibility that on occasion some states\nmight be of what is not, either of what is not the case or of what\ndoes not exist. In the Philebus, this alternative is\nexplicitly taken up: just as one can believe something without that\nbelief being of anything that ever was, is, or will be, so one can\nfeel pleasure about something, or fear, anger, and so on, even if it\nis not about anything that ever was, is, or will be. In all such\ncases, the beliefs, pleasures, fears, and so on are said to be\n“false” (pseudē, Phlb.40c–e).\n\nMore importantly, there are several passages where Socrates discusses\nfalsehood in belief and speech at length, as a familiar and important\nproblem in need of resolution. In the Cratylus, Socrates says\nthat a great many people, both in the past and in the present, have\nheld that it is impossible to speak falsely, on the grounds that it is\nimpossible to say something without saying something that is;\nCratylus concludes that in such cases, instead of speaking falsely and\nsaying something that is not, the speaker would simply be making\nnoise, no more meaningful than banging a pot (429d–430a).\nA similar\npuzzle about false speech is posed in the Euthydemus,\ninitially by the brothers Euthydemus and Dionysodorus, a visiting tag\nteam of Sophists who are displaying their eristic prowess (283e–284e).\nIt is later\nreprised by Socrates, who attributes it explicitly to\n“Protagoras’ followers” and still earlier thinkers,\nand it is explicitly extended to false belief as well (286c–d).\nThese versions\nof the puzzle frame it in terms of whether one can speak (or think) of\n“what is not”: one cannot speak without there being\nsomething that one is saying (or thinking); yet it is impossible for\nthere to be such a thing and for it not to be. But that is what\nspeaking falsely would amount to, since on this view speaking falsely\njust is to say something that is not. Plato never explicitly questions\nthe relational character of speaking and believing or rejects the\nrequirement that the relata must exist or obtain. In the inconsistent\ntriad we considered above, it is the third proposition,\n“Sometimes we can think about what does not exist/obtain,”\nwhich is consistently under pressure in these contexts. At the same\ntime, Socrates objects that such a position would be self-undermining\n(Euthyd. 287e–288a),\nthough he does not offer a further diagnosis\nhere.\n\nThe puzzle about false belief recurs in the Theaetetus at a\ncrucial juncture in the dialogue’s main argument. Socrates and\nTheaetetus have rejected the proposal that knowledge is perception and\nwith it the underlying Protagorean view that whatever appears to be\nthe case is the case. Theaetetus’ new proposal, that knowledge\nis true belief, offers no advance, though, unless they can show that\nfalse belief is possible, against sophistic puzzles like we have just\nseen from the Euthydemus; and while Socrates says he has\n“often” worried about this, he claims that he is unable to\nsay what false belief is and how it comes about (187b–e).\nHe then develops\nthe worry in much more elaborate ways than before. There is a fuller\nversion of the puzzle than we have seen so far, which explicitly\nequates believing something “that is not” with not\nbelieving anything at all (188d–189b).\nBut Socrates also introduces a distinct, new\npsychological worry into consideration. If one assumes that false\nbelief by its very nature has a certain structure, namely, of\nmistaking one thing for another, we must then ask what our cognitive\naccess is to each: do we know each of these, or only one, or neither?\n(188a–c)\nSocrates makes this underlying structure explicit when he goes on to\nanalyze false belief as a kind of “other-believing”\n(allodoxia), where we say in thought that something is one\nthing instead of another (189c–190e).\nThis analysis avoids the earlier difficulty,\nsince both items can be things that are, and it locates error in our\nhaving latched on to the wrong one. From a third-person point of view,\nthis is illuminating, since it exposes precisely why the belief is\nmistaken. But for just the same reason the description is unacceptable\nfrom a first-person point of view for the subject who is taken in: no\none, Socrates insists, would ever say to themselves that\nSocrates is Theaetetus or that one thing is something distinct from it\n(190a–c). And in\nfact Plato repeatedly characterizes thinking as saying something to\noneself, both in this dialogue (189e–190a)\nand later in\nthe Sophist (263e–264a);\nan analogous view also seems to be implicit in\nthe image from Philebus  38e–39a\nof an internal\nscribe writing out our beliefs in our soul. This treatment of\nother-believing in the Theaetetus thus seems to presuppose\nthat both terms must be somehow present to thought in order for the\nsubstitution to occur (190d). The possibility\nthat one might have only one of them in the mind, through perception\nor in some other way, and somehow apply it to the wrong thing in the\nworld is not considered (even though it is something that Plato allows\nin the case of incorrect names at Cratylus 430a–431b,\nwhere he\nspeaks of pointing or otherwise exhibiting the thing while applying a\nname to it).\n\nAt this point in the Theaetetus, Socrates proposes a model\nfor how false belief can occur, based on an analogy with how signet\nrings can be impressed into a wax block to produce a sealing: in a\nsimilar way, our thoughts and perceptions make an impression on our\nmemory, leaving behind traces which are signs or representations of\nthe original objects thought about or perceived (191c–d;\n194c–d).\nThese traces can\nthen be deployed in combination with fresh perceptions of objects,\nwith which they may or may not accord, to produce beliefs. When one of\nthese traces does not “fit” an incoming perception, like a\nshoe put on the wrong foot, the combination is incorrect and the\nresulting belief false (193c–194b).\nThe model satisfies both constraints introduced\nby the earlier puzzles: it provides cases of falsehood where we are\nrelated exclusively to things that are, and where both items are in\nsome way present to thought. But as Socrates develops the suggestion,\nit is made to rely crucially on our having different kinds of\ncognitive access to the two items combined in the belief (memory\ntraces, on the one hand, and perceptions, on the other: 195c–d).\nAs such, it does\nnot serve to explain cases where just thoughts are involved, as when\nsomeone incorrectly believes that the sum of 5 and 7 is 11 (195e–196a).\nThis is\nenough to vitiate the account Socrates and Theaetetus have given of\nfalse belief. But there should no longer be an issue about whether\nfalse beliefs are possible, the challenge posed by the\noriginal puzzles, only about whether we have been given a fully\ncomprehensive account. Socrates tries to salvage the theory by\nproposing another model, where having different thoughts is compared\nto grabbing at birds in an aviary (197c–200d).\nHere again\nthe constraints introduced by the earlier puzzles are met, but the\naccount does not seem any more promising, if taken as a general theory\nof false belief. It is soon given up after being subjected to a number\nof objections, and Socrates returns to the dialogue’s main\nconcern with knowledge. \n\nThe Theaetetus does not have much to say about intentionality\nmore broadly, in particular about the intentionality of the\nperceptions and thoughts that are combined in belief – the\ndialogue’s attention to these issues is limited, understandably,\nby the exigencies of the main argument. Perception had earlier been\ndismissed as not being in a position even to attain truth (186e),\nmuch less being capable of falsehood; but little\nis said about how perceptual content should be understood. The final\nsection of the dialogue briefly raises an important problem about the\nintentionality of thought, however, which is entirely distinct from\nthe problems involving falsehood or nonexistence. If one has a true\nbelief about something, but not knowledge, and in particular does not\ngrasp how that thing differs from all other things, Socrates worries,\nthen how does the belief manage to be about the very thing it is in\nfact about? How can thoughts of general characteristics, that are\nshared equally by other things, “make me think of Theaetetus\nrather than of Theodorus, or of the most distant Mysian, as the saying\ngoes?” (209b) This is an especially\nclear statement (in all likelihood the first) of what Chisholm would\nlater call “the problem of objective reference.” And his\nreading of the Theaetetus may well be what lies behind\nWittgenstein’s own statement of the puzzle: “What makes my\nrepresentation of him a representation of him? Not the\nsimilarity of the image.” (Phil. Invest., II.177,\n§iii)\n\nPlato offers a solution to the puzzles about falsehood in the\nSophist. It goes unchallenged in the text and may well have\nbeen regarded by him as definitive. (It need not be a recent discovery\non Plato’s part, as is often assumed; he needn’t have been\nstumped by these puzzles himself when he composed the earlier\npassages: see Burnyeat 2002.) In this dialogue, when the Eleatic\nvisitor introduces the puzzles about false belief and speaking\nfalsely, he points out the danger of contradicting oneself, invoking\nParmenides’ proscriptions against speaking of what is not\n(236e–237c). But\nhe also insists that we must find a way of reconstruing such claims,\nif we are to show that falsehood is possible (240d–241b)\nwithout\ncommitting patricide against “Father Parmenides” (241d).\nThe subsequent solution turns on recognizing a\ncomplexity in the structure of statements, between the subject, which\nis named in the statement, and what is said about it, as expressed by\nthe predicate (261d–262d).\nStatements are no longer thought of on the model\nof names, which are true if they name something “that is.”\nInstead, for a statement to be meaningful, one part of it must\nsuccessfully name something and the other say something about it,\nwhich may be either true or false of this. Something analogous will\nhold for belief, the visitor says, as belief is taken to be a kind of\ninternal assertion made by the soul (263d–264b).\nAs we have\nseen, several features of this solution are already prefigured in the\nTheaetetus: both the requirement that thought and speech be\nrelated only to what is, and the insight that the complexity of\nstatements and beliefs allows for error to occur in a mismatch of the\nparts or a misapplication of one to the other. But it is only in the\nSophist that this mismatch is explicitly characterized in\nterms of the difference between things that are, rather than\nsimply being about “what is not.” A false statement\nasserts what is not the case regarding the subject, by stating that\nthe subject is other than it in fact is (263a–d).\nThe analysis in\nthe Sophist appears incomplete as it stands, though, since it\nonly applies to subject-predicate sentences, where the subject\nsucceeds in referring to something (262e,\n263c): it is unclear how the visitor would\nhandle other types of statements, much less negative existentials\n(such as ‘there are no witches’). It also gives no account\nof naming or nonpropositional attitudes. But, again, if we consider\nonly the original challenge posed by Parmenides and the Sophists,\nnamely, to show that falsehood is possible, then Plato has clearly\nsucceeded in providing an answer.\n",
    "section_title": "4. Plato",
    "entry_title": "Intentionality in Ancient Philosophy",
    "hierarchy_title": "Intentionality in Ancient Philosophy || Plato",
    "tokenized_text": [
        "plato",
        "plato",
        "throughout",
        "dialogue",
        "plato",
        "emphasizes",
        "relational",
        "character",
        "various",
        "mental",
        "state",
        "sight",
        "hearing",
        "touch",
        "perception",
        "generally",
        "memory",
        "belief",
        "knowledge",
        "concept",
        "speech",
        "love",
        "tht",
        "c",
        "ab",
        "e",
        "db",
        "rep",
        "v",
        "e",
        "b",
        "parm",
        "bc",
        "soph",
        "e",
        "c",
        "symp",
        "d",
        "case",
        "socrates",
        "main",
        "speaker",
        "asks",
        "whether",
        "mental",
        "state",
        "question",
        "something",
        "nothing",
        "interlocutor",
        "agree",
        "always",
        "something",
        "impossible",
        "state",
        "anything",
        "charmides",
        "socrates",
        "get",
        "critias",
        "agree",
        "something",
        "stronger",
        "namely",
        "many",
        "state",
        "seeing",
        "hearing",
        "form",
        "perception",
        "desire",
        "intention",
        "love",
        "fear",
        "belief",
        "must",
        "object",
        "suggests",
        "would",
        "odd",
        "knowledge",
        "like",
        "well",
        "ca",
        "regard",
        "mental",
        "state",
        "differ",
        "relative",
        "emphasizes",
        "socrates",
        "sometimes",
        "add",
        "nonintentional",
        "case",
        "sibling",
        "parent",
        "child",
        "double",
        "half",
        "order",
        "illustrate",
        "point",
        "passage",
        "socrates",
        "follows",
        "question",
        "one",
        "bearing",
        "mental",
        "state",
        "namely",
        "whether",
        "always",
        "something",
        "rather",
        "something",
        "although",
        "speaker",
        "readily",
        "agree",
        "state",
        "must",
        "always",
        "something",
        "problem",
        "intentionality",
        "already",
        "loom",
        "merely",
        "raising",
        "possibility",
        "occasion",
        "state",
        "might",
        "either",
        "case",
        "exist",
        "philebus",
        "alternative",
        "explicitly",
        "taken",
        "one",
        "believe",
        "something",
        "without",
        "belief",
        "anything",
        "ever",
        "one",
        "feel",
        "pleasure",
        "something",
        "fear",
        "anger",
        "even",
        "anything",
        "ever",
        "case",
        "belief",
        "pleasure",
        "fear",
        "said",
        "false",
        "pseudē",
        "phlbce",
        "importantly",
        "several",
        "passage",
        "socrates",
        "discus",
        "falsehood",
        "belief",
        "speech",
        "length",
        "familiar",
        "important",
        "problem",
        "need",
        "resolution",
        "cratylus",
        "socrates",
        "say",
        "great",
        "many",
        "people",
        "past",
        "present",
        "held",
        "impossible",
        "speak",
        "falsely",
        "ground",
        "impossible",
        "say",
        "something",
        "without",
        "saying",
        "something",
        "cratylus",
        "concludes",
        "case",
        "instead",
        "speaking",
        "falsely",
        "saying",
        "something",
        "speaker",
        "would",
        "simply",
        "making",
        "noise",
        "meaningful",
        "banging",
        "pot",
        "da",
        "similar",
        "puzzle",
        "false",
        "speech",
        "posed",
        "euthydemus",
        "initially",
        "brother",
        "euthydemus",
        "dionysodorus",
        "visiting",
        "tag",
        "team",
        "sophist",
        "displaying",
        "eristic",
        "prowess",
        "ee",
        "later",
        "reprised",
        "socrates",
        "attribute",
        "explicitly",
        "protagoras",
        "follower",
        "still",
        "earlier",
        "thinker",
        "explicitly",
        "extended",
        "false",
        "belief",
        "well",
        "cd",
        "version",
        "puzzle",
        "frame",
        "term",
        "whether",
        "one",
        "speak",
        "think",
        "one",
        "speak",
        "without",
        "something",
        "one",
        "saying",
        "thinking",
        "yet",
        "impossible",
        "thing",
        "speaking",
        "falsely",
        "would",
        "amount",
        "since",
        "view",
        "speaking",
        "falsely",
        "say",
        "something",
        "plato",
        "never",
        "explicitly",
        "question",
        "relational",
        "character",
        "speaking",
        "believing",
        "reject",
        "requirement",
        "relatum",
        "must",
        "exist",
        "obtain",
        "inconsistent",
        "triad",
        "considered",
        "third",
        "proposition",
        "sometimes",
        "think",
        "existobtain",
        "consistently",
        "pressure",
        "context",
        "time",
        "socrates",
        "object",
        "position",
        "would",
        "selfundermining",
        "euthyd",
        "ea",
        "though",
        "offer",
        "diagnosis",
        "puzzle",
        "false",
        "belief",
        "recurs",
        "theaetetus",
        "crucial",
        "juncture",
        "dialogue",
        "main",
        "argument",
        "socrates",
        "theaetetus",
        "rejected",
        "proposal",
        "knowledge",
        "perception",
        "underlying",
        "protagorean",
        "view",
        "whatever",
        "appears",
        "case",
        "case",
        "theaetetus",
        "new",
        "proposal",
        "knowledge",
        "true",
        "belief",
        "offer",
        "advance",
        "though",
        "unless",
        "show",
        "false",
        "belief",
        "possible",
        "sophistic",
        "puzzle",
        "like",
        "seen",
        "euthydemus",
        "socrates",
        "say",
        "often",
        "worried",
        "claim",
        "unable",
        "say",
        "false",
        "belief",
        "come",
        "be",
        "develops",
        "worry",
        "much",
        "elaborate",
        "way",
        "fuller",
        "version",
        "puzzle",
        "seen",
        "far",
        "explicitly",
        "equates",
        "believing",
        "something",
        "believing",
        "anything",
        "db",
        "socrates",
        "also",
        "introduces",
        "distinct",
        "new",
        "psychological",
        "worry",
        "consideration",
        "one",
        "assumes",
        "false",
        "belief",
        "nature",
        "certain",
        "structure",
        "namely",
        "mistaking",
        "one",
        "thing",
        "another",
        "must",
        "ask",
        "cognitive",
        "access",
        "know",
        "one",
        "neither",
        "ac",
        "socrates",
        "make",
        "underlying",
        "structure",
        "explicit",
        "go",
        "analyze",
        "false",
        "belief",
        "kind",
        "otherbelieving",
        "allodoxia",
        "say",
        "thought",
        "something",
        "one",
        "thing",
        "instead",
        "another",
        "ce",
        "analysis",
        "avoids",
        "earlier",
        "difficulty",
        "since",
        "item",
        "thing",
        "locates",
        "error",
        "latched",
        "wrong",
        "one",
        "thirdperson",
        "point",
        "view",
        "illuminating",
        "since",
        "expose",
        "precisely",
        "belief",
        "mistaken",
        "reason",
        "description",
        "unacceptable",
        "firstperson",
        "point",
        "view",
        "subject",
        "taken",
        "one",
        "socrates",
        "insists",
        "would",
        "ever",
        "say",
        "socrates",
        "theaetetus",
        "one",
        "thing",
        "something",
        "distinct",
        "ac",
        "fact",
        "plato",
        "repeatedly",
        "characterizes",
        "thinking",
        "saying",
        "something",
        "oneself",
        "dialogue",
        "ea",
        "later",
        "sophist",
        "ea",
        "analogous",
        "view",
        "also",
        "seems",
        "implicit",
        "image",
        "philebus",
        "ea",
        "internal",
        "scribe",
        "writing",
        "belief",
        "soul",
        "treatment",
        "otherbelieving",
        "theaetetus",
        "thus",
        "seems",
        "presuppose",
        "term",
        "must",
        "somehow",
        "present",
        "thought",
        "order",
        "substitution",
        "occur",
        "d",
        "possibility",
        "one",
        "might",
        "one",
        "mind",
        "perception",
        "way",
        "somehow",
        "apply",
        "wrong",
        "thing",
        "world",
        "considered",
        "even",
        "though",
        "something",
        "plato",
        "allows",
        "case",
        "incorrect",
        "name",
        "cratylus",
        "ab",
        "speaks",
        "pointing",
        "otherwise",
        "exhibiting",
        "thing",
        "applying",
        "name",
        "point",
        "theaetetus",
        "socrates",
        "proposes",
        "model",
        "false",
        "belief",
        "occur",
        "based",
        "analogy",
        "signet",
        "ring",
        "impressed",
        "wax",
        "block",
        "produce",
        "sealing",
        "similar",
        "way",
        "thought",
        "perception",
        "make",
        "impression",
        "memory",
        "leaving",
        "behind",
        "trace",
        "sign",
        "representation",
        "original",
        "object",
        "thought",
        "perceived",
        "cd",
        "cd",
        "trace",
        "deployed",
        "combination",
        "fresh",
        "perception",
        "object",
        "may",
        "may",
        "accord",
        "produce",
        "belief",
        "one",
        "trace",
        "fit",
        "incoming",
        "perception",
        "like",
        "shoe",
        "put",
        "wrong",
        "foot",
        "combination",
        "incorrect",
        "resulting",
        "belief",
        "false",
        "cb",
        "model",
        "satisfies",
        "constraint",
        "introduced",
        "earlier",
        "puzzle",
        "provides",
        "case",
        "falsehood",
        "related",
        "exclusively",
        "thing",
        "item",
        "way",
        "present",
        "thought",
        "socrates",
        "develops",
        "suggestion",
        "made",
        "rely",
        "crucially",
        "different",
        "kind",
        "cognitive",
        "access",
        "two",
        "item",
        "combined",
        "belief",
        "memory",
        "trace",
        "one",
        "hand",
        "perception",
        "cd",
        "serve",
        "explain",
        "case",
        "thought",
        "involved",
        "someone",
        "incorrectly",
        "belief",
        "sum",
        "ea",
        "enough",
        "vitiate",
        "account",
        "socrates",
        "theaetetus",
        "given",
        "false",
        "belief",
        "longer",
        "issue",
        "whether",
        "false",
        "belief",
        "possible",
        "challenge",
        "posed",
        "original",
        "puzzle",
        "whether",
        "given",
        "fully",
        "comprehensive",
        "account",
        "socrates",
        "try",
        "salvage",
        "theory",
        "proposing",
        "another",
        "model",
        "different",
        "thought",
        "compared",
        "grabbing",
        "bird",
        "aviary",
        "cd",
        "constraint",
        "introduced",
        "earlier",
        "puzzle",
        "met",
        "account",
        "seem",
        "promising",
        "taken",
        "general",
        "theory",
        "false",
        "belief",
        "soon",
        "given",
        "subjected",
        "number",
        "objection",
        "socrates",
        "return",
        "dialogue",
        "main",
        "concern",
        "knowledge",
        "theaetetus",
        "much",
        "say",
        "intentionality",
        "broadly",
        "particular",
        "intentionality",
        "perception",
        "thought",
        "combined",
        "belief",
        "dialogue",
        "attention",
        "issue",
        "limited",
        "understandably",
        "exigency",
        "main",
        "argument",
        "perception",
        "earlier",
        "dismissed",
        "position",
        "even",
        "attain",
        "truth",
        "e",
        "much",
        "le",
        "capable",
        "falsehood",
        "little",
        "said",
        "perceptual",
        "content",
        "understood",
        "final",
        "section",
        "dialogue",
        "briefly",
        "raise",
        "important",
        "problem",
        "intentionality",
        "thought",
        "however",
        "entirely",
        "distinct",
        "problem",
        "involving",
        "falsehood",
        "nonexistence",
        "one",
        "true",
        "belief",
        "something",
        "knowledge",
        "particular",
        "grasp",
        "thing",
        "differs",
        "thing",
        "socrates",
        "worry",
        "belief",
        "manage",
        "thing",
        "fact",
        "thought",
        "general",
        "characteristic",
        "shared",
        "equally",
        "thing",
        "make",
        "think",
        "theaetetus",
        "rather",
        "theodorus",
        "distant",
        "mysian",
        "saying",
        "go",
        "b",
        "especially",
        "clear",
        "statement",
        "likelihood",
        "first",
        "chisholm",
        "would",
        "later",
        "call",
        "problem",
        "objective",
        "reference",
        "reading",
        "theaetetus",
        "may",
        "well",
        "lie",
        "behind",
        "wittgenstein",
        "statement",
        "puzzle",
        "make",
        "representation",
        "representation",
        "similarity",
        "image",
        "phil",
        "invest",
        "ii",
        "iii",
        "plato",
        "offer",
        "solution",
        "puzzle",
        "falsehood",
        "sophist",
        "go",
        "unchallenged",
        "text",
        "may",
        "well",
        "regarded",
        "definitive",
        "need",
        "recent",
        "discovery",
        "plato",
        "part",
        "often",
        "assumed",
        "stumped",
        "puzzle",
        "composed",
        "earlier",
        "passage",
        "see",
        "burnyeat",
        "dialogue",
        "eleatic",
        "visitor",
        "introduces",
        "puzzle",
        "false",
        "belief",
        "speaking",
        "falsely",
        "point",
        "danger",
        "contradicting",
        "oneself",
        "invoking",
        "parmenides",
        "proscription",
        "speaking",
        "ec",
        "also",
        "insists",
        "must",
        "find",
        "way",
        "reconstruing",
        "claim",
        "show",
        "falsehood",
        "possible",
        "db",
        "without",
        "committing",
        "patricide",
        "father",
        "parmenides",
        "d",
        "subsequent",
        "solution",
        "turn",
        "recognizing",
        "complexity",
        "structure",
        "statement",
        "subject",
        "named",
        "statement",
        "said",
        "expressed",
        "predicate",
        "dd",
        "statement",
        "longer",
        "thought",
        "model",
        "name",
        "true",
        "name",
        "something",
        "is",
        "instead",
        "statement",
        "meaningful",
        "one",
        "part",
        "must",
        "successfully",
        "name",
        "something",
        "say",
        "something",
        "may",
        "either",
        "true",
        "false",
        "something",
        "analogous",
        "hold",
        "belief",
        "visitor",
        "say",
        "belief",
        "taken",
        "kind",
        "internal",
        "assertion",
        "made",
        "soul",
        "db",
        "seen",
        "several",
        "feature",
        "solution",
        "already",
        "prefigured",
        "theaetetus",
        "requirement",
        "thought",
        "speech",
        "related",
        "insight",
        "complexity",
        "statement",
        "belief",
        "allows",
        "error",
        "occur",
        "mismatch",
        "part",
        "misapplication",
        "one",
        "sophist",
        "mismatch",
        "explicitly",
        "characterized",
        "term",
        "difference",
        "thing",
        "rather",
        "simply",
        "not",
        "false",
        "statement",
        "asserts",
        "case",
        "regarding",
        "subject",
        "stating",
        "subject",
        "fact",
        "ad",
        "analysis",
        "sophist",
        "appears",
        "incomplete",
        "stand",
        "though",
        "since",
        "applies",
        "subjectpredicate",
        "sentence",
        "subject",
        "succeeds",
        "referring",
        "something",
        "e",
        "c",
        "unclear",
        "visitor",
        "would",
        "handle",
        "type",
        "statement",
        "much",
        "le",
        "negative",
        "existentials",
        "witch",
        "also",
        "give",
        "account",
        "naming",
        "nonpropositional",
        "attitude",
        "consider",
        "original",
        "challenge",
        "posed",
        "parmenides",
        "sophist",
        "namely",
        "show",
        "falsehood",
        "possible",
        "plato",
        "clearly",
        "succeeded",
        "providing",
        "answer"
    ]
}