{
    "main_text": "Varieties of Institutionalism || The Basic Structure as Coercive Legal System\n3.1 The Basic Structure as Coercive Legal System\n\nRight institutionalists have generally adopted Rawls’s\ntwo-tiered approach, arguing for a sharp distinction between domestic\nand international distributive justice. While Rawls himself did not\nsay much about why international politics was so different,\nmuch of the subsequent work by right institutionalists has been to\nfind some morally salient feature that distinguishes the domestic from\nthe international which justifies such strong differences in\ndistributive principles in the face of growing globalization,\nincreasing economic interdependence, and strengthening international\ncivil society. In order to do so, right Rawlsians have argued that the\ninternational and domestic realms differ fundamentally in terms of\npolitical structure. Kenneth Waltz describes the difference\nnicely:\n\n\nThe parts of domestic political systems stand in relations of super-\nand subordination. Some are entitled to command; others are required\nto obey. Domestic systems are centralized and hierarchic. The parts of\nthe international-political systems stand in relations of cooperation.\nFormally, each is the equal of all the others. None is entitled to\ncommand; none is required to obey. International structures are\ndecentralized and anarchic. (Waltz 1979: 88)\n\n\nMore specifically, domestic politics is characterized by the existence\nof a superior political authority that claims—and\npossesses—sovereign judicial, legislative, and executive powers.\nNo such shared, coercive legal system exists in the international\nrealm. Since the world state is, at best, a distant possibility, this\nis unlikely to change. Domestic legal systems define the very terms of\neconomic activity and represent a kind of fundamental political power\nover individuals. Samuel Freeman writes:\n\n\nWhen Rawls says that the political constitution is part of the basic\nstructure, he does not just mean the procedures that specify how laws\nare enacted and that define offices and positions of political\nauthority. He means more or less the entire legal system, including\nmost public and private law, that is the product of the constitution\nin this procedural sense. Modern legal systems, such as the federal\nsystem of the United States, are made up of countless acts of\nlegislation, administration, judicial precedent, and other legal\nrulings that are issued by multiple legal bodies with lawmaking\nauthority. An economic system that is regulated by the legal norms\nthat are issued by the political constitutions is also part of the\nbasic structure. Here, of course, the legal norms of property,\ncontract, commercial law, intangibles, and so on that are essential\nfor economic production and exchange are to be included in the basic\nstructure. What makes possible the incredibly complicated system of\nlegal norms that underlie production, exchange, and consumption is a\nunified political system that specifies these norms and revises them\nto meet changing conditions….Nothing comparable to the\nbasic structure of society exists on the global level. (Freeman\n2006: 38–39, emphasis added)\n\n\nA Canadian citizen—no matter how economically and culturally\nentwined Canada might with the United States—does not get a vote\nin American elections, and the Canadian’s economic interactions\nand relationships are regulated and governed by Canadian, not\nAmerican, law. As a consequence, the American government lacks\n“original jurisdiction or effective [or basic] political\npower” over Canadians. The Canadian citizen lacks the same\nhierarchical relationship with American political authorities that\nAmerican citizens have, except under special circumstances are that\nare themselves negotiated by Canadian and American legal authorities.\nDifferent right institutionalists emphasize different elements of the\ndomestic, coercive legal system. Matthias Risse (2006, 2012) and\nMichael Blake (2001, 2013), for example, emphasize the\ncoercive nature of domestic legal systems. Risse has argued\nthat the pervasiveness and immediacy of the coercion in domestic legal\nsystems makes them fundamentally different from the kinds of\ninteractions that occur at the international level: even international\nlaws call on the powers of the state for their enforcement. Michael\nBlake, on the other hand, emphasizes how domestic legal systems\nstructure the most basic of economic interactions, make determinate\nindividual rights, and enforce them against abuses of private power.\nHe suggests that egalitarian principles of distributive justice are\nwhat justifies the imposition of coercive political authority\non autonomous agents. Samuel Freeman argues therefore that the\ninternational system—because it lacks the features and powers of\na robust legal system—does not constitute “a system of\nsocial cooperation” and, therefore, does not invoke\nRawls’s “Criterion of Reciprocity” that underlies\nthe difference principle.\n\nBlake, Risse, and Freeman all represent—along with Rawls\nhimself—the moderate wing of right institutionalism. They are\nunited by three claims. First, the presence of a coercive legal system\nleads to more demanding requirements of egalitarian distributive\njustice. Second, the international institutions, regimes, and\norganizations do not constitute a coercive legal system. However,\nmoderates are aware of the many ways in which the international order\ncan make the world hospitable for, or hostile to, well-ordered states.\nAs a consequence, moderates argue for principles of international\ndistributive justice that assist and protect legitimate peoples, with\nthe goal of ensuring that everyone lives within a well-ordered state.\nInternational institutions don’t activate principles of justice\nthat apply directly to distributive outcomes of global trade or\neconomic activity. Rather, those principles are activated in the event\nonly insofar as member polities (peoples, states, and the like) fail\nin their own distributive requirements (such as when peoples fail to\nprevent severe poverty, violating the human rights of their citizens)\nor need assistance. Moderate Right Institutionalists share,\nthen, Rawls’s indirect account of international distributive\njustice, justifying the two-tiered account by appeal to the necessary\nrelationship between the co-membership in a coercive legal system and\ndistributive justice.\n\nMore extreme right institutionalists, most vividly\nrepresented by Thomas Nagel in his article “The Problem of\nGlobal Justice”, (2005) argue that the lack of an international\nlegal system with sovereign coercive authority does not simply\nundermine claims of egalitarian distributive justice; it undermines\nall claims of justice outside the state. So, Nagel accepts\nthe first two claims of the moderates but suggests that together they\nimply that justice is chimerical in the anarchic realm of\ninternational politics. He does accept that we have moral obligations\nto prevent people from starving, being assaulted, or murdered, but\nthese are obligations of a universal “humanitarianism”.\nJustice, for Nagel, is a moral value that is necessarily\nindexed to coercive institutions, as coercive institutions are\nnecessary for large-scale social coordination and cooperation. Claims\nof distributive justice only apply to those institutions that engage\nin such large-scale economic coordination, do so coercively, and do so\nin the name of the individuals coerced. For Nagel, that last part is\nessential: the answer to the question, “Why do we owe someone\nequal distributive shares (or equal consideration in light of the\ndifference principle)?” is “We structure their economic\nlives through coercive political institutions in their name”.\nCo-citizens have their wills invoked as shared participants in the\ncreation of distributively relevant public policy, and this invocation\ngives rise to egalitarianism. Since the international realm is\ncharacterized by institutions that do not invoke the wills of\nthose involved as a justification of coercion, justice simply fails to\napply to that realm.\n\nBoth the extreme and moderate versions of right institutionalism have\nbeen criticized, broadly, on two fronts. First, some have argued that\nthe right institutionalist focus on coercion has been misguided. If we\nstrip away coercive institutions, or were somehow able to make\ncoercive institutions non-coercive, but retained the various regimes\nof economic cooperation, we would still have obligations of\ndistributive justice. We will turn to these arguments in section 4.1.\nThe second objection is an internal critique that denies their second\nshared claim. On this objection, the international realm is a\ncoercive legal system and thereby activates principles of distributive\njustice akin to those in the domestic arena. Right institutionalism\ndepends on the coercive nature of domestic politics being different\nfrom that of international politics. Those who argue against it\nthereby try to close the gap by pointing out the many ways in which\ncoercion is deployed internationally. Cohen and Sabel (2006) argue\nthat the collective activities of various states have created an\ninternational organization (the World Trade Organization [WTO]) that\ncan essentially issue coercive threats: follow WTO or suffer\nimpoverishment as a consequence of being denied access to global\nmarkets. They write:\n\n\nStill, it might be said that any complaint against global rule-making\nbodies should really be directed against the state for accepting their\n[the World Trade Organization] directives…But this point seems\nalmost facetious. Opting out is not a real option (the WTO is a\n“take it or leave it” arrangement without even the formal\noption of picking and choosing which parts to comply with), and given\nthat it is not, and that everyone knows that it is not, there is a\ndirect rule-making relationship between the global bodies and the\ncitizens of different states. (Cohen & Sabel 2006: 168)\n\n\nEric Cavallero (2010), on the other hand, argues that the\ninternational system is coercive in a much more direct way: Great\nPowers (including and especially the United States) coercively enforce\ninternational norms of property by invading or covertly deposing\nnations that misbehave. Arash Abizadeh (2007) has emphasized the\ncoercion inherent in the maintenance of borders and territorial\nintegrity, especially in response to immigration. If states claim the\nright to determine who enters their territory, then they place\nthemselves in the position of coercing non-citizens in virtue of the\nmethods they use to prevent those who wish to cross their borders from\ndoing so. Mirian Ronzoni (2009) argues that the existence of a global\nbasic structure isn’t the right target for our theorizing; we\nought to focus instead on whether such a basic structure should be\nbrought into being in virtue of how states exercise their power over\neach other. Laura Valentini (2011), finally, argues that the distinct\nforms of coercion present at the global level give rise to distinct\nforms of moral principles; neither statists nor cosmopolitans, she\nargues, have been able to look at the global realm as its own site of\ncoercion, with the result that a “third way” between\nstatism and cosmopolitanism must be developed. In each case, the\nstructure of the objection is quite similar: states coerce via\ninvasion and espionage, via collective action through international\ninstitutions, and via border maintenance, therefore the international\nsystem is coercive in nature and, thus, appropriately calls for\negalitarian distributive justice. \n\nThese objections have forced right institutionalists to become more\nattentive to the ways in which coercive contexts can be different. As\na consequence, the responses to these objections will be complex. For\nexample, it is clear that a state requiring a citizen to purchase\nhealth insurance, stopping a non-citizen at the border, or using a\ncovert paramilitary organization to topple an unfriendly regime are\nall examples of coercion, but are they all the same type of\ncoercion and do they all subsequently demand the same\nnormative response? Furthermore, should we evaluate these coercive\nactivities in their current form—where the\ninternational world is populated by rogue states, failed and failing\nstates, and burdened societies—or should we evaluate these\ncoercive activities based on how they would operate with a genuine\nSociety of Peoples? At any rate, the debate is ongoing as right\ninstitutionalists are pushed by these objections to create more\nsophisticated accounts of coercion and to consider coercion is more\nspecific contexts (see Blake 2011; Valentini, 2011).\n",
    "section_title": "3.1 The Basic Structure as Coercive Legal System",
    "entry_title": "International Distributive Justice",
    "hierarchy_title": "International Distributive Justice || Varieties of Institutionalism || The Basic Structure as Coercive Legal System",
    "tokenized_text": [
        "variety",
        "institutionalism",
        "basic",
        "structure",
        "coercive",
        "legal",
        "system",
        "basic",
        "structure",
        "coercive",
        "legal",
        "system",
        "right",
        "institutionalists",
        "generally",
        "adopted",
        "rawls",
        "twotiered",
        "approach",
        "arguing",
        "sharp",
        "distinction",
        "domestic",
        "international",
        "distributive",
        "justice",
        "rawls",
        "say",
        "much",
        "international",
        "politics",
        "different",
        "much",
        "subsequent",
        "work",
        "right",
        "institutionalists",
        "find",
        "morally",
        "salient",
        "feature",
        "distinguishes",
        "domestic",
        "international",
        "justifies",
        "strong",
        "difference",
        "distributive",
        "principle",
        "face",
        "growing",
        "globalization",
        "increasing",
        "economic",
        "interdependence",
        "strengthening",
        "international",
        "civil",
        "society",
        "order",
        "right",
        "rawlsians",
        "argued",
        "international",
        "domestic",
        "realm",
        "differ",
        "fundamentally",
        "term",
        "political",
        "structure",
        "kenneth",
        "waltz",
        "describes",
        "difference",
        "nicely",
        "part",
        "domestic",
        "political",
        "system",
        "stand",
        "relation",
        "super",
        "subordination",
        "entitled",
        "command",
        "others",
        "required",
        "obey",
        "domestic",
        "system",
        "centralized",
        "hierarchic",
        "part",
        "internationalpolitical",
        "system",
        "stand",
        "relation",
        "cooperation",
        "formally",
        "equal",
        "others",
        "none",
        "entitled",
        "command",
        "none",
        "required",
        "obey",
        "international",
        "structure",
        "decentralized",
        "anarchic",
        "waltz",
        "specifically",
        "domestic",
        "politics",
        "characterized",
        "existence",
        "superior",
        "political",
        "authority",
        "claimsand",
        "possessessovereign",
        "judicial",
        "legislative",
        "executive",
        "power",
        "shared",
        "coercive",
        "legal",
        "system",
        "exists",
        "international",
        "realm",
        "since",
        "world",
        "state",
        "best",
        "distant",
        "possibility",
        "unlikely",
        "change",
        "domestic",
        "legal",
        "system",
        "define",
        "term",
        "economic",
        "activity",
        "represent",
        "kind",
        "fundamental",
        "political",
        "power",
        "individual",
        "samuel",
        "freeman",
        "writes",
        "rawls",
        "say",
        "political",
        "constitution",
        "part",
        "basic",
        "structure",
        "mean",
        "procedure",
        "specify",
        "law",
        "enacted",
        "define",
        "office",
        "position",
        "political",
        "authority",
        "mean",
        "le",
        "entire",
        "legal",
        "system",
        "including",
        "public",
        "private",
        "law",
        "product",
        "constitution",
        "procedural",
        "sense",
        "modern",
        "legal",
        "system",
        "federal",
        "system",
        "united",
        "state",
        "made",
        "countless",
        "act",
        "legislation",
        "administration",
        "judicial",
        "precedent",
        "legal",
        "ruling",
        "issued",
        "multiple",
        "legal",
        "body",
        "lawmaking",
        "authority",
        "economic",
        "system",
        "regulated",
        "legal",
        "norm",
        "issued",
        "political",
        "constitution",
        "also",
        "part",
        "basic",
        "structure",
        "course",
        "legal",
        "norm",
        "property",
        "contract",
        "commercial",
        "law",
        "intangible",
        "essential",
        "economic",
        "production",
        "exchange",
        "included",
        "basic",
        "structure",
        "make",
        "possible",
        "incredibly",
        "complicated",
        "system",
        "legal",
        "norm",
        "underlie",
        "production",
        "exchange",
        "consumption",
        "unified",
        "political",
        "system",
        "specifies",
        "norm",
        "revise",
        "meet",
        "changing",
        "conditionsnothing",
        "comparable",
        "basic",
        "structure",
        "society",
        "exists",
        "global",
        "level",
        "freeman",
        "emphasis",
        "added",
        "canadian",
        "citizenno",
        "matter",
        "economically",
        "culturally",
        "entwined",
        "canada",
        "might",
        "united",
        "statesdoes",
        "get",
        "vote",
        "american",
        "election",
        "canadian",
        "economic",
        "interaction",
        "relationship",
        "regulated",
        "governed",
        "canadian",
        "american",
        "law",
        "consequence",
        "american",
        "government",
        "lack",
        "original",
        "jurisdiction",
        "effective",
        "basic",
        "political",
        "power",
        "canadian",
        "canadian",
        "citizen",
        "lack",
        "hierarchical",
        "relationship",
        "american",
        "political",
        "authority",
        "american",
        "citizen",
        "except",
        "special",
        "circumstance",
        "negotiated",
        "canadian",
        "american",
        "legal",
        "authority",
        "different",
        "right",
        "institutionalists",
        "emphasize",
        "different",
        "element",
        "domestic",
        "coercive",
        "legal",
        "system",
        "matthias",
        "risse",
        "michael",
        "blake",
        "example",
        "emphasize",
        "coercive",
        "nature",
        "domestic",
        "legal",
        "system",
        "risse",
        "argued",
        "pervasiveness",
        "immediacy",
        "coercion",
        "domestic",
        "legal",
        "system",
        "make",
        "fundamentally",
        "different",
        "kind",
        "interaction",
        "occur",
        "international",
        "level",
        "even",
        "international",
        "law",
        "call",
        "power",
        "state",
        "enforcement",
        "michael",
        "blake",
        "hand",
        "emphasizes",
        "domestic",
        "legal",
        "system",
        "structure",
        "basic",
        "economic",
        "interaction",
        "make",
        "determinate",
        "individual",
        "right",
        "enforce",
        "abuse",
        "private",
        "power",
        "suggests",
        "egalitarian",
        "principle",
        "distributive",
        "justice",
        "justifies",
        "imposition",
        "coercive",
        "political",
        "authority",
        "autonomous",
        "agent",
        "samuel",
        "freeman",
        "argues",
        "therefore",
        "international",
        "systembecause",
        "lack",
        "feature",
        "power",
        "robust",
        "legal",
        "systemdoes",
        "constitute",
        "system",
        "social",
        "cooperation",
        "therefore",
        "invoke",
        "rawls",
        "criterion",
        "reciprocity",
        "underlies",
        "difference",
        "principle",
        "blake",
        "risse",
        "freeman",
        "representalong",
        "rawls",
        "himselfthe",
        "moderate",
        "wing",
        "right",
        "institutionalism",
        "united",
        "three",
        "claim",
        "first",
        "presence",
        "coercive",
        "legal",
        "system",
        "lead",
        "demanding",
        "requirement",
        "egalitarian",
        "distributive",
        "justice",
        "second",
        "international",
        "institution",
        "regime",
        "organization",
        "constitute",
        "coercive",
        "legal",
        "system",
        "however",
        "moderate",
        "aware",
        "many",
        "way",
        "international",
        "order",
        "make",
        "world",
        "hospitable",
        "hostile",
        "wellordered",
        "state",
        "consequence",
        "moderate",
        "argue",
        "principle",
        "international",
        "distributive",
        "justice",
        "assist",
        "protect",
        "legitimate",
        "people",
        "goal",
        "ensuring",
        "everyone",
        "life",
        "within",
        "wellordered",
        "state",
        "international",
        "institution",
        "activate",
        "principle",
        "justice",
        "apply",
        "directly",
        "distributive",
        "outcome",
        "global",
        "trade",
        "economic",
        "activity",
        "rather",
        "principle",
        "activated",
        "event",
        "insofar",
        "member",
        "polity",
        "people",
        "state",
        "like",
        "fail",
        "distributive",
        "requirement",
        "people",
        "fail",
        "prevent",
        "severe",
        "poverty",
        "violating",
        "human",
        "right",
        "citizen",
        "need",
        "assistance",
        "moderate",
        "right",
        "institutionalists",
        "share",
        "rawls",
        "indirect",
        "account",
        "international",
        "distributive",
        "justice",
        "justifying",
        "twotiered",
        "account",
        "appeal",
        "necessary",
        "relationship",
        "comembership",
        "coercive",
        "legal",
        "system",
        "distributive",
        "justice",
        "extreme",
        "right",
        "institutionalists",
        "vividly",
        "represented",
        "thomas",
        "nagel",
        "article",
        "problem",
        "global",
        "justice",
        "argue",
        "lack",
        "international",
        "legal",
        "system",
        "sovereign",
        "coercive",
        "authority",
        "simply",
        "undermine",
        "claim",
        "egalitarian",
        "distributive",
        "justice",
        "undermines",
        "claim",
        "justice",
        "outside",
        "state",
        "nagel",
        "accepts",
        "first",
        "two",
        "claim",
        "moderate",
        "suggests",
        "together",
        "imply",
        "justice",
        "chimerical",
        "anarchic",
        "realm",
        "international",
        "politics",
        "accept",
        "moral",
        "obligation",
        "prevent",
        "people",
        "starving",
        "assaulted",
        "murdered",
        "obligation",
        "universal",
        "humanitarianism",
        "justice",
        "nagel",
        "moral",
        "value",
        "necessarily",
        "indexed",
        "coercive",
        "institution",
        "coercive",
        "institution",
        "necessary",
        "largescale",
        "social",
        "coordination",
        "cooperation",
        "claim",
        "distributive",
        "justice",
        "apply",
        "institution",
        "engage",
        "largescale",
        "economic",
        "coordination",
        "coercively",
        "name",
        "individual",
        "coerced",
        "nagel",
        "last",
        "part",
        "essential",
        "answer",
        "question",
        "owe",
        "someone",
        "equal",
        "distributive",
        "share",
        "equal",
        "consideration",
        "light",
        "difference",
        "principle",
        "structure",
        "economic",
        "life",
        "coercive",
        "political",
        "institution",
        "name",
        "cocitizens",
        "will",
        "invoked",
        "shared",
        "participant",
        "creation",
        "distributively",
        "relevant",
        "public",
        "policy",
        "invocation",
        "give",
        "rise",
        "egalitarianism",
        "since",
        "international",
        "realm",
        "characterized",
        "institution",
        "invoke",
        "will",
        "involved",
        "justification",
        "coercion",
        "justice",
        "simply",
        "fails",
        "apply",
        "realm",
        "extreme",
        "moderate",
        "version",
        "right",
        "institutionalism",
        "criticized",
        "broadly",
        "two",
        "front",
        "first",
        "argued",
        "right",
        "institutionalist",
        "focus",
        "coercion",
        "misguided",
        "strip",
        "away",
        "coercive",
        "institution",
        "somehow",
        "able",
        "make",
        "coercive",
        "institution",
        "noncoercive",
        "retained",
        "various",
        "regime",
        "economic",
        "cooperation",
        "would",
        "still",
        "obligation",
        "distributive",
        "justice",
        "turn",
        "argument",
        "section",
        "second",
        "objection",
        "internal",
        "critique",
        "denies",
        "second",
        "shared",
        "claim",
        "objection",
        "international",
        "realm",
        "coercive",
        "legal",
        "system",
        "thereby",
        "activates",
        "principle",
        "distributive",
        "justice",
        "akin",
        "domestic",
        "arena",
        "right",
        "institutionalism",
        "depends",
        "coercive",
        "nature",
        "domestic",
        "politics",
        "different",
        "international",
        "politics",
        "argue",
        "thereby",
        "try",
        "close",
        "gap",
        "pointing",
        "many",
        "way",
        "coercion",
        "deployed",
        "internationally",
        "cohen",
        "sabel",
        "argue",
        "collective",
        "activity",
        "various",
        "state",
        "created",
        "international",
        "organization",
        "world",
        "trade",
        "organization",
        "wto",
        "essentially",
        "issue",
        "coercive",
        "threat",
        "follow",
        "wto",
        "suffer",
        "impoverishment",
        "consequence",
        "denied",
        "access",
        "global",
        "market",
        "write",
        "still",
        "might",
        "said",
        "complaint",
        "global",
        "rulemaking",
        "body",
        "really",
        "directed",
        "state",
        "accepting",
        "world",
        "trade",
        "organization",
        "directivesbut",
        "point",
        "seems",
        "almost",
        "facetious",
        "opting",
        "real",
        "option",
        "wto",
        "take",
        "leave",
        "arrangement",
        "without",
        "even",
        "formal",
        "option",
        "picking",
        "choosing",
        "part",
        "comply",
        "given",
        "everyone",
        "know",
        "direct",
        "rulemaking",
        "relationship",
        "global",
        "body",
        "citizen",
        "different",
        "state",
        "cohen",
        "sabel",
        "eric",
        "cavallero",
        "hand",
        "argues",
        "international",
        "system",
        "coercive",
        "much",
        "direct",
        "way",
        "great",
        "power",
        "including",
        "especially",
        "united",
        "state",
        "coercively",
        "enforce",
        "international",
        "norm",
        "property",
        "invading",
        "covertly",
        "deposing",
        "nation",
        "misbehave",
        "arash",
        "abizadeh",
        "emphasized",
        "coercion",
        "inherent",
        "maintenance",
        "border",
        "territorial",
        "integrity",
        "especially",
        "response",
        "immigration",
        "state",
        "claim",
        "right",
        "determine",
        "enters",
        "territory",
        "place",
        "position",
        "coercing",
        "noncitizens",
        "virtue",
        "method",
        "use",
        "prevent",
        "wish",
        "cross",
        "border",
        "mirian",
        "ronzoni",
        "argues",
        "existence",
        "global",
        "basic",
        "structure",
        "right",
        "target",
        "theorizing",
        "ought",
        "focus",
        "instead",
        "whether",
        "basic",
        "structure",
        "brought",
        "virtue",
        "state",
        "exercise",
        "power",
        "laura",
        "valentini",
        "finally",
        "argues",
        "distinct",
        "form",
        "coercion",
        "present",
        "global",
        "level",
        "give",
        "rise",
        "distinct",
        "form",
        "moral",
        "principle",
        "neither",
        "statists",
        "cosmopolitan",
        "argues",
        "able",
        "look",
        "global",
        "realm",
        "site",
        "coercion",
        "result",
        "third",
        "way",
        "statism",
        "cosmopolitanism",
        "must",
        "developed",
        "case",
        "structure",
        "objection",
        "quite",
        "similar",
        "state",
        "coerce",
        "via",
        "invasion",
        "espionage",
        "via",
        "collective",
        "action",
        "international",
        "institution",
        "via",
        "border",
        "maintenance",
        "therefore",
        "international",
        "system",
        "coercive",
        "nature",
        "thus",
        "appropriately",
        "call",
        "egalitarian",
        "distributive",
        "justice",
        "objection",
        "forced",
        "right",
        "institutionalists",
        "become",
        "attentive",
        "way",
        "coercive",
        "context",
        "different",
        "consequence",
        "response",
        "objection",
        "complex",
        "example",
        "clear",
        "state",
        "requiring",
        "citizen",
        "purchase",
        "health",
        "insurance",
        "stopping",
        "noncitizen",
        "border",
        "using",
        "covert",
        "paramilitary",
        "organization",
        "topple",
        "unfriendly",
        "regime",
        "example",
        "coercion",
        "type",
        "coercion",
        "subsequently",
        "demand",
        "normative",
        "response",
        "furthermore",
        "evaluate",
        "coercive",
        "activity",
        "current",
        "formwhere",
        "international",
        "world",
        "populated",
        "rogue",
        "state",
        "failed",
        "failing",
        "state",
        "burdened",
        "societiesor",
        "evaluate",
        "coercive",
        "activity",
        "based",
        "would",
        "operate",
        "genuine",
        "society",
        "people",
        "rate",
        "debate",
        "ongoing",
        "right",
        "institutionalists",
        "pushed",
        "objection",
        "create",
        "sophisticated",
        "account",
        "coercion",
        "consider",
        "coercion",
        "specific",
        "context",
        "see",
        "blake",
        "valentini"
    ]
}