{
    "main_text": "Meta-mathematics || Formalization of the Creating Subject\n5.4 Formalization of the Creating Subject\n\nThe Creating Subject, introduced in Section 2.2, can generate choice\nsequences, which are some of the most important and complicated\nmathematical entities of Brouwer’s Intuitionism. Several\nphilosophers and mathematicians have tried to develop the theory of\nthe Creating Subject further mathematically as well as\nphilosophically. \n\nIn the formalization of the notion of the Creating Subject its\ntemporal aspect is formalized using the notation \\(\\Box_n A\\), that\ndenotes that the Creating Subject has a proof of A at time n (in some\nother formulations: experiences the truth of \\(A\\) at time \\(n\\)).\nGeorg Kreisel (1967) introduced the following three axioms for the\nCreating Subject, which taken together are denoted by CS:\n\n\\[\\begin{align}\n\\tag{\\({\\bf CS1}\\)}\n& \\Box_n A \\vee \\neg \\Box_n A \\\\ \n& \\mbox{(at time \\(n\\), it can be decided whether the Creating Subject} \\\\ \n& \\mbox{ has a proof of A)} \\\\ \n\\tag{\\({\\bf CS2}\\)}\n& \\Box_m A \\rightarrow \\Box_{m+n}A \\\\ \n& \\mbox{(the Creating Subject never forgets what it has proven)} \\\\ \n\\tag{\\({\\bf CS3}\\)}\n& (\\exists n \\Box_n A \\rightarrow A) \\wedge (A \\rightarrow \\neg\\neg \\exists n \\Box_n A)\\\\ \n& \\mbox{(the Creating Subject only proves what is true and no} \\\\ \n& \\mbox{ true statement can be impossible to prove for the} \\\\ \n& \\mbox{ Creating Subject)}\\\\\n\\end{align}\\]\n\n\nIn the version of Anne Troelstra (1969) the last axiom is strengthened\nto  \n\n\\[\\begin{align}\n\\tag{\\({\\bf CS3}^+\\)}\n& \\exists n \\Box_n A \\leftrightarrow A \\\\ \n& \\mbox{(the Creating Subject only proves what is true and what} \\\\ \n& \\mbox{ is true will be proved by the Creating Subject at some} \\\\\n& \\mbox{ point)}\n\\end{align}\\]\n\n\nThe first axiom CS1 is uncontroversial: at any point in time,\nit can be established whether the Creating Subject has a proof of a\ngiven statement or not. The second axiom CS2 clearly uses the\nfact that the Creating Subject is an idealization since it expresses\nthat proofs will always be remembered. The last axiom CS3 is\nthe most disputed part of the formalization of the Creating Subject,\nor better, its second conjunct \\((A \\rightarrow \\neg\\neg\\exists n\\Box_n A)\\)\nis, which was given the name Axiom of Christian Charity by\nKreisel. Göran Sundholm (2014), for example, argues that Axiom of\nChristian Charity is not acceptable from a constructive point of view.\nAnd Gödel’s incompleteness theorem even implies that the\nprinciple is false when \\(\\Box_n A\\) would be interpreted as being\nprovable in a sufficiently strong proof system, which, however, is\ncertainly not the interpretation that Brouwer had in mind. \n\nGiven a statement \\(A\\) that does not contain any reference to time,\ni.e. no occurrence of \\(\\Box_n\\), one can define a choice sequence\naccording to the following rule (Brouwer 1953):  \n\n\\[\n  \\alpha (n) = \\left\\{ \\begin{array}{ll}\n                 0 & \\mbox{ if \\(\\neg \\Box_n A\\)} \\\\\n                 1 & \\mbox{ if \\(\\Box_n A\\). } \n                \\end{array}  \\right.\n\\]\n\n\nFrom this follows the principle known as Kripke’s Schema\nKS, introduced in Section 2.2, a principle that unlike the\naxioms of the theory of the Creating Subject, contains no explicit\nreference to time: \\(\\exists \\alpha (A \\leftrightarrow \\exists n\n\\alpha(n) = 1)\\).\n\nUsing Kripke’s Schema, the weak counter example arguments can be\nexpressed formally without any reference to the Creating Subject. The\nfollowing example is taken from (van Atten 2018). Let A be a statement\nfor which at present \\(\\neg A \\vee \\neg\\neg A\\) is not known to hold.\nUsing KS one obtains choice sequences \\(\\alpha_1\\) and\n\\(\\alpha_2\\) such that  \n\n\\[ \\neg A \\leftrightarrow \\exists n \\alpha_1(n) = 1 \\ \\ \\ \\ \\neg\\neg A\n \\leftrightarrow \\exists n \\alpha_2(n) = 1.  \\]\n\n\nAssociate with these two sequences the real numbers \\(r_0\\) and\n\\(r_1\\), where for \\(i=0,1\\):  \n\n\\[\nr_i(n) = \n  \\begin{cases}\n    0            & \\text{ if \\(\\alpha_i(n)\\neq 1\\)} \\\\\n    (-1)^i2^{-m} & \\begin{align} &\\text{if for some \\(m\\leq n\\), \\(\\alpha_i(m)=1\\) and } \\\\\n                                     &  \\text{for no \\(k \\lt m\\), \\(\\alpha_i(k)=1.\\)} \n                       \\end{align}\n  \\end{cases}\n\\]\n\n\nThen for \\(r=r_0 + r_1\\), statement \\(\\neg A \\vee \\neg\\neg A\\) is\nimplied by \\((r\\gt 0\\vee r\\lt 0)\\), which shows that \\((r\\gt 0\\vee\nr\\lt 0)\\) cannot be proved. \n\nIn (van Dalen 1978) a model is constructed of the axioms for the\nCreating Subject in the context of arithmetic and choice sequences,\nthus proving them to be consistent with intuitionistic arithmetic and\ncertain parts of analysis. In (van Dalen 1982), CS is proven to\nbe conservative over Heyting Arithmetic. Mathematical consequences of\nKripke’s Schema can be found in (van Dalen 1997), where it is\nshown that KS and the continuity axioms reject Markov’s\nprinciple, while KS together with Markov’s principle\nimplies the principle of the excluded middle. \n\nKripke has shown that KS implies the existence of nonrecursive\nfunctions, a result not published by him but by Kreisel (1970).\nClearly, this implies that the theory CS also implies the\nexistence of a nonrecursive function. A possible argument for\nCS runs as follows. Suppose \\(X\\) is a noncomputable but\ncomputably enumerable set and define the function \\(f\\) as\nfollows: \n\n\\[\n f(m,n) = \n  \\begin{cases}\n    0 & \\text{ if not \\(\\Box_m (n \\not\\in X)\\)} \\\\\n    1 & \\text{ if \\(\\Box_m (n \\not\\in X)\\).} \n  \\end{cases}\n\\]\n\n\nThen it follows that \\(n\\not\\in X\\) if and only if \\(f(m,n)=1\\) for\nsome natural number \\(m\\), which implies that \\(f\\) cannot be\ncomputable. For if so, the complement of \\(X\\) would be computably\nenumerable, implying the computability of \\(X\\). Since \\(f\\) is a\nfunction from the intuitionistic point of view, this establishes that\nin Intuitionism not all functions are computable. \n5.5 Foundations\n\nFormalizations that are meant to serve as a foundation for\nconstructive mathematics are either of a set-theoretic (Aczel 1978,\nMyhill 1975) or type-theoretic (Martin-Löf 1984) nature. The\nformer theories are adaptations of Zermelo-Fraenkel set theory to a\nconstructive setting, while in type theory the constructions implicit\nin constructive statements are made explicit in the system. Set theory\ncould be viewed as an extensional foundation of mathematics whereas\ntype theory is in general an intensional one. \n\nIn recent years many models of parts of such foundational theories for\nintuitionistic mathematics have appeared, some of them have been\nmentioned above. Especially in topos theory (van Oosten 2008) there\nare many models that capture certain characteristics of intuitionism.\nThere are, for example, topoi in which all total real functions are\ncontinuous. Functional interpretations such as realizability as well\nas interpretations in type theory could also be viewed as models of\nintuitionistic mathematics and most other constructive theories.\n5.6 Reverse mathematics\n\nIn reverse mathematics one tries to establish for mathematical\ntheorems which axioms are needed to prove them. In intuitionistic\nreverse mathematics one has a similar aim, but then with respect to\nintuitionistic theorems: working over a weak intuitionistic theory,\naxioms and theorems are compared to each other. The typical axioms\nwith which one wishes theorems to compare are the fan principle and\nthe bar principle, Kripke’s schema and the continuity\naxioms.\n\nIn (Veldman 2011), equivalents of the fan principle over a basic\ntheory called Basic Intuitionistic Mathematics are studied. It is\nshown that the fan principle is equivalent to the statement that the\nunit interval [0,1] has the Heine-Borel property, and from this many\nother equivalents are derived. In (Veldman 2009), the fan principle is\nshown to also be equivalent to Brouwer’s Approximate Fixed-Point\nTheorem. In (Lubarsky et al. 2012), reverse mathematics is applied to\na form of Kripke’s schema, which is shown to be equivalent to\ncertain topological statements.\n\nThere are many more of such examples from intuitionistic reverse\nmathematics. Especially in the larger field of constructive reverse\nmathematics there are many results of this nature that are also\nrelevant from the intuitionistic point of view.\n6. Philosophy\n\nBrouwer build his Intuitionism from the ground up and did\nnot comment much on the relation between Intuitionism and other\nexisting philosophies, but others after him did. Some of these\nconnections are discussed in this section, in particular the way in\nwhich intuitionistic principles can be justified in terms of other\nphilosophies.\n6.1 Phenomenology\n\nThe connection between Intuitionism and Phenomenology, the philosophy\ndeveloped by Edmund Husserl, has been investigated by several authors,\nduring Brouwer’s lifetime as well as decades later. Hermann Weyl\nwas among the first to discuss the relation between Brouwer’s\nideas and the phenomenological view on mathematics. Like Brouwer, Weyl\nspeaks in his book Das Kontinuum (Chapter 2) about the\nintuitive continuum, but Weyl’s notion is based on the\nphenomenology of (the consciousness of) time. Weyl later feels that\nBrouwer’s development of real analysis is more faithful to the\nidea of the intuitive continuum than his own (Weyl 1921) and therefore\nplaces himself at Brouwer’s side, at least regarding this aspect\n(van Atten 2002).\n\nVan Atten (2003 en 2007) uses phenomenology to justify choice\nsequences as mathematical objects. The author (2002) is critical about\nBrouwer’s justification of choice sequences, which is the motive\nto look for a philosophical justification elsewhere. Choice sequences\noccur in the work of Becker (1927) and Weyl, but they differ from\nBrouwer’s notion, and Husserl never discussed choice sequences\npublicly. Van Atten explains how the homogeneity of the\ncontinuum accounts for its inexhaustibility and nonatomicity, two key\nproperties of the intuitive continuum according to Brouwer. Using the\nfact that these two essential properties are present in the definition\nof choice sequences, one arrives at a phenomenological justification\nof them. \n6.2 Wittgenstein\n\nOn March 10, 1928, Brouwer lectured in Vienna on his intuitionistic\nfoundations of mathematics. Ludwig Wittgenstein attended that lecture,\npersuaded by Herbert Feigl, who afterwards wrote about the hours he\nspent with Wittgenstein and others after the lecture: a great\nevent took place. Suddenly and very volubly Wittgenstein began talking\nphilosophy – at great length. Perhaps this was the turning\npoint, for ever since that time, 1929, when he moved to Cambridge\nUniversity, Wittgenstein was a philosopher again, and began to exert a\ntremendous influence.\n\nOthers dispute that Brouwer’s lecture influenced\nWittgenstein’s thinking (Hacker 1986, Hintikka 1992, Marion\n2003). In how far, if at all, Wittgenstein was influenced by\nBrouwer’s ideas is not entirely clear, but there certainly are\ninteresting agreements and disagreements between their views. Marion\n(2003) argues that Wittgenstein’s conception of mathematics as\ndescribed in the Tractatus is very close to that of Brouwer, and that\nWittgenstein agrees with the rejection of the Law of Excluded Middle\n(1929 manuscript, pp 155–156 in Wittgenstein 1994) but disagrees\nwith Brouwer’s arguments against it. Marion (2003) claims that\nWittgenstein’s stance is more radical than Brouwer’s in\nthat in the former’s view the lack of validity of the Law of\nExcluded Middle in mathematics is a distinguishing feature of all\nmathematical propositions (as opposed to empirical propositions) and\nnot only a particularity of the mathematics of the infinite, as it is\nfor Brouwer.\n\nVeldman (forthcoming) discusses several points of (dis)agreement between\nBrouwer and Wittgenstein, such as the danger of logic, which,\naccording to both, may lead to constructions without mathematical\ncontent. One of the disagreements raised in the paper concerns\nWittgenstein’s view that mathematics is a common undertaking,\nwhich is in stark contrast to Brouwer’s Creating Subject and his\nview that mathematics is a languageless activity. \n6.3 Dummett\n\nThe British philosopher Michael Dummett (1975) developed a\nphilosophical basis for Intuitionism, in particular for intuitionistic\nlogic. Dummett explicitly states that his theory is not an exegesis of\nBrouwer’s work, but a possible philosophical theory for (in his\nwords) repudiating classical reasoning in mathematics in favor of\nintuitionistic reasoning.\n\nDummett’s approach starts with the idea that the choice for one\nlogic over another must necessarily lie in the meaning one attaches to\nlogical statements. In the theory of meaning that Dummett uses, which\nis based on Wittgenstein’s ideas about language and in\nparticular on his idea that meaning is use, the meaning of a\nsentence is determined by the way in which the sentence is used. The\nmeaning of a mathematical statement manifests itself in the use made\nof it, and the understanding of it is the knowledge of the\ncapacity to use the statement. This view is supported by the way in\nwhich we acquire mathematical knowledge. When we learn a mathematical\nnotion we learn how to use it: how to compute it, prove it or infer\nfrom it. And the only way to establish that we have grasped the\nmeaning of a mathematical statement lies in our proficiency in making\ncorrect use of the statement. \n\nGiven this view on meaning, the central notion in the theory of\nmeaning for mathematics is not, as in Platonism, truth, but\nproof; the understanding of a mathematical statement consists\nin the ability to recognize a proof of it when one is presented with\none. This then, as Dummett argues, leads to the adoption of\nintuitionistic logic as the logic of mathematical reasoning. \n\nInterestingly, as Dummett (1975) remarks himself, his theory of\nmeaning is far apart from Brouwer’s ideas on mathematics as an\nessentially languageless activity. So that there are at least two\nquite different lines of thought that lead to the adoption of\nintuitionistic logic over classical logic, the one developed by\nBrouwer and the one argued for by Dummett. Dummett’s work on\nIntuitionism has been commented on by various philosophers such as Dag\nPrawitz (1977), Parsons (1986) and Richard Tieszen (1994 en 2000). \n6.4 Finitism\n\nVarious forms of Finitism are based on a similar view as the\none expressed by Dummett, but in which the constructions that are\nallowed to prove mathematical statements are required to exist not\nonly in principle, but also in practice. Depending on the the precise\nimplementation of the latter notion one arrives at different forms of\nFinitism, such as the Ultra-Intuitionism developed by\nAlexander Yessenin-Volpin (1970) and the Strict Finitism\ndeveloped by Crispin Wright (1982).",
    "section_title": "5.4 Formalization of the Creating Subject",
    "entry_title": "Intuitionism in the Philosophy of Mathematics",
    "hierarchy_title": "Intuitionism in the Philosophy of Mathematics || Meta-mathematics || Formalization of the Creating Subject",
    "tokenized_text": [
        "metamathematics",
        "formalization",
        "creating",
        "subject",
        "formalization",
        "creating",
        "subject",
        "creating",
        "subject",
        "introduced",
        "section",
        "generate",
        "choice",
        "sequence",
        "important",
        "complicated",
        "mathematical",
        "entity",
        "brouwer",
        "intuitionism",
        "several",
        "philosopher",
        "mathematician",
        "tried",
        "develop",
        "theory",
        "creating",
        "subject",
        "mathematically",
        "well",
        "philosophically",
        "formalization",
        "notion",
        "creating",
        "subject",
        "temporal",
        "aspect",
        "formalized",
        "using",
        "notation",
        "box_n",
        "a",
        "denotes",
        "creating",
        "subject",
        "proof",
        "time",
        "n",
        "formulation",
        "experience",
        "truth",
        "a",
        "time",
        "n",
        "georg",
        "kreisel",
        "introduced",
        "following",
        "three",
        "axiom",
        "creating",
        "subject",
        "taken",
        "together",
        "denoted",
        "c",
        "begin",
        "align",
        "tag",
        "bf",
        "cs",
        "box_n",
        "vee",
        "neg",
        "box_n",
        "mbox",
        "time",
        "n",
        "decided",
        "whether",
        "creating",
        "subject",
        "mbox",
        "proof",
        "tag",
        "bf",
        "cs",
        "box_m",
        "rightarrow",
        "box_",
        "mn",
        "mbox",
        "creating",
        "subject",
        "never",
        "forgets",
        "proven",
        "tag",
        "bf",
        "cs",
        "exists",
        "n",
        "box_n",
        "rightarrow",
        "wedge",
        "rightarrow",
        "negneg",
        "exists",
        "n",
        "box_n",
        "mbox",
        "creating",
        "subject",
        "prof",
        "true",
        "mbox",
        "true",
        "statement",
        "impossible",
        "prove",
        "mbox",
        "creating",
        "subject",
        "end",
        "align",
        "version",
        "anne",
        "troelstra",
        "last",
        "axiom",
        "strengthened",
        "begin",
        "align",
        "tag",
        "bf",
        "cs",
        "exists",
        "n",
        "box_n",
        "leftrightarrow",
        "mbox",
        "creating",
        "subject",
        "prof",
        "true",
        "mbox",
        "true",
        "proved",
        "creating",
        "subject",
        "mbox",
        "point",
        "end",
        "align",
        "first",
        "axiom",
        "cs",
        "uncontroversial",
        "point",
        "time",
        "established",
        "whether",
        "creating",
        "subject",
        "proof",
        "given",
        "statement",
        "second",
        "axiom",
        "cs",
        "clearly",
        "us",
        "fact",
        "creating",
        "subject",
        "idealization",
        "since",
        "express",
        "proof",
        "always",
        "remembered",
        "last",
        "axiom",
        "cs",
        "disputed",
        "part",
        "formalization",
        "creating",
        "subject",
        "better",
        "second",
        "conjunct",
        "rightarrow",
        "negnegexists",
        "nbox_n",
        "given",
        "name",
        "axiom",
        "christian",
        "charity",
        "kreisel",
        "göran",
        "sundholm",
        "example",
        "argues",
        "axiom",
        "christian",
        "charity",
        "acceptable",
        "constructive",
        "point",
        "view",
        "gödel",
        "incompleteness",
        "theorem",
        "even",
        "implies",
        "principle",
        "false",
        "box_n",
        "a",
        "would",
        "interpreted",
        "provable",
        "sufficiently",
        "strong",
        "proof",
        "system",
        "however",
        "certainly",
        "interpretation",
        "brouwer",
        "mind",
        "given",
        "statement",
        "a",
        "contain",
        "reference",
        "time",
        "ie",
        "occurrence",
        "box_n",
        "one",
        "define",
        "choice",
        "sequence",
        "according",
        "following",
        "rule",
        "brouwer",
        "alpha",
        "n",
        "left",
        "begin",
        "array",
        "mbox",
        "neg",
        "box_n",
        "a",
        "mbox",
        "box_n",
        "a",
        "end",
        "array",
        "right",
        "follows",
        "principle",
        "known",
        "kripke",
        "schema",
        "k",
        "introduced",
        "section",
        "principle",
        "unlike",
        "axiom",
        "theory",
        "creating",
        "subject",
        "contains",
        "explicit",
        "reference",
        "time",
        "exists",
        "alpha",
        "leftrightarrow",
        "exists",
        "n",
        "alpha",
        "n",
        "using",
        "kripke",
        "schema",
        "weak",
        "counter",
        "example",
        "argument",
        "expressed",
        "formally",
        "without",
        "reference",
        "creating",
        "subject",
        "following",
        "example",
        "taken",
        "van",
        "atten",
        "let",
        "statement",
        "present",
        "neg",
        "vee",
        "negneg",
        "a",
        "known",
        "hold",
        "using",
        "k",
        "one",
        "obtains",
        "choice",
        "sequence",
        "alpha_",
        "alpha_",
        "neg",
        "leftrightarrow",
        "exists",
        "n",
        "alpha_",
        "n",
        "negneg",
        "leftrightarrow",
        "exists",
        "n",
        "alpha_",
        "n",
        "associate",
        "two",
        "sequence",
        "real",
        "number",
        "r_",
        "r_",
        "i",
        "r_i",
        "n",
        "begin",
        "case",
        "text",
        "alpha_i",
        "n",
        "neq",
        "i",
        "m",
        "begin",
        "align",
        "text",
        "mleq",
        "n",
        "alpha_i",
        "text",
        "k",
        "lt",
        "m",
        "alpha_i",
        "k",
        "end",
        "align",
        "end",
        "case",
        "rr_",
        "r_",
        "statement",
        "neg",
        "vee",
        "negneg",
        "a",
        "implied",
        "rgt",
        "vee",
        "rlt",
        "show",
        "rgt",
        "vee",
        "rlt",
        "proved",
        "van",
        "dalen",
        "model",
        "constructed",
        "axiom",
        "creating",
        "subject",
        "context",
        "arithmetic",
        "choice",
        "sequence",
        "thus",
        "proving",
        "consistent",
        "intuitionistic",
        "arithmetic",
        "certain",
        "part",
        "analysis",
        "van",
        "dalen",
        "c",
        "proven",
        "conservative",
        "heyting",
        "arithmetic",
        "mathematical",
        "consequence",
        "kripke",
        "schema",
        "found",
        "van",
        "dalen",
        "shown",
        "k",
        "continuity",
        "axiom",
        "reject",
        "markov",
        "principle",
        "k",
        "together",
        "markov",
        "principle",
        "implies",
        "principle",
        "excluded",
        "middle",
        "kripke",
        "shown",
        "k",
        "implies",
        "existence",
        "nonrecursive",
        "function",
        "result",
        "published",
        "kreisel",
        "clearly",
        "implies",
        "theory",
        "c",
        "also",
        "implies",
        "existence",
        "nonrecursive",
        "function",
        "possible",
        "argument",
        "c",
        "run",
        "follows",
        "suppose",
        "x",
        "noncomputable",
        "computably",
        "enumerable",
        "set",
        "define",
        "function",
        "f",
        "follows",
        "f",
        "n",
        "begin",
        "case",
        "text",
        "box_m",
        "n",
        "notin",
        "x",
        "text",
        "box_m",
        "n",
        "notin",
        "x",
        "end",
        "case",
        "follows",
        "nnotin",
        "x",
        "f",
        "n",
        "natural",
        "number",
        "m",
        "implies",
        "f",
        "computable",
        "complement",
        "x",
        "would",
        "computably",
        "enumerable",
        "implying",
        "computability",
        "x",
        "since",
        "f",
        "function",
        "intuitionistic",
        "point",
        "view",
        "establishes",
        "intuitionism",
        "function",
        "computable",
        "foundation",
        "formalization",
        "meant",
        "serve",
        "foundation",
        "constructive",
        "mathematics",
        "either",
        "settheoretic",
        "aczel",
        "myhill",
        "typetheoretic",
        "martinlöf",
        "nature",
        "former",
        "theory",
        "adaptation",
        "zermelofraenkel",
        "set",
        "theory",
        "constructive",
        "setting",
        "type",
        "theory",
        "construction",
        "implicit",
        "constructive",
        "statement",
        "made",
        "explicit",
        "system",
        "set",
        "theory",
        "could",
        "viewed",
        "extensional",
        "foundation",
        "mathematics",
        "whereas",
        "type",
        "theory",
        "general",
        "intensional",
        "one",
        "recent",
        "year",
        "many",
        "model",
        "part",
        "foundational",
        "theory",
        "intuitionistic",
        "mathematics",
        "appeared",
        "mentioned",
        "especially",
        "topos",
        "theory",
        "van",
        "oosten",
        "many",
        "model",
        "capture",
        "certain",
        "characteristic",
        "intuitionism",
        "example",
        "topos",
        "total",
        "real",
        "function",
        "continuous",
        "functional",
        "interpretation",
        "realizability",
        "well",
        "interpretation",
        "type",
        "theory",
        "could",
        "also",
        "viewed",
        "model",
        "intuitionistic",
        "mathematics",
        "constructive",
        "theory",
        "reverse",
        "mathematics",
        "reverse",
        "mathematics",
        "one",
        "try",
        "establish",
        "mathematical",
        "theorem",
        "axiom",
        "needed",
        "prove",
        "intuitionistic",
        "reverse",
        "mathematics",
        "one",
        "similar",
        "aim",
        "respect",
        "intuitionistic",
        "theorem",
        "working",
        "weak",
        "intuitionistic",
        "theory",
        "axiom",
        "theorem",
        "compared",
        "typical",
        "axiom",
        "one",
        "wish",
        "theorem",
        "compare",
        "fan",
        "principle",
        "bar",
        "principle",
        "kripke",
        "schema",
        "continuity",
        "axiom",
        "veldman",
        "equivalent",
        "fan",
        "principle",
        "basic",
        "theory",
        "called",
        "basic",
        "intuitionistic",
        "mathematics",
        "studied",
        "shown",
        "fan",
        "principle",
        "equivalent",
        "statement",
        "unit",
        "interval",
        "heineborel",
        "property",
        "many",
        "equivalent",
        "derived",
        "veldman",
        "fan",
        "principle",
        "shown",
        "also",
        "equivalent",
        "brouwer",
        "approximate",
        "fixedpoint",
        "theorem",
        "lubarsky",
        "et",
        "al",
        "reverse",
        "mathematics",
        "applied",
        "form",
        "kripke",
        "schema",
        "shown",
        "equivalent",
        "certain",
        "topological",
        "statement",
        "many",
        "example",
        "intuitionistic",
        "reverse",
        "mathematics",
        "especially",
        "larger",
        "field",
        "constructive",
        "reverse",
        "mathematics",
        "many",
        "result",
        "nature",
        "also",
        "relevant",
        "intuitionistic",
        "point",
        "view",
        "philosophy",
        "brouwer",
        "build",
        "intuitionism",
        "ground",
        "comment",
        "much",
        "relation",
        "intuitionism",
        "existing",
        "philosophy",
        "others",
        "connection",
        "discussed",
        "section",
        "particular",
        "way",
        "intuitionistic",
        "principle",
        "justified",
        "term",
        "philosophy",
        "phenomenology",
        "connection",
        "intuitionism",
        "phenomenology",
        "philosophy",
        "developed",
        "edmund",
        "husserl",
        "investigated",
        "several",
        "author",
        "brouwer",
        "lifetime",
        "well",
        "decade",
        "later",
        "hermann",
        "weyl",
        "among",
        "first",
        "discus",
        "relation",
        "brouwer",
        "idea",
        "phenomenological",
        "view",
        "mathematics",
        "like",
        "brouwer",
        "weyl",
        "speaks",
        "book",
        "da",
        "kontinuum",
        "chapter",
        "intuitive",
        "continuum",
        "weyl",
        "notion",
        "based",
        "phenomenology",
        "consciousness",
        "time",
        "weyl",
        "later",
        "feel",
        "brouwer",
        "development",
        "real",
        "analysis",
        "faithful",
        "idea",
        "intuitive",
        "continuum",
        "weyl",
        "therefore",
        "place",
        "brouwer",
        "side",
        "least",
        "regarding",
        "aspect",
        "van",
        "atten",
        "van",
        "atten",
        "en",
        "us",
        "phenomenology",
        "justify",
        "choice",
        "sequence",
        "mathematical",
        "object",
        "author",
        "critical",
        "brouwer",
        "justification",
        "choice",
        "sequence",
        "motive",
        "look",
        "philosophical",
        "justification",
        "elsewhere",
        "choice",
        "sequence",
        "occur",
        "work",
        "becker",
        "weyl",
        "differ",
        "brouwer",
        "notion",
        "husserl",
        "never",
        "discussed",
        "choice",
        "sequence",
        "publicly",
        "van",
        "atten",
        "explains",
        "homogeneity",
        "continuum",
        "account",
        "inexhaustibility",
        "nonatomicity",
        "two",
        "key",
        "property",
        "intuitive",
        "continuum",
        "according",
        "brouwer",
        "using",
        "fact",
        "two",
        "essential",
        "property",
        "present",
        "definition",
        "choice",
        "sequence",
        "one",
        "arrives",
        "phenomenological",
        "justification",
        "wittgenstein",
        "march",
        "brouwer",
        "lectured",
        "vienna",
        "intuitionistic",
        "foundation",
        "mathematics",
        "ludwig",
        "wittgenstein",
        "attended",
        "lecture",
        "persuaded",
        "herbert",
        "feigl",
        "afterwards",
        "wrote",
        "hour",
        "spent",
        "wittgenstein",
        "others",
        "lecture",
        "great",
        "event",
        "took",
        "place",
        "suddenly",
        "volubly",
        "wittgenstein",
        "began",
        "talking",
        "philosophy",
        "great",
        "length",
        "perhaps",
        "turning",
        "point",
        "ever",
        "since",
        "time",
        "moved",
        "cambridge",
        "university",
        "wittgenstein",
        "philosopher",
        "began",
        "exert",
        "tremendous",
        "influence",
        "others",
        "dispute",
        "brouwer",
        "lecture",
        "influenced",
        "wittgenstein",
        "thinking",
        "hacker",
        "hintikka",
        "marion",
        "far",
        "wittgenstein",
        "influenced",
        "brouwer",
        "idea",
        "entirely",
        "clear",
        "certainly",
        "interesting",
        "agreement",
        "disagreement",
        "view",
        "marion",
        "argues",
        "wittgenstein",
        "conception",
        "mathematics",
        "described",
        "tractatus",
        "close",
        "brouwer",
        "wittgenstein",
        "agrees",
        "rejection",
        "law",
        "excluded",
        "middle",
        "manuscript",
        "pp",
        "wittgenstein",
        "disagrees",
        "brouwer",
        "argument",
        "marion",
        "claim",
        "wittgenstein",
        "stance",
        "radical",
        "brouwer",
        "former",
        "view",
        "lack",
        "validity",
        "law",
        "excluded",
        "middle",
        "mathematics",
        "distinguishing",
        "feature",
        "mathematical",
        "proposition",
        "opposed",
        "empirical",
        "proposition",
        "particularity",
        "mathematics",
        "infinite",
        "brouwer",
        "veldman",
        "forthcoming",
        "discus",
        "several",
        "point",
        "dis",
        "agreement",
        "brouwer",
        "wittgenstein",
        "danger",
        "logic",
        "according",
        "may",
        "lead",
        "construction",
        "without",
        "mathematical",
        "content",
        "one",
        "disagreement",
        "raised",
        "paper",
        "concern",
        "wittgenstein",
        "view",
        "mathematics",
        "common",
        "undertaking",
        "stark",
        "contrast",
        "brouwer",
        "creating",
        "subject",
        "view",
        "mathematics",
        "languageless",
        "activity",
        "dummett",
        "british",
        "philosopher",
        "michael",
        "dummett",
        "developed",
        "philosophical",
        "basis",
        "intuitionism",
        "particular",
        "intuitionistic",
        "logic",
        "dummett",
        "explicitly",
        "state",
        "theory",
        "exegesis",
        "brouwer",
        "work",
        "possible",
        "philosophical",
        "theory",
        "word",
        "repudiating",
        "classical",
        "reasoning",
        "mathematics",
        "favor",
        "intuitionistic",
        "reasoning",
        "dummett",
        "approach",
        "start",
        "idea",
        "choice",
        "one",
        "logic",
        "another",
        "must",
        "necessarily",
        "lie",
        "meaning",
        "one",
        "attache",
        "logical",
        "statement",
        "theory",
        "meaning",
        "dummett",
        "us",
        "based",
        "wittgenstein",
        "idea",
        "language",
        "particular",
        "idea",
        "meaning",
        "use",
        "meaning",
        "sentence",
        "determined",
        "way",
        "sentence",
        "used",
        "meaning",
        "mathematical",
        "statement",
        "manifest",
        "use",
        "made",
        "understanding",
        "knowledge",
        "capacity",
        "use",
        "statement",
        "view",
        "supported",
        "way",
        "acquire",
        "mathematical",
        "knowledge",
        "learn",
        "mathematical",
        "notion",
        "learn",
        "use",
        "compute",
        "prove",
        "infer",
        "way",
        "establish",
        "grasped",
        "meaning",
        "mathematical",
        "statement",
        "lie",
        "proficiency",
        "making",
        "correct",
        "use",
        "statement",
        "given",
        "view",
        "meaning",
        "central",
        "notion",
        "theory",
        "meaning",
        "mathematics",
        "platonism",
        "truth",
        "proof",
        "understanding",
        "mathematical",
        "statement",
        "consists",
        "ability",
        "recognize",
        "proof",
        "one",
        "presented",
        "one",
        "dummett",
        "argues",
        "lead",
        "adoption",
        "intuitionistic",
        "logic",
        "logic",
        "mathematical",
        "reasoning",
        "interestingly",
        "dummett",
        "remark",
        "theory",
        "meaning",
        "far",
        "apart",
        "brouwer",
        "idea",
        "mathematics",
        "essentially",
        "languageless",
        "activity",
        "least",
        "two",
        "quite",
        "different",
        "line",
        "thought",
        "lead",
        "adoption",
        "intuitionistic",
        "logic",
        "classical",
        "logic",
        "one",
        "developed",
        "brouwer",
        "one",
        "argued",
        "dummett",
        "dummett",
        "work",
        "intuitionism",
        "commented",
        "various",
        "philosopher",
        "dag",
        "prawitz",
        "parson",
        "richard",
        "tieszen",
        "en",
        "finitism",
        "various",
        "form",
        "finitism",
        "based",
        "similar",
        "view",
        "one",
        "expressed",
        "dummett",
        "construction",
        "allowed",
        "prove",
        "mathematical",
        "statement",
        "required",
        "exist",
        "principle",
        "also",
        "practice",
        "depending",
        "precise",
        "implementation",
        "latter",
        "notion",
        "one",
        "arrives",
        "different",
        "form",
        "finitism",
        "ultraintuitionism",
        "developed",
        "alexander",
        "yesseninvolpin",
        "strict",
        "finitism",
        "developed",
        "crispin",
        "wright"
    ]
}