{
    "main_text": "Intuitionist epistemology || Trolley cases and the reliability of moral intuitions\n1.4 Trolley cases and the reliability of moral intuitions\n\n\nEmpirical psychology has recently cast doubt on the reliability of at\nleast some of our moral intuitions. Since a self-evident proposition\nis one of which a clear intuition justifies us in believing it, these\ndoubts call into question the claim that our moral intuitions justify\nus in believing them, and thus whether there are any self-evident\nmoral propositions. The experiments that cast doubt on our intuitions\ntend to focus on our intuitions about trolley cases. Consider the\nfollowing three cases:\n\nSwitch: there are five people on the rail track,\nand an out of control trolley that will kill all five of them. There is\na lever that would divert the trolley onto a different track. But there\nis a single person on that track who would be killed if you pull the\nlever and divert the trolley.\n\nBridge: there are five people on the rail track,\nand an out of control trolley that will kill all five of them. There is\na large man standing on the bridge over the track. If you pushed him\noff the bridge onto the track, he would be killed. But he would derail\nthe trolley and so the five people on the track would be saved.\n\nTrap door: there are five people on the rail track,\nand an out of control trolley that will kill all five of them. There is\na man standing on the bridge over the track. If he fell onto the track\nhe would be killed, but would derail the trolley thus saving the five\npeople on the track. He is standing on a trap door that would open and\ndrop him onto the track if you pulled a lever.\n\n\nPeople tend to say that they should pull the lever in Switch, but\nthat they ought not to push the man off the bridge in Bridge. Bridge\nlooks similar to Switch in that you would be killing one person to save\nfive. So why the different intuitions? One could try to explain away\nthese apparently conflicting intuitions with the doctrine of double\neffect. According to this doctrine, we may produce some good that\ninvolves a bad outcome, so long as the bad outcome is not intended. If the\nbad outcome is a means to the good end, then it is intended (as a\nmeans), and is not merely foreseen. So such acts are wrong according to\nthe doctrine of double effect.\n\n\nSwitch seems to be a case where the bad outcome is foreseen, but not\nintended. Bridge seems to be a case where the bad outcome is intended\nas a means of saving the five. So one way to explain the different\nintuitions in Switch and Bridge is with reference to the doctrine of\ndouble effect. But this explanation is unsettled by a variant of\nSwitch, according to which the large man is on the spur track, and that\ntrack now loops back onto the main one. Here it looks like by pulling\nthe lever we would be using the large man merely as a means to saving\nthe five, for unless he stops the trolley it will loop round and kill\nthe five from the other direction. But it still seems permissible to\npull the lever, yet wrong to push the man off the bridge.\n\n\nFurthermore, this explanation of people’s different intuitions is\ncalled into question by Trap Door. For Trap Door is like Bridge in the\nsense that the bystander is killed as a means of saving the five, but\nmany more people tend to have the intuition that it is permissible to\npull the lever in Trap Door (Greene et al. 2009).\n The difference in people’s intuitions between Bridge and Trap Door\ncasts serious doubt on the deontologist’s explanation of the\ndifference in their intuitions about Switch and Bridge. An alternative\nexplanation of the difference is that the Bridge case is ‘up\nclose and personal’ in the sense that it involves physical\ncontact, whereas in Switch and Trap Door the agent is remote from the\nperson they have to kill to save the five (Singer, 2005). But this\ndifference is morally irrelevant, so if this explanation is right,\nthen our intuitions are distorted by at least one morally irrelevant\nfactor.\n\n\nAlso it seems that our intuitions are subject to framing effects. For\ninstance, our intuitions seem to be affected by whether we word our\nscenario in terms of killing or saving, and by the order in which the\ntrolley examples are considered. If people are asked to consider\nSwitch first, and Bridge second, they tend to say that it is\npermissible to pull the lever in Switch but not permissible to push\nthe man onto the track in Bridge. If, however, they are given the\nBridge case first a higher percentage say that it would be wrong to pull the\nlever in Switch. So it looks like the order in which the cases are\ngiven affects people’s intuitions about the cases. But the order in\nwhich one considers the cases is morally irrelevant. So it looks like\n our intuitions can be distorted by a second\n source.[10]\n \n\nOne thing worthy of note is that these cases test intuitions about\nour overall moral judgements—that is, about what we should, or\nmay do in certain circumstances. But not all intuitionists claim that\nprinciples about what we ought to do are self-evident. W. D. Ross for\nexample claimed that only principles of prima facie duty are\nself-evident, and principles of prima facie duty are, roughly,\nprinciples stating that certain facts count in favour of an act and\nothers count against. So these principles state, for instance, that \nthe fact that one’s act would produce some good, or the fact that it \nwould be the keeping of a promise, or the expression\nof gratitude, etc., counts in favour of it, and the fact that, for\nexample, it would involve the infliction of harm on someone counts\nagainst it. What we ought to do is determined by all of these facts,\nand how they weigh up against each other. Ross denied that we can ever\nknow what we ought to do, and rejected the view that there could be\nstrictly universal, self-evident principles specifying what we ought\nto do.\n \n\nIt would be interesting to hear the outcome of experiments to see\nwhether people’s intuitions about prima facie duty are subject\nto change on morally irrelevant grounds. This is something that\nrequires empirical testing, but it is hard to imagine someone thinking\nthat the fact that one would have to kill an innocent person in order\nto save five didn’t count against doing this act, or that the\nfact that their act would save five innocent people didn’t count\nin favour of it, regardless of their overall verdict about whether\nthey should kill the one or let the five die. That their act involved\nphysically pushing someone in front of the trolley, or pulling a lever\nthat would release a trap door dropping them onto the track would\nplausibly make no difference to such intuitions. Nor would framing\neffects introduced by the order of presentation of the cases. If such\na priori expectations are correct then empirical psychology would\nraise no problems for a Rossian intuitionism that claims only that\nprinciples of prima facie duty are self-evident.\n \n\nJames Andow (2018) has put these claims to the test, and it turns out\nthat a significant number of people (25%) do not accept that the fact\nthat someone would be killed by either pulling the lever or pushing\nthem off a bridge to save five counts against doing this, whether they\nare imagining themselves doing the act or commenting on someone\nelse’s action (121). He also discovered that people’s\nintuitions did change between the lever case and the bridge case in\nrelation to whether the fact that five lives would be saved counts in\nfavour of doing the act (121). So it seems that intuitions about\nwhether saving lives counts in favour of acting is vulnerable to\nframing effects. \n\n\nAndow argues that we shouldn’t dismiss these results on the\ngrounds that the responses did not reflect the participants’\nintuitions about the moral relevance of killing (138ff). But it is\nhard to accept that 25% of respondents really thought that the fact\nthat their act involves killing someone does not even count against\ndoing it. To believe this is not just to sincerely utter the words,\nbut involves certain counter-factual beliefs. For instance, if I did\nnot think that the fact that by pulling the lever I would be killing\nsomeone counts against pulling the lever, then if I had a second lever\nwhich would save the five without killing anyone, I would be\nindifferent about which lever I’d pull. It is difficult to\nbelieve that the respondents who claimed that killing did not matter\nin trolley case scenarios would be indifferent in this counter-factual\nscenario. Furthermore, thinking that killing does not count against\none’s act commits one to the thought that there is absolutely\nnothing to regret. But it is likely that if these people were put in a\nreal scenario where they could only save five by killing one, they\nwould regret deeply the fact that they could only save the five in\nthis way. None of this fits with the results of Andow’s\nexperimental findings, and casts doubt on whether the\nrespondent’s replies really reflect their intuitions about the\ncase. \n\n\nBut even if Ross-style intuitions were not vulnerable to such\ndisagreement and framing effects, critics may object that in so far as\nRoss’s theory does not tell us what we ought to do, it does not\ngive us what we want from a moral theory. Being told that various\nfeatures count for or against certain actions, and that one just has\nto decide for oneself in each case what one should do, may be a very\ndisappointing result even if it is self-evident which features count\nfor or against.\n\n\nA further point about the findings of such experiments is whether the\nsubjects’ answers to the experimenters’ questions express\ntheir intuitions (Bengson 2013). When subjects have considered Bridge\nfirst, they are more likely to say that it would be wrong to pull the\nlever in Switch. This is taken to show that their intuitions are\nvulnerable to framing effects. But once we remember that one’s\nbeliefs and judgements may conflict with one’s intuitions it is\nnot at all clear that the subjects lack the intuition that it would be\npermissible to pull the lever in the switch case when they say that it\nwould be wrong. A perfectly plausible alternative is that they have\nreasoned that, because it would be wrong to kill someone to save five\nin Bridge, it must be wrong to kill someone to save five in Switch.\nThat is quite consistent with their having the intuition that it would\nbe permissible to pull the lever in the switch case, since intuiting\nis not believing. This point does not however explain James\nAndow’s findings.\n",
    "section_title": "1.4 Trolley cases and the reliability of moral intuitions",
    "entry_title": "Intuitionism in Ethics",
    "hierarchy_title": "Intuitionism in Ethics || Intuitionist epistemology || Trolley cases and the reliability of moral intuitions",
    "tokenized_text": [
        "intuitionist",
        "epistemology",
        "trolley",
        "case",
        "reliability",
        "moral",
        "intuition",
        "trolley",
        "case",
        "reliability",
        "moral",
        "intuition",
        "empirical",
        "psychology",
        "recently",
        "cast",
        "doubt",
        "reliability",
        "least",
        "moral",
        "intuition",
        "since",
        "selfevident",
        "proposition",
        "one",
        "clear",
        "intuition",
        "justifies",
        "u",
        "believing",
        "doubt",
        "call",
        "question",
        "claim",
        "moral",
        "intuition",
        "justify",
        "u",
        "believing",
        "thus",
        "whether",
        "selfevident",
        "moral",
        "proposition",
        "experiment",
        "cast",
        "doubt",
        "intuition",
        "tend",
        "focus",
        "intuition",
        "trolley",
        "case",
        "consider",
        "following",
        "three",
        "case",
        "switch",
        "five",
        "people",
        "rail",
        "track",
        "control",
        "trolley",
        "kill",
        "five",
        "lever",
        "would",
        "divert",
        "trolley",
        "onto",
        "different",
        "track",
        "single",
        "person",
        "track",
        "would",
        "killed",
        "pull",
        "lever",
        "divert",
        "trolley",
        "bridge",
        "five",
        "people",
        "rail",
        "track",
        "control",
        "trolley",
        "kill",
        "five",
        "large",
        "man",
        "standing",
        "bridge",
        "track",
        "pushed",
        "bridge",
        "onto",
        "track",
        "would",
        "killed",
        "would",
        "derail",
        "trolley",
        "five",
        "people",
        "track",
        "would",
        "saved",
        "trap",
        "door",
        "five",
        "people",
        "rail",
        "track",
        "control",
        "trolley",
        "kill",
        "five",
        "man",
        "standing",
        "bridge",
        "track",
        "fell",
        "onto",
        "track",
        "would",
        "killed",
        "would",
        "derail",
        "trolley",
        "thus",
        "saving",
        "five",
        "people",
        "track",
        "standing",
        "trap",
        "door",
        "would",
        "open",
        "drop",
        "onto",
        "track",
        "pulled",
        "lever",
        "people",
        "tend",
        "say",
        "pull",
        "lever",
        "switch",
        "ought",
        "push",
        "man",
        "bridge",
        "bridge",
        "bridge",
        "look",
        "similar",
        "switch",
        "would",
        "killing",
        "one",
        "person",
        "save",
        "five",
        "different",
        "intuition",
        "one",
        "could",
        "try",
        "explain",
        "away",
        "apparently",
        "conflicting",
        "intuition",
        "doctrine",
        "double",
        "effect",
        "according",
        "doctrine",
        "may",
        "produce",
        "good",
        "involves",
        "bad",
        "outcome",
        "long",
        "bad",
        "outcome",
        "intended",
        "bad",
        "outcome",
        "mean",
        "good",
        "end",
        "intended",
        "mean",
        "merely",
        "foreseen",
        "act",
        "wrong",
        "according",
        "doctrine",
        "double",
        "effect",
        "switch",
        "seems",
        "case",
        "bad",
        "outcome",
        "foreseen",
        "intended",
        "bridge",
        "seems",
        "case",
        "bad",
        "outcome",
        "intended",
        "mean",
        "saving",
        "five",
        "one",
        "way",
        "explain",
        "different",
        "intuition",
        "switch",
        "bridge",
        "reference",
        "doctrine",
        "double",
        "effect",
        "explanation",
        "unsettled",
        "variant",
        "switch",
        "according",
        "large",
        "man",
        "spur",
        "track",
        "track",
        "loop",
        "back",
        "onto",
        "main",
        "one",
        "look",
        "like",
        "pulling",
        "lever",
        "would",
        "using",
        "large",
        "man",
        "merely",
        "mean",
        "saving",
        "five",
        "unless",
        "stop",
        "trolley",
        "loop",
        "round",
        "kill",
        "five",
        "direction",
        "still",
        "seems",
        "permissible",
        "pull",
        "lever",
        "yet",
        "wrong",
        "push",
        "man",
        "bridge",
        "furthermore",
        "explanation",
        "people",
        "different",
        "intuition",
        "called",
        "question",
        "trap",
        "door",
        "trap",
        "door",
        "like",
        "bridge",
        "sense",
        "bystander",
        "killed",
        "mean",
        "saving",
        "five",
        "many",
        "people",
        "tend",
        "intuition",
        "permissible",
        "pull",
        "lever",
        "trap",
        "door",
        "greene",
        "et",
        "al",
        "difference",
        "people",
        "intuition",
        "bridge",
        "trap",
        "door",
        "cast",
        "serious",
        "doubt",
        "deontologist",
        "explanation",
        "difference",
        "intuition",
        "switch",
        "bridge",
        "alternative",
        "explanation",
        "difference",
        "bridge",
        "case",
        "close",
        "personal",
        "sense",
        "involves",
        "physical",
        "contact",
        "whereas",
        "switch",
        "trap",
        "door",
        "agent",
        "remote",
        "person",
        "kill",
        "save",
        "five",
        "singer",
        "difference",
        "morally",
        "irrelevant",
        "explanation",
        "right",
        "intuition",
        "distorted",
        "least",
        "one",
        "morally",
        "irrelevant",
        "factor",
        "also",
        "seems",
        "intuition",
        "subject",
        "framing",
        "effect",
        "instance",
        "intuition",
        "seem",
        "affected",
        "whether",
        "word",
        "scenario",
        "term",
        "killing",
        "saving",
        "order",
        "trolley",
        "example",
        "considered",
        "people",
        "asked",
        "consider",
        "switch",
        "first",
        "bridge",
        "second",
        "tend",
        "say",
        "permissible",
        "pull",
        "lever",
        "switch",
        "permissible",
        "push",
        "man",
        "onto",
        "track",
        "bridge",
        "however",
        "given",
        "bridge",
        "case",
        "first",
        "higher",
        "percentage",
        "say",
        "would",
        "wrong",
        "pull",
        "lever",
        "switch",
        "look",
        "like",
        "order",
        "case",
        "given",
        "affect",
        "people",
        "intuition",
        "case",
        "order",
        "one",
        "considers",
        "case",
        "morally",
        "irrelevant",
        "look",
        "like",
        "intuition",
        "distorted",
        "second",
        "source",
        "one",
        "thing",
        "worthy",
        "note",
        "case",
        "test",
        "intuition",
        "overall",
        "moral",
        "judgementsthat",
        "may",
        "certain",
        "circumstance",
        "intuitionists",
        "claim",
        "principle",
        "ought",
        "selfevident",
        "w",
        "d",
        "ross",
        "example",
        "claimed",
        "principle",
        "prima",
        "facie",
        "duty",
        "selfevident",
        "principle",
        "prima",
        "facie",
        "duty",
        "roughly",
        "principle",
        "stating",
        "certain",
        "fact",
        "count",
        "favour",
        "act",
        "others",
        "count",
        "principle",
        "state",
        "instance",
        "fact",
        "one",
        "act",
        "would",
        "produce",
        "good",
        "fact",
        "would",
        "keeping",
        "promise",
        "expression",
        "gratitude",
        "etc",
        "count",
        "favour",
        "fact",
        "example",
        "would",
        "involve",
        "infliction",
        "harm",
        "someone",
        "count",
        "ought",
        "determined",
        "fact",
        "weigh",
        "ross",
        "denied",
        "ever",
        "know",
        "ought",
        "rejected",
        "view",
        "could",
        "strictly",
        "universal",
        "selfevident",
        "principle",
        "specifying",
        "ought",
        "would",
        "interesting",
        "hear",
        "outcome",
        "experiment",
        "see",
        "whether",
        "people",
        "intuition",
        "prima",
        "facie",
        "duty",
        "subject",
        "change",
        "morally",
        "irrelevant",
        "ground",
        "something",
        "requires",
        "empirical",
        "testing",
        "hard",
        "imagine",
        "someone",
        "thinking",
        "fact",
        "one",
        "would",
        "kill",
        "innocent",
        "person",
        "order",
        "save",
        "five",
        "count",
        "act",
        "fact",
        "act",
        "would",
        "save",
        "five",
        "innocent",
        "people",
        "count",
        "favour",
        "regardless",
        "overall",
        "verdict",
        "whether",
        "kill",
        "one",
        "let",
        "five",
        "die",
        "act",
        "involved",
        "physically",
        "pushing",
        "someone",
        "front",
        "trolley",
        "pulling",
        "lever",
        "would",
        "release",
        "trap",
        "door",
        "dropping",
        "onto",
        "track",
        "would",
        "plausibly",
        "make",
        "difference",
        "intuition",
        "would",
        "framing",
        "effect",
        "introduced",
        "order",
        "presentation",
        "case",
        "priori",
        "expectation",
        "correct",
        "empirical",
        "psychology",
        "would",
        "raise",
        "problem",
        "rossian",
        "intuitionism",
        "claim",
        "principle",
        "prima",
        "facie",
        "duty",
        "selfevident",
        "james",
        "andow",
        "put",
        "claim",
        "test",
        "turn",
        "significant",
        "number",
        "people",
        "accept",
        "fact",
        "someone",
        "would",
        "killed",
        "either",
        "pulling",
        "lever",
        "pushing",
        "bridge",
        "save",
        "five",
        "count",
        "whether",
        "imagining",
        "act",
        "commenting",
        "someone",
        "else",
        "action",
        "also",
        "discovered",
        "people",
        "intuition",
        "change",
        "lever",
        "case",
        "bridge",
        "case",
        "relation",
        "whether",
        "fact",
        "five",
        "life",
        "would",
        "saved",
        "count",
        "favour",
        "act",
        "seems",
        "intuition",
        "whether",
        "saving",
        "life",
        "count",
        "favour",
        "acting",
        "vulnerable",
        "framing",
        "effect",
        "andow",
        "argues",
        "dismiss",
        "result",
        "ground",
        "response",
        "reflect",
        "participant",
        "intuition",
        "moral",
        "relevance",
        "killing",
        "ff",
        "hard",
        "accept",
        "respondent",
        "really",
        "thought",
        "fact",
        "act",
        "involves",
        "killing",
        "someone",
        "even",
        "count",
        "believe",
        "sincerely",
        "utter",
        "word",
        "involves",
        "certain",
        "counterfactual",
        "belief",
        "instance",
        "think",
        "fact",
        "pulling",
        "lever",
        "would",
        "killing",
        "someone",
        "count",
        "pulling",
        "lever",
        "second",
        "lever",
        "would",
        "save",
        "five",
        "without",
        "killing",
        "anyone",
        "would",
        "indifferent",
        "lever",
        "pull",
        "difficult",
        "believe",
        "respondent",
        "claimed",
        "killing",
        "matter",
        "trolley",
        "case",
        "scenario",
        "would",
        "indifferent",
        "counterfactual",
        "scenario",
        "furthermore",
        "thinking",
        "killing",
        "count",
        "one",
        "act",
        "commits",
        "one",
        "thought",
        "absolutely",
        "nothing",
        "regret",
        "likely",
        "people",
        "put",
        "real",
        "scenario",
        "could",
        "save",
        "five",
        "killing",
        "one",
        "would",
        "regret",
        "deeply",
        "fact",
        "could",
        "save",
        "five",
        "way",
        "none",
        "fit",
        "result",
        "andow",
        "experimental",
        "finding",
        "cast",
        "doubt",
        "whether",
        "respondent",
        "reply",
        "really",
        "reflect",
        "intuition",
        "case",
        "even",
        "rossstyle",
        "intuition",
        "vulnerable",
        "disagreement",
        "framing",
        "effect",
        "critic",
        "may",
        "object",
        "far",
        "ross",
        "theory",
        "tell",
        "u",
        "ought",
        "give",
        "u",
        "want",
        "moral",
        "theory",
        "told",
        "various",
        "feature",
        "count",
        "certain",
        "action",
        "one",
        "decide",
        "oneself",
        "case",
        "one",
        "may",
        "disappointing",
        "result",
        "even",
        "selfevident",
        "feature",
        "count",
        "point",
        "finding",
        "experiment",
        "whether",
        "subject",
        "answer",
        "experimenter",
        "question",
        "express",
        "intuition",
        "bengson",
        "subject",
        "considered",
        "bridge",
        "first",
        "likely",
        "say",
        "would",
        "wrong",
        "pull",
        "lever",
        "switch",
        "taken",
        "show",
        "intuition",
        "vulnerable",
        "framing",
        "effect",
        "remember",
        "one",
        "belief",
        "judgement",
        "may",
        "conflict",
        "one",
        "intuition",
        "clear",
        "subject",
        "lack",
        "intuition",
        "would",
        "permissible",
        "pull",
        "lever",
        "switch",
        "case",
        "say",
        "would",
        "wrong",
        "perfectly",
        "plausible",
        "alternative",
        "reasoned",
        "would",
        "wrong",
        "kill",
        "someone",
        "save",
        "five",
        "bridge",
        "must",
        "wrong",
        "kill",
        "someone",
        "save",
        "five",
        "switch",
        "quite",
        "consistent",
        "intuition",
        "would",
        "permissible",
        "pull",
        "lever",
        "switch",
        "case",
        "since",
        "intuiting",
        "believing",
        "point",
        "however",
        "explain",
        "james",
        "andow",
        "finding"
    ]
}