{
    "main_text": "Intuitionist epistemology || Intuition\n1.1 Intuition\n \n\nOne of the most distinctive features of Ethical Intuitionism is\nits epistemology. All of the classic intuitionists maintained that\nbasic moral propositions are self-evident—that is, evident in\nand of themselves—and so can be known without the need of any\nargument. Price distinguishes intuition from two other grounds of\nknowledge—namely, immediate consciousness or feeling on the one\nhand, and argumentation, on the other. Argumentation, or deduction, is\nknowledge that is ultimately derived from what is immediately\napprehended, either by sensation or by the understanding. Immediate\nconsciousness, or feeling, is the mind’s awareness of its own\nexistence and mental states (Price, 1758/1969, 159). It shares\nimmediacy with intuition, but unlike intuition does not have as its\nobject a self-evident proposition. Such immediate self-consciousness\nis immediate apprehension by sensation. Intuition is immediate\napprehension by the understanding. It is the way that we apprehend\nself-evident truths, general and abstract ideas, “and anything\nelse we may discover, without making any use of any process of\nreasoning” (1758/1969, 159).\n\n\nThe claim that intuition is immediate apprehension by the\nunderstanding suggests a notion of intuition in Price that is more\nakin to current accounts of intuitions as intellectual seemings or\npresentations (Bealer 1998; Chudnoff 2013). Intellectual seemings are\nthe intellectual analogue of perceptual seemings. Just as certain\nthings can seem perceptually to be a certain way, e.g., coloured, or\nstraight, so certain propositions can seem to be true, or present\nthemselves to the mind as true. These seemings are not beliefs, for\nsomething can seem true even though one does not believe it, e.g., it\nmay seem true that there are more natural numbers than even numbers,\nbut we know that is false, so do not believe it.\n\n\nSimilarly, on Price’s view, an intuition isn’t a belief\nwith certain characteristics, such as being pre-theoretical,\nnon-derivative, firmly held, etc. Beliefs aren’t immediate\napprehensions of anything, though they may be based on such\napprehensions. One might be tempted to think that perceptual beliefs,\nsuch as the belief that there is a cat asleep in front of me, are\nimmediate apprehensions, but that would be to confuse the perceptual\napprehension of the cat with the belief based on that apprehension.\nBeliefs like this, perceptual beliefs, are based on the immediate\nexperience (sensory intuition) I have of a cat sleeping in front of\nme; they are not the sensory intuition itself. As Price understands\nit, then, an intellectual intuition is something closely akin to an\nexperiential presentation, or seeming.\n\n\nThe main difference between early intuitionists’ notion of intuition\nand intellectual seemings is that the latter is standardly regarded as\nnon-factive—that is, an intuition that p in this sense does\nnot entail that p. An apprehension that p does sound factive,\nhowever. One cannot apprehend something that is not there to be\napprehended. What is present to the mind in apprehension is the thing\nitself, not our representation of it. So whereas modern\nepistemologists regard intuition, understood as an intellectual\nseeming or presentation, as something analogous to the non-factive\nnotion of a perceptual experience, it looks like some classic\nintuitionists regarded intuition as analogous to the factive notion of\na perception. The virtue of the modern, more modest notion of\nintuition is that it allows that intuition is fallible. But in doing\nthis it loses the appeal of the direct realist account Price seems to\nwork with of certain propositions or facts being immediately present\nto the mind.\n\n\nThere is scope for intuitionists to be disjunctivist about such\nintuitions. They could maintain that some intuitions are\napprehensions, and some are intellectual seemings. Subjectively we\ncannot tell one from the other, but they are, one might argue, very\ndifferent states. But it is not evident that anyone has defended such\na view of intuition.\n\n\nIt is not clear that all intuitionists understand intuitions on this\nperceptual or quasi-perceptual model, as many do not use this notion\nat all. W. D. Ross, for example, uses the notion of apprehension, but\nhe tends to base his moral theory largely on our considered moral\nconvictions. “[T]he moral convictions of thoughtful and\nwell-educated people are the data of ethics, just as sense-perceptions\nare the data of natural science” (1930/2002, 41). Convictions\nare, however, a certain type of belief rather than an intellectual\napprehension, or seeming. So it looks like we can find two notions of\nintuition in intuitionist thought—one understood as an\nintellectual seeming or apprehension, and the other as a\n pre-theoretical, non-inferred, firmly held belief or\n conviction.[2]\n Which one they opt for makes a difference to their epistemology.\n\n\nLike other epistemic foundationalists, Price insists that all\nreasoning and knowledge must ultimately rest on propositions that are\nnot inferred from other premises. For ethical intuitions this\n non-inferred basis of knowledge is self-evident truth grasped by\n intuition.[3]\n It is, however, important to keep intuition and self-evidence separate\nfor a number of reasons. First, a conscious intuition is a certain\nmental state, either a non-inferential belief or an intellectual\nseeming. But a self-evident proposition is not a conscious mental\nstate. Second, intuition is a way in which we are aware of\nself-evident propositions, whereas self-evident propositions are the\nthings that can be known in this way. Such propositions could (pace\nPrice) be believed without an intuition of them. As I will explain\nlater, one might have some argument that leads one to believe a\nself-evident proposition, or one may believe it on the basis of\nauthoritative testimony. Thirdly, it may turn out that things other\nthan self-evident propositions can be grasped by intuition. For\ninstance, we may have moral intuitions about concrete cases, such as\nvarious trolley cases (see below) and various anti-consequentialist\ncounter-examples. But it is not obvious that the contents of these\nintuitions are self-evident propositions; whether they are may depend\non how self-evidence is understood.\n\n\nPrice claims that self-evident truths are “incapable of\n proof” (1758/1969,\n 160).[4]\n Most classical intuitionists endorse this view,\nalthough Ross is arguably an exception. This is easily missed, for he\nstates at one point that self-evident moral propositions \n“cannot be proved, but … just as certainly need no proof” \n(1930/2002, 30). But elsewhere in The Right and the Good he \nmakes only the more restricted claim that such propositions do not\n need any\n proof,[5]\n and\ndespite the fact that he sometimes makes the further claim that they\ncannot receive any proof by means of argument, this further\n claim does not seem to reflect his considered\n view.[6]\n Evidence that it does not can be found in an\narticle written three years before the publication of The Right and\nthe Good where he explicitly states that  “the fact that\nsomething can be inferred does not prove that it cannot be seen\nintuitively” (1927, 121). If he thinks that some proposition can\nbe inferred from (justified by) other propositions and be self-evident,\nhe clearly thinks that its being self-evident does not rule out the\npossibility of a proof. In any case there is nothing in the notion of a\nself-evident proposition that rules out justification or argument for\nthat proposition. A self-evident proposition is one that we can be\njustified in believing without an argument, but this does not rule out\nthe possibility that there may be such an argument, or justification,\n or that the proposition may be believed on that\n basis.[7]\n Since such arguments are not needed for us to be justified in\nbelieving a self-evident proposition, they are what may be called\n’epistemically supererogatory’.\n\n\nAlthough there can be an argument for a self-evident or an intuitive proposition, if\nintuitions are understood as intellectual seemings, then intuitions\ncannot be justified. This is easily missed, as we tend to identify\nintuitions with the beliefs based on them, rather than with the\nintellectual seemings on which those beliefs are based. But if we take\nan intuition to be an intellectual seeming, then intuitions cannot be\njustified any more than a perceptual seeming can. Take a perceptual\nseeming, such as it’s seeming that the wall is green. This\nperceptual seeming could be explained in various ways, but it\nis odd to suppose that this experience could be justified by anything\n(which is not to rule out the possibility that the belief based on it\ncould be justified). This is because we are in a certain sense passive\nin relation to such seemings. Similarly, if some proposition presents\nitself to the mind as true, then this presentation cannot be justified,\nalthough the belief based on it can be (and we might add, the\nproposition intuited can be), for its seeming to be true is not a\nconclusion we could arrive at: it’s just how certain propositions\npresent themselves to the mind.\n\n\nIt may be that the reason that Ross switches between making the\nstronger claim that self-evident propositions cannot be\njustified, and the weaker claim that they need no justification, is\nthat he had in mind a belief in some self-evident proposition when he\nsaid they could be justified, and our intuition (apprehension) of that\nproposition when he said that they could not.\n",
    "section_title": "1.1 Intuition",
    "entry_title": "Intuitionism in Ethics",
    "hierarchy_title": "Intuitionism in Ethics || Intuitionist epistemology || Intuition",
    "tokenized_text": [
        "intuitionist",
        "epistemology",
        "intuition",
        "intuition",
        "one",
        "distinctive",
        "feature",
        "ethical",
        "intuitionism",
        "epistemology",
        "classic",
        "intuitionists",
        "maintained",
        "basic",
        "moral",
        "proposition",
        "selfevidentthat",
        "evident",
        "themselvesand",
        "known",
        "without",
        "need",
        "argument",
        "price",
        "distinguishes",
        "intuition",
        "two",
        "ground",
        "knowledgenamely",
        "immediate",
        "consciousness",
        "feeling",
        "one",
        "hand",
        "argumentation",
        "argumentation",
        "deduction",
        "knowledge",
        "ultimately",
        "derived",
        "immediately",
        "apprehended",
        "either",
        "sensation",
        "understanding",
        "immediate",
        "consciousness",
        "feeling",
        "mind",
        "awareness",
        "existence",
        "mental",
        "state",
        "price",
        "share",
        "immediacy",
        "intuition",
        "unlike",
        "intuition",
        "object",
        "selfevident",
        "proposition",
        "immediate",
        "selfconsciousness",
        "immediate",
        "apprehension",
        "sensation",
        "intuition",
        "immediate",
        "apprehension",
        "understanding",
        "way",
        "apprehend",
        "selfevident",
        "truth",
        "general",
        "abstract",
        "idea",
        "anything",
        "else",
        "may",
        "discover",
        "without",
        "making",
        "use",
        "process",
        "reasoning",
        "claim",
        "intuition",
        "immediate",
        "apprehension",
        "understanding",
        "suggests",
        "notion",
        "intuition",
        "price",
        "akin",
        "current",
        "account",
        "intuition",
        "intellectual",
        "seemings",
        "presentation",
        "bealer",
        "chudnoff",
        "intellectual",
        "seemings",
        "intellectual",
        "analogue",
        "perceptual",
        "seemings",
        "certain",
        "thing",
        "seem",
        "perceptually",
        "certain",
        "way",
        "eg",
        "coloured",
        "straight",
        "certain",
        "proposition",
        "seem",
        "true",
        "present",
        "mind",
        "true",
        "seemings",
        "belief",
        "something",
        "seem",
        "true",
        "even",
        "though",
        "one",
        "believe",
        "eg",
        "may",
        "seem",
        "true",
        "natural",
        "number",
        "even",
        "number",
        "know",
        "false",
        "believe",
        "similarly",
        "price",
        "view",
        "intuition",
        "belief",
        "certain",
        "characteristic",
        "pretheoretical",
        "nonderivative",
        "firmly",
        "held",
        "etc",
        "belief",
        "immediate",
        "apprehension",
        "anything",
        "though",
        "may",
        "based",
        "apprehension",
        "one",
        "might",
        "tempted",
        "think",
        "perceptual",
        "belief",
        "belief",
        "cat",
        "asleep",
        "front",
        "immediate",
        "apprehension",
        "would",
        "confuse",
        "perceptual",
        "apprehension",
        "cat",
        "belief",
        "based",
        "apprehension",
        "belief",
        "like",
        "perceptual",
        "belief",
        "based",
        "immediate",
        "experience",
        "sensory",
        "intuition",
        "cat",
        "sleeping",
        "front",
        "sensory",
        "intuition",
        "price",
        "understands",
        "intellectual",
        "intuition",
        "something",
        "closely",
        "akin",
        "experiential",
        "presentation",
        "seeming",
        "main",
        "difference",
        "early",
        "intuitionists",
        "notion",
        "intuition",
        "intellectual",
        "seemings",
        "latter",
        "standardly",
        "regarded",
        "nonfactivethat",
        "intuition",
        "p",
        "sense",
        "entail",
        "p",
        "apprehension",
        "p",
        "sound",
        "factive",
        "however",
        "one",
        "apprehend",
        "something",
        "apprehended",
        "present",
        "mind",
        "apprehension",
        "thing",
        "representation",
        "whereas",
        "modern",
        "epistemologist",
        "regard",
        "intuition",
        "understood",
        "intellectual",
        "seeming",
        "presentation",
        "something",
        "analogous",
        "nonfactive",
        "notion",
        "perceptual",
        "experience",
        "look",
        "like",
        "classic",
        "intuitionists",
        "regarded",
        "intuition",
        "analogous",
        "factive",
        "notion",
        "perception",
        "virtue",
        "modern",
        "modest",
        "notion",
        "intuition",
        "allows",
        "intuition",
        "fallible",
        "loses",
        "appeal",
        "direct",
        "realist",
        "account",
        "price",
        "seems",
        "work",
        "certain",
        "proposition",
        "fact",
        "immediately",
        "present",
        "mind",
        "scope",
        "intuitionists",
        "disjunctivist",
        "intuition",
        "could",
        "maintain",
        "intuition",
        "apprehension",
        "intellectual",
        "seemings",
        "subjectively",
        "tell",
        "one",
        "one",
        "might",
        "argue",
        "different",
        "state",
        "evident",
        "anyone",
        "defended",
        "view",
        "intuition",
        "clear",
        "intuitionists",
        "understand",
        "intuition",
        "perceptual",
        "quasiperceptual",
        "model",
        "many",
        "use",
        "notion",
        "w",
        "d",
        "ross",
        "example",
        "us",
        "notion",
        "apprehension",
        "tends",
        "base",
        "moral",
        "theory",
        "largely",
        "considered",
        "moral",
        "conviction",
        "moral",
        "conviction",
        "thoughtful",
        "welleducated",
        "people",
        "data",
        "ethic",
        "senseperceptions",
        "data",
        "natural",
        "science",
        "conviction",
        "however",
        "certain",
        "type",
        "belief",
        "rather",
        "intellectual",
        "apprehension",
        "seeming",
        "look",
        "like",
        "find",
        "two",
        "notion",
        "intuition",
        "intuitionist",
        "thoughtone",
        "understood",
        "intellectual",
        "seeming",
        "apprehension",
        "pretheoretical",
        "noninferred",
        "firmly",
        "held",
        "belief",
        "conviction",
        "one",
        "opt",
        "make",
        "difference",
        "epistemology",
        "like",
        "epistemic",
        "foundationalists",
        "price",
        "insists",
        "reasoning",
        "knowledge",
        "must",
        "ultimately",
        "rest",
        "proposition",
        "inferred",
        "premise",
        "ethical",
        "intuition",
        "noninferred",
        "basis",
        "knowledge",
        "selfevident",
        "truth",
        "grasped",
        "intuition",
        "however",
        "important",
        "keep",
        "intuition",
        "selfevidence",
        "separate",
        "number",
        "reason",
        "first",
        "conscious",
        "intuition",
        "certain",
        "mental",
        "state",
        "either",
        "noninferential",
        "belief",
        "intellectual",
        "seeming",
        "selfevident",
        "proposition",
        "conscious",
        "mental",
        "state",
        "second",
        "intuition",
        "way",
        "aware",
        "selfevident",
        "proposition",
        "whereas",
        "selfevident",
        "proposition",
        "thing",
        "known",
        "way",
        "proposition",
        "could",
        "pace",
        "price",
        "believed",
        "without",
        "intuition",
        "explain",
        "later",
        "one",
        "might",
        "argument",
        "lead",
        "one",
        "believe",
        "selfevident",
        "proposition",
        "one",
        "may",
        "believe",
        "basis",
        "authoritative",
        "testimony",
        "thirdly",
        "may",
        "turn",
        "thing",
        "selfevident",
        "proposition",
        "grasped",
        "intuition",
        "instance",
        "may",
        "moral",
        "intuition",
        "concrete",
        "case",
        "various",
        "trolley",
        "case",
        "see",
        "various",
        "anticonsequentialist",
        "counterexamples",
        "obvious",
        "content",
        "intuition",
        "selfevident",
        "proposition",
        "whether",
        "may",
        "depend",
        "selfevidence",
        "understood",
        "price",
        "claim",
        "selfevident",
        "truth",
        "incapable",
        "proof",
        "classical",
        "intuitionists",
        "endorse",
        "view",
        "although",
        "ross",
        "arguably",
        "exception",
        "easily",
        "missed",
        "state",
        "one",
        "point",
        "selfevident",
        "moral",
        "proposition",
        "proved",
        "certainly",
        "need",
        "proof",
        "elsewhere",
        "right",
        "good",
        "make",
        "restricted",
        "claim",
        "proposition",
        "need",
        "proof",
        "despite",
        "fact",
        "sometimes",
        "make",
        "claim",
        "receive",
        "proof",
        "mean",
        "argument",
        "claim",
        "seem",
        "reflect",
        "considered",
        "view",
        "evidence",
        "found",
        "article",
        "written",
        "three",
        "year",
        "publication",
        "right",
        "good",
        "explicitly",
        "state",
        "fact",
        "something",
        "inferred",
        "prove",
        "seen",
        "intuitively",
        "think",
        "proposition",
        "inferred",
        "justified",
        "proposition",
        "selfevident",
        "clearly",
        "think",
        "selfevident",
        "rule",
        "possibility",
        "proof",
        "case",
        "nothing",
        "notion",
        "selfevident",
        "proposition",
        "rule",
        "justification",
        "argument",
        "proposition",
        "selfevident",
        "proposition",
        "one",
        "justified",
        "believing",
        "without",
        "argument",
        "rule",
        "possibility",
        "may",
        "argument",
        "justification",
        "proposition",
        "may",
        "believed",
        "basis",
        "since",
        "argument",
        "needed",
        "u",
        "justified",
        "believing",
        "selfevident",
        "proposition",
        "may",
        "called",
        "epistemically",
        "supererogatory",
        "although",
        "argument",
        "selfevident",
        "intuitive",
        "proposition",
        "intuition",
        "understood",
        "intellectual",
        "seemings",
        "intuition",
        "justified",
        "easily",
        "missed",
        "tend",
        "identify",
        "intuition",
        "belief",
        "based",
        "rather",
        "intellectual",
        "seemings",
        "belief",
        "based",
        "take",
        "intuition",
        "intellectual",
        "seeming",
        "intuition",
        "justified",
        "perceptual",
        "seeming",
        "take",
        "perceptual",
        "seeming",
        "seeming",
        "wall",
        "green",
        "perceptual",
        "seeming",
        "could",
        "explained",
        "various",
        "way",
        "odd",
        "suppose",
        "experience",
        "could",
        "justified",
        "anything",
        "rule",
        "possibility",
        "belief",
        "based",
        "could",
        "justified",
        "certain",
        "sense",
        "passive",
        "relation",
        "seemings",
        "similarly",
        "proposition",
        "present",
        "mind",
        "true",
        "presentation",
        "justified",
        "although",
        "belief",
        "based",
        "might",
        "add",
        "proposition",
        "intuited",
        "seeming",
        "true",
        "conclusion",
        "could",
        "arrive",
        "certain",
        "proposition",
        "present",
        "mind",
        "may",
        "reason",
        "ross",
        "switch",
        "making",
        "stronger",
        "claim",
        "selfevident",
        "proposition",
        "justified",
        "weaker",
        "claim",
        "need",
        "justification",
        "mind",
        "belief",
        "selfevident",
        "proposition",
        "said",
        "could",
        "justified",
        "intuition",
        "apprehension",
        "proposition",
        "said",
        "could"
    ]
}