{
    "main_text": "Intuitionist epistemology || Self-evidence\n1.2 Self-evidence\n\n\nThe notion of a self-evident proposition is a term of art in\nintuitionist thought, and needs to be distinguished from certain\ncommon sense understandings with which it may easily be conflated. The\nfirst thing to note is that a self-evident proposition is not the same\nas an obvious truth. To begin with, obviousness is relative to certain\nindividuals or groups. What is obvious to you may not be obvious to\nme.  But self-evidence is not relative in this way. Although a\nproposition may be evident to one person but not to another, it could\nnot be self-evident to one person, but not to another. A proposition\nis just self-evident, not self-evident to someone. Secondly,\nthere are many obvious truths that are not self-evident. Certain\nwell-known empirical truths, for example, that if I drop a heavy\nobject it will fall, or that the world is bigger than a football, are\nobvious but not self-evident. There are also self-evident propositions\nthat may not be obvious to everyone, at least prior to reflection,\ne.g., that if all As are Bs and no Bs are Cs then no Cs are\nAs, or that one man can be the father and grandfather of the same child. \n \n\nWhat then is it for a proposition to be self-evident? Locke says that\na self-evident proposition is one that “carries its own light\nand evidence with it, and needs no other proof: he that understands\nthe terms, assents to it for its own sake” (1969, 139). Price\ntells us that a self-evident proposition is immediate, and needs no\nfurther proof, and goes on to say that self-evident propositions need\nonly be understood to gain assent 1758/1969, 187). Ross writes, a\nself-evident proposition is “evident without any need of proof,\nor of evidence beyond itself” (1930/2002, 29), and Broad\ndescribes self-evident propositions as being “such that a\nrational being of sufficient insight and intelligence could see it to\nbe true by merely inspecting it and reflecting on its terms and their\nmode of combination” (1936, 102–3). These passages may\nhave led to the standard understanding of a self-evident proposition\nthat one finds in Shafer-Landau (2003, 247) and Audi (2001, 603; see\nalso Audi 2008, 478). Audi, for instance, writes that self evident\npropositions are “truths such that (a) adequately understanding\nthem is sufficient justification for believing them …, and (b)\nbelieving them on the basis of adequately understanding them entails\nknowing them” (2008, 478).\n\n\nOne should distinguish knowing a self-evident proposition from knowing\nthat that proposition is self-evident. The former does not imply the\nlatter. Someone might know some self-evident proposition, such as that\nif A is better than B and B is better than C then\nA is better than C, but lack the concept of self-evidence, so\ncouldn’t know that that proposition is self-evident. One might even\nknow a self-evident proposition whilst endorsing a theory according to\nwhich no propositions are self-evident.\n\n\nBut given that a proposition may seem to be self-evident when it is not,\nit is useful to have a way of discriminating the merely apparent from\nthe real ones. Sidgwick’s criteria may be regarded as helping us do\nthis. According to Sidgwick, to be sure that a proposition is self-evident it must:\n\nbe clear and distinct\nbe ascertained by careful reflection\nbe consistent with other self-evident truths\nattract general consensus (1874/1967, 338)\n\n\n\nIf some apparent self-evident proposition does not have all of these\nfeatures then we should reduce our confidence that it is a genuine\nself-evident proposition. It is, however, a striking feature of Sidgwick’s own\nprinciples that they do not pass this test. But whether we can come to\nknow that some proposition is self-evident in this, or some other way,\nthe point is that we do not need to know that some proposition is\nself-evident to know that it is true.\n\n\nAccording to the standard account, a self-evident proposition is one\nwhich an adequate understanding of the proposition justifies us in\nbelieving it. But all that Locke and Price say is that we need an\nunderstanding of a self-evident proposition in order to believe it,\nand presumably to be justified in believing it. They do not say that\nour understanding provides that justification, or that when we believe\nit, we believe it on the basis of our understanding. Indeed the idea\nthat it is our understanding of a self-evident proposition that\njustifies us in believing it may sound odd to many people. Certainly\nif one assumes that if p justifies belief in q, then p is\na reason to believe q, it is hard to see how our understanding\njustifies us in believing the proposition understood, for no one can\nclaim that their understanding of a proposition gives them a reason to\nbelieve it. One explanation of this is that the sort of thing that can\nprovide reasons to believe that p are either evidence that p\nor, more controversially, pragmatic considerations, such as that\nbelieving that p will have certain good consequences. An adequate\nunderstanding of a proposition is neither of these things. The fact\nthat I understand some proposition is not something that would make\nbelieving that proposition have any good consequences, and my\nunderstanding is not evidence for the truth of the proposition\nunderstood. Evidence is standardly understood as something that makes\nthe proposition it is evidence for more probable. But an adequate\nunderstanding of a proposition does not make that proposition more\nprobable, so is not evidence for it. Since an understanding of a\nproposition is neither a pragmatic nor an evidential consideration, it\nseems it is not the right sort of thing to give us a reason to believe\nthat proposition, and so not the right sort of thing to justify that\nbelief. Robert Audi has, however, recently offered an account of\nadequate understanding that attempts to deal with this kind of\nobjection. He does not claim that adequate understanding of a\nproposition is evidence for that proposition, but claims that adequate\nunderstanding puts us in touch with the truth-makers of the\nself-evident proposition, and it is this that makes it the right sort\nof thing to justify belief (Audi, 2019, 379–380) \n\n\nBut the oddity of supposing that it is our understanding that\njustifies us in believing a self-evident proposition does not rest on\nthe assumption that justification is to be defined as reason to\nbelieve, or that what gives us reason to believe that p is\nevidence for the truth of p or some benefit of believing this. If you\nask someone why they believe some apparently self-evident proposition,\nsuch as that agony is bad, it would be very surprising if they replied\nby saying “I believe it because I understand it”.\n\n\nGiven these worries about whether our understanding can justify us in\nbelieving the proposition understood, we should ask whether there is\nanything else that might justify us in believing a self-evident\nproposition. If intuitions are beliefs, then our intuition that p\ncannot justify us in believing p. The same is true if intuitions are\ninclinations to believe, as Williamson (2000), Sosa (2007) and Earlenbaugh and Molyneux, 2009) claim, for the fact that I am\ninclined to believe some proposition is no justification for believing\nit. But if intuitions are intellectual seemings, then they may be able\nto justify the beliefs based on them. For with this understanding of\nan intuition we can say that what justifies our belief in a\nself-evident proposition is that it seems true, just as we might say\nthat what justifies us in having some experiential belief is that\nperceptually, the world seems to be that way. Why do you believe the\nwall is green? Because it seems green. Why do you think that agony is\nbad? Because it seems bad.\n\n\nIf intuitions rather than our understanding of their content justify\nus in believing that content, then intuitionists should understand a\nself-evident proposition as follows:\n\n\nA self-evident proposition is one of which a clear intuition is\nsufficient justification for believing it, and for believing it on the\nbasis of that intuition (see Stratton-Lake, 2016, 38).\n\n\nAn adequate understanding is necessary for one to be justified in this\nway, but this is not because understanding provides justification;\nrather, it is because it is needed to get the proposition clearly in\nview, and so enables a clear intuition of it. But it is the intuition\nthat justifies, not the understanding.\n\n\nWhether this account helps intuitionists will depend on a more general\nmetaphilosophical debate about the role of intuitions in philosophy,\nand whether intuitions justify. There is a difference, though. The\nmore general debate is about whether intuitions provide evidence for\nbelieving or rejecting certain theories, whereas the intuitionist\nneeds intuitions to justify beliefs with the same content. Secondly,\nthere might be reason to think that although intuitions can provide\njustification in other areas of philosophy, they cannot do that in\nmorality. For instance, one might think that people’s moral\nintuitions vary too much to be reliable indicators of truth, or that\nin morality emotions can distort our intuitions (see\nSinnott-Armstrong, 2006), or that we only have the moral intuitions we\ndo because having those beliefs has survival value (Street, 2006).\n Some recent intuitionists have shied away from the view that\ncertain moral propositions are self-evident and have, instead, argued\nthat all the intuitionist needs is the claim that intuitions,\nunderstood as intellectual seemings, provide non-inferential\njustification for some of our moral beliefs (Huemer 2005, 106 and\nBedke 2008—though Bedke rejects intuitionism). As these authors\nview things, claiming that some at least of the propositions intuited\nare self-evident does not gain intuitionists anything.\n",
    "section_title": "1.2 Self-evidence",
    "entry_title": "Intuitionism in Ethics",
    "hierarchy_title": "Intuitionism in Ethics || Intuitionist epistemology || Self-evidence",
    "tokenized_text": [
        "intuitionist",
        "epistemology",
        "selfevidence",
        "selfevidence",
        "notion",
        "selfevident",
        "proposition",
        "term",
        "art",
        "intuitionist",
        "thought",
        "need",
        "distinguished",
        "certain",
        "common",
        "sense",
        "understanding",
        "may",
        "easily",
        "conflated",
        "first",
        "thing",
        "note",
        "selfevident",
        "proposition",
        "obvious",
        "truth",
        "begin",
        "obviousness",
        "relative",
        "certain",
        "individual",
        "group",
        "obvious",
        "may",
        "obvious",
        "selfevidence",
        "relative",
        "way",
        "although",
        "proposition",
        "may",
        "evident",
        "one",
        "person",
        "another",
        "could",
        "selfevident",
        "one",
        "person",
        "another",
        "proposition",
        "selfevident",
        "selfevident",
        "someone",
        "secondly",
        "many",
        "obvious",
        "truth",
        "selfevident",
        "certain",
        "wellknown",
        "empirical",
        "truth",
        "example",
        "drop",
        "heavy",
        "object",
        "fall",
        "world",
        "bigger",
        "football",
        "obvious",
        "selfevident",
        "also",
        "selfevident",
        "proposition",
        "may",
        "obvious",
        "everyone",
        "least",
        "prior",
        "reflection",
        "eg",
        "b",
        "b",
        "c",
        "c",
        "one",
        "man",
        "father",
        "grandfather",
        "child",
        "proposition",
        "selfevident",
        "locke",
        "say",
        "selfevident",
        "proposition",
        "one",
        "carry",
        "light",
        "evidence",
        "need",
        "proof",
        "understands",
        "term",
        "assent",
        "sake",
        "price",
        "tell",
        "u",
        "selfevident",
        "proposition",
        "immediate",
        "need",
        "proof",
        "go",
        "say",
        "selfevident",
        "proposition",
        "need",
        "understood",
        "gain",
        "assent",
        "ross",
        "writes",
        "selfevident",
        "proposition",
        "evident",
        "without",
        "need",
        "proof",
        "evidence",
        "beyond",
        "broad",
        "describes",
        "selfevident",
        "proposition",
        "rational",
        "sufficient",
        "insight",
        "intelligence",
        "could",
        "see",
        "true",
        "merely",
        "inspecting",
        "reflecting",
        "term",
        "mode",
        "combination",
        "passage",
        "may",
        "led",
        "standard",
        "understanding",
        "selfevident",
        "proposition",
        "one",
        "find",
        "shaferlandau",
        "audi",
        "see",
        "also",
        "audi",
        "audi",
        "instance",
        "writes",
        "self",
        "evident",
        "proposition",
        "truth",
        "adequately",
        "understanding",
        "sufficient",
        "justification",
        "believing",
        "b",
        "believing",
        "basis",
        "adequately",
        "understanding",
        "entail",
        "knowing",
        "one",
        "distinguish",
        "knowing",
        "selfevident",
        "proposition",
        "knowing",
        "proposition",
        "selfevident",
        "former",
        "imply",
        "latter",
        "someone",
        "might",
        "know",
        "selfevident",
        "proposition",
        "better",
        "b",
        "b",
        "better",
        "c",
        "better",
        "c",
        "lack",
        "concept",
        "selfevidence",
        "know",
        "proposition",
        "selfevident",
        "one",
        "might",
        "even",
        "know",
        "selfevident",
        "proposition",
        "whilst",
        "endorsing",
        "theory",
        "according",
        "proposition",
        "selfevident",
        "given",
        "proposition",
        "may",
        "seem",
        "selfevident",
        "useful",
        "way",
        "discriminating",
        "merely",
        "apparent",
        "real",
        "one",
        "sidgwick",
        "criterion",
        "may",
        "regarded",
        "helping",
        "u",
        "according",
        "sidgwick",
        "sure",
        "proposition",
        "selfevident",
        "must",
        "clear",
        "distinct",
        "ascertained",
        "careful",
        "reflection",
        "consistent",
        "selfevident",
        "truth",
        "attract",
        "general",
        "consensus",
        "apparent",
        "selfevident",
        "proposition",
        "feature",
        "reduce",
        "confidence",
        "genuine",
        "selfevident",
        "proposition",
        "however",
        "striking",
        "feature",
        "sidgwick",
        "principle",
        "pas",
        "test",
        "whether",
        "come",
        "know",
        "proposition",
        "selfevident",
        "way",
        "point",
        "need",
        "know",
        "proposition",
        "selfevident",
        "know",
        "true",
        "according",
        "standard",
        "account",
        "selfevident",
        "proposition",
        "one",
        "adequate",
        "understanding",
        "proposition",
        "justifies",
        "u",
        "believing",
        "locke",
        "price",
        "say",
        "need",
        "understanding",
        "selfevident",
        "proposition",
        "order",
        "believe",
        "presumably",
        "justified",
        "believing",
        "say",
        "understanding",
        "provides",
        "justification",
        "believe",
        "believe",
        "basis",
        "understanding",
        "indeed",
        "idea",
        "understanding",
        "selfevident",
        "proposition",
        "justifies",
        "u",
        "believing",
        "may",
        "sound",
        "odd",
        "many",
        "people",
        "certainly",
        "one",
        "assumes",
        "p",
        "justifies",
        "belief",
        "q",
        "p",
        "reason",
        "believe",
        "q",
        "hard",
        "see",
        "understanding",
        "justifies",
        "u",
        "believing",
        "proposition",
        "understood",
        "one",
        "claim",
        "understanding",
        "proposition",
        "give",
        "reason",
        "believe",
        "one",
        "explanation",
        "sort",
        "thing",
        "provide",
        "reason",
        "believe",
        "p",
        "either",
        "evidence",
        "p",
        "controversially",
        "pragmatic",
        "consideration",
        "believing",
        "p",
        "certain",
        "good",
        "consequence",
        "adequate",
        "understanding",
        "proposition",
        "neither",
        "thing",
        "fact",
        "understand",
        "proposition",
        "something",
        "would",
        "make",
        "believing",
        "proposition",
        "good",
        "consequence",
        "understanding",
        "evidence",
        "truth",
        "proposition",
        "understood",
        "evidence",
        "standardly",
        "understood",
        "something",
        "make",
        "proposition",
        "evidence",
        "probable",
        "adequate",
        "understanding",
        "proposition",
        "make",
        "proposition",
        "probable",
        "evidence",
        "since",
        "understanding",
        "proposition",
        "neither",
        "pragmatic",
        "evidential",
        "consideration",
        "seems",
        "right",
        "sort",
        "thing",
        "give",
        "u",
        "reason",
        "believe",
        "proposition",
        "right",
        "sort",
        "thing",
        "justify",
        "belief",
        "robert",
        "audi",
        "however",
        "recently",
        "offered",
        "account",
        "adequate",
        "understanding",
        "attempt",
        "deal",
        "kind",
        "objection",
        "claim",
        "adequate",
        "understanding",
        "proposition",
        "evidence",
        "proposition",
        "claim",
        "adequate",
        "understanding",
        "put",
        "u",
        "touch",
        "truthmakers",
        "selfevident",
        "proposition",
        "make",
        "right",
        "sort",
        "thing",
        "justify",
        "belief",
        "audi",
        "oddity",
        "supposing",
        "understanding",
        "justifies",
        "u",
        "believing",
        "selfevident",
        "proposition",
        "rest",
        "assumption",
        "justification",
        "defined",
        "reason",
        "believe",
        "give",
        "u",
        "reason",
        "believe",
        "p",
        "evidence",
        "truth",
        "p",
        "benefit",
        "believing",
        "ask",
        "someone",
        "believe",
        "apparently",
        "selfevident",
        "proposition",
        "agony",
        "bad",
        "would",
        "surprising",
        "replied",
        "saying",
        "believe",
        "understand",
        "given",
        "worry",
        "whether",
        "understanding",
        "justify",
        "u",
        "believing",
        "proposition",
        "understood",
        "ask",
        "whether",
        "anything",
        "else",
        "might",
        "justify",
        "u",
        "believing",
        "selfevident",
        "proposition",
        "intuition",
        "belief",
        "intuition",
        "p",
        "justify",
        "u",
        "believing",
        "p",
        "true",
        "intuition",
        "inclination",
        "believe",
        "williamson",
        "sosa",
        "earlenbaugh",
        "molyneux",
        "claim",
        "fact",
        "inclined",
        "believe",
        "proposition",
        "justification",
        "believing",
        "intuition",
        "intellectual",
        "seemings",
        "may",
        "able",
        "justify",
        "belief",
        "based",
        "understanding",
        "intuition",
        "say",
        "justifies",
        "belief",
        "selfevident",
        "proposition",
        "seems",
        "true",
        "might",
        "say",
        "justifies",
        "u",
        "experiential",
        "belief",
        "perceptually",
        "world",
        "seems",
        "way",
        "believe",
        "wall",
        "green",
        "seems",
        "green",
        "think",
        "agony",
        "bad",
        "seems",
        "bad",
        "intuition",
        "rather",
        "understanding",
        "content",
        "justify",
        "u",
        "believing",
        "content",
        "intuitionists",
        "understand",
        "selfevident",
        "proposition",
        "follows",
        "selfevident",
        "proposition",
        "one",
        "clear",
        "intuition",
        "sufficient",
        "justification",
        "believing",
        "believing",
        "basis",
        "intuition",
        "see",
        "strattonlake",
        "adequate",
        "understanding",
        "necessary",
        "one",
        "justified",
        "way",
        "understanding",
        "provides",
        "justification",
        "rather",
        "needed",
        "get",
        "proposition",
        "clearly",
        "view",
        "enables",
        "clear",
        "intuition",
        "intuition",
        "justifies",
        "understanding",
        "whether",
        "account",
        "help",
        "intuitionists",
        "depend",
        "general",
        "metaphilosophical",
        "debate",
        "role",
        "intuition",
        "philosophy",
        "whether",
        "intuition",
        "justify",
        "difference",
        "though",
        "general",
        "debate",
        "whether",
        "intuition",
        "provide",
        "evidence",
        "believing",
        "rejecting",
        "certain",
        "theory",
        "whereas",
        "intuitionist",
        "need",
        "intuition",
        "justify",
        "belief",
        "content",
        "secondly",
        "might",
        "reason",
        "think",
        "although",
        "intuition",
        "provide",
        "justification",
        "area",
        "philosophy",
        "morality",
        "instance",
        "one",
        "might",
        "think",
        "people",
        "moral",
        "intuition",
        "vary",
        "much",
        "reliable",
        "indicator",
        "truth",
        "morality",
        "emotion",
        "distort",
        "intuition",
        "see",
        "sinnottarmstrong",
        "moral",
        "intuition",
        "belief",
        "survival",
        "value",
        "street",
        "recent",
        "intuitionists",
        "shied",
        "away",
        "view",
        "certain",
        "moral",
        "proposition",
        "selfevident",
        "instead",
        "argued",
        "intuitionist",
        "need",
        "claim",
        "intuition",
        "understood",
        "intellectual",
        "seemings",
        "provide",
        "noninferential",
        "justification",
        "moral",
        "belief",
        "huemer",
        "bedke",
        "though",
        "bedke",
        "reject",
        "intuitionism",
        "author",
        "view",
        "thing",
        "claiming",
        "least",
        "proposition",
        "intuited",
        "selfevident",
        "gain",
        "intuitionists",
        "anything"
    ]
}