{
    "main_text": "Intuitionist metaphysics || Indefinable, non-natural properties\n2.1 Indefinable, non-natural properties\n\n\nAlong with its moral epistemology, a distinctive feature of\nintuitionist thought is its non-naturalist realism. Intuitionists\nmaintain that moral judgements are cognitive states, and that some at\nleast of these judgements are true. They are true when the things\nreferred to have the moral property that is ascribed to them by the\njudgement. The moral properties that intuitionists tended to focus on were\nthe thin moral properties of goodness and rightness. These properties\nare, they maintained, simple, non-natural properties. It is not always\nclear how they understood the notion of a non-natural property (more on\nthis below), but for now we can say that they denied that moral\nproperties can be defined wholly in terms of psychological,\nsociological, or biological properties. Some intuitionists allowed that\ngoodness can be defined in terms of rightness (Sidgwick and Ewing) or\nrightness in terms of goodness (early Moore). But all intuitionists\nmaintained that at least one of these moral properties is simple, or\nindefinable.\n\n\nAlthough their view is about the nature of moral properties, they\noften put their point in terms of moral concepts or ideas, and\nmaintained that these concepts are either unanalysable, or if\nanalysable, not analysable wholly in terms of natural concepts. It\nseems they assumed that if a concept was indefinable then its\ncorresponding property would be indefinable, and vice versa. Many\nphilosophers today would deny this assumption.\n\n\nThe simplicity of moral properties, such as rightness and goodness,\nand our ideas of them, was important for early intuitionists such as\nPrice, as he accepted the empiricist doctrine that simple ideas cannot\nbe invented but must be acquired by immediate intuition, as all simple\nideas must “be ascribed to some power of immediate\nperception in the human mind” 1758/1969, 141), i.e., either\nsensibility or the\n understanding.[11]\n Consequently, the ideas of right and\nwrong must be immediate perceptions of either sensibility or the\n understanding.[12]\n\n\n\nIf right and wrong are just feelings of approval or disapproval caused\nin us by natural properties or objects, then the idea of right and\nwrong will be given by our senses, for these ideas will be merely the\neffect that the perception of certain things has on sensibility. If,\nhowever, right and wrong were real properties of actions, then they\ncould not be apprehended by any empirical sense, for we have no such\nsensation of right and wrong when we apprehend right or wrong actions.\nRather, what we see is that these actions are right, or\n wrong.[13]\nThis seeing still counts as\nintuition, as it is an immediate apprehension, but it is intellectual\nrather than sensible\n intuition.[14]\n\n\nIt is scarcely conceivable that anyone can impartially attend to the\nnature of his own perceptions, and determine that, when he thinks\ngratitude and beneficence to be right, he perceives nothing\ntrue of them, and understands nothing, but only\nreceives an impression from sense. (Price, 1758/1969,\n144–5)\n\n\n\nPrice concedes that certain feelings may attend our apprehension of\nright and wrong, but these impressions are merely the consequence of\nour perception of right and wrong. They are not what is perceived. For\nPrice I approve of some act because I see that it is right or good.\n\n\nBut even if Price is right that the ideas of right and wrong are\nsimple, and are grasped by the understanding, that does not imply that\nthey are non-natural.  For he allows that there are simple ideas of\nnatural properties, and that some of these, such as causality and\nequality, are grasped by the understanding rather than sensibility. So\na separate argument is needed for the non-natural nature of moral\nproperties.\n\n\nMoore is the intuitionist who laid most stress on the non-natural\nnature of moral properties, though his focus was on goodness rather\nthan rightness. In Principia Ethica Moore defines a natural\nproperty as one that can exist by itself in time and not merely as a\nproperty of some natural object (1903/1993a, 93). The idea is, then,\nthat natural properties, such as the pleasantness or squareness of an\nobject, can exist independently of that object, whereas the goodness\nof a good thing cannot exist independently of that thing.\n \n\nThis definition can be understood in terms of particular instances\nof some property or in terms of the universal—the property\nitself.  Either way it does not distinguish natural from non-natural\nproperties as Moore thought. It does not seem that the particular\ninstance of redness in some particular red object could exist apart\nfrom that object any more than the particular instance of goodness of\nsome good thing could. A particular instance of any property is a way\nthat something is, and the way that some particular thing is cannot be\nseparated from the particular thing that is that way.\n\n\nBut things are no better if we understand Moore’s definition in\nterms of universals, for on a Platonist theory of properties the\nuniversal could exist independently of any particular instance of it.\nIf this is true, it will be true of any property. This does not,\ntherefore, pick out what distinguishes the natural from the\nnon-natural. So if we are talking of property instances then no\nproperties can be separated from the things that instantiate them, and\nif we are talking of property types (properties as universals), then,\nat least on some views, all of them can be separated.\n\n\nMoore himself later abandoned this definition of the distinction\nbetween natural and non-natural properties, and described his earlier\naccount of a natural property as “utterly silly and\npreposterous” (1942, 582). In the Preface to the second edition\nof Principia Moore offers an alternative definition that is\nsuggested in chapter two of Principia. According to this\ndefinition, a natural property is one “with which it is the\nbusiness of the natural sciences or of Psychology to deal” (13).\nSince the term to be defined (‘natural’) appears in the\ndefinition, this definition may not seem very informative. But we can\nreplace the term ‘natural sciences’ with ‘empirical\nsciences’ (understood to include psychology and sociology) to\nget a useful and workable epistemological definition of a natural\nproperty.  On this account, then, natural facts can be known by purely\nempirical means, whereas non-natural moral facts cannot be known in\nthis way.  Such facts involve an essentially a priori element.\n\n\nIntuitively the intuitionists seem right. Empirical investigation can\ntell us many things about the world, but it does not seem that it can\ntell whether certain acts are right or wrong, good or bad. This is not\nto say that our moral views are not revisable in the light of\nempirical findings.  For instance if science told us that a\nlobster’s neurological system is sufficiently advanced for it to\nfeel pain, we’d revise our view about the permissibility of\nboiling them alive. But all that science would have told us is that\nlobsters feel pain when boiled alive. Science does not inform us that\nboiling them alive is wrong.  That seems to be something that cannot\nbe known empirically.\n\n\nMoore’s open question argument can be regarded as giving form to this\nintuition. If the moral property of being good, for instance, could be\ndefined in wholly psychological, biological, or sociological terms,\nthen moral truths would turn out to be either psychological,\nbiological or sociological truths, which could then be discovered by\nempirical research by the appropriate science. But, Moore argues, all\nsuch definitions must fail, for it is always an open question whether\nthe thing that has the relevant empirical property is good. Moore’s\nargument can be captured as follows:\n\nIf some property F\ncould be defined in terms of some other property G, then the\nquestion “is something which is G, F?” would be\nclosed.\nFor any naturalistic\ndefinition of goodness, it would always be an open question whether\nsomething that has the relevant natural property is good.\nTherefore, goodness\ncannot be naturalistically defined.\n\n \n\nAn open question is one that is not closed, and a closed question\nis one the asking of which betrays a lack of understanding of the\nconcepts involved. For instance, if I asked “Jones is a widow,\nbut was she ever married?”, this would show that I don’t really\nunderstand the term “widow”. So this question is closed.\nMoore claims that we can test any naturalistic definition of goodness\nby asking whether something that has those natural properties is good,\nand then seeing whether this question is open or closed. If the\ndefinition is true, then the question must be closed, so if it is\nopen, the definition must be false. \n\n\nSuppose, for instance, someone proposes that goodness can be defined\nin terms of causality and pleasure. To be good, they claim, is just to\ncause pleasure. Moore’s view is that if this definition were\ncorrect, it would be a closed question whether something that causes\npleasure is good. For in effect one would be asking whether something\nthat causes pleasure causes pleasure, and that is clearly a closed\nquestion. But, Moore insists, the question “is something\nthat causes pleasure good?” is an open question. One could,\nwithout conceptual confusion, debate whether something that causes\npleasure is good. So goodness cannot be defined as causes pleasure.\n\n\nMoore assumes that this will be true of every putative naturalistic\ndefinition of goodness, whether it be in terms of second-order desires,\nsocial approval, being more evolved, or whatever. All of these\nnaturalistic definitions would fail the open question argument. If he\nis right, and goodness cannot be defined wholly with reference to\nconcepts from the empirical sciences, then goodness is a sui generis\nnotion, i.e., is one that can only be understood in its own, evaluative\nterms.\n\n\nMoore’s argument has a great deal of intuitive force, but has\nbeen subject to various objections, and it is not clear that all of\nthem can be answered. One of the first was that it just begs the\nquestion against the naturalist. Moore only considers a few very crude\nnaturalistic definitions of goodness, and concludes from these that all\nnaturalistic definitions will fail the open question argument. Frankena\n(1939) objected that this was premature. We cannot know in advance that\nevery naturalistic definition will fail this test. We just have to wait\nand consider the proposals. To conclude from a few crude examples that\nall naturalistic definitions will fail is just bad induction.\n\n\nAnother objection is that the open question argument does not tell us\nanything distinctive about the concept of goodness, but is simply an\ninstance of the paradox of analysis. According to this paradox any true\nanalysis will be uninformative, because it will be reducible to a\ntautology, and any informative analysis will be false, because it\ncan’t be reduced to a tautology. According to earlier versions of\nwhat Moore called ‘the open question argument’, and on one\ninterpretation of Moore’s argument, the reason that good cannot\nbe analysed in naturalistic terms is that it turns what sounds like a\nsubstantive moral claim, e.g., that pleasure is good, into the empty\ntautology that pleasure is pleasure. But then this looks like a\nparticular instance of the paradox of analysis. To see this, consider\nthe following analysis of the concept ‘mammal’:\n\n(M)\nA mammal is a member of a species of which the \n                      females suckle their young.\n\n\n\nThis looks informative as it can tell us why whales and duck-billed\nplatypuses are mammals when they are so different in seemingly\nsignificant ways from other mammals. But if the analysis is true, and\n‘mammal’ just means ‘member of a species of which the\nfemales suckle their young’, then (M) means:\n\n(T)\nA member of a species of which the females suckle their\nyoung is a member of a species of which the females suckle their\nyoung\n\n\n\n(T) is, however, just an uninformative tautology. This is a quite\ngeneral problem in the theory of analysis, so if it applies to\nseemingly informative analyses of goodness, then that would reveal\nnothing distinctive about naturalistic analyses of moral terms.\n\n\nFurthermore, some analyses are not obvious. The analysis of the concept\nof a mammal is an example of a non-obvious analysis. It is for that\nreason that the question “A is a member of a species the female\nof which suckle their young, but is A a mammal?” will seem open,\neven though it is a true analysis. Similarly, a non-obvious\nnaturalistic definition of good may fail the open question test even\nthough it is true.\n",
    "section_title": "2.1 Indefinable, non-natural properties",
    "entry_title": "Intuitionism in Ethics",
    "hierarchy_title": "Intuitionism in Ethics || Intuitionist metaphysics || Indefinable, non-natural properties",
    "tokenized_text": [
        "intuitionist",
        "metaphysics",
        "indefinable",
        "nonnatural",
        "property",
        "indefinable",
        "nonnatural",
        "property",
        "along",
        "moral",
        "epistemology",
        "distinctive",
        "feature",
        "intuitionist",
        "thought",
        "nonnaturalist",
        "realism",
        "intuitionists",
        "maintain",
        "moral",
        "judgement",
        "cognitive",
        "state",
        "least",
        "judgement",
        "true",
        "true",
        "thing",
        "referred",
        "moral",
        "property",
        "ascribed",
        "judgement",
        "moral",
        "property",
        "intuitionists",
        "tended",
        "focus",
        "thin",
        "moral",
        "property",
        "goodness",
        "rightness",
        "property",
        "maintained",
        "simple",
        "nonnatural",
        "property",
        "always",
        "clear",
        "understood",
        "notion",
        "nonnatural",
        "property",
        "say",
        "denied",
        "moral",
        "property",
        "defined",
        "wholly",
        "term",
        "psychological",
        "sociological",
        "biological",
        "property",
        "intuitionists",
        "allowed",
        "goodness",
        "defined",
        "term",
        "rightness",
        "sidgwick",
        "ewing",
        "rightness",
        "term",
        "goodness",
        "early",
        "moore",
        "intuitionists",
        "maintained",
        "least",
        "one",
        "moral",
        "property",
        "simple",
        "indefinable",
        "although",
        "view",
        "nature",
        "moral",
        "property",
        "often",
        "put",
        "point",
        "term",
        "moral",
        "concept",
        "idea",
        "maintained",
        "concept",
        "either",
        "unanalysable",
        "analysable",
        "analysable",
        "wholly",
        "term",
        "natural",
        "concept",
        "seems",
        "assumed",
        "concept",
        "indefinable",
        "corresponding",
        "property",
        "would",
        "indefinable",
        "vice",
        "versa",
        "many",
        "philosopher",
        "today",
        "would",
        "deny",
        "assumption",
        "simplicity",
        "moral",
        "property",
        "rightness",
        "goodness",
        "idea",
        "important",
        "early",
        "intuitionists",
        "price",
        "accepted",
        "empiricist",
        "doctrine",
        "simple",
        "idea",
        "invented",
        "must",
        "acquired",
        "immediate",
        "intuition",
        "simple",
        "idea",
        "must",
        "ascribed",
        "power",
        "immediate",
        "perception",
        "human",
        "mind",
        "ie",
        "either",
        "sensibility",
        "understanding",
        "consequently",
        "idea",
        "right",
        "wrong",
        "must",
        "immediate",
        "perception",
        "either",
        "sensibility",
        "understanding",
        "right",
        "wrong",
        "feeling",
        "approval",
        "disapproval",
        "caused",
        "u",
        "natural",
        "property",
        "object",
        "idea",
        "right",
        "wrong",
        "given",
        "sens",
        "idea",
        "merely",
        "effect",
        "perception",
        "certain",
        "thing",
        "sensibility",
        "however",
        "right",
        "wrong",
        "real",
        "property",
        "action",
        "could",
        "apprehended",
        "empirical",
        "sense",
        "sensation",
        "right",
        "wrong",
        "apprehend",
        "right",
        "wrong",
        "action",
        "rather",
        "see",
        "action",
        "right",
        "wrong",
        "seeing",
        "still",
        "count",
        "intuition",
        "immediate",
        "apprehension",
        "intellectual",
        "rather",
        "sensible",
        "intuition",
        "scarcely",
        "conceivable",
        "anyone",
        "impartially",
        "attend",
        "nature",
        "perception",
        "determine",
        "think",
        "gratitude",
        "beneficence",
        "right",
        "perceives",
        "nothing",
        "true",
        "understands",
        "nothing",
        "receives",
        "impression",
        "sense",
        "price",
        "price",
        "concedes",
        "certain",
        "feeling",
        "may",
        "attend",
        "apprehension",
        "right",
        "wrong",
        "impression",
        "merely",
        "consequence",
        "perception",
        "right",
        "wrong",
        "perceived",
        "price",
        "approve",
        "act",
        "see",
        "right",
        "good",
        "even",
        "price",
        "right",
        "idea",
        "right",
        "wrong",
        "simple",
        "grasped",
        "understanding",
        "imply",
        "nonnatural",
        "allows",
        "simple",
        "idea",
        "natural",
        "property",
        "causality",
        "equality",
        "grasped",
        "understanding",
        "rather",
        "sensibility",
        "separate",
        "argument",
        "needed",
        "nonnatural",
        "nature",
        "moral",
        "property",
        "moore",
        "intuitionist",
        "laid",
        "stress",
        "nonnatural",
        "nature",
        "moral",
        "property",
        "though",
        "focus",
        "goodness",
        "rather",
        "rightness",
        "principia",
        "ethica",
        "moore",
        "defines",
        "natural",
        "property",
        "one",
        "exist",
        "time",
        "merely",
        "property",
        "natural",
        "object",
        "a",
        "idea",
        "natural",
        "property",
        "pleasantness",
        "squareness",
        "object",
        "exist",
        "independently",
        "object",
        "whereas",
        "goodness",
        "good",
        "thing",
        "exist",
        "independently",
        "thing",
        "definition",
        "understood",
        "term",
        "particular",
        "instance",
        "property",
        "term",
        "universalthe",
        "property",
        "either",
        "way",
        "distinguish",
        "natural",
        "nonnatural",
        "property",
        "moore",
        "thought",
        "seem",
        "particular",
        "instance",
        "redness",
        "particular",
        "red",
        "object",
        "could",
        "exist",
        "apart",
        "object",
        "particular",
        "instance",
        "goodness",
        "good",
        "thing",
        "could",
        "particular",
        "instance",
        "property",
        "way",
        "something",
        "way",
        "particular",
        "thing",
        "separated",
        "particular",
        "thing",
        "way",
        "thing",
        "better",
        "understand",
        "moore",
        "definition",
        "term",
        "universal",
        "platonist",
        "theory",
        "property",
        "universal",
        "could",
        "exist",
        "independently",
        "particular",
        "instance",
        "true",
        "true",
        "property",
        "therefore",
        "pick",
        "distinguishes",
        "natural",
        "nonnatural",
        "talking",
        "property",
        "instance",
        "property",
        "separated",
        "thing",
        "instantiate",
        "talking",
        "property",
        "type",
        "property",
        "universal",
        "least",
        "view",
        "separated",
        "moore",
        "later",
        "abandoned",
        "definition",
        "distinction",
        "natural",
        "nonnatural",
        "property",
        "described",
        "earlier",
        "account",
        "natural",
        "property",
        "utterly",
        "silly",
        "preposterous",
        "preface",
        "second",
        "edition",
        "principia",
        "moore",
        "offer",
        "alternative",
        "definition",
        "suggested",
        "chapter",
        "two",
        "principia",
        "according",
        "definition",
        "natural",
        "property",
        "one",
        "business",
        "natural",
        "science",
        "psychology",
        "deal",
        "since",
        "term",
        "defined",
        "natural",
        "appears",
        "definition",
        "definition",
        "may",
        "seem",
        "informative",
        "replace",
        "term",
        "natural",
        "science",
        "empirical",
        "science",
        "understood",
        "include",
        "psychology",
        "sociology",
        "get",
        "useful",
        "workable",
        "epistemological",
        "definition",
        "natural",
        "property",
        "account",
        "natural",
        "fact",
        "known",
        "purely",
        "empirical",
        "mean",
        "whereas",
        "nonnatural",
        "moral",
        "fact",
        "known",
        "way",
        "fact",
        "involve",
        "essentially",
        "priori",
        "element",
        "intuitively",
        "intuitionists",
        "seem",
        "right",
        "empirical",
        "investigation",
        "tell",
        "u",
        "many",
        "thing",
        "world",
        "seem",
        "tell",
        "whether",
        "certain",
        "act",
        "right",
        "wrong",
        "good",
        "bad",
        "say",
        "moral",
        "view",
        "revisable",
        "light",
        "empirical",
        "finding",
        "instance",
        "science",
        "told",
        "u",
        "lobster",
        "neurological",
        "system",
        "sufficiently",
        "advanced",
        "feel",
        "pain",
        "revise",
        "view",
        "permissibility",
        "boiling",
        "alive",
        "science",
        "would",
        "told",
        "u",
        "lobster",
        "feel",
        "pain",
        "boiled",
        "alive",
        "science",
        "inform",
        "u",
        "boiling",
        "alive",
        "wrong",
        "seems",
        "something",
        "known",
        "empirically",
        "moore",
        "open",
        "question",
        "argument",
        "regarded",
        "giving",
        "form",
        "intuition",
        "moral",
        "property",
        "good",
        "instance",
        "could",
        "defined",
        "wholly",
        "psychological",
        "biological",
        "sociological",
        "term",
        "moral",
        "truth",
        "would",
        "turn",
        "either",
        "psychological",
        "biological",
        "sociological",
        "truth",
        "could",
        "discovered",
        "empirical",
        "research",
        "appropriate",
        "science",
        "moore",
        "argues",
        "definition",
        "must",
        "fail",
        "always",
        "open",
        "question",
        "whether",
        "thing",
        "relevant",
        "empirical",
        "property",
        "good",
        "moore",
        "argument",
        "captured",
        "follows",
        "property",
        "f",
        "could",
        "defined",
        "term",
        "property",
        "g",
        "question",
        "something",
        "g",
        "f",
        "would",
        "closed",
        "naturalistic",
        "definition",
        "goodness",
        "would",
        "always",
        "open",
        "question",
        "whether",
        "something",
        "relevant",
        "natural",
        "property",
        "good",
        "therefore",
        "goodness",
        "naturalistically",
        "defined",
        "open",
        "question",
        "one",
        "closed",
        "closed",
        "question",
        "one",
        "asking",
        "betrays",
        "lack",
        "understanding",
        "concept",
        "involved",
        "instance",
        "asked",
        "jones",
        "widow",
        "ever",
        "married",
        "would",
        "show",
        "really",
        "understand",
        "term",
        "widow",
        "question",
        "closed",
        "moore",
        "claim",
        "test",
        "naturalistic",
        "definition",
        "goodness",
        "asking",
        "whether",
        "something",
        "natural",
        "property",
        "good",
        "seeing",
        "whether",
        "question",
        "open",
        "closed",
        "definition",
        "true",
        "question",
        "must",
        "closed",
        "open",
        "definition",
        "must",
        "false",
        "suppose",
        "instance",
        "someone",
        "proposes",
        "goodness",
        "defined",
        "term",
        "causality",
        "pleasure",
        "good",
        "claim",
        "cause",
        "pleasure",
        "moore",
        "view",
        "definition",
        "correct",
        "would",
        "closed",
        "question",
        "whether",
        "something",
        "cause",
        "pleasure",
        "good",
        "effect",
        "one",
        "would",
        "asking",
        "whether",
        "something",
        "cause",
        "pleasure",
        "cause",
        "pleasure",
        "clearly",
        "closed",
        "question",
        "moore",
        "insists",
        "question",
        "something",
        "cause",
        "pleasure",
        "good",
        "open",
        "question",
        "one",
        "could",
        "without",
        "conceptual",
        "confusion",
        "debate",
        "whether",
        "something",
        "cause",
        "pleasure",
        "good",
        "goodness",
        "defined",
        "cause",
        "pleasure",
        "moore",
        "assumes",
        "true",
        "every",
        "putative",
        "naturalistic",
        "definition",
        "goodness",
        "whether",
        "term",
        "secondorder",
        "desire",
        "social",
        "approval",
        "evolved",
        "whatever",
        "naturalistic",
        "definition",
        "would",
        "fail",
        "open",
        "question",
        "argument",
        "right",
        "goodness",
        "defined",
        "wholly",
        "reference",
        "concept",
        "empirical",
        "science",
        "goodness",
        "sui",
        "generis",
        "notion",
        "ie",
        "one",
        "understood",
        "evaluative",
        "term",
        "moore",
        "argument",
        "great",
        "deal",
        "intuitive",
        "force",
        "subject",
        "various",
        "objection",
        "clear",
        "answered",
        "one",
        "first",
        "begs",
        "question",
        "naturalist",
        "moore",
        "considers",
        "crude",
        "naturalistic",
        "definition",
        "goodness",
        "concludes",
        "naturalistic",
        "definition",
        "fail",
        "open",
        "question",
        "argument",
        "frankena",
        "objected",
        "premature",
        "know",
        "advance",
        "every",
        "naturalistic",
        "definition",
        "fail",
        "test",
        "wait",
        "consider",
        "proposal",
        "conclude",
        "crude",
        "example",
        "naturalistic",
        "definition",
        "fail",
        "bad",
        "induction",
        "another",
        "objection",
        "open",
        "question",
        "argument",
        "tell",
        "u",
        "anything",
        "distinctive",
        "concept",
        "goodness",
        "simply",
        "instance",
        "paradox",
        "analysis",
        "according",
        "paradox",
        "true",
        "analysis",
        "uninformative",
        "reducible",
        "tautology",
        "informative",
        "analysis",
        "false",
        "reduced",
        "tautology",
        "according",
        "earlier",
        "version",
        "moore",
        "called",
        "open",
        "question",
        "argument",
        "one",
        "interpretation",
        "moore",
        "argument",
        "reason",
        "good",
        "analysed",
        "naturalistic",
        "term",
        "turn",
        "sound",
        "like",
        "substantive",
        "moral",
        "claim",
        "eg",
        "pleasure",
        "good",
        "empty",
        "tautology",
        "pleasure",
        "pleasure",
        "look",
        "like",
        "particular",
        "instance",
        "paradox",
        "analysis",
        "see",
        "consider",
        "following",
        "analysis",
        "concept",
        "mammal",
        "mammal",
        "member",
        "specie",
        "female",
        "suckle",
        "young",
        "look",
        "informative",
        "tell",
        "u",
        "whale",
        "duckbilled",
        "platypus",
        "mammal",
        "different",
        "seemingly",
        "significant",
        "way",
        "mammal",
        "analysis",
        "true",
        "mammal",
        "mean",
        "member",
        "specie",
        "female",
        "suckle",
        "young",
        "mean",
        "member",
        "specie",
        "female",
        "suckle",
        "young",
        "member",
        "specie",
        "female",
        "suckle",
        "young",
        "however",
        "uninformative",
        "tautology",
        "quite",
        "general",
        "problem",
        "theory",
        "analysis",
        "applies",
        "seemingly",
        "informative",
        "analysis",
        "goodness",
        "would",
        "reveal",
        "nothing",
        "distinctive",
        "naturalistic",
        "analysis",
        "moral",
        "term",
        "furthermore",
        "analysis",
        "obvious",
        "analysis",
        "concept",
        "mammal",
        "example",
        "nonobvious",
        "analysis",
        "reason",
        "question",
        "member",
        "specie",
        "female",
        "suckle",
        "young",
        "mammal",
        "seem",
        "open",
        "even",
        "though",
        "true",
        "analysis",
        "similarly",
        "nonobvious",
        "naturalistic",
        "definition",
        "good",
        "may",
        "fail",
        "open",
        "question",
        "test",
        "even",
        "though",
        "true"
    ]
}