{
    "main_text": "Intuitionist epistemology || Disagreement\n1.3 Disagreement\n\n\nMany philosophers think that pervasive moral disagreement casts doubt\non the intuitionists’ claim that certain moral propositions are\nself-evident. If there were certain moral propositions that can be\nknown if adequately understood, then, it is argued, people with an\nadequate understanding of them would believe them, and there would be\nuniversal assent amongst mature, comprehending people. But there is no\nsuch universal assent. So there are no self-evident moral\npropositions.\n\n\nSidgwick took disagreement seriously, and thought that if there was\nsignificant disagreement about the truth of some apparently\nself-evident moral proposition, then that casts doubt on whether that\nproposition really is self-evident. Intuitionists could defend\nthemselves from this objection by downplaying the amount of moral\ndisagreement. They might claim that a lot of moral disagreement stems\nfrom disagreement about non-moral facts, such as what the consequences\nof a certain act will be. For instance, two people might disagree\nabout whether it is permissible to boil lobsters alive just because\nthey disagree about whether lobsters can feel pain. Since the basis of\ntheir moral disagreement is this disagreement about the relevant\nneurological fact, if they agreed on this non-moral fact, we could\nexpect them to agree about the permissibility of boiling lobsters\nalive.\n\n\nFurthermore, although people might disagree about the permissibility\nof boiling lobsters alive, we may assume that they agree that pain is\na bad thing, and the infliction of undeserved pain is prima facie\nwrong. If this assumption is correct, then the disputants agree about\nthe moral facts here. They disagree only about the empirical,\nnon-moral facts.\n \n\nAnother factor that might explain moral disagreement is\ndisagreement about the strength of certain moral reasons. Many\ndisputants might agree about the non-moral facts, and about what is\nmorally relevant, but disagree about the weight that should be given\nto the different moral considerations. So, for example, two people\nmight disagree about whether they ought to push a large man onto the\nrail tracks to derail a trolley that would otherwise kill five people,\nbut this is quite consistent with them agreeing that the fact that\nthis act would save five people counts in favour of pushing the man\noff the bridge, and that the fact that he would die if this were done\ncounts against doing it. In such a case there is agreement about what\nis relevant, and how it is relevant, but disagreement about the weight\nof the competing moral considerations—one person regards the\nevil of killing one person as weightier than the good of saving five,\nwhile the other regards the evil of killing one as outweighed by the\ngood of saving the five. There is still moral disagreement here, but\nit is simply a difference in judgement about the application of agreed\nmoral principles.\n\n\nThis fits with the intuitionist view held, e.g., by Ross, that causing\ngood outcomes is prima facie right, and that causing harm is prima\nfacie wrong, for Ross held that both of these propositions are\nself-evident. He denied, however, that the stringency, or weight, of\nthese different prima facie duties is self-evident (1939, 188). About\nthis, he maintained, we could only have a probable opinion.\n\n\nIt is worth noting that moral disagreement does not imply that people\nhave different intuitions. Ross, for example, had the strong intuition\nthat it is permissible to miss an opportunity to enjoy some innocent\npleasure, but at the time he wrote The Right and the Good he\ndid not believe this. (Later, in the Foundations of Ethics, he\nchanged his mind.) He believed it would be wrong to pass up such an\nopportunity because pleasure is good, and we ought to maximise the\ngood. So although he would disagree with someone who believed that it\nis permissible to pass up an opportunity to enjoy some innocent\npleasure, he would share their intuition that this is permissible.\nSimilarly, it is plausible to suppose that many act consequentialists\nstill have the intuition that it is wrong to harvest organs from a\nhealthy but non-consenting donor to save five other lives. But because\nthey have persuaded themselves of the truth of act consequentialism,\nthey would not believe this act is wrong.\n \n\nOne of the theoretical advantages of thinking of intuitions as\nintellectual seemings is that we can allow for this mismatch between\nour intuitions and our beliefs. Just as something can seem\nperceptually to be a certain way while we don’t believe it is that\nway, as in Müller-Lyer cases, so a proposition can seem\nintellectually to be true even though we do not believe it. Since such\nseemings are not beliefs, this does not commit intuitionists to the\nview that a conflict between our intuitions and beliefs entails contradictory beliefs.\n\n\nIntuitionists like Ross could still allow that their non-believed\nintuitions provide pro-tanto justification for believing them. It’s\njust that this justification is outweighed by opposing intuitions, and\nthe theory based on them. A consequentialist with non-consequentialist\nintuitions could think the same. She may regard her deontological\nintuitions as giving her some justification for believing that it\nwould be wrong to harvest the organs to save five, but presumably\nwould regard the appeal of the consequentialist theory as a whole as\noutweighing this justification. She may even regard her deontological\nintuition as providing sufficient reason to believe that such acts are\nwrong, even though she thinks that on balance she has more reason to\nbelieve that such acts are permissible.\n\n\nFinally, Ethical Intuitionists allow that various other factors can\nlead to disagreement. Clarke, for instance, allowed that stupidity,\ncorruption, or perverseness may make one doubt self-evident\npropositions (1706/1969, 194). John Balguy also acknowledges that\nself-evident moral principles, like many other plain and evident\ntruths, may be, and have been, doubted, “even by philosophers\nand men of letters” whom, presumably, he did not regard as\nstupid or corrupt (1728/1969, 406). And Price maintained that all\nforms of knowledge, including intuitive knowledge, may be evident in\ndifferent degrees (1758/1969, 160). Intuition may be clear and\nperfect, but may sometimes be faint and obscure. Such variance in\ndegrees of clarity allows that a self-evident proposition may be\nimperfectly and obscurely grasped, and this may lead someone to deny\nits truth. Similarly, Moore claimed that “every way in which it\nis possible to cognise a true proposition, it is also possible to\ngrasp a false one” (1903/1993, 36), and Ross notes that\nself-evident propositions may only be evident to us once we reach a\ncertain moral maturity (1930/2002, 29). Given all these ways in\nwhich the truth of a self-evident proposition may be missed, it is no\n surprise that there is no universal\n assent.[8]\n But the absence of\nuniversal assent is quite consistent with self-evidence, as long as\n one does not regard ‘self-evidence’ to mean, or imply,\n obviousness.[9]\n\n\nBut despite what has been said above, critics of intuitionism can\nclaim that the fact that there is disagreement between moral\nphilosophers and even between intuitionists themselves undermines the view\nthat certain propositions are self-evident. These philosophers will\nhave thought long and hard about the relevant propositions, and (we\nwould hope) have a very clear understanding of them. One would,\ntherefore, expect that if there were certain moral propositions the\ntruth of which could be apprehended by intuition, then moral\nphilosophers would converge on these truths.  Persistent disagreement\namongst reflective, thoughtful, and comprehending moral philosophers\nmay cast doubt on the view that any of these propositions are\nself-evident.\n\n\nFurthermore, if intuitions are intellectual seemings, one might ask\nwhy certain moral propositions seem true whereas others do not. If\nmoral facts are non-natural facts, as intuitionists maintain, and\nnon-natural properties lack causal powers, then moral intuitions\ncannot be caused by the corresponding moral facts, as, e.g., certain\nperceptual seemings are caused by certain natural facts. Critics would\nargue that certain things seem right and good to us, not because of\nsome inherent value they have, but because we have evolved to react to\ncertain types of act with approval or disapproval (Singer 2005; Street\n2006; and Joyce 2007, ch. 6).\n\n\nWe have evolved to feel instant approval of acts that benefit our\ngroup, such as those that exemplify reciprocal trust, and honesty, and\nthus enhance our chances of survival, and to feel disapproval of acts\nsuch as deceit, and betrayal, that undermine trust and the benefits\nthat brings. Intuitionists need to find some way of responding to this\nsort of objection without abandoning their non-naturalism.\n",
    "section_title": "1.3 Disagreement",
    "entry_title": "Intuitionism in Ethics",
    "hierarchy_title": "Intuitionism in Ethics || Intuitionist epistemology || Disagreement",
    "tokenized_text": [
        "intuitionist",
        "epistemology",
        "disagreement",
        "disagreement",
        "many",
        "philosopher",
        "think",
        "pervasive",
        "moral",
        "disagreement",
        "cast",
        "doubt",
        "intuitionists",
        "claim",
        "certain",
        "moral",
        "proposition",
        "selfevident",
        "certain",
        "moral",
        "proposition",
        "known",
        "adequately",
        "understood",
        "argued",
        "people",
        "adequate",
        "understanding",
        "would",
        "believe",
        "would",
        "universal",
        "assent",
        "amongst",
        "mature",
        "comprehending",
        "people",
        "universal",
        "assent",
        "selfevident",
        "moral",
        "proposition",
        "sidgwick",
        "took",
        "disagreement",
        "seriously",
        "thought",
        "significant",
        "disagreement",
        "truth",
        "apparently",
        "selfevident",
        "moral",
        "proposition",
        "cast",
        "doubt",
        "whether",
        "proposition",
        "really",
        "selfevident",
        "intuitionists",
        "could",
        "defend",
        "objection",
        "downplaying",
        "amount",
        "moral",
        "disagreement",
        "might",
        "claim",
        "lot",
        "moral",
        "disagreement",
        "stem",
        "disagreement",
        "nonmoral",
        "fact",
        "consequence",
        "certain",
        "act",
        "instance",
        "two",
        "people",
        "might",
        "disagree",
        "whether",
        "permissible",
        "boil",
        "lobster",
        "alive",
        "disagree",
        "whether",
        "lobster",
        "feel",
        "pain",
        "since",
        "basis",
        "moral",
        "disagreement",
        "disagreement",
        "relevant",
        "neurological",
        "fact",
        "agreed",
        "nonmoral",
        "fact",
        "could",
        "expect",
        "agree",
        "permissibility",
        "boiling",
        "lobster",
        "alive",
        "furthermore",
        "although",
        "people",
        "might",
        "disagree",
        "permissibility",
        "boiling",
        "lobster",
        "alive",
        "may",
        "assume",
        "agree",
        "pain",
        "bad",
        "thing",
        "infliction",
        "undeserved",
        "pain",
        "prima",
        "facie",
        "wrong",
        "assumption",
        "correct",
        "disputant",
        "agree",
        "moral",
        "fact",
        "disagree",
        "empirical",
        "nonmoral",
        "fact",
        "another",
        "factor",
        "might",
        "explain",
        "moral",
        "disagreement",
        "disagreement",
        "strength",
        "certain",
        "moral",
        "reason",
        "many",
        "disputant",
        "might",
        "agree",
        "nonmoral",
        "fact",
        "morally",
        "relevant",
        "disagree",
        "weight",
        "given",
        "different",
        "moral",
        "consideration",
        "example",
        "two",
        "people",
        "might",
        "disagree",
        "whether",
        "ought",
        "push",
        "large",
        "man",
        "onto",
        "rail",
        "track",
        "derail",
        "trolley",
        "would",
        "otherwise",
        "kill",
        "five",
        "people",
        "quite",
        "consistent",
        "agreeing",
        "fact",
        "act",
        "would",
        "save",
        "five",
        "people",
        "count",
        "favour",
        "pushing",
        "man",
        "bridge",
        "fact",
        "would",
        "die",
        "done",
        "count",
        "case",
        "agreement",
        "relevant",
        "relevant",
        "disagreement",
        "weight",
        "competing",
        "moral",
        "considerationsone",
        "person",
        "regard",
        "evil",
        "killing",
        "one",
        "person",
        "weightier",
        "good",
        "saving",
        "five",
        "regard",
        "evil",
        "killing",
        "one",
        "outweighed",
        "good",
        "saving",
        "five",
        "still",
        "moral",
        "disagreement",
        "simply",
        "difference",
        "judgement",
        "application",
        "agreed",
        "moral",
        "principle",
        "fit",
        "intuitionist",
        "view",
        "held",
        "eg",
        "ross",
        "causing",
        "good",
        "outcome",
        "prima",
        "facie",
        "right",
        "causing",
        "harm",
        "prima",
        "facie",
        "wrong",
        "ross",
        "held",
        "proposition",
        "selfevident",
        "denied",
        "however",
        "stringency",
        "weight",
        "different",
        "prima",
        "facie",
        "duty",
        "selfevident",
        "maintained",
        "could",
        "probable",
        "opinion",
        "worth",
        "noting",
        "moral",
        "disagreement",
        "imply",
        "people",
        "different",
        "intuition",
        "ross",
        "example",
        "strong",
        "intuition",
        "permissible",
        "miss",
        "opportunity",
        "enjoy",
        "innocent",
        "pleasure",
        "time",
        "wrote",
        "right",
        "good",
        "believe",
        "later",
        "foundation",
        "ethic",
        "changed",
        "mind",
        "believed",
        "would",
        "wrong",
        "pas",
        "opportunity",
        "pleasure",
        "good",
        "ought",
        "maximise",
        "good",
        "although",
        "would",
        "disagree",
        "someone",
        "believed",
        "permissible",
        "pas",
        "opportunity",
        "enjoy",
        "innocent",
        "pleasure",
        "would",
        "share",
        "intuition",
        "permissible",
        "similarly",
        "plausible",
        "suppose",
        "many",
        "act",
        "consequentialists",
        "still",
        "intuition",
        "wrong",
        "harvest",
        "organ",
        "healthy",
        "nonconsenting",
        "donor",
        "save",
        "five",
        "life",
        "persuaded",
        "truth",
        "act",
        "consequentialism",
        "would",
        "believe",
        "act",
        "wrong",
        "one",
        "theoretical",
        "advantage",
        "thinking",
        "intuition",
        "intellectual",
        "seemings",
        "allow",
        "mismatch",
        "intuition",
        "belief",
        "something",
        "seem",
        "perceptually",
        "certain",
        "way",
        "believe",
        "way",
        "müllerlyer",
        "case",
        "proposition",
        "seem",
        "intellectually",
        "true",
        "even",
        "though",
        "believe",
        "since",
        "seemings",
        "belief",
        "commit",
        "intuitionists",
        "view",
        "conflict",
        "intuition",
        "belief",
        "entail",
        "contradictory",
        "belief",
        "intuitionists",
        "like",
        "ross",
        "could",
        "still",
        "allow",
        "nonbelieved",
        "intuition",
        "provide",
        "protanto",
        "justification",
        "believing",
        "justification",
        "outweighed",
        "opposing",
        "intuition",
        "theory",
        "based",
        "consequentialist",
        "nonconsequentialist",
        "intuition",
        "could",
        "think",
        "may",
        "regard",
        "deontological",
        "intuition",
        "giving",
        "justification",
        "believing",
        "would",
        "wrong",
        "harvest",
        "organ",
        "save",
        "five",
        "presumably",
        "would",
        "regard",
        "appeal",
        "consequentialist",
        "theory",
        "whole",
        "outweighing",
        "justification",
        "may",
        "even",
        "regard",
        "deontological",
        "intuition",
        "providing",
        "sufficient",
        "reason",
        "believe",
        "act",
        "wrong",
        "even",
        "though",
        "think",
        "balance",
        "reason",
        "believe",
        "act",
        "permissible",
        "finally",
        "ethical",
        "intuitionists",
        "allow",
        "various",
        "factor",
        "lead",
        "disagreement",
        "clarke",
        "instance",
        "allowed",
        "stupidity",
        "corruption",
        "perverseness",
        "may",
        "make",
        "one",
        "doubt",
        "selfevident",
        "proposition",
        "john",
        "balguy",
        "also",
        "acknowledges",
        "selfevident",
        "moral",
        "principle",
        "like",
        "many",
        "plain",
        "evident",
        "truth",
        "may",
        "doubted",
        "even",
        "philosopher",
        "men",
        "letter",
        "presumably",
        "regard",
        "stupid",
        "corrupt",
        "price",
        "maintained",
        "form",
        "knowledge",
        "including",
        "intuitive",
        "knowledge",
        "may",
        "evident",
        "different",
        "degree",
        "intuition",
        "may",
        "clear",
        "perfect",
        "may",
        "sometimes",
        "faint",
        "obscure",
        "variance",
        "degree",
        "clarity",
        "allows",
        "selfevident",
        "proposition",
        "may",
        "imperfectly",
        "obscurely",
        "grasped",
        "may",
        "lead",
        "someone",
        "deny",
        "truth",
        "similarly",
        "moore",
        "claimed",
        "every",
        "way",
        "possible",
        "cognise",
        "true",
        "proposition",
        "also",
        "possible",
        "grasp",
        "false",
        "one",
        "ross",
        "note",
        "selfevident",
        "proposition",
        "may",
        "evident",
        "u",
        "reach",
        "certain",
        "moral",
        "maturity",
        "given",
        "way",
        "truth",
        "selfevident",
        "proposition",
        "may",
        "missed",
        "surprise",
        "universal",
        "assent",
        "absence",
        "universal",
        "assent",
        "quite",
        "consistent",
        "selfevidence",
        "long",
        "one",
        "regard",
        "selfevidence",
        "mean",
        "imply",
        "obviousness",
        "despite",
        "said",
        "critic",
        "intuitionism",
        "claim",
        "fact",
        "disagreement",
        "moral",
        "philosopher",
        "even",
        "intuitionists",
        "undermines",
        "view",
        "certain",
        "proposition",
        "selfevident",
        "philosopher",
        "thought",
        "long",
        "hard",
        "relevant",
        "proposition",
        "would",
        "hope",
        "clear",
        "understanding",
        "one",
        "would",
        "therefore",
        "expect",
        "certain",
        "moral",
        "proposition",
        "truth",
        "could",
        "apprehended",
        "intuition",
        "moral",
        "philosopher",
        "would",
        "converge",
        "truth",
        "persistent",
        "disagreement",
        "amongst",
        "reflective",
        "thoughtful",
        "comprehending",
        "moral",
        "philosopher",
        "may",
        "cast",
        "doubt",
        "view",
        "proposition",
        "selfevident",
        "furthermore",
        "intuition",
        "intellectual",
        "seemings",
        "one",
        "might",
        "ask",
        "certain",
        "moral",
        "proposition",
        "seem",
        "true",
        "whereas",
        "others",
        "moral",
        "fact",
        "nonnatural",
        "fact",
        "intuitionists",
        "maintain",
        "nonnatural",
        "property",
        "lack",
        "causal",
        "power",
        "moral",
        "intuition",
        "caused",
        "corresponding",
        "moral",
        "fact",
        "eg",
        "certain",
        "perceptual",
        "seemings",
        "caused",
        "certain",
        "natural",
        "fact",
        "critic",
        "would",
        "argue",
        "certain",
        "thing",
        "seem",
        "right",
        "good",
        "u",
        "inherent",
        "value",
        "evolved",
        "react",
        "certain",
        "type",
        "act",
        "approval",
        "disapproval",
        "singer",
        "street",
        "joyce",
        "ch",
        "evolved",
        "feel",
        "instant",
        "approval",
        "act",
        "benefit",
        "group",
        "exemplify",
        "reciprocal",
        "trust",
        "honesty",
        "thus",
        "enhance",
        "chance",
        "survival",
        "feel",
        "disapproval",
        "act",
        "deceit",
        "betrayal",
        "undermine",
        "trust",
        "benefit",
        "brings",
        "intuitionists",
        "need",
        "find",
        "way",
        "responding",
        "sort",
        "objection",
        "without",
        "abandoning",
        "nonnaturalism"
    ]
}