{
    "main_text": "Epistemology || Inferential reasoning and the debating hall\n3.3 Inferential reasoning and the debating hall\n\nA type of cognition that has a particular importance in South Asian\nphilosophy is that of inference (anumāna). Inference is\nthe type of cognition through which epistemic agents acquire new\nknowledge by means of reasoning upon what can be concluded with\ncertainty from previously acquired knowledge. This is what is\nexpressed by the Sanskrit expression\n“anumāna”, “the knowledge that follows\n[another knowledge]”. For example, when Devadatta wants to buy\nmangos, he wants to know which ones taste juicy before he buys them.\nAt this point, he is not yet allowed to taste them, but he can reason\nbased upon the color of the mangos and upon his past experience of a\ngiven color being associated with a given taste. In such a situation,\nthe regularity of Devadatta’s past experience is not a\ncoincidence, the co-presence of the property of having a given taste\nwith the property of having a given color is guaranteed by the fact\nthat both occurrences rely on the same causal complex, namely, a given\nstage of ripeness of the fruit at stake. This type of reasoning based\non a necessary relationship between two properties is what is called\n“inference”. In technical terms, there is a transmission\nof certainty from the established knowledge that an\n“evidence-property” (hetu) is ascribed to a given\nobject, to the new knowledge that a “target-property”\n(sādhya) is ascribed to the same object. This\ntransmission of certainty is based on the “invariable\nconcomitance” (vyāpti) between the two inferential\nproperties. Vyāpti originally means\n“pervasion” and is used in this technical sense, because\nthe pervasion of a property by another property, as in “whenever\nthere is a Sissoo tree, there is a tree”, is the model for\nsituations of necessary co-presence of the evidence-property with the\ntarget-property.\n\nInference has been thoroughly studied and its use strictly codified by\nthe different philosophico-religious traditions of South Asia, Jainism\nincluded, because it provides the structure of scientific reasoning.\nIndeed, the conclusion of an inferential reasoning is considered as a\nscientific truth inasmuch as this type of reasoning relies on the\nemancipation from contextual parameters and on the guarantee that the\nisolated relations are necessary ones.\n\nIn concert, inferential reasoning has a strong argumentative\npotential. To explain, by means of stating an inferential reasoning,\nit is possible to bring somebody else to the awareness of these\ntruths. Such a series of statements, even though it is not properly\nspeaking a type of cognition by itself, is metaphorically called\n“inference for others”\n(parārthānumāna), in opposition to the\n“inference for oneself”\n(svārthānumāna), which is a genuine type of\ncognition. An inference for others is traditionally used in a\nphilosophical debate in order to convince an interlocutor of a\ndifferent faith who has different beliefs concerning what there is. In\nJainism, there is an abundant literature of stories of conversion as\nthe outcome of such debates, as well as the development of debating\ntechniques to support one’s inferential reasoning (Gorisse\n2018). Furthermore, the different traditions share the belief that\nfrom this truth-preserving argument, it is possible to define the\nstandards of an ideally organized rational discussion, the outcomes of\nwhich are necessary true statements, and in the course of time, these\nphilosophers developed a common inter-doctrinal framework of\nargumentation for philosophical discussions (Gorisse 2017).\n\nFrom these observations, it comes as no surprise that the study of the\nrules to attack and defend the statement of an inference constitutes\nan important part of the logical investigations in Jainism. It also\ncomes as no surprise that these considerations developed in close\nrelationship with the logical investigations led by the other\ntraditions of classical Indian philosophy. More precisely, Jaina\nauthors routinely reference the Treatise on Logic\n(Nyāyasūtra [NS]), the epistemological treatise of\nthe Naiyāyika tradition, composed by Gautama in the second\ncentury CE, which is the pan Indian inter-doctrinal reference work for\nthe characterization of inference. Next to this, later Jaina authors\nconsistently engaged in discussions with the Buddhists, in particular\nwith Dignāga and Dharmakīrti, in the context of developing\ntheir theories of inference. The deep influence of\nDharmakīrti’s epistemology and theories of argumentation on\nJain philosophers can for example be seen in Vidyānandin’s\nreuse of some of the latter’s arguments in his Investigation\ninto the True Teaching\n(Satyaśāsanaparīkṣā [SŚP])\n(Trikha 2017).\n\nThe more systematic analysis of inference in Jainism begins with the\nŚvetāmbara philosopher Siddhasena Mahāmati and his\nyounger Digambara contemporary Akalaṅka Bhaṭṭa\n(720–780), author of the Royal Commentary [to the Treatise\non What there is] (Rājavārttika [RV])\n(Balcerowicz 2016b; Shah 1967), and develops through a continued line\nof commentaries until authors like Vādi Devasūri (1143 CE)\nin his Commentary on the explanation of the nature of modes of\nknowledge and perspectives\n(Pramāṇanayatattvālokālaṃkāra\n[PNT]) and later authors like Yaśovijaya (1638–1688 CE) and\nhis Manual of Jain Logic\n(Jainatarkabhāṣā [JTBh]) (Ganeri 2008). One\nof the main inter-doctrinal line of discussions and controversies in\nthis conceptual framework is to bring the probative inferential\nargument to its minimal form by reducing the number of necessary\nstatements. In these attempts, Jaina philosophers are traditionally\nconsidered as the ones to go the furthest. More precisely, the\nTreatise on Logic and its Commentary to the Treatise on\nLogic (Nyāyasūtrabhāṣya,\nNSBh) by Vātsyāyana (450–500 CE) had brought an old\nmodel with explicit psychological conditions like doubt and desire to\nknow, to a model linked only with the structure of the argument.\nThere, the only good way to express a truth-preserving argument\nconsists of a group of five statements expressing the thesis, the\nevidence, the account, the application and the conclusion in the\ninference. Jaina authors acknowledge this model and use Naiyāyika\ntraditional examples, like:\n\n\n[Thesis] Sound is impermanent,\n[Evidence] Because it is a product.\n[Account] Whatever is such is alike, like a pot.\n[Application] And this is a product.\n[Conclusion] Therefore it is impermanent.\n\n\n\nBut for Jaina authors, only pedagogical reasons can motivate a\nphilosopher to fully state an argument in this way. To explain, only\nthe first two statements are necessary steps to ensure the adhesion of\nthe interlocutor. In his Guide of logic, Siddhasena makes it\nclear, first, that the evidence is the central cog of the inferential\nreasoning; second, that the statement of the thesis is also\nindispensable, as it indicates the goal of the inference. Its absence\nwould be like observing an archer without knowing what his target is,\nthat is to say without the possibility to know whether he is skillful\nor not.\n\nA second major line of inter-doctrinal discussions and controversies\nin this conceptual framework is to aim towards a theory of the proper\nrelationship between the target-property and the evidence-property. A\nfirst attempt to distinguish between arbitrary and necessary\nrelationships is offered by the Buddhist Dignāga (480–540\nCE), according to which the evidence-property is necessarily\nconcomitant with the target-property if and only if it is possible to\nprove that the evidence-property is present in the case under\nconsideration, in similar cases and in no dissimilar cases. In our\nexample, it means that the property “being a product” has\nto be present in impermanent things like sound and pots, and absent in\npermanent things like the self. Jaina authors show that the three\nconditions of Dignāga are neither necessary, nor sufficient, and\nthat what ultimately counts is that the evidence-property cannot be\nthought of otherwise than in the presence of the target-property. To\nexplain, the only ultimately relevant criteria for the correctness of\nan inference is that its evidence-property is known as being\n“impossible otherwise” (anyathānupapatti)\nthan in the presence of the target-property. One specificity of the\nJaina tradition is to consider that this necessary concomitance\nbetween the inferential properties is known thanks to another type of\ncognition, “tarka” (here, not used in its\ntraditional technical sense of “suppositional reasoning”),\nwhich functions as a direct discernment of universals. More precisely,\nit is clear that necessary concomitance cannot be known by customary\nperception, since perception deals only with particulars, and that\neven the biggest list of particular instances would not suffice to\nreach certainty. Yet, we can realize that if something with certain\nproperties exists, something else with certain properties must also\nexist. It is not the same type of realization as the inferential one,\nsince it is linked with the Jaina epistemological theory of\nparticular-in-universal, according to which an object is a complex\nhaving both an existent universal aspect and an existent particular\naspect (see next section on many-sidedness). Therefore, in the same\nsituation in which one grasps a particular Sissoo, one can also grasp\nthe common properties shared by all Sissoos.\n",
    "section_title": "3.3 Inferential reasoning and the debating hall",
    "entry_title": "Jaina Philosophy",
    "hierarchy_title": "Jaina Philosophy || Epistemology || Inferential reasoning and the debating hall",
    "tokenized_text": [
        "epistemology",
        "inferential",
        "reasoning",
        "debating",
        "hall",
        "inferential",
        "reasoning",
        "debating",
        "hall",
        "type",
        "cognition",
        "particular",
        "importance",
        "south",
        "asian",
        "philosophy",
        "inference",
        "anumāna",
        "inference",
        "type",
        "cognition",
        "epistemic",
        "agent",
        "acquire",
        "new",
        "knowledge",
        "mean",
        "reasoning",
        "upon",
        "concluded",
        "certainty",
        "previously",
        "acquired",
        "knowledge",
        "expressed",
        "sanskrit",
        "expression",
        "anumāna",
        "knowledge",
        "follows",
        "another",
        "knowledge",
        "example",
        "devadatta",
        "want",
        "buy",
        "mango",
        "want",
        "know",
        "one",
        "taste",
        "juicy",
        "buy",
        "point",
        "yet",
        "allowed",
        "taste",
        "reason",
        "based",
        "upon",
        "color",
        "mango",
        "upon",
        "past",
        "experience",
        "given",
        "color",
        "associated",
        "given",
        "taste",
        "situation",
        "regularity",
        "devadatta",
        "past",
        "experience",
        "coincidence",
        "copresence",
        "property",
        "given",
        "taste",
        "property",
        "given",
        "color",
        "guaranteed",
        "fact",
        "occurrence",
        "rely",
        "causal",
        "complex",
        "namely",
        "given",
        "stage",
        "ripeness",
        "fruit",
        "stake",
        "type",
        "reasoning",
        "based",
        "necessary",
        "relationship",
        "two",
        "property",
        "called",
        "inference",
        "technical",
        "term",
        "transmission",
        "certainty",
        "established",
        "knowledge",
        "evidenceproperty",
        "hetu",
        "ascribed",
        "given",
        "object",
        "new",
        "knowledge",
        "targetproperty",
        "sādhya",
        "ascribed",
        "object",
        "transmission",
        "certainty",
        "based",
        "invariable",
        "concomitance",
        "vyāpti",
        "two",
        "inferential",
        "property",
        "vyāpti",
        "originally",
        "mean",
        "pervasion",
        "used",
        "technical",
        "sense",
        "pervasion",
        "property",
        "another",
        "property",
        "whenever",
        "sissoo",
        "tree",
        "tree",
        "model",
        "situation",
        "necessary",
        "copresence",
        "evidenceproperty",
        "targetproperty",
        "inference",
        "thoroughly",
        "studied",
        "use",
        "strictly",
        "codified",
        "different",
        "philosophicoreligious",
        "tradition",
        "south",
        "asia",
        "jainism",
        "included",
        "provides",
        "structure",
        "scientific",
        "reasoning",
        "indeed",
        "conclusion",
        "inferential",
        "reasoning",
        "considered",
        "scientific",
        "truth",
        "inasmuch",
        "type",
        "reasoning",
        "relies",
        "emancipation",
        "contextual",
        "parameter",
        "guarantee",
        "isolated",
        "relation",
        "necessary",
        "one",
        "concert",
        "inferential",
        "reasoning",
        "strong",
        "argumentative",
        "potential",
        "explain",
        "mean",
        "stating",
        "inferential",
        "reasoning",
        "possible",
        "bring",
        "somebody",
        "else",
        "awareness",
        "truth",
        "series",
        "statement",
        "even",
        "though",
        "properly",
        "speaking",
        "type",
        "cognition",
        "metaphorically",
        "called",
        "inference",
        "others",
        "parārthānumāna",
        "opposition",
        "inference",
        "oneself",
        "svārthānumāna",
        "genuine",
        "type",
        "cognition",
        "inference",
        "others",
        "traditionally",
        "used",
        "philosophical",
        "debate",
        "order",
        "convince",
        "interlocutor",
        "different",
        "faith",
        "different",
        "belief",
        "concerning",
        "jainism",
        "abundant",
        "literature",
        "story",
        "conversion",
        "outcome",
        "debate",
        "well",
        "development",
        "debating",
        "technique",
        "support",
        "one",
        "inferential",
        "reasoning",
        "gorisse",
        "furthermore",
        "different",
        "tradition",
        "share",
        "belief",
        "truthpreserving",
        "argument",
        "possible",
        "define",
        "standard",
        "ideally",
        "organized",
        "rational",
        "discussion",
        "outcome",
        "necessary",
        "true",
        "statement",
        "course",
        "time",
        "philosopher",
        "developed",
        "common",
        "interdoctrinal",
        "framework",
        "argumentation",
        "philosophical",
        "discussion",
        "gorisse",
        "observation",
        "come",
        "surprise",
        "study",
        "rule",
        "attack",
        "defend",
        "statement",
        "inference",
        "constitutes",
        "important",
        "part",
        "logical",
        "investigation",
        "jainism",
        "also",
        "come",
        "surprise",
        "consideration",
        "developed",
        "close",
        "relationship",
        "logical",
        "investigation",
        "led",
        "tradition",
        "classical",
        "indian",
        "philosophy",
        "precisely",
        "jaina",
        "author",
        "routinely",
        "reference",
        "treatise",
        "logic",
        "nyāyasūtra",
        "n",
        "epistemological",
        "treatise",
        "naiyāyika",
        "tradition",
        "composed",
        "gautama",
        "second",
        "century",
        "ce",
        "pan",
        "indian",
        "interdoctrinal",
        "reference",
        "work",
        "characterization",
        "inference",
        "next",
        "later",
        "jaina",
        "author",
        "consistently",
        "engaged",
        "discussion",
        "buddhist",
        "particular",
        "dignāga",
        "dharmakīrti",
        "context",
        "developing",
        "theory",
        "inference",
        "deep",
        "influence",
        "dharmakīrti",
        "epistemology",
        "theory",
        "argumentation",
        "jain",
        "philosopher",
        "example",
        "seen",
        "vidyānandin",
        "reuse",
        "latter",
        "argument",
        "investigation",
        "true",
        "teaching",
        "satyaśāsanaparīkṣā",
        "sśp",
        "trikha",
        "systematic",
        "analysis",
        "inference",
        "jainism",
        "begin",
        "śvetāmbara",
        "philosopher",
        "siddhasena",
        "mahāmati",
        "younger",
        "digambara",
        "contemporary",
        "akalaṅka",
        "bhaṭṭa",
        "author",
        "royal",
        "commentary",
        "treatise",
        "rājavārttika",
        "rv",
        "balcerowicz",
        "b",
        "shah",
        "develops",
        "continued",
        "line",
        "commentary",
        "author",
        "like",
        "vādi",
        "devasūri",
        "ce",
        "commentary",
        "explanation",
        "nature",
        "mode",
        "knowledge",
        "perspective",
        "pramāṇanayatattvālokālaṃkāra",
        "pnt",
        "later",
        "author",
        "like",
        "yaśovijaya",
        "ce",
        "manual",
        "jain",
        "logic",
        "jainatarkabhāṣā",
        "jtbh",
        "ganeri",
        "one",
        "main",
        "interdoctrinal",
        "line",
        "discussion",
        "controversy",
        "conceptual",
        "framework",
        "bring",
        "probative",
        "inferential",
        "argument",
        "minimal",
        "form",
        "reducing",
        "number",
        "necessary",
        "statement",
        "attempt",
        "jaina",
        "philosopher",
        "traditionally",
        "considered",
        "one",
        "go",
        "furthest",
        "precisely",
        "treatise",
        "logic",
        "commentary",
        "treatise",
        "logic",
        "nyāyasūtrabhāṣya",
        "nsbh",
        "vātsyāyana",
        "ce",
        "brought",
        "old",
        "model",
        "explicit",
        "psychological",
        "condition",
        "like",
        "doubt",
        "desire",
        "know",
        "model",
        "linked",
        "structure",
        "argument",
        "good",
        "way",
        "express",
        "truthpreserving",
        "argument",
        "consists",
        "group",
        "five",
        "statement",
        "expressing",
        "thesis",
        "evidence",
        "account",
        "application",
        "conclusion",
        "inference",
        "jaina",
        "author",
        "acknowledge",
        "model",
        "use",
        "naiyāyika",
        "traditional",
        "example",
        "like",
        "thesis",
        "sound",
        "impermanent",
        "evidence",
        "product",
        "account",
        "whatever",
        "alike",
        "like",
        "pot",
        "application",
        "product",
        "conclusion",
        "therefore",
        "impermanent",
        "jaina",
        "author",
        "pedagogical",
        "reason",
        "motivate",
        "philosopher",
        "fully",
        "state",
        "argument",
        "way",
        "explain",
        "first",
        "two",
        "statement",
        "necessary",
        "step",
        "ensure",
        "adhesion",
        "interlocutor",
        "guide",
        "logic",
        "siddhasena",
        "make",
        "clear",
        "first",
        "evidence",
        "central",
        "cog",
        "inferential",
        "reasoning",
        "second",
        "statement",
        "thesis",
        "also",
        "indispensable",
        "indicates",
        "goal",
        "inference",
        "absence",
        "would",
        "like",
        "observing",
        "archer",
        "without",
        "knowing",
        "target",
        "say",
        "without",
        "possibility",
        "know",
        "whether",
        "skillful",
        "second",
        "major",
        "line",
        "interdoctrinal",
        "discussion",
        "controversy",
        "conceptual",
        "framework",
        "aim",
        "towards",
        "theory",
        "proper",
        "relationship",
        "targetproperty",
        "evidenceproperty",
        "first",
        "attempt",
        "distinguish",
        "arbitrary",
        "necessary",
        "relationship",
        "offered",
        "buddhist",
        "dignāga",
        "ce",
        "according",
        "evidenceproperty",
        "necessarily",
        "concomitant",
        "targetproperty",
        "possible",
        "prove",
        "evidenceproperty",
        "present",
        "case",
        "consideration",
        "similar",
        "case",
        "dissimilar",
        "case",
        "example",
        "mean",
        "property",
        "product",
        "present",
        "impermanent",
        "thing",
        "like",
        "sound",
        "pot",
        "absent",
        "permanent",
        "thing",
        "like",
        "self",
        "jaina",
        "author",
        "show",
        "three",
        "condition",
        "dignāga",
        "neither",
        "necessary",
        "sufficient",
        "ultimately",
        "count",
        "evidenceproperty",
        "thought",
        "otherwise",
        "presence",
        "targetproperty",
        "explain",
        "ultimately",
        "relevant",
        "criterion",
        "correctness",
        "inference",
        "evidenceproperty",
        "known",
        "impossible",
        "otherwise",
        "anyathānupapatti",
        "presence",
        "targetproperty",
        "one",
        "specificity",
        "jaina",
        "tradition",
        "consider",
        "necessary",
        "concomitance",
        "inferential",
        "property",
        "known",
        "thanks",
        "another",
        "type",
        "cognition",
        "tarka",
        "used",
        "traditional",
        "technical",
        "sense",
        "suppositional",
        "reasoning",
        "function",
        "direct",
        "discernment",
        "universal",
        "precisely",
        "clear",
        "necessary",
        "concomitance",
        "known",
        "customary",
        "perception",
        "since",
        "perception",
        "deal",
        "particular",
        "even",
        "biggest",
        "list",
        "particular",
        "instance",
        "would",
        "suffice",
        "reach",
        "certainty",
        "yet",
        "realize",
        "something",
        "certain",
        "property",
        "exists",
        "something",
        "else",
        "certain",
        "property",
        "must",
        "also",
        "exist",
        "type",
        "realization",
        "inferential",
        "one",
        "since",
        "linked",
        "jaina",
        "epistemological",
        "theory",
        "particularinuniversal",
        "according",
        "object",
        "complex",
        "existent",
        "universal",
        "aspect",
        "existent",
        "particular",
        "aspect",
        "see",
        "next",
        "section",
        "manysidedness",
        "therefore",
        "situation",
        "one",
        "grasp",
        "particular",
        "sissoo",
        "one",
        "also",
        "grasp",
        "common",
        "property",
        "shared",
        "sissoo"
    ]
}