{
    "main_text": "Philosophical Issues in Japanese Pure Land Buddhist Thought || Pure Land Buddhist Metaphysics: Reflection on Reality\n4.1 Pure Land Buddhist Metaphysics: Reflection on Reality\n\nThe principal metaphysical question occasioned by Japanese Pure Land\nBuddhism arises most naturally concerning the meaning of a\nbeing’s birth in the Pure Land and the ontological status of\nAmida Buddha. Although Western researchers have often been confident\nin imposing substantialist assumptions on Pure Land thought,\nasserting, for example, that Hōnen and his followers thought of\nthe Pure Land as a geographical place, and although many Pure Land\nBuddhists assume that past thinkers regarded the Dharmakara-Amida\nnarrative as historical in a modern sense, in fact the dominant\ntraditional motif in treating questions of the reality of Amida and\nthe Pure Land reflects, not such notions as substance, identity,\nautonomy, and permanence, but an interactive, dynamic movement across\nprovisional dichotomies of formless reality and form, enlightened\nwisdom and ignorance, transtemporality and time, buddha and sentient\nbeing. This thinking characterized by the discriminative perception of\nthe world of beings rooted in the nondiscriminative apprehension of\nreality may be seen in relation to the question of the real existence\nof beings born in the Pure Land in the following passage from the\nsixth century Chinese Pure Land thinker Tanluan (476–542):\n\nQuestion: In the Mahayana sutras and treatises it is frequently\ntaught that sentient beings are in the final analysis unborn, like\nempty space. Why does Bodhisattva Vasubandhu express aspiration for\n“birth”?\nAnswer: The statement, “Sentient beings are unborn, like\nempty space,” is open to two interpretations. First, what\nordinary people see—such as sentient beings, which they conceive\nas real, or the acts of being born and dying, which they view as\nreal—is ultimately non-existent, like imaginary “tortoise\nfur,” or like empty space. Second, since all things are\n“born” from causal conditions, they are actually unborn;\nthat is, they are non-existent, like empty space.\n\n\nThe “birth” to which Bodhisattva Vasubandhu aspires refers\nto being born through causal conditions. Hence it is provisionally\ntermed “birth.” This does not mean that there are real\nbeings or that being born and dying is real, as ordinary people\nimagine.\n\nQuestion: In what sense do you speak of birth in the Pure\nLand?\nAnswer: For the provisionally-called “person” in this\nworld who practices the five gates of mindfulness, the preceding\nthought is the cause of the succeeding thought. The\nprovisionally-called “person” of this defiled world and\nthe provisionally-called “person” of the Pure Land cannot\nbe definitely called the same or definitely called different. The same\nis true of preceding thought and succeeding thought. The reason is\nthat if they were one and the same, then there would be no causality;\nif they were different, there would be no continuity. This principle\nis the gate of contemplating sameness and difference; it is discussed\nin detail in the treatises. (Shinran CWS, 1: 27–28)\n\n\nWe see that from very early in the East Asian tradition, as well known\nin Japan, Pure Land thinkers applied the Mahayana logic of the\nnonduality and interpenetration of discriminative and\nnondiscriminative realms to Pure Land concepts.\n\nRegarding the nature of Amida Buddha, perhaps the most natural\napproach for the modern mind is to focus on the relationship between\nAmida and Sakyamuni. While Amida, Buddha of infinite light and eternal\nlife, may be regarded as the “celestial” personification\nof perfect wisdom-compassion, and the narrative of his attainment in\nthe inconceivable past as “mythic,” Gotama, known by his\nhonorific title Sakyamuni Buddha, is recognized as a historical\nfigure, a mendicant wanderer and religious teacher of India in the\nfifth century BCE. It is common to say, therefore, that Sakyamuni\nbelongs to the realm of historical fact and actual existence, while\nAmida is fictive. This view is supported by the modern understanding\nof the relationship between the two buddhas. Sakyamuni, having become\nthe “awakened one” through meditative practices, taught\nhis realization to others, and among the teachings attributed to him\nis the story of Amida Buddha. Although historical evidence now\nsuggests that the teaching of Amida gradually emerged around the\nbeginning of the common era—five centuries after\nSakyamuni’s death—even if it appeared later in the\ntradition stemming from Sakyamuni, the fundamental question of the\nrelationship between Amida and the person(s) who first taught him\nremains unchanged. Amida Buddha has never appeared directly as a\nhistorical personage, and there are no teachings or words that can be\nattributed to him. Thus, it is common to view the story of Amida as a\nnarrative fashioned by Sakyamuni (or a later figure) to express the\ncontent of his own religious insight. Since his awakening could not be\nconveyed directly, he resorted to the use of parables and myths, and\nthe story of Amida is considered such a “skillful means”\n(hōben) or mythic device for teaching. In this view,\nAmida is a fiction whose origins lie in the experience of Sakyamuni.\nFurther, it is often assumed that while unlettered Pure Land adherents\nmay have clung to the notion of Amida and his vows as real, taking\nthem as objects of faith, more sophisticated Buddhists such as those\nof the Tendai, Shingon, and Zen schools recognized all along that\nAmida is merely a skillful “metaphor” or\n“symbol” for the historical realization of Sakyamuni.\n\nIn fact, there is basic continuity in the perspective on Amida among\nthe Mahayana schools, and it stands diametrically opposed to modernist\nassumptions. For Mahayana Buddhists, reality resides not fundamentally\nwith the historical existence of Sakyamuni as such, but rather with\nthat for which he is recognized as buddha, or that which is the\nmotive-force for his appearance in the world, his attainment of\nbuddhahood, and his teaching of dharma. Reality assumes form in order\nto emerge into the consciousness of sentient beings and thereby guide\nbeings beyond the attachments and compulsions of their discriminative,\nreifying, conceptual grasp of their own existence and the things of\nthe world around them.\n\nThis circular dynamic moving between formless reality and the world of\nforms may be seen with regard to the relationship between Sakaymuni\nand Amida in Hōnen’s exposition. He states:\n\n\nConcerning the central purport [of the Larger Sutra]:\nSakyamuni discarded the supreme Pure Land and appeared in this defiled\nworld; this was to expound the teaching of the Pure land and, by\nencouraging sentient beings, to bring them to birth in the Pure Land.\nAmida Tathagata discarded this defiled world and emerged in the Pure\nLand; this was to guide sentient beings of this defiled world and\nbring them to birth in the Pure Land. This is none other than the\nfundamental intent with which all buddhas go out to the Pure Land and\nemerge in the defiled world. (Muryōjukyō shaku in\nKyōdō 1987, p. 67)\n\n\nIn Hōnen’s view, Sakyamuni and Amida function as paired\naspects of a movement of compassionate activity in teaching and\nguiding, out of true reality into the defiled world, and out from the\ndefiled world into “the supreme Pure Land” that is the\nabode of all buddhas. We see here that Hōnen transforms the\nframework of historical sequence by beginning with Sakyamuni, even\nthough Amida’s attainment of buddhahood occurred aeons prior to\nSakyamuni’s appearance. Without Sakyamuni, Amida would remain\nunknown to beings in this world and his work of leading all to his\nbuddha-field would go unapprehended; without Amida, Sakyamuni would\nhave no effective means of liberating beings and his teaching mission\nwould be futile. In place of a linear chronology, we have a motif of\nmovement between the timeless and mundane time, by which the\ntemporality of karmic causation and discriminative thinking is\nbroken.\n\nShinran develops the reciprocity between Amida and Sakyamuni seen in\nHōnen into an asymmetric relationship, and by thus giving\npriority to Amida, moves even further from a modern orientation that\nwould emphasize the historical reality of Sakyamuni. For Shinran, it\nis the motive-force of wisdom-compassion that underlies the historical\nexistence of Sakyamuni—that in fact made him buddha—and\nthis wisdom-compassion is itself the life of Amida Buddha. Hence,\nSakyamuni’s historical existence may be understood as a\nmanifestation of Amida, perhaps one among countless others.\n\nThis understanding may be seen in Shinran’s demonstration that\nthe Larger Sutra, among all the sutras, expresses the true\nteaching for which Sakyamuni appeared in the world. Shinran focuses on\nthe pattern in the sutras by which, prior to expounding dharma, the\nBuddha enters a profound samadhi and delves to the nondiscriminative\nwisdom that transcends words and concepts. On emerging from the\nsamadhi, he reemerges into the realm of words and responds to\nquestions from his disciples. While his words are those of ordinary\nhuman discourse, they give expression to the samadhi he attained.\nThus, the source of Sakyamuni’s teaching is the samadhi he\nentered, the transcendent reality or wisdom itself.\n\nAt the beginning of the Larger Sutra, Sakyamuni’s\ndisciple Ānanda observes, from the splendor and serenity apparent\nin the Buddha’s countenance, that the Buddha has entered the\nsamadhi of great tranquility (Jp. daijakujō, in the Tang\ntranslation titled Sutra of the Tathagata of Immeasurable\nLife) and requests him to explain its significance. Sakyamuni\nproceeds to deliver the teaching of Amida Buddha. In other words,\nSakyamuni has attained the reality that is the essential quality of\nall Buddhas—in a commentary on the Larger Sutra it is\ncalled the “place where all Buddhas abide”—and on\nthis basis he reveals the story of Amida, for Amida is the primordial\nBuddha who embodies the essence of all Buddhas. From the perspective\nof this sutra, were it not for Amida, whose Buddhahood lies at the\nheart of the samadhi of great tranquility, Sakyamuni himself would not\nbe Buddha. At the same time, were it not for Sakyamuni, the teaching\nof Amida would not be disclosed to the world.\n\nThus, the relationship between Amida and Sakyamuni is not that between\ntwo distinct figures, or between the religious symbol taught and the\nteacher. Rather, it is viewed in a broader framework of Amida’s\ncharacteristic as standing both in formless reality and the world of\nforms, in the eternal and in history. Sakyamuni is not separate from\nAmida, and in teaching dharma he manifests the activity or movement\ntowards beings that is Amida’s essential quality.\n\nIt may be said that while meditative traditions in Buddhism tend to\nemphasize the elimination of delusional thinking and the apprehension\nof formless reality free of the imposition of egocentric\ndiscrimination, the Pure Land tradition is attentive to the\ncompassionate working of reality to awaken beings incapable of\neradicating conceptual thought. It does so by manifesting itself in\nforms and approaching beings. Late in life, Shinran adopted the term\njinen, “naturalness” or “being made to\nbecome so of itself,” for the spontaneous working of reality in\nthe liberative process by which beings of afflicting passions reach\nenlightenment. In this process, the Mahayana assertion that\n“samsara is none other than nirvana” or “afflicting\npassions are none other than awakening” is affirmed, so that the\nend of the Pure Land path lies in this world, in the compassionate\nworking for the liberation of all beings.\n\nIn relation to beings of the world, Pure Land thinkers such as\nShōkū and Shinran asserted that the real, as itself\nnondiscriminative and nondualistic wisdom or suchness, pervades all\nthings. Since beings cannot attain such wisdom, reality as such cannot\nbe grasped. Nevertheless, through that which is real that permeates\ntheir existence, all beings, including “grasses, trees, and the\nland itself,” hold the potential for awakening. Such terms as\n“emptiness” and “dependent origination” are\nsometimes understood in metaphysical terms, but in the context of\nMahayana Buddhist tradition, they are not concepts by which to grasp\nreality, but above all elements of practice, expressing the\nrealization of the person who enters into profound samadhi by cutting\noff discriminative thought and eradicating afflicting passions.\nBecause the Pure Land path is not based on such praxis, the use of\nsuch terms is unnecessary.\n",
    "section_title": "4.1 Pure Land Buddhist Metaphysics: Reflection on Reality",
    "entry_title": "Japanese Pure Land Philosophy",
    "hierarchy_title": "Japanese Pure Land Philosophy || Philosophical Issues in Japanese Pure Land Buddhist Thought || Pure Land Buddhist Metaphysics: Reflection on Reality",
    "tokenized_text": [
        "philosophical",
        "issue",
        "japanese",
        "pure",
        "land",
        "buddhist",
        "thought",
        "pure",
        "land",
        "buddhist",
        "metaphysics",
        "reflection",
        "reality",
        "pure",
        "land",
        "buddhist",
        "metaphysics",
        "reflection",
        "reality",
        "principal",
        "metaphysical",
        "question",
        "occasioned",
        "japanese",
        "pure",
        "land",
        "buddhism",
        "arises",
        "naturally",
        "concerning",
        "meaning",
        "birth",
        "pure",
        "land",
        "ontological",
        "status",
        "amida",
        "buddha",
        "although",
        "western",
        "researcher",
        "often",
        "confident",
        "imposing",
        "substantialist",
        "assumption",
        "pure",
        "land",
        "thought",
        "asserting",
        "example",
        "hōnen",
        "follower",
        "thought",
        "pure",
        "land",
        "geographical",
        "place",
        "although",
        "many",
        "pure",
        "land",
        "buddhist",
        "assume",
        "past",
        "thinker",
        "regarded",
        "dharmakaraamida",
        "narrative",
        "historical",
        "modern",
        "sense",
        "fact",
        "dominant",
        "traditional",
        "motif",
        "treating",
        "question",
        "reality",
        "amida",
        "pure",
        "land",
        "reflects",
        "notion",
        "substance",
        "identity",
        "autonomy",
        "permanence",
        "interactive",
        "dynamic",
        "movement",
        "across",
        "provisional",
        "dichotomy",
        "formless",
        "reality",
        "form",
        "enlightened",
        "wisdom",
        "ignorance",
        "transtemporality",
        "time",
        "buddha",
        "sentient",
        "thinking",
        "characterized",
        "discriminative",
        "perception",
        "world",
        "being",
        "rooted",
        "nondiscriminative",
        "apprehension",
        "reality",
        "may",
        "seen",
        "relation",
        "question",
        "real",
        "existence",
        "being",
        "born",
        "pure",
        "land",
        "following",
        "passage",
        "sixth",
        "century",
        "chinese",
        "pure",
        "land",
        "thinker",
        "tanluan",
        "question",
        "mahayana",
        "sutra",
        "treatise",
        "frequently",
        "taught",
        "sentient",
        "being",
        "final",
        "analysis",
        "unborn",
        "like",
        "empty",
        "space",
        "bodhisattva",
        "vasubandhu",
        "express",
        "aspiration",
        "birth",
        "answer",
        "statement",
        "sentient",
        "being",
        "unborn",
        "like",
        "empty",
        "space",
        "open",
        "two",
        "interpretation",
        "first",
        "ordinary",
        "people",
        "seesuch",
        "sentient",
        "being",
        "conceive",
        "real",
        "act",
        "born",
        "dying",
        "view",
        "realis",
        "ultimately",
        "nonexistent",
        "like",
        "imaginary",
        "tortoise",
        "fur",
        "like",
        "empty",
        "space",
        "second",
        "since",
        "thing",
        "born",
        "causal",
        "condition",
        "actually",
        "unborn",
        "nonexistent",
        "like",
        "empty",
        "space",
        "birth",
        "bodhisattva",
        "vasubandhu",
        "aspires",
        "refers",
        "born",
        "causal",
        "condition",
        "hence",
        "provisionally",
        "termed",
        "birth",
        "mean",
        "real",
        "being",
        "born",
        "dying",
        "real",
        "ordinary",
        "people",
        "imagine",
        "question",
        "sense",
        "speak",
        "birth",
        "pure",
        "land",
        "answer",
        "provisionallycalled",
        "person",
        "world",
        "practice",
        "five",
        "gate",
        "mindfulness",
        "preceding",
        "thought",
        "cause",
        "succeeding",
        "thought",
        "provisionallycalled",
        "person",
        "defiled",
        "world",
        "provisionallycalled",
        "person",
        "pure",
        "land",
        "definitely",
        "called",
        "definitely",
        "called",
        "different",
        "true",
        "preceding",
        "thought",
        "succeeding",
        "thought",
        "reason",
        "one",
        "would",
        "causality",
        "different",
        "would",
        "continuity",
        "principle",
        "gate",
        "contemplating",
        "sameness",
        "difference",
        "discussed",
        "detail",
        "treatise",
        "shinran",
        "cws",
        "see",
        "early",
        "east",
        "asian",
        "tradition",
        "well",
        "known",
        "japan",
        "pure",
        "land",
        "thinker",
        "applied",
        "mahayana",
        "logic",
        "nonduality",
        "interpenetration",
        "discriminative",
        "nondiscriminative",
        "realm",
        "pure",
        "land",
        "concept",
        "regarding",
        "nature",
        "amida",
        "buddha",
        "perhaps",
        "natural",
        "approach",
        "modern",
        "mind",
        "focus",
        "relationship",
        "amida",
        "sakyamuni",
        "amida",
        "buddha",
        "infinite",
        "light",
        "eternal",
        "life",
        "may",
        "regarded",
        "celestial",
        "personification",
        "perfect",
        "wisdomcompassion",
        "narrative",
        "attainment",
        "inconceivable",
        "past",
        "mythic",
        "gotama",
        "known",
        "honorific",
        "title",
        "sakyamuni",
        "buddha",
        "recognized",
        "historical",
        "figure",
        "mendicant",
        "wanderer",
        "religious",
        "teacher",
        "india",
        "fifth",
        "century",
        "bce",
        "common",
        "say",
        "therefore",
        "sakyamuni",
        "belongs",
        "realm",
        "historical",
        "fact",
        "actual",
        "existence",
        "amida",
        "fictive",
        "view",
        "supported",
        "modern",
        "understanding",
        "relationship",
        "two",
        "buddha",
        "sakyamuni",
        "become",
        "awakened",
        "one",
        "meditative",
        "practice",
        "taught",
        "realization",
        "others",
        "among",
        "teaching",
        "attributed",
        "story",
        "amida",
        "buddha",
        "although",
        "historical",
        "evidence",
        "suggests",
        "teaching",
        "amida",
        "gradually",
        "emerged",
        "around",
        "beginning",
        "common",
        "erafive",
        "century",
        "sakyamuni",
        "deatheven",
        "appeared",
        "later",
        "tradition",
        "stemming",
        "sakyamuni",
        "fundamental",
        "question",
        "relationship",
        "amida",
        "person",
        "first",
        "taught",
        "remains",
        "unchanged",
        "amida",
        "buddha",
        "never",
        "appeared",
        "directly",
        "historical",
        "personage",
        "teaching",
        "word",
        "attributed",
        "thus",
        "common",
        "view",
        "story",
        "amida",
        "narrative",
        "fashioned",
        "sakyamuni",
        "later",
        "figure",
        "express",
        "content",
        "religious",
        "insight",
        "since",
        "awakening",
        "could",
        "conveyed",
        "directly",
        "resorted",
        "use",
        "parable",
        "myth",
        "story",
        "amida",
        "considered",
        "skillful",
        "mean",
        "hōben",
        "mythic",
        "device",
        "teaching",
        "view",
        "amida",
        "fiction",
        "whose",
        "origin",
        "lie",
        "experience",
        "sakyamuni",
        "often",
        "assumed",
        "unlettered",
        "pure",
        "land",
        "adherent",
        "may",
        "clung",
        "notion",
        "amida",
        "vow",
        "real",
        "taking",
        "object",
        "faith",
        "sophisticated",
        "buddhist",
        "tendai",
        "shingon",
        "zen",
        "school",
        "recognized",
        "along",
        "amida",
        "merely",
        "skillful",
        "metaphor",
        "symbol",
        "historical",
        "realization",
        "sakyamuni",
        "fact",
        "basic",
        "continuity",
        "perspective",
        "amida",
        "among",
        "mahayana",
        "school",
        "stand",
        "diametrically",
        "opposed",
        "modernist",
        "assumption",
        "mahayana",
        "buddhist",
        "reality",
        "resides",
        "fundamentally",
        "historical",
        "existence",
        "sakyamuni",
        "rather",
        "recognized",
        "buddha",
        "motiveforce",
        "appearance",
        "world",
        "attainment",
        "buddhahood",
        "teaching",
        "dharma",
        "reality",
        "assumes",
        "form",
        "order",
        "emerge",
        "consciousness",
        "sentient",
        "being",
        "thereby",
        "guide",
        "being",
        "beyond",
        "attachment",
        "compulsion",
        "discriminative",
        "reifying",
        "conceptual",
        "grasp",
        "existence",
        "thing",
        "world",
        "around",
        "circular",
        "dynamic",
        "moving",
        "formless",
        "reality",
        "world",
        "form",
        "may",
        "seen",
        "regard",
        "relationship",
        "sakaymuni",
        "amida",
        "hōnen",
        "exposition",
        "state",
        "concerning",
        "central",
        "purport",
        "larger",
        "sutra",
        "sakyamuni",
        "discarded",
        "supreme",
        "pure",
        "land",
        "appeared",
        "defiled",
        "world",
        "expound",
        "teaching",
        "pure",
        "land",
        "encouraging",
        "sentient",
        "being",
        "bring",
        "birth",
        "pure",
        "land",
        "amida",
        "tathagata",
        "discarded",
        "defiled",
        "world",
        "emerged",
        "pure",
        "land",
        "guide",
        "sentient",
        "being",
        "defiled",
        "world",
        "bring",
        "birth",
        "pure",
        "land",
        "none",
        "fundamental",
        "intent",
        "buddha",
        "go",
        "pure",
        "land",
        "emerge",
        "defiled",
        "world",
        "muryōjukyō",
        "shaku",
        "kyōdō",
        "p",
        "hōnen",
        "view",
        "sakyamuni",
        "amida",
        "function",
        "paired",
        "aspect",
        "movement",
        "compassionate",
        "activity",
        "teaching",
        "guiding",
        "true",
        "reality",
        "defiled",
        "world",
        "defiled",
        "world",
        "supreme",
        "pure",
        "land",
        "abode",
        "buddha",
        "see",
        "hōnen",
        "transforms",
        "framework",
        "historical",
        "sequence",
        "beginning",
        "sakyamuni",
        "even",
        "though",
        "amida",
        "attainment",
        "buddhahood",
        "occurred",
        "aeon",
        "prior",
        "sakyamuni",
        "appearance",
        "without",
        "sakyamuni",
        "amida",
        "would",
        "remain",
        "unknown",
        "being",
        "world",
        "work",
        "leading",
        "buddhafield",
        "would",
        "go",
        "unapprehended",
        "without",
        "amida",
        "sakyamuni",
        "would",
        "effective",
        "mean",
        "liberating",
        "being",
        "teaching",
        "mission",
        "would",
        "futile",
        "place",
        "linear",
        "chronology",
        "motif",
        "movement",
        "timeless",
        "mundane",
        "time",
        "temporality",
        "karmic",
        "causation",
        "discriminative",
        "thinking",
        "broken",
        "shinran",
        "develops",
        "reciprocity",
        "amida",
        "sakyamuni",
        "seen",
        "hōnen",
        "asymmetric",
        "relationship",
        "thus",
        "giving",
        "priority",
        "amida",
        "move",
        "even",
        "modern",
        "orientation",
        "would",
        "emphasize",
        "historical",
        "reality",
        "sakyamuni",
        "shinran",
        "motiveforce",
        "wisdomcompassion",
        "underlies",
        "historical",
        "existence",
        "sakyamunithat",
        "fact",
        "made",
        "buddhaand",
        "wisdomcompassion",
        "life",
        "amida",
        "buddha",
        "hence",
        "sakyamuni",
        "historical",
        "existence",
        "may",
        "understood",
        "manifestation",
        "amida",
        "perhaps",
        "one",
        "among",
        "countless",
        "others",
        "understanding",
        "may",
        "seen",
        "shinran",
        "demonstration",
        "larger",
        "sutra",
        "among",
        "sutra",
        "express",
        "true",
        "teaching",
        "sakyamuni",
        "appeared",
        "world",
        "shinran",
        "focus",
        "pattern",
        "sutra",
        "prior",
        "expounding",
        "dharma",
        "buddha",
        "enters",
        "profound",
        "samadhi",
        "delf",
        "nondiscriminative",
        "wisdom",
        "transcends",
        "word",
        "concept",
        "emerging",
        "samadhi",
        "reemerges",
        "realm",
        "word",
        "responds",
        "question",
        "disciple",
        "word",
        "ordinary",
        "human",
        "discourse",
        "give",
        "expression",
        "samadhi",
        "attained",
        "thus",
        "source",
        "sakyamuni",
        "teaching",
        "samadhi",
        "entered",
        "transcendent",
        "reality",
        "wisdom",
        "beginning",
        "larger",
        "sutra",
        "sakyamuni",
        "disciple",
        "ānanda",
        "observes",
        "splendor",
        "serenity",
        "apparent",
        "buddha",
        "countenance",
        "buddha",
        "entered",
        "samadhi",
        "great",
        "tranquility",
        "jp",
        "daijakujō",
        "tang",
        "translation",
        "titled",
        "sutra",
        "tathagata",
        "immeasurable",
        "life",
        "request",
        "explain",
        "significance",
        "sakyamuni",
        "proceeds",
        "deliver",
        "teaching",
        "amida",
        "buddha",
        "word",
        "sakyamuni",
        "attained",
        "reality",
        "essential",
        "quality",
        "buddhasin",
        "commentary",
        "larger",
        "sutra",
        "called",
        "place",
        "buddha",
        "abide",
        "and",
        "basis",
        "reveals",
        "story",
        "amida",
        "amida",
        "primordial",
        "buddha",
        "embodies",
        "essence",
        "buddha",
        "perspective",
        "sutra",
        "amida",
        "whose",
        "buddhahood",
        "lie",
        "heart",
        "samadhi",
        "great",
        "tranquility",
        "sakyamuni",
        "would",
        "buddha",
        "time",
        "sakyamuni",
        "teaching",
        "amida",
        "would",
        "disclosed",
        "world",
        "thus",
        "relationship",
        "amida",
        "sakyamuni",
        "two",
        "distinct",
        "figure",
        "religious",
        "symbol",
        "taught",
        "teacher",
        "rather",
        "viewed",
        "broader",
        "framework",
        "amida",
        "characteristic",
        "standing",
        "formless",
        "reality",
        "world",
        "form",
        "eternal",
        "history",
        "sakyamuni",
        "separate",
        "amida",
        "teaching",
        "dharma",
        "manifest",
        "activity",
        "movement",
        "towards",
        "being",
        "amida",
        "essential",
        "quality",
        "may",
        "said",
        "meditative",
        "tradition",
        "buddhism",
        "tend",
        "emphasize",
        "elimination",
        "delusional",
        "thinking",
        "apprehension",
        "formless",
        "reality",
        "free",
        "imposition",
        "egocentric",
        "discrimination",
        "pure",
        "land",
        "tradition",
        "attentive",
        "compassionate",
        "working",
        "reality",
        "awaken",
        "being",
        "incapable",
        "eradicating",
        "conceptual",
        "thought",
        "manifesting",
        "form",
        "approaching",
        "being",
        "late",
        "life",
        "shinran",
        "adopted",
        "term",
        "jinen",
        "naturalness",
        "made",
        "become",
        "spontaneous",
        "working",
        "reality",
        "liberative",
        "process",
        "being",
        "afflicting",
        "passion",
        "reach",
        "enlightenment",
        "process",
        "mahayana",
        "assertion",
        "samsara",
        "none",
        "nirvana",
        "afflicting",
        "passion",
        "none",
        "awakening",
        "affirmed",
        "end",
        "pure",
        "land",
        "path",
        "lie",
        "world",
        "compassionate",
        "working",
        "liberation",
        "being",
        "relation",
        "being",
        "world",
        "pure",
        "land",
        "thinker",
        "shōkū",
        "shinran",
        "asserted",
        "real",
        "nondiscriminative",
        "nondualistic",
        "wisdom",
        "suchness",
        "pervades",
        "thing",
        "since",
        "being",
        "attain",
        "wisdom",
        "reality",
        "grasped",
        "nevertheless",
        "real",
        "permeates",
        "existence",
        "being",
        "including",
        "grass",
        "tree",
        "land",
        "hold",
        "potential",
        "awakening",
        "term",
        "emptiness",
        "dependent",
        "origination",
        "sometimes",
        "understood",
        "metaphysical",
        "term",
        "context",
        "mahayana",
        "buddhist",
        "tradition",
        "concept",
        "grasp",
        "reality",
        "element",
        "practice",
        "expressing",
        "realization",
        "person",
        "enters",
        "profound",
        "samadhi",
        "cutting",
        "discriminative",
        "thought",
        "eradicating",
        "afflicting",
        "passion",
        "pure",
        "land",
        "path",
        "based",
        "praxis",
        "use",
        "term",
        "unnecessary"
    ]
}