{
    "main_text": "Historical Periods of Philosophical Development and Interaction || Modern (post-1868) Philosophy\n4.4 Modern (post-1868) Philosophy\n\nBy convention the modern period in Japan is considered to\nhave begun with the demise of the Tokugawa shogunate and the formal\nrestoration of the emperor to power in 1868 and continues until today.\nAlthough the Tokugawa were gradually losing control for some decades,\nthe precipitating cause for their downfall was the shogunate’s\ninability to effectively address the incursion of U.S. gunships into\nTokyo harbor in 1854 forcing Japan to open its doors to trade with the\nWest. Although a smattering of information about the West had trickled\ninto Japan during its period of closure starting in 1637, the\nintelligentsia were shocked at how far Japan had fallen behind\ntechnologically. Forced to accept severely unfavorable trade\nagreements first with the United States and then Britain and Russia,\nJapan realized that it had to modernize quickly or fall victim to\nWestern imperialism. Its hope was that somehow it could achieve that\nmodernization through allocating a balance between “Japanese\nspirit and Western ingenuity” (wakon yōsai) that\nis, by finding a way to maintain its fundamental cultural values while\nadopting Western education, science, and technology. That challenge\ninspired much of the philosophical thinking in the late nineteenth and\nearly twentieth centuries.\n\nEdo-period Confucianism’s reliance on ancient texts seemed out\nof synch with the demands for modernization. In response, increasing\nemphasis was placed on the acceptance of Western philosophical\ntheories along with Western technologies and social institutions. The\nJapanese were particularly impressed with positivism’s rejection\nof religious metaphysics in favor of empiricism. As for\nutilitarianism, they admired its consequentialist ethics that used an\nempirically derived cost-benefit analysis to determine what would\nbring maximum happiness or pleasure for society as a whole. The\npopularity of Rousseau and Mill’s On Liberty enthused a\ngeneration about the prospect for a Japanese democracy in the form of\na constitutional monarchy. The intellectuals proudly referred to their\ntime as the “Meiji Enlightenment.” There were powerful\nforces contravening against this movement toward liberal democracy,\nhowever, and they were based in the ideologies behind the events that\nhad led to the Imperial Restoration of 1868 itself.\n4.4.1 Ideologies of Imperial Restoration\n\nBeyond the practical considerations—the increasing military\nweakness of the Tokugawa control within Japan, persistent economic\ninstability, recurrent peasant uprisings, the imminent threat of\nforeign invasion, and so forth—three philosophical ideologies\nhad coalesced to support the overthrow of the shogunate and\nrestoration of the emperor. First, the Mito School, a think tank of\nintellectual historians who for centuries were writing a comprehensive\nhistory of Japan, had developed a political interpretation of the\nimperial system as kokutai, basically a theory claiming that\nfrom time immemorial the emperor has embodied the state in such a way\nthat the two are inseparable. Specifically, because of that\nembodiment, the celestial kami who created Japan, the\nJapanese land, and the Japanese people are in a holographical relation\nreflecting, containing, and depending on each other.\n\nThe second philosophical ideology to support the Restoration was\nNative Studies, which went beyond its original philological and\ntextual interests to construct a Shintō theory of racial purity\nbased in a world view purported to be implicit in the ancient Japanese\nlanguage, mythic narratives, and a primordial view of the land and\ncountry. According to those mythic narratives, the celestial\nkami had appointed the imperial family to rule over the land.\nThat so-called Restoration Shintō was said to predate influences\nfrom the Asian continent including Buddhism and Confucianism. Hence,\nit served as a major resource for the ideology of State\nShintō’s vision of a pure Japanese ethnicity and\nspirituality that served as the nucleus of the first half of the\n“Japanese spirituality and Western ingenuity” formula of\nallocation.\n\nThe Imperial Restoration also required a third, militant ideology.\nThat came from the warrior ideal that had been developing in the Edo\nperiod, including the willingness to die for one’s lord as the\ndefinitive self-expression of loyalty. Of course, the loyalty had to\nbe directed now to the emperor instead of toward the shogun and the\nhotbed of the samurai revolt behind the Restoration was in the far\nwestern provinces of Satsuma and Chōshū. The lords of those\ndomains not only held a long-standing grudge against the Tokugawa but\nalso enjoyed geographical proximity to secret trade routes with access\nto weapons from the continent that were beyond the scope of the\nweakened shogunate’s surveillance network.\n\nThe practical exigencies had become so dire that the shogunate might\nhave crumbled without the support of the three philosophical\nideologies, but once the revolution was complete the ideologies formed\nthe political theory behind the new imperial state. Following models\ndeveloped by Germany and Italy, for example, the new Japanese state\nhoned its own identity as a nation state by basing itself in ancient\nmyths of racial uniformity, warrior heroism, ethnic purity, and a\nclaim to a primordial linguistic homogeneity.\n4.4.2 Modern Academic Philosophies\n\nAs tetsugaku, the philosophy done within the university\ndepartments of philosophy fit more the “Western ingenuity”\nside of the wakon yōsai allocation formula and was\ninitially allowed to flourish freely along with the other\nWissenschaften serving the modernization project, especially\nas it restricted itself to the subfields of epistemology, logic,\nphilosophy of science, and metaphysics. The more the academic\nphilosophers ventured into ethics, political philosophy, the\nphilosophy of religion, and even philosophical anthropology, however,\nthe more likely they were to encounter government censorship or even\nimprisonment. Some philosophers like Inoue Tetsujirō\n(1855–1944), Japan’s first native born professor of\nphilosophy and head of the department at Tokyo Imperial University\nused his considerable prestige to lend philosophical support to the\nkokutai theory against liberal democracy and to develop\nbushidō from a code of samurai warriors into a National\nMorality for everyone to be taught throughout the land in the public\nschool system. He based his full-bodied theory of\nbushidō in Japanese ethnicity, loyalty to the\nkokutai, moral discipline, and the study of virtue. For\nInoue, it seems, ethics was mainly morality and, as such, belonged on\nthe spirituality side of the wakon yōsai allocation.\n\nOthers, perhaps in response to Inoue Tetsujirō’s\ncollaboration with the state ideology, stayed more squarely within the\nmode of Western philosophy but tried to develop a more expansive\nversion of tetsugaku that would allow for Japanese ethical,\nspiritual, and aesthetic sensitivities. Nishida Kitarō\n(1870–1945), the founder of what became known as the Kyoto\nSchool, tried to assimilate Western empiricism and Western idealism by\nrelegating them into a subordinate position within his more\ncomprehensive system of experience and judgments, a system that\ngrounded itself in the Buddhist notion of nothingness. (See entries on\nNishida Kitarō; The Kyoto School.) In general, although still\nunder the sway of German idealism, many important philosophers of the\nfirst half of the twentieth century including Tanabe Hajime\n(1865–1962), Kuki Shūzō (1888–1941), and Watsuji\nTetsurō (1889–1960) developed philosophies that stressed\nculture as a crucial dimension of thought, being critical of what\nseemed to them the overly simplistic dualities of either the\nindividual vs. the universal or individualism vs. collectivism that\nseemed to dominate most Western logical and social theories. Yet, in\nstressing the importance of the cultural and ethnic dimension of human\nexistence, they sometimes found themselves either wittingly or\nunwittingly considered allies of the imperial state ideology. (See\nentry on \n Watsuji Tetsurō; \nfor Tanabe, see the entry on \n The Kyoto School, section 3.4.)\n\nFor the most part, Confucianism in the Edo period functioned more as a\nsecular philosophy than a religious tradition and so it was no threat\nto the “Japanese spirituality” being cultivated in modern\nJapan. Edifying narratives of Edo-period virtuous (often samurai)\nConfucians made their way into the National Morality curriculum and\nthe Confucian emphasis on academic study was esteemed as a model for\nthe modern student. Yet, because a prevailing view was that\nConfucianism was a foreign tradition based in archaic texts instead of\nempirical data or utilitarianism, it seemed to many Westernized\nintellectuals embarrassingly unmodern. Inoue Tetsujirō, who saw\nWestern utilitarianism and Christianity as threats to the official\nkokutai and bushidō theories, did make the case\nin three books that Edo-period Confucianism was indeed a Japanese\npremodern tetsugaku, implying Japan had no need to seek\nethical theories from the West. Yet, he did little to contribute to\nthe Japanese Confucian traditions of Japan since philosophically,\nafter eight years of study in Germany, his own academic philosophical\nsympathies remained very strongly planted in the German idealism which\nhe promoted vigorously in his home department at Tokyo University.\n\nBuddhism was in a different situation from Confucianism, however,\nbecause it was both a religion and a philosophy in premodern Japan. As\na “foreign” religion it was deemed a pollutant to the pure\nJapanese spirituality of State Shintō and underwent various forms\nof persecution, even to the extent of mobs desecrating Buddhist\ncemeteries and altars within private homes. The major Buddhist\nreaction was institutional, trying to be less visibly an exception to\nthe new order, at times even encouraging monks to marry and have\nfamilies in service to the national program supporting population\ngrowth, for example. There was also a philosophical response, however.\nWith Buddhism’s wide variety of schools of thought and its\ntraditions of experiential verification, theories of consciousness,\nforms of dialectical logic, alternative forms of knowing, and so\nforth, some intellectuals felt there could be fertile interaction\nbetween premodern Buddhist thought and the newly introduced Western\nphilosophies. As a result, some of the brightest young Buddhist\nseminarians were enrolled in philosophy programs at the Imperial\nUniversities, creating a synergy between Western and Buddhist\nphilosophy in Japan that continues in many quarters until the present.\nIn addition, intrigued by the manner in which Christian theology was\ndrawing on nineteeth- and twentieth-century European philosophies,\npockets of so-called Buddhist-Christian dialogue began to emerge and\nfully blossomed in the post-censorship era after 1945.\n4.4.3 Postwar Philosophies\n\nThe postwar period has brought three general developments. First, with\nthe end of censorship of liberal and leftist thought, there was often\na purge of the very idea of “Japanese” philosophy as\nsmacking of nativism, ethnocentrism, jingoism, and State Shintō\nideology. This was often directed, fairly or unfairly, toward\nassimilative traditions like the Kyoto School. In response, the\nimmediate postwar generation or two in most Japanese academic\nphilosophy departments escaped into Western philosophy, often carried\nout with a sense of purity that rivaled the earlier ethnocentric\nmovement. Consequently, the large majority of Japanese academic\nphilosophers trained in the latter half of the twentieth century have\npursued philosophy according to methods and themes hardly\ndistinguishable from those of the West.\n\nThe second postwar response has been for traditions like the Kyoto\nSchool, born in 1910–1945, to continue to evolve, now without\nthe distraction of the old state ideology’s casting a shadow on\nthe enterprise. This movement has generated increasing interest among\nphilosophers in Europe and the United States, especially those from\nthe more Continental influenced traditions. In some quarters, for\nexample, the Kyoto School is beginning to be recognized in\nphilosophical forums, taking a place alongside other schools of global\nsignificance such as the Marburg or Frankfurt Schools.\n\nLastly, with the greater availability of translations into European\nlanguages and the sprouting of learned societies for Japanese\nphilosophy in Asia, the United States, and Europe, there are\nincreasingly signs of cross-influence and hybridization. Western\nphilosophers, even those who do not consider themselves Japanese\nspecialists, are participating in the cross-pollination of ideas. As a\nphilosopher does not need to know Danish to be influenced by\nKierkegaard, a philosopher no longer needs to know Japanese to be\ninfluenced by, or even contribute to, Japanese philosophy. The last\nsection of this article outlines some themes in Japanese philosophy\nthat may in the future stimulate philosophers of various backgrounds\nand national origins.\n",
    "section_title": "4.4 Modern (post-1868) Philosophy",
    "entry_title": "Japanese Philosophy",
    "hierarchy_title": "Japanese Philosophy || Historical Periods of Philosophical Development and Interaction || Modern (post-1868) Philosophy",
    "tokenized_text": [
        "historical",
        "period",
        "philosophical",
        "development",
        "interaction",
        "modern",
        "post",
        "philosophy",
        "modern",
        "post",
        "philosophy",
        "convention",
        "modern",
        "period",
        "japan",
        "considered",
        "begun",
        "demise",
        "tokugawa",
        "shogunate",
        "formal",
        "restoration",
        "emperor",
        "power",
        "continues",
        "today",
        "although",
        "tokugawa",
        "gradually",
        "losing",
        "control",
        "decade",
        "precipitating",
        "cause",
        "downfall",
        "shogunate",
        "inability",
        "effectively",
        "address",
        "incursion",
        "us",
        "gunships",
        "tokyo",
        "harbor",
        "forcing",
        "japan",
        "open",
        "door",
        "trade",
        "west",
        "although",
        "smattering",
        "information",
        "west",
        "trickled",
        "japan",
        "period",
        "closure",
        "starting",
        "intelligentsia",
        "shocked",
        "far",
        "japan",
        "fallen",
        "behind",
        "technologically",
        "forced",
        "accept",
        "severely",
        "unfavorable",
        "trade",
        "agreement",
        "first",
        "united",
        "state",
        "britain",
        "russia",
        "japan",
        "realized",
        "modernize",
        "quickly",
        "fall",
        "victim",
        "western",
        "imperialism",
        "hope",
        "somehow",
        "could",
        "achieve",
        "modernization",
        "allocating",
        "balance",
        "japanese",
        "spirit",
        "western",
        "ingenuity",
        "wakon",
        "yōsai",
        "finding",
        "way",
        "maintain",
        "fundamental",
        "cultural",
        "value",
        "adopting",
        "western",
        "education",
        "science",
        "technology",
        "challenge",
        "inspired",
        "much",
        "philosophical",
        "thinking",
        "late",
        "nineteenth",
        "early",
        "twentieth",
        "century",
        "edoperiod",
        "confucianism",
        "reliance",
        "ancient",
        "text",
        "seemed",
        "synch",
        "demand",
        "modernization",
        "response",
        "increasing",
        "emphasis",
        "placed",
        "acceptance",
        "western",
        "philosophical",
        "theory",
        "along",
        "western",
        "technology",
        "social",
        "institution",
        "japanese",
        "particularly",
        "impressed",
        "positivism",
        "rejection",
        "religious",
        "metaphysics",
        "favor",
        "empiricism",
        "utilitarianism",
        "admired",
        "consequentialist",
        "ethic",
        "used",
        "empirically",
        "derived",
        "costbenefit",
        "analysis",
        "determine",
        "would",
        "bring",
        "maximum",
        "happiness",
        "pleasure",
        "society",
        "whole",
        "popularity",
        "rousseau",
        "mill",
        "liberty",
        "enthused",
        "generation",
        "prospect",
        "japanese",
        "democracy",
        "form",
        "constitutional",
        "monarchy",
        "intellectual",
        "proudly",
        "referred",
        "time",
        "meiji",
        "enlightenment",
        "powerful",
        "force",
        "contravening",
        "movement",
        "toward",
        "liberal",
        "democracy",
        "however",
        "based",
        "ideology",
        "behind",
        "event",
        "led",
        "imperial",
        "restoration",
        "ideology",
        "imperial",
        "restoration",
        "beyond",
        "practical",
        "considerationsthe",
        "increasing",
        "military",
        "weakness",
        "tokugawa",
        "control",
        "within",
        "japan",
        "persistent",
        "economic",
        "instability",
        "recurrent",
        "peasant",
        "uprising",
        "imminent",
        "threat",
        "foreign",
        "invasion",
        "forththree",
        "philosophical",
        "ideology",
        "coalesced",
        "support",
        "overthrow",
        "shogunate",
        "restoration",
        "emperor",
        "first",
        "mito",
        "school",
        "think",
        "tank",
        "intellectual",
        "historian",
        "century",
        "writing",
        "comprehensive",
        "history",
        "japan",
        "developed",
        "political",
        "interpretation",
        "imperial",
        "system",
        "kokutai",
        "basically",
        "theory",
        "claiming",
        "time",
        "immemorial",
        "emperor",
        "embodied",
        "state",
        "way",
        "two",
        "inseparable",
        "specifically",
        "embodiment",
        "celestial",
        "kami",
        "created",
        "japan",
        "japanese",
        "land",
        "japanese",
        "people",
        "holographical",
        "relation",
        "reflecting",
        "containing",
        "depending",
        "second",
        "philosophical",
        "ideology",
        "support",
        "restoration",
        "native",
        "study",
        "went",
        "beyond",
        "original",
        "philological",
        "textual",
        "interest",
        "construct",
        "shintō",
        "theory",
        "racial",
        "purity",
        "based",
        "world",
        "view",
        "purported",
        "implicit",
        "ancient",
        "japanese",
        "language",
        "mythic",
        "narrative",
        "primordial",
        "view",
        "land",
        "country",
        "according",
        "mythic",
        "narrative",
        "celestial",
        "kami",
        "appointed",
        "imperial",
        "family",
        "rule",
        "land",
        "socalled",
        "restoration",
        "shintō",
        "said",
        "predate",
        "influence",
        "asian",
        "continent",
        "including",
        "buddhism",
        "confucianism",
        "hence",
        "served",
        "major",
        "resource",
        "ideology",
        "state",
        "shintō",
        "vision",
        "pure",
        "japanese",
        "ethnicity",
        "spirituality",
        "served",
        "nucleus",
        "first",
        "half",
        "japanese",
        "spirituality",
        "western",
        "ingenuity",
        "formula",
        "allocation",
        "imperial",
        "restoration",
        "also",
        "required",
        "third",
        "militant",
        "ideology",
        "came",
        "warrior",
        "ideal",
        "developing",
        "edo",
        "period",
        "including",
        "willingness",
        "die",
        "one",
        "lord",
        "definitive",
        "selfexpression",
        "loyalty",
        "course",
        "loyalty",
        "directed",
        "emperor",
        "instead",
        "toward",
        "shogun",
        "hotbed",
        "samurai",
        "revolt",
        "behind",
        "restoration",
        "far",
        "western",
        "province",
        "satsuma",
        "chōshū",
        "lord",
        "domain",
        "held",
        "longstanding",
        "grudge",
        "tokugawa",
        "also",
        "enjoyed",
        "geographical",
        "proximity",
        "secret",
        "trade",
        "route",
        "access",
        "weapon",
        "continent",
        "beyond",
        "scope",
        "weakened",
        "shogunate",
        "surveillance",
        "network",
        "practical",
        "exigency",
        "become",
        "dire",
        "shogunate",
        "might",
        "crumbled",
        "without",
        "support",
        "three",
        "philosophical",
        "ideology",
        "revolution",
        "complete",
        "ideology",
        "formed",
        "political",
        "theory",
        "behind",
        "new",
        "imperial",
        "state",
        "following",
        "model",
        "developed",
        "germany",
        "italy",
        "example",
        "new",
        "japanese",
        "state",
        "honed",
        "identity",
        "nation",
        "state",
        "basing",
        "ancient",
        "myth",
        "racial",
        "uniformity",
        "warrior",
        "heroism",
        "ethnic",
        "purity",
        "claim",
        "primordial",
        "linguistic",
        "homogeneity",
        "modern",
        "academic",
        "philosophy",
        "tetsugaku",
        "philosophy",
        "done",
        "within",
        "university",
        "department",
        "philosophy",
        "fit",
        "western",
        "ingenuity",
        "side",
        "wakon",
        "yōsai",
        "allocation",
        "formula",
        "initially",
        "allowed",
        "flourish",
        "freely",
        "along",
        "wissenschaften",
        "serving",
        "modernization",
        "project",
        "especially",
        "restricted",
        "subfields",
        "epistemology",
        "logic",
        "philosophy",
        "science",
        "metaphysics",
        "academic",
        "philosopher",
        "ventured",
        "ethic",
        "political",
        "philosophy",
        "philosophy",
        "religion",
        "even",
        "philosophical",
        "anthropology",
        "however",
        "likely",
        "encounter",
        "government",
        "censorship",
        "even",
        "imprisonment",
        "philosopher",
        "like",
        "inoue",
        "tetsujirō",
        "japan",
        "first",
        "native",
        "born",
        "professor",
        "philosophy",
        "head",
        "department",
        "tokyo",
        "imperial",
        "university",
        "used",
        "considerable",
        "prestige",
        "lend",
        "philosophical",
        "support",
        "kokutai",
        "theory",
        "liberal",
        "democracy",
        "develop",
        "bushidō",
        "code",
        "samurai",
        "warrior",
        "national",
        "morality",
        "everyone",
        "taught",
        "throughout",
        "land",
        "public",
        "school",
        "system",
        "based",
        "fullbodied",
        "theory",
        "bushidō",
        "japanese",
        "ethnicity",
        "loyalty",
        "kokutai",
        "moral",
        "discipline",
        "study",
        "virtue",
        "inoue",
        "seems",
        "ethic",
        "mainly",
        "morality",
        "belonged",
        "spirituality",
        "side",
        "wakon",
        "yōsai",
        "allocation",
        "others",
        "perhaps",
        "response",
        "inoue",
        "tetsujirō",
        "collaboration",
        "state",
        "ideology",
        "stayed",
        "squarely",
        "within",
        "mode",
        "western",
        "philosophy",
        "tried",
        "develop",
        "expansive",
        "version",
        "tetsugaku",
        "would",
        "allow",
        "japanese",
        "ethical",
        "spiritual",
        "aesthetic",
        "sensitivity",
        "nishida",
        "kitarō",
        "founder",
        "became",
        "known",
        "kyoto",
        "school",
        "tried",
        "assimilate",
        "western",
        "empiricism",
        "western",
        "idealism",
        "relegating",
        "subordinate",
        "position",
        "within",
        "comprehensive",
        "system",
        "experience",
        "judgment",
        "system",
        "grounded",
        "buddhist",
        "notion",
        "nothingness",
        "see",
        "entry",
        "nishida",
        "kitarō",
        "kyoto",
        "school",
        "general",
        "although",
        "still",
        "sway",
        "german",
        "idealism",
        "many",
        "important",
        "philosopher",
        "first",
        "half",
        "twentieth",
        "century",
        "including",
        "tanabe",
        "hajime",
        "kuki",
        "shūzō",
        "watsuji",
        "tetsurō",
        "developed",
        "philosophy",
        "stressed",
        "culture",
        "crucial",
        "dimension",
        "thought",
        "critical",
        "seemed",
        "overly",
        "simplistic",
        "duality",
        "either",
        "individual",
        "vs",
        "universal",
        "individualism",
        "vs",
        "collectivism",
        "seemed",
        "dominate",
        "western",
        "logical",
        "social",
        "theory",
        "yet",
        "stressing",
        "importance",
        "cultural",
        "ethnic",
        "dimension",
        "human",
        "existence",
        "sometimes",
        "found",
        "either",
        "wittingly",
        "unwittingly",
        "considered",
        "ally",
        "imperial",
        "state",
        "ideology",
        "see",
        "entry",
        "watsuji",
        "tetsurō",
        "tanabe",
        "see",
        "entry",
        "kyoto",
        "school",
        "section",
        "part",
        "confucianism",
        "edo",
        "period",
        "functioned",
        "secular",
        "philosophy",
        "religious",
        "tradition",
        "threat",
        "japanese",
        "spirituality",
        "cultivated",
        "modern",
        "japan",
        "edifying",
        "narrative",
        "edoperiod",
        "virtuous",
        "often",
        "samurai",
        "confucian",
        "made",
        "way",
        "national",
        "morality",
        "curriculum",
        "confucian",
        "emphasis",
        "academic",
        "study",
        "esteemed",
        "model",
        "modern",
        "student",
        "yet",
        "prevailing",
        "view",
        "confucianism",
        "foreign",
        "tradition",
        "based",
        "archaic",
        "text",
        "instead",
        "empirical",
        "data",
        "utilitarianism",
        "seemed",
        "many",
        "westernized",
        "intellectual",
        "embarrassingly",
        "unmodern",
        "inoue",
        "tetsujirō",
        "saw",
        "western",
        "utilitarianism",
        "christianity",
        "threat",
        "official",
        "kokutai",
        "bushidō",
        "theory",
        "make",
        "case",
        "three",
        "book",
        "edoperiod",
        "confucianism",
        "indeed",
        "japanese",
        "premodern",
        "tetsugaku",
        "implying",
        "japan",
        "need",
        "seek",
        "ethical",
        "theory",
        "west",
        "yet",
        "little",
        "contribute",
        "japanese",
        "confucian",
        "tradition",
        "japan",
        "since",
        "philosophically",
        "eight",
        "year",
        "study",
        "germany",
        "academic",
        "philosophical",
        "sympathy",
        "remained",
        "strongly",
        "planted",
        "german",
        "idealism",
        "promoted",
        "vigorously",
        "home",
        "department",
        "tokyo",
        "university",
        "buddhism",
        "different",
        "situation",
        "confucianism",
        "however",
        "religion",
        "philosophy",
        "premodern",
        "japan",
        "foreign",
        "religion",
        "deemed",
        "pollutant",
        "pure",
        "japanese",
        "spirituality",
        "state",
        "shintō",
        "underwent",
        "various",
        "form",
        "persecution",
        "even",
        "extent",
        "mob",
        "desecrating",
        "buddhist",
        "cemetery",
        "altar",
        "within",
        "private",
        "home",
        "major",
        "buddhist",
        "reaction",
        "institutional",
        "trying",
        "le",
        "visibly",
        "exception",
        "new",
        "order",
        "time",
        "even",
        "encouraging",
        "monk",
        "marry",
        "family",
        "service",
        "national",
        "program",
        "supporting",
        "population",
        "growth",
        "example",
        "also",
        "philosophical",
        "response",
        "however",
        "buddhism",
        "wide",
        "variety",
        "school",
        "thought",
        "tradition",
        "experiential",
        "verification",
        "theory",
        "consciousness",
        "form",
        "dialectical",
        "logic",
        "alternative",
        "form",
        "knowing",
        "forth",
        "intellectual",
        "felt",
        "could",
        "fertile",
        "interaction",
        "premodern",
        "buddhist",
        "thought",
        "newly",
        "introduced",
        "western",
        "philosophy",
        "result",
        "brightest",
        "young",
        "buddhist",
        "seminarian",
        "enrolled",
        "philosophy",
        "program",
        "imperial",
        "university",
        "creating",
        "synergy",
        "western",
        "buddhist",
        "philosophy",
        "japan",
        "continues",
        "many",
        "quarter",
        "present",
        "addition",
        "intrigued",
        "manner",
        "christian",
        "theology",
        "drawing",
        "nineteeth",
        "twentiethcentury",
        "european",
        "philosophy",
        "pocket",
        "socalled",
        "buddhistchristian",
        "dialogue",
        "began",
        "emerge",
        "fully",
        "blossomed",
        "postcensorship",
        "era",
        "postwar",
        "philosophy",
        "postwar",
        "period",
        "brought",
        "three",
        "general",
        "development",
        "first",
        "end",
        "censorship",
        "liberal",
        "leftist",
        "thought",
        "often",
        "purge",
        "idea",
        "japanese",
        "philosophy",
        "smacking",
        "nativism",
        "ethnocentrism",
        "jingoism",
        "state",
        "shintō",
        "ideology",
        "often",
        "directed",
        "fairly",
        "unfairly",
        "toward",
        "assimilative",
        "tradition",
        "like",
        "kyoto",
        "school",
        "response",
        "immediate",
        "postwar",
        "generation",
        "two",
        "japanese",
        "academic",
        "philosophy",
        "department",
        "escaped",
        "western",
        "philosophy",
        "often",
        "carried",
        "sense",
        "purity",
        "rivaled",
        "earlier",
        "ethnocentric",
        "movement",
        "consequently",
        "large",
        "majority",
        "japanese",
        "academic",
        "philosopher",
        "trained",
        "latter",
        "half",
        "twentieth",
        "century",
        "pursued",
        "philosophy",
        "according",
        "method",
        "theme",
        "hardly",
        "distinguishable",
        "west",
        "second",
        "postwar",
        "response",
        "tradition",
        "like",
        "kyoto",
        "school",
        "born",
        "continue",
        "evolve",
        "without",
        "distraction",
        "old",
        "state",
        "ideology",
        "casting",
        "shadow",
        "enterprise",
        "movement",
        "generated",
        "increasing",
        "interest",
        "among",
        "philosopher",
        "europe",
        "united",
        "state",
        "especially",
        "continental",
        "influenced",
        "tradition",
        "quarter",
        "example",
        "kyoto",
        "school",
        "beginning",
        "recognized",
        "philosophical",
        "forum",
        "taking",
        "place",
        "alongside",
        "school",
        "global",
        "significance",
        "marburg",
        "frankfurt",
        "school",
        "lastly",
        "greater",
        "availability",
        "translation",
        "european",
        "language",
        "sprouting",
        "learned",
        "society",
        "japanese",
        "philosophy",
        "asia",
        "united",
        "state",
        "europe",
        "increasingly",
        "sign",
        "crossinfluence",
        "hybridization",
        "western",
        "philosopher",
        "even",
        "consider",
        "japanese",
        "specialist",
        "participating",
        "crosspollination",
        "idea",
        "philosopher",
        "need",
        "know",
        "danish",
        "influenced",
        "kierkegaard",
        "philosopher",
        "longer",
        "need",
        "know",
        "japanese",
        "influenced",
        "even",
        "contribute",
        "japanese",
        "philosophy",
        "last",
        "section",
        "article",
        "outline",
        "theme",
        "japanese",
        "philosophy",
        "may",
        "future",
        "stimulate",
        "philosopher",
        "various",
        "background",
        "national",
        "origin"
    ]
}