{
    "main_text": "Historical Periods of Philosophical Development and Interaction || Ancient and Classical Philosophy (up to 12th century)\n4.1 Ancient and Classical Philosophy (up to 12th century)\n\nThe ancient and classical periods of Japanese philosophy span the\nyears 604 (the traditional date of Shōtoku’s\nSeventeen-article Constitution) to 1185 (the fall of\naristocratic rule and the installation of the first military\nshogunate). In the usual Japanese reckoning, it covers the Late Kofun\n(or Asuka), Nara, and Heian periods. During that time Buddhism came to\ndominate the philosophical landscape by allocating the social and\nlegal systems to Confucianism and relegating proto-Shintō to a\nsubordinate place within its expanded, all-inclusive system. Prince\nRegent Shōtoku’s hope, as expressed in his\nConstitution, was to establish Buddhism as a state religion\nbut to continue state rituals venerating the proto-Shintō\nkami, while adhering to Confucian ideals (along with some\nChinese Legalist ideas) in organizing a centralized state government.\nEven after Shōtoku’s pro-Buddhist Soga family fell from\npower, the basic model endured. Chinese laws served as models and\nBuddhist texts and teachers continued to flow into Japan.\n\nWhen the first permanent capital was established in Nara in the eighth\ncentury, the city plan included a number of Buddhist temples,\nShintō shrines, and Buddhist institutes or study centers,\nincluding those of the so-called Six Nara Schools (all based on\nChinese Buddhist schools with roots traceable to India). Buddhist\npractice, especially for intensive periods, was often performed in\nmountain temple retreats in natural settings rather than in the city.\nCreative and innovative thinking was limited at this point, but that\nwould change with the establishment of two new schools at the\nbeginning of the ninth century, Tendai (founded by Saichō,\n767–822) and Shingon (founded by Kūkai, 774–835).\nAlthough both traditions originated in China, they assumed\ndistinctively comprehensive Japanese forms that would set the\ntrajectory of Buddhist philosophy in Japan for centuries to come. The\nmajor factor behind their success was their focus on “esoteric\nteachings” (mikkyō). In establishing that core\norientation, Kūkai was the pioneering figure and the more\nsophisticated philosopher, indeed often considered Japan’s\ngreatest premodern systematic thinker. (See the entry on \n Kūkai.)\n4.1.1 Kūkai’s Esoteric Foundation for Japanese Philosophizing\n\nThe linchpin in Kūkai’s philosophy was his distinction\nbetween engaged and detached knowing, which he formulated in terms of\nthe “difference between esoteric teachings\n(mikkyō) and exoteric teachings\n(kengyō).” (See the entry on \n Kūkai, section 3.2.)\nThe esoteric involves an interpersonal engagement between the cosmos\n(the activity of patterned, self-structuring resonances called\nDainichi Buddha) and the Shingon practitioner (who is a bodymind\nholographically inscribed with the same pattern as the cosmos). Wisdom\noccurs when the theory-praxis of the Shingon Buddhist enables the\ncosmic functions and the person’s functions to be in accord,\nthat is, to resonate harmoniously.\n\nBy contrast, Kūkai claims that detached or exoteric understanding\noccurs when there is a separation between knower and known, a gap that\ncan only be bridged with the external application of linguistic\ncategories or heuristic expressions (hōben; Sanskrit:\nupāya). So an exoteric philosophy, even if it knows\nabout engagement, cannot ground its own theory in an engaged\nway because it depends on external relations even to express itself.\nIt is, in effect, a theory about bodymind unity that is based only in\nthe mind. That realization led Kūkai to argue the inherent\nlimitation in exoteric philosophy is what gives rise to it, what in\nBuddhist terminology is called its mindset\n(jūshin).\n\nKūkai used relegation to explain his detailed “theory of\nthe ten mindsets” (jūjūshinron). (See the entry\non \n Kūkai, section 3.12.) \nHe analyzed all the philosophical\nstandpoints known to him into a hierarchy of the ten mindsets\nproducing them, starting from the base level of narcissistic\nphilosophy driven by animal impulses, up through the mindsets of\nConfucianism, Daoism, and continuing in the hierarchy through all the\nBuddhist schools existing in Japan at the time. Kūkai ranked\nKegon Buddhist philosophy at level nine, the highest level of exoteric\nthinking because it highlighted internal and holographic relations.\nOnly Shingon’s esoteric philosophy of embodied theory-praxis\nranked above it.\n\nIn determining his rankings, for each level Kūkai asked whether\nthat mindset could establish its own ground within its own terms. For\nexample, to put one’s own interest above others, the\nnarcissistic mindset (level one) must account for the existence of\nthose others in one’s own awareness. That, in turn, leads to an\nunderstanding that the self must be relational, a fundamental\nassumption of the Confucian mindset found in level two. That is, even\nthe egoism of narcissism, upon examination, assumes a relational self\nof the sort that is the point of departure for a Confucian analysis.\nThus a lack of foundation in mindset one opens to the prospect of\nmindset two. At the other end of the scale, Kegon Buddhism’s\nlevel-nine mindset generates a theory of the interpenetration of all\nthings and the holographic relation of whole-in-every-part, but to do\nso the mind must stand outside reality to characterize it as such.\nYet, its own theory implies the knower cannot be independent of the\nknown, nor the mind from the body. That opens the door to a praxis of\nengagement that is the basis for the esoteric mindset (level ten).\n\nKūkai argues the “mind” of the Shingon mindset is\nmore like “bodymind” because it is a knowing inseparable\nfrom praxis. Whereas a philosophy based in metaphysical theory can\nnever establish its own ground, a philosophy based in an engaged\nbodymind praxis can produce its ground as surely as, we might\nsay, the understanding of the master potter is produced in a masterful\nwork of pottery. Whereas the exoteric philosopher, using detachment\nand assuming external relations between self and reality, presents\ntruth as ideas linking those two relatents, the esoteric philosopher\nengages self and reality in an internal relation, presenting truth as\na unified bodymind performance of thought, word, and deed. In\nKūkai’s terminology, “one achieves buddha in, with,\nand through this very body” (sokushinjōbutsu).\n(See the entry on \n Kūkai, section 3.9.)\n\nAlthough Kūkai’s philosophy itself did not become dominant\nin the Japanese tradition, he set a pattern for philosophizing that\n(often without acknowledgment) continued to influence many later\nphilosophers even into modern times. First, he firmly entrenched a\npreference for internal and holographic relations. Second, he\ndemonstrated that a strong philosophical position should not only be\nable to show weaknesses in other positions but also, if it is truly\ncomprehensive, it should be able to explain how such an error or\nmisunderstanding could occur. In other words assimilation through\nrelegation is a stronger position than simple refutation because it\ntakes opposing theories as real theories deserving a place within any\nall-inclusive account of reality. Third, a way to evaluate a new\nphilosophical position is to try to understand the mindset that\nproduced it. That methodological strategy would be especially helpful\nas Japanese philosophers encountered new theories from other\ncultures.\n\nAs the classical period continued, Buddhist philosophizing was\nconcentrated in the monastic communities, especially the huge mountain\ncomplexes of Mt Hiei in Kyoto representing Tendai Buddhism and Mt\nKōya representing Shingon Buddhism. At first borrowing from\nShingon, Tendai soon evolved its own form of esotericism with\nadditional input from emissaries sent to China for further training.\nSince Tendai was already the most comprehensive form of exoteric\nteaching in Japan, when mated with esotericism, it became the most\ninclusive and comprehensive system of philosophy and praxis in the\ncountry. As a result, by the end of the classical period the monastic\ncenter on Mt Hiei emerged as the premier site of monastic education\nand philosophical training.\n4.1.2 Aesthetics in the Heian Court\n\nFor the lay aristocrats, the Heian court of Kyoto was the hub for the\nclassical study of both Chinese and Japanese arts and letters,\nbecoming a fertile ground for aesthetic theories, some of which were\nborrowed from China, but others emerging from more native\nsensitivities. The notion of reality as a self-expressive\nfield—whether formulated in terms of the native idea of\nkokoro or of the activity of the cosmos-as-buddha, whether\nseen as permeated with the spiritual power of kami or\nbuddhas, whether relished for the poignancy of its impermanent beauty\nhowever fleeting (as in the aesthetic of aware in Lady\nMurasaki’s Tale of Genji) or seen as a detached object\nfor amusement (as in the aesthetic of okashi in Sei no\nShonagon’s Pillow Book)—became a focal point for\nthe cloistered world of the Heian court, generating an artistic\nsensitivity and vocabulary that became a cornerstone of Japanese\naesthetics. As the classical period drew to a close, however, the\ncloistered worlds of the monastery and the Heian court would come\nunder attack and philosophical innovation would need to find new\ncontexts.\n",
    "section_title": "4.1 Ancient and Classical Philosophy (up to 12th century)",
    "entry_title": "Japanese Philosophy",
    "hierarchy_title": "Japanese Philosophy || Historical Periods of Philosophical Development and Interaction || Ancient and Classical Philosophy (up to 12th century)",
    "tokenized_text": [
        "historical",
        "period",
        "philosophical",
        "development",
        "interaction",
        "ancient",
        "classical",
        "philosophy",
        "th",
        "century",
        "ancient",
        "classical",
        "philosophy",
        "th",
        "century",
        "ancient",
        "classical",
        "period",
        "japanese",
        "philosophy",
        "span",
        "year",
        "traditional",
        "date",
        "shōtoku",
        "seventeenarticle",
        "constitution",
        "fall",
        "aristocratic",
        "rule",
        "installation",
        "first",
        "military",
        "shogunate",
        "usual",
        "japanese",
        "reckoning",
        "cover",
        "late",
        "kofun",
        "asuka",
        "nara",
        "heian",
        "period",
        "time",
        "buddhism",
        "came",
        "dominate",
        "philosophical",
        "landscape",
        "allocating",
        "social",
        "legal",
        "system",
        "confucianism",
        "relegating",
        "protoshintō",
        "subordinate",
        "place",
        "within",
        "expanded",
        "allinclusive",
        "system",
        "prince",
        "regent",
        "shōtoku",
        "hope",
        "expressed",
        "constitution",
        "establish",
        "buddhism",
        "state",
        "religion",
        "continue",
        "state",
        "ritual",
        "venerating",
        "protoshintō",
        "kami",
        "adhering",
        "confucian",
        "ideal",
        "along",
        "chinese",
        "legalist",
        "idea",
        "organizing",
        "centralized",
        "state",
        "government",
        "even",
        "shōtoku",
        "probuddhist",
        "soga",
        "family",
        "fell",
        "power",
        "basic",
        "model",
        "endured",
        "chinese",
        "law",
        "served",
        "model",
        "buddhist",
        "text",
        "teacher",
        "continued",
        "flow",
        "japan",
        "first",
        "permanent",
        "capital",
        "established",
        "nara",
        "eighth",
        "century",
        "city",
        "plan",
        "included",
        "number",
        "buddhist",
        "temple",
        "shintō",
        "shrine",
        "buddhist",
        "institute",
        "study",
        "center",
        "including",
        "socalled",
        "six",
        "nara",
        "school",
        "based",
        "chinese",
        "buddhist",
        "school",
        "root",
        "traceable",
        "india",
        "buddhist",
        "practice",
        "especially",
        "intensive",
        "period",
        "often",
        "performed",
        "mountain",
        "temple",
        "retreat",
        "natural",
        "setting",
        "rather",
        "city",
        "creative",
        "innovative",
        "thinking",
        "limited",
        "point",
        "would",
        "change",
        "establishment",
        "two",
        "new",
        "school",
        "beginning",
        "ninth",
        "century",
        "tendai",
        "founded",
        "saichō",
        "shingon",
        "founded",
        "kūkai",
        "although",
        "tradition",
        "originated",
        "china",
        "assumed",
        "distinctively",
        "comprehensive",
        "japanese",
        "form",
        "would",
        "set",
        "trajectory",
        "buddhist",
        "philosophy",
        "japan",
        "century",
        "come",
        "major",
        "factor",
        "behind",
        "success",
        "focus",
        "esoteric",
        "teaching",
        "mikkyō",
        "establishing",
        "core",
        "orientation",
        "kūkai",
        "pioneering",
        "figure",
        "sophisticated",
        "philosopher",
        "indeed",
        "often",
        "considered",
        "japan",
        "greatest",
        "premodern",
        "systematic",
        "thinker",
        "see",
        "entry",
        "kūkai",
        "kūkai",
        "esoteric",
        "foundation",
        "japanese",
        "philosophizing",
        "linchpin",
        "kūkai",
        "philosophy",
        "distinction",
        "engaged",
        "detached",
        "knowing",
        "formulated",
        "term",
        "difference",
        "esoteric",
        "teaching",
        "mikkyō",
        "exoteric",
        "teaching",
        "kengyō",
        "see",
        "entry",
        "kūkai",
        "section",
        "esoteric",
        "involves",
        "interpersonal",
        "engagement",
        "cosmos",
        "activity",
        "patterned",
        "selfstructuring",
        "resonance",
        "called",
        "dainichi",
        "buddha",
        "shingon",
        "practitioner",
        "bodymind",
        "holographically",
        "inscribed",
        "pattern",
        "cosmos",
        "wisdom",
        "occurs",
        "theorypraxis",
        "shingon",
        "buddhist",
        "enables",
        "cosmic",
        "function",
        "person",
        "function",
        "accord",
        "resonate",
        "harmoniously",
        "contrast",
        "kūkai",
        "claim",
        "detached",
        "exoteric",
        "understanding",
        "occurs",
        "separation",
        "knower",
        "known",
        "gap",
        "bridged",
        "external",
        "application",
        "linguistic",
        "category",
        "heuristic",
        "expression",
        "hōben",
        "sanskrit",
        "upāya",
        "exoteric",
        "philosophy",
        "even",
        "know",
        "engagement",
        "ground",
        "theory",
        "engaged",
        "way",
        "depends",
        "external",
        "relation",
        "even",
        "express",
        "effect",
        "theory",
        "bodymind",
        "unity",
        "based",
        "mind",
        "realization",
        "led",
        "kūkai",
        "argue",
        "inherent",
        "limitation",
        "exoteric",
        "philosophy",
        "give",
        "rise",
        "buddhist",
        "terminology",
        "called",
        "mindset",
        "jūshin",
        "kūkai",
        "used",
        "relegation",
        "explain",
        "detailed",
        "theory",
        "ten",
        "mindset",
        "jūjūshinron",
        "see",
        "entry",
        "kūkai",
        "section",
        "analyzed",
        "philosophical",
        "standpoint",
        "known",
        "hierarchy",
        "ten",
        "mindset",
        "producing",
        "starting",
        "base",
        "level",
        "narcissistic",
        "philosophy",
        "driven",
        "animal",
        "impulse",
        "mindset",
        "confucianism",
        "daoism",
        "continuing",
        "hierarchy",
        "buddhist",
        "school",
        "existing",
        "japan",
        "time",
        "kūkai",
        "ranked",
        "kegon",
        "buddhist",
        "philosophy",
        "level",
        "nine",
        "highest",
        "level",
        "exoteric",
        "thinking",
        "highlighted",
        "internal",
        "holographic",
        "relation",
        "shingon",
        "esoteric",
        "philosophy",
        "embodied",
        "theorypraxis",
        "ranked",
        "determining",
        "ranking",
        "level",
        "kūkai",
        "asked",
        "whether",
        "mindset",
        "could",
        "establish",
        "ground",
        "within",
        "term",
        "example",
        "put",
        "one",
        "interest",
        "others",
        "narcissistic",
        "mindset",
        "level",
        "one",
        "must",
        "account",
        "existence",
        "others",
        "one",
        "awareness",
        "turn",
        "lead",
        "understanding",
        "self",
        "must",
        "relational",
        "fundamental",
        "assumption",
        "confucian",
        "mindset",
        "found",
        "level",
        "two",
        "even",
        "egoism",
        "narcissism",
        "upon",
        "examination",
        "assumes",
        "relational",
        "self",
        "sort",
        "point",
        "departure",
        "confucian",
        "analysis",
        "thus",
        "lack",
        "foundation",
        "mindset",
        "one",
        "open",
        "prospect",
        "mindset",
        "two",
        "end",
        "scale",
        "kegon",
        "buddhism",
        "levelnine",
        "mindset",
        "generates",
        "theory",
        "interpenetration",
        "thing",
        "holographic",
        "relation",
        "wholeineverypart",
        "mind",
        "must",
        "stand",
        "outside",
        "reality",
        "characterize",
        "yet",
        "theory",
        "implies",
        "knower",
        "independent",
        "known",
        "mind",
        "body",
        "open",
        "door",
        "praxis",
        "engagement",
        "basis",
        "esoteric",
        "mindset",
        "level",
        "ten",
        "kūkai",
        "argues",
        "mind",
        "shingon",
        "mindset",
        "like",
        "bodymind",
        "knowing",
        "inseparable",
        "praxis",
        "whereas",
        "philosophy",
        "based",
        "metaphysical",
        "theory",
        "never",
        "establish",
        "ground",
        "philosophy",
        "based",
        "engaged",
        "bodymind",
        "praxis",
        "produce",
        "ground",
        "surely",
        "might",
        "say",
        "understanding",
        "master",
        "potter",
        "produced",
        "masterful",
        "work",
        "pottery",
        "whereas",
        "exoteric",
        "philosopher",
        "using",
        "detachment",
        "assuming",
        "external",
        "relation",
        "self",
        "reality",
        "present",
        "truth",
        "idea",
        "linking",
        "two",
        "relatents",
        "esoteric",
        "philosopher",
        "engages",
        "self",
        "reality",
        "internal",
        "relation",
        "presenting",
        "truth",
        "unified",
        "bodymind",
        "performance",
        "thought",
        "word",
        "deed",
        "kūkai",
        "terminology",
        "one",
        "achieves",
        "buddha",
        "body",
        "sokushinjōbutsu",
        "see",
        "entry",
        "kūkai",
        "section",
        "although",
        "kūkai",
        "philosophy",
        "become",
        "dominant",
        "japanese",
        "tradition",
        "set",
        "pattern",
        "philosophizing",
        "often",
        "without",
        "acknowledgment",
        "continued",
        "influence",
        "many",
        "later",
        "philosopher",
        "even",
        "modern",
        "time",
        "first",
        "firmly",
        "entrenched",
        "preference",
        "internal",
        "holographic",
        "relation",
        "second",
        "demonstrated",
        "strong",
        "philosophical",
        "position",
        "able",
        "show",
        "weakness",
        "position",
        "also",
        "truly",
        "comprehensive",
        "able",
        "explain",
        "error",
        "misunderstanding",
        "could",
        "occur",
        "word",
        "assimilation",
        "relegation",
        "stronger",
        "position",
        "simple",
        "refutation",
        "take",
        "opposing",
        "theory",
        "real",
        "theory",
        "deserving",
        "place",
        "within",
        "allinclusive",
        "account",
        "reality",
        "third",
        "way",
        "evaluate",
        "new",
        "philosophical",
        "position",
        "try",
        "understand",
        "mindset",
        "produced",
        "methodological",
        "strategy",
        "would",
        "especially",
        "helpful",
        "japanese",
        "philosopher",
        "encountered",
        "new",
        "theory",
        "culture",
        "classical",
        "period",
        "continued",
        "buddhist",
        "philosophizing",
        "concentrated",
        "monastic",
        "community",
        "especially",
        "huge",
        "mountain",
        "complex",
        "mt",
        "hiei",
        "kyoto",
        "representing",
        "tendai",
        "buddhism",
        "mt",
        "kōya",
        "representing",
        "shingon",
        "buddhism",
        "first",
        "borrowing",
        "shingon",
        "tendai",
        "soon",
        "evolved",
        "form",
        "esotericism",
        "additional",
        "input",
        "emissary",
        "sent",
        "china",
        "training",
        "since",
        "tendai",
        "already",
        "comprehensive",
        "form",
        "exoteric",
        "teaching",
        "japan",
        "mated",
        "esotericism",
        "became",
        "inclusive",
        "comprehensive",
        "system",
        "philosophy",
        "praxis",
        "country",
        "result",
        "end",
        "classical",
        "period",
        "monastic",
        "center",
        "mt",
        "hiei",
        "emerged",
        "premier",
        "site",
        "monastic",
        "education",
        "philosophical",
        "training",
        "aesthetic",
        "heian",
        "court",
        "lay",
        "aristocrat",
        "heian",
        "court",
        "kyoto",
        "hub",
        "classical",
        "study",
        "chinese",
        "japanese",
        "art",
        "letter",
        "becoming",
        "fertile",
        "ground",
        "aesthetic",
        "theory",
        "borrowed",
        "china",
        "others",
        "emerging",
        "native",
        "sensitivity",
        "notion",
        "reality",
        "selfexpressive",
        "fieldwhether",
        "formulated",
        "term",
        "native",
        "idea",
        "kokoro",
        "activity",
        "cosmosasbuddha",
        "whether",
        "seen",
        "permeated",
        "spiritual",
        "power",
        "kami",
        "buddha",
        "whether",
        "relished",
        "poignancy",
        "impermanent",
        "beauty",
        "however",
        "fleeting",
        "aesthetic",
        "aware",
        "lady",
        "murasaki",
        "tale",
        "genji",
        "seen",
        "detached",
        "object",
        "amusement",
        "aesthetic",
        "okashi",
        "sei",
        "shonagon",
        "pillow",
        "book",
        "became",
        "focal",
        "point",
        "cloistered",
        "world",
        "heian",
        "court",
        "generating",
        "artistic",
        "sensitivity",
        "vocabulary",
        "became",
        "cornerstone",
        "japanese",
        "aesthetic",
        "classical",
        "period",
        "drew",
        "close",
        "however",
        "cloistered",
        "world",
        "monastery",
        "heian",
        "court",
        "would",
        "come",
        "attack",
        "philosophical",
        "innovation",
        "would",
        "need",
        "find",
        "new",
        "context"
    ]
}