{
    "main_text": "Japanese Pure Land Buddhism’s Encounter with Modernity || The Modernization of Buddhist Thought: Intellectual Reform\n5.3 Existential Engagement with Pure Land Buddhism\n\nThe aforementioned M. L. Gordon had claimed that an experiential\nconversion—“a deep personal loathing of sin” or\nawareness of “a certain and present forgiveness of\nsin”—is the hallmark of the genuinely religious. That\nconversion experience, he maintained, lends Christianity a power\nlacking in Japanese Buddhism, which he saw as moribund and widely\ndiscredited in modern times. Admittedly, the Christian concepts of sin\nand forgiveness are absent from Pure Land Buddhism. Yet, some Buddhist\nthinkers felt challenged to develop the practical dimension of the\nPure Land tradition, even while adopting Inoue’s philosophical\nterminology. They accepted the Christian critique, acknowledging the\nChristian strength as indispensable for, in Gordon’s expression,\n“a living religion.”\n\nThe representative Japanese Buddhist figure here is the Pure Land\npriest Kiyozawa Manshi (1863–1903), a younger associate of Inoue who\nhad also studied Western philosophy at Tokyo Imperial University.\nDespite his early death, Kiyozawa’s efforts to democratize and\nmodernize the Shin Buddhist temple institution deeply influenced\nsucceeding thinkers of the Higashi Honganji tradition. Like Inoue, he\nspeaks of the finite and infinite (or absolute) as mediated by reason\nin philosophy and by faith in religion. Kiyozawa is distinctive,\nthough, in his decidedly practical orientation, exploring the\nencounter with the absolute in religious life. In his late twenties,\nhe undertook an ascetic discipline of daily life and diet that ended\nafter several years when he contracted tuberculosis. In the last five\nyears of his life, he was strongly attracted to the introspective\nspiritual cultivation of equanimity and indifference to contingencies\nthat he found in the early scriptures of Buddhism and especially in\nthe Stoic philosopher Epictetus.\n\nAlthough Kiyozawa makes little mention of Christianity in his writings\nbeyond, for example, reflections on the doctrines of creation or\nmonotheism from a comparative philosophical perspective, we find in\nhis journal in 1898, amid passages from Epictetus and other classical\ntexts, references to biblical passages in standard English notation.\nIn relation to the notion “God is in man,” which he\nconsiders “an old doctrine” found in classical Western\nauthors, Kiyozawa gives references to five Bible passages, including:\n“Do you not know that your bodies are temples of the Holy\nSpirit, who is in you, whom you have received from God?” (I Cor.\n6:19); “Guard the good deposit that was entrusted to\nyou—guard it with the help of the Holy Spirit who lives in\nus” (2 Tim. 1:4); “No one has ever seen God; but if we\nlove one another, God lives in us … He has given us of his\nSpirit” (I John 3:12–13).\n\nThe references suggest a close familiarity with the Bible, probably\nfrom his youth. Although Kiyozawa makes no reference to Christianity\nitself in this context, in his pursuit of immediate experience, in his\nprobing self-examination, and in his works for institutional and\neducational reform, he appears almost to embody a Buddhist response to\nGordon’s accusation that Buddhism lacks the power to influence\ndaily life and ethical social action. Toward the end of his life,\nKiyozawa created a Buddhist movement for the quest of “spiritual\nliving” (seishin-shugi), which he defines in terms of\nthe personal encounter with the absolute.\n\nIn Kiyozawa’s disciple Soga Ryōjin (1875–1971), also a Shin\nBuddhist priest, we find the same interest in articulating the\npersonal immediacy of religious teachings. Instead of seeking, like\nhis teacher, to build on the legitimacy of philosophy and science,\ncarving out a place for Buddhism beyond the limitations of a rational\nphilosophical analysis of life experience, Soga stood within Shin\nBuddhist teachings and sought to show their vital significance. He did\nso by drawing on broader Mahayana Buddhist concepts, comparing them at\ntimes with Christian modes of thought.\n\nIn an article for fellow missionaries explaining Amida Buddha and the\nPure Land, Gordon quotes Rhys Davids in characterizing them as\n“hypothetical beings, the creations of a sickly scholasticism,\nhollow abstractions without life or reality” (“The Legend\nof Amida”). In the 1880s, Christian missionaries undoubtedly\nfelt confident that to expose Pure Land teachings as\n“tales” unknown to Gotama would lead to the dismantling of\n“the most powerful sect in Japan.” Pure Land Buddhists\nwere keenly aware of such criticism, and it may have prompted Soga and\nothers to ponder Christian ideas in exploring the existential,\nreligious meaning of Pure Land teachings. While temple institutions\nhad pursued the study of Christian theology for polemical purposes, it\nappears that by the turn of the twentieth century, some Buddhist\nphilosophers had gained a new confidence of their own, allowing\nthemselves to be stimulated by Christian theological ideas.\n\nIn one of his seminal essays, “Savior on Earth,” Soga\nbegins:\n\nIn the first part of July last year (1912), … I intuited the\nphrase, “The Tathagata (Amida) is myself,” and in the\nlatter part of August, … the phrase, “The Tathagata\nbecomes me and saves me,” was bestowed on me. Finally, about\nOctober, I was brought to realize that “‘The Tathagata\nbecomes me’ signifies the birth of Dharmakara\nBodhisattva.” (Blum and Rhodes 2011, p. 107, translation\nmodified)\n\n\nThis essay was published in 1913 in the magazine begun by Kiyozawa,\nSeishinkai (The World of Spiritual Living), fifteen years\nafter Kiyozawa’s journal references to the Bible quoted above.\nAlthough Soga is spoken of as “arguably the most innovative\nthinker in modern Shin Buddhist history” by sectarian scholars,\nand although he employs the traditional Shin term “directed [by\nAmida]” (ekō) in speaking of the source of his\n“revelation,” it is highly likely that Soga had been\ntesting how Christian ideas might help in developing Shin teachings.\nThe term “savior” (kyūshu) in Soga’s\ntitle is widely used for Jesus Christ, and in comparative remarks in\nthe essay, Soga asserts that the unique incarnation as Jesus limits\nGod’s salvific power to Jesus personally, while Dharmakara is\nborn in each person and becomes “the true subjectivity of the\nself in the desire for salvation.”\n\nSoga not only counters criticisms that Amida is merely mythical and\nthat Pure Land Buddhism lacks historical foundations, but also\nstrongly affirms in doctrinal terms the immediacy of personal\nreligious experience in Shin. Christian concepts related to kenosis,\nincarnation in historical time, and trinity may have stimulated\nSoga’s rethinking of the relationship between the practitioner\nand Amida. There is also the matter of the temporal dimension in this\nrelationship. Previously the Japanese Pure Land tradition had\narticulated the Mahayana logic of the nonduality of the temporal and\nthe uncreated (or transtemporal). That said, the Christian critique\nand Augustinian concepts of time and eternity may also have inspired\nSoga’s interpretation of the vast time spans in the narrative of\nDharmakara’s vows and practice. As Soga explains:\n\nPeople are apt to consider this as an old tale that has nothing to do\nwith their present selves. In fact, however, the one-moment wherein\nDharmakara Bodhisattva evoked the faith of sincere entrusting is an\nabsolute moment that embraces innumerable eons. And equally the first\nmoment wherein we are made to experience faith is an absolute moment\nthat covers innumerable eons … . The present of faith is the\ngreat present of immeasurable life. (Blum and Rhodes 2011, p. 115)\n\n\nThe philosopher Nishitani Keiji (1900–1990) also articulates\nShinran’s treatment of time in terms of the nondiscrimination or\nsimultaneity of the temporal and the timeless or eternal (Nishitani\n1978).\n\nChristianity challenged Japanese Buddhists by teaching a personal\nreligiosity and a stringent individual moral responsibility. Kiyozawa\noffers a prominent example of the attempt to engage those issues.\nRegarding the narrative of the origin of Amida Buddha and the Pure\nLand, which Gordon and other Christian missionaries regarded as\nobvious fictions created late in the Buddhist tradition, Soga may have\nfound resources for resolution in the very Christian sources behind\nthe criticisms. The Japanese Mahayana tradition had already developed\nit own concepts of the compassionate emergence out of emptiness or\nformless reality as well as the nonduality of the karmically\nconditioned and unconditioned. Those ideas provided an openness to and\npoint of entry into certain areas of Christian and Western\nphilosophical thought. During the twentieth century, philosophers such\nas Nishida Kitarō, Tanabe Hajime, Nishitani Keiji, Takeuchi\nYoshinori, and Abe Masao have drawn on both the Christian and Japanese\nBuddhist traditions, particularly Pure Land and Zen, in engaging\nmodern philosophical issues.\n",
    "section_title": "5.3 Existential Engagement with Pure Land Buddhism",
    "entry_title": "Japanese Pure Land Philosophy",
    "hierarchy_title": "Japanese Pure Land Philosophy || Japanese Pure Land Buddhism’s Encounter with Modernity || The Modernization of Buddhist Thought: Intellectual Reform",
    "tokenized_text": [
        "japanese",
        "pure",
        "land",
        "buddhism",
        "encounter",
        "modernity",
        "modernization",
        "buddhist",
        "thought",
        "intellectual",
        "reform",
        "existential",
        "engagement",
        "pure",
        "land",
        "buddhism",
        "aforementioned",
        "m",
        "l",
        "gordon",
        "claimed",
        "experiential",
        "conversion",
        "deep",
        "personal",
        "loathing",
        "sin",
        "awareness",
        "certain",
        "present",
        "forgiveness",
        "sin",
        "is",
        "hallmark",
        "genuinely",
        "religious",
        "conversion",
        "experience",
        "maintained",
        "lends",
        "christianity",
        "power",
        "lacking",
        "japanese",
        "buddhism",
        "saw",
        "moribund",
        "widely",
        "discredited",
        "modern",
        "time",
        "admittedly",
        "christian",
        "concept",
        "sin",
        "forgiveness",
        "absent",
        "pure",
        "land",
        "buddhism",
        "yet",
        "buddhist",
        "thinker",
        "felt",
        "challenged",
        "develop",
        "practical",
        "dimension",
        "pure",
        "land",
        "tradition",
        "even",
        "adopting",
        "inoue",
        "philosophical",
        "terminology",
        "accepted",
        "christian",
        "critique",
        "acknowledging",
        "christian",
        "strength",
        "indispensable",
        "gordon",
        "expression",
        "living",
        "religion",
        "representative",
        "japanese",
        "buddhist",
        "figure",
        "pure",
        "land",
        "priest",
        "kiyozawa",
        "manshi",
        "younger",
        "associate",
        "inoue",
        "also",
        "studied",
        "western",
        "philosophy",
        "tokyo",
        "imperial",
        "university",
        "despite",
        "early",
        "death",
        "kiyozawa",
        "effort",
        "democratize",
        "modernize",
        "shin",
        "buddhist",
        "temple",
        "institution",
        "deeply",
        "influenced",
        "succeeding",
        "thinker",
        "higashi",
        "honganji",
        "tradition",
        "like",
        "inoue",
        "speaks",
        "finite",
        "infinite",
        "absolute",
        "mediated",
        "reason",
        "philosophy",
        "faith",
        "religion",
        "kiyozawa",
        "distinctive",
        "though",
        "decidedly",
        "practical",
        "orientation",
        "exploring",
        "encounter",
        "absolute",
        "religious",
        "life",
        "late",
        "twenty",
        "undertook",
        "ascetic",
        "discipline",
        "daily",
        "life",
        "diet",
        "ended",
        "several",
        "year",
        "contracted",
        "tuberculosis",
        "last",
        "five",
        "year",
        "life",
        "strongly",
        "attracted",
        "introspective",
        "spiritual",
        "cultivation",
        "equanimity",
        "indifference",
        "contingency",
        "found",
        "early",
        "scripture",
        "buddhism",
        "especially",
        "stoic",
        "philosopher",
        "epictetus",
        "although",
        "kiyozawa",
        "make",
        "little",
        "mention",
        "christianity",
        "writing",
        "beyond",
        "example",
        "reflection",
        "doctrine",
        "creation",
        "monotheism",
        "comparative",
        "philosophical",
        "perspective",
        "find",
        "journal",
        "amid",
        "passage",
        "epictetus",
        "classical",
        "text",
        "reference",
        "biblical",
        "passage",
        "standard",
        "english",
        "notation",
        "relation",
        "notion",
        "god",
        "man",
        "considers",
        "old",
        "doctrine",
        "found",
        "classical",
        "western",
        "author",
        "kiyozawa",
        "give",
        "reference",
        "five",
        "bible",
        "passage",
        "including",
        "know",
        "body",
        "temple",
        "holy",
        "spirit",
        "received",
        "god",
        "cor",
        "guard",
        "good",
        "deposit",
        "entrusted",
        "youguard",
        "help",
        "holy",
        "spirit",
        "life",
        "u",
        "tim",
        "one",
        "ever",
        "seen",
        "god",
        "love",
        "one",
        "another",
        "god",
        "life",
        "u",
        "given",
        "u",
        "spirit",
        "john",
        "reference",
        "suggest",
        "close",
        "familiarity",
        "bible",
        "probably",
        "youth",
        "although",
        "kiyozawa",
        "make",
        "reference",
        "christianity",
        "context",
        "pursuit",
        "immediate",
        "experience",
        "probing",
        "selfexamination",
        "work",
        "institutional",
        "educational",
        "reform",
        "appears",
        "almost",
        "embody",
        "buddhist",
        "response",
        "gordon",
        "accusation",
        "buddhism",
        "lack",
        "power",
        "influence",
        "daily",
        "life",
        "ethical",
        "social",
        "action",
        "toward",
        "end",
        "life",
        "kiyozawa",
        "created",
        "buddhist",
        "movement",
        "quest",
        "spiritual",
        "living",
        "seishinshugi",
        "defines",
        "term",
        "personal",
        "encounter",
        "absolute",
        "kiyozawa",
        "disciple",
        "soga",
        "ryōjin",
        "also",
        "shin",
        "buddhist",
        "priest",
        "find",
        "interest",
        "articulating",
        "personal",
        "immediacy",
        "religious",
        "teaching",
        "instead",
        "seeking",
        "like",
        "teacher",
        "build",
        "legitimacy",
        "philosophy",
        "science",
        "carving",
        "place",
        "buddhism",
        "beyond",
        "limitation",
        "rational",
        "philosophical",
        "analysis",
        "life",
        "experience",
        "soga",
        "stood",
        "within",
        "shin",
        "buddhist",
        "teaching",
        "sought",
        "show",
        "vital",
        "significance",
        "drawing",
        "broader",
        "mahayana",
        "buddhist",
        "concept",
        "comparing",
        "time",
        "christian",
        "mode",
        "thought",
        "article",
        "fellow",
        "missionary",
        "explaining",
        "amida",
        "buddha",
        "pure",
        "land",
        "gordon",
        "quote",
        "rhys",
        "david",
        "characterizing",
        "hypothetical",
        "being",
        "creation",
        "sickly",
        "scholasticism",
        "hollow",
        "abstraction",
        "without",
        "life",
        "reality",
        "legend",
        "amida",
        "s",
        "christian",
        "missionary",
        "undoubtedly",
        "felt",
        "confident",
        "expose",
        "pure",
        "land",
        "teaching",
        "tale",
        "unknown",
        "gotama",
        "would",
        "lead",
        "dismantling",
        "powerful",
        "sect",
        "japan",
        "pure",
        "land",
        "buddhist",
        "keenly",
        "aware",
        "criticism",
        "may",
        "prompted",
        "soga",
        "others",
        "ponder",
        "christian",
        "idea",
        "exploring",
        "existential",
        "religious",
        "meaning",
        "pure",
        "land",
        "teaching",
        "temple",
        "institution",
        "pursued",
        "study",
        "christian",
        "theology",
        "polemical",
        "purpose",
        "appears",
        "turn",
        "twentieth",
        "century",
        "buddhist",
        "philosopher",
        "gained",
        "new",
        "confidence",
        "allowing",
        "stimulated",
        "christian",
        "theological",
        "idea",
        "one",
        "seminal",
        "essay",
        "savior",
        "earth",
        "soga",
        "begin",
        "first",
        "part",
        "july",
        "last",
        "year",
        "intuited",
        "phrase",
        "tathagata",
        "amida",
        "latter",
        "part",
        "august",
        "phrase",
        "tathagata",
        "becomes",
        "save",
        "bestowed",
        "finally",
        "october",
        "brought",
        "realize",
        "tathagata",
        "becomes",
        "signifies",
        "birth",
        "dharmakara",
        "bodhisattva",
        "blum",
        "rhodes",
        "p",
        "translation",
        "modified",
        "essay",
        "published",
        "magazine",
        "begun",
        "kiyozawa",
        "seishinkai",
        "world",
        "spiritual",
        "living",
        "fifteen",
        "year",
        "kiyozawa",
        "journal",
        "reference",
        "bible",
        "quoted",
        "although",
        "soga",
        "spoken",
        "arguably",
        "innovative",
        "thinker",
        "modern",
        "shin",
        "buddhist",
        "history",
        "sectarian",
        "scholar",
        "although",
        "employ",
        "traditional",
        "shin",
        "term",
        "directed",
        "amida",
        "ekō",
        "speaking",
        "source",
        "revelation",
        "highly",
        "likely",
        "soga",
        "testing",
        "christian",
        "idea",
        "might",
        "help",
        "developing",
        "shin",
        "teaching",
        "term",
        "savior",
        "kyūshu",
        "soga",
        "title",
        "widely",
        "used",
        "jesus",
        "christ",
        "comparative",
        "remark",
        "essay",
        "soga",
        "asserts",
        "unique",
        "incarnation",
        "jesus",
        "limit",
        "god",
        "salvific",
        "power",
        "jesus",
        "personally",
        "dharmakara",
        "born",
        "person",
        "becomes",
        "true",
        "subjectivity",
        "self",
        "desire",
        "salvation",
        "soga",
        "counter",
        "criticism",
        "amida",
        "merely",
        "mythical",
        "pure",
        "land",
        "buddhism",
        "lack",
        "historical",
        "foundation",
        "also",
        "strongly",
        "affirms",
        "doctrinal",
        "term",
        "immediacy",
        "personal",
        "religious",
        "experience",
        "shin",
        "christian",
        "concept",
        "related",
        "kenosis",
        "incarnation",
        "historical",
        "time",
        "trinity",
        "may",
        "stimulated",
        "soga",
        "rethinking",
        "relationship",
        "practitioner",
        "amida",
        "also",
        "matter",
        "temporal",
        "dimension",
        "relationship",
        "previously",
        "japanese",
        "pure",
        "land",
        "tradition",
        "articulated",
        "mahayana",
        "logic",
        "nonduality",
        "temporal",
        "uncreated",
        "transtemporal",
        "said",
        "christian",
        "critique",
        "augustinian",
        "concept",
        "time",
        "eternity",
        "may",
        "also",
        "inspired",
        "soga",
        "interpretation",
        "vast",
        "time",
        "span",
        "narrative",
        "dharmakara",
        "vow",
        "practice",
        "soga",
        "explains",
        "people",
        "apt",
        "consider",
        "old",
        "tale",
        "nothing",
        "present",
        "self",
        "fact",
        "however",
        "onemoment",
        "wherein",
        "dharmakara",
        "bodhisattva",
        "evoked",
        "faith",
        "sincere",
        "entrusting",
        "absolute",
        "moment",
        "embrace",
        "innumerable",
        "eon",
        "equally",
        "first",
        "moment",
        "wherein",
        "made",
        "experience",
        "faith",
        "absolute",
        "moment",
        "cover",
        "innumerable",
        "eon",
        "present",
        "faith",
        "great",
        "present",
        "immeasurable",
        "life",
        "blum",
        "rhodes",
        "p",
        "philosopher",
        "nishitani",
        "keiji",
        "also",
        "articulates",
        "shinran",
        "treatment",
        "time",
        "term",
        "nondiscrimination",
        "simultaneity",
        "temporal",
        "timeless",
        "eternal",
        "nishitani",
        "christianity",
        "challenged",
        "japanese",
        "buddhist",
        "teaching",
        "personal",
        "religiosity",
        "stringent",
        "individual",
        "moral",
        "responsibility",
        "kiyozawa",
        "offer",
        "prominent",
        "example",
        "attempt",
        "engage",
        "issue",
        "regarding",
        "narrative",
        "origin",
        "amida",
        "buddha",
        "pure",
        "land",
        "gordon",
        "christian",
        "missionary",
        "regarded",
        "obvious",
        "fiction",
        "created",
        "late",
        "buddhist",
        "tradition",
        "soga",
        "may",
        "found",
        "resource",
        "resolution",
        "christian",
        "source",
        "behind",
        "criticism",
        "japanese",
        "mahayana",
        "tradition",
        "already",
        "developed",
        "concept",
        "compassionate",
        "emergence",
        "emptiness",
        "formless",
        "reality",
        "well",
        "nonduality",
        "karmically",
        "conditioned",
        "unconditioned",
        "idea",
        "provided",
        "openness",
        "point",
        "entry",
        "certain",
        "area",
        "christian",
        "western",
        "philosophical",
        "thought",
        "twentieth",
        "century",
        "philosopher",
        "nishida",
        "kitarō",
        "tanabe",
        "hajime",
        "nishitani",
        "keiji",
        "takeuchi",
        "yoshinori",
        "abe",
        "masao",
        "drawn",
        "christian",
        "japanese",
        "buddhist",
        "tradition",
        "particularly",
        "pure",
        "land",
        "zen",
        "engaging",
        "modern",
        "philosophical",
        "issue"
    ]
}