{
    "main_text": "Philosophy of Education || Education and Human Thriving\n6. Race\n\nJefferson’s views on race have been the focus of considerable\ndiscussion in the secondary\n literature.[35]\n Those views, which would be considered today as racist, were likely\ninfluenced by the views of the leading naturalists of his day. In that\nregard, he was the product, not ahead, of his time.\n\nMost of the discussion of Jefferson’s views on Blacks concerns\nhis Notes on the State of Virginia. In Query XIV, Jefferson\nwrites, “In memory [Blacks] are equal to the whites”\n([NV]: 139). “In reason,” Jefferson says, “[Blacks\nare] much inferior [to Whites], as I think one could scarcely be found\ncapable of tracing and comprehending the investigations of\nEuclid” ([NV]: 139). He adds, “Never yet could I find that\na black had uttered a thought above the level of plain\nnarration” ([NV]: 140). “In imagination [Blacks] are dull,\ntasteless, and anomalous,” and that is evident in their art. In\nmusic, Blacks have accurate ears “for tune and time,” are\ngenerally more gifted than Whites, and are capable of a “small\ncatch,” as illustrated by their talent with the\n“Banjar,” a guitar-like instrument “brought …\nfrom Africa.” “Whether they will be equal to the\ncomposition of a more extensive run of melody, or of complicated\nharmony, is yet to be proved.” Despite their misery, which\n“is often the parent of the most affecting touches of\npoetry,” they have “no poetry” ([NV]: 40–41\nand 288n10).\n\nInferiority of mind and imagination, he adds, is also confirmed, in\nJefferson’s estimation, by “the improvement of the blacks\nin body and mind, in the first instance of their mixture with the\nwhites,” and that “has been observed by every one, and\nproves that their inferiority is not the effect merely of their\ncondition of life” ([NV]: 141). Here he may be referencing\n“observations” in scientific texts of his day in his\nlibrary.\n\nIn morality, Jefferson admits, Blacks are the equals of all\nothers.\n\n\nWe find among them numerous instances of the most rigid integrity, and\nas many as among their better instructed masters, of benevolence,\ngratitude, and unshaken fidelity.\n\n\nWhat he takes to be their “disposition to theft,”\nJefferson explains thus: “The man, in whose favour no laws of\nproperty exist, probably feels himself less bound to respect those\nmade in favour of others.” Might not a slave “justifiably\ntake a little from one, who has taken all from him” ([NV]:\n142).\n\nAll such conclusions, Jefferson says, are provisional: They have the\nconfirmation of observation, but Blacks as well as “red\nmen” hitherto have not been the subjects of natural history.\n\n\nThe opinion, that they are inferior in the faculties of reason and\nimagination, must be hazarded with great diffidence. To justify a\ngeneral conclusion, requires many observations, even where the subject\nmay be submitted to the Anatomical knife, to Optical glasses, to\nanalysis by fire or by solvents. How much more then where it is a\nfaculty, not a substance, we are examining; where it eludes the\nresearch of all the senses; where the conditions of its existence are\nvarious and variously combined; where the effects of those which are\npresent or absent bid defiance to calculation; let me add too, as a\ncircumstance of great tenderness, where our conclusion would degrade a\nwhole race of men from the rank in the scale of beings which their\nCreator may perhaps have given them. To our reproach it must be said,\nthat though for a century and a half we have had under our eyes the\nraces of black and of red men, they have never yet been viewed by us\nas subjects of natural history. I advance it therefore as a suspicion\nonly, that the blacks … are inferior to the whites in the\nendowments both of body and mind ([NV]: 143).\n\n\nThough he stated that Blacks and Native Americans had not been the\nsubjects of natural history, there was a large body of literature by\nleading naturalists of his day—e.g., Swedish biologist Carl\nLinnaeus ([1758] 1808), Oliver Goldsmith ([1774] 1823), and\n“Georges” Cuvier ([1817] 1831)—to which Jefferson\nhad access and which he doubtless assimilated. That literature viewed\nBlacks and Native Americans as inferior to white Europeans, and the\noverall tendency was to associate darker skin with increased\n inferiority.[36]\n Prominent philosophers like David Hume (1755 [1987]: 208n10), Adam\nSmith (1759 [1982]: 208), and C.F. de Volney in (1802 [2010]: 68) also\nasserted the inferiority of Blacks and Native Americans.\n\nThis smattering of the “science” of Jefferson’s time\nshows that some of the most esteemed scientists held that Blacks and\nNative Americans, considering each as a race or subspecies of humans,\nwere regarded as inferior or\n defective.[37]\n Jefferson owned and was informed by most of that literature, since he\ntended to be aware of recent developments in all of the sciences. Thus\nJefferson’s “observations” were tainted by the\n“observations” or prejudgments of the authorities of his\nday. Despite his view of them as inferior, he recognized Blacks, as\nmoral equals of all others, had the same rights as all other men. He\nwrites to Bishop Grégoire (25 Feb. 1809):\n\n\nWhatever be [Blacks’] degree of talent it is no measure of their\nrights. Because Sir Isaac Newton was superior to others in\nunderstanding, he was not therefore lord of the person or property of\nothers.\n\n\nNonetheless, Jefferson’s view of Native Americans was\ninconsistent with those naturalists who viewed them too as a race\ninferior to Europeans, and that requires some explanation. In Query\nXIV of his Notes on the State of Virginia, Jefferson offers a\nbrief analysis of Native Americans as a race. Not having had the\n“advantages” of exposure to European culture that Blacks\nhave had, still Native Americans “often carve figures on their\npipes not destitute of design and merit” ([NV]: 140). Their\ncarvings and drawings “prove the existence of a germ in their\nminds which only wants\n cultivation.”[38]\n He continues,\n\n\nThey astonish you with strokes of the most sublime oratory; such as\nprove their reason and sentiment strong, their imagination glowing and\nelevated. ([NV]: 140)\n\n\nOne may wonder how much “advantage” Jefferson imagines\nBlacks should demonstrate on account of their exposure to the\n“culture” of their oppressors while enslaved. But\nJefferson maintains that though “most of [the Blacks in America]\nhave been confined to tillage, to their own homes, and their own\nsociety” and have had little direct exposure to sciences and the\narts,\n\n\nmany have been so situated, that they might have availed themselves of\nthe conversation of their masters; many have been brought up to the\nhandicraft arts, and from that circumstance have always been\nassociated with the whites. Some have been liberally educated, and all\nhave lived in countries where the arts and sciences are cultivated to\na considerable degree, and have had before their eyes samples of the\nbest works from abroad ([NV]: 139–40).\n\n\nThus, Jefferson’s assessment of Blacks differs from his\nassessment of Native Americans. It is unclear whether that difference\nis natural or nurtural. The intimation in  Notes on the State of\nVirginia and in a letter to Edmund Coles (25 Aug. 1814) is\nnatural, though in other letters (e.g., TJ tp Benjamin Banneker, 30\nAug. 1791, and TJ to Bishop Grégoire, 25 Feb. 1809), the\nsuggestion is nurtural, though deficiencies are so pronounced that\nthere can be no rapid change of situation. With Native Americans, the\nscenario is otherwise.\n\nThere is also a sentiment commonly expressed in the secondary\nliterature (e.g., Risjord 2002: 50–1, and Holowchak 2012,\n243–48) that Jefferson had a personal, or political, interest in\ndefending Native Americans that he did not have for Blacks.\nBuffon—perhaps the greatest naturalist of his day—argued\nthat since the continent of North America was colder and wetter than\nthat of\n Europe,[39]\n its biota, Native Americans included, were inferior ([NV]: 48).\nConsequently, “the savage” was feeble, glabrous,\npassionless, and compared to Europeans, was sexually less potent, less\nsensitive, and more timid, among other things ([NV]: 58). Abbé\nRaynal said more. What was true of Native Americans would eventually\nprove true of any Europeans transplanted in America ([NV]: 64).\nJefferson put considerable effort into refuting Buffon and Raynal\n([NV]: 60–64), which he did, as most scholars concede (e.g.,\nPeden 1954: xxiii), with remarkable success, though his aim was\nfurther, open discussion more than it was refutation ([NV]: 54).\n\nOne thing seems clear, however. His mistaken views of Blacks and his\nviews of Native Americans shaped his political thinking.\nJefferson’s political vision was of an American nation that was\nwedded to liberty, happiness, and mostly agrarian living, that\ninstantiated irenic republican governance, and that would in time\nserve as a model for other parts of the globe (Holowchak 2017b,\n131–51). That vision, for success, required in his eyes the\nfullest cultivation of genius and morality in the youthful nation\n(McCoy 1980: 136). Native Americans, it seems, passed on both\naccounts. Blacks, however, were to him wanting in genius. Thus, only\nNative Americans could be integrated into the fledgling nation, which\nheld the prospect of covering, as an “empire for liberty,”\nthe North American continent (TJ to James Madison, 27 Apr. 1809) and\nperhaps even the South American continent (TJ to James Madison, 24\nNov. 1801). In Jefferson’s view, Blacks could not be integrated,\nfor any admixture of black blood with white blood would taint the\noffspring, and thereby threaten the success of Jefferson’s\nrepublican experiment. So, every slave would eventually have to be\n“removed beyond the reach of mixture” ([NV]: 137–38\nand 143). Thus, he thought everyone would be best served if Blacks\nwere educated, emancipated, and expatriated; so too would Whites.\n\nJefferson’s views on race of course have been roundly refuted by\nmodern science, which shows that race biologically is an empty\ncategory.\n\nWhat, however, of Jefferson’s views and actions on the\nelimination of slavery?\n\nWe do know that Jefferson consistently spoke out loudly against the\ninstitution of slavery and that, as lawyer and politician, he worked\nhard toward its eradication. He, for instance, undertook six pro\nbono cases on behalf of slaves, seeking freedom, and never\ndefended the rights of a slaveholder. He crafted spirited declamations\nof slavery in his Summary View ([S] 115–16), initial draft of\nthe Declaration of Independence ([Au] 22), his Notes on the State\nof Virginia ([NV]: 162–63), and in several letters.\n\nNonetheless, he did little in retirement, when he could have tried to\ndo more.\n\nYet as he matured, Jefferson did little to advance the issue, because\nhe believed that that effort might be more harmful than beneficial.\nThe time, he consistently said, was not right. As early as 1805 (TJ to\nWilliam Burwell, Jan. 28), he expresses skepticism concerning the\neradication of slavery.\n\n\nThere are many virtuous men who would make any sacrifices to effect\nit, many equally virtuous who persuade themselves either that the\nthing is not wrong, or that it cannot be remedied, and very many with\nwhom interest is morality [i.e., those who recognize its immorality,\nbut think sympathy is equivalent to action]. The older we grow, the\nlarger we are disposed to believe the last part to be.\n\n\nTo Edward Coles (25 Aug. 1814), he writes of the “general\nsilence” on slavery as indicative of public apathy among younger\ngenerations. \n\n\nI have overlived the generation with which mutual labors & perils\nbegat mutual confidence and influence. This enterprise [abolition of\nslavery] is for the young; for those who can follow it up, and bear it\nthrough to its consummation.\n\n\nHe even castigates Coles when the latter considers emancipation of his\nown slaves—a precipitous act.\n\n\nThe laws do not permit us to turn them loose, if that were for their\ngood: and to commute them for other property is to commit them to\nthose whose usage of them we cannot control. I hope then, my dear sir,\nyou will reconcile yourself to your country and its unfortunate\ncondition.\n\n\nJefferson’s mistaken views on Blacks and his refusal upon\nretirement to do more to eliminate the institution of slavery have\nprompted considerable critical discussion in the secondary literature\n(see fn. 38). On the one hand, most see Jefferson as racist. McColley\n(1964), Cohen (1969), Miller (1977), and Dawidoff (1993) argue that\nJefferson’s racial views were hypocritical rationalizations for\nhis slaveholding and large living. Finkelman (1994), O’Brien\n(1996), and Magnis (1999) state that Jefferson was driven by a\nprofound hatred of Blacks. On the other hand, Levy (1963), Mayer\n(2001), Burstein (2005), and Holowchak (2013b and 2020a) argue that\nthough Jefferson held false views concerning Blacks, it is\nanachronistic to call him a racist, as ignorance concerning racial\ndifferences by commoners and scientists was at the time rife.\nJefferson, ultimately, was a product of the ignorance and prejudgments\nof his time.\n",
    "section_title": "6. Race",
    "entry_title": "Thomas Jefferson",
    "hierarchy_title": "Thomas Jefferson || Philosophy of Education || Education and Human Thriving",
    "tokenized_text": [
        "philosophy",
        "education",
        "education",
        "human",
        "thriving",
        "race",
        "jefferson",
        "view",
        "race",
        "focus",
        "considerable",
        "discussion",
        "secondary",
        "literature",
        "view",
        "would",
        "considered",
        "today",
        "racist",
        "likely",
        "influenced",
        "view",
        "leading",
        "naturalist",
        "day",
        "regard",
        "product",
        "ahead",
        "time",
        "discussion",
        "jefferson",
        "view",
        "black",
        "concern",
        "note",
        "state",
        "virginia",
        "query",
        "xiv",
        "jefferson",
        "writes",
        "memory",
        "black",
        "equal",
        "white",
        "nv",
        "reason",
        "jefferson",
        "say",
        "black",
        "much",
        "inferior",
        "white",
        "think",
        "one",
        "could",
        "scarcely",
        "found",
        "capable",
        "tracing",
        "comprehending",
        "investigation",
        "euclid",
        "nv",
        "add",
        "never",
        "yet",
        "could",
        "find",
        "black",
        "uttered",
        "thought",
        "level",
        "plain",
        "narration",
        "nv",
        "imagination",
        "black",
        "dull",
        "tasteless",
        "anomalous",
        "evident",
        "art",
        "music",
        "black",
        "accurate",
        "ear",
        "tune",
        "time",
        "generally",
        "gifted",
        "white",
        "capable",
        "small",
        "catch",
        "illustrated",
        "talent",
        "banjar",
        "guitarlike",
        "instrument",
        "brought",
        "africa",
        "whether",
        "equal",
        "composition",
        "extensive",
        "run",
        "melody",
        "complicated",
        "harmony",
        "yet",
        "proved",
        "despite",
        "misery",
        "often",
        "parent",
        "affecting",
        "touch",
        "poetry",
        "poetry",
        "nv",
        "n",
        "inferiority",
        "mind",
        "imagination",
        "add",
        "also",
        "confirmed",
        "jefferson",
        "estimation",
        "improvement",
        "black",
        "body",
        "mind",
        "first",
        "instance",
        "mixture",
        "white",
        "observed",
        "every",
        "one",
        "prof",
        "inferiority",
        "effect",
        "merely",
        "condition",
        "life",
        "nv",
        "may",
        "referencing",
        "observation",
        "scientific",
        "text",
        "day",
        "library",
        "morality",
        "jefferson",
        "admits",
        "black",
        "equal",
        "others",
        "find",
        "among",
        "numerous",
        "instance",
        "rigid",
        "integrity",
        "many",
        "among",
        "better",
        "instructed",
        "master",
        "benevolence",
        "gratitude",
        "unshaken",
        "fidelity",
        "take",
        "disposition",
        "theft",
        "jefferson",
        "explains",
        "thus",
        "man",
        "whose",
        "favour",
        "law",
        "property",
        "exist",
        "probably",
        "feel",
        "le",
        "bound",
        "respect",
        "made",
        "favour",
        "others",
        "might",
        "slave",
        "justifiably",
        "take",
        "little",
        "one",
        "taken",
        "nv",
        "conclusion",
        "jefferson",
        "say",
        "provisional",
        "confirmation",
        "observation",
        "black",
        "well",
        "red",
        "men",
        "hitherto",
        "subject",
        "natural",
        "history",
        "opinion",
        "inferior",
        "faculty",
        "reason",
        "imagination",
        "must",
        "hazarded",
        "great",
        "diffidence",
        "justify",
        "general",
        "conclusion",
        "requires",
        "many",
        "observation",
        "even",
        "subject",
        "may",
        "submitted",
        "anatomical",
        "knife",
        "optical",
        "glass",
        "analysis",
        "fire",
        "solvent",
        "much",
        "faculty",
        "substance",
        "examining",
        "eludes",
        "research",
        "sens",
        "condition",
        "existence",
        "various",
        "variously",
        "combined",
        "effect",
        "present",
        "absent",
        "bid",
        "defiance",
        "calculation",
        "let",
        "add",
        "circumstance",
        "great",
        "tenderness",
        "conclusion",
        "would",
        "degrade",
        "whole",
        "race",
        "men",
        "rank",
        "scale",
        "being",
        "creator",
        "may",
        "perhaps",
        "given",
        "reproach",
        "must",
        "said",
        "though",
        "century",
        "half",
        "eye",
        "race",
        "black",
        "red",
        "men",
        "never",
        "yet",
        "viewed",
        "u",
        "subject",
        "natural",
        "history",
        "advance",
        "therefore",
        "suspicion",
        "black",
        "inferior",
        "white",
        "endowment",
        "body",
        "mind",
        "nv",
        "though",
        "stated",
        "black",
        "native",
        "american",
        "subject",
        "natural",
        "history",
        "large",
        "body",
        "literature",
        "leading",
        "naturalist",
        "dayeg",
        "swedish",
        "biologist",
        "carl",
        "linnaeus",
        "oliver",
        "goldsmith",
        "george",
        "cuvier",
        "to",
        "jefferson",
        "access",
        "doubtless",
        "assimilated",
        "literature",
        "viewed",
        "black",
        "native",
        "american",
        "inferior",
        "white",
        "european",
        "overall",
        "tendency",
        "associate",
        "darker",
        "skin",
        "increased",
        "inferiority",
        "prominent",
        "philosopher",
        "like",
        "david",
        "hume",
        "n",
        "adam",
        "smith",
        "cf",
        "de",
        "volney",
        "also",
        "asserted",
        "inferiority",
        "black",
        "native",
        "american",
        "smattering",
        "science",
        "jefferson",
        "time",
        "show",
        "esteemed",
        "scientist",
        "held",
        "black",
        "native",
        "american",
        "considering",
        "race",
        "subspecies",
        "human",
        "regarded",
        "inferior",
        "defective",
        "jefferson",
        "owned",
        "informed",
        "literature",
        "since",
        "tended",
        "aware",
        "recent",
        "development",
        "science",
        "thus",
        "jefferson",
        "observation",
        "tainted",
        "observation",
        "prejudgment",
        "authority",
        "day",
        "despite",
        "view",
        "inferior",
        "recognized",
        "black",
        "moral",
        "equal",
        "others",
        "right",
        "men",
        "writes",
        "bishop",
        "grégoire",
        "feb",
        "whatever",
        "black",
        "degree",
        "talent",
        "measure",
        "right",
        "sir",
        "isaac",
        "newton",
        "superior",
        "others",
        "understanding",
        "therefore",
        "lord",
        "person",
        "property",
        "others",
        "nonetheless",
        "jefferson",
        "view",
        "native",
        "american",
        "inconsistent",
        "naturalist",
        "viewed",
        "race",
        "inferior",
        "european",
        "requires",
        "explanation",
        "query",
        "xiv",
        "note",
        "state",
        "virginia",
        "jefferson",
        "offer",
        "brief",
        "analysis",
        "native",
        "american",
        "race",
        "advantage",
        "exposure",
        "european",
        "culture",
        "black",
        "still",
        "native",
        "american",
        "often",
        "carve",
        "figure",
        "pipe",
        "destitute",
        "design",
        "merit",
        "nv",
        "carving",
        "drawing",
        "prove",
        "existence",
        "germ",
        "mind",
        "want",
        "cultivation",
        "continues",
        "astonish",
        "stroke",
        "sublime",
        "oratory",
        "prove",
        "reason",
        "sentiment",
        "strong",
        "imagination",
        "glowing",
        "elevated",
        "nv",
        "one",
        "may",
        "wonder",
        "much",
        "advantage",
        "jefferson",
        "imago",
        "black",
        "demonstrate",
        "account",
        "exposure",
        "culture",
        "oppressor",
        "enslaved",
        "jefferson",
        "maintains",
        "though",
        "black",
        "america",
        "confined",
        "tillage",
        "home",
        "society",
        "little",
        "direct",
        "exposure",
        "science",
        "art",
        "many",
        "situated",
        "might",
        "availed",
        "conversation",
        "master",
        "many",
        "brought",
        "handicraft",
        "art",
        "circumstance",
        "always",
        "associated",
        "white",
        "liberally",
        "educated",
        "lived",
        "country",
        "art",
        "science",
        "cultivated",
        "considerable",
        "degree",
        "eye",
        "sample",
        "best",
        "work",
        "abroad",
        "nv",
        "thus",
        "jefferson",
        "assessment",
        "black",
        "differs",
        "assessment",
        "native",
        "american",
        "unclear",
        "whether",
        "difference",
        "natural",
        "nurtural",
        "intimation",
        "note",
        "state",
        "virginia",
        "letter",
        "edmund",
        "cole",
        "aug",
        "natural",
        "though",
        "letter",
        "eg",
        "tj",
        "tp",
        "benjamin",
        "banneker",
        "aug",
        "tj",
        "bishop",
        "grégoire",
        "feb",
        "suggestion",
        "nurtural",
        "though",
        "deficiency",
        "pronounced",
        "rapid",
        "change",
        "situation",
        "native",
        "american",
        "scenario",
        "otherwise",
        "also",
        "sentiment",
        "commonly",
        "expressed",
        "secondary",
        "literature",
        "eg",
        "risjord",
        "holowchak",
        "jefferson",
        "personal",
        "political",
        "interest",
        "defending",
        "native",
        "american",
        "black",
        "buffonperhaps",
        "greatest",
        "naturalist",
        "dayargued",
        "since",
        "continent",
        "north",
        "america",
        "colder",
        "wetter",
        "europe",
        "biota",
        "native",
        "american",
        "included",
        "inferior",
        "nv",
        "consequently",
        "savage",
        "feeble",
        "glabrous",
        "passionless",
        "compared",
        "european",
        "sexually",
        "le",
        "potent",
        "le",
        "sensitive",
        "timid",
        "among",
        "thing",
        "nv",
        "abbé",
        "raynal",
        "said",
        "true",
        "native",
        "american",
        "would",
        "eventually",
        "prove",
        "true",
        "european",
        "transplanted",
        "america",
        "nv",
        "jefferson",
        "put",
        "considerable",
        "effort",
        "refuting",
        "buffon",
        "raynal",
        "nv",
        "scholar",
        "concede",
        "eg",
        "peden",
        "xxiii",
        "remarkable",
        "success",
        "though",
        "aim",
        "open",
        "discussion",
        "refutation",
        "nv",
        "one",
        "thing",
        "seems",
        "clear",
        "however",
        "mistaken",
        "view",
        "black",
        "view",
        "native",
        "american",
        "shaped",
        "political",
        "thinking",
        "jefferson",
        "political",
        "vision",
        "american",
        "nation",
        "wedded",
        "liberty",
        "happiness",
        "mostly",
        "agrarian",
        "living",
        "instantiated",
        "irenic",
        "republican",
        "governance",
        "would",
        "time",
        "serve",
        "model",
        "part",
        "globe",
        "holowchak",
        "b",
        "vision",
        "success",
        "required",
        "eye",
        "fullest",
        "cultivation",
        "genius",
        "morality",
        "youthful",
        "nation",
        "mccoy",
        "native",
        "american",
        "seems",
        "passed",
        "account",
        "black",
        "however",
        "wanting",
        "genius",
        "thus",
        "native",
        "american",
        "could",
        "integrated",
        "fledgling",
        "nation",
        "held",
        "prospect",
        "covering",
        "empire",
        "liberty",
        "north",
        "american",
        "continent",
        "tj",
        "james",
        "madison",
        "apr",
        "perhaps",
        "even",
        "south",
        "american",
        "continent",
        "tj",
        "james",
        "madison",
        "nov",
        "jefferson",
        "view",
        "black",
        "could",
        "integrated",
        "admixture",
        "black",
        "blood",
        "white",
        "blood",
        "would",
        "taint",
        "offspring",
        "thereby",
        "threaten",
        "success",
        "jefferson",
        "republican",
        "experiment",
        "every",
        "slave",
        "would",
        "eventually",
        "removed",
        "beyond",
        "reach",
        "mixture",
        "nv",
        "thus",
        "thought",
        "everyone",
        "would",
        "best",
        "served",
        "black",
        "educated",
        "emancipated",
        "expatriated",
        "would",
        "white",
        "jefferson",
        "view",
        "race",
        "course",
        "roundly",
        "refuted",
        "modern",
        "science",
        "show",
        "race",
        "biologically",
        "empty",
        "category",
        "however",
        "jefferson",
        "view",
        "action",
        "elimination",
        "slavery",
        "know",
        "jefferson",
        "consistently",
        "spoke",
        "loudly",
        "institution",
        "slavery",
        "lawyer",
        "politician",
        "worked",
        "hard",
        "toward",
        "eradication",
        "instance",
        "undertook",
        "six",
        "pro",
        "bono",
        "case",
        "behalf",
        "slave",
        "seeking",
        "freedom",
        "never",
        "defended",
        "right",
        "slaveholder",
        "crafted",
        "spirited",
        "declamation",
        "slavery",
        "summary",
        "view",
        "initial",
        "draft",
        "declaration",
        "independence",
        "au",
        "note",
        "state",
        "virginia",
        "nv",
        "several",
        "letter",
        "nonetheless",
        "little",
        "retirement",
        "could",
        "tried",
        "yet",
        "matured",
        "jefferson",
        "little",
        "advance",
        "issue",
        "believed",
        "effort",
        "might",
        "harmful",
        "beneficial",
        "time",
        "consistently",
        "said",
        "right",
        "early",
        "tj",
        "william",
        "burwell",
        "jan",
        "express",
        "skepticism",
        "concerning",
        "eradication",
        "slavery",
        "many",
        "virtuous",
        "men",
        "would",
        "make",
        "sacrifice",
        "effect",
        "many",
        "equally",
        "virtuous",
        "persuade",
        "either",
        "thing",
        "wrong",
        "remedied",
        "many",
        "interest",
        "morality",
        "ie",
        "recognize",
        "immorality",
        "think",
        "sympathy",
        "equivalent",
        "action",
        "older",
        "grow",
        "larger",
        "disposed",
        "believe",
        "last",
        "part",
        "edward",
        "cole",
        "aug",
        "writes",
        "general",
        "silence",
        "slavery",
        "indicative",
        "public",
        "apathy",
        "among",
        "younger",
        "generation",
        "overlived",
        "generation",
        "mutual",
        "labor",
        "peril",
        "begat",
        "mutual",
        "confidence",
        "influence",
        "enterprise",
        "abolition",
        "slavery",
        "young",
        "follow",
        "bear",
        "consummation",
        "even",
        "castigates",
        "cole",
        "latter",
        "considers",
        "emancipation",
        "slavesa",
        "precipitous",
        "act",
        "law",
        "permit",
        "u",
        "turn",
        "loose",
        "good",
        "commute",
        "property",
        "commit",
        "whose",
        "usage",
        "control",
        "hope",
        "dear",
        "sir",
        "reconcile",
        "country",
        "unfortunate",
        "condition",
        "jefferson",
        "mistaken",
        "view",
        "black",
        "refusal",
        "upon",
        "retirement",
        "eliminate",
        "institution",
        "slavery",
        "prompted",
        "considerable",
        "critical",
        "discussion",
        "secondary",
        "literature",
        "see",
        "fn",
        "one",
        "hand",
        "see",
        "jefferson",
        "racist",
        "mccolley",
        "cohen",
        "miller",
        "dawidoff",
        "argue",
        "jefferson",
        "racial",
        "view",
        "hypocritical",
        "rationalization",
        "slaveholding",
        "large",
        "living",
        "finkelman",
        "brien",
        "magnis",
        "state",
        "jefferson",
        "driven",
        "profound",
        "hatred",
        "black",
        "hand",
        "levy",
        "mayer",
        "burstein",
        "holowchak",
        "b",
        "a",
        "argue",
        "though",
        "jefferson",
        "held",
        "false",
        "view",
        "concerning",
        "black",
        "anachronistic",
        "call",
        "racist",
        "ignorance",
        "concerning",
        "racial",
        "difference",
        "commoner",
        "scientist",
        "time",
        "rife",
        "jefferson",
        "ultimately",
        "product",
        "ignorance",
        "prejudgment",
        "time"
    ]
}