{
    "main_text": "Life and Writings\n1. Life and Writings Thomas Jefferson was a born at Shadwell, Virginia, on April\n13, 1743. His father, Peter Jefferson (1708–1757), was a farmer\nand surveyor, and did much, from his own initiative and hard work, to\nimprove himself through reading and communal involvement. His mother,\nJane Randolph (1721–1776), belonged to one of Virginia’s\nmost distinguished families ([Au], p. 3). While we know that his\nrelationship with his father was significant—for instance, he\nproudly added the map of Virginian, Maryland, Delaware, and\nPennsylvania in his Notes on the State of Virginia—we\nknow little about his relationship with his mother. He aimed\nthroughout the course of his own life, and succeeded, in being much\nlike his father in terms of industry, responsibility, punctuality,\nperseverance, and integrity, though he lacked his father’s\nphysical robustness. When his mother died, he wrote tersely and coolly\nin his pocket account book, “My mother died at eight\no’clock this morning [March 31], in the 57th year of age.”\nThereafter, he suffered for weeks from violent migraines (Kukla, 35).\nThe death of his father, in contrast, proved to be a significant\nturning point in his life. At fourteen years of age, he faced a\ndilemma with life-changing implications. “When I recollect that\nat fourteen years of age the whole care and direction of myself was\nthrown on myself entirely,” he wrote to grandson Thomas\nJefferson Randolph (24 Nov. 1808), “without a relative or friend\nqualified to advise or guide me, and recollect the various sorts of\nbad company with which I associated from time to time, I am astonished\nthat I did not turn off with some of them, and become as worthless to\nsociety as they were.”\n\n\nFrom 1752 to 1757, Jefferson studied under the Scottish clergyman,\nRev. William Douglas, “a superficial Latinist” and\n“less instructed in Greek,” from whom he learned French\nand the rudiments of Latin and Greek. With the death of his father in\n1757, Jefferson earned a substantial inheritance—some\n£2,400 and some 5,000 acres of land to be divided between him\nand younger brother, Randolph—and then began to study under Rev.\nJames Maury, “a correct classical scholar” ([Au], p.\n4).\n\nFrom 1760 to 1762, Jefferson attended William and Mary College and\nthere befriended Professor William Small. He wrote in his\nAutobiography, “It was my great good fortune, and what probably\nfixed the destinies of my life that Dr. Wm. Small of Scotland was then\nprofessor of Mathematics, a man profound in most of the useful\nbranches of science, with a happy talent of communication, correct and\ngentlemanly manners, & an enlarged & liberal mind.”\nSmall, Jefferson added, had become attached to Jefferson, who became\nhis “daily companion when not engaged in the school.” From\nSmall, Jefferson learned of the “expansion of science & of\nthe system of things in which we are placed” ([Au], pp.\n4–5). Small introduced Jefferson to lawyer George Wythe, who\n“continued to be my faithful and beloved Mentor in youth, and my\nmost affectionate friend through life,” and under whom Jefferson\nwould soon be apprenticed in law—and Wythe introduced Jefferson\nto Governor Francis Fauquier, governor of Virginia from 1758 till his\ndeath ([Au], pp. 4–5). Small and Wythe especially would prove to\nbe cynosures to the young man.\n\nUpon leaving William and Mary (1762) and to the time he began his\nlegal practice (1767), Jefferson, under the tutelage of Wythe ([Au:\n5), undertook a rigorous course of study of law, which comprised for\nhim study of not just the standard legal texts of the day but also\nanything of potential practical significance to advance human affairs.\nFor Jefferson, a lawyer, having a mastery of all things except\nmetempirical subjects and fiction, would be a human encyclopedia of\nuseful knowledge. Advisory letters to John Garland Jefferson (11 June\n1790) and to Bernard Moore (30 Aug. 1814) show a lengthy and full\ncourse of study, involving physical studies, morality, religion,\nnatural law, politics, history, belle lettres, criticism, rhetoric,\nand oratory. Thereby, a lawyer would be fully readied for any turn of\nevents in a case. As lawyer, Jefferson’s focus, David Konig\nnotes, was cases involving property—e.g., the legal acquisition\nof lands and the quieting of titles—and that, adds Konig, shaped\nhis political thinking on the need of the relative equal distribution\nof property among all male citizens for sound Republican\ngovernment.\n\nAs lawyer, Jefferson took up six pro bono cases of slaves,\nseeking freedom. In the case of slave Samuel Howell in Howell v.\nNetherland (Apr. 1770), Jefferson argued, in keeping with sentiments\nhe would include years later in his Declaration of Independence,\n“Under the law of nature, all men are born free, every one comes\ninto the world with a right to his own person, which includes the\nliberty of moving and using it at his own will.” The case was\nawarded to Netherland, before his lawyer, George Wythe, could present\nhis case (Catterall, 90–91).\n\nJefferson would practice law till August 11, 1774, when he passed his\npractice to Edmund Randolph at the start of the Revolutionary War.\n\nIn 1769, Jefferson gained admittance to the Virginian House of\nBurgesses. Delegates’ minds were, he said, “circumscribed\nwithin narrow limits by an habitual belief that it was our duty to be\nsubordinate to the mother country in all matters of government”\n([Au], p. 5). Jefferson’s thinking inclined otherwise. The\nexperience in the House of Delegates substantially shaped his\nrevolutionary spirit.\n\nOn February 1, 1770, Jefferson lost most of the books of his first\nlibrary when a fire razed his house at Shadwell. Of the loss of his\nbooks, he wrote to boyhood friend John Page (21 Feb. 1770),\n“Would to god it had been the money [that the books cost and not\nthe books]; then had it never cost me a sigh!” He was to have\ntwo other libraries at Monticello in his life, which, because of his\npassion for learning, centered on books. When he built his residence\nat Poplar Forest early in the nineteenth century, he kept there a\nnumber of books—focused on philosophy, history, and\nreligion—for his own enjoyment.\n\nJefferson took as his wife Martha Wayles Skelton on January 1, 1772.\nIn that same year, daughter Martha was born. In 1778, daughter Mary\nwas born.\n\nUpon retirement from law in 1774, Jefferson wrote Summary View of the\nRights of British America—“an humble and dutiful\naddress” of complaints addressed to King George III of England.\nThe complaints concerned numerous American rights, contravened, and\naimed at “some redress of their injured rights” ([S],\n105). Due to its trenchant tone, it earned Jefferson considerable\nreputation among congressmen as a gifted writer and as a\nrevolutionist.\n\nJefferson was elected to the Continental Congress in 1775 as its\nsecond youngest member. He was soon invited to participate in a\ncommittee with John Adams, Roger Sherman, Benjamin Franklin, and\nRobert Livingston to draft a declaration on American independence. It\nwas decided that Jefferson himself should compose a draft. As John\nAdams writes to Timothy Pickering (6 Aug. 1822) concerning his reasons\nfor Jefferson being the sole drafter of the document: “Reason\n1st. You are a Virginian, and a Virginian ought to appear at the head\nof this business. Reason 2nd. I am obnoxious, suspected, and\nunpopular; You are very much otherwise. Reason 3rd. You can write ten\ntimes better than I can” (Adams). For over two weeks, Jefferson\nworked on the Declaration of Independence in an upper-floor apartment\nat Seventh Street and Market Street in Philadelphia.\n\nThe document was intended to be “an expression of the American\nmind” and was put forth to the “tribunal of the\nworld.” Jefferson’s draft listed certain “sacred\n& undeniable” truths: that all men are created “equal\n& independent”; that “from that equal creation,”\nall have the rights “to the preservation of life, & liberty,\n& the pursuit of happiness”; that governments, deriving\ntheir “just powers from the consent of the governed,” are\ninstituted to secure such rights; and that the people have a right to\nabolish any government which “becomes destructive of these\nends” and to institute a new government, by “laying its\nfoundation on such principles and organizing its powers in such form,\nas to them shall seem most likely to effect their Safety and\nHappiness” ([D], 19).\n\nRigorous debate followed. Excisions and changes were made to reduce\nJefferson’s draft to three-quarters of its original length,\nthough the basic structure and the argument therein—a tightly\nstructured argument that begins with rights, turns to duties of\ngovernment, and moves to a justification for revolutionary behavior\nwhen citizens’ rights are consistently transgressed by\ngovernment—was unaltered. Thus, the Declaration contained the\nrudiments of a political philosophy that would be fleshed out in the\ndecades that followed. The document, not thought to be significant at\nthe time, was approved on July 4, 1776, and it would become one of the\nmost significant political writings ever composed.\n\nNot long after Jefferson finished the Declaration on Independence, he\nwas appointed to a committee to revise the outdated laws of Virginia,\nas a result of a bill introduced to the General Assembly of Virginia.\nThat was a hefty task, which Jefferson—as part of a committee\ncomprising also Thomas Ludwell Lee, George Mason, Edmund Pendleton,\nand George Wythe—began in 1776. Of the five, Lee and Mason\nexcused themselves, and revision, comprising 126 bills, was undertaken\nby Jefferson, Wythe, and Pendleton. Revision was completed in 1779, a\nperiod of not quite three years. Notable among the bills Jefferson\ndrafted, were Bill for the More General Diffusion of Knowledge and\nBill for Religious Freedom. The latter was passed while Jefferson was\nin France as Minister Plenipotentiary; the former, requiring educative\nreforms that demanded a system of public education, did not pass.\n\nFrom 1779 to 1781, Jefferson began tenure as governor of Virginia.\nDuring his governorship, he reformed the curriculum of William and\nMary College by “abolishing the Grammar school,”\neliminating the professorships in Divinity and Oriental languages, and\nsupplanting them with professorships in Law and Police; Anatomy,\nMedicine, and Chemistry; and Modern Languages ([Au], p. 5). He also\nbegan his only book, Notes on the State of Virginia, in which\nhe described the geography, climate, and people of Virginia and their\nlaws, religions, manners, and commerce, among other things. The book,\nin general, was well received by his Enlightenment friends and did\neven more to enhance his reputation as a gifted writer.\n\nJefferson’s wife Martha died on September 6, 1782.\nOverwhelmingly distraught, he found some consolation in an invitation\nto function as Minister to France—he needed to be away from\nMonticello—which he did from 1784 to 1789. He ended the post at\nthe bidding of George Washington, who asked him to be his Secretary of\nState—a post he held till 1793. Political disagreements between\nJefferson and Alexander Hamilton on political issues resulted in\nformation of the Republican and Federalist parties—the former,\nchampioning small, unobtrusive government and strict constructionism;\nthe latter, larger, strong government and a less strict interpretation\nof the Constitution. After a brief retirement, he was elected\nVice-President of the United States for one term that ended in 1801,\nand then President of the United States, which lasted two terms. His\npresidency, which began triumphantly with his conciliatory First\nInaugural Address, was highlighted by the Louisiana Purchase in 1803,\nwhich doubled the size of the country; the subsequent Lewis and Clark\nExpedition, which ended in 1806; and the failed Embargo Act of 1807,\nwhich aimed, among other things, to punish England during its war with\nFrance, by prohibiting exchange of goods. During his tenure as\npresident, his daughter Maria died (1804).\n\nIn retirement, Jefferson resumed his domestic life at Monticello,\ncontinued as president of the American Philosophical Society (a\nposition he held for nearly 20 years), and began activities that would\nlead to the birth of the University of Virginia, which opened one year\nbefore his death. Irretrievably saddled with debt throughout his\nretirement, he sold his library, approximately 6,700 books, to\nCongress in 1815 to pay off some of that debt. He died, as did John\nAdams, on July 4, 1826. On his obelisk, there was written, upon his\nrequest ([E]: 706):\n\nHere was buried\n\nThomas Jefferson\n\nAuthor of the Declaration of American Independence\n\nOf the Statute of Virginia for religious freedom\n\n& Father of the University of Virginia. \n\nJefferson wrote prodigiously. He penned some 19,000 letters. He\npublished Notes on the State of Virginia (English version) in\n1787. He wrote key declarations such as Summary View of the Rights of\nBritish Americans (1774), Declaration of the Causes and Necessity of\nTaking Up Arms (1775), and the Declaration of Independence (1776);\nauthored numerous bills; and wrote his Manual of Parliamentary\nPractice for the Use of the Senate of the United States, a\nmodified copy of which was still in use till 1977. He put together two\nharmonies, The Philosophy of Jesus (1804)—no copies are\nknown to survive—and The Life and Morals of Jesus of\nNazareth (1820), by extracting passages from the New Testament.\nLast, Jefferson undertook late in life an autobiography (never\ncompleted), “for my own ready reference & for the\ninformation of my family” ([Au]: 3).\n",
    "section_title": "1. Life and Writings",
    "entry_title": "Thomas Jefferson",
    "hierarchy_title": "Thomas Jefferson || Life and Writings",
    "tokenized_text": [
        "life",
        "writing",
        "life",
        "writing",
        "thomas",
        "jefferson",
        "born",
        "shadwell",
        "virginia",
        "april",
        "father",
        "peter",
        "jefferson",
        "farmer",
        "surveyor",
        "much",
        "initiative",
        "hard",
        "work",
        "improve",
        "reading",
        "communal",
        "involvement",
        "mother",
        "jane",
        "randolph",
        "belonged",
        "one",
        "virginia",
        "distinguished",
        "family",
        "au",
        "p",
        "know",
        "relationship",
        "father",
        "significantfor",
        "instance",
        "proudly",
        "added",
        "map",
        "virginian",
        "maryland",
        "delaware",
        "pennsylvania",
        "note",
        "state",
        "virginiawe",
        "know",
        "little",
        "relationship",
        "mother",
        "aimed",
        "throughout",
        "course",
        "life",
        "succeeded",
        "much",
        "like",
        "father",
        "term",
        "industry",
        "responsibility",
        "punctuality",
        "perseverance",
        "integrity",
        "though",
        "lacked",
        "father",
        "physical",
        "robustness",
        "mother",
        "died",
        "wrote",
        "tersely",
        "coolly",
        "pocket",
        "account",
        "book",
        "mother",
        "died",
        "eight",
        "clock",
        "morning",
        "march",
        "th",
        "year",
        "age",
        "thereafter",
        "suffered",
        "week",
        "violent",
        "migraine",
        "kukla",
        "death",
        "father",
        "contrast",
        "proved",
        "significant",
        "turning",
        "point",
        "life",
        "fourteen",
        "year",
        "age",
        "faced",
        "dilemma",
        "lifechanging",
        "implication",
        "recollect",
        "fourteen",
        "year",
        "age",
        "whole",
        "care",
        "direction",
        "thrown",
        "entirely",
        "wrote",
        "grandson",
        "thomas",
        "jefferson",
        "randolph",
        "nov",
        "without",
        "relative",
        "friend",
        "qualified",
        "advise",
        "guide",
        "recollect",
        "various",
        "sort",
        "bad",
        "company",
        "associated",
        "time",
        "time",
        "astonished",
        "turn",
        "become",
        "worthless",
        "society",
        "were",
        "jefferson",
        "studied",
        "scottish",
        "clergyman",
        "rev",
        "william",
        "douglas",
        "superficial",
        "latinist",
        "le",
        "instructed",
        "greek",
        "learned",
        "french",
        "rudiment",
        "latin",
        "greek",
        "death",
        "father",
        "jefferson",
        "earned",
        "substantial",
        "inheritancesome",
        "acre",
        "land",
        "divided",
        "younger",
        "brother",
        "randolphand",
        "began",
        "study",
        "rev",
        "james",
        "maury",
        "correct",
        "classical",
        "scholar",
        "au",
        "p",
        "jefferson",
        "attended",
        "william",
        "mary",
        "college",
        "befriended",
        "professor",
        "william",
        "small",
        "wrote",
        "autobiography",
        "great",
        "good",
        "fortune",
        "probably",
        "fixed",
        "destiny",
        "life",
        "dr",
        "wm",
        "small",
        "scotland",
        "professor",
        "mathematics",
        "man",
        "profound",
        "useful",
        "branch",
        "science",
        "happy",
        "talent",
        "communication",
        "correct",
        "gentlemanly",
        "manner",
        "enlarged",
        "liberal",
        "mind",
        "small",
        "jefferson",
        "added",
        "become",
        "attached",
        "jefferson",
        "became",
        "daily",
        "companion",
        "engaged",
        "school",
        "small",
        "jefferson",
        "learned",
        "expansion",
        "science",
        "system",
        "thing",
        "placed",
        "au",
        "pp",
        "small",
        "introduced",
        "jefferson",
        "lawyer",
        "george",
        "wythe",
        "continued",
        "faithful",
        "beloved",
        "mentor",
        "youth",
        "affectionate",
        "friend",
        "life",
        "jefferson",
        "would",
        "soon",
        "apprenticed",
        "lawand",
        "wythe",
        "introduced",
        "jefferson",
        "governor",
        "francis",
        "fauquier",
        "governor",
        "virginia",
        "till",
        "death",
        "au",
        "pp",
        "small",
        "wythe",
        "especially",
        "would",
        "prove",
        "cynosure",
        "young",
        "man",
        "upon",
        "leaving",
        "william",
        "mary",
        "time",
        "began",
        "legal",
        "practice",
        "jefferson",
        "tutelage",
        "wythe",
        "au",
        "undertook",
        "rigorous",
        "course",
        "study",
        "law",
        "comprised",
        "study",
        "standard",
        "legal",
        "text",
        "day",
        "also",
        "anything",
        "potential",
        "practical",
        "significance",
        "advance",
        "human",
        "affair",
        "jefferson",
        "lawyer",
        "mastery",
        "thing",
        "except",
        "metempirical",
        "subject",
        "fiction",
        "would",
        "human",
        "encyclopedia",
        "useful",
        "knowledge",
        "advisory",
        "letter",
        "john",
        "garland",
        "jefferson",
        "june",
        "bernard",
        "moore",
        "aug",
        "show",
        "lengthy",
        "full",
        "course",
        "study",
        "involving",
        "physical",
        "study",
        "morality",
        "religion",
        "natural",
        "law",
        "politics",
        "history",
        "belle",
        "lettres",
        "criticism",
        "rhetoric",
        "oratory",
        "thereby",
        "lawyer",
        "would",
        "fully",
        "readied",
        "turn",
        "event",
        "case",
        "lawyer",
        "jefferson",
        "focus",
        "david",
        "konig",
        "note",
        "case",
        "involving",
        "propertyeg",
        "legal",
        "acquisition",
        "land",
        "quieting",
        "titlesand",
        "add",
        "konig",
        "shaped",
        "political",
        "thinking",
        "need",
        "relative",
        "equal",
        "distribution",
        "property",
        "among",
        "male",
        "citizen",
        "sound",
        "republican",
        "government",
        "lawyer",
        "jefferson",
        "took",
        "six",
        "pro",
        "bono",
        "case",
        "slave",
        "seeking",
        "freedom",
        "case",
        "slave",
        "samuel",
        "howell",
        "howell",
        "v",
        "netherland",
        "apr",
        "jefferson",
        "argued",
        "keeping",
        "sentiment",
        "would",
        "include",
        "year",
        "later",
        "declaration",
        "independence",
        "law",
        "nature",
        "men",
        "born",
        "free",
        "every",
        "one",
        "come",
        "world",
        "right",
        "person",
        "includes",
        "liberty",
        "moving",
        "using",
        "will",
        "case",
        "awarded",
        "netherland",
        "lawyer",
        "george",
        "wythe",
        "could",
        "present",
        "case",
        "catterall",
        "jefferson",
        "would",
        "practice",
        "law",
        "till",
        "august",
        "passed",
        "practice",
        "edmund",
        "randolph",
        "start",
        "revolutionary",
        "war",
        "jefferson",
        "gained",
        "admittance",
        "virginian",
        "house",
        "burgess",
        "delegate",
        "mind",
        "said",
        "circumscribed",
        "within",
        "narrow",
        "limit",
        "habitual",
        "belief",
        "duty",
        "subordinate",
        "mother",
        "country",
        "matter",
        "government",
        "au",
        "p",
        "jefferson",
        "thinking",
        "inclined",
        "otherwise",
        "experience",
        "house",
        "delegate",
        "substantially",
        "shaped",
        "revolutionary",
        "spirit",
        "february",
        "jefferson",
        "lost",
        "book",
        "first",
        "library",
        "fire",
        "razed",
        "house",
        "shadwell",
        "loss",
        "book",
        "wrote",
        "boyhood",
        "friend",
        "john",
        "page",
        "feb",
        "would",
        "god",
        "money",
        "book",
        "cost",
        "book",
        "never",
        "cost",
        "sigh",
        "two",
        "library",
        "monticello",
        "life",
        "passion",
        "learning",
        "centered",
        "book",
        "built",
        "residence",
        "poplar",
        "forest",
        "early",
        "nineteenth",
        "century",
        "kept",
        "number",
        "booksfocused",
        "philosophy",
        "history",
        "religionfor",
        "enjoyment",
        "jefferson",
        "took",
        "wife",
        "martha",
        "wayles",
        "skelton",
        "january",
        "year",
        "daughter",
        "martha",
        "born",
        "daughter",
        "mary",
        "born",
        "upon",
        "retirement",
        "law",
        "jefferson",
        "wrote",
        "summary",
        "view",
        "right",
        "british",
        "america",
        "humble",
        "dutiful",
        "address",
        "complaint",
        "addressed",
        "king",
        "george",
        "iii",
        "england",
        "complaint",
        "concerned",
        "numerous",
        "american",
        "right",
        "contravened",
        "aimed",
        "redress",
        "injured",
        "right",
        "due",
        "trenchant",
        "tone",
        "earned",
        "jefferson",
        "considerable",
        "reputation",
        "among",
        "congressman",
        "gifted",
        "writer",
        "revolutionist",
        "jefferson",
        "elected",
        "continental",
        "congress",
        "second",
        "youngest",
        "member",
        "soon",
        "invited",
        "participate",
        "committee",
        "john",
        "adam",
        "roger",
        "sherman",
        "benjamin",
        "franklin",
        "robert",
        "livingston",
        "draft",
        "declaration",
        "american",
        "independence",
        "decided",
        "jefferson",
        "compose",
        "draft",
        "john",
        "adam",
        "writes",
        "timothy",
        "pickering",
        "aug",
        "concerning",
        "reason",
        "jefferson",
        "sole",
        "drafter",
        "document",
        "reason",
        "st",
        "virginian",
        "virginian",
        "ought",
        "appear",
        "head",
        "business",
        "reason",
        "nd",
        "obnoxious",
        "suspected",
        "unpopular",
        "much",
        "otherwise",
        "reason",
        "rd",
        "write",
        "ten",
        "time",
        "better",
        "adam",
        "two",
        "week",
        "jefferson",
        "worked",
        "declaration",
        "independence",
        "upperfloor",
        "apartment",
        "seventh",
        "street",
        "market",
        "street",
        "philadelphia",
        "document",
        "intended",
        "expression",
        "american",
        "mind",
        "put",
        "forth",
        "tribunal",
        "world",
        "jefferson",
        "draft",
        "listed",
        "certain",
        "sacred",
        "undeniable",
        "truth",
        "men",
        "created",
        "equal",
        "independent",
        "equal",
        "creation",
        "right",
        "preservation",
        "life",
        "liberty",
        "pursuit",
        "happiness",
        "government",
        "deriving",
        "power",
        "consent",
        "governed",
        "instituted",
        "secure",
        "right",
        "people",
        "right",
        "abolish",
        "government",
        "becomes",
        "destructive",
        "end",
        "institute",
        "new",
        "government",
        "laying",
        "foundation",
        "principle",
        "organizing",
        "power",
        "form",
        "shall",
        "seem",
        "likely",
        "effect",
        "safety",
        "happiness",
        "rigorous",
        "debate",
        "followed",
        "excision",
        "change",
        "made",
        "reduce",
        "jefferson",
        "draft",
        "threequarters",
        "original",
        "length",
        "though",
        "basic",
        "structure",
        "argument",
        "thereina",
        "tightly",
        "structured",
        "argument",
        "begin",
        "right",
        "turn",
        "duty",
        "government",
        "move",
        "justification",
        "revolutionary",
        "behavior",
        "citizen",
        "right",
        "consistently",
        "transgressed",
        "governmentwas",
        "unaltered",
        "thus",
        "declaration",
        "contained",
        "rudiment",
        "political",
        "philosophy",
        "would",
        "fleshed",
        "decade",
        "followed",
        "document",
        "thought",
        "significant",
        "time",
        "approved",
        "july",
        "would",
        "become",
        "one",
        "significant",
        "political",
        "writing",
        "ever",
        "composed",
        "long",
        "jefferson",
        "finished",
        "declaration",
        "independence",
        "appointed",
        "committee",
        "revise",
        "outdated",
        "law",
        "virginia",
        "result",
        "bill",
        "introduced",
        "general",
        "assembly",
        "virginia",
        "hefty",
        "task",
        "jeffersonas",
        "part",
        "committee",
        "comprising",
        "also",
        "thomas",
        "ludwell",
        "lee",
        "george",
        "mason",
        "edmund",
        "pendleton",
        "george",
        "wythebegan",
        "five",
        "lee",
        "mason",
        "excused",
        "revision",
        "comprising",
        "bill",
        "undertaken",
        "jefferson",
        "wythe",
        "pendleton",
        "revision",
        "completed",
        "period",
        "quite",
        "three",
        "year",
        "notable",
        "among",
        "bill",
        "jefferson",
        "drafted",
        "bill",
        "general",
        "diffusion",
        "knowledge",
        "bill",
        "religious",
        "freedom",
        "latter",
        "passed",
        "jefferson",
        "france",
        "minister",
        "plenipotentiary",
        "former",
        "requiring",
        "educative",
        "reform",
        "demanded",
        "system",
        "public",
        "education",
        "pas",
        "jefferson",
        "began",
        "tenure",
        "governor",
        "virginia",
        "governorship",
        "reformed",
        "curriculum",
        "william",
        "mary",
        "college",
        "abolishing",
        "grammar",
        "school",
        "eliminating",
        "professorship",
        "divinity",
        "oriental",
        "language",
        "supplanting",
        "professorship",
        "law",
        "police",
        "anatomy",
        "medicine",
        "chemistry",
        "modern",
        "language",
        "au",
        "p",
        "also",
        "began",
        "book",
        "note",
        "state",
        "virginia",
        "described",
        "geography",
        "climate",
        "people",
        "virginia",
        "law",
        "religion",
        "manner",
        "commerce",
        "among",
        "thing",
        "book",
        "general",
        "well",
        "received",
        "enlightenment",
        "friend",
        "even",
        "enhance",
        "reputation",
        "gifted",
        "writer",
        "jefferson",
        "wife",
        "martha",
        "died",
        "september",
        "overwhelmingly",
        "distraught",
        "found",
        "consolation",
        "invitation",
        "function",
        "minister",
        "francehe",
        "needed",
        "away",
        "monticellowhich",
        "ended",
        "post",
        "bidding",
        "george",
        "washington",
        "asked",
        "secretary",
        "statea",
        "post",
        "held",
        "till",
        "political",
        "disagreement",
        "jefferson",
        "alexander",
        "hamilton",
        "political",
        "issue",
        "resulted",
        "formation",
        "republican",
        "federalist",
        "partiesthe",
        "former",
        "championing",
        "small",
        "unobtrusive",
        "government",
        "strict",
        "constructionism",
        "latter",
        "larger",
        "strong",
        "government",
        "le",
        "strict",
        "interpretation",
        "constitution",
        "brief",
        "retirement",
        "elected",
        "vicepresident",
        "united",
        "state",
        "one",
        "term",
        "ended",
        "president",
        "united",
        "state",
        "lasted",
        "two",
        "term",
        "presidency",
        "began",
        "triumphantly",
        "conciliatory",
        "first",
        "inaugural",
        "address",
        "highlighted",
        "louisiana",
        "purchase",
        "doubled",
        "size",
        "country",
        "subsequent",
        "lewis",
        "clark",
        "expedition",
        "ended",
        "failed",
        "embargo",
        "act",
        "aimed",
        "among",
        "thing",
        "punish",
        "england",
        "war",
        "france",
        "prohibiting",
        "exchange",
        "good",
        "tenure",
        "president",
        "daughter",
        "maria",
        "died",
        "retirement",
        "jefferson",
        "resumed",
        "domestic",
        "life",
        "monticello",
        "continued",
        "president",
        "american",
        "philosophical",
        "society",
        "position",
        "held",
        "nearly",
        "year",
        "began",
        "activity",
        "would",
        "lead",
        "birth",
        "university",
        "virginia",
        "opened",
        "one",
        "year",
        "death",
        "irretrievably",
        "saddled",
        "debt",
        "throughout",
        "retirement",
        "sold",
        "library",
        "approximately",
        "book",
        "congress",
        "pay",
        "debt",
        "died",
        "john",
        "adam",
        "july",
        "obelisk",
        "written",
        "upon",
        "request",
        "e",
        "buried",
        "thomas",
        "jefferson",
        "author",
        "declaration",
        "american",
        "independence",
        "statute",
        "virginia",
        "religious",
        "freedom",
        "father",
        "university",
        "virginia",
        "jefferson",
        "wrote",
        "prodigiously",
        "penned",
        "letter",
        "published",
        "note",
        "state",
        "virginia",
        "english",
        "version",
        "wrote",
        "key",
        "declaration",
        "summary",
        "view",
        "right",
        "british",
        "american",
        "declaration",
        "cause",
        "necessity",
        "taking",
        "arm",
        "declaration",
        "independence",
        "authored",
        "numerous",
        "bill",
        "wrote",
        "manual",
        "parliamentary",
        "practice",
        "use",
        "senate",
        "united",
        "state",
        "modified",
        "copy",
        "still",
        "use",
        "till",
        "put",
        "together",
        "two",
        "harmony",
        "philosophy",
        "jesus",
        "no",
        "copy",
        "known",
        "surviveand",
        "life",
        "moral",
        "jesus",
        "nazareth",
        "extracting",
        "passage",
        "new",
        "testament",
        "last",
        "jefferson",
        "undertook",
        "late",
        "life",
        "autobiography",
        "never",
        "completed",
        "ready",
        "reference",
        "information",
        "family",
        "au"
    ]
}