{
    "main_text": "The scientific method: experimental, hypothetical, eclectic\n2. The scientific method: experimental, hypothetical, eclectic\n\nSturm’s scientific method aims at providing a complete system of\nnatural philosophy in which (potentially) all natural phenomena can\nreceive satisfying causal explanations based on available observations\nand by taking into account the most perspicuous hypotheses advanced.\nSturm’s method consists of three main steps, which also provide\nthe recurrent pattern used to discuss all topics covered in the\nPhysica\n Electiva.[2]\n\n\nThe first step consists in collecting phenomena, either reported by\nother natural philosophers or encountered by means of observation or\nexperimentation itself. They need to be reported faithfully\n(fideliter), by accurately presenting the circumstances under\nwhich the phenomena obtained (PE I: preface, art. 3.4).\n\nSturm was committed to the new emerging experimental natural\nphilosophy and he was among the first university professors in Germany\nto introduce an experimental approach on an academic level. Inspired\nby the experimental method advanced by Bacon and Boyle, he offered\nregular yet private experimental collegia (teaching). His\nCollegium experimentale sive curiosum (1676/1685) reveals\nthat Sturm was familiar with the state of the art of experimental\nnatural science, putting to good use the new instruments available at\nthe time; namely, the telescope, microscope, air pump, diver’s\nbell, etc. Furthermore, hypotheses (the basis of theory-building) are\nmeasured both against their congruence with phenomena and the results\nof experiments. Paradigmatic experimenters for Sturm are Otto von\nGuericke, Caspar Schott, and Robert Boyle.\n\nHowever, Sturm does not content himself with putting forth a mere\nnatural history, a mere listing of things found in nature, or curious\nexperimental results. Natural philosophy must provide deeper causal\nexplanations for why the phenomena are such as they are and why they\noccur. To achieve this goal, the natural philosopher should take stock\nof experimental findings and available observations and investigate\nsuitable hypotheses to explain them.\n\nThe second step, hence, consists in collecting and presenting with the\nsame faithfulness old and new hypotheses that have been suggested to\naccount for the phenomena. Sturm meticulously presents hypotheses old\nand new, from Pre-Socratic to seventeenth-century authors (see\n sect. 1.2).\n Sturm shows himself to be an assiduous, diligent reader of the\nnatural philosophy available at his time. His knowledge of more and\neven less prominent authors is impressive and precise.\n\nSturm’s last physics, the Compendium Physicae Modernae\nSanioris (CPMS), makes particularly clear that hypotheses have a\nplace in between observations by the senses and certainties revealed\nby the demonstrative method. He points out that some things are\nobvious, in that they are observed by the senses or by means of\nexperiments including the use of newly invented instruments (CPMS:\n2f). Some things are merely conjectured rather than infallibly\ndemonstrated (supponuntur verius & conjiciuntur, quam\ninfallibiliter demonstratur) (CPMS: 3). Some are certain, in the\nsense that phenomena and hypotheses align, that is, they are \n\n\ndeduced (deducuntur) from phenomena and hypotheses in such a\nway by means of the demonstrative method that due to the ubiquitous\nharmonizing correspondence itself of the phenomena with the\nhypotheses, by means of a certain demonstrative regress, the things\nthat had been assumed in a way seemingly true\n(verosimiliter), ascend to (evadent) truth and\ncertainty. (CPMS: 3f)\n\n\nThe third step of Sturm’s method aims at selection and\nreconciliation of different hypotheses and at the final concocting of\na satisfying account of the phenomena at stake. Sturm’s goal is\nto distil what is good and reasonable while discarding\npseudo-explanations, prejudices and preconceived notions. This step is\napproached mainly through critical investigation, rational discussion\nand logical inference. In this sense, it is the more philosophical or\nspeculative part of Sturm’s method. The goal of this third step\nis thus to critically assess and integrate the hypotheses\ncollected.\n\nAt the beginning of his preface to the PE (PE I: art. 3.1), Sturm\n(possibly inspired by Boyle and Mariotte) extensively investigates\ncriteria good hypotheses have to meet. They have to have a reasonable\ndegree of possibility and show the connection among phenomena. They\nhave to satisfy the circumstances that obtain. A hypothesis is better\nin case it can accommodate more phenomena and notable circumstances.\nSimpler hypotheses should be preferred. Hence, Sturm avails himself of\nOckham’s razor in choosing among hypotheses. The reasoning\nbehind this is that simple hypotheses mirror God’s ways which\nare simple (PE I: preface, art. 3.1). God as the wisest creator of\nnature (Opificem naturae Sapientissimum) designed the world\nby simple means which have to be taken into consideration when\nstudying nature and its design. Furthermore, good hypotheses should\nneither conflict with phenomena, other established hypotheses nor\nevident principles (PE I: preface, art. 3.2). Finally, Sturm points\nout that hypotheses have to satisfy not only the intellect but also\nthe imagination and the senses (PE I: preface, art. 3.3).\nSturm’s reasoning here is that all natural phenomena are\nphenomena pertaining the world of extension and its modifications like\nshape and motion. The senses and the imagination are first and\nforemost concerned with the realm of extended beings, and therefore to\nassess the aptness of hypotheses about natural phenomena, one needs to\nconsult both of these faculties. Mere abstract conceptual reflection\nabout nature as is characteristic of the scholastics (Sturm thinks) is\nnot sufficient, since worldly phenomena are most proximate to and\npalpable by the senses and the imagination (PE I: preface, art\n3.3).\n\nIn this three-step method, the presentation of phenomena establishes\nthe explanandum, the hypotheses cover some ground towards\napproximating a solution. But since these different hypotheses either\ncontradict or run parallel to one another, a true explanation has to\nselect from existing theories what is true, reject what is false, and\nadd what needs be added. This brings us to Sturm’s\n eclecticism.[3]\n\nThe eclectic approach consists in nothing other than \n\n\nto select and adopt (sibi sumere) from all sects of\nPhilosophers that which is true, having left behind what is false and\nerroneous. (PE I: preface, art. 2.1) \n\n\nSturm encountered the eclectic method during his one-year stay in\nLeiden in 1660 probably inspired by Henricus Bornius. Both the preface\nof Sturm’s Physica Electiva and his disputation De\nPhilosophia Sectaria & Electiva (DSE; in his 1686\nPhilosophia Eclectica) held in 1679 are pleas for\neclecticism, which contrasts sharply with sectarian philosophy.\nAccording to Sturm, the whole of philosophers — bracketing\nsceptics and doubters (sceptios ac dubitatores) — can\nbe subsumed under two classes: sectarians and eclectics (DSE: 3).\n\nSectarian thinkers are led by an authority on whom they slavishly\ndepend. They do not follow their own reasoning, but spend their time\nabsorbing, reproducing and fiercely defending what they have learned\nex cathedra. Sectarian philosophers do not follow the truth\nof what is being said, but the authority of the person who said\nsomething. The most notable sects in Sturm’s days are the\nAristotelians (secta Aristotelica) with its two main\nbranches, namely, the Greek interpreters and the scholastic\ncommentators; the Cartesians (secta Cartesiana); the\nGassendists (secta Gassendica) reviving Epicurean and\nDemocritean thought; and the Neoplatonists (secta\nNeo-Platonica) (DSE: 13). In his Physica Electiva, Sturm\nmentions the alchemical school (the Spagyric school or that\nof the chemists [Chemicorum]) as the fourth main one omitting\nNeo-Platonism (PE I: preface, art. 3.5).\n\nThe case for eclecticism is made ex negativo by challenging\nsectarianism and positively by bringing to light the strengths of the\neclectic method. Concerning the repudiation of sectarian philosophy,\nSturm argues that adopting a sectarian approach is first of all not a\nnecessity (Sectariae quippe Philosophiae primo nulla est\nnecessitas). It is not the only option (see DSE: 28f). Second,\nfollowing one authority is not only not useful, it is even dangerous\nand damaging to the advancement and augmentation of the sciences.\n\nIn contrast to this, eclectic philosophers are defined as:\n\n\n[T]hose who did not want to hang on to every word of someone, nor\nswear by the words of one master; they knew and collected for their\nstorehouse everything that is true and good from the words and\nwritings of whatever teachers (Doctorum) not convinced by the\nauthority of the person teaching but by the weight of the arguments\nand demonstrations; even more they added from themselves as much as\nthey could; they make it their business (sustineant) to see\nwith their own rather than with someone else’s eyes. (DSE: 3f;\nsee also DSE: 6, 28)\n\n\nThe eclectic method acknowledges the feebleness of the human mind, its\nproclivity to err (DSE: 23). In this it is humbler than sectarian\nphilosophy which assumes to find all the truths in one author. Since\nhumans on their own tend to misjudge things or make mistakes, they\ndepend on one another as correctives. The scientific study of nature\nif it is to succeed, hence, becomes a collective endeavor:\n\n\nBy the name of the eclectic philosophers we understand in this whole\ntreatise no others than those, who do not reject without a difference\nall the things that are found (inventa) and left\n(tradita) by the heads of different sects, and who are not so\nmoved by the authority of one leader that they do accept all of his\nutterances and bons mots (dicteria), but who\nacknowledge the feebleness (imbecillitatem) of the human mind\n(humani ingenii), which makes it apparent that all depths of\nnature and reason cannot be exhausted by one or a few men; they\npersuade themselves that the truth can be only viewed in part, and\nthat the sciences are to be advanced and stabilized by means of united\npowers (junctis viribus) and communicated advice\n(communicato consilio). (DSE: 7f)\n\n\nIt should be stressed that although eclecticism means collecting what\nis good in other authors, it does not just aim at a mere collection of\ntrue or probable hypotheses, but instead at the formulation of a\ncoherent system of natural philosophy (PE I: preface, art. 3.2).\nEclecticism, in Sturm’s eyes, explicitly invites the correction,\nemendation and augmentation of existing theories (DSE: 48, 69). It is\na philosophical approach more useful and appropriate for the\nadvancement of the sciences than thinking in line with one author as\nthe sectarians do (DSE: 14).\n\nFinally, Sturm’s method conceives of natural philosophy as a\ndynamic project in a state of constant transformation. To illustrate\nthis point, Sturm compares philosophy as a whole to a ship: it is\nsomewhat complete, though undergoing constant changes and mending.\nBoth philosophy and a ship in use need to be fixed from time to time.\nOld, used-up parts (hypotheses in the case of philosophy, planks in\nthe case of the ship) have to go to be replaced by new parts fit to\nallow both to advance (CPMS: 79). Philosophy is a never ending\nproject. It can only approximate truth, getting closer and closer. No\nsingle natural philosopher has or could have exhausted and\nsufficiently explained the phenomena obtaining in nature. Hence, what\nneeds to be done is to diligently assess and select what is good and\ntrue in other philosophers, adding what needs to be added. New\nphenomena are being discovered, new competing hypotheses are being\ndeveloped to explain them. They too need to be assessed. What is\nreasonable remains. What is not able to stand up to the demands of a\ngood hypothesis will have to go. The experimental study of nature\nproceeds, too. New instruments are being developed raising new\nchallenges to old hypotheses. The vastness of nature, the manifold of\nits phenomena and the fact that causes cannot be observed but only\nconjectured add to the difficulty of the natural philosopher’s\ntask. It would indeed be temerity and arrogance to think that one has\nexplained all there needs to be explained in nature (CPMS: 67).\nTherefore, Sturm is making a case for the open-endedness of natural\nphilosophy. Its goal is to know oneself, to know the world, and\nultimately to know God (PE I: preface, art. 4.5; CPMS: 8). A goal that\nis not reachable within the life span of a human being, but a goal\nworth striving for.\n",
    "section_title": "2. The scientific method: experimental, hypothetical, eclectic",
    "entry_title": "Johann Sturm",
    "hierarchy_title": "Johann Sturm || The scientific method: experimental, hypothetical, eclectic",
    "tokenized_text": [
        "scientific",
        "method",
        "experimental",
        "hypothetical",
        "eclectic",
        "scientific",
        "method",
        "experimental",
        "hypothetical",
        "eclectic",
        "sturm",
        "scientific",
        "method",
        "aim",
        "providing",
        "complete",
        "system",
        "natural",
        "philosophy",
        "potentially",
        "natural",
        "phenomenon",
        "receive",
        "satisfying",
        "causal",
        "explanation",
        "based",
        "available",
        "observation",
        "taking",
        "account",
        "perspicuous",
        "hypothesis",
        "advanced",
        "sturm",
        "method",
        "consists",
        "three",
        "main",
        "step",
        "also",
        "provide",
        "recurrent",
        "pattern",
        "used",
        "discus",
        "topic",
        "covered",
        "physica",
        "electiva",
        "first",
        "step",
        "consists",
        "collecting",
        "phenomenon",
        "either",
        "reported",
        "natural",
        "philosopher",
        "encountered",
        "mean",
        "observation",
        "experimentation",
        "need",
        "reported",
        "faithfully",
        "fideliter",
        "accurately",
        "presenting",
        "circumstance",
        "phenomenon",
        "obtained",
        "pe",
        "preface",
        "art",
        "sturm",
        "committed",
        "new",
        "emerging",
        "experimental",
        "natural",
        "philosophy",
        "among",
        "first",
        "university",
        "professor",
        "germany",
        "introduce",
        "experimental",
        "approach",
        "academic",
        "level",
        "inspired",
        "experimental",
        "method",
        "advanced",
        "bacon",
        "boyle",
        "offered",
        "regular",
        "yet",
        "private",
        "experimental",
        "collegia",
        "teaching",
        "collegium",
        "experimentale",
        "sive",
        "curiosum",
        "reveals",
        "sturm",
        "familiar",
        "state",
        "art",
        "experimental",
        "natural",
        "science",
        "putting",
        "good",
        "use",
        "new",
        "instrument",
        "available",
        "time",
        "namely",
        "telescope",
        "microscope",
        "air",
        "pump",
        "diver",
        "bell",
        "etc",
        "furthermore",
        "hypothesis",
        "basis",
        "theorybuilding",
        "measured",
        "congruence",
        "phenomenon",
        "result",
        "experiment",
        "paradigmatic",
        "experimenter",
        "sturm",
        "otto",
        "von",
        "guericke",
        "caspar",
        "schott",
        "robert",
        "boyle",
        "however",
        "sturm",
        "content",
        "putting",
        "forth",
        "mere",
        "natural",
        "history",
        "mere",
        "listing",
        "thing",
        "found",
        "nature",
        "curious",
        "experimental",
        "result",
        "natural",
        "philosophy",
        "must",
        "provide",
        "deeper",
        "causal",
        "explanation",
        "phenomenon",
        "occur",
        "achieve",
        "goal",
        "natural",
        "philosopher",
        "take",
        "stock",
        "experimental",
        "finding",
        "available",
        "observation",
        "investigate",
        "suitable",
        "hypothesis",
        "explain",
        "second",
        "step",
        "hence",
        "consists",
        "collecting",
        "presenting",
        "faithfulness",
        "old",
        "new",
        "hypothesis",
        "suggested",
        "account",
        "phenomenon",
        "sturm",
        "meticulously",
        "present",
        "hypothesis",
        "old",
        "new",
        "presocratic",
        "seventeenthcentury",
        "author",
        "see",
        "sect",
        "sturm",
        "show",
        "assiduous",
        "diligent",
        "reader",
        "natural",
        "philosophy",
        "available",
        "time",
        "knowledge",
        "even",
        "le",
        "prominent",
        "author",
        "impressive",
        "precise",
        "sturm",
        "last",
        "physic",
        "compendium",
        "physicae",
        "modernae",
        "sanioris",
        "cpms",
        "make",
        "particularly",
        "clear",
        "hypothesis",
        "place",
        "observation",
        "sens",
        "certainty",
        "revealed",
        "demonstrative",
        "method",
        "point",
        "thing",
        "obvious",
        "observed",
        "sens",
        "mean",
        "experiment",
        "including",
        "use",
        "newly",
        "invented",
        "instrument",
        "cpms",
        "f",
        "thing",
        "merely",
        "conjectured",
        "rather",
        "infallibly",
        "demonstrated",
        "supponuntur",
        "verius",
        "conjiciuntur",
        "quam",
        "infallibiliter",
        "demonstratur",
        "cpms",
        "certain",
        "sense",
        "phenomenon",
        "hypothesis",
        "align",
        "deduced",
        "deducuntur",
        "phenomenon",
        "hypothesis",
        "way",
        "mean",
        "demonstrative",
        "method",
        "due",
        "ubiquitous",
        "harmonizing",
        "correspondence",
        "phenomenon",
        "hypothesis",
        "mean",
        "certain",
        "demonstrative",
        "regress",
        "thing",
        "assumed",
        "way",
        "seemingly",
        "true",
        "verosimiliter",
        "ascend",
        "evadent",
        "truth",
        "certainty",
        "cpms",
        "f",
        "third",
        "step",
        "sturm",
        "method",
        "aim",
        "selection",
        "reconciliation",
        "different",
        "hypothesis",
        "final",
        "concocting",
        "satisfying",
        "account",
        "phenomenon",
        "stake",
        "sturm",
        "goal",
        "distil",
        "good",
        "reasonable",
        "discarding",
        "pseudoexplanations",
        "prejudice",
        "preconceived",
        "notion",
        "step",
        "approached",
        "mainly",
        "critical",
        "investigation",
        "rational",
        "discussion",
        "logical",
        "inference",
        "sense",
        "philosophical",
        "speculative",
        "part",
        "sturm",
        "method",
        "goal",
        "third",
        "step",
        "thus",
        "critically",
        "ass",
        "integrate",
        "hypothesis",
        "collected",
        "beginning",
        "preface",
        "pe",
        "pe",
        "art",
        "sturm",
        "possibly",
        "inspired",
        "boyle",
        "mariotte",
        "extensively",
        "investigates",
        "criterion",
        "good",
        "hypothesis",
        "meet",
        "reasonable",
        "degree",
        "possibility",
        "show",
        "connection",
        "among",
        "phenomenon",
        "satisfy",
        "circumstance",
        "obtain",
        "hypothesis",
        "better",
        "case",
        "accommodate",
        "phenomenon",
        "notable",
        "circumstance",
        "simpler",
        "hypothesis",
        "preferred",
        "hence",
        "sturm",
        "avail",
        "ockham",
        "razor",
        "choosing",
        "among",
        "hypothesis",
        "reasoning",
        "behind",
        "simple",
        "hypothesis",
        "mirror",
        "god",
        "way",
        "simple",
        "pe",
        "preface",
        "art",
        "god",
        "wisest",
        "creator",
        "nature",
        "opificem",
        "naturae",
        "sapientissimum",
        "designed",
        "world",
        "simple",
        "mean",
        "taken",
        "consideration",
        "studying",
        "nature",
        "design",
        "furthermore",
        "good",
        "hypothesis",
        "neither",
        "conflict",
        "phenomenon",
        "established",
        "hypothesis",
        "evident",
        "principle",
        "pe",
        "preface",
        "art",
        "finally",
        "sturm",
        "point",
        "hypothesis",
        "satisfy",
        "intellect",
        "also",
        "imagination",
        "sens",
        "pe",
        "preface",
        "art",
        "sturm",
        "reasoning",
        "natural",
        "phenomenon",
        "phenomenon",
        "pertaining",
        "world",
        "extension",
        "modification",
        "like",
        "shape",
        "motion",
        "sens",
        "imagination",
        "first",
        "foremost",
        "concerned",
        "realm",
        "extended",
        "being",
        "therefore",
        "ass",
        "aptness",
        "hypothesis",
        "natural",
        "phenomenon",
        "one",
        "need",
        "consult",
        "faculty",
        "mere",
        "abstract",
        "conceptual",
        "reflection",
        "nature",
        "characteristic",
        "scholastic",
        "sturm",
        "think",
        "sufficient",
        "since",
        "worldly",
        "phenomenon",
        "proximate",
        "palpable",
        "sens",
        "imagination",
        "pe",
        "preface",
        "art",
        "threestep",
        "method",
        "presentation",
        "phenomenon",
        "establishes",
        "explanandum",
        "hypothesis",
        "cover",
        "ground",
        "towards",
        "approximating",
        "solution",
        "since",
        "different",
        "hypothesis",
        "either",
        "contradict",
        "run",
        "parallel",
        "one",
        "another",
        "true",
        "explanation",
        "select",
        "existing",
        "theory",
        "true",
        "reject",
        "false",
        "add",
        "need",
        "added",
        "brings",
        "u",
        "sturm",
        "eclecticism",
        "eclectic",
        "approach",
        "consists",
        "nothing",
        "select",
        "adopt",
        "sibi",
        "sumere",
        "sect",
        "philosopher",
        "true",
        "left",
        "behind",
        "false",
        "erroneous",
        "pe",
        "preface",
        "art",
        "sturm",
        "encountered",
        "eclectic",
        "method",
        "oneyear",
        "stay",
        "leiden",
        "probably",
        "inspired",
        "henricus",
        "bornius",
        "preface",
        "sturm",
        "physica",
        "electiva",
        "disputation",
        "de",
        "philosophia",
        "sectaria",
        "electiva",
        "dse",
        "philosophia",
        "eclectica",
        "held",
        "plea",
        "eclecticism",
        "contrast",
        "sharply",
        "sectarian",
        "philosophy",
        "according",
        "sturm",
        "whole",
        "philosopher",
        "bracketing",
        "sceptic",
        "doubter",
        "sceptios",
        "ac",
        "dubitatores",
        "subsumed",
        "two",
        "class",
        "sectarian",
        "eclectic",
        "dse",
        "sectarian",
        "thinker",
        "led",
        "authority",
        "slavishly",
        "depend",
        "follow",
        "reasoning",
        "spend",
        "time",
        "absorbing",
        "reproducing",
        "fiercely",
        "defending",
        "learned",
        "ex",
        "cathedra",
        "sectarian",
        "philosopher",
        "follow",
        "truth",
        "said",
        "authority",
        "person",
        "said",
        "something",
        "notable",
        "sect",
        "sturm",
        "day",
        "aristotelian",
        "secta",
        "aristotelica",
        "two",
        "main",
        "branch",
        "namely",
        "greek",
        "interpreter",
        "scholastic",
        "commentator",
        "cartesian",
        "secta",
        "cartesiana",
        "gassendists",
        "secta",
        "gassendica",
        "reviving",
        "epicurean",
        "democritean",
        "thought",
        "neoplatonist",
        "secta",
        "neoplatonica",
        "dse",
        "physica",
        "electiva",
        "sturm",
        "mention",
        "alchemical",
        "school",
        "spagyric",
        "school",
        "chemist",
        "chemicorum",
        "fourth",
        "main",
        "one",
        "omitting",
        "neoplatonism",
        "pe",
        "preface",
        "art",
        "case",
        "eclecticism",
        "made",
        "ex",
        "negativo",
        "challenging",
        "sectarianism",
        "positively",
        "bringing",
        "light",
        "strength",
        "eclectic",
        "method",
        "concerning",
        "repudiation",
        "sectarian",
        "philosophy",
        "sturm",
        "argues",
        "adopting",
        "sectarian",
        "approach",
        "first",
        "necessity",
        "sectariae",
        "quippe",
        "philosophiae",
        "primo",
        "nulla",
        "est",
        "necessitas",
        "option",
        "see",
        "dse",
        "f",
        "second",
        "following",
        "one",
        "authority",
        "useful",
        "even",
        "dangerous",
        "damaging",
        "advancement",
        "augmentation",
        "science",
        "contrast",
        "eclectic",
        "philosopher",
        "defined",
        "hose",
        "want",
        "hang",
        "every",
        "word",
        "someone",
        "swear",
        "word",
        "one",
        "master",
        "knew",
        "collected",
        "storehouse",
        "everything",
        "true",
        "good",
        "word",
        "writing",
        "whatever",
        "teacher",
        "doctorum",
        "convinced",
        "authority",
        "person",
        "teaching",
        "weight",
        "argument",
        "demonstration",
        "even",
        "added",
        "much",
        "could",
        "make",
        "business",
        "sustineant",
        "see",
        "rather",
        "someone",
        "else",
        "eye",
        "dse",
        "f",
        "see",
        "also",
        "dse",
        "eclectic",
        "method",
        "acknowledges",
        "feebleness",
        "human",
        "mind",
        "proclivity",
        "err",
        "dse",
        "humbler",
        "sectarian",
        "philosophy",
        "assumes",
        "find",
        "truth",
        "one",
        "author",
        "since",
        "human",
        "tend",
        "misjudge",
        "thing",
        "make",
        "mistake",
        "depend",
        "one",
        "another",
        "corrective",
        "scientific",
        "study",
        "nature",
        "succeed",
        "hence",
        "becomes",
        "collective",
        "endeavor",
        "name",
        "eclectic",
        "philosopher",
        "understand",
        "whole",
        "treatise",
        "others",
        "reject",
        "without",
        "difference",
        "thing",
        "found",
        "inventa",
        "left",
        "tradita",
        "head",
        "different",
        "sect",
        "moved",
        "authority",
        "one",
        "leader",
        "accept",
        "utterance",
        "bons",
        "mot",
        "dicteria",
        "acknowledge",
        "feebleness",
        "imbecillitatem",
        "human",
        "mind",
        "humani",
        "ingenii",
        "make",
        "apparent",
        "depth",
        "nature",
        "reason",
        "exhausted",
        "one",
        "men",
        "persuade",
        "truth",
        "viewed",
        "part",
        "science",
        "advanced",
        "stabilized",
        "mean",
        "united",
        "power",
        "junctis",
        "viribus",
        "communicated",
        "advice",
        "communicato",
        "consilio",
        "dse",
        "f",
        "stressed",
        "although",
        "eclecticism",
        "mean",
        "collecting",
        "good",
        "author",
        "aim",
        "mere",
        "collection",
        "true",
        "probable",
        "hypothesis",
        "instead",
        "formulation",
        "coherent",
        "system",
        "natural",
        "philosophy",
        "pe",
        "preface",
        "art",
        "eclecticism",
        "sturm",
        "eye",
        "explicitly",
        "invite",
        "correction",
        "emendation",
        "augmentation",
        "existing",
        "theory",
        "dse",
        "philosophical",
        "approach",
        "useful",
        "appropriate",
        "advancement",
        "science",
        "thinking",
        "line",
        "one",
        "author",
        "sectarian",
        "dse",
        "finally",
        "sturm",
        "method",
        "conceives",
        "natural",
        "philosophy",
        "dynamic",
        "project",
        "state",
        "constant",
        "transformation",
        "illustrate",
        "point",
        "sturm",
        "compare",
        "philosophy",
        "whole",
        "ship",
        "somewhat",
        "complete",
        "though",
        "undergoing",
        "constant",
        "change",
        "mending",
        "philosophy",
        "ship",
        "use",
        "need",
        "fixed",
        "time",
        "time",
        "old",
        "usedup",
        "part",
        "hypothesis",
        "case",
        "philosophy",
        "plank",
        "case",
        "ship",
        "go",
        "replaced",
        "new",
        "part",
        "fit",
        "allow",
        "advance",
        "cpms",
        "philosophy",
        "never",
        "ending",
        "project",
        "approximate",
        "truth",
        "getting",
        "closer",
        "closer",
        "single",
        "natural",
        "philosopher",
        "could",
        "exhausted",
        "sufficiently",
        "explained",
        "phenomenon",
        "obtaining",
        "nature",
        "hence",
        "need",
        "done",
        "diligently",
        "ass",
        "select",
        "good",
        "true",
        "philosopher",
        "adding",
        "need",
        "added",
        "new",
        "phenomenon",
        "discovered",
        "new",
        "competing",
        "hypothesis",
        "developed",
        "explain",
        "need",
        "assessed",
        "reasonable",
        "remains",
        "able",
        "stand",
        "demand",
        "good",
        "hypothesis",
        "go",
        "experimental",
        "study",
        "nature",
        "proceeds",
        "new",
        "instrument",
        "developed",
        "raising",
        "new",
        "challenge",
        "old",
        "hypothesis",
        "vastness",
        "nature",
        "manifold",
        "phenomenon",
        "fact",
        "cause",
        "observed",
        "conjectured",
        "add",
        "difficulty",
        "natural",
        "philosopher",
        "task",
        "would",
        "indeed",
        "temerity",
        "arrogance",
        "think",
        "one",
        "explained",
        "need",
        "explained",
        "nature",
        "cpms",
        "therefore",
        "sturm",
        "making",
        "case",
        "openendedness",
        "natural",
        "philosophy",
        "goal",
        "know",
        "oneself",
        "know",
        "world",
        "ultimately",
        "know",
        "god",
        "pe",
        "preface",
        "art",
        "cpms",
        "goal",
        "reachable",
        "within",
        "life",
        "span",
        "human",
        "goal",
        "worth",
        "striving"
    ]
}