{
    "main_text": "Philosophical Method\n3. Philosophical Method\n\nThe most fundamental of John’s philosophical commitments arises\nexpressly from Cicero. Beyond John’s self-conscious (and largely\nsuccessful) effort to imitate Cicero’s polished style of Latin\nexpression, he embraces the Ciceronian dedication to the program of\nthe New Academy (Nederman 2005; Grellard 2013). The New Academy\nadvocated an anti-dogmatic probabilistic theory of knowledge according\nto which claims to certainty remain open to challenge, so long as they\nhave not been demonstrated beyond doubt. Cicero distanced himself from\nthe more radically skeptical method of the so-called “Old\nAcademy”, which denied that anything whatsoever could be known\nwith certainty (Cicero De natura deorum: 1.1). As Cicero\nexplains, the New Academy does not foreclose the possibility of the\nhuman mind attaining truth (pace the Old Academy), only\ninsisting that the criteria for discerning truth from falsity are not\nself-evident or intuitive and that the senses can be deceived (Cicero\nAcademica: 2.24.76–2.30.98). Cicero’s skeptical\nstance has the character not of absolute doubt but of\nanti-dogmatism.\n\nJohn overtly adopted the same Ciceronian New Academic perspective in\nall of his noteworthy contributions to philosophy: the\nPolicraticus, the Metalogicon, and the\nEntheticus de dogmate philosophorum maior. The first is his\nbest-known work, a treatise on proper courtly and royal conduct which\ncontains a great measure of political theory; the second comprises his\ncritical appraisal of the state of education in twelfth-century\nEurope, with special attention to the advances in knowledge occasioned\nby the Aristotelian learning of his time; the last is a lengthy\ndidactic poem. While scholars have normally treated these writings as\ndiscrete and largely unrelated (Wilks 1984a and von Moos 1984 are\nexceptions), they are united methodologically by their shared\nendorsement and application of Ciceronian moderate skepticism, which\nproves to be crucial in framing the substance of John’s\nphilosophical stance. Charles B. Schmitt’s claim that\nJohn’s “treatment [of the New Academy] has little\nphilosophical sophistication” proves unsustainable (Schmitt\n1972: 37–38).\n\nBecause John enjoyed broad access to Cicero’s main works of\nphilosophy, he possessed a comprehensive understanding of the issues\nat stake in adherence to New Academic skepticism (Denery 2016),\nclearly grasping the epistemological differences underpinning moderate\nand rigorous skeptical stances. In his Entheticus maior, John\nchides the radically skeptical view of the Old Academy that “the\nhuman race is deprived of light” (EMM: 1.138), endorsing the\nposition associated with the New Academy that\n\n\none should hesitate in all things except those which are proved by\nliving reason … These things, [the Academic] declares, are\nknown; he passes doubtfully on other things, of which more certainty\nis to be had from experience. For the usual course of events makes\nprobable what you always see under a similar pattern. Yet, since it\nsometimes happens otherwise, these things are not sufficiently\ncertain, and yet not without evidence. What he, therefore, affirms to\nbe true, he thinks to be necessary; for the rest, he says “I\nbelieve” or “I think it to be”. (EMM, ll.\n1143–44, 1147–54)\n\n\nCommencing with his first work of philosophical reflection, John had\nalready declared his allegiance to an essentially Ciceronian\noutlook. John’s Metalogicon reiterates this position,\nrepeatedly proclaiming his explicit commitment to the philosophical\nprogram of the New Academy. In the prologue, he announces,\n\n\nAn Academic in matters which to the wise man are doubtful, I do not\nswear that what I say is true, but, be it true or false, I remain\ncontent with probability alone. (ML: 122)\n\n\nWhile John distances his version of skepticism from more radical\nviews, he admits that the process of achieving knowledge is\ntroublesome. Echoing a remark by Cicero, John observes,\n\n\n… it is a great thing to discover the truth, which, as our\nAcademic friends claim, lies hidden as it were at the bottom of a well\n…. (ML: 205)\n\n\nJohn returns often in the Metalogicon to Cicero’s\nmethodological injunction against embracing insufficiently\nsubstantiated truth-claims too hastily. A main theme of the\nMetalogicon might aptly be characterized as the refutation of\nthe arid argumentation that occurred among the teachers of his time as\na result of their unwillingness to renounce their rigid formulae and\nfixed dogmas.\n\nJohn of Salisbury’s most extensive discussion and application of\nthe Ciceronian New Academy occurs in the Policraticus. That\ntreatise again contains repeated self-identification of its author\nwith the teachings of the Academy, its prologue echoing the words of\nthe Metalogicon:\n\n\nIn philosophy, I am a devotee of Academic dispute, which measures by\nreason that which presents itself as more probable. … I do not\nrecede from their footprints in those matters about which the wise\nperson has doubts. (PC: 7)\n\n\nThis is raised to the level of an evaluative standard in Book\nSeven’s recounting of the major schools of Greco-Roman\nphilosophy, the stated aim of which is to discover the valuable\nlessons of each as well as to demonstrate the limitations inherent in\nall (PC: 148–49). The treatment of the Academic School is given\npride of place, opening this critical history of pagan philosophy.\nEven as he admits his own devotion to the Academy, John stresses the\ndivide that exists within the School between an extreme skepticism and\nhis own moderate Ciceronian stance, offering a reductio\nargument against the former:\n\n\nYet I do not say that all those who are included under the name of\nAcademic have upheld the rule of modesty, since even its basic creed\nis in dispute and parts of it are open as much to derision as to\nerror… If the Academic is in doubt about each thing, he is\ncertain about nothing… But he possesses uncertainty about\nwhether he is in doubt, so long as he does not know for certain that\nhe does not know this doubt itself. (PC: 150)\n\n\nRadical skepticism cannot attain the mantle of philosophy, John says,\nbecause the philosopher’s love of wisdom requires the admission\nthat one may know what is true (PC: 151–52).\n\nJohn’s moderate skepticism accepts that there are three reliable\nfoundations for knowledge: faith, reason, and the senses (PC:\n153–56). Thus, it does not behoove the philosopher to question\nhis faith in the existence of God, nor the certainty of some\nmathematical postulates, nor a number of other first principles which\n“one is not permitted to doubt, except for those who are\noccupied by the labors of not knowing anything” (PC: 154).\nThough it might seem that John’s skepticism is not so very\nskeptical after all, he generates a lengthy list of\n\n\ndoubtful matters about which the wise person is not convinced by the\nauthority of either faith or his senses or manifest reason, and in\nwhich contrary claims rest on the support of some evidence. (PC:\n152)\n\n\nThese topics include major issues of metaphysics, cosmology, natural\nscience, theology, and ethics. Among the ethical topics that John\ncites as susceptible to doubt, and thus open to rational debate,\nare the uses and end and origins of virtues and vices, whether a man\nwho has one virtue has all the virtues, whether all sins are equal and\nare punishable equally. (PC: 152)\n\nThe entire list is clearly meant to be illustrative rather than\ninclusive (PC: 152–53). In sum, John opens up to rational\ndispute an extraordinarily broad array of topics which are appropriate\nfor philosophical discourse. In confronting all such debatable\nsubjects, John counsels adherence to the Academic method, since\n\n\nthe Academics have doubts regarding these matters with so much modesty\nthat I perceive them to have guarded diligently against the danger of\nrashness. (PC: 153)\n\n\nUnique among all schools of philosophy, the Academy resists the\ntemptation to replace open discussion of uncertain matters with\nprematurely closed dogma. In John’s view, the moderate\nskepticism of the New Academy alone defends the liberty of inquiry\nthat he regards to be necessary to the quest for truth.\n\nAlthough the Policraticus does not restate the\nepistemological bases of intellectual fallibility addressed in the\nEntheticus and Metalogicon, it clearly takes for\ngranted that the human mind is furnished with the potential power to\ncomprehend truth. Hence, John rejects the Augustinian claim that even\nCicero’s moderate skepticism\n\n\npiles up darkness from some hidden source, and warns that the whole of\nphilosophy is obscure, and does not allow one to hope that any light\nwill be found in it. (Augustine Against the Academicians:\n3.14.30)\n\n\nIn a surprising twist, John enlists Augustine himself in support of\nthose who evince Academic doubt:\n\n\nEven our Augustine does not assail them, since he himself somewhat\nfrequently employs Academic moderation in his works and propounds many\nmatters as ambiguous which would not seem to be in question to another\narguing with greater confidence and just as safely. (PC: 152)\n\n\nOn John’s reading, Augustine practiced the Academic method even\nwhile he excoriated it in principle. The validity of this\ninterpretation aside, John seeks any evidence whatsoever to bolster\nhis view that “mortals can know very little” (EMM, l.\n1142).\n",
    "section_title": "3. Philosophical Method",
    "entry_title": "John of Salisbury",
    "hierarchy_title": "John of Salisbury || Philosophical Method",
    "tokenized_text": [
        "philosophical",
        "method",
        "philosophical",
        "method",
        "fundamental",
        "john",
        "philosophical",
        "commitment",
        "arises",
        "expressly",
        "cicero",
        "beyond",
        "john",
        "selfconscious",
        "largely",
        "successful",
        "effort",
        "imitate",
        "cicero",
        "polished",
        "style",
        "latin",
        "expression",
        "embrace",
        "ciceronian",
        "dedication",
        "program",
        "new",
        "academy",
        "nederman",
        "grellard",
        "new",
        "academy",
        "advocated",
        "antidogmatic",
        "probabilistic",
        "theory",
        "knowledge",
        "according",
        "claim",
        "certainty",
        "remain",
        "open",
        "challenge",
        "long",
        "demonstrated",
        "beyond",
        "doubt",
        "cicero",
        "distanced",
        "radically",
        "skeptical",
        "method",
        "socalled",
        "old",
        "academy",
        "denied",
        "anything",
        "whatsoever",
        "could",
        "known",
        "certainty",
        "cicero",
        "de",
        "natura",
        "deorum",
        "cicero",
        "explains",
        "new",
        "academy",
        "foreclose",
        "possibility",
        "human",
        "mind",
        "attaining",
        "truth",
        "pace",
        "old",
        "academy",
        "insisting",
        "criterion",
        "discerning",
        "truth",
        "falsity",
        "selfevident",
        "intuitive",
        "sens",
        "deceived",
        "cicero",
        "academica",
        "cicero",
        "skeptical",
        "stance",
        "character",
        "absolute",
        "doubt",
        "antidogmatism",
        "john",
        "overtly",
        "adopted",
        "ciceronian",
        "new",
        "academic",
        "perspective",
        "noteworthy",
        "contribution",
        "philosophy",
        "policraticus",
        "metalogicon",
        "entheticus",
        "de",
        "dogmate",
        "philosophorum",
        "maior",
        "first",
        "bestknown",
        "work",
        "treatise",
        "proper",
        "courtly",
        "royal",
        "conduct",
        "contains",
        "great",
        "measure",
        "political",
        "theory",
        "second",
        "comprises",
        "critical",
        "appraisal",
        "state",
        "education",
        "twelfthcentury",
        "europe",
        "special",
        "attention",
        "advance",
        "knowledge",
        "occasioned",
        "aristotelian",
        "learning",
        "time",
        "last",
        "lengthy",
        "didactic",
        "poem",
        "scholar",
        "normally",
        "treated",
        "writing",
        "discrete",
        "largely",
        "unrelated",
        "wilks",
        "a",
        "von",
        "moo",
        "exception",
        "united",
        "methodologically",
        "shared",
        "endorsement",
        "application",
        "ciceronian",
        "moderate",
        "skepticism",
        "prof",
        "crucial",
        "framing",
        "substance",
        "john",
        "philosophical",
        "stance",
        "charles",
        "b",
        "schmitt",
        "claim",
        "john",
        "treatment",
        "new",
        "academy",
        "little",
        "philosophical",
        "sophistication",
        "prof",
        "unsustainable",
        "schmitt",
        "john",
        "enjoyed",
        "broad",
        "access",
        "cicero",
        "main",
        "work",
        "philosophy",
        "possessed",
        "comprehensive",
        "understanding",
        "issue",
        "stake",
        "adherence",
        "new",
        "academic",
        "skepticism",
        "denery",
        "clearly",
        "grasping",
        "epistemological",
        "difference",
        "underpinning",
        "moderate",
        "rigorous",
        "skeptical",
        "stance",
        "entheticus",
        "maior",
        "john",
        "chides",
        "radically",
        "skeptical",
        "view",
        "old",
        "academy",
        "human",
        "race",
        "deprived",
        "light",
        "emm",
        "endorsing",
        "position",
        "associated",
        "new",
        "academy",
        "one",
        "hesitate",
        "thing",
        "except",
        "proved",
        "living",
        "reason",
        "thing",
        "academic",
        "declares",
        "known",
        "pass",
        "doubtfully",
        "thing",
        "certainty",
        "experience",
        "usual",
        "course",
        "event",
        "make",
        "probable",
        "always",
        "see",
        "similar",
        "pattern",
        "yet",
        "since",
        "sometimes",
        "happens",
        "otherwise",
        "thing",
        "sufficiently",
        "certain",
        "yet",
        "without",
        "evidence",
        "therefore",
        "affirms",
        "true",
        "think",
        "necessary",
        "rest",
        "say",
        "believe",
        "think",
        "emm",
        "commencing",
        "first",
        "work",
        "philosophical",
        "reflection",
        "john",
        "already",
        "declared",
        "allegiance",
        "essentially",
        "ciceronian",
        "outlook",
        "john",
        "metalogicon",
        "reiterates",
        "position",
        "repeatedly",
        "proclaiming",
        "explicit",
        "commitment",
        "philosophical",
        "program",
        "new",
        "academy",
        "prologue",
        "announces",
        "academic",
        "matter",
        "wise",
        "man",
        "doubtful",
        "swear",
        "say",
        "true",
        "true",
        "false",
        "remain",
        "content",
        "probability",
        "alone",
        "ml",
        "john",
        "distance",
        "version",
        "skepticism",
        "radical",
        "view",
        "admits",
        "process",
        "achieving",
        "knowledge",
        "troublesome",
        "echoing",
        "remark",
        "cicero",
        "john",
        "observes",
        "great",
        "thing",
        "discover",
        "truth",
        "academic",
        "friend",
        "claim",
        "lie",
        "hidden",
        "bottom",
        "well",
        "ml",
        "john",
        "return",
        "often",
        "metalogicon",
        "cicero",
        "methodological",
        "injunction",
        "embracing",
        "insufficiently",
        "substantiated",
        "truthclaims",
        "hastily",
        "main",
        "theme",
        "metalogicon",
        "might",
        "aptly",
        "characterized",
        "refutation",
        "arid",
        "argumentation",
        "occurred",
        "among",
        "teacher",
        "time",
        "result",
        "unwillingness",
        "renounce",
        "rigid",
        "formula",
        "fixed",
        "dogma",
        "john",
        "salisbury",
        "extensive",
        "discussion",
        "application",
        "ciceronian",
        "new",
        "academy",
        "occurs",
        "policraticus",
        "treatise",
        "contains",
        "repeated",
        "selfidentification",
        "author",
        "teaching",
        "academy",
        "prologue",
        "echoing",
        "word",
        "metalogicon",
        "philosophy",
        "devotee",
        "academic",
        "dispute",
        "measure",
        "reason",
        "present",
        "probable",
        "recede",
        "footprint",
        "matter",
        "wise",
        "person",
        "doubt",
        "pc",
        "raised",
        "level",
        "evaluative",
        "standard",
        "book",
        "seven",
        "recounting",
        "major",
        "school",
        "grecoroman",
        "philosophy",
        "stated",
        "aim",
        "discover",
        "valuable",
        "lesson",
        "well",
        "demonstrate",
        "limitation",
        "inherent",
        "pc",
        "treatment",
        "academic",
        "school",
        "given",
        "pride",
        "place",
        "opening",
        "critical",
        "history",
        "pagan",
        "philosophy",
        "even",
        "admits",
        "devotion",
        "academy",
        "john",
        "stress",
        "divide",
        "exists",
        "within",
        "school",
        "extreme",
        "skepticism",
        "moderate",
        "ciceronian",
        "stance",
        "offering",
        "reductio",
        "argument",
        "former",
        "yet",
        "say",
        "included",
        "name",
        "academic",
        "upheld",
        "rule",
        "modesty",
        "since",
        "even",
        "basic",
        "creed",
        "dispute",
        "part",
        "open",
        "much",
        "derision",
        "error",
        "academic",
        "doubt",
        "thing",
        "certain",
        "nothing",
        "posse",
        "uncertainty",
        "whether",
        "doubt",
        "long",
        "know",
        "certain",
        "know",
        "doubt",
        "pc",
        "radical",
        "skepticism",
        "attain",
        "mantle",
        "philosophy",
        "john",
        "say",
        "philosopher",
        "love",
        "wisdom",
        "requires",
        "admission",
        "one",
        "may",
        "know",
        "true",
        "pc",
        "john",
        "moderate",
        "skepticism",
        "accepts",
        "three",
        "reliable",
        "foundation",
        "knowledge",
        "faith",
        "reason",
        "sens",
        "pc",
        "thus",
        "behoove",
        "philosopher",
        "question",
        "faith",
        "existence",
        "god",
        "certainty",
        "mathematical",
        "postulate",
        "number",
        "first",
        "principle",
        "one",
        "permitted",
        "doubt",
        "except",
        "occupied",
        "labor",
        "knowing",
        "anything",
        "pc",
        "though",
        "might",
        "seem",
        "john",
        "skepticism",
        "skeptical",
        "generates",
        "lengthy",
        "list",
        "doubtful",
        "matter",
        "wise",
        "person",
        "convinced",
        "authority",
        "either",
        "faith",
        "sens",
        "manifest",
        "reason",
        "contrary",
        "claim",
        "rest",
        "support",
        "evidence",
        "pc",
        "topic",
        "include",
        "major",
        "issue",
        "metaphysics",
        "cosmology",
        "natural",
        "science",
        "theology",
        "ethic",
        "among",
        "ethical",
        "topic",
        "john",
        "cite",
        "susceptible",
        "doubt",
        "thus",
        "open",
        "rational",
        "debate",
        "us",
        "end",
        "origin",
        "virtue",
        "vice",
        "whether",
        "man",
        "one",
        "virtue",
        "virtue",
        "whether",
        "sin",
        "equal",
        "punishable",
        "equally",
        "pc",
        "entire",
        "list",
        "clearly",
        "meant",
        "illustrative",
        "rather",
        "inclusive",
        "pc",
        "sum",
        "john",
        "open",
        "rational",
        "dispute",
        "extraordinarily",
        "broad",
        "array",
        "topic",
        "appropriate",
        "philosophical",
        "discourse",
        "confronting",
        "debatable",
        "subject",
        "john",
        "counsel",
        "adherence",
        "academic",
        "method",
        "since",
        "academic",
        "doubt",
        "regarding",
        "matter",
        "much",
        "modesty",
        "perceive",
        "guarded",
        "diligently",
        "danger",
        "rashness",
        "pc",
        "unique",
        "among",
        "school",
        "philosophy",
        "academy",
        "resists",
        "temptation",
        "replace",
        "open",
        "discussion",
        "uncertain",
        "matter",
        "prematurely",
        "closed",
        "dogma",
        "john",
        "view",
        "moderate",
        "skepticism",
        "new",
        "academy",
        "alone",
        "defends",
        "liberty",
        "inquiry",
        "regard",
        "necessary",
        "quest",
        "truth",
        "although",
        "policraticus",
        "restate",
        "epistemological",
        "base",
        "intellectual",
        "fallibility",
        "addressed",
        "entheticus",
        "metalogicon",
        "clearly",
        "take",
        "granted",
        "human",
        "mind",
        "furnished",
        "potential",
        "power",
        "comprehend",
        "truth",
        "hence",
        "john",
        "reject",
        "augustinian",
        "claim",
        "even",
        "cicero",
        "moderate",
        "skepticism",
        "pile",
        "darkness",
        "hidden",
        "source",
        "warns",
        "whole",
        "philosophy",
        "obscure",
        "allow",
        "one",
        "hope",
        "light",
        "found",
        "augustine",
        "academician",
        "surprising",
        "twist",
        "john",
        "enlists",
        "augustine",
        "support",
        "evince",
        "academic",
        "doubt",
        "even",
        "augustine",
        "assail",
        "since",
        "somewhat",
        "frequently",
        "employ",
        "academic",
        "moderation",
        "work",
        "propounds",
        "many",
        "matter",
        "ambiguous",
        "would",
        "seem",
        "question",
        "another",
        "arguing",
        "greater",
        "confidence",
        "safely",
        "pc",
        "john",
        "reading",
        "augustine",
        "practiced",
        "academic",
        "method",
        "even",
        "excoriated",
        "principle",
        "validity",
        "interpretation",
        "aside",
        "john",
        "seek",
        "evidence",
        "whatsoever",
        "bolster",
        "view",
        "mortal",
        "know",
        "little",
        "emm",
        "l"
    ]
}