{
    "main_text": "Externalist Versions of Foundationalism\n6. Externalist Versions of Foundationalism\n\nThe epistemic landscape has changed dramatically in the last forty or\nfifty years with the rise of externalist epistemologies. It is\nnotoriously difficult to define clearly the controversy between\ninternalists and externalists in epistemology. (For a detailed\ndiscussion of alternative ways of defining the controversy, see\nFumerton 1995: chs. 3 and 4. See also the entry on\n internalist and externalist conceptions of epistemic justification.)\n\nThere are at least two common ways of understanding the controversy.\nIt is sometimes taken to be a controversy over whether or not one can\nidentify epistemic properties with “internal” states of\nbelievers. According to the view we might call “internal state\ninternalism” (sometimes called “mentalism”),\njustification is analyzed in terms of or depends essentially and only\non what is inside the mind. It follows on this view that no two\nindividuals can be internally or mentally alike in all respects and\nyet differ in the justification they have for the same beliefs. In one\nsense, then, to be an externalist (a non-mentalist) is to claim that\none’s justification involves or depends essentially on some\nfacts or states of affairs outside the mind. Others take the\ncontroversy to center over the question of whether one requires\ncertain sorts of access for justification. The “access\ninternalist” holds (roughly) that being justified in believing\nthat P requires that there be something within or at least\navailable to one’s perspective or awareness which is relevant to\nthe truth or justification of P. (While some access\ninternalists seem to have held that everything that determines\njustification must be accessible, as we are about to see, hardly any\ninternalists hold such a strong position.) The “access\nexternalist” denies that justification requires any such access.\nThe access externalist need not deny that something relevant to the\ntruth of P is, at least sometimes, accessible to the subject\nwho has justification for P; but paradigm externalists deny\nthat access is always required for justification.\n\nSome accept both forms of “internalism”, though perhaps\ntake one sense to be more fundamental than the other. For example, one\nmight take access internalism to be more fundamental, and hold that\none can have access only to mental states and internal facts about\nthem, and so accept mentalism as a consequence. Or one might take the\nmentalist thesis to be more fundamental, and argue that one has some\nminimal access to the relevant mental facts, and so accept some form\nof access internalism as well. But it is possible to accept one form\nof internalism and reject the other. Some mentalists might deny that\nwe have access to all the mental states or features that make a\ndifference to justification. And some access internalists might hold\nthat we can be directly aware of external objects, external states of\naffairs, or external abstract entities or relations, and take this\ndirect awareness to make a difference to one’s justification;\nthey would deny that one’s justifiers must always be mental,\nthough they might accept the thesis that there can be no difference in\njustification without a mental difference, assuming that\naccess even to a non-mental entity counts as a mental\nrelation or mental state.\n\nAccess internalisms vary depending on what sort of\n“access” is required (true belief, justified belief,\nacquaintance, etc.), and on what it is that must be accessed for\njustification. There are thus stronger and weaker forms of access\ninternalism, and as a result the epistemic landscape is quite complex.\nCertainly, paradigm externalists would reject the second clause of the\nPIJ. According to virtually all externalists, one can arrive at a\njustified belief in P by inferring it from E without\nbeing aware of any sort of evidential connection between E\nand P; the fact that there is a good evidential connection\nbetween E and P can be external to the\nsubject’s mind and inaccessible to the subject. They would also\nreject a parallel principle for noninferential justification:\none can arrive at a justified belief on the basis of some sensory or\nother belief-independent input without being aware of any sort of\nevidential connection between the input and the belief. Phenomenal\nconservatives and dogmatists tend to agree with the paradigm\nexternalist in rejecting the requirement that one grasp a connection\nbetween one’s epistemic grounds or evidence and the proposition\nbelieved (though they deny that external conditions like reliability\ndiscussed below are also needed for justification). However,\nexternalists typically allow that in principle one could have a\nfoundational belief in the absence of any appearance or seeming. Some\nepistemologists have combined some modest internal requirements with\nexternalist ones in their accounts of epistemic justification (see,\nfor example, Alston 1989 and Steup 2004).\n\nWhile the externalist defends radically different views than those of\nclassical foundationalists, the structure of knowledge and\njustification that emerges from such theories is still often a\nfoundationalist structure. We might first illustrate the point by\nexamining the view defended by the most prominent of the externalists,\nAlvin Goldman’s\n reliabilism.[6]\n The fundamental idea behind reliabilism is strikingly simple.\nJustified beliefs are reliably produced beliefs. Reliably produced\nbeliefs are beliefs that are the product of a reliable process, and a\nreliable process is one that yields beliefs that are usually true (or\nwould usually be true if enough of them were\n generated).[7]\n Justified beliefs are worth having because justified beliefs are\nprobably true.\n\nGoldman initially distinguished two importantly different sorts of\njustified beliefs—those that result from belief-independent\nprocesses and those that result from belief-dependent processes. The\nformer are processes that take as their “input” stimuli\nother than beliefs; the latter are beliefs produced by processes that\ntake as their input at least some other beliefs. So, for example, it\nis possible that we have evolved in such a way that when prompted with\ncertain sensory input we immediately and unreflectively reach\nconclusions about external objects. And we may live in a world in\nwhich beliefs about the external world produced in this way are\nusually true (or would usually be true if enough of them were\ngenerated). Such beliefs will be justified by virtue of being the\nproduct of reliable belief-independent processes. This is basically\nthe “base clause” of the reliabilist’s analysis, a\nprinciple of foundational or noninferential justification: if a belief\nis the product of a reliable belief-independent process, then it is\njustified. Reliabilists generally add to this a condition requiring,\nin effect, that there be no defeaters available to the\nsubject—e.g., no good reason or justification to think that the\nbelief is false, unreliable or untrustworthy. (Specifying the needed\n“no defeater” condition in the base clause without using\nepistemic terms like ‘justification’ and\n‘reason’ is a nontrivial matter. Goldman (1979) proposes\nadding the condition that there be no reliable belief-withholding\nprocess available to the subject.) These foundational beliefs can in\nturn be taken as input for reliable belief-dependent processes in\norder to generate still more justified beliefs. A belief-dependent\nprocess is “conditionally” reliable if its output beliefs\nare usually (or would usually) be true if the relevant input beliefs\nare true. The output beliefs of conditionally reliable\nbelief-dependent processes are justified, provided that the input\nbeliefs are justified. This is basically the “recursive\nclause” of the reliabilist’s analysis, a principle of\nnonfoundational or inferential justification: if a belief is the\noutput of a conditionally reliable belief-dependent process, and the\ninput beliefs are justified, then (absent defeaters) the output belief\nis justified.\n\nThe above is a crude sketch of Goldman’s early\nreliabilism—he later modified it to deal with a number of\nobjections. But the sketch is enough to bring out the foundationalist\nstructure inherent in a reliabilist account. The reliabilist actually\naccepts the first clause of PIJ, and avoids the epistemic regress by\nembracing a kind of justified belief that does not owe its\njustification to the having of other justified beliefs. Any undefeated\nbelief resulting from a reliable belief-independent process is\njustified. No other beliefs are involved in the justification. So,\nsuch beliefs are foundational.\n\nReliabilism might complicate our taxonomy. Some reliabilists might\nhold that some belief-dependent processes (taking other beliefs as\ninput) can provide justification without being inferential processes.\nAfter all, there’s nothing about the reliability of a process\nthat requires that it involve anything like an inference. Indeed,\nperhaps some memorial processes, or certain sub-conscious processes,\nare conditionally reliable and so can provide justification (absent\ndefeaters). We will see in discussing objections in\n section 7.1,\n however, that this might lead to counterintuitive consequences. \n\nIt should be noted that Goldman (1979) himself denies that one could\ngive a strict definition of an evaluative or normative epistemic term\nlike ‘justification’ without using other, similar\nevaluative or normative terms. Still, he is interested in providing\n“substantive conditions”, conditions that specify, in\nnon-epistemic terms, when a belief is justified. In that sense,\nGoldman remains interested in providing a general and substantive\ntheory of justification.\n\nWe have illustrated the way in which an externalist account of\njustified belief can exemplify a foundationalist structure by\nexamining one of the most prominent versions of externalism,\nreliabilism. But other versions of externalism are also implicitly or\nexplicitly committed to a version of foundationalism, or, at the very\nleast, give an account of justification that would enable one to\ndistinguish noninferential from inferential justification, direct from\nindirect knowledge. Consider, for example, a crude version of the\nso-called causal theory of knowledge according to which one knows a\nproposition when one believes it and the belief is caused (in the\n“right” way) by the very fact that makes true what is\nbelieved. On such an account one can distinguish causal chains leading\nto the belief in question that involve intermediate beliefs from those\nthat do not. Using this distinction, one can again define a\ndistinction between foundational and nonfoundational knowledge:\nroughly, the causes of belief that do not include other beliefs are\nthe ones that would be foundational\n knowledge.[8]\n\nExternalist versions of foundationalism are probably attractive to\nmany because they seem to allow at least the possibility of a much\nexpanded foundational base of justified beliefs. Unlike the Cartesian\nview, the reliabilist’s distinction between foundational and\nnon-foundational belief has nothing to do with whether the beliefs\nare somehow infallible or infallibly justified. If nature has been\nco-operative enough to ensure the evolution of cognitive agents who\nrespond to their environmental stimuli with mostly true beliefs, then\nthere might be an enormous store of foundational knowledge upon which\nwe can draw in arriving at inferentially justified conclusions. On\nmost externalist accounts of foundational belief there are literally\nno a priori constraints on what might end up being\nfoundationally justified. Any proposition might have been believed as\nthe result of the operation of some conceivable sort of reliable\nbelief-forming process. Moreover, many epistemologists hold that\njustifiers must in some way be truth-conducive or probable, and the\nrequirement of reliability (or some other such external condition)\nmakes the connection to the truth explicit. In contrast, non-classical\ninternalist foundationalist views like phenomenal conservatism\nthreaten to sever the connection between justification and truth or\nprobability, for it is possible that propositions that seem true are\nmostly false.\n",
    "section_title": "6. Externalist Versions of Foundationalism",
    "entry_title": "Foundationalist Theories of Epistemic Justification",
    "hierarchy_title": "Foundationalist Theories of Epistemic Justification || Externalist Versions of Foundationalism",
    "tokenized_text": [
        "externalist",
        "version",
        "foundationalism",
        "externalist",
        "version",
        "foundationalism",
        "epistemic",
        "landscape",
        "changed",
        "dramatically",
        "last",
        "forty",
        "fifty",
        "year",
        "rise",
        "externalist",
        "epistemology",
        "notoriously",
        "difficult",
        "define",
        "clearly",
        "controversy",
        "internalists",
        "externalists",
        "epistemology",
        "detailed",
        "discussion",
        "alternative",
        "way",
        "defining",
        "controversy",
        "see",
        "fumerton",
        "chs",
        "see",
        "also",
        "entry",
        "internalist",
        "externalist",
        "conception",
        "epistemic",
        "justification",
        "least",
        "two",
        "common",
        "way",
        "understanding",
        "controversy",
        "sometimes",
        "taken",
        "controversy",
        "whether",
        "one",
        "identify",
        "epistemic",
        "property",
        "internal",
        "state",
        "believer",
        "according",
        "view",
        "might",
        "call",
        "internal",
        "state",
        "internalism",
        "sometimes",
        "called",
        "mentalism",
        "justification",
        "analyzed",
        "term",
        "depends",
        "essentially",
        "inside",
        "mind",
        "follows",
        "view",
        "two",
        "individual",
        "internally",
        "mentally",
        "alike",
        "respect",
        "yet",
        "differ",
        "justification",
        "belief",
        "one",
        "sense",
        "externalist",
        "nonmentalist",
        "claim",
        "one",
        "justification",
        "involves",
        "depends",
        "essentially",
        "fact",
        "state",
        "affair",
        "outside",
        "mind",
        "others",
        "take",
        "controversy",
        "center",
        "question",
        "whether",
        "one",
        "requires",
        "certain",
        "sort",
        "access",
        "justification",
        "access",
        "internalist",
        "hold",
        "roughly",
        "justified",
        "believing",
        "p",
        "requires",
        "something",
        "within",
        "least",
        "available",
        "one",
        "perspective",
        "awareness",
        "relevant",
        "truth",
        "justification",
        "p",
        "access",
        "internalists",
        "seem",
        "held",
        "everything",
        "determines",
        "justification",
        "must",
        "accessible",
        "see",
        "hardly",
        "internalists",
        "hold",
        "strong",
        "position",
        "access",
        "externalist",
        "denies",
        "justification",
        "requires",
        "access",
        "access",
        "externalist",
        "need",
        "deny",
        "something",
        "relevant",
        "truth",
        "p",
        "least",
        "sometimes",
        "accessible",
        "subject",
        "justification",
        "p",
        "paradigm",
        "externalists",
        "deny",
        "access",
        "always",
        "required",
        "justification",
        "accept",
        "form",
        "internalism",
        "though",
        "perhaps",
        "take",
        "one",
        "sense",
        "fundamental",
        "example",
        "one",
        "might",
        "take",
        "access",
        "internalism",
        "fundamental",
        "hold",
        "one",
        "access",
        "mental",
        "state",
        "internal",
        "fact",
        "accept",
        "mentalism",
        "consequence",
        "one",
        "might",
        "take",
        "mentalist",
        "thesis",
        "fundamental",
        "argue",
        "one",
        "minimal",
        "access",
        "relevant",
        "mental",
        "fact",
        "accept",
        "form",
        "access",
        "internalism",
        "well",
        "possible",
        "accept",
        "one",
        "form",
        "internalism",
        "reject",
        "mentalists",
        "might",
        "deny",
        "access",
        "mental",
        "state",
        "feature",
        "make",
        "difference",
        "justification",
        "access",
        "internalists",
        "might",
        "hold",
        "directly",
        "aware",
        "external",
        "object",
        "external",
        "state",
        "affair",
        "external",
        "abstract",
        "entity",
        "relation",
        "take",
        "direct",
        "awareness",
        "make",
        "difference",
        "one",
        "justification",
        "would",
        "deny",
        "one",
        "justifier",
        "must",
        "always",
        "mental",
        "though",
        "might",
        "accept",
        "thesis",
        "difference",
        "justification",
        "without",
        "mental",
        "difference",
        "assuming",
        "access",
        "even",
        "nonmental",
        "entity",
        "count",
        "mental",
        "relation",
        "mental",
        "state",
        "access",
        "internalisms",
        "vary",
        "depending",
        "sort",
        "access",
        "required",
        "true",
        "belief",
        "justified",
        "belief",
        "acquaintance",
        "etc",
        "must",
        "accessed",
        "justification",
        "thus",
        "stronger",
        "weaker",
        "form",
        "access",
        "internalism",
        "result",
        "epistemic",
        "landscape",
        "quite",
        "complex",
        "certainly",
        "paradigm",
        "externalists",
        "would",
        "reject",
        "second",
        "clause",
        "pij",
        "according",
        "virtually",
        "externalists",
        "one",
        "arrive",
        "justified",
        "belief",
        "p",
        "inferring",
        "e",
        "without",
        "aware",
        "sort",
        "evidential",
        "connection",
        "e",
        "p",
        "fact",
        "good",
        "evidential",
        "connection",
        "e",
        "p",
        "external",
        "subject",
        "mind",
        "inaccessible",
        "subject",
        "would",
        "also",
        "reject",
        "parallel",
        "principle",
        "noninferential",
        "justification",
        "one",
        "arrive",
        "justified",
        "belief",
        "basis",
        "sensory",
        "beliefindependent",
        "input",
        "without",
        "aware",
        "sort",
        "evidential",
        "connection",
        "input",
        "belief",
        "phenomenal",
        "conservative",
        "dogmatist",
        "tend",
        "agree",
        "paradigm",
        "externalist",
        "rejecting",
        "requirement",
        "one",
        "grasp",
        "connection",
        "one",
        "epistemic",
        "ground",
        "evidence",
        "proposition",
        "believed",
        "though",
        "deny",
        "external",
        "condition",
        "like",
        "reliability",
        "discussed",
        "also",
        "needed",
        "justification",
        "however",
        "externalists",
        "typically",
        "allow",
        "principle",
        "one",
        "could",
        "foundational",
        "belief",
        "absence",
        "appearance",
        "seeming",
        "epistemologist",
        "combined",
        "modest",
        "internal",
        "requirement",
        "externalist",
        "one",
        "account",
        "epistemic",
        "justification",
        "see",
        "example",
        "alston",
        "steup",
        "externalist",
        "defends",
        "radically",
        "different",
        "view",
        "classical",
        "foundationalists",
        "structure",
        "knowledge",
        "justification",
        "emerges",
        "theory",
        "still",
        "often",
        "foundationalist",
        "structure",
        "might",
        "first",
        "illustrate",
        "point",
        "examining",
        "view",
        "defended",
        "prominent",
        "externalists",
        "alvin",
        "goldman",
        "reliabilism",
        "fundamental",
        "idea",
        "behind",
        "reliabilism",
        "strikingly",
        "simple",
        "justified",
        "belief",
        "reliably",
        "produced",
        "belief",
        "reliably",
        "produced",
        "belief",
        "belief",
        "product",
        "reliable",
        "process",
        "reliable",
        "process",
        "one",
        "yield",
        "belief",
        "usually",
        "true",
        "would",
        "usually",
        "true",
        "enough",
        "generated",
        "justified",
        "belief",
        "worth",
        "justified",
        "belief",
        "probably",
        "true",
        "goldman",
        "initially",
        "distinguished",
        "two",
        "importantly",
        "different",
        "sort",
        "justified",
        "beliefsthose",
        "result",
        "beliefindependent",
        "process",
        "result",
        "beliefdependent",
        "process",
        "former",
        "process",
        "take",
        "input",
        "stimulus",
        "belief",
        "latter",
        "belief",
        "produced",
        "process",
        "take",
        "input",
        "least",
        "belief",
        "example",
        "possible",
        "evolved",
        "way",
        "prompted",
        "certain",
        "sensory",
        "input",
        "immediately",
        "unreflectively",
        "reach",
        "conclusion",
        "external",
        "object",
        "may",
        "live",
        "world",
        "belief",
        "external",
        "world",
        "produced",
        "way",
        "usually",
        "true",
        "would",
        "usually",
        "true",
        "enough",
        "generated",
        "belief",
        "justified",
        "virtue",
        "product",
        "reliable",
        "beliefindependent",
        "process",
        "basically",
        "base",
        "clause",
        "reliabilist",
        "analysis",
        "principle",
        "foundational",
        "noninferential",
        "justification",
        "belief",
        "product",
        "reliable",
        "beliefindependent",
        "process",
        "justified",
        "reliabilists",
        "generally",
        "add",
        "condition",
        "requiring",
        "effect",
        "defeaters",
        "available",
        "subjecteg",
        "good",
        "reason",
        "justification",
        "think",
        "belief",
        "false",
        "unreliable",
        "untrustworthy",
        "specifying",
        "needed",
        "defeater",
        "condition",
        "base",
        "clause",
        "without",
        "using",
        "epistemic",
        "term",
        "like",
        "justification",
        "reason",
        "nontrivial",
        "matter",
        "goldman",
        "proposes",
        "adding",
        "condition",
        "reliable",
        "beliefwithholding",
        "process",
        "available",
        "subject",
        "foundational",
        "belief",
        "turn",
        "taken",
        "input",
        "reliable",
        "beliefdependent",
        "process",
        "order",
        "generate",
        "still",
        "justified",
        "belief",
        "beliefdependent",
        "process",
        "conditionally",
        "reliable",
        "output",
        "belief",
        "usually",
        "would",
        "usually",
        "true",
        "relevant",
        "input",
        "belief",
        "true",
        "output",
        "belief",
        "conditionally",
        "reliable",
        "beliefdependent",
        "process",
        "justified",
        "provided",
        "input",
        "belief",
        "justified",
        "basically",
        "recursive",
        "clause",
        "reliabilist",
        "analysis",
        "principle",
        "nonfoundational",
        "inferential",
        "justification",
        "belief",
        "output",
        "conditionally",
        "reliable",
        "beliefdependent",
        "process",
        "input",
        "belief",
        "justified",
        "absent",
        "defeaters",
        "output",
        "belief",
        "justified",
        "crude",
        "sketch",
        "goldman",
        "early",
        "reliabilismhe",
        "later",
        "modified",
        "deal",
        "number",
        "objection",
        "sketch",
        "enough",
        "bring",
        "foundationalist",
        "structure",
        "inherent",
        "reliabilist",
        "account",
        "reliabilist",
        "actually",
        "accepts",
        "first",
        "clause",
        "pij",
        "avoids",
        "epistemic",
        "regress",
        "embracing",
        "kind",
        "justified",
        "belief",
        "owe",
        "justification",
        "justified",
        "belief",
        "undefeated",
        "belief",
        "resulting",
        "reliable",
        "beliefindependent",
        "process",
        "justified",
        "belief",
        "involved",
        "justification",
        "belief",
        "foundational",
        "reliabilism",
        "might",
        "complicate",
        "taxonomy",
        "reliabilists",
        "might",
        "hold",
        "beliefdependent",
        "process",
        "taking",
        "belief",
        "input",
        "provide",
        "justification",
        "without",
        "inferential",
        "process",
        "nothing",
        "reliability",
        "process",
        "requires",
        "involve",
        "anything",
        "like",
        "inference",
        "indeed",
        "perhaps",
        "memorial",
        "process",
        "certain",
        "subconscious",
        "process",
        "conditionally",
        "reliable",
        "provide",
        "justification",
        "absent",
        "defeaters",
        "see",
        "discussing",
        "objection",
        "section",
        "however",
        "might",
        "lead",
        "counterintuitive",
        "consequence",
        "noted",
        "goldman",
        "denies",
        "one",
        "could",
        "give",
        "strict",
        "definition",
        "evaluative",
        "normative",
        "epistemic",
        "term",
        "like",
        "justification",
        "without",
        "using",
        "similar",
        "evaluative",
        "normative",
        "term",
        "still",
        "interested",
        "providing",
        "substantive",
        "condition",
        "condition",
        "specify",
        "nonepistemic",
        "term",
        "belief",
        "justified",
        "sense",
        "goldman",
        "remains",
        "interested",
        "providing",
        "general",
        "substantive",
        "theory",
        "justification",
        "illustrated",
        "way",
        "externalist",
        "account",
        "justified",
        "belief",
        "exemplify",
        "foundationalist",
        "structure",
        "examining",
        "one",
        "prominent",
        "version",
        "externalism",
        "reliabilism",
        "version",
        "externalism",
        "also",
        "implicitly",
        "explicitly",
        "committed",
        "version",
        "foundationalism",
        "least",
        "give",
        "account",
        "justification",
        "would",
        "enable",
        "one",
        "distinguish",
        "noninferential",
        "inferential",
        "justification",
        "direct",
        "indirect",
        "knowledge",
        "consider",
        "example",
        "crude",
        "version",
        "socalled",
        "causal",
        "theory",
        "knowledge",
        "according",
        "one",
        "know",
        "proposition",
        "one",
        "belief",
        "belief",
        "caused",
        "right",
        "way",
        "fact",
        "make",
        "true",
        "believed",
        "account",
        "one",
        "distinguish",
        "causal",
        "chain",
        "leading",
        "belief",
        "question",
        "involve",
        "intermediate",
        "belief",
        "using",
        "distinction",
        "one",
        "define",
        "distinction",
        "foundational",
        "nonfoundational",
        "knowledge",
        "roughly",
        "cause",
        "belief",
        "include",
        "belief",
        "one",
        "would",
        "foundational",
        "knowledge",
        "externalist",
        "version",
        "foundationalism",
        "probably",
        "attractive",
        "many",
        "seem",
        "allow",
        "least",
        "possibility",
        "much",
        "expanded",
        "foundational",
        "base",
        "justified",
        "belief",
        "unlike",
        "cartesian",
        "view",
        "reliabilist",
        "distinction",
        "foundational",
        "nonfoundational",
        "belief",
        "nothing",
        "whether",
        "belief",
        "somehow",
        "infallible",
        "infallibly",
        "justified",
        "nature",
        "cooperative",
        "enough",
        "ensure",
        "evolution",
        "cognitive",
        "agent",
        "respond",
        "environmental",
        "stimulus",
        "mostly",
        "true",
        "belief",
        "might",
        "enormous",
        "store",
        "foundational",
        "knowledge",
        "upon",
        "draw",
        "arriving",
        "inferentially",
        "justified",
        "conclusion",
        "externalist",
        "account",
        "foundational",
        "belief",
        "literally",
        "priori",
        "constraint",
        "might",
        "end",
        "foundationally",
        "justified",
        "proposition",
        "might",
        "believed",
        "result",
        "operation",
        "conceivable",
        "sort",
        "reliable",
        "beliefforming",
        "process",
        "moreover",
        "many",
        "epistemologist",
        "hold",
        "justifier",
        "must",
        "way",
        "truthconducive",
        "probable",
        "requirement",
        "reliability",
        "external",
        "condition",
        "make",
        "connection",
        "truth",
        "explicit",
        "contrast",
        "nonclassical",
        "internalist",
        "foundationalist",
        "view",
        "like",
        "phenomenal",
        "conservatism",
        "threaten",
        "sever",
        "connection",
        "justification",
        "truth",
        "probability",
        "possible",
        "proposition",
        "seem",
        "true",
        "mostly",
        "false"
    ]
}