{
    "main_text": "Internalist Alternatives to Classical Foundationalism\n4. Internalist Alternatives to Classical Foundationalism\n\nWe noted above that at least many philosophers are convinced that\nacceptance of classical foundationalism leads inevitably to an\nunacceptably radical skepticism. Some contemporary epistemologists\nseek a more modest foundationalism that will make it much easier to\nrespond to the skeptic’s arguments. Michael Huemer’s\n(2001) phenomenal conservatism and Jim Pryor’s (2000) dogmatism\nare both views that are far more “permissive” in allowing\nan extensive range of beliefs to have foundational justification. And\ntheir views are not unrelated to Chisholm’s longstanding efforts\n(e.g., 1989) to locate foundational justification for believing\nvarious propositions about one’s past and about one’s\nphysical environment in the character of one’s experiential\nstates.\n\nHuemer offers his view as an improvement on a cruder view once\ndefended by Chisholm (1980) that is often called “epistemic\nconservatism” and sometimes, more aptly, “doxastic\nconservatism.” The doxastic conservative takes the mere fact\nthat you believe some proposition P to provide prima\nfacie justification for believing P. This view does not\nimply that the mere fact that you believe something renders the belief\njustified, for it may be that your belief is prima facie\njustified but not ultima facie justified: if you have\ngood reasons to disbelieve P, or good reasons to think that\nyour belief that P is unreliable or untrustworthy, then your\nbelief is “defeated” and not justified. In other words,\naccording to doxastic conservatism, if S believes that P\nthen, in the absence of defeaters, S has justification for\nbelieving that P. \n\nMany worry that the view is vulnerable to counterexamples, for it\nseems committed to regarding beliefs that clearly have nothing going\nfor them as justified. One of the better counterexamples involves\ncases in which one forms a belief in a proposition one has no evidence\nfor or against. Suppose that despite lacking any evidence for or\nagainst the belief, S somehow comes to believe that there is\nan even number of grains of sand on a particular beach (Foley 1983:\n174–5), or that a particular coin that is tossed and lands out\nof sight has landed “tails” up (Christensen 1994: 74).\nSuppose also that S lacks any defeaters for the belief:\nS has no evidence against the proposition, and is not aware\nof having formed the belief without evidence or in an unreliable way.\nDoxastic conservatism yields the counterintuitive result that this\nbelief is rational or justified. (For an attempt to respond to this\nand related objections on behalf of doxastic conservatism, see McCain\n2008.)\n\nIn any event, most foundationalists sympathetic to internalism prefer\na view according to which a non-belief state provides justification\nfor foundational belief. According to phenomenal\nconservatism, the justifying state is a “seeming” or\n“appearance”: if it seems to S that\nP, then, in the absence of defeaters, S thereby has\nsome degree of justification for believing that P (Huemer\n2001, 2007, 2013; Cullison 2010; Tucker 2010; Skene 2013). These\nappearances come in various sorts: sensory or perceptual, intellectual\nor intuitive, mnemonic, and introspective. Many use the term\n“dogmatism” to refer to the same view, or to the view\nrestricted to some domain, typically to perception: if it\nperceptually seems to S that P,\nthen, in the absence of defeaters, S thereby has some\njustification for believing that P.\n\nIt is worth noting that Pryor himself uses the term\n“dogmatism” to refer to the view that “justification\nis sometimes both immediate and underminable” (2013a: 96), and\nso uses the term in a way that is compatible with the rejection of\nphenomenal conservatism and dogmatism as these terms are generally\nunderstood. While those who accept the principle (whether in its\ngeneral form or as restricted to perceptual seemings) do thereby hold\nthat some states provide immediate but underminable or defeasible\njustification, it is possible to accept that some other states provide\nimmediate but underminable justification and deny that perceptual\nseemings do. However, for simplicity and to follow the more common\nusage, we use the two labels “phenomenal conservatism” and\n“dogmatism” more or less interchangeably in what\nfollows.\n\nThe main motivation for phenomenal conservatism is straightforward. As\nalready noted, the view is far more “permissive” than\nclassical foundationalism in allowing for more extensive foundational\njustification. For example, I believe that there is a cat on my lap,\nthat I had fish for dinner last night, that I feel thirsty, that I am\nthinking about getting a glass of water, that pleasure is good, and\nthat 2 + 3 = 5. Prima facie, it is plausible to say that I\nbelieve these propositions because they seem or appear to be\ntrue—because it seems to me that there is a cat on my lap, that\nI had fish last night, and so on. If I do indeed believe these things\non the basis of these seemings or appearances, and they constitute an\nadequate source of justification, then, in the absence of defeaters, I\nhave justification for these beliefs. And if we deny that they are\ngood sources of justification, then how do we avoid skepticism? As\nHuemer puts it, “if undefeated appearances are not a source of\njustified belief, then how is one to avoid skepticism about the\nexternal world, the past, values, abstract objects, and so on? Unless\nthis challenge can be met, we would be wise to place our trust in the\nappearances….” (2013, p. 349). \n\nWhat exactly are these “seemings” or\n“appearances”? The distinction between seemings and\nbeliefs is typically introduced with examples. Once we are familiar\nwith the Müller-Lyer illusion, we no longer believe that the\nlines are of unequal length even though, in some sense, they still\nappear to be unequal. The same holds for various apparent intuitions\nand apparent memories that we become convinced are false. Moreover,\nbeliefs are subject to epistemic norms and can be supported by\nepistemic reasons, while it doesn’t seem to make sense to say\nthe same of appearances (McCain and Moretti 2021, p. 56–7).\nHuemer and others will claim that seemings cannot be identified with\ndispositions to believe, inclinations to believe, or impulses to\nbelieve, though not everyone will agree about this. Huemer argues for\nthis on three main grounds (2007: 30–1). First, it is possible\nto have a persisting seeming or appearance (e.g., that one line is\nlonger than another, or that a stick submerged in water is bent) but\nbe so convinced that it is a mere illusion that you have no\ndisposition or inclination to believe it. Second, it is possible to be\ninclined to believe that P (because, e.g., you really want it\nto be true) in the absence of a corresponding seeming that P.\nThird, appearances can provide non-trivial explanations for what we\nbelieve or what we are disposed to believe: I am inclined to believe\nthat there is a bus approaching because it perceptually seems that\nthere is; understanding the latter seeming as an inclination to\nbelieve trivializes the explanation. Some have pointed out, however,\nthat many problems raised with doxastic accounts of appearances can be\navoided by understanding appearances as beliefs or inclinations to\nbelieve with different contents. According to Glüer (2018)\nperceptual appearances might be understood as beliefs to the effect\nthat something looks some way. And according to Conee (2013)\nand Tooley (2013), seemings can be understood as felt inclinations to\nbelieve that some state is evidence for P.\n\nProponents of phenomenal conservatism and dogmatism generally hold\nthat seemings are a kind of experience distinct from beliefs and\ninclinations to believe. But they also hold that seemings are\nnevertheless belief-like in that they are propositional attitudes or\nat least have propositional or representational contents. And they\nhold that seemings have a distinctive phenomenal character: seemings\nare “assertive” (Huemer 2013); they have a\n“phenomenal force” to them such that “it\n‘feels as if’ we can just tell that those propositions are\ntrue…just by virtue of having them so represented” (Pryor\n2000, p. 547, n. 23); “a seeming that P\n‘recommends’ P as true or ‘assures’\nthe subject of P’s truth” (Tucker 2013). There is an\ninteresting disagreement among those who are take seemings to be a\nkind of experience, a disagreement that exists even among those who\nare sympathetic to phenomenal conservatism or dogmatism in some form.\nThe disagreement concerns the relationship between seemings and\nsensations or sensory experiences. According to some (e.g., Huemer\n2001, Ch. 4 and Tolhurst 1998) sensations are themselves a kind or\nspecies of seeming—perceptual seemings—while others (e.g.,\nTucker 2010, Brogaard 2013) take sensations to be distinct from\nperceptual seemings, though often accompanied by them. (For more on\nthe relationship between sensations and seemings, see Tucker 2013, pp.\n7–8.) Some have argued that any appearance-based theory of\njustification should accept that other features accompanying\nappearances can affect whether and how strongly they might justify\nbeliefs (Reiland 2015, Brogaard and Gatzia 2018, McCain and Moretti\n2021).\n\nSome have pointed out that attempting to capture the phenomenal\ncharacter of seemings by saying they are “assertive” is\npotentially misleading given that judgments and beliefs are assertive\nand seemings are supposed to be non-doxastic experiential states\n(Smithies 2019, p. 93, McAllister 2018, p. 3082), and something\nsimilar might be said of the claim that seemings\n“recommend” or “assure” us of their truth.\nSome find the appeal to phenomenal force obscure (Conee 2013 and\nTooley 2013), while many others take something like phenomenal force\nto be an important and familiar, if difficult to describe, feature of\nmental states (e.g., Pryor 2000, Makie 2013, McGrath 2013, Skene 2013,\nMcAllister 2018, Moretti and McCain 2021). \n\nBoth Huemer and Pryor make clear that the intentional states that\nprovide justification do so without one’s having to be aware of\nthe fact that one is in such states. They might both allow, however,\nthat one can turn one’s attention inward to discover the fact\nthat one is in such states, and that one can, in principle, discover\n(perhaps a priori) that the states in question do give one\nthe relevant epistemic justification.\n",
    "section_title": "4. Internalist Alternatives to Classical Foundationalism",
    "entry_title": "Foundationalist Theories of Epistemic Justification",
    "hierarchy_title": "Foundationalist Theories of Epistemic Justification || Internalist Alternatives to Classical Foundationalism",
    "tokenized_text": [
        "internalist",
        "alternative",
        "classical",
        "foundationalism",
        "internalist",
        "alternative",
        "classical",
        "foundationalism",
        "noted",
        "least",
        "many",
        "philosopher",
        "convinced",
        "acceptance",
        "classical",
        "foundationalism",
        "lead",
        "inevitably",
        "unacceptably",
        "radical",
        "skepticism",
        "contemporary",
        "epistemologist",
        "seek",
        "modest",
        "foundationalism",
        "make",
        "much",
        "easier",
        "respond",
        "skeptic",
        "argument",
        "michael",
        "huemer",
        "phenomenal",
        "conservatism",
        "jim",
        "pryor",
        "dogmatism",
        "view",
        "far",
        "permissive",
        "allowing",
        "extensive",
        "range",
        "belief",
        "foundational",
        "justification",
        "view",
        "unrelated",
        "chisholm",
        "longstanding",
        "effort",
        "eg",
        "locate",
        "foundational",
        "justification",
        "believing",
        "various",
        "proposition",
        "one",
        "past",
        "one",
        "physical",
        "environment",
        "character",
        "one",
        "experiential",
        "state",
        "huemer",
        "offer",
        "view",
        "improvement",
        "cruder",
        "view",
        "defended",
        "chisholm",
        "often",
        "called",
        "epistemic",
        "conservatism",
        "sometimes",
        "aptly",
        "doxastic",
        "conservatism",
        "doxastic",
        "conservative",
        "take",
        "mere",
        "fact",
        "believe",
        "proposition",
        "p",
        "provide",
        "prima",
        "facie",
        "justification",
        "believing",
        "p",
        "view",
        "imply",
        "mere",
        "fact",
        "believe",
        "something",
        "render",
        "belief",
        "justified",
        "may",
        "belief",
        "prima",
        "facie",
        "justified",
        "ultima",
        "facie",
        "justified",
        "good",
        "reason",
        "disbelieve",
        "p",
        "good",
        "reason",
        "think",
        "belief",
        "p",
        "unreliable",
        "untrustworthy",
        "belief",
        "defeated",
        "justified",
        "word",
        "according",
        "doxastic",
        "conservatism",
        "belief",
        "p",
        "absence",
        "defeaters",
        "justification",
        "believing",
        "p",
        "many",
        "worry",
        "view",
        "vulnerable",
        "counterexample",
        "seems",
        "committed",
        "regarding",
        "belief",
        "clearly",
        "nothing",
        "going",
        "justified",
        "one",
        "better",
        "counterexample",
        "involves",
        "case",
        "one",
        "form",
        "belief",
        "proposition",
        "one",
        "evidence",
        "suppose",
        "despite",
        "lacking",
        "evidence",
        "belief",
        "somehow",
        "come",
        "believe",
        "even",
        "number",
        "grain",
        "sand",
        "particular",
        "beach",
        "foley",
        "particular",
        "coin",
        "tossed",
        "land",
        "sight",
        "landed",
        "tail",
        "christensen",
        "suppose",
        "also",
        "lack",
        "defeaters",
        "belief",
        "evidence",
        "proposition",
        "aware",
        "formed",
        "belief",
        "without",
        "evidence",
        "unreliable",
        "way",
        "doxastic",
        "conservatism",
        "yield",
        "counterintuitive",
        "result",
        "belief",
        "rational",
        "justified",
        "attempt",
        "respond",
        "related",
        "objection",
        "behalf",
        "doxastic",
        "conservatism",
        "see",
        "mccain",
        "event",
        "foundationalists",
        "sympathetic",
        "internalism",
        "prefer",
        "view",
        "according",
        "nonbelief",
        "state",
        "provides",
        "justification",
        "foundational",
        "belief",
        "according",
        "phenomenal",
        "conservatism",
        "justifying",
        "state",
        "seeming",
        "appearance",
        "seems",
        "p",
        "absence",
        "defeaters",
        "thereby",
        "degree",
        "justification",
        "believing",
        "p",
        "huemer",
        "cullison",
        "tucker",
        "skene",
        "appearance",
        "come",
        "various",
        "sort",
        "sensory",
        "perceptual",
        "intellectual",
        "intuitive",
        "mnemonic",
        "introspective",
        "many",
        "use",
        "term",
        "dogmatism",
        "refer",
        "view",
        "view",
        "restricted",
        "domain",
        "typically",
        "perception",
        "perceptually",
        "seems",
        "p",
        "absence",
        "defeaters",
        "thereby",
        "justification",
        "believing",
        "p",
        "worth",
        "noting",
        "pryor",
        "us",
        "term",
        "dogmatism",
        "refer",
        "view",
        "justification",
        "sometimes",
        "immediate",
        "underminable",
        "a",
        "us",
        "term",
        "way",
        "compatible",
        "rejection",
        "phenomenal",
        "conservatism",
        "dogmatism",
        "term",
        "generally",
        "understood",
        "accept",
        "principle",
        "whether",
        "general",
        "form",
        "restricted",
        "perceptual",
        "seemings",
        "thereby",
        "hold",
        "state",
        "provide",
        "immediate",
        "underminable",
        "defeasible",
        "justification",
        "possible",
        "accept",
        "state",
        "provide",
        "immediate",
        "underminable",
        "justification",
        "deny",
        "perceptual",
        "seemings",
        "however",
        "simplicity",
        "follow",
        "common",
        "usage",
        "use",
        "two",
        "label",
        "phenomenal",
        "conservatism",
        "dogmatism",
        "le",
        "interchangeably",
        "follows",
        "main",
        "motivation",
        "phenomenal",
        "conservatism",
        "straightforward",
        "already",
        "noted",
        "view",
        "far",
        "permissive",
        "classical",
        "foundationalism",
        "allowing",
        "extensive",
        "foundational",
        "justification",
        "example",
        "believe",
        "cat",
        "lap",
        "fish",
        "dinner",
        "last",
        "night",
        "feel",
        "thirsty",
        "thinking",
        "getting",
        "glass",
        "water",
        "pleasure",
        "good",
        "prima",
        "facie",
        "plausible",
        "say",
        "believe",
        "proposition",
        "seem",
        "appear",
        "truebecause",
        "seems",
        "cat",
        "lap",
        "fish",
        "last",
        "night",
        "indeed",
        "believe",
        "thing",
        "basis",
        "seemings",
        "appearance",
        "constitute",
        "adequate",
        "source",
        "justification",
        "absence",
        "defeaters",
        "justification",
        "belief",
        "deny",
        "good",
        "source",
        "justification",
        "avoid",
        "skepticism",
        "huemer",
        "put",
        "undefeated",
        "appearance",
        "source",
        "justified",
        "belief",
        "one",
        "avoid",
        "skepticism",
        "external",
        "world",
        "past",
        "value",
        "abstract",
        "object",
        "unless",
        "challenge",
        "met",
        "would",
        "wise",
        "place",
        "trust",
        "appearances",
        "p",
        "exactly",
        "seemings",
        "appearance",
        "distinction",
        "seemings",
        "belief",
        "typically",
        "introduced",
        "example",
        "familiar",
        "müllerlyer",
        "illusion",
        "longer",
        "believe",
        "line",
        "unequal",
        "length",
        "even",
        "though",
        "sense",
        "still",
        "appear",
        "unequal",
        "hold",
        "various",
        "apparent",
        "intuition",
        "apparent",
        "memory",
        "become",
        "convinced",
        "false",
        "moreover",
        "belief",
        "subject",
        "epistemic",
        "norm",
        "supported",
        "epistemic",
        "reason",
        "seem",
        "make",
        "sense",
        "say",
        "appearance",
        "mccain",
        "moretti",
        "p",
        "huemer",
        "others",
        "claim",
        "seemings",
        "identified",
        "disposition",
        "believe",
        "inclination",
        "believe",
        "impulse",
        "believe",
        "though",
        "everyone",
        "agree",
        "huemer",
        "argues",
        "three",
        "main",
        "ground",
        "first",
        "possible",
        "persisting",
        "seeming",
        "appearance",
        "eg",
        "one",
        "line",
        "longer",
        "another",
        "stick",
        "submerged",
        "water",
        "bent",
        "convinced",
        "mere",
        "illusion",
        "disposition",
        "inclination",
        "believe",
        "second",
        "possible",
        "inclined",
        "believe",
        "p",
        "eg",
        "really",
        "want",
        "true",
        "absence",
        "corresponding",
        "seeming",
        "p",
        "third",
        "appearance",
        "provide",
        "nontrivial",
        "explanation",
        "believe",
        "disposed",
        "believe",
        "inclined",
        "believe",
        "bus",
        "approaching",
        "perceptually",
        "seems",
        "understanding",
        "latter",
        "seeming",
        "inclination",
        "believe",
        "trivializes",
        "explanation",
        "pointed",
        "however",
        "many",
        "problem",
        "raised",
        "doxastic",
        "account",
        "appearance",
        "avoided",
        "understanding",
        "appearance",
        "belief",
        "inclination",
        "believe",
        "different",
        "content",
        "according",
        "glüer",
        "perceptual",
        "appearance",
        "might",
        "understood",
        "belief",
        "effect",
        "something",
        "look",
        "way",
        "according",
        "conee",
        "tooley",
        "seemings",
        "understood",
        "felt",
        "inclination",
        "believe",
        "state",
        "evidence",
        "p",
        "proponent",
        "phenomenal",
        "conservatism",
        "dogmatism",
        "generally",
        "hold",
        "seemings",
        "kind",
        "experience",
        "distinct",
        "belief",
        "inclination",
        "believe",
        "also",
        "hold",
        "seemings",
        "nevertheless",
        "belieflike",
        "propositional",
        "attitude",
        "least",
        "propositional",
        "representational",
        "content",
        "hold",
        "seemings",
        "distinctive",
        "phenomenal",
        "character",
        "seemings",
        "assertive",
        "huemer",
        "phenomenal",
        "force",
        "feel",
        "tell",
        "proposition",
        "truejust",
        "virtue",
        "represented",
        "pryor",
        "p",
        "n",
        "seeming",
        "p",
        "recommends",
        "p",
        "true",
        "assures",
        "subject",
        "p",
        "truth",
        "tucker",
        "interesting",
        "disagreement",
        "among",
        "take",
        "seemings",
        "kind",
        "experience",
        "disagreement",
        "exists",
        "even",
        "among",
        "sympathetic",
        "phenomenal",
        "conservatism",
        "dogmatism",
        "form",
        "disagreement",
        "concern",
        "relationship",
        "seemings",
        "sensation",
        "sensory",
        "experience",
        "according",
        "eg",
        "huemer",
        "ch",
        "tolhurst",
        "sensation",
        "kind",
        "specie",
        "seemingperceptual",
        "seemingswhile",
        "others",
        "eg",
        "tucker",
        "brogaard",
        "take",
        "sensation",
        "distinct",
        "perceptual",
        "seemings",
        "though",
        "often",
        "accompanied",
        "relationship",
        "sensation",
        "seemings",
        "see",
        "tucker",
        "pp",
        "argued",
        "appearancebased",
        "theory",
        "justification",
        "accept",
        "feature",
        "accompanying",
        "appearance",
        "affect",
        "whether",
        "strongly",
        "might",
        "justify",
        "belief",
        "reiland",
        "brogaard",
        "gatzia",
        "mccain",
        "moretti",
        "pointed",
        "attempting",
        "capture",
        "phenomenal",
        "character",
        "seemings",
        "saying",
        "assertive",
        "potentially",
        "misleading",
        "given",
        "judgment",
        "belief",
        "assertive",
        "seemings",
        "supposed",
        "nondoxastic",
        "experiential",
        "state",
        "smithy",
        "p",
        "mcallister",
        "p",
        "something",
        "similar",
        "might",
        "said",
        "claim",
        "seemings",
        "recommend",
        "assure",
        "u",
        "truth",
        "find",
        "appeal",
        "phenomenal",
        "force",
        "obscure",
        "conee",
        "tooley",
        "many",
        "others",
        "take",
        "something",
        "like",
        "phenomenal",
        "force",
        "important",
        "familiar",
        "difficult",
        "describe",
        "feature",
        "mental",
        "state",
        "eg",
        "pryor",
        "makie",
        "mcgrath",
        "skene",
        "mcallister",
        "moretti",
        "mccain",
        "huemer",
        "pryor",
        "make",
        "clear",
        "intentional",
        "state",
        "provide",
        "justification",
        "without",
        "one",
        "aware",
        "fact",
        "one",
        "state",
        "might",
        "allow",
        "however",
        "one",
        "turn",
        "one",
        "attention",
        "inward",
        "discover",
        "fact",
        "one",
        "state",
        "one",
        "principle",
        "discover",
        "perhaps",
        "priori",
        "state",
        "question",
        "give",
        "one",
        "relevant",
        "epistemic",
        "justification"
    ]
}