{
    "main_text": "History || Medieval and Modern\n1.2 Medieval and Modern\n\nThe legacy of the ancients — Aristotle in particular —\ncontinued into the medieval period, notably in the work of Thomas\nAquinas, who appropriated much of Aristotle’s philosophy while\nsetting it into a Christian theological framework. As in Aristotle,\nvirtue and virtues are prominent parts of his ethical theory. And,\nlike Aristotle justice is an important virtue, though for Aquinas it\nless important than the virtue of charity, a Christian virtue that did\nnot appear among the virtues recognized by Aristotle. There are other\nelements of his account that situate it in an interesting way in the\ntransition from ancient eudaimonist accounts of virtue, to virtue as\nit appears in the modern era, before it recedes from prominence in\nethical theory.\n\nBut to the extent Christian writers allied themselves with Plato and\nAristotle, they were downplaying another central element in Christian\nthought and morality, the emphasis on agapic love. Such love seems to\nbe a matter of motivationally active feeling rather than of being\nrational, and some writers on morality (eventually) allowed this side\nof Christianity to have a major influence on what they had to say\nabout virtue.\n\nSignificant elements of the Aristotelian account of justice reappear\nin Aquinas’. First, justice is first and foremost a virtue of\ncharacter rather than institutions, although Aquinas draws a\ndistinction among such virtues not found in Aristotle. For Aquinas,\njustice as a virtue is a matter of perfection of the will, rather than\nthe passions (ST II-II 58.4). Aquinas offers no account of justice as\na virtue of societies or institutions, though he interprets the\n“general” sense of justice he borrows from Aristotle as being a\nmatter of individual willing and action for the common good.\n“Particular” justice, which as in Aristotle’s account is most of\nhis focus, has to do with relationships -- in particular but not\nlimited to exchange -- between individuals as individuals (ST II-II\n58.8). \n\nSecond, Aquinas grounds the norms for these exchanges in the ancient\nformula of Justinian, which hearkens back to Plato: justice is giving\neach his own. But his interpretation of this formula situates him\nastride a deep but subtle divide between ancient and modern thought.\nTo some extent this effect is an upshot of his inheriting not only the\nGreek eudaimonist tradition, but also a Roman jurisprudential\ntradition in which notions like standing and right as claim (rather\nthan, say, fairness) had begun to emerge (Porter 2016, p. 143). As a\nresult, Aquinas’ synergistic account has some novel\ncomplications.\n\nOne major complication, relative to the ancient accounts, is that what\nis ours by right is a recognition of a kind of status, as an effect of\nthe order among people ordained by God (ST I-II 100.8). As\nJean Porter points out, this establishes a normative standard for\njustice that does not grow out of the agent’s own perfection or\neudaimonia (Porter 2016, p. 157). There are two significant follow-on\nimplications.\n\nFirst, the fabric of the eudaimonist approach to practical reasoning\nand life — inherited from the Greeks — begins to fray. For\nbetter or worse, on the Greek eudaimonist views (including here Plato,\nAristotle, the Stoics, and Epicurus) our reasons for action arise from\nour interest in a happy life. If the reason-giving nature of others\narises from a different source, as this reading of Aquinas suggests,\nthen practical reason seems to have a duality of ultimate sources,\nwith the complications that kind of duality brings.\n\nSecond, this is the first step in the diminution of the theoretical\nsignificance of the virtues — a process that will not begin to\nbe reversed until the middle of the 20th century. On Aristotle’s\nview, for example, the virtuous person sees reasons for acting that\nthe non-virtuous do not (and that arguably are not there to be seen\nabsent the effects of virtue — LeBar 2013; Berryman 2019).\nVirtue is no longer the normative epicenter of the theory, as it was\nfor the Greeks. To the extent that this aspect of Aquinas’s view has\nvirtue responsive to value or reasons that is accounted for in some\nway other than the work of virtue, it is the leading edge of process\nthat will result in a much-reduced role for virtue in later ethical\naccounts\n\nHume is an excellent exemplar of this point, in both the\nTreatise and the Enquiries. Virtue, Hume maintains,\nis a matter of “some quality or character,” produced in one by\n“durable principles of the mind” (T III.iii.I, p. 575).\nWe deem such qualities virtues not, as on the ancient Greek view,\nbecause they conduce to the happiness of the person who has them, but\nbecause they have a “tendency to the good of mankind” or society.\n(T III.iii.I). This service renders them pleasing to our\n“moral tastes:” our approbation, Hume tells us, has its source in\n“view of a character, which is naturally fitted to be useful to\nothers, or to the person himself, or which is agreeable to others, or\nto the person himself” (T III.iii.I, 591). We can think of\nthat as the criterion some quality of character must have to be deemed\na virtue. In consequence, what counts as virtuous is an upshot of, and\nnot the source of, the normative foundations of this view.\n\nBy Hume’s time the content of justice as a virtue has\nshifted as well. In Hume’s treatment, the focus of justice is\nproperty — relations of “mine and thine.” It is a\n“cautious, jealous” virtue in the sense that it is focused on the\nsorts of exclusionary powers that are characteristic of property rules\nand relations. We may always be aspiring for more but justice aims at\nthe preservation and security of what one has already (E\nIII.1, p. 184). So the virtue of justice, as Hume thinks of it, will\nin the main consist of a quality in one which disposes one to observe\nand uphold these rules. \n\nWhat Hume wants to show is, first, that we can have such a disposition\nor quality (that is, that it is possible for us to have a quality or\ncharacter to observe the rules of justice), and, second, that such a\nquality would count as a virtue, given his criteria. His approach to\nthese questions in the Treatise is framed by a problem he has\nset up himself. To appreciate that problem, we have to step back to\nHume’s broader view about moral motivation. Hume had argued that\nmoral principles “are not conclusions of our reason” (T\nIII.i.I); instead, they are “more properly felt than judg’d of”\n(T III.i.II). Morality, and virtue, is a matter of sentiments\nor passions. Why? Hume marshals a number of arguments to this effect\nwhich are not relevant to our purposes. The basic reason is that the\nfunctional roles of reason and the passions are markedly different, in\nHume’s view. The task of reason is to discover truth or falsehood,\nin “relations of ideas” or “matters of facts” (T\nIII.i.I); as such, it utterly lacks the capacity to move us to action.\nOnly the passions can do that (T II.iii.III). The passions,\non the other hand, have no representational content whatsoever; they\nare “original existences” (T II.iii.III; III.i.I). Virtue\nis paradigmatically a practical matter: it is a property of what we\ndo, and to act we must be motivated. That means any successful account\nof virtue must find it in our passions, not in any aspect of our\nreason (T III.i.I). So far so good.\n\nHowever, when we come to justice, we look in vain for a passion that\ncan supply motive power for us to act justly. If anything, our natural\nmotives move us away from justice (T III.ii.II). Self-love\nrequires “correcting and restraining” (T III.ii.I). And\nonly a passion can do that. But which? Hume himself dismisses the\npossibilities of public or private beneficence or universal love. In\nthe end he concludes that there is no natural passion to explain it.\nInstead, it is in a certain crucial sense artificial (T\nIII.ii.VI). Under certain conditions, given that we are sensible of\nthe advantages of living in human society, our self-love or\nself-interest may be given an “alteration of its direction,” and\ninduce us to respect the rules of justice. These Hume thinks of\nprimarily as involving honesty and “particular” property\nrules (T III.ii.II). That “alteration” needs\nexplanation.\n\nTwo facts about the conditions in which we act — one about us,\none about our environment — set this alteration in motion.\nFirst, Hume maintains, we are limited in our generosity or\nbenevolence. And second, we live in conditions of scarcity (T\nIII.ii.II). We have to work to make a go of it, and we cannot count on\nothers to do so for us. We need control of our world to meet our\nneeds, but we are vulnerable to the selfishness and predation of\nothers.\n\nThe solution, Hume argues, is that we naturally fall into a\n“convention” by which we observe that rules of property —\nthe observance of which is key to the virtue of justice — is\ngood for all of us. This convention is no formal agreement; Hume\nargues that it cannot be something like the product of promise or\ncompact (T III.ii.II). Instead, “it arises gradually, and\nacquires force by a slow progression, and by our repeated experience\nof the inconveniences of transgressing it” (T III.ii.II, p.\n490). Much as two men pulling the oars in a boat together need no\nexplicit agreement to find they prosper by such an arrangement, so do\nwe generally. (Wilson 2018 explores support for Hume’s\nhypothesis through work in experimental economics.) So in the end it\nis self-interest that drives us to comply with the requirements of\njustice, though Hume adds that sympathy with the public interest\ninduces our endorsement of it once justice has become established.\nThis endorsement, however, is reserved for a scheme of property rules\ntaken generally; as Hume observes, individual instances of compliance\nmay frequently be “contrary to public interest,” though such\ncompliance is still required of us. Hume believes the benefit of the\nsystem overall, both to society and to individual, requires that rules\nnot admit of exceptions (T III.ii.II, E Appendix\nIII, §256). Self-interest accounts for the possibility of our being\nmotivated to act as the virtue of justice requires, and both the\nutility and the agreeableness, both to ourselves and others, of a\nresulting social order with respected property rules, leads to our\napprobation of that motivation as a virtue. \n\nIn fact, this point — that “public utility is the sole origin\nof justice” — is the point of Hume’s discussion of justice\nin the Enquiries (III.I, ¶145). Scarcity imposes a need for\nus to distinguish mine from thine, and we have not sufficient\ngenerosity in our natures to do without property rules (as we might,\nsay, in our families). And once again Hume argues that our recognition\nof the utility and necessity of justice provides “entire command\nover our sentiments” (E III.II, ¶163).As David Johnston\nobserves (Johnston 2011, p. 138), Hume’s understanding of the\nvalue of justice as instrumental in the promotion of utility marks a\nsharp shift from earlier understandings which invoked various forms of\nreciprocity in understanding that value.\n\nSuch a sentimentalist account of justice is also found in Adam Smith;\nin fact, a focus on the sentiments almost completely swamps concern\nfor virtue. Our judgments of virtue and vice, he says, are compounded\nby consideration of two different “relations” in a sentiment:\n“the cause or object which excites or causes it, and … the end\nwhich it proposes” (TMS II.i.introduction). His focus on those two\n“relations” obviates any independent discussion of virtue per se.\nHe does however explicitly countenance a virtue of justice, developed\nin contrast with the virtue of beneficence. In Smith, even more\nclearly than in Hume, one can see that this virtue consists in\nconformity to “rules” or “laws” of justice that appear to\nexist antecedently to the realization of the virtue itself, unlike\nancient accounts. Smith indicates that justice merits resentment when\nabsent, that it may be “extorted by force,” and that in the main\nit requires forbearing from harming others.. Smith calls justice a\n“negative virtue” in this respect: often all it requires is that\nwe sit still and do nothing (Smith 1759, II.ii.I.5, 9). It is\nessential to the subsistence of society, Smith tells us (Smith 1759,\nII.ii.3.3-4), but — in contrast to Hume — is not reducible\nin its motivational basis to regard for society. Instead, our just\nconcern for “multitudes” is compounded of our concern for\nindividuals, which arises from “fellow-feeling,” which is yet\nshort of “love, esteem, and affection” (Smith 1759, II.ii.3.7).\n\n\nIn Kant, finally, along with a movement away from sentimentalism we\nsee the completion of the distinction between justice as a virtue and\njustice as a norm to which a virtue may or may not correspond. While\nKant has a theory (or “doctrine”) of virtue, he distinguishes that\ntheory precisely against a counterpoised theory of justice. The two\nare complementary elements in the “metaphysics of morals.”\nMoreover, the doctrine of justice itself has two parts, roughly\ncorresponding to the distinction present since Plato’s work, between\nthe role of justice in the individual and the role of justice in the\nstate. Kant calls these “private right” and “public right,”\nrespectively. But right in either case is not how Kant at least\nconceives of virtue; instead, right is a “condition” that can\nobtain between the moral agents comprising a moral or legal community,\nin virtue of their principles of choice in acting (Kant 1797). Little\nremains here of the notion of justice as a virtue of individuals as it\nbegan with the ancient Greeks.\n",
    "section_title": "1.2 Medieval and Modern",
    "entry_title": "Justice as a Virtue",
    "hierarchy_title": "Justice as a Virtue || History || Medieval and Modern",
    "tokenized_text": [
        "history",
        "medieval",
        "modern",
        "medieval",
        "modern",
        "legacy",
        "ancient",
        "aristotle",
        "particular",
        "continued",
        "medieval",
        "period",
        "notably",
        "work",
        "thomas",
        "aquinas",
        "appropriated",
        "much",
        "aristotle",
        "philosophy",
        "setting",
        "christian",
        "theological",
        "framework",
        "aristotle",
        "virtue",
        "virtue",
        "prominent",
        "part",
        "ethical",
        "theory",
        "like",
        "aristotle",
        "justice",
        "important",
        "virtue",
        "though",
        "aquinas",
        "le",
        "important",
        "virtue",
        "charity",
        "christian",
        "virtue",
        "appear",
        "among",
        "virtue",
        "recognized",
        "aristotle",
        "element",
        "account",
        "situate",
        "interesting",
        "way",
        "transition",
        "ancient",
        "eudaimonist",
        "account",
        "virtue",
        "virtue",
        "appears",
        "modern",
        "era",
        "recedes",
        "prominence",
        "ethical",
        "theory",
        "extent",
        "christian",
        "writer",
        "allied",
        "plato",
        "aristotle",
        "downplaying",
        "another",
        "central",
        "element",
        "christian",
        "thought",
        "morality",
        "emphasis",
        "agapic",
        "love",
        "love",
        "seems",
        "matter",
        "motivationally",
        "active",
        "feeling",
        "rather",
        "rational",
        "writer",
        "morality",
        "eventually",
        "allowed",
        "side",
        "christianity",
        "major",
        "influence",
        "say",
        "virtue",
        "significant",
        "element",
        "aristotelian",
        "account",
        "justice",
        "reappear",
        "aquinas",
        "first",
        "justice",
        "first",
        "foremost",
        "virtue",
        "character",
        "rather",
        "institution",
        "although",
        "aquinas",
        "draw",
        "distinction",
        "among",
        "virtue",
        "found",
        "aristotle",
        "aquinas",
        "justice",
        "virtue",
        "matter",
        "perfection",
        "rather",
        "passion",
        "st",
        "iiii",
        "aquinas",
        "offer",
        "account",
        "justice",
        "virtue",
        "society",
        "institution",
        "though",
        "interprets",
        "general",
        "sense",
        "justice",
        "borrows",
        "aristotle",
        "matter",
        "individual",
        "willing",
        "action",
        "common",
        "good",
        "particular",
        "justice",
        "aristotle",
        "account",
        "focus",
        "relationship",
        "particular",
        "limited",
        "exchange",
        "individual",
        "individual",
        "st",
        "iiii",
        "second",
        "aquinas",
        "ground",
        "norm",
        "exchange",
        "ancient",
        "formula",
        "justinian",
        "hearkens",
        "back",
        "plato",
        "justice",
        "giving",
        "interpretation",
        "formula",
        "situates",
        "astride",
        "deep",
        "subtle",
        "divide",
        "ancient",
        "modern",
        "thought",
        "extent",
        "effect",
        "upshot",
        "inheriting",
        "greek",
        "eudaimonist",
        "tradition",
        "also",
        "roman",
        "jurisprudential",
        "tradition",
        "notion",
        "like",
        "standing",
        "right",
        "claim",
        "rather",
        "say",
        "fairness",
        "begun",
        "emerge",
        "porter",
        "p",
        "result",
        "aquinas",
        "synergistic",
        "account",
        "novel",
        "complication",
        "one",
        "major",
        "complication",
        "relative",
        "ancient",
        "account",
        "right",
        "recognition",
        "kind",
        "status",
        "effect",
        "order",
        "among",
        "people",
        "ordained",
        "god",
        "st",
        "iii",
        "jean",
        "porter",
        "point",
        "establishes",
        "normative",
        "standard",
        "justice",
        "grow",
        "agent",
        "perfection",
        "eudaimonia",
        "porter",
        "p",
        "two",
        "significant",
        "followon",
        "implication",
        "first",
        "fabric",
        "eudaimonist",
        "approach",
        "practical",
        "reasoning",
        "life",
        "inherited",
        "greek",
        "begin",
        "fray",
        "better",
        "worse",
        "greek",
        "eudaimonist",
        "view",
        "including",
        "plato",
        "aristotle",
        "stoic",
        "epicurus",
        "reason",
        "action",
        "arise",
        "interest",
        "happy",
        "life",
        "reasongiving",
        "nature",
        "others",
        "arises",
        "different",
        "source",
        "reading",
        "aquinas",
        "suggests",
        "practical",
        "reason",
        "seems",
        "duality",
        "ultimate",
        "source",
        "complication",
        "kind",
        "duality",
        "brings",
        "second",
        "first",
        "step",
        "diminution",
        "theoretical",
        "significance",
        "virtue",
        "process",
        "begin",
        "reversed",
        "middle",
        "th",
        "century",
        "aristotle",
        "view",
        "example",
        "virtuous",
        "person",
        "see",
        "reason",
        "acting",
        "nonvirtuous",
        "arguably",
        "seen",
        "absent",
        "effect",
        "virtue",
        "lebar",
        "berryman",
        "virtue",
        "longer",
        "normative",
        "epicenter",
        "theory",
        "greek",
        "extent",
        "aspect",
        "aquinas",
        "view",
        "virtue",
        "responsive",
        "value",
        "reason",
        "accounted",
        "way",
        "work",
        "virtue",
        "leading",
        "edge",
        "process",
        "result",
        "muchreduced",
        "role",
        "virtue",
        "later",
        "ethical",
        "account",
        "hume",
        "excellent",
        "exemplar",
        "point",
        "treatise",
        "enquiry",
        "virtue",
        "hume",
        "maintains",
        "matter",
        "quality",
        "character",
        "produced",
        "one",
        "durable",
        "principle",
        "mind",
        "iiiiiii",
        "p",
        "deem",
        "quality",
        "virtue",
        "ancient",
        "greek",
        "view",
        "conduce",
        "happiness",
        "person",
        "tendency",
        "good",
        "mankind",
        "society",
        "iiiiiii",
        "service",
        "render",
        "pleasing",
        "moral",
        "taste",
        "approbation",
        "hume",
        "tell",
        "u",
        "source",
        "view",
        "character",
        "naturally",
        "fitted",
        "useful",
        "others",
        "person",
        "agreeable",
        "others",
        "person",
        "iiiiiii",
        "think",
        "criterion",
        "quality",
        "character",
        "must",
        "deemed",
        "virtue",
        "consequence",
        "count",
        "virtuous",
        "upshot",
        "source",
        "normative",
        "foundation",
        "view",
        "hume",
        "time",
        "content",
        "justice",
        "virtue",
        "shifted",
        "well",
        "hume",
        "treatment",
        "focus",
        "justice",
        "property",
        "relation",
        "mine",
        "thine",
        "cautious",
        "jealous",
        "virtue",
        "sense",
        "focused",
        "sort",
        "exclusionary",
        "power",
        "characteristic",
        "property",
        "rule",
        "relation",
        "may",
        "always",
        "aspiring",
        "justice",
        "aim",
        "preservation",
        "security",
        "one",
        "already",
        "e",
        "iii",
        "p",
        "virtue",
        "justice",
        "hume",
        "think",
        "main",
        "consist",
        "quality",
        "one",
        "disposes",
        "one",
        "observe",
        "uphold",
        "rule",
        "hume",
        "want",
        "show",
        "first",
        "disposition",
        "quality",
        "possible",
        "u",
        "quality",
        "character",
        "observe",
        "rule",
        "justice",
        "second",
        "quality",
        "would",
        "count",
        "virtue",
        "given",
        "criterion",
        "approach",
        "question",
        "treatise",
        "framed",
        "problem",
        "set",
        "appreciate",
        "problem",
        "step",
        "back",
        "hume",
        "broader",
        "view",
        "moral",
        "motivation",
        "hume",
        "argued",
        "moral",
        "principle",
        "conclusion",
        "reason",
        "iiiii",
        "instead",
        "properly",
        "felt",
        "judg",
        "iiiiii",
        "morality",
        "virtue",
        "matter",
        "sentiment",
        "passion",
        "hume",
        "marshal",
        "number",
        "argument",
        "effect",
        "relevant",
        "purpose",
        "basic",
        "reason",
        "functional",
        "role",
        "reason",
        "passion",
        "markedly",
        "different",
        "hume",
        "view",
        "task",
        "reason",
        "discover",
        "truth",
        "falsehood",
        "relation",
        "idea",
        "matter",
        "fact",
        "iiiii",
        "utterly",
        "lack",
        "capacity",
        "move",
        "u",
        "action",
        "passion",
        "iiiiiiii",
        "passion",
        "hand",
        "representational",
        "content",
        "whatsoever",
        "original",
        "existence",
        "iiiiiiii",
        "iiiii",
        "virtue",
        "paradigmatically",
        "practical",
        "matter",
        "property",
        "act",
        "must",
        "motivated",
        "mean",
        "successful",
        "account",
        "virtue",
        "must",
        "find",
        "passion",
        "aspect",
        "reason",
        "iiiii",
        "far",
        "good",
        "however",
        "come",
        "justice",
        "look",
        "vain",
        "passion",
        "supply",
        "motive",
        "power",
        "u",
        "act",
        "justly",
        "anything",
        "natural",
        "motif",
        "move",
        "u",
        "away",
        "justice",
        "iiiiiii",
        "selflove",
        "requires",
        "correcting",
        "restraining",
        "iiiiii",
        "passion",
        "hume",
        "dismisses",
        "possibility",
        "public",
        "private",
        "beneficence",
        "universal",
        "love",
        "end",
        "concludes",
        "natural",
        "passion",
        "explain",
        "instead",
        "certain",
        "crucial",
        "sense",
        "artificial",
        "iiiiivi",
        "certain",
        "condition",
        "given",
        "sensible",
        "advantage",
        "living",
        "human",
        "society",
        "selflove",
        "selfinterest",
        "may",
        "given",
        "alteration",
        "direction",
        "induce",
        "u",
        "respect",
        "rule",
        "justice",
        "hume",
        "think",
        "primarily",
        "involving",
        "honesty",
        "particular",
        "property",
        "rule",
        "iiiiiii",
        "alteration",
        "need",
        "explanation",
        "two",
        "fact",
        "condition",
        "act",
        "one",
        "u",
        "one",
        "environment",
        "set",
        "alteration",
        "motion",
        "first",
        "hume",
        "maintains",
        "limited",
        "generosity",
        "benevolence",
        "second",
        "live",
        "condition",
        "scarcity",
        "iiiiiii",
        "work",
        "make",
        "go",
        "count",
        "others",
        "u",
        "need",
        "control",
        "world",
        "meet",
        "need",
        "vulnerable",
        "selfishness",
        "predation",
        "others",
        "solution",
        "hume",
        "argues",
        "naturally",
        "fall",
        "convention",
        "observe",
        "rule",
        "property",
        "observance",
        "key",
        "virtue",
        "justice",
        "good",
        "u",
        "convention",
        "formal",
        "agreement",
        "hume",
        "argues",
        "something",
        "like",
        "product",
        "promise",
        "compact",
        "iiiiiii",
        "instead",
        "arises",
        "gradually",
        "acquires",
        "force",
        "slow",
        "progression",
        "repeated",
        "experience",
        "inconvenience",
        "transgressing",
        "iiiiiii",
        "p",
        "much",
        "two",
        "men",
        "pulling",
        "oar",
        "boat",
        "together",
        "need",
        "explicit",
        "agreement",
        "find",
        "prosper",
        "arrangement",
        "generally",
        "wilson",
        "explores",
        "support",
        "hume",
        "hypothesis",
        "work",
        "experimental",
        "economics",
        "end",
        "selfinterest",
        "drive",
        "u",
        "comply",
        "requirement",
        "justice",
        "though",
        "hume",
        "add",
        "sympathy",
        "public",
        "interest",
        "induces",
        "endorsement",
        "justice",
        "become",
        "established",
        "endorsement",
        "however",
        "reserved",
        "scheme",
        "property",
        "rule",
        "taken",
        "generally",
        "hume",
        "observes",
        "individual",
        "instance",
        "compliance",
        "may",
        "frequently",
        "contrary",
        "public",
        "interest",
        "though",
        "compliance",
        "still",
        "required",
        "u",
        "hume",
        "belief",
        "benefit",
        "system",
        "overall",
        "society",
        "individual",
        "requires",
        "rule",
        "admit",
        "exception",
        "iiiiiii",
        "e",
        "appendix",
        "iii",
        "selfinterest",
        "account",
        "possibility",
        "motivated",
        "act",
        "virtue",
        "justice",
        "requires",
        "utility",
        "agreeableness",
        "others",
        "resulting",
        "social",
        "order",
        "respected",
        "property",
        "rule",
        "lead",
        "approbation",
        "motivation",
        "virtue",
        "fact",
        "point",
        "public",
        "utility",
        "sole",
        "origin",
        "justice",
        "point",
        "hume",
        "discussion",
        "justice",
        "enquiry",
        "iiii",
        "scarcity",
        "imposes",
        "need",
        "u",
        "distinguish",
        "mine",
        "thine",
        "sufficient",
        "generosity",
        "nature",
        "without",
        "property",
        "rule",
        "might",
        "say",
        "family",
        "hume",
        "argues",
        "recognition",
        "utility",
        "necessity",
        "justice",
        "provides",
        "entire",
        "command",
        "sentiment",
        "e",
        "iiiii",
        "as",
        "david",
        "johnston",
        "observes",
        "johnston",
        "p",
        "hume",
        "understanding",
        "value",
        "justice",
        "instrumental",
        "promotion",
        "utility",
        "mark",
        "sharp",
        "shift",
        "earlier",
        "understanding",
        "invoked",
        "various",
        "form",
        "reciprocity",
        "understanding",
        "value",
        "sentimentalist",
        "account",
        "justice",
        "also",
        "found",
        "adam",
        "smith",
        "fact",
        "focus",
        "sentiment",
        "almost",
        "completely",
        "swamp",
        "concern",
        "virtue",
        "judgment",
        "virtue",
        "vice",
        "say",
        "compounded",
        "consideration",
        "two",
        "different",
        "relation",
        "sentiment",
        "cause",
        "object",
        "excites",
        "cause",
        "end",
        "proposes",
        "tm",
        "iiiintroduction",
        "focus",
        "two",
        "relation",
        "obviates",
        "independent",
        "discussion",
        "virtue",
        "per",
        "se",
        "however",
        "explicitly",
        "countenance",
        "virtue",
        "justice",
        "developed",
        "contrast",
        "virtue",
        "beneficence",
        "smith",
        "even",
        "clearly",
        "hume",
        "one",
        "see",
        "virtue",
        "consists",
        "conformity",
        "rule",
        "law",
        "justice",
        "appear",
        "exist",
        "antecedently",
        "realization",
        "virtue",
        "unlike",
        "ancient",
        "account",
        "smith",
        "indicates",
        "justice",
        "merit",
        "resentment",
        "absent",
        "may",
        "extorted",
        "force",
        "main",
        "requires",
        "forbearing",
        "harming",
        "others",
        "smith",
        "call",
        "justice",
        "negative",
        "virtue",
        "respect",
        "often",
        "requires",
        "sit",
        "still",
        "nothing",
        "smith",
        "iiiii",
        "essential",
        "subsistence",
        "society",
        "smith",
        "tell",
        "u",
        "smith",
        "iiii",
        "contrast",
        "hume",
        "reducible",
        "motivational",
        "basis",
        "regard",
        "society",
        "instead",
        "concern",
        "multitude",
        "compounded",
        "concern",
        "individual",
        "arises",
        "fellowfeeling",
        "yet",
        "short",
        "love",
        "esteem",
        "affection",
        "smith",
        "iiii",
        "kant",
        "finally",
        "along",
        "movement",
        "away",
        "sentimentalism",
        "see",
        "completion",
        "distinction",
        "justice",
        "virtue",
        "justice",
        "norm",
        "virtue",
        "may",
        "may",
        "correspond",
        "kant",
        "theory",
        "doctrine",
        "virtue",
        "distinguishes",
        "theory",
        "precisely",
        "counterpoised",
        "theory",
        "justice",
        "two",
        "complementary",
        "element",
        "metaphysics",
        "morals",
        "moreover",
        "doctrine",
        "justice",
        "two",
        "part",
        "roughly",
        "corresponding",
        "distinction",
        "present",
        "since",
        "plato",
        "work",
        "role",
        "justice",
        "individual",
        "role",
        "justice",
        "state",
        "kant",
        "call",
        "private",
        "right",
        "public",
        "right",
        "respectively",
        "right",
        "either",
        "case",
        "kant",
        "least",
        "conceives",
        "virtue",
        "instead",
        "right",
        "condition",
        "obtain",
        "moral",
        "agent",
        "comprising",
        "moral",
        "legal",
        "community",
        "virtue",
        "principle",
        "choice",
        "acting",
        "kant",
        "little",
        "remains",
        "notion",
        "justice",
        "virtue",
        "individual",
        "began",
        "ancient",
        "greek"
    ]
}