{
    "main_text": "Option Luck Versus Brute Luck\n7. Option Luck Versus Brute Luck\n\nMost observers agree that not all bad luck is unjust.\nLuck-egalitarians, for example, often separate option luck and brute\nluck and deny that instances of differential option luck are\nunjust.\n\nCanonically, Ronald Dworkin explains option luck as follows:\n“Option luck is a matter of how deliberate and calculated\ngambles turn out—whether someone gains or loses through\naccepting an isolated risk he or she should have anticipated and might\nhave declined” (Dworkin 2000, 73). Brute luck is “a matter\nof how risks fall out that are not in that sense deliberate\ngambles” (Dworkin 2000, 73). If I suddenly go blind as a result\nof a genetic condition, my brute luck is bad, but if I buy a lottery\nticket and win, my option luck is good.\n The availability of insurance provides a link between brute and\noption luck. For “the decision to buy or reject […]\ninsurance is a calculated gamble” (Dworkin 2000, 74). This means\nthat a person may suffer bad brute luck, and for that reason end up\nworse off than others, and yet the resulting inequality might reflect\ndifferential option luck (see, however, Otsuka 2002, 43–51).\nRoughly, this will be so if the person who ends up worse off could\nhave insured against the sort of bad brute luck that she later\nsuffered but declined to do so (Dworkin 2000, 74, 77). So although it\nmay be bad brute luck that I suddenly go blind as a result of a\ngenetic condition, since the risk of this outcome happening is not one\nthat I “might have declined”, the fact that I end up worse\noff as a result of going blind (if this occurs) will reflect bad\noption luck, since suitable insurance was available to me and,\naccordingly, I might have declined the risk of going blind, becoming\nbadly off as a result. (This is not to say that suitable insurance\nagainst the risk of becoming blind is possible. I am neither denying\nnor affirming that no amount of money can compensate one for the loss\nof one’s ability to see; nor am I denying, or affirming, that\nalthough some, presumably large, amount of money can compensate one\nfor becoming blind, the required insurance policy will be unreasonably\nexpensive. If suitable insurance against the risk of becoming blind is\nnot possible or possible but unreasonably expensive, it follows that\nending up worse off as a result of this is, to some extent at least, a\nmatter of bad brute luck.)\n\nDworkin’s distinction needs to be clarified, amended, and\nqualified in certain ways (Bognar 2019; Lippert-Rasmussen 2001;\nVallentyne 2002; Vallentyne 2008; Sandbu 2004, 294–299: Otsuka\n2002, 45; Steiner 2002, 349; see also Dworkin 2002, 122–125).\nFirst, consider a case where I can choose between two alternatives.\nOne involves a 75% chance of having one’s crop destroyed by cold\nweather. The other one involves a 70% chance of having one’s\ncrop destroyed by flooding. In one sense, obviously, either risk is\navoidable. Yet, if one were to go for the first alternative, and if\none’s crops were destroyed by cold weather, it would seem odd to\nsay that the full extent to which one becomes worse off as a result of\nthat choice is a matter of bad option luck. After all, the chances of\nbecoming just as badly off via a different causal route, had I chosen\nthe other alternative, were almost as great. So it seems we should\noften think of a given piece of luck as a mixture of brute luck and\noption luck where the exact mixture depends on the extent to which one\ncould influence the expected value of the outcome of one’s\nchoice (see Knight 2021). In the present case, I could only marginally\ninfluence the expected value of the outcome. Hence the disadvantages\nresulting from my choice should be seen as mostly a matter of bad\nbrute luck.\n\nSecond, suppose I am morally required to perform a certain action,\nsay, to save someone from a burning house thereby risking some\nmoderate burns in the process. Let us also suppose that I am worse off\nthan the person I save and that my doing so happens to make me even\nworse off than this person, since I do get burned in a way that\nrequires expensive medical attention. While the extra inequality that\nresults from my doing what I am morally required to do, on\nDworkin’s definition, reflects bad option luck on my part, the\nview that the resulting extra inequality is in no way unjust is\nimplausible. In fact, the same conclusion would seem to apply to cases\nwhere the risk of severe burns is so high that one’s\nintervention is supererogatory and one ends up worse off as a result\nof one’s choosing to engage in a supererogatory rescue mission\n(Eyal 2007, 4; but see Lazenby 2010; Temkin 2003(b), 144).\n\nThird, suppose you and I face a prisoners’ dilemma. I know that\nthere is some chance that you may defect in which case I will end up\nworse off. However, because I do not want to exploit you by defecting\nmyself in case you do not, I cooperate. As it happens you defect and I\nend up worse off. Again, since I am now worse off as a result of a\ncalculated gamble, I am worse off through bad option luck. Yet, it\nseems plausible to hold that the inequality that results from your\nexploiting my resistance to exploiting you is unjust\n(Lippert-Rasmussen 2011; for a different, but, related problem, see\nSeligman 2007).\n\nSetting aside refinements to it, in what way does Dworkin’s\ndistinction matter from the point view of justice? We can split this\nquestion into two, one concerning brute luck and one concerning option\nluck (cp. Sher 2014, 1). Most egalitarians believe that justice\nrequires the nullification of all differential effects of brute luck\n(Cohen 2011, 5, 29; Rakowski 1991; for a critique, see\nElford 2013), feeling that it cannot be just that some people are\nworse off than others simply because they have been unfortunate, say,\nto have been born with bad genes. Not all egalitarians, however, take\nthis position. Peter Vallentyne believes that while it is true that\njustice requires compensation for congenital dispositions to develop\nserious diseases, this is because justice requires not the\nneutralization of bad brute luck but equality of initial prospects\n(Vallentyne 2002, 543). This equality obtains between two people when\nat some early stage in their development—say, the time at which\nthey become sentient—their prospects are equally good. A genetic\ndefect, at this point in time, would limit one’s opportunities,\nand so such defects will often provide grounds for compensation.\nHowever, if two people face the same initial risk of developing\nmalaria and have equally good initial opportunities, justice does not\nrequire us to compensate the one who gets malaria as a result of bad\nbrute luck.\n\nIt is an advantage of Vallentyne’s approach (over brute luck\nneutralizing egalitarianism) that it avoids the costs incurred in\nneutralizing the effects of differential brute luck. Of course, such\ncosts may lower everyone’s ex ante prospects. Hence, brute luck\negalitarians are committed implausibly, in such cases, to worsening\neverybody’s prospects—or, at least, to saying that it\nwould be better to do so from the point of view of equality even if it\nmay not be better tout court. However, as Vallentyne concedes, initial\nequality of opportunity also raises problems. Suppose we live in a\ncaste society but make sure that babies are assigned starting\npositions in that society by a fair lottery. This society may well\nrealize initial equality of opportunity, yet it does not seem just\n(Barry 1989, 224n). Indeed, it is far from clear that the lottery\nreduces the injustice of this society at all.\n\nTurning now to option luck, three positions should be noted. First,\nsome believe that justice requires the differential effects of option\nluck not to be nullified. Dworkin takes this view (Dworkin 2000;\nRakowski 1991, 74; cp. Sher 2014, viii. Dworkin 2002, 114–115\nseems to mitigate his Dworkin 2000 position). He thinks it would be\nunjust if the state were to compensate people who suffer bad option\nluck by taxing people who enjoy good option luck:\n“…people should pay the price of the life they have\ndecided to lead, measured in what others give up in order that they\ncan do so… But the price of a safer life, measured in this way,\nis precisely foregoing any chance of the gains whose prospect induces\nothers to gamble” (Dworkin 2000, 74). Crucial to this claim is\nthe notion of the price of one’s choices, one reason being that\nthis might vary considerably depending on the context within which\none’s choice is made.\n\nOthers believe that justice permits but does not require the\nnullification of the effects of differential option luck. Peter\nVallentyne defends this position. According to him, justice requires\ninitial equality of opportunity, and this can be achieved through a\nscheme that provides equality of initial opportunities for advantage\nand no compensation for bad option outcome luck. However, initial\nequality of opportunity can also be achieved if the state, say, taxes\nall good option outcome luck (and all good brute luck) and compensates\nall bad option outcome luck (as well as all bad brute luck). This, in\neffect, will deprive people of the opportunity to gamble and hence\nensure that everyone ends up equally well off. In Vallentyne’s\nview, the latter is required by justice when, and only when, this\nincreases the value of people’s initial opportunities, and when\nthe scheme is introduced publicly and proactively so that people know\nthe rules of the game before it starts (Vallentyne 2002, 549, 555).\nThe first of these conditions may be met where people are very risk\naverse and the transaction costs involved in the tax scheme are not\nvery great.\n\nIn a third position, justice requires the nullification of some or all\neffects of differential option luck (e.g. Barry 2008). This view comes\nin several versions. In one, justice requires compensation in some but\nnot all cases of bad option luck. For instance, Marc Fleurbaey argues\nthat justice has a sufficientarian component such that it requires\ndifferential option luck outcomes where some people are left very\nbadly off to be eliminated. Suppose, for instance, that someone\ndecides to use his motorcycle without wearing a helmet, knowing the\nrisks involved, and ends up in a traffic accident in which he is\nseriously hurt as a result. According to Fleurbaey, justice requires\nus to help this person (Fleurbaey 1995, 40–41; Fleurbaey 2001,\n511; Fleurbaey 2008, 153–198; see also Huseby 2018; Segall 2007;\nStemplowska 2009, 251–254; Voigt 2007). Those attracted by\nDworkin’s position on bad option luck will reply that we confuse\nan obligation of justice with an obligation of charity. It would be\nunfair for the motorcycle driver to impose costs on us simply because\nhe prefers to take the gamble of driving without helmet without\ninsurance. He should pay the price of his decisions (which, of course,\nis not to say that he deserves his bad fate). By contrast, friends of\nVallentyne’s view might urge that there is nothing unjust about\na system that publicly and proactively declares that bad outcome\noption luck will be compensated by means of taxing away good option\nluck. Hence, while a refusal to assist the unlucky motorcyclist need\nnot be unjust, the imposition of assistance costs on others, under the\ncircumstances mentioned, would not be unjust either.\n\nA more extreme egalitarianism—“all-luck\negalitarianism” to use an apt phrase coined by Shlomi Segall\n(2010, 46; for a recent defense, see Knight 2021)—has it that\n“differential option luck should be considered as unjust as\ndifferential brute luck” (Segall 2010, 47; cp. Segall 2013,\n64–82). For if what really drives egalitarians is the conviction\nthat people should not be worse off than others as a result of causes\nfor which they are not responsible, then, arguably, it follows that\ndifferential option luck is unjust. After all, a gambler is not\nresponsible for the outcome of her gamble being what it is rather than\nsomething else it could have been. This view does not commit its\nadvocates to the position that the state (or, for that matter, anyone\nelse) should prevent conduct that might lead to inequalities\nreflecting differential option luck: advocates of the view may care\nabout welfare too and rightly think that welfare is promoted when the\noutcomes of gambles are allowed to stand, or they might distinguish\nbetween legitimacy—“the property something has when... no\none has a just grievance against it” (Cohen 2011, 125) and\njustice and think that state intervention to eliminate differential\noption luck would be ilegitimate even if it would thereby bring about\na less unjust distribution. Again, the claim that differential option\nluck is bad is consistent with the view that, given that people do\nchoose to gamble, it is better, all things considered, if differential\noption luck is not eliminated, even if it would be better,\njustice-wise, if people had chosen not to gamble in the first place\n(Lippert-Rasmussen 2001, 576; compare Cohen 2011, 124–143;\nPersson 2006).\n",
    "section_title": "7. Option Luck Versus Brute Luck",
    "entry_title": "Justice and Bad Luck",
    "hierarchy_title": "Justice and Bad Luck || Option Luck Versus Brute Luck",
    "tokenized_text": [
        "option",
        "luck",
        "versus",
        "brute",
        "luck",
        "option",
        "luck",
        "versus",
        "brute",
        "luck",
        "observer",
        "agree",
        "bad",
        "luck",
        "unjust",
        "luckegalitarians",
        "example",
        "often",
        "separate",
        "option",
        "luck",
        "brute",
        "luck",
        "deny",
        "instance",
        "differential",
        "option",
        "luck",
        "unjust",
        "canonically",
        "ronald",
        "dworkin",
        "explains",
        "option",
        "luck",
        "follows",
        "option",
        "luck",
        "matter",
        "deliberate",
        "calculated",
        "gamble",
        "turn",
        "outwhether",
        "someone",
        "gain",
        "loses",
        "accepting",
        "isolated",
        "risk",
        "anticipated",
        "might",
        "declined",
        "dworkin",
        "brute",
        "luck",
        "matter",
        "risk",
        "fall",
        "sense",
        "deliberate",
        "gamble",
        "dworkin",
        "suddenly",
        "go",
        "blind",
        "result",
        "genetic",
        "condition",
        "brute",
        "luck",
        "bad",
        "buy",
        "lottery",
        "ticket",
        "win",
        "option",
        "luck",
        "good",
        "availability",
        "insurance",
        "provides",
        "link",
        "brute",
        "option",
        "luck",
        "decision",
        "buy",
        "reject",
        "insurance",
        "calculated",
        "gamble",
        "dworkin",
        "mean",
        "person",
        "may",
        "suffer",
        "bad",
        "brute",
        "luck",
        "reason",
        "end",
        "worse",
        "others",
        "yet",
        "resulting",
        "inequality",
        "might",
        "reflect",
        "differential",
        "option",
        "luck",
        "see",
        "however",
        "otsuka",
        "roughly",
        "person",
        "end",
        "worse",
        "could",
        "insured",
        "sort",
        "bad",
        "brute",
        "luck",
        "later",
        "suffered",
        "declined",
        "dworkin",
        "although",
        "may",
        "bad",
        "brute",
        "luck",
        "suddenly",
        "go",
        "blind",
        "result",
        "genetic",
        "condition",
        "since",
        "risk",
        "outcome",
        "happening",
        "one",
        "might",
        "declined",
        "fact",
        "end",
        "worse",
        "result",
        "going",
        "blind",
        "occurs",
        "reflect",
        "bad",
        "option",
        "luck",
        "since",
        "suitable",
        "insurance",
        "available",
        "accordingly",
        "might",
        "declined",
        "risk",
        "going",
        "blind",
        "becoming",
        "badly",
        "result",
        "say",
        "suitable",
        "insurance",
        "risk",
        "becoming",
        "blind",
        "possible",
        "neither",
        "denying",
        "affirming",
        "amount",
        "money",
        "compensate",
        "one",
        "loss",
        "one",
        "ability",
        "see",
        "denying",
        "affirming",
        "although",
        "presumably",
        "large",
        "amount",
        "money",
        "compensate",
        "one",
        "becoming",
        "blind",
        "required",
        "insurance",
        "policy",
        "unreasonably",
        "expensive",
        "suitable",
        "insurance",
        "risk",
        "becoming",
        "blind",
        "possible",
        "possible",
        "unreasonably",
        "expensive",
        "follows",
        "ending",
        "worse",
        "result",
        "extent",
        "least",
        "matter",
        "bad",
        "brute",
        "luck",
        "dworkin",
        "distinction",
        "need",
        "clarified",
        "amended",
        "qualified",
        "certain",
        "way",
        "bognar",
        "lippertrasmussen",
        "vallentyne",
        "vallentyne",
        "sandbu",
        "otsuka",
        "steiner",
        "see",
        "also",
        "dworkin",
        "first",
        "consider",
        "case",
        "choose",
        "two",
        "alternative",
        "one",
        "involves",
        "chance",
        "one",
        "crop",
        "destroyed",
        "cold",
        "weather",
        "one",
        "involves",
        "chance",
        "one",
        "crop",
        "destroyed",
        "flooding",
        "one",
        "sense",
        "obviously",
        "either",
        "risk",
        "avoidable",
        "yet",
        "one",
        "go",
        "first",
        "alternative",
        "one",
        "crop",
        "destroyed",
        "cold",
        "weather",
        "would",
        "seem",
        "odd",
        "say",
        "full",
        "extent",
        "one",
        "becomes",
        "worse",
        "result",
        "choice",
        "matter",
        "bad",
        "option",
        "luck",
        "chance",
        "becoming",
        "badly",
        "via",
        "different",
        "causal",
        "route",
        "chosen",
        "alternative",
        "almost",
        "great",
        "seems",
        "often",
        "think",
        "given",
        "piece",
        "luck",
        "mixture",
        "brute",
        "luck",
        "option",
        "luck",
        "exact",
        "mixture",
        "depends",
        "extent",
        "one",
        "could",
        "influence",
        "expected",
        "value",
        "outcome",
        "one",
        "choice",
        "see",
        "knight",
        "present",
        "case",
        "could",
        "marginally",
        "influence",
        "expected",
        "value",
        "outcome",
        "hence",
        "disadvantage",
        "resulting",
        "choice",
        "seen",
        "mostly",
        "matter",
        "bad",
        "brute",
        "luck",
        "second",
        "suppose",
        "morally",
        "required",
        "perform",
        "certain",
        "action",
        "say",
        "save",
        "someone",
        "burning",
        "house",
        "thereby",
        "risking",
        "moderate",
        "burn",
        "process",
        "let",
        "u",
        "also",
        "suppose",
        "worse",
        "person",
        "save",
        "happens",
        "make",
        "even",
        "worse",
        "person",
        "since",
        "get",
        "burned",
        "way",
        "requires",
        "expensive",
        "medical",
        "attention",
        "extra",
        "inequality",
        "result",
        "morally",
        "required",
        "dworkin",
        "definition",
        "reflects",
        "bad",
        "option",
        "luck",
        "part",
        "view",
        "resulting",
        "extra",
        "inequality",
        "way",
        "unjust",
        "implausible",
        "fact",
        "conclusion",
        "would",
        "seem",
        "apply",
        "case",
        "risk",
        "severe",
        "burn",
        "high",
        "one",
        "intervention",
        "supererogatory",
        "one",
        "end",
        "worse",
        "result",
        "one",
        "choosing",
        "engage",
        "supererogatory",
        "rescue",
        "mission",
        "eyal",
        "see",
        "lazenby",
        "temkin",
        "b",
        "third",
        "suppose",
        "face",
        "prisoner",
        "dilemma",
        "know",
        "chance",
        "may",
        "defect",
        "case",
        "end",
        "worse",
        "however",
        "want",
        "exploit",
        "defecting",
        "case",
        "cooperate",
        "happens",
        "defect",
        "end",
        "worse",
        "since",
        "worse",
        "result",
        "calculated",
        "gamble",
        "worse",
        "bad",
        "option",
        "luck",
        "yet",
        "seems",
        "plausible",
        "hold",
        "inequality",
        "result",
        "exploiting",
        "resistance",
        "exploiting",
        "unjust",
        "lippertrasmussen",
        "different",
        "related",
        "problem",
        "see",
        "seligman",
        "setting",
        "aside",
        "refinement",
        "way",
        "dworkin",
        "distinction",
        "matter",
        "point",
        "view",
        "justice",
        "split",
        "question",
        "two",
        "one",
        "concerning",
        "brute",
        "luck",
        "one",
        "concerning",
        "option",
        "luck",
        "cp",
        "sher",
        "egalitarian",
        "believe",
        "justice",
        "requires",
        "nullification",
        "differential",
        "effect",
        "brute",
        "luck",
        "cohen",
        "rakowski",
        "critique",
        "see",
        "elford",
        "feeling",
        "people",
        "worse",
        "others",
        "simply",
        "unfortunate",
        "say",
        "born",
        "bad",
        "gene",
        "egalitarian",
        "however",
        "take",
        "position",
        "peter",
        "vallentyne",
        "belief",
        "true",
        "justice",
        "requires",
        "compensation",
        "congenital",
        "disposition",
        "develop",
        "serious",
        "disease",
        "justice",
        "requires",
        "neutralization",
        "bad",
        "brute",
        "luck",
        "equality",
        "initial",
        "prospect",
        "vallentyne",
        "equality",
        "obtains",
        "two",
        "people",
        "early",
        "stage",
        "developmentsay",
        "time",
        "become",
        "sentienttheir",
        "prospect",
        "equally",
        "good",
        "genetic",
        "defect",
        "point",
        "time",
        "would",
        "limit",
        "one",
        "opportunity",
        "defect",
        "often",
        "provide",
        "ground",
        "compensation",
        "however",
        "two",
        "people",
        "face",
        "initial",
        "risk",
        "developing",
        "malaria",
        "equally",
        "good",
        "initial",
        "opportunity",
        "justice",
        "require",
        "u",
        "compensate",
        "one",
        "get",
        "malaria",
        "result",
        "bad",
        "brute",
        "luck",
        "advantage",
        "vallentyne",
        "approach",
        "brute",
        "luck",
        "neutralizing",
        "egalitarianism",
        "avoids",
        "cost",
        "incurred",
        "neutralizing",
        "effect",
        "differential",
        "brute",
        "luck",
        "course",
        "cost",
        "may",
        "lower",
        "everyone",
        "ex",
        "ante",
        "prospect",
        "hence",
        "brute",
        "luck",
        "egalitarian",
        "committed",
        "implausibly",
        "case",
        "worsening",
        "everybody",
        "prospectsor",
        "least",
        "saying",
        "would",
        "better",
        "point",
        "view",
        "equality",
        "even",
        "may",
        "better",
        "tout",
        "court",
        "however",
        "vallentyne",
        "concedes",
        "initial",
        "equality",
        "opportunity",
        "also",
        "raise",
        "problem",
        "suppose",
        "live",
        "caste",
        "society",
        "make",
        "sure",
        "baby",
        "assigned",
        "starting",
        "position",
        "society",
        "fair",
        "lottery",
        "society",
        "may",
        "well",
        "realize",
        "initial",
        "equality",
        "opportunity",
        "yet",
        "seem",
        "barry",
        "n",
        "indeed",
        "far",
        "clear",
        "lottery",
        "reduces",
        "injustice",
        "society",
        "turning",
        "option",
        "luck",
        "three",
        "position",
        "noted",
        "first",
        "believe",
        "justice",
        "requires",
        "differential",
        "effect",
        "option",
        "luck",
        "nullified",
        "dworkin",
        "take",
        "view",
        "dworkin",
        "rakowski",
        "cp",
        "sher",
        "viii",
        "dworkin",
        "seems",
        "mitigate",
        "dworkin",
        "position",
        "think",
        "would",
        "unjust",
        "state",
        "compensate",
        "people",
        "suffer",
        "bad",
        "option",
        "luck",
        "taxing",
        "people",
        "enjoy",
        "good",
        "option",
        "luck",
        "people",
        "pay",
        "price",
        "life",
        "decided",
        "lead",
        "measured",
        "others",
        "give",
        "order",
        "so",
        "price",
        "safer",
        "life",
        "measured",
        "way",
        "precisely",
        "foregoing",
        "chance",
        "gain",
        "whose",
        "prospect",
        "induces",
        "others",
        "gamble",
        "dworkin",
        "crucial",
        "claim",
        "notion",
        "price",
        "one",
        "choice",
        "one",
        "reason",
        "might",
        "vary",
        "considerably",
        "depending",
        "context",
        "within",
        "one",
        "choice",
        "made",
        "others",
        "believe",
        "justice",
        "permit",
        "require",
        "nullification",
        "effect",
        "differential",
        "option",
        "luck",
        "peter",
        "vallentyne",
        "defends",
        "position",
        "according",
        "justice",
        "requires",
        "initial",
        "equality",
        "opportunity",
        "achieved",
        "scheme",
        "provides",
        "equality",
        "initial",
        "opportunity",
        "advantage",
        "compensation",
        "bad",
        "option",
        "outcome",
        "luck",
        "however",
        "initial",
        "equality",
        "opportunity",
        "also",
        "achieved",
        "state",
        "say",
        "tax",
        "good",
        "option",
        "outcome",
        "luck",
        "good",
        "brute",
        "luck",
        "compensates",
        "bad",
        "option",
        "outcome",
        "luck",
        "well",
        "bad",
        "brute",
        "luck",
        "effect",
        "deprive",
        "people",
        "opportunity",
        "gamble",
        "hence",
        "ensure",
        "everyone",
        "end",
        "equally",
        "well",
        "vallentyne",
        "view",
        "latter",
        "required",
        "justice",
        "increase",
        "value",
        "people",
        "initial",
        "opportunity",
        "scheme",
        "introduced",
        "publicly",
        "proactively",
        "people",
        "know",
        "rule",
        "game",
        "start",
        "vallentyne",
        "first",
        "condition",
        "may",
        "met",
        "people",
        "risk",
        "averse",
        "transaction",
        "cost",
        "involved",
        "tax",
        "scheme",
        "great",
        "third",
        "position",
        "justice",
        "requires",
        "nullification",
        "effect",
        "differential",
        "option",
        "luck",
        "eg",
        "barry",
        "view",
        "come",
        "several",
        "version",
        "one",
        "justice",
        "requires",
        "compensation",
        "case",
        "bad",
        "option",
        "luck",
        "instance",
        "marc",
        "fleurbaey",
        "argues",
        "justice",
        "sufficientarian",
        "component",
        "requires",
        "differential",
        "option",
        "luck",
        "outcome",
        "people",
        "left",
        "badly",
        "eliminated",
        "suppose",
        "instance",
        "someone",
        "decides",
        "use",
        "motorcycle",
        "without",
        "wearing",
        "helmet",
        "knowing",
        "risk",
        "involved",
        "end",
        "traffic",
        "accident",
        "seriously",
        "hurt",
        "result",
        "according",
        "fleurbaey",
        "justice",
        "requires",
        "u",
        "help",
        "person",
        "fleurbaey",
        "fleurbaey",
        "fleurbaey",
        "see",
        "also",
        "huseby",
        "segall",
        "stemplowska",
        "voigt",
        "attracted",
        "dworkin",
        "position",
        "bad",
        "option",
        "luck",
        "reply",
        "confuse",
        "obligation",
        "justice",
        "obligation",
        "charity",
        "would",
        "unfair",
        "motorcycle",
        "driver",
        "impose",
        "cost",
        "u",
        "simply",
        "prefers",
        "take",
        "gamble",
        "driving",
        "without",
        "helmet",
        "without",
        "insurance",
        "pay",
        "price",
        "decision",
        "course",
        "say",
        "deserves",
        "bad",
        "fate",
        "contrast",
        "friend",
        "vallentyne",
        "view",
        "might",
        "urge",
        "nothing",
        "unjust",
        "system",
        "publicly",
        "proactively",
        "declares",
        "bad",
        "outcome",
        "option",
        "luck",
        "compensated",
        "mean",
        "taxing",
        "away",
        "good",
        "option",
        "luck",
        "hence",
        "refusal",
        "assist",
        "unlucky",
        "motorcyclist",
        "need",
        "unjust",
        "imposition",
        "assistance",
        "cost",
        "others",
        "circumstance",
        "mentioned",
        "would",
        "unjust",
        "either",
        "extreme",
        "egalitarianism",
        "allluck",
        "egalitarianism",
        "use",
        "apt",
        "phrase",
        "coined",
        "shlomi",
        "segall",
        "recent",
        "defense",
        "see",
        "knight",
        "has",
        "differential",
        "option",
        "luck",
        "considered",
        "unjust",
        "differential",
        "brute",
        "luck",
        "segall",
        "cp",
        "segall",
        "really",
        "drive",
        "egalitarian",
        "conviction",
        "people",
        "worse",
        "others",
        "result",
        "cause",
        "responsible",
        "arguably",
        "follows",
        "differential",
        "option",
        "luck",
        "unjust",
        "gambler",
        "responsible",
        "outcome",
        "gamble",
        "rather",
        "something",
        "else",
        "could",
        "view",
        "commit",
        "advocate",
        "position",
        "state",
        "matter",
        "anyone",
        "else",
        "prevent",
        "conduct",
        "might",
        "lead",
        "inequality",
        "reflecting",
        "differential",
        "option",
        "luck",
        "advocate",
        "view",
        "may",
        "care",
        "welfare",
        "rightly",
        "think",
        "welfare",
        "promoted",
        "outcome",
        "gamble",
        "allowed",
        "stand",
        "might",
        "distinguish",
        "legitimacy",
        "property",
        "something",
        "one",
        "grievance",
        "cohen",
        "justice",
        "think",
        "state",
        "intervention",
        "eliminate",
        "differential",
        "option",
        "luck",
        "would",
        "ilegitimate",
        "even",
        "would",
        "thereby",
        "bring",
        "le",
        "unjust",
        "distribution",
        "claim",
        "differential",
        "option",
        "luck",
        "bad",
        "consistent",
        "view",
        "given",
        "people",
        "choose",
        "gamble",
        "better",
        "thing",
        "considered",
        "differential",
        "option",
        "luck",
        "eliminated",
        "even",
        "would",
        "better",
        "justicewise",
        "people",
        "chosen",
        "gamble",
        "first",
        "place",
        "lippertrasmussen",
        "compare",
        "cohen",
        "persson"
    ]
}