{
    "main_text": "Some Possible Interconnections\n6. Some Possible Interconnections\n\nWe have isolated three different forms of internalism regarding\njustification, and it is natural to ask how, if at all, they might be\nrelated to one another. Accessibility internalism, for example, seems\nto be strongly related to mentalism. If we ask, what might qualify as\naccessible by reflection, it is difficult to see what else there might\nbe except for one's own mental states. The relationship between these\ntwo forms of internalism is not apt to be entailment; for, it is at\nleast conceivable that one has access via reflection to some state of\naffairs in the non-mental world. Still, we may safely say that if\naccessibility internalism is true, this is evidence in favor of\nmentalism.\n\nThe evidence is particularly strong if we focus on complete\njustifier versions of accessibility internalism. On that view it\nis held that all of the justifiers for any given belief are\naccessible by reflection. If it is true in fact that\neverything that is accessible by reflection is a mental state, then\nmentalism will follow directly from this fact coupled with complete\njustifier internalism. With a partial justifier account of\naccessibility internalism, which we noted earlier is the more\nplausible internalist position, matters are different. On that view it\nis required that the cognizer merely be able to access by reflection\nsome of the justifiers for any given belief. Hence, this\nposition will permit cases in which the justifiers that are accessible\nby reflection are all mental states, but other inaccessible justifiers\nare not. Mentalism, though, is a view about the character of\nall of the justifiers, to the effect that all justifiers are\nmental states. So, while we can agree that a partial justifier account\nof accessibility internalism is evidence for mentalism, the evidence\nis not as strong as one might initially expect.\n\nNeither does mentalism entail accessibility internalism. It is a\nfamiliar point that not all of one's mental states are accessible, but\nthat some are only brought to conscious awareness by medical\nprocedures. Moreover, the example used earlier in which one gains a\nmultitude of new justified beliefs in a rapidly changing perceptual\ncontext, all backed by a variety of sensory justifiers, strongly\nsuggests that there will be many justifiers that will not be\naccessible via reflection even though they are mental states. So\nmentalism might well be correct even when accessibility internalism is\nnot.\n\nThere would be a tight connection between mentalism and accessibility\ninternalism if all of the mental states that are justifiers for\nbeliefs were occurrent mental states. That is, if all of these states\nwere attentively before the mind when one held a justified belief,\nthen those states would then be accessible via introspection. Here we\nassume that if some mental state occurrently exists or obtains at some\ntime, then one can turn one's attention to that state at that time.\nHowever, occurrent justifiers make up but a tiny percentage of the\njustifiers standing behind the large numbers of justified beliefs any\nperson will have at any time. Any adult cognizer, for instance, is apt\nto have many thousands of justified beliefs at any moment, with very\nfew if any of them occurrent at a given time, and all of them backed\nby justifiers. If all of these justifiers are mental states, as\nmentalism contends, most of them would be buried deep in one's mental\nstorehouse, beyond the reach of reflective awareness.\n\nA possible response to this line of thought would be to point out that\ntypically a person can think of a justification for her justified\nbeliefs, even for cases where one's justified beliefs and their\nrespective justifiers have been stored in the mind for a long time.\nConsider again the case of one's justified belief that Illinois was\nLincoln's home state. For most people this belief is justified, but\nhardly ever occurrent, and neither are its justifiers. On an occasion\nwhen the belief is occurrent one may be able to supply a\njustification for it. For instance one might note that one must have\nlearned this fact in elementary school, and that one had entertained\nthis fact on earlier occasions since the belief was first acquired.\nThese are thoughts one has on the present occasion and so are mental\nstates; and they are items of awareness and thus accessible to\nreflective awareness. So even when the justifiers that are mental\nstates are not directly accessible, we might think, some justifiers\nare always available to reflection, because we can think of what would\nserve to justify current beliefs. So mentalism does after all entail\naccessibility, because one can always provide or think of a\njustification.\n\nIt cannot be denied that people very often can supply justification\nfor their beliefs. It can be wondered, however, whether this is always\nso. Supplying a justification is a fairly sophisticated activity, and\nmany children would be poorly equipped to engage in it. Yet surely\nthese children have justified beliefs. Another perhaps more\nfundamental point is this: it is not clear that the justification one\nwould supply on some occasion constitutes the set of justifiers one\nthen has for that belief. In the case at hand, one is now justified in\nbelieving that Illinois was Lincoln's home state. Further, one has\nbeen justified in believing this for some time, including the time\nperiod immediately before one attempted to supply a justification.\nHence, prior to making that attempt, one already has, or there already\nare in place, some justifiers for that belief about Lincoln. The only\nalternatives to thinking this would be to say either that on this\noccasion, prior to supplying a justification, nothing justifies one's\nbelief about Lincoln, though the belief itself is justified\nnonetheless; or that the belief is not justified, contrary to\nappearances. Neither of these possibilities seems at all plausible,\nhowever, so we need to allow that there are some justifiers for the\nLincoln belief prior to and independently of one's attempt to think up\na justification. Indeed, the most natural thing to say about thesse\ncases of justified beliefs of long standing is that the fact that\nthese beliefs have been stored in memory is what makes up their\njustification. Thus, even if we presume that every cognizer is always\nin a position to provide a justification, this point does not serve to\nshow that mentalism entails accessibility internalism. (Goldman 2009,\n323, has a good discussion of memory preservation in relation to cases\nlike that of the belief that Illinois was Lincoln's home state.\nGoldman also discusses problems that may arise for the memory\npreservation account.)\n\nThe deontological concept of justification could be conjoined with\neither accessibility internalism or with mentalism. But these latter\ntwo forms of internalism are not logically connected to the\ndeontological concept. Advocates of the deontological concept of\njustification are defending a thesis concerning the meaning of the\nterm ‘justified,’ and by itself this thesis concerning the\nmeaning of the term has no implications for what the actual justifiers\nmay turn out to be. Hence, if it were a fact that the concept of\nepistemic justification is deontological, this fact would not imply\nmentalism. Nor does mentalism entail the correctness of the\ndeontological concept. For mentalism is compatible with a concept of\njustification defined in terms of degree of evidential support, or\nadequacy of evidential support, and there is nothing particularly\ndeontic about either of these ideas. Exactly the same may be said of\naccessibility internalism. It readily conjoins with a concept of\njustification of either of these evidential sorts, and so\naccessibility internalism does not entail that a deontological concept\nof justification is correct.\n\nThe reverse may be true, however. That is, if justification is really\na deontological concept, this fact may have implications for\naccessibility. Further, since we saw earlier that accessibility\ninternalism is some evidence for mentalism, the correctness of the\ndeontological concept would also have some bearing on mentalism. This\nline of thought is taken up in the next two sections, where arguments\nin favor of various forms of internalism are considered.\n",
    "section_title": "6. Some Possible Interconnections",
    "entry_title": "Internalist vs. Externalist Conceptions of Epistemic Justification",
    "hierarchy_title": "Internalist vs. Externalist Conceptions of Epistemic Justification || Some Possible Interconnections",
    "tokenized_text": [
        "possible",
        "interconnection",
        "possible",
        "interconnection",
        "isolated",
        "three",
        "different",
        "form",
        "internalism",
        "regarding",
        "justification",
        "natural",
        "ask",
        "might",
        "related",
        "one",
        "another",
        "accessibility",
        "internalism",
        "example",
        "seems",
        "strongly",
        "related",
        "mentalism",
        "ask",
        "might",
        "qualify",
        "accessible",
        "reflection",
        "difficult",
        "see",
        "else",
        "might",
        "except",
        "one",
        "s",
        "mental",
        "state",
        "relationship",
        "two",
        "form",
        "internalism",
        "apt",
        "entailment",
        "least",
        "conceivable",
        "one",
        "access",
        "via",
        "reflection",
        "state",
        "affair",
        "nonmental",
        "world",
        "still",
        "may",
        "safely",
        "say",
        "accessibility",
        "internalism",
        "true",
        "evidence",
        "favor",
        "mentalism",
        "evidence",
        "particularly",
        "strong",
        "focus",
        "complete",
        "justifier",
        "version",
        "accessibility",
        "internalism",
        "view",
        "held",
        "justifier",
        "given",
        "belief",
        "accessible",
        "reflection",
        "true",
        "fact",
        "everything",
        "accessible",
        "reflection",
        "mental",
        "state",
        "mentalism",
        "follow",
        "directly",
        "fact",
        "coupled",
        "complete",
        "justifier",
        "internalism",
        "partial",
        "justifier",
        "account",
        "accessibility",
        "internalism",
        "noted",
        "earlier",
        "plausible",
        "internalist",
        "position",
        "matter",
        "different",
        "view",
        "required",
        "cognizer",
        "merely",
        "able",
        "access",
        "reflection",
        "justifier",
        "given",
        "belief",
        "hence",
        "position",
        "permit",
        "case",
        "justifier",
        "accessible",
        "reflection",
        "mental",
        "state",
        "inaccessible",
        "justifier",
        "mentalism",
        "though",
        "view",
        "character",
        "justifier",
        "effect",
        "justifier",
        "mental",
        "state",
        "agree",
        "partial",
        "justifier",
        "account",
        "accessibility",
        "internalism",
        "evidence",
        "mentalism",
        "evidence",
        "strong",
        "one",
        "might",
        "initially",
        "expect",
        "neither",
        "mentalism",
        "entail",
        "accessibility",
        "internalism",
        "familiar",
        "point",
        "one",
        "s",
        "mental",
        "state",
        "accessible",
        "brought",
        "conscious",
        "awareness",
        "medical",
        "procedure",
        "moreover",
        "example",
        "used",
        "earlier",
        "one",
        "gain",
        "multitude",
        "new",
        "justified",
        "belief",
        "rapidly",
        "changing",
        "perceptual",
        "context",
        "backed",
        "variety",
        "sensory",
        "justifier",
        "strongly",
        "suggests",
        "many",
        "justifier",
        "accessible",
        "via",
        "reflection",
        "even",
        "though",
        "mental",
        "state",
        "mentalism",
        "might",
        "well",
        "correct",
        "even",
        "accessibility",
        "internalism",
        "would",
        "tight",
        "connection",
        "mentalism",
        "accessibility",
        "internalism",
        "mental",
        "state",
        "justifier",
        "belief",
        "occurrent",
        "mental",
        "state",
        "state",
        "attentively",
        "mind",
        "one",
        "held",
        "justified",
        "belief",
        "state",
        "would",
        "accessible",
        "via",
        "introspection",
        "assume",
        "mental",
        "state",
        "occurrently",
        "exists",
        "obtains",
        "time",
        "one",
        "turn",
        "one",
        "s",
        "attention",
        "state",
        "time",
        "however",
        "occurrent",
        "justifier",
        "make",
        "tiny",
        "percentage",
        "justifier",
        "standing",
        "behind",
        "large",
        "number",
        "justified",
        "belief",
        "person",
        "time",
        "adult",
        "cognizer",
        "instance",
        "apt",
        "many",
        "thousand",
        "justified",
        "belief",
        "moment",
        "occurrent",
        "given",
        "time",
        "backed",
        "justifier",
        "justifier",
        "mental",
        "state",
        "mentalism",
        "contends",
        "would",
        "buried",
        "deep",
        "one",
        "s",
        "mental",
        "storehouse",
        "beyond",
        "reach",
        "reflective",
        "awareness",
        "possible",
        "response",
        "line",
        "thought",
        "would",
        "point",
        "typically",
        "person",
        "think",
        "justification",
        "justified",
        "belief",
        "even",
        "case",
        "one",
        "s",
        "justified",
        "belief",
        "respective",
        "justifier",
        "stored",
        "mind",
        "long",
        "time",
        "consider",
        "case",
        "one",
        "s",
        "justified",
        "belief",
        "illinois",
        "lincoln",
        "s",
        "home",
        "state",
        "people",
        "belief",
        "justified",
        "hardly",
        "ever",
        "occurrent",
        "neither",
        "justifier",
        "occasion",
        "belief",
        "occurrent",
        "one",
        "may",
        "able",
        "supply",
        "justification",
        "instance",
        "one",
        "might",
        "note",
        "one",
        "must",
        "learned",
        "fact",
        "elementary",
        "school",
        "one",
        "entertained",
        "fact",
        "earlier",
        "occasion",
        "since",
        "belief",
        "first",
        "acquired",
        "thought",
        "one",
        "present",
        "occasion",
        "mental",
        "state",
        "item",
        "awareness",
        "thus",
        "accessible",
        "reflective",
        "awareness",
        "even",
        "justifier",
        "mental",
        "state",
        "directly",
        "accessible",
        "might",
        "think",
        "justifier",
        "always",
        "available",
        "reflection",
        "think",
        "would",
        "serve",
        "justify",
        "current",
        "belief",
        "mentalism",
        "entail",
        "accessibility",
        "one",
        "always",
        "provide",
        "think",
        "justification",
        "denied",
        "people",
        "often",
        "supply",
        "justification",
        "belief",
        "wondered",
        "however",
        "whether",
        "always",
        "supplying",
        "justification",
        "fairly",
        "sophisticated",
        "activity",
        "many",
        "child",
        "would",
        "poorly",
        "equipped",
        "engage",
        "yet",
        "surely",
        "child",
        "justified",
        "belief",
        "another",
        "perhaps",
        "fundamental",
        "point",
        "clear",
        "justification",
        "one",
        "would",
        "supply",
        "occasion",
        "constitutes",
        "set",
        "justifier",
        "one",
        "belief",
        "case",
        "hand",
        "one",
        "justified",
        "believing",
        "illinois",
        "lincoln",
        "s",
        "home",
        "state",
        "one",
        "justified",
        "believing",
        "time",
        "including",
        "time",
        "period",
        "immediately",
        "one",
        "attempted",
        "supply",
        "justification",
        "hence",
        "prior",
        "making",
        "attempt",
        "one",
        "already",
        "already",
        "place",
        "justifier",
        "belief",
        "lincoln",
        "alternative",
        "thinking",
        "would",
        "say",
        "either",
        "occasion",
        "prior",
        "supplying",
        "justification",
        "nothing",
        "justifies",
        "one",
        "s",
        "belief",
        "lincoln",
        "though",
        "belief",
        "justified",
        "nonetheless",
        "belief",
        "justified",
        "contrary",
        "appearance",
        "neither",
        "possibility",
        "seems",
        "plausible",
        "however",
        "need",
        "allow",
        "justifier",
        "lincoln",
        "belief",
        "prior",
        "independently",
        "one",
        "s",
        "attempt",
        "think",
        "justification",
        "indeed",
        "natural",
        "thing",
        "say",
        "thesse",
        "case",
        "justified",
        "belief",
        "long",
        "standing",
        "fact",
        "belief",
        "stored",
        "memory",
        "make",
        "justification",
        "thus",
        "even",
        "presume",
        "every",
        "cognizer",
        "always",
        "position",
        "provide",
        "justification",
        "point",
        "serve",
        "show",
        "mentalism",
        "entail",
        "accessibility",
        "internalism",
        "goldman",
        "good",
        "discussion",
        "memory",
        "preservation",
        "relation",
        "case",
        "like",
        "belief",
        "illinois",
        "lincoln",
        "s",
        "home",
        "state",
        "goldman",
        "also",
        "discus",
        "problem",
        "may",
        "arise",
        "memory",
        "preservation",
        "account",
        "deontological",
        "concept",
        "justification",
        "could",
        "conjoined",
        "either",
        "accessibility",
        "internalism",
        "mentalism",
        "latter",
        "two",
        "form",
        "internalism",
        "logically",
        "connected",
        "deontological",
        "concept",
        "advocate",
        "deontological",
        "concept",
        "justification",
        "defending",
        "thesis",
        "concerning",
        "meaning",
        "term",
        "justified",
        "thesis",
        "concerning",
        "meaning",
        "term",
        "implication",
        "actual",
        "justifier",
        "may",
        "turn",
        "hence",
        "fact",
        "concept",
        "epistemic",
        "justification",
        "deontological",
        "fact",
        "would",
        "imply",
        "mentalism",
        "mentalism",
        "entail",
        "correctness",
        "deontological",
        "concept",
        "mentalism",
        "compatible",
        "concept",
        "justification",
        "defined",
        "term",
        "degree",
        "evidential",
        "support",
        "adequacy",
        "evidential",
        "support",
        "nothing",
        "particularly",
        "deontic",
        "either",
        "idea",
        "exactly",
        "may",
        "said",
        "accessibility",
        "internalism",
        "readily",
        "conjoins",
        "concept",
        "justification",
        "either",
        "evidential",
        "sort",
        "accessibility",
        "internalism",
        "entail",
        "deontological",
        "concept",
        "justification",
        "correct",
        "reverse",
        "may",
        "true",
        "however",
        "justification",
        "really",
        "deontological",
        "concept",
        "fact",
        "may",
        "implication",
        "accessibility",
        "since",
        "saw",
        "earlier",
        "accessibility",
        "internalism",
        "evidence",
        "mentalism",
        "correctness",
        "deontological",
        "concept",
        "would",
        "also",
        "bearing",
        "mentalism",
        "line",
        "thought",
        "taken",
        "next",
        "two",
        "section",
        "argument",
        "favor",
        "various",
        "form",
        "internalism",
        "considered"
    ]
}