{
    "main_text": "Lustration || Historical Background\n4.1 Historical Background\nLustration is the process of regulating how former government\nofficials can participate in post-conflict government and social\nstructures. In particular, lustration involves the screening, barring,\nand removal of public officials from public positions in the new\ndemocratic system as a form of administrative justice.\nThe concept is based on the ancient Roman lustrum rituals, a\ncleansing or purification of an individual or community through the\nremoval of pollution. Lustration is often associated with the\ntransition from an authoritarian regime to democratic governance, and\nin particular with both the denazification of post-WWII Germany and\nthe post-communist transition to democracy in Eastern Europe following\nthe collapse of the Soviet Union. Lustration was originally\nimplemented as a part of the administrative reforms imposed by the\nAllies in post-WWII Germany and Japan, and by states in Western Europe\nthat were formerly occupied by the Nazi regime.\nFollowing the end of WWII, the Allies assigned themselves the task\nof purging all traces of Nazism from both German government and\nsociety, the first large-scale attempt at lustration in the modern\nera.  The Big Three Allies (the Soviet Union, United Kingdom, and\nUnited States) agreed on a plan of action to denazify Germany at the\nTripartite Conference in Potsdam. The Potsdam Agreement, released on\nAugust 2, 1945, set the groundwork for Allied efforts at purging\nNazism and its adherents from Germany. The Potsdam Agreement required\nthe Control Council (comprised of the four Allied Military Governors\nin occupied Germany) to\n\n destroy the National Socialist Party and its\naffiliated and supervised organizations, to dissolve all Nazi\ninstitutions, to ensure that they are not revived in any form, and to\nprevent all Nazi and military activity or\npropaganda. (II.A.3.iii)\n\n Furthermore, the subsequent Control Council Law No. 2 declared that\n the Nazi Party and all affiliates, totaling more than 60 specific\n organizations, were to be dismantled and outlawed.\nThe process of denazification, however, was not limited to the\ndestruction of Nazi organizations. The Potsdam Agreement also\nabolished all police organizations that monitored and controlled\npolitical activity for the Nazi Party and revoked all Nazi-era\nlegislation that established legally sanctioned “discrimination\non the grounds of race, creed, or political opinion”\n(II.A.4).\nOne of the most ambitious and wide-scale activities of the Control\nCouncil was the arrest of those involved with the National Socialist\nParty and its affiliates, and those who actively supported Nazism\nduring the war. The Allied arrest programs called for the automatic\ndetention of anyone associated with the Nazi police and security\nservices, officers holding the rank of major or higher in select\nbranches of the armed forces, high-ranking members of the Nazi Party,\nand high ranking members of the German\n government.[32]\n\nControversially, the Potsdam Agreement also called for the removal\nof Nazis from both “public and semi-public office, and from\npositions of responsibility in important private undertakings”\n(II.A.6). Although this policy was both harsh and ambitious, it meshed\nwith the Allied goal of both destroying the National Socialist Party\nand ensuring that it is “not revived in any form”\n(II.A.3.iii). The process of denazification also included the\nconfiscation of all wealth and property associated with Nazi\norganizations and high-ranking Nazi officials, and a complete purging\nof the educational system of all Nazis, Nazi materials, and\nobjectionable courses. The Allied military government also prohibited\nthe display of Nazi “uniforms and insignia, salutes, medals,\nanthems, and music” (Plischke 1947), a policy that remained in\nforce even after political control was returned to the Germans.\nDespite the enormous amount of resources and energy devoted to the\ndenazification of Germany, there were several problems associated with\nthe process. One of the biggest impediments to the complete\ndenazification of post-WWII Germany was the lack of qualified\nanti-Nazis to staff the government, and in particular the court system\nresponsible for trying ex-Nazis. The shortage of qualified\nprofessionals with “clean records”, combined with\ninterference from German officials and indifference from American\nofficers, led to disappointment among many of those tasked with\nensuring the complete removal of Nazism and its adherents from\n German\ngovernment.[33]\n\nFollowing the collapse of the Soviet Union and their emergence as\nindependent nation-states, the states that made up the former\nCzechoslovakia practiced lustration as a method of transitional\njustice. In 1991, the Czech and Slovak National Assembly passed a law\nprohibiting former Communist Party officials, members of the People's\nMilitia, and members of the National Security Corps from holding a\nwide range of elected and civil service positions in the new\ngovernment for five years (until January 30,\n 1996);[34]\n the ban was later\nextended an additional five years. \n In Hungary, a 1991 law attempted to reset the stature of\nlimitations on crimes committed during the period of Communist rule\n(1944–1990).  Hungary's Constitutional Court overturned this\nlaw. The Court later approved an amended bill, which labeled the\nrepression of 1956 as “war crimes” and “crimes\nagainst humanity”, both of which carry no finite statute of\nlimitations. On 9 March 1994, during the immediate run-up to national\nelections, the Hungarian Parliament passed a lustration ordinance that\nplaced roughly 12,000 “officials” under review in an\nattempt to discover who among them had collaborated with the secret\npolice during the Communist period. This list contained\nParliamentarians, high-ranking government officials, top officials at\nthe Hungarian National bank, ambassadors, generals, top media\noperatives, police, university officials and professors, judges, state\nattorneys, editors, directors of state agencies and banks, and\nadministrators of other sundry financial and governmental institutions\n(Ellis 1996).\n\n\nTwo panels were charged with screening suspects by investigating their\nsecret files. The investigative period was to last six years and\nresults will remain secret for thirty years. Several elements of this\nlaw were found unconstitutional in March 1994, and the Parliament\npassed a new law on July 3, 1996, which provides for the screening of\nall individuals born prior to 14 February 1972 before the assumption\nof higher office. Former agents and officials of the internal security\nservices were the target. If the lustrated official did not resign\nwithin thirty days, the results of the investigation would be released\npublicly, bringing public humiliation into play as a tool of\nlustration.\n\n\nThe demise of the former German Democratic Republic (GDR) in 1990, and\nits annexation by West Germany, resulted in its\n“colonization” by administrators, bureaucrats, and jurists\nfrom West Germany. This was partly due to the manner in which\nre-unification took place (de facto annexation), but was also\nthe result of the complete inadequacy of the existing East German\ncivil service in the face of the new demands of a capitalist\nsociety. This “colonization” and the imposition of the\npolitical and legal judgment of another country, a former foe, sets\nthe East German lustration apart from other such processes in\npost-Socialist Europe.\n It was necessary to supply the new West German government with\nmoral and political legitimacy in the former states of East\nGermany. This demanded the prosecution of past crimes under the prior\nregime, but also a purge of Communists and Stasi collaborators from\nthe civil service. No post-Communist country has yet devised a\nlustration scheme with the golden balance addressing these two\ncompeting needs. East Germany was no exception, despite—or\nperhaps because of—the rigor with which lustration was\npursued.\n\n\nThe ambiguities in the definition of collaboration (in cases of\ncollaboration, forced collaboration, pseudo-compliance, clandestine\nresistance, etc.) resulted in similar difficulties in the lustration\npurge, whose terms were defined in the EinigVrt (the Treaty of\nUnification) (Blankenburg 1995). West German civil servants and\nlawyers largely conducted the purge and the construction of new\ninstitutions in East Germany. East German lawyers were both unfamiliar\nwith the new legal system and suspect in the eyes of the new\nauthorities. The non-indigenous nature of the process was a major\nproblem both in fact and public perception. The scope of the\nlustration and the system's ability to delineate individual\nresponsibility for the Communist regime's repression were both\ncriticized (Blankenburg 1995).\n The Treaty of Unification dealt with the union of both legal and\npolitical systems. Public employees would be scrutinized to determine\nif they were politically and ideologically fit for\nreemployment. Forced to reapply for their positions, public employees\nfaced rejection if Stasi or other untoward associations were\ndiscovered. They also faced criminal trial if their offenses were\ndeemed prosecutable by the reconstituted court system. Most trials\nwere therefore conducted by new West German—or more rarely,\npre-screened East German—judges under East German criminal\nlaw. These trials were meant to bring public humiliation to the\nconvicted.\n\n\nThe former leadership of the DDR was tried in courts in West Berlin.\nAreas of investigation by the new authorities included: commanders\nresponsible for the DDR's border policy (“shoot to kill”),\nelection fraud at various levels of governance, and charges of\ncorruption, embezzlement, and “misuse of public funds”\n(Blankenburg 1995). The prosecution took on a hybrid form: the\nsuspects had to be tried according to the criminal law of East Germany\n(which West German jurists considered an Unrechtsstaat) but\nwith the procedures of West German courts. The intent was to\ncriminalize the Communist regime by treating and prosecuting its\nleadership according to the rules of an ordinary West German criminal\ntrial.\n In the aftermath of the Iraq War of 2003, the Bush administration\npursued a policy of “de-Baathification” as a means of\npurging the government of Saddam supporters and collaborators. In\ncontrast to previous lustration efforts following WWII and the\ncollapse of the Soviet Union, the U.S. government initially indicated\nthat a large number of bureaucrats and officials would be retained in\nthe post-Saddam government (de Young and Slevin 2003).  However, the\nscope of the United States' de-Baathification efforts would soon\nexpand well beyond that initially limited scope\n\n\nThe U.S.-led Coalition Provisional Authority (CPA) ultimately required\na governmental purge of all Baath party members, although there were\nexemptions provided to certain local coalitions. Senior Baath party\nofficials were forbidden from entering the entire post-Saddam\nadministration, while ordinary members were prevented from entering\nthe top levels of government, thereby ensuring that the top levels of\ngovernment remained completely Baath-free (David 2006: 366). In\naddition, Iraq's military and police services were completely\ndisbanded (see Yaphe 2004), leaving large numbers of trained military\npersonnel without work or purpose.\n\n\nSeveral problems emerged from the U.S. policy of total\nde-Baathification. By excluding so many citizens who had formerly held\npower from government, the CPA ultimately excluded and marginalized a\nlarge swath of the Iraqi population from both governance and the\neconomy; an estimated 60–75 percent of those purged were\nunemployed by late 2003 (see The Economist 2003 and David\n2006). To make matters worse, many of those excluded were former\nmilitary and police personnel who were seasoned combat veterans that\nnow sought to turn their military training against the U.S.-led forces\noverseeing the reconstruction and democratization of Iraq.\n\n\nAs a result of the purge of Baath part members throughout the entire\nIraqi government, the CPA was faced with a shortage of qualified\npersonnel to staff the new administration, military, and police forces\n(David 2006: 367). This lack of qualified personnel, combined with\nintensifying attacks against both coalition and administration targets\nand the subsequent difficulty recruiting workers, deeply impacted the\nability of the still-forming government to function. These flaws,\nwhich ultimately obstructed efforts to stabilize Iraq and contributed\nto the large number of causalities caused by insurgents, will be\ndiscussed in greater detail below.\n",
    "section_title": "4.1 Historical Background",
    "entry_title": "Transitional Justice",
    "hierarchy_title": "Transitional Justice || Lustration || Historical Background",
    "tokenized_text": [
        "lustration",
        "historical",
        "background",
        "historical",
        "background",
        "lustration",
        "process",
        "regulating",
        "former",
        "government",
        "official",
        "participate",
        "postconflict",
        "government",
        "social",
        "structure",
        "particular",
        "lustration",
        "involves",
        "screening",
        "barring",
        "removal",
        "public",
        "official",
        "public",
        "position",
        "new",
        "democratic",
        "system",
        "form",
        "administrative",
        "justice",
        "concept",
        "based",
        "ancient",
        "roman",
        "lustrum",
        "ritual",
        "cleansing",
        "purification",
        "individual",
        "community",
        "removal",
        "pollution",
        "lustration",
        "often",
        "associated",
        "transition",
        "authoritarian",
        "regime",
        "democratic",
        "governance",
        "particular",
        "denazification",
        "postwwii",
        "germany",
        "postcommunist",
        "transition",
        "democracy",
        "eastern",
        "europe",
        "following",
        "collapse",
        "soviet",
        "union",
        "lustration",
        "originally",
        "implemented",
        "part",
        "administrative",
        "reform",
        "imposed",
        "ally",
        "postwwii",
        "germany",
        "japan",
        "state",
        "western",
        "europe",
        "formerly",
        "occupied",
        "nazi",
        "regime",
        "following",
        "end",
        "wwii",
        "ally",
        "assigned",
        "task",
        "purging",
        "trace",
        "nazism",
        "german",
        "government",
        "society",
        "first",
        "largescale",
        "attempt",
        "lustration",
        "modern",
        "era",
        "big",
        "three",
        "ally",
        "soviet",
        "union",
        "united",
        "kingdom",
        "united",
        "state",
        "agreed",
        "plan",
        "action",
        "denazify",
        "germany",
        "tripartite",
        "conference",
        "potsdam",
        "potsdam",
        "agreement",
        "released",
        "august",
        "set",
        "groundwork",
        "allied",
        "effort",
        "purging",
        "nazism",
        "adherent",
        "germany",
        "potsdam",
        "agreement",
        "required",
        "control",
        "council",
        "comprised",
        "four",
        "allied",
        "military",
        "governor",
        "occupied",
        "germany",
        "destroy",
        "national",
        "socialist",
        "party",
        "affiliated",
        "supervised",
        "organization",
        "dissolve",
        "nazi",
        "institution",
        "ensure",
        "revived",
        "form",
        "prevent",
        "nazi",
        "military",
        "activity",
        "propaganda",
        "iiaiii",
        "furthermore",
        "subsequent",
        "control",
        "council",
        "law",
        "declared",
        "nazi",
        "party",
        "affiliate",
        "totaling",
        "specific",
        "organization",
        "dismantled",
        "outlawed",
        "process",
        "denazification",
        "however",
        "limited",
        "destruction",
        "nazi",
        "organization",
        "potsdam",
        "agreement",
        "also",
        "abolished",
        "police",
        "organization",
        "monitored",
        "controlled",
        "political",
        "activity",
        "nazi",
        "party",
        "revoked",
        "naziera",
        "legislation",
        "established",
        "legally",
        "sanctioned",
        "discrimination",
        "ground",
        "race",
        "creed",
        "political",
        "opinion",
        "iia",
        "one",
        "ambitious",
        "widescale",
        "activity",
        "control",
        "council",
        "arrest",
        "involved",
        "national",
        "socialist",
        "party",
        "affiliate",
        "actively",
        "supported",
        "nazism",
        "war",
        "allied",
        "arrest",
        "program",
        "called",
        "automatic",
        "detention",
        "anyone",
        "associated",
        "nazi",
        "police",
        "security",
        "service",
        "officer",
        "holding",
        "rank",
        "major",
        "higher",
        "select",
        "branch",
        "armed",
        "force",
        "highranking",
        "member",
        "nazi",
        "party",
        "high",
        "ranking",
        "member",
        "german",
        "government",
        "controversially",
        "potsdam",
        "agreement",
        "also",
        "called",
        "removal",
        "nazi",
        "public",
        "semipublic",
        "office",
        "position",
        "responsibility",
        "important",
        "private",
        "undertaking",
        "iia",
        "although",
        "policy",
        "harsh",
        "ambitious",
        "meshed",
        "allied",
        "goal",
        "destroying",
        "national",
        "socialist",
        "party",
        "ensuring",
        "revived",
        "form",
        "iiaiii",
        "process",
        "denazification",
        "also",
        "included",
        "confiscation",
        "wealth",
        "property",
        "associated",
        "nazi",
        "organization",
        "highranking",
        "nazi",
        "official",
        "complete",
        "purging",
        "educational",
        "system",
        "nazi",
        "nazi",
        "material",
        "objectionable",
        "course",
        "allied",
        "military",
        "government",
        "also",
        "prohibited",
        "display",
        "nazi",
        "uniform",
        "insignia",
        "salute",
        "medal",
        "anthem",
        "music",
        "plischke",
        "policy",
        "remained",
        "force",
        "even",
        "political",
        "control",
        "returned",
        "german",
        "despite",
        "enormous",
        "amount",
        "resource",
        "energy",
        "devoted",
        "denazification",
        "germany",
        "several",
        "problem",
        "associated",
        "process",
        "one",
        "biggest",
        "impediment",
        "complete",
        "denazification",
        "postwwii",
        "germany",
        "lack",
        "qualified",
        "antinazis",
        "staff",
        "government",
        "particular",
        "court",
        "system",
        "responsible",
        "trying",
        "exnazis",
        "shortage",
        "qualified",
        "professional",
        "clean",
        "record",
        "combined",
        "interference",
        "german",
        "official",
        "indifference",
        "american",
        "officer",
        "led",
        "disappointment",
        "among",
        "many",
        "tasked",
        "ensuring",
        "complete",
        "removal",
        "nazism",
        "adherent",
        "german",
        "government",
        "following",
        "collapse",
        "soviet",
        "union",
        "emergence",
        "independent",
        "nationstates",
        "state",
        "made",
        "former",
        "czechoslovakia",
        "practiced",
        "lustration",
        "method",
        "transitional",
        "justice",
        "czech",
        "slovak",
        "national",
        "assembly",
        "passed",
        "law",
        "prohibiting",
        "former",
        "communist",
        "party",
        "official",
        "member",
        "people",
        "s",
        "militia",
        "member",
        "national",
        "security",
        "corp",
        "holding",
        "wide",
        "range",
        "elected",
        "civil",
        "service",
        "position",
        "new",
        "government",
        "five",
        "year",
        "january",
        "ban",
        "later",
        "extended",
        "additional",
        "five",
        "year",
        "hungary",
        "law",
        "attempted",
        "reset",
        "stature",
        "limitation",
        "crime",
        "committed",
        "period",
        "communist",
        "rule",
        "hungary",
        "s",
        "constitutional",
        "court",
        "overturned",
        "law",
        "court",
        "later",
        "approved",
        "amended",
        "bill",
        "labeled",
        "repression",
        "war",
        "crime",
        "crime",
        "humanity",
        "carry",
        "finite",
        "statute",
        "limitation",
        "march",
        "immediate",
        "runup",
        "national",
        "election",
        "hungarian",
        "parliament",
        "passed",
        "lustration",
        "ordinance",
        "placed",
        "roughly",
        "official",
        "review",
        "attempt",
        "discover",
        "among",
        "collaborated",
        "secret",
        "police",
        "communist",
        "period",
        "list",
        "contained",
        "parliamentarian",
        "highranking",
        "government",
        "official",
        "top",
        "official",
        "hungarian",
        "national",
        "bank",
        "ambassador",
        "general",
        "top",
        "medium",
        "operative",
        "police",
        "university",
        "official",
        "professor",
        "judge",
        "state",
        "attorney",
        "editor",
        "director",
        "state",
        "agency",
        "bank",
        "administrator",
        "sundry",
        "financial",
        "governmental",
        "institution",
        "elli",
        "two",
        "panel",
        "charged",
        "screening",
        "suspect",
        "investigating",
        "secret",
        "file",
        "investigative",
        "period",
        "last",
        "six",
        "year",
        "result",
        "remain",
        "secret",
        "thirty",
        "year",
        "several",
        "element",
        "law",
        "found",
        "unconstitutional",
        "march",
        "parliament",
        "passed",
        "new",
        "law",
        "july",
        "provides",
        "screening",
        "individual",
        "born",
        "prior",
        "february",
        "assumption",
        "higher",
        "office",
        "former",
        "agent",
        "official",
        "internal",
        "security",
        "service",
        "target",
        "lustrated",
        "official",
        "resign",
        "within",
        "thirty",
        "day",
        "result",
        "investigation",
        "would",
        "released",
        "publicly",
        "bringing",
        "public",
        "humiliation",
        "play",
        "tool",
        "lustration",
        "demise",
        "former",
        "german",
        "democratic",
        "republic",
        "gdr",
        "annexation",
        "west",
        "germany",
        "resulted",
        "colonization",
        "administrator",
        "bureaucrat",
        "jurist",
        "west",
        "germany",
        "partly",
        "due",
        "manner",
        "reunification",
        "took",
        "place",
        "de",
        "facto",
        "annexation",
        "also",
        "result",
        "complete",
        "inadequacy",
        "existing",
        "east",
        "german",
        "civil",
        "service",
        "face",
        "new",
        "demand",
        "capitalist",
        "society",
        "colonization",
        "imposition",
        "political",
        "legal",
        "judgment",
        "another",
        "country",
        "former",
        "foe",
        "set",
        "east",
        "german",
        "lustration",
        "apart",
        "process",
        "postsocialist",
        "europe",
        "necessary",
        "supply",
        "new",
        "west",
        "german",
        "government",
        "moral",
        "political",
        "legitimacy",
        "former",
        "state",
        "east",
        "germany",
        "demanded",
        "prosecution",
        "past",
        "crime",
        "prior",
        "regime",
        "also",
        "purge",
        "communist",
        "stasi",
        "collaborator",
        "civil",
        "service",
        "postcommunist",
        "country",
        "yet",
        "devised",
        "lustration",
        "scheme",
        "golden",
        "balance",
        "addressing",
        "two",
        "competing",
        "need",
        "east",
        "germany",
        "exception",
        "despiteor",
        "perhaps",
        "ofthe",
        "rigor",
        "lustration",
        "pursued",
        "ambiguity",
        "definition",
        "collaboration",
        "case",
        "collaboration",
        "forced",
        "collaboration",
        "pseudocompliance",
        "clandestine",
        "resistance",
        "etc",
        "resulted",
        "similar",
        "difficulty",
        "lustration",
        "purge",
        "whose",
        "term",
        "defined",
        "einigvrt",
        "treaty",
        "unification",
        "blankenburg",
        "west",
        "german",
        "civil",
        "servant",
        "lawyer",
        "largely",
        "conducted",
        "purge",
        "construction",
        "new",
        "institution",
        "east",
        "germany",
        "east",
        "german",
        "lawyer",
        "unfamiliar",
        "new",
        "legal",
        "system",
        "suspect",
        "eye",
        "new",
        "authority",
        "nonindigenous",
        "nature",
        "process",
        "major",
        "problem",
        "fact",
        "public",
        "perception",
        "scope",
        "lustration",
        "system",
        "s",
        "ability",
        "delineate",
        "individual",
        "responsibility",
        "communist",
        "regime",
        "s",
        "repression",
        "criticized",
        "blankenburg",
        "treaty",
        "unification",
        "dealt",
        "union",
        "legal",
        "political",
        "system",
        "public",
        "employee",
        "would",
        "scrutinized",
        "determine",
        "politically",
        "ideologically",
        "fit",
        "reemployment",
        "forced",
        "reapply",
        "position",
        "public",
        "employee",
        "faced",
        "rejection",
        "stasi",
        "untoward",
        "association",
        "discovered",
        "also",
        "faced",
        "criminal",
        "trial",
        "offense",
        "deemed",
        "prosecutable",
        "reconstituted",
        "court",
        "system",
        "trial",
        "therefore",
        "conducted",
        "new",
        "west",
        "germanor",
        "rarely",
        "prescreened",
        "east",
        "germanjudges",
        "east",
        "german",
        "criminal",
        "law",
        "trial",
        "meant",
        "bring",
        "public",
        "humiliation",
        "convicted",
        "former",
        "leadership",
        "ddr",
        "tried",
        "court",
        "west",
        "berlin",
        "area",
        "investigation",
        "new",
        "authority",
        "included",
        "commander",
        "responsible",
        "ddr",
        "s",
        "border",
        "policy",
        "shoot",
        "kill",
        "election",
        "fraud",
        "various",
        "level",
        "governance",
        "charge",
        "corruption",
        "embezzlement",
        "misuse",
        "public",
        "fund",
        "blankenburg",
        "prosecution",
        "took",
        "hybrid",
        "form",
        "suspect",
        "tried",
        "according",
        "criminal",
        "law",
        "east",
        "germany",
        "west",
        "german",
        "jurist",
        "considered",
        "unrechtsstaat",
        "procedure",
        "west",
        "german",
        "court",
        "intent",
        "criminalize",
        "communist",
        "regime",
        "treating",
        "prosecuting",
        "leadership",
        "according",
        "rule",
        "ordinary",
        "west",
        "german",
        "criminal",
        "trial",
        "aftermath",
        "iraq",
        "war",
        "bush",
        "administration",
        "pursued",
        "policy",
        "debaathification",
        "mean",
        "purging",
        "government",
        "saddam",
        "supporter",
        "collaborator",
        "contrast",
        "previous",
        "lustration",
        "effort",
        "following",
        "wwii",
        "collapse",
        "soviet",
        "union",
        "us",
        "government",
        "initially",
        "indicated",
        "large",
        "number",
        "bureaucrat",
        "official",
        "would",
        "retained",
        "postsaddam",
        "government",
        "de",
        "young",
        "slevin",
        "however",
        "scope",
        "united",
        "state",
        "debaathification",
        "effort",
        "would",
        "soon",
        "expand",
        "well",
        "beyond",
        "initially",
        "limited",
        "scope",
        "usled",
        "coalition",
        "provisional",
        "authority",
        "cpa",
        "ultimately",
        "required",
        "governmental",
        "purge",
        "baath",
        "party",
        "member",
        "although",
        "exemption",
        "provided",
        "certain",
        "local",
        "coalition",
        "senior",
        "baath",
        "party",
        "official",
        "forbidden",
        "entering",
        "entire",
        "postsaddam",
        "administration",
        "ordinary",
        "member",
        "prevented",
        "entering",
        "top",
        "level",
        "government",
        "thereby",
        "ensuring",
        "top",
        "level",
        "government",
        "remained",
        "completely",
        "baathfree",
        "david",
        "addition",
        "iraq",
        "s",
        "military",
        "police",
        "service",
        "completely",
        "disbanded",
        "see",
        "yaphe",
        "leaving",
        "large",
        "number",
        "trained",
        "military",
        "personnel",
        "without",
        "work",
        "purpose",
        "several",
        "problem",
        "emerged",
        "us",
        "policy",
        "total",
        "debaathification",
        "excluding",
        "many",
        "citizen",
        "formerly",
        "held",
        "power",
        "government",
        "cpa",
        "ultimately",
        "excluded",
        "marginalized",
        "large",
        "swath",
        "iraqi",
        "population",
        "governance",
        "economy",
        "estimated",
        "percent",
        "purged",
        "unemployed",
        "late",
        "see",
        "economist",
        "david",
        "make",
        "matter",
        "worse",
        "many",
        "excluded",
        "former",
        "military",
        "police",
        "personnel",
        "seasoned",
        "combat",
        "veteran",
        "sought",
        "turn",
        "military",
        "training",
        "usled",
        "force",
        "overseeing",
        "reconstruction",
        "democratization",
        "iraq",
        "result",
        "purge",
        "baath",
        "part",
        "member",
        "throughout",
        "entire",
        "iraqi",
        "government",
        "cpa",
        "faced",
        "shortage",
        "qualified",
        "personnel",
        "staff",
        "new",
        "administration",
        "military",
        "police",
        "force",
        "david",
        "lack",
        "qualified",
        "personnel",
        "combined",
        "intensifying",
        "attack",
        "coalition",
        "administration",
        "target",
        "subsequent",
        "difficulty",
        "recruiting",
        "worker",
        "deeply",
        "impacted",
        "ability",
        "stillforming",
        "government",
        "function",
        "flaw",
        "ultimately",
        "obstructed",
        "effort",
        "stabilize",
        "iraq",
        "contributed",
        "large",
        "number",
        "causality",
        "caused",
        "insurgent",
        "discussed",
        "greater",
        "detail"
    ]
}