{
    "main_text": "The Classical Analysis of Foundational Justification || Foundational Justification as Infallible Justification\n2.2 Foundational Justification as Infallible Justification\n\nIt may be that classical foundationalists start off on the wrong foot\nif they seek foundations in logical relations between the mere fact\nthat someone believes some proposition and the proposition’s\nbeing true. Foundational justification is, after all, a kind of\njustification, and if the impossibility of error is essential to\nfoundational justification, it may be more plausible to locate the\nsource of infallibility in a special kind of justification available\nin support of a belief. Let us say that S’s belief is\ninfallibly justified at t when S’s ground or\njustification for believing P at t entails the truth\nof P—in other words, when S cannot have that\nground or justification for believing that P while P\nis false. The suggestion, then, is that a belief is foundationally\njustified only if it is infallibly justified in this sense.\n\nWe still need to qualify the entailment in some way to circumvent the\nproblem discussed earlier. Whenever I have any justification at all\nfor believing a proposition that turns out to be necessarily true,\nthat justification will entail the necessary truth. But we do not want\njust any sort of justification to yield infallibly justified belief,\neven if the object of that belief is a necessary truth. This problem\nis notoriously difficult to solve (see the entry on\n Certainty\n for more), but intuitively the solution should have something to do\nwith the relation between the fact that would make true the\nproposition entailed and the fact that would make true the proposition\nthat entails it. More specifically, we could say that P\nentails* Q only if the fact that would make P true\nis at least a constituent of the fact that would make Q true.\nThis suggestion can be considered at best only preliminary since we\nwill obviously need a more detailed account of facts and their\nconstituents. That I have grey hair entails that someone has grey\nhair, but is my having grey hair a constituent of the fact that is\nsomeone’s having grey hair? There is certainly a sense in which\nit is something one can point to in answer to the question “What\nmakes it true that someone has grey hair?” One cannot\nappropriately point to my having grey hair as something that makes it\ntrue that two plus two equals four. With some such relation in place,\nperhaps we can appropriately restrict the class of necessary truths we\ncan be infallibly justified in believing, and still allow contingent\ntruths to be infallibly justified: there is a sense in which one can\n“point” to one’s own experience when asked,\n“What makes it true that you are in pain?”\n\nConsider again my belief that I’m in pain (when I am). If such a\nbelief is foundationally justified, in what does the justification for\nthat belief consist? What is it that distinguishes this belief from my\nbelief about, say, whether it will rain next week? Some\nfoundationalists want to locate the foundational justification in the\ntruth-maker for the proposition believed. What justifies me in\nbelieving that I’m in pain when I am is the mere fact that\nI’m in pain. But again, what is it about my being in pain as\nopposed to its raining next week which makes it appropriate to claim\nthat my being in pain justifies me in believing that I’m in pain\nwhile its raining next week doesn’t justify me in believing that\nit will rain next week?\n\nIt is tempting to think that the foundationalist is better off\nappealing to some special relation that I have to my pain\nwhich makes it unnecessary to look to other beliefs in order to\njustify my belief that I’m in pain. It is the fact that I have a\nkind of access to my pain that no one else has that makes my\nbelief foundationally justified while others must rely on inference in\norder to discover that I am in this state. This takes us to another\nclassical version of foundationalism, the acquaintance theory. Perhaps\nthe best known proponent of an acquaintance theory is Bertrand Russell\n(1910–11, 1913; for more on the acquaintance theory, see entry\non\n knowledge by acquaintance vs. description).\n But it takes little imagination to read the view into most of the\nBritish empiricists. Roughly the view is that what justifies\nS in believing that he is in pain is the fact that S\nis acquainted with his pain in a way in which he is not acquainted\nwith any contingent facts about other people, the physical world, the\nfuture, and so on. Russell (1910–11) characterizes acquaintance\nas a relation of direct or immediate awareness, a relation in\nwhich, as he and some others have put it, something is\n“presented” or simply “given” to the subject\n(Lewis 1929 and 1946; Moser 1989: 80ff.; Fales 1996).\n\nSome doubt that acquaintance with some fact is sufficient, on its own,\nto justify belief in a corresponding proposition. To help see the\nmotivation for this, consider inferential beliefs again. A justified\nbelief that P cannot provide justification for believing\nevery other proposition it entails, for it might be that the\nentailment relation is beyond one’s cognitive grasp, or the\ninference is not something one has made or is even able to make. (As\nalready discussed in\n section 1,\n reflection on such cases might lead us to accept the second clause of\nPIJ.) Similarly, some acquaintance theorists argue that acquaintance\nwith some fact cannot provide justification for a belief in the\nabsence of an awareness of (or at least an ability to become aware of)\nthe relevance of the fact to the truth of the proposition believed.\nFor example, I may be acquainted with a very specific color or shape\nin my visual field, and also believe (correctly) that I am\nexperiencing such-and-such a color or shape, but I might actually be\nreally bad at identifying such specific features and my belief might\nbe little more than a lucky guess. Suppose these theorists also accept\na correspondence conception of truth according to which, roughly, a\nproposition is true just in case it corresponds to the facts or to the\nway the world is; they might add that to be fully justified in\nbelieving a proposition to be true one must be acquainted not only\nwith the fact that makes the proposition true but also with the\nrelation of correspondence that holds between the proposition and the\nfact. For example, in order to be justified in believing that I am\nexperiencing fuchsia, I must be acquainted with (or at least be able\nto become acquainted with) the “match”, “fit”,\nor correspondence between my thought or belief that I am experiencing\nfuchsia and the fact that I am experiencing\n fuchsia.[5]\n\nWhen acquaintance with the fact that P is part of what\nconstitutes my foundational justification for believing P,\nthere is a trivial sense in which my foundational justification is\ninfallible. I can’t be directly acquainted with the fact that\nP while I believe P falsely. However, most\ncontemporary foundationalists are fallibilists about foundational\njustification: they hold that one could be foundationally justified in\nbelieving propositions that are false. It seems plausible that I could\nbe justified in believing, for example, that I am experiencing a mild\npain when in fact I am experiencing an itch, or that I could be\njustified in believing I am experiencing a specific shade of color\nwhen I am in fact experiencing a slightly different shade. Even some\nacquaintance theorists want to allow for some fallible foundations.\nFor example, Fumerton (1995) holds that one can be noninferentially\njustified in believing P by virtue of being directly\nacquainted with a fact very similar to, but ultimately different from,\nthe fact that P (the fact that makes P true). Such\nan acquaintance theory could allow for the possibility of a\nfoundationally justified but false belief that P. Huemer\n(2007), Poston (2010), and Tucker (2016) argue, however, that\nclassical foundationalists have difficulty accommodating fallible\nfoundational beliefs. For some replies, see Fumerton (2010 and 2016),\nand Hasan (2013).\n\nNot all classical foundationalists require acquaintance with the\ncorrespondence (or some other similar relation) between some thought\nor proposition and a distinct fact for one to have knowledge by\nacquaintance. For example, according to McGrew (1995, 1998), for any\nobject of acquaintance or direct awareness it is possible to form a\nbelief in which a demonstrative concept refers directly to it. By\nvirtue of my acquaintance with a painful experience, I can believe\ndirectly of it that it exists, or that the property demonstrated,\npainfulness, is instantiated. We could express the belief roughly by\nsaying “I am experiencing this.” For this kind of\nbelief (unlike most other beliefs regarding contingent facts), to\ngenuinely understand or grasp the content of the belief is to\ngrasp its truth. Such demonstratively formed beliefs are guaranteed to\nbe true:\n\n\nFor what this belief amounts to is that one has a certain experience;\nand a necessary condition for the formation of the belief itself is\nthat one be having just that experience. (McGrew 1995: 90)\n\n\nRather than attempt to accommodate fallible foundations, McGrew\nfollows early classical foundationalists in arguing that infallibility\nor infallible justification (what he calls\n“incorrigibility”) is in fact required for foundational\njustification. Some worry, however, that such foundations, even if\nthey are generally available, are too “thin”: that I am\n“experiencing this” doesn’t seem to convey\nanything about what sort of experience I am having, and it is\ndifficult to see how we could get from here to justified beliefs that\ninvolve categorizing or conceptualizing our experiences in more\ninformative ways (see, e.g., Sosa 2003).\n",
    "section_title": "2.2 Foundational Justification as Infallible Justification",
    "entry_title": "Foundationalist Theories of Epistemic Justification",
    "hierarchy_title": "Foundationalist Theories of Epistemic Justification || The Classical Analysis of Foundational Justification || Foundational Justification as Infallible Justification",
    "tokenized_text": [
        "classical",
        "analysis",
        "foundational",
        "justification",
        "foundational",
        "justification",
        "infallible",
        "justification",
        "foundational",
        "justification",
        "infallible",
        "justification",
        "may",
        "classical",
        "foundationalists",
        "start",
        "wrong",
        "foot",
        "seek",
        "foundation",
        "logical",
        "relation",
        "mere",
        "fact",
        "someone",
        "belief",
        "proposition",
        "proposition",
        "true",
        "foundational",
        "justification",
        "kind",
        "justification",
        "impossibility",
        "error",
        "essential",
        "foundational",
        "justification",
        "may",
        "plausible",
        "locate",
        "source",
        "infallibility",
        "special",
        "kind",
        "justification",
        "available",
        "support",
        "belief",
        "let",
        "u",
        "say",
        "belief",
        "infallibly",
        "justified",
        "ground",
        "justification",
        "believing",
        "p",
        "entail",
        "truth",
        "pin",
        "word",
        "ground",
        "justification",
        "believing",
        "p",
        "p",
        "false",
        "suggestion",
        "belief",
        "foundationally",
        "justified",
        "infallibly",
        "justified",
        "sense",
        "still",
        "need",
        "qualify",
        "entailment",
        "way",
        "circumvent",
        "problem",
        "discussed",
        "earlier",
        "whenever",
        "justification",
        "believing",
        "proposition",
        "turn",
        "necessarily",
        "true",
        "justification",
        "entail",
        "necessary",
        "truth",
        "want",
        "sort",
        "justification",
        "yield",
        "infallibly",
        "justified",
        "belief",
        "even",
        "object",
        "belief",
        "necessary",
        "truth",
        "problem",
        "notoriously",
        "difficult",
        "solve",
        "see",
        "entry",
        "certainty",
        "intuitively",
        "solution",
        "something",
        "relation",
        "fact",
        "would",
        "make",
        "true",
        "proposition",
        "entailed",
        "fact",
        "would",
        "make",
        "true",
        "proposition",
        "entail",
        "specifically",
        "could",
        "say",
        "p",
        "entail",
        "q",
        "fact",
        "would",
        "make",
        "p",
        "true",
        "least",
        "constituent",
        "fact",
        "would",
        "make",
        "q",
        "true",
        "suggestion",
        "considered",
        "best",
        "preliminary",
        "since",
        "obviously",
        "need",
        "detailed",
        "account",
        "fact",
        "constituent",
        "grey",
        "hair",
        "entail",
        "someone",
        "grey",
        "hair",
        "grey",
        "hair",
        "constituent",
        "fact",
        "someone",
        "grey",
        "hair",
        "certainly",
        "sense",
        "something",
        "one",
        "point",
        "answer",
        "question",
        "make",
        "true",
        "someone",
        "grey",
        "hair",
        "one",
        "appropriately",
        "point",
        "grey",
        "hair",
        "something",
        "make",
        "true",
        "two",
        "plus",
        "two",
        "equal",
        "four",
        "relation",
        "place",
        "perhaps",
        "appropriately",
        "restrict",
        "class",
        "necessary",
        "truth",
        "infallibly",
        "justified",
        "believing",
        "still",
        "allow",
        "contingent",
        "truth",
        "infallibly",
        "justified",
        "sense",
        "one",
        "point",
        "one",
        "experience",
        "asked",
        "make",
        "true",
        "pain",
        "consider",
        "belief",
        "pain",
        "belief",
        "foundationally",
        "justified",
        "justification",
        "belief",
        "consist",
        "distinguishes",
        "belief",
        "belief",
        "say",
        "whether",
        "rain",
        "next",
        "week",
        "foundationalists",
        "want",
        "locate",
        "foundational",
        "justification",
        "truthmaker",
        "proposition",
        "believed",
        "justifies",
        "believing",
        "pain",
        "mere",
        "fact",
        "pain",
        "pain",
        "opposed",
        "raining",
        "next",
        "week",
        "make",
        "appropriate",
        "claim",
        "pain",
        "justifies",
        "believing",
        "pain",
        "raining",
        "next",
        "week",
        "justify",
        "believing",
        "rain",
        "next",
        "week",
        "tempting",
        "think",
        "foundationalist",
        "better",
        "appealing",
        "special",
        "relation",
        "pain",
        "make",
        "unnecessary",
        "look",
        "belief",
        "order",
        "justify",
        "belief",
        "pain",
        "fact",
        "kind",
        "access",
        "pain",
        "one",
        "else",
        "make",
        "belief",
        "foundationally",
        "justified",
        "others",
        "must",
        "rely",
        "inference",
        "order",
        "discover",
        "state",
        "take",
        "u",
        "another",
        "classical",
        "version",
        "foundationalism",
        "acquaintance",
        "theory",
        "perhaps",
        "best",
        "known",
        "proponent",
        "acquaintance",
        "theory",
        "bertrand",
        "russell",
        "acquaintance",
        "theory",
        "see",
        "entry",
        "knowledge",
        "acquaintance",
        "vs",
        "description",
        "take",
        "little",
        "imagination",
        "read",
        "view",
        "british",
        "empiricist",
        "roughly",
        "view",
        "justifies",
        "believing",
        "pain",
        "fact",
        "acquainted",
        "pain",
        "way",
        "acquainted",
        "contingent",
        "fact",
        "people",
        "physical",
        "world",
        "future",
        "russell",
        "characterizes",
        "acquaintance",
        "relation",
        "direct",
        "immediate",
        "awareness",
        "relation",
        "others",
        "put",
        "something",
        "presented",
        "simply",
        "given",
        "subject",
        "lewis",
        "moser",
        "ff",
        "fales",
        "doubt",
        "acquaintance",
        "fact",
        "sufficient",
        "justify",
        "belief",
        "corresponding",
        "proposition",
        "help",
        "see",
        "motivation",
        "consider",
        "inferential",
        "belief",
        "justified",
        "belief",
        "p",
        "provide",
        "justification",
        "believing",
        "every",
        "proposition",
        "entail",
        "might",
        "entailment",
        "relation",
        "beyond",
        "one",
        "cognitive",
        "grasp",
        "inference",
        "something",
        "one",
        "made",
        "even",
        "able",
        "make",
        "already",
        "discussed",
        "section",
        "reflection",
        "case",
        "might",
        "lead",
        "u",
        "accept",
        "second",
        "clause",
        "pij",
        "similarly",
        "acquaintance",
        "theorist",
        "argue",
        "acquaintance",
        "fact",
        "provide",
        "justification",
        "belief",
        "absence",
        "awareness",
        "least",
        "ability",
        "become",
        "aware",
        "relevance",
        "fact",
        "truth",
        "proposition",
        "believed",
        "example",
        "may",
        "acquainted",
        "specific",
        "color",
        "shape",
        "visual",
        "field",
        "also",
        "believe",
        "correctly",
        "experiencing",
        "suchandsuch",
        "color",
        "shape",
        "might",
        "actually",
        "really",
        "bad",
        "identifying",
        "specific",
        "feature",
        "belief",
        "might",
        "little",
        "lucky",
        "guess",
        "suppose",
        "theorist",
        "also",
        "accept",
        "correspondence",
        "conception",
        "truth",
        "according",
        "roughly",
        "proposition",
        "true",
        "case",
        "corresponds",
        "fact",
        "way",
        "world",
        "might",
        "add",
        "fully",
        "justified",
        "believing",
        "proposition",
        "true",
        "one",
        "must",
        "acquainted",
        "fact",
        "make",
        "proposition",
        "true",
        "also",
        "relation",
        "correspondence",
        "hold",
        "proposition",
        "fact",
        "example",
        "order",
        "justified",
        "believing",
        "experiencing",
        "fuchsia",
        "must",
        "acquainted",
        "least",
        "able",
        "become",
        "acquainted",
        "match",
        "fit",
        "correspondence",
        "thought",
        "belief",
        "experiencing",
        "fuchsia",
        "fact",
        "experiencing",
        "fuchsia",
        "acquaintance",
        "fact",
        "p",
        "part",
        "constitutes",
        "foundational",
        "justification",
        "believing",
        "p",
        "trivial",
        "sense",
        "foundational",
        "justification",
        "infallible",
        "directly",
        "acquainted",
        "fact",
        "p",
        "believe",
        "p",
        "falsely",
        "however",
        "contemporary",
        "foundationalists",
        "fallibilists",
        "foundational",
        "justification",
        "hold",
        "one",
        "could",
        "foundationally",
        "justified",
        "believing",
        "proposition",
        "false",
        "seems",
        "plausible",
        "could",
        "justified",
        "believing",
        "example",
        "experiencing",
        "mild",
        "pain",
        "fact",
        "experiencing",
        "itch",
        "could",
        "justified",
        "believing",
        "experiencing",
        "specific",
        "shade",
        "color",
        "fact",
        "experiencing",
        "slightly",
        "different",
        "shade",
        "even",
        "acquaintance",
        "theorist",
        "want",
        "allow",
        "fallible",
        "foundation",
        "example",
        "fumerton",
        "hold",
        "one",
        "noninferentially",
        "justified",
        "believing",
        "p",
        "virtue",
        "directly",
        "acquainted",
        "fact",
        "similar",
        "ultimately",
        "different",
        "fact",
        "p",
        "fact",
        "make",
        "p",
        "true",
        "acquaintance",
        "theory",
        "could",
        "allow",
        "possibility",
        "foundationally",
        "justified",
        "false",
        "belief",
        "p",
        "huemer",
        "poston",
        "tucker",
        "argue",
        "however",
        "classical",
        "foundationalists",
        "difficulty",
        "accommodating",
        "fallible",
        "foundational",
        "belief",
        "reply",
        "see",
        "fumerton",
        "hasan",
        "classical",
        "foundationalists",
        "require",
        "acquaintance",
        "correspondence",
        "similar",
        "relation",
        "thought",
        "proposition",
        "distinct",
        "fact",
        "one",
        "knowledge",
        "acquaintance",
        "example",
        "according",
        "mcgrew",
        "object",
        "acquaintance",
        "direct",
        "awareness",
        "possible",
        "form",
        "belief",
        "demonstrative",
        "concept",
        "refers",
        "directly",
        "virtue",
        "acquaintance",
        "painful",
        "experience",
        "believe",
        "directly",
        "exists",
        "property",
        "demonstrated",
        "painfulness",
        "instantiated",
        "could",
        "express",
        "belief",
        "roughly",
        "saying",
        "experiencing",
        "this",
        "kind",
        "belief",
        "unlike",
        "belief",
        "regarding",
        "contingent",
        "fact",
        "genuinely",
        "understand",
        "grasp",
        "content",
        "belief",
        "grasp",
        "truth",
        "demonstratively",
        "formed",
        "belief",
        "guaranteed",
        "true",
        "belief",
        "amount",
        "one",
        "certain",
        "experience",
        "necessary",
        "condition",
        "formation",
        "belief",
        "one",
        "experience",
        "mcgrew",
        "rather",
        "attempt",
        "accommodate",
        "fallible",
        "foundation",
        "mcgrew",
        "follows",
        "early",
        "classical",
        "foundationalists",
        "arguing",
        "infallibility",
        "infallible",
        "justification",
        "call",
        "incorrigibility",
        "fact",
        "required",
        "foundational",
        "justification",
        "worry",
        "however",
        "foundation",
        "even",
        "generally",
        "available",
        "thin",
        "experiencing",
        "seem",
        "convey",
        "anything",
        "sort",
        "experience",
        "difficult",
        "see",
        "could",
        "get",
        "justified",
        "belief",
        "involve",
        "categorizing",
        "conceptualizing",
        "experience",
        "informative",
        "way",
        "see",
        "eg",
        "sosa"
    ]
}