{
    "main_text": "Recent Developments\n5. Recent Developments\n\nWhile Rawls’ work has sparked an explosion of work in\ndistributive justice and social justice more generally, in recent\nyears a variety of strategies to return to a focus on justice as a\npersonal virtue has emerged. These strategies vary across both\ndimensions we have considered, taking with various degrees of\nseriousness the connection between institutional and personal forms of\njustice, and focusing on the latter as a virtue, among (and like)\nother virtues.\n\nOne such strategy is that of Jon Drydyk, who builds on the\n“capability approach” to human welfare to make a case for\na capabilities-based account of the justice of individual agents, in\nparticular as against an “Aristotelian” approach that\nstresses justice as a matter of response to merit. Acting justly\ninvolves “striving to reduce and remove inequalities in\npeople’s capabilities to function in ways that are\nelemental” to a truly human life (Drydyk 2012, pp. 31, 33). This\nis a “subsidiary” virtue account, in that we begin with a\nprior conception of the content of the requirements of justice, and\nconform the virtue to this conception. However, Drydyk emphasizes\njustice as a virtue of individuals, rather than institutions or\nsocieties. Drydyk’s strategy offers a counterpoint both to the\nRawlsian way of thinking about just societies and to the ancient Greek\nway of thinking about justice as a virtue of individuals.\n\nJohn Hacker-Wright argues that what is needed to replace a\n“legalistic” concern with moral status (as on modern\nliberal conceptions of justice) is instead an ethic of virtue with a\ndifferent conception of the virtue of justice. Instead of a concern\nfor the resolution of claims in something like reciprocal, contractual\nrelations, Hacker-Wright’s conception of the virtue of justice\nis a matter of sensitivity to “vulnerability of value” in\nthings, animate and otherwise. Thus, the threat of unjust —\nvicious -- wronging hangs not only over people who are sufficiently\ncognitively impaired so as not to perceive insults, but also corpses,\nanimals, and even rare and valuable rock formations (p. 463). This\ncounts as a sense of justice in that, on Hacker-Wright’s view it\nis not merely that we can act wrongly or viciously toward such\nentities, but (following Midgley 1983) that they can be wronged by us\nby our doing so. However, while Hacker-Wright claims that on a virtue\nethic “The character of the agent is recognized as ineliminable\nin picking out facts as they figure in our moral deliberation,”\nthis does not strictly speaking seem to be true, as prior to virtue\nthere is value which it is up to the just or virtuous person\nto respond with sensitivity (Hacker-Wright 2007, pp. 461, 463,\n464).\n\nDavid Schmidtz and John Thrasher suggest rethinking the relationship\nbetween social justice and individual justice (Schmidtz and Thrasher\n2014). Turning Plato’s account of justice in Republic\non its head, they depict justice as a bridge between a virtue of the\nsoul and of the polis: because we are essentially social, we\nneed community, and justice is a matter of harmony with the community.\nOn their view this is (largely) a matter of compliance with rules and\ninstitutions that enable people to live in harmony and flourish\ntogether.\n\nAn alternative proposal for thinking of the justice as a personal\nvirtue ties it intimately to the experiences we have as emotional\ncreatures. On this approach, instead of justice standing as distinct\nfrom “natural virtues” motivated by passions (as on\nHume’s account), or needing to be replaced by\nsentimentally-driven attitudes such as care or compassion, justice is\nto be seen as a virtue largely constituted by emotion\n(Solomon 1994, Roberts 2010). The virtue amounts to a stable\ndisposition of character to respond in the relevant ways to instances\nof injustice, perhaps consisting in those occasions in which one does\nnot receive his or her due, and on the other hand to be disposed to a\n“will to give each his due” (Roberts 2010, p. 38). For\nRoberts, this is a will to realize “objective justice,”\nand as on other recent accounts, the virtue (and the passion) are\ntheoretically subsidiary to this primary notion of “objective\njustice.”\n\nThere are also recent ventures in the spirit of the ancient Greek\nthinking about the individual virtue of justice. Rasmussen and Den Uyl\n(2005) argue for two interpersonal senses of justice (pp. 160-63). One\nis the familiar Aristotelian virtue. The second is a\n“metanormative” principle governing the institutions and\nlegal frameworks in which individual agents (just and otherwise) live\ntheir lives and exercise their practical agency. The second of these\nsenses of interpersonal justice does not draw its content from the\nexercise of virtue, but rather makes a place for it. The former does\ndepend on virtue overall (including the exercise of practical wisdom)\nfor its demands, but these are construed broadly in the traditional\nway of rendering to each his due. Bloomfield (2011) similarly suggests\nextending the Aristotelian virtue of justice, but in an inward\ndirection, arguing that self-respect is necessary for happiness, and\ntreating oneself fairly requires treating oneself fairly, as one\ntreats others fairly, as a property of justice as individuals.\n\nOn the other hand, Wolterstorff (2008) argues that the eudaimonism of\nGreek thought prevents a proper appreciation for the nature and\nsignificance of justice and rights. Whether there is theoretical space\nremaining for a virtue of justice is not a question Wolterstorff\nconsiders, but he does believe there is no hope for an adequate grip\non justice in an Aristotelian or Stoic framework. \n\nRecent thinkers have grappled with the question of priority between\nformal principle and virtue that vexed Aristotle, and offered\nsolutions that for the most part subordinate the virtue of justice to\nthe prior notion of the justice of distributions, as Aristotle himself\nseems to have suggested. Bernard Williams claims explicitly that this\nis so (Williams 1980, p. 197), as does David Wiggins, in an attempt to\nbring a “pre-liberal,” Aristotelian conception of justice\nto bear on modern liberal conceptions, a la Kant and Rawls (Wiggins\n2004). To do so, Wiggins distinguishes three senses of justice: (A) a\nmatter of outcomes or states of affairs in which each gets what is\ndue; (B) a disposition to promote justice (A); (C) a condition of the\npolis in virtue of which (A) is realized. Wiggins claims that the\nproper outcome of this collision of conceptions is one that recognizes\na form of logical priority of justice (A) over justice (B)\n(p. 489). At the same time, against Williams he insists that the\nnormative demands of justice (A) are “comprehensible” only\nwithin the perspective of a person with justice (B). And in fact he\nclaims that a necessary condition on acts and outcomes satisfying the\nnorms of justice (A) is that they be recognized to be so by those with\nthe virtue of justice (B). Wiggins’ thinking here is not\ntransparent, but perhaps the thought is that the logical point is\npurely formal: someone with justice (B) must, in act or judging\njustly, be responding to some norm which counts as justice (A). But,\nas merely formal, that tells us nothing about the substantive\ncontent of that norm. To get that, we have ineliminable need to refer\nto the judgment of the person with justice (B). That marks a way\nperhaps of restoring Aristotle’s focus on virtue in coming to\nunderstand the virtue of justice. \n\nLeBar (2013, 2014) takes a similar tack in attempting to incorporate\nKantian and post-Kantian insights into just demands on the treatment\nof others into an Aristotelian virtue framework. On his view, there is\nno way to specify the contents of the demands of justice, or to spell\nout its norms, independently of the wider possession and exercise of\nthe virtues, including the virtue of practical wisdom. At the same\ntime, what the virtuous and just person sees, in inhabiting a social\nworld with equals in moral standing, are the norms which have become\nassociated with the liberal conception: the standing to obligate\nothers and hold them accountable, for example.\n\nFinally, all of these are Western treatments of an individual virtue\nof justice. May Sim (Sim 2007, 2018) makes the case that there are\ninformative parallels between the Confucian treatment of the virtues\n(in particular, yi) and the virtue of justice as adumbrated in Plato\nand Aristotle. \n",
    "section_title": "5. Recent Developments",
    "entry_title": "Justice as a Virtue",
    "hierarchy_title": "Justice as a Virtue || Recent Developments",
    "tokenized_text": [
        "recent",
        "development",
        "recent",
        "development",
        "rawls",
        "work",
        "sparked",
        "explosion",
        "work",
        "distributive",
        "justice",
        "social",
        "justice",
        "generally",
        "recent",
        "year",
        "variety",
        "strategy",
        "return",
        "focus",
        "justice",
        "personal",
        "virtue",
        "emerged",
        "strategy",
        "vary",
        "across",
        "dimension",
        "considered",
        "taking",
        "various",
        "degree",
        "seriousness",
        "connection",
        "institutional",
        "personal",
        "form",
        "justice",
        "focusing",
        "latter",
        "virtue",
        "among",
        "like",
        "virtue",
        "one",
        "strategy",
        "jon",
        "drydyk",
        "build",
        "capability",
        "approach",
        "human",
        "welfare",
        "make",
        "case",
        "capabilitiesbased",
        "account",
        "justice",
        "individual",
        "agent",
        "particular",
        "aristotelian",
        "approach",
        "stress",
        "justice",
        "matter",
        "response",
        "merit",
        "acting",
        "justly",
        "involves",
        "striving",
        "reduce",
        "remove",
        "inequality",
        "people",
        "capability",
        "function",
        "way",
        "elemental",
        "truly",
        "human",
        "life",
        "drydyk",
        "pp",
        "subsidiary",
        "virtue",
        "account",
        "begin",
        "prior",
        "conception",
        "content",
        "requirement",
        "justice",
        "conform",
        "virtue",
        "conception",
        "however",
        "drydyk",
        "emphasizes",
        "justice",
        "virtue",
        "individual",
        "rather",
        "institution",
        "society",
        "drydyk",
        "strategy",
        "offer",
        "counterpoint",
        "rawlsian",
        "way",
        "thinking",
        "society",
        "ancient",
        "greek",
        "way",
        "thinking",
        "justice",
        "virtue",
        "individual",
        "john",
        "hackerwright",
        "argues",
        "needed",
        "replace",
        "legalistic",
        "concern",
        "moral",
        "status",
        "modern",
        "liberal",
        "conception",
        "justice",
        "instead",
        "ethic",
        "virtue",
        "different",
        "conception",
        "virtue",
        "justice",
        "instead",
        "concern",
        "resolution",
        "claim",
        "something",
        "like",
        "reciprocal",
        "contractual",
        "relation",
        "hackerwright",
        "conception",
        "virtue",
        "justice",
        "matter",
        "sensitivity",
        "vulnerability",
        "value",
        "thing",
        "animate",
        "otherwise",
        "thus",
        "threat",
        "unjust",
        "vicious",
        "wronging",
        "hang",
        "people",
        "sufficiently",
        "cognitively",
        "impaired",
        "perceive",
        "insult",
        "also",
        "corps",
        "animal",
        "even",
        "rare",
        "valuable",
        "rock",
        "formation",
        "p",
        "count",
        "sense",
        "justice",
        "hackerwright",
        "view",
        "merely",
        "act",
        "wrongly",
        "viciously",
        "toward",
        "entity",
        "following",
        "midgley",
        "wronged",
        "u",
        "however",
        "hackerwright",
        "claim",
        "virtue",
        "ethic",
        "character",
        "agent",
        "recognized",
        "ineliminable",
        "picking",
        "fact",
        "figure",
        "moral",
        "deliberation",
        "strictly",
        "speaking",
        "seem",
        "true",
        "prior",
        "virtue",
        "value",
        "virtuous",
        "person",
        "respond",
        "sensitivity",
        "hackerwright",
        "pp",
        "david",
        "schmidtz",
        "john",
        "thrasher",
        "suggest",
        "rethinking",
        "relationship",
        "social",
        "justice",
        "individual",
        "justice",
        "schmidtz",
        "thrasher",
        "turning",
        "plato",
        "account",
        "justice",
        "republic",
        "head",
        "depict",
        "justice",
        "bridge",
        "virtue",
        "soul",
        "polis",
        "essentially",
        "social",
        "need",
        "community",
        "justice",
        "matter",
        "harmony",
        "community",
        "view",
        "largely",
        "matter",
        "compliance",
        "rule",
        "institution",
        "enable",
        "people",
        "live",
        "harmony",
        "flourish",
        "together",
        "alternative",
        "proposal",
        "thinking",
        "justice",
        "personal",
        "virtue",
        "tie",
        "intimately",
        "experience",
        "emotional",
        "creature",
        "approach",
        "instead",
        "justice",
        "standing",
        "distinct",
        "natural",
        "virtue",
        "motivated",
        "passion",
        "hume",
        "account",
        "needing",
        "replaced",
        "sentimentallydriven",
        "attitude",
        "care",
        "compassion",
        "justice",
        "seen",
        "virtue",
        "largely",
        "constituted",
        "emotion",
        "solomon",
        "robert",
        "virtue",
        "amount",
        "stable",
        "disposition",
        "character",
        "respond",
        "relevant",
        "way",
        "instance",
        "injustice",
        "perhaps",
        "consisting",
        "occasion",
        "one",
        "receive",
        "due",
        "hand",
        "disposed",
        "give",
        "due",
        "robert",
        "p",
        "robert",
        "realize",
        "objective",
        "justice",
        "recent",
        "account",
        "virtue",
        "passion",
        "theoretically",
        "subsidiary",
        "primary",
        "notion",
        "objective",
        "justice",
        "also",
        "recent",
        "venture",
        "spirit",
        "ancient",
        "greek",
        "thinking",
        "individual",
        "virtue",
        "justice",
        "rasmussen",
        "den",
        "uyl",
        "argue",
        "two",
        "interpersonal",
        "sens",
        "justice",
        "pp",
        "one",
        "familiar",
        "aristotelian",
        "virtue",
        "second",
        "metanormative",
        "principle",
        "governing",
        "institution",
        "legal",
        "framework",
        "individual",
        "agent",
        "otherwise",
        "live",
        "life",
        "exercise",
        "practical",
        "agency",
        "second",
        "sens",
        "interpersonal",
        "justice",
        "draw",
        "content",
        "exercise",
        "virtue",
        "rather",
        "make",
        "place",
        "former",
        "depend",
        "virtue",
        "overall",
        "including",
        "exercise",
        "practical",
        "wisdom",
        "demand",
        "construed",
        "broadly",
        "traditional",
        "way",
        "rendering",
        "due",
        "bloomfield",
        "similarly",
        "suggests",
        "extending",
        "aristotelian",
        "virtue",
        "justice",
        "inward",
        "direction",
        "arguing",
        "selfrespect",
        "necessary",
        "happiness",
        "treating",
        "oneself",
        "fairly",
        "requires",
        "treating",
        "oneself",
        "fairly",
        "one",
        "treat",
        "others",
        "fairly",
        "property",
        "justice",
        "individual",
        "hand",
        "wolterstorff",
        "argues",
        "eudaimonism",
        "greek",
        "thought",
        "prevents",
        "proper",
        "appreciation",
        "nature",
        "significance",
        "justice",
        "right",
        "whether",
        "theoretical",
        "space",
        "remaining",
        "virtue",
        "justice",
        "question",
        "wolterstorff",
        "considers",
        "believe",
        "hope",
        "adequate",
        "grip",
        "justice",
        "aristotelian",
        "stoic",
        "framework",
        "recent",
        "thinker",
        "grappled",
        "question",
        "priority",
        "formal",
        "principle",
        "virtue",
        "vexed",
        "aristotle",
        "offered",
        "solution",
        "part",
        "subordinate",
        "virtue",
        "justice",
        "prior",
        "notion",
        "justice",
        "distribution",
        "aristotle",
        "seems",
        "suggested",
        "bernard",
        "williams",
        "claim",
        "explicitly",
        "williams",
        "p",
        "david",
        "wiggins",
        "attempt",
        "bring",
        "preliberal",
        "aristotelian",
        "conception",
        "justice",
        "bear",
        "modern",
        "liberal",
        "conception",
        "la",
        "kant",
        "rawls",
        "wiggins",
        "wiggins",
        "distinguishes",
        "three",
        "sens",
        "justice",
        "matter",
        "outcome",
        "state",
        "affair",
        "get",
        "due",
        "b",
        "disposition",
        "promote",
        "justice",
        "c",
        "condition",
        "polis",
        "virtue",
        "realized",
        "wiggins",
        "claim",
        "proper",
        "outcome",
        "collision",
        "conception",
        "one",
        "recognizes",
        "form",
        "logical",
        "priority",
        "justice",
        "justice",
        "b",
        "p",
        "time",
        "williams",
        "insists",
        "normative",
        "demand",
        "justice",
        "comprehensible",
        "within",
        "perspective",
        "person",
        "justice",
        "b",
        "fact",
        "claim",
        "necessary",
        "condition",
        "act",
        "outcome",
        "satisfying",
        "norm",
        "justice",
        "recognized",
        "virtue",
        "justice",
        "b",
        "wiggins",
        "thinking",
        "transparent",
        "perhaps",
        "thought",
        "logical",
        "point",
        "purely",
        "formal",
        "someone",
        "justice",
        "b",
        "must",
        "act",
        "judging",
        "justly",
        "responding",
        "norm",
        "count",
        "justice",
        "merely",
        "formal",
        "tell",
        "u",
        "nothing",
        "substantive",
        "content",
        "norm",
        "get",
        "ineliminable",
        "need",
        "refer",
        "judgment",
        "person",
        "justice",
        "b",
        "mark",
        "way",
        "perhaps",
        "restoring",
        "aristotle",
        "focus",
        "virtue",
        "coming",
        "understand",
        "virtue",
        "justice",
        "lebar",
        "take",
        "similar",
        "tack",
        "attempting",
        "incorporate",
        "kantian",
        "postkantian",
        "insight",
        "demand",
        "treatment",
        "others",
        "aristotelian",
        "virtue",
        "framework",
        "view",
        "way",
        "specify",
        "content",
        "demand",
        "justice",
        "spell",
        "norm",
        "independently",
        "wider",
        "possession",
        "exercise",
        "virtue",
        "including",
        "virtue",
        "practical",
        "wisdom",
        "time",
        "virtuous",
        "person",
        "see",
        "inhabiting",
        "social",
        "world",
        "equal",
        "moral",
        "standing",
        "norm",
        "become",
        "associated",
        "liberal",
        "conception",
        "standing",
        "obligate",
        "others",
        "hold",
        "accountable",
        "example",
        "finally",
        "western",
        "treatment",
        "individual",
        "virtue",
        "justice",
        "may",
        "sim",
        "sim",
        "make",
        "case",
        "informative",
        "parallel",
        "confucian",
        "treatment",
        "virtue",
        "particular",
        "yi",
        "virtue",
        "justice",
        "adumbrated",
        "plato",
        "aristotle"
    ]
}