{
    "main_text": "Does Justice Require Universal Access to Health Care? || Universal Access to Prudentially Defined Care\n3.2 Universal Access to Prudentially Defined Care\n\nA second general line of argument in favor of universal access to some\nforms of health care builds on the idea that prudent individuals would\ninsure themselves against the prospect of needing certain kinds of\nhealth care. We shall consider two versions of this argument,\nDworkin’s (1981, 1994, 2000) effort to spell out the\nimplications of treating people with equal respect, and\nGibbard’s (1982) appeal to an ex ante pareto optimality\nprinciple combined with an assumed right to a decent basic minimum of\nincome. As we shall see, though both arguments use different\nassumptions to support universal access to different health care\nbenefit packages, their main point is to counter certain implausible\nviews about what benefits should be included in a universal access\nsystem.\n\nDworkin’s argument can be sketched as follows:\n\nWe have an obligation to treat people as equals.\nTreating people as equals is best achieved by giving people\nequality of resources (and this idea can in theory be shown to be\ncoherent by devising an appropriate initial auction, combined with\nappropriate post-auction trades and insurance schemes against\ndisadvantaging outcomes).\nSuppose we had equality of resources in the U.S., for example,\nthat income and wealth were equally distributed, and that all people\nhad information about health care interventions and their effects as\ngood as what the best doctors have, and that no one has prior\ninformation about the specific risks faced by specific\nindividuals.\nThen each person could act prudently to buy insurance protection\nagainst various health needs without government subsidies or otherwise\ndistorted markets.\nWhat most people would prudently insure themselves against ought\nto be included in a universal access health system. (Some kinds of\nprotection would thus be imprudent to include and we should abandon a\nrule of rescue that included them.)\nWhere there is disagreement about what people count as prudent\ninsurance (some would buy it, others not), then we need to consult\nwith representative people of different views and make decisions about\nuniversal coverage that reflect that consultation.\n\n\nSome comments will clarify key aspects of this argument. First, the\nfirst two premises involve both a strong egalitarian assumption,\nthough one that is widely held (treating people as equals) and a very\nstrong (specific and detailed) way of achieving it (equality of\nresources). Discussion of the details of these claims would take us\nwell beyond the scope of this essay. Suffice it to say that this\nargument cannot proceed to an account of universal access to health\ncare without some more general assumptions for a view of justice. In\nthat regard, it shares with the fair equality of opportunity account\nthe need to borrow justification for universal access from more\ngeneral concerns of justice.\n\nSecond, the specific assumptions in (3) are very strong and arguably\ncannot be realized. The argument that presupposes them should thus be\nseen as an analytic tool and not an attempt to say anything very\nspecific about how real institutions could be designed. (We note that\nthis strong requirement is not needed by the model of universal and\nequal access that emphasizes real choice. Instead, the choice model\nallows for income inequalities and only needs subsidies to equalize\nthe affordability of buying insurance equal in scope to what the ACA\nrequires of insurance purchased on the exchanges it authorizes.)\nWithout, for example, knowing what level of resources would result\nfrom equalizing resources, we can say little about what levels of\ninsurance coverage for specific conditions are welfare enhancing for\nindividuals. Since there is no feasible way to meet the assumptions\nabout the distribution of medical knowledge or the exclusion of\nknowledge of individual risks, these assumptions make Dworkin’s\nargument completely hypothetical and theoretical rather than\npractical. Third, the assumption that there is an ideally competitive\ninsurance market postulated in the fourth step of the argument adds to\nthe hypothetical nature of the argument as a whole.\n\nFourth, the argument focuses primarily on personal medical services\nand not broader public health measures that reduce overall risk or\ndistribute that risk more fairly. There is no mention of interventions\nbeyond individual treatment or prevention measures, and the thrust of\n4 and 5 make it clear the argument is about an insurance market only\nfor those measures. The thrust of steps 5 and 6 make it clearer that\nthe point of the argument is to clarify what a defensible content of a\nuniversal access benefit package would include. Specifically, the\nargument aims to establish that we need a more plausible view of what\nwe owe each other by way of providing health care than the\nindefensible view that what rescues someone from death or disability\nmust be provided regardless of costs or opportunity costs.\n\nThe other version of a prudential insurance argument for universal\ncoverage rests on a weaker assumption that we have a right to a decent\nminimum of income. In Gibbard’s (1982) discussion, the\nassumption is invoked but not argued for. Like the other argument, the\nmain thrust of Gibbard’s argument lies in its implications for\nthe content of a universal access benefit package.\n\nAssume the Ex Ante Pareto Principle which says: If both a) the\nprospects of someone are better under policy P than\nQ, and b) no ones’ prospects are worse under Q\nthan P, then P is better than Q. (There are\nno opposed interests in the cases where this principle applies.)\nAssume there is a right to a decent minimum of economic welfare.\n(Gibbard does not argue for this right, only that this precept plus\nthe Ex Ante Pareto Principle are sufficient to establish there ought\nto be equal access to a decent minimum of care.)\nHealth insurance that it is prudent for all to buy from their\ndecent minimum defines essential health care, i.e., the decent minimum\nof health care.\nThere should be universal access to a decent minimum of health\ncare, for everyone is better off with such access and no one is worse\noff.\nThere should not, however, be equal access to all health care,\nassuming the Ex Ante Pareto Principle, for the overall package of\nhealth care it is prudent to buy will differ above the decent minimum.\nFurther, the Ex Ante Pareto Principle implies that some health care\nmay not be worth purchasing insurance for by anyone.\n\n\nSome comments will help clarify this argument sketch. First, Gibbard\nis concerned to show that this weak ethical principle has health\npolicy implications that are significant (and are noted in steps 4 and\n5). He defends the principle against anti-utilitarian arguments and\nagainst some intuitions that run counter to it but that may be\nirrational (on his view). Second, to arrive at the main conclusion in\n4—supporting universal access to a decent minimum of\ncare—Gibbard adopts an ethical precept that is sufficient to\nsupport provide a basis for a universal level of insurance purchasing.\nHe does not, as noted, argue for the specific right articulated here.\nHe might, however, try to derive some support for it from utilitarian\narguments about decreasing marginal utility of income and wealth, for\nit is weaker than the more egalitarian view that Brandt (1979) defends\non utility maximizing grounds and for which Gibbard expresses some\nsympathy.\n\nThird, the crux of the argument for the conclusion in step 4 is the\nidea that if everyone acts prudently at the decent minimum economic\nthreshold of welfare to buy some kinds of health care, what they buy,\nassuming they bear the inclusive social cost of the insurance\n(including any losses of efficiency), will constitute the decent\nminimum of care. To say it is prudent for a person to buy the\ninsurance (while bearing those costs) is (using the Ex Ante Pareto\nPrinciple) to say the person has better prospects with the insurance\nthan without and that no one is worse off as a result. Presumably,\nhowever, this requires that there be a competitive market for such\ninsurance (an assumption Dworkin had to make in his argument), and it\nis not obvious how to achieve that in light of the pervasive\nuncertainties that exist in medical markets (cf. Arrow 1963), a point\nGibbard notes.\n\nFourth, above the decent welfare minimum, it is unlikely that access\nto the some broader insurance package is prudent for all people to\nbuy. That is the reason Gibbard says it is not equitable to require\nequal access to all health care. Here equity is equated with ethically\nacceptable, and what counts as ethically acceptable is (among other\nthings) what is endorsed by the Ex Ante Pareto Principle. The same\nprinciple shows that some kinds of care are not prudent for anyone to\nbuy—prospects are better for all people if they do not buy\ninsurance for that care—and so a defense is made for some\nimplications of cost effectiveness analysis.\n\nFifth, unlike Dworkin, who admits there may be disagreements about\nwhat it is prudent to do, Gibbard does not make that concession.\nConsequently, he is not concerned, as is Dworkin (or the proponent of\naccountability for reasonableness, in the earlier argument), with\ndeveloping a way of resolving disputes about what counts as\nprudent.\n",
    "section_title": "3.2 Universal Access to Prudentially Defined Care",
    "entry_title": "Justice and Access to Health Care",
    "hierarchy_title": "Justice and Access to Health Care || Does Justice Require Universal Access to Health Care? || Universal Access to Prudentially Defined Care",
    "tokenized_text": [
        "justice",
        "require",
        "universal",
        "access",
        "health",
        "care",
        "universal",
        "access",
        "prudentially",
        "defined",
        "care",
        "universal",
        "access",
        "prudentially",
        "defined",
        "care",
        "second",
        "general",
        "line",
        "argument",
        "favor",
        "universal",
        "access",
        "form",
        "health",
        "care",
        "build",
        "idea",
        "prudent",
        "individual",
        "would",
        "insure",
        "prospect",
        "needing",
        "certain",
        "kind",
        "health",
        "care",
        "shall",
        "consider",
        "two",
        "version",
        "argument",
        "dworkin",
        "effort",
        "spell",
        "implication",
        "treating",
        "people",
        "equal",
        "respect",
        "gibbard",
        "appeal",
        "ex",
        "ante",
        "pareto",
        "optimality",
        "principle",
        "combined",
        "assumed",
        "right",
        "decent",
        "basic",
        "minimum",
        "income",
        "shall",
        "see",
        "though",
        "argument",
        "use",
        "different",
        "assumption",
        "support",
        "universal",
        "access",
        "different",
        "health",
        "care",
        "benefit",
        "package",
        "main",
        "point",
        "counter",
        "certain",
        "implausible",
        "view",
        "benefit",
        "included",
        "universal",
        "access",
        "system",
        "dworkin",
        "argument",
        "sketched",
        "follows",
        "obligation",
        "treat",
        "people",
        "equal",
        "treating",
        "people",
        "equal",
        "best",
        "achieved",
        "giving",
        "people",
        "equality",
        "resource",
        "idea",
        "theory",
        "shown",
        "coherent",
        "devising",
        "appropriate",
        "initial",
        "auction",
        "combined",
        "appropriate",
        "postauction",
        "trade",
        "insurance",
        "scheme",
        "disadvantaging",
        "outcome",
        "suppose",
        "equality",
        "resource",
        "us",
        "example",
        "income",
        "wealth",
        "equally",
        "distributed",
        "people",
        "information",
        "health",
        "care",
        "intervention",
        "effect",
        "good",
        "best",
        "doctor",
        "one",
        "prior",
        "information",
        "specific",
        "risk",
        "faced",
        "specific",
        "individual",
        "person",
        "could",
        "act",
        "prudently",
        "buy",
        "insurance",
        "protection",
        "various",
        "health",
        "need",
        "without",
        "government",
        "subsidy",
        "otherwise",
        "distorted",
        "market",
        "people",
        "would",
        "prudently",
        "insure",
        "ought",
        "included",
        "universal",
        "access",
        "health",
        "system",
        "kind",
        "protection",
        "would",
        "thus",
        "imprudent",
        "include",
        "abandon",
        "rule",
        "rescue",
        "included",
        "disagreement",
        "people",
        "count",
        "prudent",
        "insurance",
        "would",
        "buy",
        "others",
        "need",
        "consult",
        "representative",
        "people",
        "different",
        "view",
        "make",
        "decision",
        "universal",
        "coverage",
        "reflect",
        "consultation",
        "comment",
        "clarify",
        "key",
        "aspect",
        "argument",
        "first",
        "first",
        "two",
        "premise",
        "involve",
        "strong",
        "egalitarian",
        "assumption",
        "though",
        "one",
        "widely",
        "held",
        "treating",
        "people",
        "equal",
        "strong",
        "specific",
        "detailed",
        "way",
        "achieving",
        "equality",
        "resource",
        "discussion",
        "detail",
        "claim",
        "would",
        "take",
        "u",
        "well",
        "beyond",
        "scope",
        "essay",
        "suffice",
        "say",
        "argument",
        "proceed",
        "account",
        "universal",
        "access",
        "health",
        "care",
        "without",
        "general",
        "assumption",
        "view",
        "justice",
        "regard",
        "share",
        "fair",
        "equality",
        "opportunity",
        "account",
        "need",
        "borrow",
        "justification",
        "universal",
        "access",
        "general",
        "concern",
        "justice",
        "second",
        "specific",
        "assumption",
        "strong",
        "arguably",
        "realized",
        "argument",
        "presupposes",
        "thus",
        "seen",
        "analytic",
        "tool",
        "attempt",
        "say",
        "anything",
        "specific",
        "real",
        "institution",
        "could",
        "designed",
        "note",
        "strong",
        "requirement",
        "needed",
        "model",
        "universal",
        "equal",
        "access",
        "emphasizes",
        "real",
        "choice",
        "instead",
        "choice",
        "model",
        "allows",
        "income",
        "inequality",
        "need",
        "subsidy",
        "equalize",
        "affordability",
        "buying",
        "insurance",
        "equal",
        "scope",
        "aca",
        "requires",
        "insurance",
        "purchased",
        "exchange",
        "authorizes",
        "without",
        "example",
        "knowing",
        "level",
        "resource",
        "would",
        "result",
        "equalizing",
        "resource",
        "say",
        "little",
        "level",
        "insurance",
        "coverage",
        "specific",
        "condition",
        "welfare",
        "enhancing",
        "individual",
        "since",
        "feasible",
        "way",
        "meet",
        "assumption",
        "distribution",
        "medical",
        "knowledge",
        "exclusion",
        "knowledge",
        "individual",
        "risk",
        "assumption",
        "make",
        "dworkin",
        "argument",
        "completely",
        "hypothetical",
        "theoretical",
        "rather",
        "practical",
        "third",
        "assumption",
        "ideally",
        "competitive",
        "insurance",
        "market",
        "postulated",
        "fourth",
        "step",
        "argument",
        "add",
        "hypothetical",
        "nature",
        "argument",
        "whole",
        "fourth",
        "argument",
        "focus",
        "primarily",
        "personal",
        "medical",
        "service",
        "broader",
        "public",
        "health",
        "measure",
        "reduce",
        "overall",
        "risk",
        "distribute",
        "risk",
        "fairly",
        "mention",
        "intervention",
        "beyond",
        "individual",
        "treatment",
        "prevention",
        "measure",
        "thrust",
        "make",
        "clear",
        "argument",
        "insurance",
        "market",
        "measure",
        "thrust",
        "step",
        "make",
        "clearer",
        "point",
        "argument",
        "clarify",
        "defensible",
        "content",
        "universal",
        "access",
        "benefit",
        "package",
        "would",
        "include",
        "specifically",
        "argument",
        "aim",
        "establish",
        "need",
        "plausible",
        "view",
        "owe",
        "way",
        "providing",
        "health",
        "care",
        "indefensible",
        "view",
        "rescue",
        "someone",
        "death",
        "disability",
        "must",
        "provided",
        "regardless",
        "cost",
        "opportunity",
        "cost",
        "version",
        "prudential",
        "insurance",
        "argument",
        "universal",
        "coverage",
        "rest",
        "weaker",
        "assumption",
        "right",
        "decent",
        "minimum",
        "income",
        "gibbard",
        "discussion",
        "assumption",
        "invoked",
        "argued",
        "like",
        "argument",
        "main",
        "thrust",
        "gibbard",
        "argument",
        "lie",
        "implication",
        "content",
        "universal",
        "access",
        "benefit",
        "package",
        "assume",
        "ex",
        "ante",
        "pareto",
        "principle",
        "say",
        "prospect",
        "someone",
        "better",
        "policy",
        "p",
        "q",
        "b",
        "one",
        "prospect",
        "worse",
        "q",
        "p",
        "p",
        "better",
        "q",
        "opposed",
        "interest",
        "case",
        "principle",
        "applies",
        "assume",
        "right",
        "decent",
        "minimum",
        "economic",
        "welfare",
        "gibbard",
        "argue",
        "right",
        "precept",
        "plus",
        "ex",
        "ante",
        "pareto",
        "principle",
        "sufficient",
        "establish",
        "ought",
        "equal",
        "access",
        "decent",
        "minimum",
        "care",
        "health",
        "insurance",
        "prudent",
        "buy",
        "decent",
        "minimum",
        "defines",
        "essential",
        "health",
        "care",
        "ie",
        "decent",
        "minimum",
        "health",
        "care",
        "universal",
        "access",
        "decent",
        "minimum",
        "health",
        "care",
        "everyone",
        "better",
        "access",
        "one",
        "worse",
        "however",
        "equal",
        "access",
        "health",
        "care",
        "assuming",
        "ex",
        "ante",
        "pareto",
        "principle",
        "overall",
        "package",
        "health",
        "care",
        "prudent",
        "buy",
        "differ",
        "decent",
        "minimum",
        "ex",
        "ante",
        "pareto",
        "principle",
        "implies",
        "health",
        "care",
        "may",
        "worth",
        "purchasing",
        "insurance",
        "anyone",
        "comment",
        "help",
        "clarify",
        "argument",
        "sketch",
        "first",
        "gibbard",
        "concerned",
        "show",
        "weak",
        "ethical",
        "principle",
        "health",
        "policy",
        "implication",
        "significant",
        "noted",
        "step",
        "defends",
        "principle",
        "antiutilitarian",
        "argument",
        "intuition",
        "run",
        "counter",
        "may",
        "irrational",
        "view",
        "second",
        "arrive",
        "main",
        "conclusion",
        "supporting",
        "universal",
        "access",
        "decent",
        "minimum",
        "caregibbard",
        "adopts",
        "ethical",
        "precept",
        "sufficient",
        "support",
        "provide",
        "basis",
        "universal",
        "level",
        "insurance",
        "purchasing",
        "noted",
        "argue",
        "specific",
        "right",
        "articulated",
        "might",
        "however",
        "try",
        "derive",
        "support",
        "utilitarian",
        "argument",
        "decreasing",
        "marginal",
        "utility",
        "income",
        "wealth",
        "weaker",
        "egalitarian",
        "view",
        "brandt",
        "defends",
        "utility",
        "maximizing",
        "ground",
        "gibbard",
        "express",
        "sympathy",
        "third",
        "crux",
        "argument",
        "conclusion",
        "step",
        "idea",
        "everyone",
        "act",
        "prudently",
        "decent",
        "minimum",
        "economic",
        "threshold",
        "welfare",
        "buy",
        "kind",
        "health",
        "care",
        "buy",
        "assuming",
        "bear",
        "inclusive",
        "social",
        "cost",
        "insurance",
        "including",
        "loss",
        "efficiency",
        "constitute",
        "decent",
        "minimum",
        "care",
        "say",
        "prudent",
        "person",
        "buy",
        "insurance",
        "bearing",
        "cost",
        "using",
        "ex",
        "ante",
        "pareto",
        "principle",
        "say",
        "person",
        "better",
        "prospect",
        "insurance",
        "without",
        "one",
        "worse",
        "result",
        "presumably",
        "however",
        "requires",
        "competitive",
        "market",
        "insurance",
        "assumption",
        "dworkin",
        "make",
        "argument",
        "obvious",
        "achieve",
        "light",
        "pervasive",
        "uncertainty",
        "exist",
        "medical",
        "market",
        "cf",
        "arrow",
        "point",
        "gibbard",
        "note",
        "fourth",
        "decent",
        "welfare",
        "minimum",
        "unlikely",
        "access",
        "broader",
        "insurance",
        "package",
        "prudent",
        "people",
        "buy",
        "reason",
        "gibbard",
        "say",
        "equitable",
        "require",
        "equal",
        "access",
        "health",
        "care",
        "equity",
        "equated",
        "ethically",
        "acceptable",
        "count",
        "ethically",
        "acceptable",
        "among",
        "thing",
        "endorsed",
        "ex",
        "ante",
        "pareto",
        "principle",
        "principle",
        "show",
        "kind",
        "care",
        "prudent",
        "anyone",
        "buyprospects",
        "better",
        "people",
        "buy",
        "insurance",
        "careand",
        "defense",
        "made",
        "implication",
        "cost",
        "effectiveness",
        "analysis",
        "fifth",
        "unlike",
        "dworkin",
        "admits",
        "may",
        "disagreement",
        "prudent",
        "gibbard",
        "make",
        "concession",
        "consequently",
        "concerned",
        "dworkin",
        "proponent",
        "accountability",
        "reasonableness",
        "earlier",
        "argument",
        "developing",
        "way",
        "resolving",
        "dispute",
        "count",
        "prudent"
    ]
}