{
    "main_text": "Lustration || Criticisms of Lustration\n5. Forgetting\n\n\nHaving examined, in some detail, three of the most important ways in\nwhich nations can come to terms with their past, it is perhaps fitting\nto conclude this entry by considering the possibility that nations do\nnot attempt such a reckoning. Is there anything to be said for\nforgetting in the aftermath of war? Is there an argument to recommend\namnesia as the basis of a political transition? (for a detailed\ntreatment see Rotondi and Eisikovits, forthcoming). \n\n\nMost often, forgetting cannot serve as the basis for peacemaking. It\nis destructive on both the individual and collective levels. It\ncompounds the suffering of individuals by forcing them to watch their\ntormentors walk around freely, reenter politics, or maintain their\nposts in public service and the military. All of this takes place\nwhile their own painful memories and traumas remain unacknowledged.\nFurthermore, policies advocating forgetfulness decrease the chances\nthat victims will be compensated for their suffering. The most common\ninstitutional products of such policies are laws granting amnesty.\nTypically, under such amnesties, perpetrators are protected from both\ncriminal charges and civil liability. Amanda Pike, a reporter for PBS'\nFrontline, tells a story which starkly demonstrates the cost of\nforgetfulness for individual victims. During a trip through the\nCambodian province of Pailin, Pike came across Samrith Phum, whose\nhusband was executed by the Khmer Rouge. Phum knows the murderer well.\nHe is her neighbor and he operates a noodle shop across the street\nfrom her house. He was never arrested and never charged with her\nhusband's murder. There is no procedure through which he can be sued\nfor damages.  Phum must simply get used to the idea that her husband's\nkiller quietly manages his store next door (Pike 2002).\n\n\nOn the national level, a government advocating forgetfulness commits\nthe political correlate of suicide: it undermines the ability of the\ngroup of people it governs to call itself a nation. The French thinker\nErnest Renan (1882) defined a nation as consisting of\n two things, which, in truth, are really just\none…One is in the past, the other in the present. One is the\npossession in common of a rich legacy of memories; the other is\ncurrent consent, the desire to live together, the willingness to\ncontinue to maintain the value of the heritage that one has received\nas a common possession.\n\nForgetting destroys both elements. It undermines the possibility of a\ncommon history by excluding an entire class of memories. At the same\ntime, it obliterates the desire of formerly hostile parties to live\ntogether, or the possibility of social solidarity, by creating a\nbubbling, poisonous, pool of resentment among an entire group of\n\n people.[39]\n\n Now Renan was far from naïve. He admits that\n“forgetting” and perhaps even “historical\nerror” are essential in the creation of national identity. Later\nhe adds that “the essence of a nation is that all individuals\nhave many things in common and also that they have forgotten many\nthings.” Descriptively, he is surely right. Heroic\nhistoriography and intentional forgetting was instrumental in creating\nAmerican, Israeli, Turkish, Spanish, and French contemporary\nidentities, to mention but a few. But identities based on amnesia are\nrarely stable.  Israel's new historians, the countless young Armenians\nlobbying parliaments all over the world to recognize the Armenian\ngenocide almost a century after it took place, and the recent Spanish\n“Historical Memory Law” (2007) all attest that it is\ndifficult to simply bury the past. If the groups that have been\nforgotten are not annihilated, their painful memories continue to\nfester until they eventually erupt in renewed conflict.\n\n\nBut what if all parties involved in a conflict really want to forget?\nWhat if there is a tacit or explicit agreement not to dwell on the\npast? What are we to make of Mozambique, for example, where in the\naftermath of a long, bloody civil war, the combatants actively elected\nnot to address past atrocities? In her superb book on truth\ncommissions, Hayner (2002) describes an election rally in post-war\nMozambique in which a candidate was literally chased out of a hall for\nbringing up the conflict. Can we really make a normative argument for\nremembering if both sides freely chose to forget? One possible way to\nmake such an argument is by analogy. It is quite clear to us that, in\nthe domestic context, the fact that two sides to a conflict agree to\nbury the hatchet does not preclude their prosecution by the criminal\njustice authorities. Thus, if two neighboring families become\nentangled in a massive brawl, during which property on both sides is\ndestroyed, and some injuries are sustained, the District Attorney's\noffice may decide to issue indictments, even if all of those who did\nthe fighting would like to put the whole incident behind them. The\ncriminal law is not a private matter completely at the discretion of\ncitizens. The public has a stake in upholding the criminal law, and is\nunderstood to be an interested party whenever it is broken. After all,\nin the example provided above, wider interests were compromised:\ntraffic may have been disturbed by the fighting, the small children of\nother neighbors may have been watching, publicly funded hospitals may\nhave been called on to treat the injured, reports of the fight may\nhave made their way into the news media bringing down house prices,\netc. In short, the fight, almost any fight, has repercussions for\nthird parties. That is why, in important ways, such fights are\neveryone's business. And that is why criminal cases are typically\ntitled Commonwealth vs. Jones rather than Smith vs.  Jones.\n\n\nIs there an analogous argument to be made about the aftermath of\npolitical conflict? Are there any third party interests that may\njustify some kind of reckoning with mass atrocity, even if all of\nthose involved would freely choose to put the past behind them? Fully\nanswering this question is beyond the scope of this entry, so we shall\nsimply gesture at some of the difficulties that need to be addressed\nin order to do justice to it.\n\n\nFirst, who are the third parties whose interests are implicated by a\ndecision on the part of two warring parties to bury the past? Could we\nargue that, given the intense media coverage given to political\nconflicts, a failure to address massive violations of human rights in\nlocation X (for whatever reason) may endanger human rights in\nlocation Y (by, say, bolstering the confidence of would be\nperpetrators)? If so the third party could be described, vaguely, as\nthe international community, a community with a serious interest in\ncreating a robust culture of human rights wherein violations are\ndocumented and addressed rather than simply ignored.\n\n\nSecond, even if we agree that there are interested third parties in\nthe international context, how could such parties ensure that their\ninterests are protected? What sort of enforcement power do they have?\nHere the answers are both legal and political. The nascent\nInternational Criminal Court may be used in cases where its authority\ncomes into play. Perhaps more significantly, the international\ncommunity (or, more specifically, the most powerful international\nplayers) may resort to political pressure. After all, countries such\nas Mozambique, emerging from prolonged wars, are desperately dependent\non international aid. Donor countries could, accordingly, make aid\ncontingent on the addressing of past atrocities.\n When all is said and done, it appears that the main difference\nbetween the domestic and international cases has to do with the\nconsequences of the decision whether to use the courts. While in the\ndomestic arena a failure to prosecute can result in increased cynicism\nabout the law (and eventually in a weakening of the rule of law),\nimposing accountability in the aftermath of war may, under some\ncircumstances, reignite violence. Insisting on doing justice in such\ncases recalls Lord Mansfield's famous dictum in the 1772 Somerset\ncase: that justice must be done “though the heavens may\nfall.” The trouble, of course, with this Kantian pronouncement\nis that there is no one to reap the fruits of justice after the\nheavens have fallen.\n",
    "section_title": "5. Forgetting",
    "entry_title": "Transitional Justice",
    "hierarchy_title": "Transitional Justice || Lustration || Criticisms of Lustration",
    "tokenized_text": [
        "lustration",
        "criticism",
        "lustration",
        "forgetting",
        "examined",
        "detail",
        "three",
        "important",
        "way",
        "nation",
        "come",
        "term",
        "past",
        "perhaps",
        "fitting",
        "conclude",
        "entry",
        "considering",
        "possibility",
        "nation",
        "attempt",
        "reckoning",
        "anything",
        "said",
        "forgetting",
        "aftermath",
        "war",
        "argument",
        "recommend",
        "amnesia",
        "basis",
        "political",
        "transition",
        "detailed",
        "treatment",
        "see",
        "rotondi",
        "eisikovits",
        "forthcoming",
        "often",
        "forgetting",
        "serve",
        "basis",
        "peacemaking",
        "destructive",
        "individual",
        "collective",
        "level",
        "compound",
        "suffering",
        "individual",
        "forcing",
        "watch",
        "tormentor",
        "walk",
        "around",
        "freely",
        "reenter",
        "politics",
        "maintain",
        "post",
        "public",
        "service",
        "military",
        "take",
        "place",
        "painful",
        "memory",
        "trauma",
        "remain",
        "unacknowledged",
        "furthermore",
        "policy",
        "advocating",
        "forgetfulness",
        "decrease",
        "chance",
        "victim",
        "compensated",
        "suffering",
        "common",
        "institutional",
        "product",
        "policy",
        "law",
        "granting",
        "amnesty",
        "typically",
        "amnesty",
        "perpetrator",
        "protected",
        "criminal",
        "charge",
        "civil",
        "liability",
        "amanda",
        "pike",
        "reporter",
        "pb",
        "frontline",
        "tell",
        "story",
        "starkly",
        "demonstrates",
        "cost",
        "forgetfulness",
        "individual",
        "victim",
        "trip",
        "cambodian",
        "province",
        "pailin",
        "pike",
        "came",
        "across",
        "samrith",
        "phum",
        "whose",
        "husband",
        "executed",
        "khmer",
        "rouge",
        "phum",
        "know",
        "murderer",
        "well",
        "neighbor",
        "operates",
        "noodle",
        "shop",
        "across",
        "street",
        "house",
        "never",
        "arrested",
        "never",
        "charged",
        "husband",
        "s",
        "murder",
        "procedure",
        "sued",
        "damage",
        "phum",
        "must",
        "simply",
        "get",
        "used",
        "idea",
        "husband",
        "s",
        "killer",
        "quietly",
        "manages",
        "store",
        "next",
        "door",
        "pike",
        "national",
        "level",
        "government",
        "advocating",
        "forgetfulness",
        "commits",
        "political",
        "correlate",
        "suicide",
        "undermines",
        "ability",
        "group",
        "people",
        "governs",
        "call",
        "nation",
        "french",
        "thinker",
        "ernest",
        "renan",
        "defined",
        "nation",
        "consisting",
        "two",
        "thing",
        "truth",
        "really",
        "oneone",
        "past",
        "present",
        "one",
        "possession",
        "common",
        "rich",
        "legacy",
        "memory",
        "current",
        "consent",
        "desire",
        "live",
        "together",
        "willingness",
        "continue",
        "maintain",
        "value",
        "heritage",
        "one",
        "received",
        "common",
        "possession",
        "forgetting",
        "destroys",
        "element",
        "undermines",
        "possibility",
        "common",
        "history",
        "excluding",
        "entire",
        "class",
        "memory",
        "time",
        "obliterates",
        "desire",
        "formerly",
        "hostile",
        "party",
        "live",
        "together",
        "possibility",
        "social",
        "solidarity",
        "creating",
        "bubbling",
        "poisonous",
        "pool",
        "resentment",
        "among",
        "entire",
        "group",
        "people",
        "renan",
        "far",
        "naïve",
        "admits",
        "forgetting",
        "perhaps",
        "even",
        "historical",
        "error",
        "essential",
        "creation",
        "national",
        "identity",
        "later",
        "add",
        "essence",
        "nation",
        "individual",
        "many",
        "thing",
        "common",
        "also",
        "forgotten",
        "many",
        "things",
        "descriptively",
        "surely",
        "right",
        "heroic",
        "historiography",
        "intentional",
        "forgetting",
        "instrumental",
        "creating",
        "american",
        "israeli",
        "turkish",
        "spanish",
        "french",
        "contemporary",
        "identity",
        "mention",
        "identity",
        "based",
        "amnesia",
        "rarely",
        "stable",
        "israel",
        "s",
        "new",
        "historian",
        "countless",
        "young",
        "armenian",
        "lobbying",
        "parliament",
        "world",
        "recognize",
        "armenian",
        "genocide",
        "almost",
        "century",
        "took",
        "place",
        "recent",
        "spanish",
        "historical",
        "memory",
        "law",
        "attest",
        "difficult",
        "simply",
        "bury",
        "past",
        "group",
        "forgotten",
        "annihilated",
        "painful",
        "memory",
        "continue",
        "fester",
        "eventually",
        "erupt",
        "renewed",
        "conflict",
        "party",
        "involved",
        "conflict",
        "really",
        "want",
        "forget",
        "tacit",
        "explicit",
        "agreement",
        "dwell",
        "past",
        "make",
        "mozambique",
        "example",
        "aftermath",
        "long",
        "bloody",
        "civil",
        "war",
        "combatant",
        "actively",
        "elected",
        "address",
        "past",
        "atrocity",
        "superb",
        "book",
        "truth",
        "commission",
        "hayner",
        "describes",
        "election",
        "rally",
        "postwar",
        "mozambique",
        "candidate",
        "literally",
        "chased",
        "hall",
        "bringing",
        "conflict",
        "really",
        "make",
        "normative",
        "argument",
        "remembering",
        "side",
        "freely",
        "chose",
        "forget",
        "one",
        "possible",
        "way",
        "make",
        "argument",
        "analogy",
        "quite",
        "clear",
        "u",
        "domestic",
        "context",
        "fact",
        "two",
        "side",
        "conflict",
        "agree",
        "bury",
        "hatchet",
        "preclude",
        "prosecution",
        "criminal",
        "justice",
        "authority",
        "thus",
        "two",
        "neighboring",
        "family",
        "become",
        "entangled",
        "massive",
        "brawl",
        "property",
        "side",
        "destroyed",
        "injury",
        "sustained",
        "district",
        "attorney",
        "s",
        "office",
        "may",
        "decide",
        "issue",
        "indictment",
        "even",
        "fighting",
        "would",
        "like",
        "put",
        "whole",
        "incident",
        "behind",
        "criminal",
        "law",
        "private",
        "matter",
        "completely",
        "discretion",
        "citizen",
        "public",
        "stake",
        "upholding",
        "criminal",
        "law",
        "understood",
        "interested",
        "party",
        "whenever",
        "broken",
        "example",
        "provided",
        "wider",
        "interest",
        "compromised",
        "traffic",
        "may",
        "disturbed",
        "fighting",
        "small",
        "child",
        "neighbor",
        "may",
        "watching",
        "publicly",
        "funded",
        "hospital",
        "may",
        "called",
        "treat",
        "injured",
        "report",
        "fight",
        "may",
        "made",
        "way",
        "news",
        "medium",
        "bringing",
        "house",
        "price",
        "etc",
        "short",
        "fight",
        "almost",
        "fight",
        "repercussion",
        "third",
        "party",
        "important",
        "way",
        "fight",
        "everyone",
        "s",
        "business",
        "criminal",
        "case",
        "typically",
        "titled",
        "commonwealth",
        "vs",
        "jones",
        "rather",
        "smith",
        "vs",
        "jones",
        "analogous",
        "argument",
        "made",
        "aftermath",
        "political",
        "conflict",
        "third",
        "party",
        "interest",
        "may",
        "justify",
        "kind",
        "reckoning",
        "mass",
        "atrocity",
        "even",
        "involved",
        "would",
        "freely",
        "choose",
        "put",
        "past",
        "behind",
        "fully",
        "answering",
        "question",
        "beyond",
        "scope",
        "entry",
        "shall",
        "simply",
        "gesture",
        "difficulty",
        "need",
        "addressed",
        "order",
        "justice",
        "first",
        "third",
        "party",
        "whose",
        "interest",
        "implicated",
        "decision",
        "part",
        "two",
        "warring",
        "party",
        "bury",
        "past",
        "could",
        "argue",
        "given",
        "intense",
        "medium",
        "coverage",
        "given",
        "political",
        "conflict",
        "failure",
        "address",
        "massive",
        "violation",
        "human",
        "right",
        "location",
        "x",
        "whatever",
        "reason",
        "may",
        "endanger",
        "human",
        "right",
        "location",
        "say",
        "bolstering",
        "confidence",
        "would",
        "perpetrator",
        "third",
        "party",
        "could",
        "described",
        "vaguely",
        "international",
        "community",
        "community",
        "serious",
        "interest",
        "creating",
        "robust",
        "culture",
        "human",
        "right",
        "wherein",
        "violation",
        "documented",
        "addressed",
        "rather",
        "simply",
        "ignored",
        "second",
        "even",
        "agree",
        "interested",
        "third",
        "party",
        "international",
        "context",
        "could",
        "party",
        "ensure",
        "interest",
        "protected",
        "sort",
        "enforcement",
        "power",
        "answer",
        "legal",
        "political",
        "nascent",
        "international",
        "criminal",
        "court",
        "may",
        "used",
        "case",
        "authority",
        "come",
        "play",
        "perhaps",
        "significantly",
        "international",
        "community",
        "specifically",
        "powerful",
        "international",
        "player",
        "may",
        "resort",
        "political",
        "pressure",
        "country",
        "mozambique",
        "emerging",
        "prolonged",
        "war",
        "desperately",
        "dependent",
        "international",
        "aid",
        "donor",
        "country",
        "could",
        "accordingly",
        "make",
        "aid",
        "contingent",
        "addressing",
        "past",
        "atrocity",
        "said",
        "done",
        "appears",
        "main",
        "difference",
        "domestic",
        "international",
        "case",
        "consequence",
        "decision",
        "whether",
        "use",
        "court",
        "domestic",
        "arena",
        "failure",
        "prosecute",
        "result",
        "increased",
        "cynicism",
        "law",
        "eventually",
        "weakening",
        "rule",
        "law",
        "imposing",
        "accountability",
        "aftermath",
        "war",
        "may",
        "circumstance",
        "reignite",
        "violence",
        "insisting",
        "justice",
        "case",
        "recall",
        "lord",
        "mansfield",
        "s",
        "famous",
        "dictum",
        "somerset",
        "case",
        "justice",
        "must",
        "done",
        "though",
        "heaven",
        "may",
        "fall",
        "trouble",
        "course",
        "kantian",
        "pronouncement",
        "one",
        "reap",
        "fruit",
        "justice",
        "heaven",
        "fallen"
    ]
}