{
    "main_text": "The Soul and Rational Psychology\n3. The Soul and Rational Psychology\n\nOne historically predominant metaphysical interest has to do with\nidentifying the nature and the constitution of the soul. Partly for\npractical reasons, partly for theoretical explanation, reason forms\nthe idea of a metaphysically simple being, the soul. Such an idea is\nmotivated by reason’s demand for the unconditioned. Kant puts\nthis point in a number of ways, suggesting that the idea of the soul\nis one to which we are led necessarily insofar as we are constrained\nby reason to seek the “totality” of the “synthesis\nof conditions of a thought in general” (A397), or insofar as we\nseek to represent “the unconditioned unity” of\n“subjective conditions of representations in general”\n(A406/B433). More straightforwardly, Kant states that a metaphysics of\nthe soul is generated by the demand for the “absolute\n(unconditioned) unity of the thinking subject itself”\n(A334/B391). The branch of metaphysics devoted to this topic is\nRational Psychology. Rational psychologists, among whom Descartes or\nLeibniz would serve as apt historical examples, seek to demonstrate,\nfor example, the substantiality, simplicity, and personal identity of\nthe soul. Each such inference, however, involves concluding\n“from the transcendental concept of the subject, which contains\nnothing manifold, the absolute unity of this subject itself, of which\nI possess no concept whatsoever” (A340/B398). In other words,\nKant takes the rational psychologist to slide (mistakenly) from formal\nfeatures of our self concept to material or substantive metaphysical\nclaims about an alleged (super-sensible) object (the soul).\n\nAn essential aspect of all these arguments, according to Kant, is\ntheir attempt to derive conclusions about the nature and constitution\nof the “soul” a priori, simply from an analysis\nof the activity of thinking. A classic example of such an attempt is\nprovided by Descartes, who deduced the substantiality of the self from\nthe proposition (or, perhaps better, the activity) “I\nthink.” This move is apparent in the Cartesian inference from\n“I think” to the claim that the “I” is\ntherefore “a thing” that thinks. For Descartes, this move\nis unproblematic: thought is an attribute, and thus presupposes a\nsubstance in which it inheres. Kant emphasizes the a priori\nbasis for the metaphysical doctrine of the soul by claiming that in\nrational psychology, the “I think” is supposed to provide\nthe “sole text” (A343–4/B401–02). It is this\nfeature of the discipline that serves to distinguish it from any\nempirical doctrine of the self (any empirical psychology), and which\nsecures its status as a “metaphysics” that purports to\nprovide synthetic a priori knowledge.\n\nKant’s criticisms of rational psychology draw on a number of\ndistinct sources, one of which is the Kantian doctrine of\napperception, or transcendental self-consciousness (often formulated\nin terms of the necessary possibility of attaching the “I\nthink” to all my representations (B132)). Kant denies that the\nmetaphysician is entitled to his substantive conclusions on the\ngrounds that the activity of self-consciousness does not yield any\nobject for thought. Nevertheless, reason is guided by its projecting\nand objectifying propensities. In accordance with these,\nself-consciousness is “hypostatized,” or objectified. Here\nagain, Kant claims that a “natural illusion” compels us to\ntake the apperceived unity of consciousness as an intuition of an\nobject (A402). The ineliminably subjective nature of\nself-consciousness, and the elusiveness of the “I” in the\ncontext of that activity, are thus the well known bases for\nKant’s response to rational psychology, and the doctrine of\napperception plays an important role in Kant’s rejection. For in\neach case, Kant thinks that a feature of self-consciousness (the\nessentially subjectival, unitary and identical nature of the\n“I” of apperception) gets transmuted into a metaphysics of\na self (as an object) that is ostensibly “known” through\nreason alone to be substantial, simple, identical, etc. This slide\nfrom the “I” of apperception to the constitution of an\nobject (the soul) has received considerable attention in the secondary\nliterature, and has fueled a great deal of attention to the Kantian\ntheory of mind and mental activity.\n\nThe claim that the ‘I’ of apperception yields no object of\nknowledge (for it is not itself an object, but only the\n“vehicle” for any representation of objectivity as such)\nis fundamental to Kant’s critique of rational psychology. Kant\nthus spends a considerable amount of time arguing that no object is\ngiven in transcendental self-consciousness, and thus that the rational\npsychologist’s efforts to discern features of the self,\nconstrued as a metaphysical entity, through reason alone are without\nmerit. To elucidate the ways in which the rational psychologist is\nnevertheless seduced into making this slide from formal\nrepresentations of self consciousness to a metaphysics of the self,\nKant examines each of the psychological arguments, maintaining that\nall such arguments about the soul are dialectical. He refers to the\narguments designed to draw such conclusions, “transcendental\nparalogisms”, and hence the chapter of the Critique that\ncriticizes rational psychology goes by the name “The Paralogisms\nof Pure Reason.” A transcendental paralogism, according to Kant,\nis a “syllogism in which one is constrained, by a transcendental\nground, to draw a formally invalid conclusion” (A341/B399).\nKant’s subsequent efforts are thus directed towards\ndemonstrating the paralogistic (fallacious) nature of the arguments\nabout the soul.\n\nKant’s diagnosis of the fallacies has received considerable\nattention, and has generated considerable controversy. In each case,\nKant tells us, the argument is guilty of the fallacy of sophisma\nfigurae dictionis, or the fallacy of\nequivocation/ambiguous middle. Kant suggests that in each of the\nsyllogisms, a term is used in different senses in the major and minor\npremises. Consider the first paralogism, the argument that allegedly\ndeduces the substantiality of the soul. In the A edition, Kant\nformulates the argument as follows:\n\n\nThat the representation of which is the absolute subject of our\njudgments and cannot be employed as determination of any other thing,\nis substance.\n\nI, as thinking being, am the absolute subject of all my possible\njudgments and this representation of myself cannot be employed as\ndetermination of any other thing.\n\nTherefore, I, as thinking being (soul), am substance. (A349)\n\n\nKant locates the equivocation contained in the argument in the use of\nthe term “substance.” According to Kant, the major premise\nuses this term “transcendentally” whereas the minor\npremise and conclusion use the same term “empirically.”\n(A403). What Kant appears to mean is this: the major premise deploys\nthe term “substance” in a very general way, one which\nabstracts from the conditions of our sensible intuition (space and\ntime). As such, the major premise simply offers the most general\ndefinition of substance, and thus expresses the most general rule in\naccordance with which objects might be able to be thought as\nsubstances. Nevertheless, in order to apply the concept of substance\nin such a way as to determine an object, the category would have to be\nused empirically. Unfortunately, such an empirical use is precluded by\nthe fact that the alleged object to which it is being applied is not\nempirical. Even more problematically, on Kant’s view, there is\nno object given at all. In Kantian jargon, the category only\nyields knowledge of objects if it is “schematized,”\napplied to given objects under the conditions of time.\n\nThis same kind of complaint is lodged against each of the paralogistic\nsyllogisms that characterize Rational Psychology. Thus, Kant argues\nagainst the inference to the simplicity of the soul, by remarking that\nthe psychologist surreptitiously deduces the actual simplicity of a\nmetaphysical object simply from the formal features of subjectivity\n(the fact that the “I” is unitary in our representational\neconomy). The personal identity of the soul is attacked on similar\ngrounds. In each case the metaphysical conclusion is said to be drawn\nonly by an equivocation in the use or meaning of a concept of the\nunderstanding.\n\nThis illustrates Kant’s efforts to demonstrate the fallacious\nnature of the arguments that characterize metaphysics, as well as his\ninterest in identifying the sources of such errors. Given this,\nKant’s criticisms of rational psychology are not as\nstraightforward as one might expect, for embedded in his criticisms of\nrational psychology are actually a number of distinct charges: 1) The\nidea of the soul, although it is one to which we are naturally led in\nour quest for the unconditioned ground of thought, does not correspond\nto any object that is (or could be) actually given to us in\nintuition. The hypostatization of this idea, therefore, although it\nmay be natural, is deeply problematic. 2) Because the idea of the soul\ndoes not yield, by itself alone, any knowable object, the arguments\nabout it, although they may have the appearance of being legitimate,\nin fact involve dialectical applications of concepts. The arguments,\nin other words, involve fallacies that vitiate their conclusions. 3)\nThe arguments are traceable back to certain features of human reason\nthat may not be eradicated, but that can and ought to be curbed and\ncritically reinterpreted. More specifically, the demand for the\nunconditioned, and the idea of the soul to which it gives rise, may be\nconstrued regulatively as devices for guiding inquiries, but never\nconstitutively — never, that is, as yielding grounds for any a\npriori synthetic knowledge of a metaphysical self given immediately to\npure reason.\n\nKant’s Paralogisms have received considerable and focused\nattention in the secondary literature. See Ameriks (1992), Brook\n(1994), Kitcher, Patricia (1990), Powell (1990), Sellars (1969, 1971),\nWolff, R. P. (1963). There are also excellent discussions to be found\nin Allison (1983, 2004), Bennett (1974), Buroker (2006), Grier (2001,\nforthcoming), Guyer (1987), Wuerth (2010, 2021) (2010), Bird (2006), Ameriks\n(2006), Melnick (2006), Dyck (2014), Proops (2010), Willaschek (2018)\n",
    "section_title": "3. The Soul and Rational Psychology",
    "entry_title": "Kant’s Critique of Metaphysics",
    "hierarchy_title": "Kant’s Critique of Metaphysics || The Soul and Rational Psychology",
    "tokenized_text": [
        "soul",
        "rational",
        "psychology",
        "soul",
        "rational",
        "psychology",
        "one",
        "historically",
        "predominant",
        "metaphysical",
        "interest",
        "identifying",
        "nature",
        "constitution",
        "soul",
        "partly",
        "practical",
        "reason",
        "partly",
        "theoretical",
        "explanation",
        "reason",
        "form",
        "idea",
        "metaphysically",
        "simple",
        "soul",
        "idea",
        "motivated",
        "reason",
        "demand",
        "unconditioned",
        "kant",
        "put",
        "point",
        "number",
        "way",
        "suggesting",
        "idea",
        "soul",
        "one",
        "led",
        "necessarily",
        "insofar",
        "constrained",
        "reason",
        "seek",
        "totality",
        "synthesis",
        "condition",
        "thought",
        "general",
        "a",
        "insofar",
        "seek",
        "represent",
        "unconditioned",
        "unity",
        "subjective",
        "condition",
        "representation",
        "general",
        "ab",
        "straightforwardly",
        "kant",
        "state",
        "metaphysics",
        "soul",
        "generated",
        "demand",
        "absolute",
        "unconditioned",
        "unity",
        "thinking",
        "subject",
        "ab",
        "branch",
        "metaphysics",
        "devoted",
        "topic",
        "rational",
        "psychology",
        "rational",
        "psychologist",
        "among",
        "descartes",
        "leibniz",
        "would",
        "serve",
        "apt",
        "historical",
        "example",
        "seek",
        "demonstrate",
        "example",
        "substantiality",
        "simplicity",
        "personal",
        "identity",
        "soul",
        "inference",
        "however",
        "involves",
        "concluding",
        "transcendental",
        "concept",
        "subject",
        "contains",
        "nothing",
        "manifold",
        "absolute",
        "unity",
        "subject",
        "posse",
        "concept",
        "whatsoever",
        "ab",
        "word",
        "kant",
        "take",
        "rational",
        "psychologist",
        "slide",
        "mistakenly",
        "formal",
        "feature",
        "self",
        "concept",
        "material",
        "substantive",
        "metaphysical",
        "claim",
        "alleged",
        "supersensible",
        "object",
        "soul",
        "essential",
        "aspect",
        "argument",
        "according",
        "kant",
        "attempt",
        "derive",
        "conclusion",
        "nature",
        "constitution",
        "soul",
        "priori",
        "simply",
        "analysis",
        "activity",
        "thinking",
        "classic",
        "example",
        "attempt",
        "provided",
        "descartes",
        "deduced",
        "substantiality",
        "self",
        "proposition",
        "perhaps",
        "better",
        "activity",
        "think",
        "move",
        "apparent",
        "cartesian",
        "inference",
        "think",
        "claim",
        "therefore",
        "thing",
        "think",
        "descartes",
        "move",
        "unproblematic",
        "thought",
        "attribute",
        "thus",
        "presupposes",
        "substance",
        "inheres",
        "kant",
        "emphasizes",
        "priori",
        "basis",
        "metaphysical",
        "doctrine",
        "soul",
        "claiming",
        "rational",
        "psychology",
        "think",
        "supposed",
        "provide",
        "sole",
        "text",
        "ab",
        "feature",
        "discipline",
        "serf",
        "distinguish",
        "empirical",
        "doctrine",
        "self",
        "empirical",
        "psychology",
        "secures",
        "status",
        "metaphysics",
        "purport",
        "provide",
        "synthetic",
        "priori",
        "knowledge",
        "kant",
        "criticism",
        "rational",
        "psychology",
        "draw",
        "number",
        "distinct",
        "source",
        "one",
        "kantian",
        "doctrine",
        "apperception",
        "transcendental",
        "selfconsciousness",
        "often",
        "formulated",
        "term",
        "necessary",
        "possibility",
        "attaching",
        "think",
        "representation",
        "b",
        "kant",
        "denies",
        "metaphysician",
        "entitled",
        "substantive",
        "conclusion",
        "ground",
        "activity",
        "selfconsciousness",
        "yield",
        "object",
        "thought",
        "nevertheless",
        "reason",
        "guided",
        "projecting",
        "objectifying",
        "propensity",
        "accordance",
        "selfconsciousness",
        "hypostatized",
        "objectified",
        "kant",
        "claim",
        "natural",
        "illusion",
        "compels",
        "u",
        "take",
        "apperceived",
        "unity",
        "consciousness",
        "intuition",
        "object",
        "a",
        "ineliminably",
        "subjective",
        "nature",
        "selfconsciousness",
        "elusiveness",
        "context",
        "activity",
        "thus",
        "well",
        "known",
        "base",
        "kant",
        "response",
        "rational",
        "psychology",
        "doctrine",
        "apperception",
        "play",
        "important",
        "role",
        "kant",
        "rejection",
        "case",
        "kant",
        "think",
        "feature",
        "selfconsciousness",
        "essentially",
        "subjectival",
        "unitary",
        "identical",
        "nature",
        "apperception",
        "get",
        "transmuted",
        "metaphysics",
        "self",
        "object",
        "ostensibly",
        "known",
        "reason",
        "alone",
        "substantial",
        "simple",
        "identical",
        "etc",
        "slide",
        "apperception",
        "constitution",
        "object",
        "soul",
        "received",
        "considerable",
        "attention",
        "secondary",
        "literature",
        "fueled",
        "great",
        "deal",
        "attention",
        "kantian",
        "theory",
        "mind",
        "mental",
        "activity",
        "claim",
        "apperception",
        "yield",
        "object",
        "knowledge",
        "object",
        "vehicle",
        "representation",
        "objectivity",
        "fundamental",
        "kant",
        "critique",
        "rational",
        "psychology",
        "kant",
        "thus",
        "spends",
        "considerable",
        "amount",
        "time",
        "arguing",
        "object",
        "given",
        "transcendental",
        "selfconsciousness",
        "thus",
        "rational",
        "psychologist",
        "effort",
        "discern",
        "feature",
        "self",
        "construed",
        "metaphysical",
        "entity",
        "reason",
        "alone",
        "without",
        "merit",
        "elucidate",
        "way",
        "rational",
        "psychologist",
        "nevertheless",
        "seduced",
        "making",
        "slide",
        "formal",
        "representation",
        "self",
        "consciousness",
        "metaphysics",
        "self",
        "kant",
        "examines",
        "psychological",
        "argument",
        "maintaining",
        "argument",
        "soul",
        "dialectical",
        "refers",
        "argument",
        "designed",
        "draw",
        "conclusion",
        "transcendental",
        "paralogism",
        "hence",
        "chapter",
        "critique",
        "criticizes",
        "rational",
        "psychology",
        "go",
        "name",
        "paralogism",
        "pure",
        "reason",
        "transcendental",
        "paralogism",
        "according",
        "kant",
        "syllogism",
        "one",
        "constrained",
        "transcendental",
        "ground",
        "draw",
        "formally",
        "invalid",
        "conclusion",
        "ab",
        "kant",
        "subsequent",
        "effort",
        "thus",
        "directed",
        "towards",
        "demonstrating",
        "paralogistic",
        "fallacious",
        "nature",
        "argument",
        "soul",
        "kant",
        "diagnosis",
        "fallacy",
        "received",
        "considerable",
        "attention",
        "generated",
        "considerable",
        "controversy",
        "case",
        "kant",
        "tell",
        "u",
        "argument",
        "guilty",
        "fallacy",
        "sophisma",
        "figurae",
        "dictionis",
        "fallacy",
        "equivocationambiguous",
        "middle",
        "kant",
        "suggests",
        "syllogism",
        "term",
        "used",
        "different",
        "sens",
        "major",
        "minor",
        "premise",
        "consider",
        "first",
        "paralogism",
        "argument",
        "allegedly",
        "deduces",
        "substantiality",
        "soul",
        "edition",
        "kant",
        "formulates",
        "argument",
        "follows",
        "representation",
        "absolute",
        "subject",
        "judgment",
        "employed",
        "determination",
        "thing",
        "substance",
        "thinking",
        "absolute",
        "subject",
        "possible",
        "judgment",
        "representation",
        "employed",
        "determination",
        "thing",
        "therefore",
        "thinking",
        "soul",
        "substance",
        "a",
        "kant",
        "locates",
        "equivocation",
        "contained",
        "argument",
        "use",
        "term",
        "substance",
        "according",
        "kant",
        "major",
        "premise",
        "us",
        "term",
        "transcendentally",
        "whereas",
        "minor",
        "premise",
        "conclusion",
        "use",
        "term",
        "empirically",
        "a",
        "kant",
        "appears",
        "mean",
        "major",
        "premise",
        "deploys",
        "term",
        "substance",
        "general",
        "way",
        "one",
        "abstract",
        "condition",
        "sensible",
        "intuition",
        "space",
        "time",
        "major",
        "premise",
        "simply",
        "offer",
        "general",
        "definition",
        "substance",
        "thus",
        "express",
        "general",
        "rule",
        "accordance",
        "object",
        "might",
        "able",
        "thought",
        "substance",
        "nevertheless",
        "order",
        "apply",
        "concept",
        "substance",
        "way",
        "determine",
        "object",
        "category",
        "would",
        "used",
        "empirically",
        "unfortunately",
        "empirical",
        "use",
        "precluded",
        "fact",
        "alleged",
        "object",
        "applied",
        "empirical",
        "even",
        "problematically",
        "kant",
        "view",
        "object",
        "given",
        "kantian",
        "jargon",
        "category",
        "yield",
        "knowledge",
        "object",
        "schematized",
        "applied",
        "given",
        "object",
        "condition",
        "time",
        "kind",
        "complaint",
        "lodged",
        "paralogistic",
        "syllogism",
        "characterize",
        "rational",
        "psychology",
        "thus",
        "kant",
        "argues",
        "inference",
        "simplicity",
        "soul",
        "remarking",
        "psychologist",
        "surreptitiously",
        "deduces",
        "actual",
        "simplicity",
        "metaphysical",
        "object",
        "simply",
        "formal",
        "feature",
        "subjectivity",
        "fact",
        "unitary",
        "representational",
        "economy",
        "personal",
        "identity",
        "soul",
        "attacked",
        "similar",
        "ground",
        "case",
        "metaphysical",
        "conclusion",
        "said",
        "drawn",
        "equivocation",
        "use",
        "meaning",
        "concept",
        "understanding",
        "illustrates",
        "kant",
        "effort",
        "demonstrate",
        "fallacious",
        "nature",
        "argument",
        "characterize",
        "metaphysics",
        "well",
        "interest",
        "identifying",
        "source",
        "error",
        "given",
        "kant",
        "criticism",
        "rational",
        "psychology",
        "straightforward",
        "one",
        "might",
        "expect",
        "embedded",
        "criticism",
        "rational",
        "psychology",
        "actually",
        "number",
        "distinct",
        "charge",
        "idea",
        "soul",
        "although",
        "one",
        "naturally",
        "led",
        "quest",
        "unconditioned",
        "ground",
        "thought",
        "correspond",
        "object",
        "could",
        "actually",
        "given",
        "u",
        "intuition",
        "hypostatization",
        "idea",
        "therefore",
        "although",
        "may",
        "natural",
        "deeply",
        "problematic",
        "idea",
        "soul",
        "yield",
        "alone",
        "knowable",
        "object",
        "argument",
        "although",
        "may",
        "appearance",
        "legitimate",
        "fact",
        "involve",
        "dialectical",
        "application",
        "concept",
        "argument",
        "word",
        "involve",
        "fallacy",
        "vitiate",
        "conclusion",
        "argument",
        "traceable",
        "back",
        "certain",
        "feature",
        "human",
        "reason",
        "may",
        "eradicated",
        "ought",
        "curbed",
        "critically",
        "reinterpreted",
        "specifically",
        "demand",
        "unconditioned",
        "idea",
        "soul",
        "give",
        "rise",
        "may",
        "construed",
        "regulatively",
        "device",
        "guiding",
        "inquiry",
        "never",
        "constitutively",
        "never",
        "yielding",
        "ground",
        "priori",
        "synthetic",
        "knowledge",
        "metaphysical",
        "self",
        "given",
        "immediately",
        "pure",
        "reason",
        "kant",
        "paralogism",
        "received",
        "considerable",
        "focused",
        "attention",
        "secondary",
        "literature",
        "see",
        "ameriks",
        "brook",
        "kitcher",
        "patricia",
        "powell",
        "sellars",
        "wolff",
        "r",
        "p",
        "also",
        "excellent",
        "discussion",
        "found",
        "allison",
        "bennett",
        "buroker",
        "grier",
        "forthcoming",
        "guyer",
        "wuerth",
        "bird",
        "ameriks",
        "melnick",
        "dyck",
        "proops",
        "willaschek"
    ]
}