{
    "main_text": "Teleology or Deontology?\n14. Teleology or Deontology?\n\nThe received view is that Kant’s moral philosophy is a\ndeontological normative theory at least to this extent: it denies that\nright and wrong are in some way or other functions of goodness or\nbadness. It denies, in other words, the central claim of teleological\nmoral views. For instance, act consequentialism is one sort of\nteleological theory. It asserts that the right action is that action\nof all the alternatives available to the agent that has the best\noverall outcome. Here, the goodness of the outcome determines the\nrightness of an action. Another sort of teleological theory might\nfocus instead on character traits. “Virtue ethics” asserts\nthat a right action in any given circumstance is that action a\nvirtuous person does or would perform in those circumstances. In this\ncase, it is the goodness of the character of the person who does or\nwould perform it that determines the rightness of an action. In both\ncases, as it were, the source or ground of rightness is goodness. And\nKant’s own views have typically been classified as deontological\nprecisely because they have seemed to reverse this priority and deny\njust what such theories assert. Rightness, on the standard reading of\nKant, is not grounded in the value of outcomes or character.\n\nThere are several reasons why readers have thought that Kant denies\nthe teleological thesis. First, he makes a plethora of statements\nabout outcomes and character traits that appear to imply an outright\nrejection of both forms of teleology. For instance, in\nGroundwork I, he says that he takes himself to have argued\nthat “the objectives we may have in acting, and also our\nactions’ effects considered as ends and what motivates our\nvolition, can give to actions no unconditional or moral\nworth…[this] can be found nowhere but in the principle of the\nwill, irrespective of the ends that can be brought about by such\naction” (G 4: 400). This appears to say that moral rightness is\nnot a function of the value of intended or actual outcomes. Kant\nsubsequently says that a categorical imperative “declares an\naction to be objectively necessary of itself without reference to any\npurpose—that is, even without any further end” (G 4:415).\nA categorical imperative “commands a certain line of conduct\ndirectly, without assuming or being conditional on any further goal to\nbe reached by that conduct” (G 4:416). These certainly appear to\nbe the words of someone who rejects the idea that what makes actions\nright is primarily their relationship to what good may come of those\nactions, someone who rejects outright the act consequentialist form of\nteleology. Moreover, Kant begins the Groundwork by noting\nthat character traits such as the traditional virtues of courage,\nresolution, moderation, self-control, or a sympathetic cast of mind\npossess no unconditional moral worth, (G 4:393–94,\n398–99). If the moral rightness of an action is grounded in the\nvalue of the character traits of the person who performs or would\nperform it then it seems Kant thinks that it would be grounded in\nsomething of only conditional value. This certainly would not comport\nwell with the virtue ethics form of teleology.\n\nSecond, there are deeper theoretical claims and arguments of\nKant’s in both the Groundwork and in the second\nCritique that appear to be incompatible with any sort of\nteleological form of ethics. These claims and arguments all stem from\nKant’s insistence that morality is grounded in the autonomy of a\nrational will. For instance, Kant states that “if the will seeks\nthe law that is to determine it anywhere else than in the fitness of\nits maxims for its own giving of universal law…heteronomy\nalways results” (G 4:441). If the law determining right and\nwrong is grounded in either the value of outcomes or the value of the\ncharacter of the agent, it seems it will not be found in the fitness\nof the action’s maxim to be a universal law laid down by the\nagent’s own rational will. And Kant’s most complete\ntreatment of value, the second Critique’s “On the\nConcept of an Object of Pure Practical Reason”, appears to be a\nrelentless attack on any sort of teleological moral theory. “The\nconcept of good and evil” he states, “must not be\ndetermined before the moral law (for which, as it would seem, this\nconcept would have to be made the basis) but only (as was done here)\nafter it and by means of it” (CPrR 5:63).\n\nA number of Kant’s readers have come to question this received\nview, however. Perhaps the first philosopher to suggest a teleological\nreading of Kant was John Stuart Mill. In the first chapter of his\nUtilitarianism, Mill implies that the Universal Law\nformulation of the Categorical Imperative could only sensibly be\ninterpreted as a test of the consequences of universal adoption of a\nmaxim. Several 20th century theorists have followed Mill’s\nsuggestion, most notably, R. M. Hare. Hare argued that moral judgments\nsuch as “Stealing is wrong” are in fact universal\nprescriptions (“No stealing anywhere by anyone!”). And\nbecause they are universal, Hare argued, they forbid making\nexceptions. That in turn requires moral judgments to give each\nperson’s wellbeing, including our own, equal weight. And when we\ngive each person’s wellbeing equal weight, we are acting to\nproduce the best overall outcome. Thus, in his view, the CI is\n“simply utilitarianism put into other words” (1993, p.\n103). More recently, David Cummiskey (1996) has argued that\nKant’s view that moral principles are justified because they are\nuniversalizable is compatible with those principles themselves being\nconsequentialist. Indeed, Cummiskey argues that they must be: Respect\nfor the value of humanity entails treating the interests of each as\ncounting for one and one only, and hence for always acting to produce\nthe best overall outcome.\n\nThere are also teleological readings of Kant’s ethics that are\nnon-consequentialist. Barbara Herman (1993) has urged philosophers to\n“leave deontology behind” as an understanding of\nKant’s moral theory on the grounds that the conception of\npractical reason grounding the Categorical Imperative is itself a\nconception of value. Herman’s idea is that Kant never meant to\nsay that no value grounds moral principles. That, she argues, would\nimply that there would be no reason to conform to them. Instead, Kant\nthought the principles of rationality taken together constitute\nrational agency, and rational agency so constituted itself functions\nas a value that justifies moral action (1993, 231). Herman’s\nproposal thus has Kant’s view grounding the rightness of actions\nin rational agency, and then in turn offering rational agency itself\nup as a value. Both Paul Guyer and Allen Wood have offered proposals\nthat differ from Herman’s in content, but agree on the general\nform of teleology that she defends as a reading of Kant. Guyer argues\nthat autonomy itself is the value grounding moral requirements. Moral\nthinking consists in recognizing the priceless value of a rational\nagent’s autonomous will, something in light of whose value it is\nnecessary for any rational agent to modify his behavior (1998,\n22–35). And Wood argues that humanity itself is the grounding\nvalue for Kant. While the second Critique claims that good\nthings owe their value to being the objects of the choices of rational\nagents, they could not, in his view, acquire any value at all if the\nsource of that value, rational agency, itself had no value (1999, 130;\nsee also 157–8). Finally, Rae Langton has argued that if\nKant’s theory is to be thought of as an objectivistic view, we\nmust suppose that the value of humanity and the good will are\nindependent of simply being the objects of our rational choices. If\ntheir value thereby becomes the source of the rightness of our actions\n— say, our actions are right if and because they treat that\nself-standing value in various ways — then her reading too is\nteleological.\n\nIt is of considerable interest to those who follow Kant to determine\nwhich reading — teleological or deontological — was\nactually Kant’s, as well as which view ought to have been his. A\npowerful argument for the teleological reading is the motivation for\nHerman’s proposal: What rationale can we provide for doing our\nduty at all if we don’t appeal to it’s being good to do\nit? But a powerful argument for the deontological reading is\nKant’s own apparent insistence that the authority of moral\ndemands must come simply from their being the demands of a rational\nwill, quite apart from the value that will may have (see Schneewind\n1996; Johnson 2007, 2008; and Reath 1994). On the latter view, moral\ndemands gain their authority simply because a rational will, insofar\nas you are rational, must will them. Proponents of this reading are\nleft with the burden of answering Herman’s challenge to provide\na rationale for having willed such demands, although one response may\nbe that the very question Herman raises does not make sense because it\nasks, in effect, why it is rational to be rational. On the former\nview, by contrast, a rationale is at hand: because your will is,\ninsofar as it is rational, good. Proponents of this former reading\nare, however, then left with the burden of explaining how it could be\nthe autonomy of the will alone that explains the authority of\nmorality.\n",
    "section_title": "14. Teleology or Deontology?",
    "entry_title": "Kant’s Moral Philosophy",
    "hierarchy_title": "Kant’s Moral Philosophy || Teleology or Deontology?",
    "tokenized_text": [
        "teleology",
        "deontology",
        "teleology",
        "deontology",
        "received",
        "view",
        "kant",
        "moral",
        "philosophy",
        "deontological",
        "normative",
        "theory",
        "least",
        "extent",
        "denies",
        "right",
        "wrong",
        "way",
        "function",
        "goodness",
        "badness",
        "denies",
        "word",
        "central",
        "claim",
        "teleological",
        "moral",
        "view",
        "instance",
        "act",
        "consequentialism",
        "one",
        "sort",
        "teleological",
        "theory",
        "asserts",
        "right",
        "action",
        "action",
        "alternative",
        "available",
        "agent",
        "best",
        "overall",
        "outcome",
        "goodness",
        "outcome",
        "determines",
        "rightness",
        "action",
        "another",
        "sort",
        "teleological",
        "theory",
        "might",
        "focus",
        "instead",
        "character",
        "trait",
        "virtue",
        "ethic",
        "asserts",
        "right",
        "action",
        "given",
        "circumstance",
        "action",
        "virtuous",
        "person",
        "would",
        "perform",
        "circumstance",
        "case",
        "goodness",
        "character",
        "person",
        "would",
        "perform",
        "determines",
        "rightness",
        "action",
        "case",
        "source",
        "ground",
        "rightness",
        "goodness",
        "kant",
        "view",
        "typically",
        "classified",
        "deontological",
        "precisely",
        "seemed",
        "reverse",
        "priority",
        "deny",
        "theory",
        "assert",
        "rightness",
        "standard",
        "reading",
        "kant",
        "grounded",
        "value",
        "outcome",
        "character",
        "several",
        "reason",
        "reader",
        "thought",
        "kant",
        "denies",
        "teleological",
        "thesis",
        "first",
        "make",
        "plethora",
        "statement",
        "outcome",
        "character",
        "trait",
        "appear",
        "imply",
        "outright",
        "rejection",
        "form",
        "teleology",
        "instance",
        "groundwork",
        "say",
        "take",
        "argued",
        "objective",
        "may",
        "acting",
        "also",
        "action",
        "effect",
        "considered",
        "end",
        "motivates",
        "volition",
        "give",
        "action",
        "unconditional",
        "moral",
        "worth",
        "found",
        "nowhere",
        "principle",
        "irrespective",
        "end",
        "brought",
        "action",
        "g",
        "appears",
        "say",
        "moral",
        "rightness",
        "function",
        "value",
        "intended",
        "actual",
        "outcome",
        "kant",
        "subsequently",
        "say",
        "categorical",
        "imperative",
        "declares",
        "action",
        "objectively",
        "necessary",
        "without",
        "reference",
        "purposethat",
        "even",
        "without",
        "end",
        "g",
        "categorical",
        "imperative",
        "command",
        "certain",
        "line",
        "conduct",
        "directly",
        "without",
        "assuming",
        "conditional",
        "goal",
        "reached",
        "conduct",
        "g",
        "certainly",
        "appear",
        "word",
        "someone",
        "reject",
        "idea",
        "make",
        "action",
        "right",
        "primarily",
        "relationship",
        "good",
        "may",
        "come",
        "action",
        "someone",
        "reject",
        "outright",
        "act",
        "consequentialist",
        "form",
        "teleology",
        "moreover",
        "kant",
        "begin",
        "groundwork",
        "noting",
        "character",
        "trait",
        "traditional",
        "virtue",
        "courage",
        "resolution",
        "moderation",
        "selfcontrol",
        "sympathetic",
        "cast",
        "mind",
        "posse",
        "unconditional",
        "moral",
        "worth",
        "g",
        "moral",
        "rightness",
        "action",
        "grounded",
        "value",
        "character",
        "trait",
        "person",
        "performs",
        "would",
        "perform",
        "seems",
        "kant",
        "think",
        "would",
        "grounded",
        "something",
        "conditional",
        "value",
        "certainly",
        "would",
        "comport",
        "well",
        "virtue",
        "ethic",
        "form",
        "teleology",
        "second",
        "deeper",
        "theoretical",
        "claim",
        "argument",
        "kant",
        "groundwork",
        "second",
        "critique",
        "appear",
        "incompatible",
        "sort",
        "teleological",
        "form",
        "ethic",
        "claim",
        "argument",
        "stem",
        "kant",
        "insistence",
        "morality",
        "grounded",
        "autonomy",
        "rational",
        "instance",
        "kant",
        "state",
        "seek",
        "law",
        "determine",
        "anywhere",
        "else",
        "fitness",
        "maxim",
        "giving",
        "universal",
        "lawheteronomy",
        "always",
        "result",
        "g",
        "law",
        "determining",
        "right",
        "wrong",
        "grounded",
        "either",
        "value",
        "outcome",
        "value",
        "character",
        "agent",
        "seems",
        "found",
        "fitness",
        "action",
        "maxim",
        "universal",
        "law",
        "laid",
        "agent",
        "rational",
        "kant",
        "complete",
        "treatment",
        "value",
        "second",
        "critique",
        "concept",
        "object",
        "pure",
        "practical",
        "reason",
        "appears",
        "relentless",
        "attack",
        "sort",
        "teleological",
        "moral",
        "theory",
        "concept",
        "good",
        "evil",
        "state",
        "must",
        "determined",
        "moral",
        "law",
        "would",
        "seem",
        "concept",
        "would",
        "made",
        "basis",
        "done",
        "mean",
        "cprr",
        "number",
        "kant",
        "reader",
        "come",
        "question",
        "received",
        "view",
        "however",
        "perhaps",
        "first",
        "philosopher",
        "suggest",
        "teleological",
        "reading",
        "kant",
        "john",
        "stuart",
        "mill",
        "first",
        "chapter",
        "utilitarianism",
        "mill",
        "implies",
        "universal",
        "law",
        "formulation",
        "categorical",
        "imperative",
        "could",
        "sensibly",
        "interpreted",
        "test",
        "consequence",
        "universal",
        "adoption",
        "maxim",
        "several",
        "th",
        "century",
        "theorist",
        "followed",
        "mill",
        "suggestion",
        "notably",
        "r",
        "m",
        "hare",
        "hare",
        "argued",
        "moral",
        "judgment",
        "stealing",
        "wrong",
        "fact",
        "universal",
        "prescription",
        "stealing",
        "anywhere",
        "anyone",
        "universal",
        "hare",
        "argued",
        "forbid",
        "making",
        "exception",
        "turn",
        "requires",
        "moral",
        "judgment",
        "give",
        "person",
        "wellbeing",
        "including",
        "equal",
        "weight",
        "give",
        "person",
        "wellbeing",
        "equal",
        "weight",
        "acting",
        "produce",
        "best",
        "overall",
        "outcome",
        "thus",
        "view",
        "ci",
        "simply",
        "utilitarianism",
        "put",
        "word",
        "p",
        "recently",
        "david",
        "cummiskey",
        "argued",
        "kant",
        "view",
        "moral",
        "principle",
        "justified",
        "universalizable",
        "compatible",
        "principle",
        "consequentialist",
        "indeed",
        "cummiskey",
        "argues",
        "must",
        "respect",
        "value",
        "humanity",
        "entail",
        "treating",
        "interest",
        "counting",
        "one",
        "one",
        "hence",
        "always",
        "acting",
        "produce",
        "best",
        "overall",
        "outcome",
        "also",
        "teleological",
        "reading",
        "kant",
        "ethic",
        "nonconsequentialist",
        "barbara",
        "herman",
        "urged",
        "philosopher",
        "leave",
        "deontology",
        "behind",
        "understanding",
        "kant",
        "moral",
        "theory",
        "ground",
        "conception",
        "practical",
        "reason",
        "grounding",
        "categorical",
        "imperative",
        "conception",
        "value",
        "herman",
        "idea",
        "kant",
        "never",
        "meant",
        "say",
        "value",
        "ground",
        "moral",
        "principle",
        "argues",
        "would",
        "imply",
        "would",
        "reason",
        "conform",
        "instead",
        "kant",
        "thought",
        "principle",
        "rationality",
        "taken",
        "together",
        "constitute",
        "rational",
        "agency",
        "rational",
        "agency",
        "constituted",
        "function",
        "value",
        "justifies",
        "moral",
        "action",
        "herman",
        "proposal",
        "thus",
        "kant",
        "view",
        "grounding",
        "rightness",
        "action",
        "rational",
        "agency",
        "turn",
        "offering",
        "rational",
        "agency",
        "value",
        "paul",
        "guyer",
        "allen",
        "wood",
        "offered",
        "proposal",
        "differ",
        "herman",
        "content",
        "agree",
        "general",
        "form",
        "teleology",
        "defends",
        "reading",
        "kant",
        "guyer",
        "argues",
        "autonomy",
        "value",
        "grounding",
        "moral",
        "requirement",
        "moral",
        "thinking",
        "consists",
        "recognizing",
        "priceless",
        "value",
        "rational",
        "agent",
        "autonomous",
        "something",
        "light",
        "whose",
        "value",
        "necessary",
        "rational",
        "agent",
        "modify",
        "behavior",
        "wood",
        "argues",
        "humanity",
        "grounding",
        "value",
        "kant",
        "second",
        "critique",
        "claim",
        "good",
        "thing",
        "owe",
        "value",
        "object",
        "choice",
        "rational",
        "agent",
        "could",
        "view",
        "acquire",
        "value",
        "source",
        "value",
        "rational",
        "agency",
        "value",
        "see",
        "also",
        "finally",
        "rae",
        "langton",
        "argued",
        "kant",
        "theory",
        "thought",
        "objectivistic",
        "view",
        "must",
        "suppose",
        "value",
        "humanity",
        "good",
        "independent",
        "simply",
        "object",
        "rational",
        "choice",
        "value",
        "thereby",
        "becomes",
        "source",
        "rightness",
        "action",
        "say",
        "action",
        "right",
        "treat",
        "selfstanding",
        "value",
        "various",
        "way",
        "reading",
        "teleological",
        "considerable",
        "interest",
        "follow",
        "kant",
        "determine",
        "reading",
        "teleological",
        "deontological",
        "actually",
        "kant",
        "well",
        "view",
        "ought",
        "powerful",
        "argument",
        "teleological",
        "reading",
        "motivation",
        "herman",
        "proposal",
        "rationale",
        "provide",
        "duty",
        "appeal",
        "good",
        "powerful",
        "argument",
        "deontological",
        "reading",
        "kant",
        "apparent",
        "insistence",
        "authority",
        "moral",
        "demand",
        "must",
        "come",
        "simply",
        "demand",
        "rational",
        "quite",
        "apart",
        "value",
        "may",
        "see",
        "schneewind",
        "johnson",
        "reath",
        "latter",
        "view",
        "moral",
        "demand",
        "gain",
        "authority",
        "simply",
        "rational",
        "insofar",
        "rational",
        "must",
        "proponent",
        "reading",
        "left",
        "burden",
        "answering",
        "herman",
        "challenge",
        "provide",
        "rationale",
        "willed",
        "demand",
        "although",
        "one",
        "response",
        "may",
        "question",
        "herman",
        "raise",
        "make",
        "sense",
        "asks",
        "effect",
        "rational",
        "rational",
        "former",
        "view",
        "contrast",
        "rationale",
        "hand",
        "insofar",
        "rational",
        "good",
        "proponent",
        "former",
        "reading",
        "however",
        "left",
        "burden",
        "explaining",
        "could",
        "autonomy",
        "alone",
        "explains",
        "authority",
        "morality"
    ]
}