{
    "main_text": "International Relations and History\n8. International Relations and History\n\nIn the “Doctrine of Right” Kant complains that the German\nword used to describe international right,\n“Völkerrecht”, is misleading, for it means literally\nthe right of nations or peoples. He suggests that it would better be\ncalled “Staatenrecht”, the right of states. Nonetheless\nKant still uses the phrase “right of nations” and also\ndiscusses a “league of nations”, although it is clear that\nhe is referring not to nations as peoples but to states as\norganizations. Kant is also inconsistent in his use of other terms,\nsuch as “federation”. For the sake of clarity, this entry\nwill maintain consistent terminology for the discussion of concepts\nin international right, even where that requires departures from\nKant’s own usage.\n\nGiven the lack of international institutions, Kant says, states must\nbe considered to be in a state of nature relative to one another. Like\nindividuals in the state of nature, then, they must be considered to\nbe in a state of war with each other. Like individuals, the states are\nobligated to leave this state of nature to form some type of union\nunder a social contract. Before the creation of some such union (see\nnext paragraph), states do have a right to go to war against other\nstates if another state threatens it or actively aggresses against it\n(6:346). But any declaration of war ought to be confirmed by the\npeople “as colegislating members of a state” (6:345).\nRulers who wage war without such consent are using their subjects as\nproperty, as mere means, rather than treating them as ends in\nthemselves. This claim is one of Kant’s strongest statements\nthat actual voting by citizens is required: citizens “must\ntherefore give their free assent, through their representatives, not\nonly to waging war in general but also to each particular declaration\nof war” (6:345–46). Once war has been declared, states are\nobligated to conduct the war under principles that leave open the\npossibility of an eventual league of states. Actions that undermine\nfuture trust between states, such as the use of assassination, are\nprohibited.\n\nStates are obligated to leave this state of nature among states and\nenter into a union of states. He considers several models of this\nworldwide political institution. The first is a single universal state\nin which the entirety of humanity is ruled directly by the single\nstate or is subject to a single monarch. He rejects this model for\nfailing to fulfill the function of the international institution by in\neffect dissolving the separateness of states rather than providing a\nmeans for peaceful relations among states. The second model is a\nleague of states in which states voluntarily submit themselves to an\norganization for resolving international disputes. The league would\nnot have coercive power to enforce its decisions, and states would be\nfree to leave the league if they chose. He sometimes refers to this\nmodel as a “federation”, although he notes that it cannot\nbe an indissoluble union based upon a constitution, as in the\nfederalist structure of the United States (6:351), so it is best to\nrefer to this model as a “league”. The third model is a\nstate of states or a world republic of states in which each state\njoins a federation of states with coercive power. In this model, a\nstate’s relation to the international federation is closely\nanalogous to an individual person’s relation to a state. Only\nthese second and third models receive Kant’s approval. He offers\ndifferent reasons for supporting each of the two models.\n\nKant holds out the third model as the ideal form for the correct\ninternational institution. He calls the world republic an\n“idea” (8:357), a term that Kant uses for concepts created\nby the faculty of reason that cannot be met in experience but that can\nserve as models or goals for actual human behavior (the social\ncontract is another idea of reason in political philosophy). The ideal\ninternational union is a federation of states that has coercive power\nover member states but whose decisions arise from debate and\ndiscussion among those member states. Kant is unclear regarding\nwhether that coercive force is to be realized by joint action of\nmember states, sanctioned by the federation, against a non-compliant\nmember or by a distinct international force controlled by the\nfederation itself. The precise status of states’ membership is\nalso not clearly stated: he generally says that states have a right to\nwithdraw from the federation, although he often states that the\nfederation is indissoluble and even indicates in the “Doctrine\nof Right” that states may go to war to “establish a\ncondition more closely approaching a rightful condition”\n(6:344), implying that states can be coerced into membership. Kant\nrecognizes that actual states will balk at this international\nfederation since rulers will object to such a surrender of their\nsovereign power. Kant thus argues that the second model, a league of\nstates in which each state opts to negotiate with other nations\ninstead of waging war, must be adopted as a “negative\nsurrogate” (8:357). In a league of states, individual nations\nare allowed to leave at will and the league itself has no coercive\npowers over members. States voluntarily agree to settle disputes in a\nway that avoids war and encourages further peaceful relations. Leagues\nof states need not extend worldwide but should expand over time in\norder to approximate a worldwide union of all states.\n\nIn the essay “Toward Perpetual Peace”, Kant offers a set\nof six “preliminary articles” which aim to reduce the\nlikelihood of war, but cannot by themselves establish permanent peace\n(8:343–47). These are a ban on making temporary peace treaties\nwhile still planning for future wars, the prohibition of annexation of\none state by another, the abolition of standing armies, the refusal to\ntake on national debts for external affairs, a ban on interference by\none state in the internal affairs of another, and a set of limits on\nthe conduct of war that disallows acts that would breed mistrust and\nmake peace impossible. These six articles are negative laws that\nprohibit states from engaging in certain kinds of conduct. They are\nnot sufficient by themselves to prevent states from lapsing back into\ntheir old habits of warring on one another. To institute an\ninternational order that can genuinely bring about perpetual peace,\nKant offers three “definitive articles”. The first of\nthese is that every state shall have a republican civil constitution\n(8:348, discussed in section 4 above). In a republican constitution,\nthe people who decide whether there will be a war are the same people\nwho would pay the price for the war, both in monetary terms (taxes and\nother financial burdens) and in flesh and blood. Republican states\nwill therefore be very hesitant to go to war and will readily accept\nnegotiations rather than resort to war. This consideration is\nKant’s most important contribution to the debate about securing\npeace. He believes that when states are ruled in accordance with the\nwishes of the people, their self-interest will provide a consistent\nbasis for pacific relations among states. The second definitive\narticle is that each state shall participate in a union of states\n(8:354, discussed in the previous paragraph). The third definitive\narticle advocates a cosmopolitan right of universal hospitality\n(8:357, discussed in section 9 below).\n\nKant’s view of historical progress is tied to his view of\ninternational relations. He actually presents several versions of his\nargument for the progress of humanity toward the ideal condition in\nwhich states, each governed by a republican civil constitution and\nthus each providing maximal consistent freedom for its citizens, all\ncooperate in a republican federation of states. In his essay\n“Idea for a Universal History from a Cosmopolitan Point of\nView” (8:15–31), he takes the basis of his claims for\nhistorical progress to be the culmination of the human ability to\nreason, which, as a natural property of human beings, must be worked\nout to perfection in the species. He argues that incessant wars will\neventually lead rulers to recognize the benefits of peaceful\nnegotiation. They will gradually increase the freedoms of their\ncitizens, because freer citizens are economically more productive and\nhence make the state stronger in its international dealings.\nImportantly in this essay he relies on the self-interest of presumably\nunelected rulers as a significant force in the movement toward\ninternational peace. In “Toward Perpetual Peace” Kant\nsuggests that some particular state may, through “good\nfortune”, become a republic and then act as a focal point for\nother states to join in peaceful relations, and that gradually such\ncooperation can spread to all states (8:356). These positions\ncertainly reveal that Kant considered world peace impossible without\nboth individual republican states and an international federation\namong them.\n",
    "section_title": "8. International Relations and History",
    "entry_title": "Kant’s Social and Political Philosophy",
    "hierarchy_title": "Kant’s Social and Political Philosophy || International Relations and History",
    "tokenized_text": [
        "international",
        "relation",
        "history",
        "international",
        "relation",
        "history",
        "doctrine",
        "right",
        "kant",
        "complains",
        "german",
        "word",
        "used",
        "describe",
        "international",
        "right",
        "völkerrecht",
        "misleading",
        "mean",
        "literally",
        "right",
        "nation",
        "people",
        "suggests",
        "would",
        "better",
        "called",
        "staatenrecht",
        "right",
        "state",
        "nonetheless",
        "kant",
        "still",
        "us",
        "phrase",
        "right",
        "nation",
        "also",
        "discus",
        "league",
        "nation",
        "although",
        "clear",
        "referring",
        "nation",
        "people",
        "state",
        "organization",
        "kant",
        "also",
        "inconsistent",
        "use",
        "term",
        "federation",
        "sake",
        "clarity",
        "entry",
        "maintain",
        "consistent",
        "terminology",
        "discussion",
        "concept",
        "international",
        "right",
        "even",
        "requires",
        "departure",
        "kant",
        "usage",
        "given",
        "lack",
        "international",
        "institution",
        "kant",
        "say",
        "state",
        "must",
        "considered",
        "state",
        "nature",
        "relative",
        "one",
        "another",
        "like",
        "individual",
        "state",
        "nature",
        "must",
        "considered",
        "state",
        "war",
        "like",
        "individual",
        "state",
        "obligated",
        "leave",
        "state",
        "nature",
        "form",
        "type",
        "union",
        "social",
        "contract",
        "creation",
        "union",
        "see",
        "next",
        "paragraph",
        "state",
        "right",
        "go",
        "war",
        "state",
        "another",
        "state",
        "threatens",
        "actively",
        "aggresses",
        "declaration",
        "war",
        "ought",
        "confirmed",
        "people",
        "colegislating",
        "member",
        "state",
        "ruler",
        "wage",
        "war",
        "without",
        "consent",
        "using",
        "subject",
        "property",
        "mere",
        "mean",
        "rather",
        "treating",
        "end",
        "claim",
        "one",
        "kant",
        "strongest",
        "statement",
        "actual",
        "voting",
        "citizen",
        "required",
        "citizen",
        "must",
        "therefore",
        "give",
        "free",
        "assent",
        "representative",
        "waging",
        "war",
        "general",
        "also",
        "particular",
        "declaration",
        "war",
        "war",
        "declared",
        "state",
        "obligated",
        "conduct",
        "war",
        "principle",
        "leave",
        "open",
        "possibility",
        "eventual",
        "league",
        "state",
        "action",
        "undermine",
        "future",
        "trust",
        "state",
        "use",
        "assassination",
        "prohibited",
        "state",
        "obligated",
        "leave",
        "state",
        "nature",
        "among",
        "state",
        "enter",
        "union",
        "state",
        "considers",
        "several",
        "model",
        "worldwide",
        "political",
        "institution",
        "first",
        "single",
        "universal",
        "state",
        "entirety",
        "humanity",
        "ruled",
        "directly",
        "single",
        "state",
        "subject",
        "single",
        "monarch",
        "reject",
        "model",
        "failing",
        "fulfill",
        "function",
        "international",
        "institution",
        "effect",
        "dissolving",
        "separateness",
        "state",
        "rather",
        "providing",
        "mean",
        "peaceful",
        "relation",
        "among",
        "state",
        "second",
        "model",
        "league",
        "state",
        "state",
        "voluntarily",
        "submit",
        "organization",
        "resolving",
        "international",
        "dispute",
        "league",
        "would",
        "coercive",
        "power",
        "enforce",
        "decision",
        "state",
        "would",
        "free",
        "leave",
        "league",
        "chose",
        "sometimes",
        "refers",
        "model",
        "federation",
        "although",
        "note",
        "indissoluble",
        "union",
        "based",
        "upon",
        "constitution",
        "federalist",
        "structure",
        "united",
        "state",
        "best",
        "refer",
        "model",
        "league",
        "third",
        "model",
        "state",
        "state",
        "world",
        "republic",
        "state",
        "state",
        "join",
        "federation",
        "state",
        "coercive",
        "power",
        "model",
        "state",
        "relation",
        "international",
        "federation",
        "closely",
        "analogous",
        "individual",
        "person",
        "relation",
        "state",
        "second",
        "third",
        "model",
        "receive",
        "kant",
        "approval",
        "offer",
        "different",
        "reason",
        "supporting",
        "two",
        "model",
        "kant",
        "hold",
        "third",
        "model",
        "ideal",
        "form",
        "correct",
        "international",
        "institution",
        "call",
        "world",
        "republic",
        "idea",
        "term",
        "kant",
        "us",
        "concept",
        "created",
        "faculty",
        "reason",
        "met",
        "experience",
        "serve",
        "model",
        "goal",
        "actual",
        "human",
        "behavior",
        "social",
        "contract",
        "another",
        "idea",
        "reason",
        "political",
        "philosophy",
        "ideal",
        "international",
        "union",
        "federation",
        "state",
        "coercive",
        "power",
        "member",
        "state",
        "whose",
        "decision",
        "arise",
        "debate",
        "discussion",
        "among",
        "member",
        "state",
        "kant",
        "unclear",
        "regarding",
        "whether",
        "coercive",
        "force",
        "realized",
        "joint",
        "action",
        "member",
        "state",
        "sanctioned",
        "federation",
        "noncompliant",
        "member",
        "distinct",
        "international",
        "force",
        "controlled",
        "federation",
        "precise",
        "status",
        "state",
        "membership",
        "also",
        "clearly",
        "stated",
        "generally",
        "say",
        "state",
        "right",
        "withdraw",
        "federation",
        "although",
        "often",
        "state",
        "federation",
        "indissoluble",
        "even",
        "indicates",
        "doctrine",
        "right",
        "state",
        "may",
        "go",
        "war",
        "establish",
        "condition",
        "closely",
        "approaching",
        "rightful",
        "condition",
        "implying",
        "state",
        "coerced",
        "membership",
        "kant",
        "recognizes",
        "actual",
        "state",
        "balk",
        "international",
        "federation",
        "since",
        "ruler",
        "object",
        "surrender",
        "sovereign",
        "power",
        "kant",
        "thus",
        "argues",
        "second",
        "model",
        "league",
        "state",
        "state",
        "opts",
        "negotiate",
        "nation",
        "instead",
        "waging",
        "war",
        "must",
        "adopted",
        "negative",
        "surrogate",
        "league",
        "state",
        "individual",
        "nation",
        "allowed",
        "leave",
        "league",
        "coercive",
        "power",
        "member",
        "state",
        "voluntarily",
        "agree",
        "settle",
        "dispute",
        "way",
        "avoids",
        "war",
        "encourages",
        "peaceful",
        "relation",
        "league",
        "state",
        "need",
        "extend",
        "worldwide",
        "expand",
        "time",
        "order",
        "approximate",
        "worldwide",
        "union",
        "state",
        "essay",
        "toward",
        "perpetual",
        "peace",
        "kant",
        "offer",
        "set",
        "six",
        "preliminary",
        "article",
        "aim",
        "reduce",
        "likelihood",
        "war",
        "establish",
        "permanent",
        "peace",
        "ban",
        "making",
        "temporary",
        "peace",
        "treaty",
        "still",
        "planning",
        "future",
        "war",
        "prohibition",
        "annexation",
        "one",
        "state",
        "another",
        "abolition",
        "standing",
        "army",
        "refusal",
        "take",
        "national",
        "debt",
        "external",
        "affair",
        "ban",
        "interference",
        "one",
        "state",
        "internal",
        "affair",
        "another",
        "set",
        "limit",
        "conduct",
        "war",
        "disallows",
        "act",
        "would",
        "breed",
        "mistrust",
        "make",
        "peace",
        "impossible",
        "six",
        "article",
        "negative",
        "law",
        "prohibit",
        "state",
        "engaging",
        "certain",
        "kind",
        "conduct",
        "sufficient",
        "prevent",
        "state",
        "lapsing",
        "back",
        "old",
        "habit",
        "warring",
        "one",
        "another",
        "institute",
        "international",
        "order",
        "genuinely",
        "bring",
        "perpetual",
        "peace",
        "kant",
        "offer",
        "three",
        "definitive",
        "article",
        "first",
        "every",
        "state",
        "shall",
        "republican",
        "civil",
        "constitution",
        "discussed",
        "section",
        "republican",
        "constitution",
        "people",
        "decide",
        "whether",
        "war",
        "people",
        "would",
        "pay",
        "price",
        "war",
        "monetary",
        "term",
        "tax",
        "financial",
        "burden",
        "flesh",
        "blood",
        "republican",
        "state",
        "therefore",
        "hesitant",
        "go",
        "war",
        "readily",
        "accept",
        "negotiation",
        "rather",
        "resort",
        "war",
        "consideration",
        "kant",
        "important",
        "contribution",
        "debate",
        "securing",
        "peace",
        "belief",
        "state",
        "ruled",
        "accordance",
        "wish",
        "people",
        "selfinterest",
        "provide",
        "consistent",
        "basis",
        "pacific",
        "relation",
        "among",
        "state",
        "second",
        "definitive",
        "article",
        "state",
        "shall",
        "participate",
        "union",
        "state",
        "discussed",
        "previous",
        "paragraph",
        "third",
        "definitive",
        "article",
        "advocate",
        "cosmopolitan",
        "right",
        "universal",
        "hospitality",
        "discussed",
        "section",
        "kant",
        "view",
        "historical",
        "progress",
        "tied",
        "view",
        "international",
        "relation",
        "actually",
        "present",
        "several",
        "version",
        "argument",
        "progress",
        "humanity",
        "toward",
        "ideal",
        "condition",
        "state",
        "governed",
        "republican",
        "civil",
        "constitution",
        "thus",
        "providing",
        "maximal",
        "consistent",
        "freedom",
        "citizen",
        "cooperate",
        "republican",
        "federation",
        "state",
        "essay",
        "idea",
        "universal",
        "history",
        "cosmopolitan",
        "point",
        "view",
        "take",
        "basis",
        "claim",
        "historical",
        "progress",
        "culmination",
        "human",
        "ability",
        "reason",
        "natural",
        "property",
        "human",
        "being",
        "must",
        "worked",
        "perfection",
        "specie",
        "argues",
        "incessant",
        "war",
        "eventually",
        "lead",
        "ruler",
        "recognize",
        "benefit",
        "peaceful",
        "negotiation",
        "gradually",
        "increase",
        "freedom",
        "citizen",
        "freer",
        "citizen",
        "economically",
        "productive",
        "hence",
        "make",
        "state",
        "stronger",
        "international",
        "dealing",
        "importantly",
        "essay",
        "relies",
        "selfinterest",
        "presumably",
        "unelected",
        "ruler",
        "significant",
        "force",
        "movement",
        "toward",
        "international",
        "peace",
        "toward",
        "perpetual",
        "peace",
        "kant",
        "suggests",
        "particular",
        "state",
        "may",
        "good",
        "fortune",
        "become",
        "republic",
        "act",
        "focal",
        "point",
        "state",
        "join",
        "peaceful",
        "relation",
        "gradually",
        "cooperation",
        "spread",
        "state",
        "position",
        "certainly",
        "reveal",
        "kant",
        "considered",
        "world",
        "peace",
        "impossible",
        "without",
        "individual",
        "republican",
        "state",
        "international",
        "federation",
        "among"
    ]
}