{
    "main_text": "Aesthetics || How are Judgments of Beauty Possible?\n2.2 How are Judgments of Beauty Possible?\n\nRunning through Kant’s various characterizations of judgments of\nbeauty is a basic dichotomy between two apparently opposed sets of\nfeatures. On the one hand, judgments of beauty are based on feeling,\nthey do not depend on subsuming the object under a concept (in\nparticular, the concept of a purpose that such an object is supposed\nto satisfy), and they cannot be proved. This combination of features\nseems to suggest that judgments of beauty should be assimilated to\njudgments of the agreeable. On the other hand, however, judgments of\nbeauty are unlike judgments of the agreeable in not involving desire\nfor the object; more importantly and centrally, they make a normative\nclaim to everyone’s agreement. These features seem to suggest\nthat they should be assimilated, instead, to objective cognitive\njudgments.\n\nIn claiming that judgments of beauty have both sets of features, Kant\ncan be seen as reacting equally against the two main opposing\ntraditions in eighteenth-century aesthetics: the\n“empiricist” tradition of aesthetics represented by Hume,\nHutcheson and Burke, on which a judgment of taste is an expression of\nfeeling without cognitive content, and the “rationalist”\ntradition of aesthetics represented by Baumgarten and Meier, on which\na judgment of taste consists in the cognition of an object as having\nan objective property. Kant’s insistence that there is an\nalternative to these two views, one on which judgments of beauty are\nboth based on feeling and make a claim to universal validity, is\nprobably the most distinctive aspect of his aesthetic theory. But this\ninsistence confronts him with the obvious problem of how the two\nfeatures, or sets of features, are to be reconciled. As Kant puts\nit:\n\n\nhow is a judgment possible which, merely from one’s own\nfeeling of pleasure in an object, independent of its concept, judges\nthis pleasure as attached to the representation of the same object\nin every other subject, and does so a priori, i.e.,\nwithout having to wait for the assent of others?(§36, 288)\n\n\nThe argument constituting Kant’s official answer to this\nquestion (the “Deduction of Taste”) is presented in the\nsection entitled “Deduction of Pure Aesthetic Judgments”,\nin particular in sections §§31–39, with the core of\nthe argument given at §38. It is also prefigured in the\n“Analytic of the Beautiful”, in particular at §9 and\n§22, although the argument of §22, which appeals to the\nnotion of a “common sense”, takes a somewhat different\nform from the presentation in the “Deduction of Taste”\nproper.\n\nThe argument in all of its appearances relies on the claim, introduced\nin §9, that pleasure in the beautiful depends on the “free\nplay” or “free harmony” of the faculties of\nimagination and understanding. In the Critique of Pure\nReason, imagination is described as “synthesizing the\nmanifold of intuition” under the governance of rules that are\nprescribed by the understanding: the outcome of this is cognitive\nperceptual experience of objects as having specific empirical\nfeatures. The rules prescribed by the understanding, are, or\ncorrespond to, particular concepts that are applied to the object. For\nexample, when a manifold is synthesized in accordance with the\nconcepts green and square, the outcome is a\nperceptual experience in which the object is perceived as green and\nsquare. But now in the Critique of Judgment, Kant suggests\nthat imagination and understanding can stand in a different kind of\nrelationship, one in which imagination’s activity harmonizes\nwith the understanding but without imagination’s being\nconstrained or governed by understanding. In this relationship,\nimagination and understanding in effect do what is ordinarily involved\nin the bringing of objects under concepts, and hence in the perception\nof objects as having empirical features: but they do this without\nbringing the object under any concept in particular. So, rather than\nperceiving the object as green or square, the subject whose faculties\nare in free play responds to it perceptually with a state of mind\nwhich is non-conceptual, and specifically a feeling of disinterested\npleasure. It is this kind of pleasure which is the basis for a\njudgment of taste.\n\nKant appeals to this account of pleasure in the beautiful in order to\nargue for its universal validity or universal communicability: to\nargue, that is, that a subject who feels such a pleasure, and thus\njudges the object to be beautiful, is entitled to demand that everyone\nelse feel a corresponding pleasure and thus agree with her judgment of\ntaste. For, he claims, the free play of the faculties manifests the\nsubjective condition of cognition in general (see for example §9,\n218; §21, 238; §38, 290). We are entitled to claim that\neveryone ought to agree with our cognitions: for example, if I\nperceptually cognize an object as being green and square, I am\nentitled to claim that everyone else ought to cognize it as green and\nsquare. But in order for this demand for agreement to be possible, he\nsuggests, it must also be possible for me to demand universal\nagreement for the subjective condition of such cognitions. If I can\ntake it that everyone ought to share my cognition of an object as\ngreen or square, then I must also be entitled to take it that everyone\nought to share a perception of the object in which my faculties are in\nfree play, since the free play is no more than a manifestation of what\nis in general required for an object’s being cognized as green\nor square in the first place.\n\nThe most serious objection to the argument can be put in the form of a\ndilemma; see for example Guyer (1979 [1997: 264]), Meerbote (1982:\n81ff.), Allison (2001: 184–192), Rind (2002). Either the free\nplay of the faculties is involved in all cognitive perceptual\nexperience, or it is not. If it is, then it would seem,\ncounterintuitively, that every object should be perceived as\nbeautiful. (Because of this consequence of grasping the first horn,\nthe dilemma is sometimes characterized instead as Kant’s\n“everything is beautiful” problem.) But if it is not, then\nthe central inference does not seem to go through. From the fact that\nI can demand agreement for the state of my faculties in experiencing\nan object as, say, green or square, it does not follow that I can\ndemand agreement for a state in which my faculties are in free play,\nsince the possibility of experiencing the free play would seem to\nrequire something over and above what is required for cognition\nalone.\n\nMost defenders of the argument have grasped the second horn of the\ndilemma. One such defence, originally proposed by Ameriks in his 1982\n(subsequently incorporated into Ameriks 2003), relies on an\nunderstanding of judgments of taste as objective, and hence as making\na claim to universal agreement which is akin to that made by cognitive\njudgments. (For more on the objectivity of taste, see\n Section 2.3.5).\n Another, offered by Allison, rejects the objection as presupposing an\noverly strong interpretation of what the Deduction is intended to\naccomplish. The objection tells against the Deduction only if it is\nconstrued as entitling us to claim universal agreement for particular\njudgments of taste; but, as Allison reads it, the Deduction is\nintended only to establish that such claims can, in general, be\nlegitimate (Allison 2001: ch. 8; see especially 177–179). A\nsimilar position is taken by Kalar (2006: 134). However, some\ncommentators have taken this kind of defence to be inadequate, holding\nthat the argument must establish not only a general entitlement to\ndemand agreement for judgments of beauty, but an entitlement in each\nparticular case (Savile 1987, Chignell 2007).\n\nAnother, less commonly accepted, option for defending the argument\nwould be to grasp the first horn, accepting that, on Kant’s\naccount, every object can legitimately be judged to be beautiful.\nGracyk (1986) argues, independently of the argument of the Deduction,\nthat this is Kant’s view, and it might also be noted that, if\njudgments of beauty are not objective, there can be no feature of an\nobject which rules it out as a candidate for being legitimately found\nbeautiful. Commentators who emphasize this point include Ginsborg\n(2017) and Breitenbach (2021).\n\nA number of commentators have taken the dilemma, or considerations\nrelated to it, to be fatal to Kant’s view that judgments of\nbeauty make a legitimate claim to universal validity: see for example\nMeerbote 1982, cited above, and Guyer (1979: 284–288; although\nGuyer offers a more positive assessment, see his 2003b: 60n15). Others\nhave argued that Kant’s view can be saved by drawing on\nconsiderations not mentioned in the official argument of the\nDeduction. As noted below\n (Section 2.8),\n Kant draws a close connection between our capacity for aesthetic\njudgment and our nature as moral beings, and even though Kant himself\ndoes not appeal to this connection in the deduction of taste, some\ncommentators, including Elliott (1968), Crawford (1974), Kemal (1986)\nand Savile (1987), have taken moral considerations to constitute the\nultimate ground of the legitimacy of judgments of beauty. Another\nstrategy drawing on considerations outside the Deduction itself has\nbeen to appeal to Kant’s theory of aesthetic ideas (see\n Section 2.6),\n which is ostensibly part of his theory of art, rather than his core\ntheory of taste. This strategy is adopted in Savile 1987 and Chignell\n2007; Chignell’s view differs from Savile’s in that it\ndoes not make any appeal to moral considerations. Finally, some\ncommentators have held that while the argument of the official\nDeduction at §38 is unsuccessful in avoiding the dilemma, the\nversion of the argument offered at §21, which appeals to the\nnotion of a “common sense”, is more effective; see in\nparticular Rind (2002) and Kalar (2006: ch. 5).\n\nThe assessment of the objection, and of Kant’s Deduction of\nTaste more generally, is complicated by a number of more fundamental\ninterpretive issues, which are discussed in the next section.\n",
    "section_title": "2.2 How are Judgments of Beauty Possible?",
    "entry_title": "Kant’s Aesthetics and Teleology",
    "hierarchy_title": "Kant’s Aesthetics and Teleology || Aesthetics || How are Judgments of Beauty Possible?",
    "tokenized_text": [
        "aesthetic",
        "judgment",
        "beauty",
        "possible",
        "judgment",
        "beauty",
        "possible",
        "running",
        "kant",
        "various",
        "characterization",
        "judgment",
        "beauty",
        "basic",
        "dichotomy",
        "two",
        "apparently",
        "opposed",
        "set",
        "feature",
        "one",
        "hand",
        "judgment",
        "beauty",
        "based",
        "feeling",
        "depend",
        "subsuming",
        "object",
        "concept",
        "particular",
        "concept",
        "purpose",
        "object",
        "supposed",
        "satisfy",
        "proved",
        "combination",
        "feature",
        "seems",
        "suggest",
        "judgment",
        "beauty",
        "assimilated",
        "judgment",
        "agreeable",
        "hand",
        "however",
        "judgment",
        "beauty",
        "unlike",
        "judgment",
        "agreeable",
        "involving",
        "desire",
        "object",
        "importantly",
        "centrally",
        "make",
        "normative",
        "claim",
        "everyone",
        "agreement",
        "feature",
        "seem",
        "suggest",
        "assimilated",
        "instead",
        "objective",
        "cognitive",
        "judgment",
        "claiming",
        "judgment",
        "beauty",
        "set",
        "feature",
        "kant",
        "seen",
        "reacting",
        "equally",
        "two",
        "main",
        "opposing",
        "tradition",
        "eighteenthcentury",
        "aesthetic",
        "empiricist",
        "tradition",
        "aesthetic",
        "represented",
        "hume",
        "hutcheson",
        "burke",
        "judgment",
        "taste",
        "expression",
        "feeling",
        "without",
        "cognitive",
        "content",
        "rationalist",
        "tradition",
        "aesthetic",
        "represented",
        "baumgarten",
        "meier",
        "judgment",
        "taste",
        "consists",
        "cognition",
        "object",
        "objective",
        "property",
        "kant",
        "insistence",
        "alternative",
        "two",
        "view",
        "one",
        "judgment",
        "beauty",
        "based",
        "feeling",
        "make",
        "claim",
        "universal",
        "validity",
        "probably",
        "distinctive",
        "aspect",
        "aesthetic",
        "theory",
        "insistence",
        "confronts",
        "obvious",
        "problem",
        "two",
        "feature",
        "set",
        "feature",
        "reconciled",
        "kant",
        "put",
        "judgment",
        "possible",
        "merely",
        "one",
        "feeling",
        "pleasure",
        "object",
        "independent",
        "concept",
        "judge",
        "pleasure",
        "attached",
        "representation",
        "object",
        "every",
        "subject",
        "priori",
        "ie",
        "without",
        "wait",
        "assent",
        "others",
        "argument",
        "constituting",
        "kant",
        "official",
        "answer",
        "question",
        "deduction",
        "taste",
        "presented",
        "section",
        "entitled",
        "deduction",
        "pure",
        "aesthetic",
        "judgment",
        "particular",
        "section",
        "core",
        "argument",
        "given",
        "also",
        "prefigured",
        "analytic",
        "beautiful",
        "particular",
        "although",
        "argument",
        "appeal",
        "notion",
        "common",
        "sense",
        "take",
        "somewhat",
        "different",
        "form",
        "presentation",
        "deduction",
        "taste",
        "proper",
        "argument",
        "appearance",
        "relies",
        "claim",
        "introduced",
        "pleasure",
        "beautiful",
        "depends",
        "free",
        "play",
        "free",
        "harmony",
        "faculty",
        "imagination",
        "understanding",
        "critique",
        "pure",
        "reason",
        "imagination",
        "described",
        "synthesizing",
        "manifold",
        "intuition",
        "governance",
        "rule",
        "prescribed",
        "understanding",
        "outcome",
        "cognitive",
        "perceptual",
        "experience",
        "object",
        "specific",
        "empirical",
        "feature",
        "rule",
        "prescribed",
        "understanding",
        "correspond",
        "particular",
        "concept",
        "applied",
        "object",
        "example",
        "manifold",
        "synthesized",
        "accordance",
        "concept",
        "green",
        "square",
        "outcome",
        "perceptual",
        "experience",
        "object",
        "perceived",
        "green",
        "square",
        "critique",
        "judgment",
        "kant",
        "suggests",
        "imagination",
        "understanding",
        "stand",
        "different",
        "kind",
        "relationship",
        "one",
        "imagination",
        "activity",
        "harmonizes",
        "understanding",
        "without",
        "imagination",
        "constrained",
        "governed",
        "understanding",
        "relationship",
        "imagination",
        "understanding",
        "effect",
        "ordinarily",
        "involved",
        "bringing",
        "object",
        "concept",
        "hence",
        "perception",
        "object",
        "empirical",
        "feature",
        "without",
        "bringing",
        "object",
        "concept",
        "particular",
        "rather",
        "perceiving",
        "object",
        "green",
        "square",
        "subject",
        "whose",
        "faculty",
        "free",
        "play",
        "responds",
        "perceptually",
        "state",
        "mind",
        "nonconceptual",
        "specifically",
        "feeling",
        "disinterested",
        "pleasure",
        "kind",
        "pleasure",
        "basis",
        "judgment",
        "taste",
        "kant",
        "appeal",
        "account",
        "pleasure",
        "beautiful",
        "order",
        "argue",
        "universal",
        "validity",
        "universal",
        "communicability",
        "argue",
        "subject",
        "feel",
        "pleasure",
        "thus",
        "judge",
        "object",
        "beautiful",
        "entitled",
        "demand",
        "everyone",
        "else",
        "feel",
        "corresponding",
        "pleasure",
        "thus",
        "agree",
        "judgment",
        "taste",
        "claim",
        "free",
        "play",
        "faculty",
        "manifest",
        "subjective",
        "condition",
        "cognition",
        "general",
        "see",
        "example",
        "entitled",
        "claim",
        "everyone",
        "ought",
        "agree",
        "cognition",
        "example",
        "perceptually",
        "cognize",
        "object",
        "green",
        "square",
        "entitled",
        "claim",
        "everyone",
        "else",
        "ought",
        "cognize",
        "green",
        "square",
        "order",
        "demand",
        "agreement",
        "possible",
        "suggests",
        "must",
        "also",
        "possible",
        "demand",
        "universal",
        "agreement",
        "subjective",
        "condition",
        "cognition",
        "take",
        "everyone",
        "ought",
        "share",
        "cognition",
        "object",
        "green",
        "square",
        "must",
        "also",
        "entitled",
        "take",
        "everyone",
        "ought",
        "share",
        "perception",
        "object",
        "faculty",
        "free",
        "play",
        "since",
        "free",
        "play",
        "manifestation",
        "general",
        "required",
        "object",
        "cognized",
        "green",
        "square",
        "first",
        "place",
        "serious",
        "objection",
        "argument",
        "put",
        "form",
        "dilemma",
        "see",
        "example",
        "guyer",
        "meerbote",
        "ff",
        "allison",
        "rind",
        "either",
        "free",
        "play",
        "faculty",
        "involved",
        "cognitive",
        "perceptual",
        "experience",
        "would",
        "seem",
        "counterintuitively",
        "every",
        "object",
        "perceived",
        "beautiful",
        "consequence",
        "grasping",
        "first",
        "horn",
        "dilemma",
        "sometimes",
        "characterized",
        "instead",
        "kant",
        "everything",
        "beautiful",
        "problem",
        "central",
        "inference",
        "seem",
        "go",
        "fact",
        "demand",
        "agreement",
        "state",
        "faculty",
        "experiencing",
        "object",
        "say",
        "green",
        "square",
        "follow",
        "demand",
        "agreement",
        "state",
        "faculty",
        "free",
        "play",
        "since",
        "possibility",
        "experiencing",
        "free",
        "play",
        "would",
        "seem",
        "require",
        "something",
        "required",
        "cognition",
        "alone",
        "defender",
        "argument",
        "grasped",
        "second",
        "horn",
        "dilemma",
        "one",
        "defence",
        "originally",
        "proposed",
        "ameriks",
        "subsequently",
        "incorporated",
        "ameriks",
        "relies",
        "understanding",
        "judgment",
        "taste",
        "objective",
        "hence",
        "making",
        "claim",
        "universal",
        "agreement",
        "akin",
        "made",
        "cognitive",
        "judgment",
        "objectivity",
        "taste",
        "see",
        "section",
        "another",
        "offered",
        "allison",
        "reject",
        "objection",
        "presupposing",
        "overly",
        "strong",
        "interpretation",
        "deduction",
        "intended",
        "accomplish",
        "objection",
        "tell",
        "deduction",
        "construed",
        "entitling",
        "u",
        "claim",
        "universal",
        "agreement",
        "particular",
        "judgment",
        "taste",
        "allison",
        "read",
        "deduction",
        "intended",
        "establish",
        "claim",
        "general",
        "legitimate",
        "allison",
        "ch",
        "see",
        "especially",
        "similar",
        "position",
        "taken",
        "kalar",
        "however",
        "commentator",
        "taken",
        "kind",
        "defence",
        "inadequate",
        "holding",
        "argument",
        "must",
        "establish",
        "general",
        "entitlement",
        "demand",
        "agreement",
        "judgment",
        "beauty",
        "entitlement",
        "particular",
        "case",
        "savile",
        "chignell",
        "another",
        "le",
        "commonly",
        "accepted",
        "option",
        "defending",
        "argument",
        "would",
        "grasp",
        "first",
        "horn",
        "accepting",
        "kant",
        "account",
        "every",
        "object",
        "legitimately",
        "judged",
        "beautiful",
        "gracyk",
        "argues",
        "independently",
        "argument",
        "deduction",
        "kant",
        "view",
        "might",
        "also",
        "noted",
        "judgment",
        "beauty",
        "objective",
        "feature",
        "object",
        "rule",
        "candidate",
        "legitimately",
        "found",
        "beautiful",
        "commentator",
        "emphasize",
        "point",
        "include",
        "ginsborg",
        "breitenbach",
        "number",
        "commentator",
        "taken",
        "dilemma",
        "consideration",
        "related",
        "fatal",
        "kant",
        "view",
        "judgment",
        "beauty",
        "make",
        "legitimate",
        "claim",
        "universal",
        "validity",
        "see",
        "example",
        "meerbote",
        "cited",
        "guyer",
        "although",
        "guyer",
        "offer",
        "positive",
        "assessment",
        "see",
        "b",
        "n",
        "others",
        "argued",
        "kant",
        "view",
        "saved",
        "drawing",
        "consideration",
        "mentioned",
        "official",
        "argument",
        "deduction",
        "noted",
        "section",
        "kant",
        "draw",
        "close",
        "connection",
        "capacity",
        "aesthetic",
        "judgment",
        "nature",
        "moral",
        "being",
        "even",
        "though",
        "kant",
        "appeal",
        "connection",
        "deduction",
        "taste",
        "commentator",
        "including",
        "elliott",
        "crawford",
        "kemal",
        "savile",
        "taken",
        "moral",
        "consideration",
        "constitute",
        "ultimate",
        "ground",
        "legitimacy",
        "judgment",
        "beauty",
        "another",
        "strategy",
        "drawing",
        "consideration",
        "outside",
        "deduction",
        "appeal",
        "kant",
        "theory",
        "aesthetic",
        "idea",
        "see",
        "section",
        "ostensibly",
        "part",
        "theory",
        "art",
        "rather",
        "core",
        "theory",
        "taste",
        "strategy",
        "adopted",
        "savile",
        "chignell",
        "chignell",
        "view",
        "differs",
        "savile",
        "make",
        "appeal",
        "moral",
        "consideration",
        "finally",
        "commentator",
        "held",
        "argument",
        "official",
        "deduction",
        "unsuccessful",
        "avoiding",
        "dilemma",
        "version",
        "argument",
        "offered",
        "appeal",
        "notion",
        "common",
        "sense",
        "effective",
        "see",
        "particular",
        "rind",
        "kalar",
        "ch",
        "assessment",
        "objection",
        "kant",
        "deduction",
        "taste",
        "generally",
        "complicated",
        "number",
        "fundamental",
        "interpretive",
        "issue",
        "discussed",
        "next",
        "section"
    ]
}