{
    "main_text": "The background to Kant’s views in the Critique || Leibniz and Newton\n2.1 Leibniz and Newton\n\nThere is no doubt that the debate between the Leibnizians and the\nNewtonians concerning the status of space and time forms part of the\nessential background to Kant’s views throughout his career.\nAlthough Newton originally formulated his conception of space and time\nin response to Descartes’s views in the Principles of\nPhilosophy (1644), by the turn of the eighteenth century, Newton\nand his followers were embroiled in an extensive debate with Leibniz\nand his supporters on the Continent. This reflected, in part, the\nfamous priority dispute regarding the calculus, but it also reflected\nsome of Leibniz’s fundamental criticisms of Newton’s views\nof space, time and motion in Principia mathematica (1687,\n1713—second edition). Leibniz raised many of those criticisms in\nhis correspondence with Samuel Clarke, who defended Newton’s\nideas. Kant mentions this debate frequently in the\nCritique (see, e.g., A23/B37, A39/B56, & A46/B64).\nBroadly speaking, Newton and his followers argued for the importance\nof thinking of space, time and motion as “absolute” or at least from\nan absolute point of view. This means that one regards space and time\nas existing independently of matter and relations amongst material\nbodies. As Newton (1999, 408) puts it, “Absolute space, of its own\nnature without reference to anything external, always remains\nhomogeneous and immovable.” So absolute space, or space regarded from\nan absolute point of view, has a nature and has the properties of\nhomogeneity and immovability independently of anything else. Since\nspace on this conception has a nature and has properties independently\nof any relations, Newton was often interpreted as saying that space is\na being or perhaps a substance. To the chagrin of many philosophers,\nNewton avoided using these categories in the Principia\nitself, although in a famous unpublished manuscript he denied that one\nshould think of space as either a substance or as an\naccident (Newton 2014, 35–36). In his correspondence with Clarke\n(1715–1716), Leibniz then argued that Newton’s conception of\nspace and time conflicts with the principle of sufficient reason: if\nspace were to exist independently of all matter and material\nrelations, then there could be no reason for God to have chosen to\ncreate matter in one location rather than any other; independently of\nmatter, all locations are indistinguishable (see L 5: 3–4). In part to\nsolve this problem involving the principle of sufficient reason,\nLeibniz then argues that space is merely the order of relations\namongst material bodies. So on his view, space depends on objects and\ntheir relations, which solves the problem: since space does not exist\nindependently of matter, God never faced the question of “where” to\nplace bodies in space. To create a bunch of matter just is to create\nspace.\n\nMany interpreters have thought that in the Critique of Pure\nReason, and particularly in its first section, the Transcendental\nAesthetic, Kant attempts to engage the Leibnizian\n“relationalist” and the Newtonian “absolutist”\nconceptions of space with transcendental\n idealism.[1]\n As Charles Parsons puts it, “the issue between what are now\ncalled absolutist and relationalist conceptions of space and time,\nrepresented paradigmatically by Newton and Leibniz” represents\n“the background to all of [Kant’s] thinking” about\nspace and time (Parsons 1992, 67; cf. Torretti 1999, 105). In the\nbeginning of the Transcendental Aesthetic, Kant frames his view by\ncontrasting it with the failures of the Leibnizians and the Newtonians\nto conceive of space appropriately:\n\nNow what are space and time? Are they actual entities [wirkliche\nWesen]? Are they only determinations or also relations of things, but\nstill such as would belong to them even if they were not intuited? Or\nare they such that they belong only to the form of intuition, and\ntherefore to the subjective constitution of our mind, without which\nthese predicates could not be ascribed to any things at all?\n(A23/B37–8).\n\n\nThe view that space and time are actual entities is meant to represent\nthe Newtonian position, and the view that they are determinations or\nrelations of things, the Leibnizian position (but cf. Hatfield 2006,\n77–8). Later in the Transcendental Aesthetic, he refers to the\nNewtonians as the “mathematical investigators” of nature,\nwho contend that space and time “subsist” on their own,\nand to the Leibnizians as the “metaphysicians of nature,”\nwho think that space and time “inhere” in objects and\ntheir relations (see A39–40/B56–57).\n\nWhile Kant does clearly allude to this theoretical background, it is\nnoteworthy that views of the sort he defends in the\nAesthetic—that space and time are transcendentally ideal, that\nthey are mere “forms” of intuition, that they depend upon\nthe “subjective constitution of the mind,” and so\non—do not obviously make contact with the Leibniz/Newton debate.\nThis raises questions about Kant’s use of the Leibniz-Newton\nbackground. First, how does Kant understand the Leibnizian and the\nNewtonian conceptions of space and time? Does he think of them solely\nas views on what I have called the status of space vis-à-vis\nobjects and relations, or does he think that they contain, or perhaps\nentail, views on other topics, such as the character of our\nrepresentations of space and time? Does Kant regard himself as needing\nto undermine either, or both, of these prior conceptions in order to\nsupport his conclusion that space and time are transcendentally ideal?\nDoes Kant’s rejection of both the Leibnizian and the\nNewtonian conceptions as types of “transcendental realism”\nilluminate what he means by transcendental idealism? And finally, is\nKant on secure ground in characterizing his predecessors’ views\nin this way? These questions will help to guide the discussion\nbelow.\n\nThe fact that Kant focuses on the debate between the Leibnizians and\nthe Newtonians is perplexing given his evident lack of interest,\nwithin the context of the Critique, in problems concerning\nmotion. One of Newton’s principal reasons for distinguishing\nbetween an “absolute” (or “mathematical”) and\na “relative” (or “common”) conception of space\nis to ground a distinction between true and merely relative motion.\nNewton construes the true motion of an object, as opposed to its\nmerely “apparent” motion, not in terms of its change in\nrelations to other objects, as Descartes had done in his\nPrinciples, but in terms of its change of absolute place\n(Janiak 2008, chapter five). So the very idea of absolute or\nmathematical space helps to express what true motion is. Discovering\nthe true, as opposed to the merely apparent, motions of objects, so\nthat one can then determine the forces that cause these true motions,\nrepresents one of the principal goals of Newton’s\nPrincipia.\n\nKant is perfectly well aware of these details from the Scholium to the\nPrincipia, but he makes it clear in the Transcendental\nAesthetic that he wishes to bracket questions concerning the motion of\nobjects. The reason is that he regards <motion> as an\nempirical concept, and the Aesthetic aims to articulate a purely a\npriori conception of space (see A 41/B 58; also MFNS, 4: 482).\nInstead, Kant tackles physical motion in the Metaphysical\nFoundations, where he contends that one can distinguish true from\nrelative motion by determining the center of mass frame of the solar\nsystem (4: 482, 487, 555–6, 559–63), thereby avoiding the postulation\nof Newton’s mathematical (absolute) space.\n\nBut what if we abstract away from questions of physical motion? What\nif we consider motion within a much more abstract context: for\ninstance, can the motion of a mathematical point through\nspace be considered in the Aesthetic? Kant makes it clear that this\nremains empirical because the concept of motion itself is empirical,\nand so should still be deferred to the Metaphysical\nFoundations. Indeed, the latter begins with a consideration of\nmotion in abstraction from various physical questions like the mass of\nthe objects and then slowly progresses by adding further physical (or\nempirical) elements.\n\nKant does discuss the important notion of the “motion of the\nsubject” in a famous footnote in §26 of the Transcendental\nDeduction. Is that kind of motion under discussion, perhaps\nimplicitly, in the context of the Aesthetic? Kant does not think that\nthe “motion of the subject,” for instance in drawing a\ncircle, is empirical, but he does think that it requires—indeed,\nit apparently exemplifies—the unity of the manifold of intuition\nimposed by the unity of consciousness. Whatever this doctrine may\nmean, it seems clear that from Kant’s own perspective it cannot\nbe dealt with in the Aesthetic, for the latter text abstracts from all\ncontributions of understanding and therefore abstracts from any\nconsideration of the unity of the manifold imposed by the unity of\nunderstanding. (This seems to be closely related to Kant’s point\nin §26 that it is only from within the point of view of the\nTranscendental Analytic that one is able to make a distinction between\nwhat he calls space as a form of intuition and space as a\nformal intuition.) So from Kant’s point of view,\nalthough various kinds of motion are considered in the critical\nphilosophy—including the so-called motion of the subject in\ndescribing a space, the motion of a mathematical point through space,\nand the motion of a body through space—no kind of motion can be\nconsidered within the context of the Aesthetic (see Pollok 2006).\n\nThis seems to suggest that Kant’s interest in the\nabsolutism-relationalism debate does not originate with his concern to\ndiscuss motion in any sense of the term. In what follows,\nthen, one goal is to specify why Kant remains focused in the Aesthetic\non the views of Leibniz and Newton (and their respective followers).\nIt may be that Kant’s interest derives from his general interest\nin the views of what he calls the “metaphysicians,” the\nLeibnizians, and of what he calls the “mathematicians,”\nthe Newtonians. Throughout the pre-critical and critical periods, Kant\nevinces considerable interest in various attempts to reconcile certain\naspects of Leibnizian metaphysics with the Newtonian view of nature\n(Friedman 1992, 1–52). But there is also more to be said about\nKant’s focus on the absolutism-relationalism debate (see\nespecially Messina 2018), which we do below.\n",
    "section_title": "2.1 Leibniz and Newton",
    "entry_title": "Kant’s Views on Space and Time",
    "hierarchy_title": "Kant’s Views on Space and Time || The background to Kant’s views in the Critique || Leibniz and Newton",
    "tokenized_text": [
        "background",
        "kant",
        "view",
        "critique",
        "leibniz",
        "newton",
        "leibniz",
        "newton",
        "doubt",
        "debate",
        "leibnizians",
        "newtonian",
        "concerning",
        "status",
        "space",
        "time",
        "form",
        "part",
        "essential",
        "background",
        "kant",
        "view",
        "throughout",
        "career",
        "although",
        "newton",
        "originally",
        "formulated",
        "conception",
        "space",
        "time",
        "response",
        "descartes",
        "view",
        "principle",
        "philosophy",
        "turn",
        "eighteenth",
        "century",
        "newton",
        "follower",
        "embroiled",
        "extensive",
        "debate",
        "leibniz",
        "supporter",
        "continent",
        "reflected",
        "part",
        "famous",
        "priority",
        "dispute",
        "regarding",
        "calculus",
        "also",
        "reflected",
        "leibniz",
        "fundamental",
        "criticism",
        "newton",
        "view",
        "space",
        "time",
        "motion",
        "principia",
        "mathematica",
        "second",
        "edition",
        "leibniz",
        "raised",
        "many",
        "criticism",
        "correspondence",
        "samuel",
        "clarke",
        "defended",
        "newton",
        "idea",
        "kant",
        "mention",
        "debate",
        "frequently",
        "critique",
        "see",
        "eg",
        "ab",
        "ab",
        "ab",
        "broadly",
        "speaking",
        "newton",
        "follower",
        "argued",
        "importance",
        "thinking",
        "space",
        "time",
        "motion",
        "absolute",
        "least",
        "absolute",
        "point",
        "view",
        "mean",
        "one",
        "regard",
        "space",
        "time",
        "existing",
        "independently",
        "matter",
        "relation",
        "amongst",
        "material",
        "body",
        "newton",
        "put",
        "absolute",
        "space",
        "nature",
        "without",
        "reference",
        "anything",
        "external",
        "always",
        "remains",
        "homogeneous",
        "immovable",
        "absolute",
        "space",
        "space",
        "regarded",
        "absolute",
        "point",
        "view",
        "nature",
        "property",
        "homogeneity",
        "immovability",
        "independently",
        "anything",
        "else",
        "since",
        "space",
        "conception",
        "nature",
        "property",
        "independently",
        "relation",
        "newton",
        "often",
        "interpreted",
        "saying",
        "space",
        "perhaps",
        "substance",
        "chagrin",
        "many",
        "philosopher",
        "newton",
        "avoided",
        "using",
        "category",
        "principia",
        "although",
        "famous",
        "unpublished",
        "manuscript",
        "denied",
        "one",
        "think",
        "space",
        "either",
        "substance",
        "accident",
        "newton",
        "correspondence",
        "clarke",
        "leibniz",
        "argued",
        "newton",
        "conception",
        "space",
        "time",
        "conflict",
        "principle",
        "sufficient",
        "reason",
        "space",
        "exist",
        "independently",
        "matter",
        "material",
        "relation",
        "could",
        "reason",
        "god",
        "chosen",
        "create",
        "matter",
        "one",
        "location",
        "rather",
        "independently",
        "matter",
        "location",
        "indistinguishable",
        "see",
        "l",
        "part",
        "solve",
        "problem",
        "involving",
        "principle",
        "sufficient",
        "reason",
        "leibniz",
        "argues",
        "space",
        "merely",
        "order",
        "relation",
        "amongst",
        "material",
        "body",
        "view",
        "space",
        "depends",
        "object",
        "relation",
        "solves",
        "problem",
        "since",
        "space",
        "exist",
        "independently",
        "matter",
        "god",
        "never",
        "faced",
        "question",
        "place",
        "body",
        "space",
        "create",
        "bunch",
        "matter",
        "create",
        "space",
        "many",
        "interpreter",
        "thought",
        "critique",
        "pure",
        "reason",
        "particularly",
        "first",
        "section",
        "transcendental",
        "aesthetic",
        "kant",
        "attempt",
        "engage",
        "leibnizian",
        "relationalist",
        "newtonian",
        "absolutist",
        "conception",
        "space",
        "transcendental",
        "idealism",
        "charles",
        "parson",
        "put",
        "issue",
        "called",
        "absolutist",
        "relationalist",
        "conception",
        "space",
        "time",
        "represented",
        "paradigmatically",
        "newton",
        "leibniz",
        "represents",
        "background",
        "kant",
        "thinking",
        "space",
        "time",
        "parson",
        "cf",
        "torretti",
        "beginning",
        "transcendental",
        "aesthetic",
        "kant",
        "frame",
        "view",
        "contrasting",
        "failure",
        "leibnizians",
        "newtonian",
        "conceive",
        "space",
        "appropriately",
        "space",
        "time",
        "actual",
        "entity",
        "wirkliche",
        "wesen",
        "determination",
        "also",
        "relation",
        "thing",
        "still",
        "would",
        "belong",
        "even",
        "intuited",
        "belong",
        "form",
        "intuition",
        "therefore",
        "subjective",
        "constitution",
        "mind",
        "without",
        "predicate",
        "could",
        "ascribed",
        "thing",
        "ab",
        "view",
        "space",
        "time",
        "actual",
        "entity",
        "meant",
        "represent",
        "newtonian",
        "position",
        "view",
        "determination",
        "relation",
        "thing",
        "leibnizian",
        "position",
        "cf",
        "hatfield",
        "later",
        "transcendental",
        "aesthetic",
        "refers",
        "newtonian",
        "mathematical",
        "investigator",
        "nature",
        "contend",
        "space",
        "time",
        "subsist",
        "leibnizians",
        "metaphysicians",
        "nature",
        "think",
        "space",
        "time",
        "inhere",
        "object",
        "relation",
        "see",
        "ab",
        "kant",
        "clearly",
        "allude",
        "theoretical",
        "background",
        "noteworthy",
        "view",
        "sort",
        "defends",
        "aestheticthat",
        "space",
        "time",
        "transcendentally",
        "ideal",
        "mere",
        "form",
        "intuition",
        "depend",
        "upon",
        "subjective",
        "constitution",
        "mind",
        "ondo",
        "obviously",
        "make",
        "contact",
        "leibniznewton",
        "debate",
        "raise",
        "question",
        "kant",
        "use",
        "leibniznewton",
        "background",
        "first",
        "kant",
        "understand",
        "leibnizian",
        "newtonian",
        "conception",
        "space",
        "time",
        "think",
        "solely",
        "view",
        "called",
        "status",
        "space",
        "visàvis",
        "object",
        "relation",
        "think",
        "contain",
        "perhaps",
        "entail",
        "view",
        "topic",
        "character",
        "representation",
        "space",
        "time",
        "kant",
        "regard",
        "needing",
        "undermine",
        "either",
        "prior",
        "conception",
        "order",
        "support",
        "conclusion",
        "space",
        "time",
        "transcendentally",
        "ideal",
        "kant",
        "rejection",
        "leibnizian",
        "newtonian",
        "conception",
        "type",
        "transcendental",
        "realism",
        "illuminate",
        "mean",
        "transcendental",
        "idealism",
        "finally",
        "kant",
        "secure",
        "ground",
        "characterizing",
        "predecessor",
        "view",
        "way",
        "question",
        "help",
        "guide",
        "discussion",
        "fact",
        "kant",
        "focus",
        "debate",
        "leibnizians",
        "newtonian",
        "perplexing",
        "given",
        "evident",
        "lack",
        "interest",
        "within",
        "context",
        "critique",
        "problem",
        "concerning",
        "motion",
        "one",
        "newton",
        "principal",
        "reason",
        "distinguishing",
        "absolute",
        "mathematical",
        "relative",
        "common",
        "conception",
        "space",
        "ground",
        "distinction",
        "true",
        "merely",
        "relative",
        "motion",
        "newton",
        "construes",
        "true",
        "motion",
        "object",
        "opposed",
        "merely",
        "apparent",
        "motion",
        "term",
        "change",
        "relation",
        "object",
        "descartes",
        "done",
        "principle",
        "term",
        "change",
        "absolute",
        "place",
        "janiak",
        "chapter",
        "five",
        "idea",
        "absolute",
        "mathematical",
        "space",
        "help",
        "express",
        "true",
        "motion",
        "discovering",
        "true",
        "opposed",
        "merely",
        "apparent",
        "motion",
        "object",
        "one",
        "determine",
        "force",
        "cause",
        "true",
        "motion",
        "represents",
        "one",
        "principal",
        "goal",
        "newton",
        "principia",
        "kant",
        "perfectly",
        "well",
        "aware",
        "detail",
        "scholium",
        "principia",
        "make",
        "clear",
        "transcendental",
        "aesthetic",
        "wish",
        "bracket",
        "question",
        "concerning",
        "motion",
        "object",
        "reason",
        "regard",
        "motion",
        "empirical",
        "concept",
        "aesthetic",
        "aim",
        "articulate",
        "purely",
        "priori",
        "conception",
        "space",
        "see",
        "b",
        "also",
        "mfns",
        "instead",
        "kant",
        "tackle",
        "physical",
        "motion",
        "metaphysical",
        "foundation",
        "contends",
        "one",
        "distinguish",
        "true",
        "relative",
        "motion",
        "determining",
        "center",
        "mass",
        "frame",
        "solar",
        "system",
        "thereby",
        "avoiding",
        "postulation",
        "newton",
        "mathematical",
        "absolute",
        "space",
        "abstract",
        "away",
        "question",
        "physical",
        "motion",
        "consider",
        "motion",
        "within",
        "much",
        "abstract",
        "context",
        "instance",
        "motion",
        "mathematical",
        "point",
        "space",
        "considered",
        "aesthetic",
        "kant",
        "make",
        "clear",
        "remains",
        "empirical",
        "concept",
        "motion",
        "empirical",
        "still",
        "deferred",
        "metaphysical",
        "foundation",
        "indeed",
        "latter",
        "begin",
        "consideration",
        "motion",
        "abstraction",
        "various",
        "physical",
        "question",
        "like",
        "mass",
        "object",
        "slowly",
        "progress",
        "adding",
        "physical",
        "empirical",
        "element",
        "kant",
        "discus",
        "important",
        "notion",
        "motion",
        "subject",
        "famous",
        "footnote",
        "transcendental",
        "deduction",
        "kind",
        "motion",
        "discussion",
        "perhaps",
        "implicitly",
        "context",
        "aesthetic",
        "kant",
        "think",
        "motion",
        "subject",
        "instance",
        "drawing",
        "circle",
        "empirical",
        "think",
        "requiresindeed",
        "apparently",
        "exemplifiesthe",
        "unity",
        "manifold",
        "intuition",
        "imposed",
        "unity",
        "consciousness",
        "whatever",
        "doctrine",
        "may",
        "mean",
        "seems",
        "clear",
        "kant",
        "perspective",
        "dealt",
        "aesthetic",
        "latter",
        "text",
        "abstract",
        "contribution",
        "understanding",
        "therefore",
        "abstract",
        "consideration",
        "unity",
        "manifold",
        "imposed",
        "unity",
        "understanding",
        "seems",
        "closely",
        "related",
        "kant",
        "point",
        "within",
        "point",
        "view",
        "transcendental",
        "analytic",
        "one",
        "able",
        "make",
        "distinction",
        "call",
        "space",
        "form",
        "intuition",
        "space",
        "formal",
        "intuition",
        "kant",
        "point",
        "view",
        "although",
        "various",
        "kind",
        "motion",
        "considered",
        "critical",
        "philosophyincluding",
        "socalled",
        "motion",
        "subject",
        "describing",
        "space",
        "motion",
        "mathematical",
        "point",
        "space",
        "motion",
        "body",
        "spaceno",
        "kind",
        "motion",
        "considered",
        "within",
        "context",
        "aesthetic",
        "see",
        "pollok",
        "seems",
        "suggest",
        "kant",
        "interest",
        "absolutismrelationalism",
        "debate",
        "originate",
        "concern",
        "discus",
        "motion",
        "sense",
        "term",
        "follows",
        "one",
        "goal",
        "specify",
        "kant",
        "remains",
        "focused",
        "aesthetic",
        "view",
        "leibniz",
        "newton",
        "respective",
        "follower",
        "may",
        "kant",
        "interest",
        "derives",
        "general",
        "interest",
        "view",
        "call",
        "metaphysicians",
        "leibnizians",
        "call",
        "mathematician",
        "newtonian",
        "throughout",
        "precritical",
        "critical",
        "period",
        "kant",
        "evinces",
        "considerable",
        "interest",
        "various",
        "attempt",
        "reconcile",
        "certain",
        "aspect",
        "leibnizian",
        "metaphysics",
        "newtonian",
        "view",
        "nature",
        "friedman",
        "also",
        "said",
        "kant",
        "focus",
        "absolutismrelationalism",
        "debate",
        "see",
        "especially",
        "messina"
    ]
}