{
    "main_text": "Freedom and Necessity\n6. Religion and Morality\n\nDiscussions of religious themes can be found in most of Hume’s\nand Kant’s major works. Their treatments of the subject differ\nsignificantly, but they have a few important things in common,\nespecially on the question of how religion relates to morality. Above\nall, both philosophers advocate a secularized approach to moral\nphilosophy. That is, both argue for the independence of morality from\nreligion and the importance of keeping the two distinct. They both\nexpress deep concern about the corrupting influence of false religion,\nincluding “enthusiasm” and “superstition”. And\nthey both seek to undermine a good deal of Christian theology,\nincluding traditional arguments for the existence of God. There are\nalso significant disagreements, however. Generally speaking, Hume is\nfar more alert to religion’s potential costs, such as\nintolerance, violence, and distraction from whatever happiness is\navailable in this life. Kant, by contrast, seems far more attuned to\nthe benefits of religion, especially its attempts to address the human\nneed for ultimate answers or consolation in the face of death and\nsuffering.\n\nOn Hume’s view, the foundation of morality has nothing to do\nwith God. This is evident from his distinctive version of\nsentimentalism. He argues that morality, much like our aesthetic\nresponses to beauty, is “founded entirely on the peculiar fabric\nand constitution of the human species” (EPM 1.3). This claim is\nmade in the context of arguing against a form of moral rationalism\nthat locates the foundation of morality in immutable truths\ndiscoverable by reason (Schneewind 2010). Against rationalists like\nSamuel Clarke, Hume claims that morality is a distinctly and entirely\nhuman phenomenon; there are no grounds for believing that human beings\nexist in any kind of moral community with God or that God is\nanswerable to the moral norms that bind us (Schneewind 2010). For\npresent purposes, there are two additional points to appreciate.\nFirst, Hume’s claim entails a rejection of the idea that moral\ndistinctions between good and evil are instituted by divine command,\nas argued by voluntarists such as Pufendorf, Luther, or Calvin.\nSecond, Hume’s version of the above claim differs from the\nversion found in Hutcheson. On Hutcheson’s view, human nature is\nessentially good and its goodness reflects the wisdom and benevolence\nof God. When we behave virtuously, we further the purposes for which\nwe were created. Hume, by contrast, rejects Hutcheson’s equation\nof the natural with the good (T 3.1.2.10), and he rejects his\npredecessor’s underlying teleology (Gill 2006:\n194–208).\n\nHume frequently draws attention to the moral and political costs of\nreligion. He never argues that religion is inherently destructive, but\nhe consistently claims that it tends to distort and corrupt morality.\nWere it not for religion’s influence, Hume claims, we would\nnever approve of qualities such as “celibacy, fasting, penance,\nmortification, self-denial, humility, silence, solitude, and the whole\ntrain of monkish virtues” (EPM 9.1.3). The “delusive\nglosses of superstition and false religion” can cause us to\napprove of such qualities despite the fact that they are neither\nuseful nor agreeable (EPM 9.1.3). Similarly, Hume emphasizes the\ndifference between moral and religious sources of motivation. When a\nperson pays a debt or restores a loan, for example, “his divinity is\nnowise beholden to him; because these acts of justice are what he was\nbound to perform, and what many would have performed, were there no\ngod in the universe. But if he fast a day, or give himself a sound\nwhipping; this has a direct reference, in his opinion, to the service\nof God. No other motive could engage him to such austerities” (NHR\n14.6). Hume often blames these distortions of morality on particular\nforms of Christianity, such as Catholicism and sectarian offshoots of\nCalvinism and Lutheranism. But in some places Hume comes close to\nfaulting any religion that represents God as\n“infinitely superior to mankind” (NHR 10.2), arguing that,\n“[t]he more tremendous the divinity is represented, the more\ntame and submissive do men become to his ministers” (NHR 14.8).\nHe clearly believes that monotheistic religions tend to focus human\nattention on the one God rather than on the enjoyment of life on\nearth. Monotheism also tends to promote intolerance, factionalism, and\neven violence.\n\nLike Hume, Kant holds that the foundation of morality is independent\nof religion. The main difference between them is that Hume locates\nthat foundation in human nature, while Kant —depending on the\ninterpretation—locates it in the structure of practical reason,\nthe nature of rational beings, or the supreme value of freedom. On\nKant’s view, morality is not only independent of religion; it is\nalso more fundamental. One way that he gives priority to morality is\nby arguing that belief in God follows from a moral commitment, and by\ndenying that recognition of the moral law follows from or must be\ngrounded in recognition of God’s authority. A second way in\nwhich Kant treats morality as fundamental is by denying that we have\nany duties to God. All that God commands us to do is what morality\nrequires: our duties to ourselves and others. A third point is that\nKant insists that children not be taught about religion until they are\nfamiliar with basic moral concepts and principles; otherwise, they may\nthink, for example, that the reason one should act rightly is to hope\nfor God’s favor and to avoid God’s punishment. He argues\nthat Christianity is superior to other ecclesiastical faiths because\nof the centrality of ethics within it from its inception (Rel 6:167).\nBut all ecclesiastical faiths are liable to corruption, and none is\nthe ideal form for religion to take. Ideally, we will dispense with\ndistinct ecclesiastical faiths, along with their revealed texts and\ndoctrinal statutes and observances, in favor of a universal, pure\nreligion of reason, dedicated to morality.\n\nWhile Kant holds that morality’s foundation is independent of\nreligion, the two are more closely connected for him than they are for\nHume. Compared with Hume, Kant is far less antagonistic to religion,\nand he consistently tries to preserve a place for religious belief\nwithin the strictures of his moral philosophy. Indeed, this is an\nimportant aspect of his approach to morality. Kant’s\n“moral theism” is one of his most significant\ncontributions to the philosophy of religion and the question of\nreligion’s relation to morality. Moral theism is belief in God\nfounded on morality. By belief (or faith) [Glaube], Kant\nmeans something different from knowledge [Wissen] (A 822/B\n850; WOT 8:140–41). Believing and knowing both involve holding\nsomething to be true. When one knows something, one holds it to be\ntrue on grounds that are “subjectively and objectively”\nsufficient, whereas when one believes something, one holds it to be\ntrue on grounds that are subjectively but not objectively sufficient\n(A 822/B 850). Here, Kant takes objective sufficiency to imply valid\ntheoretical grounds, such as evidence or theoretical argument; he\ntakes subjective sufficiency, by contrast, to imply valid practical\ngrounds. Thus, belief entails having valid practical reasons for\nholding something to be true, while lacking valid theoretical reasons\nfor doing so. Indeed, when it comes to belief in God, Kant does not\nthink that knowledge is possible (CPJ 5:471–72).\n\nKant’s position contains a distinctly moral conception of God.\nIn addition to the attributes of omniscience, omnipresence, and\nomnipotence, he ascribes to God the moral attributes of holiness,\nbenevolence, and justice (LPDR 28:1073–74). God is not only\nauthor and executor of the moral law, but also as its\n“personification” (C 27:322; V 27:530, 723; LPDR 28:1076,\n1091). Kant also says that all moral requirements can be seen\nas divine commands (CPrR 5:129; Rel 6:153). God knows and cares\nabout our virtue and well-being. In particular, he cares about the\nrealization of the highest good, in which people attain maximal virtue\nand, consequently, maximal happiness. This is a God who has created\nthe world, has incorporated morality into the world, and has a moral\nplan for the world (CPrR 5:125; CPJ 5:450). Belief in God allows us to\nretain our faith that some of our moral actions will produce the\nintended good consequences, and that if we strive our best to promote\nthe highest good, God will complete the task (C 27:310, 321–22;\nCPJ 5:450–53; Rel 6:74–77, 192, 201–202).\n\nThe relation between God and the highest good is the basis of\nKant’s main argument for belief in God. (See Wood 1970.) The\nargument, most clearly articulated in the Critique of Practical\nReason, goes like this (CPrR 5:110–14, 124–46). The\nmoral law issues categorical demands through each agent’s own\nreason. If the moral law sets forth an end for us to promote, we must\npromote it. For our promotion of this end to be rational, the end must\nbe one that we can rationally view as possible for us to promote\nthrough our own agency. The moral law gives rise to the highest good\n(i.e., virtue and conditioned, proportionate happiness), as practical\nreason’s ultimate end. Thus, we must promote it. Yet it is not\nclear that we are capable of effecting the highest good, given the\nlimitations of our agency and the conditions and workings of the\nnatural world. If the realization of the highest good is not possible,\nhowever, then we cannot rationally promote it as an end; indeed, we\ncannot even make sense of it as an end. But if we do not promote the\nhighest good, we flout the moral law. Now, suppose that there were a\nsupreme, eternal, all powerful, all knowing ruler of the universe\n(i.e., God); he could bring to completion our imperfect strivings for\nthe highest good. Thus, if we postulate the existence of God, we can\nview the highest good as possible, and can rationally follow\nmorality’s command to promote it. There is no reason not to\npostulate God’s existence, since his non-existence cannot be\nproven, and since belief in him does not conflict with any necessary\nbeliefs (CPrR 5:135–43). In addition, since belief in God is\nnecessary for seeing the highest good as possible, we must believe in\nGod (CPrR 5:125–26, 142–46). Thus, belief in God is\ngrounded in the necessity of seeing the highest good as possible, and\nso for the rational compliance with morality. Thus, Kant says that\nbelief in God is morally necessary, and that morality leads\nineluctably to religion (CPrR 5:125). We do not, however, have a duty\nto believe in God. Postulating God’s existence is a theoretical\nexercise of reason, which cannot be morally commanded (CPrR 5:125,\n144). Rather, our duty to promote the highest good gives rise to\n“a need of reason” to assume the possibility of the\nhighest good. From this need emerges the necessity of postulating\nGod’s existence.\n\nKant’s practical argument differs profoundly from his\ncontemporaries’ speculative or theoretical arguments for God’s\nexistence. His approach grounds the necessity of believing in God in\neach person’s practical reason, required to “orient\nourselves in thinking” (WOT 8:136–37). According to Kant,\nbelief in God is “a postulate” of practical reason, that is,\n“a theoretical proposition which is not as such demonstrable,\nbut which is an inseparable corollary of an a priori unconditionally\nvalid practical law” (CPrR 5:122). Although practical arguments\ncannot provide knowledge of God’s existence, they can provide\n“moral certainty” of God’s existence (A\n828–30/B 856–58; CPrR 5:134, 143; LPDR 28:1011–12).\nMoral certainty in God’s existence is stronger than the sort of\nconfidence one could obtain from any theoretical argument.\n\nHume’s influence on Kant regarding the intersection of religion\nand morality is evident, though difficult to measure. It is also hard\nto tell how much of the influence came directly from Hume’s\nwritings. Hume is not often cited regarding religion in Kant’s\nmajor works. Kant’s Lectures on the Philosophical Doctrine\nof Religion, however, suggest familiarity with Hume’s\nDialogues Concerning Natural Religion, a work which Kant\ncould have read in its entirety in 1781 (Wood 1978: 14–15), and\nperhaps in part when it first came out, since Hamann translated the\nfirst and last parts of it for him (Kuehn 2001: 121). Kant explicitly\ndiscusses Hume’s Dialogues in the section on the\nphysiotheological proof, which is what Kant calls the argument from\ndesign (see LPDR 28:1063–4). Furthermore, in the Danzig\nmanuscript of these lectures, Kant cites Hume within his argument\nagainst the cosmotheological proof (Ak 28:1266; Wood 1978: 83n31).\nKant was clearly also familiar with Hume’s The Natural\nHistory of Religion. In “A History of Natural Theology,\naccording to Meiners’ Historia doctrinae de uno vero\nDeo”, Kant refers briefly to Hume’s account of\npolytheists as tolerant in section 9 of The Natural History of\nReligion (LPDR 28:1125).\n\nFinally, it is interesting to note that many philosophers and other\nintellectuals in Königsberg in the late 1750s and early 1760s\nseem to have attributed to Hume a view of religion that has\nsignificant parallels with Kant’s mature view. Hamann and others\nsaw Hume’s skepticism as necessary for purging religion of its\ntraditional arguments and clearing the way for true religion. One\nsource for this view of Hume is the conclusion of book I of the\nTreatise, which Hamann translated into German (with some\nalterations and excisions to hide its origin) and published\nanonymously in 1771 under the title “Night Thoughts of a\nSceptic” (Kuehn 2001: 198–201). Another source is the end\nof the Dialogues, where Philo says, “To be a\nphilosophical skeptic is, in a man of letters, the first and most\nessential step towards being a sound, believing Christian” (DR\n89). This statement is out of line with Philo’s previous\nassertions and arguments, and it comes as a surprise at this point in\nthe text. But, some, including Hamman, take Philo’s remark as an\nexpression of Hume’s fideism. Whether the interpretation of Hume is\ncorrect, Philo’s remark finds deep resonance in Kant. He is no\nfideist, but Kant does hold that purging the traditional “proofs” from\nphilosophical theology helps us recognize that morality itself offers\na better argument for God’s existence –– one which\nprovides the moral certainty sought by finite rational beings such as\nourselves.\n",
    "section_title": "6. Religion and Morality",
    "entry_title": "Kant and Hume on Morality",
    "hierarchy_title": "Kant and Hume on Morality || Freedom and Necessity",
    "tokenized_text": [
        "freedom",
        "necessity",
        "religion",
        "morality",
        "discussion",
        "religious",
        "theme",
        "found",
        "hume",
        "kant",
        "major",
        "work",
        "treatment",
        "subject",
        "differ",
        "significantly",
        "important",
        "thing",
        "common",
        "especially",
        "question",
        "religion",
        "relates",
        "morality",
        "philosopher",
        "advocate",
        "secularized",
        "approach",
        "moral",
        "philosophy",
        "argue",
        "independence",
        "morality",
        "religion",
        "importance",
        "keeping",
        "two",
        "distinct",
        "express",
        "deep",
        "concern",
        "corrupting",
        "influence",
        "false",
        "religion",
        "including",
        "enthusiasm",
        "superstition",
        "seek",
        "undermine",
        "good",
        "deal",
        "christian",
        "theology",
        "including",
        "traditional",
        "argument",
        "existence",
        "god",
        "also",
        "significant",
        "disagreement",
        "however",
        "generally",
        "speaking",
        "hume",
        "far",
        "alert",
        "religion",
        "potential",
        "cost",
        "intolerance",
        "violence",
        "distraction",
        "whatever",
        "happiness",
        "available",
        "life",
        "kant",
        "contrast",
        "seems",
        "far",
        "attuned",
        "benefit",
        "religion",
        "especially",
        "attempt",
        "address",
        "human",
        "need",
        "ultimate",
        "answer",
        "consolation",
        "face",
        "death",
        "suffering",
        "hume",
        "view",
        "foundation",
        "morality",
        "nothing",
        "god",
        "evident",
        "distinctive",
        "version",
        "sentimentalism",
        "argues",
        "morality",
        "much",
        "like",
        "aesthetic",
        "response",
        "beauty",
        "founded",
        "entirely",
        "peculiar",
        "fabric",
        "constitution",
        "human",
        "specie",
        "epm",
        "claim",
        "made",
        "context",
        "arguing",
        "form",
        "moral",
        "rationalism",
        "locates",
        "foundation",
        "morality",
        "immutable",
        "truth",
        "discoverable",
        "reason",
        "schneewind",
        "rationalist",
        "like",
        "samuel",
        "clarke",
        "hume",
        "claim",
        "morality",
        "distinctly",
        "entirely",
        "human",
        "phenomenon",
        "ground",
        "believing",
        "human",
        "being",
        "exist",
        "kind",
        "moral",
        "community",
        "god",
        "god",
        "answerable",
        "moral",
        "norm",
        "bind",
        "u",
        "schneewind",
        "present",
        "purpose",
        "two",
        "additional",
        "point",
        "appreciate",
        "first",
        "hume",
        "claim",
        "entail",
        "rejection",
        "idea",
        "moral",
        "distinction",
        "good",
        "evil",
        "instituted",
        "divine",
        "command",
        "argued",
        "voluntarists",
        "pufendorf",
        "luther",
        "calvin",
        "second",
        "hume",
        "version",
        "claim",
        "differs",
        "version",
        "found",
        "hutcheson",
        "hutcheson",
        "view",
        "human",
        "nature",
        "essentially",
        "good",
        "goodness",
        "reflects",
        "wisdom",
        "benevolence",
        "god",
        "behave",
        "virtuously",
        "purpose",
        "created",
        "hume",
        "contrast",
        "reject",
        "hutcheson",
        "equation",
        "natural",
        "good",
        "reject",
        "predecessor",
        "underlying",
        "teleology",
        "gill",
        "hume",
        "frequently",
        "draw",
        "attention",
        "moral",
        "political",
        "cost",
        "religion",
        "never",
        "argues",
        "religion",
        "inherently",
        "destructive",
        "consistently",
        "claim",
        "tends",
        "distort",
        "corrupt",
        "morality",
        "religion",
        "influence",
        "hume",
        "claim",
        "would",
        "never",
        "approve",
        "quality",
        "celibacy",
        "fasting",
        "penance",
        "mortification",
        "selfdenial",
        "humility",
        "silence",
        "solitude",
        "whole",
        "train",
        "monkish",
        "virtue",
        "epm",
        "delusive",
        "gloss",
        "superstition",
        "false",
        "religion",
        "cause",
        "u",
        "approve",
        "quality",
        "despite",
        "fact",
        "neither",
        "useful",
        "agreeable",
        "epm",
        "similarly",
        "hume",
        "emphasizes",
        "difference",
        "moral",
        "religious",
        "source",
        "motivation",
        "person",
        "pay",
        "debt",
        "restores",
        "loan",
        "example",
        "divinity",
        "nowise",
        "beholden",
        "act",
        "justice",
        "bound",
        "perform",
        "many",
        "would",
        "performed",
        "god",
        "universe",
        "fast",
        "day",
        "give",
        "sound",
        "whipping",
        "direct",
        "reference",
        "opinion",
        "service",
        "god",
        "motive",
        "could",
        "engage",
        "austerity",
        "nhr",
        "hume",
        "often",
        "blame",
        "distortion",
        "morality",
        "particular",
        "form",
        "christianity",
        "catholicism",
        "sectarian",
        "offshoot",
        "calvinism",
        "lutheranism",
        "place",
        "hume",
        "come",
        "close",
        "faulting",
        "religion",
        "represents",
        "god",
        "infinitely",
        "superior",
        "mankind",
        "nhr",
        "arguing",
        "tremendous",
        "divinity",
        "represented",
        "tame",
        "submissive",
        "men",
        "become",
        "minister",
        "nhr",
        "clearly",
        "belief",
        "monotheistic",
        "religion",
        "tend",
        "focus",
        "human",
        "attention",
        "one",
        "god",
        "rather",
        "enjoyment",
        "life",
        "earth",
        "monotheism",
        "also",
        "tends",
        "promote",
        "intolerance",
        "factionalism",
        "even",
        "violence",
        "like",
        "hume",
        "kant",
        "hold",
        "foundation",
        "morality",
        "independent",
        "religion",
        "main",
        "difference",
        "hume",
        "locates",
        "foundation",
        "human",
        "nature",
        "kant",
        "depending",
        "interpretationlocates",
        "structure",
        "practical",
        "reason",
        "nature",
        "rational",
        "being",
        "supreme",
        "value",
        "freedom",
        "kant",
        "view",
        "morality",
        "independent",
        "religion",
        "also",
        "fundamental",
        "one",
        "way",
        "give",
        "priority",
        "morality",
        "arguing",
        "belief",
        "god",
        "follows",
        "moral",
        "commitment",
        "denying",
        "recognition",
        "moral",
        "law",
        "follows",
        "must",
        "grounded",
        "recognition",
        "god",
        "authority",
        "second",
        "way",
        "kant",
        "treat",
        "morality",
        "fundamental",
        "denying",
        "duty",
        "god",
        "god",
        "command",
        "u",
        "morality",
        "requires",
        "duty",
        "others",
        "third",
        "point",
        "kant",
        "insists",
        "child",
        "taught",
        "religion",
        "familiar",
        "basic",
        "moral",
        "concept",
        "principle",
        "otherwise",
        "may",
        "think",
        "example",
        "reason",
        "one",
        "act",
        "rightly",
        "hope",
        "god",
        "favor",
        "avoid",
        "god",
        "punishment",
        "argues",
        "christianity",
        "superior",
        "ecclesiastical",
        "faith",
        "centrality",
        "ethic",
        "within",
        "inception",
        "rel",
        "ecclesiastical",
        "faith",
        "liable",
        "corruption",
        "none",
        "ideal",
        "form",
        "religion",
        "take",
        "ideally",
        "dispense",
        "distinct",
        "ecclesiastical",
        "faith",
        "along",
        "revealed",
        "text",
        "doctrinal",
        "statute",
        "observance",
        "favor",
        "universal",
        "pure",
        "religion",
        "reason",
        "dedicated",
        "morality",
        "kant",
        "hold",
        "morality",
        "foundation",
        "independent",
        "religion",
        "two",
        "closely",
        "connected",
        "hume",
        "compared",
        "hume",
        "kant",
        "far",
        "le",
        "antagonistic",
        "religion",
        "consistently",
        "try",
        "preserve",
        "place",
        "religious",
        "belief",
        "within",
        "stricture",
        "moral",
        "philosophy",
        "indeed",
        "important",
        "aspect",
        "approach",
        "morality",
        "kant",
        "moral",
        "theism",
        "one",
        "significant",
        "contribution",
        "philosophy",
        "religion",
        "question",
        "religion",
        "relation",
        "morality",
        "moral",
        "theism",
        "belief",
        "god",
        "founded",
        "morality",
        "belief",
        "faith",
        "glaube",
        "kant",
        "mean",
        "something",
        "different",
        "knowledge",
        "wissen",
        "b",
        "wot",
        "believing",
        "knowing",
        "involve",
        "holding",
        "something",
        "true",
        "one",
        "know",
        "something",
        "one",
        "hold",
        "true",
        "ground",
        "subjectively",
        "objectively",
        "sufficient",
        "whereas",
        "one",
        "belief",
        "something",
        "one",
        "hold",
        "true",
        "ground",
        "subjectively",
        "objectively",
        "sufficient",
        "b",
        "kant",
        "take",
        "objective",
        "sufficiency",
        "imply",
        "valid",
        "theoretical",
        "ground",
        "evidence",
        "theoretical",
        "argument",
        "take",
        "subjective",
        "sufficiency",
        "contrast",
        "imply",
        "valid",
        "practical",
        "ground",
        "thus",
        "belief",
        "entail",
        "valid",
        "practical",
        "reason",
        "holding",
        "something",
        "true",
        "lacking",
        "valid",
        "theoretical",
        "reason",
        "indeed",
        "come",
        "belief",
        "god",
        "kant",
        "think",
        "knowledge",
        "possible",
        "cpj",
        "kant",
        "position",
        "contains",
        "distinctly",
        "moral",
        "conception",
        "god",
        "addition",
        "attribute",
        "omniscience",
        "omnipresence",
        "omnipotence",
        "ascribes",
        "god",
        "moral",
        "attribute",
        "holiness",
        "benevolence",
        "justice",
        "lpdr",
        "god",
        "author",
        "executor",
        "moral",
        "law",
        "also",
        "personification",
        "c",
        "v",
        "lpdr",
        "kant",
        "also",
        "say",
        "moral",
        "requirement",
        "seen",
        "divine",
        "command",
        "cprr",
        "rel",
        "god",
        "know",
        "care",
        "virtue",
        "wellbeing",
        "particular",
        "care",
        "realization",
        "highest",
        "good",
        "people",
        "attain",
        "maximal",
        "virtue",
        "consequently",
        "maximal",
        "happiness",
        "god",
        "created",
        "world",
        "incorporated",
        "morality",
        "world",
        "moral",
        "plan",
        "world",
        "cprr",
        "cpj",
        "belief",
        "god",
        "allows",
        "u",
        "retain",
        "faith",
        "moral",
        "action",
        "produce",
        "intended",
        "good",
        "consequence",
        "strive",
        "best",
        "promote",
        "highest",
        "good",
        "god",
        "complete",
        "task",
        "c",
        "cpj",
        "rel",
        "relation",
        "god",
        "highest",
        "good",
        "basis",
        "kant",
        "main",
        "argument",
        "belief",
        "god",
        "see",
        "wood",
        "argument",
        "clearly",
        "articulated",
        "critique",
        "practical",
        "reason",
        "go",
        "like",
        "cprr",
        "moral",
        "law",
        "issue",
        "categorical",
        "demand",
        "agent",
        "reason",
        "moral",
        "law",
        "set",
        "forth",
        "end",
        "u",
        "promote",
        "must",
        "promote",
        "promotion",
        "end",
        "rational",
        "end",
        "must",
        "one",
        "rationally",
        "view",
        "possible",
        "u",
        "promote",
        "agency",
        "moral",
        "law",
        "give",
        "rise",
        "highest",
        "good",
        "ie",
        "virtue",
        "conditioned",
        "proportionate",
        "happiness",
        "practical",
        "reason",
        "ultimate",
        "end",
        "thus",
        "must",
        "promote",
        "yet",
        "clear",
        "capable",
        "effecting",
        "highest",
        "good",
        "given",
        "limitation",
        "agency",
        "condition",
        "working",
        "natural",
        "world",
        "realization",
        "highest",
        "good",
        "possible",
        "however",
        "rationally",
        "promote",
        "end",
        "indeed",
        "even",
        "make",
        "sense",
        "end",
        "promote",
        "highest",
        "good",
        "flout",
        "moral",
        "law",
        "suppose",
        "supreme",
        "eternal",
        "powerful",
        "knowing",
        "ruler",
        "universe",
        "ie",
        "god",
        "could",
        "bring",
        "completion",
        "imperfect",
        "striving",
        "highest",
        "good",
        "thus",
        "postulate",
        "existence",
        "god",
        "view",
        "highest",
        "good",
        "possible",
        "rationally",
        "follow",
        "morality",
        "command",
        "promote",
        "reason",
        "postulate",
        "god",
        "existence",
        "since",
        "nonexistence",
        "proven",
        "since",
        "belief",
        "conflict",
        "necessary",
        "belief",
        "cprr",
        "addition",
        "since",
        "belief",
        "god",
        "necessary",
        "seeing",
        "highest",
        "good",
        "possible",
        "must",
        "believe",
        "god",
        "cprr",
        "thus",
        "belief",
        "god",
        "grounded",
        "necessity",
        "seeing",
        "highest",
        "good",
        "possible",
        "rational",
        "compliance",
        "morality",
        "thus",
        "kant",
        "say",
        "belief",
        "god",
        "morally",
        "necessary",
        "morality",
        "lead",
        "ineluctably",
        "religion",
        "cprr",
        "however",
        "duty",
        "believe",
        "god",
        "postulating",
        "god",
        "existence",
        "theoretical",
        "exercise",
        "reason",
        "morally",
        "commanded",
        "cprr",
        "rather",
        "duty",
        "promote",
        "highest",
        "good",
        "give",
        "rise",
        "need",
        "reason",
        "assume",
        "possibility",
        "highest",
        "good",
        "need",
        "emerges",
        "necessity",
        "postulating",
        "god",
        "existence",
        "kant",
        "practical",
        "argument",
        "differs",
        "profoundly",
        "contemporary",
        "speculative",
        "theoretical",
        "argument",
        "god",
        "existence",
        "approach",
        "ground",
        "necessity",
        "believing",
        "god",
        "person",
        "practical",
        "reason",
        "required",
        "orient",
        "thinking",
        "wot",
        "according",
        "kant",
        "belief",
        "god",
        "postulate",
        "practical",
        "reason",
        "theoretical",
        "proposition",
        "demonstrable",
        "inseparable",
        "corollary",
        "priori",
        "unconditionally",
        "valid",
        "practical",
        "law",
        "cprr",
        "although",
        "practical",
        "argument",
        "provide",
        "knowledge",
        "god",
        "existence",
        "provide",
        "moral",
        "certainty",
        "god",
        "existence",
        "b",
        "cprr",
        "lpdr",
        "moral",
        "certainty",
        "god",
        "existence",
        "stronger",
        "sort",
        "confidence",
        "one",
        "could",
        "obtain",
        "theoretical",
        "argument",
        "hume",
        "influence",
        "kant",
        "regarding",
        "intersection",
        "religion",
        "morality",
        "evident",
        "though",
        "difficult",
        "measure",
        "also",
        "hard",
        "tell",
        "much",
        "influence",
        "came",
        "directly",
        "hume",
        "writing",
        "hume",
        "often",
        "cited",
        "regarding",
        "religion",
        "kant",
        "major",
        "work",
        "kant",
        "lecture",
        "philosophical",
        "doctrine",
        "religion",
        "however",
        "suggest",
        "familiarity",
        "hume",
        "dialogue",
        "concerning",
        "natural",
        "religion",
        "work",
        "kant",
        "could",
        "read",
        "entirety",
        "wood",
        "perhaps",
        "part",
        "first",
        "came",
        "since",
        "hamann",
        "translated",
        "first",
        "last",
        "part",
        "kuehn",
        "kant",
        "explicitly",
        "discus",
        "hume",
        "dialogue",
        "section",
        "physiotheological",
        "proof",
        "kant",
        "call",
        "argument",
        "design",
        "see",
        "lpdr",
        "furthermore",
        "danzig",
        "manuscript",
        "lecture",
        "kant",
        "cite",
        "hume",
        "within",
        "argument",
        "cosmotheological",
        "proof",
        "ak",
        "wood",
        "n",
        "kant",
        "clearly",
        "also",
        "familiar",
        "hume",
        "natural",
        "history",
        "religion",
        "history",
        "natural",
        "theology",
        "according",
        "meiners",
        "historia",
        "doctrinae",
        "de",
        "uno",
        "vero",
        "deo",
        "kant",
        "refers",
        "briefly",
        "hume",
        "account",
        "polytheist",
        "tolerant",
        "section",
        "natural",
        "history",
        "religion",
        "lpdr",
        "finally",
        "interesting",
        "note",
        "many",
        "philosopher",
        "intellectual",
        "königsberg",
        "late",
        "s",
        "early",
        "s",
        "seem",
        "attributed",
        "hume",
        "view",
        "religion",
        "significant",
        "parallel",
        "kant",
        "mature",
        "view",
        "hamann",
        "others",
        "saw",
        "hume",
        "skepticism",
        "necessary",
        "purging",
        "religion",
        "traditional",
        "argument",
        "clearing",
        "way",
        "true",
        "religion",
        "one",
        "source",
        "view",
        "hume",
        "conclusion",
        "book",
        "treatise",
        "hamann",
        "translated",
        "german",
        "alteration",
        "excision",
        "hide",
        "origin",
        "published",
        "anonymously",
        "title",
        "night",
        "thought",
        "sceptic",
        "kuehn",
        "another",
        "source",
        "end",
        "dialogue",
        "philo",
        "say",
        "philosophical",
        "skeptic",
        "man",
        "letter",
        "first",
        "essential",
        "step",
        "towards",
        "sound",
        "believing",
        "christian",
        "dr",
        "statement",
        "line",
        "philo",
        "previous",
        "assertion",
        "argument",
        "come",
        "surprise",
        "point",
        "text",
        "including",
        "hamman",
        "take",
        "philo",
        "remark",
        "expression",
        "hume",
        "fideism",
        "whether",
        "interpretation",
        "hume",
        "correct",
        "philo",
        "remark",
        "find",
        "deep",
        "resonance",
        "kant",
        "fideist",
        "kant",
        "hold",
        "purging",
        "traditional",
        "proof",
        "philosophical",
        "theology",
        "help",
        "u",
        "recognize",
        "morality",
        "offer",
        "better",
        "argument",
        "god",
        "existence",
        "one",
        "provides",
        "moral",
        "certainty",
        "sought",
        "finite",
        "rational",
        "being"
    ]
}