{
    "main_text": "Systematic Cosmology: “All Things in the Universe Interactively Connect”\n7. Crisis and Critique: “Groping Among Mere Concepts”\nBut when Kant was reflecting on the divine ground of nature, he was\nassailed by doubts. Studying force in nature is one thing, but\ndeducing God’s existence is quite another. Can one identify God in the\nrigorous and comprehensive way suggested in his third book? Here the\nultimate task clashes with ultimate method. Determining the absolute\nby means of formal demonstration and empirical evidence is too\nbold. How could Kant be certain that he was not kidding himself?\nThe preface of the Only Possible Ground reveals his inner\ntorment. Providence, he writes there, already imparted to common sense\nthe notion that God exists, hence the project of a demonstration is\nredundant (2:65). The insight that God exists does not need “the\nsophistry of subtle inferences” (ibid.). In theory, such a\ndemonstration might illuminate much else in this object, but “to\nachieve this purpose, however, one must venture into the bottomless\nabyss of metaphysics” (2:65.25–66.1). And what is\nmetaphysics? A dark ocean without shore and lighthouse, Kant says, on\nwhich it is all too easy to lose one’s way (2:66.1–6).\nThis is followed by a startling retraction: he writes that his\nontological proof, of all things, should not be mistaken for a\ndemonstration (2:66.12–13). But if it were not a demonstration,\nwhat else could it be? What he wanted to do, he says, was to supply\n“just an argument in support of a demonstration”;\na construction kit (Baugerät) for a future proof\n(2:66.9–10). This kit has been assembled with “great\ndifficulty” (ibidz.), and even so, he owes the reader an\napology, for the kit is incomplete—frankly, it is bad\n(schlecht; 2:66.28).\nTwo years before Kant’s loss of heart, in 1761, the Prussian\nAcademy had announced a question for the public competition of\n1763. The question was whether metaphysical principles, specifically\nthe principles of natural theology and morals, could be proven with\nthe same clarity and precision as the truths of geometry. King\nFrederick II had invited foreign intellectuals and scientists, such as\nMaupertuis, d’Alembert, La Mettrie, Voltaire, Lagrange, and Euler to\nthe academy, and they had little patience with their speculative\nGerman colleagues.  Newton’s star kept rising, and the tough-minded\nforeigners put the metaphysicians in Berlin on the spot. The prize\nquestion was the result.\nWhile Kant was writing the Only Possible Ground, he\nprepared a submission to the contest, the Inquiry Concerning the\nDistinctness of the Principles of Natural Theology and Morals\n(1764). The treatise is known as the Prize Essay, although\nKant only received second prize, behind Mendelssohn. Work on\nthe Prize Essay put Kant in a stressful situation, not only\nbecause he had to meet the contest deadline, but also because he\nforced himself to engage with metaphysics on two levels—in the\nbook, he pursued a first-order question on God’s existence, and in the\nessay, he examined the second-order question of whether such a pursuit\nis actually feasible. This forced Kant to question himself and the\nproject of his book.\nThe Prize Essay was a step toward the issue that would\nlater acquire obsessive importance for Kant, the problem of the\npossibility of metaphysics as a system of conceptual (a\npriori) judgments that are synthetic—that really generate\ntrue knowledge claims, instead of just paraphrasing what is\n“known” through common sense. But, in contrast to\nthe Critique of Pure Reason (1781), the Prize Essay\ncontains still a modicum of hope. Its concern was not whether,\nbut how metaphysics can be possible. Asking “how”\nsuggests that metaphysics is feasible, and that the task is only a\nmatter of determining its right method.\nAs a model of method, the Principia suggested itself. No\nother work in recent history had had such an impact on knowledge; no\nother book had revolutionized the understanding of nature as much as\nNewton’s masterpiece; and no other book contained so many discoveries\nin such rigorous form. Such rigor, it appeared, was the key to the\nextraordinary quality of its contents. Kant, who had studied Newton’s\ninsights a decade earlier, now studied his guidelines, spelled out not\nonly in the “Rules of Philosophy” of\nthe Principia but also in the queries of\nthe Opticks. In the final query (1979 [1730]: 404–5),\nNewton suggests the research strategy of an analysis of wholes into\nparts, followed by a synthesis of the identified causes into\nexplanatory principles.\nAccordingly, Kant’s methodological proposal in the Prize\nEssay is a case for a conceptual analysis as the starting point\nof metaphysics. Synthetic reasoning is premature as long as the\nconcepts involved are ambiguous. Eventually metaphysics should turn\ninto a synthetic discipline, but its current limitations require a\nmandatory analytic phase first (2:290).\nThis proposal allowed Kant to present himself as a thinker with\nexacting standards, and his Prize Essay was a reality-check\non the overly optimistic winner, Mendelssohn’s Treatise on the\nEvidence in the Metaphysical Sciences (1764). The Prize\nEssay was a critique: metaphysics can be salvaged, but only by\nrebuilding it from scratch.\nBy drawing this conclusion Kant sawed off the branch he had been\nsitting on since 1745. Is conceptual philosophical inquiry into\nreality capable of certainty? Kant’s answer was “not\nyet”. But conceptual inquiry had been his work to date, from\nthe Living Forces to the Only Possible Ground. Hence\neverything he had done suddenly appeared to him as terribly\npremature. Suddenly, Kant was in a crisis.\nThings came to a head a year later, in 1765, when he, now\nforty-one, read the Swedish mystic Emmanuel Swedenborg\n(1688–1772). In Heavenly Secrets (8 vol.,\n1749–56), Swedenborg relates his visions of angels, describing\ntheir spiritual world in detail. Kant had been intrigued by the\nhearsay of the clairvoyant’s exploits, but when he read the work, he\nrecognized it as a fraud.\nKant wrote a scathing satire, the Dreams of a Spirit-Seer\n(1766). In it he denounces Swedenborg as the “arch-spirit-seer\nof all spirit-seers” (2:354.20), whose works are\n“fantasies” (2:363.36), “wild figments of the\nimagination” (2:366.11), “eight tomes of nonsense”\n(2:360.15), and the results of “hypochondrial winds” that\nresult in effluence when raging in the guts, and in heavenly visions\nwhen raging in the mind (2:348.25–9).\nWhat disturbed Kant was that he saw in the farting mystic a parody\nof himself (Laywine 1993: 71). The visionary’s world of angels is\nthe reductio of dynamic cosmology—the absurd final\nconsequence of Kant’s own contentions. He had always assumed that\nreality is radically coherent. Science and metaphysics join hands in\nits investigation because the cosmos involves an intelligible as well\nas an empirical side: humans are unqualified parts of nature; mind and\nbody are energetic interacting presences; rationality depends on\nmatter; freedom in nature is just a question of resisting force; and\nso forth. There is only force, and its product, nature. Kant’s ideas\nhad amounted to a dynamic parallelism of the corporeal and the\nmental—just like Swedenborg’s philosophy of heaven.\nThe Dreams of the Spirit-Seer was thus also a\nself-critique. He wrote Mendelssohn that to preempt mockery by others,\nhe found it wisest to mock himself, which was honest and something he\nhad to do because his mind “is really in conflict on this\nissue” (10:70.2–5). The problem, he explains, is the\npresence of the mind in the material world, and that analogies between\nspiritual and material substances are flights of fancy unhindered by\ndata (10:71–2). With this admission, in the letter on April 8,\n1766, before his forty-second birthday, the entire pre-critical\nproject Kant had worked on since he was twenty had come to a crashing\nhalt.\nKant’s first response to this devastating outcome was to overreact.\nWhen a position as a professor at Königsberg University was available,\nhe had to write yet another thesis for the application\nportfolio, On the Form and Principles of the Sensible and the\nIntelligible World (1770), the so-called Inaugural\nDissertation. Since the problem handed to him by the mystic had\nbeen the dynamic unity of a jointly sensible and intelligible reality,\nthe solution must be, according to Kant, their divorce. In\nthe Inaugural Dissertation, he slashed through the Gordian\nknot by cutting nature into two halves, the mundus\nintelligibilis of metaphysics and the mundus sensibilis\nof science.\nHis second response was more considered and very courageous. He\nconfronted his long-held convictions and examined them on possible\nflaws, by which meant to determine which of the claims previously\nadvanced hold up and those that do not. This soul-searching amounted\nto a second-order investigation—not an examination of the\nconceptual contentions as such, but an examination of their\nknowability. This turned out to be an intense task that consumed more\nthan a decade of his life, and which resulted in his greatest work,\nthe Critique of Pure Reason (1781).\nAmong its findings, which historically changed the face of\nphilosophy, are that traditional metaphysics is over (Aviii–x,\nAxix–xx, Bxiv–xv), and that proofs for God’s existence are\ndone with (A631–42/B659–70). Discoveries later made in\nneuroscience confirm Kant’s insights and affirm that perception\nresults from interaction, whereby pathways organize affecting data\n(B1, A15/B29, A50–51/B74–5, B113, B148–9), and that\nthe subject of organized experience—the synthetic unity of\napperception—poses the hard problem of consciousness\n(B154–9).\nAt the same time, Kant qualified there his previous split of the\nsensible from the intelligible; and it was good that he did, because\nas his early insights illustrate, his dynamic ontology, albeit\npremature, had always been on the right track. Thus interactivity\nentered the Critique as a cognitive device for ordering data\n(the disjunctive relation or community; A70/B95 and A80/B106) and for\nperceiving spatial objects (the principle of coexistence;\nA211/B256–A215/B262). The energy field (force stretched out as\nspace) returns there as well, as the only exception to Kant’s critical\nrule not to talk about the intelligible features of mind-independent\nnature.  But the rule had to be broken, he realized, because the\nenergy-field sustains the interactive experience of spatial things\n(A211/B257–A213/B260).\nLater, there would be even more qualifications of the split, and\nKant’s return to his original themes with the Opus Postumum\nwould turn the former divorce of intelligible and sensible into a\nmerely episodic division to be overcome. But by 1781, he had found his\nway: the continued quest for the big questions, but now tempered by\ncritical caution.\n",
    "section_title": "7. Crisis and Critique: “Groping Among Mere Concepts”",
    "entry_title": "Kant’s Philosophical Development",
    "hierarchy_title": "Kant’s Philosophical Development || Systematic Cosmology: “All Things in the Universe Interactively Connect”",
    "tokenized_text": [
        "systematic",
        "cosmology",
        "thing",
        "universe",
        "interactively",
        "connect",
        "crisis",
        "critique",
        "groping",
        "among",
        "mere",
        "concept",
        "kant",
        "reflecting",
        "divine",
        "ground",
        "nature",
        "assailed",
        "doubt",
        "studying",
        "force",
        "nature",
        "one",
        "thing",
        "deducing",
        "god",
        "existence",
        "quite",
        "another",
        "one",
        "identify",
        "god",
        "rigorous",
        "comprehensive",
        "way",
        "suggested",
        "third",
        "book",
        "ultimate",
        "task",
        "clash",
        "ultimate",
        "method",
        "determining",
        "absolute",
        "mean",
        "formal",
        "demonstration",
        "empirical",
        "evidence",
        "bold",
        "could",
        "kant",
        "certain",
        "kidding",
        "preface",
        "possible",
        "ground",
        "reveals",
        "inner",
        "torment",
        "providence",
        "writes",
        "already",
        "imparted",
        "common",
        "sense",
        "notion",
        "god",
        "exists",
        "hence",
        "project",
        "demonstration",
        "redundant",
        "insight",
        "god",
        "exists",
        "need",
        "sophistry",
        "subtle",
        "inference",
        "ibid",
        "theory",
        "demonstration",
        "might",
        "illuminate",
        "much",
        "else",
        "object",
        "achieve",
        "purpose",
        "however",
        "one",
        "must",
        "venture",
        "bottomless",
        "abyss",
        "metaphysics",
        "metaphysics",
        "dark",
        "ocean",
        "without",
        "shore",
        "lighthouse",
        "kant",
        "say",
        "easy",
        "lose",
        "one",
        "way",
        "followed",
        "startling",
        "retraction",
        "writes",
        "ontological",
        "proof",
        "thing",
        "mistaken",
        "demonstration",
        "demonstration",
        "else",
        "could",
        "wanted",
        "say",
        "supply",
        "argument",
        "support",
        "demonstration",
        "construction",
        "kit",
        "baugerät",
        "future",
        "proof",
        "kit",
        "assembled",
        "great",
        "difficulty",
        "ibidz",
        "even",
        "owes",
        "reader",
        "apology",
        "kit",
        "incompletefrankly",
        "bad",
        "schlecht",
        "two",
        "year",
        "kant",
        "loss",
        "heart",
        "prussian",
        "academy",
        "announced",
        "question",
        "public",
        "competition",
        "question",
        "whether",
        "metaphysical",
        "principle",
        "specifically",
        "principle",
        "natural",
        "theology",
        "moral",
        "could",
        "proven",
        "clarity",
        "precision",
        "truth",
        "geometry",
        "king",
        "frederick",
        "ii",
        "invited",
        "foreign",
        "intellectual",
        "scientist",
        "maupertuis",
        "alembert",
        "la",
        "mettrie",
        "voltaire",
        "lagrange",
        "euler",
        "academy",
        "little",
        "patience",
        "speculative",
        "german",
        "colleague",
        "newton",
        "star",
        "kept",
        "rising",
        "toughminded",
        "foreigner",
        "put",
        "metaphysicians",
        "berlin",
        "spot",
        "prize",
        "question",
        "result",
        "kant",
        "writing",
        "possible",
        "ground",
        "prepared",
        "submission",
        "contest",
        "inquiry",
        "concerning",
        "distinctness",
        "principle",
        "natural",
        "theology",
        "moral",
        "treatise",
        "known",
        "prize",
        "essay",
        "although",
        "kant",
        "received",
        "second",
        "prize",
        "behind",
        "mendelssohn",
        "work",
        "prize",
        "essay",
        "put",
        "kant",
        "stressful",
        "situation",
        "meet",
        "contest",
        "deadline",
        "also",
        "forced",
        "engage",
        "metaphysics",
        "two",
        "levelsin",
        "book",
        "pursued",
        "firstorder",
        "question",
        "god",
        "existence",
        "essay",
        "examined",
        "secondorder",
        "question",
        "whether",
        "pursuit",
        "actually",
        "feasible",
        "forced",
        "kant",
        "question",
        "project",
        "book",
        "prize",
        "essay",
        "step",
        "toward",
        "issue",
        "would",
        "later",
        "acquire",
        "obsessive",
        "importance",
        "kant",
        "problem",
        "possibility",
        "metaphysics",
        "system",
        "conceptual",
        "priori",
        "judgment",
        "syntheticthat",
        "really",
        "generate",
        "true",
        "knowledge",
        "claim",
        "instead",
        "paraphrasing",
        "known",
        "common",
        "sense",
        "contrast",
        "critique",
        "pure",
        "reason",
        "prize",
        "essay",
        "contains",
        "still",
        "modicum",
        "hope",
        "concern",
        "whether",
        "metaphysics",
        "possible",
        "asking",
        "suggests",
        "metaphysics",
        "feasible",
        "task",
        "matter",
        "determining",
        "right",
        "method",
        "model",
        "method",
        "principia",
        "suggested",
        "work",
        "recent",
        "history",
        "impact",
        "knowledge",
        "book",
        "revolutionized",
        "understanding",
        "nature",
        "much",
        "newton",
        "masterpiece",
        "book",
        "contained",
        "many",
        "discovery",
        "rigorous",
        "form",
        "rigor",
        "appeared",
        "key",
        "extraordinary",
        "quality",
        "content",
        "kant",
        "studied",
        "newton",
        "insight",
        "decade",
        "earlier",
        "studied",
        "guideline",
        "spelled",
        "rule",
        "philosophy",
        "principia",
        "also",
        "query",
        "opticks",
        "final",
        "query",
        "newton",
        "suggests",
        "research",
        "strategy",
        "analysis",
        "whole",
        "part",
        "followed",
        "synthesis",
        "identified",
        "cause",
        "explanatory",
        "principle",
        "accordingly",
        "kant",
        "methodological",
        "proposal",
        "prize",
        "essay",
        "case",
        "conceptual",
        "analysis",
        "starting",
        "point",
        "metaphysics",
        "synthetic",
        "reasoning",
        "premature",
        "long",
        "concept",
        "involved",
        "ambiguous",
        "eventually",
        "metaphysics",
        "turn",
        "synthetic",
        "discipline",
        "current",
        "limitation",
        "require",
        "mandatory",
        "analytic",
        "phase",
        "first",
        "proposal",
        "allowed",
        "kant",
        "present",
        "thinker",
        "exacting",
        "standard",
        "prize",
        "essay",
        "realitycheck",
        "overly",
        "optimistic",
        "winner",
        "mendelssohn",
        "treatise",
        "evidence",
        "metaphysical",
        "science",
        "prize",
        "essay",
        "critique",
        "metaphysics",
        "salvaged",
        "rebuilding",
        "scratch",
        "drawing",
        "conclusion",
        "kant",
        "sawed",
        "branch",
        "sitting",
        "since",
        "conceptual",
        "philosophical",
        "inquiry",
        "reality",
        "capable",
        "certainty",
        "kant",
        "answer",
        "yet",
        "conceptual",
        "inquiry",
        "work",
        "date",
        "living",
        "force",
        "possible",
        "ground",
        "hence",
        "everything",
        "done",
        "suddenly",
        "appeared",
        "terribly",
        "premature",
        "suddenly",
        "kant",
        "crisis",
        "thing",
        "came",
        "head",
        "year",
        "later",
        "fortyone",
        "read",
        "swedish",
        "mystic",
        "emmanuel",
        "swedenborg",
        "heavenly",
        "secret",
        "vol",
        "swedenborg",
        "relates",
        "vision",
        "angel",
        "describing",
        "spiritual",
        "world",
        "detail",
        "kant",
        "intrigued",
        "hearsay",
        "clairvoyant",
        "exploit",
        "read",
        "work",
        "recognized",
        "fraud",
        "kant",
        "wrote",
        "scathing",
        "satire",
        "dream",
        "spiritseer",
        "denounces",
        "swedenborg",
        "archspiritseer",
        "spiritseers",
        "whose",
        "work",
        "fantasy",
        "wild",
        "figment",
        "imagination",
        "eight",
        "tome",
        "nonsense",
        "result",
        "hypochondrial",
        "wind",
        "result",
        "effluence",
        "raging",
        "gut",
        "heavenly",
        "vision",
        "raging",
        "mind",
        "disturbed",
        "kant",
        "saw",
        "farting",
        "mystic",
        "parody",
        "laywine",
        "visionary",
        "world",
        "angel",
        "reductio",
        "dynamic",
        "cosmologythe",
        "absurd",
        "final",
        "consequence",
        "kant",
        "contention",
        "always",
        "assumed",
        "reality",
        "radically",
        "coherent",
        "science",
        "metaphysics",
        "join",
        "hand",
        "investigation",
        "cosmos",
        "involves",
        "intelligible",
        "well",
        "empirical",
        "side",
        "human",
        "unqualified",
        "part",
        "nature",
        "mind",
        "body",
        "energetic",
        "interacting",
        "presence",
        "rationality",
        "depends",
        "matter",
        "freedom",
        "nature",
        "question",
        "resisting",
        "force",
        "forth",
        "force",
        "product",
        "nature",
        "kant",
        "idea",
        "amounted",
        "dynamic",
        "parallelism",
        "corporeal",
        "mentaljust",
        "like",
        "swedenborg",
        "philosophy",
        "heaven",
        "dream",
        "spiritseer",
        "thus",
        "also",
        "selfcritique",
        "wrote",
        "mendelssohn",
        "preempt",
        "mockery",
        "others",
        "found",
        "wisest",
        "mock",
        "honest",
        "something",
        "mind",
        "really",
        "conflict",
        "issue",
        "problem",
        "explains",
        "presence",
        "mind",
        "material",
        "world",
        "analogy",
        "spiritual",
        "material",
        "substance",
        "flight",
        "fancy",
        "unhindered",
        "data",
        "admission",
        "letter",
        "april",
        "fortysecond",
        "birthday",
        "entire",
        "precritical",
        "project",
        "kant",
        "worked",
        "since",
        "twenty",
        "come",
        "crashing",
        "halt",
        "kant",
        "first",
        "response",
        "devastating",
        "outcome",
        "overreact",
        "position",
        "professor",
        "königsberg",
        "university",
        "available",
        "write",
        "yet",
        "another",
        "thesis",
        "application",
        "portfolio",
        "form",
        "principle",
        "sensible",
        "intelligible",
        "world",
        "socalled",
        "inaugural",
        "dissertation",
        "since",
        "problem",
        "handed",
        "mystic",
        "dynamic",
        "unity",
        "jointly",
        "sensible",
        "intelligible",
        "reality",
        "solution",
        "must",
        "according",
        "kant",
        "divorce",
        "inaugural",
        "dissertation",
        "slashed",
        "gordian",
        "knot",
        "cutting",
        "nature",
        "two",
        "half",
        "mundus",
        "intelligibilis",
        "metaphysics",
        "mundus",
        "sensibilis",
        "science",
        "second",
        "response",
        "considered",
        "courageous",
        "confronted",
        "longheld",
        "conviction",
        "examined",
        "possible",
        "flaw",
        "meant",
        "determine",
        "claim",
        "previously",
        "advanced",
        "hold",
        "soulsearching",
        "amounted",
        "secondorder",
        "investigationnot",
        "examination",
        "conceptual",
        "contention",
        "examination",
        "knowability",
        "turned",
        "intense",
        "task",
        "consumed",
        "decade",
        "life",
        "resulted",
        "greatest",
        "work",
        "critique",
        "pure",
        "reason",
        "among",
        "finding",
        "historically",
        "changed",
        "face",
        "philosophy",
        "traditional",
        "metaphysics",
        "aviiix",
        "axixxx",
        "bxivxv",
        "proof",
        "god",
        "existence",
        "done",
        "ab",
        "discovery",
        "later",
        "made",
        "neuroscience",
        "confirm",
        "kant",
        "insight",
        "affirm",
        "perception",
        "result",
        "interaction",
        "whereby",
        "pathway",
        "organize",
        "affecting",
        "data",
        "b",
        "ab",
        "ab",
        "b",
        "b",
        "subject",
        "organized",
        "experiencethe",
        "synthetic",
        "unity",
        "apperceptionposes",
        "hard",
        "problem",
        "consciousness",
        "b",
        "time",
        "kant",
        "qualified",
        "previous",
        "split",
        "sensible",
        "intelligible",
        "good",
        "early",
        "insight",
        "illustrate",
        "dynamic",
        "ontology",
        "albeit",
        "premature",
        "always",
        "right",
        "track",
        "thus",
        "interactivity",
        "entered",
        "critique",
        "cognitive",
        "device",
        "ordering",
        "data",
        "disjunctive",
        "relation",
        "community",
        "ab",
        "ab",
        "perceiving",
        "spatial",
        "object",
        "principle",
        "coexistence",
        "abab",
        "energy",
        "field",
        "force",
        "stretched",
        "space",
        "return",
        "well",
        "exception",
        "kant",
        "critical",
        "rule",
        "talk",
        "intelligible",
        "feature",
        "mindindependent",
        "nature",
        "rule",
        "broken",
        "realized",
        "energyfield",
        "sustains",
        "interactive",
        "experience",
        "spatial",
        "thing",
        "abab",
        "later",
        "would",
        "even",
        "qualification",
        "split",
        "kant",
        "return",
        "original",
        "theme",
        "opus",
        "postumum",
        "would",
        "turn",
        "former",
        "divorce",
        "intelligible",
        "sensible",
        "merely",
        "episodic",
        "division",
        "overcome",
        "found",
        "way",
        "continued",
        "quest",
        "big",
        "question",
        "tempered",
        "critical",
        "caution"
    ]
}