{
    "main_text": "Physics: The Critical Period (Metaphysical Foundations of Natural Science) || Preface\n2.1 Preface\n\nIn the Preface to the Metaphysical Foundations Kant (i)\nanalyzes the concepts of nature and science so as to establish what\nconditions must be met for a body of knowledge to constitute natural\nscience in the proper sense, (ii) explains why science so understood\nrequires “a pure part” (4:469) and what criteria would\nhave to be satisfied for such a pure part to exist, (iii) argues that\nchemistry and psychology cannot at present meet these criteria, and\n(iv) describes what procedure should be followed to satisfy these\ncriteria and thus to provide the “pure part” that science\nproper requires.\n\nThe feature of Kant’s conception of natural science proper that\nis most immediately striking is how restrictive it is. It requires\nthat cognition (i) be systematically ordered (ii) according to\nrational principles and (iii) be known a priori with apodictic\ncertainty, i.e., with “consciousness of their necessity”\n(4:468). Because properly scientific cognition must satisfy these\nstrict conditions, it requires “a pure part on which the\napodictic certainty that reason seeks can be based” (4:469). But\nsince Kant identifies pure rational cognition that is generated from\nconcepts with metaphysics, it follows that science proper requires a\nmetaphysics of nature. He then specifies that such a metaphysics of\nnature could consist in either a “transcendental part,”\nwhich discusses the laws that make possible the concept of a nature in\ngeneral — “even without relation to any determinate object\nof experience” (4:469) — or a “special\nmetaphysical” part, which concerns a “particular nature of\nthis or that kind of things” for which an empirical concept is\ngiven.\n\nKant’s very conception of natural science proper thus\nimmediately gives rise to several systematically important questions.\nFirst, if the “transcendental part” of the metaphysics of\nnature can be identified with the results of the Critique of Pure\nReason, then the Metaphysical Foundations is a work in\nspecial metaphysics. But what exactly is a special metaphysics? In\nparticular, what particular natures or kinds of things could be its\nobject? And how precisely can an empirical concept of such things be\ngiven without compromising the necessity required of the pure part of\nnatural science? Second, how is the special metaphysics provided by\nthe Metaphysical Foundations supposed to be related to the\ntranscendental part of the metaphysics of nature that was established\nin the Critique of Pure Reason? Does the former presuppose\nthe principles of the latter or are they logically independent, but\nstill related to each other in some other way? Another question\nconcerns the method of special metaphysics. Is that method the\nconceptual analysis (of the notion of matter), the transcendental\ninvestigation of the presuppositions of the mathematical science of\nnature, or something else entirely?\n\nFirst, Kant suggests that in special metaphysics the principles of the\ntranscendental part “are applied to the two species of objects\nof our senses” (4:470). Thus, the particular kinds of things\nthat could be investigated in a special metaphysics are (i) the\nobjects of outer sense, i.e., matter, and (ii) the objects of inner\nsense, i.e., thinking beings, which would thus result in a doctrine of\nbody and a doctrine of soul. Kant then argues that because “the\npossibility of determinate natural things cannot be cognized from\ntheir mere concepts … it is still required that the\nintuition corresponding to the concept be given a\npriori, that is, that the concept be constructed” (4:470),\nwhich is a task that requires mathematics. This is Kant’s\njustification for his famous claim that “in any special doctrine\nof nature there can be only as much proper science as there\nis mathematics therein” (4:470). This argument suggests\nthat the necessity required of the pure part of natural science\nderives from the necessity of the rules by which the mathematical\nconstruction of determinate things must proceed.\n\nKant then uses the claim that science proper requires the construction\nof the concept of the object in a priori intuition to exclude the\npossibility that chemistry and psychology, at least as they were\npracticed at that time, could count as science proper. In the case of\nchemistry, the problem is that “no law of the approach or\nwithdrawal of the parts of matter can be specified according to which\n… their motions and all the consequences thereof can be made\nintuitive and presented a priori in space (a demand that will\nonly with great difficulty ever be fulfilled)” (4:471). Since\nits principles are “merely empirical,” it can, at best, be\na “systematic art” (ibid.). The case of psychology is more\ncomplex, since Kant provides (at least) two separate reasons in the\nPreface for denying it the status of natural science proper. First,\nKant claims that mathematics is inapplicable to the phenomena of inner\nsense and their laws, though he grants that the law of continuity\n(discussed, e.g., at A207–209/B253–255 and\nA228–229/B281 in the Critique of Pure Reason) ought to\napply to changes in our representations as well. He downplays the\nsignificance of this application of the law of continuity, however, by\nnoting that time has only one dimension, which does not provide enough\nmaterial to extend our cognition significantly. Second, Kant also\ncomplains that empirical psychology cannot separate and recombine the\nphenomena of inner sense at will; rather, our inner observations can\nbe separated “only by mere division in thought” (4:471).\nKant’s fuller views on chemistry and psychology will be\ndiscussed further below.\n\nSecond, in explaining how mathematics can be applied to bodies Kant\nasserts that “principles for the construction of the\nconcepts that belong to the possibility of matter in general must\nfirst be introduced. Therefore a complete analysis of the concept of a\nmatter in general [must be provided in which it] makes use of no\nparticular experiences, but only that which it finds in the isolated\n(although intrinsically empirical) concept itself, in relation to the\npure intuitions in space and time, and in accordance with laws that\nalready essentially attach to the concept of nature in general”\n(4:472). Kant then explains that this means that the concept of matter\nmust be determined according to the Critique of Pure\nReason’s categories of quantity, quality, relation, and\nmodality (4:474–476). Further, Kant holds that “a new\ndetermination” (4:476) must be added to the concept of matter in\neach chapter of the Metaphysical Foundations. This suggests\nnot only that the principles argued for in the Metaphysical\nFoundations are to be developed “in accordance with”\nthe principles defended in the Critique of Pure Reason, but\nalso that both the concept of matter and the Metaphysical\nFoundations itself is structured according to the Critique of\nPure Reason’s table of categories.\n\nUnfortunately, these points of clarification do not resolve all of the\nissues that are immediately raised by Kant’s pronouncements\nabout what is required for natural science proper. One further issue\nthat is relevant here concerns the concept of matter that is at the\nheart of the Metaphysical Foundations. Kant introduces it in\nthe Critique of Pure Reason (A847–848/B875–876)\nas the concept of something that is impenetrable, extended, and inert.\nYet, in the beginning of the Preface of the Metaphysical\nFoundations, he describes it as whatever is an object of outer\nsense, and later he argues that the “basic determination of\nsomething that is to be an object of the outer senses had to be\nmotion, because only thereby can these senses be affected”\n(4:476). Whatever weight one accords Kant’s justification of the\nconnection between matter, outer sense, and motion, one faces a\ndilemma. If the concept of matter, most fundamentally, is simply the\nconcept of any object of outer sense, then how is it still empirical\nin any genuine sense (and what has become of the structural difference\nKant draws between the Critique of Pure Reason and the\nMetaphysical Foundations)? If, by contrast, impenetrability,\nextension, and movability are deemed the basic traits of the concept\nof matter, then how can one know a priori that any object we might\nencounter in outer sense must behave in accordance with the laws that\nwould govern matter so defined?\n\nMoreover, even if one can find an appropriately nuanced sense in which\nthe concept of matter is empirical while still allowing for an\nappropriate kind of necessity, questions can still be posed about the\n“new determinations” that are to be added to that concept\nin each chapter of the Metaphysical Foundations. For example,\nwhat is the justification for each specific determination that is\nadded when one thinks of matter as having a quantity, a quality, etc.?\nAlso, what is the relationship between each new determination of\nmatter and the various claims that Kant makes in each chapter of the\nMetaphysical Foundations? In particular, when Kant explicitly\ninvokes principles for constructing concepts belonging to the\npossibility of matter, is his idea that these principles are required\ninsofar as they make experience of the relevant “new\ndetermination” of matter possible (so that Kant would be\ndeveloping a transcendental argument in the Metaphysical\nFoundations similar in many respects to the Critique of Pure\nReason)? Answers to these questions depend on how one interprets\nthe arguments Kant develops throughout the Metaphysical\nFoundations.\n\nThe conception of science that Kant presents in the Preface has been\nthe focus of considerable attention over the past several decades. In\nthe German literature, the issues raised above have been discussed at\nlength by Plaass (1965), Cramer (1985), and others. Pollok (2001) has\nrecently produced a detailed and comprehensive textual commentary on\nthe Metaphysical Foundations. Important work has also been\ndone in the English literature by Walker (1974), Brittan (1978),\nBuchdahl (1968, 1969, and 1986), Parsons (1984), Butts (1986), and\nWatkins (1998a). Friedman (1992, 2001, 2002 and 2013) has been\nespecially influential on these issues as well. Several chapters (by\nSturm, Breitenbach, and Friedman, respectively) in McNulty 2022 add to\nour understanding of this aspect in Kant’s thought.\n",
    "section_title": "2.1 Preface",
    "entry_title": "Kant’s Philosophy of Science",
    "hierarchy_title": "Kant’s Philosophy of Science || Physics: The Critical Period (Metaphysical Foundations of Natural Science) || Preface",
    "tokenized_text": [
        "physic",
        "critical",
        "period",
        "metaphysical",
        "foundation",
        "natural",
        "science",
        "preface",
        "preface",
        "preface",
        "metaphysical",
        "foundation",
        "kant",
        "analyzes",
        "concept",
        "nature",
        "science",
        "establish",
        "condition",
        "must",
        "met",
        "body",
        "knowledge",
        "constitute",
        "natural",
        "science",
        "proper",
        "sense",
        "ii",
        "explains",
        "science",
        "understood",
        "requires",
        "pure",
        "part",
        "criterion",
        "would",
        "satisfied",
        "pure",
        "part",
        "exist",
        "iii",
        "argues",
        "chemistry",
        "psychology",
        "present",
        "meet",
        "criterion",
        "iv",
        "describes",
        "procedure",
        "followed",
        "satisfy",
        "criterion",
        "thus",
        "provide",
        "pure",
        "part",
        "science",
        "proper",
        "requires",
        "feature",
        "kant",
        "conception",
        "natural",
        "science",
        "proper",
        "immediately",
        "striking",
        "restrictive",
        "requires",
        "cognition",
        "systematically",
        "ordered",
        "ii",
        "according",
        "rational",
        "principle",
        "iii",
        "known",
        "priori",
        "apodictic",
        "certainty",
        "ie",
        "consciousness",
        "necessity",
        "properly",
        "scientific",
        "cognition",
        "must",
        "satisfy",
        "strict",
        "condition",
        "requires",
        "pure",
        "part",
        "apodictic",
        "certainty",
        "reason",
        "seek",
        "based",
        "since",
        "kant",
        "identifies",
        "pure",
        "rational",
        "cognition",
        "generated",
        "concept",
        "metaphysics",
        "follows",
        "science",
        "proper",
        "requires",
        "metaphysics",
        "nature",
        "specifies",
        "metaphysics",
        "nature",
        "could",
        "consist",
        "either",
        "transcendental",
        "part",
        "discus",
        "law",
        "make",
        "possible",
        "concept",
        "nature",
        "general",
        "even",
        "without",
        "relation",
        "determinate",
        "object",
        "experience",
        "special",
        "metaphysical",
        "part",
        "concern",
        "particular",
        "nature",
        "kind",
        "thing",
        "empirical",
        "concept",
        "given",
        "kant",
        "conception",
        "natural",
        "science",
        "proper",
        "thus",
        "immediately",
        "give",
        "rise",
        "several",
        "systematically",
        "important",
        "question",
        "first",
        "transcendental",
        "part",
        "metaphysics",
        "nature",
        "identified",
        "result",
        "critique",
        "pure",
        "reason",
        "metaphysical",
        "foundation",
        "work",
        "special",
        "metaphysics",
        "exactly",
        "special",
        "metaphysics",
        "particular",
        "particular",
        "nature",
        "kind",
        "thing",
        "could",
        "object",
        "precisely",
        "empirical",
        "concept",
        "thing",
        "given",
        "without",
        "compromising",
        "necessity",
        "required",
        "pure",
        "part",
        "natural",
        "science",
        "second",
        "special",
        "metaphysics",
        "provided",
        "metaphysical",
        "foundation",
        "supposed",
        "related",
        "transcendental",
        "part",
        "metaphysics",
        "nature",
        "established",
        "critique",
        "pure",
        "reason",
        "former",
        "presuppose",
        "principle",
        "latter",
        "logically",
        "independent",
        "still",
        "related",
        "way",
        "another",
        "question",
        "concern",
        "method",
        "special",
        "metaphysics",
        "method",
        "conceptual",
        "analysis",
        "notion",
        "matter",
        "transcendental",
        "investigation",
        "presupposition",
        "mathematical",
        "science",
        "nature",
        "something",
        "else",
        "entirely",
        "first",
        "kant",
        "suggests",
        "special",
        "metaphysics",
        "principle",
        "transcendental",
        "part",
        "applied",
        "two",
        "specie",
        "object",
        "sens",
        "thus",
        "particular",
        "kind",
        "thing",
        "could",
        "investigated",
        "special",
        "metaphysics",
        "object",
        "outer",
        "sense",
        "ie",
        "matter",
        "ii",
        "object",
        "inner",
        "sense",
        "ie",
        "thinking",
        "being",
        "would",
        "thus",
        "result",
        "doctrine",
        "body",
        "doctrine",
        "soul",
        "kant",
        "argues",
        "possibility",
        "determinate",
        "natural",
        "thing",
        "cognized",
        "mere",
        "concept",
        "still",
        "required",
        "intuition",
        "corresponding",
        "concept",
        "given",
        "priori",
        "concept",
        "constructed",
        "task",
        "requires",
        "mathematics",
        "kant",
        "justification",
        "famous",
        "claim",
        "special",
        "doctrine",
        "nature",
        "much",
        "proper",
        "science",
        "mathematics",
        "therein",
        "argument",
        "suggests",
        "necessity",
        "required",
        "pure",
        "part",
        "natural",
        "science",
        "derives",
        "necessity",
        "rule",
        "mathematical",
        "construction",
        "determinate",
        "thing",
        "must",
        "proceed",
        "kant",
        "us",
        "claim",
        "science",
        "proper",
        "requires",
        "construction",
        "concept",
        "object",
        "priori",
        "intuition",
        "exclude",
        "possibility",
        "chemistry",
        "psychology",
        "least",
        "practiced",
        "time",
        "could",
        "count",
        "science",
        "proper",
        "case",
        "chemistry",
        "problem",
        "law",
        "approach",
        "withdrawal",
        "part",
        "matter",
        "specified",
        "according",
        "motion",
        "consequence",
        "thereof",
        "made",
        "intuitive",
        "presented",
        "priori",
        "space",
        "demand",
        "great",
        "difficulty",
        "ever",
        "fulfilled",
        "since",
        "principle",
        "merely",
        "empirical",
        "best",
        "systematic",
        "art",
        "ibid",
        "case",
        "psychology",
        "complex",
        "since",
        "kant",
        "provides",
        "least",
        "two",
        "separate",
        "reason",
        "preface",
        "denying",
        "status",
        "natural",
        "science",
        "proper",
        "first",
        "kant",
        "claim",
        "mathematics",
        "inapplicable",
        "phenomenon",
        "inner",
        "sense",
        "law",
        "though",
        "grant",
        "law",
        "continuity",
        "discussed",
        "eg",
        "ab",
        "ab",
        "critique",
        "pure",
        "reason",
        "ought",
        "apply",
        "change",
        "representation",
        "well",
        "downplays",
        "significance",
        "application",
        "law",
        "continuity",
        "however",
        "noting",
        "time",
        "one",
        "dimension",
        "provide",
        "enough",
        "material",
        "extend",
        "cognition",
        "significantly",
        "second",
        "kant",
        "also",
        "complains",
        "empirical",
        "psychology",
        "separate",
        "recombine",
        "phenomenon",
        "inner",
        "sense",
        "rather",
        "inner",
        "observation",
        "separated",
        "mere",
        "division",
        "thought",
        "kant",
        "fuller",
        "view",
        "chemistry",
        "psychology",
        "discussed",
        "second",
        "explaining",
        "mathematics",
        "applied",
        "body",
        "kant",
        "asserts",
        "principle",
        "construction",
        "concept",
        "belong",
        "possibility",
        "matter",
        "general",
        "must",
        "first",
        "introduced",
        "therefore",
        "complete",
        "analysis",
        "concept",
        "matter",
        "general",
        "must",
        "provided",
        "make",
        "use",
        "particular",
        "experience",
        "find",
        "isolated",
        "although",
        "intrinsically",
        "empirical",
        "concept",
        "relation",
        "pure",
        "intuition",
        "space",
        "time",
        "accordance",
        "law",
        "already",
        "essentially",
        "attach",
        "concept",
        "nature",
        "general",
        "kant",
        "explains",
        "mean",
        "concept",
        "matter",
        "must",
        "determined",
        "according",
        "critique",
        "pure",
        "reason",
        "category",
        "quantity",
        "quality",
        "relation",
        "modality",
        "kant",
        "hold",
        "new",
        "determination",
        "must",
        "added",
        "concept",
        "matter",
        "chapter",
        "metaphysical",
        "foundation",
        "suggests",
        "principle",
        "argued",
        "metaphysical",
        "foundation",
        "developed",
        "accordance",
        "principle",
        "defended",
        "critique",
        "pure",
        "reason",
        "also",
        "concept",
        "matter",
        "metaphysical",
        "foundation",
        "structured",
        "according",
        "critique",
        "pure",
        "reason",
        "table",
        "category",
        "unfortunately",
        "point",
        "clarification",
        "resolve",
        "issue",
        "immediately",
        "raised",
        "kant",
        "pronouncement",
        "required",
        "natural",
        "science",
        "proper",
        "one",
        "issue",
        "relevant",
        "concern",
        "concept",
        "matter",
        "heart",
        "metaphysical",
        "foundation",
        "kant",
        "introduces",
        "critique",
        "pure",
        "reason",
        "ab",
        "concept",
        "something",
        "impenetrable",
        "extended",
        "inert",
        "yet",
        "beginning",
        "preface",
        "metaphysical",
        "foundation",
        "describes",
        "whatever",
        "object",
        "outer",
        "sense",
        "later",
        "argues",
        "basic",
        "determination",
        "something",
        "object",
        "outer",
        "sens",
        "motion",
        "thereby",
        "sens",
        "affected",
        "whatever",
        "weight",
        "one",
        "accord",
        "kant",
        "justification",
        "connection",
        "matter",
        "outer",
        "sense",
        "motion",
        "one",
        "face",
        "dilemma",
        "concept",
        "matter",
        "fundamentally",
        "simply",
        "concept",
        "object",
        "outer",
        "sense",
        "still",
        "empirical",
        "genuine",
        "sense",
        "become",
        "structural",
        "difference",
        "kant",
        "draw",
        "critique",
        "pure",
        "reason",
        "metaphysical",
        "foundation",
        "contrast",
        "impenetrability",
        "extension",
        "movability",
        "deemed",
        "basic",
        "trait",
        "concept",
        "matter",
        "one",
        "know",
        "priori",
        "object",
        "might",
        "encounter",
        "outer",
        "sense",
        "must",
        "behave",
        "accordance",
        "law",
        "would",
        "govern",
        "matter",
        "defined",
        "moreover",
        "even",
        "one",
        "find",
        "appropriately",
        "nuanced",
        "sense",
        "concept",
        "matter",
        "empirical",
        "still",
        "allowing",
        "appropriate",
        "kind",
        "necessity",
        "question",
        "still",
        "posed",
        "new",
        "determination",
        "added",
        "concept",
        "chapter",
        "metaphysical",
        "foundation",
        "example",
        "justification",
        "specific",
        "determination",
        "added",
        "one",
        "think",
        "matter",
        "quantity",
        "quality",
        "etc",
        "also",
        "relationship",
        "new",
        "determination",
        "matter",
        "various",
        "claim",
        "kant",
        "make",
        "chapter",
        "metaphysical",
        "foundation",
        "particular",
        "kant",
        "explicitly",
        "invokes",
        "principle",
        "constructing",
        "concept",
        "belonging",
        "possibility",
        "matter",
        "idea",
        "principle",
        "required",
        "insofar",
        "make",
        "experience",
        "relevant",
        "new",
        "determination",
        "matter",
        "possible",
        "kant",
        "would",
        "developing",
        "transcendental",
        "argument",
        "metaphysical",
        "foundation",
        "similar",
        "many",
        "respect",
        "critique",
        "pure",
        "reason",
        "answer",
        "question",
        "depend",
        "one",
        "interprets",
        "argument",
        "kant",
        "develops",
        "throughout",
        "metaphysical",
        "foundation",
        "conception",
        "science",
        "kant",
        "present",
        "preface",
        "focus",
        "considerable",
        "attention",
        "past",
        "several",
        "decade",
        "german",
        "literature",
        "issue",
        "raised",
        "discussed",
        "length",
        "plaass",
        "cramer",
        "others",
        "pollok",
        "recently",
        "produced",
        "detailed",
        "comprehensive",
        "textual",
        "commentary",
        "metaphysical",
        "foundation",
        "important",
        "work",
        "also",
        "done",
        "english",
        "literature",
        "walker",
        "brittan",
        "buchdahl",
        "parson",
        "butt",
        "watkins",
        "a",
        "friedman",
        "especially",
        "influential",
        "issue",
        "well",
        "several",
        "chapter",
        "sturm",
        "breitenbach",
        "friedman",
        "respectively",
        "mcnulty",
        "add",
        "understanding",
        "aspect",
        "kant",
        "thought"
    ]
}