{
    "main_text": "The Feder-Garve Review and Kant’s Replies || Changes in the B Edition\n2.4 Changes in the B Edition\n\nKant extensively revised certain sections of the Critique for\nthe second edition (B), published in 1787. It is widely accepted that\na main consideration in these revisions was to avoid the\nmisunderstanding of his view that had led to the Feder-Garve review.\nHowever, some scholars think that, on this point, there is a\ndifference in doctrine between the A and B editions: made aware of the\nproblematic Berkeleyan consequences of the first edition, Kant\nendeavored to develop a more realistic view in the B\n Edition.[14]\n Other scholars think the difference is largely a matter of\npresentation: in the B edition, Kant highlights the more realistic\naspects of his view and downplays its phenomenalistic sides, but the\nview is basically the same (e.g., Allison 2004). The rest of this\nsection considers the main textual changes from 1781 to 1787 and\nconsiders what implications they have for the interpretation of\nKant’s idealism. Since Kant made no significant changes past the\nParalogisms chapter, sections that did not undergo substantial\nrevision will not be cited as evidence; it may be that Kant would have\nsignificantly changed those sections if he had gotten there (on the\ngeneral topic of the changes from the A to the B edition, see Erdmann\n1878).\n\nKant did, however, make one relatively minor alteration in the later\nsections (in the “Antinomies”, to be specific) that is\nrelevant to our discussion. In the wake of the Feder-Garve review,\nKant evidently felt that “transcendental” idealism may\nhave been a poor choice of\n name.[15]\n In the B Edition Kant adds a footnote to his definition of\ntranscendental idealism at A491/519 (quoted earlier) to remark that\nperhaps he should have called his position “critical\n idealism”.[16]\n The section Kant most heavily revised for the B Edition is the\n“Transcendental Deduction”, but there is not space here to\ndiscuss the complex argument of that section, or the differences\nbetween the A “Deduction” and the B\n“Deduction”.\n2.4.1 Objects as representations\n\nAs mentioned earlier, one of the main sources, both in the eighteenth\ncentury and today, for the phenomenalist reading of Kant is\nKant’s tendency to identify empirical objects with\nrepresentations. But Kant continues to do this in the B Edition, not\nonly in sections that were heavily revised for the B\n Edition[17]\n but even in passages that were added to the B Edition (e.g.,\nB164).\n2.4.2 Preface\n\nThe B Preface contains several passages, which some scholars take to\nbe inconsistent with the phenomenalist reading. They are discussed\nbelow in\n section 4.1.\n2.4.3 Transcendental Aesthetic\n\nThe main addition to the B “Transcendental Aesthetic” is\nseveral pages (B66–69) at the end of the section, which includes\nthis discussion, a clear reference to the Feder-Garve review:\n\n\nIf I say: in space and time intuition represents both outer objects as\nwell as the self-intuition of the mind as each affects our senses,\ni.e., as it appears, that is not to say that these\nobjects would be a mere illusion. […] Thus I\ndo not say that objects merely seem to exist outside\nme or that my soul only seems to be given if I assert\nthat the quality of space […] lies in my kind of intuition and\nnot in these objects in themselves. It would be my own fault if I made\nthat which I should count as appearance [Erscheinung] into\nmere illusion [bloßen Schein]. (B70–1)\n\n\nThis reiterates a theme found in the A edition and in the\nProlegomena: transcendental idealism does not entail that\nobjects in space are illusions. Later in the paragraph Kant argues\nthat, if we assume that if space and time must be “infinite\nsubstances”, if they exist at all, then we cannot blame Berkeley\nfor concluding that space, time, and bodies are mere illusions;\nempirical idealism is the right conclusion to draw from transcendental\nrealism, according to Kant. While Kant is correct in representing\nBerkeley later in this paragraph as reacting against the Newtonian\nview of space and time as “absolute” entities, he is wrong\nto characterize Berkeley as concluding that bodies are mere illusions,\nso Kant’s dissatisfaction with Berkeley’s own view is not\nevidence that he does not have a some variety of phenomenalist view of\nobjects in space. The B “Transcendental Aesthetic” adds no\nnew evidence against the phenomenalist reading.\n2.4.4 Paralogisms\n\nOne main source of the phenomenalist reading is the A Edition\n“Fourth Paralogism”, in which Kant refutes the\n“Cartesian” view that our inner states are immediately\nknown while the existence of outer objects can only be known mediately\nby inference from our inner states. The Paralogisms section was\nentirely re-written in the B Edition, and none of the four B\nParalogisms correspond precisely to the fourth A Paralogism. The A\nEdition “Fourth Paralogoism” is the source of many of the\npassages quoted above, and, historically, an important source for the\nphenomenalist interpretation. The fact that it was, effectively,\nremoved in the B Edition has led many scholars to reject the\nphenomenalist interpretation, at least with respect to the B Edition\n(with some averring that he changed his mind from the A to the B\n Edition).[18]\n A version of the A Paralogism argument that self-consciousness\nrequires knowledge of objects in space reappears as the\n“Refutation of Idealism”, added in the B Edition.\n2.4.5 Refutation of Idealism\n\nGiven its brevity, the “Refutation of Idealism”, added to\nthe “Postulates of empirical thinking in general” in the B\nEdition, is, line for line, one of the most thoroughly commented upon\npassages in all of Kant’s\n writings.[19]\n Kant’s argument, very briefly, is that the existence of objects\nin space outside me (“empirically external” objects) is a\ncondition on the possibility of my being conscious of the determinate\ntemporal relations of my inner states. Consequently, it is impossible\nto be a self-conscious subject without there existing objects in space\noutside of me, and in being conscious of the temporal relations of my\ninner states I am immediately conscious of the existence of these\n objects.[20]\n The problem of “problematic idealism”—how can I\ninfer the existence of objects outside of me on the basis of my\nimmediate knowledge of my inner states?—is based on a false\npremise.\n\nNothing about this conclusion, or how Kant argues for it, is prima\nfacie incompatible with a qualified phenomenalist reading of\ntranscendental idealism, or even a strong phenomenalist\n one.[21]\n It may be incompatible with “identity” phenomenalism,\nsince Kant argues that self-consciousness requires the existence of\npermanent objects in space, yet there is no permanent representation\nin the mind (B278). If objects just are representations, it follows\nthat none of them are\n permanent.[22]\n At B274 Kant makes it clear that the “idealism” that he\nintends to refute is idealism as he defined it in the\nProlegomena and the “Fourth A Paralogism”: the\nclaim that objects in space do not exist (dogmatic idealism) or at\nleast that we do not know whether they exist (problematic idealism).\nThe sense of idealism that is at issue in the phenomenalist\nreading—empirical objects exist, and exist in virtue of the\ncontents of experience—is not, apparently, addressed here. On an\nextreme phenomenalist reading, all there is to the existence of\nempirical objects in space is our having appropriately unified\nexperiences of them. The phenomenalist can interpret Kant’s\nargument in the “Refutation” as an argument that\nconsciousness of the temporal relations of my inner states requires\nthat these inner states constitute appropriately unified experiences.\nConsequently, self-consciousness requires the existence of objects in\nspace (spatially) outside\n me.[23]\n,\n[24]\n2.4.6 General note to the principles\n\nIn the B Edition Kant added a “General Note” to the\n“Principles of Experience”, which some have read as ruling\nout the phenomenalist reading, especially the long passage from B291\nto 294 (excerpted here):\n\n\nThis entire remark is of great importance, not only in order to\nconfirm our preceding refutation of idealism, but, even more, when we\ncome to talk of self-cognition form mere inner\nconsciousness and the determination of our nature without the\nassistance of outer empirical intuition, to indicate to us the limits\nof the possibility of such a cognition. (B293–4)\n\n\nOnce again, this is a case of Kant emphasizing that his view is not\nidealist in the specific sense of idealism we have seen so\nfar—denying either that objects exist in space or that we\ncan know that they do. His point is that even understanding our most\nbasic a priori concepts, the categories, requires applying\nthem to outer objects in space. The remark about\n“self-cognition” at the end is a reminder that inner\nawareness is dependent upon outer experience; it does not address\nwhether empirical objects exist (partly or wholly) in virtue of the\ncontents of experience.\n2.4.7 Phenomena and noumena\n\nKant extensively revised the section entitled “On the grounds of\nthe distinction of all objects into phenomena and noumena” in\nthe B Edition. However, since that section concerns the Kantian notion\nof “noumena”, discussion of it is reserved until\n §6,\n which is devoted to that notion, its relation to the “thing in\nitself”, and the related notion of the “transcendental\nobject”.\n",
    "section_title": "2.4 Changes in the B Edition",
    "entry_title": "Kant’s Transcendental Idealism",
    "hierarchy_title": "Kant’s Transcendental Idealism || The Feder-Garve Review and Kant’s Replies || Changes in the B Edition",
    "tokenized_text": [
        "federgarve",
        "review",
        "kant",
        "reply",
        "change",
        "b",
        "edition",
        "change",
        "b",
        "edition",
        "kant",
        "extensively",
        "revised",
        "certain",
        "section",
        "critique",
        "second",
        "edition",
        "b",
        "published",
        "widely",
        "accepted",
        "main",
        "consideration",
        "revision",
        "avoid",
        "misunderstanding",
        "view",
        "led",
        "federgarve",
        "review",
        "however",
        "scholar",
        "think",
        "point",
        "difference",
        "doctrine",
        "b",
        "edition",
        "made",
        "aware",
        "problematic",
        "berkeleyan",
        "consequence",
        "first",
        "edition",
        "kant",
        "endeavored",
        "develop",
        "realistic",
        "view",
        "b",
        "edition",
        "scholar",
        "think",
        "difference",
        "largely",
        "matter",
        "presentation",
        "b",
        "edition",
        "kant",
        "highlight",
        "realistic",
        "aspect",
        "view",
        "downplays",
        "phenomenalistic",
        "side",
        "view",
        "basically",
        "eg",
        "allison",
        "rest",
        "section",
        "considers",
        "main",
        "textual",
        "change",
        "considers",
        "implication",
        "interpretation",
        "kant",
        "idealism",
        "since",
        "kant",
        "made",
        "significant",
        "change",
        "past",
        "paralogism",
        "chapter",
        "section",
        "undergo",
        "substantial",
        "revision",
        "cited",
        "evidence",
        "may",
        "kant",
        "would",
        "significantly",
        "changed",
        "section",
        "gotten",
        "general",
        "topic",
        "change",
        "b",
        "edition",
        "see",
        "erdmann",
        "kant",
        "however",
        "make",
        "one",
        "relatively",
        "minor",
        "alteration",
        "later",
        "section",
        "antinomy",
        "specific",
        "relevant",
        "discussion",
        "wake",
        "federgarve",
        "review",
        "kant",
        "evidently",
        "felt",
        "transcendental",
        "idealism",
        "may",
        "poor",
        "choice",
        "name",
        "b",
        "edition",
        "kant",
        "add",
        "footnote",
        "definition",
        "transcendental",
        "idealism",
        "a",
        "quoted",
        "earlier",
        "remark",
        "perhaps",
        "called",
        "position",
        "critical",
        "idealism",
        "section",
        "kant",
        "heavily",
        "revised",
        "b",
        "edition",
        "transcendental",
        "deduction",
        "space",
        "discus",
        "complex",
        "argument",
        "section",
        "difference",
        "deduction",
        "b",
        "deduction",
        "object",
        "representation",
        "mentioned",
        "earlier",
        "one",
        "main",
        "source",
        "eighteenth",
        "century",
        "today",
        "phenomenalist",
        "reading",
        "kant",
        "kant",
        "tendency",
        "identify",
        "empirical",
        "object",
        "representation",
        "kant",
        "continues",
        "b",
        "edition",
        "section",
        "heavily",
        "revised",
        "b",
        "edition",
        "even",
        "passage",
        "added",
        "b",
        "edition",
        "eg",
        "b",
        "preface",
        "b",
        "preface",
        "contains",
        "several",
        "passage",
        "scholar",
        "take",
        "inconsistent",
        "phenomenalist",
        "reading",
        "discussed",
        "section",
        "transcendental",
        "aesthetic",
        "main",
        "addition",
        "b",
        "transcendental",
        "aesthetic",
        "several",
        "page",
        "b",
        "end",
        "section",
        "includes",
        "discussion",
        "clear",
        "reference",
        "federgarve",
        "review",
        "say",
        "space",
        "time",
        "intuition",
        "represents",
        "outer",
        "object",
        "well",
        "selfintuition",
        "mind",
        "affect",
        "sens",
        "ie",
        "appears",
        "say",
        "object",
        "would",
        "mere",
        "illusion",
        "thus",
        "say",
        "object",
        "merely",
        "seem",
        "exist",
        "outside",
        "soul",
        "seems",
        "given",
        "assert",
        "quality",
        "space",
        "lie",
        "kind",
        "intuition",
        "object",
        "would",
        "fault",
        "made",
        "count",
        "appearance",
        "erscheinung",
        "mere",
        "illusion",
        "bloßen",
        "schein",
        "b",
        "reiterates",
        "theme",
        "found",
        "edition",
        "prolegomenon",
        "transcendental",
        "idealism",
        "entail",
        "object",
        "space",
        "illusion",
        "later",
        "paragraph",
        "kant",
        "argues",
        "assume",
        "space",
        "time",
        "must",
        "infinite",
        "substance",
        "exist",
        "blame",
        "berkeley",
        "concluding",
        "space",
        "time",
        "body",
        "mere",
        "illusion",
        "empirical",
        "idealism",
        "right",
        "conclusion",
        "draw",
        "transcendental",
        "realism",
        "according",
        "kant",
        "kant",
        "correct",
        "representing",
        "berkeley",
        "later",
        "paragraph",
        "reacting",
        "newtonian",
        "view",
        "space",
        "time",
        "absolute",
        "entity",
        "wrong",
        "characterize",
        "berkeley",
        "concluding",
        "body",
        "mere",
        "illusion",
        "kant",
        "dissatisfaction",
        "berkeley",
        "view",
        "evidence",
        "variety",
        "phenomenalist",
        "view",
        "object",
        "space",
        "b",
        "transcendental",
        "aesthetic",
        "add",
        "new",
        "evidence",
        "phenomenalist",
        "reading",
        "paralogism",
        "one",
        "main",
        "source",
        "phenomenalist",
        "reading",
        "edition",
        "fourth",
        "paralogism",
        "kant",
        "refutes",
        "cartesian",
        "view",
        "inner",
        "state",
        "immediately",
        "known",
        "existence",
        "outer",
        "object",
        "known",
        "mediately",
        "inference",
        "inner",
        "state",
        "paralogism",
        "section",
        "entirely",
        "rewritten",
        "b",
        "edition",
        "none",
        "four",
        "b",
        "paralogism",
        "correspond",
        "precisely",
        "fourth",
        "paralogism",
        "edition",
        "fourth",
        "paralogoism",
        "source",
        "many",
        "passage",
        "quoted",
        "historically",
        "important",
        "source",
        "phenomenalist",
        "interpretation",
        "fact",
        "effectively",
        "removed",
        "b",
        "edition",
        "led",
        "many",
        "scholar",
        "reject",
        "phenomenalist",
        "interpretation",
        "least",
        "respect",
        "b",
        "edition",
        "averring",
        "changed",
        "mind",
        "b",
        "edition",
        "version",
        "paralogism",
        "argument",
        "selfconsciousness",
        "requires",
        "knowledge",
        "object",
        "space",
        "reappears",
        "refutation",
        "idealism",
        "added",
        "b",
        "edition",
        "refutation",
        "idealism",
        "given",
        "brevity",
        "refutation",
        "idealism",
        "added",
        "postulate",
        "empirical",
        "thinking",
        "general",
        "b",
        "edition",
        "line",
        "line",
        "one",
        "thoroughly",
        "commented",
        "upon",
        "passage",
        "kant",
        "writing",
        "kant",
        "argument",
        "briefly",
        "existence",
        "object",
        "space",
        "outside",
        "empirically",
        "external",
        "object",
        "condition",
        "possibility",
        "conscious",
        "determinate",
        "temporal",
        "relation",
        "inner",
        "state",
        "consequently",
        "impossible",
        "selfconscious",
        "subject",
        "without",
        "existing",
        "object",
        "space",
        "outside",
        "conscious",
        "temporal",
        "relation",
        "inner",
        "state",
        "immediately",
        "conscious",
        "existence",
        "object",
        "problem",
        "problematic",
        "idealism",
        "how",
        "infer",
        "existence",
        "object",
        "outside",
        "basis",
        "immediate",
        "knowledge",
        "inner",
        "state",
        "is",
        "based",
        "false",
        "premise",
        "nothing",
        "conclusion",
        "kant",
        "argues",
        "prima",
        "facie",
        "incompatible",
        "qualified",
        "phenomenalist",
        "reading",
        "transcendental",
        "idealism",
        "even",
        "strong",
        "phenomenalist",
        "one",
        "may",
        "incompatible",
        "identity",
        "phenomenalism",
        "since",
        "kant",
        "argues",
        "selfconsciousness",
        "requires",
        "existence",
        "permanent",
        "object",
        "space",
        "yet",
        "permanent",
        "representation",
        "mind",
        "b",
        "object",
        "representation",
        "follows",
        "none",
        "permanent",
        "b",
        "kant",
        "make",
        "clear",
        "idealism",
        "intends",
        "refute",
        "idealism",
        "defined",
        "prolegomenon",
        "fourth",
        "paralogism",
        "claim",
        "object",
        "space",
        "exist",
        "dogmatic",
        "idealism",
        "least",
        "know",
        "whether",
        "exist",
        "problematic",
        "idealism",
        "sense",
        "idealism",
        "issue",
        "phenomenalist",
        "readingempirical",
        "object",
        "exist",
        "exist",
        "virtue",
        "content",
        "experienceis",
        "apparently",
        "addressed",
        "extreme",
        "phenomenalist",
        "reading",
        "existence",
        "empirical",
        "object",
        "space",
        "appropriately",
        "unified",
        "experience",
        "phenomenalist",
        "interpret",
        "kant",
        "argument",
        "refutation",
        "argument",
        "consciousness",
        "temporal",
        "relation",
        "inner",
        "state",
        "requires",
        "inner",
        "state",
        "constitute",
        "appropriately",
        "unified",
        "experience",
        "consequently",
        "selfconsciousness",
        "requires",
        "existence",
        "object",
        "space",
        "spatially",
        "outside",
        "general",
        "note",
        "principle",
        "b",
        "edition",
        "kant",
        "added",
        "general",
        "note",
        "principle",
        "experience",
        "read",
        "ruling",
        "phenomenalist",
        "reading",
        "especially",
        "long",
        "passage",
        "b",
        "excerpted",
        "entire",
        "remark",
        "great",
        "importance",
        "order",
        "confirm",
        "preceding",
        "refutation",
        "idealism",
        "even",
        "come",
        "talk",
        "selfcognition",
        "form",
        "mere",
        "inner",
        "consciousness",
        "determination",
        "nature",
        "without",
        "assistance",
        "outer",
        "empirical",
        "intuition",
        "indicate",
        "u",
        "limit",
        "possibility",
        "cognition",
        "b",
        "case",
        "kant",
        "emphasizing",
        "view",
        "idealist",
        "specific",
        "sense",
        "idealism",
        "seen",
        "fardenying",
        "either",
        "object",
        "exist",
        "space",
        "know",
        "point",
        "even",
        "understanding",
        "basic",
        "priori",
        "concept",
        "category",
        "requires",
        "applying",
        "outer",
        "object",
        "space",
        "remark",
        "selfcognition",
        "end",
        "reminder",
        "inner",
        "awareness",
        "dependent",
        "upon",
        "outer",
        "experience",
        "address",
        "whether",
        "empirical",
        "object",
        "exist",
        "partly",
        "wholly",
        "virtue",
        "content",
        "experience",
        "phenomenon",
        "noumenon",
        "kant",
        "extensively",
        "revised",
        "section",
        "entitled",
        "ground",
        "distinction",
        "object",
        "phenomenon",
        "noumenon",
        "b",
        "edition",
        "however",
        "since",
        "section",
        "concern",
        "kantian",
        "notion",
        "noumenon",
        "discussion",
        "reserved",
        "devoted",
        "notion",
        "relation",
        "thing",
        "related",
        "notion",
        "transcendental",
        "object"
    ]
}