{
    "main_text": "The unity of theoretical and practical reason || The public use of reason\n4. Concluding remarks\n\nNo one doubts that belief and action are subject to demands of\nrationality. Theoretical reasoning aims at knowledge of the world\naround us (perhaps also knowledge of ourselves). Practical reasoning\naims to make a difference in the world (perhaps also a difference in\nourselves).\n\nThis distinction hides a larger question: what is reason,\n exactly?[35]\n Rationality clearly involves the capacity to make logical and causal\ninferences: to draw out the consequences of our beliefs; to judge what\nconsequences are likely to follow from different possibilities for\naction. Rationality clearly requires consistency. Our beliefs should\nnot contradict one another, or have contradictory implications. We\nshould use means that support our goals, rather than defeat them. We\nshould avoid contradictory\n goals.[36]\n Beyond this, however, it is not obvious that “reason” is\na unitary capacity or that “rationality” is a unitary\nrequirement. If truth seems self-evident as a criterion of thinking,\nthe criteria for rational action are much harder to make out.\n\nIf we accept the basic lesson of the first Critique, it is\neven harder to discern the criteria of rational action. Against\nrationalist philosophers, Kant argues that theoretical reason cannot\ndiscover realities beyond empirical experience. (Recall the literal\nmeaning of metaphysics: beyond the physical world.) So we\ncannot know any sort of moral authority, be it God or revelation, that\ntells us how to think and act. Traditionally, truth and goodness stood\ntogether. Mendelssohn called Kant the “all-destroyer”\npartly because his critique undercut this traditional pairing.\nExperience can disclose (empirical) truth, but not goodness.\n\nPerhaps, then, we can only reason practically in order to satisfy\npre-existing feelings or goals. These factors can motivate us to\nreasoning, but they are not themselves open to rational justification.\nHume’s empiricist account of morality illustrates the point.\nReason is “the slave of the passions.” We can only hope\nthat our fellow human beings feel sympathy, and will put reason to\nwork in its cause. Although we may disapprove, we cannot say it is\nirrational to feel or pursue more anti-social\n“passions” such as spite or envy or pride. In Hume’s\nown words, “’Tis not contrary to reason to prefer the\ndestruction of the whole world to the scratching of my finger…\n’Tis as little contrary to reason to prefer even my own\nacknowledg’d lesser good to my greater…”\n(Treatise 2.3.3.6).\n\nSince Kant has cut off (theoretical) knowledge of goodness,\ndoesn’t consistency drive him to similar skepticism? Since his\naccount is structured by a distinction between theoretical and\npractical reason, how can he show their unity?\n\nThis entry has suggested that Kant’s account of reason is\nconstructive (not skeptical) and unified (not divided). In thought and\nin action, reasoners must look for principles that others can also\nadopt:\n\nTo make use of one’s own reason means no more than to ask\noneself, whenever one is supposed to assume something, whether one\ncould find it feasible to make the ground or the rule on which one\nassumes it into a universal principle for the use of reason.\n(“What is it to Orient Oneself in Thinking?” 8:146n)\n\n\nIn theoretical enquiry, we seek knowledge of the world and explore the\nlimits of knowledge; we think and philosophize. We hope to reach\njudgments that are valid for all and draw on principles that all can\nrely on.\n\nIn practical reasoning, we decide how to act, individually and with\nothers. Kant often emphasizes duty, but this entry has stressed the\nrelated idea of reasoning as justification. If an action is\njustified, other people should endorse it, rather than resent or\ncriticize it. If their circumstances are similar, they should act\nsimilarly. Even if their circumstances differ, the same underlying\nprinciples should guide their actions. If we can share principles, we\ncan justify our conduct and find a basis for cooperation.\n\nO’Neill (2000) situates the Kantian account against three\nalternatives. (i) The instrumental account of reason remains\npopular. Following Hume, rational choice theory and\n consequentialism\n see practical reasoning as a tool. Reason works out how to achieve\ngiven ends (cf.\n practical reason,\n §4;\n reasons for action: internal vs. external;\n instrumental rationality;\n philosophy of economics,\n §5). (ii) The communitarian account sees reason as\nembedded within shared traditions. Rationality is what a historical\ncommunity takes it to be—for example, its usual modes of\nargument and accepted authorities (cf. MacIntyre 1988;\n communitarianism).\n (iii) The perfectionist account sees reason as an individual\ncapacity to discern moral truth or goodness. This view resembles the\nrationalism which Kant opposed, except that it stresses divine\nrevelation or moral intuition, rather than abstract thought (cf.\n moral non-naturalism,\n §3).\n\nArguably, all three accounts fail in providing reasoned justification\nto some audiences. (i) The instrumental reasoner cannot justify their\naction to people who do not endorse their goal. Instrumental reasons\nexplain action in terms of the actor’s desires or ends.\nThey can make sense of the action, but they do not give the audience\nreasons to endorse it. Explanation is not justification. (ii) For the\ncommunitarian, their tradition defines what beliefs and practices\ncount as reasonable. If someone disagrees, such a reasoner can say\nlittle except: this is how I have been taught; this is how we do\nthings round here. This sort of reasoning cannot justify itself to\noutsiders, nor to insiders who dissent. (Recall Kant’s free\ncitizens who “must be able to express [their] reservations,\nindeed even [their] veto.”) (iii) The perfectionist believes\nthat they can intuit how it is good to act or to be. But what can they\nsay to someone who has different “intuitions,” or\nnone—except perhaps to condemn them as blind or confused?\n\nOn the interpretations advanced by Saner, O’Neill, Neiman and\nothers, Kant was aware of these options and rejected them all. We saw\nabove\n (§1.4)\n that Kant characterizes reason in terms of a self-reflexive\nprocedure. Reason is autonomous—that is, it rejects all external\nauthorities. Reason has authority only because it rests on on-going\ncritique. Openness to critique means giving up any mode of thinking or\nacting that cannot be adopted by all.\n\nTo put the same point in more concrete terms: Kant ties reasoning to\njustification. His account stresses the limits of many everyday\njustifications. Consider the modes of reasoning just mentioned. (i)\n“Because I wanted to” is sometimes a perfectly good\nreason—so long as I don’t infringe on\nothers’ legitimate claims. (ii) “Because that’s how\nwe usually do things” is sometimes a perfectly good\nreason—so long as our practices don’t endanger or\nhumiliate or exploit. (iii) “Because it felt like the right\nthing to do” may be a perfectly good reason—so long\nas my “intuitions” reflect a moral sensibility that\nfits my circumstances.\n\nThe Kantian point is this: Don’t forget the proviso,\n“so long as…” In the wrong circumstances,\ndesires, customs and intuitions can lead us astray. Reasoning is\nincomplete unless we can also justify giving weight to the\ndesires, customs or intuitions that make something seem reasonable to\nus. By contrast, reasoning is complete when it meets the following\ntest: Everyone could think and act on the same principles that now\nguide my thought and action. To judge whether our thinking and acting\nmeet this demanding test, we must consider objections from different\npoints of view. As Kant says, each person “must be able to\nexpress [their] reservations.” This is an on-going process, with\nno fixed or final endpoint. Only this active process can make\nreasoning fully “public,” “autonomous” and\n“universal(izable).”\n\nThe Kantian view does not assume that we are hemmed in by our\ninterests and inclinations—as many instrumental accounts do. It\ndoes not ask us to rely on what others already accept—as the\ncommunitarian account does. It does not suppose that we can intuit\nwhat everyone should accept—as the perfectionist account does.\nNot least, it does not suppose that reason can teach us about God or\nany other moral authority beyond everyday experience—as many\nrationalist philosophers supposed. Kant’s account sees human\nbeings as able to step back from their inclinations, habits and\nintuitions. Reasoning is not the voice of God, but rather a capacity\nto heed the voices of those we share a world with. Kant asks us to use\nthis ability to seek principles that all can think and live by, and to\norganize our lives together on this basis.\n\nThis account depends on a particular interpretation of Kant’s\ntexts. It is abstract, ambitious, and complex in its ramifications.\nBut if it succeeds, it captures two powerful aspects of Kant’s\nphilosophy: a universalism that transcends self and community\nboundaries; a modesty that respects the limits of human insight.\n",
    "section_title": "4. Concluding remarks",
    "entry_title": "Kant’s Account of Reason",
    "hierarchy_title": "Kant’s Account of Reason || The unity of theoretical and practical reason || The public use of reason",
    "tokenized_text": [
        "unity",
        "theoretical",
        "practical",
        "reason",
        "public",
        "use",
        "reason",
        "concluding",
        "remark",
        "one",
        "doubt",
        "belief",
        "action",
        "subject",
        "demand",
        "rationality",
        "theoretical",
        "reasoning",
        "aim",
        "knowledge",
        "world",
        "around",
        "u",
        "perhaps",
        "also",
        "knowledge",
        "practical",
        "reasoning",
        "aim",
        "make",
        "difference",
        "world",
        "perhaps",
        "also",
        "difference",
        "distinction",
        "hide",
        "larger",
        "question",
        "reason",
        "exactly",
        "rationality",
        "clearly",
        "involves",
        "capacity",
        "make",
        "logical",
        "causal",
        "inference",
        "draw",
        "consequence",
        "belief",
        "judge",
        "consequence",
        "likely",
        "follow",
        "different",
        "possibility",
        "action",
        "rationality",
        "clearly",
        "requires",
        "consistency",
        "belief",
        "contradict",
        "one",
        "another",
        "contradictory",
        "implication",
        "use",
        "mean",
        "support",
        "goal",
        "rather",
        "defeat",
        "avoid",
        "contradictory",
        "goal",
        "beyond",
        "however",
        "obvious",
        "reason",
        "unitary",
        "capacity",
        "rationality",
        "unitary",
        "requirement",
        "truth",
        "seems",
        "selfevident",
        "criterion",
        "thinking",
        "criterion",
        "rational",
        "action",
        "much",
        "harder",
        "make",
        "accept",
        "basic",
        "lesson",
        "first",
        "critique",
        "even",
        "harder",
        "discern",
        "criterion",
        "rational",
        "action",
        "rationalist",
        "philosopher",
        "kant",
        "argues",
        "theoretical",
        "reason",
        "discover",
        "reality",
        "beyond",
        "empirical",
        "experience",
        "recall",
        "literal",
        "meaning",
        "metaphysics",
        "beyond",
        "physical",
        "world",
        "know",
        "sort",
        "moral",
        "authority",
        "god",
        "revelation",
        "tell",
        "u",
        "think",
        "act",
        "traditionally",
        "truth",
        "goodness",
        "stood",
        "together",
        "mendelssohn",
        "called",
        "kant",
        "alldestroyer",
        "partly",
        "critique",
        "undercut",
        "traditional",
        "pairing",
        "experience",
        "disclose",
        "empirical",
        "truth",
        "goodness",
        "perhaps",
        "reason",
        "practically",
        "order",
        "satisfy",
        "preexisting",
        "feeling",
        "goal",
        "factor",
        "motivate",
        "u",
        "reasoning",
        "open",
        "rational",
        "justification",
        "hume",
        "empiricist",
        "account",
        "morality",
        "illustrates",
        "point",
        "reason",
        "slave",
        "passions",
        "hope",
        "fellow",
        "human",
        "being",
        "feel",
        "sympathy",
        "put",
        "reason",
        "work",
        "cause",
        "although",
        "may",
        "disapprove",
        "say",
        "irrational",
        "feel",
        "pursue",
        "antisocial",
        "passion",
        "spite",
        "envy",
        "pride",
        "hume",
        "word",
        "ti",
        "contrary",
        "reason",
        "prefer",
        "destruction",
        "whole",
        "world",
        "scratching",
        "finger",
        "ti",
        "little",
        "contrary",
        "reason",
        "prefer",
        "even",
        "acknowledg",
        "lesser",
        "good",
        "greater",
        "treatise",
        "since",
        "kant",
        "cut",
        "theoretical",
        "knowledge",
        "goodness",
        "consistency",
        "drive",
        "similar",
        "skepticism",
        "since",
        "account",
        "structured",
        "distinction",
        "theoretical",
        "practical",
        "reason",
        "show",
        "unity",
        "entry",
        "suggested",
        "kant",
        "account",
        "reason",
        "constructive",
        "skeptical",
        "unified",
        "divided",
        "thought",
        "action",
        "reasoner",
        "must",
        "look",
        "principle",
        "others",
        "also",
        "adopt",
        "make",
        "use",
        "one",
        "reason",
        "mean",
        "ask",
        "oneself",
        "whenever",
        "one",
        "supposed",
        "assume",
        "something",
        "whether",
        "one",
        "could",
        "find",
        "feasible",
        "make",
        "ground",
        "rule",
        "one",
        "assumes",
        "universal",
        "principle",
        "use",
        "reason",
        "orient",
        "oneself",
        "thinking",
        "n",
        "theoretical",
        "enquiry",
        "seek",
        "knowledge",
        "world",
        "explore",
        "limit",
        "knowledge",
        "think",
        "philosophize",
        "hope",
        "reach",
        "judgment",
        "valid",
        "draw",
        "principle",
        "rely",
        "practical",
        "reasoning",
        "decide",
        "act",
        "individually",
        "others",
        "kant",
        "often",
        "emphasizes",
        "duty",
        "entry",
        "stressed",
        "related",
        "idea",
        "reasoning",
        "justification",
        "action",
        "justified",
        "people",
        "endorse",
        "rather",
        "resent",
        "criticize",
        "circumstance",
        "similar",
        "act",
        "similarly",
        "even",
        "circumstance",
        "differ",
        "underlying",
        "principle",
        "guide",
        "action",
        "share",
        "principle",
        "justify",
        "conduct",
        "find",
        "basis",
        "cooperation",
        "neill",
        "situates",
        "kantian",
        "account",
        "three",
        "alternative",
        "instrumental",
        "account",
        "reason",
        "remains",
        "popular",
        "following",
        "hume",
        "rational",
        "choice",
        "theory",
        "consequentialism",
        "see",
        "practical",
        "reasoning",
        "tool",
        "reason",
        "work",
        "achieve",
        "given",
        "end",
        "cf",
        "practical",
        "reason",
        "reason",
        "action",
        "internal",
        "vs",
        "external",
        "instrumental",
        "rationality",
        "philosophy",
        "economics",
        "ii",
        "communitarian",
        "account",
        "see",
        "reason",
        "embedded",
        "within",
        "shared",
        "tradition",
        "rationality",
        "historical",
        "community",
        "take",
        "befor",
        "example",
        "usual",
        "mode",
        "argument",
        "accepted",
        "authority",
        "cf",
        "macintyre",
        "communitarianism",
        "iii",
        "perfectionist",
        "account",
        "see",
        "reason",
        "individual",
        "capacity",
        "discern",
        "moral",
        "truth",
        "goodness",
        "view",
        "resembles",
        "rationalism",
        "kant",
        "opposed",
        "except",
        "stress",
        "divine",
        "revelation",
        "moral",
        "intuition",
        "rather",
        "abstract",
        "thought",
        "cf",
        "moral",
        "nonnaturalism",
        "arguably",
        "three",
        "account",
        "fail",
        "providing",
        "reasoned",
        "justification",
        "audience",
        "instrumental",
        "reasoner",
        "justify",
        "action",
        "people",
        "endorse",
        "goal",
        "instrumental",
        "reason",
        "explain",
        "action",
        "term",
        "actor",
        "desire",
        "end",
        "make",
        "sense",
        "action",
        "give",
        "audience",
        "reason",
        "endorse",
        "explanation",
        "justification",
        "ii",
        "communitarian",
        "tradition",
        "defines",
        "belief",
        "practice",
        "count",
        "reasonable",
        "someone",
        "disagrees",
        "reasoner",
        "say",
        "little",
        "except",
        "taught",
        "thing",
        "round",
        "sort",
        "reasoning",
        "justify",
        "outsider",
        "insider",
        "dissent",
        "recall",
        "kant",
        "free",
        "citizen",
        "must",
        "able",
        "express",
        "reservation",
        "indeed",
        "even",
        "veto",
        "iii",
        "perfectionist",
        "belief",
        "intuit",
        "good",
        "act",
        "say",
        "someone",
        "different",
        "intuition",
        "noneexcept",
        "perhaps",
        "condemn",
        "blind",
        "confused",
        "interpretation",
        "advanced",
        "saner",
        "neill",
        "neiman",
        "others",
        "kant",
        "aware",
        "option",
        "rejected",
        "saw",
        "kant",
        "characterizes",
        "reason",
        "term",
        "selfreflexive",
        "procedure",
        "reason",
        "autonomousthat",
        "reject",
        "external",
        "authority",
        "reason",
        "authority",
        "rest",
        "ongoing",
        "critique",
        "openness",
        "critique",
        "mean",
        "giving",
        "mode",
        "thinking",
        "acting",
        "adopted",
        "put",
        "point",
        "concrete",
        "term",
        "kant",
        "tie",
        "reasoning",
        "justification",
        "account",
        "stress",
        "limit",
        "many",
        "everyday",
        "justification",
        "consider",
        "mode",
        "reasoning",
        "mentioned",
        "wanted",
        "sometimes",
        "perfectly",
        "good",
        "reasonso",
        "long",
        "infringe",
        "others",
        "legitimate",
        "claim",
        "ii",
        "usually",
        "thing",
        "sometimes",
        "perfectly",
        "good",
        "reasonso",
        "long",
        "practice",
        "endanger",
        "humiliate",
        "exploit",
        "iii",
        "felt",
        "like",
        "right",
        "thing",
        "may",
        "perfectly",
        "good",
        "reasonso",
        "long",
        "intuition",
        "reflect",
        "moral",
        "sensibility",
        "fit",
        "circumstance",
        "kantian",
        "point",
        "forget",
        "proviso",
        "long",
        "as",
        "wrong",
        "circumstance",
        "desire",
        "custom",
        "intuition",
        "lead",
        "u",
        "astray",
        "reasoning",
        "incomplete",
        "unless",
        "also",
        "justify",
        "giving",
        "weight",
        "desire",
        "custom",
        "intuition",
        "make",
        "something",
        "seem",
        "reasonable",
        "u",
        "contrast",
        "reasoning",
        "complete",
        "meet",
        "following",
        "test",
        "everyone",
        "could",
        "think",
        "act",
        "principle",
        "guide",
        "thought",
        "action",
        "judge",
        "whether",
        "thinking",
        "acting",
        "meet",
        "demanding",
        "test",
        "must",
        "consider",
        "objection",
        "different",
        "point",
        "view",
        "kant",
        "say",
        "person",
        "must",
        "able",
        "express",
        "reservations",
        "ongoing",
        "process",
        "fixed",
        "final",
        "endpoint",
        "active",
        "process",
        "make",
        "reasoning",
        "fully",
        "public",
        "autonomous",
        "universal",
        "izable",
        "kantian",
        "view",
        "assume",
        "hemmed",
        "interest",
        "inclinationsas",
        "many",
        "instrumental",
        "account",
        "ask",
        "u",
        "rely",
        "others",
        "already",
        "acceptas",
        "communitarian",
        "account",
        "suppose",
        "intuit",
        "everyone",
        "acceptas",
        "perfectionist",
        "account",
        "least",
        "suppose",
        "reason",
        "teach",
        "u",
        "god",
        "moral",
        "authority",
        "beyond",
        "everyday",
        "experienceas",
        "many",
        "rationalist",
        "philosopher",
        "supposed",
        "kant",
        "account",
        "see",
        "human",
        "being",
        "able",
        "step",
        "back",
        "inclination",
        "habit",
        "intuition",
        "reasoning",
        "voice",
        "god",
        "rather",
        "capacity",
        "heed",
        "voice",
        "share",
        "world",
        "kant",
        "asks",
        "u",
        "use",
        "ability",
        "seek",
        "principle",
        "think",
        "live",
        "organize",
        "life",
        "together",
        "basis",
        "account",
        "depends",
        "particular",
        "interpretation",
        "kant",
        "text",
        "abstract",
        "ambitious",
        "complex",
        "ramification",
        "succeeds",
        "capture",
        "two",
        "powerful",
        "aspect",
        "kant",
        "philosophy",
        "universalism",
        "transcends",
        "self",
        "community",
        "boundary",
        "modesty",
        "respect",
        "limit",
        "human",
        "insight"
    ]
}