{
    "main_text": "Biology\n5. Biology\n\nKant was interested not only in the inanimate bodies studied by\nphysics, but also in living organisms, which he viewed as deserving of\nadditional philosophical scrutiny due to their special status, for two\nreasons. First, the symmetries and regularities of their structure and\nworkings make them “in the highest degree contingent” (5:\n360) and “mechanically inexplicable.” Second, organisms\ncome from their own kind; grow their own functional parts, or organs,\nand repair them if they become damaged; and do in general exhibit\nhomeostasis. These facts about them prompt Kant to claim that an\norganism is “cause and effect of itself” (5: 370). In a\nsense, a living entity is self-caused, and indeed by a causality that\nwe can grasp solely “under the idea of purposes as a\nprinciple” (5: 383). Organisms, in other words, are\n“natural purposes,” or naturally occurring ensembles of\nparts purposefully fitted and working in unity.\n\nIt is just these peculiarities that create philosophical challenges\nnot met with in physics and chemistry. Kant tackles them in the latter\nhalf of his third magnum opus, the Critique of the Power of\nJudgment (1790). In particular, he claims that attempting to\nexplain organisms creates an inevitable conflict within reflective\njudgment, the faculty we employ in empirical concept formation,\ntaxonomic classification, and the explanatory unification of\nparticular laws. Kant describes that conflict in the Antinomy of\nTeleological Judgment (CJ §§ 69–78; 5:\n385–415). The Antinomy obtains between two regulative\nprinciples, herein prefixed by an ‘R’ to distinguish them\nfrom two similar constitutive principles that Kant briefly\ndiscusses in the same place:\n\n\nR-thesis:\n\nAll generation of material things and their forms must be judged as\npossible in accordance with merely mechanical laws.\n\nR-antithesis:\n\nSome products of material nature cannot be judged as possible\naccording to merely mechanical laws (judging them requires an entirely\ndifferent law of causality, namely that of final causality) (5:\n387).\n\n\nA great deal of scholarship has aimed to elucidate this antinomy, and\nin the last decade these interpretive efforts have gained new momentum\n(see also the entry “Kant’s Aesthetics and\nTeleology” in this encyclopedia). In particular, sustained\nattention has been given to three questions: In what sense are\norganisms inexplicable mechanically, for Kant? What exactly is the\ncontradiction that generates the Antinomy? And precisely how does Kant\nsolve it?\n\nFirst, clarification is needed about Kant’s claim that organisms\ncannot be explained ‘mechanically.’ In the Enlightenment,\n‘mechanical’ was used in at least two senses: broadly, to\ndenote explanation by physico-chemical laws of efficient\ncausation; and narrowly, restricted to the theory of ‘compound\nmachines,’ or assemblies of movable parts used to displace loads\nor transfer momentum, e.g. engines and watches. McLaughlin (1990)\ntakes Kant to mean ‘mechanical’ in this latter sense. In\nartificial machines, parts precede the whole temporally, and\ndetermine it: the machine’s configuration results from\nsummation over the parts; and its laws of operation are the same as\nthose governing the parts. But organisms are different: the whole\nprecedes its parts, or organs; and it has functions and aim-directed\nbehaviors not present in them. Hence, organisms are mechanically\ninexplicable. Ginsborg (2004) construes Kant’s claim along\ndifferent lines, in two senses. According to one, to explain something\nmechanically is to show that its production results, or would result,\nfrom the “unaided powers of matter as such,” i.e.\nNewtonian forces of attraction and repulsion, and “crude\nunorganized matter,” or arbitrary initial conditions such as\nmasses, charges, configurations and motions. Organisms are\ninexplicable in this sense because their arising would be “in\nthe highest degree contingent.” This is the notion operative in\nthe Antinomy of Teleological Judgment, Ginsborg contends. But, she has\nargued, there is a second, stronger sense. Not only are organisms\ninexplicable by reduction to the structure and powers of their\norgans—rather, their symmetries and regularities and powers are\nnot explicable from the “moving forces” of their\ninorganic particles either. Organism-level powers are not\nvector sums or integrals of physico-chemical forces that accelerate or\nreconfigure sub-visible particles.\n\nSecond, interpreters have also scrutinized the exact nature of the\nAntinomy. Insofar as the thesis and the antithesis are regulative\nprinciples, they may be seen as research policies, and those can be\npursued separately, at different times, hence with no\ncontradiction. Then why are they antinomic? Watkins (2009, § 2.2)\nexplains that the two theses do not just recommend explanatory\npolicies but express commitments to judging in a determinate way about\nbiological phenomena. As such, they would be contradictory\ncommitments: to judge organisms purely mechanistically and to\njudge them non-mechanistically. Teufel (2011) reads the two theses as\nhypothetical imperatives, imposed upon reflective judgment by\npractical reason. The Antinomy ensues, he contends, because they\ndemand contradictory courses of cognitive conduct: to judge that\nmechanistic laws suffice to explain organisms and that they\nare insufficient for that task.\n\nMoreover, for each antinomy in the Critique of Pure Reason,\nKant derives both thesis and antithesis by deductive argument from\nalleged a priori premises. But, in the Antinomy of Teleological\nJudgment, he does not take that route. This makes quite pressing the\nquestion of his justification for the two R-claims above. As to the\nR-thesis, one might think that it can be easily deduced from\nKant’s three Laws of Mechanics. However, we must remember that\nthose laws are constitutive principles, whereas the R-thesis is\nregulative. A better interpretive avenue is that Kant’s three\nlaws constrain the spectrum of particular empirical laws, including\nlaws for biology, that scientists may seek. The constraint is that the\nLaws of Mechanics are basic: no other laws of material nature explain\nor ground them, while they must explain all other laws,\ndirectly or indirectly. So, for biological regularities to be turned\ninto genuine laws, they must be integrable with the system of already\nknown mechanical laws, and ultimately explained by the three Laws of\nMechanics, the basis for all “interconnected experiential\ncognition” (5: 386). Even less well understood is Kant’s\njustification for the R-antithesis. Not only is there no official\nproof, it is not easy to know what the proof must establish. The\nR-thesis strongly implies that at issue is the origin of\norganisms; in contrast, the R-antithesis is about judging their\npossibility, which has to do with structure and functioning\nnot production (Ginsborg 2001, 236). These are different aspects of\norganisms, and proving that they are mechanically inexplicable would\nrequire different arguments.\n\nThird, Kant’s solution to the Antinomy has received sustained\nattention. In the first two Critiques, his general approach is to\nargue, for each antinomy, that both thesis and antithesis presuppose\nTranscendental Realism, insofar as they make claims about things in\nthemselves; and to adduce Transcendental Idealism as the vantage point\nfrom which the initial contradiction is solved. However, that is not\nKant’s approach to the Antinomy of Teleological Judgment.\nAccordingly, interpreters have sought to reconstruct a different\nsolution on Kant’s behalf. Quarfood (2004) and Förster\n(2008) take the notion of an intuitive understanding (expounded at 5:\n401–10) as the key to Kant’s answer. In particular,\nFörster explains, intellects like ours are discursive: they grasp\nobjects through concepts as ‘parts’ assembled in\ntemporally-extended judgments, and so mechanistically, he alleges.\nHence, we need the concept ‘purpose’ to judge organisms\nsolely because we have discursive intellects. However, an intuitive\nunderstanding could grasp organisms without purpose-concepts and\nregulative principles about judging teleologically. Hence, for this\nunderstanding, the R-thesis and R-antithesis need not be true, and so\nno antinomy arises. Breitenbach (2008) contends that the Antinomy is\nsolved, or rather dissolved, if we note that thesis and antithesis are\nnot really contradictory but complementary. They govern (reflecting)\nacts of judging in different contexts: the mechanistic R-thesis\nregulates explanatory conduct in empirical biology, whereas the\nR-antithesis governs ordinary judging about living nature as\nexperienced in everyday, pre-theoretical encounters with it. The two\nprinciples epitomize “two different views on nature,” and\nare compossible (466). They just appear to be in contradiction; in\nfact, they complement each other, indispensably. McLaughlin (1990)\nsubmits that the Antinomy does not arise simpliciter but only\nunder a special assumption, viz. that everything in nature is\nobjectively explainable by us (162). Reject the assumption, and the\ncontradiction vanishes, insofar as the R-thesis and the R-antithesis\ncan both be true, but for different domains: the former holds for\nphenomena explainable by us, the latter for phenomena not so\nexplainable. McLaughlin does not offer a general criterion for\n‘explicability by us’ attributable to Kant, however, apart\nfrom mechanical explicability. Ginsborg (2008) focuses on how the\ncontradiction might be resolved in the context of scientific\ninvestigation rather than in abstract, general philosophical terms.\nBuilding on Kant’s remark about subordinating mechanism to\nteleology (5: 414), Ginsborg contends that natural historians and\nphysiologists may well explain the origin and workings of organisms\n‘mechanistically,’ purely by physico-chemical laws,\nprovided they apply them not to “crude” but to\n“organized” matter, i.e. organic stuff already endowed\nwith a “formative drive,” a generic disposition to grow,\nreproduce and self-maintain. In turn, this organized matter itself is\nunintelligible without appeal to purpose and design terms. Thus,\nbiologists ‘subordinate’ mechanism to teleology, and so\nthe antinomic conflict between them is removed.\n\nWhile these interpretive proposals collectively advance our\nunderstanding of how the Antinomy might be defused, each has its share\nof philosophical difficulties, as spelled out in Watkins (2009).\nMoreover, few of these construals heed close to Kant’s words,\nwhich suggest strongly that his solution relies indispensably\non a “supersensible ground” (5: 413), or explanatory\nprinciple located in the noumenal world. That ground could\nunite both mechanism and teleology, by making both antinomic theses\njointly derivable or explainable from it. However, since humans can\nhave “no positive determinate” knowledge of any\nsupersensible entity, the Antinomy is solvable in principle rather\nthan solved in fact. Kant (at least in his official solution) does not\nseem to provide the details for an actual account of how the conflict\nat the heart of biological explanation is removed. The limitations\nthat beset our understanding of Kant’s philosophy of biology so\nfar, some of which we have expounded above, continue to drive\ninterpretive efforts to cast more light on that part of his doctrine,\nas exemplified in Goy and Watkins (forthcoming).\n\nIn addition to the works mentioned above, Kant’s Antinomy of\nTeleological Judgment has been usefully discussed in Allison (1991),\nCohen (2004), Ginsborg (2001), Kreines (2005), Steigerwald (2006),\nZanetti (1993) and Zumbach (1984); see also the entry\n“Kant’s Aesthetics and Teleology” in this\nencyclopedia.\n",
    "section_title": "5. Biology",
    "entry_title": "Kant’s Philosophy of Science",
    "hierarchy_title": "Kant’s Philosophy of Science || Biology",
    "tokenized_text": [
        "biology",
        "biology",
        "kant",
        "interested",
        "inanimate",
        "body",
        "studied",
        "physic",
        "also",
        "living",
        "organism",
        "viewed",
        "deserving",
        "additional",
        "philosophical",
        "scrutiny",
        "due",
        "special",
        "status",
        "two",
        "reason",
        "first",
        "symmetry",
        "regularity",
        "structure",
        "working",
        "make",
        "highest",
        "degree",
        "contingent",
        "mechanically",
        "inexplicable",
        "second",
        "organism",
        "come",
        "kind",
        "grow",
        "functional",
        "part",
        "organ",
        "repair",
        "become",
        "damaged",
        "general",
        "exhibit",
        "homeostasis",
        "fact",
        "prompt",
        "kant",
        "claim",
        "organism",
        "cause",
        "effect",
        "sense",
        "living",
        "entity",
        "selfcaused",
        "indeed",
        "causality",
        "grasp",
        "solely",
        "idea",
        "purpose",
        "principle",
        "organism",
        "word",
        "natural",
        "purpose",
        "naturally",
        "occurring",
        "ensemble",
        "part",
        "purposefully",
        "fitted",
        "working",
        "unity",
        "peculiarity",
        "create",
        "philosophical",
        "challenge",
        "met",
        "physic",
        "chemistry",
        "kant",
        "tackle",
        "latter",
        "half",
        "third",
        "magnum",
        "opus",
        "critique",
        "power",
        "judgment",
        "particular",
        "claim",
        "attempting",
        "explain",
        "organism",
        "creates",
        "inevitable",
        "conflict",
        "within",
        "reflective",
        "judgment",
        "faculty",
        "employ",
        "empirical",
        "concept",
        "formation",
        "taxonomic",
        "classification",
        "explanatory",
        "unification",
        "particular",
        "law",
        "kant",
        "describes",
        "conflict",
        "antinomy",
        "teleological",
        "judgment",
        "cj",
        "antinomy",
        "obtains",
        "two",
        "regulative",
        "principle",
        "herein",
        "prefixed",
        "r",
        "distinguish",
        "two",
        "similar",
        "constitutive",
        "principle",
        "kant",
        "briefly",
        "discus",
        "place",
        "rthesis",
        "generation",
        "material",
        "thing",
        "form",
        "must",
        "judged",
        "possible",
        "accordance",
        "merely",
        "mechanical",
        "law",
        "rantithesis",
        "product",
        "material",
        "nature",
        "judged",
        "possible",
        "according",
        "merely",
        "mechanical",
        "law",
        "judging",
        "requires",
        "entirely",
        "different",
        "law",
        "causality",
        "namely",
        "final",
        "causality",
        "great",
        "deal",
        "scholarship",
        "aimed",
        "elucidate",
        "antinomy",
        "last",
        "decade",
        "interpretive",
        "effort",
        "gained",
        "new",
        "momentum",
        "see",
        "also",
        "entry",
        "kant",
        "aesthetic",
        "teleology",
        "encyclopedia",
        "particular",
        "sustained",
        "attention",
        "given",
        "three",
        "question",
        "sense",
        "organism",
        "inexplicable",
        "mechanically",
        "kant",
        "exactly",
        "contradiction",
        "generates",
        "antinomy",
        "precisely",
        "kant",
        "solve",
        "first",
        "clarification",
        "needed",
        "kant",
        "claim",
        "organism",
        "explained",
        "mechanically",
        "enlightenment",
        "mechanical",
        "used",
        "least",
        "two",
        "sens",
        "broadly",
        "denote",
        "explanation",
        "physicochemical",
        "law",
        "efficient",
        "causation",
        "narrowly",
        "restricted",
        "theory",
        "compound",
        "machine",
        "assembly",
        "movable",
        "part",
        "used",
        "displace",
        "load",
        "transfer",
        "momentum",
        "eg",
        "engine",
        "watch",
        "mclaughlin",
        "take",
        "kant",
        "mean",
        "mechanical",
        "latter",
        "sense",
        "artificial",
        "machine",
        "part",
        "precede",
        "whole",
        "temporally",
        "determine",
        "machine",
        "configuration",
        "result",
        "summation",
        "part",
        "law",
        "operation",
        "governing",
        "part",
        "organism",
        "different",
        "whole",
        "precedes",
        "part",
        "organ",
        "function",
        "aimdirected",
        "behavior",
        "present",
        "hence",
        "organism",
        "mechanically",
        "inexplicable",
        "ginsborg",
        "construes",
        "kant",
        "claim",
        "along",
        "different",
        "line",
        "two",
        "sens",
        "according",
        "one",
        "explain",
        "something",
        "mechanically",
        "show",
        "production",
        "result",
        "would",
        "result",
        "unaided",
        "power",
        "matter",
        "ie",
        "newtonian",
        "force",
        "attraction",
        "repulsion",
        "crude",
        "unorganized",
        "matter",
        "arbitrary",
        "initial",
        "condition",
        "mass",
        "charge",
        "configuration",
        "motion",
        "organism",
        "inexplicable",
        "sense",
        "arising",
        "would",
        "highest",
        "degree",
        "contingent",
        "notion",
        "operative",
        "antinomy",
        "teleological",
        "judgment",
        "ginsborg",
        "contends",
        "argued",
        "second",
        "stronger",
        "sense",
        "organism",
        "inexplicable",
        "reduction",
        "structure",
        "power",
        "organsrather",
        "symmetry",
        "regularity",
        "power",
        "explicable",
        "moving",
        "force",
        "inorganic",
        "particle",
        "either",
        "organismlevel",
        "power",
        "vector",
        "sum",
        "integral",
        "physicochemical",
        "force",
        "accelerate",
        "reconfigure",
        "subvisible",
        "particle",
        "second",
        "interpreter",
        "also",
        "scrutinized",
        "exact",
        "nature",
        "antinomy",
        "insofar",
        "thesis",
        "antithesis",
        "regulative",
        "principle",
        "may",
        "seen",
        "research",
        "policy",
        "pursued",
        "separately",
        "different",
        "time",
        "hence",
        "contradiction",
        "antinomic",
        "watkins",
        "explains",
        "two",
        "thesis",
        "recommend",
        "explanatory",
        "policy",
        "express",
        "commitment",
        "judging",
        "determinate",
        "way",
        "biological",
        "phenomenon",
        "would",
        "contradictory",
        "commitment",
        "judge",
        "organism",
        "purely",
        "mechanistically",
        "judge",
        "nonmechanistically",
        "teufel",
        "read",
        "two",
        "thesis",
        "hypothetical",
        "imperative",
        "imposed",
        "upon",
        "reflective",
        "judgment",
        "practical",
        "reason",
        "antinomy",
        "ensues",
        "contends",
        "demand",
        "contradictory",
        "course",
        "cognitive",
        "conduct",
        "judge",
        "mechanistic",
        "law",
        "suffice",
        "explain",
        "organism",
        "insufficient",
        "task",
        "moreover",
        "antinomy",
        "critique",
        "pure",
        "reason",
        "kant",
        "derives",
        "thesis",
        "antithesis",
        "deductive",
        "argument",
        "alleged",
        "priori",
        "premise",
        "antinomy",
        "teleological",
        "judgment",
        "take",
        "route",
        "make",
        "quite",
        "pressing",
        "question",
        "justification",
        "two",
        "rclaims",
        "rthesis",
        "one",
        "might",
        "think",
        "easily",
        "deduced",
        "kant",
        "three",
        "law",
        "mechanic",
        "however",
        "must",
        "remember",
        "law",
        "constitutive",
        "principle",
        "whereas",
        "rthesis",
        "regulative",
        "better",
        "interpretive",
        "avenue",
        "kant",
        "three",
        "law",
        "constrain",
        "spectrum",
        "particular",
        "empirical",
        "law",
        "including",
        "law",
        "biology",
        "scientist",
        "may",
        "seek",
        "constraint",
        "law",
        "mechanic",
        "basic",
        "law",
        "material",
        "nature",
        "explain",
        "ground",
        "must",
        "explain",
        "law",
        "directly",
        "indirectly",
        "biological",
        "regularity",
        "turned",
        "genuine",
        "law",
        "must",
        "integrable",
        "system",
        "already",
        "known",
        "mechanical",
        "law",
        "ultimately",
        "explained",
        "three",
        "law",
        "mechanic",
        "basis",
        "interconnected",
        "experiential",
        "cognition",
        "even",
        "le",
        "well",
        "understood",
        "kant",
        "justification",
        "rantithesis",
        "official",
        "proof",
        "easy",
        "know",
        "proof",
        "must",
        "establish",
        "rthesis",
        "strongly",
        "implies",
        "issue",
        "origin",
        "organism",
        "contrast",
        "rantithesis",
        "judging",
        "possibility",
        "structure",
        "functioning",
        "production",
        "ginsborg",
        "different",
        "aspect",
        "organism",
        "proving",
        "mechanically",
        "inexplicable",
        "would",
        "require",
        "different",
        "argument",
        "third",
        "kant",
        "solution",
        "antinomy",
        "received",
        "sustained",
        "attention",
        "first",
        "two",
        "critique",
        "general",
        "approach",
        "argue",
        "antinomy",
        "thesis",
        "antithesis",
        "presuppose",
        "transcendental",
        "realism",
        "insofar",
        "make",
        "claim",
        "thing",
        "adduce",
        "transcendental",
        "idealism",
        "vantage",
        "point",
        "initial",
        "contradiction",
        "solved",
        "however",
        "kant",
        "approach",
        "antinomy",
        "teleological",
        "judgment",
        "accordingly",
        "interpreter",
        "sought",
        "reconstruct",
        "different",
        "solution",
        "kant",
        "behalf",
        "quarfood",
        "förster",
        "take",
        "notion",
        "intuitive",
        "understanding",
        "expounded",
        "key",
        "kant",
        "answer",
        "particular",
        "förster",
        "explains",
        "intellect",
        "like",
        "discursive",
        "grasp",
        "object",
        "concept",
        "part",
        "assembled",
        "temporallyextended",
        "judgment",
        "mechanistically",
        "alleges",
        "hence",
        "need",
        "concept",
        "purpose",
        "judge",
        "organism",
        "solely",
        "discursive",
        "intellect",
        "however",
        "intuitive",
        "understanding",
        "could",
        "grasp",
        "organism",
        "without",
        "purposeconcepts",
        "regulative",
        "principle",
        "judging",
        "teleologically",
        "hence",
        "understanding",
        "rthesis",
        "rantithesis",
        "need",
        "true",
        "antinomy",
        "arises",
        "breitenbach",
        "contends",
        "antinomy",
        "solved",
        "rather",
        "dissolved",
        "note",
        "thesis",
        "antithesis",
        "really",
        "contradictory",
        "complementary",
        "govern",
        "reflecting",
        "act",
        "judging",
        "different",
        "context",
        "mechanistic",
        "rthesis",
        "regulates",
        "explanatory",
        "conduct",
        "empirical",
        "biology",
        "whereas",
        "rantithesis",
        "governs",
        "ordinary",
        "judging",
        "living",
        "nature",
        "experienced",
        "everyday",
        "pretheoretical",
        "encounter",
        "two",
        "principle",
        "epitomize",
        "two",
        "different",
        "view",
        "nature",
        "compossible",
        "appear",
        "contradiction",
        "fact",
        "complement",
        "indispensably",
        "mclaughlin",
        "submits",
        "antinomy",
        "arise",
        "simpliciter",
        "special",
        "assumption",
        "viz",
        "everything",
        "nature",
        "objectively",
        "explainable",
        "u",
        "reject",
        "assumption",
        "contradiction",
        "vanishes",
        "insofar",
        "rthesis",
        "rantithesis",
        "true",
        "different",
        "domain",
        "former",
        "hold",
        "phenomenon",
        "explainable",
        "u",
        "latter",
        "phenomenon",
        "explainable",
        "mclaughlin",
        "offer",
        "general",
        "criterion",
        "explicability",
        "u",
        "attributable",
        "kant",
        "however",
        "apart",
        "mechanical",
        "explicability",
        "ginsborg",
        "focus",
        "contradiction",
        "might",
        "resolved",
        "context",
        "scientific",
        "investigation",
        "rather",
        "abstract",
        "general",
        "philosophical",
        "term",
        "building",
        "kant",
        "remark",
        "subordinating",
        "mechanism",
        "teleology",
        "ginsborg",
        "contends",
        "natural",
        "historian",
        "physiologist",
        "may",
        "well",
        "explain",
        "origin",
        "working",
        "organism",
        "mechanistically",
        "purely",
        "physicochemical",
        "law",
        "provided",
        "apply",
        "crude",
        "organized",
        "matter",
        "ie",
        "organic",
        "stuff",
        "already",
        "endowed",
        "formative",
        "drive",
        "generic",
        "disposition",
        "grow",
        "reproduce",
        "selfmaintain",
        "turn",
        "organized",
        "matter",
        "unintelligible",
        "without",
        "appeal",
        "purpose",
        "design",
        "term",
        "thus",
        "biologist",
        "subordinate",
        "mechanism",
        "teleology",
        "antinomic",
        "conflict",
        "removed",
        "interpretive",
        "proposal",
        "collectively",
        "advance",
        "understanding",
        "antinomy",
        "might",
        "defused",
        "share",
        "philosophical",
        "difficulty",
        "spelled",
        "watkins",
        "moreover",
        "construal",
        "heed",
        "close",
        "kant",
        "word",
        "suggest",
        "strongly",
        "solution",
        "relies",
        "indispensably",
        "supersensible",
        "ground",
        "explanatory",
        "principle",
        "located",
        "noumenal",
        "world",
        "ground",
        "could",
        "unite",
        "mechanism",
        "teleology",
        "making",
        "antinomic",
        "thesis",
        "jointly",
        "derivable",
        "explainable",
        "however",
        "since",
        "human",
        "positive",
        "determinate",
        "knowledge",
        "supersensible",
        "entity",
        "antinomy",
        "solvable",
        "principle",
        "rather",
        "solved",
        "fact",
        "kant",
        "least",
        "official",
        "solution",
        "seem",
        "provide",
        "detail",
        "actual",
        "account",
        "conflict",
        "heart",
        "biological",
        "explanation",
        "removed",
        "limitation",
        "beset",
        "understanding",
        "kant",
        "philosophy",
        "biology",
        "far",
        "expounded",
        "continue",
        "drive",
        "interpretive",
        "effort",
        "cast",
        "light",
        "part",
        "doctrine",
        "exemplified",
        "goy",
        "watkins",
        "forthcoming",
        "addition",
        "work",
        "mentioned",
        "kant",
        "antinomy",
        "teleological",
        "judgment",
        "usefully",
        "discussed",
        "allison",
        "cohen",
        "ginsborg",
        "kreines",
        "steigerwald",
        "zanetti",
        "zumbach",
        "see",
        "also",
        "entry",
        "kant",
        "aesthetic",
        "teleology",
        "encyclopedia"
    ]
}