{
    "main_text": "Kant’s project in the Critique of Pure Reason || Kant’s Copernican revolution in philosophy\n2.2 Kant’s Copernican revolution in philosophy\n\nTo see how Kant attempts to achieve this goal in the\nCritique, it helps to reflect on his grounds for rejecting\nthe Platonism of the Inaugural Dissertation. The\nInaugural Dissertation also tries to reconcile Newtonian\nscience with traditional morality and religion in a way, but its\nstrategy is different from that of the Critique. According to\nthe Inaugural Dissertation, Newtonian science is true of the\nsensible world, to which sensibility gives us access; and the\nunderstanding grasps principles of divine and moral perfection in a\ndistinct intelligible world, which are paradigms for measuring\neverything in the sensible world. So on this view our knowledge of the\nintelligible world is a priori because it does not depend on\nsensibility, and this a priori knowledge furnishes principles for\njudging the sensible world because in some way the sensible world\nitself conforms to or imitates the intelligible world.\n\nSoon after writing the Inaugural Dissertation, however, Kant\nexpressed doubts about this view. As he explained in a February 21,\n1772 letter to his friend and former student, Marcus Herz:\n\nIn my dissertation I was content to explain the nature of intellectual\nrepresentations in a merely negative way, namely, to state that they\nwere not modifications of the soul brought about by the object.\nHowever, I silently passed over the further question of how a\nrepresentation that refers to an object without being in any way\naffected by it can be possible…. [B]y what means are these\n[intellectual representations] given to us, if not by the way in which\nthey affect us? And if such intellectual representations depend on our\ninner activity, whence comes the agreement that they are supposed to\nhave with objects – objects that are nevertheless not possibly\nproduced thereby?…[A]s to how my understanding may form for\nitself concepts of things completely a priori, with which concepts the\nthings must necessarily agree, and as to how my understanding may\nformulate real principles concerning the possibility of such concepts,\nwith which principles experience must be in exact agreement and which\nnevertheless are independent of experience – this question, of\nhow the faculty of understanding achieves this conformity with the\nthings themselves, is still left in a state of obscurity.\n(10:130–131)\n\n\nHere Kant entertains doubts about how a priori knowledge of an\nintelligible world would be possible. The position of the\nInaugural Dissertation is that the intelligible world is\nindependent of the human understanding and of the sensible world, both\nof which (in different ways) conform to the intelligible world. But,\nleaving aside questions about what it means for the sensible world to\nconform to an intelligible world, how is it possible for the human\nunderstanding to conform to or grasp an intelligible world? If the\nintelligible world is independent of our understanding, then it seems\nthat we could grasp it only if we are passively affected by it in some\nway. But for Kant sensibility is our passive or receptive capacity to\nbe affected by objects that are independent of us (2:392, A51/B75). So\nthe only way we could grasp an intelligible world that is independent\nof us is through sensibility, which means that our knowledge of it\ncould not be a priori. The pure understanding alone could at best\nenable us to form representations of an intelligible world. But since\nthese intellectual representations would entirely “depend on our\ninner activity,” as Kant says to Herz, we have no good reason to\nbelieve that they would conform to an independent intelligible world.\nSuch a priori intellectual representations could well be figments of\nthe brain that do not correspond to anything independent of the human\nmind. In any case, it is completely mysterious how there might come to\nbe a correspondence between purely intellectual representations and an\nindependent intelligible world.\n\nKant’s strategy in the Critique is similar to that of\nthe Inaugural Dissertation in that both works attempt to\nreconcile modern science with traditional morality and religion by\nrelegating them to distinct sensible and intelligible worlds,\nrespectively. But the Critique gives a far more modest and\nyet revolutionary account of a priori knowledge. As Kant’s\nletter to Herz suggests, the main problem with his view in the\nInaugural Dissertation is that it tries to explain the\npossibility of a priori knowledge about a world that is entirely\nindependent of the human mind. This turned out to be a dead end, and\nKant never again maintained that we can have a priori knowledge about\nan intelligible world precisely because such a world would be entirely\nindependent of us. However, Kant’s revolutionary position in the\nCritique is that we can have a priori knowledge about the\ngeneral structure of the sensible world because it is not entirely\nindependent of the human mind. The sensible world, or the world of\nappearances, is constructed by the human mind from a combination of\nsensory matter that we receive passively and a priori forms that are\nsupplied by our cognitive faculties. We can have a priori knowledge\nonly about aspects of the sensible world that reflect the a priori\nforms supplied by our cognitive faculties. In Kant’s words,\n“we can cognize of things a priori only what we ourselves have\nput into them” (Bxviii). So according to the Critique,\na priori knowledge is possible only if and to the extent that the\nsensible world itself depends on the way the human mind structures its\nexperience.\n\nKant characterizes this new constructivist view of experience in the\nCritique through an analogy with the revolution wrought by\nCopernicus in astronomy:\n\nUp to now it has been assumed that all our cognition must conform to\nthe objects; but all attempts to find out something about them a\npriori through concepts that would extend our cognition have, on this\npresupposition, come to nothing. Hence let us once try whether we do\nnot get farther with the problems of metaphysics by assuming that the\nobjects must conform to our cognition, which would agree better with\nthe requested possibility of an a priori cognition of them, which is\nto establish something about objects before they are given to us. This\nwould be just like the first thoughts of Copernicus, who, when he did\nnot make good progress in the explanation of the celestial motions if\nhe assumed that the entire celestial host revolves around the\nobserver, tried to see if he might not have greater success if he made\nthe observer revolve and left the stars at rest. Now in metaphysics we\ncan try in a similar way regarding the intuition of objects. If\nintuition has to conform to the constitution of the objects, then I do\nnot see how we can know anything of them a priori; but if the object\n(as an object of the senses) conforms to the constitution of our\nfaculty of intuition, then I can very well represent this possibility\nto myself. Yet because I cannot stop with these intuitions, if they\nare to become cognitions, but must refer them as representations to\nsomething as their object and determine this object through them, I\ncan assume either that the concepts through which I bring about this\ndetermination also conform to the objects, and then I am once again in\nthe same difficulty about how I could know anything about them a\npriori, or else I assume that the objects, or what is the same thing,\nthe experience in which alone they can be cognized (as given objects)\nconforms to those concepts, in which case I immediately see an easier\nway out of the difficulty, since experience itself is a kind of\ncognition requiring the understanding, whose rule I have to presuppose\nin myself before any object is given to me, hence a priori, which rule\nis expressed in concepts a priori, to which all objects of experience\nmust therefore necessarily conform, and with which they must agree.\n(Bxvi–xviii)\n\n\nAs this passage suggests, what Kant has changed in the\nCritique is primarily his view about the role and powers of\nthe understanding, since he already held in the Inaugural\nDissertation that sensibility contributes the forms of space and\ntime – which he calls pure (or a priori) intuitions (2:397)\n– to our cognition of the sensible world. But the\nCritique claims that pure understanding too, rather than\ngiving us insight into an intelligible world, is limited to providing\nforms – which he calls pure or a priori concepts – that\nstructure our cognition of the sensible world. So now both sensibility\nand understanding work together to construct cognition of the sensible\nworld, which therefore conforms to the a priori forms that are\nsupplied by our cognitive faculties: the a priori intuitions of\nsensibility and the a priori concepts of the understanding. This\naccount is analogous to the heliocentric revolution of Copernicus in\nastronomy because both require contributions from the observer to be\nfactored into explanations of phenomena, although neither reduces\nphenomena to the contributions of observers\n alone.[6]\n The way celestial phenomena appear to us on earth, according to\nCopernicus, is affected by both the motions of celestial bodies and\nthe motion of the earth, which is not a stationary body around which\neverything else revolves. For Kant, analogously, the phenomena of\nhuman experience depend on both the sensory data that we receive\npassively through sensibility and the way our mind actively processes\nthis data according to its own a priori rules. These rules supply the\ngeneral framework in which the sensible world and all the objects (or\nphenomena) in it appear to us. So the sensible world and its phenomena\nare not entirely independent of the human mind, which contributes its\nbasic structure.\n\nHow does Kant’s Copernican revolution in philosophy improve on\nthe strategy of the Inaugural Dissertation for reconciling\nmodern science with traditional morality and religion? First, it gives\nKant a new and ingenious way of placing modern science on an a priori\nfoundation. He is now in a position to argue that we can have a priori\nknowledge about the basic laws of modern science because those laws\nreflect the human mind’s contribution to structuring our\nexperience. In other words, the sensible world necessarily conforms to\ncertain fundamental laws – such as that every event has a cause\n– because the human mind constructs it according to those laws.\nMoreover, we can identify those laws by reflecting on the conditions\nof possible experience, which reveals that it would be impossible for\nus to experience a world in which, for example, any given event fails\nto have a cause. From this Kant concludes that metaphysics is indeed\npossible in the sense that we can have a priori knowledge that the\nentire sensible world – not just our actual experience, but any\npossible human experience – necessarily conforms to certain\nlaws. Kant calls this immanent metaphysics or the metaphysics of\nexperience, because it deals with the essential principles that are\nimmanent to human experience.\n\nBut, second, if “we can cognize of things a priori only what we\nourselves have put into them,” then we cannot have a priori\nknowledge about things whose existence and nature are entirely\nindependent of the human mind, which Kant calls things in themselves\n(Bxviii). In his words: “[F]rom this deduction of our faculty of\ncognizing a priori […] there emerges a very strange result\n[…], namely that with this faculty we can never get beyond the\nboundaries of possible experience, […and] that such cognition\nreaches appearances only, leaving the thing in itself as something\nactual for itself but uncognized by us” (Bxix–xx). That\nis, Kant’s constructivist foundation for scientific knowledge\nrestricts science to the realm of appearances and implies that\ntranscendent metaphysics – i.e., a priori knowledge of things in\nthemselves that transcend possible human experience – is\nimpossible. In the Critique Kant thus rejects the insight\ninto an intelligible world that he defended in the Inaugural\nDissertation, and he now claims that rejecting knowledge about\nthings in themselves is necessary for reconciling science with\ntraditional morality and religion. This is because he claims that\nbelief in God, freedom, and immortality have a strictly moral basis,\nand yet adopting these beliefs on moral grounds would be unjustified\nif we could know that they were false. “Thus,” Kant says,\n“I had to deny knowledge in order to make room for faith”\n(Bxxx). Restricting knowledge to appearances and relegating God and\nthe soul to an unknowable realm of things in themselves guarantees\nthat it is impossible to disprove claims about God and the freedom or\nimmortality of the soul, which moral arguments may therefore justify\nus in believing. Moreover, the determinism of modern science no longer\nthreatens the freedom required by traditional morality, because\nscience and therefore determinism apply only to appearances, and there\nis room for freedom in the realm of things in themselves, where the\nself or soul is located. We cannot know (theoretically) that we are\nfree, because we cannot know anything about things in themselves. But\nthere are especially strong moral grounds for the belief in human\nfreedom, which acts as “the keystone” supporting other\nmorally grounded beliefs (5:3–4). In this way, Kant replaces\ntranscendent metaphysics with a new practical science that he calls\nthe metaphysics of morals. It thus turns out that two kinds of\nmetaphysics are possible: the metaphysics of experience (or nature)\nand the metaphysics of morals, both of which depend on Kant’s\nCopernican revolution in philosophy.\n",
    "section_title": "2.2 Kant’s Copernican revolution in philosophy",
    "entry_title": "Immanuel Kant",
    "hierarchy_title": "Immanuel Kant || Kant’s project in the Critique of Pure Reason || Kant’s Copernican revolution in philosophy",
    "tokenized_text": [
        "kant",
        "project",
        "critique",
        "pure",
        "reason",
        "kant",
        "copernican",
        "revolution",
        "philosophy",
        "kant",
        "copernican",
        "revolution",
        "philosophy",
        "see",
        "kant",
        "attempt",
        "achieve",
        "goal",
        "critique",
        "help",
        "reflect",
        "ground",
        "rejecting",
        "platonism",
        "inaugural",
        "dissertation",
        "inaugural",
        "dissertation",
        "also",
        "try",
        "reconcile",
        "newtonian",
        "science",
        "traditional",
        "morality",
        "religion",
        "way",
        "strategy",
        "different",
        "critique",
        "according",
        "inaugural",
        "dissertation",
        "newtonian",
        "science",
        "true",
        "sensible",
        "world",
        "sensibility",
        "give",
        "u",
        "access",
        "understanding",
        "grasp",
        "principle",
        "divine",
        "moral",
        "perfection",
        "distinct",
        "intelligible",
        "world",
        "paradigm",
        "measuring",
        "everything",
        "sensible",
        "world",
        "view",
        "knowledge",
        "intelligible",
        "world",
        "priori",
        "depend",
        "sensibility",
        "priori",
        "knowledge",
        "furnishes",
        "principle",
        "judging",
        "sensible",
        "world",
        "way",
        "sensible",
        "world",
        "conforms",
        "imitates",
        "intelligible",
        "world",
        "soon",
        "writing",
        "inaugural",
        "dissertation",
        "however",
        "kant",
        "expressed",
        "doubt",
        "view",
        "explained",
        "february",
        "letter",
        "friend",
        "former",
        "student",
        "marcus",
        "herz",
        "dissertation",
        "content",
        "explain",
        "nature",
        "intellectual",
        "representation",
        "merely",
        "negative",
        "way",
        "namely",
        "state",
        "modification",
        "soul",
        "brought",
        "object",
        "however",
        "silently",
        "passed",
        "question",
        "representation",
        "refers",
        "object",
        "without",
        "way",
        "affected",
        "possible",
        "b",
        "mean",
        "intellectual",
        "representation",
        "given",
        "u",
        "way",
        "affect",
        "u",
        "intellectual",
        "representation",
        "depend",
        "inner",
        "activity",
        "whence",
        "come",
        "agreement",
        "supposed",
        "object",
        "object",
        "nevertheless",
        "possibly",
        "produced",
        "thereby",
        "understanding",
        "may",
        "form",
        "concept",
        "thing",
        "completely",
        "priori",
        "concept",
        "thing",
        "must",
        "necessarily",
        "agree",
        "understanding",
        "may",
        "formulate",
        "real",
        "principle",
        "concerning",
        "possibility",
        "concept",
        "principle",
        "experience",
        "must",
        "exact",
        "agreement",
        "nevertheless",
        "independent",
        "experience",
        "question",
        "faculty",
        "understanding",
        "achieves",
        "conformity",
        "thing",
        "still",
        "left",
        "state",
        "obscurity",
        "kant",
        "entertains",
        "doubt",
        "priori",
        "knowledge",
        "intelligible",
        "world",
        "would",
        "possible",
        "position",
        "inaugural",
        "dissertation",
        "intelligible",
        "world",
        "independent",
        "human",
        "understanding",
        "sensible",
        "world",
        "different",
        "way",
        "conform",
        "intelligible",
        "world",
        "leaving",
        "aside",
        "question",
        "mean",
        "sensible",
        "world",
        "conform",
        "intelligible",
        "world",
        "possible",
        "human",
        "understanding",
        "conform",
        "grasp",
        "intelligible",
        "world",
        "intelligible",
        "world",
        "independent",
        "understanding",
        "seems",
        "could",
        "grasp",
        "passively",
        "affected",
        "way",
        "kant",
        "sensibility",
        "passive",
        "receptive",
        "capacity",
        "affected",
        "object",
        "independent",
        "u",
        "ab",
        "way",
        "could",
        "grasp",
        "intelligible",
        "world",
        "independent",
        "u",
        "sensibility",
        "mean",
        "knowledge",
        "could",
        "priori",
        "pure",
        "understanding",
        "alone",
        "could",
        "best",
        "enable",
        "u",
        "form",
        "representation",
        "intelligible",
        "world",
        "since",
        "intellectual",
        "representation",
        "would",
        "entirely",
        "depend",
        "inner",
        "activity",
        "kant",
        "say",
        "herz",
        "good",
        "reason",
        "believe",
        "would",
        "conform",
        "independent",
        "intelligible",
        "world",
        "priori",
        "intellectual",
        "representation",
        "could",
        "well",
        "figment",
        "brain",
        "correspond",
        "anything",
        "independent",
        "human",
        "mind",
        "case",
        "completely",
        "mysterious",
        "might",
        "come",
        "correspondence",
        "purely",
        "intellectual",
        "representation",
        "independent",
        "intelligible",
        "world",
        "kant",
        "strategy",
        "critique",
        "similar",
        "inaugural",
        "dissertation",
        "work",
        "attempt",
        "reconcile",
        "modern",
        "science",
        "traditional",
        "morality",
        "religion",
        "relegating",
        "distinct",
        "sensible",
        "intelligible",
        "world",
        "respectively",
        "critique",
        "give",
        "far",
        "modest",
        "yet",
        "revolutionary",
        "account",
        "priori",
        "knowledge",
        "kant",
        "letter",
        "herz",
        "suggests",
        "main",
        "problem",
        "view",
        "inaugural",
        "dissertation",
        "try",
        "explain",
        "possibility",
        "priori",
        "knowledge",
        "world",
        "entirely",
        "independent",
        "human",
        "mind",
        "turned",
        "dead",
        "end",
        "kant",
        "never",
        "maintained",
        "priori",
        "knowledge",
        "intelligible",
        "world",
        "precisely",
        "world",
        "would",
        "entirely",
        "independent",
        "u",
        "however",
        "kant",
        "revolutionary",
        "position",
        "critique",
        "priori",
        "knowledge",
        "general",
        "structure",
        "sensible",
        "world",
        "entirely",
        "independent",
        "human",
        "mind",
        "sensible",
        "world",
        "world",
        "appearance",
        "constructed",
        "human",
        "mind",
        "combination",
        "sensory",
        "matter",
        "receive",
        "passively",
        "priori",
        "form",
        "supplied",
        "cognitive",
        "faculty",
        "priori",
        "knowledge",
        "aspect",
        "sensible",
        "world",
        "reflect",
        "priori",
        "form",
        "supplied",
        "cognitive",
        "faculty",
        "kant",
        "word",
        "cognize",
        "thing",
        "priori",
        "put",
        "bxviii",
        "according",
        "critique",
        "priori",
        "knowledge",
        "possible",
        "extent",
        "sensible",
        "world",
        "depends",
        "way",
        "human",
        "mind",
        "structure",
        "experience",
        "kant",
        "characterizes",
        "new",
        "constructivist",
        "view",
        "experience",
        "critique",
        "analogy",
        "revolution",
        "wrought",
        "copernicus",
        "astronomy",
        "assumed",
        "cognition",
        "must",
        "conform",
        "object",
        "attempt",
        "find",
        "something",
        "priori",
        "concept",
        "would",
        "extend",
        "cognition",
        "presupposition",
        "come",
        "nothing",
        "hence",
        "let",
        "u",
        "try",
        "whether",
        "get",
        "farther",
        "problem",
        "metaphysics",
        "assuming",
        "object",
        "must",
        "conform",
        "cognition",
        "would",
        "agree",
        "better",
        "requested",
        "possibility",
        "priori",
        "cognition",
        "establish",
        "something",
        "object",
        "given",
        "u",
        "would",
        "like",
        "first",
        "thought",
        "copernicus",
        "make",
        "good",
        "progress",
        "explanation",
        "celestial",
        "motion",
        "assumed",
        "entire",
        "celestial",
        "host",
        "revolves",
        "around",
        "observer",
        "tried",
        "see",
        "might",
        "greater",
        "success",
        "made",
        "observer",
        "revolve",
        "left",
        "star",
        "rest",
        "metaphysics",
        "try",
        "similar",
        "way",
        "regarding",
        "intuition",
        "object",
        "intuition",
        "conform",
        "constitution",
        "object",
        "see",
        "know",
        "anything",
        "priori",
        "object",
        "object",
        "sens",
        "conforms",
        "constitution",
        "faculty",
        "intuition",
        "well",
        "represent",
        "possibility",
        "yet",
        "stop",
        "intuition",
        "become",
        "cognition",
        "must",
        "refer",
        "representation",
        "something",
        "object",
        "determine",
        "object",
        "assume",
        "either",
        "concept",
        "bring",
        "determination",
        "also",
        "conform",
        "object",
        "difficulty",
        "could",
        "know",
        "anything",
        "priori",
        "else",
        "assume",
        "object",
        "thing",
        "experience",
        "alone",
        "cognized",
        "given",
        "object",
        "conforms",
        "concept",
        "case",
        "immediately",
        "see",
        "easier",
        "way",
        "difficulty",
        "since",
        "experience",
        "kind",
        "cognition",
        "requiring",
        "understanding",
        "whose",
        "rule",
        "presuppose",
        "object",
        "given",
        "hence",
        "priori",
        "rule",
        "expressed",
        "concept",
        "priori",
        "object",
        "experience",
        "must",
        "therefore",
        "necessarily",
        "conform",
        "must",
        "agree",
        "bxvixviii",
        "passage",
        "suggests",
        "kant",
        "changed",
        "critique",
        "primarily",
        "view",
        "role",
        "power",
        "understanding",
        "since",
        "already",
        "held",
        "inaugural",
        "dissertation",
        "sensibility",
        "contributes",
        "form",
        "space",
        "time",
        "call",
        "pure",
        "priori",
        "intuition",
        "cognition",
        "sensible",
        "world",
        "critique",
        "claim",
        "pure",
        "understanding",
        "rather",
        "giving",
        "u",
        "insight",
        "intelligible",
        "world",
        "limited",
        "providing",
        "form",
        "call",
        "pure",
        "priori",
        "concept",
        "structure",
        "cognition",
        "sensible",
        "world",
        "sensibility",
        "understanding",
        "work",
        "together",
        "construct",
        "cognition",
        "sensible",
        "world",
        "therefore",
        "conforms",
        "priori",
        "form",
        "supplied",
        "cognitive",
        "faculty",
        "priori",
        "intuition",
        "sensibility",
        "priori",
        "concept",
        "understanding",
        "account",
        "analogous",
        "heliocentric",
        "revolution",
        "copernicus",
        "astronomy",
        "require",
        "contribution",
        "observer",
        "factored",
        "explanation",
        "phenomenon",
        "although",
        "neither",
        "reduces",
        "phenomenon",
        "contribution",
        "observer",
        "alone",
        "way",
        "celestial",
        "phenomenon",
        "appear",
        "u",
        "earth",
        "according",
        "copernicus",
        "affected",
        "motion",
        "celestial",
        "body",
        "motion",
        "earth",
        "stationary",
        "body",
        "around",
        "everything",
        "else",
        "revolves",
        "kant",
        "analogously",
        "phenomenon",
        "human",
        "experience",
        "depend",
        "sensory",
        "data",
        "receive",
        "passively",
        "sensibility",
        "way",
        "mind",
        "actively",
        "process",
        "data",
        "according",
        "priori",
        "rule",
        "rule",
        "supply",
        "general",
        "framework",
        "sensible",
        "world",
        "object",
        "phenomenon",
        "appear",
        "u",
        "sensible",
        "world",
        "phenomenon",
        "entirely",
        "independent",
        "human",
        "mind",
        "contributes",
        "basic",
        "structure",
        "kant",
        "copernican",
        "revolution",
        "philosophy",
        "improve",
        "strategy",
        "inaugural",
        "dissertation",
        "reconciling",
        "modern",
        "science",
        "traditional",
        "morality",
        "religion",
        "first",
        "give",
        "kant",
        "new",
        "ingenious",
        "way",
        "placing",
        "modern",
        "science",
        "priori",
        "foundation",
        "position",
        "argue",
        "priori",
        "knowledge",
        "basic",
        "law",
        "modern",
        "science",
        "law",
        "reflect",
        "human",
        "mind",
        "contribution",
        "structuring",
        "experience",
        "word",
        "sensible",
        "world",
        "necessarily",
        "conforms",
        "certain",
        "fundamental",
        "law",
        "every",
        "event",
        "cause",
        "human",
        "mind",
        "construct",
        "according",
        "law",
        "moreover",
        "identify",
        "law",
        "reflecting",
        "condition",
        "possible",
        "experience",
        "reveals",
        "would",
        "impossible",
        "u",
        "experience",
        "world",
        "example",
        "given",
        "event",
        "fails",
        "cause",
        "kant",
        "concludes",
        "metaphysics",
        "indeed",
        "possible",
        "sense",
        "priori",
        "knowledge",
        "entire",
        "sensible",
        "world",
        "actual",
        "experience",
        "possible",
        "human",
        "experience",
        "necessarily",
        "conforms",
        "certain",
        "law",
        "kant",
        "call",
        "immanent",
        "metaphysics",
        "metaphysics",
        "experience",
        "deal",
        "essential",
        "principle",
        "immanent",
        "human",
        "experience",
        "second",
        "cognize",
        "thing",
        "priori",
        "put",
        "priori",
        "knowledge",
        "thing",
        "whose",
        "existence",
        "nature",
        "entirely",
        "independent",
        "human",
        "mind",
        "kant",
        "call",
        "thing",
        "bxviii",
        "word",
        "f",
        "rom",
        "deduction",
        "faculty",
        "cognizing",
        "priori",
        "emerges",
        "strange",
        "result",
        "namely",
        "faculty",
        "never",
        "get",
        "beyond",
        "boundary",
        "possible",
        "experience",
        "and",
        "cognition",
        "reach",
        "appearance",
        "leaving",
        "thing",
        "something",
        "actual",
        "uncognized",
        "u",
        "bxixxx",
        "kant",
        "constructivist",
        "foundation",
        "scientific",
        "knowledge",
        "restricts",
        "science",
        "realm",
        "appearance",
        "implies",
        "transcendent",
        "metaphysics",
        "ie",
        "priori",
        "knowledge",
        "thing",
        "transcend",
        "possible",
        "human",
        "experience",
        "impossible",
        "critique",
        "kant",
        "thus",
        "reject",
        "insight",
        "intelligible",
        "world",
        "defended",
        "inaugural",
        "dissertation",
        "claim",
        "rejecting",
        "knowledge",
        "thing",
        "necessary",
        "reconciling",
        "science",
        "traditional",
        "morality",
        "religion",
        "claim",
        "belief",
        "god",
        "freedom",
        "immortality",
        "strictly",
        "moral",
        "basis",
        "yet",
        "adopting",
        "belief",
        "moral",
        "ground",
        "would",
        "unjustified",
        "could",
        "know",
        "false",
        "thus",
        "kant",
        "say",
        "deny",
        "knowledge",
        "order",
        "make",
        "room",
        "faith",
        "bxxx",
        "restricting",
        "knowledge",
        "appearance",
        "relegating",
        "god",
        "soul",
        "unknowable",
        "realm",
        "thing",
        "guarantee",
        "impossible",
        "disprove",
        "claim",
        "god",
        "freedom",
        "immortality",
        "soul",
        "moral",
        "argument",
        "may",
        "therefore",
        "justify",
        "u",
        "believing",
        "moreover",
        "determinism",
        "modern",
        "science",
        "longer",
        "threatens",
        "freedom",
        "required",
        "traditional",
        "morality",
        "science",
        "therefore",
        "determinism",
        "apply",
        "appearance",
        "room",
        "freedom",
        "realm",
        "thing",
        "self",
        "soul",
        "located",
        "know",
        "theoretically",
        "free",
        "know",
        "anything",
        "thing",
        "especially",
        "strong",
        "moral",
        "ground",
        "belief",
        "human",
        "freedom",
        "act",
        "keystone",
        "supporting",
        "morally",
        "grounded",
        "belief",
        "way",
        "kant",
        "replaces",
        "transcendent",
        "metaphysics",
        "new",
        "practical",
        "science",
        "call",
        "metaphysics",
        "moral",
        "thus",
        "turn",
        "two",
        "kind",
        "metaphysics",
        "possible",
        "metaphysics",
        "experience",
        "nature",
        "metaphysics",
        "moral",
        "depend",
        "kant",
        "copernican",
        "revolution",
        "philosophy"
    ]
}