{
    "main_text": "Aims and Methods of Moral Philosophy\n1. Aims and Methods of Moral Philosophy\n\nThe most basic aim of moral philosophy, and so also of the\nGroundwork, is, in Kant’s view, to “seek\nout” the foundational principle of a “metaphysics of\nmorals,” which Kant understands as a system of a priori\nmoral principles that apply the CI to human persons in all times and\ncultures. Kant pursues this project through the first two chapters of\nthe Groundwork. He proceeds by analyzing and elucidating\ncommonsense ideas about morality, including the ideas of a “good\nwill” and “duty”. The point of this first project is\nto come up with a precise statement of the principle or principles on\nwhich all of our ordinary moral judgments are based. The judgments in\nquestion are supposed to be those that any normal, sane, adult human\nbeing would accept on due rational reflection. Nowadays, however, many\nwould regard Kant as being overly optimistic about the depth and\nextent of moral agreement. Perhaps he is best thought of as drawing on\na moral viewpoint that is very widely shared and which contains some\ngeneral judgments that are very deeply held. In any case, he does not\nappear to take himself to be primarily addressing a genuine moral\nskeptic such as those who often populate the works of moral\nphilosophers, that is, someone who doubts that she has any reason to\nact morally and whose moral behavior hinges on a rational proof that\nphilosophers might try to give. For instance, when, in the third and\nfinal chapter of the Groundwork, Kant takes up his second\nfundamental aim, to “establish” this foundational moral\nprinciple as a demand of each person’s own rational will, his\nconclusion apparently falls short of answering those who want a proof\nthat we really are bound by moral requirements. He rests this second\nproject on the position that we — or at least creatures with\nrational wills — possess autonomy. The argument of this second\nproject does often appear to try to reach out to a metaphysical fact\nabout our wills. This has led some readers to the conclusion that he\nis, after all, trying to justify moral requirements by appealing to a\nfact — our autonomy — that even a moral skeptic would have\nto recognize.\n\nKant’s analysis of the common moral concepts of\n“duty” and “good will” led him to believe that\nwe are free and autonomous as long as morality, itself, is not an\nillusion. Yet in the Critique of Pure Reason, Kant also tried\nto show that every event has a cause. Kant recognized that there seems\nto be a deep tension between these two claims: If causal determinism\nis true then, it seems, we cannot have the kind of freedom that\nmorality presupposes, which is “a kind of causality” that\n“can be active, independently of alien causes determining\nit” (G 4:446).\n\nKant thought that the only way to resolve this apparent conflict is to\ndistinguish between phenomena, which is what we know through\nexperience, and noumena, which we can consistently think but\nnot know through experience. Our knowledge and understanding of the\nempirical world, Kant argued, can only arise within the limits of our\nperceptual and cognitive powers. We should not assume, however, that\nwe know all that may be true about “things in themselves,”\nalthough we lack the “intellectual intuition” that would\nbe needed to learn about such things.\n\nThese distinctions, according to Kant, allow us to resolve the\n“antinomy” about free will by interpreting the\n“thesis” that free will is possible as about noumena and\nthe “antithesis” that every event has a cause as about\nphenomena. Morality thus presupposes that agents, in an\nincomprehensible “intelligible world,” are able to make\nthings happen by their own free choices in a “sensible\nworld” in which causal determinism is true.\n\nMany of Kant’s commentators, who are skeptical about these\napparently exorbitant metaphysical claims, have attempted to make\nsense of his discussions of the intelligible and sensible worlds in\nless metaphysically demanding ways. On one interpretation (Hudson\n1994), one and the same act can be described in wholly physical terms\n(as an appearance) and also in irreducibly mental terms (as a thing in\nitself). On this compatibilist picture, all acts are causally\ndetermined, but a free act is one that can be described as determined\nby irreducibly mental causes, and in particular by the causality of\nreason. A second interpretation holds that the intelligible and\nsensible worlds are used as metaphors for two ways of conceiving of\none and the same world (Korsgaard 1996; Allison 1990; Hill 1989a,\n1989b). When we are engaging in scientific or empirical\ninvestigations, we often take up a perspective in which we think of\nthings as subject to natural causation, but when we deliberate, act,\nreason and judge, we often take up a different perspective, in which\nwe think of ourselves and others as agents who are not determined by\nnatural causes. When we take up this latter, practical, standpoint, we\nneed not believe that we or others really are free, in any deep\nmetaphysical sense; we need only operate “under the idea of\nfreedom” (G 4:448). Controversy persists, however, about whether\nKant’s conception of freedom requires a “two worlds”\nor “two perspectives” account of the sensible and\nintelligible worlds (Guyer 1987, 2009; Langton 2001; Kohl 2016; Wood\n1984; Hogan 2009).\n\nAlthough the two most basic aims Kant saw for moral philosophy are to\nseek out and establish the supreme principle of morality, they are\nnot, in Kant’s view, its only aims. Moral philosophy, for Kant,\nis most fundamentally addressed to the first-person, deliberative\nquestion, “What ought I to do?”, and an answer to that\nquestion requires much more than delivering or justifying the\nfundamental principle of morality. We also need some account, based on\nthis principle, of the nature and extent of the specific moral duties\nthat apply to us. To this end, Kant employs his findings from the\nGroundwork in The Metaphysics of Morals, and offers\na categorization of our basic moral duties to ourselves and others. In\naddition, Kant thought that moral philosophy should characterize and\nexplain the demands that morality makes on human psychology and forms\nof human social interaction. These topics, among others, are addressed\nin central chapters of the second Critique, the\nReligion and again in the Metaphysics of Morals, and\nare perhaps given a sustained treatment in Anthropology from a\nPragmatic Point of View. Further, a satisfying answer to the\nquestion of what one ought to do would have to take into account any\npolitical and religious requirements there are. Each of these\nrequirement turn out to be, indirectly at least, also moral\nobligations for Kant, and are discussed in the Metaphysics of\nMorals and in Religion. Finally, moral philosophy should\nsay something about the ultimate end of human endeavor, the Highest\nGood, and its relationship to the moral life. In the Critique of\nPractical Reason, Kant argued that this Highest Good for humanity\nis complete moral virtue together with complete happiness, the former\nbeing the condition of our deserving the latter. Unfortunately, Kant\nnoted, virtue does not ensure wellbeing and may even conflict with it.\nFurther, he thought that there is no real possibility of moral\nperfection in this life and indeed few of us fully deserve the\nhappiness we are lucky enough to enjoy. Reason cannot prove or\ndisprove the existence of Divine Providence, on Kant’s view, nor\nthe immortality of the soul, which seem necessary to rectify these\nthings. Nevertheless, Kant argued, an unlimited amount of time to\nperfect ourselves (immortality) and a commensurate achievement of\nwellbeing (ensured by God) are “postulates” required by\nreason when employed in moral matters.\n\nThroughout his moral works, Kant returns time and again to the\nquestion of the method moral philosophy should employ when pursuing\nthese aims. A basic theme of these discussions is that the fundamental\nphilosophical issues of morality must be addressed a priori,\nthat is, without drawing on observations of human beings and their\nbehavior. Kant’s insistence on an a priori method to\nseek out and establish fundamental moral principles, however, does not\nalways appear to be matched by his own practice. The Metaphysics\nof Morals, for instance, is meant to be based on a\npriori rational principles, but many of the specific duties that\nKant describes, along with some of the arguments he gives in support\nof them, rely on general facts about human beings and our\ncircumstances that are known from experience.\n\nIn one sense, it might seem obvious why Kant insists on an a\npriori method. A “metaphysics of morals” would be,\nmore or less, an account of the nature and structure of moral\nrequirements — in effect, a categorization of duties and values.\nSuch a project would address such questions as, What is a\nduty? What kinds of duties are there? What is the\ngood? What kinds of goods are there?, and so on. These appear\nto be metaphysical questions. Any principle used to provide such\ncategorizations appears to be a principle of metaphysics, in a sense,\nbut Kant did not see them as external moral truths that exist\nindependently of rational agents. Moral requirements, instead, are\nrational principles that tell us what we have overriding reason to do.\nMetaphysical principles of this sort are always sought out and\nestablished by a priori methods.\n\nPerhaps something like this was behind Kant’s thinking. However,\nthe considerations he offers for an a priori method do not\nall obviously draw on this sort of rationale. The following are three\nconsiderations favoring a priori methods that he emphasizes\nrepeatedly.\n\nThe first is that, as Kant and others have conceived of it, ethics\ninitially requires an analysis of our moral concepts. We must\nunderstand the concepts of a “good will”,\n“obligation”, “duty” and so on, as well as\ntheir logical relationships to one another, before we can determine\nwhether our use of these concepts is justified. Given that the\nanalysis of concepts is an a priori matter, to the degree\nthat ethics consists of such an analysis, ethics is a priori\nas a well.\n\nOf course, even were we to agree with Kant that ethics should begin\nwith analysis, and that analysis is or should be an entirely a\npriori undertaking, this would not explain why all of\nthe fundamental questions of moral philosophy must be pursued a\npriori. Indeed, one of the most important projects of moral\nphilosophy, for Kant, is to show that we, as rational agents, are\nbound by moral requirements and that fully rational agents would\nnecessarily comply with them. Kant admits that his analytical\narguments for the CI are inadequate on their own because the most they\ncan show is that the CI is the supreme principle of morality if\nthere is such a principle. Kant must therefore address the\npossibility that morality itself is an illusion by showing that the CI\nreally is an unconditional requirement of reason that applies to us.\nEven though Kant thought that this project of\n“establishing” the CI must also be carried out a\npriori, he did not think we could pursue this project simply by\nanalyzing our moral concepts or examining the actual behavior of\nothers. What is needed, instead, is a “synthetic”, but\nstill a priori, kind of argument that starts from ideas of\nfreedom and rational agency and critically examines the nature and\nlimits of these capacities.\n\nThis is the second reason Kant held that fundamental issues in ethics\nmust be addressed with an a priori method: The ultimate\nsubject matter of ethics is the nature and content of the principles\nthat necessarily determine a rational will.\n\nFundamental issues in moral philosophy must also be settled a\npriori because of the nature of moral requirements themselves, or\nso Kant thought. This is a third reason he gives for an a priori\nmethod, and it appears to have been of great importance to Kant:\nMoral requirements present themselves as being unconditionally\nnecessary. But an a posteriori method seems ill-suited\nto discovering and establishing what we must do whether we\nfeel like doing it or not; surely such a method could only tell us\nwhat we actually do. So an a posteriori method of\nseeking out and establishing the principle that generates such\nrequirements will not support the presentation of moral\n“oughts” as unconditional necessities. Kant argued that\nempirical observations could only deliver conclusions about, for\ninstance, the relative advantages of moral behavior in various\ncircumstances or how pleasing it might be in our own eyes or the eyes\nof others. Such findings clearly would not support the unconditional\nnecessity of moral requirements. To appeal to a posteriori\nconsiderations would thus result in a tainted conception of moral\nrequirements. It would view them as demands for which compliance is\nnot unconditionally necessary, but rather necessary only if additional\nconsiderations show it to be advantageous, optimific or in some other\nway felicitous. Thus, Kant argued that if moral philosophy is to guard\nagainst undermining the unconditional necessity of obligation in its\nanalysis and defense of moral thought, it must be carried out entirely\na priori.\n",
    "section_title": "1. Aims and Methods of Moral Philosophy",
    "entry_title": "Kant’s Moral Philosophy",
    "hierarchy_title": "Kant’s Moral Philosophy || Aims and Methods of Moral Philosophy",
    "tokenized_text": [
        "aim",
        "method",
        "moral",
        "philosophy",
        "aim",
        "method",
        "moral",
        "philosophy",
        "basic",
        "aim",
        "moral",
        "philosophy",
        "also",
        "groundwork",
        "kant",
        "view",
        "seek",
        "foundational",
        "principle",
        "metaphysics",
        "moral",
        "kant",
        "understands",
        "system",
        "priori",
        "moral",
        "principle",
        "apply",
        "ci",
        "human",
        "person",
        "time",
        "culture",
        "kant",
        "pursues",
        "project",
        "first",
        "two",
        "chapter",
        "groundwork",
        "proceeds",
        "analyzing",
        "elucidating",
        "commonsense",
        "idea",
        "morality",
        "including",
        "idea",
        "good",
        "duty",
        "point",
        "first",
        "project",
        "come",
        "precise",
        "statement",
        "principle",
        "principle",
        "ordinary",
        "moral",
        "judgment",
        "based",
        "judgment",
        "question",
        "supposed",
        "normal",
        "sane",
        "adult",
        "human",
        "would",
        "accept",
        "due",
        "rational",
        "reflection",
        "nowadays",
        "however",
        "many",
        "would",
        "regard",
        "kant",
        "overly",
        "optimistic",
        "depth",
        "extent",
        "moral",
        "agreement",
        "perhaps",
        "best",
        "thought",
        "drawing",
        "moral",
        "viewpoint",
        "widely",
        "shared",
        "contains",
        "general",
        "judgment",
        "deeply",
        "held",
        "case",
        "appear",
        "take",
        "primarily",
        "addressing",
        "genuine",
        "moral",
        "skeptic",
        "often",
        "populate",
        "work",
        "moral",
        "philosopher",
        "someone",
        "doubt",
        "reason",
        "act",
        "morally",
        "whose",
        "moral",
        "behavior",
        "hinge",
        "rational",
        "proof",
        "philosopher",
        "might",
        "try",
        "give",
        "instance",
        "third",
        "final",
        "chapter",
        "groundwork",
        "kant",
        "take",
        "second",
        "fundamental",
        "aim",
        "establish",
        "foundational",
        "moral",
        "principle",
        "demand",
        "person",
        "rational",
        "conclusion",
        "apparently",
        "fall",
        "short",
        "answering",
        "want",
        "proof",
        "really",
        "bound",
        "moral",
        "requirement",
        "rest",
        "second",
        "project",
        "position",
        "least",
        "creature",
        "rational",
        "will",
        "posse",
        "autonomy",
        "argument",
        "second",
        "project",
        "often",
        "appear",
        "try",
        "reach",
        "metaphysical",
        "fact",
        "will",
        "led",
        "reader",
        "conclusion",
        "trying",
        "justify",
        "moral",
        "requirement",
        "appealing",
        "fact",
        "autonomy",
        "even",
        "moral",
        "skeptic",
        "would",
        "recognize",
        "kant",
        "analysis",
        "common",
        "moral",
        "concept",
        "duty",
        "good",
        "led",
        "believe",
        "free",
        "autonomous",
        "long",
        "morality",
        "illusion",
        "yet",
        "critique",
        "pure",
        "reason",
        "kant",
        "also",
        "tried",
        "show",
        "every",
        "event",
        "cause",
        "kant",
        "recognized",
        "seems",
        "deep",
        "tension",
        "two",
        "claim",
        "causal",
        "determinism",
        "true",
        "seems",
        "kind",
        "freedom",
        "morality",
        "presupposes",
        "kind",
        "causality",
        "active",
        "independently",
        "alien",
        "cause",
        "determining",
        "g",
        "kant",
        "thought",
        "way",
        "resolve",
        "apparent",
        "conflict",
        "distinguish",
        "phenomenon",
        "know",
        "experience",
        "noumenon",
        "consistently",
        "think",
        "know",
        "experience",
        "knowledge",
        "understanding",
        "empirical",
        "world",
        "kant",
        "argued",
        "arise",
        "within",
        "limit",
        "perceptual",
        "cognitive",
        "power",
        "assume",
        "however",
        "know",
        "may",
        "true",
        "thing",
        "although",
        "lack",
        "intellectual",
        "intuition",
        "would",
        "needed",
        "learn",
        "thing",
        "distinction",
        "according",
        "kant",
        "allow",
        "u",
        "resolve",
        "antinomy",
        "free",
        "interpreting",
        "thesis",
        "free",
        "possible",
        "noumenon",
        "antithesis",
        "every",
        "event",
        "cause",
        "phenomenon",
        "morality",
        "thus",
        "presupposes",
        "agent",
        "incomprehensible",
        "intelligible",
        "world",
        "able",
        "make",
        "thing",
        "happen",
        "free",
        "choice",
        "sensible",
        "world",
        "causal",
        "determinism",
        "true",
        "many",
        "kant",
        "commentator",
        "skeptical",
        "apparently",
        "exorbitant",
        "metaphysical",
        "claim",
        "attempted",
        "make",
        "sense",
        "discussion",
        "intelligible",
        "sensible",
        "world",
        "le",
        "metaphysically",
        "demanding",
        "way",
        "one",
        "interpretation",
        "hudson",
        "one",
        "act",
        "described",
        "wholly",
        "physical",
        "term",
        "appearance",
        "also",
        "irreducibly",
        "mental",
        "term",
        "thing",
        "compatibilist",
        "picture",
        "act",
        "causally",
        "determined",
        "free",
        "act",
        "one",
        "described",
        "determined",
        "irreducibly",
        "mental",
        "cause",
        "particular",
        "causality",
        "reason",
        "second",
        "interpretation",
        "hold",
        "intelligible",
        "sensible",
        "world",
        "used",
        "metaphor",
        "two",
        "way",
        "conceiving",
        "one",
        "world",
        "korsgaard",
        "allison",
        "hill",
        "a",
        "b",
        "engaging",
        "scientific",
        "empirical",
        "investigation",
        "often",
        "take",
        "perspective",
        "think",
        "thing",
        "subject",
        "natural",
        "causation",
        "deliberate",
        "act",
        "reason",
        "judge",
        "often",
        "take",
        "different",
        "perspective",
        "think",
        "others",
        "agent",
        "determined",
        "natural",
        "cause",
        "take",
        "latter",
        "practical",
        "standpoint",
        "need",
        "believe",
        "others",
        "really",
        "free",
        "deep",
        "metaphysical",
        "sense",
        "need",
        "operate",
        "idea",
        "freedom",
        "g",
        "controversy",
        "persists",
        "however",
        "whether",
        "kant",
        "conception",
        "freedom",
        "requires",
        "two",
        "world",
        "two",
        "perspective",
        "account",
        "sensible",
        "intelligible",
        "world",
        "guyer",
        "langton",
        "kohl",
        "wood",
        "hogan",
        "although",
        "two",
        "basic",
        "aim",
        "kant",
        "saw",
        "moral",
        "philosophy",
        "seek",
        "establish",
        "supreme",
        "principle",
        "morality",
        "kant",
        "view",
        "aim",
        "moral",
        "philosophy",
        "kant",
        "fundamentally",
        "addressed",
        "firstperson",
        "deliberative",
        "question",
        "ought",
        "answer",
        "question",
        "requires",
        "much",
        "delivering",
        "justifying",
        "fundamental",
        "principle",
        "morality",
        "also",
        "need",
        "account",
        "based",
        "principle",
        "nature",
        "extent",
        "specific",
        "moral",
        "duty",
        "apply",
        "u",
        "end",
        "kant",
        "employ",
        "finding",
        "groundwork",
        "metaphysics",
        "moral",
        "offer",
        "categorization",
        "basic",
        "moral",
        "duty",
        "others",
        "addition",
        "kant",
        "thought",
        "moral",
        "philosophy",
        "characterize",
        "explain",
        "demand",
        "morality",
        "make",
        "human",
        "psychology",
        "form",
        "human",
        "social",
        "interaction",
        "topic",
        "among",
        "others",
        "addressed",
        "central",
        "chapter",
        "second",
        "critique",
        "religion",
        "metaphysics",
        "moral",
        "perhaps",
        "given",
        "sustained",
        "treatment",
        "anthropology",
        "pragmatic",
        "point",
        "view",
        "satisfying",
        "answer",
        "question",
        "one",
        "ought",
        "would",
        "take",
        "account",
        "political",
        "religious",
        "requirement",
        "requirement",
        "turn",
        "indirectly",
        "least",
        "also",
        "moral",
        "obligation",
        "kant",
        "discussed",
        "metaphysics",
        "moral",
        "religion",
        "finally",
        "moral",
        "philosophy",
        "say",
        "something",
        "ultimate",
        "end",
        "human",
        "endeavor",
        "highest",
        "good",
        "relationship",
        "moral",
        "life",
        "critique",
        "practical",
        "reason",
        "kant",
        "argued",
        "highest",
        "good",
        "humanity",
        "complete",
        "moral",
        "virtue",
        "together",
        "complete",
        "happiness",
        "former",
        "condition",
        "deserving",
        "latter",
        "unfortunately",
        "kant",
        "noted",
        "virtue",
        "ensure",
        "wellbeing",
        "may",
        "even",
        "conflict",
        "thought",
        "real",
        "possibility",
        "moral",
        "perfection",
        "life",
        "indeed",
        "u",
        "fully",
        "deserve",
        "happiness",
        "lucky",
        "enough",
        "enjoy",
        "reason",
        "prove",
        "disprove",
        "existence",
        "divine",
        "providence",
        "kant",
        "view",
        "immortality",
        "soul",
        "seem",
        "necessary",
        "rectify",
        "thing",
        "nevertheless",
        "kant",
        "argued",
        "unlimited",
        "amount",
        "time",
        "perfect",
        "immortality",
        "commensurate",
        "achievement",
        "wellbeing",
        "ensured",
        "god",
        "postulate",
        "required",
        "reason",
        "employed",
        "moral",
        "matter",
        "throughout",
        "moral",
        "work",
        "kant",
        "return",
        "time",
        "question",
        "method",
        "moral",
        "philosophy",
        "employ",
        "pursuing",
        "aim",
        "basic",
        "theme",
        "discussion",
        "fundamental",
        "philosophical",
        "issue",
        "morality",
        "must",
        "addressed",
        "priori",
        "without",
        "drawing",
        "observation",
        "human",
        "being",
        "behavior",
        "kant",
        "insistence",
        "priori",
        "method",
        "seek",
        "establish",
        "fundamental",
        "moral",
        "principle",
        "however",
        "always",
        "appear",
        "matched",
        "practice",
        "metaphysics",
        "moral",
        "instance",
        "meant",
        "based",
        "priori",
        "rational",
        "principle",
        "many",
        "specific",
        "duty",
        "kant",
        "describes",
        "along",
        "argument",
        "give",
        "support",
        "rely",
        "general",
        "fact",
        "human",
        "being",
        "circumstance",
        "known",
        "experience",
        "one",
        "sense",
        "might",
        "seem",
        "obvious",
        "kant",
        "insists",
        "priori",
        "method",
        "metaphysics",
        "moral",
        "would",
        "le",
        "account",
        "nature",
        "structure",
        "moral",
        "requirement",
        "effect",
        "categorization",
        "duty",
        "value",
        "project",
        "would",
        "address",
        "question",
        "duty",
        "kind",
        "duty",
        "good",
        "kind",
        "good",
        "appear",
        "metaphysical",
        "question",
        "principle",
        "used",
        "provide",
        "categorization",
        "appears",
        "principle",
        "metaphysics",
        "sense",
        "kant",
        "see",
        "external",
        "moral",
        "truth",
        "exist",
        "independently",
        "rational",
        "agent",
        "moral",
        "requirement",
        "instead",
        "rational",
        "principle",
        "tell",
        "u",
        "overriding",
        "reason",
        "metaphysical",
        "principle",
        "sort",
        "always",
        "sought",
        "established",
        "priori",
        "method",
        "perhaps",
        "something",
        "like",
        "behind",
        "kant",
        "thinking",
        "however",
        "consideration",
        "offer",
        "priori",
        "method",
        "obviously",
        "draw",
        "sort",
        "rationale",
        "following",
        "three",
        "consideration",
        "favoring",
        "priori",
        "method",
        "emphasizes",
        "repeatedly",
        "first",
        "kant",
        "others",
        "conceived",
        "ethic",
        "initially",
        "requires",
        "analysis",
        "moral",
        "concept",
        "must",
        "understand",
        "concept",
        "good",
        "obligation",
        "duty",
        "well",
        "logical",
        "relationship",
        "one",
        "another",
        "determine",
        "whether",
        "use",
        "concept",
        "justified",
        "given",
        "analysis",
        "concept",
        "priori",
        "matter",
        "degree",
        "ethic",
        "consists",
        "analysis",
        "ethic",
        "priori",
        "well",
        "course",
        "even",
        "agree",
        "kant",
        "ethic",
        "begin",
        "analysis",
        "analysis",
        "entirely",
        "priori",
        "undertaking",
        "would",
        "explain",
        "fundamental",
        "question",
        "moral",
        "philosophy",
        "must",
        "pursued",
        "priori",
        "indeed",
        "one",
        "important",
        "project",
        "moral",
        "philosophy",
        "kant",
        "show",
        "rational",
        "agent",
        "bound",
        "moral",
        "requirement",
        "fully",
        "rational",
        "agent",
        "would",
        "necessarily",
        "comply",
        "kant",
        "admits",
        "analytical",
        "argument",
        "ci",
        "inadequate",
        "show",
        "ci",
        "supreme",
        "principle",
        "morality",
        "principle",
        "kant",
        "must",
        "therefore",
        "address",
        "possibility",
        "morality",
        "illusion",
        "showing",
        "ci",
        "really",
        "unconditional",
        "requirement",
        "reason",
        "applies",
        "u",
        "even",
        "though",
        "kant",
        "thought",
        "project",
        "establishing",
        "ci",
        "must",
        "also",
        "carried",
        "priori",
        "think",
        "could",
        "pursue",
        "project",
        "simply",
        "analyzing",
        "moral",
        "concept",
        "examining",
        "actual",
        "behavior",
        "others",
        "needed",
        "instead",
        "synthetic",
        "still",
        "priori",
        "kind",
        "argument",
        "start",
        "idea",
        "freedom",
        "rational",
        "agency",
        "critically",
        "examines",
        "nature",
        "limit",
        "capacity",
        "second",
        "reason",
        "kant",
        "held",
        "fundamental",
        "issue",
        "ethic",
        "must",
        "addressed",
        "priori",
        "method",
        "ultimate",
        "subject",
        "matter",
        "ethic",
        "nature",
        "content",
        "principle",
        "necessarily",
        "determine",
        "rational",
        "fundamental",
        "issue",
        "moral",
        "philosophy",
        "must",
        "also",
        "settled",
        "priori",
        "nature",
        "moral",
        "requirement",
        "kant",
        "thought",
        "third",
        "reason",
        "give",
        "priori",
        "method",
        "appears",
        "great",
        "importance",
        "kant",
        "moral",
        "requirement",
        "present",
        "unconditionally",
        "necessary",
        "posteriori",
        "method",
        "seems",
        "illsuited",
        "discovering",
        "establishing",
        "must",
        "whether",
        "feel",
        "like",
        "surely",
        "method",
        "could",
        "tell",
        "u",
        "actually",
        "posteriori",
        "method",
        "seeking",
        "establishing",
        "principle",
        "generates",
        "requirement",
        "support",
        "presentation",
        "moral",
        "oughts",
        "unconditional",
        "necessity",
        "kant",
        "argued",
        "empirical",
        "observation",
        "could",
        "deliver",
        "conclusion",
        "instance",
        "relative",
        "advantage",
        "moral",
        "behavior",
        "various",
        "circumstance",
        "pleasing",
        "might",
        "eye",
        "eye",
        "others",
        "finding",
        "clearly",
        "would",
        "support",
        "unconditional",
        "necessity",
        "moral",
        "requirement",
        "appeal",
        "posteriori",
        "consideration",
        "would",
        "thus",
        "result",
        "tainted",
        "conception",
        "moral",
        "requirement",
        "would",
        "view",
        "demand",
        "compliance",
        "unconditionally",
        "necessary",
        "rather",
        "necessary",
        "additional",
        "consideration",
        "show",
        "advantageous",
        "optimific",
        "way",
        "felicitous",
        "thus",
        "kant",
        "argued",
        "moral",
        "philosophy",
        "guard",
        "undermining",
        "unconditional",
        "necessity",
        "obligation",
        "analysis",
        "defense",
        "moral",
        "thought",
        "must",
        "carried",
        "entirely",
        "priori"
    ]
}