{
    "main_text": "The “Metaphysical Exposition” || The origin of our representation of space\n3.2 The origin of our representation of space\n\nIn the first argument of the Metaphysical Exposition, Kant suggests\nthat the representation of space cannot be empirical:\n\n1. Space is not an empirical concept which has been derived from outer\nexperiences. For in order that certain sensations be referred to\nsomething outside me (that is, to something in another region of space\nfrom that in which I find myself), and similarly in order that I may\nbe able to represent them as outside and alongside one another, and\naccordingly as not only different but as in different places, the\nrepresentation of space must already underlie them [dazu muß die\nVorstellung des Raumes schon zum Grunde liegen]. Therefore, the\nrepresentation of space cannot be obtained through experience from the\nrelations of outer appearance; this outer experience is itself\npossible at all only through that representation (A23/B38).\n\n\nOne might wonder what type of view is at issue here. One potential\ntarget is a classic empiricist account of our idea of space, such as\nthat found in Locke. Acknowledging in the Essay that the idea\nof space seems to be “remote” from our perception of\nobjects, Locke contends nonetheless that its origin lies in experience\n(Essay, 2.13.2–4): perceivers observe objects in close\nproximity to one another, including the distance between objects, and\nthen repeatedly add the ideas of these distances together, thereby\nobtaining an idea of as large a single space as they please. According\nto Locke’s view, a version of which was also defended by Hume\n(Treatise, 1.2.3), we obtain a representation of\nspace—not of places, but of the one all-encompassing space,\nwhich may be akin to geometric space—from the\nperception of spatial relations.\n\nKant may be focusing attention on the starting place of Locke’s\nview. It seems that for Locke, we begin with an idea of the distance\nbetween any two bodies; this would presumably involve an idea of these\ntwo bodies as being in different places. Kant may be contending that\nin order to represent objects as in different places from one another,\nI must represent them as in space. But if this were true, then I would\nalready have, as it were, the representation of space, and therefore\ncould not obtain it in the way Locke outlines.\n\nDaniel Warren clarifies this argument in an especially helpful way\n(Warren 1998; cf. Allison 2004, 100–104). Certainly, it is not true in\ngeneral that in any order to represent any two entities, A and B, as\nrelated in some way, I must represent them as falling into a larger\n“space” of some relevant character. Warren gives a useful\nexample: in order to represent A as “brighter than” B, I\nneed not represent A and B as being part of a larger\n“brightness” space. I could do so: I could\nrepresent A and B via the “brightness” relation precisely\nby representing A as lying at one end of a brightness spectrum, and B\nas lying near its other end. But I need not do so: I could simply\nrepresent A and B themselves, and represent A as brighter than B, as I\nmight do with two lights (Warren 1998, 200ff). The suggestion\nis that in order to represent A and B as bearing a spatial\nrelation with one another—say, to represent them as being some\ndistance apart—I must represent A and B as in space. In\nthat sense, the representation of objects as spatially related may\npresuppose the representation of space. The problem for Locke is that\nhe begins with my perception, or idea, of a distance between two\nobjects, and then proceeds to construct my idea of space from that\ninitial point. But if my representation of a distance relation between\nany two objects already presupposes a representation of those objects\nas in space, then the former cannot be the beginning point of a\nprocess that issues in the latter. Some commentators have noted\nthat Locke—or another classical empiricist—may not be the\nonly focus for Kant’s first argument. At some moments, Leibniz\nseems committed to the view that the representation of space is\nconstructed from particular perceptions of distance relations (and the\nlike). For instance, in a famous passage in his final letter to\nClarke, Leibniz claims that in order to obtain a representation of\nspace, one can consider a system of objects, some of which are in\nmotion, and abstract the notion same place from that\n system.[9]\n For A and B to occupy the same place is for them to have the same\nrelation to the same bodies in space at different times. Space is what\nencompasses all such\n places.[10]\n Kant’s first argument may have some bite against the view in\nthis passage as well. Whether Kant’s argument also undermines\nLeibniz’s relationalism about space is a separate issue, and a\nmatter of\n controversy.[11]\n\nSome commentators have thought that Kant’s second argument in\nthe Metaphysical Exposition is intended specifically to undermine\nLeibniz’s relationalism (cf. Parsons 1992, 68–9):\n\n2. Space is a necessary a priori representation that\nunderlies all outer intuitions. One can never forge a representation\nof the absence of space, though one can quite well think that no\nthings are to be met within it. It must therefore be regarded as the\ncondition of the possibility of appearances, and not as a\ndetermination dependent upon them, and it is an a priori\nrepresentation that necessarily underlies outer appearances.\n(A24/B38–9)\n\n\nKant claims that although we can represent space as empty, we cannot\nrepresent to ourselves the absence of space. This point would\nundermine Leibnizian relationalism if the relationalist claim that\nspace is not independent of objects is, at least in part, founded on\nthe claim that the very idea of space existing independently of\nobjects is incoherent. If one held such a view, one could raise doubts\nabout relationalism by contending, as Kant does, that we can in fact\nconceive of space to be devoid of objects.\n\nThe view that space cannot exist independently of objects at any given\ninstant does seem to entail that space cannot be utterly devoid of\nobjects. Leibniz thinks that space is the order of the actual and\npossible relations among objects, so he has the resources to\nsay that space can contain empty sectors—see New\nEssays, 127, and L 5: 43—but it seems he cannot claim that\nspace is altogether empty, for then object relations would be\nabsent. Yet this view seems perfectly compatible with the idea that we\ncan conceive of empty space. Leibniz himself makes repeated\nand explicit use of the thought of such a situation when attempting to\nundermine the Newtonian view that space is absolute. Instead of\narguing that the idea that space could be independent of objects is\nincoherent, Leibniz contends that it violates the principle of\nsufficient reason (see L3: 5; L 5: 53), a principle Clarke himself\ndefends in a distinct version. The “fiction” (L5: 29; cf.\nL5: 55) that space could exist independently of objects violates the\nprinciple because the homogeneity and uniformity of space prevent\nthere from being any reason for God to place the objects of the\nuniverse with one particular orientation within absolute space rather\nthan with any other possible orientation. The idea that God could\nplace objects within a pre-existing absolute space with one\norientation rather than another is evidently not incoherent; rather,\nGod would lack a reason for doing this. Similarly, Leibniz\ncontends that absolutism violates the principle of the identity of\nindiscernibles (L4: 16) and that it bears theological difficulties\n(L4: 10).\n\nThis is not to deny that Leibniz’s relationalism intersects with\nhis understanding of the representation of space. He thinks that we\nmust not be fooled by the fact that we can think of space as empty of\nobjects into concluding that space itself is something independent of\nobjects and their relations. As with all mere abstractions, we must\nnot reify\n space.[12]\n\nOne might read Kant’s second argument instead as\nstraightforwardly targeting the view that the representation of space\nis empirical. Kant claims that we cannot represent the absence of\nspace, but that we can represent space as empty of objects. His point\nmay be that empiricist philosophers who contend that the\nrepresentation of space is obtained from the perception of objects\nmust bear the burden of explaining how it is possible for us to\nconceive of space as empty of such objects. This consideration appears\nto be rather weak. But the further contention that one cannot\nrepresent the absence of space may be more difficult for an empiricist\nto accept. Prima facie, it is difficult to see why, if our\nrepresentation of space is indeed empirical in origin, we should lack\nthe ability to conceive of space’s absence. This might\nbe read as Kant’s prima facie point against an\nempiricist view of the representation of space.\n\nIn these first two arguments, Kant considers, perhaps among other\nthings, the origin of our representation of space, concluding that it\nis not empirical. It seems, though, that these first two arguments\nleave open the question of the content of our representation\nof space in two important senses. First, Kant’s first two\narguments do not explicate what properties we represent space as\nhaving. Do we represent it, for instance, as finite or infinite, as\nhomogeneous or not? And so on. Second, the first two arguments in the\nTranscendental Aesthetic apparently leave it open that the content of\nour representation of space could be conceptual. That is, they leave\nit open that our representation of space could be a concept, rather\nthan an intuition—it could be either a general, mediate\nrepresentation, or a singular, immediate one. We simply know—if\nKant’s arguments are successful—that the representation is\nnot empirical. And Kant certainly thinks that a non-empirical\nrepresentation could be either a concept or an intuition; that is, he\nthinks that we have both a priori concepts and pure\nintuition. Since the idea of pure intuition is puzzling in a way that\nthe idea of an a priori concept may not be, one interpretive\ngoal is to clarify this idea in the course of understanding the second\ntwo arguments of the Metaphysical Exposition.\n",
    "section_title": "3.2 The origin of our representation of space",
    "entry_title": "Kant’s Views on Space and Time",
    "hierarchy_title": "Kant’s Views on Space and Time || The “Metaphysical Exposition” || The origin of our representation of space",
    "tokenized_text": [
        "metaphysical",
        "exposition",
        "origin",
        "representation",
        "space",
        "origin",
        "representation",
        "space",
        "first",
        "argument",
        "metaphysical",
        "exposition",
        "kant",
        "suggests",
        "representation",
        "space",
        "empirical",
        "space",
        "empirical",
        "concept",
        "derived",
        "outer",
        "experience",
        "order",
        "certain",
        "sensation",
        "referred",
        "something",
        "outside",
        "something",
        "another",
        "region",
        "space",
        "find",
        "similarly",
        "order",
        "may",
        "able",
        "represent",
        "outside",
        "alongside",
        "one",
        "another",
        "accordingly",
        "different",
        "different",
        "place",
        "representation",
        "space",
        "must",
        "already",
        "underlie",
        "dazu",
        "muß",
        "die",
        "vorstellung",
        "de",
        "raumes",
        "schon",
        "zum",
        "grunde",
        "liegen",
        "therefore",
        "representation",
        "space",
        "obtained",
        "experience",
        "relation",
        "outer",
        "appearance",
        "outer",
        "experience",
        "possible",
        "representation",
        "ab",
        "one",
        "might",
        "wonder",
        "type",
        "view",
        "issue",
        "one",
        "potential",
        "target",
        "classic",
        "empiricist",
        "account",
        "idea",
        "space",
        "found",
        "locke",
        "acknowledging",
        "essay",
        "idea",
        "space",
        "seems",
        "remote",
        "perception",
        "object",
        "locke",
        "contends",
        "nonetheless",
        "origin",
        "lie",
        "experience",
        "essay",
        "perceiver",
        "observe",
        "object",
        "close",
        "proximity",
        "one",
        "another",
        "including",
        "distance",
        "object",
        "repeatedly",
        "add",
        "idea",
        "distance",
        "together",
        "thereby",
        "obtaining",
        "idea",
        "large",
        "single",
        "space",
        "please",
        "according",
        "locke",
        "view",
        "version",
        "also",
        "defended",
        "hume",
        "treatise",
        "obtain",
        "representation",
        "spacenot",
        "place",
        "one",
        "allencompassing",
        "space",
        "may",
        "akin",
        "geometric",
        "spacefrom",
        "perception",
        "spatial",
        "relation",
        "kant",
        "may",
        "focusing",
        "attention",
        "starting",
        "place",
        "locke",
        "view",
        "seems",
        "locke",
        "begin",
        "idea",
        "distance",
        "two",
        "body",
        "would",
        "presumably",
        "involve",
        "idea",
        "two",
        "body",
        "different",
        "place",
        "kant",
        "may",
        "contending",
        "order",
        "represent",
        "object",
        "different",
        "place",
        "one",
        "another",
        "must",
        "represent",
        "space",
        "true",
        "would",
        "already",
        "representation",
        "space",
        "therefore",
        "could",
        "obtain",
        "way",
        "locke",
        "outline",
        "daniel",
        "warren",
        "clarifies",
        "argument",
        "especially",
        "helpful",
        "way",
        "warren",
        "cf",
        "allison",
        "certainly",
        "true",
        "general",
        "order",
        "represent",
        "two",
        "entity",
        "b",
        "related",
        "way",
        "must",
        "represent",
        "falling",
        "larger",
        "space",
        "relevant",
        "character",
        "warren",
        "give",
        "useful",
        "example",
        "order",
        "represent",
        "brighter",
        "b",
        "need",
        "represent",
        "b",
        "part",
        "larger",
        "brightness",
        "space",
        "could",
        "could",
        "represent",
        "b",
        "via",
        "brightness",
        "relation",
        "precisely",
        "representing",
        "lying",
        "one",
        "end",
        "brightness",
        "spectrum",
        "b",
        "lying",
        "near",
        "end",
        "need",
        "could",
        "simply",
        "represent",
        "b",
        "represent",
        "brighter",
        "b",
        "might",
        "two",
        "light",
        "warren",
        "ff",
        "suggestion",
        "order",
        "represent",
        "b",
        "bearing",
        "spatial",
        "relation",
        "one",
        "anothersay",
        "represent",
        "distance",
        "aparti",
        "must",
        "represent",
        "b",
        "space",
        "sense",
        "representation",
        "object",
        "spatially",
        "related",
        "may",
        "presuppose",
        "representation",
        "space",
        "problem",
        "locke",
        "begin",
        "perception",
        "idea",
        "distance",
        "two",
        "object",
        "proceeds",
        "construct",
        "idea",
        "space",
        "initial",
        "point",
        "representation",
        "distance",
        "relation",
        "two",
        "object",
        "already",
        "presupposes",
        "representation",
        "object",
        "space",
        "former",
        "beginning",
        "point",
        "process",
        "issue",
        "latter",
        "commentator",
        "noted",
        "lockeor",
        "another",
        "classical",
        "empiricistmay",
        "focus",
        "kant",
        "first",
        "argument",
        "moment",
        "leibniz",
        "seems",
        "committed",
        "view",
        "representation",
        "space",
        "constructed",
        "particular",
        "perception",
        "distance",
        "relation",
        "like",
        "instance",
        "famous",
        "passage",
        "final",
        "letter",
        "clarke",
        "leibniz",
        "claim",
        "order",
        "obtain",
        "representation",
        "space",
        "one",
        "consider",
        "system",
        "object",
        "motion",
        "abstract",
        "notion",
        "place",
        "system",
        "b",
        "occupy",
        "place",
        "relation",
        "body",
        "space",
        "different",
        "time",
        "space",
        "encompasses",
        "place",
        "kant",
        "first",
        "argument",
        "may",
        "bite",
        "view",
        "passage",
        "well",
        "whether",
        "kant",
        "argument",
        "also",
        "undermines",
        "leibniz",
        "relationalism",
        "space",
        "separate",
        "issue",
        "matter",
        "controversy",
        "commentator",
        "thought",
        "kant",
        "second",
        "argument",
        "metaphysical",
        "exposition",
        "intended",
        "specifically",
        "undermine",
        "leibniz",
        "relationalism",
        "cf",
        "parson",
        "space",
        "necessary",
        "priori",
        "representation",
        "underlies",
        "outer",
        "intuition",
        "one",
        "never",
        "forge",
        "representation",
        "absence",
        "space",
        "though",
        "one",
        "quite",
        "well",
        "think",
        "thing",
        "met",
        "within",
        "must",
        "therefore",
        "regarded",
        "condition",
        "possibility",
        "appearance",
        "determination",
        "dependent",
        "upon",
        "priori",
        "representation",
        "necessarily",
        "underlies",
        "outer",
        "appearance",
        "ab",
        "kant",
        "claim",
        "although",
        "represent",
        "space",
        "empty",
        "represent",
        "absence",
        "space",
        "point",
        "would",
        "undermine",
        "leibnizian",
        "relationalism",
        "relationalist",
        "claim",
        "space",
        "independent",
        "object",
        "least",
        "part",
        "founded",
        "claim",
        "idea",
        "space",
        "existing",
        "independently",
        "object",
        "incoherent",
        "one",
        "held",
        "view",
        "one",
        "could",
        "raise",
        "doubt",
        "relationalism",
        "contending",
        "kant",
        "fact",
        "conceive",
        "space",
        "devoid",
        "object",
        "view",
        "space",
        "exist",
        "independently",
        "object",
        "given",
        "instant",
        "seem",
        "entail",
        "space",
        "utterly",
        "devoid",
        "object",
        "leibniz",
        "think",
        "space",
        "order",
        "actual",
        "possible",
        "relation",
        "among",
        "object",
        "resource",
        "say",
        "space",
        "contain",
        "empty",
        "sectorssee",
        "new",
        "essay",
        "l",
        "but",
        "seems",
        "claim",
        "space",
        "altogether",
        "empty",
        "object",
        "relation",
        "would",
        "absent",
        "yet",
        "view",
        "seems",
        "perfectly",
        "compatible",
        "idea",
        "conceive",
        "empty",
        "space",
        "leibniz",
        "make",
        "repeated",
        "explicit",
        "use",
        "thought",
        "situation",
        "attempting",
        "undermine",
        "newtonian",
        "view",
        "space",
        "absolute",
        "instead",
        "arguing",
        "idea",
        "space",
        "could",
        "independent",
        "object",
        "incoherent",
        "leibniz",
        "contends",
        "violates",
        "principle",
        "sufficient",
        "reason",
        "see",
        "l",
        "l",
        "principle",
        "clarke",
        "defends",
        "distinct",
        "version",
        "fiction",
        "l",
        "cf",
        "l",
        "space",
        "could",
        "exist",
        "independently",
        "object",
        "violates",
        "principle",
        "homogeneity",
        "uniformity",
        "space",
        "prevent",
        "reason",
        "god",
        "place",
        "object",
        "universe",
        "one",
        "particular",
        "orientation",
        "within",
        "absolute",
        "space",
        "rather",
        "possible",
        "orientation",
        "idea",
        "god",
        "could",
        "place",
        "object",
        "within",
        "preexisting",
        "absolute",
        "space",
        "one",
        "orientation",
        "rather",
        "another",
        "evidently",
        "incoherent",
        "rather",
        "god",
        "would",
        "lack",
        "reason",
        "similarly",
        "leibniz",
        "contends",
        "absolutism",
        "violates",
        "principle",
        "identity",
        "indiscernibles",
        "l",
        "bear",
        "theological",
        "difficulty",
        "l",
        "deny",
        "leibniz",
        "relationalism",
        "intersects",
        "understanding",
        "representation",
        "space",
        "think",
        "must",
        "fooled",
        "fact",
        "think",
        "space",
        "empty",
        "object",
        "concluding",
        "space",
        "something",
        "independent",
        "object",
        "relation",
        "mere",
        "abstraction",
        "must",
        "reify",
        "space",
        "one",
        "might",
        "read",
        "kant",
        "second",
        "argument",
        "instead",
        "straightforwardly",
        "targeting",
        "view",
        "representation",
        "space",
        "empirical",
        "kant",
        "claim",
        "represent",
        "absence",
        "space",
        "represent",
        "space",
        "empty",
        "object",
        "point",
        "may",
        "empiricist",
        "philosopher",
        "contend",
        "representation",
        "space",
        "obtained",
        "perception",
        "object",
        "must",
        "bear",
        "burden",
        "explaining",
        "possible",
        "u",
        "conceive",
        "space",
        "empty",
        "object",
        "consideration",
        "appears",
        "rather",
        "weak",
        "contention",
        "one",
        "represent",
        "absence",
        "space",
        "may",
        "difficult",
        "empiricist",
        "accept",
        "prima",
        "facie",
        "difficult",
        "see",
        "representation",
        "space",
        "indeed",
        "empirical",
        "origin",
        "lack",
        "ability",
        "conceive",
        "space",
        "absence",
        "might",
        "read",
        "kant",
        "prima",
        "facie",
        "point",
        "empiricist",
        "view",
        "representation",
        "space",
        "first",
        "two",
        "argument",
        "kant",
        "considers",
        "perhaps",
        "among",
        "thing",
        "origin",
        "representation",
        "space",
        "concluding",
        "empirical",
        "seems",
        "though",
        "first",
        "two",
        "argument",
        "leave",
        "open",
        "question",
        "content",
        "representation",
        "space",
        "two",
        "important",
        "sens",
        "first",
        "kant",
        "first",
        "two",
        "argument",
        "explicate",
        "property",
        "represent",
        "space",
        "represent",
        "instance",
        "finite",
        "infinite",
        "homogeneous",
        "second",
        "first",
        "two",
        "argument",
        "transcendental",
        "aesthetic",
        "apparently",
        "leave",
        "open",
        "content",
        "representation",
        "space",
        "could",
        "conceptual",
        "leave",
        "open",
        "representation",
        "space",
        "could",
        "concept",
        "rather",
        "intuitionit",
        "could",
        "either",
        "general",
        "mediate",
        "representation",
        "singular",
        "immediate",
        "one",
        "simply",
        "knowif",
        "kant",
        "argument",
        "successfulthat",
        "representation",
        "empirical",
        "kant",
        "certainly",
        "think",
        "nonempirical",
        "representation",
        "could",
        "either",
        "concept",
        "intuition",
        "think",
        "priori",
        "concept",
        "pure",
        "intuition",
        "since",
        "idea",
        "pure",
        "intuition",
        "puzzling",
        "way",
        "idea",
        "priori",
        "concept",
        "may",
        "one",
        "interpretive",
        "goal",
        "clarify",
        "idea",
        "course",
        "understanding",
        "second",
        "two",
        "argument",
        "metaphysical",
        "exposition"
    ]
}