{
    "main_text": "Reinhold’s Life and Work\n1. Reinhold’s Life and Work\n\nKarl Leonhard Reinhold was born in Vienna October 26, 1757 (though\nmany older sources erroneously give 1758 as his year of his birth). He\nstudied at the Jesuit Seminary in Vienna for a year, until the order\nwas suppressed in 1773, at which time he entered the Barnabite\nseminary. Following his ordination, he became a Barnabite monk and\nserved for several years as a parish priest and teacher of philosophy.\nReinhold’s first publications were book reviews and short essays\nin popular newspapers, in which he showed himself to be a zealous\nadvocate of Josephite reforms and an enthusiastic exponent of radical\nEnlightenment and religious toleration.\n\nIn 1783 Reinhold moved to Leipzig and converted to Protestantism. He\nalso became a Freemason and a member of the Illuminati, and\nhe remained an active Freemason until the end of his life. Possessed\nof a restless, inquiring spirit, Reinhold’s early intellectual\ntrajectory led him from orthodox Catholicism, to reformed Catholicism,\nto materialism and atheism, and then to Leibnizianism and to Humean\nskepticism. Yet he always remained true to the ideal of\n“Enlightenment,” at least as he understood that ideal, and\nhe never ceased to insist that philosophy ought to make a practical\ndifference in the world. For all of his forays into the most technical\nand arcane philosophical debates and issues, he never wavered in his\ninsistence that true “popularity” must remain the goal of\nphilosophy, and that the ultimate test of any system is its capacity\nfor convincing everyone of its truth. Enlightenment, for Reinhold, was\nno abstract pursuit of truth, but a program of religious, moral,\nsocial, and political reform. Coupled with this commitment to\npopularity, was a pedagogic zeal to do everything in his power to\nspread the message of popular Enlightenment—whether in its\nmaterialist, its neo-Leibnizian, its skeptical, its Kantian, its\nFichtean, its Bardilian, or its distinctively\n“Reinholdian” form—as widely and as effectively as\npossible.\n\nIn 1784, after studying philosophy for a semester in Leipzig, Reinhold\nmoved to Weimar, where he became a confidant (and son-in-law) of C. M.\nWieland and a regular contributor to Wieland’s widely read\nDer Teutsche Merkur. It was in this journal that his famous\nseries of “Letters on the Kantian Philosophy” began to\nappear in 1786. It is with these “Letters,” which were\nsubsequently published in revised and expanded form in two volumes,\nthat Reinhold’s name enters the history of philosophy. What\nReinhold found in Kant is clearly expressed in the first of his many\nprivate letters to the latter: namely, a way to resolve the\ndebilitating conflict between faith and reason,\n“superstition” and “disbelief,”\n“heart” and “head.” And this is precisely the\naspect of the new, Critical philosophy that is emphasized in his\nLetters on the Kantian Philosophy: not Kant’s radical\nnew account of space and time, nor his audacious effort to provide a\ntranscendental deduction of the pure categories of the understanding,\nbut rather the conclusions and implications of the\n“transcendental dialectic.”\n\nKantianism was recommended by Reinhold, above all, for its allegedly\nsalubrious and enlightened practical consequences,\nparticularly with respect to religion and morality. It was not for\nnothing that Reinhold described this new philosophy to readers of\nDie Teutscher Merkur as “the gospel of pure\nreason.” Rational belief in God, in the immortality of the soul,\nin the reality of free will: such are the articles of this new\n“gospel”—a gospel promulgated, everyone agreed, far\nmore effectively and popularly by Reinhold than by Kant himself. Even\nKant professed to be charmed by Reinhold’s effort and gratified\nby his success.\n\nOn the strength of his newfound fame as author of the\nLetters, Reinhold was invited to be the inaugural occupant of\nthe first professorial chair devoted exclusively to the new Kantian\nphilosophy, and thus he began lecturing at the University of Jena in\n1787. First at Jena, and then later at the University of Kiel,\nReinhold proved to be an immensely popular and influential teacher,\nmuch beloved by his students. (Of the approximately 860 students\nenrolled in Jena in the Spring Semester of 1794, 600 were enrolled in\nReinhold’s three lecture courses.) Indeed, Reinhold was largely\nresponsible for making Jena the center of German philosophy, which it\nremained for the next several decades.\n\nIn his published Letters on the Kantian Philosophy Reinhold\nhad excused himself from the task of presenting and examining the\ntheoretical foundations of Kant’s Critical philosophy, in order\nto concentrate instead upon the practical consequences of the same.\nBut once he arrived at Jena he set himself to the former task, the\nsurprising result of which was not so much the popularization of\nanother aspect of Kant’s thought as a first, historically\nmomentous effort to revise and recast the\ntheoretical foundations of the new transcendental idealism in a new,\nallegedly more coherent and systematic form. The fruit of this\nrevisionist effort was Reinhold’s own “Elementary\nPhilosophy” (see below), which, though only a passing phase in\nReinhold’s own development as a philosopher, remains his most\nsubstantial and effective contribution to the historical development\nof German Idealism.\n\nReinhold’s Elementary Philosophy is most fully expounded in\nthree works he published in rapid succession during his tenure at the\nUniversity of Jena: Versuch einer neuen Theorie des menschlichen\nVorstellungsvermögens [Attempt a New Theory of the Human\nFaculty of Representation] (1789), Beyträge zur\nBerichtigung bisheriger Missverständnisse der Philosophen,\nErster Band [Contributions toward Correcting the Previous\nMisunderstandings of Philosophers, Vol. I] (1790), and Ueber\ndas Fundament des philosophischen Wissens [On the Foundation\nof Philosophical Knowledge] (1791).\n\nReinhold’s radical revision and implicit critique of orthodox\nKantianism exercised an immediate and immense influence upon his\ncontemporaries, and particularly upon the philosopher who followed him\nat Jena in 1794, namely Johann Gottlieb Fichte. But though Fichte was\nthoroughly convinced by Reinhold’s arguments for the\nincompleteness of Kant’s own presentation of the Critical\nphilosophy and by his demand for an immediately certain “first\nprinciple” of the same, he was not satisfied with\nReinhold’s own efforts to satisfy these demands and, in the\nAenesidemus review and elsewhere, made public his own\ncriticisms of the Elementary Philosophy and of Reinhold’s\n“Principle of Consciousness.” For a few years following\nFichte’s arrival in Jena and Reinhold’s transfer to Kiel,\nthe two men engaged in a wide-ranging and stimulating philosophical\ncorrespondence, though they never met.\n\nThe final upshot of Reinhold’s Auseinandersetzung with\nFichte was the former’s recantation of his own Elementary\nPhilosophy and transference of his allegiance to the standpoint of\nFichte’s Wissenschaftslehre. This conversion was made\npublic in early 1797, in the preface to Reinhold’s Auswahl\nVermischster Schriften, Zweyter Band [Selection of\nVarious Writings, Volume II] and in his revised 1795 Prize Essay,\nfeatured in that work. It was elaborated in a lengthy review essay in\nthe Allgemeine Literatur-Zeitung of Fichte’s recent\nwritings, and again, the following year, in Reinhold’s Ueber\ndie Paradoxien der neuesten Philosophie [Concerning the\nParadoxes of the most recent Philosophy], in which he explicitly\nacknowledged the inadequacy of his own Principle of Consciousness as\nthe foundation of philosophy as a whole and endorsed Fichte’s\nproposal for a more “active” first principle (the\nTathandlung, or “fact-act” of the I’s\nself-positing), which would be capable of fully integrating\ntheoretical with practical reason, as well as uniting theoretical and\npractical philosophy.\n\nAs his contribution to the Atheism Controversy of 1798/99, which led\nto Fichte’s departure from Jena, Reinhold published a pamphlet\nin Fichte’s defense. However, it was not long before he grew\ndissatisfied with what he perceived to be the\n“one-sidedness” of Fichte’s philosophy—and\nindeed, of transcendental idealism as a whole—and publicly\nsought some “third way,” which could reconcile the\nopposing positions of Fichte and Jacobi (whose contribution to the\nAtheism Controversy was an influential “Open letter,”\ncriticizing philosophy in general and Fichte’s transcendental\nidealism in particular as “nihilism.”) This effort on\nReinhold’s part to mediate the differences between the\ntranscendental idealist “philosopher of freedom” (Fichte)\nand the common-sense “non-philosopher of faith” (Jacobi)\npleased neither party, and signaled the quick and abrupt end of\nReinhold’s short-lived “Fichte phase.”\n\nAfter resolutely turning his back on the new post-Kantian idealist\nphilosophy that he himself had done so much to instigate, Reinhold now\npresented himself to the public, in the six issues of his own\nBeyträge zur leichtern Uebersicht des Zustandes der\nPhilosophie beym Anfange des 19. Jahrhunderts [Contributions\nto a Simpler Overview of the State of Philosophy at the Beginning of\nthe Nineteenth Century] (1801–1803), as a partisan of C.G.\nBardili’s “logical realism,” which Reinhold dubbed\n“rational realism.” This system attempted to base\nphilosophy upon pure logic and upon an appeal to what Bardili called\n“thinking qua thinking.” It was this effort on\nReinhold’s part, in the first issue of the\nBeyträge, “to reduce philosophy to logic”\nthat drew the sarcastic ire of Hegel in his notorious appendix to his\nDifferenz des Fichte’schen und Schelling’schen Systems\nder Philosophie [Difference between the Fichtean and\nSchellingian System of Philosophy] (1801).\n\nSoon enough, however, Reinhold became dissatisfied with\nBardili’s position as well, and began publicly to criticize the\nsame “from the standpoint of language” and to reject all\nefforts to ground philosophy in pure formal logic. Reinhold’s\nfinal project as a philosopher can be described as a pioneering effort\nto take seriously the implications of ordinary language for philosophy\nitself and to insist upon the intimate relationship between speaking\nand thinking. These writings of Reinhold’s final years went\nnearly unnoticed during his own lifetime and have generally remained\nunknown until very recently; yet they would appear to merit the\nattention of contemporary philosophers and scholars, inasmuch as they\nanticipate in certain ways the “linguistic turn” of so\nmuch subsequent philosophy.\n\nAfter a lifetime of philosophical inquiry, during which he influenced\ncountless readers and students, while himself moving restlessly from\none theoretical standpoint to another, Reinhold died in Kiel in\n1823.\n",
    "section_title": "1. Reinhold’s Life and Work",
    "entry_title": "Karl Leonhard Reinhold",
    "hierarchy_title": "Karl Leonhard Reinhold || Reinhold’s Life and Work",
    "tokenized_text": [
        "reinhold",
        "life",
        "work",
        "reinhold",
        "life",
        "work",
        "karl",
        "leonhard",
        "reinhold",
        "born",
        "vienna",
        "october",
        "though",
        "many",
        "older",
        "source",
        "erroneously",
        "give",
        "year",
        "birth",
        "studied",
        "jesuit",
        "seminary",
        "vienna",
        "year",
        "order",
        "suppressed",
        "time",
        "entered",
        "barnabite",
        "seminary",
        "following",
        "ordination",
        "became",
        "barnabite",
        "monk",
        "served",
        "several",
        "year",
        "parish",
        "priest",
        "teacher",
        "philosophy",
        "reinhold",
        "first",
        "publication",
        "book",
        "review",
        "short",
        "essay",
        "popular",
        "newspaper",
        "showed",
        "zealous",
        "advocate",
        "josephite",
        "reform",
        "enthusiastic",
        "exponent",
        "radical",
        "enlightenment",
        "religious",
        "toleration",
        "reinhold",
        "moved",
        "leipzig",
        "converted",
        "protestantism",
        "also",
        "became",
        "freemason",
        "member",
        "illuminati",
        "remained",
        "active",
        "freemason",
        "end",
        "life",
        "possessed",
        "restless",
        "inquiring",
        "spirit",
        "reinhold",
        "early",
        "intellectual",
        "trajectory",
        "led",
        "orthodox",
        "catholicism",
        "reformed",
        "catholicism",
        "materialism",
        "atheism",
        "leibnizianism",
        "humean",
        "skepticism",
        "yet",
        "always",
        "remained",
        "true",
        "ideal",
        "enlightenment",
        "least",
        "understood",
        "ideal",
        "never",
        "ceased",
        "insist",
        "philosophy",
        "ought",
        "make",
        "practical",
        "difference",
        "world",
        "foray",
        "technical",
        "arcane",
        "philosophical",
        "debate",
        "issue",
        "never",
        "wavered",
        "insistence",
        "true",
        "popularity",
        "must",
        "remain",
        "goal",
        "philosophy",
        "ultimate",
        "test",
        "system",
        "capacity",
        "convincing",
        "everyone",
        "truth",
        "enlightenment",
        "reinhold",
        "abstract",
        "pursuit",
        "truth",
        "program",
        "religious",
        "moral",
        "social",
        "political",
        "reform",
        "coupled",
        "commitment",
        "popularity",
        "pedagogic",
        "zeal",
        "everything",
        "power",
        "spread",
        "message",
        "popular",
        "enlightenmentwhether",
        "materialist",
        "neoleibnizian",
        "skeptical",
        "kantian",
        "fichtean",
        "bardilian",
        "distinctively",
        "reinholdian",
        "formas",
        "widely",
        "effectively",
        "possible",
        "studying",
        "philosophy",
        "semester",
        "leipzig",
        "reinhold",
        "moved",
        "weimar",
        "became",
        "confidant",
        "soninlaw",
        "c",
        "m",
        "wieland",
        "regular",
        "contributor",
        "wieland",
        "widely",
        "read",
        "der",
        "teutsche",
        "merkur",
        "journal",
        "famous",
        "series",
        "letter",
        "kantian",
        "philosophy",
        "began",
        "appear",
        "letter",
        "subsequently",
        "published",
        "revised",
        "expanded",
        "form",
        "two",
        "volume",
        "reinhold",
        "name",
        "enters",
        "history",
        "philosophy",
        "reinhold",
        "found",
        "kant",
        "clearly",
        "expressed",
        "first",
        "many",
        "private",
        "letter",
        "latter",
        "namely",
        "way",
        "resolve",
        "debilitating",
        "conflict",
        "faith",
        "reason",
        "superstition",
        "disbelief",
        "heart",
        "head",
        "precisely",
        "aspect",
        "new",
        "critical",
        "philosophy",
        "emphasized",
        "letter",
        "kantian",
        "philosophy",
        "kant",
        "radical",
        "new",
        "account",
        "space",
        "time",
        "audacious",
        "effort",
        "provide",
        "transcendental",
        "deduction",
        "pure",
        "category",
        "understanding",
        "rather",
        "conclusion",
        "implication",
        "transcendental",
        "dialectic",
        "kantianism",
        "recommended",
        "reinhold",
        "allegedly",
        "salubrious",
        "enlightened",
        "practical",
        "consequence",
        "particularly",
        "respect",
        "religion",
        "morality",
        "nothing",
        "reinhold",
        "described",
        "new",
        "philosophy",
        "reader",
        "die",
        "teutscher",
        "merkur",
        "gospel",
        "pure",
        "reason",
        "rational",
        "belief",
        "god",
        "immortality",
        "soul",
        "reality",
        "free",
        "article",
        "new",
        "gospel",
        "a",
        "gospel",
        "promulgated",
        "everyone",
        "agreed",
        "far",
        "effectively",
        "popularly",
        "reinhold",
        "kant",
        "even",
        "kant",
        "professed",
        "charmed",
        "reinhold",
        "effort",
        "gratified",
        "success",
        "strength",
        "newfound",
        "fame",
        "author",
        "letter",
        "reinhold",
        "invited",
        "inaugural",
        "occupant",
        "first",
        "professorial",
        "chair",
        "devoted",
        "exclusively",
        "new",
        "kantian",
        "philosophy",
        "thus",
        "began",
        "lecturing",
        "university",
        "jena",
        "first",
        "jena",
        "later",
        "university",
        "kiel",
        "reinhold",
        "proved",
        "immensely",
        "popular",
        "influential",
        "teacher",
        "much",
        "beloved",
        "student",
        "approximately",
        "student",
        "enrolled",
        "jena",
        "spring",
        "semester",
        "enrolled",
        "reinhold",
        "three",
        "lecture",
        "course",
        "indeed",
        "reinhold",
        "largely",
        "responsible",
        "making",
        "jena",
        "center",
        "german",
        "philosophy",
        "remained",
        "next",
        "several",
        "decade",
        "published",
        "letter",
        "kantian",
        "philosophy",
        "reinhold",
        "excused",
        "task",
        "presenting",
        "examining",
        "theoretical",
        "foundation",
        "kant",
        "critical",
        "philosophy",
        "order",
        "concentrate",
        "instead",
        "upon",
        "practical",
        "consequence",
        "arrived",
        "jena",
        "set",
        "former",
        "task",
        "surprising",
        "result",
        "much",
        "popularization",
        "another",
        "aspect",
        "kant",
        "thought",
        "first",
        "historically",
        "momentous",
        "effort",
        "revise",
        "recast",
        "theoretical",
        "foundation",
        "new",
        "transcendental",
        "idealism",
        "new",
        "allegedly",
        "coherent",
        "systematic",
        "form",
        "fruit",
        "revisionist",
        "effort",
        "reinhold",
        "elementary",
        "philosophy",
        "see",
        "though",
        "passing",
        "phase",
        "reinhold",
        "development",
        "philosopher",
        "remains",
        "substantial",
        "effective",
        "contribution",
        "historical",
        "development",
        "german",
        "idealism",
        "reinhold",
        "elementary",
        "philosophy",
        "fully",
        "expounded",
        "three",
        "work",
        "published",
        "rapid",
        "succession",
        "tenure",
        "university",
        "jena",
        "versuch",
        "einer",
        "neuen",
        "theorie",
        "de",
        "menschlichen",
        "vorstellungsvermögens",
        "attempt",
        "new",
        "theory",
        "human",
        "faculty",
        "representation",
        "beyträge",
        "zur",
        "berichtigung",
        "bisheriger",
        "missverständnisse",
        "der",
        "philosophen",
        "erster",
        "band",
        "contribution",
        "toward",
        "correcting",
        "previous",
        "misunderstanding",
        "philosopher",
        "vol",
        "ueber",
        "da",
        "fundament",
        "de",
        "philosophischen",
        "wissens",
        "foundation",
        "philosophical",
        "knowledge",
        "reinhold",
        "radical",
        "revision",
        "implicit",
        "critique",
        "orthodox",
        "kantianism",
        "exercised",
        "immediate",
        "immense",
        "influence",
        "upon",
        "contemporary",
        "particularly",
        "upon",
        "philosopher",
        "followed",
        "jena",
        "namely",
        "johann",
        "gottlieb",
        "fichte",
        "though",
        "fichte",
        "thoroughly",
        "convinced",
        "reinhold",
        "argument",
        "incompleteness",
        "kant",
        "presentation",
        "critical",
        "philosophy",
        "demand",
        "immediately",
        "certain",
        "first",
        "principle",
        "satisfied",
        "reinhold",
        "effort",
        "satisfy",
        "demand",
        "aenesidemus",
        "review",
        "elsewhere",
        "made",
        "public",
        "criticism",
        "elementary",
        "philosophy",
        "reinhold",
        "principle",
        "consciousness",
        "year",
        "following",
        "fichte",
        "arrival",
        "jena",
        "reinhold",
        "transfer",
        "kiel",
        "two",
        "men",
        "engaged",
        "wideranging",
        "stimulating",
        "philosophical",
        "correspondence",
        "though",
        "never",
        "met",
        "final",
        "upshot",
        "reinhold",
        "auseinandersetzung",
        "fichte",
        "former",
        "recantation",
        "elementary",
        "philosophy",
        "transference",
        "allegiance",
        "standpoint",
        "fichte",
        "wissenschaftslehre",
        "conversion",
        "made",
        "public",
        "early",
        "preface",
        "reinhold",
        "auswahl",
        "vermischster",
        "schriften",
        "zweyter",
        "band",
        "selection",
        "various",
        "writing",
        "volume",
        "ii",
        "revised",
        "prize",
        "essay",
        "featured",
        "work",
        "elaborated",
        "lengthy",
        "review",
        "essay",
        "allgemeine",
        "literaturzeitung",
        "fichte",
        "recent",
        "writing",
        "following",
        "year",
        "reinhold",
        "ueber",
        "die",
        "paradoxien",
        "der",
        "neuesten",
        "philosophie",
        "concerning",
        "paradox",
        "recent",
        "philosophy",
        "explicitly",
        "acknowledged",
        "inadequacy",
        "principle",
        "consciousness",
        "foundation",
        "philosophy",
        "whole",
        "endorsed",
        "fichte",
        "proposal",
        "active",
        "first",
        "principle",
        "tathandlung",
        "factact",
        "selfpositing",
        "would",
        "capable",
        "fully",
        "integrating",
        "theoretical",
        "practical",
        "reason",
        "well",
        "uniting",
        "theoretical",
        "practical",
        "philosophy",
        "contribution",
        "atheism",
        "controversy",
        "led",
        "fichte",
        "departure",
        "jena",
        "reinhold",
        "published",
        "pamphlet",
        "fichte",
        "defense",
        "however",
        "long",
        "grew",
        "dissatisfied",
        "perceived",
        "onesidedness",
        "fichte",
        "philosophyand",
        "indeed",
        "transcendental",
        "idealism",
        "wholeand",
        "publicly",
        "sought",
        "third",
        "way",
        "could",
        "reconcile",
        "opposing",
        "position",
        "fichte",
        "jacobi",
        "whose",
        "contribution",
        "atheism",
        "controversy",
        "influential",
        "open",
        "letter",
        "criticizing",
        "philosophy",
        "general",
        "fichte",
        "transcendental",
        "idealism",
        "particular",
        "nihilism",
        "effort",
        "reinhold",
        "part",
        "mediate",
        "difference",
        "transcendental",
        "idealist",
        "philosopher",
        "freedom",
        "fichte",
        "commonsense",
        "nonphilosopher",
        "faith",
        "jacobi",
        "pleased",
        "neither",
        "party",
        "signaled",
        "quick",
        "abrupt",
        "end",
        "reinhold",
        "shortlived",
        "fichte",
        "phase",
        "resolutely",
        "turning",
        "back",
        "new",
        "postkantian",
        "idealist",
        "philosophy",
        "done",
        "much",
        "instigate",
        "reinhold",
        "presented",
        "public",
        "six",
        "issue",
        "beyträge",
        "zur",
        "leichtern",
        "uebersicht",
        "de",
        "zustandes",
        "der",
        "philosophie",
        "beym",
        "anfange",
        "de",
        "jahrhunderts",
        "contribution",
        "simpler",
        "overview",
        "state",
        "philosophy",
        "beginning",
        "nineteenth",
        "century",
        "partisan",
        "cg",
        "bardili",
        "logical",
        "realism",
        "reinhold",
        "dubbed",
        "rational",
        "realism",
        "system",
        "attempted",
        "base",
        "philosophy",
        "upon",
        "pure",
        "logic",
        "upon",
        "appeal",
        "bardili",
        "called",
        "thinking",
        "qua",
        "thinking",
        "effort",
        "reinhold",
        "part",
        "first",
        "issue",
        "beyträge",
        "reduce",
        "philosophy",
        "logic",
        "drew",
        "sarcastic",
        "ire",
        "hegel",
        "notorious",
        "appendix",
        "differenz",
        "de",
        "fichte",
        "schen",
        "und",
        "schelling",
        "schen",
        "system",
        "der",
        "philosophie",
        "difference",
        "fichtean",
        "schellingian",
        "system",
        "philosophy",
        "soon",
        "enough",
        "however",
        "reinhold",
        "became",
        "dissatisfied",
        "bardili",
        "position",
        "well",
        "began",
        "publicly",
        "criticize",
        "standpoint",
        "language",
        "reject",
        "effort",
        "ground",
        "philosophy",
        "pure",
        "formal",
        "logic",
        "reinhold",
        "final",
        "project",
        "philosopher",
        "described",
        "pioneering",
        "effort",
        "take",
        "seriously",
        "implication",
        "ordinary",
        "language",
        "philosophy",
        "insist",
        "upon",
        "intimate",
        "relationship",
        "speaking",
        "thinking",
        "writing",
        "reinhold",
        "final",
        "year",
        "went",
        "nearly",
        "unnoticed",
        "lifetime",
        "generally",
        "remained",
        "unknown",
        "recently",
        "yet",
        "would",
        "appear",
        "merit",
        "attention",
        "contemporary",
        "philosopher",
        "scholar",
        "inasmuch",
        "anticipate",
        "certain",
        "way",
        "linguistic",
        "turn",
        "much",
        "subsequent",
        "philosophy",
        "lifetime",
        "philosophical",
        "inquiry",
        "influenced",
        "countless",
        "reader",
        "student",
        "moving",
        "restlessly",
        "one",
        "theoretical",
        "standpoint",
        "another",
        "reinhold",
        "died",
        "kiel"
    ]
}