{
    "main_text": "Epistemology and philosophy of sciences || Causality\n4.2 Causality\n\nThe reality of astronomical hypotheses—and hence the superiority\nof the Copernican world system—implied a physicalization of\nastronomical theories and, in turn, an accentuation of causality.\nDespite Kepler’s criticism of Aristotle, this aspect can\nactually be considered the realization in the field of astronomy of\nthe old Aristotelian ideal of knowledge: “knowledge” means\nto grasp the causes of the phenomena.\n\nThus, on the one hand, “causality” is a notion implying\nthe most general idea of “actual scientific knowledge”\nwhich guides and stimulates each investigation. In this sense, Kepler\nalready embarked in his MC on a causal investigation by asking for the\ncause of the number, the sizes and the “motions”\n(= the speeds) of the heavenly spheres (see Section 3 above).\n\nOn the other hand, “causality” implies in Kepler,\naccording to the Aristotelian conception of physical science, the\nconcrete “physical cause”, the efficient cause which\nproduces a motion or is responsible for keeping the body in motion.\nOriginal to Kepler, however, and typical of his approach is the\nresoluteness with which he was convinced that the problem of\nequipollence of the astronomical hypotheses can be resolved and the\nconsequent introduction of the concept of causality into astronomy\n– traditionally a mathematical science. This approach is already\npresent in his MC, where he, for instance, relates for the first time\nthe distances of the planets to a power which emerges\nfrom the Sun and decreases in proportion to the distance of each\nplanet, up to the sphere of the fixed stars (see Stephenson 1987, pp.\n9–10).\n\nOne of Kepler’s decisive innovations in his MC is that he\nreplaced the “mean Sun” of Copernicus with the real Sun,\nwhich was no longer merely a geometrical point but a body capable of\nphysically influencing the surrounding planets. In addition, in notes\nto the 1621 edition of MC Kepler strongly criticizes the notion of\n“soul” (anima) as a dynamical factor in planetary\nmotion and proposes to substitute “force” (vis)\nfor it (see KGW 8, p. 113, Engl. trans. p. 203, note 3).\n\nOne of the most important philosophical aspects of Kepler’s\nAstronomia Nova from 1609 (=AN) is its methodological\napproach and its causal foundation (see Mittelstrass 1972). Kepler was\nsufficiently conscious of the change of perspective he was introducing\ninto astronomy. Hence, he decided to announce this in the full title\nof the work: Astronomia Nova, Aitiologetos, seu physica coelestis,\ntradita commentariis de motibus stellae Martis. Ex observationibus G.\nV. Tychonis Brahe: New Astronomy Based upon Causes or\nCelestial Physics Treated by Means of Commentaries on the Motions of\nthe Star Mars from the observations of Tycho Brahe …\n(trans. Donahue). In the introduction to AN Kepler insists on his\nradical change of view: his work is about physics, not pure\nkinematical or geometrical astronomy. “Physics”, as in the\ntraditional, Aristotelian understanding of the discipline, deals with\nthe causes of phenomena, and for Kepler that constitutes his ultimate\napproach to deciding between rival hypotheses (AN, Engl. trans., p.\n48; see Krafft 1991). On the other hand, since his celestial physics\nuses not only geometrical axioms but also other, non-mathematical\naxioms, the knowledge obtained often has a kernel of guesswork.\n\nIn the third part of AN, chapters 22–40, Kepler deals with the\npath of the Earth and intends to offer a physical account of the\nCopernican theory. By so doing he includes the idea that a certain\nnotion of power should be made responsible for the regulation of the\ndifferences in velocities of the planets, which in turn have to be\nestablished in relation to the planets’ distances. Now, the\nCopernican planetary theory departs from the general principle that\nthe Earth moves regularly on an eccentric circle. For Kepler, on the\ncontrary, the planets are moved irregularly, and the slower they are\nmoved, the greater their distance is from the center of power, the\nSun. Addressing the physical aspects of his new astronomy, he deals in\nchapters 32–40, perhaps the most idiosyncratic of the work, with\nhis notion of motive power. Here, he combines different approaches and\nsources, sometimes producing—for the purpose of simplifying the\nwhole geometrical construction of geometrical astronomy by introducing\na power causing motions—a new confusion at the dynamical level.\nTo begin with, it is not always absolutely clear what kind of power\nKepler has in mind. He inclines, above all, to the idea of a magnetic\npower residing in the Sun, but he also mentions light and, at least\nindirectly, gravity (which he does not bring into operation in the\ncentral chapters of the AN but which is to a certain extent implied in\nhis explanations using the model of the balance and which he surely\naccepts as true for the Sun-Moon system, as he explains in the general\nintroduction). Secondly, it is not always clear what this power is and\nhow it acts, especially when he is speaking merely analogically,\n“as if” (particularly in the case of light). Essentially,\nKepler breaks down the motions of the planets into two components. On\nthe one hand, the planets move around the Sun—at this state of\nthe discussion—circularly. On the other hand, they exhibit a\nlibration on the Sun-planet vector. The rotation of the Sun is\nresponsible for the motion of the planets. Irradiating from the\nrotating Sun is a power which spreads at the ecliptic plain. This\npower diminishes with distance to the source of the power, that is, to\nthe Sun. A decisive work for Kepler’s development in his\nphysical astronomy is William Gilbert’s (1544–1603) De\nmagnete (London, 1600), a work which also intends to offer a new\nphysics for the new Copernican cosmology and which surely influenced\nKepler’s thoughts about this power. One of the main problems\nwas, of course, how to apply the general principles of magnetism to\nplanetary motion, first to explain the difference in velocity on a\ncircular path, and later to give an account of the motion on an\nellipse. Kepler conceives of a model with parallel magnetic fibers\nwhich links the Sun with the planets in such a way that the rotation\nof the Sun causes the motion of the planets around it. The fibers are\nborn in the planets parallel and perpendicular to the lines of apsides\nby a kind of “animal power”. The planets themselves are\npolarized, that is, with one pole they are attracted to the Sun, with\nthe other pole they are pushed away from it. This explains very well\nthe direction of planetary motion: the planets all move in one\ndirection because the Sun rotates in that direction.\nNevertheless, a further problem still seems to remain unresolved:\naccording to Kepler’s explication, the planets should move\naround the Sun as fast as the Sun itself rotates, which is not the\ncase. This phenomenon can be explained by referring to a property of\nmatter, which for Kepler has an axiomatic character: the\ninclinatio ad quietem, that is, the tendency to rest (see\nespecially AN, chap. 39; KGW 3, p. 256). As a consequence, the planets\nare moved around the Sun slower than they would be if the power of the\nSun were at work alone.\n\nKepler’s causal approach is above all present in his\nEpitome, a voluminous work which exercised a considerable\ninfluence on the later development of astronomy. In the second part of\nBook 4, he deals with the motion of the world’s parts. Not the\ntwo first laws but rather the third law, which he had recently\nannounced in his HM, is Kepler’s starting point; for this law,\nrather than a calculational device for the path of one planet,\nrepresents a general cosmological statement, and thus it is more\nconvenient for his approach here. At the same time, it should be\npointed out that the third law is not necessarily the best point of\ndeparture for a dynamical, causal approach to motion, as Kepler\nintends here; for, in comparison with the previous causal approaches,\nthe question of the location of the cause of power responsible for the\nproduction of motion remains relevant. The spheres, which in the\ntraditional view transported the planets, had been abolished since the\ntime of Tycho. Furthermore, Kepler is clearly against the\n“moving intelligences” of the Aristotelian tradition. The\nfact that the orbits are elliptical and not circular, shows that the\nmotions are not caused by a spiritual power but rather by a natural\none, which is internal to the composition of matter. The planets\nthemselves are provided with “inertia”, a\nproperty, as Kepler understood it, that inhibits motion and represents\nan impediment to it. The motive power (vix motrix) comes\nindeed from the Sun, which sends its rays of light and power in all\ndirections. These rays are captured by the planets. Kepler, however,\ntries to explain this behavior of the planets less through astrology\nand much more through magnetism (a physical phenomenon which was by no\nmeans clearly understood in his time). Firstly, the Sun rotates and,\nby so doing, sets in motion the planets around it. Secondly, since the\nplanets are poles of magnets and the Sun itself acts with magnetic\npower, the planets are, at different parts of their orbits, either\nattracted or repelled; in this way the elliptical path is causally\nproduced. Kepler partially gives up the mechanical approach by\npostulating a soul in the Sun which is responsible for its regular\nmotion of rotation, a motion on which, finally, the entire system\ndepends. In fact, the planets are also supposed by Kepler to rotate\nand are therefore provided with “a sort of soul” or some\nsuch principle which produces the rotation.\n\nIn addition to astronomy and cosmology Kepler expanded his causal\napproach to include the fields of optics (see Section 6 below) and\nharmonics (Section 7 below).\n",
    "section_title": "4.2 Causality",
    "entry_title": "Johannes Kepler",
    "hierarchy_title": "Johannes Kepler || Epistemology and philosophy of sciences || Causality",
    "tokenized_text": [
        "epistemology",
        "philosophy",
        "science",
        "causality",
        "causality",
        "reality",
        "astronomical",
        "hypothesesand",
        "hence",
        "superiority",
        "copernican",
        "world",
        "systemimplied",
        "physicalization",
        "astronomical",
        "theory",
        "turn",
        "accentuation",
        "causality",
        "despite",
        "kepler",
        "criticism",
        "aristotle",
        "aspect",
        "actually",
        "considered",
        "realization",
        "field",
        "astronomy",
        "old",
        "aristotelian",
        "ideal",
        "knowledge",
        "knowledge",
        "mean",
        "grasp",
        "cause",
        "phenomenon",
        "thus",
        "one",
        "hand",
        "causality",
        "notion",
        "implying",
        "general",
        "idea",
        "actual",
        "scientific",
        "knowledge",
        "guide",
        "stimulates",
        "investigation",
        "sense",
        "kepler",
        "already",
        "embarked",
        "mc",
        "causal",
        "investigation",
        "asking",
        "cause",
        "number",
        "size",
        "motion",
        "speed",
        "heavenly",
        "sphere",
        "see",
        "section",
        "hand",
        "causality",
        "implies",
        "kepler",
        "according",
        "aristotelian",
        "conception",
        "physical",
        "science",
        "concrete",
        "physical",
        "cause",
        "efficient",
        "cause",
        "produce",
        "motion",
        "responsible",
        "keeping",
        "body",
        "motion",
        "original",
        "kepler",
        "however",
        "typical",
        "approach",
        "resoluteness",
        "convinced",
        "problem",
        "equipollence",
        "astronomical",
        "hypothesis",
        "resolved",
        "consequent",
        "introduction",
        "concept",
        "causality",
        "astronomy",
        "traditionally",
        "mathematical",
        "science",
        "approach",
        "already",
        "present",
        "mc",
        "instance",
        "relates",
        "first",
        "time",
        "distance",
        "planet",
        "power",
        "emerges",
        "sun",
        "decrease",
        "proportion",
        "distance",
        "planet",
        "sphere",
        "fixed",
        "star",
        "see",
        "stephenson",
        "pp",
        "one",
        "kepler",
        "decisive",
        "innovation",
        "mc",
        "replaced",
        "mean",
        "sun",
        "copernicus",
        "real",
        "sun",
        "longer",
        "merely",
        "geometrical",
        "point",
        "body",
        "capable",
        "physically",
        "influencing",
        "surrounding",
        "planet",
        "addition",
        "note",
        "edition",
        "mc",
        "kepler",
        "strongly",
        "criticizes",
        "notion",
        "soul",
        "anima",
        "dynamical",
        "factor",
        "planetary",
        "motion",
        "proposes",
        "substitute",
        "force",
        "vi",
        "see",
        "kgw",
        "p",
        "engl",
        "trans",
        "p",
        "note",
        "one",
        "important",
        "philosophical",
        "aspect",
        "kepler",
        "astronomia",
        "nova",
        "an",
        "methodological",
        "approach",
        "causal",
        "foundation",
        "see",
        "mittelstrass",
        "kepler",
        "sufficiently",
        "conscious",
        "change",
        "perspective",
        "introducing",
        "astronomy",
        "hence",
        "decided",
        "announce",
        "full",
        "title",
        "work",
        "astronomia",
        "nova",
        "aitiologetos",
        "seu",
        "physica",
        "coelestis",
        "tradita",
        "commentariis",
        "de",
        "motibus",
        "stellae",
        "marti",
        "ex",
        "observationibus",
        "g",
        "v",
        "tychonis",
        "brahe",
        "new",
        "astronomy",
        "based",
        "upon",
        "cause",
        "celestial",
        "physic",
        "treated",
        "mean",
        "commentary",
        "motion",
        "star",
        "mar",
        "observation",
        "tycho",
        "brahe",
        "trans",
        "donahue",
        "introduction",
        "kepler",
        "insists",
        "radical",
        "change",
        "view",
        "work",
        "physic",
        "pure",
        "kinematical",
        "geometrical",
        "astronomy",
        "physic",
        "traditional",
        "aristotelian",
        "understanding",
        "discipline",
        "deal",
        "cause",
        "phenomenon",
        "kepler",
        "constitutes",
        "ultimate",
        "approach",
        "deciding",
        "rival",
        "hypothesis",
        "engl",
        "trans",
        "p",
        "see",
        "krafft",
        "hand",
        "since",
        "celestial",
        "physic",
        "us",
        "geometrical",
        "axiom",
        "also",
        "nonmathematical",
        "axiom",
        "knowledge",
        "obtained",
        "often",
        "kernel",
        "guesswork",
        "third",
        "part",
        "chapter",
        "kepler",
        "deal",
        "path",
        "earth",
        "intends",
        "offer",
        "physical",
        "account",
        "copernican",
        "theory",
        "includes",
        "idea",
        "certain",
        "notion",
        "power",
        "made",
        "responsible",
        "regulation",
        "difference",
        "velocity",
        "planet",
        "turn",
        "established",
        "relation",
        "planet",
        "distance",
        "copernican",
        "planetary",
        "theory",
        "departs",
        "general",
        "principle",
        "earth",
        "move",
        "regularly",
        "eccentric",
        "circle",
        "kepler",
        "contrary",
        "planet",
        "moved",
        "irregularly",
        "slower",
        "moved",
        "greater",
        "distance",
        "center",
        "power",
        "sun",
        "addressing",
        "physical",
        "aspect",
        "new",
        "astronomy",
        "deal",
        "chapter",
        "perhaps",
        "idiosyncratic",
        "work",
        "notion",
        "motive",
        "power",
        "combine",
        "different",
        "approach",
        "source",
        "sometimes",
        "producingfor",
        "purpose",
        "simplifying",
        "whole",
        "geometrical",
        "construction",
        "geometrical",
        "astronomy",
        "introducing",
        "power",
        "causing",
        "motionsa",
        "new",
        "confusion",
        "dynamical",
        "level",
        "begin",
        "always",
        "absolutely",
        "clear",
        "kind",
        "power",
        "kepler",
        "mind",
        "incline",
        "idea",
        "magnetic",
        "power",
        "residing",
        "sun",
        "also",
        "mention",
        "light",
        "least",
        "indirectly",
        "gravity",
        "bring",
        "operation",
        "central",
        "chapter",
        "certain",
        "extent",
        "implied",
        "explanation",
        "using",
        "model",
        "balance",
        "surely",
        "accepts",
        "true",
        "sunmoon",
        "system",
        "explains",
        "general",
        "introduction",
        "secondly",
        "always",
        "clear",
        "power",
        "act",
        "especially",
        "speaking",
        "merely",
        "analogically",
        "particularly",
        "case",
        "light",
        "essentially",
        "kepler",
        "break",
        "motion",
        "planet",
        "two",
        "component",
        "one",
        "hand",
        "planet",
        "move",
        "around",
        "sunat",
        "state",
        "discussioncircularly",
        "hand",
        "exhibit",
        "libration",
        "sunplanet",
        "vector",
        "rotation",
        "sun",
        "responsible",
        "motion",
        "planet",
        "irradiating",
        "rotating",
        "sun",
        "power",
        "spread",
        "ecliptic",
        "plain",
        "power",
        "diminishes",
        "distance",
        "source",
        "power",
        "sun",
        "decisive",
        "work",
        "kepler",
        "development",
        "physical",
        "astronomy",
        "william",
        "gilbert",
        "de",
        "magnete",
        "london",
        "work",
        "also",
        "intends",
        "offer",
        "new",
        "physic",
        "new",
        "copernican",
        "cosmology",
        "surely",
        "influenced",
        "kepler",
        "thought",
        "power",
        "one",
        "main",
        "problem",
        "course",
        "apply",
        "general",
        "principle",
        "magnetism",
        "planetary",
        "motion",
        "first",
        "explain",
        "difference",
        "velocity",
        "circular",
        "path",
        "later",
        "give",
        "account",
        "motion",
        "ellipse",
        "kepler",
        "conceives",
        "model",
        "parallel",
        "magnetic",
        "fiber",
        "link",
        "sun",
        "planet",
        "way",
        "rotation",
        "sun",
        "cause",
        "motion",
        "planet",
        "around",
        "fiber",
        "born",
        "planet",
        "parallel",
        "perpendicular",
        "line",
        "apsis",
        "kind",
        "animal",
        "power",
        "planet",
        "polarized",
        "one",
        "pole",
        "attracted",
        "sun",
        "pole",
        "pushed",
        "away",
        "explains",
        "well",
        "direction",
        "planetary",
        "motion",
        "planet",
        "move",
        "one",
        "direction",
        "sun",
        "rotates",
        "direction",
        "nevertheless",
        "problem",
        "still",
        "seems",
        "remain",
        "unresolved",
        "according",
        "kepler",
        "explication",
        "planet",
        "move",
        "around",
        "sun",
        "fast",
        "sun",
        "rotates",
        "case",
        "phenomenon",
        "explained",
        "referring",
        "property",
        "matter",
        "kepler",
        "axiomatic",
        "character",
        "inclinatio",
        "ad",
        "quietem",
        "tendency",
        "rest",
        "see",
        "especially",
        "chap",
        "kgw",
        "p",
        "consequence",
        "planet",
        "moved",
        "around",
        "sun",
        "slower",
        "would",
        "power",
        "sun",
        "work",
        "alone",
        "kepler",
        "causal",
        "approach",
        "present",
        "epitome",
        "voluminous",
        "work",
        "exercised",
        "considerable",
        "influence",
        "later",
        "development",
        "astronomy",
        "second",
        "part",
        "book",
        "deal",
        "motion",
        "world",
        "part",
        "two",
        "first",
        "law",
        "rather",
        "third",
        "law",
        "recently",
        "announced",
        "hm",
        "kepler",
        "starting",
        "point",
        "law",
        "rather",
        "calculational",
        "device",
        "path",
        "one",
        "planet",
        "represents",
        "general",
        "cosmological",
        "statement",
        "thus",
        "convenient",
        "approach",
        "time",
        "pointed",
        "third",
        "law",
        "necessarily",
        "best",
        "point",
        "departure",
        "dynamical",
        "causal",
        "approach",
        "motion",
        "kepler",
        "intends",
        "comparison",
        "previous",
        "causal",
        "approach",
        "question",
        "location",
        "cause",
        "power",
        "responsible",
        "production",
        "motion",
        "remains",
        "relevant",
        "sphere",
        "traditional",
        "view",
        "transported",
        "planet",
        "abolished",
        "since",
        "time",
        "tycho",
        "furthermore",
        "kepler",
        "clearly",
        "moving",
        "intelligence",
        "aristotelian",
        "tradition",
        "fact",
        "orbit",
        "elliptical",
        "circular",
        "show",
        "motion",
        "caused",
        "spiritual",
        "power",
        "rather",
        "natural",
        "one",
        "internal",
        "composition",
        "matter",
        "planet",
        "provided",
        "inertia",
        "property",
        "kepler",
        "understood",
        "inhibits",
        "motion",
        "represents",
        "impediment",
        "motive",
        "power",
        "vix",
        "motrix",
        "come",
        "indeed",
        "sun",
        "sends",
        "ray",
        "light",
        "power",
        "direction",
        "ray",
        "captured",
        "planet",
        "kepler",
        "however",
        "try",
        "explain",
        "behavior",
        "planet",
        "le",
        "astrology",
        "much",
        "magnetism",
        "physical",
        "phenomenon",
        "mean",
        "clearly",
        "understood",
        "time",
        "firstly",
        "sun",
        "rotates",
        "set",
        "motion",
        "planet",
        "around",
        "secondly",
        "since",
        "planet",
        "pole",
        "magnet",
        "sun",
        "act",
        "magnetic",
        "power",
        "planet",
        "different",
        "part",
        "orbit",
        "either",
        "attracted",
        "repelled",
        "way",
        "elliptical",
        "path",
        "causally",
        "produced",
        "kepler",
        "partially",
        "give",
        "mechanical",
        "approach",
        "postulating",
        "soul",
        "sun",
        "responsible",
        "regular",
        "motion",
        "rotation",
        "motion",
        "finally",
        "entire",
        "system",
        "depends",
        "fact",
        "planet",
        "also",
        "supposed",
        "kepler",
        "rotate",
        "therefore",
        "provided",
        "sort",
        "soul",
        "principle",
        "produce",
        "rotation",
        "addition",
        "astronomy",
        "cosmology",
        "kepler",
        "expanded",
        "causal",
        "approach",
        "include",
        "field",
        "optic",
        "see",
        "section",
        "harmonic",
        "section"
    ]
}