{
    "main_text": "Natural Philosophy\n4. Natural Philosophy\n\nAlthough Kilvington does not enjoy the reputation in natural\nphilosophy that he does in logic, recent research reveals that his\nquestions on Aristotle’s De generatione et corruptione\nand Physics inspired Thomas Bradwardine’s theory of\nmotion and his famous rule of the proportions of velocities in motion\n(see Jung 2022a). Both works stemmed from lectures Kilvington\ndelivered in the Arts Faculty before 1328, i.e., before\nBradwardine’s famous treatise On the Proportions of\nVelocities in Motions.\n\nLike most medieval natural philosophers, Kilvington accepts\nAristotle’s general rules for change to occur, stating that: 1)\nthere cannot be a change without an active capacity (virtus\nmotiva) and a passive capacity (virtus resistiva),\nbecause without resistance, motion would not be temporal; 2) the\nproportion of an active capacity to a passive one must be the\nproportion of maioris inequalitatis, that is, it must be\ngreater than one. These conditions are sufficient for the occurrence\nof natural local motion. Kilvington is primarily interested in the\ndescription of the natural motions of a mixed and simple body both in\na medium and in a vacuum. In his discussion of various motions, such\nas the motion of the Earth or the motion of weights, he often relies\non the laws of statics presented in the works of Jordanus de Nemore,\nArchimedes, and Euclid (DM: 221, 223, 239–40).\n\nAristotle’s most famous law of motion, “Everything that\nmoves is moved by something,” is only quoted a few times when\nKilvington discusses the processes of transformation of the elements.\nIn such cases, it is imperative that, for example, hot fire come into\ncontact with iron and act directly on it, turning its cold into\nheat.\n\nTaking substance and quality as the only two absolute things (res\nabsolutae), Kilvington concludes that the reality of motion is\nlimited to what is in motion: the places, qualities, and quantities\nthat are successively acquired. Consequently, he is more interested in\nmeasuring local motion in terms of the actions of the causes of\nmotion, the distance traversed, and the time elapsed, than in the\nintensity of speed. In his questions on physics, Kilvington describes\nthe differences between various types of change, such as generation,\nalteration, and augmentation; determines the measurements of active\nand passive capacities that cause change; finds rules for the division\nof various types of continua; and formulates a mathematically\nconsistent rule of local motion. He examines the problem of motion\nfrom two points of view: with regard to its causes and with regard to\nits effects (see Jung-Palczewska 2002b).\n\nKilvington’s discussion of the measure of motion with respect to\ncauses, or what we would call his ‘dynamic’ analysis, has\nboth a physical aspect involving relations between acting and\nresistive potencies, and a mathematical aspect involving concepts of\ncontinuity and limits. He is interested in how a capacity is to be\nbounded if it is active or passive potency. Is it subject to weakening\nor strengthening? Is it mutable or immutable? How do we determine the\nboundaries of an active potency if a body moves in a medium that is\nnot uniformly resistant?\n\nThe mathematical character of Kilvington’s theory can be seen in\nhis use of two kinds of limit for continuous sequences: an intrinsic\nboundary (when an element is a member of the sequence of the elements\nit bounds: maximum quod sic, minimum quod sic) and an\nextrinsic boundary (when an element which serves as a boundary stands\noutside the range of elements which it bounds: maximum quod non,\nminimum quod non). Although he did not formulate strict rules\nabout the different types of division of continua, his study\ncases reveal that he approved the following conditions for the\nexistence of limits:\n\nThere must be a range in which the capacity can act or be acted\non, and another range in which it cannot act or be acted on.\nThe capacity should be capable of taking on a continuous range of\nvalues between zero and the value which serves as its boundary, and no\nother values.\n\n\nAccording to Aristotle (Physics VIII), motion occurs only if\nthe ratio of acting capacity (a force F) to passive capacity (a\nresistance R) is a ratio of major inequality, i.e., when it is greater\nthan 1. Kilvington maintains that any small excess of force over\nresistance suffices for motion to commence and continue; thus,\nwhenever force is greater than resistance, motion occurs (DM:\n215–25, 252–58). This assumes that force (an active\ncapacity) is bounded by a minimum upon which it cannot act\n(minimum quod non), i.e., by the resistance that is equal to\nit (DM: 225–29, 258–59). For a passive capacity,\nKilvington accepts the minimum quod sic limit “with\nrespect to circumstances”. He accepts Aristotle’s claim\nthat to establish a limit for Socrates’ passive capacity of\nvision, we should point to the smallest thing he can see. However, it\nalso happens that we cannot see such a great thing as a cathedral if\nwe are too close to it. Therefore, a passive capacity cannot be\ndescribed by a minimum quod sic limit in each case (DM:\n229–33, 259–62).\n\nIt is clear that Kilvington’s belief that mathematics is the\nlegitimate method of describing natural phenomena also allowed him to\nformulate a new rule of local motion. Kilvington agrees that the\nproper way of measuring the speed of motion is to describe variations\nof proportion of forces to resistances. He was aware that\nAristotle’s and Averroes’s rules of motion, given in\nPhysics VII, were not universally applicable, and was\nconvinced that the correct calculus of proportions was formulated by\nEuclid in his Elements. As a consequence, he noticed that the\nproper understanding of Euclid’s definition of operations on\nproportions necessitates a new interpretation of Aristotle’s and\nAverroes’s theory of motion. On the one hand, Euclid’s and\nArchimedes’s theory of operations on proportions concludes that\ndoubling a ratio corresponds to squaring the fraction which we\nform from the ratio. On the other hand, Aristotle’s and\nAverroes’s statements clearly indicate that speed is\nproportional to the proportion of an active power to resistance, which\nis not squared but simply multiplied by two. Having noticed the\ninconsistency between these two views, Kilvington first presented two\nmain arguments against the Aristotelian proposition and finally\nconcluded that, when talking about a power moving one half of a mobile\n(that is, something moveable), Aristotle means precisely a double\nratio between F and R; when talking about a power moving a mobile\ntwice as heavy, he means taking the square root of the ratio of F : R.\nThe new mathematical rule describing the speed of motion is in accord\nwith those of Aristotle only in one case: if the ratio of the power of\nthe mover to that of its mobile is 2 : 1, the same power will move\nhalf the mobile with exactly twice the speed. Kilvington’s\nreinterpretation of Aristotle’s and Averroes’s rules of\nmotion reveals that the speed cannot be described by multiplication\nalone. Kilvington’s calculus provides values of the ratio of F\nto R greater than 1 : 1 for any speed down to zero, since any root of\na ratio greater than 1 : 1 is always a ratio greater than 1 : 1. And,\nwith his additional assumption that any excess, however small, of an\nactive power over resistance is sufficient to initiate and continue\nmotion, he may have described a very slow motion with a speed greater\nthan 0 and less than 1 (0 > v < 1). Hence, he avoids a serious\nweakness of Aristotle’s theory, which cannot explain the\nmathematical relation of F and R in very slow motions, at speeds\nless than 1 (Jung 2022a: 76–77).\n\nKilvington applies his new rule of motion to describe the uniformly\ndifform motion of mixed bodies and the motion of simple bodies both in\na medium and in a vacuum. Explaining Kilvington’s theory, we\nmust keep in mind that temporal motion is possible only if there is\nsome resistance playing the role of a virtus impeditiva. The\nmotion of a mixed body in a medium is easiest to explain, since then\nthe acting power has to overcome the external resistance of the medium\nas well as the internal resistance of that element which is moved away\nfrom its natural place. The local motion of a simple body in a medium\nis not problematic either, since it can be explained by its natural\ndesire to attain the natural place determined by its heaviness or\nlightness. Nor does Kilvington have a problem with explaining the\nnatural motion of a mixed body in a vacuum. He once again adopts\nOckham’s view that if there were a void, it would be a place.\nSince place in the Aristotelian sense is something natural that has\nessential qualities, it determines the natural motion of elementary\nbodies and, moreover, their inclination to remain at rest in their\nnatural places. Accordingly, says Kilvington, one could imagine a void\nin four natural spheres, which despite being empty preserve the proper\nqualities characteristic of the natural places of earth, water, air,\nand fire. Hence, the temporal motion of a mixed body in a void is the\nresult of the natural inclination of heavy or light elements to attain\ntheir natural places. The heaviness and lightness play the roles of\nforce and resistance, respectively. Although there would be no\nexternal resistance in a vacuum, the motion of a mixed body could\noccur without any difficulty (see Jung-Palczewska 1997).\n\nThe temporal motion of a simple body in a vacuum is the most difficult\nto explain. In the opinion of Averroes, a simple body such as a piece\nof earth has an elementary form, prime matter, and different\nquantitative parts. Because form cannot resist matter, no resistance\ncan come from its qualitative parts. But there can be resistance\ncoming from its quantitative parts resisting one another. This time\nKilvington uses Grosseteste’s idea, recognizing that the\ntemporal motion of a simple body in a vacuum is possible due to the\ninternal resistance that arises when the peripheral parts of a body\nthat move along oblique lines resist its central parts moving along\nstraight lines. Such an internal resistance produces motion, and does\nnot impede; nevertheless, it guarantees temporal motion. Consequently,\nif a vacuum existed, the natural motion of a simple body would be\npossible. Moreover, the speed of such a motion would be the fastest,\nsince there is no external resistance to be overcome (Jung-Palczewska\n2002a: 169).\n\nIn Kilvington’s opinion, lower and greater resistance, i.e. the\nrarity or density of the medium, is responsible for faster or slower\nmotion, and the distance of the medium traversed in motion is\nresponsible for the longer or shorter time consumed in\nmotion.\n\nAccording to Kilvington, in order to characterize changes in the speed\nof motion, one must analyze the problem of local motion in its\nkinematic aspect, which takes into account distance traversed and time\nconsumed. He correctly recognizes that to measure the speed of motion\nthat lasts some time, it is enough to establish relations between time\nand distance traversed. In his opinion, the same distances traversed\nin equal intervals of time characterize uniform motion. Uniformly\ndifform motions are characterized respectively: accelerated motion by\nthe same distance traversed in a shorter interval of time; decelerated\nmotion by the same distance traversed in a longer time; or, according\nto modern definitions: the motion is uniformly difforme if the speed\nchanges by equal amounts in equal intervals. Kilvington provides a\nproper description of free fall, noting that speed increases by the\nsame amount in each time interval, and that speed is equally slower at\nthe beginning of each interval than at the end of it. Difformly\ndifform motion is characterized by unequal distances traversed in\nunequal intervals of time; the speed of such motion changes unequally\n(see Jung-Palczewska 2002b).\n\nAlthough Kilvington never abandoned Aristotle’s physics, he\noften goes beyond his theories to resolve paradoxes resulting from his\nlaws, giving the impression that, behind the facade of\nAristotle’s principles and concepts, Kilvington is an Ockhamist.\nDespite the fact that Kilvington never explicitly mentions Ockham,\nthere is no doubt that he not only knew the Venerable\nInceptor’s opinions, but also accepted them as a natural\nway to interpret the works of the Philosopher.\n",
    "section_title": "4. Natural Philosophy",
    "entry_title": "Richard Kilvington",
    "hierarchy_title": "Richard Kilvington || Natural Philosophy",
    "tokenized_text": [
        "natural",
        "philosophy",
        "natural",
        "philosophy",
        "although",
        "kilvington",
        "enjoy",
        "reputation",
        "natural",
        "philosophy",
        "logic",
        "recent",
        "research",
        "reveals",
        "question",
        "aristotle",
        "de",
        "generatione",
        "et",
        "corruptione",
        "physic",
        "inspired",
        "thomas",
        "bradwardine",
        "theory",
        "motion",
        "famous",
        "rule",
        "proportion",
        "velocity",
        "motion",
        "see",
        "jung",
        "a",
        "work",
        "stemmed",
        "lecture",
        "kilvington",
        "delivered",
        "art",
        "faculty",
        "ie",
        "bradwardine",
        "famous",
        "treatise",
        "proportion",
        "velocity",
        "motion",
        "like",
        "medieval",
        "natural",
        "philosopher",
        "kilvington",
        "accepts",
        "aristotle",
        "general",
        "rule",
        "change",
        "occur",
        "stating",
        "change",
        "without",
        "active",
        "capacity",
        "virtu",
        "motiva",
        "passive",
        "capacity",
        "virtu",
        "resistiva",
        "without",
        "resistance",
        "motion",
        "would",
        "temporal",
        "proportion",
        "active",
        "capacity",
        "passive",
        "one",
        "must",
        "proportion",
        "maioris",
        "inequalitatis",
        "must",
        "greater",
        "one",
        "condition",
        "sufficient",
        "occurrence",
        "natural",
        "local",
        "motion",
        "kilvington",
        "primarily",
        "interested",
        "description",
        "natural",
        "motion",
        "mixed",
        "simple",
        "body",
        "medium",
        "vacuum",
        "discussion",
        "various",
        "motion",
        "motion",
        "earth",
        "motion",
        "weight",
        "often",
        "relies",
        "law",
        "static",
        "presented",
        "work",
        "jordanus",
        "de",
        "nemore",
        "archimedes",
        "euclid",
        "dm",
        "aristotle",
        "famous",
        "law",
        "motion",
        "everything",
        "move",
        "moved",
        "something",
        "quoted",
        "time",
        "kilvington",
        "discus",
        "process",
        "transformation",
        "element",
        "case",
        "imperative",
        "example",
        "hot",
        "fire",
        "come",
        "contact",
        "iron",
        "act",
        "directly",
        "turning",
        "cold",
        "heat",
        "taking",
        "substance",
        "quality",
        "two",
        "absolute",
        "thing",
        "re",
        "absolutae",
        "kilvington",
        "concludes",
        "reality",
        "motion",
        "limited",
        "motion",
        "place",
        "quality",
        "quantity",
        "successively",
        "acquired",
        "consequently",
        "interested",
        "measuring",
        "local",
        "motion",
        "term",
        "action",
        "cause",
        "motion",
        "distance",
        "traversed",
        "time",
        "elapsed",
        "intensity",
        "speed",
        "question",
        "physic",
        "kilvington",
        "describes",
        "difference",
        "various",
        "type",
        "change",
        "generation",
        "alteration",
        "augmentation",
        "determines",
        "measurement",
        "active",
        "passive",
        "capacity",
        "cause",
        "change",
        "find",
        "rule",
        "division",
        "various",
        "type",
        "continuum",
        "formulates",
        "mathematically",
        "consistent",
        "rule",
        "local",
        "motion",
        "examines",
        "problem",
        "motion",
        "two",
        "point",
        "view",
        "regard",
        "cause",
        "regard",
        "effect",
        "see",
        "jungpalczewska",
        "b",
        "kilvington",
        "discussion",
        "measure",
        "motion",
        "respect",
        "cause",
        "would",
        "call",
        "dynamic",
        "analysis",
        "physical",
        "aspect",
        "involving",
        "relation",
        "acting",
        "resistive",
        "potency",
        "mathematical",
        "aspect",
        "involving",
        "concept",
        "continuity",
        "limit",
        "interested",
        "capacity",
        "bounded",
        "active",
        "passive",
        "potency",
        "subject",
        "weakening",
        "strengthening",
        "mutable",
        "immutable",
        "determine",
        "boundary",
        "active",
        "potency",
        "body",
        "move",
        "medium",
        "uniformly",
        "resistant",
        "mathematical",
        "character",
        "kilvington",
        "theory",
        "seen",
        "use",
        "two",
        "kind",
        "limit",
        "continuous",
        "sequence",
        "intrinsic",
        "boundary",
        "element",
        "member",
        "sequence",
        "element",
        "bound",
        "maximum",
        "quod",
        "sic",
        "minimum",
        "quod",
        "sic",
        "extrinsic",
        "boundary",
        "element",
        "serf",
        "boundary",
        "stand",
        "outside",
        "range",
        "element",
        "bound",
        "maximum",
        "quod",
        "non",
        "minimum",
        "quod",
        "non",
        "although",
        "formulate",
        "strict",
        "rule",
        "different",
        "type",
        "division",
        "continuum",
        "study",
        "case",
        "reveal",
        "approved",
        "following",
        "condition",
        "existence",
        "limit",
        "must",
        "range",
        "capacity",
        "act",
        "acted",
        "another",
        "range",
        "act",
        "acted",
        "capacity",
        "capable",
        "taking",
        "continuous",
        "range",
        "value",
        "zero",
        "value",
        "serf",
        "boundary",
        "value",
        "according",
        "aristotle",
        "physic",
        "viii",
        "motion",
        "occurs",
        "ratio",
        "acting",
        "capacity",
        "force",
        "f",
        "passive",
        "capacity",
        "resistance",
        "r",
        "ratio",
        "major",
        "inequality",
        "ie",
        "greater",
        "kilvington",
        "maintains",
        "small",
        "excess",
        "force",
        "resistance",
        "suffices",
        "motion",
        "commence",
        "continue",
        "thus",
        "whenever",
        "force",
        "greater",
        "resistance",
        "motion",
        "occurs",
        "dm",
        "assumes",
        "force",
        "active",
        "capacity",
        "bounded",
        "minimum",
        "upon",
        "act",
        "minimum",
        "quod",
        "non",
        "ie",
        "resistance",
        "equal",
        "dm",
        "passive",
        "capacity",
        "kilvington",
        "accepts",
        "minimum",
        "quod",
        "sic",
        "limit",
        "respect",
        "circumstance",
        "accepts",
        "aristotle",
        "claim",
        "establish",
        "limit",
        "socrates",
        "passive",
        "capacity",
        "vision",
        "point",
        "smallest",
        "thing",
        "see",
        "however",
        "also",
        "happens",
        "see",
        "great",
        "thing",
        "cathedral",
        "close",
        "therefore",
        "passive",
        "capacity",
        "described",
        "minimum",
        "quod",
        "sic",
        "limit",
        "case",
        "dm",
        "clear",
        "kilvington",
        "belief",
        "mathematics",
        "legitimate",
        "method",
        "describing",
        "natural",
        "phenomenon",
        "also",
        "allowed",
        "formulate",
        "new",
        "rule",
        "local",
        "motion",
        "kilvington",
        "agrees",
        "proper",
        "way",
        "measuring",
        "speed",
        "motion",
        "describe",
        "variation",
        "proportion",
        "force",
        "resistance",
        "aware",
        "aristotle",
        "averroes",
        "rule",
        "motion",
        "given",
        "physic",
        "vii",
        "universally",
        "applicable",
        "convinced",
        "correct",
        "calculus",
        "proportion",
        "formulated",
        "euclid",
        "element",
        "consequence",
        "noticed",
        "proper",
        "understanding",
        "euclid",
        "definition",
        "operation",
        "proportion",
        "necessitates",
        "new",
        "interpretation",
        "aristotle",
        "averroes",
        "theory",
        "motion",
        "one",
        "hand",
        "euclid",
        "archimedes",
        "theory",
        "operation",
        "proportion",
        "concludes",
        "doubling",
        "ratio",
        "corresponds",
        "squaring",
        "fraction",
        "form",
        "ratio",
        "hand",
        "aristotle",
        "averroes",
        "statement",
        "clearly",
        "indicate",
        "speed",
        "proportional",
        "proportion",
        "active",
        "power",
        "resistance",
        "squared",
        "simply",
        "multiplied",
        "two",
        "noticed",
        "inconsistency",
        "two",
        "view",
        "kilvington",
        "first",
        "presented",
        "two",
        "main",
        "argument",
        "aristotelian",
        "proposition",
        "finally",
        "concluded",
        "talking",
        "power",
        "moving",
        "one",
        "half",
        "mobile",
        "something",
        "moveable",
        "aristotle",
        "mean",
        "precisely",
        "double",
        "ratio",
        "f",
        "r",
        "talking",
        "power",
        "moving",
        "mobile",
        "twice",
        "heavy",
        "mean",
        "taking",
        "square",
        "root",
        "ratio",
        "f",
        "r",
        "new",
        "mathematical",
        "rule",
        "describing",
        "speed",
        "motion",
        "accord",
        "aristotle",
        "one",
        "case",
        "ratio",
        "power",
        "mover",
        "mobile",
        "power",
        "move",
        "half",
        "mobile",
        "exactly",
        "twice",
        "speed",
        "kilvington",
        "reinterpretation",
        "aristotle",
        "averroes",
        "rule",
        "motion",
        "reveals",
        "speed",
        "described",
        "multiplication",
        "alone",
        "kilvington",
        "calculus",
        "provides",
        "value",
        "ratio",
        "f",
        "r",
        "greater",
        "speed",
        "zero",
        "since",
        "root",
        "ratio",
        "greater",
        "always",
        "ratio",
        "greater",
        "additional",
        "assumption",
        "excess",
        "however",
        "small",
        "active",
        "power",
        "resistance",
        "sufficient",
        "initiate",
        "continue",
        "motion",
        "may",
        "described",
        "slow",
        "motion",
        "speed",
        "greater",
        "le",
        "v",
        "hence",
        "avoids",
        "serious",
        "weakness",
        "aristotle",
        "theory",
        "explain",
        "mathematical",
        "relation",
        "f",
        "r",
        "slow",
        "motion",
        "speed",
        "le",
        "jung",
        "a",
        "kilvington",
        "applies",
        "new",
        "rule",
        "motion",
        "describe",
        "uniformly",
        "difform",
        "motion",
        "mixed",
        "body",
        "motion",
        "simple",
        "body",
        "medium",
        "vacuum",
        "explaining",
        "kilvington",
        "theory",
        "must",
        "keep",
        "mind",
        "temporal",
        "motion",
        "possible",
        "resistance",
        "playing",
        "role",
        "virtu",
        "impeditiva",
        "motion",
        "mixed",
        "body",
        "medium",
        "easiest",
        "explain",
        "since",
        "acting",
        "power",
        "overcome",
        "external",
        "resistance",
        "medium",
        "well",
        "internal",
        "resistance",
        "element",
        "moved",
        "away",
        "natural",
        "place",
        "local",
        "motion",
        "simple",
        "body",
        "medium",
        "problematic",
        "either",
        "since",
        "explained",
        "natural",
        "desire",
        "attain",
        "natural",
        "place",
        "determined",
        "heaviness",
        "lightness",
        "kilvington",
        "problem",
        "explaining",
        "natural",
        "motion",
        "mixed",
        "body",
        "vacuum",
        "adopts",
        "ockham",
        "view",
        "void",
        "would",
        "place",
        "since",
        "place",
        "aristotelian",
        "sense",
        "something",
        "natural",
        "essential",
        "quality",
        "determines",
        "natural",
        "motion",
        "elementary",
        "body",
        "moreover",
        "inclination",
        "remain",
        "rest",
        "natural",
        "place",
        "accordingly",
        "say",
        "kilvington",
        "one",
        "could",
        "imagine",
        "void",
        "four",
        "natural",
        "sphere",
        "despite",
        "empty",
        "preserve",
        "proper",
        "quality",
        "characteristic",
        "natural",
        "place",
        "earth",
        "water",
        "air",
        "fire",
        "hence",
        "temporal",
        "motion",
        "mixed",
        "body",
        "void",
        "result",
        "natural",
        "inclination",
        "heavy",
        "light",
        "element",
        "attain",
        "natural",
        "place",
        "heaviness",
        "lightness",
        "play",
        "role",
        "force",
        "resistance",
        "respectively",
        "although",
        "would",
        "external",
        "resistance",
        "vacuum",
        "motion",
        "mixed",
        "body",
        "could",
        "occur",
        "without",
        "difficulty",
        "see",
        "jungpalczewska",
        "temporal",
        "motion",
        "simple",
        "body",
        "vacuum",
        "difficult",
        "explain",
        "opinion",
        "averroes",
        "simple",
        "body",
        "piece",
        "earth",
        "elementary",
        "form",
        "prime",
        "matter",
        "different",
        "quantitative",
        "part",
        "form",
        "resist",
        "matter",
        "resistance",
        "come",
        "qualitative",
        "part",
        "resistance",
        "coming",
        "quantitative",
        "part",
        "resisting",
        "one",
        "another",
        "time",
        "kilvington",
        "us",
        "grosseteste",
        "idea",
        "recognizing",
        "temporal",
        "motion",
        "simple",
        "body",
        "vacuum",
        "possible",
        "due",
        "internal",
        "resistance",
        "arises",
        "peripheral",
        "part",
        "body",
        "move",
        "along",
        "oblique",
        "line",
        "resist",
        "central",
        "part",
        "moving",
        "along",
        "straight",
        "line",
        "internal",
        "resistance",
        "produce",
        "motion",
        "impede",
        "nevertheless",
        "guarantee",
        "temporal",
        "motion",
        "consequently",
        "vacuum",
        "existed",
        "natural",
        "motion",
        "simple",
        "body",
        "would",
        "possible",
        "moreover",
        "speed",
        "motion",
        "would",
        "fastest",
        "since",
        "external",
        "resistance",
        "overcome",
        "jungpalczewska",
        "a",
        "kilvington",
        "opinion",
        "lower",
        "greater",
        "resistance",
        "ie",
        "rarity",
        "density",
        "medium",
        "responsible",
        "faster",
        "slower",
        "motion",
        "distance",
        "medium",
        "traversed",
        "motion",
        "responsible",
        "longer",
        "shorter",
        "time",
        "consumed",
        "motion",
        "according",
        "kilvington",
        "order",
        "characterize",
        "change",
        "speed",
        "motion",
        "one",
        "must",
        "analyze",
        "problem",
        "local",
        "motion",
        "kinematic",
        "aspect",
        "take",
        "account",
        "distance",
        "traversed",
        "time",
        "consumed",
        "correctly",
        "recognizes",
        "measure",
        "speed",
        "motion",
        "last",
        "time",
        "enough",
        "establish",
        "relation",
        "time",
        "distance",
        "traversed",
        "opinion",
        "distance",
        "traversed",
        "equal",
        "interval",
        "time",
        "characterize",
        "uniform",
        "motion",
        "uniformly",
        "difform",
        "motion",
        "characterized",
        "respectively",
        "accelerated",
        "motion",
        "distance",
        "traversed",
        "shorter",
        "interval",
        "time",
        "decelerated",
        "motion",
        "distance",
        "traversed",
        "longer",
        "time",
        "according",
        "modern",
        "definition",
        "motion",
        "uniformly",
        "difforme",
        "speed",
        "change",
        "equal",
        "amount",
        "equal",
        "interval",
        "kilvington",
        "provides",
        "proper",
        "description",
        "free",
        "fall",
        "noting",
        "speed",
        "increase",
        "amount",
        "time",
        "interval",
        "speed",
        "equally",
        "slower",
        "beginning",
        "interval",
        "end",
        "difformly",
        "difform",
        "motion",
        "characterized",
        "unequal",
        "distance",
        "traversed",
        "unequal",
        "interval",
        "time",
        "speed",
        "motion",
        "change",
        "unequally",
        "see",
        "jungpalczewska",
        "b",
        "although",
        "kilvington",
        "never",
        "abandoned",
        "aristotle",
        "physic",
        "often",
        "go",
        "beyond",
        "theory",
        "resolve",
        "paradox",
        "resulting",
        "law",
        "giving",
        "impression",
        "behind",
        "facade",
        "aristotle",
        "principle",
        "concept",
        "kilvington",
        "ockhamist",
        "despite",
        "fact",
        "kilvington",
        "never",
        "explicitly",
        "mention",
        "ockham",
        "doubt",
        "knew",
        "venerable",
        "inceptor",
        "opinion",
        "also",
        "accepted",
        "natural",
        "way",
        "interpret",
        "work",
        "philosopher"
    ]
}