{
    "main_text": "Contemporary Views on Acquaintance\n2. Contemporary Views on Acquaintance\n\nWe said above that what distinguishes the classical, Russellian notion\nof acquaintance is, minimally, that (i) it is a non-intentional form\nof awareness: acquaintance with something does not consist in forming\nany judgment or thought about it, or applying any concepts to it; and\n(ii) it is real relation requiring the existence of its\nrelata; one cannot be acquainted with some thing, property or\nfact that does not exist. Let us use the label “acquaintance\ntheory” broadly to stand for any view, in the philosophy of mind\nor epistemology, in which acquaintance so understood plays a central\nrole. There has been a resurgence of interest in acquaintance theory\nin the last 25 years or so. Contemporary proponents include BonJour\n(2001, 2003), Chalmers (2010), Fales (1996), Fumerton (1995, 2001,\n2016), Gertler (2001, 2011, 2012), Hasan (2011, 2013), McGrew (1995,\n1999), Moser (1989), Stoutenburg (forthcoming), and Taylor (2013). As\nwe shall see, some of these philosophers depart from Russell in\nsignificant ways. However, like him, they are all committed to the\nexistence and philosophical significance of a direct, nonjudgmental\nform of awareness (indeed, many of them call it\n“acquaintance”) and this warrants treating them all as\n“acquaintance theorists.” Most of them also explicitly\nendorse classical foundationalism: like Russell, they hold that all\nknowledge or justified belief ultimately depends on a foundation of\nknowledge or justified belief acquired by acquaintance. There are\nconsistent ways to accept acquaintance theory without accepting\nclassical foundationalism. For example, some might agree that we do\nhave some knowledge by acquaintance and appeal to such knowledge in\nthe dualism debate in the philosophy of mind (see the entry on\n qualia: the knowledge argument),\n without endorsing the claim that all knowledge or justified belief\nmust depend, ultimately, on acquaintance. However, unless otherwise\nindicated, we use “acquaintance theory” and\n“classical foundationalism” interchangeably.\n\nAcquaintance is typically taken to be simple and thus indefinable. The\nphilosophers for whom acquaintance plays a critical philosophical role\nare usually unapologetic about their inability to define the concept\n(e.g., Fumerton 1995: 76–7). They will quite plausibly argue\nthat analysis requires conceptual “atoms”—simple\nideas out of which other ideas are built. The concept of acquaintance,\nfor them, is arguably the most fundamental concept on which all\nepistemology, and perhaps all philosophy of mind, is built. Still, one\nphilosopher’s conceptual atom is another’s complete\nmystery, and unless one can convince oneself that one understands what\nacquaintance is, one will not be able to understand views that invoke\nit.\n\nTo be sure, one can use metaphors of one sort or another to explain\nthe concept, but the metaphors are as likely to be misleading as\nhelpful. The pain one feels, one might say, is “before”\nthe mind. There is nothing “between” one and the pain one\nfeels. But these are spatial metaphors and the relation between\none’s self and that with which one is acquainted is not really\nall that much like a spatial relation. Even if there is no object\nbetween a chair and a table, the space between them is composed of\nother spaces, and in virtue of this we can compare different spaces or\ndistances quantitatively; in contrast, acquaintance with something is\nnot composed of further relations, and so different relations of\nacquaintance cannot be compared quantitatively in a parallel way. One\ncan add that acquaintance is a non-intentional or nonjudgmental form\nof awareness, and that one cannot be aware of something in this way\nwithout its existing, but the concept of awareness remains unanalyzed,\nand these conditions merely assert that, and shed no light on why,\nacquaintance has these features.\n\nIf the usual view is correct and acquaintance is simple and\nunanalyzable, nevertheless, perhaps one can point to it by describing\nit in some revealing way that is unique to it. Unfortunately, the\nattempt at pointing involves controversial presuppositions. But\nimagine the following sort of familiar case. One is in pain but as one\nengages in an interesting conversation, one doesn’t notice the\npain for a while. After the conversation ends, one is again aware of\nthe pain. There are two possibilities. One is that the pain\ntemporarily ceased. The other is that the pain continued, but that the\nsubject was temporarily unaware of it. On the supposition that the\nlatter makes sense, acquaintance is that relation the subject had to\npain before the conversation, the relation that ceased during the\nconversation, and that began again shortly thereafter. \n\nThe acquaintance theory is controversial, the idea that some things\ncan simply be “given” to the subject has often been\ndenounced as a “myth” (Sellars 1963), and those committed\nto acquaintance disagree about its nature and its objects. All this\nmay seem to be a source of embarrassment for the acquaintance\ntheorist, for how could doubts and disagreements arise regarding what\nis supposed to be immediately and transparently present to\nconsciousness? But there is no need for embarrassment. For the\nproponent of acquaintance or the given, the lesson of these doubts and\ndisagreements is that from the fact that something is given it does\nnot follow that everything about the nature of the given or its\nepistemic role is itself given; “profound puzzles can arise, and\nlegitimately demand solution, even in connection with that which is\nindubitable” (Fales 1996: 2). (For some elaboration on the\nacquaintance theorist’s response to the existence of such doubts\nand disagreements, see the\n concluding remarks.)\n\nSome acquaintance theorists seem to disagree about the nature of\nacquaintance. Fumerton regards acquaintance as a sui generis\nrelation; it “cannot be informatively subsumed under a\ngenus, and…cannot be analyzed into any less problematic\nconcepts” (1995: 76). It is an irreducible relation that can\nhold between a self and some object, state, property, or fact. Like\nFumerton and other acquaintance theorists, BonJour agrees that there\nis a form of awareness that is nonjudgmental and that is\n“infallible” in the sense that it requires the existence\nof its object; and like other classical foundationalists, he takes all\njustified beliefs (or at least all justified empirical beliefs) to\ndepend, ultimately, on this form of awareness. Unlike Fumerton\nhowever, BonJour (2003) takes this awareness to be a\n“built-in” or intrinsic to conscious or experiential\nstates. On this view, awareness is not a relation between the self and\nsomething else, but is an intrinsic feature of the mental state\nitself, though one that is still relational in the sense that it is\ndirected at something; and what one is aware of is just the specific\ncharacter or content of that state of awareness. So, while Fumerton\ntakes the fundamental awareness or acquaintance to be a relation,\nBonJour takes it to be an intrinsic feature of all experiences or\nconscious states. Awareness or acquaintance is perhaps most naturally\nthought of as a relation between a self and something else: we\ntypically talk of people, animals, persons, selves, minds,\netc. being aware of things, states, properties, or\nfacts. However, a view that regards the most fundamental sort of\nawareness as an intrinsic property of certain mental states might\nstill be able to make sense of such talk: to say that I am directly\naware of X is just to say that I am in a state with\n“built-in” awareness of X.\n\nBonJour’s view is similar to the view that conscious states are\nself-representational in that the awareness of some content or feature\nof the state is itself part of that state, but it is important not to\noverstate the similarity. For BonJour, conscious states are in a\nsense, as Chisholm might put it, self-presenting, but they\nare not self-representing. BonJour denies that direct\nawareness of something is intentional or representational, or that it\nessentially involves a thought about or representation of it.\nAgain, like all acquaintance theorists, he takes the sort of awareness\nunderlying all foundationally justified belief to be unmediated by any\nbelief or representation, and to guarantee the existence of its\nobject: one cannot be directly aware of something that does not exist.\n\n\nBonJour’s view of acquaintance seems to explain why, as\nproponents of the acquaintance approach tend to hold, one cannot be\nacquainted with external world objects or external world facts\n(BonJour 2001: 31). If acquaintance is a “built-in”\nfeature of conscious states in virtue of which one can be aware only\nof intrinsic features of that very state, then on the plausible\nassumption that ordinary physical objects and their intrinsic features\nare not intrinsic features of mental states, one cannot have\nacquaintance with such objects or their features. On the other hand,\nFumerton’s relational view of acquaintance, like the traditional\nRussellian view, seems to allow for the possibility of acquaintance\nwith abstract entities such as universals, which some acquaintance\ntheorists appeal to in order to make sense of the possibility of\nthought and a priori knowledge\n (see section 4).\n There is room for more work here in investigating the nature of\nacquaintance and its implications.\n\nIt’s also worth noting that although talk of acquaintance often\nbrings sense-datum theory to mind, there is nothing about the\ncommitment to acquaintance itself that entails such a commitment.\nAccording to sense datum theory, whenever one has a sensory experience\nas of some object having some property F, there is some object\npresent that has the property F. For example, if I have a\nsensory experience as of a green triangle, then there is something\npresent that is green and triangular. And since I could have this\nsensory experience even while hallucinating (at least according to\nsense datum theorists), this object that is green and triangular is\nnot a physical object. In contrast to the sense datum theorist who\ntreats the sensed property F as a feature of some object of\nwhich the subject is aware, the adverbialist or advocate of the theory\nof appearing treats it as a way of sensing or experiencing. To dance a\nwaltz is not to do something or perform some act, viz., dancing, that\ntakes something else, a waltz, as its object, but is rather a way or\nmanner of dancing—dancing waltzily; similarly, to experience or\nhave an appearance of green is not to have an act of awareness that\ntakes a green object as its target, but is rather a way of\nexperiencing or being appeared to—“experiencing\ngreenly”, or “being appeared to greenly.” The\nacquaintance approach is compatible with adverbialism regarding sense\nexperience; one might be acquainted with experiential states, and with\none’s experiencing greenly, as opposed to being acquainted with\nsome green object, and with its being green. (See, for example,\nFumerton 1985: 94–5; McGrew 1995: 93–4; and Chalmers 2010:\n291.) Alternatively, some acquaintance theorists take perceptual or\nsensory experience to involve acquaintance with universals,\nand hope thereby to avoid problems with both the sense datum theory\nand the adverbial theory. For an interesting defense of this view, see\nForrest (2005). (For more on sense datum theory and adverbialism, see\nthe entry on\n the problem of perception.)\n\nAs we have seen, the familiar experience of temporarily failing to\nnotice one’s pain while engrossed in conversation serves as a\npotential illustration of acquaintance. In at least some such cases,\nthe pain does not disappear entirely, even though one no longer\nnotices it. Some may be inclined to deny that one can have a pain\nwithout being in some way aware or conscious of the pain. (BonJour\n2003 seems to hold this view. See also, Chalmers 2010: 291.) But it\ndoes seem that the sort of case Fumerton describes is a genuinely\npossible, indeed frequent, occurrence, and that the act of noticing\none’s pain is not a mere predication of one concept to another\n(e.g., predication of the concept pain to the concept\npresent experience), but an act of fixing one’s mental\ngaze, so to speak, on some particular feature or aspect of one’s\nexperience. A relation of acquaintance seems to provide just what is\nneeded here: if acquaintance is a relation that one can stand in to\none’s experience or to some feature of the experience, that\nwould account for the possibility of having an experience of\nsomething, like a pain or some other sensation, temporarily failing to\nnotice it, and then noticing it again. Can BonJour’s account\nhandle such cases as well? BonJour does qualify the awareness required\nfor justification in a particular way that may help him to make sense\nof such cases. I can be conscious of or directly aware of a great many\nfeatures simultaneously, but can attend to only a few\nfeatures at any one time. For BonJour, attention is not entirely\nseparate from the built-in awareness, but is “built upon it via\nwhat might be described as a selective focus” (2003: 192). So,\nwhile I cannot be in pain without being conscious of or aware of the\npain, I can be in pain without attending specifically or selectively\nto the pain. Gertler (2001) presents an account of the justification\nof introspective beliefs that takes attention as a primitive, direct\nawareness. Though the connection to acquaintance is not explicit\nthere, in more recent work Gertler defends the same view as an\n“acquaintance approach” to introspective knowledge, so\ncalled because it is inspired by Russell’s theory of\nacquaintance (2011, 2012). She seems to regard demonstrative attention\n(the sort of attention that makes possible introspective judgments\nwith demonstrative content, e.g., “I am experiencing\nthis property”) as made possible by acquaintance\n(2012). Taylor (2013) discusses a number of phenomenological and\ntheoretical advantages to identifying acquaintance with attentive\nawareness.\n\nTo summarize, there is a great deal of agreement among philosophers\nwho adopt the acquaintance approach: they all take there to be an\nepistemically fundamental awareness that is unmediated and\nnonconceptual, a form of awareness that secures the existence of its\nobject. There seems to be some disagreement regarding the nature of\nacquaintance, e.g., whether it is fundamentally a relation between the\nself and the target of awareness, or an intrinsic,\n“built-in” aspect or feature of some mental states; and\nwhether it consists in attention. There may also be some disagreement\nregarding the possible objects or targets of acquaintance. And, as we\nshall see below, there is also some disagreement regarding the proper\nanalysis of noninferential knowledge or justified belief, and how\nacquaintance figures in that analysis.\n",
    "section_title": "2. Contemporary Views on Acquaintance",
    "entry_title": "Knowledge by Acquaintance vs. Description",
    "hierarchy_title": "Knowledge by Acquaintance vs. Description || Contemporary Views on Acquaintance",
    "tokenized_text": [
        "contemporary",
        "view",
        "acquaintance",
        "contemporary",
        "view",
        "acquaintance",
        "said",
        "distinguishes",
        "classical",
        "russellian",
        "notion",
        "acquaintance",
        "minimally",
        "nonintentional",
        "form",
        "awareness",
        "acquaintance",
        "something",
        "consist",
        "forming",
        "judgment",
        "thought",
        "applying",
        "concept",
        "ii",
        "real",
        "relation",
        "requiring",
        "existence",
        "relatum",
        "one",
        "acquainted",
        "thing",
        "property",
        "fact",
        "exist",
        "let",
        "u",
        "use",
        "label",
        "acquaintance",
        "theory",
        "broadly",
        "stand",
        "view",
        "philosophy",
        "mind",
        "epistemology",
        "acquaintance",
        "understood",
        "play",
        "central",
        "role",
        "resurgence",
        "interest",
        "acquaintance",
        "theory",
        "last",
        "year",
        "contemporary",
        "proponent",
        "include",
        "bonjour",
        "chalmers",
        "fales",
        "fumerton",
        "gertler",
        "hasan",
        "mcgrew",
        "moser",
        "stoutenburg",
        "forthcoming",
        "taylor",
        "shall",
        "see",
        "philosopher",
        "depart",
        "russell",
        "significant",
        "way",
        "however",
        "like",
        "committed",
        "existence",
        "philosophical",
        "significance",
        "direct",
        "nonjudgmental",
        "form",
        "awareness",
        "indeed",
        "many",
        "call",
        "acquaintance",
        "warrant",
        "treating",
        "acquaintance",
        "theorists",
        "also",
        "explicitly",
        "endorse",
        "classical",
        "foundationalism",
        "like",
        "russell",
        "hold",
        "knowledge",
        "justified",
        "belief",
        "ultimately",
        "depends",
        "foundation",
        "knowledge",
        "justified",
        "belief",
        "acquired",
        "acquaintance",
        "consistent",
        "way",
        "accept",
        "acquaintance",
        "theory",
        "without",
        "accepting",
        "classical",
        "foundationalism",
        "example",
        "might",
        "agree",
        "knowledge",
        "acquaintance",
        "appeal",
        "knowledge",
        "dualism",
        "debate",
        "philosophy",
        "mind",
        "see",
        "entry",
        "qualia",
        "knowledge",
        "argument",
        "without",
        "endorsing",
        "claim",
        "knowledge",
        "justified",
        "belief",
        "must",
        "depend",
        "ultimately",
        "acquaintance",
        "however",
        "unless",
        "otherwise",
        "indicated",
        "use",
        "acquaintance",
        "theory",
        "classical",
        "foundationalism",
        "interchangeably",
        "acquaintance",
        "typically",
        "taken",
        "simple",
        "thus",
        "indefinable",
        "philosopher",
        "acquaintance",
        "play",
        "critical",
        "philosophical",
        "role",
        "usually",
        "unapologetic",
        "inability",
        "define",
        "concept",
        "eg",
        "fumerton",
        "quite",
        "plausibly",
        "argue",
        "analysis",
        "requires",
        "conceptual",
        "atom",
        "simple",
        "idea",
        "idea",
        "built",
        "concept",
        "acquaintance",
        "arguably",
        "fundamental",
        "concept",
        "epistemology",
        "perhaps",
        "philosophy",
        "mind",
        "built",
        "still",
        "one",
        "philosopher",
        "conceptual",
        "atom",
        "another",
        "complete",
        "mystery",
        "unless",
        "one",
        "convince",
        "oneself",
        "one",
        "understands",
        "acquaintance",
        "one",
        "able",
        "understand",
        "view",
        "invoke",
        "sure",
        "one",
        "use",
        "metaphor",
        "one",
        "sort",
        "another",
        "explain",
        "concept",
        "metaphor",
        "likely",
        "misleading",
        "helpful",
        "pain",
        "one",
        "feel",
        "one",
        "might",
        "say",
        "mind",
        "nothing",
        "one",
        "pain",
        "one",
        "feel",
        "spatial",
        "metaphor",
        "relation",
        "one",
        "self",
        "one",
        "acquainted",
        "really",
        "much",
        "like",
        "spatial",
        "relation",
        "even",
        "object",
        "chair",
        "table",
        "space",
        "composed",
        "space",
        "virtue",
        "compare",
        "different",
        "space",
        "distance",
        "quantitatively",
        "contrast",
        "acquaintance",
        "something",
        "composed",
        "relation",
        "different",
        "relation",
        "acquaintance",
        "compared",
        "quantitatively",
        "parallel",
        "way",
        "one",
        "add",
        "acquaintance",
        "nonintentional",
        "nonjudgmental",
        "form",
        "awareness",
        "one",
        "aware",
        "something",
        "way",
        "without",
        "existing",
        "concept",
        "awareness",
        "remains",
        "unanalyzed",
        "condition",
        "merely",
        "assert",
        "shed",
        "light",
        "acquaintance",
        "feature",
        "usual",
        "view",
        "correct",
        "acquaintance",
        "simple",
        "unanalyzable",
        "nevertheless",
        "perhaps",
        "one",
        "point",
        "describing",
        "revealing",
        "way",
        "unique",
        "unfortunately",
        "attempt",
        "pointing",
        "involves",
        "controversial",
        "presupposition",
        "imagine",
        "following",
        "sort",
        "familiar",
        "case",
        "one",
        "pain",
        "one",
        "engages",
        "interesting",
        "conversation",
        "one",
        "notice",
        "pain",
        "conversation",
        "end",
        "one",
        "aware",
        "pain",
        "two",
        "possibility",
        "one",
        "pain",
        "temporarily",
        "ceased",
        "pain",
        "continued",
        "subject",
        "temporarily",
        "unaware",
        "supposition",
        "latter",
        "make",
        "sense",
        "acquaintance",
        "relation",
        "subject",
        "pain",
        "conversation",
        "relation",
        "ceased",
        "conversation",
        "began",
        "shortly",
        "thereafter",
        "acquaintance",
        "theory",
        "controversial",
        "idea",
        "thing",
        "simply",
        "given",
        "subject",
        "often",
        "denounced",
        "myth",
        "sellars",
        "committed",
        "acquaintance",
        "disagree",
        "nature",
        "object",
        "may",
        "seem",
        "source",
        "embarrassment",
        "acquaintance",
        "theorist",
        "could",
        "doubt",
        "disagreement",
        "arise",
        "regarding",
        "supposed",
        "immediately",
        "transparently",
        "present",
        "consciousness",
        "need",
        "embarrassment",
        "proponent",
        "acquaintance",
        "given",
        "lesson",
        "doubt",
        "disagreement",
        "fact",
        "something",
        "given",
        "follow",
        "everything",
        "nature",
        "given",
        "epistemic",
        "role",
        "given",
        "profound",
        "puzzle",
        "arise",
        "legitimately",
        "demand",
        "solution",
        "even",
        "connection",
        "indubitable",
        "fales",
        "elaboration",
        "acquaintance",
        "theorist",
        "response",
        "existence",
        "doubt",
        "disagreement",
        "see",
        "concluding",
        "remark",
        "acquaintance",
        "theorist",
        "seem",
        "disagree",
        "nature",
        "acquaintance",
        "fumerton",
        "regard",
        "acquaintance",
        "sui",
        "generis",
        "relation",
        "informatively",
        "subsumed",
        "genus",
        "and",
        "analyzed",
        "le",
        "problematic",
        "concept",
        "irreducible",
        "relation",
        "hold",
        "self",
        "object",
        "state",
        "property",
        "fact",
        "like",
        "fumerton",
        "acquaintance",
        "theorist",
        "bonjour",
        "agrees",
        "form",
        "awareness",
        "nonjudgmental",
        "infallible",
        "sense",
        "requires",
        "existence",
        "object",
        "like",
        "classical",
        "foundationalists",
        "take",
        "justified",
        "belief",
        "least",
        "justified",
        "empirical",
        "belief",
        "depend",
        "ultimately",
        "form",
        "awareness",
        "unlike",
        "fumerton",
        "however",
        "bonjour",
        "take",
        "awareness",
        "builtin",
        "intrinsic",
        "conscious",
        "experiential",
        "state",
        "view",
        "awareness",
        "relation",
        "self",
        "something",
        "else",
        "intrinsic",
        "feature",
        "mental",
        "state",
        "though",
        "one",
        "still",
        "relational",
        "sense",
        "directed",
        "something",
        "one",
        "aware",
        "specific",
        "character",
        "content",
        "state",
        "awareness",
        "fumerton",
        "take",
        "fundamental",
        "awareness",
        "acquaintance",
        "relation",
        "bonjour",
        "take",
        "intrinsic",
        "feature",
        "experience",
        "conscious",
        "state",
        "awareness",
        "acquaintance",
        "perhaps",
        "naturally",
        "thought",
        "relation",
        "self",
        "something",
        "else",
        "typically",
        "talk",
        "people",
        "animal",
        "person",
        "self",
        "mind",
        "etc",
        "aware",
        "thing",
        "state",
        "property",
        "fact",
        "however",
        "view",
        "regard",
        "fundamental",
        "sort",
        "awareness",
        "intrinsic",
        "property",
        "certain",
        "mental",
        "state",
        "might",
        "still",
        "able",
        "make",
        "sense",
        "talk",
        "say",
        "directly",
        "aware",
        "x",
        "say",
        "state",
        "builtin",
        "awareness",
        "x",
        "bonjour",
        "view",
        "similar",
        "view",
        "conscious",
        "state",
        "selfrepresentational",
        "awareness",
        "content",
        "feature",
        "state",
        "part",
        "state",
        "important",
        "overstate",
        "similarity",
        "bonjour",
        "conscious",
        "state",
        "sense",
        "chisholm",
        "might",
        "put",
        "selfpresenting",
        "selfrepresenting",
        "bonjour",
        "denies",
        "direct",
        "awareness",
        "something",
        "intentional",
        "representational",
        "essentially",
        "involves",
        "thought",
        "representation",
        "like",
        "acquaintance",
        "theorist",
        "take",
        "sort",
        "awareness",
        "underlying",
        "foundationally",
        "justified",
        "belief",
        "unmediated",
        "belief",
        "representation",
        "guarantee",
        "existence",
        "object",
        "one",
        "directly",
        "aware",
        "something",
        "exist",
        "bonjour",
        "view",
        "acquaintance",
        "seems",
        "explain",
        "proponent",
        "acquaintance",
        "approach",
        "tend",
        "hold",
        "one",
        "acquainted",
        "external",
        "world",
        "object",
        "external",
        "world",
        "fact",
        "bonjour",
        "acquaintance",
        "builtin",
        "feature",
        "conscious",
        "state",
        "virtue",
        "one",
        "aware",
        "intrinsic",
        "feature",
        "state",
        "plausible",
        "assumption",
        "ordinary",
        "physical",
        "object",
        "intrinsic",
        "feature",
        "intrinsic",
        "feature",
        "mental",
        "state",
        "one",
        "acquaintance",
        "object",
        "feature",
        "hand",
        "fumerton",
        "relational",
        "view",
        "acquaintance",
        "like",
        "traditional",
        "russellian",
        "view",
        "seems",
        "allow",
        "possibility",
        "acquaintance",
        "abstract",
        "entity",
        "universal",
        "acquaintance",
        "theorist",
        "appeal",
        "order",
        "make",
        "sense",
        "possibility",
        "thought",
        "priori",
        "knowledge",
        "see",
        "section",
        "room",
        "work",
        "investigating",
        "nature",
        "acquaintance",
        "implication",
        "also",
        "worth",
        "noting",
        "although",
        "talk",
        "acquaintance",
        "often",
        "brings",
        "sensedatum",
        "theory",
        "mind",
        "nothing",
        "commitment",
        "acquaintance",
        "entail",
        "commitment",
        "according",
        "sense",
        "datum",
        "theory",
        "whenever",
        "one",
        "sensory",
        "experience",
        "object",
        "property",
        "f",
        "object",
        "present",
        "property",
        "f",
        "example",
        "sensory",
        "experience",
        "green",
        "triangle",
        "something",
        "present",
        "green",
        "triangular",
        "since",
        "could",
        "sensory",
        "experience",
        "even",
        "hallucinating",
        "least",
        "according",
        "sense",
        "datum",
        "theorist",
        "object",
        "green",
        "triangular",
        "physical",
        "object",
        "contrast",
        "sense",
        "datum",
        "theorist",
        "treat",
        "sensed",
        "property",
        "f",
        "feature",
        "object",
        "subject",
        "aware",
        "adverbialist",
        "advocate",
        "theory",
        "appearing",
        "treat",
        "way",
        "sensing",
        "experiencing",
        "dance",
        "waltz",
        "something",
        "perform",
        "act",
        "viz",
        "dancing",
        "take",
        "something",
        "else",
        "waltz",
        "object",
        "rather",
        "way",
        "manner",
        "dancingdancing",
        "waltzily",
        "similarly",
        "experience",
        "appearance",
        "green",
        "act",
        "awareness",
        "take",
        "green",
        "object",
        "target",
        "rather",
        "way",
        "experiencing",
        "appeared",
        "to",
        "experiencing",
        "greenly",
        "appeared",
        "greenly",
        "acquaintance",
        "approach",
        "compatible",
        "adverbialism",
        "regarding",
        "sense",
        "experience",
        "one",
        "might",
        "acquainted",
        "experiential",
        "state",
        "one",
        "experiencing",
        "greenly",
        "opposed",
        "acquainted",
        "green",
        "object",
        "green",
        "see",
        "example",
        "fumerton",
        "mcgrew",
        "chalmers",
        "alternatively",
        "acquaintance",
        "theorist",
        "take",
        "perceptual",
        "sensory",
        "experience",
        "involve",
        "acquaintance",
        "universal",
        "hope",
        "thereby",
        "avoid",
        "problem",
        "sense",
        "datum",
        "theory",
        "adverbial",
        "theory",
        "interesting",
        "defense",
        "view",
        "see",
        "forrest",
        "sense",
        "datum",
        "theory",
        "adverbialism",
        "see",
        "entry",
        "problem",
        "perception",
        "seen",
        "familiar",
        "experience",
        "temporarily",
        "failing",
        "notice",
        "one",
        "pain",
        "engrossed",
        "conversation",
        "serf",
        "potential",
        "illustration",
        "acquaintance",
        "least",
        "case",
        "pain",
        "disappear",
        "entirely",
        "even",
        "though",
        "one",
        "longer",
        "notice",
        "may",
        "inclined",
        "deny",
        "one",
        "pain",
        "without",
        "way",
        "aware",
        "conscious",
        "pain",
        "bonjour",
        "seems",
        "hold",
        "view",
        "see",
        "also",
        "chalmers",
        "seem",
        "sort",
        "case",
        "fumerton",
        "describes",
        "genuinely",
        "possible",
        "indeed",
        "frequent",
        "occurrence",
        "act",
        "noticing",
        "one",
        "pain",
        "mere",
        "predication",
        "one",
        "concept",
        "another",
        "eg",
        "predication",
        "concept",
        "pain",
        "concept",
        "present",
        "experience",
        "act",
        "fixing",
        "one",
        "mental",
        "gaze",
        "speak",
        "particular",
        "feature",
        "aspect",
        "one",
        "experience",
        "relation",
        "acquaintance",
        "seems",
        "provide",
        "needed",
        "acquaintance",
        "relation",
        "one",
        "stand",
        "one",
        "experience",
        "feature",
        "experience",
        "would",
        "account",
        "possibility",
        "experience",
        "something",
        "like",
        "pain",
        "sensation",
        "temporarily",
        "failing",
        "notice",
        "noticing",
        "bonjour",
        "account",
        "handle",
        "case",
        "well",
        "bonjour",
        "qualify",
        "awareness",
        "required",
        "justification",
        "particular",
        "way",
        "may",
        "help",
        "make",
        "sense",
        "case",
        "conscious",
        "directly",
        "aware",
        "great",
        "many",
        "feature",
        "simultaneously",
        "attend",
        "feature",
        "one",
        "time",
        "bonjour",
        "attention",
        "entirely",
        "separate",
        "builtin",
        "awareness",
        "built",
        "upon",
        "via",
        "might",
        "described",
        "selective",
        "focus",
        "pain",
        "without",
        "conscious",
        "aware",
        "pain",
        "pain",
        "without",
        "attending",
        "specifically",
        "selectively",
        "pain",
        "gertler",
        "present",
        "account",
        "justification",
        "introspective",
        "belief",
        "take",
        "attention",
        "primitive",
        "direct",
        "awareness",
        "though",
        "connection",
        "acquaintance",
        "explicit",
        "recent",
        "work",
        "gertler",
        "defends",
        "view",
        "acquaintance",
        "approach",
        "introspective",
        "knowledge",
        "called",
        "inspired",
        "russell",
        "theory",
        "acquaintance",
        "seems",
        "regard",
        "demonstrative",
        "attention",
        "sort",
        "attention",
        "make",
        "possible",
        "introspective",
        "judgment",
        "demonstrative",
        "content",
        "eg",
        "experiencing",
        "property",
        "made",
        "possible",
        "acquaintance",
        "taylor",
        "discus",
        "number",
        "phenomenological",
        "theoretical",
        "advantage",
        "identifying",
        "acquaintance",
        "attentive",
        "awareness",
        "summarize",
        "great",
        "deal",
        "agreement",
        "among",
        "philosopher",
        "adopt",
        "acquaintance",
        "approach",
        "take",
        "epistemically",
        "fundamental",
        "awareness",
        "unmediated",
        "nonconceptual",
        "form",
        "awareness",
        "secures",
        "existence",
        "object",
        "seems",
        "disagreement",
        "regarding",
        "nature",
        "acquaintance",
        "eg",
        "whether",
        "fundamentally",
        "relation",
        "self",
        "target",
        "awareness",
        "intrinsic",
        "builtin",
        "aspect",
        "feature",
        "mental",
        "state",
        "whether",
        "consists",
        "attention",
        "may",
        "also",
        "disagreement",
        "regarding",
        "possible",
        "object",
        "target",
        "acquaintance",
        "shall",
        "see",
        "also",
        "disagreement",
        "regarding",
        "proper",
        "analysis",
        "noninferential",
        "knowledge",
        "justified",
        "belief",
        "acquaintance",
        "figure",
        "analysis"
    ]
}