{
    "main_text": "Sage Learning and The Four-Seven Debate\n4. Sage Learning and The Four-Seven Debate\n\nTwo of the most preeminent scholars of the first half of the\nChosŏn dynasty, Yi Hwang (1501–1570), well known by his pen\nname T’oegye, and Yi I (1536–1584), known by the pen name\nYulgok, are responsible for the deep level of metaphysical debates\nthat would mark Neo-Confucianism in Korea. Both would engage in\nattempts to analyse the macrocosmic Principle and its\nmicrocosmic interactions with material force (K. ki). More\nimportantly, they would initiate an intricate debate about what these\ninteractions meant for our minds and human nature, as actualised\nthrough our thoughts and actions, linked with a sense of psychological\nand social urgency. Korea’s Neo-Confucian scholars propounded a\nsocial guiding discourse that is humanistic in essence (drawing on the\nConfucian in), reflected in how we are linked externally\n(through conduct) and internally (through thought). Sagehood itself is\nachieved through learning, or rather, “Sage Learning”, a\nterm underscored by Oh Kangnam (1993: 313) as “one of the\nessential components, if not the essence, of Korean Confucianism\n[…]”, adding that “Neo-Confucianism’s\nhallmark was its emphasis on sage-learning”.\n\nBoth T’oegye and Yulgok both wrote very specific texts on\nSagehood. In 1568, T’oegye wrote Sŏnghak sipto\n聖學十圖 (The Ten Diagrams on Sage Learning),\nand in 1575 Yulgok wrote Sŏnghak chipyo\n聖學輯要 (Essentials of the Learning of the\nSages). According to Keum Jang-tae (1980 [2000: 40]), author of\nConfucianism and Korean Thoughts, these texts (the Ten\nDiagrams and the Essentials) reflect “the two main\nclassical works epitomizing Neo-Confucian learning in the Chosŏn\nera”. They also embody the development of Korea’s\nNeo-Confucian tradition. Kim Yung Sik (2017: 25) suggests that\n\n\nthe full understanding of [Zhu’s thought] seems to have come\nquite late, only after Yi Hwang […] launched an all-out effort\nto come to grips with the entire scope of the Zhu Xi Learning.\n\n\nIn fact, Japanese Neo-Confucian scholars, such as Yamazaki Ansai\n(1618–82), considered T’oegye to be “the greatest\nConfucian in Korea”, even suggesting he was on a par with Zhu Xi\nhimself (Pak 1983: 69).\n\nT’oegye’s Ten Diagrams represents the finest\nsynthesis of this Neo-Confucian thought current in Korea at that time,\nand it was one of the most reproduced texts of the entire Chosŏn\ndynasty, overshadowing Yulgok’s text. T’oegye’s text\nconsists of a collection of diagrams by Neo-Confucian scholars from\nChina and Korea, including three by T’oegye himself, that\nelucidate Zhu Xi’s main teachings, as well as\nT’oegye’s own synthesis and analysis of them, especially\nthrough his focus on the mind (K. sim), though guided by a\nmethodological approach that focuses on Kyŏng\n(敬). Kyŏng is often translated as seriousness,\nbut T’oegye has reoriented this term’s use, underscoring\nthe mind’s mastery over one’s thoughts and actions,\nleading Michael Kalton (1985: 212–214) to translate it as\n“mindfulness”, while Kim Hyoungchan (2018: 27–32)\nuses the term “reverent mindfulness”. Mindfulness, in this\nvery Confucian re-appropriation of a Buddhist concept, reflects\nT’oegye’s approach to sagehood: the daily practice of\nconstantly being aware of the mind, controlling its impulses so that\ngood thoughts can lead to good actions.\n\nThe first two diagrams reflect the underpinnings of Neo-Confucian\nontologico-cosmology:\n\nZhou Dunyi’s Diagram of the Supreme Ultimate\n(太極之圖, K. T’aegŭk\nchido), and\nZhang Zai’s Western Inscription\n(西銘圖, K. Sŏmyŏngdo)\n(see\n Kalton’s translations online).\n\n\nThey provide us with a clear outline of the interconnected\nNeo-Confucian vision of a morally interconnected universe. While the\nfirst diagram identifies the Supreme Ultimate\n(T’aegŭk) as Principle, which generates\nyin and yang, which then materialise through the Five Elements, the\nsecond diagram further concretises this organising aspect of the\ngreater originating Principle in the material world, showing\nits inherent order that inscribes itself hierarchically.\nPrinciple is reflected in all things, and therefore used to\nvalidate human social relations and the distinctions that exist\nbetween ruler and subjects, older and younger for example. The next\nthree diagrams are all concerned with the basic underpinnings of\nConfucian moral humanistic education: The Diagram of Elementary\nLearning, the Diagram of the Great Learning, and the\nDiagram of Rules of the White Deer Hollow Academy, the latter\nbeing the rules of Zhu Xi’s own retreat centre for learning.\nThis education embodies Confucian morality which is the basis for\nunderstanding more complex issues of the mind and human nature.\nThe Elementary Learning is an original diagram by\nT’oegye himself based on Zhu Xi’s text of the same name,\nwhich was widely studied in Korea in its own right. Meanwhile, the\nDiagram of the Great Learning was by Kwŏn Kŭn,\nappearing in his collection of diagrams mentioned above, bolstering\nthe importance of moral education within the Korean Neo-Confucian\ntradition.\n\nIt is the sixth diagram in T’oegye’s collection where we\nfind his view of the “Four-Seven” issue that was first\nmentioned by Kwŏn Kŭn, but which really addressed the\nquestions: if human nature is completely good—why do people do\nthings that are “not good” and how/why are there negative\nfeelings? Is this due to Principle or the material force?\nThis was a conundrum for Neo-Confucians just as good and evil was for\nthe Scholastics in Europe trying to explain why there was evil if\ntheir God was good. Michael Kalton (1985: 119) describes the\nsubsequent debate, outlined below, as “the single most important\nintellectual controversy of the Yi dynasty”, ultimately related\nto the different roles of Principle and material force, their\ninteractions and significance in regard to one’s human nature\nand the mind. T’oegye’s sixth diagram is actually divided\ninto three parts, relating to the saying The Mind Combines and\nGoverns the Nature and the Feelings\n(心統性情圖) and they describe different\nbut interrelated aspects of the mind:\n\n“the not yet aroused state” (未發, K.\nmibal), linked to the four beginnings, and pure\nPrinciple, and\nthe seven feelings linked to “the aroused state”\n(已發, K. ibal) when Principle interacts\nwith the material force.\n\n\nIn this instance, both Principle and material force\ninterpenetrate each other, but this was not T’oegye’s\ninitial interpretation, which had changed due to his\n“Four-Seven” debate with another scholar.\n\nThe “Four-Seven” debate (which was clearly deeply related\nto Principle and material force) originated from a series of\ncorrespondences between T’oegye and Kobong, penname of Ki\nTaesŭng (1527–1572), and later it was continued on between\nYulgok and Ugye, penname of Sŏng Hon (1536–1598).\nT’oegye originally suggested that the four beginnings and seven\nfeelings had different origins, and this instigated the original\ndebate with Kobong, who did not agree with T’oegye’s\ndualistic approach: that Principle (i) was the\nsource of the four beginnings, while the material force was the source\nof the seven feelings. Kobong was more interested in\nki’s moral and activating function, and considered\ni and ki as inseparable, especially when it came to\n“their presence in actual things” (Kalton 1994: 6). The\nissue at hand was how could the morally good Principle,\nmanifested to its highest form in (wo)mankind, be corrupt, or led\nastray, in the sense that people clearly do not always conduct\nthemselves in a kind-hearted manner towards others. Though\nT’oegye revised his view, he still gave primacy to\nPrinciple and maintained that it always initially preceded\nki when we act morally, or rather that Principle\nguided ki, like a rider guiding a horse. Hence, T’oegye\nupheld the moralistic perfection and integrity of Principle\nby suggesting that things could be less than perfect, and human\nbehaviour sometimes not good, as a result of the interaction with the\nmaterial force, which could be affected/corrupted depending on the\nconcrete circumstances of its actualisation in concrete\nform/action.\n\nFor T’oegye Principle had been equated with the Supreme\nUltimate, and thus represented the source of the possibility for all\nexistence, whereby the very Principle (or potential) of a\nthing preceded its actual realisation, which would then interact with\nki. In this sense, the potential for life in the universe\npredated the actualisation of that life. T’oegye suggests\nsomething quite idealistic: that Principle leads with what I\ndescribe as the “possibility for actualisation”,\nwhile its interaction with ki enables the\n“actualisation of the possibility”. The\npossibility for actualisation was always “perfect”, but\nthe individual ki, in his opinion, could fluctuate and so\ndoes not always “function” to the optimum level of its\ninherent Principle (or potential). Let us consider this in\nterms of sexual reproduction to clarify this point: when a man and\nwoman mate (or using other medical techniques), there is the potential\nthat an egg will be fertilised by a sperm, and if so, given that the\nphysical conditions are optimum, a woman will carry a baby to term.\nHowever, sometimes there can be biological (material) issues that may\nprevent the woman from even getting pregnant (due to fertility issues\nwith the man or woman) or from carrying the baby to term.\nAdditionally, the baby may not always develop as healthily as\ntheoretically expected, which is not related to the Principle\n(i.e., that the fertilisation process itself produces a healthy baby),\nbut rather the actualisation of potential genetic codes that can\ndetermine physical and biological outcomes: hence, it is ki\nthat we inherit from our parents, and not their Principle. In\nrelation to the mind, T’oegye referred to the mind of Dao, a\npure form, as well as the human mind, where less than perfect thoughts\ncould lead to less than perfect actions. However, one could use\nmindfulness as a way to guide our inner good nature to reflect the\nmind of Dao where Principle took control to divert us from\ndesires and negative feelings.\n\nContrary to T’oegye and Ugye, Yulgok posited that ki\nwas both the activating factor of the seven feelings and four\nbeginnings, and in this sense was less idealistic in relation to\nPrinciple. He argued that Principle needed somewhere\nto settle before it could guide or affect things, and that was\nki, the material force. How can we relate this to daily life\nin some way? The man and woman needed to exist and to mate before the\n“principle” for fertilisation could take place, which is\nperhaps a more practical way of looking at things. This then had\nimplications for more important moral matters. Yulgok concluded that\nwhile the seven feelings included the four beginnings, the four\nbeginnings did not contain the seven feelings—in order to\nmaintain human nature “innately” good and intact. Bongrae\nSeok (2019: 24) clarifies that Yulgok (and Kobong, for that matter)\ndid not believe that\n\n\nthe goodness of the Four is a distinct moral property explained\nexclusively by [i] but a common property shared by the Seven\nexplained by both [i] and qi [ki],\n\n\nhence, in a sense “smoothening the sharp distinction between the\nFour and the Seven” as argued by T’oegye and rearticulated\nby Ugye. Seok (2019: 19) also notes how Ugye interpreted the four\nbeginnings and the seven feelings as separate sets of emotions, with\nthe “seven” having the potential for evil, drawing on\nT’oegye who clearly viewed Principle as the essence of\nthe mind and ki as the function (on which Principle\nmounts), again using the interrelationship between essence-function,\nor che-yong, discussed above in relation to Chinul. For the\nKorean Neo-Confucians, this only reinforced the need for proper moral\neducation and the incessant need for self-cultivations to guide one\nfrom falling prey of the shortcomings of one’s physical,\nmaterial and environmental existence as it related to the mind and\none’s human nature (see E. Chung 1995; Ro 1989; Cawley 2019:\n84–89). Though Yulgok was interested in the metaphysical aspects\nof Neo-Confucianism, Ro Young-Chan (2017: 74) underscores his interest\nin the practical side of “sagely learning”.\n\nBoth T’oegye’s Diagrams and Yulgok’s\nEssentials advocate pathways towards sagehood and promote the\nconcept of self-cultivation. Both scholars also emphasised the special\nrole of the king who was expected to be a paragon of Confucian\nmorality and humanity (ren), the living embodiment of the\nideals of “sagehood”. T’oegye and Yulgok elucidate\nour place in a morally directed universe, where one is expected to act\nresponsibly towards other members of the family and the larger\nsociety, or rather “practice” a social vision of morality\nin our daily lives. For both scholars, sagehood represented a noble\nsavoir vivre, the goal of which was to benefit others, and\nthis in itself was the key to becoming a sage. T’oegye\nand Yulgok provide us with archetypes of a sort of East Asian\nNeo-Confucian “Social Contract”, to draw on Jean Jacques\nRousseau’s (1712–1778) major work published in 1762. Both\nKorean scholars stress the moral and social responsibility of those in\npower, but also the moral responsibility of individuals to each other\nas members of an interconnected society—and this is something\nthe world can appreciate now more than ever, as we face a global\npandemic in 2020/21, where through socially responsible distancing, we\nboth respect and protect others.\n",
    "section_title": "4. Sage Learning and The Four-Seven Debate",
    "entry_title": "Korean Confucianism",
    "hierarchy_title": "Korean Confucianism || Sage Learning and The Four-Seven Debate",
    "tokenized_text": [
        "sage",
        "learning",
        "fourseven",
        "debate",
        "sage",
        "learning",
        "fourseven",
        "debate",
        "two",
        "preeminent",
        "scholar",
        "first",
        "half",
        "chosŏn",
        "dynasty",
        "yi",
        "hwang",
        "well",
        "known",
        "pen",
        "name",
        "oegye",
        "yi",
        "known",
        "pen",
        "name",
        "yulgok",
        "responsible",
        "deep",
        "level",
        "metaphysical",
        "debate",
        "would",
        "mark",
        "neoconfucianism",
        "korea",
        "would",
        "engage",
        "attempt",
        "analyse",
        "macrocosmic",
        "principle",
        "microcosmic",
        "interaction",
        "material",
        "force",
        "k",
        "ki",
        "importantly",
        "would",
        "initiate",
        "intricate",
        "debate",
        "interaction",
        "meant",
        "mind",
        "human",
        "nature",
        "actualised",
        "thought",
        "action",
        "linked",
        "sense",
        "psychological",
        "social",
        "urgency",
        "korea",
        "neoconfucian",
        "scholar",
        "propounded",
        "social",
        "guiding",
        "discourse",
        "humanistic",
        "essence",
        "drawing",
        "confucian",
        "reflected",
        "linked",
        "externally",
        "conduct",
        "internally",
        "thought",
        "sagehood",
        "achieved",
        "learning",
        "rather",
        "sage",
        "learning",
        "term",
        "underscored",
        "oh",
        "kangnam",
        "one",
        "essential",
        "component",
        "essence",
        "korean",
        "confucianism",
        "adding",
        "neoconfucianism",
        "hallmark",
        "emphasis",
        "sagelearning",
        "oegye",
        "yulgok",
        "wrote",
        "specific",
        "text",
        "sagehood",
        "oegye",
        "wrote",
        "sŏnghak",
        "sipto",
        "聖學十圖",
        "ten",
        "diagram",
        "sage",
        "learning",
        "yulgok",
        "wrote",
        "sŏnghak",
        "chipyo",
        "聖學輯要",
        "essential",
        "learning",
        "sage",
        "according",
        "keum",
        "jangtae",
        "author",
        "confucianism",
        "korean",
        "thought",
        "text",
        "ten",
        "diagram",
        "essential",
        "reflect",
        "two",
        "main",
        "classical",
        "work",
        "epitomizing",
        "neoconfucian",
        "learning",
        "chosŏn",
        "era",
        "also",
        "embody",
        "development",
        "korea",
        "neoconfucian",
        "tradition",
        "kim",
        "yung",
        "sik",
        "suggests",
        "full",
        "understanding",
        "zhu",
        "thought",
        "seems",
        "come",
        "quite",
        "late",
        "yi",
        "hwang",
        "launched",
        "allout",
        "effort",
        "come",
        "grip",
        "entire",
        "scope",
        "zhu",
        "xi",
        "learning",
        "fact",
        "japanese",
        "neoconfucian",
        "scholar",
        "yamazaki",
        "ansai",
        "considered",
        "oegye",
        "greatest",
        "confucian",
        "korea",
        "even",
        "suggesting",
        "par",
        "zhu",
        "xi",
        "pak",
        "oegye",
        "ten",
        "diagram",
        "represents",
        "finest",
        "synthesis",
        "neoconfucian",
        "thought",
        "current",
        "korea",
        "time",
        "one",
        "reproduced",
        "text",
        "entire",
        "chosŏn",
        "dynasty",
        "overshadowing",
        "yulgok",
        "text",
        "oegye",
        "text",
        "consists",
        "collection",
        "diagram",
        "neoconfucian",
        "scholar",
        "china",
        "korea",
        "including",
        "three",
        "oegye",
        "elucidate",
        "zhu",
        "xi",
        "main",
        "teaching",
        "well",
        "oegye",
        "synthesis",
        "analysis",
        "especially",
        "focus",
        "mind",
        "k",
        "sim",
        "though",
        "guided",
        "methodological",
        "approach",
        "focus",
        "kyŏng",
        "敬",
        "kyŏng",
        "often",
        "translated",
        "seriousness",
        "oegye",
        "reoriented",
        "term",
        "use",
        "underscoring",
        "mind",
        "mastery",
        "one",
        "thought",
        "action",
        "leading",
        "michael",
        "kalton",
        "translate",
        "mindfulness",
        "kim",
        "hyoungchan",
        "us",
        "term",
        "reverent",
        "mindfulness",
        "mindfulness",
        "confucian",
        "reappropriation",
        "buddhist",
        "concept",
        "reflects",
        "oegye",
        "approach",
        "sagehood",
        "daily",
        "practice",
        "constantly",
        "aware",
        "mind",
        "controlling",
        "impulse",
        "good",
        "thought",
        "lead",
        "good",
        "action",
        "first",
        "two",
        "diagram",
        "reflect",
        "underpinnings",
        "neoconfucian",
        "ontologicocosmology",
        "zhou",
        "dunyi",
        "diagram",
        "supreme",
        "ultimate",
        "太極之圖",
        "k",
        "aegŭk",
        "chido",
        "zhang",
        "zai",
        "western",
        "inscription",
        "西銘圖",
        "k",
        "sŏmyŏngdo",
        "see",
        "kalton",
        "translation",
        "online",
        "provide",
        "u",
        "clear",
        "outline",
        "interconnected",
        "neoconfucian",
        "vision",
        "morally",
        "interconnected",
        "universe",
        "first",
        "diagram",
        "identifies",
        "supreme",
        "ultimate",
        "aegŭk",
        "principle",
        "generates",
        "yin",
        "yang",
        "materialise",
        "five",
        "element",
        "second",
        "diagram",
        "concretises",
        "organising",
        "aspect",
        "greater",
        "originating",
        "principle",
        "material",
        "world",
        "showing",
        "inherent",
        "order",
        "inscribes",
        "hierarchically",
        "principle",
        "reflected",
        "thing",
        "therefore",
        "used",
        "validate",
        "human",
        "social",
        "relation",
        "distinction",
        "exist",
        "ruler",
        "subject",
        "older",
        "younger",
        "example",
        "next",
        "three",
        "diagram",
        "concerned",
        "basic",
        "underpinnings",
        "confucian",
        "moral",
        "humanistic",
        "education",
        "diagram",
        "elementary",
        "learning",
        "diagram",
        "great",
        "learning",
        "diagram",
        "rule",
        "white",
        "deer",
        "hollow",
        "academy",
        "latter",
        "rule",
        "zhu",
        "xi",
        "retreat",
        "centre",
        "learning",
        "education",
        "embodies",
        "confucian",
        "morality",
        "basis",
        "understanding",
        "complex",
        "issue",
        "mind",
        "human",
        "nature",
        "elementary",
        "learning",
        "original",
        "diagram",
        "oegye",
        "based",
        "zhu",
        "xi",
        "text",
        "name",
        "widely",
        "studied",
        "korea",
        "right",
        "meanwhile",
        "diagram",
        "great",
        "learning",
        "kwŏn",
        "kŭn",
        "appearing",
        "collection",
        "diagram",
        "mentioned",
        "bolstering",
        "importance",
        "moral",
        "education",
        "within",
        "korean",
        "neoconfucian",
        "tradition",
        "sixth",
        "diagram",
        "oegye",
        "collection",
        "find",
        "view",
        "fourseven",
        "issue",
        "first",
        "mentioned",
        "kwŏn",
        "kŭn",
        "really",
        "addressed",
        "question",
        "human",
        "nature",
        "completely",
        "goodwhy",
        "people",
        "thing",
        "good",
        "howwhy",
        "negative",
        "feeling",
        "due",
        "principle",
        "material",
        "force",
        "conundrum",
        "neoconfucians",
        "good",
        "evil",
        "scholastic",
        "europe",
        "trying",
        "explain",
        "evil",
        "god",
        "good",
        "michael",
        "kalton",
        "describes",
        "subsequent",
        "debate",
        "outlined",
        "single",
        "important",
        "intellectual",
        "controversy",
        "yi",
        "dynasty",
        "ultimately",
        "related",
        "different",
        "role",
        "principle",
        "material",
        "force",
        "interaction",
        "significance",
        "regard",
        "one",
        "human",
        "nature",
        "mind",
        "oegye",
        "sixth",
        "diagram",
        "actually",
        "divided",
        "three",
        "part",
        "relating",
        "saying",
        "mind",
        "combine",
        "governs",
        "nature",
        "feeling",
        "心統性情圖",
        "describe",
        "different",
        "interrelated",
        "aspect",
        "mind",
        "yet",
        "aroused",
        "state",
        "未發",
        "k",
        "mibal",
        "linked",
        "four",
        "beginning",
        "pure",
        "principle",
        "seven",
        "feeling",
        "linked",
        "aroused",
        "state",
        "已發",
        "k",
        "ibal",
        "principle",
        "interacts",
        "material",
        "force",
        "instance",
        "principle",
        "material",
        "force",
        "interpenetrate",
        "oegye",
        "initial",
        "interpretation",
        "changed",
        "due",
        "fourseven",
        "debate",
        "another",
        "scholar",
        "fourseven",
        "debate",
        "clearly",
        "deeply",
        "related",
        "principle",
        "material",
        "force",
        "originated",
        "series",
        "correspondence",
        "oegye",
        "kobong",
        "penname",
        "ki",
        "taesŭng",
        "later",
        "continued",
        "yulgok",
        "ugye",
        "penname",
        "sŏng",
        "hon",
        "oegye",
        "originally",
        "suggested",
        "four",
        "beginning",
        "seven",
        "feeling",
        "different",
        "origin",
        "instigated",
        "original",
        "debate",
        "kobong",
        "agree",
        "oegye",
        "dualistic",
        "approach",
        "principle",
        "source",
        "four",
        "beginning",
        "material",
        "force",
        "source",
        "seven",
        "feeling",
        "kobong",
        "interested",
        "ki",
        "moral",
        "activating",
        "function",
        "considered",
        "ki",
        "inseparable",
        "especially",
        "came",
        "presence",
        "actual",
        "thing",
        "kalton",
        "issue",
        "hand",
        "could",
        "morally",
        "good",
        "principle",
        "manifested",
        "highest",
        "form",
        "wo",
        "mankind",
        "corrupt",
        "led",
        "astray",
        "sense",
        "people",
        "clearly",
        "always",
        "conduct",
        "kindhearted",
        "manner",
        "towards",
        "others",
        "though",
        "oegye",
        "revised",
        "view",
        "still",
        "gave",
        "primacy",
        "principle",
        "maintained",
        "always",
        "initially",
        "preceded",
        "ki",
        "act",
        "morally",
        "rather",
        "principle",
        "guided",
        "ki",
        "like",
        "rider",
        "guiding",
        "horse",
        "hence",
        "oegye",
        "upheld",
        "moralistic",
        "perfection",
        "integrity",
        "principle",
        "suggesting",
        "thing",
        "could",
        "le",
        "perfect",
        "human",
        "behaviour",
        "sometimes",
        "good",
        "result",
        "interaction",
        "material",
        "force",
        "could",
        "affectedcorrupted",
        "depending",
        "concrete",
        "circumstance",
        "actualisation",
        "concrete",
        "formaction",
        "oegye",
        "principle",
        "equated",
        "supreme",
        "ultimate",
        "thus",
        "represented",
        "source",
        "possibility",
        "existence",
        "whereby",
        "principle",
        "potential",
        "thing",
        "preceded",
        "actual",
        "realisation",
        "would",
        "interact",
        "ki",
        "sense",
        "potential",
        "life",
        "universe",
        "predated",
        "actualisation",
        "life",
        "oegye",
        "suggests",
        "something",
        "quite",
        "idealistic",
        "principle",
        "lead",
        "describe",
        "possibility",
        "actualisation",
        "interaction",
        "ki",
        "enables",
        "actualisation",
        "possibility",
        "possibility",
        "actualisation",
        "always",
        "perfect",
        "individual",
        "ki",
        "opinion",
        "could",
        "fluctuate",
        "always",
        "function",
        "optimum",
        "level",
        "inherent",
        "principle",
        "potential",
        "let",
        "u",
        "consider",
        "term",
        "sexual",
        "reproduction",
        "clarify",
        "point",
        "man",
        "woman",
        "mate",
        "using",
        "medical",
        "technique",
        "potential",
        "egg",
        "fertilised",
        "sperm",
        "given",
        "physical",
        "condition",
        "optimum",
        "woman",
        "carry",
        "baby",
        "term",
        "however",
        "sometimes",
        "biological",
        "material",
        "issue",
        "may",
        "prevent",
        "woman",
        "even",
        "getting",
        "pregnant",
        "due",
        "fertility",
        "issue",
        "man",
        "woman",
        "carrying",
        "baby",
        "term",
        "additionally",
        "baby",
        "may",
        "always",
        "develop",
        "healthily",
        "theoretically",
        "expected",
        "related",
        "principle",
        "ie",
        "fertilisation",
        "process",
        "produce",
        "healthy",
        "baby",
        "rather",
        "actualisation",
        "potential",
        "genetic",
        "code",
        "determine",
        "physical",
        "biological",
        "outcome",
        "hence",
        "ki",
        "inherit",
        "parent",
        "principle",
        "relation",
        "mind",
        "oegye",
        "referred",
        "mind",
        "dao",
        "pure",
        "form",
        "well",
        "human",
        "mind",
        "le",
        "perfect",
        "thought",
        "could",
        "lead",
        "le",
        "perfect",
        "action",
        "however",
        "one",
        "could",
        "use",
        "mindfulness",
        "way",
        "guide",
        "inner",
        "good",
        "nature",
        "reflect",
        "mind",
        "dao",
        "principle",
        "took",
        "control",
        "divert",
        "u",
        "desire",
        "negative",
        "feeling",
        "contrary",
        "oegye",
        "ugye",
        "yulgok",
        "posited",
        "ki",
        "activating",
        "factor",
        "seven",
        "feeling",
        "four",
        "beginning",
        "sense",
        "le",
        "idealistic",
        "relation",
        "principle",
        "argued",
        "principle",
        "needed",
        "somewhere",
        "settle",
        "could",
        "guide",
        "affect",
        "thing",
        "ki",
        "material",
        "force",
        "relate",
        "daily",
        "life",
        "way",
        "man",
        "woman",
        "needed",
        "exist",
        "mate",
        "principle",
        "fertilisation",
        "could",
        "take",
        "place",
        "perhaps",
        "practical",
        "way",
        "looking",
        "thing",
        "implication",
        "important",
        "moral",
        "matter",
        "yulgok",
        "concluded",
        "seven",
        "feeling",
        "included",
        "four",
        "beginning",
        "four",
        "beginning",
        "contain",
        "seven",
        "feelingsin",
        "order",
        "maintain",
        "human",
        "nature",
        "innately",
        "good",
        "intact",
        "bongrae",
        "seok",
        "clarifies",
        "yulgok",
        "kobong",
        "matter",
        "believe",
        "goodness",
        "four",
        "distinct",
        "moral",
        "property",
        "explained",
        "exclusively",
        "common",
        "property",
        "shared",
        "seven",
        "explained",
        "qi",
        "ki",
        "hence",
        "sense",
        "smoothening",
        "sharp",
        "distinction",
        "four",
        "seven",
        "argued",
        "oegye",
        "rearticulated",
        "ugye",
        "seok",
        "also",
        "note",
        "ugye",
        "interpreted",
        "four",
        "beginning",
        "seven",
        "feeling",
        "separate",
        "set",
        "emotion",
        "seven",
        "potential",
        "evil",
        "drawing",
        "oegye",
        "clearly",
        "viewed",
        "principle",
        "essence",
        "mind",
        "ki",
        "function",
        "principle",
        "mount",
        "using",
        "interrelationship",
        "essencefunction",
        "cheyong",
        "discussed",
        "relation",
        "chinul",
        "korean",
        "neoconfucians",
        "reinforced",
        "need",
        "proper",
        "moral",
        "education",
        "incessant",
        "need",
        "selfcultivation",
        "guide",
        "one",
        "falling",
        "prey",
        "shortcoming",
        "one",
        "physical",
        "material",
        "environmental",
        "existence",
        "related",
        "mind",
        "one",
        "human",
        "nature",
        "see",
        "e",
        "chung",
        "ro",
        "cawley",
        "though",
        "yulgok",
        "interested",
        "metaphysical",
        "aspect",
        "neoconfucianism",
        "ro",
        "youngchan",
        "underscore",
        "interest",
        "practical",
        "side",
        "sagely",
        "learning",
        "oegye",
        "diagram",
        "yulgok",
        "essential",
        "advocate",
        "pathway",
        "towards",
        "sagehood",
        "promote",
        "concept",
        "selfcultivation",
        "scholar",
        "also",
        "emphasised",
        "special",
        "role",
        "king",
        "expected",
        "paragon",
        "confucian",
        "morality",
        "humanity",
        "ren",
        "living",
        "embodiment",
        "ideal",
        "sagehood",
        "oegye",
        "yulgok",
        "elucidate",
        "place",
        "morally",
        "directed",
        "universe",
        "one",
        "expected",
        "act",
        "responsibly",
        "towards",
        "member",
        "family",
        "larger",
        "society",
        "rather",
        "practice",
        "social",
        "vision",
        "morality",
        "daily",
        "life",
        "scholar",
        "sagehood",
        "represented",
        "noble",
        "savoir",
        "vivre",
        "goal",
        "benefit",
        "others",
        "key",
        "becoming",
        "sage",
        "oegye",
        "yulgok",
        "provide",
        "u",
        "archetype",
        "sort",
        "east",
        "asian",
        "neoconfucian",
        "social",
        "contract",
        "draw",
        "jean",
        "jacques",
        "rousseau",
        "major",
        "work",
        "published",
        "korean",
        "scholar",
        "stress",
        "moral",
        "social",
        "responsibility",
        "power",
        "also",
        "moral",
        "responsibility",
        "individual",
        "member",
        "interconnected",
        "societyand",
        "something",
        "world",
        "appreciate",
        "ever",
        "face",
        "global",
        "pandemic",
        "socially",
        "responsible",
        "distancing",
        "respect",
        "protect",
        "others"
    ]
}