{
    "main_text": "Thought || The Mandalic Cosmos/Cosmos as Mandala\n3.8 The Mandalic Cosmos/Cosmos as Mandala\n3.8.1 Rishin and chishin: Two mandalic embodiments\n\nViewed in light of the concept of hosshin seppō, the\ncosmos is a flowering of the Dharma preached by Dainichi, as it\nspreads outward towards beings receiving it in various degrees in\naccordance with their level of understanding. The form that this\nflowering takes is the mandala (Jpn: mandara). The mandala in\nShingon Buddhism is a diagram or picture, usually a painting,\npicturing the doctrines expounded in the two major esoteric\nscriptures, Dainichikyō and\nKongōchōgyō. It depicts visually the form that\nenlightenment takes as it becomes manifest in the universe. In other\nwords, it is taken to be a visual depiction of the hosshin\nitself and the flowering of hosshin seppō throughout the\ncosmos, serving as a map for one’s journey to enlightenment.\n\nThis use and understanding of the mandala was another distinction of\nShingon Buddhism differentiating it in Kūkai’s mind as\nesoteric from exoteric Buddhism. The mandala proves to be “a\nmetaphor for a new envisioning of reality, self, and world”\n(Gardiner 2008, 44), a vehicle for the transformation of vision,\nwhereby one envisions the world as a mandala.\nKūkai’s contention was that exoteric teachings move the\npractitioner towards the central summit of the mandala, step-by-step\nfrom its own specific vantage point without taking a comprehensive\nview of the whole. Esoteric teachings on the other hand take the\nentirety of the cosmic mandala into one comprehensive view, allowing\nfor the practitioner to leap, as it were, into the center to realize\nnon-duality with the hosshin.\n\nIn the esoteric tradition that Kūkai inherited from Hui-kuo,\nthere are two major mandalas that depict the hosshin in two\ndifferent mandalic forms. Each mandala originally belonged to one of\nthe two esoteric lineages, which became combined in China, and is\nassociated with either of the two sūtras. All Shingon doctrines,\ntraceable to the two sūtras, are supposed to be pictorially\ndepicted in these two mandalas: the Taizō (Skrt:\nGarbha, “Womb of enlightenment”) and the\nKongōkai (Srkt: Vajradhātu,\n“Vajra realm,” “Diamond realm” or\n“Realm of the adamantine thunderbolt”) mandalas. Together\nthey are called ryōbu mandara and represent a\ncomprehensive unity. Each are also associated with one of the two\ndifferent concepts of ri (pattern, order – referring to\nemptiness as the reason discerned in patternment) and chi\n(wisdom, i.e., the wisdom of emptiness). Accordingly the\nhosshin can be understood in its embodied form as\nri-hosshin (or rishin) and as chi-hosshin\n(or chishin), two aspects which are ultimately non-dualistic\n(richi funi). The ri-hosshin is depicted in the\nTaizō mandara that expresses truths expounded in the\nDainichi-kyō. And the chi-hosshin is depicted\nin the Kongōkai mandara that expresses truths expounded in the\nKongōchō-gyō. Both depict Dainichi as the\ncentral deity, with buddhas and bodhisattvas surrounding him in\ngeometric arrangement.\n\nThe Taizō-mandara (full name: Daichitaizōsei\nmandara; Skrt: Garbhakośadhātu mandala;\n“Great compassion womb repository birth mandala”)\nrepresents the “female principle” and expresses the\nmaterial world in its underlying empatternment of ri, which\nis the Buddha’s view to truth from the summit of enlightenment\ndownward to the mundane world of humans. Ri (Chn:\nli) often translated into English as “principle,”\nin fact has the sense of “pattern,” and in the esoteric\nBuddhist context signifies the pattern found in the interplay of the\nfive material elements that constitute the myriad thing-events and\nphenomena. As the material elements form the objects of cognition, the\nmandala depicting the rishin represents the known. In his\ncommentary on the Dainichi-kyō\n(Dainichi-kyō kaidai), Kūkai equates the\nnature of Dainichi taken as jishō hosshin with this\nrishin. He then in turn identifies the rishin as the\noriginal enlightenment intrinsic to all sentient beings but hidden in\nits unmanifest potentiality as what is to be known. \n\nAs a descending view from the summit, this Taizō mandala\nrepresents the enlightened universe from the perspective of\ncompassion, an expression of the “female” principle. Just\nas a mother enfolds her child in the care of her womb, the\nBuddha’s compassion nurtures the original enlightenment in all.\nWith the lotus as chief symbol, the picture represents the\nmanifestation of Dainichi through his cosmic activities. Dainichi\noccupies the unmoving center with myriad buddhas, bodhisattvas, and\nother deities layered around it, while Dainichi simultaneously\npervades all up to the outermost edges of the diagram. From that\ncenter, enlightenment radiates outward in a spiral, passing through\nthe various buddhas and bodhisattvas, descending through various\nlevels of being and mind, outward to the phenomenal world as it\nbecomes more and more concrete, reaching the human world and further\ninto the realms of animals, hell-beings, and hungry ghosts. Thus a\nwellspring of activity is depicted to be endlessly flowing out of the\ncenter. This activity manifests the welling-up of compassion from the\nBuddha’s wisdom as it moves outwards and downwards.\nSimultaneously all beings are directed inwards and upwards towards\nenlightenment depicted in the mandalic center. The two movements are\nnon-dualistic.\n\nThe Kongō-kai mandara (Srkt: Vajradhātu\nmandala; “Vajra-realm mandala”) represents\nthe “male priciple” and embodies the\nvajra-wisdom, a wisdom that is adamantine and imperishable\nand that illuminates and enfolds all beings. This symbolizes the sixth\nelement, the mental element of chi (wisdom), referring to the\nmental realm of the knower, the subject of cognitive experience. But\nit also represents the Buddha’s adamantine power of illumination\nthat realizes enlightenment, symbolized by the vajra (an\nadamantine weapon with many points). In this respect the mind it\nsymbolizes is not only the practitioner’s mind but also the\nall-comprehensive mind of Dainichi as indestructible potentials of the\ncosmos, as the Buddha’s “embodiment of wisdom”\n(chishin). \n\nThis Kongō-kai mandala is a rectangle consisting of a\ncombination of nine smaller mandalas, each an originally independent\nmandala, juxtaposed to depict a double spiraling movement, centrifugal\nand centripetal: on the one hand outward of the Buddha’s\nenlightenment towards the phenomenal world, and on the other hand\ninward of beings on the periphery from the mundane world in spiritual\nprogression towards enlightenment at the center. Of the nine smaller\nmandalas, the most basic, which are on the lower left corner, are\nrepresentations of the so-called “four mandalas”\n(shimandara) that Kūkai classified as the form of\nappearance of the hosshin. (More on the shimandara\nin the next section.) All together the nine depict the unending\nactivity of the enlightened mind, moving clockwise from the center, to\ntake on increasingly concrete forms, engaging in skillful means to\nhelp the unenlightened, while the unenlightened evolve towards the\ncenter. From the Buddha’s perspective, the center is moving\noutwards; and from the individual practitioner’s perspective,\nthe periphery is being drawn inwards. Enlightened wisdom cannot remain\naloof from the realities of unenlightened life. Skillful means thus\nembodies wisdom in concrete phenomenal activity. In this respect, the\nmandala emphasizes the non-duality between wisdom (hannya)\nand skillful means. And it symbolizes the wisdom that knows truth, the\nDharma, in all its separate manifestations.\n\nTogether these two mandalic forms depict the form of the cosmos as a\ndynamic process interrelating and uniting the transcendent and the\nmundane, the enlightened and the ignorant, Buddha and man, macrocosmos\nand microcosmos, matter and mind, pattern and wisdom. They visually\nrepresent two simultaneous overlapping aspects of enlightenment,\nvariously described as emptiness and form, compassion and wisdom,\nobject and subject, the dimension from which the practitioner\nis guided by the Buddha and the dimension towards which the\npractitioner evolves. In Kūkai’s reading, these are\ninseparable aspects of the hosshin, depicted in the two\nmandalas from different but non-dualistic perspectives. Enlightenment\nwould be the experiential realization of their non-duality: richi\nfuni. In Shingon practice, therefore the Taizō mandala\n(rishin) is hung on the east wall of the meditation hall; and\nthe Kongōkai mandala (chishin) is hung on the west\nwall.\n3.8.2 The four types of the mandala\n\nIn addition to the two mandalic embodiments of the hosshin,\nKūkai (in Sokushinjōbutsugi, ch.4) classifies\nmandalas in general into four types, depicting the different ways\nwhereby the Dharma is manifest: 1. The “great mandala”\n(Skrt: mahā-mandala; Jpn: daimandara)\nsymbolizes the cosmic Buddha in its physical extension along with all\nthe stages of being, including the buddhas, bodhisattvas, and deities\nthat are depicted in perfect anthropormophic form surrounding Dainichi\nat the center and painted in different colors to represent different\nmaterial elements. 2. The “samaya mandala” (Skrt:\nsamaya-mandala; Jpn: sanmaya mandara) pictures the\nBuddha-cum-universe through a variety of articles or signs,\nsymbolizing the omnipresencing of Dainichi’s intention (Skrt:\nsamaya; Jpn: sanmaya). They include swords, gems,\nlotus, vajra, etc., as each signifying a specific improvisation of a\nskillful mean to enlighten the unenlightened. This also represents the\nunity-in-diversity of all thing-events as forms of Dainichi’s\nbody. 3. The “Dharma mandala” (Skrt:\nDharma-mandala; Jpn: hō mandara) pictures the\nuniverse as the sphere of Dainichi’s continuous communication of\ntruth (Dharma), as depicted in the arrangement of mantric\nseed syllables. And 4. The “karma mandala” (Skrt:\nkarma-mandala; Jpn: katsuma mandara) was originally\na three-dimensional mandala in sculpted form – including the\nphysical layout of the temple compound at Mt. Kōya – but\nwhich more often became a painted one instead. Showing the activities\n(karma) of buddhas and bodhisattvas implied in the other\nthree, this mandala depicts the fact that every change in any form\nwithin the cosmos is an act of the hosshin and conversely\nthat every act of the hosshin is an occurrence of things and\nevents in the cosmos. The four then depict four different aspects of\ntruth: body (the five material elements), mind (intention, compassion,\nthe sixth element), speech (communication), and action (all\nmovements). Through meditation upon them one comes to view everything\nas a mandala, the cosmos as a mandalic unfolding of the Dharma.\nUltimately the mandala depicts not only the cosmos or the Dharma as\nobject but also one’s own interior self in meditation as one\ninteriorizes it or as one visualizes it within.\n",
    "section_title": "3.8 The Mandalic Cosmos/Cosmos as Mandala",
    "entry_title": "Kūkai",
    "hierarchy_title": "Kūkai || Thought || The Mandalic Cosmos/Cosmos as Mandala",
    "tokenized_text": [
        "thought",
        "mandalic",
        "cosmoscosmos",
        "mandala",
        "mandalic",
        "cosmoscosmos",
        "mandala",
        "rishin",
        "chishin",
        "two",
        "mandalic",
        "embodiment",
        "viewed",
        "light",
        "concept",
        "hosshin",
        "seppō",
        "cosmos",
        "flowering",
        "dharma",
        "preached",
        "dainichi",
        "spread",
        "outward",
        "towards",
        "being",
        "receiving",
        "various",
        "degree",
        "accordance",
        "level",
        "understanding",
        "form",
        "flowering",
        "take",
        "mandala",
        "jpn",
        "mandara",
        "mandala",
        "shingon",
        "buddhism",
        "diagram",
        "picture",
        "usually",
        "painting",
        "picturing",
        "doctrine",
        "expounded",
        "two",
        "major",
        "esoteric",
        "scripture",
        "dainichikyō",
        "kongōchōgyō",
        "depicts",
        "visually",
        "form",
        "enlightenment",
        "take",
        "becomes",
        "manifest",
        "universe",
        "word",
        "taken",
        "visual",
        "depiction",
        "hosshin",
        "flowering",
        "hosshin",
        "seppō",
        "throughout",
        "cosmos",
        "serving",
        "map",
        "one",
        "journey",
        "enlightenment",
        "use",
        "understanding",
        "mandala",
        "another",
        "distinction",
        "shingon",
        "buddhism",
        "differentiating",
        "kūkai",
        "mind",
        "esoteric",
        "exoteric",
        "buddhism",
        "mandala",
        "prof",
        "metaphor",
        "new",
        "envisioning",
        "reality",
        "self",
        "world",
        "gardiner",
        "vehicle",
        "transformation",
        "vision",
        "whereby",
        "one",
        "envisions",
        "world",
        "mandala",
        "kūkai",
        "contention",
        "exoteric",
        "teaching",
        "move",
        "practitioner",
        "towards",
        "central",
        "summit",
        "mandala",
        "stepbystep",
        "specific",
        "vantage",
        "point",
        "without",
        "taking",
        "comprehensive",
        "view",
        "whole",
        "esoteric",
        "teaching",
        "hand",
        "take",
        "entirety",
        "cosmic",
        "mandala",
        "one",
        "comprehensive",
        "view",
        "allowing",
        "practitioner",
        "leap",
        "center",
        "realize",
        "nonduality",
        "hosshin",
        "esoteric",
        "tradition",
        "kūkai",
        "inherited",
        "huikuo",
        "two",
        "major",
        "mandala",
        "depict",
        "hosshin",
        "two",
        "different",
        "mandalic",
        "form",
        "mandala",
        "originally",
        "belonged",
        "one",
        "two",
        "esoteric",
        "lineage",
        "became",
        "combined",
        "china",
        "associated",
        "either",
        "two",
        "sūtras",
        "shingon",
        "doctrine",
        "traceable",
        "two",
        "sūtras",
        "supposed",
        "pictorially",
        "depicted",
        "two",
        "mandala",
        "taizō",
        "skrt",
        "garbha",
        "womb",
        "enlightenment",
        "kongōkai",
        "srkt",
        "vajradhātu",
        "vajra",
        "realm",
        "diamond",
        "realm",
        "realm",
        "adamantine",
        "thunderbolt",
        "mandala",
        "together",
        "called",
        "ryōbu",
        "mandara",
        "represent",
        "comprehensive",
        "unity",
        "also",
        "associated",
        "one",
        "two",
        "different",
        "concept",
        "ri",
        "pattern",
        "order",
        "referring",
        "emptiness",
        "reason",
        "discerned",
        "patternment",
        "chi",
        "wisdom",
        "ie",
        "wisdom",
        "emptiness",
        "accordingly",
        "hosshin",
        "understood",
        "embodied",
        "form",
        "rihosshin",
        "rishin",
        "chihosshin",
        "chishin",
        "two",
        "aspect",
        "ultimately",
        "nondualistic",
        "richi",
        "funi",
        "rihosshin",
        "depicted",
        "taizō",
        "mandara",
        "express",
        "truth",
        "expounded",
        "dainichikyō",
        "chihosshin",
        "depicted",
        "kongōkai",
        "mandara",
        "express",
        "truth",
        "expounded",
        "kongōchōgyō",
        "depict",
        "dainichi",
        "central",
        "deity",
        "buddha",
        "bodhisattva",
        "surrounding",
        "geometric",
        "arrangement",
        "taizōmandara",
        "full",
        "name",
        "daichitaizōsei",
        "mandara",
        "skrt",
        "garbhakośadhātu",
        "mandala",
        "great",
        "compassion",
        "womb",
        "repository",
        "birth",
        "mandala",
        "represents",
        "female",
        "principle",
        "express",
        "material",
        "world",
        "underlying",
        "empatternment",
        "ri",
        "buddha",
        "view",
        "truth",
        "summit",
        "enlightenment",
        "downward",
        "mundane",
        "world",
        "human",
        "ri",
        "chn",
        "li",
        "often",
        "translated",
        "english",
        "principle",
        "fact",
        "sense",
        "pattern",
        "esoteric",
        "buddhist",
        "context",
        "signifies",
        "pattern",
        "found",
        "interplay",
        "five",
        "material",
        "element",
        "constitute",
        "myriad",
        "thingevents",
        "phenomenon",
        "material",
        "element",
        "form",
        "object",
        "cognition",
        "mandala",
        "depicting",
        "rishin",
        "represents",
        "known",
        "commentary",
        "dainichikyō",
        "dainichikyō",
        "kaidai",
        "kūkai",
        "equates",
        "nature",
        "dainichi",
        "taken",
        "jishō",
        "hosshin",
        "rishin",
        "turn",
        "identifies",
        "rishin",
        "original",
        "enlightenment",
        "intrinsic",
        "sentient",
        "being",
        "hidden",
        "unmanifest",
        "potentiality",
        "known",
        "descending",
        "view",
        "summit",
        "taizō",
        "mandala",
        "represents",
        "enlightened",
        "universe",
        "perspective",
        "compassion",
        "expression",
        "female",
        "principle",
        "mother",
        "enfolds",
        "child",
        "care",
        "womb",
        "buddha",
        "compassion",
        "nurture",
        "original",
        "enlightenment",
        "lotus",
        "chief",
        "symbol",
        "picture",
        "represents",
        "manifestation",
        "dainichi",
        "cosmic",
        "activity",
        "dainichi",
        "occupies",
        "unmoving",
        "center",
        "myriad",
        "buddha",
        "bodhisattva",
        "deity",
        "layered",
        "around",
        "dainichi",
        "simultaneously",
        "pervades",
        "outermost",
        "edge",
        "diagram",
        "center",
        "enlightenment",
        "radiates",
        "outward",
        "spiral",
        "passing",
        "various",
        "buddha",
        "bodhisattva",
        "descending",
        "various",
        "level",
        "mind",
        "outward",
        "phenomenal",
        "world",
        "becomes",
        "concrete",
        "reaching",
        "human",
        "world",
        "realm",
        "animal",
        "hellbeings",
        "hungry",
        "ghost",
        "thus",
        "wellspring",
        "activity",
        "depicted",
        "endlessly",
        "flowing",
        "center",
        "activity",
        "manifest",
        "wellingup",
        "compassion",
        "buddha",
        "wisdom",
        "move",
        "outwards",
        "downwards",
        "simultaneously",
        "being",
        "directed",
        "inwards",
        "upwards",
        "towards",
        "enlightenment",
        "depicted",
        "mandalic",
        "center",
        "two",
        "movement",
        "nondualistic",
        "kongōkai",
        "mandara",
        "srkt",
        "vajradhātu",
        "mandala",
        "vajrarealm",
        "mandala",
        "represents",
        "male",
        "priciple",
        "embodies",
        "vajrawisdom",
        "wisdom",
        "adamantine",
        "imperishable",
        "illuminates",
        "enfolds",
        "being",
        "symbolizes",
        "sixth",
        "element",
        "mental",
        "element",
        "chi",
        "wisdom",
        "referring",
        "mental",
        "realm",
        "knower",
        "subject",
        "cognitive",
        "experience",
        "also",
        "represents",
        "buddha",
        "adamantine",
        "power",
        "illumination",
        "realizes",
        "enlightenment",
        "symbolized",
        "vajra",
        "adamantine",
        "weapon",
        "many",
        "point",
        "respect",
        "mind",
        "symbolizes",
        "practitioner",
        "mind",
        "also",
        "allcomprehensive",
        "mind",
        "dainichi",
        "indestructible",
        "potential",
        "cosmos",
        "buddha",
        "embodiment",
        "wisdom",
        "chishin",
        "kongōkai",
        "mandala",
        "rectangle",
        "consisting",
        "combination",
        "nine",
        "smaller",
        "mandala",
        "originally",
        "independent",
        "mandala",
        "juxtaposed",
        "depict",
        "double",
        "spiraling",
        "movement",
        "centrifugal",
        "centripetal",
        "one",
        "hand",
        "outward",
        "buddha",
        "enlightenment",
        "towards",
        "phenomenal",
        "world",
        "hand",
        "inward",
        "being",
        "periphery",
        "mundane",
        "world",
        "spiritual",
        "progression",
        "towards",
        "enlightenment",
        "center",
        "nine",
        "smaller",
        "mandala",
        "basic",
        "lower",
        "left",
        "corner",
        "representation",
        "socalled",
        "four",
        "mandala",
        "shimandara",
        "kūkai",
        "classified",
        "form",
        "appearance",
        "hosshin",
        "shimandara",
        "next",
        "section",
        "together",
        "nine",
        "depict",
        "unending",
        "activity",
        "enlightened",
        "mind",
        "moving",
        "clockwise",
        "center",
        "take",
        "increasingly",
        "concrete",
        "form",
        "engaging",
        "skillful",
        "mean",
        "help",
        "unenlightened",
        "unenlightened",
        "evolve",
        "towards",
        "center",
        "buddha",
        "perspective",
        "center",
        "moving",
        "outwards",
        "individual",
        "practitioner",
        "perspective",
        "periphery",
        "drawn",
        "inwards",
        "enlightened",
        "wisdom",
        "remain",
        "aloof",
        "reality",
        "unenlightened",
        "life",
        "skillful",
        "mean",
        "thus",
        "embodies",
        "wisdom",
        "concrete",
        "phenomenal",
        "activity",
        "respect",
        "mandala",
        "emphasizes",
        "nonduality",
        "wisdom",
        "hannya",
        "skillful",
        "mean",
        "symbolizes",
        "wisdom",
        "know",
        "truth",
        "dharma",
        "separate",
        "manifestation",
        "together",
        "two",
        "mandalic",
        "form",
        "depict",
        "form",
        "cosmos",
        "dynamic",
        "process",
        "interrelating",
        "uniting",
        "transcendent",
        "mundane",
        "enlightened",
        "ignorant",
        "buddha",
        "man",
        "macrocosmos",
        "microcosmos",
        "matter",
        "mind",
        "pattern",
        "wisdom",
        "visually",
        "represent",
        "two",
        "simultaneous",
        "overlapping",
        "aspect",
        "enlightenment",
        "variously",
        "described",
        "emptiness",
        "form",
        "compassion",
        "wisdom",
        "object",
        "subject",
        "dimension",
        "practitioner",
        "guided",
        "buddha",
        "dimension",
        "towards",
        "practitioner",
        "evolves",
        "kūkai",
        "reading",
        "inseparable",
        "aspect",
        "hosshin",
        "depicted",
        "two",
        "mandala",
        "different",
        "nondualistic",
        "perspective",
        "enlightenment",
        "would",
        "experiential",
        "realization",
        "nonduality",
        "richi",
        "funi",
        "shingon",
        "practice",
        "therefore",
        "taizō",
        "mandala",
        "rishin",
        "hung",
        "east",
        "wall",
        "meditation",
        "hall",
        "kongōkai",
        "mandala",
        "chishin",
        "hung",
        "west",
        "wall",
        "four",
        "type",
        "mandala",
        "addition",
        "two",
        "mandalic",
        "embodiment",
        "hosshin",
        "kūkai",
        "sokushinjōbutsugi",
        "ch",
        "classifies",
        "mandala",
        "general",
        "four",
        "type",
        "depicting",
        "different",
        "way",
        "whereby",
        "dharma",
        "manifest",
        "great",
        "mandala",
        "skrt",
        "mahāmandala",
        "jpn",
        "daimandara",
        "symbolizes",
        "cosmic",
        "buddha",
        "physical",
        "extension",
        "along",
        "stage",
        "including",
        "buddha",
        "bodhisattva",
        "deity",
        "depicted",
        "perfect",
        "anthropormophic",
        "form",
        "surrounding",
        "dainichi",
        "center",
        "painted",
        "different",
        "color",
        "represent",
        "different",
        "material",
        "element",
        "samaya",
        "mandala",
        "skrt",
        "samayamandala",
        "jpn",
        "sanmaya",
        "mandara",
        "picture",
        "buddhacumuniverse",
        "variety",
        "article",
        "sign",
        "symbolizing",
        "omnipresencing",
        "dainichi",
        "intention",
        "skrt",
        "samaya",
        "jpn",
        "sanmaya",
        "include",
        "sword",
        "gem",
        "lotus",
        "vajra",
        "etc",
        "signifying",
        "specific",
        "improvisation",
        "skillful",
        "mean",
        "enlighten",
        "unenlightened",
        "also",
        "represents",
        "unityindiversity",
        "thingevents",
        "form",
        "dainichi",
        "body",
        "dharma",
        "mandala",
        "skrt",
        "dharmamandala",
        "jpn",
        "hō",
        "mandara",
        "picture",
        "universe",
        "sphere",
        "dainichi",
        "continuous",
        "communication",
        "truth",
        "dharma",
        "depicted",
        "arrangement",
        "mantric",
        "seed",
        "syllable",
        "karma",
        "mandala",
        "skrt",
        "karmamandala",
        "jpn",
        "katsuma",
        "mandara",
        "originally",
        "threedimensional",
        "mandala",
        "sculpted",
        "form",
        "including",
        "physical",
        "layout",
        "temple",
        "compound",
        "mt",
        "kōya",
        "often",
        "became",
        "painted",
        "one",
        "instead",
        "showing",
        "activity",
        "karma",
        "buddha",
        "bodhisattva",
        "implied",
        "three",
        "mandala",
        "depicts",
        "fact",
        "every",
        "change",
        "form",
        "within",
        "cosmos",
        "act",
        "hosshin",
        "conversely",
        "every",
        "act",
        "hosshin",
        "occurrence",
        "thing",
        "event",
        "cosmos",
        "four",
        "depict",
        "four",
        "different",
        "aspect",
        "truth",
        "body",
        "five",
        "material",
        "element",
        "mind",
        "intention",
        "compassion",
        "sixth",
        "element",
        "speech",
        "communication",
        "action",
        "movement",
        "meditation",
        "upon",
        "one",
        "come",
        "view",
        "everything",
        "mandala",
        "cosmos",
        "mandalic",
        "unfolding",
        "dharma",
        "ultimately",
        "mandala",
        "depicts",
        "cosmos",
        "dharma",
        "object",
        "also",
        "one",
        "interior",
        "self",
        "meditation",
        "one",
        "interiorizes",
        "one",
        "visualizes",
        "within"
    ]
}