{
    "main_text": "Thought || The Esoteric View of the Buddha: The Four Embodiments of Truth (the Dharma)\n3.3 The Esoteric View of the Buddha: The Four Embodiments of Truth (the Dharma)\n\nIn order to understand the above-mentioned distinctions made by\nKūkai, we need to comprehend what exactly the Buddha signifies\nfor Kūkai. This is also important as his esoteric view of the\nBuddha underlies all of the major points of his philosophy that we\nshall be discussing further below.\n\nIn traditional Mahāyāna Buddhist theory, the Buddha is\nconceived in terms of three modes or forms of embodiments\n(trikāya): dharmakāya (Jpn:\nhosshin), nirmanakāya, and\nsambhogakāya. While originally the term buddha,\nmeaning “enlightened one,” was reserved for\nŚakyamuni, the historical founder of Buddhism, it eventually came\nto designate the ideal for humanity. This ideal became equated with\nthe “truth” (Skrt: Dharma; Jpn:\nhō), taught by the Buddha, of the nature of being. To be\na “buddha” is then to be enlightened to that truth, which\ncame to also mean the realization of one’s non-duality with the\nDharma. It is in this significance that one way of understanding the\nBuddha is in terms of the universal “embodiment of the\nDharma” (Skrt: dharmakāya; Jpn: hosshin).\nFor traditional Mahāyāna, this hosshin is an\nabstract principle and hence impersonal and non-preaching. However as\nimplied in the foregoing section, for Kūkai the hosshin\nis identified with the Buddha Dainichi. That is, in one aspect the\nhosshin may be understood to be a personal being who preaches\nthe Dharma by concretizing it in the cosmos as his own body. (Of\ncourse though to avoid anthropomorphism, the hosshin cannot\nbe reduced to this aspect.) In the traditional three-body doctrine,\nhowever, it is the other two forms of embodiment that preach. The\nBuddha, when regarded as embodying the Dharma in an historical earthly\nbeing, such as Śakyamuni, who preaches the Dharma to humans, is\ncalled the nirmanakāya (“embodiment of\ntransformation”). And the Buddha as enjoying his fruits of\nenlightenment by residing in a celestial buddha-realm, while unfolding\nfurther truths for advanced bodhisattva beings and acting as a savior\nto the earthly, is called the sambhogakāya\n(“embodiment of bliss”). An example of would be Amida\nresiding in his “Pure Land.”\n\nWhat distinguishes Kūkai’s understanding of the Buddha is\nthat he takes the notion of the “embodiment of the Dharma”\nliterally and radically. Hosshin in Shingon thought is not an\nabstract truth transcending the mundane world. Rather all\nphenomena and thing-events of this cosmos, in their very transience,\nare each themselves embodiments of truth and the cosmos as a whole\ncomprised of these impermanent and interdependent beings is eternally\nan embodiment of truth, the hosshin. Moreover this concrete\ncosmic identification between Buddha, truth, and the cosmos of\nthing-events, was “personal.” That is, hosshin\nwas equated with the Buddha Dainichi. The cosmos as the\nmanifestation of truth, the Dharma, was itself hence equated with the\nbody of the personal Buddha Dainichi. And in turn, Dainichi with his\ncosmic body is then the embodied personification of the universal\nBuddha-nature inherent in all beings and the Dharma that is manifest\neverywhere. Prior to Hui-kuo, this identification of Dainichi with the\nhosshin in Mantrayāna Buddhism was ambiguous and not\nthorough. In the Dainichi-kyō, a sun metaphor is used to\nname its central Buddha, “Dainichi”\n(Mahāvairocana, transliterated as\nMakabirushana), meaning “Great Sun,” as the being\nwhose light illuminates and enlightens all beings in a way akin to the\nsun’s life-giving light. All other deities are seen as\nmanifestations of this light. Dainichi’s identification with the\nhosshin nevertheless remains ambiguous. While he probably\ninfluenced Kūkai in regards to this equation, Hui-kuo himself\nhowever left no written explications. Kūkai thus has been\nregarded as the first to provide a complete and systematic exposition\nof the nature of the Buddha Dainichi as the hosshin.\nThe sun metaphor of illumination – as the source of both being\nand of knowledge (enlightenment) – befits the universality of\nthe hosshin perfectly. The illumination of the “Great\nSun” (Dainichi) becomes accordingly understood to mean the\nomnipresencing of the Dharma throughout the cosmos, an omnipresencing\nin turn equated with the Buddha’s preaching. This\n“proof” that the hosshin does in fact preach\nhelped Kūkai in distinguishing his esoteric doctrines from those\nof exoteric Buddhism.\n\nThis identification between Dainichi and hosshin held many\nimplications for Kūkai, which became worked out in his various\ndoctrines. For example, the equation of Dainichi’s body-and-mind\nwith the cosmos itself also means the immanent presence of the Buddha\nwithin, and as, the body-and-mind of each and every one of\nus. And so Dainichi’s “enlightened mind”\n(bodhicitta) becomes synonymous with the Mahāyāna\ndoctrine of “original enlightenment” (hongaku)\nwithin all beings. But as the Dharma signifies the interdependent\norigination, hence, emptiness (kū) of all beings, its\nembodiment may be said to be an “empty body.” We will\nexamine these ideas in greater detail later.\n\nKūkai’s Shingon Buddhism postulated four forms of\nembodiment as the hosshin itself. This notion of the\nfour forms of the hosshin (shishu hosshin) roughly\ncorresponds to, while reworking, the Mahāyāna\ntrikāya doctrine. 1) First there is the hosshin\nin its absolute sense, called jishō hosshin.\nThis is the embodiment of the Dharma as Dainichi eternally remaining\nin the state of samadhi but also engaging in a monologue,\nwhich reveals its “self-nature” and unfolds the Dharma\nthrough its omni-presencing manifestations in the cosmos. 2) Secondly\nthere is the juyū hosshin, which is the\nhosshin enjoying bliss. But this is characterized in its two\naspects: A) “the self-oriented embodiment”\n(jijuyūshin) describing the hosshin as enjoying\nits own state of samadhic bliss; and B) “the\nother-oriented embodiment” (tajuyūshin) describing\nthe hosshin in the form of various celestial buddhas\ndirecting the blissful fruits of self-enlightenment for the benefit of\nothers. 3) Thirdly there is the hosshin in its historical and\nearthly transformation, called henge hosshin as\nmanifest in the enlightened personage of Śakyamuni. This\nhistorical Buddha guides ordinary, ignorant, and irreligious people\ntowards the Dharma, but for this sake must improvise skillful (or:\nexpedient) means (Skrt: upāya; Jpn: hōben)\nappropriate to the time, place, and comprehension of a given audience.\n4) And fourthly there is the hosshin in its universal\nemanation, called tōru hosshin. This is its\nmanifestation in all sorts of bodily forms appropriate to the\nsituation in order to expound the Dharma, often appearing in the same\nform as the listener in order to share in his suffering. This\nconception also became generalized by Kūkai to include all\nphenomenal thing-events – together with their respective\nenvironments or “realms” – as “bodies”\nfilling up the entire cosmos. As such every phenomenon plays the role\nof a “buddha,” teaching some aspect of the Dharma and\nexpressing the Buddha’s enlightened wisdom and compassion, to\nrealize the original enlightenment of all. Interestingly this implies\nthat each one of us are already buddhas expounding some\naspect of the Dharma to one another, but which we must then become\naware of in order to realize our own Buddhahood.\n\nIt is interesting to note that the celestial buddhas and the\nhistorical buddha (Śakyamuni) are here included as themselves\nforms of the hosshin, when in the traditional\ntrikāya doctrine of Mahāyāna, they were\ndistinguished from the hosshin, which in turn was seen as\nabstract and impersonal. Furthermore, according to this doctrine of\nthe four forms of the hosshin, it is not only the celestial\nbuddhas in the heavens and the historical buddha on earth who preach,\nbut all four forms. From Kūkai’s esoteric\nstandpoint, the hosshin even in its samadhic\nself-enjoyment is preaching the Dharma in its cosmic monologue –\nfor its very embodiment is the cosmos itself so that its\nsamadhic experiencing of the Dharma permeates everywhere and\neverywhen. Simply put, Dainichi as the hosshin and\nas the personification of the Dharma concretely embodied in\nthe cosmos, is directly preaching the Dharma to the world via\nhis omni-presencing being. And while in the broader sense the\nhosshin is thus preaching via the cosmos, in the\nnarrower sense its preaching is manifest in the teachings of esoteric\nBuddhism itself. On the other hand the doctrines of what Kūkai\nclassified as exoteric are traced to either what the historical\nbuddha, Śakyamuni, preached or what the celestial buddhas are\npreaching in the heavenly dimensions. Insofar as they themselves are\nembodiments of the hosshin, what they preach are indirectly\nteachings of the hosshin. But their teachings are\nprovisional, relative only to the comprehension of their audience and\nthe circumstance of time and place wherein they are preached.\nKūkai claims, however, that through training in Shingon\nesotericism, one can receive the teachings of the hosshin\ndirectly – that is, receive the timeless and absolute,\ncosmic and holistic, truth of the Dharma in its very embodiment. This\nwas a radical and heterodox claim at the time since the teaching\ncommon to all orthodox Buddhist schools was that the sūtras can\nall be traced back to the preachings of Śakyamuni and this\nlineage is what legitimated their use of the sūtras. But for\nKūkai, the historical Buddha was but one manifestation of the\ncosmic Buddha, Dainichi, who embodies the truth (Dharma,\nhō) it preaches as the hosshin.\n",
    "section_title": "3.3 The Esoteric View of the Buddha: The Four Embodiments of Truth (the Dharma)",
    "entry_title": "Kūkai",
    "hierarchy_title": "Kūkai || Thought || The Esoteric View of the Buddha: The Four Embodiments of Truth (the Dharma)",
    "tokenized_text": [
        "thought",
        "esoteric",
        "view",
        "buddha",
        "four",
        "embodiment",
        "truth",
        "dharma",
        "esoteric",
        "view",
        "buddha",
        "four",
        "embodiment",
        "truth",
        "dharma",
        "order",
        "understand",
        "abovementioned",
        "distinction",
        "made",
        "kūkai",
        "need",
        "comprehend",
        "exactly",
        "buddha",
        "signifies",
        "kūkai",
        "also",
        "important",
        "esoteric",
        "view",
        "buddha",
        "underlies",
        "major",
        "point",
        "philosophy",
        "shall",
        "discussing",
        "traditional",
        "mahāyāna",
        "buddhist",
        "theory",
        "buddha",
        "conceived",
        "term",
        "three",
        "mode",
        "form",
        "embodiment",
        "trikāya",
        "dharmakāya",
        "jpn",
        "hosshin",
        "nirmanakāya",
        "sambhogakāya",
        "originally",
        "term",
        "buddha",
        "meaning",
        "enlightened",
        "one",
        "reserved",
        "śakyamuni",
        "historical",
        "founder",
        "buddhism",
        "eventually",
        "came",
        "designate",
        "ideal",
        "humanity",
        "ideal",
        "became",
        "equated",
        "truth",
        "skrt",
        "dharma",
        "jpn",
        "hō",
        "taught",
        "buddha",
        "nature",
        "buddha",
        "enlightened",
        "truth",
        "came",
        "also",
        "mean",
        "realization",
        "one",
        "nonduality",
        "dharma",
        "significance",
        "one",
        "way",
        "understanding",
        "buddha",
        "term",
        "universal",
        "embodiment",
        "dharma",
        "skrt",
        "dharmakāya",
        "jpn",
        "hosshin",
        "traditional",
        "mahāyāna",
        "hosshin",
        "abstract",
        "principle",
        "hence",
        "impersonal",
        "nonpreaching",
        "however",
        "implied",
        "foregoing",
        "section",
        "kūkai",
        "hosshin",
        "identified",
        "buddha",
        "dainichi",
        "one",
        "aspect",
        "hosshin",
        "may",
        "understood",
        "personal",
        "preaches",
        "dharma",
        "concretizing",
        "cosmos",
        "body",
        "course",
        "though",
        "avoid",
        "anthropomorphism",
        "hosshin",
        "reduced",
        "aspect",
        "traditional",
        "threebody",
        "doctrine",
        "however",
        "two",
        "form",
        "embodiment",
        "preach",
        "buddha",
        "regarded",
        "embodying",
        "dharma",
        "historical",
        "earthly",
        "śakyamuni",
        "preaches",
        "dharma",
        "human",
        "called",
        "nirmanakāya",
        "embodiment",
        "transformation",
        "buddha",
        "enjoying",
        "fruit",
        "enlightenment",
        "residing",
        "celestial",
        "buddharealm",
        "unfolding",
        "truth",
        "advanced",
        "bodhisattva",
        "being",
        "acting",
        "savior",
        "earthly",
        "called",
        "sambhogakāya",
        "embodiment",
        "bliss",
        "example",
        "would",
        "amida",
        "residing",
        "pure",
        "land",
        "distinguishes",
        "kūkai",
        "understanding",
        "buddha",
        "take",
        "notion",
        "embodiment",
        "dharma",
        "literally",
        "radically",
        "hosshin",
        "shingon",
        "thought",
        "abstract",
        "truth",
        "transcending",
        "mundane",
        "world",
        "rather",
        "phenomenon",
        "thingevents",
        "cosmos",
        "transience",
        "embodiment",
        "truth",
        "cosmos",
        "whole",
        "comprised",
        "impermanent",
        "interdependent",
        "being",
        "eternally",
        "embodiment",
        "truth",
        "hosshin",
        "moreover",
        "concrete",
        "cosmic",
        "identification",
        "buddha",
        "truth",
        "cosmos",
        "thingevents",
        "personal",
        "hosshin",
        "equated",
        "buddha",
        "dainichi",
        "cosmos",
        "manifestation",
        "truth",
        "dharma",
        "hence",
        "equated",
        "body",
        "personal",
        "buddha",
        "dainichi",
        "turn",
        "dainichi",
        "cosmic",
        "body",
        "embodied",
        "personification",
        "universal",
        "buddhanature",
        "inherent",
        "being",
        "dharma",
        "manifest",
        "everywhere",
        "prior",
        "huikuo",
        "identification",
        "dainichi",
        "hosshin",
        "mantrayāna",
        "buddhism",
        "ambiguous",
        "thorough",
        "dainichikyō",
        "sun",
        "metaphor",
        "used",
        "name",
        "central",
        "buddha",
        "dainichi",
        "mahāvairocana",
        "transliterated",
        "makabirushana",
        "meaning",
        "great",
        "sun",
        "whose",
        "light",
        "illuminates",
        "enlightens",
        "being",
        "way",
        "akin",
        "sun",
        "lifegiving",
        "light",
        "deity",
        "seen",
        "manifestation",
        "light",
        "dainichi",
        "identification",
        "hosshin",
        "nevertheless",
        "remains",
        "ambiguous",
        "probably",
        "influenced",
        "kūkai",
        "regard",
        "equation",
        "huikuo",
        "however",
        "left",
        "written",
        "explication",
        "kūkai",
        "thus",
        "regarded",
        "first",
        "provide",
        "complete",
        "systematic",
        "exposition",
        "nature",
        "buddha",
        "dainichi",
        "hosshin",
        "sun",
        "metaphor",
        "illumination",
        "source",
        "knowledge",
        "enlightenment",
        "befits",
        "universality",
        "hosshin",
        "perfectly",
        "illumination",
        "great",
        "sun",
        "dainichi",
        "becomes",
        "accordingly",
        "understood",
        "mean",
        "omnipresencing",
        "dharma",
        "throughout",
        "cosmos",
        "omnipresencing",
        "turn",
        "equated",
        "buddha",
        "preaching",
        "proof",
        "hosshin",
        "fact",
        "preach",
        "helped",
        "kūkai",
        "distinguishing",
        "esoteric",
        "doctrine",
        "exoteric",
        "buddhism",
        "identification",
        "dainichi",
        "hosshin",
        "held",
        "many",
        "implication",
        "kūkai",
        "became",
        "worked",
        "various",
        "doctrine",
        "example",
        "equation",
        "dainichi",
        "bodyandmind",
        "cosmos",
        "also",
        "mean",
        "immanent",
        "presence",
        "buddha",
        "within",
        "bodyandmind",
        "every",
        "one",
        "u",
        "dainichi",
        "enlightened",
        "mind",
        "bodhicitta",
        "becomes",
        "synonymous",
        "mahāyāna",
        "doctrine",
        "original",
        "enlightenment",
        "hongaku",
        "within",
        "being",
        "dharma",
        "signifies",
        "interdependent",
        "origination",
        "hence",
        "emptiness",
        "kū",
        "being",
        "embodiment",
        "may",
        "said",
        "empty",
        "body",
        "examine",
        "idea",
        "greater",
        "detail",
        "later",
        "kūkai",
        "shingon",
        "buddhism",
        "postulated",
        "four",
        "form",
        "embodiment",
        "hosshin",
        "notion",
        "four",
        "form",
        "hosshin",
        "shishu",
        "hosshin",
        "roughly",
        "corresponds",
        "reworking",
        "mahāyāna",
        "trikāya",
        "doctrine",
        "first",
        "hosshin",
        "absolute",
        "sense",
        "called",
        "jishō",
        "hosshin",
        "embodiment",
        "dharma",
        "dainichi",
        "eternally",
        "remaining",
        "state",
        "samadhi",
        "also",
        "engaging",
        "monologue",
        "reveals",
        "selfnature",
        "unfolds",
        "dharma",
        "omnipresencing",
        "manifestation",
        "cosmos",
        "secondly",
        "juyū",
        "hosshin",
        "hosshin",
        "enjoying",
        "bliss",
        "characterized",
        "two",
        "aspect",
        "selforiented",
        "embodiment",
        "jijuyūshin",
        "describing",
        "hosshin",
        "enjoying",
        "state",
        "samadhic",
        "bliss",
        "b",
        "otheroriented",
        "embodiment",
        "tajuyūshin",
        "describing",
        "hosshin",
        "form",
        "various",
        "celestial",
        "buddha",
        "directing",
        "blissful",
        "fruit",
        "selfenlightenment",
        "benefit",
        "others",
        "thirdly",
        "hosshin",
        "historical",
        "earthly",
        "transformation",
        "called",
        "henge",
        "hosshin",
        "manifest",
        "enlightened",
        "personage",
        "śakyamuni",
        "historical",
        "buddha",
        "guide",
        "ordinary",
        "ignorant",
        "irreligious",
        "people",
        "towards",
        "dharma",
        "sake",
        "must",
        "improvise",
        "skillful",
        "expedient",
        "mean",
        "skrt",
        "upāya",
        "jpn",
        "hōben",
        "appropriate",
        "time",
        "place",
        "comprehension",
        "given",
        "audience",
        "fourthly",
        "hosshin",
        "universal",
        "emanation",
        "called",
        "tōru",
        "hosshin",
        "manifestation",
        "sort",
        "bodily",
        "form",
        "appropriate",
        "situation",
        "order",
        "expound",
        "dharma",
        "often",
        "appearing",
        "form",
        "listener",
        "order",
        "share",
        "suffering",
        "conception",
        "also",
        "became",
        "generalized",
        "kūkai",
        "include",
        "phenomenal",
        "thingevents",
        "together",
        "respective",
        "environment",
        "realm",
        "body",
        "filling",
        "entire",
        "cosmos",
        "every",
        "phenomenon",
        "play",
        "role",
        "buddha",
        "teaching",
        "aspect",
        "dharma",
        "expressing",
        "buddha",
        "enlightened",
        "wisdom",
        "compassion",
        "realize",
        "original",
        "enlightenment",
        "interestingly",
        "implies",
        "one",
        "u",
        "already",
        "buddha",
        "expounding",
        "aspect",
        "dharma",
        "one",
        "another",
        "must",
        "become",
        "aware",
        "order",
        "realize",
        "buddhahood",
        "interesting",
        "note",
        "celestial",
        "buddha",
        "historical",
        "buddha",
        "śakyamuni",
        "included",
        "form",
        "hosshin",
        "traditional",
        "trikāya",
        "doctrine",
        "mahāyāna",
        "distinguished",
        "hosshin",
        "turn",
        "seen",
        "abstract",
        "impersonal",
        "furthermore",
        "according",
        "doctrine",
        "four",
        "form",
        "hosshin",
        "celestial",
        "buddha",
        "heaven",
        "historical",
        "buddha",
        "earth",
        "preach",
        "four",
        "form",
        "kūkai",
        "esoteric",
        "standpoint",
        "hosshin",
        "even",
        "samadhic",
        "selfenjoyment",
        "preaching",
        "dharma",
        "cosmic",
        "monologue",
        "embodiment",
        "cosmos",
        "samadhic",
        "experiencing",
        "dharma",
        "permeates",
        "everywhere",
        "everywhen",
        "simply",
        "put",
        "dainichi",
        "hosshin",
        "personification",
        "dharma",
        "concretely",
        "embodied",
        "cosmos",
        "directly",
        "preaching",
        "dharma",
        "world",
        "via",
        "omnipresencing",
        "broader",
        "sense",
        "hosshin",
        "thus",
        "preaching",
        "via",
        "cosmos",
        "narrower",
        "sense",
        "preaching",
        "manifest",
        "teaching",
        "esoteric",
        "buddhism",
        "hand",
        "doctrine",
        "kūkai",
        "classified",
        "exoteric",
        "traced",
        "either",
        "historical",
        "buddha",
        "śakyamuni",
        "preached",
        "celestial",
        "buddha",
        "preaching",
        "heavenly",
        "dimension",
        "insofar",
        "embodiment",
        "hosshin",
        "preach",
        "indirectly",
        "teaching",
        "hosshin",
        "teaching",
        "provisional",
        "relative",
        "comprehension",
        "audience",
        "circumstance",
        "time",
        "place",
        "wherein",
        "preached",
        "kūkai",
        "claim",
        "however",
        "training",
        "shingon",
        "esotericism",
        "one",
        "receive",
        "teaching",
        "hosshin",
        "directly",
        "receive",
        "timeless",
        "absolute",
        "cosmic",
        "holistic",
        "truth",
        "dharma",
        "embodiment",
        "radical",
        "heterodox",
        "claim",
        "time",
        "since",
        "teaching",
        "common",
        "orthodox",
        "buddhist",
        "school",
        "sūtras",
        "traced",
        "back",
        "preaching",
        "śakyamuni",
        "lineage",
        "legitimated",
        "use",
        "sūtras",
        "kūkai",
        "historical",
        "buddha",
        "one",
        "manifestation",
        "cosmic",
        "buddha",
        "dainichi",
        "embodies",
        "truth",
        "dharma",
        "hō",
        "preaches",
        "hosshin"
    ]
}