{
    "main_text": "Absolute Nothingness: Giving Philosophical Form to the Formless || Nishida’s Topology of Absolute Nothingness\n3.3 Nishida’s Topology of Absolute Nothingness\n\nBesides contrasting Western being with Eastern nothingness, in his\nlater writings Nishida also at times makes a broad distinction between\na Western “logic of things” and an Eastern “logic of\nthe heart-mind (kokoro).” While Western thought tends\nto begin with an objective logic of substances (be these physical or\nmental), he claims that in Buddhism one can find the germ of a logic\nof the heart-mind, even if traditionally this remained largely at the\nlevel of an expression of personal experience rather than being fully\ndeveloped into a genuinely philosophical logic (see Nishida 1964,\n356). Scholars of Buddhism may object that it was Nishida’s own\nknowledge of Buddhism that remained too much at the level of personal\nexperience, rather than the sophisticated discourses of Abhidharma,\nMādhyamaka, Yogācāra, Tiantai, and Huayan traditions of\nBuddhist philosophy themselves.\n\nIn any case, in the development of Nishida’s thought,\n“being” is thought of in terms of the objectivity of\ndeterminate things, “relative nothingness” is understood\nas a mere privation or simple negation of being, and an enveloping\nsense of “nothingness” is provisionally associated with a\nkind of transcendental subjectivity of consciousness or the\nheart-mind. Ultimately, however, Nishida comes to posit absolute\nnothingness as the “place” (basho) that embraces\nboth subjective (noetic) and objective (noematic) dimensions\nof reality. Thus, he relegates not only privation of being but also\nsubjective nothingness, in the sense of the “field of\nconsciousness,” to a type of “relative\n nothingness.”[10]\n\nIn 1934 Nishida writes: “Reality is being and at the same time\nnothingness; it is being-and-nothingness [u-soku-mu],\nnothingness-and-being; it is both subjective and objective, noetic and\nnoematic. Reality is the unity of subjectivity and objectivity, and\nthus the self-identity of what is absolutely contradictory. Or rather,\nit is not that [the separate spheres of] subjectivity and objectivity\ncome to unite, and then we first have reality. [The opposition of]\nsubjectivity and objectivity must instead be thought from out of a\ndynamically dialectical reality that is self-determining” (NKZ\nVII, 441; see Nishida 1970, 29). Reality, as the dialectical\n“self-determination of absolute nothingness,” is in\nNishida’s later works understood as a dynamic “identity of\nthe absolute contradiction” between subjective (relative)\nnothingness and objective being. Absolute nothingness is the temporal\nand spatial “place” wherein individual persons and things\ndetermine one another in their mutual interactions.\n\nThe “place of absolute nothingess” (zettai-mu no\nbasho) first became the central concept of Nishida’s\nthought in the mid-1920s, though he continued to develop and rethink\nthe idea up until his last completed essay in 1945, “The Logic\nof Place and the Religious Worldview.” Nishida first explicitly\nworked out an idea of absolute nothingness in his 1926 book, From\nThat Which Acts to That Which Sees (NKZ IV), a book which\ninaugurated his middle-period of thought. In this work, which includes\nan important essay entitled “Place”\n(“Basho”), Nishida’s topological reasoning\ndevelops in rough outline as\n follows[11]:\n\nJust as all events must “take place” somewhere, all beings\nmust be situated in some place. Beings always exist in relation to\nother beings, and any relation requires a third term, namely, the\nplace or medium wherein they are related. In other words, for A and B\nto be related, there must be some place, C, in which their relation is\nsituated. To begin with, we can understand this C as the spatial\n“context” in which objects are situated in relation to one\nanother. But the context in which things are defined is more than\nspatial; a thing is not only here as opposed to there. Things are\ndetermined according to a number of criteria, each of which operates\nwithin its own field of judgment. Hence, the place C can be further\nunderstood as a “category” of judgment, such as the\nquality “color.” Red and blue are revealed, and contrasted\nwith one another, as colors within the same color field.\n\nIn order to let concrete things reveal themselves yet more fully,\nhowever, we should think of C as “consciousness.” Our\nminds are able to correlate various categories of judgment, such as\ncolor, size, shape, location, etc., and therefore to perceive\nindividual things as composed of unique combinations of various\nqualities and relations. For example, we are conscious of a certain\nthing as a round, soft, red, sweet, apple sitting on a table. The\nfield of consciousness is the field in which these different\ncategories are unified in the perception and judgment of the qualities\nof a particular thing in relation to other particular things and their\nqualities.\n\nUltimately, however, there is a crucial limit to the subjective\n“field of consciousness.” As Kant demonstrated, subjective\nconsciousness cannot reflect things as they are in themselves, but\nonly as they appear when schematized according to subjective\ncategories. What, then, is the ultimate place wherein the encounter\nbetween subjects and objects takes place, wherein persons and things\ncoexist? According to Nishida, this must be the place wherein persons\nand things not only undergo changes in accidental categorical\nqualities, but wherein they essentially and existentially “come\nto be and pass away.” It is the place, not just of intellectual\njudgments, but of birth and death. This ultimate “groundless\nground,” which “envelops” all beings, yet which does\nso in such a way that lets them contain their own principle of\nself-determination, Nishida calls “the place of true\nnothingness.” Although in no sense a determinate being, neither\nis this place of true or absolute nothingness a mere static vacuity.\nIt must be thought of as both the epistemic source of consciousness\nand the ontological origin of beings.\n\nAlthough Nishida comes to the idea of the place of absolute\nnothingness most directly through his confrontations with Kant and\nNeo-Kantianism, he does not shy from thinking this place in\nmetaphysical as well as epistemological terms: nothingness is not\nmerely a reflective, but is also a creative principle (NKZ IV,\n238–39). As he writes much later, “absolute nothingness at\nonce transcends everything and is that by which everything is\nconstituted” (NKZ IX, 6). And yet, Nishida repeatedly tells us\nthat, as no-thing outside of or other than the place of the coming to\nbe and passing away of truly individual beings, absolute nothingness\nis not to be thought of as a “transcendent\nbeing.” Nor is it to be understood as the processional unfolding\nof a “potential being,” that is to say, as a kind of\nHegelian “world Spirit” with its own cunning reason at\nwork behind the scenes of its historical march toward\nself-realization. The absolute, according to Nishida, must be thought\nof as nothingness in order to distinguish it from all ontologies that\nwould reduce the uniqueness and autonomy of truly individual beings\neither to a transcendent being or to an underlying mechanical or\nteleological process.\n\nOne of the driving concerns behind Nishida’s repeated insistence\nthat the absolute be thought of in the meontological terms of a\nformless, indeterminate place of absolute nothingness, is that only\ntherein can self-determining and irreducibly singular individuals be\ngiven their due. All ontologies of universal being fail to allow for\nthe existence of the “true individual,” or for the genuine\nencounter between such individuals. Since “there is no universal\n[of being] whatsoever that subsumes the I and the thou” (NKZ VI,\n381), the locus of genuine interpersonal encounter must be thought of\nin terms of the place of absolute nothingness (see Davis 2014).\n\nIt should be pointed out that the Japanese term for\n“absolute,” zettai, literally means a\n“severing of opposition,” which implies the sense of\n“without an opposing other.” The contrasting term is\nsōtai, which indicates “relativity” in the\nliteral sense of “mutual opposition.” The true absolute\nmust embrace, rather than stand over against, the relative. The\nabsolute, therefore, must not oppose itself to relative beings;\nrather, its self-determination must be such as to allow their mutually\nautonomous relations to take place. According to Nishida, it is only a\nphilosophy of the place of absolute nothingness that can do justice to\nthe notion of the absolute as well as account for both the autonomy\nand the mutual relativity of individuals.\n\nWhile on the one hand Nishida becomes increasingly concerned with\nallowing for radical interpersonal alterity within the place of\nabsolute nothingness, on the other hand he also consistently argues\nfrom early on that “consciousness” should not be thought\nto entail an unbridgeable epistemological subject-object split.\nAlthough he initially adopted, and adapted, the notion of “pure\nexperience” from William James and others to express this\nnondual basis of knowledge (see Nishida 1990), Nishida later drops\nthis expression in favor of the notion of “self-awareness”\n(jikaku). According to Nishida, self-awareness can be defined\nas a “self reflecting itself within itself” (NKZ IV,\n 215).[12]\n Since absolute nothingness is not a “self” in the sense\nof a subject standing over against an object, any more than it is an\nego with its own interested categories of perception, the\nself-awareness of absolute nothingness must be that of a “seeing\nwithout a seer” or a “knowing without a knower.”\n“Since there is no-thing that reflects, it is like a mirror\nreflecting the mirror itself” (ibid., 181).\n\nIn Nishida’s middle period, the paradigm for knowing is a\n“pure seeing” (tada miru) beyond all acting and\nvolition. Nishida claims that as finite individuals we can approach\nthis ideal by way of thoroughly negating or emptying the ego.\n“By truly emptying the self, the field of consciousness can\nreflect an object just as it is” (NKZ IV, 221). The self reaches\nthe place of absolute nothingness, and therefore first truly comes\ninto contact with other beings, by way of thoroughly emptying itself\nin a movement of “immanent transcendence” that takes it\nback through the depths of the field of consciousness.\n\nIn his last completed text, “The Logic of Place and the\nReligious Worldview,” Nishida most fully develops the religious\nimplications of the idea of absolute nothingness. There he suggests\nthat absolute nothingness is the best way to understand God or the\nabsolute, which he defines as that which “contains its own\nabsolute self-negation within itself” (NKZ XI, 397). As absolute\nnothingness, God is the dynamic principle of affirmation by way of\nabsolute self-negation. The true absolute essentially negates its\ntranscendent divinity and expresses itself in the forms of the\n relative.[13]\n\nNishida insists that this idea of God can be understood no more in\nterms of an immanent pantheism than in terms of a transcendent theism.\nIt may perhaps best be called “panentheism”; but for\nNishida this too remains a static term of “objective\nlogic” and fails to capture the necessity of thinking God as\nboth irreducibly transcendent and thoroughly immanent. As\nNishida is fond of saying, God or the Buddha is “immanently\ntranscendent.” It is the paradoxical logic one finds in the\nPrajñāpāramitā Sutras of\nMahāyāna Buddhism (i.e., what D. T. Suzuki called the\n“logic of soku-hi,” a logic of “is and is\nnot”) that Nishida thinks most profoundly expresses the\n“absolute dialectic” of the divine as the dynamic\nprinciple of absolute nothingness (NKZ XI, 399; see Nishida 1987,\n69–71).\n\nIf we as finite relative beings can and do touch the infinite\nabsolute, it is only by way of a mutual self-negation. Nishida calls\nthis mutual self-negation “inverse correspondence”\n(gyakutaiō). By way of radically emptying ourselves, we\ncan touch that which is the radical origin of self-emptying, the\nabsolute as an essentially self-negating absolute nothingness.\nAccording to Nishida, an immanent principle of self-negation is, in\nfact, the very essence of life. “True life (seimei)\nmust contain within itself an absolute nothingness, a [principle of]\nabsolute negation” (NKZ VIII, 341). It is such a life that can\ntruly be self-determining as a “creative element of a creative\nworld.”\n\nIn his middle period, inaugurated by the first formulations of the\nidea of “the place of absolute nothingness” in From\nThat Which Acts to That Which Sees, Nishida’s thought was\ncharacterized by a shift from his earlier voluntarism to a kind of\nintuitionism of pure seeing without a seer (see NKZ IV, 3–6). In\nhis later period, however, Nishida’s epistemology became much\nmore dynamic and dialectical; rather than “pure seeing,”\nhis key epistemological phrase then became\n“action-intuition” (kōi-teki chokkan).\nAlthough self-emptying still plays a vital role, this is understood\nnot as preparation for a passive intuition, but rather as an active\nprocess of “seeing a thing by becoming it.” In other\nwords, intuition happens only in the midst of the dialectical process\nof acting upon and in turn being acted upon by things.\n\nIn his later period, the place of absolute nothingness is accordingly\nreconceived much more dynamically as the “self-determination of\nthe dialectical world,” a world which continually moves\naccording to the principle of “from created to creating.”\nThe absolute finds expression only in the midst of the mutual\ninteraction of individuals and things, and true individuals are both\ndetermined by and “counter-determine” (gyaku-gentei\nsuru) the movement of the dialectical world (see NKZ VII, 305ff.;\nVIII, 313–14). Although one can trace an immanent unfolding of\nNishida’s thought in this direction, it is also clear that a\nmajor impetus for his dialectical development of the idea of absolute\nnothingness can be found in the criticism he received from his junior\ncolleague, Tanabe Hajime.\n",
    "section_title": "3.3 Nishida’s Topology of Absolute Nothingness",
    "entry_title": "The Kyoto School",
    "hierarchy_title": "The Kyoto School || Absolute Nothingness: Giving Philosophical Form to the Formless || Nishida’s Topology of Absolute Nothingness",
    "tokenized_text": [
        "absolute",
        "nothingness",
        "giving",
        "philosophical",
        "form",
        "formless",
        "nishida",
        "topology",
        "absolute",
        "nothingness",
        "nishida",
        "topology",
        "absolute",
        "nothingness",
        "besides",
        "contrasting",
        "western",
        "eastern",
        "nothingness",
        "later",
        "writing",
        "nishida",
        "also",
        "time",
        "make",
        "broad",
        "distinction",
        "western",
        "logic",
        "thing",
        "eastern",
        "logic",
        "heartmind",
        "kokoro",
        "western",
        "thought",
        "tends",
        "begin",
        "objective",
        "logic",
        "substance",
        "physical",
        "mental",
        "claim",
        "buddhism",
        "one",
        "find",
        "germ",
        "logic",
        "heartmind",
        "even",
        "traditionally",
        "remained",
        "largely",
        "level",
        "expression",
        "personal",
        "experience",
        "rather",
        "fully",
        "developed",
        "genuinely",
        "philosophical",
        "logic",
        "see",
        "nishida",
        "scholar",
        "buddhism",
        "may",
        "object",
        "nishida",
        "knowledge",
        "buddhism",
        "remained",
        "much",
        "level",
        "personal",
        "experience",
        "rather",
        "sophisticated",
        "discourse",
        "abhidharma",
        "mādhyamaka",
        "yogācāra",
        "tiantai",
        "huayan",
        "tradition",
        "buddhist",
        "philosophy",
        "case",
        "development",
        "nishida",
        "thought",
        "thought",
        "term",
        "objectivity",
        "determinate",
        "thing",
        "relative",
        "nothingness",
        "understood",
        "mere",
        "privation",
        "simple",
        "negation",
        "enveloping",
        "sense",
        "nothingness",
        "provisionally",
        "associated",
        "kind",
        "transcendental",
        "subjectivity",
        "consciousness",
        "heartmind",
        "ultimately",
        "however",
        "nishida",
        "come",
        "posit",
        "absolute",
        "nothingness",
        "place",
        "basho",
        "embrace",
        "subjective",
        "noetic",
        "objective",
        "noematic",
        "dimension",
        "reality",
        "thus",
        "relegates",
        "privation",
        "also",
        "subjective",
        "nothingness",
        "sense",
        "field",
        "consciousness",
        "type",
        "relative",
        "nothingness",
        "nishida",
        "writes",
        "reality",
        "time",
        "nothingness",
        "beingandnothingness",
        "usokumu",
        "nothingnessandbeing",
        "subjective",
        "objective",
        "noetic",
        "noematic",
        "reality",
        "unity",
        "subjectivity",
        "objectivity",
        "thus",
        "selfidentity",
        "absolutely",
        "contradictory",
        "rather",
        "separate",
        "sphere",
        "subjectivity",
        "objectivity",
        "come",
        "unite",
        "first",
        "reality",
        "opposition",
        "subjectivity",
        "objectivity",
        "must",
        "instead",
        "thought",
        "dynamically",
        "dialectical",
        "reality",
        "selfdetermining",
        "nkz",
        "vii",
        "see",
        "nishida",
        "reality",
        "dialectical",
        "selfdetermination",
        "absolute",
        "nothingness",
        "nishida",
        "later",
        "work",
        "understood",
        "dynamic",
        "identity",
        "absolute",
        "contradiction",
        "subjective",
        "relative",
        "nothingness",
        "objective",
        "absolute",
        "nothingness",
        "temporal",
        "spatial",
        "place",
        "wherein",
        "individual",
        "person",
        "thing",
        "determine",
        "one",
        "another",
        "mutual",
        "interaction",
        "place",
        "absolute",
        "nothingess",
        "zettaimu",
        "basho",
        "first",
        "became",
        "central",
        "concept",
        "nishida",
        "thought",
        "mids",
        "though",
        "continued",
        "develop",
        "rethink",
        "idea",
        "last",
        "completed",
        "essay",
        "logic",
        "place",
        "religious",
        "worldview",
        "nishida",
        "first",
        "explicitly",
        "worked",
        "idea",
        "absolute",
        "nothingness",
        "book",
        "act",
        "see",
        "nkz",
        "iv",
        "book",
        "inaugurated",
        "middleperiod",
        "thought",
        "work",
        "includes",
        "important",
        "essay",
        "entitled",
        "place",
        "basho",
        "nishida",
        "topological",
        "reasoning",
        "develops",
        "rough",
        "outline",
        "follows",
        "event",
        "must",
        "take",
        "place",
        "somewhere",
        "being",
        "must",
        "situated",
        "place",
        "being",
        "always",
        "exist",
        "relation",
        "being",
        "relation",
        "requires",
        "third",
        "term",
        "namely",
        "place",
        "medium",
        "wherein",
        "related",
        "word",
        "b",
        "related",
        "must",
        "place",
        "c",
        "relation",
        "situated",
        "begin",
        "understand",
        "c",
        "spatial",
        "context",
        "object",
        "situated",
        "relation",
        "one",
        "another",
        "context",
        "thing",
        "defined",
        "spatial",
        "thing",
        "opposed",
        "thing",
        "determined",
        "according",
        "number",
        "criterion",
        "operates",
        "within",
        "field",
        "judgment",
        "hence",
        "place",
        "c",
        "understood",
        "category",
        "judgment",
        "quality",
        "color",
        "red",
        "blue",
        "revealed",
        "contrasted",
        "one",
        "another",
        "color",
        "within",
        "color",
        "field",
        "order",
        "let",
        "concrete",
        "thing",
        "reveal",
        "yet",
        "fully",
        "however",
        "think",
        "c",
        "consciousness",
        "mind",
        "able",
        "correlate",
        "various",
        "category",
        "judgment",
        "color",
        "size",
        "shape",
        "location",
        "etc",
        "therefore",
        "perceive",
        "individual",
        "thing",
        "composed",
        "unique",
        "combination",
        "various",
        "quality",
        "relation",
        "example",
        "conscious",
        "certain",
        "thing",
        "round",
        "soft",
        "red",
        "sweet",
        "apple",
        "sitting",
        "table",
        "field",
        "consciousness",
        "field",
        "different",
        "category",
        "unified",
        "perception",
        "judgment",
        "quality",
        "particular",
        "thing",
        "relation",
        "particular",
        "thing",
        "quality",
        "ultimately",
        "however",
        "crucial",
        "limit",
        "subjective",
        "field",
        "consciousness",
        "kant",
        "demonstrated",
        "subjective",
        "consciousness",
        "reflect",
        "thing",
        "appear",
        "schematized",
        "according",
        "subjective",
        "category",
        "ultimate",
        "place",
        "wherein",
        "encounter",
        "subject",
        "object",
        "take",
        "place",
        "wherein",
        "person",
        "thing",
        "coexist",
        "according",
        "nishida",
        "must",
        "place",
        "wherein",
        "person",
        "thing",
        "undergo",
        "change",
        "accidental",
        "categorical",
        "quality",
        "wherein",
        "essentially",
        "existentially",
        "come",
        "pas",
        "away",
        "place",
        "intellectual",
        "judgment",
        "birth",
        "death",
        "ultimate",
        "groundless",
        "ground",
        "envelops",
        "being",
        "yet",
        "way",
        "let",
        "contain",
        "principle",
        "selfdetermination",
        "nishida",
        "call",
        "place",
        "true",
        "nothingness",
        "although",
        "sense",
        "determinate",
        "neither",
        "place",
        "true",
        "absolute",
        "nothingness",
        "mere",
        "static",
        "vacuity",
        "must",
        "thought",
        "epistemic",
        "source",
        "consciousness",
        "ontological",
        "origin",
        "being",
        "although",
        "nishida",
        "come",
        "idea",
        "place",
        "absolute",
        "nothingness",
        "directly",
        "confrontation",
        "kant",
        "neokantianism",
        "shy",
        "thinking",
        "place",
        "metaphysical",
        "well",
        "epistemological",
        "term",
        "nothingness",
        "merely",
        "reflective",
        "also",
        "creative",
        "principle",
        "nkz",
        "iv",
        "writes",
        "much",
        "later",
        "absolute",
        "nothingness",
        "transcends",
        "everything",
        "everything",
        "constituted",
        "nkz",
        "ix",
        "yet",
        "nishida",
        "repeatedly",
        "tell",
        "u",
        "nothing",
        "outside",
        "place",
        "coming",
        "passing",
        "away",
        "truly",
        "individual",
        "being",
        "absolute",
        "nothingness",
        "thought",
        "transcendent",
        "being",
        "understood",
        "processional",
        "unfolding",
        "potential",
        "say",
        "kind",
        "hegelian",
        "world",
        "spirit",
        "cunning",
        "reason",
        "work",
        "behind",
        "scene",
        "historical",
        "march",
        "toward",
        "selfrealization",
        "absolute",
        "according",
        "nishida",
        "must",
        "thought",
        "nothingness",
        "order",
        "distinguish",
        "ontology",
        "would",
        "reduce",
        "uniqueness",
        "autonomy",
        "truly",
        "individual",
        "being",
        "either",
        "transcendent",
        "underlying",
        "mechanical",
        "teleological",
        "process",
        "one",
        "driving",
        "concern",
        "behind",
        "nishida",
        "repeated",
        "insistence",
        "absolute",
        "thought",
        "meontological",
        "term",
        "formless",
        "indeterminate",
        "place",
        "absolute",
        "nothingness",
        "therein",
        "selfdetermining",
        "irreducibly",
        "singular",
        "individual",
        "given",
        "due",
        "ontology",
        "universal",
        "fail",
        "allow",
        "existence",
        "true",
        "individual",
        "genuine",
        "encounter",
        "individual",
        "since",
        "universal",
        "whatsoever",
        "subsumes",
        "thou",
        "nkz",
        "vi",
        "locus",
        "genuine",
        "interpersonal",
        "encounter",
        "must",
        "thought",
        "term",
        "place",
        "absolute",
        "nothingness",
        "see",
        "davis",
        "pointed",
        "japanese",
        "term",
        "absolute",
        "zettai",
        "literally",
        "mean",
        "severing",
        "opposition",
        "implies",
        "sense",
        "without",
        "opposing",
        "other",
        "contrasting",
        "term",
        "sōtai",
        "indicates",
        "relativity",
        "literal",
        "sense",
        "mutual",
        "opposition",
        "true",
        "absolute",
        "must",
        "embrace",
        "rather",
        "stand",
        "relative",
        "absolute",
        "therefore",
        "must",
        "oppose",
        "relative",
        "being",
        "rather",
        "selfdetermination",
        "must",
        "allow",
        "mutually",
        "autonomous",
        "relation",
        "take",
        "place",
        "according",
        "nishida",
        "philosophy",
        "place",
        "absolute",
        "nothingness",
        "justice",
        "notion",
        "absolute",
        "well",
        "account",
        "autonomy",
        "mutual",
        "relativity",
        "individual",
        "one",
        "hand",
        "nishida",
        "becomes",
        "increasingly",
        "concerned",
        "allowing",
        "radical",
        "interpersonal",
        "alterity",
        "within",
        "place",
        "absolute",
        "nothingness",
        "hand",
        "also",
        "consistently",
        "argues",
        "early",
        "consciousness",
        "thought",
        "entail",
        "unbridgeable",
        "epistemological",
        "subjectobject",
        "split",
        "although",
        "initially",
        "adopted",
        "adapted",
        "notion",
        "pure",
        "experience",
        "william",
        "james",
        "others",
        "express",
        "nondual",
        "basis",
        "knowledge",
        "see",
        "nishida",
        "nishida",
        "later",
        "drop",
        "expression",
        "favor",
        "notion",
        "selfawareness",
        "jikaku",
        "according",
        "nishida",
        "selfawareness",
        "defined",
        "self",
        "reflecting",
        "within",
        "nkz",
        "iv",
        "since",
        "absolute",
        "nothingness",
        "self",
        "sense",
        "subject",
        "standing",
        "object",
        "ego",
        "interested",
        "category",
        "perception",
        "selfawareness",
        "absolute",
        "nothingness",
        "must",
        "seeing",
        "without",
        "seer",
        "knowing",
        "without",
        "knower",
        "since",
        "nothing",
        "reflects",
        "like",
        "mirror",
        "reflecting",
        "mirror",
        "ibid",
        "nishida",
        "middle",
        "period",
        "paradigm",
        "knowing",
        "pure",
        "seeing",
        "tada",
        "miru",
        "beyond",
        "acting",
        "volition",
        "nishida",
        "claim",
        "finite",
        "individual",
        "approach",
        "ideal",
        "way",
        "thoroughly",
        "negating",
        "emptying",
        "ego",
        "truly",
        "emptying",
        "self",
        "field",
        "consciousness",
        "reflect",
        "object",
        "nkz",
        "iv",
        "self",
        "reach",
        "place",
        "absolute",
        "nothingness",
        "therefore",
        "first",
        "truly",
        "come",
        "contact",
        "being",
        "way",
        "thoroughly",
        "emptying",
        "movement",
        "immanent",
        "transcendence",
        "take",
        "back",
        "depth",
        "field",
        "consciousness",
        "last",
        "completed",
        "text",
        "logic",
        "place",
        "religious",
        "worldview",
        "nishida",
        "fully",
        "develops",
        "religious",
        "implication",
        "idea",
        "absolute",
        "nothingness",
        "suggests",
        "absolute",
        "nothingness",
        "best",
        "way",
        "understand",
        "god",
        "absolute",
        "defines",
        "contains",
        "absolute",
        "selfnegation",
        "within",
        "nkz",
        "xi",
        "absolute",
        "nothingness",
        "god",
        "dynamic",
        "principle",
        "affirmation",
        "way",
        "absolute",
        "selfnegation",
        "true",
        "absolute",
        "essentially",
        "negates",
        "transcendent",
        "divinity",
        "express",
        "form",
        "relative",
        "nishida",
        "insists",
        "idea",
        "god",
        "understood",
        "term",
        "immanent",
        "pantheism",
        "term",
        "transcendent",
        "theism",
        "may",
        "perhaps",
        "best",
        "called",
        "panentheism",
        "nishida",
        "remains",
        "static",
        "term",
        "objective",
        "logic",
        "fails",
        "capture",
        "necessity",
        "thinking",
        "god",
        "irreducibly",
        "transcendent",
        "thoroughly",
        "immanent",
        "nishida",
        "fond",
        "saying",
        "god",
        "buddha",
        "immanently",
        "transcendent",
        "paradoxical",
        "logic",
        "one",
        "find",
        "prajñāpāramitā",
        "sutra",
        "mahāyāna",
        "buddhism",
        "ie",
        "d",
        "t",
        "suzuki",
        "called",
        "logic",
        "sokuhi",
        "logic",
        "nishida",
        "think",
        "profoundly",
        "express",
        "absolute",
        "dialectic",
        "divine",
        "dynamic",
        "principle",
        "absolute",
        "nothingness",
        "nkz",
        "xi",
        "see",
        "nishida",
        "finite",
        "relative",
        "being",
        "touch",
        "infinite",
        "absolute",
        "way",
        "mutual",
        "selfnegation",
        "nishida",
        "call",
        "mutual",
        "selfnegation",
        "inverse",
        "correspondence",
        "gyakutaiō",
        "way",
        "radically",
        "emptying",
        "touch",
        "radical",
        "origin",
        "selfemptying",
        "absolute",
        "essentially",
        "selfnegating",
        "absolute",
        "nothingness",
        "according",
        "nishida",
        "immanent",
        "principle",
        "selfnegation",
        "fact",
        "essence",
        "life",
        "true",
        "life",
        "seimei",
        "must",
        "contain",
        "within",
        "absolute",
        "nothingness",
        "principle",
        "absolute",
        "negation",
        "nkz",
        "viii",
        "life",
        "truly",
        "selfdetermining",
        "creative",
        "element",
        "creative",
        "world",
        "middle",
        "period",
        "inaugurated",
        "first",
        "formulation",
        "idea",
        "place",
        "absolute",
        "nothingness",
        "act",
        "see",
        "nishida",
        "thought",
        "characterized",
        "shift",
        "earlier",
        "voluntarism",
        "kind",
        "intuitionism",
        "pure",
        "seeing",
        "without",
        "seer",
        "see",
        "nkz",
        "iv",
        "later",
        "period",
        "however",
        "nishida",
        "epistemology",
        "became",
        "much",
        "dynamic",
        "dialectical",
        "rather",
        "pure",
        "seeing",
        "key",
        "epistemological",
        "phrase",
        "became",
        "actionintuition",
        "kōiteki",
        "chokkan",
        "although",
        "selfemptying",
        "still",
        "play",
        "vital",
        "role",
        "understood",
        "preparation",
        "passive",
        "intuition",
        "rather",
        "active",
        "process",
        "seeing",
        "thing",
        "becoming",
        "it",
        "word",
        "intuition",
        "happens",
        "midst",
        "dialectical",
        "process",
        "acting",
        "upon",
        "turn",
        "acted",
        "upon",
        "thing",
        "later",
        "period",
        "place",
        "absolute",
        "nothingness",
        "accordingly",
        "reconceived",
        "much",
        "dynamically",
        "selfdetermination",
        "dialectical",
        "world",
        "world",
        "continually",
        "move",
        "according",
        "principle",
        "created",
        "creating",
        "absolute",
        "find",
        "expression",
        "midst",
        "mutual",
        "interaction",
        "individual",
        "thing",
        "true",
        "individual",
        "determined",
        "counterdetermine",
        "gyakugentei",
        "suru",
        "movement",
        "dialectical",
        "world",
        "see",
        "nkz",
        "vii",
        "ff",
        "viii",
        "although",
        "one",
        "trace",
        "immanent",
        "unfolding",
        "nishida",
        "thought",
        "direction",
        "also",
        "clear",
        "major",
        "impetus",
        "dialectical",
        "development",
        "idea",
        "absolute",
        "nothingness",
        "found",
        "criticism",
        "received",
        "junior",
        "colleague",
        "tanabe",
        "hajime"
    ]
}