{
    "main_text": "Language and Meaning\n4. Language and Meaning\n\nThe term artha in Sanskrit is used to denote the notion of\nmeaning. However, the meaning of this term ranges from a real object\nin the external world referred to by the word to a mere concept of an\nobject which may or may not correspond to anything in the external\nworld. The differences regarding what meaning is are argued out by the\nphilosophical schools of Nyāya,\nVaiśeṣika, Mīmāṃsā,\nvarious schools of Buddhism, Sanskrit grammar, and poetics. Among\nthese schools, the schools of Nyāya,\nVaiśeṣika, and\nMīmāṃsā have realist ontologies.\nMīmāṃsā focuses mainly on interpreting\nthe Vedic scriptures. Buddhist thinkers generally pointed to language\nas depicting a false picture of reality. Sanskrit grammarians were\nmore interested in language and communication than in ontology, while\nSanskrit poetics focused on the poetic dimensions of meaning.\n\nThe modern distinction of “sense” versus\n“reference” is somewhat blurred in the Sanskrit\ndiscussions of the notion of meaning. The question Indian philosophers\nseem to raise is “what does a word communicate?” They were\nalso interested in detecting if there was some sort of sequence in\nwhich different aspects of layers of meaning were communicated.\nGenerally, the notion of meaning is further stratified into three or\nfour types. First there is the primary meaning, something that is\ndirectly and immediately communicated by a word. If the primary\nmeaning is inappropriate in a given context, then one moves to a\nsecondary meaning, an extension of the primary meaning. Beyond this is\nthe suggested meaning, which may or may not be the same as the meaning\nintended by the speaker.\n\nThe various Indian theories of meaning are closely related to the\noverall stances taken by the different schools. Among the factors\nwhich influence the notion of meaning are the ontological and\nepistemological views of a school, its views regarding the role of God\nand scripture, its specific focus on a certain type of discourse, and\nits ultimate purpose in theorizing.\n\nIn the Western literature on the notion of meaning in the Indian\ntradition, various terms such as “sense,”\n“reference,” “denotation,”\n“connotation,” “designatum,” and\n“intension” have been frequently used to render the\nSanskrit term artha. However, these terms carry specific\nnuances of their own, and no single term adequately conveys the idea\nof artha. Artha basically refers to the object\nsignified by a word. In numerous contexts, the term stands for an\nobject in the sense of an element of external reality. For instance,\nPatañjali says that when a word is pronounced, an\nartha “object” is understood. For example:\n“bring in a bull”, “eat yogurt”, etc. It is\nthe artha that is brought in and it is also the\nartha that is eaten.\n\nThe schools of Nyāya and Vaiśeṣika\nset up an ontology containing substances, qualities, actions,\nrelations, generic and particular properties, etc. With this realistic\nontology in mind, they argue that if the relation between a word and\nits artha (“meaning”) were a natural ontological\nrelation, there should be real experiences of burning and cutting in\none’s mouth after hearing words like “agni”\n(“fire”) and “asi”\n(“sword”). Therefore, this relationship must be a\nconventional relationship (saṃketa), the convention\nbeing established by God as part of his initial acts of creation. The\nrelationship between a word and the object it refers to is thought to\nbe the desire of God that such and such a word should refer to such\nand such an object. It is through this established conventional\nrelationship that a word reminds the listener of its meaning. The\nschool of Mīmāṃsā represents the\ntradition of the exegesis of the Vedic texts. However, in the course\nof discussing and perfecting principles of interpretation, this system\ndeveloped a full-scale theory of ontology and an important theory of\nmeaning. For the Mīmāṃsakas, the primary tenet is that\nthe Vedic scriptural texts are eternal and uncreated, and that they\nare meaningful. For this orthodox system, which remarkably defends the\nscripture but dispenses with the notion of God, the relationship\nbetween a word and its meaning is an innate eternal relationship. For\nboth Nyāya-Vaiśeṣikas and\nMīmāṃsakas, language refers to external states of the\nworld and not just to conceptual constructions.\n\nThe tradition of grammarians, beginning with Bhartṛhari, seems\nto have followed a middle path between the realistic theories of\nreference (bāhyārthavāda) developed by\nNyāya-Vaiśeṣika and\nMīmāṃsā on the one hand, and the\nnotional/conceptual meaning (vikalpa) of the Buddhists on the\nother. For the grammarians, the meaning of a word is closely related\nto the level of understanding. Whether or not things are real, we do\nhave concepts. These concepts form the content of a person’s\ncognitions derived from language. Without necessarily denying or\naffirming the external reality of objects in the world, grammarians\nclaimed that the meaning of a word is only a projection of intellect\n(bauddhārtha, buddhipratibhāsa). The\nexamples offered by Sanskrit grammarians such as\n“śaśaśṛṅga”\n(“horn of a rabbit”) and\n“vandhyāsuta” (“son of a barren\nwoman”) remain meaningful within this theory. Sanskrit\ngrammarians are thus not concerned with ontological or truth\nfunctional values of linguistic expressions. For them the truth of an\nexpression and its meaningfulness are not to be equated.\n\nBy the middle of the second millennium of the Christian era, certain\nuniformity came about in the technical terminology used by different\nschools. The prominent schools in this period are the new school of\nNyāya initiated by Gaṅgeśa, the schools of\nMīmāṃsā, Vedānta, and Sanskrit\ngrammar. While all these schools are engaged in pitched battles\nagainst each other, they seem to accept the terminological lead of the\nneo-logicians, the Navya-Naiyāyikas. Following the discussion of\nthe term artha by the neo-logician\nGadādharabhaṭṭa, we can state the general framework\nof a semantic theory. Other schools accept this general terminology,\nwith some variations.\n\nIt may be said that the term artha (“meaning”)\nstands for the object or content of a verbal cognition or a cognition\nthat results from hearing a word\n(śābda-bodha-viṣaya). Such\na verbal cognition results from the cognition of a word\n(śābda-jñāna) on the basis of\nan awareness of the signification function pertaining to that word\n(pada-niṣṭha-vṛtti-jñāna).\nDepending upon the kind of signification function\n(vṛtti) involved in the emergence of the verbal\ncognition, the meaning belongs to a distinct type. In general\nterms:\n\n When a verbal cognition results from the primary signification\nfunction (śakti / abhidhāvṛtti /\nmukhyavṛtti) of a word, the object or content of that\nverbal cognition is called primary meaning\n(śakyārtha / vācyārtha /\nabhidheya).\n When a verbal cognition results from the secondary signification\nfunction (lakṣaṇāvṛtti /\nguṇavṛtti) of a word, the object or content of\nthat verbal cognition is called secondary meaning\n(lakṣyārtha).\n When a verbal cognition results from the suggestive signification\nfunction (vyañjanāvṛtti) of a word, the\nobject or content of that verbal cognition is called suggested meaning\n(vyaṅgyārtha / dhvanitārtha).\n When a verbal cognition results from the intentional\nsignification function (tātparyavṛtti) of a word,\nthe object or content of that verbal cognition is called intended\nmeaning (tātparyārtha).\n\n\nNot all the different schools of Indian philosophy accept all of these\ndifferent kinds of signification functions for words, and they hold\nsubstantially different views on the nature of words, meanings, and\nthe relations between words and meanings. However, the above\nterminology holds true, in general, for most of the medieval schools.\nLet us note some of the important differences.\nMīmāṃsā claims that the sole primary\nmeaning of the word “bull” is the generic property or the\nclass property (jāti) such as bull-ness, while the\nindividual object which possesses this generic property, i.e., a\nparticular bull, is only secondarily and subsequently understood from\nthe word “bull”. The school called\nKevalavyaktivāda argues that a particular individual\nbull is the sole primary meaning of the word “bull,” while\nthe generic property bull-ness is merely a secondary meaning.\nNyāya argues that the primary meaning of a word is an\nindividual object qualified by a generic property\n(jāti-viśiṣṭa-vyakti),\nboth being perceived simultaneously.\n\nSanskrit grammarians distinguish between various different kinds of\nmeanings (artha). The term artha stands for an\nexternal object (vastumātra), as well as for the object\nthat is intended to be signified by a word (abhidheya). The\nlatter, i.e., meaning in a linguistic sense, could be meaning in a\ntechnical context (śāstrīya), such as the\nmeaning of an affix or a stem, or it may be meaning as understood by\npeople in actual communication (laukika). Then there is a\nfurther difference. Meaning may be something directly intended to be\nsignified by an expression (abhidheya), or it could be\nsomething which is inevitably signified\n(nāntarīyaka) when something else is really the\nintended meaning. Everything that is understood from a word on the\nbasis of some kind of signification function (vṛtti) is\ncovered by the term artha. Different systems of Indian\nphilosophy differ from each other on whether a given cognition is\nderived from a word on the basis of a signification function\n(vṛtti), through inference (anumāna), or\npresumption (arthāpatti). If a particular item of\ninformation is deemed to have been derived through inference or\npresumption, it is not included in the notion of word-meaning.\n\nThe scope of the term artha is actually not limited in\nSanskrit texts to what is usually understood as the domain of\nsemantics in the western literature. It covers elements such as gender\n(liṅga) and number (saṃkhyā). It\nalso covers the semantic-syntactic roles (kāraka) such\nas agent-ness (kartṛtva) and object-ness\n(karmatva). Tenses such as the present, past, and future, and\nthe moods such as the imperative and optative are also traditionally\nincluded in the arthas signified by a verb root, or an affix.\nAnother aspect of the concept of artha is revealed in the\ntheory of dyotyārtha (“co-signified”)\nmeaning. According to this theory, to put it in simple terms,\nparticles such as ca (“and”) do not have any\nlexical or primary meaning. They are said to help other words used in\nconstruction with them to signify some special aspects of their\nmeaning. For instance, in the phrase “John and Tom”, the\nmeaning of grouping is said to be not directly signified by the word\n“and”. The theory of dyotyārtha argues that\ngrouping is a specific meaning of the two words “John” and\n“Tom”, but that these two words are unable to signify this\nmeaning if used by themselves. The word “and” used along\nwith these two words is said to work as a catalyst that enables them\nto signify this special meaning. The problem of use and mention of\nwords is also handled by Sanskrit grammarians by treating the\nphonological form of the word itself to be a part of the meaning it\nsignifies. This is a unique way of handling this problem.\n",
    "section_title": "4. Language and Meaning",
    "entry_title": "Language and Testimony in Classical Indian Philosophy",
    "hierarchy_title": "Language and Testimony in Classical Indian Philosophy || Language and Meaning",
    "tokenized_text": [
        "language",
        "meaning",
        "language",
        "meaning",
        "term",
        "artha",
        "sanskrit",
        "used",
        "denote",
        "notion",
        "meaning",
        "however",
        "meaning",
        "term",
        "range",
        "real",
        "object",
        "external",
        "world",
        "referred",
        "word",
        "mere",
        "concept",
        "object",
        "may",
        "may",
        "correspond",
        "anything",
        "external",
        "world",
        "difference",
        "regarding",
        "meaning",
        "argued",
        "philosophical",
        "school",
        "nyāya",
        "vaiśeṣika",
        "mīmāṃsā",
        "various",
        "school",
        "buddhism",
        "sanskrit",
        "grammar",
        "poetics",
        "among",
        "school",
        "school",
        "nyāya",
        "vaiśeṣika",
        "mīmāṃsā",
        "realist",
        "ontology",
        "mīmāṃsā",
        "focus",
        "mainly",
        "interpreting",
        "vedic",
        "scripture",
        "buddhist",
        "thinker",
        "generally",
        "pointed",
        "language",
        "depicting",
        "false",
        "picture",
        "reality",
        "sanskrit",
        "grammarian",
        "interested",
        "language",
        "communication",
        "ontology",
        "sanskrit",
        "poetics",
        "focused",
        "poetic",
        "dimension",
        "meaning",
        "modern",
        "distinction",
        "sense",
        "versus",
        "reference",
        "somewhat",
        "blurred",
        "sanskrit",
        "discussion",
        "notion",
        "meaning",
        "question",
        "indian",
        "philosopher",
        "seem",
        "raise",
        "word",
        "communicate",
        "also",
        "interested",
        "detecting",
        "sort",
        "sequence",
        "different",
        "aspect",
        "layer",
        "meaning",
        "communicated",
        "generally",
        "notion",
        "meaning",
        "stratified",
        "three",
        "four",
        "type",
        "first",
        "primary",
        "meaning",
        "something",
        "directly",
        "immediately",
        "communicated",
        "word",
        "primary",
        "meaning",
        "inappropriate",
        "given",
        "context",
        "one",
        "move",
        "secondary",
        "meaning",
        "extension",
        "primary",
        "meaning",
        "beyond",
        "suggested",
        "meaning",
        "may",
        "may",
        "meaning",
        "intended",
        "speaker",
        "various",
        "indian",
        "theory",
        "meaning",
        "closely",
        "related",
        "overall",
        "stance",
        "taken",
        "different",
        "school",
        "among",
        "factor",
        "influence",
        "notion",
        "meaning",
        "ontological",
        "epistemological",
        "view",
        "school",
        "view",
        "regarding",
        "role",
        "god",
        "scripture",
        "specific",
        "focus",
        "certain",
        "type",
        "discourse",
        "ultimate",
        "purpose",
        "theorizing",
        "western",
        "literature",
        "notion",
        "meaning",
        "indian",
        "tradition",
        "various",
        "term",
        "sense",
        "reference",
        "denotation",
        "connotation",
        "designatum",
        "intension",
        "frequently",
        "used",
        "render",
        "sanskrit",
        "term",
        "artha",
        "however",
        "term",
        "carry",
        "specific",
        "nuance",
        "single",
        "term",
        "adequately",
        "conveys",
        "idea",
        "artha",
        "artha",
        "basically",
        "refers",
        "object",
        "signified",
        "word",
        "numerous",
        "context",
        "term",
        "stand",
        "object",
        "sense",
        "element",
        "external",
        "reality",
        "instance",
        "patañjali",
        "say",
        "word",
        "pronounced",
        "artha",
        "object",
        "understood",
        "example",
        "bring",
        "bull",
        "eat",
        "yogurt",
        "etc",
        "artha",
        "brought",
        "also",
        "artha",
        "eaten",
        "school",
        "nyāya",
        "vaiśeṣika",
        "set",
        "ontology",
        "containing",
        "substance",
        "quality",
        "action",
        "relation",
        "generic",
        "particular",
        "property",
        "etc",
        "realistic",
        "ontology",
        "mind",
        "argue",
        "relation",
        "word",
        "artha",
        "meaning",
        "natural",
        "ontological",
        "relation",
        "real",
        "experience",
        "burning",
        "cutting",
        "one",
        "mouth",
        "hearing",
        "word",
        "like",
        "agni",
        "fire",
        "asi",
        "sword",
        "therefore",
        "relationship",
        "must",
        "conventional",
        "relationship",
        "saṃketa",
        "convention",
        "established",
        "god",
        "part",
        "initial",
        "act",
        "creation",
        "relationship",
        "word",
        "object",
        "refers",
        "thought",
        "desire",
        "god",
        "word",
        "refer",
        "object",
        "established",
        "conventional",
        "relationship",
        "word",
        "reminds",
        "listener",
        "meaning",
        "school",
        "mīmāṃsā",
        "represents",
        "tradition",
        "exegesis",
        "vedic",
        "text",
        "however",
        "course",
        "discussing",
        "perfecting",
        "principle",
        "interpretation",
        "system",
        "developed",
        "fullscale",
        "theory",
        "ontology",
        "important",
        "theory",
        "meaning",
        "mīmāṃsakas",
        "primary",
        "tenet",
        "vedic",
        "scriptural",
        "text",
        "eternal",
        "uncreated",
        "meaningful",
        "orthodox",
        "system",
        "remarkably",
        "defends",
        "scripture",
        "dispenses",
        "notion",
        "god",
        "relationship",
        "word",
        "meaning",
        "innate",
        "eternal",
        "relationship",
        "nyāyavaiśeṣikas",
        "mīmāṃsakas",
        "language",
        "refers",
        "external",
        "state",
        "world",
        "conceptual",
        "construction",
        "tradition",
        "grammarian",
        "beginning",
        "bhartṛhari",
        "seems",
        "followed",
        "middle",
        "path",
        "realistic",
        "theory",
        "reference",
        "bāhyārthavāda",
        "developed",
        "nyāyavaiśeṣika",
        "mīmāṃsā",
        "one",
        "hand",
        "notionalconceptual",
        "meaning",
        "vikalpa",
        "buddhist",
        "grammarian",
        "meaning",
        "word",
        "closely",
        "related",
        "level",
        "understanding",
        "whether",
        "thing",
        "real",
        "concept",
        "concept",
        "form",
        "content",
        "person",
        "cognition",
        "derived",
        "language",
        "without",
        "necessarily",
        "denying",
        "affirming",
        "external",
        "reality",
        "object",
        "world",
        "grammarian",
        "claimed",
        "meaning",
        "word",
        "projection",
        "intellect",
        "bauddhārtha",
        "buddhipratibhāsa",
        "example",
        "offered",
        "sanskrit",
        "grammarian",
        "śaśaśṛṅga",
        "horn",
        "rabbit",
        "vandhyāsuta",
        "son",
        "barren",
        "woman",
        "remain",
        "meaningful",
        "within",
        "theory",
        "sanskrit",
        "grammarian",
        "thus",
        "concerned",
        "ontological",
        "truth",
        "functional",
        "value",
        "linguistic",
        "expression",
        "truth",
        "expression",
        "meaningfulness",
        "equated",
        "middle",
        "second",
        "millennium",
        "christian",
        "era",
        "certain",
        "uniformity",
        "came",
        "technical",
        "terminology",
        "used",
        "different",
        "school",
        "prominent",
        "school",
        "period",
        "new",
        "school",
        "nyāya",
        "initiated",
        "gaṅgeśa",
        "school",
        "mīmāṃsā",
        "vedānta",
        "sanskrit",
        "grammar",
        "school",
        "engaged",
        "pitched",
        "battle",
        "seem",
        "accept",
        "terminological",
        "lead",
        "neologicians",
        "navyanaiyāyikas",
        "following",
        "discussion",
        "term",
        "artha",
        "neologician",
        "gadādharabhaṭṭa",
        "state",
        "general",
        "framework",
        "semantic",
        "theory",
        "school",
        "accept",
        "general",
        "terminology",
        "variation",
        "may",
        "said",
        "term",
        "artha",
        "meaning",
        "stand",
        "object",
        "content",
        "verbal",
        "cognition",
        "cognition",
        "result",
        "hearing",
        "word",
        "śābdabodhaviṣaya",
        "verbal",
        "cognition",
        "result",
        "cognition",
        "word",
        "śābdajñāna",
        "basis",
        "awareness",
        "signification",
        "function",
        "pertaining",
        "word",
        "padaniṣṭhavṛttijñāna",
        "depending",
        "upon",
        "kind",
        "signification",
        "function",
        "vṛtti",
        "involved",
        "emergence",
        "verbal",
        "cognition",
        "meaning",
        "belongs",
        "distinct",
        "type",
        "general",
        "term",
        "verbal",
        "cognition",
        "result",
        "primary",
        "signification",
        "function",
        "śakti",
        "abhidhāvṛtti",
        "mukhyavṛtti",
        "word",
        "object",
        "content",
        "verbal",
        "cognition",
        "called",
        "primary",
        "meaning",
        "śakyārtha",
        "vācyārtha",
        "abhidheya",
        "verbal",
        "cognition",
        "result",
        "secondary",
        "signification",
        "function",
        "lakṣaṇāvṛtti",
        "guṇavṛtti",
        "word",
        "object",
        "content",
        "verbal",
        "cognition",
        "called",
        "secondary",
        "meaning",
        "lakṣyārtha",
        "verbal",
        "cognition",
        "result",
        "suggestive",
        "signification",
        "function",
        "vyañjanāvṛtti",
        "word",
        "object",
        "content",
        "verbal",
        "cognition",
        "called",
        "suggested",
        "meaning",
        "vyaṅgyārtha",
        "dhvanitārtha",
        "verbal",
        "cognition",
        "result",
        "intentional",
        "signification",
        "function",
        "tātparyavṛtti",
        "word",
        "object",
        "content",
        "verbal",
        "cognition",
        "called",
        "intended",
        "meaning",
        "tātparyārtha",
        "different",
        "school",
        "indian",
        "philosophy",
        "accept",
        "different",
        "kind",
        "signification",
        "function",
        "word",
        "hold",
        "substantially",
        "different",
        "view",
        "nature",
        "word",
        "meaning",
        "relation",
        "word",
        "meaning",
        "however",
        "terminology",
        "hold",
        "true",
        "general",
        "medieval",
        "school",
        "let",
        "u",
        "note",
        "important",
        "difference",
        "mīmāṃsā",
        "claim",
        "sole",
        "primary",
        "meaning",
        "word",
        "bull",
        "generic",
        "property",
        "class",
        "property",
        "jāti",
        "bullness",
        "individual",
        "object",
        "posse",
        "generic",
        "property",
        "ie",
        "particular",
        "bull",
        "secondarily",
        "subsequently",
        "understood",
        "word",
        "bull",
        "school",
        "called",
        "kevalavyaktivāda",
        "argues",
        "particular",
        "individual",
        "bull",
        "sole",
        "primary",
        "meaning",
        "word",
        "bull",
        "generic",
        "property",
        "bullness",
        "merely",
        "secondary",
        "meaning",
        "nyāya",
        "argues",
        "primary",
        "meaning",
        "word",
        "individual",
        "object",
        "qualified",
        "generic",
        "property",
        "jātiviśiṣṭavyakti",
        "perceived",
        "simultaneously",
        "sanskrit",
        "grammarian",
        "distinguish",
        "various",
        "different",
        "kind",
        "meaning",
        "artha",
        "term",
        "artha",
        "stand",
        "external",
        "object",
        "vastumātra",
        "well",
        "object",
        "intended",
        "signified",
        "word",
        "abhidheya",
        "latter",
        "ie",
        "meaning",
        "linguistic",
        "sense",
        "could",
        "meaning",
        "technical",
        "context",
        "śāstrīya",
        "meaning",
        "affix",
        "stem",
        "may",
        "meaning",
        "understood",
        "people",
        "actual",
        "communication",
        "laukika",
        "difference",
        "meaning",
        "may",
        "something",
        "directly",
        "intended",
        "signified",
        "expression",
        "abhidheya",
        "could",
        "something",
        "inevitably",
        "signified",
        "nāntarīyaka",
        "something",
        "else",
        "really",
        "intended",
        "meaning",
        "everything",
        "understood",
        "word",
        "basis",
        "kind",
        "signification",
        "function",
        "vṛtti",
        "covered",
        "term",
        "artha",
        "different",
        "system",
        "indian",
        "philosophy",
        "differ",
        "whether",
        "given",
        "cognition",
        "derived",
        "word",
        "basis",
        "signification",
        "function",
        "vṛtti",
        "inference",
        "anumāna",
        "presumption",
        "arthāpatti",
        "particular",
        "item",
        "information",
        "deemed",
        "derived",
        "inference",
        "presumption",
        "included",
        "notion",
        "wordmeaning",
        "scope",
        "term",
        "artha",
        "actually",
        "limited",
        "sanskrit",
        "text",
        "usually",
        "understood",
        "domain",
        "semantics",
        "western",
        "literature",
        "cover",
        "element",
        "gender",
        "liṅga",
        "number",
        "saṃkhyā",
        "also",
        "cover",
        "semanticsyntactic",
        "role",
        "kāraka",
        "agentness",
        "kartṛtva",
        "objectness",
        "karmatva",
        "tense",
        "present",
        "past",
        "future",
        "mood",
        "imperative",
        "optative",
        "also",
        "traditionally",
        "included",
        "arthas",
        "signified",
        "verb",
        "root",
        "affix",
        "another",
        "aspect",
        "concept",
        "artha",
        "revealed",
        "theory",
        "dyotyārtha",
        "cosignified",
        "meaning",
        "according",
        "theory",
        "put",
        "simple",
        "term",
        "particle",
        "ca",
        "lexical",
        "primary",
        "meaning",
        "said",
        "help",
        "word",
        "used",
        "construction",
        "signify",
        "special",
        "aspect",
        "meaning",
        "instance",
        "phrase",
        "john",
        "tom",
        "meaning",
        "grouping",
        "said",
        "directly",
        "signified",
        "word",
        "theory",
        "dyotyārtha",
        "argues",
        "grouping",
        "specific",
        "meaning",
        "two",
        "word",
        "john",
        "tom",
        "two",
        "word",
        "unable",
        "signify",
        "meaning",
        "used",
        "word",
        "used",
        "along",
        "two",
        "word",
        "said",
        "work",
        "catalyst",
        "enables",
        "signify",
        "special",
        "meaning",
        "problem",
        "use",
        "mention",
        "word",
        "also",
        "handled",
        "sanskrit",
        "grammarian",
        "treating",
        "phonological",
        "form",
        "word",
        "part",
        "meaning",
        "signifies",
        "unique",
        "way",
        "handling",
        "problem"
    ]
}