{
    "main_text": "Development of Analytic Philosophy in Latin America || Brazil (1930–1990)\n2.3 Brazil (1930–1990)\n\nBrazilian analytic philosophy is the outgrowth of several\ncrisscrossing threads spanning a large territory. A logic thread led\nto the development of a Brazilian school of logic centered around the\nstudy of paraconsistent formal systems. Work in mathematical logic\nstarted in the late 1920s and bloomed in the late 1970s.\nIndependently, starting in the 1940s, a philosophy thread introduced\nthemes from the analytic tradition into philosophy departments. This\nthread was led by scholars trained in continental philosophy and the\nhistory of philosophy who became interested in logical positivism,\nlogic, Wittgenstein, ordinary language philosophy, and the history and\nphilosophy of science. Although many of its members were not fully\ncommitted to the analytic tradition, their writings engaged with\nanalytic authors. The logic and philosophy threads started to\nintersect in the mid-1970s when philosophers increased their\ninteraction with mathematicians. Throughout the late 1970s and 1980s,\nanalytic philosophy expanded to many Brazilian states, leading to a\nfragmentation of philosophical activity in Brazil. In the 1980s, there\nwere several initiatives to promote inter-state collaboration. The\nintegration started to bear fruit in the 1990s, so one can speak of a\nBrazilian analytic community by the end of the 1990s.\n\nIn the first half of the twentieth century, scholastic philosophy was\ncultivated in Brazil, so most work in logic focused on Aristotelian\nsyllogism and fallacies. However, there had been several attempts at\nintroducing mathematical logic in Brazil since the 1930s. Manuel\nAmoroso Costa’s As Idéias Fundamentais da\nMatemática (1929) included a chapter devoted to\nmathematical logic. In 1940, Vicente Ferreira da Silva published\nElementos de Lógica Matemática, the first book\nexclusively devoted to mathematical logic in Latin America. In 1942,\nQuine was invited to teach a one-semester course at the Universidade\nde São Paulo (USP). His lectures gave rise to a book entitled\nO Sentido da Nova Lógica (1944). These three books had\nlittle impact within philosophy circles.\n\nFrom the late 1950s onwards, there were several groups of\nmathematicians dedicated to the study of mathematical logic in\n Brazil.[36]\n Edson Farah in the Mathematics Department at USP led some seminars\ndedicated to this topic (Hegenberg 1978). He also supervised two\nimportant promoters of analytic philosophy in Brazil: Leônidas\nHegenberg and Newton da Costa.\n\nHegenberg played a key role in the dissemination of mathematical logic\nand philosophy of science through his classes, textbooks, and\n translations.[37]\n\nNewton da Costa studied civil engineering and mathematics at the\nUniversidade Federal do Paraná (UFPR). Despite his lack of\nformal training in philosophy, da Costa had studied philosophy on his\nown since his\n teens.[38]\n In 1963, he defended a thesis to obtain the chair in Mathematical\nAnalysis and Higher Analysis of the Faculty of Philosophy, Science,\nand Letters at UFPR. That thesis offered an analysis of three\nparaconsistent logical systems, i.e., deductive systems that are\ninconsistent albeit\n non-trivial.[39]\n\nAlthough da Costa was not the first to study paraconsistent systems,\nhe was the first to create several paraconsistent logical systems and\ngather a research group with the explicit goal of investigating their\nformal properties (Secco and Álvarez\n 2022).[40]\n Da Costa’s research team became known as the “Curitiba\n group”.[41]\n He published some of his first results in the Comptes rendus de\nl’Académie des Sciences de Paris. The first paper,\npublished in 1963, was the first research article in logic ever\npublished by a Brazilian author in an international outlet\n(D’Ottaviano and Gomes 2011). Those publications put the\ninternational spotlight on da Costa’s work, started to establish\na Brazilian school of logic, and contributed to the development of\nparaconsistent logics as a topic of global\n interest.[42]\n\nIn 1964, a coup d’état led the members of the\nCuritiba group to migrate to São Paulo. Da Costa joined the\nInstitute of Mathematics, Statistics and Computer Science (IMECC) at\nthe Universidade Estadual de Campinas (Unicamp) in 1968 and the\nInstitute of Mathematics and Statistics (IME) at USP in\n 1970.[43]\n Da Costa’s first and most prominent PhD student, Ayda Ignez\nArruda, created her own research group at IMECC (D’Ottaviano and\nGomes 2011). Both groups developed joint projects and published many\njoint articles. They also promoted the organization of events that\ncontributed to the integration of logicians from all Latin America and\nother parts of the world. The growth of that community of logicians\nled to the creation of the Sociedade Brasileira de\nLógica (SBL) in\n 1979.[44]\n\nThe philosophical thread also starts at USP. Since its foundation in\n1934, USP had invited many foreign intellectuals to join the nascent\nuniversity. Many of them came from France, forming the so-called\n“French legion”. They implemented a structuralist approach\nto the history of philosophy that shaped the way in which the first\nand second generations of USP professional philosophers understood\nphilosophy (Costa 2021). Gilles-Gaston Granger worked at USP from 1947\nto 1953 and returned to Brazil on several occasions. During his stay\nat USP, Granger taught logic and philosophy of science. A few years\nlater, he published those lectures in book format as Lógica\ne Filosofia das Ciências (1955). Although the book offered\nan overview of the most recent developments in logic and philosophy of\nscience, Granger also promoted the structuralist approach (Costa\n2021). Hence, it is no accident that the first Brazilian philosophers\nwho engaged with analytic authors approached philosophy from a\nhistorical-structuralist perspective.\n\nJosé Giannotti—a student of Granger—became a\nprofessor at USP in 1959. Although he initially taught symbolic logic,\nhe soon became interested in Marx. In his famous book Origens da\ndialética do trabalho (1966), Giannotti offered a sui\ngeneris interpretation of the antagonism between capital and\nlabor as a verbal game. In the following years, he studied\nWittgenstein’s philosophy (Hegenberg 1978) and published, in\n1968, the first Portuguese translation of Wittgenstein’s\nTractatus\n Logico-Philosophicus.[45]\n At the end of his career, he published a long book that compared\nHeidegger’s and Wittgenstein’s attitudes towards language\n(Giannotti\n 2018).[46]\n\nOswaldo Porchat studied at USP and Rennes and taught at USP. In his\nfamous lecture O Conflito das Filosofias (1969), Porchat\nargued that each philosopher faces a “conflict of\nphilosophies”: different philosophical systems provide\nincompatible answers to philosophical questions about the world.\nLacking an answer to that challenge, he abandoned philosophy and\ndevoted himself to the study of mathematical logic during a stay at UC\nBerkeley (Smith 2018). Porchat returned to USP in 1970 and taught\nadvanced mathematical logic and philosophy of science. Those courses\nhad a great impact on his students. He also regained interest in\nphilosophy and led a research group dedicated to modal logic\n(Hegenberg 1978). After publishing a polemical article against\nhistoricism in philosophy of science (Porchat 1974), Porchat explored\ntwo different solutions to the conflict of philosophies: a commonsense\nsolution that relied on key works from the analytic canon such as\nMoore and Strawson, and a skeptical solution inspired by an innovative\ninterpretation of Ancient Greek skepticism (especially Sextus\nEmpiricus), and building on the work of Quine and Ryle, and\nphilosophers of science such as Popper and Lakatos. The result is\ncalled “neo-Pyrrhonism” (Porchat\n 2006).[47]\n\nAfter his stay at UC Berkeley, Porchat envisioned creating a center\nanalogous to UC Berkeley’s Group in Logic and Methodology of\nScience. His initiative faced political resistance at USP, so he\ntook his project to Unicamp (D’Ottaviano and Gomes 2011). The\nCentro de Lógica, Epistemologia e História da\nCiência (CLE) was finally born in 1977. Its main goal was\nto promote research in logic, epistemology, philosophy of science, and\ninterdisciplinary studies. It initially focused on the organization of\nseminars and scientific meetings, the promotion of academic exchanges\nwith other groups and institutions in Brazil and abroad, and the\npublication of periodicals and books (D’Ottaviano and Gomes\n2011). Many participants in the logic thread joined CLE either as\npermanent or associated members. There was also a group dedicated to\nthe philosophy of natural sciences (such as physics and biology),\nanother group devoted to the philosophy of human sciences (psychology,\npsychoanalysis, and sociology), and a few members interested in\nphilosophy of mind and philosophy of language (D’Ottaviano,\nCarnielli and Alves\n 1996).[48]\n\nCLE created different journals. Porchat founded Manuscrito in\n1978, which later became one of the main outlets for analytic\nphilosophy in Latin\n America.[49]\n Zeljko Loparić created Cadernos de História e\nFilosofia da Ciência in 1980. The Journal of\nNon-Classical Logics followed in\n 1982.[50]\n In 1987, CLE started to publish books on logic, history of\nphilosophy, and epistemology and methodology of science. Until the\nearly 2000s, CLE contributed to the development of specialized courses\nand a graduate program in logic and philosophy of science at the\nPhilosophy Department of Unicamp. That program trained many subsequent\ngenerations of analytic philosophers from Brazil and other Latin\nAmerican countries. Since its creation, CLE has played a decisive role\nin gathering Brazilian and Latin American philosophers and\ninternationalizing Brazilian work in logic and analytic\nphilosophy.\n\nThere were other philosophical developments roughly contemporaneous\nwith those from São Paulo in other states. For reasons of\nspace, only a few developments in Rio de Janeiro will be\nmentioned.\n\nEuryalo Cannabrava published Elementos de Metodologia\nFilosófica and Introdução à\nFilosofia Científica in 1956 and Ensaios\nFilosóficos in 1957. Those books presented hitherto\nunfamiliar ideas from the analytic canon. Other philosophers from Rio\nalso showed an early interest in Frege, the second Wittgenstein, and\nordinary language philosophy. Paulo Alcoforado worked at the\nUniversidade Federal do Rio de Janeiro (UFRJ) from 1963 to 1998.\nAlthough most of his work was in the history of philosophy, he\ntranslated into Portuguese some works by Frege in the late 1970s and\nSimpson’s Formas lógicas, realidad y significado\nin 1976. In 1980, he also published an introductory article to\nordinary language philosophy that helped develop a tradition of work\nin ordinary language philosophy in Rio. Mario Guerreiro joined UFRJ in\n1978. He taught theory of knowledge, philosophy of language, and\nmetaphysics. He wrote about common sense, Wittgenstein, and skepticism\n(Guerreiro 1999). Guido Antônio de Almeida worked at the\nPontifícia Universidade Católica de Rio de Janeiro\n(PUC-RJ) from 1972 to 1981. Trained in Husserl’s phenomenology,\nhe taught graduate classes on speech acts and the second Wittgenstein.\nDaniel Vanderveken, an expert on speech acts, also visited Rio during\nthose years (Hegenberg\n 1978).[51]\n\nIn the 1970s, analytic philosophy started to spread throughout the\ncountry. At least two factors explain this phenomenon. First, many\ngraduate programs of philosophy were created in Brazil in the 1970s\n(Brito 2008). Second, the number of scholarships to pursue\npostgraduate studies in Brazil and abroad increased dramatically from\nthe early 1970s to the late 1990s (Mazza\n 2009).[52]\n Many Brazilian philosophers benefited from those public policies.\n\nThe expansion of analytic philosophy took many forms. Many Brazilians\nreceived training at analytic centers abroad and introduced topics\nfrom the analytic tradition at various Brazilian\n universities.[53]\n Philosophers trained in the São Paulo and Rio de Janeiro\ngroups moved to other states and promoted work in analytic\n philosophy.[54]\n Foreign professors with training in analytic philosophy also joined\nBrazilian\n universities.[55]\n As a result, many analytic groups started to emerge at various\nBrazilian universities from the early 1980s\n onwards.[56]\n\nThis expansion led to a fragmentation of philosophical activity in\nBrazil. In response, several initiatives emerged to integrate the\ndozens of philosophers scattered throughout the Brazilian territory.\nThe Associação Nacional de\nPós-Graduação em Filosofia (ANPOF) was\ncreated in 1983. ANPOF sought to prevent the isolation of researchers\nand maintain a continuous dialogue amongst philosophers from different\nstates. It started to organize biennial philosophy meetings structured\naround grupos de trabalho (GTs), i.e., working groups that\ngather senior and young researchers interested in common topics. GTs\noffered young researchers the opportunity to be mentored by senior\nresearchers from different states and develop a network across the\n country.[57]\n\nMany new philosophy journals have appeared since the 1990s. To be\nsure, few of those journals are exclusively devoted to analytic\nphilosophy. However, many of them regularly accept submissions of\nanalytic works. Their openness to analytic contributions suggests\nthat, at least since the 1990s, analytic philosophy was normalized\nthroughout the country.\n\nIn the 1990s and early 2000s, several national meetings in analytic\nphilosophy took place that led to the creation of the Sociedade\nBrasileira de Filosofia Analítica (SBFA) in 2008 (Brito\n 2008).[58]\n",
    "section_title": "2.3 Brazil (1930–1990)",
    "entry_title": "Analytic Philosophy in Latin America",
    "hierarchy_title": "Analytic Philosophy in Latin America || Development of Analytic Philosophy in Latin America || Brazil (1930–1990)",
    "tokenized_text": [
        "development",
        "analytic",
        "philosophy",
        "latin",
        "america",
        "brazil",
        "brazil",
        "brazilian",
        "analytic",
        "philosophy",
        "outgrowth",
        "several",
        "crisscrossing",
        "thread",
        "spanning",
        "large",
        "territory",
        "logic",
        "thread",
        "led",
        "development",
        "brazilian",
        "school",
        "logic",
        "centered",
        "around",
        "study",
        "paraconsistent",
        "formal",
        "system",
        "work",
        "mathematical",
        "logic",
        "started",
        "late",
        "s",
        "bloomed",
        "late",
        "s",
        "independently",
        "starting",
        "s",
        "philosophy",
        "thread",
        "introduced",
        "theme",
        "analytic",
        "tradition",
        "philosophy",
        "department",
        "thread",
        "led",
        "scholar",
        "trained",
        "continental",
        "philosophy",
        "history",
        "philosophy",
        "became",
        "interested",
        "logical",
        "positivism",
        "logic",
        "wittgenstein",
        "ordinary",
        "language",
        "philosophy",
        "history",
        "philosophy",
        "science",
        "although",
        "many",
        "member",
        "fully",
        "committed",
        "analytic",
        "tradition",
        "writing",
        "engaged",
        "analytic",
        "author",
        "logic",
        "philosophy",
        "thread",
        "started",
        "intersect",
        "mids",
        "philosopher",
        "increased",
        "interaction",
        "mathematician",
        "throughout",
        "late",
        "s",
        "s",
        "analytic",
        "philosophy",
        "expanded",
        "many",
        "brazilian",
        "state",
        "leading",
        "fragmentation",
        "philosophical",
        "activity",
        "brazil",
        "s",
        "several",
        "initiative",
        "promote",
        "interstate",
        "collaboration",
        "integration",
        "started",
        "bear",
        "fruit",
        "s",
        "one",
        "speak",
        "brazilian",
        "analytic",
        "community",
        "end",
        "s",
        "first",
        "half",
        "twentieth",
        "century",
        "scholastic",
        "philosophy",
        "cultivated",
        "brazil",
        "work",
        "logic",
        "focused",
        "aristotelian",
        "syllogism",
        "fallacy",
        "however",
        "several",
        "attempt",
        "introducing",
        "mathematical",
        "logic",
        "brazil",
        "since",
        "s",
        "manuel",
        "amoroso",
        "costa",
        "idéias",
        "fundamentais",
        "da",
        "matemática",
        "included",
        "chapter",
        "devoted",
        "mathematical",
        "logic",
        "vicente",
        "ferreira",
        "da",
        "silva",
        "published",
        "elementos",
        "de",
        "lógica",
        "matemática",
        "first",
        "book",
        "exclusively",
        "devoted",
        "mathematical",
        "logic",
        "latin",
        "america",
        "quine",
        "invited",
        "teach",
        "onesemester",
        "course",
        "universidade",
        "de",
        "são",
        "paulo",
        "usp",
        "lecture",
        "gave",
        "rise",
        "book",
        "entitled",
        "sentido",
        "da",
        "nova",
        "lógica",
        "three",
        "book",
        "little",
        "impact",
        "within",
        "philosophy",
        "circle",
        "late",
        "s",
        "onwards",
        "several",
        "group",
        "mathematician",
        "dedicated",
        "study",
        "mathematical",
        "logic",
        "brazil",
        "edson",
        "farah",
        "mathematics",
        "department",
        "usp",
        "led",
        "seminar",
        "dedicated",
        "topic",
        "hegenberg",
        "also",
        "supervised",
        "two",
        "important",
        "promoter",
        "analytic",
        "philosophy",
        "brazil",
        "leônidas",
        "hegenberg",
        "newton",
        "da",
        "costa",
        "hegenberg",
        "played",
        "key",
        "role",
        "dissemination",
        "mathematical",
        "logic",
        "philosophy",
        "science",
        "class",
        "textbook",
        "translation",
        "newton",
        "da",
        "costa",
        "studied",
        "civil",
        "engineering",
        "mathematics",
        "universidade",
        "federal",
        "paraná",
        "ufpr",
        "despite",
        "lack",
        "formal",
        "training",
        "philosophy",
        "da",
        "costa",
        "studied",
        "philosophy",
        "since",
        "teen",
        "defended",
        "thesis",
        "obtain",
        "chair",
        "mathematical",
        "analysis",
        "higher",
        "analysis",
        "faculty",
        "philosophy",
        "science",
        "letter",
        "ufpr",
        "thesis",
        "offered",
        "analysis",
        "three",
        "paraconsistent",
        "logical",
        "system",
        "ie",
        "deductive",
        "system",
        "inconsistent",
        "albeit",
        "nontrivial",
        "although",
        "da",
        "costa",
        "first",
        "study",
        "paraconsistent",
        "system",
        "first",
        "create",
        "several",
        "paraconsistent",
        "logical",
        "system",
        "gather",
        "research",
        "group",
        "explicit",
        "goal",
        "investigating",
        "formal",
        "property",
        "secco",
        "álvarez",
        "da",
        "costa",
        "research",
        "team",
        "became",
        "known",
        "curitiba",
        "group",
        "published",
        "first",
        "result",
        "comptes",
        "rendus",
        "de",
        "l",
        "académie",
        "de",
        "science",
        "de",
        "paris",
        "first",
        "paper",
        "published",
        "first",
        "research",
        "article",
        "logic",
        "ever",
        "published",
        "brazilian",
        "author",
        "international",
        "outlet",
        "ottaviano",
        "gomes",
        "publication",
        "put",
        "international",
        "spotlight",
        "da",
        "costa",
        "work",
        "started",
        "establish",
        "brazilian",
        "school",
        "logic",
        "contributed",
        "development",
        "paraconsistent",
        "logic",
        "topic",
        "global",
        "interest",
        "coup",
        "état",
        "led",
        "member",
        "curitiba",
        "group",
        "migrate",
        "são",
        "paulo",
        "da",
        "costa",
        "joined",
        "institute",
        "mathematics",
        "statistic",
        "computer",
        "science",
        "imecc",
        "universidade",
        "estadual",
        "de",
        "campinas",
        "unicamp",
        "institute",
        "mathematics",
        "statistic",
        "ime",
        "usp",
        "da",
        "costa",
        "first",
        "prominent",
        "phd",
        "student",
        "ayda",
        "ignez",
        "arruda",
        "created",
        "research",
        "group",
        "imecc",
        "ottaviano",
        "gomes",
        "group",
        "developed",
        "joint",
        "project",
        "published",
        "many",
        "joint",
        "article",
        "also",
        "promoted",
        "organization",
        "event",
        "contributed",
        "integration",
        "logician",
        "latin",
        "america",
        "part",
        "world",
        "growth",
        "community",
        "logician",
        "led",
        "creation",
        "sociedade",
        "brasileira",
        "de",
        "lógica",
        "sbl",
        "philosophical",
        "thread",
        "also",
        "start",
        "usp",
        "since",
        "foundation",
        "usp",
        "invited",
        "many",
        "foreign",
        "intellectual",
        "join",
        "nascent",
        "university",
        "many",
        "came",
        "france",
        "forming",
        "socalled",
        "french",
        "legion",
        "implemented",
        "structuralist",
        "approach",
        "history",
        "philosophy",
        "shaped",
        "way",
        "first",
        "second",
        "generation",
        "usp",
        "professional",
        "philosopher",
        "understood",
        "philosophy",
        "costa",
        "gillesgaston",
        "granger",
        "worked",
        "usp",
        "returned",
        "brazil",
        "several",
        "occasion",
        "stay",
        "usp",
        "granger",
        "taught",
        "logic",
        "philosophy",
        "science",
        "year",
        "later",
        "published",
        "lecture",
        "book",
        "format",
        "lógica",
        "e",
        "filosofia",
        "da",
        "ciências",
        "although",
        "book",
        "offered",
        "overview",
        "recent",
        "development",
        "logic",
        "philosophy",
        "science",
        "granger",
        "also",
        "promoted",
        "structuralist",
        "approach",
        "costa",
        "hence",
        "accident",
        "first",
        "brazilian",
        "philosopher",
        "engaged",
        "analytic",
        "author",
        "approached",
        "philosophy",
        "historicalstructuralist",
        "perspective",
        "josé",
        "giannottia",
        "student",
        "grangerbecame",
        "professor",
        "usp",
        "although",
        "initially",
        "taught",
        "symbolic",
        "logic",
        "soon",
        "became",
        "interested",
        "marx",
        "famous",
        "book",
        "origen",
        "da",
        "dialética",
        "trabalho",
        "giannotti",
        "offered",
        "sui",
        "generis",
        "interpretation",
        "antagonism",
        "capital",
        "labor",
        "verbal",
        "game",
        "following",
        "year",
        "studied",
        "wittgenstein",
        "philosophy",
        "hegenberg",
        "published",
        "first",
        "portuguese",
        "translation",
        "wittgenstein",
        "tractatus",
        "logicophilosophicus",
        "end",
        "career",
        "published",
        "long",
        "book",
        "compared",
        "heidegger",
        "wittgenstein",
        "attitude",
        "towards",
        "language",
        "giannotti",
        "oswaldo",
        "porchat",
        "studied",
        "usp",
        "rennes",
        "taught",
        "usp",
        "famous",
        "lecture",
        "conflito",
        "da",
        "filosofias",
        "porchat",
        "argued",
        "philosopher",
        "face",
        "conflict",
        "philosophy",
        "different",
        "philosophical",
        "system",
        "provide",
        "incompatible",
        "answer",
        "philosophical",
        "question",
        "world",
        "lacking",
        "answer",
        "challenge",
        "abandoned",
        "philosophy",
        "devoted",
        "study",
        "mathematical",
        "logic",
        "stay",
        "uc",
        "berkeley",
        "smith",
        "porchat",
        "returned",
        "usp",
        "taught",
        "advanced",
        "mathematical",
        "logic",
        "philosophy",
        "science",
        "course",
        "great",
        "impact",
        "student",
        "also",
        "regained",
        "interest",
        "philosophy",
        "led",
        "research",
        "group",
        "dedicated",
        "modal",
        "logic",
        "hegenberg",
        "publishing",
        "polemical",
        "article",
        "historicism",
        "philosophy",
        "science",
        "porchat",
        "porchat",
        "explored",
        "two",
        "different",
        "solution",
        "conflict",
        "philosophy",
        "commonsense",
        "solution",
        "relied",
        "key",
        "work",
        "analytic",
        "canon",
        "moore",
        "strawson",
        "skeptical",
        "solution",
        "inspired",
        "innovative",
        "interpretation",
        "ancient",
        "greek",
        "skepticism",
        "especially",
        "sextus",
        "empiricus",
        "building",
        "work",
        "quine",
        "ryle",
        "philosopher",
        "science",
        "popper",
        "lakatos",
        "result",
        "called",
        "neopyrrhonism",
        "porchat",
        "stay",
        "uc",
        "berkeley",
        "porchat",
        "envisioned",
        "creating",
        "center",
        "analogous",
        "uc",
        "berkeley",
        "group",
        "logic",
        "methodology",
        "science",
        "initiative",
        "faced",
        "political",
        "resistance",
        "usp",
        "took",
        "project",
        "unicamp",
        "ottaviano",
        "gomes",
        "centro",
        "de",
        "lógica",
        "epistemologia",
        "e",
        "história",
        "da",
        "ciência",
        "cle",
        "finally",
        "born",
        "main",
        "goal",
        "promote",
        "research",
        "logic",
        "epistemology",
        "philosophy",
        "science",
        "interdisciplinary",
        "study",
        "initially",
        "focused",
        "organization",
        "seminar",
        "scientific",
        "meeting",
        "promotion",
        "academic",
        "exchange",
        "group",
        "institution",
        "brazil",
        "abroad",
        "publication",
        "periodical",
        "book",
        "ottaviano",
        "gomes",
        "many",
        "participant",
        "logic",
        "thread",
        "joined",
        "cle",
        "either",
        "permanent",
        "associated",
        "member",
        "also",
        "group",
        "dedicated",
        "philosophy",
        "natural",
        "science",
        "physic",
        "biology",
        "another",
        "group",
        "devoted",
        "philosophy",
        "human",
        "science",
        "psychology",
        "psychoanalysis",
        "sociology",
        "member",
        "interested",
        "philosophy",
        "mind",
        "philosophy",
        "language",
        "ottaviano",
        "carnielli",
        "alves",
        "cle",
        "created",
        "different",
        "journal",
        "porchat",
        "founded",
        "manuscrito",
        "later",
        "became",
        "one",
        "main",
        "outlet",
        "analytic",
        "philosophy",
        "latin",
        "america",
        "zeljko",
        "loparić",
        "created",
        "cadernos",
        "de",
        "história",
        "e",
        "filosofia",
        "da",
        "ciência",
        "journal",
        "nonclassical",
        "logic",
        "followed",
        "cle",
        "started",
        "publish",
        "book",
        "logic",
        "history",
        "philosophy",
        "epistemology",
        "methodology",
        "science",
        "early",
        "s",
        "cle",
        "contributed",
        "development",
        "specialized",
        "course",
        "graduate",
        "program",
        "logic",
        "philosophy",
        "science",
        "philosophy",
        "department",
        "unicamp",
        "program",
        "trained",
        "many",
        "subsequent",
        "generation",
        "analytic",
        "philosopher",
        "brazil",
        "latin",
        "american",
        "country",
        "since",
        "creation",
        "cle",
        "played",
        "decisive",
        "role",
        "gathering",
        "brazilian",
        "latin",
        "american",
        "philosopher",
        "internationalizing",
        "brazilian",
        "work",
        "logic",
        "analytic",
        "philosophy",
        "philosophical",
        "development",
        "roughly",
        "contemporaneous",
        "são",
        "paulo",
        "state",
        "reason",
        "space",
        "development",
        "rio",
        "de",
        "janeiro",
        "mentioned",
        "euryalo",
        "cannabrava",
        "published",
        "elementos",
        "de",
        "metodologia",
        "filosófica",
        "introdução",
        "à",
        "filosofia",
        "científica",
        "ensaios",
        "filosóficos",
        "book",
        "presented",
        "hitherto",
        "unfamiliar",
        "idea",
        "analytic",
        "canon",
        "philosopher",
        "rio",
        "also",
        "showed",
        "early",
        "interest",
        "frege",
        "second",
        "wittgenstein",
        "ordinary",
        "language",
        "philosophy",
        "paulo",
        "alcoforado",
        "worked",
        "universidade",
        "federal",
        "rio",
        "de",
        "janeiro",
        "ufrj",
        "although",
        "work",
        "history",
        "philosophy",
        "translated",
        "portuguese",
        "work",
        "frege",
        "late",
        "s",
        "simpson",
        "formas",
        "lógicas",
        "realidad",
        "significado",
        "also",
        "published",
        "introductory",
        "article",
        "ordinary",
        "language",
        "philosophy",
        "helped",
        "develop",
        "tradition",
        "work",
        "ordinary",
        "language",
        "philosophy",
        "rio",
        "mario",
        "guerreiro",
        "joined",
        "ufrj",
        "taught",
        "theory",
        "knowledge",
        "philosophy",
        "language",
        "metaphysics",
        "wrote",
        "common",
        "sense",
        "wittgenstein",
        "skepticism",
        "guerreiro",
        "guido",
        "antônio",
        "de",
        "almeida",
        "worked",
        "pontifícia",
        "universidade",
        "católica",
        "de",
        "rio",
        "de",
        "janeiro",
        "pucrj",
        "trained",
        "husserl",
        "phenomenology",
        "taught",
        "graduate",
        "class",
        "speech",
        "act",
        "second",
        "wittgenstein",
        "daniel",
        "vanderveken",
        "expert",
        "speech",
        "act",
        "also",
        "visited",
        "rio",
        "year",
        "hegenberg",
        "s",
        "analytic",
        "philosophy",
        "started",
        "spread",
        "throughout",
        "country",
        "least",
        "two",
        "factor",
        "explain",
        "phenomenon",
        "first",
        "many",
        "graduate",
        "program",
        "philosophy",
        "created",
        "brazil",
        "s",
        "brito",
        "second",
        "number",
        "scholarship",
        "pursue",
        "postgraduate",
        "study",
        "brazil",
        "abroad",
        "increased",
        "dramatically",
        "early",
        "s",
        "late",
        "s",
        "mazza",
        "many",
        "brazilian",
        "philosopher",
        "benefited",
        "public",
        "policy",
        "expansion",
        "analytic",
        "philosophy",
        "took",
        "many",
        "form",
        "many",
        "brazilian",
        "received",
        "training",
        "analytic",
        "center",
        "abroad",
        "introduced",
        "topic",
        "analytic",
        "tradition",
        "various",
        "brazilian",
        "university",
        "philosopher",
        "trained",
        "são",
        "paulo",
        "rio",
        "de",
        "janeiro",
        "group",
        "moved",
        "state",
        "promoted",
        "work",
        "analytic",
        "philosophy",
        "foreign",
        "professor",
        "training",
        "analytic",
        "philosophy",
        "also",
        "joined",
        "brazilian",
        "university",
        "result",
        "many",
        "analytic",
        "group",
        "started",
        "emerge",
        "various",
        "brazilian",
        "university",
        "early",
        "s",
        "onwards",
        "expansion",
        "led",
        "fragmentation",
        "philosophical",
        "activity",
        "brazil",
        "response",
        "several",
        "initiative",
        "emerged",
        "integrate",
        "dozen",
        "philosopher",
        "scattered",
        "throughout",
        "brazilian",
        "territory",
        "associação",
        "nacional",
        "de",
        "pósgraduação",
        "em",
        "filosofia",
        "anpof",
        "created",
        "anpof",
        "sought",
        "prevent",
        "isolation",
        "researcher",
        "maintain",
        "continuous",
        "dialogue",
        "amongst",
        "philosopher",
        "different",
        "state",
        "started",
        "organize",
        "biennial",
        "philosophy",
        "meeting",
        "structured",
        "around",
        "grupos",
        "de",
        "trabalho",
        "gts",
        "ie",
        "working",
        "group",
        "gather",
        "senior",
        "young",
        "researcher",
        "interested",
        "common",
        "topic",
        "gts",
        "offered",
        "young",
        "researcher",
        "opportunity",
        "mentored",
        "senior",
        "researcher",
        "different",
        "state",
        "develop",
        "network",
        "across",
        "country",
        "many",
        "new",
        "philosophy",
        "journal",
        "appeared",
        "since",
        "s",
        "sure",
        "journal",
        "exclusively",
        "devoted",
        "analytic",
        "philosophy",
        "however",
        "many",
        "regularly",
        "accept",
        "submission",
        "analytic",
        "work",
        "openness",
        "analytic",
        "contribution",
        "suggests",
        "least",
        "since",
        "s",
        "analytic",
        "philosophy",
        "normalized",
        "throughout",
        "country",
        "s",
        "early",
        "s",
        "several",
        "national",
        "meeting",
        "analytic",
        "philosophy",
        "took",
        "place",
        "led",
        "creation",
        "sociedade",
        "brasileira",
        "de",
        "filosofia",
        "analítica",
        "sbfa",
        "brito"
    ]
}