{
    "main_text": "The use of language in law || The pragmatics of legal language\n2.3 The pragmatics of legal language\n\nThe dependence of the effect of legal language on context is an\ninstance of a general feature of communication, which some\nphilosophers of language have approached by distinguishing semantics\nfrom pragmatics. The distinction is, roughly, between the meaning of a\nword or phrase or other linguistic expression, and the effect that is\nto be ascribed to the use of the expression in a particular way, by a\nparticular user of the language, in a particular context. The\npragmatics of legal language is a vast field, because the term\n‘pragmatics’ could be used as a heading for much of what\nmodern legal scholars and theorists have described as grounds for\ninterpretation. In fact, ‘pragmatics’ could also be used\nas a heading for much that they have described as the theory of\ninterpretation – since ‘pragmatics’ is a term not\nonly for effects of communication, but also for the study of those\neffects.  For example, the work of the judges in Garner v\nBurr can be described as an exercise in pragmatic inference. The\ntechnical sound of the word ‘pragmatics’ may suggest that\nit is a term for the theoretical study of its object; in fact, the\nfield of study is what might be inferred from the fact that someone\nsaid what they said in the context in which they said it. No object of\nstudy is less apt for theorising.\n\nThis vast field has been much studied over millennia by lawyers and\nphilosophers, but only recently through the use of resources that may\nbe borrowed from the 20th-century development of\n‘pragmatics’ as a discipline in linguistics and the\nphilosophy of language. Much recent work in the pragmatics of legal\nlanguage has focused on Gricean and post-Gricean pragmatics, as a\nsource of insights into the theory of legal interpretation (see e.g.\nMarmor 2008, 2014, Soames 2008, Ekins 2012 (see especially pp\n205–211), Carston 2013, Solum 2013; on Gricean and post-Gricean\npragmatics, see\n pragmatics).\n\nIt is controversial whether legal pragmatics is simply a part of the\npragmatics of language use in general (see Dascal and\nWróblewski 1988). It stands to reason that if the pragmatics of\nlanguage use depends on the context of an utterance, the legal context\nof a lawmaking use of language will have implications for the meaning\nconveyed and, therefore, for the law that is made. Scott Soames has\nargued that the question of the relation between the content of the\nlaw and authoritative sources (such as statutes), is ‘an\ninstance of the more general question of what determines the contents\nof ordinary linguistic texts’ (Soames 2008). It is a popular\nidea that when a legislature enacts a statute, ‘The content of\nthe statute is what the lawmakers asserted and committed themselves\nto, in adopting the statutory language’ (Soames 2008). Speakers\ncan commit themselves to something that they have not asserted, and\ncan make assertions in contexts that make it clear that they are not\ncommitted to what they have asserted.\n\nBut Andrei Marmor has argued that the pragmatics of legal language is\nunique in crucial respects (Marmor 2008), with pragmatic\nconsiderations playing some very significantly lesser role in law than\nin other contexts: ‘In ordinary conversations, pragmatic\nenrichment is the norm, not the exception; in statutory law, it is the\nexception’ (Marmor 2014, 34). In his view, the Gricean maxims of\nconversation, derived from a general principle of cooperation, do not\nstraightforwardly apply in legislative communication, because\nlegislative communication is ‘strategic’ rather than\ncooperative (Marmor 2014, 45–57). Likewise, Francesca Poggi has argued\nthat Grice’s theory does not apply to legislation, because of\nthe ‘conflictual behaviour’ of those addressed by\nlegislation (Poggi 2011, 35). As Marmor points out, speakers and\nlisteners in strategic communication take advantage of uncertainties\nin the\n implicatures\n to be derived from pragmatic norms of communication. For present\npurposes, we can think of an implicature as a proposition that a\nperson is to be understood to have conveyed by using language in a\nparticular way, although it is not expressed by what the person said\n(see Grice 1975, 43–4). Speakers may exploit implicatures in order to\navoid asserting what they prefer to implicate, and listeners may\nexploit uncertainties concerning implicatures in order to bend the\neffect of a communication to their liking. Yet these aspects of\ncommunication are not distinctive to law making. And they depend on\ncooperation among participants in the ‘conversation’ in\nquestion: some degree of cooperation is necessary in order for it to\nmake any sense for a speaker to take advantage of an implicature, or\nfor a listener to treat an uncertain implicature as a genuine\nimplicature.\n\n‘Near-side’ pragmatics (for Korta and Perry’s\ndistinction between ‘near-side’ and ‘far-side’\npragmatics, see\n pragmatics)\n is a matter of what is said by an utterance; in informal conversation\nit involves the use of indexicals and pronominal figures that are\navoided in legislation, and involves the implications of context for\nan understanding of the uses of terms. And ‘far-side’\npragmatics (determining what is implicated rather than said, and\ndetermining what speech acts are carried out by means of an utterance)\ncan involve figurative uses of language such as sarcasm, innuendos,\nand other techniques that lawmakers avoid. There is some force in\nMarmor’s claim that pragmatics is different in law. Legislation\nsystematically avoids many communicative devices that can be so very\nuseful in other contexts of communication. But those devices are also\navoided in a wide range of other formalized and technical uses of\nlanguage—for example, in most wedding invitations, in Wikipedia\narticles that have not been hacked, and in well-written instruction\nguides for applying for bank account or for operating a rice\ncooker.\n\nYet the pragmatic effects of communication are essential in all of\nthose formalised contexts of language use, and they are essential to\nthe legislative use of language. This is true both of\n‘near-side’ and ‘far-side’ pragmatics. The\ndiscussion of the decision in Garner v Burr, above, provides\nan illustration of the ways in which the context of a legislative\nenactment can determine the reference of terms such as\n‘vehicle’, and this determination of meaning is an aspect\nof near-side pragmatics. The dispute over the requirement of pneumatic\ntires on ‘vehicles’ in Garner v Burr can be\nunderstood as a dispute over the effect of the context on the content\nof the regulatory provision; another way of making the same point is\nto describe it as a dispute over the implicatures to be drawn from the\nfact of the enactment of that provision. This aspect of the pragmatics\nof legal language is simply an instance of the pragmatics of the use\nof language in general. It would be very easy to formulate a version\nof the apparent paradox of legislative language, discussed in section\n2.2 above, in a non-legal context: only imagine that Lawrence\nBurr’s mother told him not to go driving the farm vehicles down\nher driveway without tires.\n\nThe role of far-side pragmatics is illustrated by the master\nimplicature of every legislative act: it is never said in legislation,\nbut there is always an implicature, that the rights and duties and\npowers established by the legislation are to be legal rights\nand duties and powers, under the law of the jurisdiction for which the\nenactment is made (see Endicott 2014, 55). Very many other more\nparticular lawyers’ presumptions serve as maxims of the\npragmatics of lawmaking (such as the presumption that a new enactment\noverrides a contrary previous enactment).\n\nIt is worth noting, as well, that the diversity of contexts of\ncommunication (even the diversity of conversations that the same two\npeople may have, let alone all the diversity of exchanges that might\nbe called ‘conversations’ by more or less remote analogy)\nis so great that the variations among pragmatic aspects of ordinary\nconversations are much wider and deeper than any general distinction\nthat can be drawn between legislative communication as a class, and\nordinary conversations as a class. The use of language in making law\nis so closely interwoven with the use of language to exercise\nauthority in other contexts, and with the use of language in games, in\ntalk (in many different contexts) of what is right and wrong, and\ngenerally in communication in families and in organisations of every\nkind, that the pragmatics of legal language is best seen as a deeply\nintegral part of the pragmatics of the use of language in general.\n\nIt may seem otherwise, because the persons to whom laws are addressed\ncan be extraordinarily creative in finding ways of fitting the laws to\ntheir own interests, and parties to a dispute over the law tend to\ndisagree deeply over the effect of the language that has been used to\nmake law (so that it is not at all unusual for each side to end up\nwith a deeply-felt conviction that the law is so clearly on his or her\nown side, that no reasonable person could think otherwise). So it\nseems, as Marmor argues, that the use of language to make law is not\npart of a cooperative exchange between lawmakers and the persons to\nwhom their communications are addressed.\n\nFor this very reason, of course, every legal system has tribunals for\nthe resolution of legal disputes. They are always an integral part of\nthe system of governance in a state that is ruled by law, although\nthey very often have various forms of independence from other\ninstitutions of the system. The tribunals or courts typically have\nauthority to interpret the lawmaking use of language and to determine\nits effect in particular cases. Unlike the parties to a dispute,\ncourts are characteristically involved with the lawmakers in the\nenterprise of governance (even where the courts are independent), and\noften have their own lawmaking capacities. Their role in the system is\nthe substratum for a cooperative principle that has even deeper\nsignificance (and somewhat simpler implications) in the operation of a\nlegal system, than Grice’s cooperative principle has in ordinary\nconversation. And, of course, that cooperative role of a court in the\nlegal system constrains the arguments of parties to a dispute: however\nstrongly they are inclined to twist the language of the law (and\nhowever strongly they may feel that the other side is twisting the\nlanguage of the law), they need an argument that will persuade an\ninstitution that is committed, at least in principle, to cooperative\ninterpretation of lawmaking acts. One way of explaining the decision\nin is to say that the Lord Chief Justice cooperated with the\nlegislature by treating the legislature as having adhered to\nGrice’s Cooperative Principle: ‘Make your conversational\ncontribution such as is required, at the stage at which it occurs, by\nthe accepted purpose or direction of the talk exchange in which you\nare engaged’ (Grice 1989, 26; for discussion of the principle\nsee\n Grice).\n Sometimes, as lawyers know well, courts interpret legislation in more\nor less non-cooperative ways, and it is not hard to envisage\nlegislative pathologies (or to identify real life examples of\npathologies) that justify such an attitude on the part of judges. If\ncourts take a generally non-cooperative attitude to legislation, the\nwhole legal system suffers from a pathology: an inability to sustain\nthe rule-of-law values of openness and clarity of the laws.\n\nThe problem faced in cases like Garner v Burr is an\nespecially vivid reminder of a problem that philosophers of language\nhave long been more or less aware of (see Aristotle’s discussion\nof the notion of ‘friendship’ in Eudemian Ethics VII, 2,\n1236a 33). The context-dependence of the meaning of utterances\nrequires an account of linguistic competence that relates it to other\nhuman capacities—capacities to judge the importance of context\nand to draw analogies. It would be a mistake in the philosophy of\nlanguage to account for language in a way that divorces its mastery\nfrom other aspects of reason. That connection between the use of\nlanguage and reason is also illustrated by the contentious nature of\nthe use of language in law. Much work on pragmatics by philosophers of\nlanguage has concerned the conditions for understanding an utterance;\njudicial disputes over language are a reminder that those\nconditions—even though they are conditions of intelligibility of\ncommunication—lend themselves to disagreement and to reasoned\ndispute over how an utterance is to be understood (see Carston 2013,\nfor discussion of controversies over the application of conversational\nmaxims). The special feature that distinguishes the legal use of\nlanguage from ordinary conversation is not that participants in a\nlegal system act strategically while participants in an ordinary\nconversation act cooperatively; the special feature is that in order\nto attain the ideal of the rule of law, legal systems need\ninstitutions and processes for resolution of the disputes about the\neffect of law-making uses of language that arise as a result of its\ncontext-dependence, and as a result of other pragmatic aspects of\ncommunication.\n",
    "section_title": "2.3 The pragmatics of legal language",
    "entry_title": "Law and Language",
    "hierarchy_title": "Law and Language || The use of language in law || The pragmatics of legal language",
    "tokenized_text": [
        "use",
        "language",
        "law",
        "pragmatic",
        "legal",
        "language",
        "pragmatic",
        "legal",
        "language",
        "dependence",
        "effect",
        "legal",
        "language",
        "context",
        "instance",
        "general",
        "feature",
        "communication",
        "philosopher",
        "language",
        "approached",
        "distinguishing",
        "semantics",
        "pragmatic",
        "distinction",
        "roughly",
        "meaning",
        "word",
        "phrase",
        "linguistic",
        "expression",
        "effect",
        "ascribed",
        "use",
        "expression",
        "particular",
        "way",
        "particular",
        "user",
        "language",
        "particular",
        "context",
        "pragmatic",
        "legal",
        "language",
        "vast",
        "field",
        "term",
        "pragmatic",
        "could",
        "used",
        "heading",
        "much",
        "modern",
        "legal",
        "scholar",
        "theorist",
        "described",
        "ground",
        "interpretation",
        "fact",
        "pragmatic",
        "could",
        "also",
        "used",
        "heading",
        "much",
        "described",
        "theory",
        "interpretation",
        "since",
        "pragmatic",
        "term",
        "effect",
        "communication",
        "also",
        "study",
        "effect",
        "example",
        "work",
        "judge",
        "garner",
        "v",
        "burr",
        "described",
        "exercise",
        "pragmatic",
        "inference",
        "technical",
        "sound",
        "word",
        "pragmatic",
        "may",
        "suggest",
        "term",
        "theoretical",
        "study",
        "object",
        "fact",
        "field",
        "study",
        "might",
        "inferred",
        "fact",
        "someone",
        "said",
        "said",
        "context",
        "said",
        "object",
        "study",
        "le",
        "apt",
        "theorising",
        "vast",
        "field",
        "much",
        "studied",
        "millennium",
        "lawyer",
        "philosopher",
        "recently",
        "use",
        "resource",
        "may",
        "borrowed",
        "thcentury",
        "development",
        "pragmatic",
        "discipline",
        "linguistics",
        "philosophy",
        "language",
        "much",
        "recent",
        "work",
        "pragmatic",
        "legal",
        "language",
        "focused",
        "gricean",
        "postgricean",
        "pragmatic",
        "source",
        "insight",
        "theory",
        "legal",
        "interpretation",
        "see",
        "eg",
        "marmor",
        "soames",
        "ekins",
        "see",
        "especially",
        "pp",
        "carston",
        "solum",
        "gricean",
        "postgricean",
        "pragmatic",
        "see",
        "pragmatic",
        "controversial",
        "whether",
        "legal",
        "pragmatic",
        "simply",
        "part",
        "pragmatic",
        "language",
        "use",
        "general",
        "see",
        "dascal",
        "wróblewski",
        "stand",
        "reason",
        "pragmatic",
        "language",
        "use",
        "depends",
        "context",
        "utterance",
        "legal",
        "context",
        "lawmaking",
        "use",
        "language",
        "implication",
        "meaning",
        "conveyed",
        "therefore",
        "law",
        "made",
        "scott",
        "soames",
        "argued",
        "question",
        "relation",
        "content",
        "law",
        "authoritative",
        "source",
        "statute",
        "instance",
        "general",
        "question",
        "determines",
        "content",
        "ordinary",
        "linguistic",
        "text",
        "soames",
        "popular",
        "idea",
        "legislature",
        "enacts",
        "statute",
        "content",
        "statute",
        "lawmaker",
        "asserted",
        "committed",
        "adopting",
        "statutory",
        "language",
        "soames",
        "speaker",
        "commit",
        "something",
        "asserted",
        "make",
        "assertion",
        "context",
        "make",
        "clear",
        "committed",
        "asserted",
        "andrei",
        "marmor",
        "argued",
        "pragmatic",
        "legal",
        "language",
        "unique",
        "crucial",
        "respect",
        "marmor",
        "pragmatic",
        "consideration",
        "playing",
        "significantly",
        "lesser",
        "role",
        "law",
        "context",
        "ordinary",
        "conversation",
        "pragmatic",
        "enrichment",
        "norm",
        "exception",
        "statutory",
        "law",
        "exception",
        "marmor",
        "view",
        "gricean",
        "maxim",
        "conversation",
        "derived",
        "general",
        "principle",
        "cooperation",
        "straightforwardly",
        "apply",
        "legislative",
        "communication",
        "legislative",
        "communication",
        "strategic",
        "rather",
        "cooperative",
        "marmor",
        "likewise",
        "francesca",
        "poggi",
        "argued",
        "grice",
        "theory",
        "apply",
        "legislation",
        "conflictual",
        "behaviour",
        "addressed",
        "legislation",
        "poggi",
        "marmor",
        "point",
        "speaker",
        "listener",
        "strategic",
        "communication",
        "take",
        "advantage",
        "uncertainty",
        "implicatures",
        "derived",
        "pragmatic",
        "norm",
        "communication",
        "present",
        "purpose",
        "think",
        "implicature",
        "proposition",
        "person",
        "understood",
        "conveyed",
        "using",
        "language",
        "particular",
        "way",
        "although",
        "expressed",
        "person",
        "said",
        "see",
        "grice",
        "speaker",
        "may",
        "exploit",
        "implicatures",
        "order",
        "avoid",
        "asserting",
        "prefer",
        "implicate",
        "listener",
        "may",
        "exploit",
        "uncertainty",
        "concerning",
        "implicatures",
        "order",
        "bend",
        "effect",
        "communication",
        "liking",
        "yet",
        "aspect",
        "communication",
        "distinctive",
        "law",
        "making",
        "depend",
        "cooperation",
        "among",
        "participant",
        "conversation",
        "question",
        "degree",
        "cooperation",
        "necessary",
        "order",
        "make",
        "sense",
        "speaker",
        "take",
        "advantage",
        "implicature",
        "listener",
        "treat",
        "uncertain",
        "implicature",
        "genuine",
        "implicature",
        "nearside",
        "pragmatic",
        "korta",
        "perry",
        "distinction",
        "nearside",
        "farside",
        "pragmatic",
        "see",
        "pragmatic",
        "matter",
        "said",
        "utterance",
        "informal",
        "conversation",
        "involves",
        "use",
        "indexicals",
        "pronominal",
        "figure",
        "avoided",
        "legislation",
        "involves",
        "implication",
        "context",
        "understanding",
        "us",
        "term",
        "farside",
        "pragmatic",
        "determining",
        "implicated",
        "rather",
        "said",
        "determining",
        "speech",
        "act",
        "carried",
        "mean",
        "utterance",
        "involve",
        "figurative",
        "us",
        "language",
        "sarcasm",
        "innuendo",
        "technique",
        "lawmaker",
        "avoid",
        "force",
        "marmor",
        "claim",
        "pragmatic",
        "different",
        "law",
        "legislation",
        "systematically",
        "avoids",
        "many",
        "communicative",
        "device",
        "useful",
        "context",
        "communication",
        "device",
        "also",
        "avoided",
        "wide",
        "range",
        "formalized",
        "technical",
        "us",
        "languagefor",
        "example",
        "wedding",
        "invitation",
        "wikipedia",
        "article",
        "hacked",
        "wellwritten",
        "instruction",
        "guide",
        "applying",
        "bank",
        "account",
        "operating",
        "rice",
        "cooker",
        "yet",
        "pragmatic",
        "effect",
        "communication",
        "essential",
        "formalised",
        "context",
        "language",
        "use",
        "essential",
        "legislative",
        "use",
        "language",
        "true",
        "nearside",
        "farside",
        "pragmatic",
        "discussion",
        "decision",
        "garner",
        "v",
        "burr",
        "provides",
        "illustration",
        "way",
        "context",
        "legislative",
        "enactment",
        "determine",
        "reference",
        "term",
        "vehicle",
        "determination",
        "meaning",
        "aspect",
        "nearside",
        "pragmatic",
        "dispute",
        "requirement",
        "pneumatic",
        "tire",
        "vehicle",
        "garner",
        "v",
        "burr",
        "understood",
        "dispute",
        "effect",
        "context",
        "content",
        "regulatory",
        "provision",
        "another",
        "way",
        "making",
        "point",
        "describe",
        "dispute",
        "implicatures",
        "drawn",
        "fact",
        "enactment",
        "provision",
        "aspect",
        "pragmatic",
        "legal",
        "language",
        "simply",
        "instance",
        "pragmatic",
        "use",
        "language",
        "general",
        "would",
        "easy",
        "formulate",
        "version",
        "apparent",
        "paradox",
        "legislative",
        "language",
        "discussed",
        "section",
        "nonlegal",
        "context",
        "imagine",
        "lawrence",
        "burr",
        "mother",
        "told",
        "go",
        "driving",
        "farm",
        "vehicle",
        "driveway",
        "without",
        "tire",
        "role",
        "farside",
        "pragmatic",
        "illustrated",
        "master",
        "implicature",
        "every",
        "legislative",
        "act",
        "never",
        "said",
        "legislation",
        "always",
        "implicature",
        "right",
        "duty",
        "power",
        "established",
        "legislation",
        "legal",
        "right",
        "duty",
        "power",
        "law",
        "jurisdiction",
        "enactment",
        "made",
        "see",
        "endicott",
        "many",
        "particular",
        "lawyer",
        "presumption",
        "serve",
        "maxim",
        "pragmatic",
        "lawmaking",
        "presumption",
        "new",
        "enactment",
        "override",
        "contrary",
        "previous",
        "enactment",
        "worth",
        "noting",
        "well",
        "diversity",
        "context",
        "communication",
        "even",
        "diversity",
        "conversation",
        "two",
        "people",
        "may",
        "let",
        "alone",
        "diversity",
        "exchange",
        "might",
        "called",
        "conversation",
        "le",
        "remote",
        "analogy",
        "great",
        "variation",
        "among",
        "pragmatic",
        "aspect",
        "ordinary",
        "conversation",
        "much",
        "wider",
        "deeper",
        "general",
        "distinction",
        "drawn",
        "legislative",
        "communication",
        "class",
        "ordinary",
        "conversation",
        "class",
        "use",
        "language",
        "making",
        "law",
        "closely",
        "interwoven",
        "use",
        "language",
        "exercise",
        "authority",
        "context",
        "use",
        "language",
        "game",
        "talk",
        "many",
        "different",
        "context",
        "right",
        "wrong",
        "generally",
        "communication",
        "family",
        "organisation",
        "every",
        "kind",
        "pragmatic",
        "legal",
        "language",
        "best",
        "seen",
        "deeply",
        "integral",
        "part",
        "pragmatic",
        "use",
        "language",
        "general",
        "may",
        "seem",
        "otherwise",
        "person",
        "law",
        "addressed",
        "extraordinarily",
        "creative",
        "finding",
        "way",
        "fitting",
        "law",
        "interest",
        "party",
        "dispute",
        "law",
        "tend",
        "disagree",
        "deeply",
        "effect",
        "language",
        "used",
        "make",
        "law",
        "unusual",
        "side",
        "end",
        "deeplyfelt",
        "conviction",
        "law",
        "clearly",
        "side",
        "reasonable",
        "person",
        "could",
        "think",
        "otherwise",
        "seems",
        "marmor",
        "argues",
        "use",
        "language",
        "make",
        "law",
        "part",
        "cooperative",
        "exchange",
        "lawmaker",
        "person",
        "communication",
        "addressed",
        "reason",
        "course",
        "every",
        "legal",
        "system",
        "tribunal",
        "resolution",
        "legal",
        "dispute",
        "always",
        "integral",
        "part",
        "system",
        "governance",
        "state",
        "ruled",
        "law",
        "although",
        "often",
        "various",
        "form",
        "independence",
        "institution",
        "system",
        "tribunal",
        "court",
        "typically",
        "authority",
        "interpret",
        "lawmaking",
        "use",
        "language",
        "determine",
        "effect",
        "particular",
        "case",
        "unlike",
        "party",
        "dispute",
        "court",
        "characteristically",
        "involved",
        "lawmaker",
        "enterprise",
        "governance",
        "even",
        "court",
        "independent",
        "often",
        "lawmaking",
        "capacity",
        "role",
        "system",
        "substratum",
        "cooperative",
        "principle",
        "even",
        "deeper",
        "significance",
        "somewhat",
        "simpler",
        "implication",
        "operation",
        "legal",
        "system",
        "grice",
        "cooperative",
        "principle",
        "ordinary",
        "conversation",
        "course",
        "cooperative",
        "role",
        "court",
        "legal",
        "system",
        "constrains",
        "argument",
        "party",
        "dispute",
        "however",
        "strongly",
        "inclined",
        "twist",
        "language",
        "law",
        "however",
        "strongly",
        "may",
        "feel",
        "side",
        "twisting",
        "language",
        "law",
        "need",
        "argument",
        "persuade",
        "institution",
        "committed",
        "least",
        "principle",
        "cooperative",
        "interpretation",
        "lawmaking",
        "act",
        "one",
        "way",
        "explaining",
        "decision",
        "say",
        "lord",
        "chief",
        "justice",
        "cooperated",
        "legislature",
        "treating",
        "legislature",
        "adhered",
        "grice",
        "cooperative",
        "principle",
        "make",
        "conversational",
        "contribution",
        "required",
        "stage",
        "occurs",
        "accepted",
        "purpose",
        "direction",
        "talk",
        "exchange",
        "engaged",
        "grice",
        "discussion",
        "principle",
        "see",
        "grice",
        "sometimes",
        "lawyer",
        "know",
        "well",
        "court",
        "interpret",
        "legislation",
        "le",
        "noncooperative",
        "way",
        "hard",
        "envisage",
        "legislative",
        "pathology",
        "identify",
        "real",
        "life",
        "example",
        "pathology",
        "justify",
        "attitude",
        "part",
        "judge",
        "court",
        "take",
        "generally",
        "noncooperative",
        "attitude",
        "legislation",
        "whole",
        "legal",
        "system",
        "suffers",
        "pathology",
        "inability",
        "sustain",
        "ruleoflaw",
        "value",
        "openness",
        "clarity",
        "law",
        "problem",
        "faced",
        "case",
        "like",
        "garner",
        "v",
        "burr",
        "especially",
        "vivid",
        "reminder",
        "problem",
        "philosopher",
        "language",
        "long",
        "le",
        "aware",
        "see",
        "aristotle",
        "discussion",
        "notion",
        "friendship",
        "eudemian",
        "ethic",
        "vii",
        "a",
        "contextdependence",
        "meaning",
        "utterance",
        "requires",
        "account",
        "linguistic",
        "competence",
        "relates",
        "human",
        "capacitiescapacities",
        "judge",
        "importance",
        "context",
        "draw",
        "analogy",
        "would",
        "mistake",
        "philosophy",
        "language",
        "account",
        "language",
        "way",
        "divorce",
        "mastery",
        "aspect",
        "reason",
        "connection",
        "use",
        "language",
        "reason",
        "also",
        "illustrated",
        "contentious",
        "nature",
        "use",
        "language",
        "law",
        "much",
        "work",
        "pragmatic",
        "philosopher",
        "language",
        "concerned",
        "condition",
        "understanding",
        "utterance",
        "judicial",
        "dispute",
        "language",
        "reminder",
        "conditionseven",
        "though",
        "condition",
        "intelligibility",
        "communicationlend",
        "disagreement",
        "reasoned",
        "dispute",
        "utterance",
        "understood",
        "see",
        "carston",
        "discussion",
        "controversy",
        "application",
        "conversational",
        "maxim",
        "special",
        "feature",
        "distinguishes",
        "legal",
        "use",
        "language",
        "ordinary",
        "conversation",
        "participant",
        "legal",
        "system",
        "act",
        "strategically",
        "participant",
        "ordinary",
        "conversation",
        "act",
        "cooperatively",
        "special",
        "feature",
        "order",
        "attain",
        "ideal",
        "rule",
        "law",
        "legal",
        "system",
        "need",
        "institution",
        "process",
        "resolution",
        "dispute",
        "effect",
        "lawmaking",
        "us",
        "language",
        "arise",
        "result",
        "contextdependence",
        "result",
        "pragmatic",
        "aspect",
        "communication"
    ]
}