{
    "main_text": "Can law be made by the use of language? || The Semantic Sting\n3.1 The Semantic Sting\n\nThe most influential theory to have denied the communication model is\nthat of Ronald Dworkin, as it emerged in his argument against the idea\nthat the law of a country is a system of rules. H.L.A.Hart had tried\nto explain the nature of a legal system on the basis of social rules\nfor identifying the law of a community, which provide shared tests of\nvalidity for rules of the system. Hart treated it as obvious that such\nrules commonly identify the acts of law-making authorities as sources\nof law, conferring power on those authorities to make law, and that\n(subject to qualifications that are part of the communication model\nsuch as those listed above) the law becomes what a lawmaker conveys\nthat it is to be, in the communicative act by which it exercises such\na power.\n\nOn that view, the content of the law of a community depends on a\nconventional way of recognizing legal rules. But if members of the\ncommunity share a way of recognizing their law, how can they engage in\nthe deep disputes about the law that we are all so familiar with?\nDworkin made that question into a focus of jurisprudential debate. And\nhe framed the question as an objection to a misguided view of\nlanguage, and of the relation between law and language. He began his\nbook Law’s Empire (Dworkin 1986b) by contending that\nlegal theorists like Hart cannot explain theoretical disagreement in\nlegal practice, because they think that lawyers share uncontroversial\ntests (tests which Dworkin termed ‘criteria’) for the\ntruth of propositions of law. The ‘semantic sting’\ninvolves the misconception that the language of the law can be\nmeaningful only if lawyers share such criteria. It is fatal to a legal\ntheory, because it leads the theorist to think that people cannot have\nany deep (or ‘substantive’ or ‘genuine’)\ndisagreement about the law. They can only disagree (1) about empirical\nquestions such as what words were used in a statute, or (2) about how\nto resolve penumbral cases, or (3) about whether the law should be\nchanged. If you suffer from the semantic sting, you will conclude that\ndisagreeing about the criteria for application of the language of the\nlaw would be like using the same words with different meanings. People\nwho disagree in that way are only talking past each other. Here is how\nDworkin set out the views of theorists who suffer from the semantic\nsting:\n\n\nWe follow shared rules, they say, in using any word: these rules set\nout criteria that supply the word’s meaning. Our rules for using\n‘law’ tie law to plain historical fact.…\nPhilosophers of law must elucidate them for us by a sensitive study of\nhow we speak. They may disagree among themselves, but that alone casts\nno doubt on their common assumption, which is that we do share some\nset of standards about how ‘law’ is to be used. (Dworkin,\n1986b, 31)\n\n\nDworkin argued that legal philosophy needs to make a fresh start, in\norder to face the challenge of explaining disagreement about the law.\nAny theory of law, he claimed, needs to be a ‘constructive\ninterpretation’ of legal practice. A constructive interpretation\nis one that simultaneously fits the facts of the object of\ninterpretation (in the case of legal interpretation, the object is not\nsome particular communicative act by a lawmaker, but the entire\npractice of the community) and portrays it as an object that\nachieves its purpose. On this view, a theory that does not present law\nas an exercise in constructive interpretation cannot even compete as a\ntheory of law, because it suffers from the semantic sting. And the\ncommunication model is incompatible with the idea that law is an\nexercise in constructive interpretation.\n\nThe semantic sting really does seem a gruesome fate for a lawyer,\nbecause those who suffer from it would have to say that no one really\ndisagrees with anyone about the law: whenever people think they\ndisagree about how to identify the law on any point, that fact in\nitself would demonstrate that there is nothing to disagree about:\nthere is no law on the point at issue, if the agreed ways of\nidentifying the law do not decide the point. So if you suffer from the\nsemantic sting, you will conclude that sincere, competent lawyers who\nknow the facts of a case will never disagree with each other. When an\napparent disagreement arises, they ought to throw up their hands and\nsay that there is no law on the point. If you suffer from the semantic\nsting, you will think that at least one party to any dispute over the\ncontent of the law is either legally inept and philosophically\nmisguided, or dishonest.\n\nDworkin somewhat obscured his brilliant argument by melding the vice\nof thinking that legal philosophy is a matter of disclosing the agreed\nway of using the word ‘law’ (see section 6.1 below) with\nthe vice of thinking that the content of the law of a jurisdiction is\ndetermined by agreement over the use of the words in which it is\nformulated. Pierluigi Chiassoni has recently isolated the second vice\nand called it the ‘container-retrieval’ theory (Chiassoni\n2019, 113). On the container-retrieval theory, legislative language is\nfilled up with content by linguistic conventions as to the application\nof the words in which it is expressed. The task of applying\nlegislation is the task of identifying those cases to which its words\nconventionally apply. On that approach, Garner v Burr was\nrightly decided if English speakers were disposed in 1951 to apply the\nword ‘vehicle’ to a chicken coop on wheels. If they were\ndisposed to withhold the term, the case was wrongly decided. And if\nthey had no shared disposition either way, then there was a gap in the\nlaw, and the Court of Appeal had to fill it. In any case, the\ncontent-retrieval theorist is, as Dworkin suggested, doomed to\nconclude that competent lawyers cannot disagree in good faith as to\nwhat law has been made.\n\nDworkin’s challenge is pressing because of the absurdity of the\ncontent-retrieval view. To meet the challenge, it is necessary to\nexplain how it can be reasonable to disagree over the application of\nrules made by communicative acts. If the meaning of words determines\nthe rules, and the Lord Chief Justice and the magistrates agreed in\ntheir grasp of the meaning of the words of the legislation, how could\nthey differ on the question of what the rules required?\n\nThe potential for such a reasonable disagreement (even among people\nwho understand the language of the lawmaker equally well) is to be\nfound in the complex pragmatic considerations discussed in section 2.3\nabove, concerning the effect of a lawmaking communicative act.\nConsider that if we tried to adhere to the content-retrieval theory,\nwe would have to say that the relevant dispositions of speakers have\nto be contextualised: because the context affects speakers’\ndispositions, we would have to ask whether they are disposed to apply\nthe word to a chicken coop with wheels, in the context of the\napplication of the word ‘vehicle’ in a statutory provision\nmaking it an offence to use a vehicle without tires, for the purpose\nof protecting road surfaces... And once we ask the dispositions of\nspeakers in that proper context, it becomes obviously absurd to think\nthat there should be any legal force in their dispositions to decide\nthe very question that the Court had jurisdiction and duty to\ndecide.\n\nIf we accept the communication model, we will conclude that\nparticipants in legal practice typically share an understanding of the\nmeaning of the language of legislation; yet it is still clear that\nthere are bound to be deep disagreements as to the implications of\nthose law-making acts in some cases. Disagreement about the content of\nthe law will arise if the persons subject to the law must apply a test\nthat, like the legislation in Garner v Burr, can be\ncontroversial in its application in some cases. Likewise, disagreement\nwill arise if the legislative act delegates authority to a court (as\nlegislatures often do), or if the legislature communicates unclearly.\nThe persons subject to the law must decide (and may dispute) how to\ninterpret the acts of the legislature. And it may also be unclear (and\ncontroversial) in some cases whether the legislature has the power\nthat it claims to have exercised, or whether a court has power to\ndepart (and if so, whether it ought to depart) from a decision of the\nlegislature.\n\nDoes the recent outpouring of work on the pragmatics of legal language\nprovide a successful defence of the communication model against\nDworkin’s semantic sting argument? That work makes it abundantly\nclear that the communication model does not need to rely on the\ncontent-retrieval picture of the meaning of words. The point of legal\ninterpretation in Garner v Burr was not to decide whether the\nmeaning of the word ‘vehicle’ encompasses a chicken coop\non wheels. It was, instead, to decide what it was that Parliament had\ndone, when it required vehicles on the roads to have tires. In\nJ.L.Austin’s slogan, ‘The total speech act in the total\nspeech situation is the only actual phenomenon which, in the last\nresort, we are engaged in elucidating.’ (Austin 1962, 148).\n\nBut Dworkin would presumably have extended his ‘semantic\nsting’ argument into an argument that the communication model\nsuffers from a ‘semantic-and-pragmatic sting’—i.e.,\nthe misconception that the content of the law is determined by\nagreement both as to the semantics of words, and also as to the\npragmatics of communication. He would no doubt have said that the only\nantidote to this sting is his theory of ‘constructive\ninterpretation’, holding that the ‘pragmatic’\naspects of the use of language in law include the attitude that law\nmust justify the use of state coercion, which requires the interpreter\nto construct the theory of rights and duties that best fits and\njustifies the whole pattern of legal practice. That was\nDworkin’s essential claim. His semantic sting argument cannot in\nitself undermine the communication model, because his argument was\nbased on an impoverished view of the controversy that can result from\ncommunication.\n",
    "section_title": "3.1 The Semantic Sting",
    "entry_title": "Law and Language",
    "hierarchy_title": "Law and Language || Can law be made by the use of language? || The Semantic Sting",
    "tokenized_text": [
        "law",
        "made",
        "use",
        "language",
        "semantic",
        "sting",
        "semantic",
        "sting",
        "influential",
        "theory",
        "denied",
        "communication",
        "model",
        "ronald",
        "dworkin",
        "emerged",
        "argument",
        "idea",
        "law",
        "country",
        "system",
        "rule",
        "hlahart",
        "tried",
        "explain",
        "nature",
        "legal",
        "system",
        "basis",
        "social",
        "rule",
        "identifying",
        "law",
        "community",
        "provide",
        "shared",
        "test",
        "validity",
        "rule",
        "system",
        "hart",
        "treated",
        "obvious",
        "rule",
        "commonly",
        "identify",
        "act",
        "lawmaking",
        "authority",
        "source",
        "law",
        "conferring",
        "power",
        "authority",
        "make",
        "law",
        "subject",
        "qualification",
        "part",
        "communication",
        "model",
        "listed",
        "law",
        "becomes",
        "lawmaker",
        "conveys",
        "communicative",
        "act",
        "exercise",
        "power",
        "view",
        "content",
        "law",
        "community",
        "depends",
        "conventional",
        "way",
        "recognizing",
        "legal",
        "rule",
        "member",
        "community",
        "share",
        "way",
        "recognizing",
        "law",
        "engage",
        "deep",
        "dispute",
        "law",
        "familiar",
        "dworkin",
        "made",
        "question",
        "focus",
        "jurisprudential",
        "debate",
        "framed",
        "question",
        "objection",
        "misguided",
        "view",
        "language",
        "relation",
        "law",
        "language",
        "began",
        "book",
        "law",
        "empire",
        "dworkin",
        "b",
        "contending",
        "legal",
        "theorist",
        "like",
        "hart",
        "explain",
        "theoretical",
        "disagreement",
        "legal",
        "practice",
        "think",
        "lawyer",
        "share",
        "uncontroversial",
        "test",
        "test",
        "dworkin",
        "termed",
        "criterion",
        "truth",
        "proposition",
        "law",
        "semantic",
        "sting",
        "involves",
        "misconception",
        "language",
        "law",
        "meaningful",
        "lawyer",
        "share",
        "criterion",
        "fatal",
        "legal",
        "theory",
        "lead",
        "theorist",
        "think",
        "people",
        "deep",
        "substantive",
        "genuine",
        "disagreement",
        "law",
        "disagree",
        "empirical",
        "question",
        "word",
        "used",
        "statute",
        "resolve",
        "penumbral",
        "case",
        "whether",
        "law",
        "changed",
        "suffer",
        "semantic",
        "sting",
        "conclude",
        "disagreeing",
        "criterion",
        "application",
        "language",
        "law",
        "would",
        "like",
        "using",
        "word",
        "different",
        "meaning",
        "people",
        "disagree",
        "way",
        "talking",
        "past",
        "dworkin",
        "set",
        "view",
        "theorist",
        "suffer",
        "semantic",
        "sting",
        "follow",
        "shared",
        "rule",
        "say",
        "using",
        "word",
        "rule",
        "set",
        "criterion",
        "supply",
        "word",
        "meaning",
        "rule",
        "using",
        "law",
        "tie",
        "law",
        "plain",
        "historical",
        "fact",
        "philosopher",
        "law",
        "must",
        "elucidate",
        "u",
        "sensitive",
        "study",
        "speak",
        "may",
        "disagree",
        "among",
        "alone",
        "cast",
        "doubt",
        "common",
        "assumption",
        "share",
        "set",
        "standard",
        "law",
        "used",
        "dworkin",
        "b",
        "dworkin",
        "argued",
        "legal",
        "philosophy",
        "need",
        "make",
        "fresh",
        "start",
        "order",
        "face",
        "challenge",
        "explaining",
        "disagreement",
        "law",
        "theory",
        "law",
        "claimed",
        "need",
        "constructive",
        "interpretation",
        "legal",
        "practice",
        "constructive",
        "interpretation",
        "one",
        "simultaneously",
        "fit",
        "fact",
        "object",
        "interpretation",
        "case",
        "legal",
        "interpretation",
        "object",
        "particular",
        "communicative",
        "act",
        "lawmaker",
        "entire",
        "practice",
        "community",
        "portrays",
        "object",
        "achieves",
        "purpose",
        "view",
        "theory",
        "present",
        "law",
        "exercise",
        "constructive",
        "interpretation",
        "even",
        "compete",
        "theory",
        "law",
        "suffers",
        "semantic",
        "sting",
        "communication",
        "model",
        "incompatible",
        "idea",
        "law",
        "exercise",
        "constructive",
        "interpretation",
        "semantic",
        "sting",
        "really",
        "seem",
        "gruesome",
        "fate",
        "lawyer",
        "suffer",
        "would",
        "say",
        "one",
        "really",
        "disagrees",
        "anyone",
        "law",
        "whenever",
        "people",
        "think",
        "disagree",
        "identify",
        "law",
        "point",
        "fact",
        "would",
        "demonstrate",
        "nothing",
        "disagree",
        "law",
        "point",
        "issue",
        "agreed",
        "way",
        "identifying",
        "law",
        "decide",
        "point",
        "suffer",
        "semantic",
        "sting",
        "conclude",
        "sincere",
        "competent",
        "lawyer",
        "know",
        "fact",
        "case",
        "never",
        "disagree",
        "apparent",
        "disagreement",
        "arises",
        "ought",
        "throw",
        "hand",
        "say",
        "law",
        "point",
        "suffer",
        "semantic",
        "sting",
        "think",
        "least",
        "one",
        "party",
        "dispute",
        "content",
        "law",
        "either",
        "legally",
        "inept",
        "philosophically",
        "misguided",
        "dishonest",
        "dworkin",
        "somewhat",
        "obscured",
        "brilliant",
        "argument",
        "melding",
        "vice",
        "thinking",
        "legal",
        "philosophy",
        "matter",
        "disclosing",
        "agreed",
        "way",
        "using",
        "word",
        "law",
        "see",
        "section",
        "vice",
        "thinking",
        "content",
        "law",
        "jurisdiction",
        "determined",
        "agreement",
        "use",
        "word",
        "formulated",
        "pierluigi",
        "chiassoni",
        "recently",
        "isolated",
        "second",
        "vice",
        "called",
        "containerretrieval",
        "theory",
        "chiassoni",
        "containerretrieval",
        "theory",
        "legislative",
        "language",
        "filled",
        "content",
        "linguistic",
        "convention",
        "application",
        "word",
        "expressed",
        "task",
        "applying",
        "legislation",
        "task",
        "identifying",
        "case",
        "word",
        "conventionally",
        "apply",
        "approach",
        "garner",
        "v",
        "burr",
        "rightly",
        "decided",
        "english",
        "speaker",
        "disposed",
        "apply",
        "word",
        "vehicle",
        "chicken",
        "coop",
        "wheel",
        "disposed",
        "withhold",
        "term",
        "case",
        "wrongly",
        "decided",
        "shared",
        "disposition",
        "either",
        "way",
        "gap",
        "law",
        "court",
        "appeal",
        "fill",
        "case",
        "contentretrieval",
        "theorist",
        "dworkin",
        "suggested",
        "doomed",
        "conclude",
        "competent",
        "lawyer",
        "disagree",
        "good",
        "faith",
        "law",
        "made",
        "dworkin",
        "challenge",
        "pressing",
        "absurdity",
        "contentretrieval",
        "view",
        "meet",
        "challenge",
        "necessary",
        "explain",
        "reasonable",
        "disagree",
        "application",
        "rule",
        "made",
        "communicative",
        "act",
        "meaning",
        "word",
        "determines",
        "rule",
        "lord",
        "chief",
        "justice",
        "magistrate",
        "agreed",
        "grasp",
        "meaning",
        "word",
        "legislation",
        "could",
        "differ",
        "question",
        "rule",
        "required",
        "potential",
        "reasonable",
        "disagreement",
        "even",
        "among",
        "people",
        "understand",
        "language",
        "lawmaker",
        "equally",
        "well",
        "found",
        "complex",
        "pragmatic",
        "consideration",
        "discussed",
        "section",
        "concerning",
        "effect",
        "lawmaking",
        "communicative",
        "act",
        "consider",
        "tried",
        "adhere",
        "contentretrieval",
        "theory",
        "would",
        "say",
        "relevant",
        "disposition",
        "speaker",
        "contextualised",
        "context",
        "affect",
        "speaker",
        "disposition",
        "would",
        "ask",
        "whether",
        "disposed",
        "apply",
        "word",
        "chicken",
        "coop",
        "wheel",
        "context",
        "application",
        "word",
        "vehicle",
        "statutory",
        "provision",
        "making",
        "offence",
        "use",
        "vehicle",
        "without",
        "tire",
        "purpose",
        "protecting",
        "road",
        "surface",
        "ask",
        "disposition",
        "speaker",
        "proper",
        "context",
        "becomes",
        "obviously",
        "absurd",
        "think",
        "legal",
        "force",
        "disposition",
        "decide",
        "question",
        "court",
        "jurisdiction",
        "duty",
        "decide",
        "accept",
        "communication",
        "model",
        "conclude",
        "participant",
        "legal",
        "practice",
        "typically",
        "share",
        "understanding",
        "meaning",
        "language",
        "legislation",
        "yet",
        "still",
        "clear",
        "bound",
        "deep",
        "disagreement",
        "implication",
        "lawmaking",
        "act",
        "case",
        "disagreement",
        "content",
        "law",
        "arise",
        "person",
        "subject",
        "law",
        "must",
        "apply",
        "test",
        "like",
        "legislation",
        "garner",
        "v",
        "burr",
        "controversial",
        "application",
        "case",
        "likewise",
        "disagreement",
        "arise",
        "legislative",
        "act",
        "delegate",
        "authority",
        "court",
        "legislature",
        "often",
        "legislature",
        "communicates",
        "unclearly",
        "person",
        "subject",
        "law",
        "must",
        "decide",
        "may",
        "dispute",
        "interpret",
        "act",
        "legislature",
        "may",
        "also",
        "unclear",
        "controversial",
        "case",
        "whether",
        "legislature",
        "power",
        "claim",
        "exercised",
        "whether",
        "court",
        "power",
        "depart",
        "whether",
        "ought",
        "depart",
        "decision",
        "legislature",
        "recent",
        "outpouring",
        "work",
        "pragmatic",
        "legal",
        "language",
        "provide",
        "successful",
        "defence",
        "communication",
        "model",
        "dworkin",
        "semantic",
        "sting",
        "argument",
        "work",
        "make",
        "abundantly",
        "clear",
        "communication",
        "model",
        "need",
        "rely",
        "contentretrieval",
        "picture",
        "meaning",
        "word",
        "point",
        "legal",
        "interpretation",
        "garner",
        "v",
        "burr",
        "decide",
        "whether",
        "meaning",
        "word",
        "vehicle",
        "encompasses",
        "chicken",
        "coop",
        "wheel",
        "instead",
        "decide",
        "parliament",
        "done",
        "required",
        "vehicle",
        "road",
        "tire",
        "jlaustin",
        "slogan",
        "total",
        "speech",
        "act",
        "total",
        "speech",
        "situation",
        "actual",
        "phenomenon",
        "last",
        "resort",
        "engaged",
        "elucidating",
        "austin",
        "dworkin",
        "would",
        "presumably",
        "extended",
        "semantic",
        "sting",
        "argument",
        "argument",
        "communication",
        "model",
        "suffers",
        "semanticandpragmatic",
        "sting",
        "ie",
        "misconception",
        "content",
        "law",
        "determined",
        "agreement",
        "semantics",
        "word",
        "also",
        "pragmatic",
        "communication",
        "would",
        "doubt",
        "said",
        "antidote",
        "sting",
        "theory",
        "constructive",
        "interpretation",
        "holding",
        "pragmatic",
        "aspect",
        "use",
        "language",
        "law",
        "include",
        "attitude",
        "law",
        "must",
        "justify",
        "use",
        "state",
        "coercion",
        "requires",
        "interpreter",
        "construct",
        "theory",
        "right",
        "duty",
        "best",
        "fit",
        "justifies",
        "whole",
        "pattern",
        "legal",
        "practice",
        "dworkin",
        "essential",
        "claim",
        "semantic",
        "sting",
        "argument",
        "undermine",
        "communication",
        "model",
        "argument",
        "based",
        "impoverished",
        "view",
        "controversy",
        "result",
        "communication"
    ]
}