{
    "main_text": "Public Reason\n7. Public Reason\n\nAs we have seen, several leading legal writers—be they in favour\nor against—continue to take Mill’s harm principle in\noriginal or modified form to be “the dominant theory as to what\nlimits on criminal legislation should be observed by liberal\ndemocratic states” (Moore 2017: 461). Katrina Forrester’s\npost-war history of liberal political thought, however, emphatically\nputs John Rawls, rather than Mill, at the centre (Forrester 2021); and\nPiers Norris Turner, in an essay on Mill and modern liberalism, opines\nthat public reason liberalism—whose leading light is\nRawls—has become the dominant tradition within liberal thought\n“over the past three decades” (Turner 2017: 576; cf.\nTurner and Gaus 2017; Rawls 1999; Quong 2018; Hartley & Watson\n2018; Freeman 2020). However, the growing and highly sophisticated\nliterature on public reason among specifically political philosophers\nhas not yet—at least not to the extent that it has in relation\nto legal moralism and the harm principle—received the sustained\nstudy of writers as heavily steeped in the law as Feinberg, Hart or\nDevlin. Specific legal applications of the public reason approach are,\nhowever, already in existence (for example Flanders 2016) and the\napproach continues to develop.\n\nThe approach suggests a different limit of the law: that laws must in\nsome sense be based on public reasons, not reasons harvested\nfrom, or based on, comprehensive moral, ethical or religious theories.\nWe saw above that while Devlin, Moore and Hart all supported the\ndecriminalization of gay sex, they did so on very different\nunderstandings. Devlin did not rule out circumstances, admittedly\nextreme ones, in which criminalization might be justifiable in virtue\nof the intensity and comprehensiveness of the beliefs of ordinary\npersons in a society. Moore and Hart, by contrast, did implicitly rule\nout criminalization in such circumstances. Moore because the moral\ntruth of the matter is highly pertinent, indeed\ndecisive—there being nothing morally wrong with gay\nsex—Hart, despite assuming the moral truth of the matter to be\nirrelevant—gay sex is not harmful, so the conclusion\ngoes through whether such conduct is wrongful or not. Rawls for his\npart would no doubt agree with all three on the correctness of\ndecriminalization. But he would seek to exclude, as did Hart and\nDevlin, any Moore-style or perfectionist appeal to a comprehensive\nmoral understanding to determine the issue. Devlin for his part would\nhave had Moore down as one of the “moral rationalists”\nwhose views he wanted side-lined in favour of the reasonable\ncitizen.\n\nIn one way, then, Devlin anticipates a major preoccupation of Rawls.\nRawls did not, to be sure, take Devlin’s apparent view that the\nmoral beliefs of a society constitute (its) moral truth. His\nwas not a scepticism about the existence of moral truth, merely a\ndetermination to avoid “the zeal to embody the whole\ntruth in politics” (Rawls 1999: 132–133, emphasis added).\nBut both Devlin and Rawls demanded that political power and legal\ncoercion should be justifiable to those subject to them,\nprovided they are reasonable. Thomas Nagel similarly insists\na state’s law must do better than just tell those with certain\nconceptions of the good that they are mistaken, which seems the\nimplication of Moore’s and of the perfectionist view; something\nmore must be offered to them relating, he argues, to the point of view\nof such persons. According to him we must support:\n\n\n… the exclusion of certain values from the admissible grounds\nfor the application of coercive state powers. We must agree to refrain\nfrom limiting people’s liberty by state action in the name of\nvalues that are deeply inadmissible in a certain way from their point\nof view. (Nagel 1991: 155)\n\n\nDevlin and Rawls, however, differed in how justification to reasonable\ncitizens should be spelt out and it is here that Rawls develops much\nof his account. Devlin’s model of the reasonable person was the\njury. To the question how the lawmaker is to ascertain the moral\njudgements of society, Devlin answered,\n\n\nthe moral judgement of society must be something about which any\ntwelve men or women drawn at random might after discussion be expected\nto be unanimous. (Devlin 1965: 15).\n\n\nTo insist, as both do, that justification must be targeted at the\nreasonable citizen is to idealize the agreement on which their views\nwere based (Raz 1990 [1994]; Enoch 2013; Billingham & Taylor\nforthcoming), since neither is saying one should simply seek the\nacceptance of (all) the citizens as they are, reasonable or not.\nInsisting on the actual agreement of citizens as they actually are is\nlikely to prove excessively demanding, since too much of the rough\nmust be taken with the smooth, accommodating misanthropic,\nmisogynistic, egotistical, anarchic etc views. Devlin does not\nidealize a great deal, or at least he does not spell out in any detail\nhow he understands what “reasonable” means, beyond\ninsisting the reasonable jury-member must not hold\n“irrational” beliefs, such as “homosexuality is the\ncause of earthquakes” (Devlin 1965: viii). In stating one can\nnotionally pick “twelve men or women at random” he\nappeared to think that a sample of the population is an adequate\npointer to the appropriate morality. Here there is a stark contrast\nwith Rawls. For taking a random sample of the population is to\nunderemphasise moral disagreement, as Rawls would see it. It is not\nreasonable to think that moral disagreement will disappear in the\nmedium- or even the long-term. And much of this disagreement cannot\nsimply be blamed on the bloody-mindedness of some or on those biased\nin favour of themselves, their families, or groups. Some of the\ndisagreement is based, rather, on differences over what evidence is\nappropriate, how much weight should be given to the evidence where it\ncan be agreed upon, how priorities and choices should be made among\nthe vast range of possible values and so on. Rawls describes factors\nsuch as these as “the burdens of judgment” (Rawls 1993:\n56–57). Hence Rawls idealizes the constituency to whom legal\ncoercion must be justified inter alia as the persons who\naccept the burdens of judgement and the resulting fact of reasonable\npluralism.\n\nThe idealization involved in the public reason approach is\ncontroversial. There is scepticism in some quarters that there really\nis any genuine “middle way” between “actual\n(including implied) agreement and rational justification” (Raz\n1990: 46). If too many constraints are built in, the very idea of\njustification-to a given constituency disappears. The leading\nnatural law theorist John Finnis, writes:\n\n\nNatural Law theory is nothing other than the account of all the\nreasons-for-action which people ought to be able to accept, precisely\nbecause these are good, valid and sound as reasons. (Finnis 1996:\n10–11).\n\n\nNatural law, theory, is a paradigm “comprehensive”\ndoctrine, however, precisely what is to be avoided in Rawls’\nview. If justification-to ends up meaning only giving good\nreasons to a certain constituency, the idea has all but\nevaporated.\n\nAnother contrast with Devlin’s members of the jury, is that\nRawlsian public reason is not simply a matter of getting a sample of\nthe people into a notional room and waiting for them to agree, however\nthat is to be done. Public reason is itself a substantive framework to\nbe shared by everyone, a module, “a complete political\nconception” whose principles and ideals are to be elaborated and\nwhose arguments are to be deployed in legal argument (Rawls 1999:\n138). It has content, in other words, “given by a family of\nreasonable conceptions of justice” (Rawls 1999: 132). While, as\nwe have just noted, a natural law or Roman Catholic world view cannot\nitself be adopted under public reason, its conception of the common\ngood or solidarity when “expressed in terms of political\nvalues” can be one grounding for a political conception that\ngives content to public reason (Rawls 1999: 142). For interesting\nexplorations of the relationship between religious comprehensive\ndoctrines and public reason, see, e.g., An-Na’im 2015,\nBillingham 2021.\n\nTwo kinds of issue of special concern to questions of the limits of\nlaw concern, first, the scope of public reason and, secondly, its\ncapacity to account convincingly for certain apparently easy cases of\nlegitimate legal coercion. As for the first, Rawls restricts public\nreason to “constitutional essentials and matters of basic\njustice” (Rawls 1999: 133). Is it convincing to thus limit\npublic reason? In the eyes of some Rawls is too permissive about\nimportant matters of (non-basic) justice and fairness beyond the\nconstitutional essentials and the basic aspects of justice. Jonathan\nQuong for example objects to Rawls’ openness to perfectionist\nvalues so far as “large resources to grand projects in the arts\nand sciences” are concerned (Quong 2011: 281; Stanton-Ife\n2020).\n\nSecondly, how well does the public reason view handle certain\nobviously legitimate uses of legal coercion, such as the\ncriminalization of murder and rape? While there is no doubt that a\nRawlsian public reason module, duly developed, would straightforwardly\ndeliver the bare bones of coercive laws against murder and rape, can\nthis be done fully and satisfactorily without the sort of recourse to\ncomprehensive moral and metaphysical doctrines Rawls wishes to rule\nout? Take murder as an example. Standardly murder requires proof of at\nleast causation of death with an intention to kill and penalties are\namong the severest, stretching in various jurisdictions to mandatory\nlife imprisonment or, in some, to capital punishment. But how is\n“death” in “causation of death” to be\nunderstood? It is common to understand it in terms of the cessation of\nbrain stem functioning. But why this understanding? For some putative\nvictim may have irrevocably lost the capacity for consciousness while\nhis or her brain stem continues to function. Is not the wrong of\nmurder truly captured not only when the brain stem ceases functioning,\nbut (possibly before that) when there is such “irrevocable loss\nof the capacity of consciousness” (Persson 2002; De Grazia 2017:\n4.3)? For, one might say, it is the latter that explains what is\nhorrific about murder. Someone who intentionally brings about the\npermanent cessation of the brain stem functioning of another should\nnot be thought of as a murderer, the argument goes, where the capacity\nfor consciousness of the victim is already known to have been\nirrevocably lost. Perhaps such conduct ought still to be criminal and\nlabelled as such, only not as murder meriting the mandatory life\nsentence. The point for present purposes is not to settle the question\nof what the best understanding of murder should be, or whether the\nimaginary case should count as murder, only to suggest that these\nissues are likely to turn, implicitly or explicitly, on comprehensive\nmoral and metaphysical understandings. Public reason will be\ninsufficient-or so the challenge would run (Tadros 2012: 77). Somewhat\nrelatedly is Rawls’ account of abortion—he argues for a\n“duly qualified right” on the part of a woman “to\ndecide whether or not to end her pregnancy during the first\ntrimester” (Rawls 1993: 243). Whether Rawls is entitled to this\nconclusion on the basis of public reason has been hotly contested (see\nthe varying perspectives of George 1997 [1999: 209–213]; J.\nWilliams 2015; Kramer 2017: 92–155; Laborde 2018; Chambers 2018;\nArrell 2019).\n",
    "section_title": "7. Public Reason",
    "entry_title": "The Limits of Law",
    "hierarchy_title": "The Limits of Law || Public Reason",
    "tokenized_text": [
        "public",
        "reason",
        "public",
        "reason",
        "seen",
        "several",
        "leading",
        "legal",
        "writersbe",
        "favour",
        "againstcontinue",
        "take",
        "mill",
        "harm",
        "principle",
        "original",
        "modified",
        "form",
        "dominant",
        "theory",
        "limit",
        "criminal",
        "legislation",
        "observed",
        "liberal",
        "democratic",
        "state",
        "moore",
        "katrina",
        "forrester",
        "postwar",
        "history",
        "liberal",
        "political",
        "thought",
        "however",
        "emphatically",
        "put",
        "john",
        "rawls",
        "rather",
        "mill",
        "centre",
        "forrester",
        "pier",
        "norris",
        "turner",
        "essay",
        "mill",
        "modern",
        "liberalism",
        "opines",
        "public",
        "reason",
        "liberalismwhose",
        "leading",
        "light",
        "rawlshas",
        "become",
        "dominant",
        "tradition",
        "within",
        "liberal",
        "thought",
        "past",
        "three",
        "decade",
        "turner",
        "cf",
        "turner",
        "gaus",
        "rawls",
        "quong",
        "hartley",
        "watson",
        "freeman",
        "however",
        "growing",
        "highly",
        "sophisticated",
        "literature",
        "public",
        "reason",
        "among",
        "specifically",
        "political",
        "philosopher",
        "yetat",
        "least",
        "extent",
        "relation",
        "legal",
        "moralism",
        "harm",
        "principlereceived",
        "sustained",
        "study",
        "writer",
        "heavily",
        "steeped",
        "law",
        "feinberg",
        "hart",
        "devlin",
        "specific",
        "legal",
        "application",
        "public",
        "reason",
        "approach",
        "however",
        "already",
        "existence",
        "example",
        "flanders",
        "approach",
        "continues",
        "develop",
        "approach",
        "suggests",
        "different",
        "limit",
        "law",
        "law",
        "must",
        "sense",
        "based",
        "public",
        "reason",
        "reason",
        "harvested",
        "based",
        "comprehensive",
        "moral",
        "ethical",
        "religious",
        "theory",
        "saw",
        "devlin",
        "moore",
        "hart",
        "supported",
        "decriminalization",
        "gay",
        "sex",
        "different",
        "understanding",
        "devlin",
        "rule",
        "circumstance",
        "admittedly",
        "extreme",
        "one",
        "criminalization",
        "might",
        "justifiable",
        "virtue",
        "intensity",
        "comprehensiveness",
        "belief",
        "ordinary",
        "person",
        "society",
        "moore",
        "hart",
        "contrast",
        "implicitly",
        "rule",
        "criminalization",
        "circumstance",
        "moore",
        "moral",
        "truth",
        "matter",
        "highly",
        "pertinent",
        "indeed",
        "decisivethere",
        "nothing",
        "morally",
        "wrong",
        "gay",
        "sexhart",
        "despite",
        "assuming",
        "moral",
        "truth",
        "matter",
        "irrelevantgay",
        "sex",
        "harmful",
        "conclusion",
        "go",
        "whether",
        "conduct",
        "wrongful",
        "rawls",
        "part",
        "would",
        "doubt",
        "agree",
        "three",
        "correctness",
        "decriminalization",
        "would",
        "seek",
        "exclude",
        "hart",
        "devlin",
        "moorestyle",
        "perfectionist",
        "appeal",
        "comprehensive",
        "moral",
        "understanding",
        "determine",
        "issue",
        "devlin",
        "part",
        "would",
        "moore",
        "one",
        "moral",
        "rationalist",
        "whose",
        "view",
        "wanted",
        "sidelined",
        "favour",
        "reasonable",
        "citizen",
        "one",
        "way",
        "devlin",
        "anticipates",
        "major",
        "preoccupation",
        "rawls",
        "rawls",
        "sure",
        "take",
        "devlin",
        "apparent",
        "view",
        "moral",
        "belief",
        "society",
        "constitute",
        "moral",
        "truth",
        "scepticism",
        "existence",
        "moral",
        "truth",
        "merely",
        "determination",
        "avoid",
        "zeal",
        "embody",
        "whole",
        "truth",
        "politics",
        "rawls",
        "emphasis",
        "added",
        "devlin",
        "rawls",
        "demanded",
        "political",
        "power",
        "legal",
        "coercion",
        "justifiable",
        "subject",
        "provided",
        "reasonable",
        "thomas",
        "nagel",
        "similarly",
        "insists",
        "state",
        "law",
        "must",
        "better",
        "tell",
        "certain",
        "conception",
        "good",
        "mistaken",
        "seems",
        "implication",
        "moore",
        "perfectionist",
        "view",
        "something",
        "must",
        "offered",
        "relating",
        "argues",
        "point",
        "view",
        "person",
        "according",
        "must",
        "support",
        "exclusion",
        "certain",
        "value",
        "admissible",
        "ground",
        "application",
        "coercive",
        "state",
        "power",
        "must",
        "agree",
        "refrain",
        "limiting",
        "people",
        "liberty",
        "state",
        "action",
        "name",
        "value",
        "deeply",
        "inadmissible",
        "certain",
        "way",
        "point",
        "view",
        "nagel",
        "devlin",
        "rawls",
        "however",
        "differed",
        "justification",
        "reasonable",
        "citizen",
        "spelt",
        "rawls",
        "develops",
        "much",
        "account",
        "devlin",
        "model",
        "reasonable",
        "person",
        "jury",
        "question",
        "lawmaker",
        "ascertain",
        "moral",
        "judgement",
        "society",
        "devlin",
        "answered",
        "moral",
        "judgement",
        "society",
        "must",
        "something",
        "twelve",
        "men",
        "woman",
        "drawn",
        "random",
        "might",
        "discussion",
        "expected",
        "unanimous",
        "devlin",
        "insist",
        "justification",
        "must",
        "targeted",
        "reasonable",
        "citizen",
        "idealize",
        "agreement",
        "view",
        "based",
        "raz",
        "enoch",
        "billingham",
        "taylor",
        "forthcoming",
        "since",
        "neither",
        "saying",
        "one",
        "simply",
        "seek",
        "acceptance",
        "citizen",
        "reasonable",
        "insisting",
        "actual",
        "agreement",
        "citizen",
        "actually",
        "likely",
        "prove",
        "excessively",
        "demanding",
        "since",
        "much",
        "rough",
        "must",
        "taken",
        "smooth",
        "accommodating",
        "misanthropic",
        "misogynistic",
        "egotistical",
        "anarchic",
        "etc",
        "view",
        "devlin",
        "idealize",
        "great",
        "deal",
        "least",
        "spell",
        "detail",
        "understands",
        "reasonable",
        "mean",
        "beyond",
        "insisting",
        "reasonable",
        "jurymember",
        "must",
        "hold",
        "irrational",
        "belief",
        "homosexuality",
        "cause",
        "earthquake",
        "devlin",
        "viii",
        "stating",
        "one",
        "notionally",
        "pick",
        "twelve",
        "men",
        "woman",
        "random",
        "appeared",
        "think",
        "sample",
        "population",
        "adequate",
        "pointer",
        "appropriate",
        "morality",
        "stark",
        "contrast",
        "rawls",
        "taking",
        "random",
        "sample",
        "population",
        "underemphasise",
        "moral",
        "disagreement",
        "rawls",
        "would",
        "see",
        "reasonable",
        "think",
        "moral",
        "disagreement",
        "disappear",
        "medium",
        "even",
        "longterm",
        "much",
        "disagreement",
        "simply",
        "blamed",
        "bloodymindedness",
        "biased",
        "favour",
        "family",
        "group",
        "disagreement",
        "based",
        "rather",
        "difference",
        "evidence",
        "appropriate",
        "much",
        "weight",
        "given",
        "evidence",
        "agreed",
        "upon",
        "priority",
        "choice",
        "made",
        "among",
        "vast",
        "range",
        "possible",
        "value",
        "rawls",
        "describes",
        "factor",
        "burden",
        "judgment",
        "rawls",
        "hence",
        "rawls",
        "idealizes",
        "constituency",
        "legal",
        "coercion",
        "must",
        "justified",
        "inter",
        "alia",
        "person",
        "accept",
        "burden",
        "judgement",
        "resulting",
        "fact",
        "reasonable",
        "pluralism",
        "idealization",
        "involved",
        "public",
        "reason",
        "approach",
        "controversial",
        "scepticism",
        "quarter",
        "really",
        "genuine",
        "middle",
        "way",
        "actual",
        "including",
        "implied",
        "agreement",
        "rational",
        "justification",
        "raz",
        "many",
        "constraint",
        "built",
        "idea",
        "justificationto",
        "given",
        "constituency",
        "disappears",
        "leading",
        "natural",
        "law",
        "theorist",
        "john",
        "finnis",
        "writes",
        "natural",
        "law",
        "theory",
        "nothing",
        "account",
        "reasonsforaction",
        "people",
        "ought",
        "able",
        "accept",
        "precisely",
        "good",
        "valid",
        "sound",
        "reason",
        "finnis",
        "natural",
        "law",
        "theory",
        "paradigm",
        "comprehensive",
        "doctrine",
        "however",
        "precisely",
        "avoided",
        "rawls",
        "view",
        "justificationto",
        "end",
        "meaning",
        "giving",
        "good",
        "reason",
        "certain",
        "constituency",
        "idea",
        "evaporated",
        "another",
        "contrast",
        "devlin",
        "member",
        "jury",
        "rawlsian",
        "public",
        "reason",
        "simply",
        "matter",
        "getting",
        "sample",
        "people",
        "notional",
        "room",
        "waiting",
        "agree",
        "however",
        "done",
        "public",
        "reason",
        "substantive",
        "framework",
        "shared",
        "everyone",
        "module",
        "complete",
        "political",
        "conception",
        "whose",
        "principle",
        "ideal",
        "elaborated",
        "whose",
        "argument",
        "deployed",
        "legal",
        "argument",
        "rawls",
        "content",
        "word",
        "given",
        "family",
        "reasonable",
        "conception",
        "justice",
        "rawls",
        "noted",
        "natural",
        "law",
        "roman",
        "catholic",
        "world",
        "view",
        "adopted",
        "public",
        "reason",
        "conception",
        "common",
        "good",
        "solidarity",
        "expressed",
        "term",
        "political",
        "value",
        "one",
        "grounding",
        "political",
        "conception",
        "give",
        "content",
        "public",
        "reason",
        "rawls",
        "interesting",
        "exploration",
        "relationship",
        "religious",
        "comprehensive",
        "doctrine",
        "public",
        "reason",
        "see",
        "eg",
        "anna",
        "im",
        "billingham",
        "two",
        "kind",
        "issue",
        "special",
        "concern",
        "question",
        "limit",
        "law",
        "concern",
        "first",
        "scope",
        "public",
        "reason",
        "secondly",
        "capacity",
        "account",
        "convincingly",
        "certain",
        "apparently",
        "easy",
        "case",
        "legitimate",
        "legal",
        "coercion",
        "first",
        "rawls",
        "restricts",
        "public",
        "reason",
        "constitutional",
        "essential",
        "matter",
        "basic",
        "justice",
        "rawls",
        "convincing",
        "thus",
        "limit",
        "public",
        "reason",
        "eye",
        "rawls",
        "permissive",
        "important",
        "matter",
        "nonbasic",
        "justice",
        "fairness",
        "beyond",
        "constitutional",
        "essential",
        "basic",
        "aspect",
        "justice",
        "jonathan",
        "quong",
        "example",
        "object",
        "rawls",
        "openness",
        "perfectionist",
        "value",
        "far",
        "large",
        "resource",
        "grand",
        "project",
        "art",
        "science",
        "concerned",
        "quong",
        "stantonife",
        "secondly",
        "well",
        "public",
        "reason",
        "view",
        "handle",
        "certain",
        "obviously",
        "legitimate",
        "us",
        "legal",
        "coercion",
        "criminalization",
        "murder",
        "rape",
        "doubt",
        "rawlsian",
        "public",
        "reason",
        "module",
        "duly",
        "developed",
        "would",
        "straightforwardly",
        "deliver",
        "bare",
        "bone",
        "coercive",
        "law",
        "murder",
        "rape",
        "done",
        "fully",
        "satisfactorily",
        "without",
        "sort",
        "recourse",
        "comprehensive",
        "moral",
        "metaphysical",
        "doctrine",
        "rawls",
        "wish",
        "rule",
        "take",
        "murder",
        "example",
        "standardly",
        "murder",
        "requires",
        "proof",
        "least",
        "causation",
        "death",
        "intention",
        "kill",
        "penalty",
        "among",
        "severest",
        "stretching",
        "various",
        "jurisdiction",
        "mandatory",
        "life",
        "imprisonment",
        "capital",
        "punishment",
        "death",
        "causation",
        "death",
        "understood",
        "common",
        "understand",
        "term",
        "cessation",
        "brain",
        "stem",
        "functioning",
        "understanding",
        "putative",
        "victim",
        "may",
        "irrevocably",
        "lost",
        "capacity",
        "consciousness",
        "brain",
        "stem",
        "continues",
        "function",
        "wrong",
        "murder",
        "truly",
        "captured",
        "brain",
        "stem",
        "cease",
        "functioning",
        "possibly",
        "irrevocable",
        "loss",
        "capacity",
        "consciousness",
        "persson",
        "de",
        "grazia",
        "one",
        "might",
        "say",
        "latter",
        "explains",
        "horrific",
        "murder",
        "someone",
        "intentionally",
        "brings",
        "permanent",
        "cessation",
        "brain",
        "stem",
        "functioning",
        "another",
        "thought",
        "murderer",
        "argument",
        "go",
        "capacity",
        "consciousness",
        "victim",
        "already",
        "known",
        "irrevocably",
        "lost",
        "perhaps",
        "conduct",
        "ought",
        "still",
        "criminal",
        "labelled",
        "murder",
        "meriting",
        "mandatory",
        "life",
        "sentence",
        "point",
        "present",
        "purpose",
        "settle",
        "question",
        "best",
        "understanding",
        "murder",
        "whether",
        "imaginary",
        "case",
        "count",
        "murder",
        "suggest",
        "issue",
        "likely",
        "turn",
        "implicitly",
        "explicitly",
        "comprehensive",
        "moral",
        "metaphysical",
        "understanding",
        "public",
        "reason",
        "insufficientor",
        "challenge",
        "would",
        "run",
        "tadros",
        "somewhat",
        "relatedly",
        "rawls",
        "account",
        "abortionhe",
        "argues",
        "duly",
        "qualified",
        "right",
        "part",
        "woman",
        "decide",
        "whether",
        "end",
        "pregnancy",
        "first",
        "trimester",
        "rawls",
        "whether",
        "rawls",
        "entitled",
        "conclusion",
        "basis",
        "public",
        "reason",
        "hotly",
        "contested",
        "see",
        "varying",
        "perspective",
        "george",
        "j",
        "williams",
        "kramer",
        "laborde",
        "chamber",
        "arrell"
    ]
}