{
    "main_text": "Vagueness in language and in law\n5. Vagueness in language and in law\n\nA speed limit on a highway is a fairly precise law: in most cases it\nis clear whether a driver has conformed to the standard. But highway\ntraffic regulation also needs (and typically uses) rules against\ncareless or dangerous driving. Such abstract standards are designed to\ncontrol a variety of behaviour that is too diverse for the legislative\npurpose to be attained by reference to any uniform, measurable\ncriterion that would allow the precision of a speed limit.\n\nVague laws, such as a rule against careless driving, pose problems for\nphilosophy of law that are related to problems that philosophers of\nlanguage and of logic have addressed in arguments about the\nparadox of the heap (see the entry on the\n Sorites paradox).\n Suppose that, according to law, it counts as careless driving to\ndrive with bald tires. If the law gives a precise definition of the\nthickness of tire tread that counts as bald, then in this regard the\nlaw is (more or less) precise, and for the purposes of the law,\nvirtually every tire is either clearly bald or clearly not bald. But\nif there is no such precise standard, then there are ‘borderline\ncases’ in which it is neither clearly true that a tire is bald,\nnor clearly false. And we can construct a sorites series and a sorites\nparadox for the application of the law:\n\nA new tire is not\n bald.[5]\nIf a tire is not bald, it does not become bald by losing one\nmolecule of rubber from its tread.\nSo a tire that has lost one molecule of rubber is not bald.\nReiterate 2.\nSo a tire that has lost two molecules of rubber is not bald.\nReiterate 2.\n\n\n\n…\n\nN. So a tire never goes bald.\n\nN+1. So no one can ever break the rule against careless driving by\ndriving with bald tires.\n\n\nThe false conclusions N and N+1 arise by apparently valid reasoning\nfrom apparently true premises. Philosophical approaches to the paradox\nseem to have implications for legal theory: arguments that vague terms\nare incoherent, and that reasoning with them is impossible,\nwould support arguments that vague laws are incoherent. Since vague\nlaws are an important part of every legal system (Endicott 2001), the\nimplications seem to be far-reaching.\n\n‘Epistemic’ arguments that the only way to solve\nthe paradox is to deny the truth of step 2 (so that vagueness is a\nproblem of ignorance as to where the sharp boundary is between tires\nthat are and are not bald) imply that there is always a single right\nanswer to the application of a law stated in vague language. Arguments\nthat the application of a vague expression is indeterminate in\nborderline cases (or in some borderline cases) imply that the\napplication of a law that can be expressed in vague language is\nindeterminate in some cases. But it is even controversial whether such\ntheories matter to legal philosophy (Schiffer 2001 and 2021,\nGreenawalt 2001).\n\nPhilosophers of law have not been especially concerned with the\nquestion of how to solve (or to resolve) the paradox, but they have\ndebated the nature of borderline cases, and its implications for the\nrole of judges in a community, and for the possibility of the rule of\nlaw. If the application of vague laws is indeterminate in some cases,\nthen in those cases a judge (or other official) responsible for\napplying the law cannot decide the matter by applying the law, since\nthe law does not determine the matter (and in fact, no one can use the\nlaw to guide their conduct).\n\nSome legal philosophers have responded to this problem by claiming\nthat judges never (or virtually never) have such a choice, and that\nthere is virtually always a right answer to a question of legal rights\n(Dworkin, 1986a, 1991). Others have responded to the problem by\nclaiming that the law gives judges discretion, in all or some\nborderline cases, to decide issues that the law does not determine\n(Hart, 2012, chapter VII.1). That is, the standards of the system\nleave a choice to judges as to how to decide the issue. Then judges\nmust treat the parties to litigation as having liabilities or\nobligations or entitlements that were not determinately theirs at the\ntime when the dispute arose. That power of judges appears to some to\nrun contrary to a requirement of the rule of law: that laws (or at\nleast, that legal burdens) should not be imposed retroactively.\n\nAs a result, vagueness raises an extraordinarily important set of\nproblems for the philosophy of law. It may seem to be a different set\nof problems from those raised by vague language in general, because of\nthree ways in which the legal use of vague language is distinctive.\nFirst, legal systems need to provide for authoritative resolution of\ndisputes as to the effect of the use of vague language (where in some\nother domains of the use of language, we can get by without any such\nresolution).\n\nSecondly, vagueness in legal language is distinctive because lawmakers\navoid ordinary vague expressions like ‘driving very fast’\nand prefer precise speed limits (or blood alcohol limits...). When the\nlaw uses vague language, it uses abstract evaluative\nexpressions. Lawmakers typically do not prohibit driving with\n‘bald’ tires; they either impose precise measures (such as\ntire tread measurements), or address the problem as part of an\nabstract, general prohibition on, e.g., ‘careless’\ndriving. An abstract standard calls upon its subjects to construct a\nview of the care that, in their law, a driver owes to another\nperson—(and not merely to ask the seemingly pointless question,\nhow bald is a bald tire?). Abstract standards are a very common and a\nvery important part of lawmaking technique. A negligence standard may\nrequire ‘reasonable care’; a constitution may define a\nprocedural right as a right to ‘due process’, or a\ncontract may require the delivery of goods in ‘satisfactory\ncondition’. Those abstract terms are very different from the\nvague descriptive terms that philosophers of logic use to illustrate\ntheir arguments about the sorites paradox (‘heap’,\n‘thin’, ‘bald’, ‘red’…). It\nmisses the point, you might think, to say that abstract standards do\nnot draw sharp lines, because they are not designed to draw lines at\nall. By using an abstract standard, the lawmaker requires the people\nwho must apply the law to construct a theory of the standard (of care,\nor of process, or of condition), which will draw any line that is\nneeded. Ronald Dworkin has claimed that abstract expressions are not\nvague at all—that they have a different semantics from that of\nvague words like ‘heap’ (Dworkin, 1986b, 17).\n\nThirdly, the legal context of an expression may be very different from\nother contexts of its use. Principles of legal interpretation (for\nexample, a legal requirement that vague criminal enactments are to be\ninterpreted as applying only in clear cases) may make the legal effect\nof the use of a word more precise than its ordinary effect. The\ninterpretation of a legal prohibition on careless driving demands an\nunderstanding of what counts as careless for the purposes of the\nlaw. The effect of a vague legal prohibition may be governed by\nprecedents that rule out decisions that would otherwise be a\nreasonable application of the vague language. Even apart from the\nregulatory role of precedent, a good advocate or judge may have a\nrelatively clear sense of the accepted practice in applying the\nprohibition, and the practice may well involve not treating certain\nforms of conduct as careless, when it would be fair enough, apart from\nthat practice, to call them careless.\n\nGiven these distinctive features of law, it may seem that\nlogicians’ discussions of heaps and baldness are beside the\npoint, and that legal reasoning is exempt from any implications that\nthe paradox may have for logic or for semantics. And because of the\ncontext dependence of the use of language in law (see section 2.2),\nsome have argued that indeterminacies in law are not significantly\nrelated to the susceptibility of statements of law to sorites\nreasoning (Lanius 2019, Chapter 3). Yet statements of law that use\nabstract expressions, and use them to different effect in different\ncontexts, certainly are vague in the philosophers’ sense: that\nis, they appear to be susceptible to sorites reasoning.\n‘Careless driving’ in its legal sense is a much more\ncomplex concept than ‘driving with bald tires’, and\ndriving with bald tires is an instance of careless driving only in\nvirtue of the evaluative and contextual considerations that must be\nunderstood if the law of careless driving is to be understood. Yet\n‘careless driving’ is susceptible to sorites reasoning:\ne.g., those evaluative and contextual considerations give reason to\nconclude that it is careless to drive with bald tires. For all their\ncomplexity (and their relation to deep questions of the rights of the\ncitizen and the responsibilities and the liabilities that a community\ncan justifiably impose on the citizen), those considerations do not\ndetermine a standard that is more precise than a standard\nthat could be expressed using such an ordinary vague expression as\n‘bald’. That is, those considerations do not provide a way\nof distinguishing between one tire in the sorites series and the next.\nSimilarly, it is obviously possible to construct sorites series for\nthe application of even more abstract legal standards such as the\nright to due process, or the United States constitutional prohibition\non cruel and unusual punishment. These evaluative tests have special\nlegal meanings that can only be understood in the context of a legal\nsystem, and in the more particular context of a specific area of law,\nand by reference to their elaboration and development in a common law\nsystem of precedent. Even with a mastery of all those aspects of the\ncontext, however, the best theory of the effect of such standards will\nnot provide a way of distinguishing between one tire in the sorites\nseries and the next. A theory of careless driving in some particular\nlegal system at a particular time would be a defective theory, if it\nyielded the conclusion that the loss of one molecule of rubber from a\ntire can make the difference between driving that is careless and\ndriving that is not careless according to law.\n\nConsider again the case of Garner v Burr (above, section\n2.2). The term ‘vehicle’, as properly understood for the\npurposes of the Road Traffic Act, is vague if there are borderline\ncases for its application (cases in which it is unclear whether the\nterm applies to some object). It may seem that nothing is more\npatently a borderline case of a ‘vehicle’ than a chicken\ncoop on wheels. But we should bear in mind that (if the discussion in\nsection 2.2 above is sound) the correct application of the term\ndepends on legal principles relating to the purposes of the\nlegislation and to the need for clarity in criminal liabilities. So\nthe chicken coop on wheels is a borderline case if it is unclear\nwhether those principles required the provision to be applied to it.\nAnd the application of the term was indeterminate in the case, if\nthose principles did not require a decision one way or the other. Of\ncourse, the appeal court held that a conviction was\nrequired—which we might say amounts to a decision that the term\napplied to the chicken coop on wheels. The magistrates and the appeal\ncourt disagreed about it, but that disagreement in itself does not\nmean either that the application of the term was determinate or that\nit was indeterminate. And the fact that the appeal judges seem to have\nthought that the term clearly applied to the chicken coop cannot tell\nus that the application of the term was determinate.\n\nThe magistrates’ approach put a special emphasis on the\nprinciple of certainty in criminal liability, and the appeal\ncourt’s approach put a special emphasis on the effective\naccomplishment of the purpose the legislation was designed to pursue.\nEach approach would take the law in a different direction. The\napplication of the term was indeterminate (before the decision of the\nappeal court set a precedent) if neither approach was demanded by the\ncomplex resources of legal reasoning that the courts (as a matter of\nlegal obligation) had to act upon. If that was the case, then the\nappeal court’s decision was not contrary to the law. But a\ndecision upholding the acquittal would not have been contrary to the\nlaw, either. The law as it was at the time of the decision allowed the\ncourts to move it in either direction.\n\nThat account of a case like Garner v Burr would support the\ncontroversial claim that judges have widespread discretion in\nresolving legal disputes. Legal philosophers have debated whether that\nclaim undermines the ideal of the rule of law, or reflects a basic\nrequirement of the rule of law: that a legal system needs techniques\nfor the resolution of legal issues that are not determined by the law\n(see Endicott 2000, chapter 9, and on the value of vagueness in law\nsee Asgeirsson 2020; on a variety of issues concerning vagueness and\nphilosophy of law, see the essays in Keil and Poscher 2016).\n",
    "section_title": "5. Vagueness in language and in law",
    "entry_title": "Law and Language",
    "hierarchy_title": "Law and Language || Vagueness in language and in law",
    "tokenized_text": [
        "vagueness",
        "language",
        "law",
        "vagueness",
        "language",
        "law",
        "speed",
        "limit",
        "highway",
        "fairly",
        "precise",
        "law",
        "case",
        "clear",
        "whether",
        "driver",
        "conformed",
        "standard",
        "highway",
        "traffic",
        "regulation",
        "also",
        "need",
        "typically",
        "us",
        "rule",
        "careless",
        "dangerous",
        "driving",
        "abstract",
        "standard",
        "designed",
        "control",
        "variety",
        "behaviour",
        "diverse",
        "legislative",
        "purpose",
        "attained",
        "reference",
        "uniform",
        "measurable",
        "criterion",
        "would",
        "allow",
        "precision",
        "speed",
        "limit",
        "vague",
        "law",
        "rule",
        "careless",
        "driving",
        "pose",
        "problem",
        "philosophy",
        "law",
        "related",
        "problem",
        "philosopher",
        "language",
        "logic",
        "addressed",
        "argument",
        "paradox",
        "heap",
        "see",
        "entry",
        "sorites",
        "paradox",
        "suppose",
        "according",
        "law",
        "count",
        "careless",
        "driving",
        "drive",
        "bald",
        "tire",
        "law",
        "give",
        "precise",
        "definition",
        "thickness",
        "tire",
        "tread",
        "count",
        "bald",
        "regard",
        "law",
        "le",
        "precise",
        "purpose",
        "law",
        "virtually",
        "every",
        "tire",
        "either",
        "clearly",
        "bald",
        "clearly",
        "bald",
        "precise",
        "standard",
        "borderline",
        "case",
        "neither",
        "clearly",
        "true",
        "tire",
        "bald",
        "clearly",
        "false",
        "construct",
        "sorites",
        "series",
        "sorites",
        "paradox",
        "application",
        "law",
        "new",
        "tire",
        "bald",
        "tire",
        "bald",
        "become",
        "bald",
        "losing",
        "one",
        "molecule",
        "rubber",
        "tread",
        "tire",
        "lost",
        "one",
        "molecule",
        "rubber",
        "bald",
        "reiterate",
        "tire",
        "lost",
        "two",
        "molecule",
        "rubber",
        "bald",
        "reiterate",
        "n",
        "tire",
        "never",
        "go",
        "bald",
        "n",
        "one",
        "ever",
        "break",
        "rule",
        "careless",
        "driving",
        "driving",
        "bald",
        "tire",
        "false",
        "conclusion",
        "n",
        "n",
        "arise",
        "apparently",
        "valid",
        "reasoning",
        "apparently",
        "true",
        "premise",
        "philosophical",
        "approach",
        "paradox",
        "seem",
        "implication",
        "legal",
        "theory",
        "argument",
        "vague",
        "term",
        "incoherent",
        "reasoning",
        "impossible",
        "would",
        "support",
        "argument",
        "vague",
        "law",
        "incoherent",
        "since",
        "vague",
        "law",
        "important",
        "part",
        "every",
        "legal",
        "system",
        "endicott",
        "implication",
        "seem",
        "farreaching",
        "epistemic",
        "argument",
        "way",
        "solve",
        "paradox",
        "deny",
        "truth",
        "step",
        "vagueness",
        "problem",
        "ignorance",
        "sharp",
        "boundary",
        "tire",
        "bald",
        "imply",
        "always",
        "single",
        "right",
        "answer",
        "application",
        "law",
        "stated",
        "vague",
        "language",
        "argument",
        "application",
        "vague",
        "expression",
        "indeterminate",
        "borderline",
        "case",
        "borderline",
        "case",
        "imply",
        "application",
        "law",
        "expressed",
        "vague",
        "language",
        "indeterminate",
        "case",
        "even",
        "controversial",
        "whether",
        "theory",
        "matter",
        "legal",
        "philosophy",
        "schiffer",
        "greenawalt",
        "philosopher",
        "law",
        "especially",
        "concerned",
        "question",
        "solve",
        "resolve",
        "paradox",
        "debated",
        "nature",
        "borderline",
        "case",
        "implication",
        "role",
        "judge",
        "community",
        "possibility",
        "rule",
        "law",
        "application",
        "vague",
        "law",
        "indeterminate",
        "case",
        "case",
        "judge",
        "official",
        "responsible",
        "applying",
        "law",
        "decide",
        "matter",
        "applying",
        "law",
        "since",
        "law",
        "determine",
        "matter",
        "fact",
        "one",
        "use",
        "law",
        "guide",
        "conduct",
        "legal",
        "philosopher",
        "responded",
        "problem",
        "claiming",
        "judge",
        "never",
        "virtually",
        "never",
        "choice",
        "virtually",
        "always",
        "right",
        "answer",
        "question",
        "legal",
        "right",
        "dworkin",
        "a",
        "others",
        "responded",
        "problem",
        "claiming",
        "law",
        "give",
        "judge",
        "discretion",
        "borderline",
        "case",
        "decide",
        "issue",
        "law",
        "determine",
        "hart",
        "chapter",
        "vii",
        "standard",
        "system",
        "leave",
        "choice",
        "judge",
        "decide",
        "issue",
        "judge",
        "must",
        "treat",
        "party",
        "litigation",
        "liability",
        "obligation",
        "entitlement",
        "determinately",
        "time",
        "dispute",
        "arose",
        "power",
        "judge",
        "appears",
        "run",
        "contrary",
        "requirement",
        "rule",
        "law",
        "law",
        "least",
        "legal",
        "burden",
        "imposed",
        "retroactively",
        "result",
        "vagueness",
        "raise",
        "extraordinarily",
        "important",
        "set",
        "problem",
        "philosophy",
        "law",
        "may",
        "seem",
        "different",
        "set",
        "problem",
        "raised",
        "vague",
        "language",
        "general",
        "three",
        "way",
        "legal",
        "use",
        "vague",
        "language",
        "distinctive",
        "first",
        "legal",
        "system",
        "need",
        "provide",
        "authoritative",
        "resolution",
        "dispute",
        "effect",
        "use",
        "vague",
        "language",
        "domain",
        "use",
        "language",
        "get",
        "without",
        "resolution",
        "secondly",
        "vagueness",
        "legal",
        "language",
        "distinctive",
        "lawmaker",
        "avoid",
        "ordinary",
        "vague",
        "expression",
        "like",
        "driving",
        "fast",
        "prefer",
        "precise",
        "speed",
        "limit",
        "blood",
        "alcohol",
        "limit",
        "law",
        "us",
        "vague",
        "language",
        "us",
        "abstract",
        "evaluative",
        "expression",
        "lawmaker",
        "typically",
        "prohibit",
        "driving",
        "bald",
        "tire",
        "either",
        "impose",
        "precise",
        "measure",
        "tire",
        "tread",
        "measurement",
        "address",
        "problem",
        "part",
        "abstract",
        "general",
        "prohibition",
        "eg",
        "careless",
        "driving",
        "abstract",
        "standard",
        "call",
        "upon",
        "subject",
        "construct",
        "view",
        "care",
        "law",
        "driver",
        "owes",
        "another",
        "person",
        "merely",
        "ask",
        "seemingly",
        "pointless",
        "question",
        "bald",
        "bald",
        "tire",
        "abstract",
        "standard",
        "common",
        "important",
        "part",
        "lawmaking",
        "technique",
        "negligence",
        "standard",
        "may",
        "require",
        "reasonable",
        "care",
        "constitution",
        "may",
        "define",
        "procedural",
        "right",
        "right",
        "due",
        "process",
        "contract",
        "may",
        "require",
        "delivery",
        "good",
        "satisfactory",
        "condition",
        "abstract",
        "term",
        "different",
        "vague",
        "descriptive",
        "term",
        "philosopher",
        "logic",
        "use",
        "illustrate",
        "argument",
        "sorites",
        "paradox",
        "heap",
        "thin",
        "bald",
        "red",
        "miss",
        "point",
        "might",
        "think",
        "say",
        "abstract",
        "standard",
        "draw",
        "sharp",
        "line",
        "designed",
        "draw",
        "line",
        "using",
        "abstract",
        "standard",
        "lawmaker",
        "requires",
        "people",
        "must",
        "apply",
        "law",
        "construct",
        "theory",
        "standard",
        "care",
        "process",
        "condition",
        "draw",
        "line",
        "needed",
        "ronald",
        "dworkin",
        "claimed",
        "abstract",
        "expression",
        "vague",
        "allthat",
        "different",
        "semantics",
        "vague",
        "word",
        "like",
        "heap",
        "dworkin",
        "b",
        "thirdly",
        "legal",
        "context",
        "expression",
        "may",
        "different",
        "context",
        "use",
        "principle",
        "legal",
        "interpretation",
        "example",
        "legal",
        "requirement",
        "vague",
        "criminal",
        "enactment",
        "interpreted",
        "applying",
        "clear",
        "case",
        "may",
        "make",
        "legal",
        "effect",
        "use",
        "word",
        "precise",
        "ordinary",
        "effect",
        "interpretation",
        "legal",
        "prohibition",
        "careless",
        "driving",
        "demand",
        "understanding",
        "count",
        "careless",
        "purpose",
        "law",
        "effect",
        "vague",
        "legal",
        "prohibition",
        "may",
        "governed",
        "precedent",
        "rule",
        "decision",
        "would",
        "otherwise",
        "reasonable",
        "application",
        "vague",
        "language",
        "even",
        "apart",
        "regulatory",
        "role",
        "precedent",
        "good",
        "advocate",
        "judge",
        "may",
        "relatively",
        "clear",
        "sense",
        "accepted",
        "practice",
        "applying",
        "prohibition",
        "practice",
        "may",
        "well",
        "involve",
        "treating",
        "certain",
        "form",
        "conduct",
        "careless",
        "would",
        "fair",
        "enough",
        "apart",
        "practice",
        "call",
        "careless",
        "given",
        "distinctive",
        "feature",
        "law",
        "may",
        "seem",
        "logician",
        "discussion",
        "heap",
        "baldness",
        "beside",
        "point",
        "legal",
        "reasoning",
        "exempt",
        "implication",
        "paradox",
        "may",
        "logic",
        "semantics",
        "context",
        "dependence",
        "use",
        "language",
        "law",
        "see",
        "section",
        "argued",
        "indeterminacy",
        "law",
        "significantly",
        "related",
        "susceptibility",
        "statement",
        "law",
        "sorites",
        "reasoning",
        "lanius",
        "chapter",
        "yet",
        "statement",
        "law",
        "use",
        "abstract",
        "expression",
        "use",
        "different",
        "effect",
        "different",
        "context",
        "certainly",
        "vague",
        "philosopher",
        "sense",
        "appear",
        "susceptible",
        "sorites",
        "reasoning",
        "careless",
        "driving",
        "legal",
        "sense",
        "much",
        "complex",
        "concept",
        "driving",
        "bald",
        "tire",
        "driving",
        "bald",
        "tire",
        "instance",
        "careless",
        "driving",
        "virtue",
        "evaluative",
        "contextual",
        "consideration",
        "must",
        "understood",
        "law",
        "careless",
        "driving",
        "understood",
        "yet",
        "careless",
        "driving",
        "susceptible",
        "sorites",
        "reasoning",
        "eg",
        "evaluative",
        "contextual",
        "consideration",
        "give",
        "reason",
        "conclude",
        "careless",
        "drive",
        "bald",
        "tire",
        "complexity",
        "relation",
        "deep",
        "question",
        "right",
        "citizen",
        "responsibility",
        "liability",
        "community",
        "justifiably",
        "impose",
        "citizen",
        "consideration",
        "determine",
        "standard",
        "precise",
        "standard",
        "could",
        "expressed",
        "using",
        "ordinary",
        "vague",
        "expression",
        "bald",
        "consideration",
        "provide",
        "way",
        "distinguishing",
        "one",
        "tire",
        "sorites",
        "series",
        "next",
        "similarly",
        "obviously",
        "possible",
        "construct",
        "sorites",
        "series",
        "application",
        "even",
        "abstract",
        "legal",
        "standard",
        "right",
        "due",
        "process",
        "united",
        "state",
        "constitutional",
        "prohibition",
        "cruel",
        "unusual",
        "punishment",
        "evaluative",
        "test",
        "special",
        "legal",
        "meaning",
        "understood",
        "context",
        "legal",
        "system",
        "particular",
        "context",
        "specific",
        "area",
        "law",
        "reference",
        "elaboration",
        "development",
        "common",
        "law",
        "system",
        "precedent",
        "even",
        "mastery",
        "aspect",
        "context",
        "however",
        "best",
        "theory",
        "effect",
        "standard",
        "provide",
        "way",
        "distinguishing",
        "one",
        "tire",
        "sorites",
        "series",
        "next",
        "theory",
        "careless",
        "driving",
        "particular",
        "legal",
        "system",
        "particular",
        "time",
        "would",
        "defective",
        "theory",
        "yielded",
        "conclusion",
        "loss",
        "one",
        "molecule",
        "rubber",
        "tire",
        "make",
        "difference",
        "driving",
        "careless",
        "driving",
        "careless",
        "according",
        "law",
        "consider",
        "case",
        "garner",
        "v",
        "burr",
        "section",
        "term",
        "vehicle",
        "properly",
        "understood",
        "purpose",
        "road",
        "traffic",
        "act",
        "vague",
        "borderline",
        "case",
        "application",
        "case",
        "unclear",
        "whether",
        "term",
        "applies",
        "object",
        "may",
        "seem",
        "nothing",
        "patently",
        "borderline",
        "case",
        "vehicle",
        "chicken",
        "coop",
        "wheel",
        "bear",
        "mind",
        "discussion",
        "section",
        "sound",
        "correct",
        "application",
        "term",
        "depends",
        "legal",
        "principle",
        "relating",
        "purpose",
        "legislation",
        "need",
        "clarity",
        "criminal",
        "liability",
        "chicken",
        "coop",
        "wheel",
        "borderline",
        "case",
        "unclear",
        "whether",
        "principle",
        "required",
        "provision",
        "applied",
        "application",
        "term",
        "indeterminate",
        "case",
        "principle",
        "require",
        "decision",
        "one",
        "way",
        "course",
        "appeal",
        "court",
        "held",
        "conviction",
        "requiredwhich",
        "might",
        "say",
        "amount",
        "decision",
        "term",
        "applied",
        "chicken",
        "coop",
        "wheel",
        "magistrate",
        "appeal",
        "court",
        "disagreed",
        "disagreement",
        "mean",
        "either",
        "application",
        "term",
        "determinate",
        "indeterminate",
        "fact",
        "appeal",
        "judge",
        "seem",
        "thought",
        "term",
        "clearly",
        "applied",
        "chicken",
        "coop",
        "tell",
        "u",
        "application",
        "term",
        "determinate",
        "magistrate",
        "approach",
        "put",
        "special",
        "emphasis",
        "principle",
        "certainty",
        "criminal",
        "liability",
        "appeal",
        "court",
        "approach",
        "put",
        "special",
        "emphasis",
        "effective",
        "accomplishment",
        "purpose",
        "legislation",
        "designed",
        "pursue",
        "approach",
        "would",
        "take",
        "law",
        "different",
        "direction",
        "application",
        "term",
        "indeterminate",
        "decision",
        "appeal",
        "court",
        "set",
        "precedent",
        "neither",
        "approach",
        "demanded",
        "complex",
        "resource",
        "legal",
        "reasoning",
        "court",
        "matter",
        "legal",
        "obligation",
        "act",
        "upon",
        "case",
        "appeal",
        "court",
        "decision",
        "contrary",
        "law",
        "decision",
        "upholding",
        "acquittal",
        "would",
        "contrary",
        "law",
        "either",
        "law",
        "time",
        "decision",
        "allowed",
        "court",
        "move",
        "either",
        "direction",
        "account",
        "case",
        "like",
        "garner",
        "v",
        "burr",
        "would",
        "support",
        "controversial",
        "claim",
        "judge",
        "widespread",
        "discretion",
        "resolving",
        "legal",
        "dispute",
        "legal",
        "philosopher",
        "debated",
        "whether",
        "claim",
        "undermines",
        "ideal",
        "rule",
        "law",
        "reflects",
        "basic",
        "requirement",
        "rule",
        "law",
        "legal",
        "system",
        "need",
        "technique",
        "resolution",
        "legal",
        "issue",
        "determined",
        "law",
        "see",
        "endicott",
        "chapter",
        "value",
        "vagueness",
        "law",
        "see",
        "asgeirsson",
        "variety",
        "issue",
        "concerning",
        "vagueness",
        "philosophy",
        "law",
        "see",
        "essay",
        "keil",
        "poscher"
    ]
}