{
    "main_text": "Relativism and Reduction\n2. Relativism and Reduction\n\n\nCommon wisdom has it that Kelsen’s argument for the\npresupposition of the basic norm takes the form of a Kantian\ntranscendental argument. The structure is as follows:\n\nP is possible only if Q\nP is possible (or, possibly P)\nTherefore, Q.\n\n\n\nIn Kelsen’s argument, P stands for the fact that legal\nnorms are “ought” statements , and Q is the\npresupposition of the basic norm. In other words, the necessary\npresupposition of the basic norm is derived from the possibility\nconditions for ascribing legal significance to actions and events. In\norder to interpret an action as one of creating or modifying the law,\nit is necessary to show that the relevant legal significance of the\nact/event is conferred on it by some other legal norm. At some point,\nas we have noted, we necessarily run out of legal norms that confer\nthe relevant validity on law creating acts, and at that point the\nlegal validity has to be presupposed. The content of this\npresupposition is the basic norm.\n\n\n It would be a\nmistake, however, to look for an explanation of Kelsen’s argument\nin the logic of Kant’s transcendental argument. (Kelsen himself\nseems to have changed his views about this over the years; he may have\nstarted with a kind of neo-Kantian perspective one can discern in PT1,\nand gradually shifted to a Humean version of his main argument, which\nis quite evident in GT. However, this is a very controversial issue; for a different view, see Paulson 2013 and Green 2016.) Kant employed a transcendental argument\nto establish the necessary presuppositions of some categories and modes\nof perception that are essential for rational cognition, or so he\nthought. They form deep, universal, and necessary features of human\ncognition. Suffice it to recall that it was Hume’s skepticism\nabout knowledge that Kant strove to answer by his transcendental\nargument. Kelsen, however, remains much closer to Hume’s\nskeptical views than to Kant’s rationalism. In particular, Kelsen\nwas very skeptical of any objective grounding of morality, Kant’s\nmoral theory included. Kelsen’s view of morality was relativist\nall the way down. (More on this, below). Second, and not unrelated, as\nwe shall see, Kelsen has explicitly rejected the idea that the basic\nnorm (in law, or of any other normative domain) is something like a\nnecessary feature or category of human cognition. The presupposition of\na basic norm is optional. One does not have to accept the normativity\nof law; anarchism, as a rejection of law’s normative validity is\ncertainly an option, Kelsen maintained. The basic norm is presupposed\nonly by those who accept the “ought”, that is, the\nnormative validity, of the law. But one is not rationally compelled to\nhave this attitude:\n\n\nThe Pure Theory describes the positive law as an objectively\nvalid order and states that this interpretation is possible only under\nthe condition that a basic norm is presupposed…. The Pure\nTheory, thereby characterizes this interpretation as possible, not\nnecessary, and presents the objective validity of positive law only as\nconditional—namely conditioned by the presupposed basic\nnorm. (PT2, 217–218)\n\n\nA comparison to religion, that Kelsen himself offered, might be\nhelpful here. The normative structure of religion is very similar to\nthat of law. It has the same logic: religious beliefs about what one\nought to do ultimately derive from one’s beliefs about\nGod’s commands. God’s commands, however, would only have\nnormative validity for those who presuppose the basic norm of their\nrespective religion, namely, that one ought to obey God’s\ncommands. Thus the normativity of religion, like that of the law, rests\non the presupposition of its basic norm. But in both cases, as, in\nfact, with any other normative system, the presupposition of the basic\nnorm is logically required only of those who regard the relevant norms\nas reasons for their actions. Thus, whether you actually presuppose the\nrelevant basic norm is a matter of choice, it is an ideological option,\nas it were, not something that is dictated by Reason. Similarly, the\nnormativity of law, presupposed by its basic norm, is optional:\n“An anarchist, for instance, who denied the validity of the\nhypothetical basic norm of positive law…. will view its positive\nregulation of human relationships… as mere power\nrelations” (GT, 413).\n\n\n Relativism,\nhowever, comes with a price. Consider this question: What is the\ncontent of the basic norm that one needs to presuppose in order to\nrender positive law intelligible as a normative legal order? The simple\nanswer is that what one presupposes here is precisely the normative\nvalidity of positive law, namely, the law that is actually practiced by\na certain population. The validity of the basic norm, as we noted\nbriefly earlier, is conditional on its “efficacy”. The\ncontent of the basic norm of any given legal system is determined by\nthe actual practices that prevail in the relevant community. As Kelsen\nhimself repeatedly argued, a successful revolution brings about a\nradical change in the content of the basic norm. Suppose, for example,\nthat in a given legal system the basic norm is that the constitution\nenacted by Rex One is binding. At a certain point, a coup\nd’etat takes place and a republican government is\nsuccessfully installed. At this point, Kelsen admits, ‘one\npresupposes a new basic norm, no longer the basic norm delegating law\nmaking authority to the monarch, but a basic norm delegating authority\nto the revolutionary government’ (PT1, 59).\n\n\n Has Kelsen just\nviolated his own adherence to Hume’s injunction against deriving\n“ought” from an “is” here? One gets the clear\nimpression that Kelsen was aware of a serious difficulty in his\nposition. In both editions of the Pure Theory of Law, Kelsen toys with\nthe idea that perhaps changes in the basic norms of municipal legal\nsystems legally derive from the basic norm of public international law.\nIt is a basic principle of international law that state sovereignty is\ndetermined by actual control over a territory/population (PT1\n61–62, though in PT2, 214–215, the idea is presented with greater\nhesitation; notably, some commentators argue that Kelsen took the idea of a universal legal order much more seriously than suggested here—see Green 2016).  But this led Kelsen to the rather uncomfortable\nconclusion that there is only one basic norm in the entire world,\nnamely, the basic norm of public international law. Be this as it\nmay, the main worry lies elsewhere. The worry stems from the fact that\nit is very difficult, if not impossible, to maintain both a profound\nrelativist and an anti-reductionist position with respect to a given\nnormative domain. If you hold the view that the validity of a type of\nnorms is entirely relative to a certain vantage point—in other\nwords, if what is involved here is only the actual conduct,\nbeliefs/presuppositions and attitudes of people—it becomes\nvery difficult to detach the explanation of that normative validity\nfrom the facts that constitute the relevant point of view (namely, the\nfacts about people’s actions, beliefs, attitudes, etc). This is\nbasically what was meant earlier by the comment that Kelsen had no\noption but to admit that the validity of the basic norm is conditional\non its efficacy. The normative relativism which is inherent in\nKelsen’s conception forces him to ground the content of the basic\nnorm in the social facts that constitute its content, namely, the facts\nabout actions, beliefs, and attitudes actually entertained by the\npopulation in question. And this makes it very questionable that\nreductionism can be avoided. In fact, what Kelsen really offered us\nhere is an invitation to provide a reductive explanation of the concept\nof legal validity in terms of some set of social facts, the facts that\nconstitute the content of any given basic norm. (Which is precisely the\nkind of reduction H.L.A. Hart later offered in his account of the Rules\nof Recognition as social rules [see Hart 1961, at p. 105, where\nHart alludes to the difference between his conception of the rules of\nrecognition and Kelsen’s idea of the basic norm.])\n\n\n Kelsen’s\nproblem here is not due to the fact that he was a relativist with\nrespect to every normative system, like morality, religion etc.; it is\nnot the scope of his relativism that is relevant to the question of\nreduction. The problem stems from the fact that Kelsen was quite right\nabout the law. Legal validity is essentially relative to the social\nfacts that constitute the content of the basic norm in each and every\nlegal order. Notice that legal validity is always relative to a time\nand place. A law enacted by the California legislature only applies\nwithin the boundaries of the state of California, and it applies during\na certain period of time, after its enactment and until a time when it\nis modified or repealed. And we can see why: because legal validity is\ndetermined by the content of the basic norm that is actually followed\nin a given society. The laws in UK, for example, are different from\nthose in the US, because people (mostly judges and other officials)\nactually follow different rules, or basic norms, in Kelsen’s\nterminology, about what counts as law in their respective\njurisdictions. Once Kelsen admits, as he does, that the content of a\nbasic norm is fully determined by practice, it becomes very difficult\nto understand how the explication of legal validity he offers is\nnon-reductive.\n",
    "section_title": "2. Relativism and Reduction",
    "entry_title": "The Pure Theory of Law",
    "hierarchy_title": "The Pure Theory of Law || Relativism and Reduction",
    "tokenized_text": [
        "relativism",
        "reduction",
        "relativism",
        "reduction",
        "common",
        "wisdom",
        "kelsen",
        "argument",
        "presupposition",
        "basic",
        "norm",
        "take",
        "form",
        "kantian",
        "transcendental",
        "argument",
        "structure",
        "follows",
        "p",
        "possible",
        "q",
        "p",
        "possible",
        "possibly",
        "p",
        "therefore",
        "q",
        "kelsen",
        "argument",
        "p",
        "stand",
        "fact",
        "legal",
        "norm",
        "ought",
        "statement",
        "q",
        "presupposition",
        "basic",
        "norm",
        "word",
        "necessary",
        "presupposition",
        "basic",
        "norm",
        "derived",
        "possibility",
        "condition",
        "ascribing",
        "legal",
        "significance",
        "action",
        "event",
        "order",
        "interpret",
        "action",
        "one",
        "creating",
        "modifying",
        "law",
        "necessary",
        "show",
        "relevant",
        "legal",
        "significance",
        "actevent",
        "conferred",
        "legal",
        "norm",
        "point",
        "noted",
        "necessarily",
        "run",
        "legal",
        "norm",
        "confer",
        "relevant",
        "validity",
        "law",
        "creating",
        "act",
        "point",
        "legal",
        "validity",
        "presupposed",
        "content",
        "presupposition",
        "basic",
        "norm",
        "would",
        "mistake",
        "however",
        "look",
        "explanation",
        "kelsen",
        "argument",
        "logic",
        "kant",
        "transcendental",
        "argument",
        "kelsen",
        "seems",
        "changed",
        "view",
        "year",
        "may",
        "started",
        "kind",
        "neokantian",
        "perspective",
        "one",
        "discern",
        "pt",
        "gradually",
        "shifted",
        "humean",
        "version",
        "main",
        "argument",
        "quite",
        "evident",
        "gt",
        "however",
        "controversial",
        "issue",
        "different",
        "view",
        "see",
        "paulson",
        "green",
        "kant",
        "employed",
        "transcendental",
        "argument",
        "establish",
        "necessary",
        "presupposition",
        "category",
        "mode",
        "perception",
        "essential",
        "rational",
        "cognition",
        "thought",
        "form",
        "deep",
        "universal",
        "necessary",
        "feature",
        "human",
        "cognition",
        "suffice",
        "recall",
        "hume",
        "skepticism",
        "knowledge",
        "kant",
        "strove",
        "answer",
        "transcendental",
        "argument",
        "kelsen",
        "however",
        "remains",
        "much",
        "closer",
        "hume",
        "skeptical",
        "view",
        "kant",
        "rationalism",
        "particular",
        "kelsen",
        "skeptical",
        "objective",
        "grounding",
        "morality",
        "kant",
        "moral",
        "theory",
        "included",
        "kelsen",
        "view",
        "morality",
        "relativist",
        "way",
        "second",
        "unrelated",
        "shall",
        "see",
        "kelsen",
        "explicitly",
        "rejected",
        "idea",
        "basic",
        "norm",
        "law",
        "normative",
        "domain",
        "something",
        "like",
        "necessary",
        "feature",
        "category",
        "human",
        "cognition",
        "presupposition",
        "basic",
        "norm",
        "optional",
        "one",
        "accept",
        "normativity",
        "law",
        "anarchism",
        "rejection",
        "law",
        "normative",
        "validity",
        "certainly",
        "option",
        "kelsen",
        "maintained",
        "basic",
        "norm",
        "presupposed",
        "accept",
        "ought",
        "normative",
        "validity",
        "law",
        "one",
        "rationally",
        "compelled",
        "attitude",
        "pure",
        "theory",
        "describes",
        "positive",
        "law",
        "objectively",
        "valid",
        "order",
        "state",
        "interpretation",
        "possible",
        "condition",
        "basic",
        "norm",
        "presupposed",
        "pure",
        "theory",
        "thereby",
        "characterizes",
        "interpretation",
        "possible",
        "necessary",
        "present",
        "objective",
        "validity",
        "positive",
        "law",
        "conditionalnamely",
        "conditioned",
        "presupposed",
        "basic",
        "norm",
        "pt",
        "comparison",
        "religion",
        "kelsen",
        "offered",
        "might",
        "helpful",
        "normative",
        "structure",
        "religion",
        "similar",
        "law",
        "logic",
        "religious",
        "belief",
        "one",
        "ought",
        "ultimately",
        "derive",
        "one",
        "belief",
        "god",
        "command",
        "god",
        "command",
        "however",
        "would",
        "normative",
        "validity",
        "presuppose",
        "basic",
        "norm",
        "respective",
        "religion",
        "namely",
        "one",
        "ought",
        "obey",
        "god",
        "command",
        "thus",
        "normativity",
        "religion",
        "like",
        "law",
        "rest",
        "presupposition",
        "basic",
        "norm",
        "case",
        "fact",
        "normative",
        "system",
        "presupposition",
        "basic",
        "norm",
        "logically",
        "required",
        "regard",
        "relevant",
        "norm",
        "reason",
        "action",
        "thus",
        "whether",
        "actually",
        "presuppose",
        "relevant",
        "basic",
        "norm",
        "matter",
        "choice",
        "ideological",
        "option",
        "something",
        "dictated",
        "reason",
        "similarly",
        "normativity",
        "law",
        "presupposed",
        "basic",
        "norm",
        "optional",
        "anarchist",
        "instance",
        "denied",
        "validity",
        "hypothetical",
        "basic",
        "norm",
        "positive",
        "law",
        "view",
        "positive",
        "regulation",
        "human",
        "relationships",
        "mere",
        "power",
        "relation",
        "gt",
        "relativism",
        "however",
        "come",
        "price",
        "consider",
        "question",
        "content",
        "basic",
        "norm",
        "one",
        "need",
        "presuppose",
        "order",
        "render",
        "positive",
        "law",
        "intelligible",
        "normative",
        "legal",
        "order",
        "simple",
        "answer",
        "one",
        "presupposes",
        "precisely",
        "normative",
        "validity",
        "positive",
        "law",
        "namely",
        "law",
        "actually",
        "practiced",
        "certain",
        "population",
        "validity",
        "basic",
        "norm",
        "noted",
        "briefly",
        "earlier",
        "conditional",
        "efficacy",
        "content",
        "basic",
        "norm",
        "given",
        "legal",
        "system",
        "determined",
        "actual",
        "practice",
        "prevail",
        "relevant",
        "community",
        "kelsen",
        "repeatedly",
        "argued",
        "successful",
        "revolution",
        "brings",
        "radical",
        "change",
        "content",
        "basic",
        "norm",
        "suppose",
        "example",
        "given",
        "legal",
        "system",
        "basic",
        "norm",
        "constitution",
        "enacted",
        "rex",
        "one",
        "binding",
        "certain",
        "point",
        "coup",
        "etat",
        "take",
        "place",
        "republican",
        "government",
        "successfully",
        "installed",
        "point",
        "kelsen",
        "admits",
        "one",
        "presupposes",
        "new",
        "basic",
        "norm",
        "longer",
        "basic",
        "norm",
        "delegating",
        "law",
        "making",
        "authority",
        "monarch",
        "basic",
        "norm",
        "delegating",
        "authority",
        "revolutionary",
        "government",
        "pt",
        "kelsen",
        "violated",
        "adherence",
        "hume",
        "injunction",
        "deriving",
        "ought",
        "one",
        "get",
        "clear",
        "impression",
        "kelsen",
        "aware",
        "serious",
        "difficulty",
        "position",
        "edition",
        "pure",
        "theory",
        "law",
        "kelsen",
        "toy",
        "idea",
        "perhaps",
        "change",
        "basic",
        "norm",
        "municipal",
        "legal",
        "system",
        "legally",
        "derive",
        "basic",
        "norm",
        "public",
        "international",
        "law",
        "basic",
        "principle",
        "international",
        "law",
        "state",
        "sovereignty",
        "determined",
        "actual",
        "control",
        "territorypopulation",
        "pt",
        "though",
        "pt",
        "idea",
        "presented",
        "greater",
        "hesitation",
        "notably",
        "commentator",
        "argue",
        "kelsen",
        "took",
        "idea",
        "universal",
        "legal",
        "order",
        "much",
        "seriously",
        "suggested",
        "heresee",
        "green",
        "led",
        "kelsen",
        "rather",
        "uncomfortable",
        "conclusion",
        "one",
        "basic",
        "norm",
        "entire",
        "world",
        "namely",
        "basic",
        "norm",
        "public",
        "international",
        "law",
        "may",
        "main",
        "worry",
        "lie",
        "elsewhere",
        "worry",
        "stem",
        "fact",
        "difficult",
        "impossible",
        "maintain",
        "profound",
        "relativist",
        "antireductionist",
        "position",
        "respect",
        "given",
        "normative",
        "domain",
        "hold",
        "view",
        "validity",
        "type",
        "norm",
        "entirely",
        "relative",
        "certain",
        "vantage",
        "pointin",
        "word",
        "involved",
        "actual",
        "conduct",
        "beliefspresuppositions",
        "attitude",
        "peopleit",
        "becomes",
        "difficult",
        "detach",
        "explanation",
        "normative",
        "validity",
        "fact",
        "constitute",
        "relevant",
        "point",
        "view",
        "namely",
        "fact",
        "people",
        "action",
        "belief",
        "attitude",
        "etc",
        "basically",
        "meant",
        "earlier",
        "comment",
        "kelsen",
        "option",
        "admit",
        "validity",
        "basic",
        "norm",
        "conditional",
        "efficacy",
        "normative",
        "relativism",
        "inherent",
        "kelsen",
        "conception",
        "force",
        "ground",
        "content",
        "basic",
        "norm",
        "social",
        "fact",
        "constitute",
        "content",
        "namely",
        "fact",
        "action",
        "belief",
        "attitude",
        "actually",
        "entertained",
        "population",
        "question",
        "make",
        "questionable",
        "reductionism",
        "avoided",
        "fact",
        "kelsen",
        "really",
        "offered",
        "u",
        "invitation",
        "provide",
        "reductive",
        "explanation",
        "concept",
        "legal",
        "validity",
        "term",
        "set",
        "social",
        "fact",
        "fact",
        "constitute",
        "content",
        "given",
        "basic",
        "norm",
        "precisely",
        "kind",
        "reduction",
        "hla",
        "hart",
        "later",
        "offered",
        "account",
        "rule",
        "recognition",
        "social",
        "rule",
        "see",
        "hart",
        "p",
        "hart",
        "alludes",
        "difference",
        "conception",
        "rule",
        "recognition",
        "kelsen",
        "idea",
        "basic",
        "norm",
        "kelsen",
        "problem",
        "due",
        "fact",
        "relativist",
        "respect",
        "every",
        "normative",
        "system",
        "like",
        "morality",
        "religion",
        "etc",
        "scope",
        "relativism",
        "relevant",
        "question",
        "reduction",
        "problem",
        "stem",
        "fact",
        "kelsen",
        "quite",
        "right",
        "law",
        "legal",
        "validity",
        "essentially",
        "relative",
        "social",
        "fact",
        "constitute",
        "content",
        "basic",
        "norm",
        "every",
        "legal",
        "order",
        "notice",
        "legal",
        "validity",
        "always",
        "relative",
        "time",
        "place",
        "law",
        "enacted",
        "california",
        "legislature",
        "applies",
        "within",
        "boundary",
        "state",
        "california",
        "applies",
        "certain",
        "period",
        "time",
        "enactment",
        "time",
        "modified",
        "repealed",
        "see",
        "legal",
        "validity",
        "determined",
        "content",
        "basic",
        "norm",
        "actually",
        "followed",
        "given",
        "society",
        "law",
        "uk",
        "example",
        "different",
        "u",
        "people",
        "mostly",
        "judge",
        "official",
        "actually",
        "follow",
        "different",
        "rule",
        "basic",
        "norm",
        "kelsen",
        "terminology",
        "count",
        "law",
        "respective",
        "jurisdiction",
        "kelsen",
        "admits",
        "content",
        "basic",
        "norm",
        "fully",
        "determined",
        "practice",
        "becomes",
        "difficult",
        "understand",
        "explication",
        "legal",
        "validity",
        "offer",
        "nonreductive"
    ]
}