{
    "main_text": "How to Argue for and Evaluate Theories of Legal Interpretation || Theories of Legal Interpretation and Theories of Law\n5.1 Theories of Legal Interpretation and Theories of Law\nIn the literature on legal interpretation, theorists offer various arguments in favor of their preferred theories of legal interpretation. As noted, normative arguments, appealing to moral values such as democracy, fairness, and the rule of law, are the most common. For example, both textualists and intentionalists offer arguments based on democracy (see Eskridge 1994, 13; Eskridge and Frickey 1990, 326; Barak 2005, 248; Alexander 2013, 540; Easterbrook 1994, 63). According to Justice Scalia, “it is simply incompatible with democratic government, or indeed, even with fair government, to have the meaning of a law determined by what the lawgiver meant, rather than by what the lawgiver promulgated.” (Scalia 1997, 17.)\nTypical linguistic arguments defend a particular approach to legal interpretation by appealing to claims about how language or communication works. For example, in section 3, we saw that a recent form of intentionalism is defended on the ground that any linguistic text must mean whatever its author intends it to mean. And theorists influenced by philosophy of language have argued that the proper approach to legal interpretation is to find the total pragmatically conveyed content of the legal texts, on the ground that that is what linguistic interpretation normally seeks.[30]\nConceptual arguments claim that a particular approach to legal interpretation follows from the concept of interpretation, the concept of law, the concept of authority, or some other relevant concept (e.g., Neale 2012 [Other Internet Resources]; see Berman 2009, 37–68). For example, as noted in section 2, some writers have argued that any approach to a text that does not seek the intentions of the author does not count as interpretation (Fish 2005; Graglia 1992).[31]\nSuch arguments for particular theories of legal interpretation are typically offered without any account of why these arguments are the relevant ones and often without consideration of other kinds of arguments. What is the appropriate way to choose between competing theories of legal interpretation? What kinds of arguments are relevant? How do we adjudicate between competing arguments if they conflict? It is unusual for theorists to explicitly address the question of how to choose between competing theories of interpretation. For exceptions, see, e.g., Shapiro 2009 chaps. 1, 12–13; Greenberg 2017a; Fallon 1999.\nSection 2 made the point that which method of legal interpretation is correct – and which reasons or arguments count in favor of a method – depends on what legal interpretation seeks. To a first approximation, whether a method of legal interpretation is correct depends on whether it reliably yields what legal interpretation seeks. For example, if legal interpretation seeks the best resolution of disputes, then a method of legal interpretation is correct if, and only if, it yields the best resolution of disputes.[32]\nWe saw that the strongest candidate for what legal interpretation seeks is provisions’ contribution to the content of the law. (As noted, even if legal interpretation seeks the best resolution of disputes, legal interpretation must begin by seeking provisions’ contributions, given plausible assumptions. See section 2.) If that is what legal interpretation seeks, then a method cannot be a good one unless it reliably yields the content of the law.\nLet’s use the term legal facts for facts about the content of the law, for example, the fact that, in California, contracts for the sale of land are not valid unless in writing.[33] Legal facts are not among the most basic facts of the universe. They are determined by metaphysically more basic facts, such as facts about what various people and institutions have said and done and decided and, on some views, moral or other normative facts. A theory of law is an account of how the more basic, determining facts determine the legal facts.[34] Different theories of law make different claims about what the determining facts are and how they combine to determine the legal facts.\nThe most widely held theory of law, at least in law schools, is HLA Hart’s (1994) inclusive positivist theory, and many theorists of legal interpretation profess to accept Hartian positivism (Alexander 2015; Baude and Sachs 2018; Baude 2015, 2364–65; Sachs 2014, 2261; 2015, 825–26; Fallon 2018, 90–91; Goldsworthy 2019). What are its implications for legal interpretation? On Hart’s account, the content of the law is determined at the most fundamental level by the convergent practices of judges and other officials.[35] In Hart’s well-known terminology, judges’ convergent practices and attitudes constitute a rule of recognition that specifies how the content of the law is determined (Hart 1994, 100–10).[36] (For simplicity, I restrict attention to judges.) To illustrate with respect to statutes, if judges (in a particular jurisdiction): (1) regularly treat statutes as contributing to the law in a particular way; (2) are disposed to criticize other judges who fail to do so (or threaten to fail to do so); and (3) regard such criticisms as justified, then the rule of recognition in the jurisdiction is that statutes contribute to the content of the law in that way. (See entry on Legal Positivism.)\nIn addition to the rule of recognition’s specification of how sources of law contribute to the content of the law at the most fundamental level, legal norms that are themselves validated by the rule of recognition could further specify how sources of law are to contribute to the content of the law.\nThus, if Hart’s theory is true, in order to defend a preferred theory of legal interpretation, a theorist must argue either: 1) that the way in which the theory takes a provision to contribute to the content of the law is incorporated in the rule of recognition because it is treated as correct by a large majority of judges; or 2) that the way in which the theory takes a provision to contribute to the content of the law is validated by a criterion that, in turn, is treated as correct by a large majority of judges.[37] This would be a challenging task. (As these are the only two possibilities that Hart’s account allows, to the extent that there is no consensus on a theory of legal interpretation and no criterion grounded in consensus that validates a particular theory of interpretation, it is indeterminate which theory of interpretation is correct.)[38]\nTake the first possibility. There seems to be no consensus among judges about the proper method of legal interpretation. Instead, there is widespread controversy (Hart and Sacks 1994, 1169; Eskridge 1994, 13–47; Eskridge, Frickey & Garret 2007, 689–846; for a few haphazardly chosen examples, see the various methods employed and advocated in the United States Supreme Court’s decisions in Smith, Bond, Yates, Weber, and King v. Burwell). A theorist could try to argue that, at a high level of generality, there is a consensus among judges on the theorist’s preferred method of interpretation, and that the disagreement is in the application of that consensus.\nThe only kind of consensus among judges, however, is on bland platitudes such as that original meaning matters or legislative intention is important. Such platitudes are too underspecified to yield a uniquely correct application. Which kind of original meaning? Semantic content? Communicative content? “Public meaning”? Exactly how does original meaning matter, and what other factors matter and in what way? Which kind of legislative intention?\nThe second possibility is a little more promising. It is possible for judges to agree on a criterion (or chain of criteria) that validates a particular method of legal interpretation, yet be unaware that the criterion does so because the application of the criterion is controversial. Thus, for example, a theorist could try to argue that the judges agree on a normative criterion, but they disagree about what that criterion, properly understood, entails. Or a theorist could argue that judges converge on a descriptive criterion, but they have a factual disagreement about what that descriptive criterion entails. Perhaps there is a forgotten custom, validated by the rule of recognition, that specifies (when understood as the rule of recognition requires) that statutes contribute to the law according to their literal meaning, and there are no conflicting norms validated by the rule of recognition. Such possibilities can’t be ruled out a priori, but it is clear that it would be a tall order to show that there is consensus on a criterion that, properly understood, yields a controversial method of interpretation.\nIn sum, on Hart’s theory of law, it is difficult to defend any controversial theory of legal interpretation.[39] (But see Baude and Sachs 2017; 2018.)\nDworkin’s well-known “law as integrity” theory of law, sketched above, is the most influential alternative to Hart’s account. See section 3. (Dworkin 1986, 225, Ch. 7.) As discussed, Dworkin does not consider the distinction between theory of law and theory of legal interpretation – i.e., between an account of how the content of the law is determined and an account of how to ascertain the content of the law. He assumes that, if his theory of law is true, the proper method of legal interpretation is simply to seek the set of principles that best justify the legal practices.\nIn principle, however, a proponent of a different theory of legal interpretation, textualism, say, could argue that Dworkin’s theory of law in fact supports textualism. The theorist would have to argue that textualism is the best method of ascertaining the set of principles that best justify the legal practices.\nIn light of these implications of well-known theories of law for how to defend theories of legal interpretation, it’s worth returning to the kinds of arguments that theorists of legal interpretation in fact offer to support their preferred accounts. As already noted, normative arguments are probably the most common. The typical argument is that a method is supported by a certain value – democracy or fairness, for example – because the method treats sources of law as contributing to the law in the way that that value requires.\nIt may be that theorists give such arguments simply because they have not carefully considered what legal interpretation seeks. But are such arguments apt – that is, are they an appropriate way of defending a theory of legal interpretation given the assumption that legal interpretation seeks a provision’s contribution to the content of the law?\nThe fact that a method of legal interpretation treats a provision as contributing to the law in the way that is supported by fairness (say) is an argument in favor of the correctness of that method only if fairness is relevant to the method’s ability to identify a provision’s contribution to the content of the law. But whether fairness is relevant in this way depends on how the content of the law is determined. Thus, whether typical normative arguments are apt depends on how the content of the law is determined. For example, if normative factors play no role in determining the content of the law, then it’s hard to see how the fact that a method of interpretation treats a source as contributing to the law in a way that is fair bears on whether it accurately identifies a provision’s contribution to the content of the law.\nReturning to Hartian positivism, normative factors can play a role if, and only if, there is a consensus among judges that does the necessary work (or a consensus on another criterion that picks out those normative factors). If, as seems likely, there is no consensus among judges that does the necessary work, Hart’s theory implies that normative factors do not play a role in determining the content of the law. In that case, the fact that a method of legal interpretation is supported by democracy, fairness, or other values has no bearing on whether it accurately ascertains the content of the law.\nExclusive positivist theories of law, by contrast with inclusive accounts like Hart’s, maintain that normative factors can play no role in determining the content of the law at any level (Raz 1979; 1994; Shapiro 2011, 271–81; Leiter 1998, 535–36; see entry on Legal Positivism). On such accounts, it is clear that normative arguments have no bearing on whether a theory of interpretation is true.\nAs we saw above, Dworkin’s theory makes normative arguments relevant. But the type of normative argument that it makes relevant is very different from the normative arguments typically offered in favor of theories of legal interpretation. On Dworkin’s theory, the way to show that a method of interpretation accurately identifies how sources, such as statutory and constitutional provisions, contribute to the law is to show that the method yields the principles that best justify the enactment of those provisions. An argument that a method yields the best justification of enactments is, however, very different from the kind of normative argument typically offered in favor of theories of legal interpretation.\nOne theory of law – really a family of theories – offers a natural explanation of the relevance of the typical normative arguments. Theories in this family hold that legal obligations are constituted by certain genuine normative (or moral) obligations.[40] For example, according to the moral impact theory, the relevant obligations are, roughly speaking, those that obtain in virtue of the actions of legal institutions (Greenberg 2014). At the fundamental level, therefore, what the determinants of the content of the law are – and how they contribute to the content of the law – is determined by all relevant values. Thus, for example, a statute’s contribution to the content of the law is the impact of its enactment, in light of fairness, democracy, and any other relevant values, on our obligations (and rights, permissions, powers, and so on). Consequently, on the moral impact theory, a natural way to argue for a method of interpretation is to argue that the way in which the method of interpretation takes sources to contribute to the content of the law is supported, on balance, by the relevant values.\nThe moral impact theory thus seems to fit nicely the way in which theorists of legal interpretation employ normative arguments to defend their theories (see Greenberg 2020, 133–34). And, perhaps surprisingly, on many competing theories of law, it may be difficult to defend the aptness of such normative arguments. Of course, the moral impact theory implies that it is not enough to argue, as theorists often do, that a particular democratic or fairness consideration supports a preferred theory of interpretation. What is needed is an argument that the way in which a theory takes sources to contribute to the content of the law is supported, on balance, by all relevant values.\n",
    "section_title": "5.1 Theories of Legal Interpretation and Theories of Law",
    "entry_title": "Legal Interpretation",
    "hierarchy_title": "Legal Interpretation || How to Argue for and Evaluate Theories of Legal Interpretation || Theories of Legal Interpretation and Theories of Law",
    "tokenized_text": [
        "argue",
        "evaluate",
        "theory",
        "legal",
        "interpretation",
        "theory",
        "legal",
        "interpretation",
        "theory",
        "law",
        "theory",
        "legal",
        "interpretation",
        "theory",
        "law",
        "literature",
        "legal",
        "interpretation",
        "theorist",
        "offer",
        "various",
        "argument",
        "favor",
        "preferred",
        "theory",
        "legal",
        "interpretation",
        "noted",
        "normative",
        "argument",
        "appealing",
        "moral",
        "value",
        "democracy",
        "fairness",
        "rule",
        "law",
        "common",
        "example",
        "textualists",
        "intentionalists",
        "offer",
        "argument",
        "based",
        "democracy",
        "see",
        "eskridge",
        "eskridge",
        "frickey",
        "barak",
        "alexander",
        "easterbrook",
        "according",
        "justice",
        "scalia",
        "simply",
        "incompatible",
        "democratic",
        "government",
        "indeed",
        "even",
        "fair",
        "government",
        "meaning",
        "law",
        "determined",
        "lawgiver",
        "meant",
        "rather",
        "lawgiver",
        "promulgated",
        "scalia",
        "typical",
        "linguistic",
        "argument",
        "defend",
        "particular",
        "approach",
        "legal",
        "interpretation",
        "appealing",
        "claim",
        "language",
        "communication",
        "work",
        "example",
        "section",
        "saw",
        "recent",
        "form",
        "intentionalism",
        "defended",
        "ground",
        "linguistic",
        "text",
        "must",
        "mean",
        "whatever",
        "author",
        "intends",
        "mean",
        "theorist",
        "influenced",
        "philosophy",
        "language",
        "argued",
        "proper",
        "approach",
        "legal",
        "interpretation",
        "find",
        "total",
        "pragmatically",
        "conveyed",
        "content",
        "legal",
        "text",
        "ground",
        "linguistic",
        "interpretation",
        "normally",
        "seek",
        "conceptual",
        "argument",
        "claim",
        "particular",
        "approach",
        "legal",
        "interpretation",
        "follows",
        "concept",
        "interpretation",
        "concept",
        "law",
        "concept",
        "authority",
        "relevant",
        "concept",
        "eg",
        "neale",
        "internet",
        "resource",
        "see",
        "berman",
        "example",
        "noted",
        "section",
        "writer",
        "argued",
        "approach",
        "text",
        "seek",
        "intention",
        "author",
        "count",
        "interpretation",
        "fish",
        "graglia",
        "argument",
        "particular",
        "theory",
        "legal",
        "interpretation",
        "typically",
        "offered",
        "without",
        "account",
        "argument",
        "relevant",
        "one",
        "often",
        "without",
        "consideration",
        "kind",
        "argument",
        "appropriate",
        "way",
        "choose",
        "competing",
        "theory",
        "legal",
        "interpretation",
        "kind",
        "argument",
        "relevant",
        "adjudicate",
        "competing",
        "argument",
        "conflict",
        "unusual",
        "theorist",
        "explicitly",
        "address",
        "question",
        "choose",
        "competing",
        "theory",
        "interpretation",
        "exception",
        "see",
        "eg",
        "shapiro",
        "chap",
        "greenberg",
        "a",
        "fallon",
        "section",
        "made",
        "point",
        "method",
        "legal",
        "interpretation",
        "correct",
        "reason",
        "argument",
        "count",
        "favor",
        "method",
        "depends",
        "legal",
        "interpretation",
        "seek",
        "first",
        "approximation",
        "whether",
        "method",
        "legal",
        "interpretation",
        "correct",
        "depends",
        "whether",
        "reliably",
        "yield",
        "legal",
        "interpretation",
        "seek",
        "example",
        "legal",
        "interpretation",
        "seek",
        "best",
        "resolution",
        "dispute",
        "method",
        "legal",
        "interpretation",
        "correct",
        "yield",
        "best",
        "resolution",
        "dispute",
        "saw",
        "strongest",
        "candidate",
        "legal",
        "interpretation",
        "seek",
        "provision",
        "contribution",
        "content",
        "law",
        "noted",
        "even",
        "legal",
        "interpretation",
        "seek",
        "best",
        "resolution",
        "dispute",
        "legal",
        "interpretation",
        "must",
        "begin",
        "seeking",
        "provision",
        "contribution",
        "given",
        "plausible",
        "assumption",
        "see",
        "section",
        "legal",
        "interpretation",
        "seek",
        "method",
        "good",
        "one",
        "unless",
        "reliably",
        "yield",
        "content",
        "law",
        "let",
        "use",
        "term",
        "legal",
        "fact",
        "fact",
        "content",
        "law",
        "example",
        "fact",
        "california",
        "contract",
        "sale",
        "land",
        "valid",
        "unless",
        "writing",
        "legal",
        "fact",
        "among",
        "basic",
        "fact",
        "universe",
        "determined",
        "metaphysically",
        "basic",
        "fact",
        "fact",
        "various",
        "people",
        "institution",
        "said",
        "done",
        "decided",
        "view",
        "moral",
        "normative",
        "fact",
        "theory",
        "law",
        "account",
        "basic",
        "determining",
        "fact",
        "determine",
        "legal",
        "fact",
        "different",
        "theory",
        "law",
        "make",
        "different",
        "claim",
        "determining",
        "fact",
        "combine",
        "determine",
        "legal",
        "fact",
        "widely",
        "held",
        "theory",
        "law",
        "least",
        "law",
        "school",
        "hla",
        "hart",
        "inclusive",
        "positivist",
        "theory",
        "many",
        "theorist",
        "legal",
        "interpretation",
        "profess",
        "accept",
        "hartian",
        "positivism",
        "alexander",
        "baude",
        "sachs",
        "baude",
        "sachs",
        "fallon",
        "goldsworthy",
        "implication",
        "legal",
        "interpretation",
        "hart",
        "account",
        "content",
        "law",
        "determined",
        "fundamental",
        "level",
        "convergent",
        "practice",
        "judge",
        "official",
        "hart",
        "wellknown",
        "terminology",
        "judge",
        "convergent",
        "practice",
        "attitude",
        "constitute",
        "rule",
        "recognition",
        "specifies",
        "content",
        "law",
        "determined",
        "hart",
        "simplicity",
        "restrict",
        "attention",
        "judge",
        "illustrate",
        "respect",
        "statute",
        "judge",
        "particular",
        "jurisdiction",
        "regularly",
        "treat",
        "statute",
        "contributing",
        "law",
        "particular",
        "way",
        "disposed",
        "criticize",
        "judge",
        "fail",
        "threaten",
        "fail",
        "regard",
        "criticism",
        "justified",
        "rule",
        "recognition",
        "jurisdiction",
        "statute",
        "contribute",
        "content",
        "law",
        "way",
        "see",
        "entry",
        "legal",
        "positivism",
        "addition",
        "rule",
        "recognition",
        "specification",
        "source",
        "law",
        "contribute",
        "content",
        "law",
        "fundamental",
        "level",
        "legal",
        "norm",
        "validated",
        "rule",
        "recognition",
        "could",
        "specify",
        "source",
        "law",
        "contribute",
        "content",
        "law",
        "thus",
        "hart",
        "theory",
        "true",
        "order",
        "defend",
        "preferred",
        "theory",
        "legal",
        "interpretation",
        "theorist",
        "must",
        "argue",
        "either",
        "way",
        "theory",
        "take",
        "provision",
        "contribute",
        "content",
        "law",
        "incorporated",
        "rule",
        "recognition",
        "treated",
        "correct",
        "large",
        "majority",
        "judge",
        "way",
        "theory",
        "take",
        "provision",
        "contribute",
        "content",
        "law",
        "validated",
        "criterion",
        "turn",
        "treated",
        "correct",
        "large",
        "majority",
        "judge",
        "would",
        "challenging",
        "task",
        "two",
        "possibility",
        "hart",
        "account",
        "allows",
        "extent",
        "consensus",
        "theory",
        "legal",
        "interpretation",
        "criterion",
        "grounded",
        "consensus",
        "validates",
        "particular",
        "theory",
        "interpretation",
        "indeterminate",
        "theory",
        "interpretation",
        "correct",
        "take",
        "first",
        "possibility",
        "seems",
        "consensus",
        "among",
        "judge",
        "proper",
        "method",
        "legal",
        "interpretation",
        "instead",
        "widespread",
        "controversy",
        "hart",
        "sack",
        "eskridge",
        "eskridge",
        "frickey",
        "garret",
        "haphazardly",
        "chosen",
        "example",
        "see",
        "various",
        "method",
        "employed",
        "advocated",
        "united",
        "state",
        "supreme",
        "court",
        "decision",
        "smith",
        "bond",
        "yates",
        "weber",
        "king",
        "v",
        "burwell",
        "theorist",
        "could",
        "try",
        "argue",
        "high",
        "level",
        "generality",
        "consensus",
        "among",
        "judge",
        "theorist",
        "preferred",
        "method",
        "interpretation",
        "disagreement",
        "application",
        "consensus",
        "kind",
        "consensus",
        "among",
        "judge",
        "however",
        "bland",
        "platitude",
        "original",
        "meaning",
        "matter",
        "legislative",
        "intention",
        "important",
        "platitude",
        "underspecified",
        "yield",
        "uniquely",
        "correct",
        "application",
        "kind",
        "original",
        "meaning",
        "semantic",
        "content",
        "communicative",
        "content",
        "public",
        "meaning",
        "exactly",
        "original",
        "meaning",
        "matter",
        "factor",
        "matter",
        "way",
        "kind",
        "legislative",
        "intention",
        "second",
        "possibility",
        "little",
        "promising",
        "possible",
        "judge",
        "agree",
        "criterion",
        "chain",
        "criterion",
        "validates",
        "particular",
        "method",
        "legal",
        "interpretation",
        "yet",
        "unaware",
        "criterion",
        "application",
        "criterion",
        "controversial",
        "thus",
        "example",
        "theorist",
        "could",
        "try",
        "argue",
        "judge",
        "agree",
        "normative",
        "criterion",
        "disagree",
        "criterion",
        "properly",
        "understood",
        "entail",
        "theorist",
        "could",
        "argue",
        "judge",
        "converge",
        "descriptive",
        "criterion",
        "factual",
        "disagreement",
        "descriptive",
        "criterion",
        "entail",
        "perhaps",
        "forgotten",
        "custom",
        "validated",
        "rule",
        "recognition",
        "specifies",
        "understood",
        "rule",
        "recognition",
        "requires",
        "statute",
        "contribute",
        "law",
        "according",
        "literal",
        "meaning",
        "conflicting",
        "norm",
        "validated",
        "rule",
        "recognition",
        "possibility",
        "ruled",
        "priori",
        "clear",
        "would",
        "tall",
        "order",
        "show",
        "consensus",
        "criterion",
        "properly",
        "understood",
        "yield",
        "controversial",
        "method",
        "interpretation",
        "sum",
        "hart",
        "theory",
        "law",
        "difficult",
        "defend",
        "controversial",
        "theory",
        "legal",
        "interpretation",
        "see",
        "baude",
        "sachs",
        "dworkin",
        "wellknown",
        "law",
        "integrity",
        "theory",
        "law",
        "sketched",
        "influential",
        "alternative",
        "hart",
        "account",
        "see",
        "section",
        "dworkin",
        "ch",
        "discussed",
        "dworkin",
        "consider",
        "distinction",
        "theory",
        "law",
        "theory",
        "legal",
        "interpretation",
        "ie",
        "account",
        "content",
        "law",
        "determined",
        "account",
        "ascertain",
        "content",
        "law",
        "assumes",
        "theory",
        "law",
        "true",
        "proper",
        "method",
        "legal",
        "interpretation",
        "simply",
        "seek",
        "set",
        "principle",
        "best",
        "justify",
        "legal",
        "practice",
        "principle",
        "however",
        "proponent",
        "different",
        "theory",
        "legal",
        "interpretation",
        "textualism",
        "say",
        "could",
        "argue",
        "dworkin",
        "theory",
        "law",
        "fact",
        "support",
        "textualism",
        "theorist",
        "would",
        "argue",
        "textualism",
        "best",
        "method",
        "ascertaining",
        "set",
        "principle",
        "best",
        "justify",
        "legal",
        "practice",
        "light",
        "implication",
        "wellknown",
        "theory",
        "law",
        "defend",
        "theory",
        "legal",
        "interpretation",
        "worth",
        "returning",
        "kind",
        "argument",
        "theorist",
        "legal",
        "interpretation",
        "fact",
        "offer",
        "support",
        "preferred",
        "account",
        "already",
        "noted",
        "normative",
        "argument",
        "probably",
        "common",
        "typical",
        "argument",
        "method",
        "supported",
        "certain",
        "value",
        "democracy",
        "fairness",
        "example",
        "method",
        "treat",
        "source",
        "law",
        "contributing",
        "law",
        "way",
        "value",
        "requires",
        "may",
        "theorist",
        "give",
        "argument",
        "simply",
        "carefully",
        "considered",
        "legal",
        "interpretation",
        "seek",
        "argument",
        "apt",
        "appropriate",
        "way",
        "defending",
        "theory",
        "legal",
        "interpretation",
        "given",
        "assumption",
        "legal",
        "interpretation",
        "seek",
        "provision",
        "contribution",
        "content",
        "law",
        "fact",
        "method",
        "legal",
        "interpretation",
        "treat",
        "provision",
        "contributing",
        "law",
        "way",
        "supported",
        "fairness",
        "say",
        "argument",
        "favor",
        "correctness",
        "method",
        "fairness",
        "relevant",
        "method",
        "ability",
        "identify",
        "provision",
        "contribution",
        "content",
        "law",
        "whether",
        "fairness",
        "relevant",
        "way",
        "depends",
        "content",
        "law",
        "determined",
        "thus",
        "whether",
        "typical",
        "normative",
        "argument",
        "apt",
        "depends",
        "content",
        "law",
        "determined",
        "example",
        "normative",
        "factor",
        "play",
        "role",
        "determining",
        "content",
        "law",
        "hard",
        "see",
        "fact",
        "method",
        "interpretation",
        "treat",
        "source",
        "contributing",
        "law",
        "way",
        "fair",
        "bear",
        "whether",
        "accurately",
        "identifies",
        "provision",
        "contribution",
        "content",
        "law",
        "returning",
        "hartian",
        "positivism",
        "normative",
        "factor",
        "play",
        "role",
        "consensus",
        "among",
        "judge",
        "necessary",
        "work",
        "consensus",
        "another",
        "criterion",
        "pick",
        "normative",
        "factor",
        "seems",
        "likely",
        "consensus",
        "among",
        "judge",
        "necessary",
        "work",
        "hart",
        "theory",
        "implies",
        "normative",
        "factor",
        "play",
        "role",
        "determining",
        "content",
        "law",
        "case",
        "fact",
        "method",
        "legal",
        "interpretation",
        "supported",
        "democracy",
        "fairness",
        "value",
        "bearing",
        "whether",
        "accurately",
        "ascertains",
        "content",
        "law",
        "exclusive",
        "positivist",
        "theory",
        "law",
        "contrast",
        "inclusive",
        "account",
        "like",
        "hart",
        "maintain",
        "normative",
        "factor",
        "play",
        "role",
        "determining",
        "content",
        "law",
        "level",
        "raz",
        "shapiro",
        "leiter",
        "see",
        "entry",
        "legal",
        "positivism",
        "account",
        "clear",
        "normative",
        "argument",
        "bearing",
        "whether",
        "theory",
        "interpretation",
        "true",
        "saw",
        "dworkin",
        "theory",
        "make",
        "normative",
        "argument",
        "relevant",
        "type",
        "normative",
        "argument",
        "make",
        "relevant",
        "different",
        "normative",
        "argument",
        "typically",
        "offered",
        "favor",
        "theory",
        "legal",
        "interpretation",
        "dworkin",
        "theory",
        "way",
        "show",
        "method",
        "interpretation",
        "accurately",
        "identifies",
        "source",
        "statutory",
        "constitutional",
        "provision",
        "contribute",
        "law",
        "show",
        "method",
        "yield",
        "principle",
        "best",
        "justify",
        "enactment",
        "provision",
        "argument",
        "method",
        "yield",
        "best",
        "justification",
        "enactment",
        "however",
        "different",
        "kind",
        "normative",
        "argument",
        "typically",
        "offered",
        "favor",
        "theory",
        "legal",
        "interpretation",
        "one",
        "theory",
        "law",
        "really",
        "family",
        "theory",
        "offer",
        "natural",
        "explanation",
        "relevance",
        "typical",
        "normative",
        "argument",
        "theory",
        "family",
        "hold",
        "legal",
        "obligation",
        "constituted",
        "certain",
        "genuine",
        "normative",
        "moral",
        "obligation",
        "example",
        "according",
        "moral",
        "impact",
        "theory",
        "relevant",
        "obligation",
        "roughly",
        "speaking",
        "obtain",
        "virtue",
        "action",
        "legal",
        "institution",
        "greenberg",
        "fundamental",
        "level",
        "therefore",
        "determinant",
        "content",
        "law",
        "contribute",
        "content",
        "law",
        "determined",
        "relevant",
        "value",
        "thus",
        "example",
        "statute",
        "contribution",
        "content",
        "law",
        "impact",
        "enactment",
        "light",
        "fairness",
        "democracy",
        "relevant",
        "value",
        "obligation",
        "right",
        "permission",
        "power",
        "consequently",
        "moral",
        "impact",
        "theory",
        "natural",
        "way",
        "argue",
        "method",
        "interpretation",
        "argue",
        "way",
        "method",
        "interpretation",
        "take",
        "source",
        "contribute",
        "content",
        "law",
        "supported",
        "balance",
        "relevant",
        "value",
        "moral",
        "impact",
        "theory",
        "thus",
        "seems",
        "fit",
        "nicely",
        "way",
        "theorist",
        "legal",
        "interpretation",
        "employ",
        "normative",
        "argument",
        "defend",
        "theory",
        "see",
        "greenberg",
        "perhaps",
        "surprisingly",
        "many",
        "competing",
        "theory",
        "law",
        "may",
        "difficult",
        "defend",
        "aptness",
        "normative",
        "argument",
        "course",
        "moral",
        "impact",
        "theory",
        "implies",
        "enough",
        "argue",
        "theorist",
        "often",
        "particular",
        "democratic",
        "fairness",
        "consideration",
        "support",
        "preferred",
        "theory",
        "interpretation",
        "needed",
        "argument",
        "way",
        "theory",
        "take",
        "source",
        "contribute",
        "content",
        "law",
        "supported",
        "balance",
        "relevant",
        "value"
    ]
}