{
    "main_text": "Theories of Legal Interpretation || Textualism\n4.2 Textualism\nIn recent decades, in part in reaction to skepticism about actual legislative intentions, theorists of both statutory and constitutional interpretation have moved away from accounts that focus on intentions. One important trend has been toward textualism in statutory interpretation and “public meaning” originalism in constitutional interpretation. (Textualism here will be used to encompass public meaning originalism, including the position of the so-called new originalists.[23])\nThe core idea of textualism is that the text prevails over other factors. Traditional textualism focused on “plain meaning” and held that, if the plain meaning is clear, a court should not consult other indications of legislative intent. This older textualism saw itself as seeking legislative intent, but took the position that a clear text is the best evidence of that intent.\nThe focus here will be on a more recently influential form of textualism, sometimes called new textualism. New textualists are skeptical about the existence of coherent and discoverable legislative intentions. For reasons for such skepticism, see section 4.1. They emphasize, not plain meaning, but a reasonable reading of the text in context.\nTextualism’s emphasis on the text has to be understood as an emphasis on the linguistic meaning of the text, rather than the text understood as marks on a page. Within linguistic meaning, there are two basic types: semantic content and pragmatically conveyed content (or pragmatic content, for short). See entry on Pragmatics. There is a lively debate in philosophy of language and linguistics over how exactly to draw the line between semantics and pragmatics. Roughly speaking, however, semantic content is what is conventionally encoded in the words, and pragmatic content is what a speaker or author, by an utterance of words on a particular occasion in a particular context, manages to convey beyond, or different from, the semantic content of the words.[24] Central to pragmatic content are the communicative intentions of the speaker. To take a well-known type of example, when one says to a new acquaintance at a dinner party, “I have three children,” one likely intends to communicate that one has exactly three children and the hearer will likely recognize that intention, though the literal meaning of the words is that one has at least three children. This chapter uses “linguistic content” to encompass both semantic content and pragmatic content.\nOn the face of it, pragmatic content seems a poor candidate for what textualists are after, given their skepticism about legislative intentions (though we will see that much of what they say points toward pragmatic content nevertheless).\nGiven textualism’s emphasis on text and objective meaning, it would be natural to understand it as seeking semantic content.[25] This cannot be the right understanding of contemporary textualism, however. Leading textualists explicitly reject literal meaning (a rough synonym for semantic content), which they associate with the more traditional “plain meaning” textualism. They insist that textualism seeks a reasonable reading in context, not a literal one (Scalia 1997, 23–24; Easterbrook 1994, 64, 67; Manning 2001, 108–15; 2003, 2457–58; 2006, 79–81; see also Whittington 1999a, 176–77). As Justice Scalia puts it: “A text should not be construed strictly…; it should be construed reasonably, to contain all that it fairly means” (Scalia 1997, 23).\nAt first blush, the idea of a reasonable reading seems hard to quarrel with. On closer examination, however, it raises a host of problems largely unrecognized by textualists. To begin with, what is reasonable depends on what one seeks and what one knows or believes.\nIn ordinary communication, in interpreting a note from one’s spouse or an instruction manual, say, the goal is normally to identify what the speaker or author meant or intended to communicate, as opposed, for example, to what the words literally mean or what a reasonable person with certain assumptions would take the speaker to have intended to communicate. In other words, one is successful in interpreting in ordinary communication just to the extent that one accurately recovers what the speaker intended to communicate.[26] A reasonable interpretation in a conversational setting is therefore one that is reasonably calculated to recover the speaker’s communicative intentions given the audience’s beliefs about the speaker and the situation. On the other hand, if one is engaged in a different enterprise – playing a word game, trying to decide whether a witness committed perjury (see Bronston v. United States), interpreting a poem, or working out the impact on the law of the enactment of a provision – what is reasonable might be quite different. Textualists do not clearly address what a reasonable reader is supposed to be seeking in part because they have not recognized the issue, saying things that point in different directions.\nSome examples that textualists offer suggest that they are assuming the model of ordinary communication. In the well-known case of Smith v. United States, Smith had offered to trade a gun for cocaine. The Supreme Court divided over the question whether he was properly sentenced under a statute that provides for increased penalties if the defendant “uses … a firearm” in a drug-trafficking or violent crime. In a much-quoted dissenting opinion, Justice Scalia pointed out that “When someone asks ‘Do you use a cane?’ he is not inquiring whether you have your grandfather’s silver handled walking stick on display in the hall; he wants to know whether you walk with a cane” (508 U.S. 223, 242; see Manning 2003, 2460). Properly understood, the example illustrates that, in ordinary conversation, in the imagined situation, the speaker would likely intend to ask whether you walk with a cane. The communication would therefore be successful if the audience correctly identified that intention.[27] Textualists also endorse the use of linguistic canons of interpretation that, properly understood, are rules of thumb for inferring what a speaker likely intended to communicate, as opposed to the literal meaning of the words (e.g., Scalia 1997, 25–26).[28]\nThus, the examples that textualists give involving the interpretation of ordinary communications and their use of certain canons of interpretation suggest that the relevant inquiry is what it would be reasonable to take the speaker to intend to communicate. Indeed, textualists often assert that what words mean is what a reasonable person would take the speaker to mean or to intend to convey – thus confusing word meaning with reasonable inferences about communicative intent (e.g., Scalia and Garner 2012, 16, 56). Similarly, textualists often say that the relevant inquiry is “objectified legal intention,” understood as what a reasonable person, given the context, would take the legislature to have intended.[29]\nThe notion of what a reasonable person would take the speaker to have intended to communicate is coherent (though what a reasonable person would take the speaker to have intended to communicate is not the meaning of a text or utterance). In the case of legislation, however, by the textualists’ own lights, it is not reasonable to take the legislature to have intended to communicate anything. (For skepticism about legislative intentions, see section 4.1)\nA textualist could respond by suggesting that we stipulate fictional assumptions about the speaker or the situation. In this way, we could construct counterfactual-based contents. Plainly, we would get diverse such contents depending on which stipulations we make (see Alexander 2011, 91–93). For example, one might ask what a reasonable person would have taken the speaker’s communicative intention to be if the text of a provision had been uttered by one rational speaker in ordinary conversation with the goal of communicating a message. It is important to note that, as stated, the answer to this question will likely be indeterminate – that is, without more specification of, for example, the reasonable person’s beliefs about the speaker and the conversational context, there will be no fact of the matter as to what the reasonable person would have taken the speaker’s intention to be. Moreover, fleshing out the counterfactual situation in a specific way, rather than indefinitely many others, needs to be justified. Why should legal interpretation be concerned with what a reasonable person would take a speaker to intend under this particular set of fictional assumptions? (See Greenberg 2020, 116–124, for extended discussion of the options available to textualism and difficulties with those options.)\n",
    "section_title": "4.2 Textualism",
    "entry_title": "Legal Interpretation",
    "hierarchy_title": "Legal Interpretation || Theories of Legal Interpretation || Textualism",
    "tokenized_text": [
        "theory",
        "legal",
        "interpretation",
        "textualism",
        "textualism",
        "recent",
        "decade",
        "part",
        "reaction",
        "skepticism",
        "actual",
        "legislative",
        "intention",
        "theorist",
        "statutory",
        "constitutional",
        "interpretation",
        "moved",
        "away",
        "account",
        "focus",
        "intention",
        "one",
        "important",
        "trend",
        "toward",
        "textualism",
        "statutory",
        "interpretation",
        "public",
        "meaning",
        "originalism",
        "constitutional",
        "interpretation",
        "textualism",
        "used",
        "encompass",
        "public",
        "meaning",
        "originalism",
        "including",
        "position",
        "socalled",
        "new",
        "originalists",
        "core",
        "idea",
        "textualism",
        "text",
        "prevails",
        "factor",
        "traditional",
        "textualism",
        "focused",
        "plain",
        "meaning",
        "held",
        "plain",
        "meaning",
        "clear",
        "court",
        "consult",
        "indication",
        "legislative",
        "intent",
        "older",
        "textualism",
        "saw",
        "seeking",
        "legislative",
        "intent",
        "took",
        "position",
        "clear",
        "text",
        "best",
        "evidence",
        "intent",
        "focus",
        "recently",
        "influential",
        "form",
        "textualism",
        "sometimes",
        "called",
        "new",
        "textualism",
        "new",
        "textualists",
        "skeptical",
        "existence",
        "coherent",
        "discoverable",
        "legislative",
        "intention",
        "reason",
        "skepticism",
        "see",
        "section",
        "emphasize",
        "plain",
        "meaning",
        "reasonable",
        "reading",
        "text",
        "context",
        "textualism",
        "emphasis",
        "text",
        "understood",
        "emphasis",
        "linguistic",
        "meaning",
        "text",
        "rather",
        "text",
        "understood",
        "mark",
        "page",
        "within",
        "linguistic",
        "meaning",
        "two",
        "basic",
        "type",
        "semantic",
        "content",
        "pragmatically",
        "conveyed",
        "content",
        "pragmatic",
        "content",
        "short",
        "see",
        "entry",
        "pragmatic",
        "lively",
        "debate",
        "philosophy",
        "language",
        "linguistics",
        "exactly",
        "draw",
        "line",
        "semantics",
        "pragmatic",
        "roughly",
        "speaking",
        "however",
        "semantic",
        "content",
        "conventionally",
        "encoded",
        "word",
        "pragmatic",
        "content",
        "speaker",
        "author",
        "utterance",
        "word",
        "particular",
        "occasion",
        "particular",
        "context",
        "manages",
        "convey",
        "beyond",
        "different",
        "semantic",
        "content",
        "word",
        "central",
        "pragmatic",
        "content",
        "communicative",
        "intention",
        "speaker",
        "take",
        "wellknown",
        "type",
        "example",
        "one",
        "say",
        "new",
        "acquaintance",
        "dinner",
        "party",
        "three",
        "child",
        "one",
        "likely",
        "intends",
        "communicate",
        "one",
        "exactly",
        "three",
        "child",
        "hearer",
        "likely",
        "recognize",
        "intention",
        "though",
        "literal",
        "meaning",
        "word",
        "one",
        "least",
        "three",
        "child",
        "chapter",
        "us",
        "linguistic",
        "content",
        "encompass",
        "semantic",
        "content",
        "pragmatic",
        "content",
        "face",
        "pragmatic",
        "content",
        "seems",
        "poor",
        "candidate",
        "textualists",
        "given",
        "skepticism",
        "legislative",
        "intention",
        "though",
        "see",
        "much",
        "say",
        "point",
        "toward",
        "pragmatic",
        "content",
        "nevertheless",
        "given",
        "textualism",
        "emphasis",
        "text",
        "objective",
        "meaning",
        "would",
        "natural",
        "understand",
        "seeking",
        "semantic",
        "content",
        "right",
        "understanding",
        "contemporary",
        "textualism",
        "however",
        "leading",
        "textualists",
        "explicitly",
        "reject",
        "literal",
        "meaning",
        "rough",
        "synonym",
        "semantic",
        "content",
        "associate",
        "traditional",
        "plain",
        "meaning",
        "textualism",
        "insist",
        "textualism",
        "seek",
        "reasonable",
        "reading",
        "context",
        "literal",
        "one",
        "scalia",
        "easterbrook",
        "manning",
        "see",
        "also",
        "whittington",
        "a",
        "justice",
        "scalia",
        "put",
        "text",
        "construed",
        "strictly",
        "construed",
        "reasonably",
        "contain",
        "fairly",
        "mean",
        "scalia",
        "first",
        "blush",
        "idea",
        "reasonable",
        "reading",
        "seems",
        "hard",
        "quarrel",
        "closer",
        "examination",
        "however",
        "raise",
        "host",
        "problem",
        "largely",
        "unrecognized",
        "textualists",
        "begin",
        "reasonable",
        "depends",
        "one",
        "seek",
        "one",
        "know",
        "belief",
        "ordinary",
        "communication",
        "interpreting",
        "note",
        "one",
        "spouse",
        "instruction",
        "manual",
        "say",
        "goal",
        "normally",
        "identify",
        "speaker",
        "author",
        "meant",
        "intended",
        "communicate",
        "opposed",
        "example",
        "word",
        "literally",
        "mean",
        "reasonable",
        "person",
        "certain",
        "assumption",
        "would",
        "take",
        "speaker",
        "intended",
        "communicate",
        "word",
        "one",
        "successful",
        "interpreting",
        "ordinary",
        "communication",
        "extent",
        "one",
        "accurately",
        "recovers",
        "speaker",
        "intended",
        "communicate",
        "reasonable",
        "interpretation",
        "conversational",
        "setting",
        "therefore",
        "one",
        "reasonably",
        "calculated",
        "recover",
        "speaker",
        "communicative",
        "intention",
        "given",
        "audience",
        "belief",
        "speaker",
        "situation",
        "hand",
        "one",
        "engaged",
        "different",
        "enterprise",
        "playing",
        "word",
        "game",
        "trying",
        "decide",
        "whether",
        "witness",
        "committed",
        "perjury",
        "see",
        "bronston",
        "v",
        "united",
        "state",
        "interpreting",
        "poem",
        "working",
        "impact",
        "law",
        "enactment",
        "provision",
        "reasonable",
        "might",
        "quite",
        "different",
        "textualists",
        "clearly",
        "address",
        "reasonable",
        "reader",
        "supposed",
        "seeking",
        "part",
        "recognized",
        "issue",
        "saying",
        "thing",
        "point",
        "different",
        "direction",
        "example",
        "textualists",
        "offer",
        "suggest",
        "assuming",
        "model",
        "ordinary",
        "communication",
        "wellknown",
        "case",
        "smith",
        "v",
        "united",
        "state",
        "smith",
        "offered",
        "trade",
        "gun",
        "cocaine",
        "supreme",
        "court",
        "divided",
        "question",
        "whether",
        "properly",
        "sentenced",
        "statute",
        "provides",
        "increased",
        "penalty",
        "defendant",
        "us",
        "firearm",
        "drugtrafficking",
        "violent",
        "crime",
        "muchquoted",
        "dissenting",
        "opinion",
        "justice",
        "scalia",
        "pointed",
        "someone",
        "asks",
        "use",
        "cane",
        "inquiring",
        "whether",
        "grandfather",
        "silver",
        "handled",
        "walking",
        "stick",
        "display",
        "hall",
        "want",
        "know",
        "whether",
        "walk",
        "cane",
        "us",
        "see",
        "manning",
        "properly",
        "understood",
        "example",
        "illustrates",
        "ordinary",
        "conversation",
        "imagined",
        "situation",
        "speaker",
        "would",
        "likely",
        "intend",
        "ask",
        "whether",
        "walk",
        "cane",
        "communication",
        "would",
        "therefore",
        "successful",
        "audience",
        "correctly",
        "identified",
        "intention",
        "textualists",
        "also",
        "endorse",
        "use",
        "linguistic",
        "canon",
        "interpretation",
        "properly",
        "understood",
        "rule",
        "thumb",
        "inferring",
        "speaker",
        "likely",
        "intended",
        "communicate",
        "opposed",
        "literal",
        "meaning",
        "word",
        "eg",
        "scalia",
        "thus",
        "example",
        "textualists",
        "give",
        "involving",
        "interpretation",
        "ordinary",
        "communication",
        "use",
        "certain",
        "canon",
        "interpretation",
        "suggest",
        "relevant",
        "inquiry",
        "would",
        "reasonable",
        "take",
        "speaker",
        "intend",
        "communicate",
        "indeed",
        "textualists",
        "often",
        "assert",
        "word",
        "mean",
        "reasonable",
        "person",
        "would",
        "take",
        "speaker",
        "mean",
        "intend",
        "convey",
        "thus",
        "confusing",
        "word",
        "meaning",
        "reasonable",
        "inference",
        "communicative",
        "intent",
        "eg",
        "scalia",
        "garner",
        "similarly",
        "textualists",
        "often",
        "say",
        "relevant",
        "inquiry",
        "objectified",
        "legal",
        "intention",
        "understood",
        "reasonable",
        "person",
        "given",
        "context",
        "would",
        "take",
        "legislature",
        "intended",
        "notion",
        "reasonable",
        "person",
        "would",
        "take",
        "speaker",
        "intended",
        "communicate",
        "coherent",
        "though",
        "reasonable",
        "person",
        "would",
        "take",
        "speaker",
        "intended",
        "communicate",
        "meaning",
        "text",
        "utterance",
        "case",
        "legislation",
        "however",
        "textualists",
        "light",
        "reasonable",
        "take",
        "legislature",
        "intended",
        "communicate",
        "anything",
        "skepticism",
        "legislative",
        "intention",
        "see",
        "section",
        "textualist",
        "could",
        "respond",
        "suggesting",
        "stipulate",
        "fictional",
        "assumption",
        "speaker",
        "situation",
        "way",
        "could",
        "construct",
        "counterfactualbased",
        "content",
        "plainly",
        "would",
        "get",
        "diverse",
        "content",
        "depending",
        "stipulation",
        "make",
        "see",
        "alexander",
        "example",
        "one",
        "might",
        "ask",
        "reasonable",
        "person",
        "would",
        "taken",
        "speaker",
        "communicative",
        "intention",
        "text",
        "provision",
        "uttered",
        "one",
        "rational",
        "speaker",
        "ordinary",
        "conversation",
        "goal",
        "communicating",
        "message",
        "important",
        "note",
        "stated",
        "answer",
        "question",
        "likely",
        "indeterminate",
        "without",
        "specification",
        "example",
        "reasonable",
        "person",
        "belief",
        "speaker",
        "conversational",
        "context",
        "fact",
        "matter",
        "reasonable",
        "person",
        "would",
        "taken",
        "speaker",
        "intention",
        "moreover",
        "fleshing",
        "counterfactual",
        "situation",
        "specific",
        "way",
        "rather",
        "indefinitely",
        "many",
        "others",
        "need",
        "justified",
        "legal",
        "interpretation",
        "concerned",
        "reasonable",
        "person",
        "would",
        "take",
        "speaker",
        "intend",
        "particular",
        "set",
        "fictional",
        "assumption",
        "see",
        "greenberg",
        "extended",
        "discussion",
        "option",
        "available",
        "textualism",
        "difficulty",
        "option"
    ]
}