{
    "main_text": "Claims and Projects within Economic Analysis of Law || Three Strands of Thought within Economic Analysis of Law\n1.3 Three Strands of Thought within Economic Analysis of Law\n\nThe vast literature of economic analysis of law is not easily\ncharacterized. As the set of distinct claims suggests, the literature\ncontains a large number of different projects. For purposes of this\nessay, we may identify three distinct strands of thought within\neconomic analysis of law. A large percentage, but not all, of the\nliterature in economic analysis of law falls within one of these three\nstrands. I shall call one strand policy analysis, the second\nstrand political economy, and the third strand doctrinal\n analysis.[4]\n\nPolicy analysis generally focuses on the analysis of the effects of\nlegal rules and institutions on outcomes. An outcome usually\nconsists of the “objective” effects of the rule or\ninstitution on the behavior of “private” individuals.\nPolicy analysis then typically evaluates the rule or institution under\nstudy against some social objective function. Often policy analysis\nadopts “efficiency” as the evaluative criterion.\n\nPolicy analysis is thus linked both to the behavioral claim (Claim IV)\nand the design claim (Claim VIII). Neither of these links is logical\nor conceptual. The behavioral claim concerns the causal mechanism that\ndetermines how individuals respond to legal rules and institutions;\nthese rules have effects through standard economic processes. The\ndesign aspect of policy analysis, however, requires not that the\npolicymaker explain the effects of legal rules on behavior but\nthat the policymaker predict the behavior the rules will\ninduce. Prediction does not necessarily require the identification of\na causal mechanism. Correlation suffices.\n\nA gap also exists between the design aim of policy analysis and the\ndesign claim. The policy analyst may choose to assess the predicted\nbehavior against any criterion she deems relevant; she may thus,\ncontrary to the design claim, adopt non-efficiency criteria to select\na legal rule. \n\nPolitical economy, by contrast, investigates the operation of\npolitical institutions such as electoral systems, courts,\nlegislatures, the executive and administrative agencies. These\ninstitutions make policy or determine which people make policy.\nPolitical economy thus seeks to explain how the content of the law is\ndetermined. In some instances we might understand political economy\nsimply as the application of the behavioral claim to the\nconstitutional and legal rules and practices that structure\nlegislation, administrative action, and adjudication.\n\nBoth policy analysis and political economy examine behavior. The\npolicy analyst focuses on the behavior induced by legal rules and\ninstitutions. Political economy concentrates on behavior that causes\nlegal rules and institutions. Doctrinal analysis, by contrast, focuses\non the content of the legal doctrine developed by courts in\nadjudication. It asserts that efficiency rationalizes the content of\nthe law. We might understand “the content of the law” in\nat least three ways. First, it might, as the behavioral claim does,\nrefer to the behavior induced by the legal rules announced in judicial\nopinions. Alternatively, the analyst interprets these opinions and\nother texts to extract an economic model that underlies the\ndecision’s legal view of the world. On this interpretation,\nclaims (II) and (III) might be true even though legal rules induced\ninefficient behavior in the real world because the announced legal\nrule might be efficient within the implicit model used by judges but\ninefficient in the world as it actually is.\n\nThe first understanding of doctrinal analysis suggests a connection to\nthe classical behavioral claim (claim (IVa)). It would also suggest\nthat doctrinal analysis would have developed a substantial empirical\ncomponent that investigated what behavior doctrine actually induced.\nAs this empirical component is largely absent, we may understand\ndoctrinal analysis in the second, alternative way. The next section\nexamines the philosophical debates that have emerged from this\nalternative, non-behavioral understanding of doctrinal analysis. \n\nThese three strands may be differentiated in a number of ways. First,\neach strand makes different motivational assumptions about public\nofficials. Policy analysis generally assumes that public officials in\ngeneral, and judges in particular, are conscientious. Judges thus\nenforce the legal rules as they are announced, regardless of the\njudge’s own view of the desirability of the legal rule or its\nimpact on her personally. Political economy assumes that public\nofficials have the same motivation as private individuals; they are\nself-interested (or subject to the same biases that private\nindividuals are). In the context of adjudication, as will be\nelaborated below, the political economist interprets self-interested\njudicial behavior as decisions that promote the policy preferences of\nthe judge. Doctrinal analysis does not analyze the behavior of public\nofficials; it rationalizes the decisions of judges without necessarily\nimputing motivations to them.\n\nSecond, policy analysis and doctrinal analysis generally adopt a\nwelfarist stance towards evaluation of legal rules, while political\neconomy has evolved from a more contractarian tradition. Policy\nanalysts, when evaluating legal rules, ask whether that legal rule\ninduces behavior that satisfies some welfarist criterion, usually\neither Pareto efficiency or (constrained) social welfare\n maximization.[5]\n Political economy, however, has to a large extent emerged from an\neconomic tradition, exemplified by James\n Buchanan,[6]\n that rejects the maximization of social welfare as a criterion and\nseeks to evaluate political institutions on grounds of (actual or\nhypothetical) consent. The political economist often asks not whether\nthe rule induces Pareto efficiency but whether the parties have acted\nvoluntarily, consented to the rule, or would have (rationally)\nconsented to the rule.\n\nFinally, we might understand the distinction among the three strands\nas a difference in the view each adopts about the instrumentalism of\nlaw. “Instrumentalism” here means that an agent designs\nthe law to promote some collective goal. Kornhauser [2000, 2010]\ndiscuss this idea at length. For our purposes, we need only note\nseveral ambiguities in the brief definition just given. A more careful\ndefinition would specify the agent who designs, the meaning of design,\nwhat counts as “law,” and what is a collective purpose.\nRight now, we note only that instrumentalism may occur at the level of\nthe rule, the institution or the legal system as a whole.\n\nPolicy analysis tends to proceed legal rule by legal rule. It asks,\nfor example, how does a change in the standard of care affect the\nbehavior of tortfeasors and tort victims? Or how does contracting\nbehavior differ if the measure of damages shifts from expectation\ndamages to reliance damages? The analyst thus imputes a purpose\n(usually, but not necessarily, the maximization of social welfare) to\nthe promulgator of the legal rule. The analyst then assumes that the\npolicymaker has chosen the legal rule that best promotes her (imputed)\nobjective. Legal rules are then instrumental to the achievement of the\nposited goal; call this approach rule instrumentalism.\n\nThe political economist, by contrast, generally denies that any\npurpose can be attributed to the promulgator of a legal rule largely\nbecause legal rules are not promulgated by a single individual with\npower unilaterally to control the content of the rule. Certainly, from\nthe perspective of political economy, legislators have no common\npurpose and one should not assume or expect that any statute maximizes\nsocial welfare. Legislation results from the interplay of interest\ngroups that do not reflect all interests within society. Even if the\nlegislature did reflect all interests within society, each interest\ndoes not have an equal (or proportionate) say in the formulation of\nthe\n statute.[7]\n Finally, even if each interest did play a “proportionate”\nrole in the formulation of the statute, Arrow’s General\nPossibility Theorem teaches that the aggregation of interests might\nstill not yield a coherent purpose. Political economy thus rejects\nrule instrumentalism.\n\nFurther understanding of the approach of political economy requires\nacknowledgment of divergent views within political economy. I\ndistinguish two such views: constitutional political economy\nand radical political economy. Each rejects rule\ninstrumentalism but only the latter rejects instrumentalism\naltogether.\n\nOne might attribute the rejection of rule instrumentalism within\npolitical economy to a commitment to an explanatory rather than a\nnormative project. At the level of constitutional political economy,\nhowever, the research program usually adopts the perspective of a\nconstitutional designer and this designer arguably has a view of law\nthat includes institutional instrumentalism: i.e., legal\ninstitutions, rather than specific legal rules, promote the specific\ngoals of the constitutional\n designer.[8]\n The constitutional designer seeks a political structure that promotes\nher goals. The project of constitutional political economy is thus\nnormative in nature. Indeed the normative nature of the project\ndominates any explanatory aim. Many within the project — see\nBrennan and Buchanan [1981, 1985] — argue that one ought to\nadopt an economic theory of behavior of public officials and private\nindividuals even if that theory is not the best explanatory\ntheory.\n\nRadical political economists reject this reasoning. They carry the\nlogic of the argument about the incoherence of legislative behavior\nthrough to the level of institutional and constitutional design.\nConstitutions are drafted by agents with political and economic\ninterests that they seek to forward when they create the basic social,\neconomic, and political institutions of the society. Incoherence may\nthus infect these institutions as well. The compromises over slavery\nin the US Constitution, for example, illustrate, when viewed against\nthe democratic and equality elements of the document, such\nincoherence. Radical political economists thus reject the claim that\nthe law is designed and hence reject instrumentalism\naltogether.\n\nThe relation of doctrinal analysis to instrumentalism depends on our\nunderstanding of the project of doctrinal analysis. If we understand\ndoctrinal analysis simply as a rationalization of doctrine, it would\nappear to make no assumptions about the instrumental nature of law.\nThe fact that doctrine is efficient might result from intentional\nbehavior on the part of agents or might simply emerge from the\nstructure of the institutions within which public officials work. On\nthe other hand, if we understand doctrinal analysis as a theory of\nadjudication, then it clearly adopts a rule instrumental view of law.\nThe project of doctrinal analysis is discussed at greater length in\nthe next section.\n\nThese differences in the level at which law is instrumental, if the\nlaw is instrumental at all, suggest that the three strands of economic\nanalysis of law will adopt different approaches to the study of\nadjudication. These theories are sketched and discussed in section 5\nbelow.\n\nMore significantly for purposes of this entry, however, the classical\nvariants of both policy analysis and political economy adopt the\nstandard assumption of neo-classical economics that each individual\nseeks to maximize the satisfaction of her preferences. Moreover, they\ngenerally assume that each individual acts in her own self-interest,\nnarrowly defined. This approach presents the single, greatest obstacle\nto the articulation of a general theory of law that confronts economic\nanalysis: it has no room for the normative aspect of law. It\nis this denial of the normativity of law that accounts for the\nvehement resistance that economic analysis provoked within the legal\nacademy.\n",
    "section_title": "1.3 Three Strands of Thought within Economic Analysis of Law",
    "entry_title": "The Economic Analysis of Law",
    "hierarchy_title": "The Economic Analysis of Law || Claims and Projects within Economic Analysis of Law || Three Strands of Thought within Economic Analysis of Law",
    "tokenized_text": [
        "claim",
        "project",
        "within",
        "economic",
        "analysis",
        "law",
        "three",
        "strand",
        "thought",
        "within",
        "economic",
        "analysis",
        "law",
        "three",
        "strand",
        "thought",
        "within",
        "economic",
        "analysis",
        "law",
        "vast",
        "literature",
        "economic",
        "analysis",
        "law",
        "easily",
        "characterized",
        "set",
        "distinct",
        "claim",
        "suggests",
        "literature",
        "contains",
        "large",
        "number",
        "different",
        "project",
        "purpose",
        "essay",
        "may",
        "identify",
        "three",
        "distinct",
        "strand",
        "thought",
        "within",
        "economic",
        "analysis",
        "law",
        "large",
        "percentage",
        "literature",
        "economic",
        "analysis",
        "law",
        "fall",
        "within",
        "one",
        "three",
        "strand",
        "shall",
        "call",
        "one",
        "strand",
        "policy",
        "analysis",
        "second",
        "strand",
        "political",
        "economy",
        "third",
        "strand",
        "doctrinal",
        "analysis",
        "policy",
        "analysis",
        "generally",
        "focus",
        "analysis",
        "effect",
        "legal",
        "rule",
        "institution",
        "outcome",
        "outcome",
        "usually",
        "consists",
        "objective",
        "effect",
        "rule",
        "institution",
        "behavior",
        "private",
        "individual",
        "policy",
        "analysis",
        "typically",
        "evaluates",
        "rule",
        "institution",
        "study",
        "social",
        "objective",
        "function",
        "often",
        "policy",
        "analysis",
        "adopts",
        "efficiency",
        "evaluative",
        "criterion",
        "policy",
        "analysis",
        "thus",
        "linked",
        "behavioral",
        "claim",
        "claim",
        "iv",
        "design",
        "claim",
        "claim",
        "viii",
        "neither",
        "link",
        "logical",
        "conceptual",
        "behavioral",
        "claim",
        "concern",
        "causal",
        "mechanism",
        "determines",
        "individual",
        "respond",
        "legal",
        "rule",
        "institution",
        "rule",
        "effect",
        "standard",
        "economic",
        "process",
        "design",
        "aspect",
        "policy",
        "analysis",
        "however",
        "requires",
        "policymaker",
        "explain",
        "effect",
        "legal",
        "rule",
        "behavior",
        "policymaker",
        "predict",
        "behavior",
        "rule",
        "induce",
        "prediction",
        "necessarily",
        "require",
        "identification",
        "causal",
        "mechanism",
        "correlation",
        "suffices",
        "gap",
        "also",
        "exists",
        "design",
        "aim",
        "policy",
        "analysis",
        "design",
        "claim",
        "policy",
        "analyst",
        "may",
        "choose",
        "ass",
        "predicted",
        "behavior",
        "criterion",
        "deems",
        "relevant",
        "may",
        "thus",
        "contrary",
        "design",
        "claim",
        "adopt",
        "nonefficiency",
        "criterion",
        "select",
        "legal",
        "rule",
        "political",
        "economy",
        "contrast",
        "investigates",
        "operation",
        "political",
        "institution",
        "electoral",
        "system",
        "court",
        "legislature",
        "executive",
        "administrative",
        "agency",
        "institution",
        "make",
        "policy",
        "determine",
        "people",
        "make",
        "policy",
        "political",
        "economy",
        "thus",
        "seek",
        "explain",
        "content",
        "law",
        "determined",
        "instance",
        "might",
        "understand",
        "political",
        "economy",
        "simply",
        "application",
        "behavioral",
        "claim",
        "constitutional",
        "legal",
        "rule",
        "practice",
        "structure",
        "legislation",
        "administrative",
        "action",
        "adjudication",
        "policy",
        "analysis",
        "political",
        "economy",
        "examine",
        "behavior",
        "policy",
        "analyst",
        "focus",
        "behavior",
        "induced",
        "legal",
        "rule",
        "institution",
        "political",
        "economy",
        "concentrate",
        "behavior",
        "cause",
        "legal",
        "rule",
        "institution",
        "doctrinal",
        "analysis",
        "contrast",
        "focus",
        "content",
        "legal",
        "doctrine",
        "developed",
        "court",
        "adjudication",
        "asserts",
        "efficiency",
        "rationalizes",
        "content",
        "law",
        "might",
        "understand",
        "content",
        "law",
        "least",
        "three",
        "way",
        "first",
        "might",
        "behavioral",
        "claim",
        "refer",
        "behavior",
        "induced",
        "legal",
        "rule",
        "announced",
        "judicial",
        "opinion",
        "alternatively",
        "analyst",
        "interprets",
        "opinion",
        "text",
        "extract",
        "economic",
        "model",
        "underlies",
        "decision",
        "legal",
        "view",
        "world",
        "interpretation",
        "claim",
        "ii",
        "iii",
        "might",
        "true",
        "even",
        "though",
        "legal",
        "rule",
        "induced",
        "inefficient",
        "behavior",
        "real",
        "world",
        "announced",
        "legal",
        "rule",
        "might",
        "efficient",
        "within",
        "implicit",
        "model",
        "used",
        "judge",
        "inefficient",
        "world",
        "actually",
        "first",
        "understanding",
        "doctrinal",
        "analysis",
        "suggests",
        "connection",
        "classical",
        "behavioral",
        "claim",
        "claim",
        "iva",
        "would",
        "also",
        "suggest",
        "doctrinal",
        "analysis",
        "would",
        "developed",
        "substantial",
        "empirical",
        "component",
        "investigated",
        "behavior",
        "doctrine",
        "actually",
        "induced",
        "empirical",
        "component",
        "largely",
        "absent",
        "may",
        "understand",
        "doctrinal",
        "analysis",
        "second",
        "alternative",
        "way",
        "next",
        "section",
        "examines",
        "philosophical",
        "debate",
        "emerged",
        "alternative",
        "nonbehavioral",
        "understanding",
        "doctrinal",
        "analysis",
        "three",
        "strand",
        "may",
        "differentiated",
        "number",
        "way",
        "first",
        "strand",
        "make",
        "different",
        "motivational",
        "assumption",
        "public",
        "official",
        "policy",
        "analysis",
        "generally",
        "assumes",
        "public",
        "official",
        "general",
        "judge",
        "particular",
        "conscientious",
        "judge",
        "thus",
        "enforce",
        "legal",
        "rule",
        "announced",
        "regardless",
        "judge",
        "view",
        "desirability",
        "legal",
        "rule",
        "impact",
        "personally",
        "political",
        "economy",
        "assumes",
        "public",
        "official",
        "motivation",
        "private",
        "individual",
        "selfinterested",
        "subject",
        "bias",
        "private",
        "individual",
        "context",
        "adjudication",
        "elaborated",
        "political",
        "economist",
        "interprets",
        "selfinterested",
        "judicial",
        "behavior",
        "decision",
        "promote",
        "policy",
        "preference",
        "judge",
        "doctrinal",
        "analysis",
        "analyze",
        "behavior",
        "public",
        "official",
        "rationalizes",
        "decision",
        "judge",
        "without",
        "necessarily",
        "imputing",
        "motivation",
        "second",
        "policy",
        "analysis",
        "doctrinal",
        "analysis",
        "generally",
        "adopt",
        "welfarist",
        "stance",
        "towards",
        "evaluation",
        "legal",
        "rule",
        "political",
        "economy",
        "evolved",
        "contractarian",
        "tradition",
        "policy",
        "analyst",
        "evaluating",
        "legal",
        "rule",
        "ask",
        "whether",
        "legal",
        "rule",
        "induces",
        "behavior",
        "satisfies",
        "welfarist",
        "criterion",
        "usually",
        "either",
        "pareto",
        "efficiency",
        "constrained",
        "social",
        "welfare",
        "maximization",
        "political",
        "economy",
        "however",
        "large",
        "extent",
        "emerged",
        "economic",
        "tradition",
        "exemplified",
        "james",
        "buchanan",
        "reject",
        "maximization",
        "social",
        "welfare",
        "criterion",
        "seek",
        "evaluate",
        "political",
        "institution",
        "ground",
        "actual",
        "hypothetical",
        "consent",
        "political",
        "economist",
        "often",
        "asks",
        "whether",
        "rule",
        "induces",
        "pareto",
        "efficiency",
        "whether",
        "party",
        "acted",
        "voluntarily",
        "consented",
        "rule",
        "would",
        "rationally",
        "consented",
        "rule",
        "finally",
        "might",
        "understand",
        "distinction",
        "among",
        "three",
        "strand",
        "difference",
        "view",
        "adopts",
        "instrumentalism",
        "law",
        "instrumentalism",
        "mean",
        "agent",
        "design",
        "law",
        "promote",
        "collective",
        "goal",
        "kornhauser",
        "discus",
        "idea",
        "length",
        "purpose",
        "need",
        "note",
        "several",
        "ambiguity",
        "brief",
        "definition",
        "given",
        "careful",
        "definition",
        "would",
        "specify",
        "agent",
        "design",
        "meaning",
        "design",
        "count",
        "law",
        "collective",
        "purpose",
        "right",
        "note",
        "instrumentalism",
        "may",
        "occur",
        "level",
        "rule",
        "institution",
        "legal",
        "system",
        "whole",
        "policy",
        "analysis",
        "tends",
        "proceed",
        "legal",
        "rule",
        "legal",
        "rule",
        "asks",
        "example",
        "change",
        "standard",
        "care",
        "affect",
        "behavior",
        "tortfeasor",
        "tort",
        "victim",
        "contracting",
        "behavior",
        "differ",
        "measure",
        "damage",
        "shift",
        "expectation",
        "damage",
        "reliance",
        "damage",
        "analyst",
        "thus",
        "imputes",
        "purpose",
        "usually",
        "necessarily",
        "maximization",
        "social",
        "welfare",
        "promulgator",
        "legal",
        "rule",
        "analyst",
        "assumes",
        "policymaker",
        "chosen",
        "legal",
        "rule",
        "best",
        "promotes",
        "imputed",
        "objective",
        "legal",
        "rule",
        "instrumental",
        "achievement",
        "posited",
        "goal",
        "call",
        "approach",
        "rule",
        "instrumentalism",
        "political",
        "economist",
        "contrast",
        "generally",
        "denies",
        "purpose",
        "attributed",
        "promulgator",
        "legal",
        "rule",
        "largely",
        "legal",
        "rule",
        "promulgated",
        "single",
        "individual",
        "power",
        "unilaterally",
        "control",
        "content",
        "rule",
        "certainly",
        "perspective",
        "political",
        "economy",
        "legislator",
        "common",
        "purpose",
        "one",
        "assume",
        "expect",
        "statute",
        "maximizes",
        "social",
        "welfare",
        "legislation",
        "result",
        "interplay",
        "interest",
        "group",
        "reflect",
        "interest",
        "within",
        "society",
        "even",
        "legislature",
        "reflect",
        "interest",
        "within",
        "society",
        "interest",
        "equal",
        "proportionate",
        "say",
        "formulation",
        "statute",
        "finally",
        "even",
        "interest",
        "play",
        "proportionate",
        "role",
        "formulation",
        "statute",
        "arrow",
        "general",
        "possibility",
        "theorem",
        "teach",
        "aggregation",
        "interest",
        "might",
        "still",
        "yield",
        "coherent",
        "purpose",
        "political",
        "economy",
        "thus",
        "reject",
        "rule",
        "instrumentalism",
        "understanding",
        "approach",
        "political",
        "economy",
        "requires",
        "acknowledgment",
        "divergent",
        "view",
        "within",
        "political",
        "economy",
        "distinguish",
        "two",
        "view",
        "constitutional",
        "political",
        "economy",
        "radical",
        "political",
        "economy",
        "reject",
        "rule",
        "instrumentalism",
        "latter",
        "reject",
        "instrumentalism",
        "altogether",
        "one",
        "might",
        "attribute",
        "rejection",
        "rule",
        "instrumentalism",
        "within",
        "political",
        "economy",
        "commitment",
        "explanatory",
        "rather",
        "normative",
        "project",
        "level",
        "constitutional",
        "political",
        "economy",
        "however",
        "research",
        "program",
        "usually",
        "adopts",
        "perspective",
        "constitutional",
        "designer",
        "designer",
        "arguably",
        "view",
        "law",
        "includes",
        "institutional",
        "instrumentalism",
        "ie",
        "legal",
        "institution",
        "rather",
        "specific",
        "legal",
        "rule",
        "promote",
        "specific",
        "goal",
        "constitutional",
        "designer",
        "constitutional",
        "designer",
        "seek",
        "political",
        "structure",
        "promotes",
        "goal",
        "project",
        "constitutional",
        "political",
        "economy",
        "thus",
        "normative",
        "nature",
        "indeed",
        "normative",
        "nature",
        "project",
        "dominates",
        "explanatory",
        "aim",
        "many",
        "within",
        "project",
        "see",
        "brennan",
        "buchanan",
        "argue",
        "one",
        "ought",
        "adopt",
        "economic",
        "theory",
        "behavior",
        "public",
        "official",
        "private",
        "individual",
        "even",
        "theory",
        "best",
        "explanatory",
        "theory",
        "radical",
        "political",
        "economist",
        "reject",
        "reasoning",
        "carry",
        "logic",
        "argument",
        "incoherence",
        "legislative",
        "behavior",
        "level",
        "institutional",
        "constitutional",
        "design",
        "constitution",
        "drafted",
        "agent",
        "political",
        "economic",
        "interest",
        "seek",
        "forward",
        "create",
        "basic",
        "social",
        "economic",
        "political",
        "institution",
        "society",
        "incoherence",
        "may",
        "thus",
        "infect",
        "institution",
        "well",
        "compromise",
        "slavery",
        "u",
        "constitution",
        "example",
        "illustrate",
        "viewed",
        "democratic",
        "equality",
        "element",
        "document",
        "incoherence",
        "radical",
        "political",
        "economist",
        "thus",
        "reject",
        "claim",
        "law",
        "designed",
        "hence",
        "reject",
        "instrumentalism",
        "altogether",
        "relation",
        "doctrinal",
        "analysis",
        "instrumentalism",
        "depends",
        "understanding",
        "project",
        "doctrinal",
        "analysis",
        "understand",
        "doctrinal",
        "analysis",
        "simply",
        "rationalization",
        "doctrine",
        "would",
        "appear",
        "make",
        "assumption",
        "instrumental",
        "nature",
        "law",
        "fact",
        "doctrine",
        "efficient",
        "might",
        "result",
        "intentional",
        "behavior",
        "part",
        "agent",
        "might",
        "simply",
        "emerge",
        "structure",
        "institution",
        "within",
        "public",
        "official",
        "work",
        "hand",
        "understand",
        "doctrinal",
        "analysis",
        "theory",
        "adjudication",
        "clearly",
        "adopts",
        "rule",
        "instrumental",
        "view",
        "law",
        "project",
        "doctrinal",
        "analysis",
        "discussed",
        "greater",
        "length",
        "next",
        "section",
        "difference",
        "level",
        "law",
        "instrumental",
        "law",
        "instrumental",
        "suggest",
        "three",
        "strand",
        "economic",
        "analysis",
        "law",
        "adopt",
        "different",
        "approach",
        "study",
        "adjudication",
        "theory",
        "sketched",
        "discussed",
        "section",
        "significantly",
        "purpose",
        "entry",
        "however",
        "classical",
        "variant",
        "policy",
        "analysis",
        "political",
        "economy",
        "adopt",
        "standard",
        "assumption",
        "neoclassical",
        "economics",
        "individual",
        "seek",
        "maximize",
        "satisfaction",
        "preference",
        "moreover",
        "generally",
        "assume",
        "individual",
        "act",
        "selfinterest",
        "narrowly",
        "defined",
        "approach",
        "present",
        "single",
        "greatest",
        "obstacle",
        "articulation",
        "general",
        "theory",
        "law",
        "confronts",
        "economic",
        "analysis",
        "room",
        "normative",
        "aspect",
        "law",
        "denial",
        "normativity",
        "law",
        "account",
        "vehement",
        "resistance",
        "economic",
        "analysis",
        "provoked",
        "within",
        "legal",
        "academy"
    ]
}