{
    "main_text": "Doctrinal Analysis || Doctrinal Analysis as a Rationalization of Private Law\n2.1 Doctrinal Analysis as a Rationalization of Private Law\n\nScholars thus generally consider doctrinal analysis the core project\nwithin economic analysis of\n law.[9]\n Certainly, legal scholars who work in the central private law areas\nof tort, contract, and property typically understand economic analysis\nof law as doctrinal analysis. This doctrinal analysis has provoked\nsubstantial philosophical attention and critique.\n\nCritiques fall roughly into two groups. The first accepts the\ninstrumentalism of law, at one level or another. It rejects, however,\neither efficiency as the aim of the designer or the assumption of\nrationality underlying any behavioral claim that may be implicated in\na rationalization of doctrine. Issues related to the efficiency\ncriterion are discussed below in section 6. The rejection of economic\nrationality generally rests on its failure to accommodate normativity,\nan issue we discuss in section 4.\n\nThe second set of critics have offered a panoply of alternative\nexplanations of the relevant area of law. These alternative\nexplanations share two features. First, they all take the language of\n“obligation” seriously. Second, and related, they all\nreject the view of doctrine as instrumental. Following Ripstein\n[2016], we shall call these alternative theories deontic\ntheories.\n\nTo assess the debate, however, one must first determine how each side\nin the controversy understands the nature of doctrine and what counts\nas an explanation of it. Phrased differently, we must answer a\nsubstantive and a methodological question: what is private law theory\n(or doctrinal analysis of private law) a theory of? And against what\ncriteria do we assess such theories? \n\nTo begin, consider the substantive question. This question has two\naspects: a jurisdictional aspect and a “textual” aspect.\nConsider the textual aspect first. In doctrinal analysis, economic\nanalysts of law seek to explain the outcomes of cases. An\n“outcome” here means the disposition of the case;\nthe disposition of a case identifies the party that prevailed in the\nlitigation, i.e, on the facts of the case, whether defendant was\nresponsible or\n not.[10].\n The critics of economic analysis of law understand the task of\ndoctrinal analysis differently. Explaining doctrine requires an\nexplanation not of the dispositions of decided cases but of the\nreasoning of those cases and, often, structural and procedural\nfeatures of the litigation that gives rise to the\n reasons.[11]\n\nThe position of the critics is at least perplexing and arguably\nproblematic. They apparently regard dispositions as mere applications\nof law to fact. Yet the practice of common law adjudication arguably\ntreats the disposition as fundamental, i.e., as the aspect of the\ndecision that requires respect. The priority of the disposition over\nthe rule fits the English practice of seriatim  opinions\nwell. In such a practice, each judge offers her reasons for the\ndisposition and may articulate rules. There are no reasons for\ndispositions or rules announced by the court. The court,\nhowever, does announce a disposition.\n\nSimilarly, it is not clear why an account of doctrine\nrequires a rationalization of the bilateral nature of private law\nlitigation. Critics (such as Coleman [2001], Ripstein [2016] and\nWeinrib [1995]) of the doctrinal analysis project in economic analysis\nof law consider this bilateral nature—the fact that\nthis plaintiff sues that defendant and not someone\nelse—essential. They point to the doctrinal analysts’\nfailure to provide an essential explanation as an important aspect of\nthe superiority of their account of private law.\n\nThough the critics are correct that doctrinal analysis does not\nconsider the bilateral structure of private law as essential, it\nnonetheless can account both for how it emerged and why it persists.\nAt the time of the emergence of private law, states were relatively\nsmall and had little capacity to monitor and enforce rules and\nregulations. Indeed, Henry II arguably introduced the common law\ncourts to exert his power more broadly within England. At the time of\nthe emergence of these private law institutions, there were no\nalternative institutions available to induce the desired behavior.\n\n\nMoreover, the bilateral structure of private law exploits the private\ninformation of injured plaintiffs in enforcing the law. It is costly\nfor the state to monitor everyone’s behavior; it is difficult to\nobserve behavior that does not comply with announced norms. Injured\nvictims, however, are well-placed—and, when the law enforces\nmonetary claims for non-compliant behavior, injured victims have the\nincentive—to observe non-compliant behavior. The state\nfrequently exploits this informational advantage of victims by\ncreating private actions as in the antitrust and employment\ndiscrimination regimes in the United States. \n\nThe systematic use of these “private attorneys general” to\npromote public interests points to a deeper reason why the critics err\nwhen they treat the bilateral nature of private litigation as\nessential. This “bilateral nature” is a feature not simply\nof private law adjudication but of adjudication generally. Its\nexplanation should therefore not rest on features peculiar to private\nlaw but on something fundamental to adjudication generally.\n\nTurn now to the jurisdictional aspect of the substantive question.\nWhich outcomes do doctrinal analysts rationalize? The reasoning of\nwhich opinions do the critics analyze? For a practicing lawyer, these\nquestions have an obvious answer: analyze the outcomes or reasoning of\nthe cases in the jurisdiction the law of which applies to the dispute.\nOn this account, we would have a doctrinal analysis of, say, the\ncontract law of New Jersey or the libel law of Montana. Private law\ntheorists, however, have broader ambitions; they seek a more general\ntheory though it is unclear how to generalize from the doctrine of\njurisdiction J to doctrine in the abstract.\n\nDoctrinal analysts within economic analysis of law face a somewhat\nlesser difficulty. Their project simply asks whether a legal rule that\nrationalizes a pattern of outcomes induces efficient behavior (perhaps\nwithin some model). One can pursue this task rule-by-rule and\nindependently of the jurisdiction. The general claim then states\nsimply that the doctrine in most jurisdictions is by-and-large\nrationalized by rules that induce efficient behavior. As more than one\nrule governing the same conduct may induce efficient behavior, there\nis no implication that rules are identical in different\n jurisdictions.[12]\n\n\nFor the critics, however, the problem seems deeper. Some structural\nfeatures of private law may not vary across jurisdictions but the\nrules and the reasons for them do. It is less clear how one explains a\nmass of reasons and rules from different jurisdictions. The difficulty\nincreases the more diverse the set of jurisdictions is. We might\nexpect tort law in the United States to be relatively uniform across\nthe fifty states. After all, the states largely share an approach to\nopinion writing and judges of one state may refer to the decisions of\nanother. We would expect courts from different states to offer similar\n types of reasons. That unity might decrease if we consider\nall common law jurisdictions. After all, the conventions of opinion\nwriting vary across these jurisdictions. Opinions issued from the\njudges of the Queen’s Bench do not obviously offer similar types\nof reasons as those issued by the California Supreme Court. An\nexpansion to civil law jurisdictions increases the range of styles.\nOpinions of the French Cour de Cassation look nothing like the\nopinions of the two previously mentioned common law courts.\n\nThough doctrinal analysts have not been methodologically\nself-conscious, several private law theorists—e.g., Coleman\n[2001], Kraus [2002], Smith [2006], and Ripstein [2016]—have\noutlined the requirements that a theory of private law must satisfy.\nThese authors have articulated at least three criteria that apply to\nthe evaluation of theories of private law: fit, transparency, and\ndeterminancy.\n\n“Fit,” of course, refers to the extent to which the theory\naccounts for the observed phenomena—for the doctrinal economic\nanalysts, the extent to which it accounts for the observed outcomes\nand for the deontic critics the extent to which it accounts for the\nreasoning of the courts and the relevant structural features. Though\ncomparing degrees of fit across interpretations may be difficult, fit\nis uncontroversial as a criterion.\n\n“Transparency” requires that the explanation be internal\nrather than external in the sense that the explanation relies on\nconcepts deployed by judges and other actors producing the outcomes\nand reasoning to be explained. Doctrinal analysis, according to the\ncritics, fails as an explanation of private law because it is opaque\nrather than transparent. Indeed, most of the criticisms of doctrinal\nanalysis reduce, in one way or another, either to a claim that (1) it\nfails to satisfy transparency or (2) as discussed above, it fails to\naccount for the bilateral nature of private law. \n\nTransparency, however, seems an important theoretical ambition only\nfor some accounts of doctrinal analysis. Most obviously, the content\nclaim (claim II) that holds that efficiency determines the content of\nthe law requires transparency when we interpret it as part of the rule\nof recognition. But neither the explanatory claim (claim I) nor the\ndoctrinal claim (claim III) presuppose transparency. The content of a\nlegal rule may be efficient even if judges do not aim at efficiency.\nAn external account of the explanatory claim, however, provides an\nincomplete explanation until it identifies some mechanism that\nexplains how judges, unconcerned about efficiency, nevertheless\ngenerally announce efficient\n rules.[13]\n Similarly, the doctrinal claim (claim III) that efficiency\nrationalizes the outcomes reached by the common law does not\nnecessarily require transparency. \n\n“Determinacy” requires an explanation to make a clear\nprediction of the application of legal rules to facts. Doctrinal\nanalysis often satisfies this criterion; indeed, to the extent it\nseeks to rationalize dispositions, any successful doctrinal analysis\nmust make such predictions. An explanation in doctrinal analysis\nidentifies some “efficient” rule and this rule is\ndeterminate in the sense that it dictates a precise outcome or\ndisposition in specific cases. On the other hand, efficient rules are\noften not unique; more than one rule will induce efficient behavior\nand these rules will not necessarily dictate the same disposition of a\n case.[14]\n\nDeontic theories, by contrast, fare badly under the determinacy\ncriterion. This lack of success may follow from the choice of subject\nmatter to explain. These theories focus on the rules not the\ndispositions.\n\nDeontic critics also reject the instrumentalism of doctrinal analysis.\nDoctrinal analysis treats the law as a means to the end of inducing\nefficient behavior. The value of legal rules derives solely from the\nvalue of the goal sought. On the deontic accounts, by contrast, the\npoint of the law is to do justice between the parties. \n",
    "section_title": "2.1 Doctrinal Analysis as a Rationalization of Private Law",
    "entry_title": "The Economic Analysis of Law",
    "hierarchy_title": "The Economic Analysis of Law || Doctrinal Analysis || Doctrinal Analysis as a Rationalization of Private Law",
    "tokenized_text": [
        "doctrinal",
        "analysis",
        "doctrinal",
        "analysis",
        "rationalization",
        "private",
        "law",
        "doctrinal",
        "analysis",
        "rationalization",
        "private",
        "law",
        "scholar",
        "thus",
        "generally",
        "consider",
        "doctrinal",
        "analysis",
        "core",
        "project",
        "within",
        "economic",
        "analysis",
        "law",
        "certainly",
        "legal",
        "scholar",
        "work",
        "central",
        "private",
        "law",
        "area",
        "tort",
        "contract",
        "property",
        "typically",
        "understand",
        "economic",
        "analysis",
        "law",
        "doctrinal",
        "analysis",
        "doctrinal",
        "analysis",
        "provoked",
        "substantial",
        "philosophical",
        "attention",
        "critique",
        "critique",
        "fall",
        "roughly",
        "two",
        "group",
        "first",
        "accepts",
        "instrumentalism",
        "law",
        "one",
        "level",
        "another",
        "reject",
        "however",
        "either",
        "efficiency",
        "aim",
        "designer",
        "assumption",
        "rationality",
        "underlying",
        "behavioral",
        "claim",
        "may",
        "implicated",
        "rationalization",
        "doctrine",
        "issue",
        "related",
        "efficiency",
        "criterion",
        "discussed",
        "section",
        "rejection",
        "economic",
        "rationality",
        "generally",
        "rest",
        "failure",
        "accommodate",
        "normativity",
        "issue",
        "discus",
        "section",
        "second",
        "set",
        "critic",
        "offered",
        "panoply",
        "alternative",
        "explanation",
        "relevant",
        "area",
        "law",
        "alternative",
        "explanation",
        "share",
        "two",
        "feature",
        "first",
        "take",
        "language",
        "obligation",
        "seriously",
        "second",
        "related",
        "reject",
        "view",
        "doctrine",
        "instrumental",
        "following",
        "ripstein",
        "shall",
        "call",
        "alternative",
        "theory",
        "deontic",
        "theory",
        "ass",
        "debate",
        "however",
        "one",
        "must",
        "first",
        "determine",
        "side",
        "controversy",
        "understands",
        "nature",
        "doctrine",
        "count",
        "explanation",
        "phrased",
        "differently",
        "must",
        "answer",
        "substantive",
        "methodological",
        "question",
        "private",
        "law",
        "theory",
        "doctrinal",
        "analysis",
        "private",
        "law",
        "theory",
        "criterion",
        "ass",
        "theory",
        "begin",
        "consider",
        "substantive",
        "question",
        "question",
        "two",
        "aspect",
        "jurisdictional",
        "aspect",
        "textual",
        "aspect",
        "consider",
        "textual",
        "aspect",
        "first",
        "doctrinal",
        "analysis",
        "economic",
        "analyst",
        "law",
        "seek",
        "explain",
        "outcome",
        "case",
        "outcome",
        "mean",
        "disposition",
        "case",
        "disposition",
        "case",
        "identifies",
        "party",
        "prevailed",
        "litigation",
        "ie",
        "fact",
        "case",
        "whether",
        "defendant",
        "responsible",
        "not",
        "critic",
        "economic",
        "analysis",
        "law",
        "understand",
        "task",
        "doctrinal",
        "analysis",
        "differently",
        "explaining",
        "doctrine",
        "requires",
        "explanation",
        "disposition",
        "decided",
        "case",
        "reasoning",
        "case",
        "often",
        "structural",
        "procedural",
        "feature",
        "litigation",
        "give",
        "rise",
        "reason",
        "position",
        "critic",
        "least",
        "perplexing",
        "arguably",
        "problematic",
        "apparently",
        "regard",
        "disposition",
        "mere",
        "application",
        "law",
        "fact",
        "yet",
        "practice",
        "common",
        "law",
        "adjudication",
        "arguably",
        "treat",
        "disposition",
        "fundamental",
        "ie",
        "aspect",
        "decision",
        "requires",
        "respect",
        "priority",
        "disposition",
        "rule",
        "fit",
        "english",
        "practice",
        "seriatim",
        "opinion",
        "well",
        "practice",
        "judge",
        "offer",
        "reason",
        "disposition",
        "may",
        "articulate",
        "rule",
        "reason",
        "disposition",
        "rule",
        "announced",
        "court",
        "court",
        "however",
        "announce",
        "disposition",
        "similarly",
        "clear",
        "account",
        "doctrine",
        "requires",
        "rationalization",
        "bilateral",
        "nature",
        "private",
        "law",
        "litigation",
        "critic",
        "coleman",
        "ripstein",
        "weinrib",
        "doctrinal",
        "analysis",
        "project",
        "economic",
        "analysis",
        "law",
        "consider",
        "bilateral",
        "naturethe",
        "fact",
        "plaintiff",
        "sue",
        "defendant",
        "someone",
        "elseessential",
        "point",
        "doctrinal",
        "analyst",
        "failure",
        "provide",
        "essential",
        "explanation",
        "important",
        "aspect",
        "superiority",
        "account",
        "private",
        "law",
        "though",
        "critic",
        "correct",
        "doctrinal",
        "analysis",
        "consider",
        "bilateral",
        "structure",
        "private",
        "law",
        "essential",
        "nonetheless",
        "account",
        "emerged",
        "persists",
        "time",
        "emergence",
        "private",
        "law",
        "state",
        "relatively",
        "small",
        "little",
        "capacity",
        "monitor",
        "enforce",
        "rule",
        "regulation",
        "indeed",
        "henry",
        "ii",
        "arguably",
        "introduced",
        "common",
        "law",
        "court",
        "exert",
        "power",
        "broadly",
        "within",
        "england",
        "time",
        "emergence",
        "private",
        "law",
        "institution",
        "alternative",
        "institution",
        "available",
        "induce",
        "desired",
        "behavior",
        "moreover",
        "bilateral",
        "structure",
        "private",
        "law",
        "exploit",
        "private",
        "information",
        "injured",
        "plaintiff",
        "enforcing",
        "law",
        "costly",
        "state",
        "monitor",
        "everyone",
        "behavior",
        "difficult",
        "observe",
        "behavior",
        "comply",
        "announced",
        "norm",
        "injured",
        "victim",
        "however",
        "wellplacedand",
        "law",
        "enforces",
        "monetary",
        "claim",
        "noncompliant",
        "behavior",
        "injured",
        "victim",
        "incentiveto",
        "observe",
        "noncompliant",
        "behavior",
        "state",
        "frequently",
        "exploit",
        "informational",
        "advantage",
        "victim",
        "creating",
        "private",
        "action",
        "antitrust",
        "employment",
        "discrimination",
        "regime",
        "united",
        "state",
        "systematic",
        "use",
        "private",
        "attorney",
        "general",
        "promote",
        "public",
        "interest",
        "point",
        "deeper",
        "reason",
        "critic",
        "err",
        "treat",
        "bilateral",
        "nature",
        "private",
        "litigation",
        "essential",
        "bilateral",
        "nature",
        "feature",
        "simply",
        "private",
        "law",
        "adjudication",
        "adjudication",
        "generally",
        "explanation",
        "therefore",
        "rest",
        "feature",
        "peculiar",
        "private",
        "law",
        "something",
        "fundamental",
        "adjudication",
        "generally",
        "turn",
        "jurisdictional",
        "aspect",
        "substantive",
        "question",
        "outcome",
        "doctrinal",
        "analyst",
        "rationalize",
        "reasoning",
        "opinion",
        "critic",
        "analyze",
        "practicing",
        "lawyer",
        "question",
        "obvious",
        "answer",
        "analyze",
        "outcome",
        "reasoning",
        "case",
        "jurisdiction",
        "law",
        "applies",
        "dispute",
        "account",
        "would",
        "doctrinal",
        "analysis",
        "say",
        "contract",
        "law",
        "new",
        "jersey",
        "libel",
        "law",
        "montana",
        "private",
        "law",
        "theorist",
        "however",
        "broader",
        "ambition",
        "seek",
        "general",
        "theory",
        "though",
        "unclear",
        "generalize",
        "doctrine",
        "jurisdiction",
        "j",
        "doctrine",
        "abstract",
        "doctrinal",
        "analyst",
        "within",
        "economic",
        "analysis",
        "law",
        "face",
        "somewhat",
        "lesser",
        "difficulty",
        "project",
        "simply",
        "asks",
        "whether",
        "legal",
        "rule",
        "rationalizes",
        "pattern",
        "outcome",
        "induces",
        "efficient",
        "behavior",
        "perhaps",
        "within",
        "model",
        "one",
        "pursue",
        "task",
        "rulebyrule",
        "independently",
        "jurisdiction",
        "general",
        "claim",
        "state",
        "simply",
        "doctrine",
        "jurisdiction",
        "byandlarge",
        "rationalized",
        "rule",
        "induce",
        "efficient",
        "behavior",
        "one",
        "rule",
        "governing",
        "conduct",
        "may",
        "induce",
        "efficient",
        "behavior",
        "implication",
        "rule",
        "identical",
        "different",
        "jurisdiction",
        "critic",
        "however",
        "problem",
        "seems",
        "deeper",
        "structural",
        "feature",
        "private",
        "law",
        "may",
        "vary",
        "across",
        "jurisdiction",
        "rule",
        "reason",
        "le",
        "clear",
        "one",
        "explains",
        "mass",
        "reason",
        "rule",
        "different",
        "jurisdiction",
        "difficulty",
        "increase",
        "diverse",
        "set",
        "jurisdiction",
        "might",
        "expect",
        "tort",
        "law",
        "united",
        "state",
        "relatively",
        "uniform",
        "across",
        "fifty",
        "state",
        "state",
        "largely",
        "share",
        "approach",
        "opinion",
        "writing",
        "judge",
        "one",
        "state",
        "may",
        "refer",
        "decision",
        "another",
        "would",
        "expect",
        "court",
        "different",
        "state",
        "offer",
        "similar",
        "type",
        "reason",
        "unity",
        "might",
        "decrease",
        "consider",
        "common",
        "law",
        "jurisdiction",
        "convention",
        "opinion",
        "writing",
        "vary",
        "across",
        "jurisdiction",
        "opinion",
        "issued",
        "judge",
        "queen",
        "bench",
        "obviously",
        "offer",
        "similar",
        "type",
        "reason",
        "issued",
        "california",
        "supreme",
        "court",
        "expansion",
        "civil",
        "law",
        "jurisdiction",
        "increase",
        "range",
        "style",
        "opinion",
        "french",
        "cour",
        "de",
        "cassation",
        "look",
        "nothing",
        "like",
        "opinion",
        "two",
        "previously",
        "mentioned",
        "common",
        "law",
        "court",
        "though",
        "doctrinal",
        "analyst",
        "methodologically",
        "selfconscious",
        "several",
        "private",
        "law",
        "theoristseg",
        "coleman",
        "kraus",
        "smith",
        "ripstein",
        "have",
        "outlined",
        "requirement",
        "theory",
        "private",
        "law",
        "must",
        "satisfy",
        "author",
        "articulated",
        "least",
        "three",
        "criterion",
        "apply",
        "evaluation",
        "theory",
        "private",
        "law",
        "fit",
        "transparency",
        "determinancy",
        "fit",
        "course",
        "refers",
        "extent",
        "theory",
        "account",
        "observed",
        "phenomenafor",
        "doctrinal",
        "economic",
        "analyst",
        "extent",
        "account",
        "observed",
        "outcome",
        "deontic",
        "critic",
        "extent",
        "account",
        "reasoning",
        "court",
        "relevant",
        "structural",
        "feature",
        "though",
        "comparing",
        "degree",
        "fit",
        "across",
        "interpretation",
        "may",
        "difficult",
        "fit",
        "uncontroversial",
        "criterion",
        "transparency",
        "requires",
        "explanation",
        "internal",
        "rather",
        "external",
        "sense",
        "explanation",
        "relies",
        "concept",
        "deployed",
        "judge",
        "actor",
        "producing",
        "outcome",
        "reasoning",
        "explained",
        "doctrinal",
        "analysis",
        "according",
        "critic",
        "fails",
        "explanation",
        "private",
        "law",
        "opaque",
        "rather",
        "transparent",
        "indeed",
        "criticism",
        "doctrinal",
        "analysis",
        "reduce",
        "one",
        "way",
        "another",
        "either",
        "claim",
        "fails",
        "satisfy",
        "transparency",
        "discussed",
        "fails",
        "account",
        "bilateral",
        "nature",
        "private",
        "law",
        "transparency",
        "however",
        "seems",
        "important",
        "theoretical",
        "ambition",
        "account",
        "doctrinal",
        "analysis",
        "obviously",
        "content",
        "claim",
        "claim",
        "ii",
        "hold",
        "efficiency",
        "determines",
        "content",
        "law",
        "requires",
        "transparency",
        "interpret",
        "part",
        "rule",
        "recognition",
        "neither",
        "explanatory",
        "claim",
        "claim",
        "doctrinal",
        "claim",
        "claim",
        "iii",
        "presuppose",
        "transparency",
        "content",
        "legal",
        "rule",
        "may",
        "efficient",
        "even",
        "judge",
        "aim",
        "efficiency",
        "external",
        "account",
        "explanatory",
        "claim",
        "however",
        "provides",
        "incomplete",
        "explanation",
        "identifies",
        "mechanism",
        "explains",
        "judge",
        "unconcerned",
        "efficiency",
        "nevertheless",
        "generally",
        "announce",
        "efficient",
        "rule",
        "similarly",
        "doctrinal",
        "claim",
        "claim",
        "iii",
        "efficiency",
        "rationalizes",
        "outcome",
        "reached",
        "common",
        "law",
        "necessarily",
        "require",
        "transparency",
        "determinacy",
        "requires",
        "explanation",
        "make",
        "clear",
        "prediction",
        "application",
        "legal",
        "rule",
        "fact",
        "doctrinal",
        "analysis",
        "often",
        "satisfies",
        "criterion",
        "indeed",
        "extent",
        "seek",
        "rationalize",
        "disposition",
        "successful",
        "doctrinal",
        "analysis",
        "must",
        "make",
        "prediction",
        "explanation",
        "doctrinal",
        "analysis",
        "identifies",
        "efficient",
        "rule",
        "rule",
        "determinate",
        "sense",
        "dictate",
        "precise",
        "outcome",
        "disposition",
        "specific",
        "case",
        "hand",
        "efficient",
        "rule",
        "often",
        "unique",
        "one",
        "rule",
        "induce",
        "efficient",
        "behavior",
        "rule",
        "necessarily",
        "dictate",
        "disposition",
        "case",
        "deontic",
        "theory",
        "contrast",
        "fare",
        "badly",
        "determinacy",
        "criterion",
        "lack",
        "success",
        "may",
        "follow",
        "choice",
        "subject",
        "matter",
        "explain",
        "theory",
        "focus",
        "rule",
        "disposition",
        "deontic",
        "critic",
        "also",
        "reject",
        "instrumentalism",
        "doctrinal",
        "analysis",
        "doctrinal",
        "analysis",
        "treat",
        "law",
        "mean",
        "end",
        "inducing",
        "efficient",
        "behavior",
        "value",
        "legal",
        "rule",
        "derives",
        "solely",
        "value",
        "goal",
        "sought",
        "deontic",
        "account",
        "contrast",
        "point",
        "law",
        "justice",
        "party"
    ]
}