{
    "main_text": "Abolition and Alternatives\n7. Abolition and Alternatives\n\nAbolitionist theorising about punishment takes many different forms,\nunited only by the insistence that we should seek to abolish, rather\nthan merely to reform, our practices of punishment. (Classic\nabolitionist texts include Christie 1977, 1981; Hulsman 1986, 1991; de\nHaan 1990; Bianchi 1994.) An initial question is precisely what\npractices should be abolished. Some abolitionists focus on particular\nmodes of punishment, such as capital punishment (see, e.g., Brooks\n2004; Yost 2019) or imprisonment (see, e.g., A. Y. Davis 2003).\nWhat’s more, a prominent strand of abolitionism focuses on\nincarceration as practiced in the U.S. context, with links drawn\nbetween imprisonment and the American legacy of slavery, Jim Crow, and\nsegregation (see, e.g., Adelsberg et. al. 2015; McLeod 2019; Roberts\n2019). Insofar as such critiques are grounded in concerns about racial\ndisparities, mass incarceration, police abuses, and other features of\nthe U.S. criminal justice system, they may have implications for other\nU.S. criminal justice practices in addition to incarceration. At the\nsame time, insofar as the critiques are based on particular features\nof the U.S. system, it may be less clear what implications they have\nfor imprisonment as it is implemented in other polities. By contrast,\nother abolitionist accounts focus not on some particular mode(s) of\npunishment, or on a particular mode of punishment as administered in\nthis or that legal system, but rather on criminal punishment in any\nform (see, e.g., Golash 2005; Boonin 2008; Zimmerman 2011). It is\nimportant to be clear about the target of critique: to endorse the\nabolition of imprisonment, or even of criminal punishment in any form,\nas it is currently practiced allows for the possibility that a\nsuitably reformed system of imprisonment or punishment in some other\nform could be justified (and here it may be difficult, as with\nTheseus's ship, to distinguish between radically rebuilding an\nexisting practice and abolishing it in favour of an alternative\npractice).\n\nThe more powerful abolitionist challenge is that punishment cannot be\njustified even in principle. After all, when the state imposes\npunishment, it treats some people in ways that would typically\n(outside the context of punishment) be impermissible. It subjects them\nto intentionally burdensome treatment and to the condemnation of the\ncommunity. Abolitionists find that the various attempted\njustifications of this intentionally burdensome condemnatory treatment\nfail, and thus that the practice is morally wrong — not merely\nin practice but in principle. For such accounts, a central question is\nhow the state should respond to the types of conduct for which one\ncurrently would be subject to punishment. In this section we attend to\nthree notable types of abolitionist theory and the alternatives to\npunishment that they endorse.\n\nMost prominently, many abolitionists look to ‘restorative\njustice’ as an alternative to punishment.\n(‘Restorative’ practices and programmes also play an\nincreasingly significant, although still somewhat marginal, role\nwithin the criminal process of trial and punishment; but our\nconcern here is with restorative justice as an alternative to\npunishment.) The restorative justice movement has been growing in\nstrength: although there are different and conflicting conceptions of\nwhat ‘restorative justice’ means or involves, one central\ntheme is that what crime makes necessary is a process of reparation or\nrestoration between offender, victim, and other interested parties;\nand that this is achieved not through a criminal process of trial and\npunishment, but through mediation or reconciliation programmes that\nbring together the victim, offender and other interested parties to\ndiscuss what was done and how to deal with it (see generally Matthews\n1988; Daly and Immarigeon 1998; von Hirsch and Ashworth 1998, ch. 7;\nBraithwaite 1999; Walgrave 2002; von Hirsch et al 2003; von Hirsch,\nAshworth and Shearing 2005; London 2011; Johnstone 2011, 2012).\n\nAdvocates of restorative justice often contrast it with\n‘retributive’ justice; they argue that we should look for\nrestoration rather than retribution or punishment, and seek to repair\nharms caused rather than to inflict punitive suffering for wrongs\ndone. But one might regard this as a false dichotomy (see Allais 2011;\nDuff 2011a). For when we ask what it is that requires\n‘restoration’ or repair, the answer must refer not only to\nwhatever material harm was caused by the crime, but to the wrong that\nwas done: that was what fractured the relationship between offender\nand victim (and the broader community), and that is what must be\nrecognised and ‘repaired’ or made up for if a genuine\nreconciliation is to be achieved. A restorative process that is to be\nappropriate to crime must therefore be one that seeks an adequate\nrecognition, by the offender and by others, of the wrong done—a\nrecognition that must for the offender, if genuine, be repentant; and\nthat seeks an appropriate apologetic reparation for that wrong from\nthe offender. But those are also the aims of punishment as a species\nof secular penance, as sketched above. A system of criminal\npunishment, however improved it might be, is of course not well\ndesigned to bring about the kind of personal reconciliations and\ntransformations that advocates of restorative justice sometimes seek;\nbut it could be apt to secure the kind of formal, ritualised\nreconciliation that is the most that a liberal state should try to\nsecure between its citizens. If we focus only on imprisonment, which\nis still often the preferred mode of punishment in many penal systems,\nthis suggestion will appear laughable; but if we think instead of\npunishments such as Community Service Orders (now part of what is\ncalled Community Payback) or probation, it might seem more\nplausible.\n\nThis argument does not, of course, support that account of punishment\nagainst its critics. What it might suggest, however, is that although\nwe can learn much from the restorative justice movement, especially\nabout the role that processes of mediation and reparation can play in\nour responses to crime, its aim should not be the abolition or\nreplacement of punishment: ‘restoration’ is better\nunderstood, in this context, as the proper aim of punishment, not as\nan alternative to it (see further Duff 2001, ch. 3.4–6, but also\nZedner 1994).\n\nA similar issue is raised by the second kind of abolitionist theory\nthat we should note here: the argument that we should replace\npunishment by a system of enforced restitution (see e.g., Barnett\n1977; Boonin 2008: ch. 5 — which also cites and discusses a\nnumber of objections to the theory). For we need to ask what\nrestitution can amount to, what it should involve, if it is to\nconstitute restitution not merely for any harm that might have been\ncaused, but for the wrong that was done; and it is tempting to answer\nthat restitution for a wrong must involve the kind of apologetic moral\nreparation, expressing a remorseful recognition of the wrong, that\ncommunicative punishment (on the view sketched above) aims to\nbecome.\n\nMore generally, advocates of restorative justice and of restitution\nare right to highlight the question of what offenders owe to those\nwhom they have wronged — and to their fellow citizens (see also\nTadros 2011 for a focus on the duties that offenders incur). Some\npenal theorists, however, especially those who connect punishment to\napology, will reply that what offenders owe precisely includes\naccepting, undertaking, or undergoing punishment.\n\nA third alternative approach that has gained some prominence in recent\nyears is grounded in belief in free will scepticism, the view that\nhuman behaviour is a result of free will but of determinism, luck, or\nchance, and thus that the notions of moral responsibility and desert\non which many accounts of punishment (especially retributivist\ntheories) depend are misguided (see s. 5). As an alternative to\nholding offenders responsible, or giving them their just deserts, some\nfree will sceptics (see Pereboom 2013; Caruso 2021) instead endorse\nincapacitating dangerous offenders on a model similar to that of\npublic health quarantines. Just as it can arguably be justified to\nquarantine someone carrying a transmissible disease even if that\nperson is not morally responsible for the threat they pose, proponents\nof the quarantine model contend that it can be justified to\nincapacitate dangerous offenders even if they are not morally\nresponsible for what they have done or for the danger they present.\nOne question is whether the quarantine model is best understood as an\nalternative to punishment or as an alternative form of punishment.\nBeyond questions of labelling, however, such views also face various\nlines of critique. In particular, because they discard the notions of\nmoral responsibility and desert, they face objections, similar to\nthose faced by pure consequentialist accounts (see s. 3), that they\ncannot in principle rule out disproportionate punishment, or that they\nare inconsistent with respect for persons and with human dignity (see,\ne.g., Smilansky 2011).\n",
    "section_title": "7. Abolition and Alternatives",
    "entry_title": "Legal Punishment",
    "hierarchy_title": "Legal Punishment || Abolition and Alternatives",
    "tokenized_text": [
        "abolition",
        "alternative",
        "abolition",
        "alternative",
        "abolitionist",
        "theorising",
        "punishment",
        "take",
        "many",
        "different",
        "form",
        "united",
        "insistence",
        "seek",
        "abolish",
        "rather",
        "merely",
        "reform",
        "practice",
        "punishment",
        "classic",
        "abolitionist",
        "text",
        "include",
        "christie",
        "hulsman",
        "de",
        "haan",
        "bianchi",
        "initial",
        "question",
        "precisely",
        "practice",
        "abolished",
        "abolitionist",
        "focus",
        "particular",
        "mode",
        "punishment",
        "capital",
        "punishment",
        "see",
        "eg",
        "brook",
        "yost",
        "imprisonment",
        "see",
        "eg",
        "a",
        "y",
        "davis",
        "prominent",
        "strand",
        "abolitionism",
        "focus",
        "incarceration",
        "practiced",
        "us",
        "context",
        "link",
        "drawn",
        "imprisonment",
        "american",
        "legacy",
        "slavery",
        "jim",
        "crow",
        "segregation",
        "see",
        "eg",
        "adelsberg",
        "et",
        "al",
        "mcleod",
        "robert",
        "insofar",
        "critique",
        "grounded",
        "concern",
        "racial",
        "disparity",
        "mass",
        "incarceration",
        "police",
        "abuse",
        "feature",
        "us",
        "criminal",
        "justice",
        "system",
        "may",
        "implication",
        "us",
        "criminal",
        "justice",
        "practice",
        "addition",
        "incarceration",
        "time",
        "insofar",
        "critique",
        "based",
        "particular",
        "feature",
        "us",
        "system",
        "may",
        "le",
        "clear",
        "implication",
        "imprisonment",
        "implemented",
        "polity",
        "contrast",
        "abolitionist",
        "account",
        "focus",
        "particular",
        "mode",
        "punishment",
        "particular",
        "mode",
        "punishment",
        "administered",
        "legal",
        "system",
        "rather",
        "criminal",
        "punishment",
        "form",
        "see",
        "eg",
        "golash",
        "boonin",
        "zimmerman",
        "important",
        "clear",
        "target",
        "critique",
        "endorse",
        "abolition",
        "imprisonment",
        "even",
        "criminal",
        "punishment",
        "form",
        "currently",
        "practiced",
        "allows",
        "possibility",
        "suitably",
        "reformed",
        "system",
        "imprisonment",
        "punishment",
        "form",
        "could",
        "justified",
        "may",
        "difficult",
        "theseus",
        "s",
        "ship",
        "distinguish",
        "radically",
        "rebuilding",
        "existing",
        "practice",
        "abolishing",
        "favour",
        "alternative",
        "practice",
        "powerful",
        "abolitionist",
        "challenge",
        "punishment",
        "justified",
        "even",
        "principle",
        "state",
        "imposes",
        "punishment",
        "treat",
        "people",
        "way",
        "would",
        "typically",
        "outside",
        "context",
        "punishment",
        "impermissible",
        "subject",
        "intentionally",
        "burdensome",
        "treatment",
        "condemnation",
        "community",
        "abolitionist",
        "find",
        "various",
        "attempted",
        "justification",
        "intentionally",
        "burdensome",
        "condemnatory",
        "treatment",
        "fail",
        "thus",
        "practice",
        "morally",
        "wrong",
        "merely",
        "practice",
        "principle",
        "account",
        "central",
        "question",
        "state",
        "respond",
        "type",
        "conduct",
        "one",
        "currently",
        "would",
        "subject",
        "punishment",
        "section",
        "attend",
        "three",
        "notable",
        "type",
        "abolitionist",
        "theory",
        "alternative",
        "punishment",
        "endorse",
        "prominently",
        "many",
        "abolitionist",
        "look",
        "restorative",
        "justice",
        "alternative",
        "punishment",
        "restorative",
        "practice",
        "programme",
        "also",
        "play",
        "increasingly",
        "significant",
        "although",
        "still",
        "somewhat",
        "marginal",
        "role",
        "within",
        "criminal",
        "process",
        "trial",
        "punishment",
        "concern",
        "restorative",
        "justice",
        "alternative",
        "punishment",
        "restorative",
        "justice",
        "movement",
        "growing",
        "strength",
        "although",
        "different",
        "conflicting",
        "conception",
        "restorative",
        "justice",
        "mean",
        "involves",
        "one",
        "central",
        "theme",
        "crime",
        "make",
        "necessary",
        "process",
        "reparation",
        "restoration",
        "offender",
        "victim",
        "interested",
        "party",
        "achieved",
        "criminal",
        "process",
        "trial",
        "punishment",
        "mediation",
        "reconciliation",
        "programme",
        "bring",
        "together",
        "victim",
        "offender",
        "interested",
        "party",
        "discus",
        "done",
        "deal",
        "see",
        "generally",
        "matthew",
        "daly",
        "immarigeon",
        "von",
        "hirsch",
        "ashworth",
        "ch",
        "braithwaite",
        "walgrave",
        "von",
        "hirsch",
        "et",
        "al",
        "von",
        "hirsch",
        "ashworth",
        "shearing",
        "london",
        "johnstone",
        "advocate",
        "restorative",
        "justice",
        "often",
        "contrast",
        "retributive",
        "justice",
        "argue",
        "look",
        "restoration",
        "rather",
        "retribution",
        "punishment",
        "seek",
        "repair",
        "harm",
        "caused",
        "rather",
        "inflict",
        "punitive",
        "suffering",
        "wrong",
        "done",
        "one",
        "might",
        "regard",
        "false",
        "dichotomy",
        "see",
        "allais",
        "duff",
        "a",
        "ask",
        "requires",
        "restoration",
        "repair",
        "answer",
        "must",
        "refer",
        "whatever",
        "material",
        "harm",
        "caused",
        "crime",
        "wrong",
        "done",
        "fractured",
        "relationship",
        "offender",
        "victim",
        "broader",
        "community",
        "must",
        "recognised",
        "repaired",
        "made",
        "genuine",
        "reconciliation",
        "achieved",
        "restorative",
        "process",
        "appropriate",
        "crime",
        "must",
        "therefore",
        "one",
        "seek",
        "adequate",
        "recognition",
        "offender",
        "others",
        "wrong",
        "donea",
        "recognition",
        "must",
        "offender",
        "genuine",
        "repentant",
        "seek",
        "appropriate",
        "apologetic",
        "reparation",
        "wrong",
        "offender",
        "also",
        "aim",
        "punishment",
        "specie",
        "secular",
        "penance",
        "sketched",
        "system",
        "criminal",
        "punishment",
        "however",
        "improved",
        "might",
        "course",
        "well",
        "designed",
        "bring",
        "kind",
        "personal",
        "reconciliation",
        "transformation",
        "advocate",
        "restorative",
        "justice",
        "sometimes",
        "seek",
        "could",
        "apt",
        "secure",
        "kind",
        "formal",
        "ritualised",
        "reconciliation",
        "liberal",
        "state",
        "try",
        "secure",
        "citizen",
        "focus",
        "imprisonment",
        "still",
        "often",
        "preferred",
        "mode",
        "punishment",
        "many",
        "penal",
        "system",
        "suggestion",
        "appear",
        "laughable",
        "think",
        "instead",
        "punishment",
        "community",
        "service",
        "order",
        "part",
        "called",
        "community",
        "payback",
        "probation",
        "might",
        "seem",
        "plausible",
        "argument",
        "course",
        "support",
        "account",
        "punishment",
        "critic",
        "might",
        "suggest",
        "however",
        "although",
        "learn",
        "much",
        "restorative",
        "justice",
        "movement",
        "especially",
        "role",
        "process",
        "mediation",
        "reparation",
        "play",
        "response",
        "crime",
        "aim",
        "abolition",
        "replacement",
        "punishment",
        "restoration",
        "better",
        "understood",
        "context",
        "proper",
        "aim",
        "punishment",
        "alternative",
        "see",
        "duff",
        "ch",
        "also",
        "zedner",
        "similar",
        "issue",
        "raised",
        "second",
        "kind",
        "abolitionist",
        "theory",
        "note",
        "argument",
        "replace",
        "punishment",
        "system",
        "enforced",
        "restitution",
        "see",
        "eg",
        "barnett",
        "boonin",
        "ch",
        "also",
        "cite",
        "discus",
        "number",
        "objection",
        "theory",
        "need",
        "ask",
        "restitution",
        "amount",
        "involve",
        "constitute",
        "restitution",
        "merely",
        "harm",
        "might",
        "caused",
        "wrong",
        "done",
        "tempting",
        "answer",
        "restitution",
        "wrong",
        "must",
        "involve",
        "kind",
        "apologetic",
        "moral",
        "reparation",
        "expressing",
        "remorseful",
        "recognition",
        "wrong",
        "communicative",
        "punishment",
        "view",
        "sketched",
        "aim",
        "become",
        "generally",
        "advocate",
        "restorative",
        "justice",
        "restitution",
        "right",
        "highlight",
        "question",
        "offender",
        "owe",
        "wronged",
        "fellow",
        "citizen",
        "see",
        "also",
        "tadros",
        "focus",
        "duty",
        "offender",
        "incur",
        "penal",
        "theorist",
        "however",
        "especially",
        "connect",
        "punishment",
        "apology",
        "reply",
        "offender",
        "owe",
        "precisely",
        "includes",
        "accepting",
        "undertaking",
        "undergoing",
        "punishment",
        "third",
        "alternative",
        "approach",
        "gained",
        "prominence",
        "recent",
        "year",
        "grounded",
        "belief",
        "free",
        "scepticism",
        "view",
        "human",
        "behaviour",
        "result",
        "free",
        "determinism",
        "luck",
        "chance",
        "thus",
        "notion",
        "moral",
        "responsibility",
        "desert",
        "many",
        "account",
        "punishment",
        "especially",
        "retributivist",
        "theory",
        "depend",
        "misguided",
        "see",
        "s",
        "alternative",
        "holding",
        "offender",
        "responsible",
        "giving",
        "desert",
        "free",
        "sceptic",
        "see",
        "pereboom",
        "caruso",
        "instead",
        "endorse",
        "incapacitating",
        "dangerous",
        "offender",
        "model",
        "similar",
        "public",
        "health",
        "quarantine",
        "arguably",
        "justified",
        "quarantine",
        "someone",
        "carrying",
        "transmissible",
        "disease",
        "even",
        "person",
        "morally",
        "responsible",
        "threat",
        "pose",
        "proponent",
        "quarantine",
        "model",
        "contend",
        "justified",
        "incapacitate",
        "dangerous",
        "offender",
        "even",
        "morally",
        "responsible",
        "done",
        "danger",
        "present",
        "one",
        "question",
        "whether",
        "quarantine",
        "model",
        "best",
        "understood",
        "alternative",
        "punishment",
        "alternative",
        "form",
        "punishment",
        "beyond",
        "question",
        "labelling",
        "however",
        "view",
        "also",
        "face",
        "various",
        "line",
        "critique",
        "particular",
        "discard",
        "notion",
        "moral",
        "responsibility",
        "desert",
        "face",
        "objection",
        "similar",
        "faced",
        "pure",
        "consequentialist",
        "account",
        "see",
        "s",
        "principle",
        "rule",
        "disproportionate",
        "punishment",
        "inconsistent",
        "respect",
        "person",
        "human",
        "dignity",
        "see",
        "eg",
        "smilansky"
    ]
}