{
    "main_text": "Precedent\n2. Precedent\n\n\nArguments from precedent are a prominent feature of legal\nreasoning. But what exactly is a ‘precedent’?  A precedent\nis the decision of a court (or other adjudicative body) that has a\nspecial legal significance. That significance lies in the\ncourt's decision being regarded as having practical,\nand not merely theoretical, authority over the content of the\nlaw. A decision has theoretical authority if the circumstances in\nwhich it was made (the identity of the decision-makers, those involved\nin arguing the case, the availability of evidence or time) provide\ngood reasons for believing the decision to be correct in law. If there\nare good reasons to believe that an earlier case was correctly\ndecided, and if the facts in a later case are the same as those in the\nearlier case, then there are good reasons for believing that the same\ndecision would be correct in the later case. In some legal systems\nearlier decisions are, officially, treated in just this way: cases are\ncited to courts, but courts may only justify their decisions by\nreference to other legal materials such as legislation. As a\nconsequence the decision in an earlier case is not in itself regarded\nas a justification for reaching a decision in a later\n case.[1]\n\n\nBy contrast, precedents have practical authority because they are\nregarded as partly constituting the law. Simplifying somewhat, the law\nis what the court stated it to be because the court stated it\nto be such. Putting the matter in these terms is over-simplified,\nhowever, because (a) it may be that what the court did,\nrather than what it said, that alters the law, and (b) there are\nnormally a number of limitations on the capacity of a decision to\nconstitute the law (depending upon the content of the decision and the\nstatus of the body making them). An important consequence of\nprecedents' practical authority is this: since courts are bound to apply the\nlaw, and since earlier decisions have practical authority over the\ncontent of the law (i.e., over what is the law), later courts\nare bound to follow the decisions of earlier cases. This is commonly\nknown as the doctrine of precedent, or stare decisis\n(i.e., standing by things decided).\n\n\nIt should be noted that the modern Common Law endorses a particularly\nstrong version of stare decisis, one that requires later\ncourts to follow earlier decisions even if those cases were\nwrongly decided according to the pre-existing law. It is often assumed\nby Common Lawyers that a doctrine of stare decisis\nnecessarily requires that later courts be bound by such erroneous\ndecisions. This follows from the following line of thought. If later\ncourts were not bound to follow erroneous decisions, then they would\nonly be ‘bound’ by earlier, correct judgments. But an\nearlier correct judgment simply reaches the conclusion that the law\nalready supported when it was delivered. So to direct courts to follow\ncases that were not erroneous would simply be to direct them to do\nwhat they are legally bound to do anyway (i.e., apply the law),\nthereby rendering the doctrine of precedent redundant. The flaw in\nthis argument lies in the assumption that in every case there must be\na single legally correct outcome, with other outcomes being\nwrong. This overlooks the possibility of cases in which the merits of\nthe dispute are legally indeterminate, so that there is more than one\npossible outcome that would not be wrong.  To say that a case is\n‘legally indeterminate’ covers a range of situations, such\nas the merits of the opposing arguments being, in law, equal, or where\nthe conflicting considerations cannot be rationally ranked against\neach other. In cases such as these the decision alters the law without\nmaking any error. The Common Law, then, might have limited its\ndoctrine of stare decisis by holding that later courts were\nnot bound by earlier decisions that were wrongly\n decided.[2] \n Instead it developed a different practice—that of\n‘overruling’, whereby some courts were given a limited\npower to deprive earlier decisions of their binding status on the\nbasis that they were wrongly decided. So the Common Law's\nversion of the doctrine of precedent does not inevitably flow from the\nfact that precedents have practical authority. Nonetheless the idea of\nbeing bound to follow even erroneous decisions is a common feature of\nmany institutions decision-making, and will be the focus of this\nentry.\n\n\nThe precise operation of stare decisis varies from one legal\nsystem to another. It is common for courts lower in a judicial\nhierarchy to be strictly bound by the decisions of higher courts, so\nthat Federal Court judges in the United States are bound by decisions\nof the Federal Court of Appeals for their circuit, and the English\nCourt of Appeal is bound by decisions of the House of Lords. The lower\ncourt is ‘strictly’ bound because it has no power to\noverrule the higher court's decision.  Equally, most appeal\ncourts are bound by their own earlier decisions, though they are\ngenerally entitled in certain circumstances to overrule those\ndecisions. There is enormous variation in the circumstances that are\nnecessary for a court to overrule one of its own decisions: at a\nminimum it must regard the earlier decision as wrongly decided, but\ngenerally more is required than this, e.g. that the decision is\n‘clearly’ or ‘plainly’\n wrong.[3].\n Finally, courts are generally not bound by the decisions of lower\ncourts: the House of Lords for example is not bound to follow\ndecisions of the Court of Appeal and is free to overrule such\ndecisions if it takes a different view of how the case should have\nbeen decided.\n\n\nThe most important limitation on the application of precedent is that\nthe decision in an earlier case is only binding in later cases where\nthe facts in the later case are the ‘same’ as those in the\nearlier case. It is agreed on all sides that if two cases are the same\nthen the precedent applies, whereas if they are different it does\nnot. What makes two cases the same, however, is a matter of\nconsiderable debate, and goes to the root of the question of the\nnature of precedent in legal reasoning. In saying that two cases are\nthe same, it cannot be that they are identical. It is obvious\nthat no two situations are identical in every respect: they must\ndiffer at least in having occurred at different times and/or different\nplaces. In practice the differences between any two cases will be much\nmore significant than this, and yet they may—legally\nspeaking—still be the same. For this reason, theorists often\nspeak of two cases being the same in ‘all relevant\nrespects’. Which of course simply raises the question of what\nmakes two cases ‘relevantly’ the same.\n\n\nThis problem is easier to understand if a number of distinct aspects\nof legal cases are taken into account. Most cases do not create\nprecedents: they turn on a dispute about the facts—who did what,\nwhen, and to whom. In these cases the job of the court is to decide on\nthe evidence before it whose version of the facts to endorse. The\nparties in such cases agree about the law that applies to their\ndispute, they simply disagree about what actually happened. In other\ncases there can be a dispute over the applicable\nlaw—one side claiming that on the facts the appropriate\nlaw supports a decision in their favour and the other side disputing\nthis account of the law and arguing that on those facts the law\nsupports a decision in favour of them. (It goes without saying that\nthere are also cases with disputes over both the facts and the law.)\nPrecedents are those cases which require the courts to resolve a\ndispute over the law.\n\n\nA precedent is the decision on the law in a\ncase before a court or some similar legal\ndecision-maker such as a tribunal. Paradigmatically in Common Law\nlegal systems a judicial decision is given in a\njudgment which has five aspects to it:\n\na recitation of the facts of the case, i.e., an\naccount of what\n happened[4];\nan identification of the legal issue—the\ndisputed question of law—which the court is being asked to\nresolve;\nthe reasoning over the appropriate resolution of\nthat issue;\nthe ruling resolving the issue put before the\ncourt, e.g. that in these circumstances the defendant has breached a\ncontract, or does not owe the plaintiff a duty of care, or holds the\nproperty on trust for a third party, or made a decision contrary to\nnatural justice; and\nthe result or outcome of the case, i.e., which\nparty succeeded in the action; which follows from (d).\n\n\n\n(For a more detailed discussion, see MacCormick 1987, 170ff.)  To take\nan example, the court may be faced with a case in which the trustee of\nproperty held on behalf of the plaintiff has wrongfully transferred\nthat property to the defendant. The plaintiff sues the defendant to\nrecover the property which was transferred in breach of trust.  The\nplaintiff argues that since (i) the defendant has received trust\nproperty (ii) in breach of trust and (iii) has not paid for the\nproperty, she should restore the property to the trust.  The defendant\nargues, on the other hand, that since (iv) the trustee had a good\ntitle to the property, (v) the power to transfer it and (vi) the\ndefendant acted in good faith, unaware of the breach of trust, she is\nentitled to retain it. The court will assess the situation and may\nrule that factors (i)–(iii) do give the plaintiff a good action,\ni.e., that a recipient of trust property transferred in breach of\ntrust who has not paid for the property must restore it. In its\nreasoning the court will explain why the fact that the defendant\nreceived the property as a gift means that it should be\nrestored to the trust, despite the trustee having the legal power to\ntransfer the title.\n\n\nThe identification of the subset of factors (i)–(iii) that\nconstitute the ruling is not always a straightforward task: this has\nto be determined from construing the judgment as a whole in the\ncontext of the area of law with which it deals. In particular it can\nbe difficult to ascertain the appropriate level of abstraction of the\ndescriptions of factors (i)–(iii). A person is made ill by\ndrinking an opaque bottle of ginger beer containing a decomposing\n snail.[5] \n The manufacturer of the bottle is held to be liable to the person\nmade ill, despite the absence of any contract between her and the\nmanufacturer. What is the key characterisation of the vehicle of harm\non these facts?  The bottle of ginger beer is a beverage, but it\nis also a consumable, an article for human use and something capable\nof causing injury if negligently produced. (See further Stone 1985,\n125). Generally the judgment needs to be read as a whole to determine\nthe appropriate level: in particular the court's reasoning will\ntend to support one level of generality over another. In some cases,\nhowever, the level of generality will not be clear and it will not be\npossible to give a very precise account of the ruling. In other cases\nthe category may be incompletely characterised: there will be examples\nof items falling within the category but no general characterisation\nof it (see Levenbook 2000, 201–11).\n\n\nThis point brings out an important aspect of the study of\nprecedent. Lawyers are mostly preoccupied with two issues: (1)\nthe question of how to determine what a precedent is authority\nfor, e.g. how to characterise the ruling in the case\n(beverage? consumable?  article?), or how to deal with cases where\nthere is no single majority judgment in favour of the result, or how to\ntreat cases which give two alternative bases for the decision; and (2)\nthe question of when a court will be willing to overrule its own prior\ndecisions. The most interesting philosophical questions, however,\nconcern how precedents operate when, as is often the case, there is no\ndoubt about what the precedent is authority for, and the later court is\nnot free (or is unwilling) to overrule the earlier decision.\n\n\nThere are three ways in which it has been argued that precedents\nshould be\n understood:[6]\n (1) as laying down rules, (2) as the application of underlying\nprinciples, and (3) as a decision on the balance of reasons.\n",
    "section_title": "2. Precedent",
    "entry_title": "Precedent and Analogy in Legal Reasoning",
    "hierarchy_title": "Precedent and Analogy in Legal Reasoning || Precedent",
    "tokenized_text": [
        "precedent",
        "precedent",
        "argument",
        "precedent",
        "prominent",
        "feature",
        "legal",
        "reasoning",
        "exactly",
        "precedent",
        "precedent",
        "decision",
        "court",
        "adjudicative",
        "body",
        "special",
        "legal",
        "significance",
        "significance",
        "lie",
        "court",
        "s",
        "decision",
        "regarded",
        "practical",
        "merely",
        "theoretical",
        "authority",
        "content",
        "law",
        "decision",
        "theoretical",
        "authority",
        "circumstance",
        "made",
        "identity",
        "decisionmakers",
        "involved",
        "arguing",
        "case",
        "availability",
        "evidence",
        "time",
        "provide",
        "good",
        "reason",
        "believing",
        "decision",
        "correct",
        "law",
        "good",
        "reason",
        "believe",
        "earlier",
        "case",
        "correctly",
        "decided",
        "fact",
        "later",
        "case",
        "earlier",
        "case",
        "good",
        "reason",
        "believing",
        "decision",
        "would",
        "correct",
        "later",
        "case",
        "legal",
        "system",
        "earlier",
        "decision",
        "officially",
        "treated",
        "way",
        "case",
        "cited",
        "court",
        "court",
        "may",
        "justify",
        "decision",
        "reference",
        "legal",
        "material",
        "legislation",
        "consequence",
        "decision",
        "earlier",
        "case",
        "regarded",
        "justification",
        "reaching",
        "decision",
        "later",
        "case",
        "contrast",
        "precedent",
        "practical",
        "authority",
        "regarded",
        "partly",
        "constituting",
        "law",
        "simplifying",
        "somewhat",
        "law",
        "court",
        "stated",
        "court",
        "stated",
        "putting",
        "matter",
        "term",
        "oversimplified",
        "however",
        "may",
        "court",
        "rather",
        "said",
        "alters",
        "law",
        "b",
        "normally",
        "number",
        "limitation",
        "capacity",
        "decision",
        "constitute",
        "law",
        "depending",
        "upon",
        "content",
        "decision",
        "status",
        "body",
        "making",
        "important",
        "consequence",
        "precedent",
        "practical",
        "authority",
        "since",
        "court",
        "bound",
        "apply",
        "law",
        "since",
        "earlier",
        "decision",
        "practical",
        "authority",
        "content",
        "law",
        "ie",
        "law",
        "later",
        "court",
        "bound",
        "follow",
        "decision",
        "earlier",
        "case",
        "commonly",
        "known",
        "doctrine",
        "precedent",
        "stare",
        "decisis",
        "ie",
        "standing",
        "thing",
        "decided",
        "noted",
        "modern",
        "common",
        "law",
        "endorses",
        "particularly",
        "strong",
        "version",
        "stare",
        "decisis",
        "one",
        "requires",
        "later",
        "court",
        "follow",
        "earlier",
        "decision",
        "even",
        "case",
        "wrongly",
        "decided",
        "according",
        "preexisting",
        "law",
        "often",
        "assumed",
        "common",
        "lawyer",
        "doctrine",
        "stare",
        "decisis",
        "necessarily",
        "requires",
        "later",
        "court",
        "bound",
        "erroneous",
        "decision",
        "follows",
        "following",
        "line",
        "thought",
        "later",
        "court",
        "bound",
        "follow",
        "erroneous",
        "decision",
        "would",
        "bound",
        "earlier",
        "correct",
        "judgment",
        "earlier",
        "correct",
        "judgment",
        "simply",
        "reach",
        "conclusion",
        "law",
        "already",
        "supported",
        "delivered",
        "direct",
        "court",
        "follow",
        "case",
        "erroneous",
        "would",
        "simply",
        "direct",
        "legally",
        "bound",
        "anyway",
        "ie",
        "apply",
        "law",
        "thereby",
        "rendering",
        "doctrine",
        "precedent",
        "redundant",
        "flaw",
        "argument",
        "lie",
        "assumption",
        "every",
        "case",
        "must",
        "single",
        "legally",
        "correct",
        "outcome",
        "outcome",
        "wrong",
        "overlook",
        "possibility",
        "case",
        "merit",
        "dispute",
        "legally",
        "indeterminate",
        "one",
        "possible",
        "outcome",
        "would",
        "wrong",
        "say",
        "case",
        "legally",
        "indeterminate",
        "cover",
        "range",
        "situation",
        "merit",
        "opposing",
        "argument",
        "law",
        "equal",
        "conflicting",
        "consideration",
        "rationally",
        "ranked",
        "case",
        "decision",
        "alters",
        "law",
        "without",
        "making",
        "error",
        "common",
        "law",
        "might",
        "limited",
        "doctrine",
        "stare",
        "decisis",
        "holding",
        "later",
        "court",
        "bound",
        "earlier",
        "decision",
        "wrongly",
        "decided",
        "instead",
        "developed",
        "different",
        "practicethat",
        "overruling",
        "whereby",
        "court",
        "given",
        "limited",
        "power",
        "deprive",
        "earlier",
        "decision",
        "binding",
        "status",
        "basis",
        "wrongly",
        "decided",
        "common",
        "law",
        "s",
        "version",
        "doctrine",
        "precedent",
        "inevitably",
        "flow",
        "fact",
        "precedent",
        "practical",
        "authority",
        "nonetheless",
        "idea",
        "bound",
        "follow",
        "even",
        "erroneous",
        "decision",
        "common",
        "feature",
        "many",
        "institution",
        "decisionmaking",
        "focus",
        "entry",
        "precise",
        "operation",
        "stare",
        "decisis",
        "varies",
        "one",
        "legal",
        "system",
        "another",
        "common",
        "court",
        "lower",
        "judicial",
        "hierarchy",
        "strictly",
        "bound",
        "decision",
        "higher",
        "court",
        "federal",
        "court",
        "judge",
        "united",
        "state",
        "bound",
        "decision",
        "federal",
        "court",
        "appeal",
        "circuit",
        "english",
        "court",
        "appeal",
        "bound",
        "decision",
        "house",
        "lord",
        "lower",
        "court",
        "strictly",
        "bound",
        "power",
        "overrule",
        "higher",
        "court",
        "s",
        "decision",
        "equally",
        "appeal",
        "court",
        "bound",
        "earlier",
        "decision",
        "though",
        "generally",
        "entitled",
        "certain",
        "circumstance",
        "overrule",
        "decision",
        "enormous",
        "variation",
        "circumstance",
        "necessary",
        "court",
        "overrule",
        "one",
        "decision",
        "minimum",
        "must",
        "regard",
        "earlier",
        "decision",
        "wrongly",
        "decided",
        "generally",
        "required",
        "eg",
        "decision",
        "clearly",
        "plainly",
        "wrong",
        "finally",
        "court",
        "generally",
        "bound",
        "decision",
        "lower",
        "court",
        "house",
        "lord",
        "example",
        "bound",
        "follow",
        "decision",
        "court",
        "appeal",
        "free",
        "overrule",
        "decision",
        "take",
        "different",
        "view",
        "case",
        "decided",
        "important",
        "limitation",
        "application",
        "precedent",
        "decision",
        "earlier",
        "case",
        "binding",
        "later",
        "case",
        "fact",
        "later",
        "case",
        "earlier",
        "case",
        "agreed",
        "side",
        "two",
        "case",
        "precedent",
        "applies",
        "whereas",
        "different",
        "make",
        "two",
        "case",
        "however",
        "matter",
        "considerable",
        "debate",
        "go",
        "root",
        "question",
        "nature",
        "precedent",
        "legal",
        "reasoning",
        "saying",
        "two",
        "case",
        "identical",
        "obvious",
        "two",
        "situation",
        "identical",
        "every",
        "respect",
        "must",
        "differ",
        "least",
        "occurred",
        "different",
        "time",
        "andor",
        "different",
        "place",
        "practice",
        "difference",
        "two",
        "case",
        "much",
        "significant",
        "yet",
        "maylegally",
        "speakingstill",
        "reason",
        "theorist",
        "often",
        "speak",
        "two",
        "case",
        "relevant",
        "respect",
        "course",
        "simply",
        "raise",
        "question",
        "make",
        "two",
        "case",
        "relevantly",
        "problem",
        "easier",
        "understand",
        "number",
        "distinct",
        "aspect",
        "legal",
        "case",
        "taken",
        "account",
        "case",
        "create",
        "precedent",
        "turn",
        "dispute",
        "factswho",
        "case",
        "job",
        "court",
        "decide",
        "evidence",
        "whose",
        "version",
        "fact",
        "endorse",
        "party",
        "case",
        "agree",
        "law",
        "applies",
        "dispute",
        "simply",
        "disagree",
        "actually",
        "happened",
        "case",
        "dispute",
        "applicable",
        "lawone",
        "side",
        "claiming",
        "fact",
        "appropriate",
        "law",
        "support",
        "decision",
        "favour",
        "side",
        "disputing",
        "account",
        "law",
        "arguing",
        "fact",
        "law",
        "support",
        "decision",
        "favour",
        "go",
        "without",
        "saying",
        "also",
        "case",
        "dispute",
        "fact",
        "law",
        "precedent",
        "case",
        "require",
        "court",
        "resolve",
        "dispute",
        "law",
        "precedent",
        "decision",
        "law",
        "case",
        "court",
        "similar",
        "legal",
        "decisionmaker",
        "tribunal",
        "paradigmatically",
        "common",
        "law",
        "legal",
        "system",
        "judicial",
        "decision",
        "given",
        "judgment",
        "five",
        "aspect",
        "recitation",
        "fact",
        "case",
        "ie",
        "account",
        "happened",
        "identification",
        "legal",
        "issuethe",
        "disputed",
        "question",
        "lawwhich",
        "court",
        "asked",
        "resolve",
        "reasoning",
        "appropriate",
        "resolution",
        "issue",
        "ruling",
        "resolving",
        "issue",
        "put",
        "court",
        "eg",
        "circumstance",
        "defendant",
        "breached",
        "contract",
        "owe",
        "plaintiff",
        "duty",
        "care",
        "hold",
        "property",
        "trust",
        "third",
        "party",
        "made",
        "decision",
        "contrary",
        "natural",
        "justice",
        "result",
        "outcome",
        "case",
        "ie",
        "party",
        "succeeded",
        "action",
        "follows",
        "detailed",
        "discussion",
        "see",
        "maccormick",
        "ff",
        "take",
        "example",
        "court",
        "may",
        "faced",
        "case",
        "trustee",
        "property",
        "held",
        "behalf",
        "plaintiff",
        "wrongfully",
        "transferred",
        "property",
        "defendant",
        "plaintiff",
        "sue",
        "defendant",
        "recover",
        "property",
        "transferred",
        "breach",
        "trust",
        "plaintiff",
        "argues",
        "since",
        "defendant",
        "received",
        "trust",
        "property",
        "ii",
        "breach",
        "trust",
        "iii",
        "paid",
        "property",
        "restore",
        "property",
        "trust",
        "defendant",
        "argues",
        "hand",
        "since",
        "iv",
        "trustee",
        "good",
        "title",
        "property",
        "v",
        "power",
        "transfer",
        "vi",
        "defendant",
        "acted",
        "good",
        "faith",
        "unaware",
        "breach",
        "trust",
        "entitled",
        "retain",
        "court",
        "ass",
        "situation",
        "may",
        "rule",
        "factor",
        "iii",
        "give",
        "plaintiff",
        "good",
        "action",
        "ie",
        "recipient",
        "trust",
        "property",
        "transferred",
        "breach",
        "trust",
        "paid",
        "property",
        "must",
        "restore",
        "reasoning",
        "court",
        "explain",
        "fact",
        "defendant",
        "received",
        "property",
        "gift",
        "mean",
        "restored",
        "trust",
        "despite",
        "trustee",
        "legal",
        "power",
        "transfer",
        "title",
        "identification",
        "subset",
        "factor",
        "iii",
        "constitute",
        "ruling",
        "always",
        "straightforward",
        "task",
        "determined",
        "construing",
        "judgment",
        "whole",
        "context",
        "area",
        "law",
        "deal",
        "particular",
        "difficult",
        "ascertain",
        "appropriate",
        "level",
        "abstraction",
        "description",
        "factor",
        "iii",
        "person",
        "made",
        "ill",
        "drinking",
        "opaque",
        "bottle",
        "ginger",
        "beer",
        "containing",
        "decomposing",
        "snail",
        "manufacturer",
        "bottle",
        "held",
        "liable",
        "person",
        "made",
        "ill",
        "despite",
        "absence",
        "contract",
        "manufacturer",
        "key",
        "characterisation",
        "vehicle",
        "harm",
        "fact",
        "bottle",
        "ginger",
        "beer",
        "beverage",
        "also",
        "consumable",
        "article",
        "human",
        "use",
        "something",
        "capable",
        "causing",
        "injury",
        "negligently",
        "produced",
        "see",
        "stone",
        "generally",
        "judgment",
        "need",
        "read",
        "whole",
        "determine",
        "appropriate",
        "level",
        "particular",
        "court",
        "s",
        "reasoning",
        "tend",
        "support",
        "one",
        "level",
        "generality",
        "another",
        "case",
        "however",
        "level",
        "generality",
        "clear",
        "possible",
        "give",
        "precise",
        "account",
        "ruling",
        "case",
        "category",
        "may",
        "incompletely",
        "characterised",
        "example",
        "item",
        "falling",
        "within",
        "category",
        "general",
        "characterisation",
        "see",
        "levenbook",
        "point",
        "brings",
        "important",
        "aspect",
        "study",
        "precedent",
        "lawyer",
        "mostly",
        "preoccupied",
        "two",
        "issue",
        "question",
        "determine",
        "precedent",
        "authority",
        "eg",
        "characterise",
        "ruling",
        "case",
        "beverage",
        "consumable",
        "article",
        "deal",
        "case",
        "single",
        "majority",
        "judgment",
        "favour",
        "result",
        "treat",
        "case",
        "give",
        "two",
        "alternative",
        "base",
        "decision",
        "question",
        "court",
        "willing",
        "overrule",
        "prior",
        "decision",
        "interesting",
        "philosophical",
        "question",
        "however",
        "concern",
        "precedent",
        "operate",
        "often",
        "case",
        "doubt",
        "precedent",
        "authority",
        "later",
        "court",
        "free",
        "unwilling",
        "overrule",
        "earlier",
        "decision",
        "three",
        "way",
        "argued",
        "precedent",
        "understood",
        "laying",
        "rule",
        "application",
        "underlying",
        "principle",
        "decision",
        "balance",
        "reason"
    ]
}