{
    "main_text": "The Nature of Law || Law as an Achievement: Towards a Social Scientific Concept of Law?\n3.3 Law as an Achievement: Towards a Social Scientific Concept of Law?\n\nBoth policy analysis and political economy pursue projects\nsubstantially different from the philosophical ones. Policy analysis\nseeks to understand how legal rules influence behavior; political\neconomy seeks to understand the ways in which society structures its\npolitical, economic, and legal institutions. These projects suggest a\nsocial scientific concept of law rather than a doctrinal or taxonomic\none. A social-scientific concept of law would help us understand the\nsocial world in general, the emergence and persistence of social\ngroups over time and the causes and consequences of different\ngovernmental structures. Political economy and policy analysis, or a\ngeneral sociology, then seek to answer the question: How do we\ndifferentiate the structures of social governance in order to\nunderstand social phenomena? \n\nAn understanding of society and social phenomena, of course, may not\nrequire anything akin to the concept of law at issue in the\nphilosophical debates. Two different reasons, however, suggest some\nrelation between the philosophical debate and the social-scientific\ninquiry. One should recall that Hart [1961] characterized, perhaps\noff-handedly, his project as one in the descriptive sociology of law.\nSuch a sociological project presumably requires a social scientific\nconcept of law. Moreover, once one has articulated a viable and useful\nset of social-scientific concepts, one might ask what relation they\nbear to the issues at the center of the philosophical inquiries of the\nvalue of legality and of articulating the criterion that distinguishes\nlegal from other grounds of decision. \n\nAdopting Hart’s discussion as a starting point, we shall in the\nrest of this subsection, sketch a social-scientific concept of a\ngovernance structure and suggest how it might relate both to the\nproject of political economy and to the philosophical debate over the\nconcept of law. (Kornhauser [2004, 2015, forthcoming] provide a more\nextended account.)\n\nOne of Hart’s rhetorical devices provides a useful starting\npoint for the development of a social scientific (functional) concept\nof governance. To introduce the concept of a secondary rule, Hart\n[1961] recounts a fable concerning the emergence of a legal system in\na small community. He suggests that a small, homogeneous, stable, and\nclosely knit society requires no differentiated structures of\ngovernance. These structures emerge to resolve problems that arise in\nsocieties that are large, heterogeneous, or subject to environmental\nuncertainty. Though Hart identifies only three such problems, we shall\nidentify four distinct functions that might be distributed across\nsocietal structures: (1) the characterization of socially acceptable\n(or unacceptable) behavior, a task the importance of which grows as\nthe rate of change in society increases;(2) policing of behavior to\nidentify likely instances of deviant behavior; more anonymous\nsocieties may require more institutionalized policing; (3) definitive\nadjudication of non-conformity to social norms; again, when society is\nno longer face-to-face, such adjudication may be necessary to trigger\nsanctions; and (4)sanctioning of deviant behavior; informal sanctions\ngrow more difficult to impose when society is not face-to-face.\n\nGovernance within a society requires that the society somehow\naccomplish each of these four tasks. A society might do so in a number\nof different ways. A governance structure is the set of institutional\nstructures within a society that address one or more of the four\nproblems of adaptation, detection, application, and sanction that are\nthe central elements of governance. An institutional structure is a\ndecision-making protocol that specifies procedures relevant to the\nresolution of one or more of the problems of adaptation, detection,\napplication, and sanction. Clear understanding requires a distinction\nhere between institutional structures, realized institutions, and\nfunctioning institutions. This distinction parallels the distinction\nbetween game forms, games, and plays of a game in the theory of games.\nAs noted before, an institutional structure is simply the basic rules\nor protocol for governance; a realized institution is an institutional\nstructure situated in a given society and populated by particular\nindividuals; and a functioning institution is a realized institution\nas it operates in a society in actual conditions.\n\nAll societies have governance structures. The simplest, face-to-face\nsocieties have undifferentiated structures in which all of these\nfunctions are informal and diffused through the society. As social\ngroups grow more numerous and their environment becomes more volatile,\ngovernance structures become more complex.\n\nA crude taxonomy of governance structures might distinguish them along\nthree dimensions: the degree of institutional differentiation in the\ngovernance structure, the degree of organization (or\n“direction,” or “structure)” – for\nfurther discussion see Kornhauser [forthcoming] – and the\nmechanism of internal, “bureaucratic” control. \n\nA governance structure may be more or less differentiated from other\ninstitutions (such as those governing exchange or reproduction) in a\nsociety. Hart considered two extremes: a simple society with no\ndifferentiation of governance from other institutions and modern,\nmunicipal legal systems that have distinct institutions for\nadaptation, policing, adjudication, and sanctioning. Indeed, a society\nsuch as the United States has multiple legislative, executive and\njudicial institutions that relate in complex ways. \n\n“Organization” refers to the degree to which governance in\na given realm or of a given function (such as norm creation or norm\nmonitoring) are “centralized” or “directed” by\nspecified individuals. Simple, face-to-face societies typically have\ndecentralized (and undifferentiated) institutions. The community as a\nwhole monitors compliance and sanctions non-compliance. Private law is\ntypically monitored in this decentralized way. Modern municipal legal\nsystems, by contrast, are typically more structured and organized.\n\n\nThe mechanism of internal control refers to the character type that\nthe governance institutions (seek to) select for public officials. As\nnoted above, governance depends on who occupies official roles;\ngovernance structures function differently when public officials are\nself-interested rather than when they are conscientious. Hart\ncontrasted two motivations for compliance with law or legal\nobligations: incentives that rely on the self-interest of individuals\nand acceptance of rules as guides to action. For Hart, law required\nthat a core set of public officials had to accept the rule of\nrecognition as an authoritative guide to action. \n\nPolitical economy, by contrast, aims to explain all legal phenomena in\nterms of the self-interest of agents. This analytic strategy precludes\na Hartian account of law; legal rules cannot play any role in the\nexplanation of behavior of either private individuals or public\nofficials because no agent has the relevant internal attitude towards\nthe rule. An individual faced with a choice considers the costs and\nbenefits that each option presents to her. These costs and benefits\nwill include “legal costs and benefits” but these costs\nand benefits are not determined by rules; they are the result of the\nincentives that private and public officials face. Rules are only\nrules of thumb that express the response of average individuals under\nnormal circumstances to particular events. Which rules of thumb are\nused, of course, may greatly affect the social equilibrium achieved in\na particular jurisdiction.\n\nPolitical economy thus seeks a concept of governance that relies only\non incentives; it consequently denies the existence of legal systems\nin Hart’s sense. It might nonetheless acknowledge a different\nconcept of law. Some political economists, for example, suggest that\nlegality in the sense of an impartial “rule of law”\npromotes economic growth. The political economist then might identify\nlaw or legal systems as those governance structures that realize such\na rule of law (in given circumstances). The political economist, then,\nmight adopt two related concepts. The first concept of a governance\nstructure is an explanatory one; it characterizes the mechanisms of\nsocial governance in terms of the degree of institutional\ndifferentiation and the mechanism of bureaucratic control within these\ninstitutions. The second related concept is normative. It identifies a\nvalue that a governance structure might realize. Call this value\nlegality. The concept of law is thus a normative one; that\nidentifies the value of legality. The social scientist then seeks to\nidentify conditions under which specific governance structures will\nrealize the value of legality.\n\nThe above discussion sketches a concept of governance, a concept\nclearly necessary for social science. We might understand law in two\ndistinct ways. The first, traditional way regards law as a\nmode of governance, or, we might say, as a species of\ngovernance. On this account, some specific feature or features of a\nfunctioning governance system characterize law; these features\nidentify the “essence” of law. Debates about the concept\nof law are thus debates over the features that are essential for law.\n\n\nThe alternative approach understands law as an achievement of\na functioning governance system. On this account, the essence of law\nlies in the character of the achievement, i.e., in the value of\n“legality” that the functioning governance system\nrealizes. Debates about the concept of law on this achievement account\nare thus debates over the nature of the value of legality.\n",
    "section_title": "3.3 Law as an Achievement: Towards a Social Scientific Concept of Law?",
    "entry_title": "The Economic Analysis of Law",
    "hierarchy_title": "The Economic Analysis of Law || The Nature of Law || Law as an Achievement: Towards a Social Scientific Concept of Law?",
    "tokenized_text": [
        "nature",
        "law",
        "law",
        "achievement",
        "towards",
        "social",
        "scientific",
        "concept",
        "law",
        "law",
        "achievement",
        "towards",
        "social",
        "scientific",
        "concept",
        "law",
        "policy",
        "analysis",
        "political",
        "economy",
        "pursue",
        "project",
        "substantially",
        "different",
        "philosophical",
        "one",
        "policy",
        "analysis",
        "seek",
        "understand",
        "legal",
        "rule",
        "influence",
        "behavior",
        "political",
        "economy",
        "seek",
        "understand",
        "way",
        "society",
        "structure",
        "political",
        "economic",
        "legal",
        "institution",
        "project",
        "suggest",
        "social",
        "scientific",
        "concept",
        "law",
        "rather",
        "doctrinal",
        "taxonomic",
        "one",
        "socialscientific",
        "concept",
        "law",
        "would",
        "help",
        "u",
        "understand",
        "social",
        "world",
        "general",
        "emergence",
        "persistence",
        "social",
        "group",
        "time",
        "cause",
        "consequence",
        "different",
        "governmental",
        "structure",
        "political",
        "economy",
        "policy",
        "analysis",
        "general",
        "sociology",
        "seek",
        "answer",
        "question",
        "differentiate",
        "structure",
        "social",
        "governance",
        "order",
        "understand",
        "social",
        "phenomenon",
        "understanding",
        "society",
        "social",
        "phenomenon",
        "course",
        "may",
        "require",
        "anything",
        "akin",
        "concept",
        "law",
        "issue",
        "philosophical",
        "debate",
        "two",
        "different",
        "reason",
        "however",
        "suggest",
        "relation",
        "philosophical",
        "debate",
        "socialscientific",
        "inquiry",
        "one",
        "recall",
        "hart",
        "characterized",
        "perhaps",
        "offhandedly",
        "project",
        "one",
        "descriptive",
        "sociology",
        "law",
        "sociological",
        "project",
        "presumably",
        "requires",
        "social",
        "scientific",
        "concept",
        "law",
        "moreover",
        "one",
        "articulated",
        "viable",
        "useful",
        "set",
        "socialscientific",
        "concept",
        "one",
        "might",
        "ask",
        "relation",
        "bear",
        "issue",
        "center",
        "philosophical",
        "inquiry",
        "value",
        "legality",
        "articulating",
        "criterion",
        "distinguishes",
        "legal",
        "ground",
        "decision",
        "adopting",
        "hart",
        "discussion",
        "starting",
        "point",
        "shall",
        "rest",
        "subsection",
        "sketch",
        "socialscientific",
        "concept",
        "governance",
        "structure",
        "suggest",
        "might",
        "relate",
        "project",
        "political",
        "economy",
        "philosophical",
        "debate",
        "concept",
        "law",
        "kornhauser",
        "forthcoming",
        "provide",
        "extended",
        "account",
        "one",
        "hart",
        "rhetorical",
        "device",
        "provides",
        "useful",
        "starting",
        "point",
        "development",
        "social",
        "scientific",
        "functional",
        "concept",
        "governance",
        "introduce",
        "concept",
        "secondary",
        "rule",
        "hart",
        "recount",
        "fable",
        "concerning",
        "emergence",
        "legal",
        "system",
        "small",
        "community",
        "suggests",
        "small",
        "homogeneous",
        "stable",
        "closely",
        "knit",
        "society",
        "requires",
        "differentiated",
        "structure",
        "governance",
        "structure",
        "emerge",
        "resolve",
        "problem",
        "arise",
        "society",
        "large",
        "heterogeneous",
        "subject",
        "environmental",
        "uncertainty",
        "though",
        "hart",
        "identifies",
        "three",
        "problem",
        "shall",
        "identify",
        "four",
        "distinct",
        "function",
        "might",
        "distributed",
        "across",
        "societal",
        "structure",
        "characterization",
        "socially",
        "acceptable",
        "unacceptable",
        "behavior",
        "task",
        "importance",
        "grows",
        "rate",
        "change",
        "society",
        "increase",
        "policing",
        "behavior",
        "identify",
        "likely",
        "instance",
        "deviant",
        "behavior",
        "anonymous",
        "society",
        "may",
        "require",
        "institutionalized",
        "policing",
        "definitive",
        "adjudication",
        "nonconformity",
        "social",
        "norm",
        "society",
        "longer",
        "facetoface",
        "adjudication",
        "may",
        "necessary",
        "trigger",
        "sanction",
        "sanctioning",
        "deviant",
        "behavior",
        "informal",
        "sanction",
        "grow",
        "difficult",
        "impose",
        "society",
        "facetoface",
        "governance",
        "within",
        "society",
        "requires",
        "society",
        "somehow",
        "accomplish",
        "four",
        "task",
        "society",
        "might",
        "number",
        "different",
        "way",
        "governance",
        "structure",
        "set",
        "institutional",
        "structure",
        "within",
        "society",
        "address",
        "one",
        "four",
        "problem",
        "adaptation",
        "detection",
        "application",
        "sanction",
        "central",
        "element",
        "governance",
        "institutional",
        "structure",
        "decisionmaking",
        "protocol",
        "specifies",
        "procedure",
        "relevant",
        "resolution",
        "one",
        "problem",
        "adaptation",
        "detection",
        "application",
        "sanction",
        "clear",
        "understanding",
        "requires",
        "distinction",
        "institutional",
        "structure",
        "realized",
        "institution",
        "functioning",
        "institution",
        "distinction",
        "parallel",
        "distinction",
        "game",
        "form",
        "game",
        "play",
        "game",
        "theory",
        "game",
        "noted",
        "institutional",
        "structure",
        "simply",
        "basic",
        "rule",
        "protocol",
        "governance",
        "realized",
        "institution",
        "institutional",
        "structure",
        "situated",
        "given",
        "society",
        "populated",
        "particular",
        "individual",
        "functioning",
        "institution",
        "realized",
        "institution",
        "operates",
        "society",
        "actual",
        "condition",
        "society",
        "governance",
        "structure",
        "simplest",
        "facetoface",
        "society",
        "undifferentiated",
        "structure",
        "function",
        "informal",
        "diffused",
        "society",
        "social",
        "group",
        "grow",
        "numerous",
        "environment",
        "becomes",
        "volatile",
        "governance",
        "structure",
        "become",
        "complex",
        "crude",
        "taxonomy",
        "governance",
        "structure",
        "might",
        "distinguish",
        "along",
        "three",
        "dimension",
        "degree",
        "institutional",
        "differentiation",
        "governance",
        "structure",
        "degree",
        "organization",
        "direction",
        "structure",
        "discussion",
        "see",
        "kornhauser",
        "forthcoming",
        "mechanism",
        "internal",
        "bureaucratic",
        "control",
        "governance",
        "structure",
        "may",
        "le",
        "differentiated",
        "institution",
        "governing",
        "exchange",
        "reproduction",
        "society",
        "hart",
        "considered",
        "two",
        "extreme",
        "simple",
        "society",
        "differentiation",
        "governance",
        "institution",
        "modern",
        "municipal",
        "legal",
        "system",
        "distinct",
        "institution",
        "adaptation",
        "policing",
        "adjudication",
        "sanctioning",
        "indeed",
        "society",
        "united",
        "state",
        "multiple",
        "legislative",
        "executive",
        "judicial",
        "institution",
        "relate",
        "complex",
        "way",
        "organization",
        "refers",
        "degree",
        "governance",
        "given",
        "realm",
        "given",
        "function",
        "norm",
        "creation",
        "norm",
        "monitoring",
        "centralized",
        "directed",
        "specified",
        "individual",
        "simple",
        "facetoface",
        "society",
        "typically",
        "decentralized",
        "undifferentiated",
        "institution",
        "community",
        "whole",
        "monitor",
        "compliance",
        "sanction",
        "noncompliance",
        "private",
        "law",
        "typically",
        "monitored",
        "decentralized",
        "way",
        "modern",
        "municipal",
        "legal",
        "system",
        "contrast",
        "typically",
        "structured",
        "organized",
        "mechanism",
        "internal",
        "control",
        "refers",
        "character",
        "type",
        "governance",
        "institution",
        "seek",
        "select",
        "public",
        "official",
        "noted",
        "governance",
        "depends",
        "occupies",
        "official",
        "role",
        "governance",
        "structure",
        "function",
        "differently",
        "public",
        "official",
        "selfinterested",
        "rather",
        "conscientious",
        "hart",
        "contrasted",
        "two",
        "motivation",
        "compliance",
        "law",
        "legal",
        "obligation",
        "incentive",
        "rely",
        "selfinterest",
        "individual",
        "acceptance",
        "rule",
        "guide",
        "action",
        "hart",
        "law",
        "required",
        "core",
        "set",
        "public",
        "official",
        "accept",
        "rule",
        "recognition",
        "authoritative",
        "guide",
        "action",
        "political",
        "economy",
        "contrast",
        "aim",
        "explain",
        "legal",
        "phenomenon",
        "term",
        "selfinterest",
        "agent",
        "analytic",
        "strategy",
        "precludes",
        "hartian",
        "account",
        "law",
        "legal",
        "rule",
        "play",
        "role",
        "explanation",
        "behavior",
        "either",
        "private",
        "individual",
        "public",
        "official",
        "agent",
        "relevant",
        "internal",
        "attitude",
        "towards",
        "rule",
        "individual",
        "faced",
        "choice",
        "considers",
        "cost",
        "benefit",
        "option",
        "present",
        "cost",
        "benefit",
        "include",
        "legal",
        "cost",
        "benefit",
        "cost",
        "benefit",
        "determined",
        "rule",
        "result",
        "incentive",
        "private",
        "public",
        "official",
        "face",
        "rule",
        "rule",
        "thumb",
        "express",
        "response",
        "average",
        "individual",
        "normal",
        "circumstance",
        "particular",
        "event",
        "rule",
        "thumb",
        "used",
        "course",
        "may",
        "greatly",
        "affect",
        "social",
        "equilibrium",
        "achieved",
        "particular",
        "jurisdiction",
        "political",
        "economy",
        "thus",
        "seek",
        "concept",
        "governance",
        "relies",
        "incentive",
        "consequently",
        "denies",
        "existence",
        "legal",
        "system",
        "hart",
        "sense",
        "might",
        "nonetheless",
        "acknowledge",
        "different",
        "concept",
        "law",
        "political",
        "economist",
        "example",
        "suggest",
        "legality",
        "sense",
        "impartial",
        "rule",
        "law",
        "promotes",
        "economic",
        "growth",
        "political",
        "economist",
        "might",
        "identify",
        "law",
        "legal",
        "system",
        "governance",
        "structure",
        "realize",
        "rule",
        "law",
        "given",
        "circumstance",
        "political",
        "economist",
        "might",
        "adopt",
        "two",
        "related",
        "concept",
        "first",
        "concept",
        "governance",
        "structure",
        "explanatory",
        "one",
        "characterizes",
        "mechanism",
        "social",
        "governance",
        "term",
        "degree",
        "institutional",
        "differentiation",
        "mechanism",
        "bureaucratic",
        "control",
        "within",
        "institution",
        "second",
        "related",
        "concept",
        "normative",
        "identifies",
        "value",
        "governance",
        "structure",
        "might",
        "realize",
        "call",
        "value",
        "legality",
        "concept",
        "law",
        "thus",
        "normative",
        "one",
        "identifies",
        "value",
        "legality",
        "social",
        "scientist",
        "seek",
        "identify",
        "condition",
        "specific",
        "governance",
        "structure",
        "realize",
        "value",
        "legality",
        "discussion",
        "sketch",
        "concept",
        "governance",
        "concept",
        "clearly",
        "necessary",
        "social",
        "science",
        "might",
        "understand",
        "law",
        "two",
        "distinct",
        "way",
        "first",
        "traditional",
        "way",
        "regard",
        "law",
        "mode",
        "governance",
        "might",
        "say",
        "specie",
        "governance",
        "account",
        "specific",
        "feature",
        "feature",
        "functioning",
        "governance",
        "system",
        "characterize",
        "law",
        "feature",
        "identify",
        "essence",
        "law",
        "debate",
        "concept",
        "law",
        "thus",
        "debate",
        "feature",
        "essential",
        "law",
        "alternative",
        "approach",
        "understands",
        "law",
        "achievement",
        "functioning",
        "governance",
        "system",
        "account",
        "essence",
        "law",
        "lie",
        "character",
        "achievement",
        "ie",
        "value",
        "legality",
        "functioning",
        "governance",
        "system",
        "realizes",
        "debate",
        "concept",
        "law",
        "achievement",
        "account",
        "thus",
        "debate",
        "nature",
        "value",
        "legality"
    ]
}