{
    "main_text": "Transactional Theories || Consent\n4.1 Consent\n\n“The Right of all Sovereigns”, says Hobbes in\nLeviathan (chap. 42) “is derived originally from the\nconsent of everyone of those that are to be governed”. In the\nSecond Treatise (§ 95) Locke says:\n\n\nMen being … by nature all free, equal, and independent, no one\ncan be put out of this estate and subjected to the political power of\nanother without his own consent.\n\n\nThe ideological influence of such theories in the struggles for\nrepresentative government and decolonization was immense. Few now\ndeny, in the words of the United States’ Declaration of\nIndependence, that all governments “deriv[e] their just\npowers from the consent of the governed”, and it is perhaps not\ntoo much to say that consent has become the “gold\nstandard” for political authority (and, indeed, for a\ntheory of any political power; Buchanan 2002).\n\nBut whose consent, and to what? Not the consent of our ancestors, for\nsuch an “original” contract, as it was called in the\nseventeenth century, can have no authority over those who did not\nagree to it. A voluntarist theory requires the actual consent of each\nsubject. But this cannot mean consent to every law or application\nthereof. The evident absurdity of that idea leads some to declare\nconsent “intrinsically implausible”: As Finnis puts\nit,\n\n\nthe need for authority is, precisely, to substitute for unanimity in\ndetermining the solution of practical co-ordination problems which\ninvolve or concern everyone in the community. (Finnis 1979: 248)\n\n\nConsent theorists, however, have not generally proposed the principle\nas a solution to “practical co-ordination problems”.\nUnanimous consent would be a very bad decision rule: the\ntransaction costs would be enormous and hold-outs could block many\ndesirable policies. Consent is more commonly proposed as a part of the\nconstitution rule that sets up the political community in the\nfirst place. Consent theorists reject, therefore, Immanuel\nKant’s idea (discussed below) that the mere capacity of\nA to violently affect B’s interests is\nsufficient licence for anyone to subject them both to a regime of\npositive law (the Metaphysics of Morals § 44). For\nconsent theorists, an A-B interaction does not\nbecome a candidate for authoritative regulation until\nA and B agree to unite under one jurisdiction. We\ncannot ask which or what sort of authority is justified over both the\nKurds and the Shiites in Iraq until we answer why there should be one\nat all. Beyond this foundational role, however, consent theorists take\ndifferent views of whether it has any further significance in policy.\nLocke thinks it is then displaced by majority rule by delegates as the\nnatural procedure for most decisions; for Rousseau, this is but\nanother form of slavery.\n\nEven in its confined role, however, consent has attracted powerful\ncriticism. (For a good survey see Simmons 1979: 57–100; for a\nqualified defence see Beran 1987.) Much of it has focused on the\nquestions of whether consent is in fact given and, if given, whether\nit would bind. The first thing to notice is that here consent is meant\nto be a performative commitment that undertakes an obligation through\nthe very act of consenting. Thus, it is closer to how we normally\nunderstand the notion of a promise, rather than to how consent is used\nin other contexts. (When you consent to surgery, for example, you\ndon’t incur an obligation to undergo surgery. You simply waive\nyour objection to undergoing surgery.) Like other promises and oaths,\nhowever, there are limits to the validity of consent. Not only because\nconsent is invalid if secured via coercion, manipulation or duress,\nbut also because there are things we lack the moral power to consent\nto. Locke, for example, argues that one can consent neither to be\nkilled nor to slavery, and thus not to anything tantamount to slavery,\nincluding absolute government. One can imagine a similar argument to\nthe conclusion that political consent must be revocable. But as we\nbuild in all these validity conditions, the commitment itself seems to\nbe doing less and less work, leading some to conclude it becomes\n“essentially irrelevant” (Pitkin 1965 [1972: 57]). Consent\nis saved from irrelevance only if we can explain why we also\nvalue a power to bind ourselves to obey. David Hume could conceive no\nreason at all: promise-keeping is an “artificial virtue”\nserving the public good, just like obedience to law. So long as law is\ntolerably legitimate—and Hume is prepared to give it a very wide\nberth—a promise to obey is redundant, for any plausible answer\nto the question of why we are bound by the promise would\n“immediately, without any circuit, have accounted for our\nobligation to allegiance”; “being of like force and\nauthority, we gain nothing by resolving the one into the other”\n(Hume 1748 [1985: 481]).\n\nNow, whilst a consent theory need not “resolve” allegiance\ninto a promise—there may also be non-promissory conditions on\nobedience—, it must explain why it should be conditional on it.\nThree sorts of arguments have been popular. First, there are\ninstrumental reasons for wanting deliberate control over the liability\nto legal duties. In political authority, where the stakes are as high\nas they come, the power to give and withhold consent serves an\nultimate protective function beyond what we could expect from the\nfallible institutions of limited government. Second, consent enables\npeople to establish political allegiances by creating new political\nsocieties or joining existing ones without awaiting the gradual\nemergence of bonds of community and reciprocity; consent is an\nimmediate passport to “perfect membership” in a\ncommonwealth (Locke, Second Treatise, § 119). Third,\nthough consent is defined by its performative character, ancillary\nnon-performative features naturally accompany it: consent also\nexpresses the acceptability, or at least tolerability, of the\ngovernment. This may mark consented-to rulers as salient from among a\nnumber of possible contenders, and it may signal that they stand a\ngood chance of being effective, which is itself a necessary condition\nfor the justification of any political authority.\n\nIt is open to doubt how persuasive such considerations are. But\nmatters are even worse, for it is in any case clear that many people\nhave done nothing that counts as giving such consent. Even freely\ngiven oaths of office and naturalization do not usually amount to a\ngeneral commitment to obey the law (Greenawalt 1987). Other acts are\neven less plausibly so interpreted. Plato’s Crito\nintroduces the idea that continued residence counts as some kind of\ntacit consent to obey, and Locke extends that to include any enjoyment\nof the benefits of government—“whether it be barely\ntravelling freely on the highway” (Second Treatise,\n§ 199). Whatever the moral relevance of these facts, they do not\ncount as consent, for people do these things without imagining they\nwill create obligations, and they do them in circumstances in which\nthey have no feasible alternative. Other non-promissory actions, for\nexample voting or participating in politics, fare no better: many do\nnot vote, and few who do regard it as undertaking any duties at all.\nPerhaps we can say that if people consent, and if\nthe relevant legitimacy conditions are fulfilled, then they will have\na duty to obey the law. That is obviously a far cry from establishing\nlaw’s claims, however.\n\nAlternatively, we might amend our theory and justify political\nauthority not by appealing to the fact that we have consented to it,\nbut rather by appealing to the fact that we would, or perhaps should,\nhave consented to it, under some idealized condition—say, if we\nhad been more rational or better informed (Estlund 2008:\n117–135). The problem with this move, however, is that in\ngrounding political authority in hypothetical, rather than\nactual, consent, the view seems to lose much of its appeal.\nThe reason the notion of consent is especially attractive is that it\npromises to reconcile being subject to someone else’s authority\nwith retaining our capacity to act as autonomous agents. Consent does\nthat because insofar as we have consented to someone else having\nauthority over us, any obligations they impose on us, can ultimately\nbe traced back, although indirectly, to an exercise of our will,\nnamely our decision to consent. In this limited sense, the obligations\nin question are obligations that we have willingly incurred. None of\nthis is true in the case of hypothetical consent, however. For our\nwill plays no role in generating any of the obligations that the\npolitical authority imposes on us if the authority is justified not by\nappealing to our actual choice to consent to it, but rather by\nappealing to the hypothetical choice of some idealized version of\nourselves. Indeed, some have argued that hypothetical consent is best\nunderstood as a version of natural duty view in disguise (Simmons\n2005: 117). Ultimately, what justifies political authority here is the\nfact that we have independent reasons to act as the authority\nrequires. For these are the very reasons that explain why we would (or\nshould) consent to an authority that requires those things if we were\nmore rational, or better informed. If so, hypothetical consent is at\nmost a heuristic device which helps us see what those reasons are (Raz\n1986; Sreenivasan 2009; Thomson 1990; but see Enoch 2017).\n",
    "section_title": "4.1 Consent",
    "entry_title": "Legal Obligation and Authority",
    "hierarchy_title": "Legal Obligation and Authority || Transactional Theories || Consent",
    "tokenized_text": [
        "transactional",
        "theory",
        "consent",
        "consent",
        "right",
        "sovereign",
        "say",
        "hobbes",
        "leviathan",
        "chap",
        "derived",
        "originally",
        "consent",
        "everyone",
        "governed",
        "second",
        "treatise",
        "locke",
        "say",
        "men",
        "nature",
        "free",
        "equal",
        "independent",
        "one",
        "put",
        "estate",
        "subjected",
        "political",
        "power",
        "another",
        "without",
        "consent",
        "ideological",
        "influence",
        "theory",
        "struggle",
        "representative",
        "government",
        "decolonization",
        "immense",
        "deny",
        "word",
        "united",
        "state",
        "declaration",
        "independence",
        "government",
        "deriv",
        "e",
        "power",
        "consent",
        "governed",
        "perhaps",
        "much",
        "say",
        "consent",
        "become",
        "gold",
        "standard",
        "political",
        "authority",
        "indeed",
        "theory",
        "political",
        "power",
        "buchanan",
        "whose",
        "consent",
        "consent",
        "ancestor",
        "original",
        "contract",
        "called",
        "seventeenth",
        "century",
        "authority",
        "agree",
        "voluntarist",
        "theory",
        "requires",
        "actual",
        "consent",
        "subject",
        "mean",
        "consent",
        "every",
        "law",
        "application",
        "thereof",
        "evident",
        "absurdity",
        "idea",
        "lead",
        "declare",
        "consent",
        "intrinsically",
        "implausible",
        "finnis",
        "put",
        "need",
        "authority",
        "precisely",
        "substitute",
        "unanimity",
        "determining",
        "solution",
        "practical",
        "coordination",
        "problem",
        "involve",
        "concern",
        "everyone",
        "community",
        "finnis",
        "consent",
        "theorist",
        "however",
        "generally",
        "proposed",
        "principle",
        "solution",
        "practical",
        "coordination",
        "problem",
        "unanimous",
        "consent",
        "would",
        "bad",
        "decision",
        "rule",
        "transaction",
        "cost",
        "would",
        "enormous",
        "holdouts",
        "could",
        "block",
        "many",
        "desirable",
        "policy",
        "consent",
        "commonly",
        "proposed",
        "part",
        "constitution",
        "rule",
        "set",
        "political",
        "community",
        "first",
        "place",
        "consent",
        "theorist",
        "reject",
        "therefore",
        "immanuel",
        "kant",
        "idea",
        "discussed",
        "mere",
        "capacity",
        "violently",
        "affect",
        "b",
        "interest",
        "sufficient",
        "licence",
        "anyone",
        "subject",
        "regime",
        "positive",
        "law",
        "metaphysics",
        "moral",
        "consent",
        "theorist",
        "ab",
        "interaction",
        "become",
        "candidate",
        "authoritative",
        "regulation",
        "b",
        "agree",
        "unite",
        "one",
        "jurisdiction",
        "ask",
        "sort",
        "authority",
        "justified",
        "kurd",
        "shiite",
        "iraq",
        "answer",
        "one",
        "beyond",
        "foundational",
        "role",
        "however",
        "consent",
        "theorist",
        "take",
        "different",
        "view",
        "whether",
        "significance",
        "policy",
        "locke",
        "think",
        "displaced",
        "majority",
        "rule",
        "delegate",
        "natural",
        "procedure",
        "decision",
        "rousseau",
        "another",
        "form",
        "slavery",
        "even",
        "confined",
        "role",
        "however",
        "consent",
        "attracted",
        "powerful",
        "criticism",
        "good",
        "survey",
        "see",
        "simmons",
        "qualified",
        "defence",
        "see",
        "beran",
        "much",
        "focused",
        "question",
        "whether",
        "consent",
        "fact",
        "given",
        "given",
        "whether",
        "would",
        "bind",
        "first",
        "thing",
        "notice",
        "consent",
        "meant",
        "performative",
        "commitment",
        "undertakes",
        "obligation",
        "act",
        "consenting",
        "thus",
        "closer",
        "normally",
        "understand",
        "notion",
        "promise",
        "rather",
        "consent",
        "used",
        "context",
        "consent",
        "surgery",
        "example",
        "incur",
        "obligation",
        "undergo",
        "surgery",
        "simply",
        "waive",
        "objection",
        "undergoing",
        "surgery",
        "like",
        "promise",
        "oath",
        "however",
        "limit",
        "validity",
        "consent",
        "consent",
        "invalid",
        "secured",
        "via",
        "coercion",
        "manipulation",
        "duress",
        "also",
        "thing",
        "lack",
        "moral",
        "power",
        "consent",
        "locke",
        "example",
        "argues",
        "one",
        "consent",
        "neither",
        "killed",
        "slavery",
        "thus",
        "anything",
        "tantamount",
        "slavery",
        "including",
        "absolute",
        "government",
        "one",
        "imagine",
        "similar",
        "argument",
        "conclusion",
        "political",
        "consent",
        "must",
        "revocable",
        "build",
        "validity",
        "condition",
        "commitment",
        "seems",
        "le",
        "le",
        "work",
        "leading",
        "conclude",
        "becomes",
        "essentially",
        "irrelevant",
        "pitkin",
        "consent",
        "saved",
        "irrelevance",
        "explain",
        "also",
        "value",
        "power",
        "bind",
        "obey",
        "david",
        "hume",
        "could",
        "conceive",
        "reason",
        "promisekeeping",
        "artificial",
        "virtue",
        "serving",
        "public",
        "good",
        "like",
        "obedience",
        "law",
        "long",
        "law",
        "tolerably",
        "legitimateand",
        "hume",
        "prepared",
        "give",
        "wide",
        "bertha",
        "promise",
        "obey",
        "redundant",
        "plausible",
        "answer",
        "question",
        "bound",
        "promise",
        "would",
        "immediately",
        "without",
        "circuit",
        "accounted",
        "obligation",
        "allegiance",
        "like",
        "force",
        "authority",
        "gain",
        "nothing",
        "resolving",
        "one",
        "hume",
        "whilst",
        "consent",
        "theory",
        "need",
        "resolve",
        "allegiance",
        "promisethere",
        "may",
        "also",
        "nonpromissory",
        "condition",
        "obedience",
        "must",
        "explain",
        "conditional",
        "three",
        "sort",
        "argument",
        "popular",
        "first",
        "instrumental",
        "reason",
        "wanting",
        "deliberate",
        "control",
        "liability",
        "legal",
        "duty",
        "political",
        "authority",
        "stake",
        "high",
        "come",
        "power",
        "give",
        "withhold",
        "consent",
        "serf",
        "ultimate",
        "protective",
        "function",
        "beyond",
        "could",
        "expect",
        "fallible",
        "institution",
        "limited",
        "government",
        "second",
        "consent",
        "enables",
        "people",
        "establish",
        "political",
        "allegiance",
        "creating",
        "new",
        "political",
        "society",
        "joining",
        "existing",
        "one",
        "without",
        "awaiting",
        "gradual",
        "emergence",
        "bond",
        "community",
        "reciprocity",
        "consent",
        "immediate",
        "passport",
        "perfect",
        "membership",
        "commonwealth",
        "locke",
        "second",
        "treatise",
        "third",
        "though",
        "consent",
        "defined",
        "performative",
        "character",
        "ancillary",
        "nonperformative",
        "feature",
        "naturally",
        "accompany",
        "consent",
        "also",
        "express",
        "acceptability",
        "least",
        "tolerability",
        "government",
        "may",
        "mark",
        "consentedto",
        "ruler",
        "salient",
        "among",
        "number",
        "possible",
        "contender",
        "may",
        "signal",
        "stand",
        "good",
        "chance",
        "effective",
        "necessary",
        "condition",
        "justification",
        "political",
        "authority",
        "open",
        "doubt",
        "persuasive",
        "consideration",
        "matter",
        "even",
        "worse",
        "case",
        "clear",
        "many",
        "people",
        "done",
        "nothing",
        "count",
        "giving",
        "consent",
        "even",
        "freely",
        "given",
        "oath",
        "office",
        "naturalization",
        "usually",
        "amount",
        "general",
        "commitment",
        "obey",
        "law",
        "greenawalt",
        "act",
        "even",
        "le",
        "plausibly",
        "interpreted",
        "plato",
        "crito",
        "introduces",
        "idea",
        "continued",
        "residence",
        "count",
        "kind",
        "tacit",
        "consent",
        "obey",
        "locke",
        "extends",
        "include",
        "enjoyment",
        "benefit",
        "government",
        "whether",
        "barely",
        "travelling",
        "freely",
        "highway",
        "second",
        "treatise",
        "whatever",
        "moral",
        "relevance",
        "fact",
        "count",
        "consent",
        "people",
        "thing",
        "without",
        "imagining",
        "create",
        "obligation",
        "circumstance",
        "feasible",
        "alternative",
        "nonpromissory",
        "action",
        "example",
        "voting",
        "participating",
        "politics",
        "fare",
        "better",
        "many",
        "vote",
        "regard",
        "undertaking",
        "duty",
        "perhaps",
        "say",
        "people",
        "consent",
        "relevant",
        "legitimacy",
        "condition",
        "fulfilled",
        "duty",
        "obey",
        "law",
        "obviously",
        "far",
        "cry",
        "establishing",
        "law",
        "claim",
        "however",
        "alternatively",
        "might",
        "amend",
        "theory",
        "justify",
        "political",
        "authority",
        "appealing",
        "fact",
        "consented",
        "rather",
        "appealing",
        "fact",
        "would",
        "perhaps",
        "consented",
        "idealized",
        "conditionsay",
        "rational",
        "better",
        "informed",
        "estlund",
        "problem",
        "move",
        "however",
        "grounding",
        "political",
        "authority",
        "hypothetical",
        "rather",
        "actual",
        "consent",
        "view",
        "seems",
        "lose",
        "much",
        "appeal",
        "reason",
        "notion",
        "consent",
        "especially",
        "attractive",
        "promise",
        "reconcile",
        "subject",
        "someone",
        "else",
        "authority",
        "retaining",
        "capacity",
        "act",
        "autonomous",
        "agent",
        "consent",
        "insofar",
        "consented",
        "someone",
        "else",
        "authority",
        "u",
        "obligation",
        "impose",
        "u",
        "ultimately",
        "traced",
        "back",
        "although",
        "indirectly",
        "exercise",
        "namely",
        "decision",
        "consent",
        "limited",
        "sense",
        "obligation",
        "question",
        "obligation",
        "willingly",
        "incurred",
        "none",
        "true",
        "case",
        "hypothetical",
        "consent",
        "however",
        "play",
        "role",
        "generating",
        "obligation",
        "political",
        "authority",
        "imposes",
        "u",
        "authority",
        "justified",
        "appealing",
        "actual",
        "choice",
        "consent",
        "rather",
        "appealing",
        "hypothetical",
        "choice",
        "idealized",
        "version",
        "indeed",
        "argued",
        "hypothetical",
        "consent",
        "best",
        "understood",
        "version",
        "natural",
        "duty",
        "view",
        "disguise",
        "simmons",
        "ultimately",
        "justifies",
        "political",
        "authority",
        "fact",
        "independent",
        "reason",
        "act",
        "authority",
        "requires",
        "reason",
        "explain",
        "would",
        "consent",
        "authority",
        "requires",
        "thing",
        "rational",
        "better",
        "informed",
        "hypothetical",
        "consent",
        "heuristic",
        "device",
        "help",
        "u",
        "see",
        "reason",
        "raz",
        "sreenivasan",
        "thomson",
        "see",
        "enoch"
    ]
}