{
    "main_text": "Claims and Projects within Economic Analysis of Law || The Basic Claims Underlying Economic Analysis of Law\n1.2 The Basic Claims Underlying Economic Analysis of Law\n\nPosner [1973] made two claims that have usually defined the debate\naround the philosophical foundations of economic analysis of law. The\nfirst claim, often called the positive claim, asserts that\ncommon law legal rules are, in fact, efficient. The second claim,\noften called the normative claim, asserts that common law\nlegal rules ought to be efficient. In both claims, Posner understood\n“efficiency” to mean the maximization of the social\nwillingness-to-pay but subsequent authors have sometimes used the term\nin its more conventional economic sense of Pareto efficiency. As both\nof these claims predate the emergence of behavioral economic analysis\nof law, each relies on the classical theory.\n\nEach claim is ambiguous. Consider the first claim, the positive claim.\nOn the one hand, it might mean that common law legal rules\ninduce efficient behavior. On the other hand, it might mean\nthat the law is efficient; that is, that the content of the\nlaw is identified by its efficiency. Or the claim might mean that\nefficiency provides the best rationale of the “law” in\nsome doctrinal area. \n\nThe second of Posner’s claims, that the common law ought to be\nefficient, also presents multiple ambiguities. Do we interpret the\nclaim as a theory of adjudication (i.e., as a theory of how common law\njudges ought to decide cases)? Or should we understand the claim as\nasserting that efficiency is the appropriate criterion against which\nto assess judicial performance? Or should we understand the claim as\nasserting that lawmakers, whether judges, legislators, or\nadministrators, should choose efficient rules?\n\nThis disambiguation of Posner’s claims yields six distinct\nclaims about law that fall into a positive and a normative cluster. A\nthird set of two claims follows from the methodology of economic\nanalysis of law—the application of the tools of micro-economic\ntheory to the study of legal rules and institutions.\n\nI begin with the three positive claims that correspond to the\ndisambiguation of Posner’s positive claim and the two claims\nthat flow from economic methodology. Claim (I), the\nexplanatory claim, asserts that common law legal rules induce\nefficient behavior. Claim (II), the content claim, asserts\nthat the criterion of efficiency determines the content of the law. A\npositivist might understand this claim as a claim about the content of\nthe rule of recognition. Claim (III), the doctrinal claim,\nstates that the criterion of efficiency rationalizes\nprevailing legal rules and institutions. This doctrinal claim is\nweaker than the content claim; the latter asserts either that\nefficiency causes the content of the law or that it justifies it. The\ndoctrinal claim, by contrast, asserts only that efficiency makes sense\nof the legal materials.\n\nFor clarity, note the ambiguity in the sense in which a legal rule is\n“efficient” in claims (II) and (III). In the most\nstraightforward, economic interpretation, claims (II) and (III) refer\nto the efficiency of the behavior induced by the legal rule. Claims\n(II) and (III) therefore seem to presuppose claim (I). Many, if not\nmost, economic analyses of law, however, assert only that the legal\nrule is efficient within some\n model.[2]\n A judge, policymaker, or analyst might believe, on the basis of the\nefficiency of a rule in a model, that the rule induces efficient\nbehavior in the world but the efficiency of the rule in the model does\nnot logically entail efficiency in the world. \n\nClaims (I), (II) and (III) apparently all presuppose the classical\nmodel of narrowly self-interested actors as these preferences underlie\nthe first and second welfare theorems of general equilibrium analysis.\nThese theorems state that every competitive equilibrium is Pareto\nefficient and conversely, every Pareto efficient allocation can be\nsupported by a competitive equilibrium. Of course, it is possible that\necological rationality would lead to similar desirable outcomes. \n\nI now turn to the two claims that derive from the methodological\ncommitments of economic analysis of law. These two claims are also\nexplanatory claims. Claim (IV), the behavioral claim, asserts\nthat economic theory explains how individuals respond to legal rules\nand institutions. Claim (V), the causal claim, asserts that\neconomically motivated action by both public officials and private\ncitizens explains the content of legal rules and the structure of\nlegal institutions. Each of these claims in principle has two\nvariants. Claim (IVa) for example asserts that the classical theory\nexplains how individuals respond to legal rules. Claim (IVb)asserts\nthat some behavioral theory explains how individuals respond to legal\nrules. Similarly, claim (V) asserts that private citizens and public\nofficials conform to the same behavioral theory. In practice,\nvirtually all research addressing claim (V) attributes classical,\nnarrowly self-interested preferences to both private individuals and\npublic officials. \n\nBoth claims (IV) and (V) might refer to the classical model or to any\nof the three variants of the behavioral model. In fact most of the\nliterature relies on the classical model though, increasingly,\nscholars are investigating the consequences of the behavioral model\nwithin the context of claim (IV). \n\nClaim (I) differs from claim (IV). The explanatory claim asserts that\n(some) legal rules and institutions induce efficient behavior but does\nnot identify the mechanism through which this efficient behavior\nresults. The behavioral claim, by contrast, identifies the mechanisms\nthrough which legal rules and institutions influence behavior, but it\ndoes not assert that the resulting behavior is\n efficient.[3]\n Claims (II) and (III) are equally silent about the mechanisms that\nyield efficiency though one might think that claim (II) asserts that\njudges and other public officials intentionally pursue efficient\nrules. \n\nNote also that claim (II) differs from Claim (V) for similar reasons.\nClaim (II) states that efficiency is one of the grounds of law. Many\nlegal rules should thus be efficient. Claim (V), by contrast, asserts\nonly that law results from the self-interested behavior of individual\ncitizens and public officials. This behavior does not necessarily\nyield efficient rules or institutions.\n\nFinally, note that the methodological claims (IV) and (V) apparently\nreject standard accounts of the normativity of law, an issue addressed\nmore fully in section 4.\n\nConsider now the three normative claims that follow from the\ndisambiguation of Posner’s initial normative claim. Claim (VI),\nthe adjudicatory, claim asserts that judges ought, in their\ndecision of cases, to promote efficiency. This claim understands\nPosner’s claim as a theory of adjudication. Claim (VII), the\nevaluative claim, asserts that the primary criterion against\nwhich to assess legal rules and institutions is efficiency. Claim\n(VIII), the design claim, asserts that policymakers should\ndesign legal rules and institutions to promote efficiency. Note that\nclaims (VII) and (VIII) are independent. Designing efficient legal\nrules and institutions might be desirable for non-efficiency reasons.\nConversely, efficiency might dictate the design of inefficient\ninstitutions.\n\nIn the late 1970s and early 1980s, controversy raged primarily over\nthe evaluative claim. This debate largely recapitulated the debate\nover the “new welfare economics” that occurred in\neconomics in the late 1930s and early 1940s. Debate over this claim\nbriefly resurged with the publication of Kaplow and Shavell [2004].\nMore recently, however, claim (III), the doctrinal claim has received\nthe most philosophical attention. \n\nThe philosophy of law has traditionally focused on a limited set of\nquestions centered around the “concept of law” and the\nexistence or non-existence of an obligation to obey the law. Thus,\nphilosophers of law have investigated the nature of law, its relation\nto coercion and morality, how judges ought to decide cases, and\nwhether, to what extent, and how law gives agents reasons for action.\n\n\nThe eight claims identified above do not correspond directly to these\ntraditional questions in the philosophy of law. As already noted,\nclaim (II) at least implicitly adopts a legal positivist understanding\nof law. Claim (VI) offers an explicit normative theory of\nadjudication, though one apparently at odds with how judges in fact\ndecide cases. Central philosophic questions concerning the concept of\nlaw, its normativity, and the obligation to obey the law, however, are\nnot directly addressed. The behavioral claim (IV) as well as the\ncausal claim (V) and the explanatory claim (I), by contrast, concern\nempirical issues that philosophers of law generally neglect.\nNevertheless, the controversy within the legal academy has generally\nregarded economic analysis of law as providing a comprehensive theory\nof law that challenges traditional approaches to law. Indeed, an\nexplanation of the vehemence of the controversy should identify\ndifferences in fundamental views concerning law.\n",
    "section_title": "1.2 The Basic Claims Underlying Economic Analysis of Law",
    "entry_title": "The Economic Analysis of Law",
    "hierarchy_title": "The Economic Analysis of Law || Claims and Projects within Economic Analysis of Law || The Basic Claims Underlying Economic Analysis of Law",
    "tokenized_text": [
        "claim",
        "project",
        "within",
        "economic",
        "analysis",
        "law",
        "basic",
        "claim",
        "underlying",
        "economic",
        "analysis",
        "law",
        "basic",
        "claim",
        "underlying",
        "economic",
        "analysis",
        "law",
        "posner",
        "made",
        "two",
        "claim",
        "usually",
        "defined",
        "debate",
        "around",
        "philosophical",
        "foundation",
        "economic",
        "analysis",
        "law",
        "first",
        "claim",
        "often",
        "called",
        "positive",
        "claim",
        "asserts",
        "common",
        "law",
        "legal",
        "rule",
        "fact",
        "efficient",
        "second",
        "claim",
        "often",
        "called",
        "normative",
        "claim",
        "asserts",
        "common",
        "law",
        "legal",
        "rule",
        "ought",
        "efficient",
        "claim",
        "posner",
        "understood",
        "efficiency",
        "mean",
        "maximization",
        "social",
        "willingnesstopay",
        "subsequent",
        "author",
        "sometimes",
        "used",
        "term",
        "conventional",
        "economic",
        "sense",
        "pareto",
        "efficiency",
        "claim",
        "predate",
        "emergence",
        "behavioral",
        "economic",
        "analysis",
        "law",
        "relies",
        "classical",
        "theory",
        "claim",
        "ambiguous",
        "consider",
        "first",
        "claim",
        "positive",
        "claim",
        "one",
        "hand",
        "might",
        "mean",
        "common",
        "law",
        "legal",
        "rule",
        "induce",
        "efficient",
        "behavior",
        "hand",
        "might",
        "mean",
        "law",
        "efficient",
        "content",
        "law",
        "identified",
        "efficiency",
        "claim",
        "might",
        "mean",
        "efficiency",
        "provides",
        "best",
        "rationale",
        "law",
        "doctrinal",
        "area",
        "second",
        "posner",
        "claim",
        "common",
        "law",
        "ought",
        "efficient",
        "also",
        "present",
        "multiple",
        "ambiguity",
        "interpret",
        "claim",
        "theory",
        "adjudication",
        "ie",
        "theory",
        "common",
        "law",
        "judge",
        "ought",
        "decide",
        "case",
        "understand",
        "claim",
        "asserting",
        "efficiency",
        "appropriate",
        "criterion",
        "ass",
        "judicial",
        "performance",
        "understand",
        "claim",
        "asserting",
        "lawmaker",
        "whether",
        "judge",
        "legislator",
        "administrator",
        "choose",
        "efficient",
        "rule",
        "disambiguation",
        "posner",
        "claim",
        "yield",
        "six",
        "distinct",
        "claim",
        "law",
        "fall",
        "positive",
        "normative",
        "cluster",
        "third",
        "set",
        "two",
        "claim",
        "follows",
        "methodology",
        "economic",
        "analysis",
        "lawthe",
        "application",
        "tool",
        "microeconomic",
        "theory",
        "study",
        "legal",
        "rule",
        "institution",
        "begin",
        "three",
        "positive",
        "claim",
        "correspond",
        "disambiguation",
        "posner",
        "positive",
        "claim",
        "two",
        "claim",
        "flow",
        "economic",
        "methodology",
        "claim",
        "explanatory",
        "claim",
        "asserts",
        "common",
        "law",
        "legal",
        "rule",
        "induce",
        "efficient",
        "behavior",
        "claim",
        "ii",
        "content",
        "claim",
        "asserts",
        "criterion",
        "efficiency",
        "determines",
        "content",
        "law",
        "positivist",
        "might",
        "understand",
        "claim",
        "claim",
        "content",
        "rule",
        "recognition",
        "claim",
        "iii",
        "doctrinal",
        "claim",
        "state",
        "criterion",
        "efficiency",
        "rationalizes",
        "prevailing",
        "legal",
        "rule",
        "institution",
        "doctrinal",
        "claim",
        "weaker",
        "content",
        "claim",
        "latter",
        "asserts",
        "either",
        "efficiency",
        "cause",
        "content",
        "law",
        "justifies",
        "doctrinal",
        "claim",
        "contrast",
        "asserts",
        "efficiency",
        "make",
        "sense",
        "legal",
        "material",
        "clarity",
        "note",
        "ambiguity",
        "sense",
        "legal",
        "rule",
        "efficient",
        "claim",
        "ii",
        "iii",
        "straightforward",
        "economic",
        "interpretation",
        "claim",
        "ii",
        "iii",
        "refer",
        "efficiency",
        "behavior",
        "induced",
        "legal",
        "rule",
        "claim",
        "ii",
        "iii",
        "therefore",
        "seem",
        "presuppose",
        "claim",
        "many",
        "economic",
        "analysis",
        "law",
        "however",
        "assert",
        "legal",
        "rule",
        "efficient",
        "within",
        "model",
        "judge",
        "policymaker",
        "analyst",
        "might",
        "believe",
        "basis",
        "efficiency",
        "rule",
        "model",
        "rule",
        "induces",
        "efficient",
        "behavior",
        "world",
        "efficiency",
        "rule",
        "model",
        "logically",
        "entail",
        "efficiency",
        "world",
        "claim",
        "ii",
        "iii",
        "apparently",
        "presuppose",
        "classical",
        "model",
        "narrowly",
        "selfinterested",
        "actor",
        "preference",
        "underlie",
        "first",
        "second",
        "welfare",
        "theorem",
        "general",
        "equilibrium",
        "analysis",
        "theorem",
        "state",
        "every",
        "competitive",
        "equilibrium",
        "pareto",
        "efficient",
        "conversely",
        "every",
        "pareto",
        "efficient",
        "allocation",
        "supported",
        "competitive",
        "equilibrium",
        "course",
        "possible",
        "ecological",
        "rationality",
        "would",
        "lead",
        "similar",
        "desirable",
        "outcome",
        "turn",
        "two",
        "claim",
        "derive",
        "methodological",
        "commitment",
        "economic",
        "analysis",
        "law",
        "two",
        "claim",
        "also",
        "explanatory",
        "claim",
        "claim",
        "iv",
        "behavioral",
        "claim",
        "asserts",
        "economic",
        "theory",
        "explains",
        "individual",
        "respond",
        "legal",
        "rule",
        "institution",
        "claim",
        "v",
        "causal",
        "claim",
        "asserts",
        "economically",
        "motivated",
        "action",
        "public",
        "official",
        "private",
        "citizen",
        "explains",
        "content",
        "legal",
        "rule",
        "structure",
        "legal",
        "institution",
        "claim",
        "principle",
        "two",
        "variant",
        "claim",
        "iva",
        "example",
        "asserts",
        "classical",
        "theory",
        "explains",
        "individual",
        "respond",
        "legal",
        "rule",
        "claim",
        "ivb",
        "asserts",
        "behavioral",
        "theory",
        "explains",
        "individual",
        "respond",
        "legal",
        "rule",
        "similarly",
        "claim",
        "v",
        "asserts",
        "private",
        "citizen",
        "public",
        "official",
        "conform",
        "behavioral",
        "theory",
        "practice",
        "virtually",
        "research",
        "addressing",
        "claim",
        "v",
        "attribute",
        "classical",
        "narrowly",
        "selfinterested",
        "preference",
        "private",
        "individual",
        "public",
        "official",
        "claim",
        "iv",
        "v",
        "might",
        "refer",
        "classical",
        "model",
        "three",
        "variant",
        "behavioral",
        "model",
        "fact",
        "literature",
        "relies",
        "classical",
        "model",
        "though",
        "increasingly",
        "scholar",
        "investigating",
        "consequence",
        "behavioral",
        "model",
        "within",
        "context",
        "claim",
        "iv",
        "claim",
        "differs",
        "claim",
        "iv",
        "explanatory",
        "claim",
        "asserts",
        "legal",
        "rule",
        "institution",
        "induce",
        "efficient",
        "behavior",
        "identify",
        "mechanism",
        "efficient",
        "behavior",
        "result",
        "behavioral",
        "claim",
        "contrast",
        "identifies",
        "mechanism",
        "legal",
        "rule",
        "institution",
        "influence",
        "behavior",
        "assert",
        "resulting",
        "behavior",
        "efficient",
        "claim",
        "ii",
        "iii",
        "equally",
        "silent",
        "mechanism",
        "yield",
        "efficiency",
        "though",
        "one",
        "might",
        "think",
        "claim",
        "ii",
        "asserts",
        "judge",
        "public",
        "official",
        "intentionally",
        "pursue",
        "efficient",
        "rule",
        "note",
        "also",
        "claim",
        "ii",
        "differs",
        "claim",
        "v",
        "similar",
        "reason",
        "claim",
        "ii",
        "state",
        "efficiency",
        "one",
        "ground",
        "law",
        "many",
        "legal",
        "rule",
        "thus",
        "efficient",
        "claim",
        "v",
        "contrast",
        "asserts",
        "law",
        "result",
        "selfinterested",
        "behavior",
        "individual",
        "citizen",
        "public",
        "official",
        "behavior",
        "necessarily",
        "yield",
        "efficient",
        "rule",
        "institution",
        "finally",
        "note",
        "methodological",
        "claim",
        "iv",
        "v",
        "apparently",
        "reject",
        "standard",
        "account",
        "normativity",
        "law",
        "issue",
        "addressed",
        "fully",
        "section",
        "consider",
        "three",
        "normative",
        "claim",
        "follow",
        "disambiguation",
        "posner",
        "initial",
        "normative",
        "claim",
        "claim",
        "vi",
        "adjudicatory",
        "claim",
        "asserts",
        "judge",
        "ought",
        "decision",
        "case",
        "promote",
        "efficiency",
        "claim",
        "understands",
        "posner",
        "claim",
        "theory",
        "adjudication",
        "claim",
        "vii",
        "evaluative",
        "claim",
        "asserts",
        "primary",
        "criterion",
        "ass",
        "legal",
        "rule",
        "institution",
        "efficiency",
        "claim",
        "viii",
        "design",
        "claim",
        "asserts",
        "policymakers",
        "design",
        "legal",
        "rule",
        "institution",
        "promote",
        "efficiency",
        "note",
        "claim",
        "vii",
        "viii",
        "independent",
        "designing",
        "efficient",
        "legal",
        "rule",
        "institution",
        "might",
        "desirable",
        "nonefficiency",
        "reason",
        "conversely",
        "efficiency",
        "might",
        "dictate",
        "design",
        "inefficient",
        "institution",
        "late",
        "s",
        "early",
        "s",
        "controversy",
        "raged",
        "primarily",
        "evaluative",
        "claim",
        "debate",
        "largely",
        "recapitulated",
        "debate",
        "new",
        "welfare",
        "economics",
        "occurred",
        "economics",
        "late",
        "s",
        "early",
        "s",
        "debate",
        "claim",
        "briefly",
        "resurged",
        "publication",
        "kaplow",
        "shavell",
        "recently",
        "however",
        "claim",
        "iii",
        "doctrinal",
        "claim",
        "received",
        "philosophical",
        "attention",
        "philosophy",
        "law",
        "traditionally",
        "focused",
        "limited",
        "set",
        "question",
        "centered",
        "around",
        "concept",
        "law",
        "existence",
        "nonexistence",
        "obligation",
        "obey",
        "law",
        "thus",
        "philosopher",
        "law",
        "investigated",
        "nature",
        "law",
        "relation",
        "coercion",
        "morality",
        "judge",
        "ought",
        "decide",
        "case",
        "whether",
        "extent",
        "law",
        "give",
        "agent",
        "reason",
        "action",
        "eight",
        "claim",
        "identified",
        "correspond",
        "directly",
        "traditional",
        "question",
        "philosophy",
        "law",
        "already",
        "noted",
        "claim",
        "ii",
        "least",
        "implicitly",
        "adopts",
        "legal",
        "positivist",
        "understanding",
        "law",
        "claim",
        "vi",
        "offer",
        "explicit",
        "normative",
        "theory",
        "adjudication",
        "though",
        "one",
        "apparently",
        "odds",
        "judge",
        "fact",
        "decide",
        "case",
        "central",
        "philosophic",
        "question",
        "concerning",
        "concept",
        "law",
        "normativity",
        "obligation",
        "obey",
        "law",
        "however",
        "directly",
        "addressed",
        "behavioral",
        "claim",
        "iv",
        "well",
        "causal",
        "claim",
        "v",
        "explanatory",
        "claim",
        "contrast",
        "concern",
        "empirical",
        "issue",
        "philosopher",
        "law",
        "generally",
        "neglect",
        "nevertheless",
        "controversy",
        "within",
        "legal",
        "academy",
        "generally",
        "regarded",
        "economic",
        "analysis",
        "law",
        "providing",
        "comprehensive",
        "theory",
        "law",
        "challenge",
        "traditional",
        "approach",
        "law",
        "indeed",
        "explanation",
        "vehemence",
        "controversy",
        "identify",
        "difference",
        "fundamental",
        "view",
        "concerning",
        "law"
    ]
}