{
    "main_text": "Legitimacy and Political Cosmopolitanism || Political Nationalism\n5.2 Political Cosmopolitanism\n\nThere are two main approaches to both international and global\nlegitimacy: the state-centered approach and the people-centered\napproach. The former takes appropriate relations among states as\nbasic. As Charles Beitz characterizes this approach:\n“international society is understood as domestic society writ\nlarge, with states playing the roles occupied by persons in domestic\nsociety. States, not persons, are the subjects of international\nmorality, and the rules that regulate their behavior are supposed to\npreserve a peaceful order of sovereign states” (1979b: 408; see\nalso Beitz 1998). Locke, Bentham, and Mill, among others, approached\nthe issue of international legitimacy in this way. Among contemporary\nthinkers, Michael Walzer (1977, 1980) defends a state-based—or\nas he calls it—community-based approach. The most important\ncriterion of international legitimacy that he proposes is the\ncriterion of non-interference. (For discussions of Walzer’s\nproposal, see Beitz 1979a, b). Others have put forward conceptions\nbased on state consent. Rawls advocates a conception based on the\nconsent of “well-ordered” (either “liberal” or\n“decent”) peoples (Rawls 1999; for critical discussions,\nsee e.g., Buchanan 2000; Wenar 2002; Cavallero 2003).\n\nThe second approach takes features of individuals—their\ninterests or their rights—as basic for legitimacy. At present,\nthe most comprehensive contemporary philosophical treatment of\ninternational legitimacy of this kind is probably Allen\nBuchanan’s Justice, Legitimacy, and Self-Determination\n(2003). As mentioned above (section 2.2.), Buchanan advocates a\nmoralized conception of legitimacy, according to which entities are\nlegitimate if they are morally justified to wield political power.\nSpecifically, political legitimacy requires that a minimal standard of\njustice is met.\n\nOn the basis of this moralized conception of legitimacy, Buchanan\nargues against the state-based conception and against state consent\ntheories of legitimacy in particular. State consent, Buchanan claims,\nis neither necessary nor sufficient for legitimacy. It is not\nsufficient because it is well-known that states tend to be the worst\nperpetrators in matters of human rights and there is thus need for an\nindependent international standard of minimal justice to obtain\nlegitimacy. It is not necessary, because international law recognizes\nmany obligations as binding even without the consent of acting\ngovernments. As long as these obligations are compatible with the\nminimal standard of justice, they are legitimate even if they have\narisen without state consent.\n\nBuchanan also rejects the idea that the source of a legitimacy deficit\nat the international level is the inequality among states. He does not\nbelieve that states need to have equal weight in international\ninstitutions. What he regards as the main problem of legitimacy at the\ninternational level is, instead, that “a technocratic elite,\nlacking in democratic accountability to individuals and nonstate\ngroups, is playing an increasingly powerful role in a system of\nregional and global governance” (2003: 289). The more efficient\nremedy for this problem, he argues, is protecting basic human rights\nand improving democratic accountability.\n\nBuchanan uses his conception of legitimacy to answer the question when\na political entity—as formed, for example, by secession or by\nunion—should be recognized as legitimate. He lists three\ncriteria (Buchanan 2003: 266ff). The first is a “minimal\ninternal justice requirement”. It specifies how political\nentities should treat those upon whom it wields political power.\nSpecifically, it requires that basic human rights are protected. This\nrequirement includes a demand for minimal democracy. But not all\npolitical entities that satisfy this requirement deserve to be\nrecognized as legitimate. They also need to be formed in the right\nway. The second criterion is thus a criterion of procedural justice\nand requires that a political entity has not come about through\nusurpation (“nonusurpation requirement”). Finally, there\nis a “minimal external justice requirement”. It contains\nconditions about how political entities should interact with one\nanother.\n\nSofia Näsström (2007) uses the people-centered approach to\npush against the tendency to associate state legitimacy with the\nlegitimacy of governments. The more fundamental question, she argues,\nis what makes the constitution of a people legitimate. And it would be\na mistake to think that the constitution of a people is a historical\nissue or an empirical given. What makes the constitution of a people\nlegitimate is a normative question in its own right that must be asked\nbefore we can ask about the legitimacy of the government of a\npeople.\n\nThe question Näsström articulates, which is also discussed\nin the literature on the constitution of the demos (Goodin 2007), is\nimportant for the debate on the ethics of immigration. What is the\nscope for legitimate border controls? Do states have a unilateral\nright to control their borders or do potential immigrants have a right\nto participate in the determination of immigration policies? Abizadeh\n(2008) has argued, on the basis of the claim that the constitution of\nthe demos is not a historical given, that a commitment to a democratic\ntheory of domestic political legitimacy implies that one ought to\nreject the unilateral domestic right to control and close the\nstate’s boundaries. His key claim is that state borders are\ncoercive to potential immigrants. In light of this, and because, in a\ndemocracy, the exercise of coercive political power requires some form\nof democratic justification, he concludes that both citizens and\nforeigners should have say in the determination of border policies.\n(See Miller 2008 for a critical discussion of this argument.)\n\nConceptions of global legitimacy broaden the scope of legitimate\nauthority to global governance institutions. One of the precursors of\nglobal legitimacy is Kant. Kant is often read as advocating a\nconception of international legitimacy based on a loose “league\nof nations”—especially in Perpetual Peace. But\nSharon Byrd and Joachim Hruschka (2008) argue that Kant, especially in\nThe Doctrine of Right, can also be read as favoring, a\n“state of nation states” as the right approach to global\nlegitimacy. This conception, while stopping short of requiring a\nsingle world state, confers more coercive political power to the\nglobal level than the league of nations, which essentially leaves\nuntouched the sovereignty of nation states.\n\nThe philosophical literature on global legitimacy is very much work in\nprogress. But most proposals favor a multilevel system of governance\nin which global legitimacy is to be achieved through an appropriate\ndivision of labor between nation states and issue-specific global\ngovernance institutions (e.g., Caney 2006; Valentini 2012).\n\nAny successful theory of global legitimacy has to cover the following\nthree issues. First, what are global governance institutions and in\nwhat ways can and should they be thought of as taking over roles from\nstates or their governments? This is a question about the subject of\nglobal legitimacy (Hurrell and MacDonald 2012). Second, what is the\nlegitimacy problem that such governance institutions face? And, third,\nhow can they solve this problem of legitimacy and what are legitimacy\ncriteria that apply to them? How, if at all, do these criteria differ\nfrom those that apply at the level of nation states?\n\nIn response to the first question, Buchanan and Keohane (2006) argue\nthat global governance institutions such as the WTO or the IMF\n“are like governments in that they issue rules and publicly\nattach significant consequences to compliance or failure to comply\nwith them—and claim authority to do so” (Buchanan and\nKeohane 2006: 406). These institutions are set up to handle certain\nissues in similar fashion as national political agencies would. Just\nlike national political institutions, they are coordination devices.\nOnly they are created to solve problems that arise at the global\nlevel.\n\nJoshua Cohen and Charles Sabel (2005) have a slightly broader account\nof global governance institutions—one that is not limited to\nthem being coordination devices, but that emphasizes coercion instead.\nAccording to Cohen and Sabel 2005: 765), “[t]o a substantial and\ngrowing extent … rulemaking directly affecting the freedom of\naction of individuals, firms, and nation states (and the making of\nrules to regulate this rulemaking) is taking place … in global\nsettings created by the world’s nations but no longer under\ntheir effective control.” In their answer to the second\nquestion, they relate the legitimacy problem of global governance\ninstitutions to the absence of political authority, understood as\nlegitimate exercises of coercive political power, at the global level.\nTo overcome this problem, they argue, new modes of governance must be\ncreated, with their own structures of accountability. These structures\nare necessary to properly deal with the coercive power that these\ninstitutions exercise.\n\nBuchanan and Keohane agree that the attempt to rule without legitimacy\nis an unjustified exercise of power. They also argue that the attempt\nto rule without legitimacy raises not only a normative problem, but\nhas direct practical consequences, as institutions that appear\nunjustified will not be effective. The problem of legitimacy that\nglobal governance institutions face is that even when there is\nwidespread agreement that global institutions that can take on the\nrole of co-ordination devices are necessary, there will be widespread\ndisagreement about which particular institutions are necessary and\nwhat rules they should issue (Buchanan and Keohane 2006: 408ff).\n\nIn answer to the third question, Buchanan and Keohane (2006) propose a\nmoralized conception of legitimacy: legitimacy “is the right to\nrule, understood to mean both that institutional agents are morally\njustified in making rules and attempting to secure compliance with\nthem and that people subject to those rules have moral,\ncontent-independent reasons to follow them and/or to not interfere\nwith others’ compliance with them” (2006: 411).\nSubstantively, they propose that an institution is morally justified\nin this way if it does not contribute to grave injustices\n(“minimal moral acceptability”), if there is no obvious\nalternative that would perform better (“comparative\nbenefit”), and if it respects its own guidelines and procedures\n(“institutional integrity”) (Buchanan and Keohane 2006:\n419ff).\n\nAn important question for political cosmopolitanism is to what extent\ninternational and global legitimacy require democracy—either at\nthe level of national states and governments or at the level of global\ngovernance institutions. Many writers on the subject have tended to\ntake a cautiously positive stance on this issue (e.g., Beitz 1979b,\n1998; Held 1995, 2002; Buchanan 2003; Buchanan and Keohane 2006). An\nexception is Rawls in The Law of Peoples, however,\nwho advocates a conception of international legitimacy that demands\nthat peoples and their states are well-ordered, but does not associate\nwell-orderedness with democracy.\n\nThere are two worries that tend to underlie the cautious attitude. One\nis feasibility: it is often argued that democracy at the international\nlevel, let alone at the level of global governance institutions, is\nutopian and cannot be realized. The second worry is of a moral nature:\ndemocracy should not be imposed on people and peoples who endorse a\ndifferent set of values (see Valentini 2014 for a discussion).\n\nIn response to the second worry, Christiano (2015) argues that a human\nright to democracy is compatible with a right to self-determination\nand that, properly understood, the right to self-determination\npresupposes the human right to democracy. Christiano’s work\noffers the most comprehensive defense of a human right to democracy at\nthe domestic level (Christiano 2011; 2015). Christiano’s\ninstrumental argument aims to show that democracies offer better\nprotection of a range of human rights than non-democracies. His\nintrinsic argument for a human right to democracy builds on an\nargument discussed earlier (section 4.2), namely that democracies are\nuniquely able to realize the value of publicly treating people as\nequals.\n\nCohen and Sabel (2005) seek to rescue an ideal of global democracy\nfrom more skeptical tendencies in the literature. They respond to\nthese considerations by advocating a notion of global democracy that\nemphasizes the deliberative aspect. Granting to skeptics that\ndemocratic decision-making mechanisms might be problematic for both\nfeasibility reasons and moral reasons, they argue that some form of\ndeliberation is primarily what is needed to address the legitimacy\ndeficit that global governance institutions face (see also Appiah\n2007; List and Koenig-Archibugi 2010).\n",
    "section_title": "5.2 Political Cosmopolitanism",
    "entry_title": "Political Legitimacy",
    "hierarchy_title": "Political Legitimacy || Legitimacy and Political Cosmopolitanism || Political Nationalism",
    "tokenized_text": [
        "legitimacy",
        "political",
        "cosmopolitanism",
        "political",
        "nationalism",
        "political",
        "cosmopolitanism",
        "two",
        "main",
        "approach",
        "international",
        "global",
        "legitimacy",
        "statecentered",
        "approach",
        "peoplecentered",
        "approach",
        "former",
        "take",
        "appropriate",
        "relation",
        "among",
        "state",
        "basic",
        "charles",
        "beitz",
        "characterizes",
        "approach",
        "international",
        "society",
        "understood",
        "domestic",
        "society",
        "writ",
        "large",
        "state",
        "playing",
        "role",
        "occupied",
        "person",
        "domestic",
        "society",
        "state",
        "person",
        "subject",
        "international",
        "morality",
        "rule",
        "regulate",
        "behavior",
        "supposed",
        "preserve",
        "peaceful",
        "order",
        "sovereign",
        "state",
        "b",
        "see",
        "also",
        "beitz",
        "locke",
        "bentham",
        "mill",
        "among",
        "others",
        "approached",
        "issue",
        "international",
        "legitimacy",
        "way",
        "among",
        "contemporary",
        "thinker",
        "michael",
        "walzer",
        "defends",
        "statebasedor",
        "call",
        "itcommunitybased",
        "approach",
        "important",
        "criterion",
        "international",
        "legitimacy",
        "proposes",
        "criterion",
        "noninterference",
        "discussion",
        "walzer",
        "proposal",
        "see",
        "beitz",
        "a",
        "b",
        "others",
        "put",
        "forward",
        "conception",
        "based",
        "state",
        "consent",
        "rawls",
        "advocate",
        "conception",
        "based",
        "consent",
        "wellordered",
        "either",
        "liberal",
        "decent",
        "people",
        "rawls",
        "critical",
        "discussion",
        "see",
        "eg",
        "buchanan",
        "wenar",
        "cavallero",
        "second",
        "approach",
        "take",
        "feature",
        "individualstheir",
        "interest",
        "rightsas",
        "basic",
        "legitimacy",
        "present",
        "comprehensive",
        "contemporary",
        "philosophical",
        "treatment",
        "international",
        "legitimacy",
        "kind",
        "probably",
        "allen",
        "buchanan",
        "justice",
        "legitimacy",
        "selfdetermination",
        "mentioned",
        "section",
        "buchanan",
        "advocate",
        "moralized",
        "conception",
        "legitimacy",
        "according",
        "entity",
        "legitimate",
        "morally",
        "justified",
        "wield",
        "political",
        "power",
        "specifically",
        "political",
        "legitimacy",
        "requires",
        "minimal",
        "standard",
        "justice",
        "met",
        "basis",
        "moralized",
        "conception",
        "legitimacy",
        "buchanan",
        "argues",
        "statebased",
        "conception",
        "state",
        "consent",
        "theory",
        "legitimacy",
        "particular",
        "state",
        "consent",
        "buchanan",
        "claim",
        "neither",
        "necessary",
        "sufficient",
        "legitimacy",
        "sufficient",
        "wellknown",
        "state",
        "tend",
        "worst",
        "perpetrator",
        "matter",
        "human",
        "right",
        "thus",
        "need",
        "independent",
        "international",
        "standard",
        "minimal",
        "justice",
        "obtain",
        "legitimacy",
        "necessary",
        "international",
        "law",
        "recognizes",
        "many",
        "obligation",
        "binding",
        "even",
        "without",
        "consent",
        "acting",
        "government",
        "long",
        "obligation",
        "compatible",
        "minimal",
        "standard",
        "justice",
        "legitimate",
        "even",
        "arisen",
        "without",
        "state",
        "consent",
        "buchanan",
        "also",
        "reject",
        "idea",
        "source",
        "legitimacy",
        "deficit",
        "international",
        "level",
        "inequality",
        "among",
        "state",
        "believe",
        "state",
        "need",
        "equal",
        "weight",
        "international",
        "institution",
        "regard",
        "main",
        "problem",
        "legitimacy",
        "international",
        "level",
        "instead",
        "technocratic",
        "elite",
        "lacking",
        "democratic",
        "accountability",
        "individual",
        "nonstate",
        "group",
        "playing",
        "increasingly",
        "powerful",
        "role",
        "system",
        "regional",
        "global",
        "governance",
        "efficient",
        "remedy",
        "problem",
        "argues",
        "protecting",
        "basic",
        "human",
        "right",
        "improving",
        "democratic",
        "accountability",
        "buchanan",
        "us",
        "conception",
        "legitimacy",
        "answer",
        "question",
        "political",
        "entityas",
        "formed",
        "example",
        "secession",
        "unionshould",
        "recognized",
        "legitimate",
        "list",
        "three",
        "criterion",
        "buchanan",
        "ff",
        "first",
        "minimal",
        "internal",
        "justice",
        "requirement",
        "specifies",
        "political",
        "entity",
        "treat",
        "upon",
        "wields",
        "political",
        "power",
        "specifically",
        "requires",
        "basic",
        "human",
        "right",
        "protected",
        "requirement",
        "includes",
        "demand",
        "minimal",
        "democracy",
        "political",
        "entity",
        "satisfy",
        "requirement",
        "deserve",
        "recognized",
        "legitimate",
        "also",
        "need",
        "formed",
        "right",
        "way",
        "second",
        "criterion",
        "thus",
        "criterion",
        "procedural",
        "justice",
        "requires",
        "political",
        "entity",
        "come",
        "usurpation",
        "nonusurpation",
        "requirement",
        "finally",
        "minimal",
        "external",
        "justice",
        "requirement",
        "contains",
        "condition",
        "political",
        "entity",
        "interact",
        "one",
        "another",
        "sofia",
        "näsström",
        "us",
        "peoplecentered",
        "approach",
        "push",
        "tendency",
        "associate",
        "state",
        "legitimacy",
        "legitimacy",
        "government",
        "fundamental",
        "question",
        "argues",
        "make",
        "constitution",
        "people",
        "legitimate",
        "would",
        "mistake",
        "think",
        "constitution",
        "people",
        "historical",
        "issue",
        "empirical",
        "given",
        "make",
        "constitution",
        "people",
        "legitimate",
        "normative",
        "question",
        "right",
        "must",
        "asked",
        "ask",
        "legitimacy",
        "government",
        "people",
        "question",
        "näsström",
        "articulates",
        "also",
        "discussed",
        "literature",
        "constitution",
        "demo",
        "goodin",
        "important",
        "debate",
        "ethic",
        "immigration",
        "scope",
        "legitimate",
        "border",
        "control",
        "state",
        "unilateral",
        "right",
        "control",
        "border",
        "potential",
        "immigrant",
        "right",
        "participate",
        "determination",
        "immigration",
        "policy",
        "abizadeh",
        "argued",
        "basis",
        "claim",
        "constitution",
        "demo",
        "historical",
        "given",
        "commitment",
        "democratic",
        "theory",
        "domestic",
        "political",
        "legitimacy",
        "implies",
        "one",
        "ought",
        "reject",
        "unilateral",
        "domestic",
        "right",
        "control",
        "close",
        "state",
        "boundary",
        "key",
        "claim",
        "state",
        "border",
        "coercive",
        "potential",
        "immigrant",
        "light",
        "democracy",
        "exercise",
        "coercive",
        "political",
        "power",
        "requires",
        "form",
        "democratic",
        "justification",
        "concludes",
        "citizen",
        "foreigner",
        "say",
        "determination",
        "border",
        "policy",
        "see",
        "miller",
        "critical",
        "discussion",
        "argument",
        "conception",
        "global",
        "legitimacy",
        "broaden",
        "scope",
        "legitimate",
        "authority",
        "global",
        "governance",
        "institution",
        "one",
        "precursor",
        "global",
        "legitimacy",
        "kant",
        "kant",
        "often",
        "read",
        "advocating",
        "conception",
        "international",
        "legitimacy",
        "based",
        "loose",
        "league",
        "nation",
        "especially",
        "perpetual",
        "peace",
        "sharon",
        "byrd",
        "joachim",
        "hruschka",
        "argue",
        "kant",
        "especially",
        "doctrine",
        "right",
        "also",
        "read",
        "favoring",
        "state",
        "nation",
        "state",
        "right",
        "approach",
        "global",
        "legitimacy",
        "conception",
        "stopping",
        "short",
        "requiring",
        "single",
        "world",
        "state",
        "confers",
        "coercive",
        "political",
        "power",
        "global",
        "level",
        "league",
        "nation",
        "essentially",
        "leaf",
        "untouched",
        "sovereignty",
        "nation",
        "state",
        "philosophical",
        "literature",
        "global",
        "legitimacy",
        "much",
        "work",
        "progress",
        "proposal",
        "favor",
        "multilevel",
        "system",
        "governance",
        "global",
        "legitimacy",
        "achieved",
        "appropriate",
        "division",
        "labor",
        "nation",
        "state",
        "issuespecific",
        "global",
        "governance",
        "institution",
        "eg",
        "caney",
        "valentini",
        "successful",
        "theory",
        "global",
        "legitimacy",
        "cover",
        "following",
        "three",
        "issue",
        "first",
        "global",
        "governance",
        "institution",
        "way",
        "thought",
        "taking",
        "role",
        "state",
        "government",
        "question",
        "subject",
        "global",
        "legitimacy",
        "hurrell",
        "macdonald",
        "second",
        "legitimacy",
        "problem",
        "governance",
        "institution",
        "face",
        "third",
        "solve",
        "problem",
        "legitimacy",
        "legitimacy",
        "criterion",
        "apply",
        "criterion",
        "differ",
        "apply",
        "level",
        "nation",
        "state",
        "response",
        "first",
        "question",
        "buchanan",
        "keohane",
        "argue",
        "global",
        "governance",
        "institution",
        "wto",
        "imf",
        "like",
        "government",
        "issue",
        "rule",
        "publicly",
        "attach",
        "significant",
        "consequence",
        "compliance",
        "failure",
        "comply",
        "themand",
        "claim",
        "authority",
        "buchanan",
        "keohane",
        "institution",
        "set",
        "handle",
        "certain",
        "issue",
        "similar",
        "fashion",
        "national",
        "political",
        "agency",
        "would",
        "like",
        "national",
        "political",
        "institution",
        "coordination",
        "device",
        "created",
        "solve",
        "problem",
        "arise",
        "global",
        "level",
        "joshua",
        "cohen",
        "charles",
        "sabel",
        "slightly",
        "broader",
        "account",
        "global",
        "governance",
        "institutionsone",
        "limited",
        "coordination",
        "device",
        "emphasizes",
        "coercion",
        "instead",
        "according",
        "cohen",
        "sabel",
        "substantial",
        "growing",
        "extent",
        "rulemaking",
        "directly",
        "affecting",
        "freedom",
        "action",
        "individual",
        "firm",
        "nation",
        "state",
        "making",
        "rule",
        "regulate",
        "rulemaking",
        "taking",
        "place",
        "global",
        "setting",
        "created",
        "world",
        "nation",
        "longer",
        "effective",
        "control",
        "answer",
        "second",
        "question",
        "relate",
        "legitimacy",
        "problem",
        "global",
        "governance",
        "institution",
        "absence",
        "political",
        "authority",
        "understood",
        "legitimate",
        "exercise",
        "coercive",
        "political",
        "power",
        "global",
        "level",
        "overcome",
        "problem",
        "argue",
        "new",
        "mode",
        "governance",
        "must",
        "created",
        "structure",
        "accountability",
        "structure",
        "necessary",
        "properly",
        "deal",
        "coercive",
        "power",
        "institution",
        "exercise",
        "buchanan",
        "keohane",
        "agree",
        "attempt",
        "rule",
        "without",
        "legitimacy",
        "unjustified",
        "exercise",
        "power",
        "also",
        "argue",
        "attempt",
        "rule",
        "without",
        "legitimacy",
        "raise",
        "normative",
        "problem",
        "direct",
        "practical",
        "consequence",
        "institution",
        "appear",
        "unjustified",
        "effective",
        "problem",
        "legitimacy",
        "global",
        "governance",
        "institution",
        "face",
        "even",
        "widespread",
        "agreement",
        "global",
        "institution",
        "take",
        "role",
        "coordination",
        "device",
        "necessary",
        "widespread",
        "disagreement",
        "particular",
        "institution",
        "necessary",
        "rule",
        "issue",
        "buchanan",
        "keohane",
        "ff",
        "answer",
        "third",
        "question",
        "buchanan",
        "keohane",
        "propose",
        "moralized",
        "conception",
        "legitimacy",
        "legitimacy",
        "right",
        "rule",
        "understood",
        "mean",
        "institutional",
        "agent",
        "morally",
        "justified",
        "making",
        "rule",
        "attempting",
        "secure",
        "compliance",
        "people",
        "subject",
        "rule",
        "moral",
        "contentindependent",
        "reason",
        "follow",
        "andor",
        "interfere",
        "others",
        "compliance",
        "substantively",
        "propose",
        "institution",
        "morally",
        "justified",
        "way",
        "contribute",
        "grave",
        "injustice",
        "minimal",
        "moral",
        "acceptability",
        "obvious",
        "alternative",
        "would",
        "perform",
        "better",
        "comparative",
        "benefit",
        "respect",
        "guideline",
        "procedure",
        "institutional",
        "integrity",
        "buchanan",
        "keohane",
        "ff",
        "important",
        "question",
        "political",
        "cosmopolitanism",
        "extent",
        "international",
        "global",
        "legitimacy",
        "require",
        "democracyeither",
        "level",
        "national",
        "state",
        "government",
        "level",
        "global",
        "governance",
        "institution",
        "many",
        "writer",
        "subject",
        "tended",
        "take",
        "cautiously",
        "positive",
        "stance",
        "issue",
        "eg",
        "beitz",
        "b",
        "held",
        "buchanan",
        "buchanan",
        "keohane",
        "exception",
        "rawls",
        "law",
        "people",
        "however",
        "advocate",
        "conception",
        "international",
        "legitimacy",
        "demand",
        "people",
        "state",
        "wellordered",
        "associate",
        "wellorderedness",
        "democracy",
        "two",
        "worry",
        "tend",
        "underlie",
        "cautious",
        "attitude",
        "one",
        "feasibility",
        "often",
        "argued",
        "democracy",
        "international",
        "level",
        "let",
        "alone",
        "level",
        "global",
        "governance",
        "institution",
        "utopian",
        "realized",
        "second",
        "worry",
        "moral",
        "nature",
        "democracy",
        "imposed",
        "people",
        "people",
        "endorse",
        "different",
        "set",
        "value",
        "see",
        "valentini",
        "discussion",
        "response",
        "second",
        "worry",
        "christiano",
        "argues",
        "human",
        "right",
        "democracy",
        "compatible",
        "right",
        "selfdetermination",
        "properly",
        "understood",
        "right",
        "selfdetermination",
        "presupposes",
        "human",
        "right",
        "democracy",
        "christiano",
        "work",
        "offer",
        "comprehensive",
        "defense",
        "human",
        "right",
        "democracy",
        "domestic",
        "level",
        "christiano",
        "christiano",
        "instrumental",
        "argument",
        "aim",
        "show",
        "democracy",
        "offer",
        "better",
        "protection",
        "range",
        "human",
        "right",
        "nondemocracies",
        "intrinsic",
        "argument",
        "human",
        "right",
        "democracy",
        "build",
        "argument",
        "discussed",
        "earlier",
        "section",
        "namely",
        "democracy",
        "uniquely",
        "able",
        "realize",
        "value",
        "publicly",
        "treating",
        "people",
        "equal",
        "cohen",
        "sabel",
        "seek",
        "rescue",
        "ideal",
        "global",
        "democracy",
        "skeptical",
        "tendency",
        "literature",
        "respond",
        "consideration",
        "advocating",
        "notion",
        "global",
        "democracy",
        "emphasizes",
        "deliberative",
        "aspect",
        "granting",
        "skeptic",
        "democratic",
        "decisionmaking",
        "mechanism",
        "might",
        "problematic",
        "feasibility",
        "reason",
        "moral",
        "reason",
        "argue",
        "form",
        "deliberation",
        "primarily",
        "needed",
        "address",
        "legitimacy",
        "deficit",
        "global",
        "governance",
        "institution",
        "face",
        "see",
        "also",
        "appiah",
        "list",
        "koenigarchibugi"
    ]
}