{
    "main_text": "The Function of Political Legitimacy || Justifying Power and Coercion\n2.2 Justifying Power and Coercion\n\nThose who link political legitimacy to the problem of justifying\nauthority tend to think of political coercion as only a means that\nlegitimate states may use to secure their authority. As Leslie Green\nputs it: “Coercion threats provide secondary, reinforcing\nmotivation when the political order fails in its primary normative\ntechnique of authoritative guidance” (Green 1988: 75). According\nto a second important view, held by Rawls (1993), for example, the\nmain function of legitimacy is precisely to justify coercive power.\n(For an excellent discussion of the two interpretations of legitimacy\nand a defense of the coercion-based interpretation, see Ripstein 2004;\nsee also Hampton 1998.) On coercion-based interpretations, the main\nproblem that a conception of legitimacy aims to solve is how to\ndistinguish the rightful use of political power from mere coercion.\nWhether a political body such as a state is legitimate and whether\ncitizens have political obligations towards it depends, on this view\non whether the coercive political power that the state exercises is\njustified. Again, there are different ways in which this idea might be\nunderstood.\n\nIn Thomas Hobbes’ influential account, political authority is\ncreated by the social contract. In the state of nature,\neveryone’s self-preservation is under threat, and this makes it\nrational for all to consent to a covenant that authorizes a sovereign\nwho can guarantee their protection and to transfer their rights to\nthis sovereign—an individual or a group of individuals. When\nthere is no such sovereign, one may be created by a\ncovenant—Hobbes calls this “sovereignty by\ninstitution”. But political authority may also be established by\nthe promise of all to obey a threatening power (“sovereignty by\nacquisition”; see Leviathan, chapter 17). Both manners\nof creating a sovereign are equally legitimate. And political\nauthority will be legitimate as long as the sovereign ensures the\nprotection of the citizens, as Hobbes believes that the natural right\nto self-preservation cannot be relinquished (Leviathan,\nchapter 21). Beyond that, however, there can be no further questions\nabout the legitimacy of the sovereign. In particular, there is no\ndistinction between effective authority and legitimate authority in\nHobbes’ thought. It might even be argued that Hobbes fails to\ndistinguish between legitimate authority and the mere exercise of\npower (Korsgaard 1997: 29; see chapter 30 of Leviathan,\nhowever, for an account of the quality of the sovereign’s\nrule).\n\nAnother way in which the relation between legitimacy and the creation\nof authority may be understood is that the attempt to rule without\nlegitimacy is an attempt to exercise coercive power—not\nauthority. Such a view can be found in Jean-Jacques Rousseau’s\nwork. Legitimacy, for Rousseau, justifies the state’s exercise\nof coercive power and creates an obligation to obey. Rousseau\ncontrasts a legitimate social order with a system of rules that is\nmerely the expression of power. Coercive power is primarily a feature\nof the civil state. While there are some forms of coercive power even\nin the state of nature—for example the power of parents over\ntheir children—Rousseau assumes that harmful coercive power\narises primarily in the civil state and that this creates the problem\nof legitimacy. In the first chapter of the first book of On\nthe Social Contract he remarks that while “[m]an\nis born free”, the civil state he observes makes everyone a\nslave. Rousseau’s main question is under what conditions a civil\nstate, which uses coercive power to back up its laws, can be thought\nof as freeing citizens from this serfdom. Such a state would be\nlegitimate. As he puts it in the opening sentence of the Social\nContract, “I want to inquire whether there can be some\nlegitimate and sure rule of administration in the civil order, taking\nmen as they are and laws as they might be.”\n\nRousseau’s account of legitimacy is importantly different from\nLocke’s in that Rousseau does not attach normativity to the\nprocess through which a civil state emerges from the state of nature.\nLegitimate political authority is created by convention, reached\nwithin the civil state. Specifically, Rousseau suggests that\nlegitimacy arises from the democratic justification of the laws of the\ncivil state (Social Contract I:6; cf. section 3.3.\nbelow).\n\nFor Immanuel Kant, as for Hobbes, political authority is created by\nthe establishment of political institutions in the civil state. It\ndoes not pre-exist in individuals in the state of nature. What exists\nin the pre-civil social state, according to Kant, is the moral\nauthority of each individual qua rational being and a moral obligation\nto form a civil state. Establishing a civil state is “in itself\nan end (that each ought to have)” (Kant, Theory and\nPractice 8:289; see also Perpetual Peace, Appendix I).\nKant regards the civil state as a necessary first step toward a moral\norder (the “ethical commonwealth”). It helps people\nconform to certain rules by eliminating what today would be called the\nfree-riding problem or the problem of partial compliance. By creating\na coercive order of public legal justice, “a great step is taken\ntoward morality (though it is not yet a moral step), toward being\nattached to this concept of duty even for its own sake” (Kant,\nPerpetual Peace 8:376, notes to Appendix I; see also Riley\n1982: 129f).\n\nThe civil state, according to Kant, establishes the rights necessary\nto secure equal freedom. Unlike for Locke and his contemporary\nfollowers, however, coercive power is not a secondary feature of the\ncivil state, necessary to back up laws. According to Kant, coercion is\npart of the idea of rights. The thought can be explained as follows.\nCoercion is defined as a restriction of the freedom to pursue\none’s own ends. Any right of a person—independently of\nwhether it is respected or has been violated—implies a\nrestriction for others. (cf. Kant, Theory and Practice, Part\n2; Ripstein 2004: 8; Flikschuh 2008: 389f). Coercion, in this view, is\nthus not merely a means for the civil state to enforce rights as\ndefenders of an authority-based concept of legitimacy claim. Instead,\naccording to Kant, it is constitutive of the civil state. This\nunderstanding of rights links Kant’s conception of legitimacy to\nthe justification of coercion.\n\nLegitimacy, for Kant, depends on a particular interpretation of the\nsocial contract. For Kant, the social contract which establishes the\ncivil state is not an actual event. He accepts David Hume’s\nobjection to Locke that the civil state is often established in an act\nof violence (Hume “Of the Original Contract”). Kant\ninvokes the social contract, instead, as the test “of any public\nlaw’s conformity with right” (Kant Theory and\nPractice 8:294). The criterion is the following: each law should\nbe such that all individuals could have consented to it. The social\ncontract, according to Kant, is thus a hypothetical thought\nexperiment, meant to capture an idea of public reason. As such, it\nsets the standard for what counts as legitimate political authority.\nBecause of his particular interpretation of the social contract, Kant\nis not a social contract theorist in the strict sense. The idea of a\ncontract is nevertheless relevant for his understanding of legitimacy.\n(On the difference between voluntaristic and rationalistic strands in\nliberalism, see Waldron 1987.)\n\nKant, unlike Hobbes, recognizes the difference between legitimate and\neffective authority. For the head of the civil state is under an\nobligation to obey public reason and to enact only laws to which all\nindividuals could consent. If he violates this obligation, however, he\nstill holds authority, even if his authority ceases to be legitimate.\nThis view is best explained in relation to Kant’s often\ncriticized position on the right to revolution. Kant famously denied\nthat there is a right to revolution (Kant, Perpetual Peace,\nAppendix II; for a recent discussion, see Flikschuh 2008). Kant\nstresses that while “a people”—as united in the\ncivil state—is sovereign, its individual members are under the\nobligation to obey the head of the state thus established. This\nobligation is such that it is incompatible with a right to revolution.\nKant offers a transcendental argument for his position (Kant\nPerpetual Peace, Appendix II; Arendt 1992). A right to\nrevolution would be in contradiction with the idea that individuals\nare bound by public law, but without the idea of citizens being bound\nby public law, there cannot be a civil state—only anarchy. As\nmentioned earlier, however, there is a duty to establish a civil\nstate. Kant’s position implies that the obligation of\nindividuals to obey a head of state is not conditioned upon the\nruler’s performance. In particular, the obligation to obey does\nnot cease when the laws are unjust.\n\nKant’s position on the right to revolution may suggest that he\nregards political authority as similarly absolute as Hobbes. But Kant\nstresses that the head of state is bound by the commands of public\nreason. This is manifest in his insistence on freedom of the pen:\n“a citizen must have, with the approval of the ruler himself,\nthe authorization to make known publicly his opinions about what it is\nin the ruler’s arrangements that seems to him to be a wrong\nagainst the commonwealth” (Kant Theory and Practice\n8:304). While there is no right to revolution, political authority is\nonly legitimate if the head of state respects the social contract. But\npolitical obligations arise even from illegitimate authority. If the\nhead of state acts in violation of the social contract and hence of\npublic reason, for example by restricting citizens’ freedom of\npolitical criticism, citizens are still obligated to obey.\n\nIn 2004, Ripstein argued that much of the contemporary literature on\npolitical legitimacy has been dominated by a focus on the\njustification of authority, rather than coercive political power\n(Ripstein 2004). In the literature since then, it looks as if the\ntables are turning, especially if one considers the debates on\ninternational and global legitimacy (section 5). But prominent earlier\ncoercion-based accounts include those by Nagel (1987) and by\ncontemporary Kantians such as Rawls and Habermas (to be discussed in\nsections 3.3. and 4.3., respectively).\n\nLet me briefly mention other important coercion-based interpretations.\nJean Hampton (1998; drawing on Anscombe 1981) offers an elegant\ncontemporary explication of Hobbes’ view. According to her,\npolitical authority “is invented by a group of people who\nperceive that this kind of special authority as necessary for the\ncollective solution of certain problems of interaction in their\nterritory and whose process of state creation essentially involves\ndesigning the content and structure of that authority so that it meets\nwhat they take to be their needs” (Hampton 1998: 77). Her theory\nlinks the authority of the state to its ability to enforce a solution\nto coordination and cooperation problems. Coercion is the necessary\nfeature that enables the state to provide an effective solution to\nthese problems, and the entitlement to use coercion is what\nconstitutes the authority of the state. The entitlement to use\ncoercion distinguishes such minimally legitimate political authority\nfrom a mere use of power. Hampton draws a further distinction between\nminimal legitimacy and what she calls full moral legitimacy, which\nobtains when political authority is just.\n\nBuchanan (2002) also argues that legitimacy is concerned with the\njustification of coercive power. Buchanan points out that this makes\nlegitimacy a more fundamental normative concept than authority. Like\nHampton, he advocates a moralized interpretation of legitimacy.\nAccording to him, “an entity has political legitimacy if and\nonly if it is morally justified in wielding political power”\n(2002: 689). Political authority, in his approach, obtains if an\nentity is legitimate in this sense and if some further conditions,\nrelating to political obligation, are met (2002: 691). Anna Stilz\n(2009) offers a coercion-centered account of state legitimacy that\ndraws on both Kant and Rousseau.\n",
    "section_title": "2.2 Justifying Power and Coercion",
    "entry_title": "Political Legitimacy",
    "hierarchy_title": "Political Legitimacy || The Function of Political Legitimacy || Justifying Power and Coercion",
    "tokenized_text": [
        "function",
        "political",
        "legitimacy",
        "justifying",
        "power",
        "coercion",
        "justifying",
        "power",
        "coercion",
        "link",
        "political",
        "legitimacy",
        "problem",
        "justifying",
        "authority",
        "tend",
        "think",
        "political",
        "coercion",
        "mean",
        "legitimate",
        "state",
        "may",
        "use",
        "secure",
        "authority",
        "leslie",
        "green",
        "put",
        "coercion",
        "threat",
        "provide",
        "secondary",
        "reinforcing",
        "motivation",
        "political",
        "order",
        "fails",
        "primary",
        "normative",
        "technique",
        "authoritative",
        "guidance",
        "green",
        "according",
        "second",
        "important",
        "view",
        "held",
        "rawls",
        "example",
        "main",
        "function",
        "legitimacy",
        "precisely",
        "justify",
        "coercive",
        "power",
        "excellent",
        "discussion",
        "two",
        "interpretation",
        "legitimacy",
        "defense",
        "coercionbased",
        "interpretation",
        "see",
        "ripstein",
        "see",
        "also",
        "hampton",
        "coercionbased",
        "interpretation",
        "main",
        "problem",
        "conception",
        "legitimacy",
        "aim",
        "solve",
        "distinguish",
        "rightful",
        "use",
        "political",
        "power",
        "mere",
        "coercion",
        "whether",
        "political",
        "body",
        "state",
        "legitimate",
        "whether",
        "citizen",
        "political",
        "obligation",
        "towards",
        "depends",
        "view",
        "whether",
        "coercive",
        "political",
        "power",
        "state",
        "exercise",
        "justified",
        "different",
        "way",
        "idea",
        "might",
        "understood",
        "thomas",
        "hobbes",
        "influential",
        "account",
        "political",
        "authority",
        "created",
        "social",
        "contract",
        "state",
        "nature",
        "everyone",
        "selfpreservation",
        "threat",
        "make",
        "rational",
        "consent",
        "covenant",
        "authorizes",
        "sovereign",
        "guarantee",
        "protection",
        "transfer",
        "right",
        "sovereignan",
        "individual",
        "group",
        "individual",
        "sovereign",
        "one",
        "may",
        "created",
        "covenanthobbes",
        "call",
        "sovereignty",
        "institution",
        "political",
        "authority",
        "may",
        "also",
        "established",
        "promise",
        "obey",
        "threatening",
        "power",
        "sovereignty",
        "acquisition",
        "see",
        "leviathan",
        "chapter",
        "manner",
        "creating",
        "sovereign",
        "equally",
        "legitimate",
        "political",
        "authority",
        "legitimate",
        "long",
        "sovereign",
        "ensures",
        "protection",
        "citizen",
        "hobbes",
        "belief",
        "natural",
        "right",
        "selfpreservation",
        "relinquished",
        "leviathan",
        "chapter",
        "beyond",
        "however",
        "question",
        "legitimacy",
        "sovereign",
        "particular",
        "distinction",
        "effective",
        "authority",
        "legitimate",
        "authority",
        "hobbes",
        "thought",
        "might",
        "even",
        "argued",
        "hobbes",
        "fails",
        "distinguish",
        "legitimate",
        "authority",
        "mere",
        "exercise",
        "power",
        "korsgaard",
        "see",
        "chapter",
        "leviathan",
        "however",
        "account",
        "quality",
        "sovereign",
        "rule",
        "another",
        "way",
        "relation",
        "legitimacy",
        "creation",
        "authority",
        "may",
        "understood",
        "attempt",
        "rule",
        "without",
        "legitimacy",
        "attempt",
        "exercise",
        "coercive",
        "powernot",
        "authority",
        "view",
        "found",
        "jeanjacques",
        "rousseau",
        "work",
        "legitimacy",
        "rousseau",
        "justifies",
        "state",
        "exercise",
        "coercive",
        "power",
        "creates",
        "obligation",
        "obey",
        "rousseau",
        "contrast",
        "legitimate",
        "social",
        "order",
        "system",
        "rule",
        "merely",
        "expression",
        "power",
        "coercive",
        "power",
        "primarily",
        "feature",
        "civil",
        "state",
        "form",
        "coercive",
        "power",
        "even",
        "state",
        "naturefor",
        "example",
        "power",
        "parent",
        "childrenrousseau",
        "assumes",
        "harmful",
        "coercive",
        "power",
        "arises",
        "primarily",
        "civil",
        "state",
        "creates",
        "problem",
        "legitimacy",
        "first",
        "chapter",
        "first",
        "book",
        "social",
        "contract",
        "remark",
        "born",
        "free",
        "civil",
        "state",
        "observes",
        "make",
        "everyone",
        "slave",
        "rousseau",
        "main",
        "question",
        "condition",
        "civil",
        "state",
        "us",
        "coercive",
        "power",
        "back",
        "law",
        "thought",
        "freeing",
        "citizen",
        "serfdom",
        "state",
        "would",
        "legitimate",
        "put",
        "opening",
        "sentence",
        "social",
        "contract",
        "want",
        "inquire",
        "whether",
        "legitimate",
        "sure",
        "rule",
        "administration",
        "civil",
        "order",
        "taking",
        "men",
        "law",
        "might",
        "be",
        "rousseau",
        "account",
        "legitimacy",
        "importantly",
        "different",
        "locke",
        "rousseau",
        "attach",
        "normativity",
        "process",
        "civil",
        "state",
        "emerges",
        "state",
        "nature",
        "legitimate",
        "political",
        "authority",
        "created",
        "convention",
        "reached",
        "within",
        "civil",
        "state",
        "specifically",
        "rousseau",
        "suggests",
        "legitimacy",
        "arises",
        "democratic",
        "justification",
        "law",
        "civil",
        "state",
        "social",
        "contract",
        "i",
        "cf",
        "section",
        "immanuel",
        "kant",
        "hobbes",
        "political",
        "authority",
        "created",
        "establishment",
        "political",
        "institution",
        "civil",
        "state",
        "preexist",
        "individual",
        "state",
        "nature",
        "exists",
        "precivil",
        "social",
        "state",
        "according",
        "kant",
        "moral",
        "authority",
        "individual",
        "qua",
        "rational",
        "moral",
        "obligation",
        "form",
        "civil",
        "state",
        "establishing",
        "civil",
        "state",
        "end",
        "ought",
        "kant",
        "theory",
        "practice",
        "see",
        "also",
        "perpetual",
        "peace",
        "appendix",
        "kant",
        "regard",
        "civil",
        "state",
        "necessary",
        "first",
        "step",
        "toward",
        "moral",
        "order",
        "ethical",
        "commonwealth",
        "help",
        "people",
        "conform",
        "certain",
        "rule",
        "eliminating",
        "today",
        "would",
        "called",
        "freeriding",
        "problem",
        "problem",
        "partial",
        "compliance",
        "creating",
        "coercive",
        "order",
        "public",
        "legal",
        "justice",
        "great",
        "step",
        "taken",
        "toward",
        "morality",
        "though",
        "yet",
        "moral",
        "step",
        "toward",
        "attached",
        "concept",
        "duty",
        "even",
        "sake",
        "kant",
        "perpetual",
        "peace",
        "note",
        "appendix",
        "see",
        "also",
        "riley",
        "f",
        "civil",
        "state",
        "according",
        "kant",
        "establishes",
        "right",
        "necessary",
        "secure",
        "equal",
        "freedom",
        "unlike",
        "locke",
        "contemporary",
        "follower",
        "however",
        "coercive",
        "power",
        "secondary",
        "feature",
        "civil",
        "state",
        "necessary",
        "back",
        "law",
        "according",
        "kant",
        "coercion",
        "part",
        "idea",
        "right",
        "thought",
        "explained",
        "follows",
        "coercion",
        "defined",
        "restriction",
        "freedom",
        "pursue",
        "one",
        "end",
        "right",
        "personindependently",
        "whether",
        "respected",
        "violatedimplies",
        "restriction",
        "others",
        "cf",
        "kant",
        "theory",
        "practice",
        "part",
        "ripstein",
        "flikschuh",
        "f",
        "coercion",
        "view",
        "thus",
        "merely",
        "mean",
        "civil",
        "state",
        "enforce",
        "right",
        "defender",
        "authoritybased",
        "concept",
        "legitimacy",
        "claim",
        "instead",
        "according",
        "kant",
        "constitutive",
        "civil",
        "state",
        "understanding",
        "right",
        "link",
        "kant",
        "conception",
        "legitimacy",
        "justification",
        "coercion",
        "legitimacy",
        "kant",
        "depends",
        "particular",
        "interpretation",
        "social",
        "contract",
        "kant",
        "social",
        "contract",
        "establishes",
        "civil",
        "state",
        "actual",
        "event",
        "accepts",
        "david",
        "hume",
        "objection",
        "locke",
        "civil",
        "state",
        "often",
        "established",
        "act",
        "violence",
        "hume",
        "original",
        "contract",
        "kant",
        "invokes",
        "social",
        "contract",
        "instead",
        "test",
        "public",
        "law",
        "conformity",
        "right",
        "kant",
        "theory",
        "practice",
        "criterion",
        "following",
        "law",
        "individual",
        "could",
        "consented",
        "social",
        "contract",
        "according",
        "kant",
        "thus",
        "hypothetical",
        "thought",
        "experiment",
        "meant",
        "capture",
        "idea",
        "public",
        "reason",
        "set",
        "standard",
        "count",
        "legitimate",
        "political",
        "authority",
        "particular",
        "interpretation",
        "social",
        "contract",
        "kant",
        "social",
        "contract",
        "theorist",
        "strict",
        "sense",
        "idea",
        "contract",
        "nevertheless",
        "relevant",
        "understanding",
        "legitimacy",
        "difference",
        "voluntaristic",
        "rationalistic",
        "strand",
        "liberalism",
        "see",
        "waldron",
        "kant",
        "unlike",
        "hobbes",
        "recognizes",
        "difference",
        "legitimate",
        "effective",
        "authority",
        "head",
        "civil",
        "state",
        "obligation",
        "obey",
        "public",
        "reason",
        "enact",
        "law",
        "individual",
        "could",
        "consent",
        "violates",
        "obligation",
        "however",
        "still",
        "hold",
        "authority",
        "even",
        "authority",
        "cease",
        "legitimate",
        "view",
        "best",
        "explained",
        "relation",
        "kant",
        "often",
        "criticized",
        "position",
        "right",
        "revolution",
        "kant",
        "famously",
        "denied",
        "right",
        "revolution",
        "kant",
        "perpetual",
        "peace",
        "appendix",
        "ii",
        "recent",
        "discussion",
        "see",
        "flikschuh",
        "kant",
        "stress",
        "people",
        "as",
        "united",
        "civil",
        "stateis",
        "sovereign",
        "individual",
        "member",
        "obligation",
        "obey",
        "head",
        "state",
        "thus",
        "established",
        "obligation",
        "incompatible",
        "right",
        "revolution",
        "kant",
        "offer",
        "transcendental",
        "argument",
        "position",
        "kant",
        "perpetual",
        "peace",
        "appendix",
        "ii",
        "arendt",
        "right",
        "revolution",
        "would",
        "contradiction",
        "idea",
        "individual",
        "bound",
        "public",
        "law",
        "without",
        "idea",
        "citizen",
        "bound",
        "public",
        "law",
        "civil",
        "stateonly",
        "anarchy",
        "mentioned",
        "earlier",
        "however",
        "duty",
        "establish",
        "civil",
        "state",
        "kant",
        "position",
        "implies",
        "obligation",
        "individual",
        "obey",
        "head",
        "state",
        "conditioned",
        "upon",
        "ruler",
        "performance",
        "particular",
        "obligation",
        "obey",
        "cease",
        "law",
        "unjust",
        "kant",
        "position",
        "right",
        "revolution",
        "may",
        "suggest",
        "regard",
        "political",
        "authority",
        "similarly",
        "absolute",
        "hobbes",
        "kant",
        "stress",
        "head",
        "state",
        "bound",
        "command",
        "public",
        "reason",
        "manifest",
        "insistence",
        "freedom",
        "pen",
        "citizen",
        "must",
        "approval",
        "ruler",
        "authorization",
        "make",
        "known",
        "publicly",
        "opinion",
        "ruler",
        "arrangement",
        "seems",
        "wrong",
        "commonwealth",
        "kant",
        "theory",
        "practice",
        "right",
        "revolution",
        "political",
        "authority",
        "legitimate",
        "head",
        "state",
        "respect",
        "social",
        "contract",
        "political",
        "obligation",
        "arise",
        "even",
        "illegitimate",
        "authority",
        "head",
        "state",
        "act",
        "violation",
        "social",
        "contract",
        "hence",
        "public",
        "reason",
        "example",
        "restricting",
        "citizen",
        "freedom",
        "political",
        "criticism",
        "citizen",
        "still",
        "obligated",
        "obey",
        "ripstein",
        "argued",
        "much",
        "contemporary",
        "literature",
        "political",
        "legitimacy",
        "dominated",
        "focus",
        "justification",
        "authority",
        "rather",
        "coercive",
        "political",
        "power",
        "ripstein",
        "literature",
        "since",
        "look",
        "table",
        "turning",
        "especially",
        "one",
        "considers",
        "debate",
        "international",
        "global",
        "legitimacy",
        "section",
        "prominent",
        "earlier",
        "coercionbased",
        "account",
        "include",
        "nagel",
        "contemporary",
        "kantians",
        "rawls",
        "habermas",
        "discussed",
        "section",
        "respectively",
        "let",
        "briefly",
        "mention",
        "important",
        "coercionbased",
        "interpretation",
        "jean",
        "hampton",
        "drawing",
        "anscombe",
        "offer",
        "elegant",
        "contemporary",
        "explication",
        "hobbes",
        "view",
        "according",
        "political",
        "authority",
        "invented",
        "group",
        "people",
        "perceive",
        "kind",
        "special",
        "authority",
        "necessary",
        "collective",
        "solution",
        "certain",
        "problem",
        "interaction",
        "territory",
        "whose",
        "process",
        "state",
        "creation",
        "essentially",
        "involves",
        "designing",
        "content",
        "structure",
        "authority",
        "meet",
        "take",
        "need",
        "hampton",
        "theory",
        "link",
        "authority",
        "state",
        "ability",
        "enforce",
        "solution",
        "coordination",
        "cooperation",
        "problem",
        "coercion",
        "necessary",
        "feature",
        "enables",
        "state",
        "provide",
        "effective",
        "solution",
        "problem",
        "entitlement",
        "use",
        "coercion",
        "constitutes",
        "authority",
        "state",
        "entitlement",
        "use",
        "coercion",
        "distinguishes",
        "minimally",
        "legitimate",
        "political",
        "authority",
        "mere",
        "use",
        "power",
        "hampton",
        "draw",
        "distinction",
        "minimal",
        "legitimacy",
        "call",
        "full",
        "moral",
        "legitimacy",
        "obtains",
        "political",
        "authority",
        "buchanan",
        "also",
        "argues",
        "legitimacy",
        "concerned",
        "justification",
        "coercive",
        "power",
        "buchanan",
        "point",
        "make",
        "legitimacy",
        "fundamental",
        "normative",
        "concept",
        "authority",
        "like",
        "hampton",
        "advocate",
        "moralized",
        "interpretation",
        "legitimacy",
        "according",
        "entity",
        "political",
        "legitimacy",
        "morally",
        "justified",
        "wielding",
        "political",
        "power",
        "political",
        "authority",
        "approach",
        "obtains",
        "entity",
        "legitimate",
        "sense",
        "condition",
        "relating",
        "political",
        "obligation",
        "met",
        "anna",
        "stilz",
        "offer",
        "coercioncentered",
        "account",
        "state",
        "legitimacy",
        "draw",
        "kant",
        "rousseau"
    ]
}