{
    "main_text": "Metaphysics and Natural Philosophy\n2. Metaphysics and Natural Philosophy\n\nLe Grand defended the first principles of Descartes’s philosophy\nwith great fidelity. He held to Descartes’s dualism of mind and\nbody and that the essence of mind is thought and the essence of matter\nis extension. Like Descartes, he also asserted that in the human being\nthe mind and body are united and interact, and that while humans have\nsouls, brutes and other living things are mere machines. In natural\nphilosophy, Le Grand defended the Cartesian physics that material\nthings operate in a plenum and move by means of vortical motions\naccording to the laws of motion. Le Grand did not make any substantial\nrevisions to Cartesian metaphysics or physics. However, he did make\ntwo important contributions: first, he provided clarifications and\nelaborations of Descartes’s account of motion which had direct\nconsequences for the Cartesian account of matter, causation, and\nmind-body interaction; secondly, he extended the application of\nCartesian physics, treating in detail such subjects as metals, plants,\ninsects, animals, and the human body. Both contributions represented\nimportant developments of the Cartesian science, against the\nprevailing Scholastic-Aristotelian science.\n\nLe Grand’s contribution to the Cartesian account of motion may\neither be seen as an extension or a revision of Descartes’s,\nsomewhat ambiguous, treatment. Le Grand took seriously the claim that\nGod is the total and efficient cause of motion in the universe, and\nthat matter is entirely passive, and hence bodies are incapable of\nself-movement, or of moving other bodies. In his Entire Body of\nPhilosophy, he argued that since a body may be in motion or at\nrest and yet still remain a body, motion must be a mode non-essential\nto matter. Moreover, given that matter itself is inert, it cannot be\nthe source of the order and direction of moving bodies. Accordingly,\nGod infused motion into the universe and laid down the laws of motion\nto govern it. Thus, motion itself as well as the orderly movement of\nbodies derive from God who acts as the effective principle. While the\nspecific position, constitution, and configuration of the parts of a\nparticular body determine how certain local motions are communicated,\nthe source and ultimate direction of the motion itself is God. What\nthis means for body-body interaction is that bodies function as\nsecondary causes, directing local motions in virtue of the specific\nconfigurations of their parts. (1694, Book I, part iv, p. 116) Kenneth\nClatterbaugh argues that Le Grand’s position on body-body\ncausation amounts to occasionalism. Clatterbaugh identifies four\npositions that he claims commit Le Grand to the occasionalist doctrine\narticulated by Malebranche: 1) that there are no accidents; 2) that\nmotion is identical to the will of God; 3) that conservation and\ncreation are the same such that God creates bodies and their motions\ncontinuously; and 4) that the Divine Will and Intellect are one.\n(Clatterbaugh, 1999) However, Le Grand’s references to universal\nand secondary causes, and his commitment to the created nature of laws\nand eternal truths make the occasionalist ascription a complicated\none. (See discussion of the Creation Doctrine below in section 3.)\n\nLe Grand’s account of body-body interaction clears the way to\nexplain mind-body interaction and union. In the same way as with\nfinite bodies, God functions as the effective principle of finite\nminds, providing the ultimate source of change: “… there\nis nothing, besides motion, which can strike the organs of the senses,\nor affect the mind itself.” (1694, book I, part viii, p. 284)\nAlthough mind and matter are substances sharing no common properties,\nit is in virtue of God acting as the effective principle that mind and\nbody are capable of interaction. This kind of interaction is no more\nor no less problematic than the interaction of two physical bodies.\nAccording to Le Grand, the causal interaction between bodies and\nbetween minds and bodies are facts dependent upon God’s will and\nknown only by experience. The real question is not about whether there\ncan be interaction, but rather, how particular interactions in fact\noccur: “The union of the soul and body consists in an actual\ndependency of all the cogitations of the soul, upon certain motions of\nthe body; and of some certain motions of the body upon some\ncogitations of the soul.” (1694, book I, part xi, p. 325) As\nthere is no mode of union of mind and body (for modes belong only to\nsubstances), what is required is the actual “mutual commerce of\nactions and passions.” (Ibid., p. 325)\n\nAs with interaction, Le Grand described the mind-body union in terms\ndirectly borrowed from Descartes. However, Le Grand explicated in more\ndetailed terms than did Descartes the nature of the mind-body union.\nAccording to Le Grand, there are three kinds of union, each possessing\ntheir own principle that brings about that union: the first is that of\ntwo minds whose principle of union is love; the second is that of two\nphysical bodies whose principle of union is local presence; and the\nthird is that of the mind and body whose principle of union is actual\nmutual dependence. Just as two physical bodies are joined by physical\ncontact, and as two minds are joined by love, the mind and body are\njoined by a mutually dependent activity. So long as the body actually\nreceives its specific motions dependently on the soul, and the soul\nactually receives its local motions (passions) dependently on the\nbody, then the spirit and the body are joined. Although there can be\nno mode common to mind and matter, there is this mutual action and\nhence a similitude and relation: “This similitude and relation\nwe have formerly affirmed to consist in action and passion.”\n(Ibid., p. 325) In other words, just as the body is capable\nof receiving and transmitting local motions since motion is a mode of\nmatter, the mind is capable of varying passions since passions are a\nmode of the mind. It is by the mutual commerce of such motions and\npassions that the mind and body are said to be united. The mutual\nactivity said to occur between the mind and the body is a property\nwhich follows only from the union of mind and body and cannot proceed\nfrom either alone, “And the truth is, since neither body can\nthink, nor mind be capable of dimension, there can be no mode common\nto mind and body, except a mutual acting of each upon each, from which\nalone the properties of both can follow.” (1694, p. 325).\n\nIn natural philosophy, Le Grand extended Descartes’s physics to\ninclude phenomena that would now be classified as metallurgy,\nentomology, botany, biology, physiology, medicine, psychology, and\npsychiatry. Book II of the Entire Body of Philosophy,\nentitled The History of Nature, catalogues and critically\ndiscusses the latest experiments of his time, as well as the theories\nof the ancients and moderns. Prominent in his discussions is the\nimportance of secondary causes in nature (both exemplary and secondary\nefficient causes), and the need for experiments, not just as tools of\nconfirmation, but also as a means of discovering the true nature of\nthings. This was due to his application of mechanism to explain not\nonly the behavior of material bodies but also the entire institution\nof nature. Le Grand believed that God laid down the laws of nature and\nthe principles of being by acting as the primary efficient cause, and\nthat the operation of these laws and principles manifested themselves\nin nature in the form of secondary causes and effects. Although the\nlaws and their specific mechanisms of operation are not visible,\nsecondary causes and their effects are. These causes and effects then\nare known by experience and are the starting point of all science,\nwhich is characterized by reasoning from effects (observed in nature)\nto causes (first principles discerned by reason). Book III of the\nEntire Body of Philosophy, entitled A Dissertation of the\nWant of Sense and Knowledge in Brute Animals, extends\nDescartes’s treatment of the mechanization of the sensitive soul\nto explain sensory, motor, and appetitive functions. In addition to\ndefending Descartes’s controversial theses that life functions\nare reducible to material motions and that animals are mere machines,\nhe provides an account of how cartesian organic bodies have identity\nover time. (Adriaenssen, 2018) As Hatfield shows, Le Grand’s\ncompendium of nature demonstrates the magnitude of the Cartesian\nproject to mechanize life and the soul. Its detailed observations and\nrich descriptions lay the groundwork for Cartesian physiology and\npsychology. (Hatfield, 2013)\n",
    "section_title": "2. Metaphysics and Natural Philosophy",
    "entry_title": "Antoine Le Grand",
    "hierarchy_title": "Antoine Le Grand || Metaphysics and Natural Philosophy",
    "tokenized_text": [
        "metaphysics",
        "natural",
        "philosophy",
        "metaphysics",
        "natural",
        "philosophy",
        "le",
        "grand",
        "defended",
        "first",
        "principle",
        "descartes",
        "philosophy",
        "great",
        "fidelity",
        "held",
        "descartes",
        "dualism",
        "mind",
        "body",
        "essence",
        "mind",
        "thought",
        "essence",
        "matter",
        "extension",
        "like",
        "descartes",
        "also",
        "asserted",
        "human",
        "mind",
        "body",
        "united",
        "interact",
        "human",
        "soul",
        "brute",
        "living",
        "thing",
        "mere",
        "machine",
        "natural",
        "philosophy",
        "le",
        "grand",
        "defended",
        "cartesian",
        "physic",
        "material",
        "thing",
        "operate",
        "plenum",
        "move",
        "mean",
        "vortical",
        "motion",
        "according",
        "law",
        "motion",
        "le",
        "grand",
        "make",
        "substantial",
        "revision",
        "cartesian",
        "metaphysics",
        "physic",
        "however",
        "make",
        "two",
        "important",
        "contribution",
        "first",
        "provided",
        "clarification",
        "elaboration",
        "descartes",
        "account",
        "motion",
        "direct",
        "consequence",
        "cartesian",
        "account",
        "matter",
        "causation",
        "mindbody",
        "interaction",
        "secondly",
        "extended",
        "application",
        "cartesian",
        "physic",
        "treating",
        "detail",
        "subject",
        "metal",
        "plant",
        "insect",
        "animal",
        "human",
        "body",
        "contribution",
        "represented",
        "important",
        "development",
        "cartesian",
        "science",
        "prevailing",
        "scholasticaristotelian",
        "science",
        "le",
        "grand",
        "contribution",
        "cartesian",
        "account",
        "motion",
        "may",
        "either",
        "seen",
        "extension",
        "revision",
        "descartes",
        "somewhat",
        "ambiguous",
        "treatment",
        "le",
        "grand",
        "took",
        "seriously",
        "claim",
        "god",
        "total",
        "efficient",
        "cause",
        "motion",
        "universe",
        "matter",
        "entirely",
        "passive",
        "hence",
        "body",
        "incapable",
        "selfmovement",
        "moving",
        "body",
        "entire",
        "body",
        "philosophy",
        "argued",
        "since",
        "body",
        "may",
        "motion",
        "rest",
        "yet",
        "still",
        "remain",
        "body",
        "motion",
        "must",
        "mode",
        "nonessential",
        "matter",
        "moreover",
        "given",
        "matter",
        "inert",
        "source",
        "order",
        "direction",
        "moving",
        "body",
        "accordingly",
        "god",
        "infused",
        "motion",
        "universe",
        "laid",
        "law",
        "motion",
        "govern",
        "thus",
        "motion",
        "well",
        "orderly",
        "movement",
        "body",
        "derive",
        "god",
        "act",
        "effective",
        "principle",
        "specific",
        "position",
        "constitution",
        "configuration",
        "part",
        "particular",
        "body",
        "determine",
        "certain",
        "local",
        "motion",
        "communicated",
        "source",
        "ultimate",
        "direction",
        "motion",
        "god",
        "mean",
        "bodybody",
        "interaction",
        "body",
        "function",
        "secondary",
        "cause",
        "directing",
        "local",
        "motion",
        "virtue",
        "specific",
        "configuration",
        "part",
        "book",
        "part",
        "iv",
        "p",
        "kenneth",
        "clatterbaugh",
        "argues",
        "le",
        "grand",
        "position",
        "bodybody",
        "causation",
        "amount",
        "occasionalism",
        "clatterbaugh",
        "identifies",
        "four",
        "position",
        "claim",
        "commit",
        "le",
        "grand",
        "occasionalist",
        "doctrine",
        "articulated",
        "malebranche",
        "accident",
        "motion",
        "identical",
        "god",
        "conservation",
        "creation",
        "god",
        "creates",
        "body",
        "motion",
        "continuously",
        "divine",
        "intellect",
        "one",
        "clatterbaugh",
        "however",
        "le",
        "grand",
        "reference",
        "universal",
        "secondary",
        "cause",
        "commitment",
        "created",
        "nature",
        "law",
        "eternal",
        "truth",
        "make",
        "occasionalist",
        "ascription",
        "complicated",
        "one",
        "see",
        "discussion",
        "creation",
        "doctrine",
        "section",
        "le",
        "grand",
        "account",
        "bodybody",
        "interaction",
        "clear",
        "way",
        "explain",
        "mindbody",
        "interaction",
        "union",
        "way",
        "finite",
        "body",
        "god",
        "function",
        "effective",
        "principle",
        "finite",
        "mind",
        "providing",
        "ultimate",
        "source",
        "change",
        "nothing",
        "besides",
        "motion",
        "strike",
        "organ",
        "sens",
        "affect",
        "mind",
        "itself",
        "book",
        "part",
        "viii",
        "p",
        "although",
        "mind",
        "matter",
        "substance",
        "sharing",
        "common",
        "property",
        "virtue",
        "god",
        "acting",
        "effective",
        "principle",
        "mind",
        "body",
        "capable",
        "interaction",
        "kind",
        "interaction",
        "le",
        "problematic",
        "interaction",
        "two",
        "physical",
        "body",
        "according",
        "le",
        "grand",
        "causal",
        "interaction",
        "body",
        "mind",
        "body",
        "fact",
        "dependent",
        "upon",
        "god",
        "known",
        "experience",
        "real",
        "question",
        "whether",
        "interaction",
        "rather",
        "particular",
        "interaction",
        "fact",
        "occur",
        "union",
        "soul",
        "body",
        "consists",
        "actual",
        "dependency",
        "cogitation",
        "soul",
        "upon",
        "certain",
        "motion",
        "body",
        "certain",
        "motion",
        "body",
        "upon",
        "cogitation",
        "soul",
        "book",
        "part",
        "xi",
        "p",
        "mode",
        "union",
        "mind",
        "body",
        "mode",
        "belong",
        "substance",
        "required",
        "actual",
        "mutual",
        "commerce",
        "action",
        "passions",
        "ibid",
        "p",
        "interaction",
        "le",
        "grand",
        "described",
        "mindbody",
        "union",
        "term",
        "directly",
        "borrowed",
        "descartes",
        "however",
        "le",
        "grand",
        "explicated",
        "detailed",
        "term",
        "descartes",
        "nature",
        "mindbody",
        "union",
        "according",
        "le",
        "grand",
        "three",
        "kind",
        "union",
        "possessing",
        "principle",
        "brings",
        "union",
        "first",
        "two",
        "mind",
        "whose",
        "principle",
        "union",
        "love",
        "second",
        "two",
        "physical",
        "body",
        "whose",
        "principle",
        "union",
        "local",
        "presence",
        "third",
        "mind",
        "body",
        "whose",
        "principle",
        "union",
        "actual",
        "mutual",
        "dependence",
        "two",
        "physical",
        "body",
        "joined",
        "physical",
        "contact",
        "two",
        "mind",
        "joined",
        "love",
        "mind",
        "body",
        "joined",
        "mutually",
        "dependent",
        "activity",
        "long",
        "body",
        "actually",
        "receives",
        "specific",
        "motion",
        "dependently",
        "soul",
        "soul",
        "actually",
        "receives",
        "local",
        "motion",
        "passion",
        "dependently",
        "body",
        "spirit",
        "body",
        "joined",
        "although",
        "mode",
        "common",
        "mind",
        "matter",
        "mutual",
        "action",
        "hence",
        "similitude",
        "relation",
        "similitude",
        "relation",
        "formerly",
        "affirmed",
        "consist",
        "action",
        "passion",
        "ibid",
        "p",
        "word",
        "body",
        "capable",
        "receiving",
        "transmitting",
        "local",
        "motion",
        "since",
        "motion",
        "mode",
        "matter",
        "mind",
        "capable",
        "varying",
        "passion",
        "since",
        "passion",
        "mode",
        "mind",
        "mutual",
        "commerce",
        "motion",
        "passion",
        "mind",
        "body",
        "said",
        "united",
        "mutual",
        "activity",
        "said",
        "occur",
        "mind",
        "body",
        "property",
        "follows",
        "union",
        "mind",
        "body",
        "proceed",
        "either",
        "alone",
        "truth",
        "since",
        "neither",
        "body",
        "think",
        "mind",
        "capable",
        "dimension",
        "mode",
        "common",
        "mind",
        "body",
        "except",
        "mutual",
        "acting",
        "upon",
        "alone",
        "property",
        "follow",
        "p",
        "natural",
        "philosophy",
        "le",
        "grand",
        "extended",
        "descartes",
        "physic",
        "include",
        "phenomenon",
        "would",
        "classified",
        "metallurgy",
        "entomology",
        "botany",
        "biology",
        "physiology",
        "medicine",
        "psychology",
        "psychiatry",
        "book",
        "ii",
        "entire",
        "body",
        "philosophy",
        "entitled",
        "history",
        "nature",
        "catalogue",
        "critically",
        "discus",
        "latest",
        "experiment",
        "time",
        "well",
        "theory",
        "ancient",
        "modern",
        "prominent",
        "discussion",
        "importance",
        "secondary",
        "cause",
        "nature",
        "exemplary",
        "secondary",
        "efficient",
        "cause",
        "need",
        "experiment",
        "tool",
        "confirmation",
        "also",
        "mean",
        "discovering",
        "true",
        "nature",
        "thing",
        "due",
        "application",
        "mechanism",
        "explain",
        "behavior",
        "material",
        "body",
        "also",
        "entire",
        "institution",
        "nature",
        "le",
        "grand",
        "believed",
        "god",
        "laid",
        "law",
        "nature",
        "principle",
        "acting",
        "primary",
        "efficient",
        "cause",
        "operation",
        "law",
        "principle",
        "manifested",
        "nature",
        "form",
        "secondary",
        "cause",
        "effect",
        "although",
        "law",
        "specific",
        "mechanism",
        "operation",
        "visible",
        "secondary",
        "cause",
        "effect",
        "cause",
        "effect",
        "known",
        "experience",
        "starting",
        "point",
        "science",
        "characterized",
        "reasoning",
        "effect",
        "observed",
        "nature",
        "cause",
        "first",
        "principle",
        "discerned",
        "reason",
        "book",
        "iii",
        "entire",
        "body",
        "philosophy",
        "entitled",
        "dissertation",
        "want",
        "sense",
        "knowledge",
        "brute",
        "animal",
        "extends",
        "descartes",
        "treatment",
        "mechanization",
        "sensitive",
        "soul",
        "explain",
        "sensory",
        "motor",
        "appetitive",
        "function",
        "addition",
        "defending",
        "descartes",
        "controversial",
        "thesis",
        "life",
        "function",
        "reducible",
        "material",
        "motion",
        "animal",
        "mere",
        "machine",
        "provides",
        "account",
        "cartesian",
        "organic",
        "body",
        "identity",
        "time",
        "adriaenssen",
        "hatfield",
        "show",
        "le",
        "grand",
        "compendium",
        "nature",
        "demonstrates",
        "magnitude",
        "cartesian",
        "project",
        "mechanize",
        "life",
        "soul",
        "detailed",
        "observation",
        "rich",
        "description",
        "lay",
        "groundwork",
        "cartesian",
        "physiology",
        "psychology",
        "hatfield"
    ]
}