{
    "main_text": "Natural Law Theory\n2. Natural Law Theory\n\nSo far we have seen that, for Leibniz, the human good consists in the\nlasting state of pleasure that accompanies moral perfection. \nMoral perfection, in turn, is cultivated through the perpetual pursuit\nand acquisition of knowledge of the perfection of others, the\nuniverse, and God. Although all knowledge contributes to moral\nperfection and is therefore practical in a broad sense of the term,\nethics nevertheless is a distinct branch of science, capable of the\nsame level of demonstrative rigor as arithmetic and geometry (NE,\nPreface, p. 50; PW, “Meditation on the Common Concept of\nJustice,” pp. 49–50). Leibniz shares this view of ethics\nwith other important seventeenth-century thinkers, such as Hobbes\n(1588–1679), Spinoza (1632–1677), and Locke\n(1632–1704). And although Leibniz never wrote a comprehensive\nethical treatise in the geometrical style, it is clear from what he\nleft us that, in addition to a naturalistic-metaphysical theory of the\ngood, ethical science also includes a science of natural law. \n\nAs a natural law theorist, Leibniz holds that compliance with the set\nof universal ethical principles that make up the natural law is\nnecessary and sufficient to achieve the good. Also, like the eminent\nmodern natural lawyer Hugo Grotius (1583–1645), whom Leibniz\ngreatly admired—referring to him as the “incomparable\nGrotius” (PW, “Opinion on the Principles of\nPufendorf,” p. 65; T §6, p. 77), he believes that the\nnatural law and the obligation to comply with it are independent of\nGod's will. It is not possible, in other words, for God to have\nlegislated a different set of moral absolutes than those that obtain;\nnor do the moral absolutes derive their obligatory authority from\nhaving been legislated by God. According to Leibniz,\n\nNeither the norm of conduct itself, nor the essence of the just,\ndepends on his [God's] free decision, but rather on eternal truths,\nobjects of the divine intellect, which constitute, so to speak, the\nessence of divinity itself. . . . And, indeed, justice follows certain\nrules of equality and of proportion [which are] no less founded in the\nimmutable nature of things, and in the divine ideas, than are the\nprinciples of arithmetic and of geometry (PW, “Opinion on the\nPrinciples of Pufendorf,” p. 71).\n\n\nThe concept of justice in Leibniz's view is fixed independent of God's\nchoice, and so God has no more power to alter the nature of justice\nthan He does to alter the nature of circularity.\n\nThe idea that justice and moral obligation do not depend on a free\ndecree of God is a significant doctrine in Leibniz's philosophy. In\nthe seventeenth and eighteenth centuries, a focal point of debate in\nmoral philosophy centered on a version of the Euthyphro\nproblem—between those who sided with Grotius and Leibniz in\nholding that moral goodness and obligation do not depend on God's will\nand those who held the opposite view, that moral goodness and\nobligation are as they are as a result of God's free choice. Two of\nthe most important seventeenth-century proponents of the latter,\nvoluntarist position are Thomas Hobbes and Samuel Pufendorf\n(1632–1694). Leibniz's objections to voluntarism became widely\nknown in the early eighteenth century when a letter he wrote attacking\nvoluntarism was appended to a new edition of Pufendorf's The Duty\nof Man and Citizen (1718). This anti-voluntarist tract,\n“Opinion on the Principles of Pufendorf” (written in\n1706), contains one of his fullest discussions of justice. A full\ntreatment of Leibniz's anti-voluntarism would take us too far afield,\nbut a central criticism is that, in regarding moral goodness and\nobligation as dependent on God's free choice, voluntarism undermines\nthe basis for our love of God (PW, “Opinion on the Principles of\nPufendorf,” p. 71–2). If, as the voluntarist holds, moral\ngoodness is an artifact of God, it is not an essential attribute of\nthe divine nature. God therefore cannot be loved for His\ngoodness.  Voluntarism thus subverts morality and religion\nbecause love of God is essential to both (for more in depth\ndiscussions of Leibniz's anti-voluntarism, see Schneewind 1998\n(250–259) and Haakonssen 1996 (46–9)).\n\nFollowing a current in the natural law tradition, Leibniz supplements\nhis account of justice as the charity of the wise with three\nprinciples handed down from Roman law via Justinian's\nInstitutes (533 AD). The three principles are “to hurt\nno one” (neminem laedere), “to give each his\ndue” (suum cuique tribuere), and “to live\nhonorably” (honeste vivere) or, as Leibniz glosses it,\nto live piously. Leibniz suggests that these principles underwrite\nthree distinct degrees of justice (PW, “Codex Iuris\nGentium,” pp. 171–2). The lowest degree is “strict\nright” (ius strictum), which has as its precept that\n“no one is to be injured, so that he will not be given a motive\nfor a legal action within the state, nor outside the state a right of\nwar” (PW, “Codex Iuris Gentium,” p. 172). Strict\nright primarily includes a bare minimum set of negative duties, such\nas the duties not to harm, not to murder, and not to commit theft. The\nfunction of this degree of justice is the “conservation of\npeace.”  The second degree Leibniz calls\n“equity” or “charity” in the narrow sense of\nthe term, which has its basis in the principle “to give each his\ndue.”  This grade of justice includes, for example, duties\nof gratitude and of charitable donation, things we owe to others but\nwhich failure to fulfill is not sanctioned by law. Whereas strict\nright functions merely to avoid misery by fostering peace, the duties\nof equity actively promote the happiness of others as far as possible\nwithin this life.\n\nStrict right and equity, he explains, correspond to Grotius’\ndistinction between perfect and imperfect rights (PW, “Codex\nIuris Gentium,” p. 172). Unlike Grotius, however, Leibniz views\nthis distinction as one of degree rather than as one of kind. Also,\nequity, the second grade of justice, comprehends strict right within\nits scope, and strict right and equity are comprehended under the\nthird and highest grade of justice, namely, piety.\n\nThe principle of piety is “to live honorably.”  An\nimportant difference between strict right and equity, on the one hand,\nand piety, on the other, is that the former pertain to our pursuit of\ngoods and avoidance of evils over the course of our natural lives\nwhile the latter pertains to our pursuit of goods and avoidance of\nevils throughout our entire lives, that is, over the whole course of\nour immortal existence. The third grade of justice thus relies on two\ncentral tenets of Leibniz's metaphysics, for which he believes there\nare demonstrative proofs; indeed, he believes he provides such proofs\n(PE, “Principles of Nature and Grace, Based on Reason,”\n§4, §8; PE, “Monadology,” §4, §38).\nThe tenets on which this account relies are (1) that the soul is\nimmortal and (2) that God is the ruler of the universe. Most relevant\nto our purpose are not the arguments he supplies in support of these\nbut, rather, the work that the theses do in his account of piety.\n\nA person is pious in Leibniz's sense of the term in virtue of being\nperfectly just, which means that the pious person loves others in\nconformity with wisdom. But it is extremely difficult to fully realize\nthis ideal love so long as one's outlook is restricted to the goods\nand evils that may be encountered in one's natural life. If one's\noutlook is limited to this life, one may come to fulfill the first and\nsecond grades of justice without too much difficulty, but rarely does\nanyone achieve the highest level of justice without consideration of\nthe soul's immortality and God's governance (PW, “Codex Iuris\nGentium,” p. 173; PW, “Meditation on the Common Concept of\nJustice,” p. 58). This is because, even though the virtuous\nperson's “interior harmony” is intrinsically pleasing,\nmost are unable to appreciate virtue due to the fact that, from the\nperspective of mortality, virtuous actions often go unrewarded while\nvicious ones go unpunished. Thus most people will not bear tremendous\nhardships for the sake of virtue. Only the most exceptional\nindividuals are willing to be virtuous and do the right thing at any\nmortal cost. And this very willingness, this “spiritual\ndisposition” as Leibniz calls it, constitutes piety (PW,\n“Meditation on the Common Concept of Justice,” p. 58).\n\nIn the opening chapter of his dialogue between himself, represented by\nTheophilus, and a spokesperson for Locke, named\nPhilalethes, Leibniz makes the following autobiographical\nremark:\n\nYou [Philalethes] had more to do with the speculative philosophers,\nwhile I was more inclined towards moral questions. But I have been\nlearning, more and more, how greatly morality can be strengthened by\nthe solid principles of true philosophy; which is why I have\nlately been studying them more intensively, and have started on some\nquite new trains of thought (NE, p. 71, emphasis added).\n\n\nWe are now in a position to see how specifically the solid principles\nof philosophy strengthen morality. True philosophy (i.e., sound\nmetaphysics) aids morality by providing grounds for assurance that in\nthe end happiness is directly proportioned to merit. The more virtuous\none is, the greater the happiness one can expect because one's\nwell-being does not completely depend on the goods of this life and\nbecause it is incompatible with God's universal benevolence and\ninfinite wisdom that even a single virtuous deed should go unrewarded\nand a vicious one unpunished. “After this,” Leibniz\nconcludes, “it must be imprudent not to be just, because no one\nwill fail to derive good or evil from what he will have done,\naccording as it is just or unjust” (PW, “Meditation on the\nCommon Concept of Justice,” pp. 58–9). Even though\nexceptional individuals may be able to remain virtuous at any apparent\nmortal cost, it follows from Leibniz's metaphysics that there is in\nfact no mortal price to pay for being virtuous. On the contrary,\nvirtue is necessary and sufficient for true happiness (for further\nreading on Leibniz's natural law theory, see Brown 1995 and\n2011a).\n",
    "section_title": "2. Natural Law Theory",
    "entry_title": "Leibniz’s Ethics",
    "hierarchy_title": "Leibniz’s Ethics || Natural Law Theory",
    "tokenized_text": [
        "natural",
        "law",
        "theory",
        "natural",
        "law",
        "theory",
        "far",
        "seen",
        "leibniz",
        "human",
        "good",
        "consists",
        "lasting",
        "state",
        "pleasure",
        "accompanies",
        "moral",
        "perfection",
        "moral",
        "perfection",
        "turn",
        "cultivated",
        "perpetual",
        "pursuit",
        "acquisition",
        "knowledge",
        "perfection",
        "others",
        "universe",
        "god",
        "although",
        "knowledge",
        "contributes",
        "moral",
        "perfection",
        "therefore",
        "practical",
        "broad",
        "sense",
        "term",
        "ethic",
        "nevertheless",
        "distinct",
        "branch",
        "science",
        "capable",
        "level",
        "demonstrative",
        "rigor",
        "arithmetic",
        "geometry",
        "ne",
        "preface",
        "p",
        "pw",
        "meditation",
        "common",
        "concept",
        "justice",
        "pp",
        "leibniz",
        "share",
        "view",
        "ethic",
        "important",
        "seventeenthcentury",
        "thinker",
        "hobbes",
        "spinoza",
        "locke",
        "although",
        "leibniz",
        "never",
        "wrote",
        "comprehensive",
        "ethical",
        "treatise",
        "geometrical",
        "style",
        "clear",
        "left",
        "u",
        "addition",
        "naturalisticmetaphysical",
        "theory",
        "good",
        "ethical",
        "science",
        "also",
        "includes",
        "science",
        "natural",
        "law",
        "natural",
        "law",
        "theorist",
        "leibniz",
        "hold",
        "compliance",
        "set",
        "universal",
        "ethical",
        "principle",
        "make",
        "natural",
        "law",
        "necessary",
        "sufficient",
        "achieve",
        "good",
        "also",
        "like",
        "eminent",
        "modern",
        "natural",
        "lawyer",
        "hugo",
        "grotius",
        "leibniz",
        "greatly",
        "admiredreferring",
        "incomparable",
        "grotius",
        "pw",
        "opinion",
        "principle",
        "pufendorf",
        "p",
        "p",
        "belief",
        "natural",
        "law",
        "obligation",
        "comply",
        "independent",
        "god",
        "s",
        "possible",
        "word",
        "god",
        "legislated",
        "different",
        "set",
        "moral",
        "absolute",
        "obtain",
        "moral",
        "absolute",
        "derive",
        "obligatory",
        "authority",
        "legislated",
        "god",
        "according",
        "leibniz",
        "neither",
        "norm",
        "conduct",
        "essence",
        "depends",
        "god",
        "s",
        "free",
        "decision",
        "rather",
        "eternal",
        "truth",
        "object",
        "divine",
        "intellect",
        "constitute",
        "speak",
        "essence",
        "divinity",
        "indeed",
        "justice",
        "follows",
        "certain",
        "rule",
        "equality",
        "proportion",
        "le",
        "founded",
        "immutable",
        "nature",
        "thing",
        "divine",
        "idea",
        "principle",
        "arithmetic",
        "geometry",
        "pw",
        "opinion",
        "principle",
        "pufendorf",
        "p",
        "concept",
        "justice",
        "leibniz",
        "s",
        "view",
        "fixed",
        "independent",
        "god",
        "s",
        "choice",
        "god",
        "power",
        "alter",
        "nature",
        "justice",
        "alter",
        "nature",
        "circularity",
        "idea",
        "justice",
        "moral",
        "obligation",
        "depend",
        "free",
        "decree",
        "god",
        "significant",
        "doctrine",
        "leibniz",
        "s",
        "philosophy",
        "seventeenth",
        "eighteenth",
        "century",
        "focal",
        "point",
        "debate",
        "moral",
        "philosophy",
        "centered",
        "version",
        "euthyphro",
        "problembetween",
        "sided",
        "grotius",
        "leibniz",
        "holding",
        "moral",
        "goodness",
        "obligation",
        "depend",
        "god",
        "s",
        "held",
        "opposite",
        "view",
        "moral",
        "goodness",
        "obligation",
        "result",
        "god",
        "s",
        "free",
        "choice",
        "two",
        "important",
        "seventeenthcentury",
        "proponent",
        "latter",
        "voluntarist",
        "position",
        "thomas",
        "hobbes",
        "samuel",
        "pufendorf",
        "leibniz",
        "s",
        "objection",
        "voluntarism",
        "became",
        "widely",
        "known",
        "early",
        "eighteenth",
        "century",
        "letter",
        "wrote",
        "attacking",
        "voluntarism",
        "appended",
        "new",
        "edition",
        "pufendorf",
        "s",
        "duty",
        "man",
        "citizen",
        "antivoluntarist",
        "tract",
        "opinion",
        "principle",
        "pufendorf",
        "written",
        "contains",
        "one",
        "fullest",
        "discussion",
        "justice",
        "full",
        "treatment",
        "leibniz",
        "s",
        "antivoluntarism",
        "would",
        "take",
        "u",
        "far",
        "afield",
        "central",
        "criticism",
        "regarding",
        "moral",
        "goodness",
        "obligation",
        "dependent",
        "god",
        "s",
        "free",
        "choice",
        "voluntarism",
        "undermines",
        "basis",
        "love",
        "god",
        "pw",
        "opinion",
        "principle",
        "pufendorf",
        "p",
        "voluntarist",
        "hold",
        "moral",
        "goodness",
        "artifact",
        "god",
        "essential",
        "attribute",
        "divine",
        "nature",
        "god",
        "therefore",
        "loved",
        "goodness",
        "voluntarism",
        "thus",
        "subverts",
        "morality",
        "religion",
        "love",
        "god",
        "essential",
        "depth",
        "discussion",
        "leibniz",
        "s",
        "antivoluntarism",
        "see",
        "schneewind",
        "haakonssen",
        "following",
        "current",
        "natural",
        "law",
        "tradition",
        "leibniz",
        "supplement",
        "account",
        "justice",
        "charity",
        "wise",
        "three",
        "principle",
        "handed",
        "roman",
        "law",
        "via",
        "justinian",
        "s",
        "institute",
        "ad",
        "three",
        "principle",
        "hurt",
        "one",
        "neminem",
        "laedere",
        "give",
        "due",
        "suum",
        "cuique",
        "tribuere",
        "live",
        "honorably",
        "honeste",
        "vivere",
        "leibniz",
        "gloss",
        "live",
        "piously",
        "leibniz",
        "suggests",
        "principle",
        "underwrite",
        "three",
        "distinct",
        "degree",
        "justice",
        "pw",
        "codex",
        "iuris",
        "gentium",
        "pp",
        "lowest",
        "degree",
        "strict",
        "right",
        "ius",
        "strictum",
        "precept",
        "one",
        "injured",
        "given",
        "motive",
        "legal",
        "action",
        "within",
        "state",
        "outside",
        "state",
        "right",
        "war",
        "pw",
        "codex",
        "iuris",
        "gentium",
        "p",
        "strict",
        "right",
        "primarily",
        "includes",
        "bare",
        "minimum",
        "set",
        "negative",
        "duty",
        "duty",
        "harm",
        "murder",
        "commit",
        "theft",
        "function",
        "degree",
        "justice",
        "conservation",
        "peace",
        "second",
        "degree",
        "leibniz",
        "call",
        "equity",
        "charity",
        "narrow",
        "sense",
        "term",
        "basis",
        "principle",
        "give",
        "due",
        "grade",
        "justice",
        "includes",
        "example",
        "duty",
        "gratitude",
        "charitable",
        "donation",
        "thing",
        "owe",
        "others",
        "failure",
        "fulfill",
        "sanctioned",
        "law",
        "whereas",
        "strict",
        "right",
        "function",
        "merely",
        "avoid",
        "misery",
        "fostering",
        "peace",
        "duty",
        "equity",
        "actively",
        "promote",
        "happiness",
        "others",
        "far",
        "possible",
        "within",
        "life",
        "strict",
        "right",
        "equity",
        "explains",
        "correspond",
        "grotius",
        "distinction",
        "perfect",
        "imperfect",
        "right",
        "pw",
        "codex",
        "iuris",
        "gentium",
        "p",
        "unlike",
        "grotius",
        "however",
        "leibniz",
        "view",
        "distinction",
        "one",
        "degree",
        "rather",
        "one",
        "kind",
        "also",
        "equity",
        "second",
        "grade",
        "justice",
        "comprehends",
        "strict",
        "right",
        "within",
        "scope",
        "strict",
        "right",
        "equity",
        "comprehended",
        "third",
        "highest",
        "grade",
        "justice",
        "namely",
        "piety",
        "principle",
        "piety",
        "live",
        "honorably",
        "important",
        "difference",
        "strict",
        "right",
        "equity",
        "one",
        "hand",
        "piety",
        "former",
        "pertain",
        "pursuit",
        "good",
        "avoidance",
        "evil",
        "course",
        "natural",
        "life",
        "latter",
        "pertains",
        "pursuit",
        "good",
        "avoidance",
        "evil",
        "throughout",
        "entire",
        "life",
        "whole",
        "course",
        "immortal",
        "existence",
        "third",
        "grade",
        "justice",
        "thus",
        "relies",
        "two",
        "central",
        "tenet",
        "leibniz",
        "s",
        "metaphysics",
        "belief",
        "demonstrative",
        "proof",
        "indeed",
        "belief",
        "provides",
        "proof",
        "pe",
        "principle",
        "nature",
        "grace",
        "based",
        "reason",
        "pe",
        "monadology",
        "tenet",
        "account",
        "relies",
        "soul",
        "immortal",
        "god",
        "ruler",
        "universe",
        "relevant",
        "purpose",
        "argument",
        "supply",
        "support",
        "rather",
        "work",
        "thesis",
        "account",
        "piety",
        "person",
        "pious",
        "leibniz",
        "s",
        "sense",
        "term",
        "virtue",
        "perfectly",
        "mean",
        "pious",
        "person",
        "love",
        "others",
        "conformity",
        "wisdom",
        "extremely",
        "difficult",
        "fully",
        "realize",
        "ideal",
        "love",
        "long",
        "one",
        "s",
        "outlook",
        "restricted",
        "good",
        "evil",
        "may",
        "encountered",
        "one",
        "s",
        "natural",
        "life",
        "one",
        "s",
        "outlook",
        "limited",
        "life",
        "one",
        "may",
        "come",
        "fulfill",
        "first",
        "second",
        "grade",
        "justice",
        "without",
        "much",
        "difficulty",
        "rarely",
        "anyone",
        "achieve",
        "highest",
        "level",
        "justice",
        "without",
        "consideration",
        "soul",
        "s",
        "immortality",
        "god",
        "s",
        "governance",
        "pw",
        "codex",
        "iuris",
        "gentium",
        "p",
        "pw",
        "meditation",
        "common",
        "concept",
        "justice",
        "p",
        "even",
        "though",
        "virtuous",
        "person",
        "s",
        "interior",
        "harmony",
        "intrinsically",
        "pleasing",
        "unable",
        "appreciate",
        "virtue",
        "due",
        "fact",
        "perspective",
        "mortality",
        "virtuous",
        "action",
        "often",
        "go",
        "unrewarded",
        "vicious",
        "one",
        "go",
        "unpunished",
        "thus",
        "people",
        "bear",
        "tremendous",
        "hardship",
        "sake",
        "virtue",
        "exceptional",
        "individual",
        "willing",
        "virtuous",
        "right",
        "thing",
        "mortal",
        "cost",
        "willingness",
        "spiritual",
        "disposition",
        "leibniz",
        "call",
        "constitutes",
        "piety",
        "pw",
        "meditation",
        "common",
        "concept",
        "justice",
        "p",
        "opening",
        "chapter",
        "dialogue",
        "represented",
        "theophilus",
        "spokesperson",
        "locke",
        "named",
        "philalethes",
        "leibniz",
        "make",
        "following",
        "autobiographical",
        "remark",
        "philalethes",
        "speculative",
        "philosopher",
        "inclined",
        "towards",
        "moral",
        "question",
        "learning",
        "greatly",
        "morality",
        "strengthened",
        "solid",
        "principle",
        "true",
        "philosophy",
        "lately",
        "studying",
        "intensively",
        "started",
        "quite",
        "new",
        "train",
        "thought",
        "ne",
        "p",
        "emphasis",
        "added",
        "position",
        "see",
        "specifically",
        "solid",
        "principle",
        "philosophy",
        "strengthen",
        "morality",
        "true",
        "philosophy",
        "ie",
        "sound",
        "metaphysics",
        "aid",
        "morality",
        "providing",
        "ground",
        "assurance",
        "end",
        "happiness",
        "directly",
        "proportioned",
        "merit",
        "virtuous",
        "one",
        "greater",
        "happiness",
        "one",
        "expect",
        "one",
        "s",
        "wellbeing",
        "completely",
        "depend",
        "good",
        "life",
        "incompatible",
        "god",
        "s",
        "universal",
        "benevolence",
        "infinite",
        "wisdom",
        "even",
        "single",
        "virtuous",
        "deed",
        "go",
        "unrewarded",
        "vicious",
        "one",
        "unpunished",
        "leibniz",
        "concludes",
        "must",
        "imprudent",
        "one",
        "fail",
        "derive",
        "good",
        "evil",
        "done",
        "according",
        "unjust",
        "pw",
        "meditation",
        "common",
        "concept",
        "justice",
        "pp",
        "even",
        "though",
        "exceptional",
        "individual",
        "may",
        "able",
        "remain",
        "virtuous",
        "apparent",
        "mortal",
        "cost",
        "follows",
        "leibniz",
        "s",
        "metaphysics",
        "fact",
        "mortal",
        "price",
        "pay",
        "virtuous",
        "contrary",
        "virtue",
        "necessary",
        "sufficient",
        "true",
        "happiness",
        "reading",
        "leibniz",
        "s",
        "natural",
        "law",
        "theory",
        "see",
        "brown",
        "a"
    ]
}