{
    "main_text": "Natural Law Theory\n3. Moral Psychology\n\nLeibniz believes that enlightened self-interest is in complete\nagreement with the requirements of virtue. The cornerstone of this\nharmony between interest and morality is metaphysics, his doctrines\nconcerning the soul's immortality and God's governance. Still, the\nvirtuous person does not regard right action and the well-being of\nothers as a means to his or her own happiness. According to Leibniz,\n\n\nThus he who acts well, not out of hope or fear, but by an inclination\nof his soul, is so far from not behaving justly that, on the contrary,\nhe acts more justly than all others, imitating, in a certain way, as a\nman, divine justice. Whoever, indeed, does good out of love for God or\nof his neighbor, takes pleasure precisely in the action itself (such\nbeing the nature of love) and does not need any other incitement, or\nthe command of a superior; for that man the saying that the law is not\nmade for the just is valid (PW, “Opinion on the Principles of\nPufendorf,” p. 72).\n\n\nNot self-love but love of others motivates the virtuous person, or\nwhat Leibniz calls “disinterested love” (PW, “Codex\nIuris Gentium,” p. 171). Metaphysics thus strengthens morality\nwithout overhauling it. In revealing that virtue alone ultimately\nsatisfies self-interest, true philosophy guides us steadfastly along\nthe path to virtue. Yet the truly virtuous person performs a morally\nright action for its own sake.\n\nDisinterested love is not completely selfless however. Nor can it\nconsistently be on Leibniz's view since he subscribes to a version of\npsychological egoism; “for we do all for our own good,” he\nmaintains, “and it is impossible for us to have other feelings\nwhatever we may say” (W, “Letter to Nicaise,” p.\n565). In his account of disinterested love, Leibniz in fact seeks to\nreconcile egoism and altruism, and, in doing so, anticipates Bishop\nButler's (1692–1752) landmark attack against psychological\negoism (BM1, Fifteen Sermons (1726), pp. 364–373).\n\nThe key to Leibniz's reconciliation is a distinction between the\npleasure involved in the satisfaction of a desire and the object of a\ndesire. Desires spur all human actions. Some desires emerge distinctly\nin conscious awareness while many do not, or do so only confusedly.\nThe former he calls volitions and the latter\nappetitions (NE, p. 173). Satisfaction of any desire gives\nits subject at least a minimal degree of pleasure, however fleeting.\nAn unfulfilled volition causes at a minimum enough suffering for one\nto be aware of it, but an unfulfilled appetition, by contrast, gives\nrise to “semi-suffering,” or what he calls, following\nLocke, “uneasiness” (NE, p. 188–9). Such\nsemi-suffering, Leibniz explains, “does not amount to\ndiscomfort, but is restricted to the elements or rudiments of\nsuffering, which we cannot be aware of in themselves but which suffice\nto act as spurs and to stimulate the will” (NE, p. 189). No\nfinite being is ever totally free of semi-sufferings and, to a lesser\ndegree, semi-pleasures. Even where we appear to ourselves to be\ncompletely indifferent about our options, unconscious desires move us\ntoward one course of action rather than another (NE, p. 188).\n\nEvery desire inclines one to joy, its immediate satisfaction and the\ntransitory pleasure arising therefrom. Moreover, Leibniz takes it as\naxiomatic that no one pursues anything but what appears to him or her\nto be the greatest good (NE, p. 185; T §45, p. 148). Failure to\nbe virtuous and achieve happiness is therefore a consequence of\nignorance, error, or inattention to what one knows. Inattention\nresults from a lapse in the ability to call to mind the knowledge one\npossesses, and this, according to Leibniz, accounts for the puzzling\npsychological phenomenon known as weakness of will  (NE, pp.\n186–187). Weakness of will, it turns out, is a type of\nforgetfulness. As such, an individual has some control over it, albeit\nindirectly. Upbringing and education certainly affect an individual's\nability to bring specific thoughts to mind, but steps may be taken to\nensure that certain considerations rather than others occur to one in\npractical deliberation (NE, p. 187 & pp. 195–196). For\nexample, Leibniz counsels,\n\nThus when a man is in a good frame of mind he ought to make himself\nlaws and rules for the future, and then carry them out strictly,\ndrawing himself away–abruptly or gradually, depending on the\nnature of the case–from situations which are capable of\ncorrupting him. A lover will be cured by a voyage undertaken just for\nthat purpose; a period of seclusion will stop us from keeping company\nwith people who confirm some bad disposition in us. (NE, p. 187)\n\n\nAdvance preparation is the key to strength of will. An individual\nneeds to equip him- or herself with principles and appropriate habits\nof thought in order to make correct choices in pressure situations.\nOtherwise, he or she is merely an instrument of conscious and\nunconscious inclinations (for a discussion of Leibniz's view of\npractical rationality see Roinila 2008).\n\nRecall that true happiness is a lasting state of pleasure. The most\ndirect route to happiness, as commonsense testifies, is not through\nthe gratification of every desire that happens to occur to one.\nVolitions and appetitions must be moderated by experience and reason\n(NE, p. 189). Experience and reason teach us to neglect or postpone\nfulfillment of some desires so that others may be fulfilled instead,\nthe most valuable among them being those that reason gives us (NE, p.\n194–5). Reason generates inclinations whose strength and objects\nare distinct, as opposed to bodily inclinations whose strength and\nobjects are confused. The confusion inherent in bodily inclinations\nmakes their fulfillment considerably more problematic than that of\nrational inclinations. The bodily desire for nourishment, for example,\nmay be satisfied by eating a piece of fruit, but, as Leibniz points\nout, “a fruit with a good taste and a good odor can conceal a\npoison” (PW, “Felicity,” §6a, p. 83).\nFulfillment of confused bodily inclinations may, and too often does,\nlead to pain and suffering further on. Such however is not the case\nwith rational inclinations. Distinct knowledge, which is a distinct\nperception of harmony, satisfies the distinct inclinations of reason.\nAnd since the universe is maximally harmonious, there is no end to the\npleasure we can derive from the acquisition of distinct knowledge.\n\nAll desires, no matter how confused or distinct, incline one toward\nthe pleasure one takes in their satisfaction. Leibniz then can be\nunderstood as subscribing to psychological egoism where by this is\nmeant that a person does all to satisfy one or more of his or her own\ninclinations. But it does not follow that all inclinations are\nalike—that, say, all of one's desires have one's own pleasure as\ntheir object. This is where the egoist goes wrong and where Leibniz\nfinds room for accommodating both egoism and altruism.  What all\nactions have in common is that they are spurred by an inclination of\nthe agent, the satisfaction of which gives him or her pleasure. But\nthe same type of object does not satisfy all inclinations alike. For\nLeibniz, some inclinations have confused sensible objects, such as the\nsweetness of fruit, the melody of a song, or the beauty of a painting.\nOthers have distinct intellectual objects, such as the perfection of\nGod, of the natural world, or of another human being. A sweet piece of\nfruit cannot satisfy a desire for perfection in the natural world any\nmore than a distinct perception of harmony in the natural world can\nsatisfy a bodily desire for nourishment. Different inclinations\nconcern different objects.\n\nTo be inclined toward the perfection of another rational being is to\nbe disposed to take pleasure in their perfection. Notice however that\nthe object of the inclination, that which one's view is fixed on, is\nnot one's own pleasure. This does not mean that an individual's own\npleasure cannot be the object of one of his or her desires. For most,\nself-love may be their predominant motive. Nevertheless, an individual\ncan have an other-directed desire for the perfection of another\nrational being, which is to have disinterested love. To love\ndisinterestedly, Leibniz explains, is to be “disposed to take\npleasure in the perfection, well-being or happiness of the object of\none's love. And this involves not thinking about or asking for any\npleasure of one's own except what one can get from the happiness or\npleasure of the loved one” (NE, p. 163). Since happiness is the\noutward manifestation of perfection, it makes no real difference\nwhether love is said to have the perfection or the happiness of\nanother rational being as its object. Leibniz thus makes the\ninsightful suggestion that, though we do everything we do out of an\ninclination whose satisfaction gives us pleasure, this is perfectly\ncompatible with desiring the perfection of another without any other\nend in view, which actually occurs whenever the object of our desire\nis another's perfection or happiness. “In truth,” Leibniz\nconcludes, “the happiness of those whose happiness pleases us\nturns into our own happiness, since things which please us are desired\nfor their own sake” (PW, “Codex Iuris Gentium,” p.\n171) (for further reading on Leibniz's conception of disinterested\nlove, see Brown 2011b).\n\nGenuine altruism, then, does not require complete selflessness.\nIndeed, selflessness, even if it were possible, would not be desirable\n(W, “Letter to Nicaise,” p. 566). After all, according to\nLeibniz,\n\nOne cannot envisage in God any other motive than that of perfection,\nor, if you like, of his pleasure; supposing (according to my\ndefinition) that pleasure is nothing but a feeling of perfection, he\nhas nothing to consider outside himself; on the contrary everything\ndepends on him. But his goodness would not be supreme, if he did not\naim at the good and at perfection so far as is possible. But what will\none say, if I show that this same motive has a place in truly virtuous\nand generous men, whose supreme function [degré] is to\nimitate divinity, in so far as human nature is capable of it? (PW,\n“Meditation on the Common Concept of Justice,” pp.\n57–8).\n\n\nImitate divinity—this is the overarching imperative of Leibniz's\nethics, if not the guiding principle of his entire philosophical\nsystem. For him, God, not humanity, is the “measure of all\nthings” (PW, “Opinion on the Principles of\nPufendorf,” p. 69). Our chief task therefore is to make\nperpetual progress toward the ideal of divine nature, for each of us\nis like a little divinity in the City of God (PE,\n“Monadology,” §83 & §85, pp. 223–4; T\n§147, pp. 215–216).\n",
    "section_title": "3. Moral Psychology",
    "entry_title": "Leibniz’s Ethics",
    "hierarchy_title": "Leibniz’s Ethics || Natural Law Theory",
    "tokenized_text": [
        "natural",
        "law",
        "theory",
        "moral",
        "psychology",
        "leibniz",
        "belief",
        "enlightened",
        "selfinterest",
        "complete",
        "agreement",
        "requirement",
        "virtue",
        "cornerstone",
        "harmony",
        "interest",
        "morality",
        "metaphysics",
        "doctrine",
        "concerning",
        "soul",
        "s",
        "immortality",
        "god",
        "s",
        "governance",
        "still",
        "virtuous",
        "person",
        "regard",
        "right",
        "action",
        "wellbeing",
        "others",
        "mean",
        "happiness",
        "according",
        "leibniz",
        "thus",
        "act",
        "well",
        "hope",
        "fear",
        "inclination",
        "soul",
        "far",
        "behaving",
        "justly",
        "contrary",
        "act",
        "justly",
        "others",
        "imitating",
        "certain",
        "way",
        "man",
        "divine",
        "justice",
        "whoever",
        "indeed",
        "good",
        "love",
        "god",
        "neighbor",
        "take",
        "pleasure",
        "precisely",
        "action",
        "nature",
        "love",
        "need",
        "incitement",
        "command",
        "superior",
        "man",
        "saying",
        "law",
        "made",
        "valid",
        "pw",
        "opinion",
        "principle",
        "pufendorf",
        "p",
        "selflove",
        "love",
        "others",
        "motivates",
        "virtuous",
        "person",
        "leibniz",
        "call",
        "disinterested",
        "love",
        "pw",
        "codex",
        "iuris",
        "gentium",
        "p",
        "metaphysics",
        "thus",
        "strengthens",
        "morality",
        "without",
        "overhauling",
        "revealing",
        "virtue",
        "alone",
        "ultimately",
        "satisfies",
        "selfinterest",
        "true",
        "philosophy",
        "guide",
        "u",
        "steadfastly",
        "along",
        "path",
        "virtue",
        "yet",
        "truly",
        "virtuous",
        "person",
        "performs",
        "morally",
        "right",
        "action",
        "sake",
        "disinterested",
        "love",
        "completely",
        "selfless",
        "however",
        "consistently",
        "leibniz",
        "s",
        "view",
        "since",
        "subscribes",
        "version",
        "psychological",
        "egoism",
        "good",
        "maintains",
        "impossible",
        "u",
        "feeling",
        "whatever",
        "may",
        "say",
        "w",
        "letter",
        "nicaise",
        "p",
        "account",
        "disinterested",
        "love",
        "leibniz",
        "fact",
        "seek",
        "reconcile",
        "egoism",
        "altruism",
        "anticipates",
        "bishop",
        "butler",
        "s",
        "landmark",
        "attack",
        "psychological",
        "egoism",
        "bm",
        "fifteen",
        "sermon",
        "pp",
        "key",
        "leibniz",
        "s",
        "reconciliation",
        "distinction",
        "pleasure",
        "involved",
        "satisfaction",
        "desire",
        "object",
        "desire",
        "desire",
        "spur",
        "human",
        "action",
        "desire",
        "emerge",
        "distinctly",
        "conscious",
        "awareness",
        "many",
        "confusedly",
        "former",
        "call",
        "volition",
        "latter",
        "appetitions",
        "ne",
        "p",
        "satisfaction",
        "desire",
        "give",
        "subject",
        "least",
        "minimal",
        "degree",
        "pleasure",
        "however",
        "fleeting",
        "unfulfilled",
        "volition",
        "cause",
        "minimum",
        "enough",
        "suffering",
        "one",
        "aware",
        "unfulfilled",
        "appetition",
        "contrast",
        "give",
        "rise",
        "semisuffering",
        "call",
        "following",
        "locke",
        "uneasiness",
        "ne",
        "p",
        "semisuffering",
        "leibniz",
        "explains",
        "amount",
        "discomfort",
        "restricted",
        "element",
        "rudiment",
        "suffering",
        "aware",
        "suffice",
        "act",
        "spur",
        "stimulate",
        "ne",
        "p",
        "finite",
        "ever",
        "totally",
        "free",
        "semisufferings",
        "lesser",
        "degree",
        "semipleasures",
        "even",
        "appear",
        "completely",
        "indifferent",
        "option",
        "unconscious",
        "desire",
        "move",
        "u",
        "toward",
        "one",
        "course",
        "action",
        "rather",
        "another",
        "ne",
        "p",
        "every",
        "desire",
        "incline",
        "one",
        "joy",
        "immediate",
        "satisfaction",
        "transitory",
        "pleasure",
        "arising",
        "therefrom",
        "moreover",
        "leibniz",
        "take",
        "axiomatic",
        "one",
        "pursues",
        "anything",
        "appears",
        "greatest",
        "good",
        "ne",
        "p",
        "p",
        "failure",
        "virtuous",
        "achieve",
        "happiness",
        "therefore",
        "consequence",
        "ignorance",
        "error",
        "inattention",
        "one",
        "know",
        "inattention",
        "result",
        "lapse",
        "ability",
        "call",
        "mind",
        "knowledge",
        "one",
        "posse",
        "according",
        "leibniz",
        "account",
        "puzzling",
        "psychological",
        "phenomenon",
        "known",
        "weakness",
        "ne",
        "pp",
        "weakness",
        "turn",
        "type",
        "forgetfulness",
        "individual",
        "control",
        "albeit",
        "indirectly",
        "upbringing",
        "education",
        "certainly",
        "affect",
        "individual",
        "s",
        "ability",
        "bring",
        "specific",
        "thought",
        "mind",
        "step",
        "may",
        "taken",
        "ensure",
        "certain",
        "consideration",
        "rather",
        "others",
        "occur",
        "one",
        "practical",
        "deliberation",
        "ne",
        "p",
        "pp",
        "example",
        "leibniz",
        "counsel",
        "thus",
        "man",
        "good",
        "frame",
        "mind",
        "ought",
        "make",
        "law",
        "rule",
        "future",
        "carry",
        "strictly",
        "drawing",
        "awayabruptly",
        "gradually",
        "depending",
        "nature",
        "casefrom",
        "situation",
        "capable",
        "corrupting",
        "lover",
        "cured",
        "voyage",
        "undertaken",
        "purpose",
        "period",
        "seclusion",
        "stop",
        "u",
        "keeping",
        "company",
        "people",
        "confirm",
        "bad",
        "disposition",
        "u",
        "ne",
        "p",
        "advance",
        "preparation",
        "key",
        "strength",
        "individual",
        "need",
        "equip",
        "him",
        "principle",
        "appropriate",
        "habit",
        "thought",
        "order",
        "make",
        "correct",
        "choice",
        "pressure",
        "situation",
        "otherwise",
        "merely",
        "instrument",
        "conscious",
        "unconscious",
        "inclination",
        "discussion",
        "leibniz",
        "s",
        "view",
        "practical",
        "rationality",
        "see",
        "roinila",
        "recall",
        "true",
        "happiness",
        "lasting",
        "state",
        "pleasure",
        "direct",
        "route",
        "happiness",
        "commonsense",
        "testifies",
        "gratification",
        "every",
        "desire",
        "happens",
        "occur",
        "one",
        "volition",
        "appetitions",
        "must",
        "moderated",
        "experience",
        "reason",
        "ne",
        "p",
        "experience",
        "reason",
        "teach",
        "u",
        "neglect",
        "postpone",
        "fulfillment",
        "desire",
        "others",
        "may",
        "fulfilled",
        "instead",
        "valuable",
        "among",
        "reason",
        "give",
        "u",
        "ne",
        "p",
        "reason",
        "generates",
        "inclination",
        "whose",
        "strength",
        "object",
        "distinct",
        "opposed",
        "bodily",
        "inclination",
        "whose",
        "strength",
        "object",
        "confused",
        "confusion",
        "inherent",
        "bodily",
        "inclination",
        "make",
        "fulfillment",
        "considerably",
        "problematic",
        "rational",
        "inclination",
        "bodily",
        "desire",
        "nourishment",
        "example",
        "may",
        "satisfied",
        "eating",
        "piece",
        "fruit",
        "leibniz",
        "point",
        "fruit",
        "good",
        "taste",
        "good",
        "odor",
        "conceal",
        "poison",
        "pw",
        "felicity",
        "a",
        "p",
        "fulfillment",
        "confused",
        "bodily",
        "inclination",
        "may",
        "often",
        "lead",
        "pain",
        "suffering",
        "however",
        "case",
        "rational",
        "inclination",
        "distinct",
        "knowledge",
        "distinct",
        "perception",
        "harmony",
        "satisfies",
        "distinct",
        "inclination",
        "reason",
        "since",
        "universe",
        "maximally",
        "harmonious",
        "end",
        "pleasure",
        "derive",
        "acquisition",
        "distinct",
        "knowledge",
        "desire",
        "matter",
        "confused",
        "distinct",
        "incline",
        "one",
        "toward",
        "pleasure",
        "one",
        "take",
        "satisfaction",
        "leibniz",
        "understood",
        "subscribing",
        "psychological",
        "egoism",
        "meant",
        "person",
        "satisfy",
        "one",
        "inclination",
        "follow",
        "inclination",
        "alikethat",
        "say",
        "one",
        "s",
        "desire",
        "one",
        "s",
        "pleasure",
        "object",
        "egoist",
        "go",
        "wrong",
        "leibniz",
        "find",
        "room",
        "accommodating",
        "egoism",
        "altruism",
        "action",
        "common",
        "spurred",
        "inclination",
        "agent",
        "satisfaction",
        "give",
        "pleasure",
        "type",
        "object",
        "satisfy",
        "inclination",
        "alike",
        "leibniz",
        "inclination",
        "confused",
        "sensible",
        "object",
        "sweetness",
        "fruit",
        "melody",
        "song",
        "beauty",
        "painting",
        "others",
        "distinct",
        "intellectual",
        "object",
        "perfection",
        "god",
        "natural",
        "world",
        "another",
        "human",
        "sweet",
        "piece",
        "fruit",
        "satisfy",
        "desire",
        "perfection",
        "natural",
        "world",
        "distinct",
        "perception",
        "harmony",
        "natural",
        "world",
        "satisfy",
        "bodily",
        "desire",
        "nourishment",
        "different",
        "inclination",
        "concern",
        "different",
        "object",
        "inclined",
        "toward",
        "perfection",
        "another",
        "rational",
        "disposed",
        "take",
        "pleasure",
        "perfection",
        "notice",
        "however",
        "object",
        "inclination",
        "one",
        "s",
        "view",
        "fixed",
        "one",
        "s",
        "pleasure",
        "mean",
        "individual",
        "s",
        "pleasure",
        "object",
        "one",
        "desire",
        "selflove",
        "may",
        "predominant",
        "motive",
        "nevertheless",
        "individual",
        "otherdirected",
        "desire",
        "perfection",
        "another",
        "rational",
        "disinterested",
        "love",
        "love",
        "disinterestedly",
        "leibniz",
        "explains",
        "disposed",
        "take",
        "pleasure",
        "perfection",
        "wellbeing",
        "happiness",
        "object",
        "one",
        "s",
        "love",
        "involves",
        "thinking",
        "asking",
        "pleasure",
        "one",
        "s",
        "except",
        "one",
        "get",
        "happiness",
        "pleasure",
        "loved",
        "one",
        "ne",
        "p",
        "since",
        "happiness",
        "outward",
        "manifestation",
        "perfection",
        "make",
        "real",
        "difference",
        "whether",
        "love",
        "said",
        "perfection",
        "happiness",
        "another",
        "rational",
        "object",
        "leibniz",
        "thus",
        "make",
        "insightful",
        "suggestion",
        "though",
        "everything",
        "inclination",
        "whose",
        "satisfaction",
        "give",
        "u",
        "pleasure",
        "perfectly",
        "compatible",
        "desiring",
        "perfection",
        "another",
        "without",
        "end",
        "view",
        "actually",
        "occurs",
        "whenever",
        "object",
        "desire",
        "another",
        "s",
        "perfection",
        "happiness",
        "truth",
        "leibniz",
        "concludes",
        "happiness",
        "whose",
        "happiness",
        "plea",
        "u",
        "turn",
        "happiness",
        "since",
        "thing",
        "please",
        "u",
        "desired",
        "sake",
        "pw",
        "codex",
        "iuris",
        "gentium",
        "p",
        "reading",
        "leibniz",
        "s",
        "conception",
        "disinterested",
        "love",
        "see",
        "brown",
        "b",
        "genuine",
        "altruism",
        "require",
        "complete",
        "selflessness",
        "indeed",
        "selflessness",
        "even",
        "possible",
        "would",
        "desirable",
        "w",
        "letter",
        "nicaise",
        "p",
        "according",
        "leibniz",
        "one",
        "envisage",
        "god",
        "motive",
        "perfection",
        "like",
        "pleasure",
        "supposing",
        "according",
        "definition",
        "pleasure",
        "nothing",
        "feeling",
        "perfection",
        "nothing",
        "consider",
        "outside",
        "contrary",
        "everything",
        "depends",
        "goodness",
        "would",
        "supreme",
        "aim",
        "good",
        "perfection",
        "far",
        "possible",
        "one",
        "say",
        "show",
        "motive",
        "place",
        "truly",
        "virtuous",
        "generous",
        "men",
        "whose",
        "supreme",
        "function",
        "degré",
        "imitate",
        "divinity",
        "far",
        "human",
        "nature",
        "capable",
        "pw",
        "meditation",
        "common",
        "concept",
        "justice",
        "pp",
        "imitate",
        "divinitythis",
        "overarching",
        "imperative",
        "leibniz",
        "s",
        "ethic",
        "guiding",
        "principle",
        "entire",
        "philosophical",
        "system",
        "god",
        "humanity",
        "measure",
        "thing",
        "pw",
        "opinion",
        "principle",
        "pufendorf",
        "p",
        "chief",
        "task",
        "therefore",
        "make",
        "perpetual",
        "progress",
        "toward",
        "ideal",
        "divine",
        "nature",
        "u",
        "like",
        "little",
        "divinity",
        "city",
        "god",
        "pe",
        "monadology",
        "pp",
        "pp"
    ]
}