{
    "main_text": "Interpreting Scripture\n3. Interpreting Scripture\n\nLeibowitz begins with a definition of God and draws out its\nimplications for how we are to conceive of the world from a Jewish\nperspective. But where does he find this starting point? Textually\nspeaking, one might claim to find grounding for the radical\ntranscendence of God in various biblical verses and statements drawn\nfrom the Jewish tradition more generally, but no less than one can\nfind quotes to question this account of God’s relationship with\nnature and with history – as Leibowitz himself often\n acknowledges.[8]\n Indeed, any plain reading of Jewish Scripture would seem to suggest a\nGod very closely involved with history and nature. Leibowitz’s\nreading of Jewish Scripture is therefore based on a very particular\nhermeneutic approach to the Tanakh (the acronym used to refer\nto Jewish Scripture, based on the three works of which is\ncomposed – Torah, (lit. instruction),\nNevi’im (Prophets), and Ketuvim\n(Writings)).\n\nLeibowitz’s definition of the Tanakh as Holy Scripture\nwould appear atypically to place him in uncontroversial territory.\nBut, what, for Leibowitz, does it mean to accord it this status and\nhow is it to be interpreted? For simplicity’s sake, we will\nfocus in what follows on the Torah, the founding constitution of\nJudaism and the most authoritative part of the Tanakh.\nTraditionally, it was believed that: 1) The Torah is the word of God\nas dictated to Moses; and 2) it contains both the history of ancient\nIsrael and the eternally valid laws that bind the Jewish\npeople – the mitzvoth. Though both claims are contested in\ncontemporary denominations of Judaism, Leibowitz is highly critical of\nsuch denominations, identifying himself with Orthodox Judaism within\nwhich these would usually remain fundamental tenets. Yet his view of\nScripture is some distance from the traditional picture.\n\nWhile many traditionalists would read the Torah as containing the\nprehistory of Judaism – if not of the world – and thus as\nbeing full of factual statements teaching such information, Leibowitz\ncannot accept this to be the case. Beginning with a basic\nepistemological point, as noted earlier Leibowitz’s scientific\ntraining and vocation led him to take a positivistic approach to\nknowledge claims. Thus he writes that “our source of information\nis science. To the extent that we possess any real knowledge it is by\nway of scientific cognition” (Judaism, 136). But, given\nGod’s transcendence, there can be nothing holy about history or\nnature, or the information it provides. So were the Torah a history\nbook or a scientific tract detailing the science of the\nuniverse – and it is of course often read as at least giving an\naccount of the origins of the universe – “it would be\ndifficult to see where [its] sacredness resided”\n(Judaism, 140). The Torah cannot be a holy book if it is\nteaching us information that is by (Leibowitz’s) definition\n profane.[9]\n\nBut this means that the prima facie factual assertions that\nwe encounter must be read as nothing of the sort. The Torah is not a\nwork of fact containing truths that we can obtain through standard\nepistemic procedures. It is rather, a sacred work, a work that is\nconcerned with the realm of the religious. Not for Leibowitz therefore\nthe time-honoured medieval conundrum regarding faith and reason. While\nfor his medieval Jewish forbears reason and revelation were competing\nfor the same territory – raising the question of the relevance of\nthe latter for those enamoured of the former – Leibowitz is happy\nto give reason its due without worrying about its encroachment into\nthe territory of revelation, and vice versa. The Torah as a\nsacred work is dealing in the realm of the sacred and is not supposed\nto be a repository of the propositional truths of history or science.\nWhat it provides instead is “the demand made of man to worship\nGod” (Judaism, 136). As noted earlier, Leibowitz has no\ntruck with the idea that there could be “religious facts”\nand the idea that belief in creation, for example, could be a\nreligious demand would conflate facts and values. The Torah is the\nsource of the commandments – the mitzvoth – which are the\nmanner in which Jews are to serve God. \n\nIn one sense, this hermeneutic serves Leibowitz well, allowing him to\nbypass textual objections to his anti-providential reading of the\nTorah by claiming that the apparent references to God’s role in\nnature or history are no longer to be understood factually, but rather\nas expressing something about the nature of our obligation to God.\nSimilarly, stories of individuals are not to be mined for their\nhistorical content but for what they teach regarding the nature of\nreligious obligation. At the same time, it demands a far from\nintuitive reading of much of Scripture, especially the stories of\nindividuals that are certainly presented as if they are in some sense\nhistorical, and that in the later books of the Prophets that are also\npart of Holy Scripture surely are historical in part. Yet\nLeibowitz insists that in attempting the impossible – speaking of\nGod – the Torah necessarily uses various literary forms amenable\nto human comprehension, but that nonetheless “from the\nstandpoint of religious faith, the Torah and the entirety of Holy\nScripture must be conceived as a demand which transcends the\nrange of human cognition … a demand conveyed in various forms\nof human expression: prescriptions, vision, poetry, prayer, thought,\nand narrative” (Judaism, 140).\n\nThis does not rule out in principle the possibility of the narratives\nhappening to contain historical information in part. Scripture’s\nnarratives could at times coincide with historical facts, though\nwhether or not this is the case would be subject to independent\nverification of these purported historical facts by standard epistemic\ncriteria. But even allowing for this possibility, the historical\nmeaning would be merely accidental. Such facts would not take on any\nsacred meaning in virtue of that facticity, but rather on account of\nimparting an ahistorical sacred message. The Torah, qua Holy\nScripture, cannot be read as a repository of historical fact. To read\nit “from the standpoint of religious faith,” is to read it\nfor the demands it places upon us.\n\nNonetheless, given Leibowitz’s views on God’s\ntranscendence, it is clear that the sacred and historical\ninterpretations of the text are mutually exclusive when it\ncomes to references to God’s “intervention” in\nhistory or nature. Maintaining God’s transcendence demands that\nthere can be no such incursions of holiness into the world of the\nprofane, and Leibowitz’s hermeneutic allows him to police these\nboundaries and deny that the Torah teaches us anything about\nGod’s actual intervention in nature or his directing of history.\nApparently factual statements to this end in the Torah are not to be\nconstrued as such, but rather in terms of the normative messages that\nthey carry. Here, the priority that Leibowitz gives to his\nunderstanding of God’s transcendence appears forcefully,\nconstraining him to take this hermeneutic stance. It does, however,\nraise the question of Leibowitz’s understanding of the divine\nstatus of the Torah. For, if we cannot speak of it being revealed by\nGod in any historical sense, whence its divinity? Leibowitz, fully\naware of the problem, maintains that it is the Oral Torah that\nestablishes the divinity of the Written Torah.\n\nTraditional Jewish teaching maintained that at the same time as he\ntransmitted the Written Torah, God transmitted an oral teaching to\nMoses that was not to be written down. This Oral teaching developed\ninto the multi-layered work that was eventually written down as the\nTalmud by the end of the sixth century and that was the source of the\ncomplex practical system of law – halakhah – that governed\nJewish life until the nineteenth century and continues to structure\nthe life of contemporary Orthodox Jews. Leibowitz maintains that\n“religiously and from a logical and causal standpoint the Oral\nLaw, the Halakhah, is prior to the Written Teaching”\n(Judaism, 12), and thus it is the Oral Torah that grants\ndivine status to the Written Torah:\n\n\nThe decision about which books to accept as Scripture was not\nmade behind the veil of mythology or pre-history, but took place in\nthe full light of history and in the course of halakhic\nnegotiation…. Scripture is one of the institutions of the\nreligion of Israel. (Judaism, 12)\n\n\nThis, Leibowitz admits, yields an inescapably circular account whereby\nthe divinity of the Written Torah is established by the Oral Torah,\nwhich only gains its own authority on the basis of the Written Torah\nthat it is being used to support. More significantly Leibowitz\nemphasizes time and again that the Oral Torah is a human product. Thus\nwe end up with human beings stipulating that the Written Torah is\ndivine, a stipulation, however, that only has authority based upon the\nWritten Torah’s own statements to the effect that one must\nfollow the words of the human\n sages.[10]\n Reinforcing the circularity, this way of reading of the relevant\nverses in the Torah itself depends on interpretation by the sages.\n\nLeibowitz maintains, then, that we can say one thing about\nGod – that he is radically transcendent, a statement the content\nof which is exhausted in the denial of any element of divinity to any\nother reality. Allowing for this denial of any positive theology that\nwould relate God to history or nature, we still find one thing to\nwhich we can attach divinity, and that is Scripture. However, the most\nbasic question regarding whether or not God revealed the Torah in any\nhistorical sense must be answered negatively by Leibowitz, as noted in\nStatman 2005 (60) and Sagi 1997a (213), leaving him with an account of\nthe divinity of Scripture that is circular, and that ultimately seems\nunable to escape its reliance on human decision.\n",
    "section_title": "3. Interpreting Scripture",
    "entry_title": "Yeshayahu Leibowitz",
    "hierarchy_title": "Yeshayahu Leibowitz || Interpreting Scripture",
    "tokenized_text": [
        "interpreting",
        "scripture",
        "interpreting",
        "scripture",
        "leibowitz",
        "begin",
        "definition",
        "god",
        "draw",
        "implication",
        "conceive",
        "world",
        "jewish",
        "perspective",
        "find",
        "starting",
        "point",
        "textually",
        "speaking",
        "one",
        "might",
        "claim",
        "find",
        "grounding",
        "radical",
        "transcendence",
        "god",
        "various",
        "biblical",
        "verse",
        "statement",
        "drawn",
        "jewish",
        "tradition",
        "generally",
        "le",
        "one",
        "find",
        "quote",
        "question",
        "account",
        "god",
        "relationship",
        "nature",
        "history",
        "leibowitz",
        "often",
        "acknowledges",
        "indeed",
        "plain",
        "reading",
        "jewish",
        "scripture",
        "would",
        "seem",
        "suggest",
        "god",
        "closely",
        "involved",
        "history",
        "nature",
        "leibowitz",
        "reading",
        "jewish",
        "scripture",
        "therefore",
        "based",
        "particular",
        "hermeneutic",
        "approach",
        "tanakh",
        "acronym",
        "used",
        "refer",
        "jewish",
        "scripture",
        "based",
        "three",
        "work",
        "composed",
        "torah",
        "lit",
        "instruction",
        "nevus",
        "im",
        "prophet",
        "ketuvim",
        "writing",
        "leibowitz",
        "definition",
        "tanakh",
        "holy",
        "scripture",
        "would",
        "appear",
        "atypically",
        "place",
        "uncontroversial",
        "territory",
        "leibowitz",
        "mean",
        "accord",
        "status",
        "interpreted",
        "simplicity",
        "sake",
        "focus",
        "follows",
        "torah",
        "founding",
        "constitution",
        "judaism",
        "authoritative",
        "part",
        "tanakh",
        "traditionally",
        "believed",
        "torah",
        "word",
        "god",
        "dictated",
        "moses",
        "contains",
        "history",
        "ancient",
        "israel",
        "eternally",
        "valid",
        "law",
        "bind",
        "jewish",
        "people",
        "mitzvah",
        "though",
        "claim",
        "contested",
        "contemporary",
        "denomination",
        "judaism",
        "leibowitz",
        "highly",
        "critical",
        "denomination",
        "identifying",
        "orthodox",
        "judaism",
        "within",
        "would",
        "usually",
        "remain",
        "fundamental",
        "tenet",
        "yet",
        "view",
        "scripture",
        "distance",
        "traditional",
        "picture",
        "many",
        "traditionalist",
        "would",
        "read",
        "torah",
        "containing",
        "prehistory",
        "judaism",
        "world",
        "thus",
        "full",
        "factual",
        "statement",
        "teaching",
        "information",
        "leibowitz",
        "accept",
        "case",
        "beginning",
        "basic",
        "epistemological",
        "point",
        "noted",
        "earlier",
        "leibowitz",
        "scientific",
        "training",
        "vocation",
        "led",
        "take",
        "positivistic",
        "approach",
        "knowledge",
        "claim",
        "thus",
        "writes",
        "source",
        "information",
        "science",
        "extent",
        "posse",
        "real",
        "knowledge",
        "way",
        "scientific",
        "cognition",
        "judaism",
        "given",
        "god",
        "transcendence",
        "nothing",
        "holy",
        "history",
        "nature",
        "information",
        "provides",
        "torah",
        "history",
        "book",
        "scientific",
        "tract",
        "detailing",
        "science",
        "universe",
        "course",
        "often",
        "read",
        "least",
        "giving",
        "account",
        "origin",
        "universe",
        "would",
        "difficult",
        "see",
        "sacredness",
        "resided",
        "judaism",
        "torah",
        "holy",
        "book",
        "teaching",
        "u",
        "information",
        "leibowitz",
        "definition",
        "profane",
        "mean",
        "prima",
        "facie",
        "factual",
        "assertion",
        "encounter",
        "must",
        "read",
        "nothing",
        "sort",
        "torah",
        "work",
        "fact",
        "containing",
        "truth",
        "obtain",
        "standard",
        "epistemic",
        "procedure",
        "rather",
        "sacred",
        "work",
        "work",
        "concerned",
        "realm",
        "religious",
        "leibowitz",
        "therefore",
        "timehonoured",
        "medieval",
        "conundrum",
        "regarding",
        "faith",
        "reason",
        "medieval",
        "jewish",
        "forbear",
        "reason",
        "revelation",
        "competing",
        "territory",
        "raising",
        "question",
        "relevance",
        "latter",
        "enamoured",
        "former",
        "leibowitz",
        "happy",
        "give",
        "reason",
        "due",
        "without",
        "worrying",
        "encroachment",
        "territory",
        "revelation",
        "vice",
        "versa",
        "torah",
        "sacred",
        "work",
        "dealing",
        "realm",
        "sacred",
        "supposed",
        "repository",
        "propositional",
        "truth",
        "history",
        "science",
        "provides",
        "instead",
        "demand",
        "made",
        "man",
        "worship",
        "god",
        "judaism",
        "noted",
        "earlier",
        "leibowitz",
        "truck",
        "idea",
        "could",
        "religious",
        "fact",
        "idea",
        "belief",
        "creation",
        "example",
        "could",
        "religious",
        "demand",
        "would",
        "conflate",
        "fact",
        "value",
        "torah",
        "source",
        "commandment",
        "mitzvah",
        "manner",
        "jew",
        "serve",
        "god",
        "one",
        "sense",
        "hermeneutic",
        "serf",
        "leibowitz",
        "well",
        "allowing",
        "bypass",
        "textual",
        "objection",
        "antiprovidential",
        "reading",
        "torah",
        "claiming",
        "apparent",
        "reference",
        "god",
        "role",
        "nature",
        "history",
        "longer",
        "understood",
        "factually",
        "rather",
        "expressing",
        "something",
        "nature",
        "obligation",
        "god",
        "similarly",
        "story",
        "individual",
        "mined",
        "historical",
        "content",
        "teach",
        "regarding",
        "nature",
        "religious",
        "obligation",
        "time",
        "demand",
        "far",
        "intuitive",
        "reading",
        "much",
        "scripture",
        "especially",
        "story",
        "individual",
        "certainly",
        "presented",
        "sense",
        "historical",
        "later",
        "book",
        "prophet",
        "also",
        "part",
        "holy",
        "scripture",
        "surely",
        "historical",
        "part",
        "yet",
        "leibowitz",
        "insists",
        "attempting",
        "impossible",
        "speaking",
        "god",
        "torah",
        "necessarily",
        "us",
        "various",
        "literary",
        "form",
        "amenable",
        "human",
        "comprehension",
        "nonetheless",
        "standpoint",
        "religious",
        "faith",
        "torah",
        "entirety",
        "holy",
        "scripture",
        "must",
        "conceived",
        "demand",
        "transcends",
        "range",
        "human",
        "cognition",
        "demand",
        "conveyed",
        "various",
        "form",
        "human",
        "expression",
        "prescription",
        "vision",
        "poetry",
        "prayer",
        "thought",
        "narrative",
        "judaism",
        "rule",
        "principle",
        "possibility",
        "narrative",
        "happening",
        "contain",
        "historical",
        "information",
        "part",
        "scripture",
        "narrative",
        "could",
        "time",
        "coincide",
        "historical",
        "fact",
        "though",
        "whether",
        "case",
        "would",
        "subject",
        "independent",
        "verification",
        "purported",
        "historical",
        "fact",
        "standard",
        "epistemic",
        "criterion",
        "even",
        "allowing",
        "possibility",
        "historical",
        "meaning",
        "would",
        "merely",
        "accidental",
        "fact",
        "would",
        "take",
        "sacred",
        "meaning",
        "virtue",
        "facticity",
        "rather",
        "account",
        "imparting",
        "ahistorical",
        "sacred",
        "message",
        "torah",
        "qua",
        "holy",
        "scripture",
        "read",
        "repository",
        "historical",
        "fact",
        "read",
        "standpoint",
        "religious",
        "faith",
        "read",
        "demand",
        "place",
        "upon",
        "u",
        "nonetheless",
        "given",
        "leibowitz",
        "view",
        "god",
        "transcendence",
        "clear",
        "sacred",
        "historical",
        "interpretation",
        "text",
        "mutually",
        "exclusive",
        "come",
        "reference",
        "god",
        "intervention",
        "history",
        "nature",
        "maintaining",
        "god",
        "transcendence",
        "demand",
        "incursion",
        "holiness",
        "world",
        "profane",
        "leibowitz",
        "hermeneutic",
        "allows",
        "police",
        "boundary",
        "deny",
        "torah",
        "teach",
        "u",
        "anything",
        "god",
        "actual",
        "intervention",
        "nature",
        "directing",
        "history",
        "apparently",
        "factual",
        "statement",
        "end",
        "torah",
        "construed",
        "rather",
        "term",
        "normative",
        "message",
        "carry",
        "priority",
        "leibowitz",
        "give",
        "understanding",
        "god",
        "transcendence",
        "appears",
        "forcefully",
        "constraining",
        "take",
        "hermeneutic",
        "stance",
        "however",
        "raise",
        "question",
        "leibowitz",
        "understanding",
        "divine",
        "status",
        "torah",
        "speak",
        "revealed",
        "god",
        "historical",
        "sense",
        "whence",
        "divinity",
        "leibowitz",
        "fully",
        "aware",
        "problem",
        "maintains",
        "oral",
        "torah",
        "establishes",
        "divinity",
        "written",
        "torah",
        "traditional",
        "jewish",
        "teaching",
        "maintained",
        "time",
        "transmitted",
        "written",
        "torah",
        "god",
        "transmitted",
        "oral",
        "teaching",
        "moses",
        "written",
        "oral",
        "teaching",
        "developed",
        "multilayered",
        "work",
        "eventually",
        "written",
        "talmud",
        "end",
        "sixth",
        "century",
        "source",
        "complex",
        "practical",
        "system",
        "law",
        "halakhah",
        "governed",
        "jewish",
        "life",
        "nineteenth",
        "century",
        "continues",
        "structure",
        "life",
        "contemporary",
        "orthodox",
        "jew",
        "leibowitz",
        "maintains",
        "religiously",
        "logical",
        "causal",
        "standpoint",
        "oral",
        "law",
        "halakhah",
        "prior",
        "written",
        "teaching",
        "judaism",
        "thus",
        "oral",
        "torah",
        "grant",
        "divine",
        "status",
        "written",
        "torah",
        "decision",
        "book",
        "accept",
        "scripture",
        "made",
        "behind",
        "veil",
        "mythology",
        "prehistory",
        "took",
        "place",
        "full",
        "light",
        "history",
        "course",
        "halakhic",
        "negotiation",
        "scripture",
        "one",
        "institution",
        "religion",
        "israel",
        "judaism",
        "leibowitz",
        "admits",
        "yield",
        "inescapably",
        "circular",
        "account",
        "whereby",
        "divinity",
        "written",
        "torah",
        "established",
        "oral",
        "torah",
        "gain",
        "authority",
        "basis",
        "written",
        "torah",
        "used",
        "support",
        "significantly",
        "leibowitz",
        "emphasizes",
        "time",
        "oral",
        "torah",
        "human",
        "product",
        "thus",
        "end",
        "human",
        "being",
        "stipulating",
        "written",
        "torah",
        "divine",
        "stipulation",
        "however",
        "authority",
        "based",
        "upon",
        "written",
        "torah",
        "statement",
        "effect",
        "one",
        "must",
        "follow",
        "word",
        "human",
        "sage",
        "reinforcing",
        "circularity",
        "way",
        "reading",
        "relevant",
        "verse",
        "torah",
        "depends",
        "interpretation",
        "sage",
        "leibowitz",
        "maintains",
        "say",
        "one",
        "thing",
        "god",
        "radically",
        "transcendent",
        "statement",
        "content",
        "exhausted",
        "denial",
        "element",
        "divinity",
        "reality",
        "allowing",
        "denial",
        "positive",
        "theology",
        "would",
        "relate",
        "god",
        "history",
        "nature",
        "still",
        "find",
        "one",
        "thing",
        "attach",
        "divinity",
        "scripture",
        "however",
        "basic",
        "question",
        "regarding",
        "whether",
        "god",
        "revealed",
        "torah",
        "historical",
        "sense",
        "must",
        "answered",
        "negatively",
        "leibowitz",
        "noted",
        "statman",
        "sagi",
        "a",
        "leaving",
        "account",
        "divinity",
        "scripture",
        "circular",
        "ultimately",
        "seems",
        "unable",
        "escape",
        "reliance",
        "human",
        "decision"
    ]
}