{
    "main_text": "The Nature of Modality\n2. The Nature of Modality\n\n\nOne reason that Leibniz's conception of possible worlds has\nattracted the sympathetic attention of some contemporary philosophers\nand has proven appealing is that it appears to foreshadow the\ndevelopments in possible-worlds semantics. According to this\nview, our basic modal concepts—necessity, contingency,\npossibility and impossibility—can be defined in\nstraightforwardly non-modal terms.\n\nPossibility: A proposition is possible if and only if it\nis true in some possible world. A being is possible if and only if it\nexists in some possible world.\nContingency: A proposition is contingently true if and\nonly if it is true in this world and false in another world. A\nproposition is contingent if its contrary does not imply a\ncontradiction.\nNecessity: A proposition is necessarily true if and only\nif it is true in every possible world.\nImpossibility: A proposition is impossible if and only if\nit is not true in any possible world.\n\n\n\nBut does Leibniz's account of necessity and contingency really\namount to possible-worlds semantics for modality avant la\nlettre? While Leibniz had all the tools at his disposal to\ndevelop such an account of modality, he did not, or, at least, he did\nnot do so explicitly in any texts. Rather, his account of the\nnature of necessity and contingency has more to do with his account of\nthe nature of truth and the analysis of propositions. More\nspecifically, it has to do with his doctrine of infinite\nanalysis. In his piece On Contingency,\nLeibniz writes,\n\n\n[I]n necessary propositions, when the analysis is continued\nindefinitely, it arrives at an equation that is an identity… But\nin contingent propositions one continues the analysis to infinity\nthrough reasons for reasons, so that one never has a complete\ndemonstration, though there is always, underneath, a reason for the\ntruth, but the reason is understood completely by God, who alone\ntraverses the infinite series in one stroke of mind. (A VI iv 1650/AG\n28)\n\n\nIn other words, a proposition is necessary (or expresses a necessary\ntruth) if, in analyzing it, one arrives at a statement of\nidentities. A simple example can be found in arithmetic:\n“2+2 = 4.” Since “2 = 1+1” and “4 =\n1+1+1+1”, we can easily show that the original statement can be\nreduced to “1+1+1+1 = 1+1+1+1.” Here we have an\nobvious case of an identity and one where we can say that the concept\nof the predicate – in this case, “4” – is\ncontained is contained in the subject, “2+2” (or\n“(1+1) + (1+1)”).\n\n\nIt should be clear that Leibniz's definition of what is\nnecessary will be adopted by Kant, but Kant will call\nthis analytic. (On the other hand, Kant famously rejects\nthe idea that the arithmetic statement given above (or any arithmetic\nstatement) is analytic. Although this is a topic of some\ncontroversy, the majority of jurors have a returned a verdict in favor\nof Leibniz's classificatory scheme and against that of Kant.)\n\n\n A\ntrue proposition that is contingent is one in which it can\nnever be demonstrated that the subject and predicate terms are\nreducible to identities. Indeed, according to Leibniz, the\nanalysis of these concepts can be carried on to infinity. While\nthis might seem vague, Leibniz often compares the distinction between\nnecessary and contingent truths to rational and irrational numbers.\n\n\n[I]n proportions, while the analysis sometimes comes to an end, and\narrives at a common measure, namely, one that measures out each term of\nthe proportion through exact repetitions of itself, in other cases the\nanalysis can be continued to infinity, as happens in the comparison\nbetween a rational number and an irrational number, such as the\ncomparison of the side and the diagonal of a square. So, similarly,\ntruths are sometimes provable, that is, necessary, and sometimes they\nare free or contingent, and so cannot be reduced by any analysis to an\nidentity, to a common measure, as it were. And this is an essential\ndistinction, both for proportions and for truths. (A VI iv\n1657/AG 97)\n\n\nAlthough “infinite analysis” might still seem a rather\nelusive idea, the driving thought should not be so difficult.\nThe reason for any contingently true proposition is to be\nfound in another contingently true proposition, and this chain of\nreasons goes back ultimately to the creation of the world (or rather to\nGod's free choice of this particular world). We,\nwith our finite minds, are not able to grasp this chain of reasons, but\nGod can do so.\n\n\nBut in contingent truths, even though the predicate is in the\nsubject, this can never be demonstrated, nor can a proposition ever be\nreduced [revocari] to an equality or to an identity, but the\nresolution proceeds to infinity, God alone seeing, not the end of the\nresolution, of course, which does not exist, but the connection of the\nterms or the containment of the predicate in the subject, since he sees\nwhatever is in the series. Indeed, this very truth was derived in part\nfrom his intellect, in part from his will, and it expresses his\ninfinite perfection and the harmony of the entire series of things in\nits own particular way. (A VI iv 1656/AG 96)\n\n\nLeibniz's definition of a possibility is simply a\nproposition that can be shown to be such that a contradiction will\nnever arise in its analysis. (A VI iv 758/LLP 61) And an\nimpossibility, not surprisingly, is defined as a proposition that can\nbe demonstrated to generate a contradiction in its analysis.\n\n\nIt was claimed above that Leibniz does not explicitly adopt the kind of\npossible-worlds semantics endorsed by Lewis and others in his own\ndefinitions and explanations of our basic modal concepts. But it\nis easy to show that Leibniz's account of these modal concepts\ncan be translated into the now standard possible-worlds\nsemantics. Consider the way Leibniz distinguishes necessary and\ncontingent truths in §13 of the Discourse on\nMetaphysics.\n\n\nThe one whose contrary implies a contradiction is absolutely\nnecessary; this deduction occurs in the eternal truths, for example,\nthe truths of geometry. The other is necessary only ex\nhypothesi and, so to speak, accidentally, but it is contingent in\nitself, since its contrary does not imply a contradiction. And this\nconnection is based not purely on ideas and God's simple understanding,\nbut on his free decrees and on the sequence of the universe. (A VI iv\n1547/AG 45)\n\n\nAnd, slightly later, discussing Julius Caesar's crossing of\nthe Rubicon (and predicate “crosses the Rubicon” in the\nconcept of Caesar), Leibniz writes the following:\n\n\nFor it will be found that the demonstration of this predicate of\nCaesar is not as absolute as those of numbers or of geometry, but that\nit supposes the sequence of things that God has freely chosen, a\nsequence based on God's first free decree always to do what is most\nperfect and on God's decree with respect to human nature, following out\nof the first decree, that man will always do (although freely) that\nwhich appears to be best. But every truth based on these kinds of\ndecrees is contingent, even though it is certain; for these decrees do\nnot change the possibility of things, and, as I have already said, even\nthough it is certain that God always chooses the best, this does not\nprevent something less perfect from being and remaining possible in\nitself, even though it will not happen, since it is not its\nimpossibility but its imperfection which causes it to be rejected. And\nnothing is necessary whose contrary is possible. (A VI iv 1548/AG\n46)\n\n\nThe crucial idea here is that a proposition is contingently true in\nthis world when it is somehow dependent upon the first free decree of\nGod, that is, when the reason for the truth of the\nproposition is to be located in the actualization of this\nparticular world. There is another world, W*, existing in the\ninfinite library of world-books, which is such that if God\nhad brought that world, W*, into existence P would\nbe false. In other words, a proposition is contingently true when it\nis true in that world and false in some other world. As mentioned\nabove, however, Leibniz defines a possible proposition in another text\nfrom this period as a proposition which will never result in a\ncontradiction in its analysis, and given his account of worlds, this\nsimply means that the proposition is true in some world. Further,\nsince necessary truths are not dependent upon the first free\ndecree of God but are instead revealed by analysis to be identities,\nthey are in fact propositions that are true in all possible\nworlds. And so, while our basic modal concepts are explained in terms\nof the in-esse doctrine of truth (i.e. the\nPredicate-in-Notion Principle) and the notion of infinite analysis (in\nthe case of contingency), it is a not a great jump to possible-worlds\nsemantics.\n\n\nIt should probably not be surprising that Leibniz's explication of the\nnature of the distinction between necessary and contingent truths can\nbe translated into the terms of contemporary possible-worlds\nsemantics. For Leibniz tells us in On Freedom (De\nlibertate... 1689?) that he first came to think of the\nnature of possibilia in terms of fictional worlds, worlds\nthat have existence in a somewhat tenuous sense. “But the\nconsideration of possibles, which are not, were not, and will not be,\nbrought me back from this precipice [Spinoza's necessitarianism]. For\nif there are certain possibles that never exist, then the things that\nexist, at any rate, are not always necessary, for otherwise it would\nbe impossible for others to exist in their place, and thus, everything\nthat never exists would be impossible.” (A VI iv\n1653–54/AG 94) It was only later that he began to conceive of\nthe distinction between necessary and contingent truths in terms of\nfinite and infinite analysis. In the end, then, we can say that the\ndoctrine of infinite analysis is dependent upon the doctrine of the\ninfinity of possible worlds.\n",
    "section_title": "2. The Nature of Modality",
    "entry_title": "Leibniz’s Modal Metaphysics",
    "hierarchy_title": "Leibniz’s Modal Metaphysics || The Nature of Modality",
    "tokenized_text": [
        "nature",
        "modality",
        "nature",
        "modality",
        "one",
        "reason",
        "leibniz",
        "s",
        "conception",
        "possible",
        "world",
        "attracted",
        "sympathetic",
        "attention",
        "contemporary",
        "philosopher",
        "proven",
        "appealing",
        "appears",
        "foreshadow",
        "development",
        "possibleworlds",
        "semantics",
        "according",
        "view",
        "basic",
        "modal",
        "conceptsnecessity",
        "contingency",
        "possibility",
        "impossibilitycan",
        "defined",
        "straightforwardly",
        "nonmodal",
        "term",
        "possibility",
        "proposition",
        "possible",
        "true",
        "possible",
        "world",
        "possible",
        "exists",
        "possible",
        "world",
        "contingency",
        "proposition",
        "contingently",
        "true",
        "true",
        "world",
        "false",
        "another",
        "world",
        "proposition",
        "contingent",
        "contrary",
        "imply",
        "contradiction",
        "necessity",
        "proposition",
        "necessarily",
        "true",
        "true",
        "every",
        "possible",
        "world",
        "impossibility",
        "proposition",
        "impossible",
        "true",
        "possible",
        "world",
        "leibniz",
        "s",
        "account",
        "necessity",
        "contingency",
        "really",
        "amount",
        "possibleworlds",
        "semantics",
        "modality",
        "avant",
        "la",
        "lettre",
        "leibniz",
        "tool",
        "disposal",
        "develop",
        "account",
        "modality",
        "least",
        "explicitly",
        "text",
        "rather",
        "account",
        "nature",
        "necessity",
        "contingency",
        "account",
        "nature",
        "truth",
        "analysis",
        "proposition",
        "specifically",
        "doctrine",
        "infinite",
        "analysis",
        "piece",
        "contingency",
        "leibniz",
        "writes",
        "n",
        "necessary",
        "proposition",
        "analysis",
        "continued",
        "indefinitely",
        "arrives",
        "equation",
        "identity",
        "contingent",
        "proposition",
        "one",
        "continues",
        "analysis",
        "infinity",
        "reason",
        "reason",
        "one",
        "never",
        "complete",
        "demonstration",
        "though",
        "always",
        "underneath",
        "reason",
        "truth",
        "reason",
        "understood",
        "completely",
        "god",
        "alone",
        "traverse",
        "infinite",
        "series",
        "one",
        "stroke",
        "mind",
        "vi",
        "iv",
        "ag",
        "word",
        "proposition",
        "necessary",
        "express",
        "necessary",
        "truth",
        "analyzing",
        "one",
        "arrives",
        "statement",
        "identity",
        "simple",
        "example",
        "found",
        "arithmetic",
        "since",
        "easily",
        "show",
        "original",
        "statement",
        "reduced",
        "obvious",
        "case",
        "identity",
        "one",
        "say",
        "concept",
        "predicate",
        "case",
        "contained",
        "contained",
        "subject",
        "clear",
        "leibniz",
        "s",
        "definition",
        "necessary",
        "adopted",
        "kant",
        "kant",
        "call",
        "analytic",
        "hand",
        "kant",
        "famously",
        "reject",
        "idea",
        "arithmetic",
        "statement",
        "given",
        "arithmetic",
        "statement",
        "analytic",
        "although",
        "topic",
        "controversy",
        "majority",
        "juror",
        "returned",
        "verdict",
        "favor",
        "leibniz",
        "s",
        "classificatory",
        "scheme",
        "kant",
        "true",
        "proposition",
        "contingent",
        "one",
        "never",
        "demonstrated",
        "subject",
        "predicate",
        "term",
        "reducible",
        "identity",
        "indeed",
        "according",
        "leibniz",
        "analysis",
        "concept",
        "carried",
        "infinity",
        "might",
        "seem",
        "vague",
        "leibniz",
        "often",
        "compare",
        "distinction",
        "necessary",
        "contingent",
        "truth",
        "rational",
        "irrational",
        "number",
        "n",
        "proportion",
        "analysis",
        "sometimes",
        "come",
        "end",
        "arrives",
        "common",
        "measure",
        "namely",
        "one",
        "measure",
        "term",
        "proportion",
        "exact",
        "repetition",
        "case",
        "analysis",
        "continued",
        "infinity",
        "happens",
        "comparison",
        "rational",
        "number",
        "irrational",
        "number",
        "comparison",
        "side",
        "diagonal",
        "square",
        "similarly",
        "truth",
        "sometimes",
        "provable",
        "necessary",
        "sometimes",
        "free",
        "contingent",
        "reduced",
        "analysis",
        "identity",
        "common",
        "measure",
        "essential",
        "distinction",
        "proportion",
        "truth",
        "vi",
        "iv",
        "ag",
        "although",
        "infinite",
        "analysis",
        "might",
        "still",
        "seem",
        "rather",
        "elusive",
        "idea",
        "driving",
        "thought",
        "difficult",
        "reason",
        "contingently",
        "true",
        "proposition",
        "found",
        "another",
        "contingently",
        "true",
        "proposition",
        "chain",
        "reason",
        "go",
        "back",
        "ultimately",
        "creation",
        "world",
        "rather",
        "god",
        "s",
        "free",
        "choice",
        "particular",
        "world",
        "finite",
        "mind",
        "able",
        "grasp",
        "chain",
        "reason",
        "god",
        "contingent",
        "truth",
        "even",
        "though",
        "predicate",
        "subject",
        "never",
        "demonstrated",
        "proposition",
        "ever",
        "reduced",
        "revocari",
        "equality",
        "identity",
        "resolution",
        "proceeds",
        "infinity",
        "god",
        "alone",
        "seeing",
        "end",
        "resolution",
        "course",
        "exist",
        "connection",
        "term",
        "containment",
        "predicate",
        "subject",
        "since",
        "see",
        "whatever",
        "series",
        "indeed",
        "truth",
        "derived",
        "part",
        "intellect",
        "part",
        "express",
        "infinite",
        "perfection",
        "harmony",
        "entire",
        "series",
        "thing",
        "particular",
        "way",
        "vi",
        "iv",
        "ag",
        "leibniz",
        "s",
        "definition",
        "possibility",
        "simply",
        "proposition",
        "shown",
        "contradiction",
        "never",
        "arise",
        "analysis",
        "vi",
        "iv",
        "llp",
        "impossibility",
        "surprisingly",
        "defined",
        "proposition",
        "demonstrated",
        "generate",
        "contradiction",
        "analysis",
        "claimed",
        "leibniz",
        "explicitly",
        "adopt",
        "kind",
        "possibleworlds",
        "semantics",
        "endorsed",
        "lewis",
        "others",
        "definition",
        "explanation",
        "basic",
        "modal",
        "concept",
        "easy",
        "show",
        "leibniz",
        "s",
        "account",
        "modal",
        "concept",
        "translated",
        "standard",
        "possibleworlds",
        "semantics",
        "consider",
        "way",
        "leibniz",
        "distinguishes",
        "necessary",
        "contingent",
        "truth",
        "discourse",
        "metaphysics",
        "one",
        "whose",
        "contrary",
        "implies",
        "contradiction",
        "absolutely",
        "necessary",
        "deduction",
        "occurs",
        "eternal",
        "truth",
        "example",
        "truth",
        "geometry",
        "necessary",
        "ex",
        "hypothesi",
        "speak",
        "accidentally",
        "contingent",
        "since",
        "contrary",
        "imply",
        "contradiction",
        "connection",
        "based",
        "purely",
        "idea",
        "god",
        "s",
        "simple",
        "understanding",
        "free",
        "decree",
        "sequence",
        "universe",
        "vi",
        "iv",
        "ag",
        "slightly",
        "later",
        "discussing",
        "julius",
        "caesar",
        "s",
        "crossing",
        "rubicon",
        "predicate",
        "cross",
        "rubicon",
        "concept",
        "caesar",
        "leibniz",
        "writes",
        "following",
        "found",
        "demonstration",
        "predicate",
        "caesar",
        "absolute",
        "number",
        "geometry",
        "supposes",
        "sequence",
        "thing",
        "god",
        "freely",
        "chosen",
        "sequence",
        "based",
        "god",
        "s",
        "first",
        "free",
        "decree",
        "always",
        "perfect",
        "god",
        "s",
        "decree",
        "respect",
        "human",
        "nature",
        "following",
        "first",
        "decree",
        "man",
        "always",
        "although",
        "freely",
        "appears",
        "best",
        "every",
        "truth",
        "based",
        "kind",
        "decree",
        "contingent",
        "even",
        "though",
        "certain",
        "decree",
        "change",
        "possibility",
        "thing",
        "already",
        "said",
        "even",
        "though",
        "certain",
        "god",
        "always",
        "chooses",
        "best",
        "prevent",
        "something",
        "le",
        "perfect",
        "remaining",
        "possible",
        "even",
        "though",
        "happen",
        "since",
        "impossibility",
        "imperfection",
        "cause",
        "rejected",
        "nothing",
        "necessary",
        "whose",
        "contrary",
        "possible",
        "vi",
        "iv",
        "ag",
        "crucial",
        "idea",
        "proposition",
        "contingently",
        "true",
        "world",
        "somehow",
        "dependent",
        "upon",
        "first",
        "free",
        "decree",
        "god",
        "reason",
        "truth",
        "proposition",
        "located",
        "actualization",
        "particular",
        "world",
        "another",
        "world",
        "w",
        "existing",
        "infinite",
        "library",
        "worldbooks",
        "god",
        "brought",
        "world",
        "w",
        "existence",
        "p",
        "would",
        "false",
        "word",
        "proposition",
        "contingently",
        "true",
        "true",
        "world",
        "false",
        "world",
        "mentioned",
        "however",
        "leibniz",
        "defines",
        "possible",
        "proposition",
        "another",
        "text",
        "period",
        "proposition",
        "never",
        "result",
        "contradiction",
        "analysis",
        "given",
        "account",
        "world",
        "simply",
        "mean",
        "proposition",
        "true",
        "world",
        "since",
        "necessary",
        "truth",
        "dependent",
        "upon",
        "first",
        "free",
        "decree",
        "god",
        "instead",
        "revealed",
        "analysis",
        "identity",
        "fact",
        "proposition",
        "true",
        "possible",
        "world",
        "basic",
        "modal",
        "concept",
        "explained",
        "term",
        "inesse",
        "doctrine",
        "truth",
        "ie",
        "predicateinnotion",
        "principle",
        "notion",
        "infinite",
        "analysis",
        "case",
        "contingency",
        "great",
        "jump",
        "possibleworlds",
        "semantics",
        "probably",
        "surprising",
        "leibniz",
        "s",
        "explication",
        "nature",
        "distinction",
        "necessary",
        "contingent",
        "truth",
        "translated",
        "term",
        "contemporary",
        "possibleworlds",
        "semantics",
        "leibniz",
        "tell",
        "u",
        "freedom",
        "de",
        "libertate",
        "first",
        "came",
        "think",
        "nature",
        "possibilia",
        "term",
        "fictional",
        "world",
        "world",
        "existence",
        "somewhat",
        "tenuous",
        "sense",
        "consideration",
        "possible",
        "brought",
        "back",
        "precipice",
        "spinoza",
        "s",
        "necessitarianism",
        "certain",
        "possible",
        "never",
        "exist",
        "thing",
        "exist",
        "rate",
        "always",
        "necessary",
        "otherwise",
        "would",
        "impossible",
        "others",
        "exist",
        "place",
        "thus",
        "everything",
        "never",
        "exists",
        "would",
        "impossible",
        "vi",
        "iv",
        "ag",
        "later",
        "began",
        "conceive",
        "distinction",
        "necessary",
        "contingent",
        "truth",
        "term",
        "finite",
        "infinite",
        "analysis",
        "end",
        "say",
        "doctrine",
        "infinite",
        "analysis",
        "dependent",
        "upon",
        "doctrine",
        "infinity",
        "possible",
        "world"
    ]
}