{
    "main_text": "The Historical Development of Leibniz’s Physics\n1. The Historical Development of Leibniz’s Physics\n\n\nIn his earliest days, Leibniz read a wide range of works \ndrawn from his father’s considerable library. Later he was formally \neducated at the University of Leipzig (1661–1666), briefly at the \nUniversity of Jena (1663), and finally at the University of Altdorf \n(1666–1667). From these sources, Leibniz gained an early acquaintance\nwith the Aristotelian-Scholastic tradition, as well as a taste of \nneo-platonic themes common in Renaissance humanism. By his own \naccount, he quickly “penetrated far into the territory of the \nScholastics,” and derived “some satisfaction” from \n“Plato too, and Plotinus” (G III 606/L 655). Although he \nconsciously broke with the Scholastic tradition while still quite \nyoung, its doctrines clearly made a lasting impression on him, and \nserved him both as a font of ideas and a readily available target of \ncriticism. Indeed, one can justifiably see many of Leibniz’s mature \ndoctrines as reactions – either positive or negative – to\nthe Scholastic views that he first became acquainted with while still\na student in Germany.\n\n\nAccording to his own recollection, it appears that Leibniz threw \nhimself into the mechanical philosophy sometime around the year \n 1661.[1]\n In a well-known letter to Nicolas Remond, Leibniz – then in the\ntwilight of his years – recounted his early conversion:\n\n\nAfter having finished the trivial \n schools[2],\n I fell upon the moderns, and I recall walking in a grove on the \noutskirts of Leipzig called the Rosental, at the age of fifteen, and \ndeliberating whether to preserve substantial forms or not. Mechanism \nfinally prevailed and led me to apply myself to mathematics. (G III \n606/L 655) \n\n\nAlthough we have no records of Leibniz’s work from the years \nimmediately following his youthful adoption of mechanism, there is \nabundant evidence that by the late 1660s, he had studied the \nwritings of a wide range of mechanistic\n philosophers,[3]\n committed himself to the “hypothesis of the moderns, which \nconceives no incorporeal entities within bodies but assumes nothing \nbeyond magnitude, figure, and \n motion,”[4]\n and had begun to search for ways to improve the \nmechanistic philosophy of his\n predecessors.[5]\n\n\n\nThe early influence of natural philosophers such as Gassendi and \nHobbes – whom Leibniz would later characterize as working in the \nEpicurean tradition – is particularly apparent in his first \npair of systematic works on motion. In the Theoria motus \nabstracti (TMA), dedicated to the French Academy in 1671, \nLeibniz introduces a set of abstract laws of motion (A \nVI.ii.261–276/L 139–142). At the heart of those laws is the Hobbesian\nnotion of conatus, which Leibniz describes as “the beginning \nand end of motion,” and which he seems to conceive of as a \ntendency to motion in a particular direction. Leibniz argues that the\nmotion of a body in isolation is determined entirely by its own \nconatus, and that the motions of colliding bodies are determined \nsolely by the combination of their respective conatuses. In this way,\nLeibniz’s abstract theory of motion assigns no role whatsoever, with \nrespect to the fundamental laws of motion, to the sizes or masses of \nmaterial bodies. According to the TMA, a tiny pebble with a certain \nvelocity striking a large boulder at rest would, under idealized \nconditions, continue to move with the boulder with the same velocity \nthat it had initially. \n\n\nLeibniz, of course, recognized that the laws of motion sketched in \nthe TMA are radically at odds with the testimony of everyday \nexperience. After all, it would seem to be the case that if the world\nwere governed by the laws of the TMA, it should be no more difficult \nto move a planet than a \n pebble.[6]\n Leibniz sought to close this gap between the fundamental laws and \nexperience with the publication of his Hypothesis physica \nnova (HPN) also known as the Theoria motus concreti, \nwhich he also dedicated in 1671, this time to the Royal Society of \nLondon (A.VI.ii.221–257). In the HPN, Leibniz argues that the laws of\nthe TMA yield the Huygens-Wren laws of impact when taken together \nwith the contingent structure of the actual world. Central to \nLeibniz’s strategy is the idea that all bodies in the actual world \nare elastic due to a pervasive aether, and are composed of discrete \nparticles. Although mass continues to play no foundational role in \nhis applied system of physics, Leibniz is cleverly able to argue that\nlarger bodies will generally be more resistant to motion due to the \nlarger number of particles from which they are constituted. A pebble \nstriking a planet will thus fail to have any significant effect \nbecause the pebble’s velocity is propagated to the planet not at a \nsingle blow but particle by particle. Its motion is consequently \ndiluted – and even reversed – as it is repeatedly summed \nwith the velocity of each subsequent particle.\n\n\nIn 1672, Leibniz was sent to Paris as part of a diplomatic mission \nwhere he stayed – short trips aside – for the next four \nyears. His time spent in the intellectually vibrant French capital \nproved crucial to the development of his mature views in physics. \nWhile in Paris, Leibniz gained an expert’s knowledge of the \nmathematics of his time, embarked on an intensive study of Cartesian \nphysics, and made contact with many of the leading natural \nphilosophers of his day. \n\n\nIn such fertile circumstances – which included tutoring by \nHuygens himself and direct access to Descartes’s unpublished \nnotebooks – Leibniz quickly fashioned his own penetrating \ncritique of Cartesian physics. As early as \n 1676,[7]\n he had found what he considered to be a fatal flaw in Descartes’s \ncornerstone conservation law, namely, that it violates the principle \nof the equality of cause and effect. When Leibniz published \nessentially the same objection in his Brief Demonstration of a \nNotable Error of Descartes’s and Others Concerning a Natural Law\nin 1686, it sparked a now famous dispute among natural philosophers \nthat has become known as the vis viva controversy \n(GM VI 117–119/L \n 296–298).[8]\n For Leibniz the argument of the Brief Demonstration marked \nnot only an important event in his understanding of the Cartesian \nsystem, but also a turning point in the development of his own \ndistinctive physics. \n\n\nOn the one hand, the argument of the Brief Demonstration\nforced Leibniz to rethink the foundations of his early theory of\nmotion. For the charge of violating the principle of the equality of\ncause and effect that he leveled against Cartesians spoke as well\nagainst the laws of the TMA and the HPN. The paradoxical result of the\nideal laws of the TMA – that a tiny body moving with a given\nspeed might impart the same speed to a relatively enormous body\n– appeared, at least intuitively, as an example of a potentially\neven greater increase in local force than anything allowed by\nDescartes’s rules of impact. Conversely, according to the\nphenomenal laws of the HPN, since the combination by impact of two\nconatuses can fall short, but never exceed, the strict sum of the\nconatuses of the two individual bodies, the total conatus present in\nthe world must naturally decline over time – another violation\nof the equality principle. In short, in the argument of the Brief\nDemonstration, Leibniz found a devastating criticism not only of\nCartesian physics, but also of Early Leibnizian physics. \n\n\nOn the other hand, Leibniz’s embrace of the principle of the equality\nof cause and effect helped inspire his development of a series of \nambitious positions that would collectively serve as the moorings of \nhis mature physics. The failure of Descartes’s conservation law \nencouraged Leibniz to attach new significance to an alternative \nconservation principle that he had learned from Huygens by 1669 at \nthe \n latest.[9]\n Leibniz came to see that if force is taken to be equivalent to the \nquantity of vis viva – rather than the quantity of \nmotion as Descartes had implied – then, in cases such as those \nhighlighted by the Brief Demonstration, no violation of the \nprinciple of equality of cause and effect need be tolerated. In \nsubsequent works, including his Dynamica de Potentia et Legibus \nNaturae corporea (1689), Essay of Dynamics on the Laws of \nMotion … (1690), and Specimen\nDynamicum (1695), Leibniz attempts to build on this \ndiscovery by suggesting further implications not only for the \nconservation of force, but also for the laws of motion and even the \nfundamental nature of physical bodies. One can see in\nhis devastating critique of the Cartesian conservation law the seeds \nof much of what is distinctive in his own mature physics.\n\n\nAlthough Leibniz continued to refine, develop, and extend his views \non the laws of motion and impact, his work in the philosophy of \nphysics was most famously capped by his correspondence with\nSamuel Clarke [10]\n The controversy between Leibniz and Clarke began when the \nPrincess of Wales passed along to \nClarke in 1715 a letter written by Leibniz decrying the decline of \nreligion in England inspired by the rise of Newton’s natural \nphilosophy. Taking place against the backdrop of a bitter dispute \nover the priority of the calculus, Clarke responded in Newton’s \ndefense and a series of five letters and replies were exchanged. \nAmong the many topics covered in the correspondence, the letters are \nbest known for the opposing views of space and time which they offer:\nLeibniz defending roughly the view that space is an ideal system of \nrelations holding between bodies, and Clarke defending the view that \nspace is something more like a container in which bodies are located \nand move. The increasingly detailed and pointed exchange ended only \nwith Leibniz’s death in 1716, with Clarke, in the historical sense at\nleast, having the last word. \n",
    "section_title": "1. The Historical Development of Leibniz’s Physics",
    "entry_title": "Leibniz’s Philosophy of Physics",
    "hierarchy_title": "Leibniz’s Philosophy of Physics || The Historical Development of Leibniz’s Physics",
    "tokenized_text": [
        "historical",
        "development",
        "leibniz",
        "physic",
        "historical",
        "development",
        "leibniz",
        "physic",
        "earliest",
        "day",
        "leibniz",
        "read",
        "wide",
        "range",
        "work",
        "drawn",
        "father",
        "considerable",
        "library",
        "later",
        "formally",
        "educated",
        "university",
        "leipzig",
        "briefly",
        "university",
        "jena",
        "finally",
        "university",
        "altdorf",
        "source",
        "leibniz",
        "gained",
        "early",
        "acquaintance",
        "aristotelianscholastic",
        "tradition",
        "well",
        "taste",
        "neoplatonic",
        "theme",
        "common",
        "renaissance",
        "humanism",
        "account",
        "quickly",
        "penetrated",
        "far",
        "territory",
        "scholastic",
        "derived",
        "satisfaction",
        "plato",
        "plotinus",
        "g",
        "iii",
        "l",
        "although",
        "consciously",
        "broke",
        "scholastic",
        "tradition",
        "still",
        "quite",
        "young",
        "doctrine",
        "clearly",
        "made",
        "lasting",
        "impression",
        "served",
        "font",
        "idea",
        "readily",
        "available",
        "target",
        "criticism",
        "indeed",
        "one",
        "justifiably",
        "see",
        "many",
        "leibniz",
        "mature",
        "doctrine",
        "reaction",
        "either",
        "positive",
        "negative",
        "scholastic",
        "view",
        "first",
        "became",
        "acquainted",
        "still",
        "student",
        "germany",
        "according",
        "recollection",
        "appears",
        "leibniz",
        "threw",
        "mechanical",
        "philosophy",
        "sometime",
        "around",
        "year",
        "wellknown",
        "letter",
        "nicolas",
        "remond",
        "leibniz",
        "twilight",
        "year",
        "recounted",
        "early",
        "conversion",
        "finished",
        "trivial",
        "school",
        "fell",
        "upon",
        "modern",
        "recall",
        "walking",
        "grove",
        "outskirt",
        "leipzig",
        "called",
        "rosental",
        "age",
        "fifteen",
        "deliberating",
        "whether",
        "preserve",
        "substantial",
        "form",
        "mechanism",
        "finally",
        "prevailed",
        "led",
        "apply",
        "mathematics",
        "g",
        "iii",
        "l",
        "although",
        "record",
        "leibniz",
        "work",
        "year",
        "immediately",
        "following",
        "youthful",
        "adoption",
        "mechanism",
        "abundant",
        "evidence",
        "late",
        "s",
        "studied",
        "writing",
        "wide",
        "range",
        "mechanistic",
        "philosopher",
        "committed",
        "hypothesis",
        "modern",
        "conceives",
        "incorporeal",
        "entity",
        "within",
        "body",
        "assumes",
        "nothing",
        "beyond",
        "magnitude",
        "figure",
        "motion",
        "begun",
        "search",
        "way",
        "improve",
        "mechanistic",
        "philosophy",
        "predecessor",
        "early",
        "influence",
        "natural",
        "philosopher",
        "gassendi",
        "hobbes",
        "leibniz",
        "would",
        "later",
        "characterize",
        "working",
        "epicurean",
        "tradition",
        "particularly",
        "apparent",
        "first",
        "pair",
        "systematic",
        "work",
        "motion",
        "theoria",
        "motus",
        "abstracti",
        "tma",
        "dedicated",
        "french",
        "academy",
        "leibniz",
        "introduces",
        "set",
        "abstract",
        "law",
        "motion",
        "viiil",
        "heart",
        "law",
        "hobbesian",
        "notion",
        "conatus",
        "leibniz",
        "describes",
        "beginning",
        "end",
        "motion",
        "seems",
        "conceive",
        "tendency",
        "motion",
        "particular",
        "direction",
        "leibniz",
        "argues",
        "motion",
        "body",
        "isolation",
        "determined",
        "entirely",
        "conatus",
        "motion",
        "colliding",
        "body",
        "determined",
        "solely",
        "combination",
        "respective",
        "conatuses",
        "way",
        "leibniz",
        "abstract",
        "theory",
        "motion",
        "assigns",
        "role",
        "whatsoever",
        "respect",
        "fundamental",
        "law",
        "motion",
        "size",
        "mass",
        "material",
        "body",
        "according",
        "tma",
        "tiny",
        "pebble",
        "certain",
        "velocity",
        "striking",
        "large",
        "boulder",
        "rest",
        "would",
        "idealized",
        "condition",
        "continue",
        "move",
        "boulder",
        "velocity",
        "initially",
        "leibniz",
        "course",
        "recognized",
        "law",
        "motion",
        "sketched",
        "tma",
        "radically",
        "odds",
        "testimony",
        "everyday",
        "experience",
        "would",
        "seem",
        "case",
        "world",
        "governed",
        "law",
        "tma",
        "difficult",
        "move",
        "planet",
        "pebble",
        "leibniz",
        "sought",
        "close",
        "gap",
        "fundamental",
        "law",
        "experience",
        "publication",
        "hypothesis",
        "physica",
        "nova",
        "hpn",
        "also",
        "known",
        "theoria",
        "motus",
        "concreti",
        "also",
        "dedicated",
        "time",
        "royal",
        "society",
        "london",
        "aviii",
        "hpn",
        "leibniz",
        "argues",
        "law",
        "tma",
        "yield",
        "huygenswren",
        "law",
        "impact",
        "taken",
        "together",
        "contingent",
        "structure",
        "actual",
        "world",
        "central",
        "leibniz",
        "strategy",
        "idea",
        "body",
        "actual",
        "world",
        "elastic",
        "due",
        "pervasive",
        "aether",
        "composed",
        "discrete",
        "particle",
        "although",
        "mass",
        "continues",
        "play",
        "foundational",
        "role",
        "applied",
        "system",
        "physic",
        "leibniz",
        "cleverly",
        "able",
        "argue",
        "larger",
        "body",
        "generally",
        "resistant",
        "motion",
        "due",
        "larger",
        "number",
        "particle",
        "constituted",
        "pebble",
        "striking",
        "planet",
        "thus",
        "fail",
        "significant",
        "effect",
        "pebble",
        "velocity",
        "propagated",
        "planet",
        "single",
        "blow",
        "particle",
        "particle",
        "motion",
        "consequently",
        "diluted",
        "even",
        "reversed",
        "repeatedly",
        "summed",
        "velocity",
        "subsequent",
        "particle",
        "leibniz",
        "sent",
        "paris",
        "part",
        "diplomatic",
        "mission",
        "stayed",
        "short",
        "trip",
        "aside",
        "next",
        "four",
        "year",
        "time",
        "spent",
        "intellectually",
        "vibrant",
        "french",
        "capital",
        "proved",
        "crucial",
        "development",
        "mature",
        "view",
        "physic",
        "paris",
        "leibniz",
        "gained",
        "expert",
        "knowledge",
        "mathematics",
        "time",
        "embarked",
        "intensive",
        "study",
        "cartesian",
        "physic",
        "made",
        "contact",
        "many",
        "leading",
        "natural",
        "philosopher",
        "day",
        "fertile",
        "circumstance",
        "included",
        "tutoring",
        "huygens",
        "direct",
        "access",
        "descartes",
        "unpublished",
        "notebook",
        "leibniz",
        "quickly",
        "fashioned",
        "penetrating",
        "critique",
        "cartesian",
        "physic",
        "early",
        "found",
        "considered",
        "fatal",
        "flaw",
        "descartes",
        "cornerstone",
        "conservation",
        "law",
        "namely",
        "violates",
        "principle",
        "equality",
        "cause",
        "effect",
        "leibniz",
        "published",
        "essentially",
        "objection",
        "brief",
        "demonstration",
        "notable",
        "error",
        "descartes",
        "others",
        "concerning",
        "natural",
        "law",
        "sparked",
        "famous",
        "dispute",
        "among",
        "natural",
        "philosopher",
        "become",
        "known",
        "vi",
        "viva",
        "controversy",
        "gm",
        "vi",
        "l",
        "leibniz",
        "argument",
        "brief",
        "demonstration",
        "marked",
        "important",
        "event",
        "understanding",
        "cartesian",
        "system",
        "also",
        "turning",
        "point",
        "development",
        "distinctive",
        "physic",
        "one",
        "hand",
        "argument",
        "brief",
        "demonstration",
        "forced",
        "leibniz",
        "rethink",
        "foundation",
        "early",
        "theory",
        "motion",
        "charge",
        "violating",
        "principle",
        "equality",
        "cause",
        "effect",
        "leveled",
        "cartesian",
        "spoke",
        "well",
        "law",
        "tma",
        "hpn",
        "paradoxical",
        "result",
        "ideal",
        "law",
        "tma",
        "tiny",
        "body",
        "moving",
        "given",
        "speed",
        "might",
        "impart",
        "speed",
        "relatively",
        "enormous",
        "body",
        "appeared",
        "least",
        "intuitively",
        "example",
        "potentially",
        "even",
        "greater",
        "increase",
        "local",
        "force",
        "anything",
        "allowed",
        "descartes",
        "rule",
        "impact",
        "conversely",
        "according",
        "phenomenal",
        "law",
        "hpn",
        "since",
        "combination",
        "impact",
        "two",
        "conatuses",
        "fall",
        "short",
        "never",
        "exceed",
        "strict",
        "sum",
        "conatuses",
        "two",
        "individual",
        "body",
        "total",
        "conatus",
        "present",
        "world",
        "must",
        "naturally",
        "decline",
        "time",
        "another",
        "violation",
        "equality",
        "principle",
        "short",
        "argument",
        "brief",
        "demonstration",
        "leibniz",
        "found",
        "devastating",
        "criticism",
        "cartesian",
        "physic",
        "also",
        "early",
        "leibnizian",
        "physic",
        "hand",
        "leibniz",
        "embrace",
        "principle",
        "equality",
        "cause",
        "effect",
        "helped",
        "inspire",
        "development",
        "series",
        "ambitious",
        "position",
        "would",
        "collectively",
        "serve",
        "mooring",
        "mature",
        "physic",
        "failure",
        "descartes",
        "conservation",
        "law",
        "encouraged",
        "leibniz",
        "attach",
        "new",
        "significance",
        "alternative",
        "conservation",
        "principle",
        "learned",
        "huygens",
        "latest",
        "leibniz",
        "came",
        "see",
        "force",
        "taken",
        "equivalent",
        "quantity",
        "vi",
        "viva",
        "rather",
        "quantity",
        "motion",
        "descartes",
        "implied",
        "case",
        "highlighted",
        "brief",
        "demonstration",
        "violation",
        "principle",
        "equality",
        "cause",
        "effect",
        "need",
        "tolerated",
        "subsequent",
        "work",
        "including",
        "dynamica",
        "de",
        "potentia",
        "et",
        "legibus",
        "naturae",
        "corporea",
        "essay",
        "dynamic",
        "law",
        "motion",
        "specimen",
        "dynamicum",
        "leibniz",
        "attempt",
        "build",
        "discovery",
        "suggesting",
        "implication",
        "conservation",
        "force",
        "also",
        "law",
        "motion",
        "even",
        "fundamental",
        "nature",
        "physical",
        "body",
        "one",
        "see",
        "devastating",
        "critique",
        "cartesian",
        "conservation",
        "law",
        "seed",
        "much",
        "distinctive",
        "mature",
        "physic",
        "although",
        "leibniz",
        "continued",
        "refine",
        "develop",
        "extend",
        "view",
        "law",
        "motion",
        "impact",
        "work",
        "philosophy",
        "physic",
        "famously",
        "capped",
        "correspondence",
        "samuel",
        "clarke",
        "controversy",
        "leibniz",
        "clarke",
        "began",
        "princess",
        "wale",
        "passed",
        "along",
        "clarke",
        "letter",
        "written",
        "leibniz",
        "decrying",
        "decline",
        "religion",
        "england",
        "inspired",
        "rise",
        "newton",
        "natural",
        "philosophy",
        "taking",
        "place",
        "backdrop",
        "bitter",
        "dispute",
        "priority",
        "calculus",
        "clarke",
        "responded",
        "newton",
        "defense",
        "series",
        "five",
        "letter",
        "reply",
        "exchanged",
        "among",
        "many",
        "topic",
        "covered",
        "correspondence",
        "letter",
        "best",
        "known",
        "opposing",
        "view",
        "space",
        "time",
        "offer",
        "leibniz",
        "defending",
        "roughly",
        "view",
        "space",
        "ideal",
        "system",
        "relation",
        "holding",
        "body",
        "clarke",
        "defending",
        "view",
        "space",
        "something",
        "like",
        "container",
        "body",
        "located",
        "move",
        "increasingly",
        "detailed",
        "pointed",
        "exchange",
        "ended",
        "leibniz",
        "death",
        "clarke",
        "historical",
        "sense",
        "least",
        "last",
        "word"
    ]
}