{
    "main_text": "Matter and Thought\n1. Matter and Thought\n\nFor present purposes, we may think of materialism as the view that\neverything that exists is material (or physical) with this view\nclosely allied to another, namely, that mental states and processes\nare either identical to, or realized by, physical states and\nprocesses. Leibniz remained opposed to materialism throughout his\ncareer, particularly as it figured in the writings of Epicurus and\nHobbes. The realms of the mental and the physical, for Leibniz, form\ntwo distinct realms—but not in a way conducive to dualism or the\nview that there exists both thinking substance and extended substance.\nBy opposing both materialism and dualism, Leibniz carved himself an\ninteresting place in the history of views concerning the relationship\nbetween thought and matter.\n\nMost of Leibniz’s arguments against materialism are directly\naimed at the thesis that perception and consciousness can be given\nmechanical (i.e. physical) explanations. His position is that\nperception and consciousness cannot possibly be explained\nmechanically, and, hence, could not be physical processes. His most\nfamous argument against the possibility of materialism is found in\nsection 17 of the Monadology (1714):\n\nOne is obliged to admit that perception and what depends upon\nit is inexplicable on mechanical principles, that is, by\nfigures and motions. In imagining that there is a machine whose\nconstruction would enable it to think, to sense, and to have\nperception, one could conceive it enlarged while retaining the same\nproportions, so that one could enter into it, just like into a\nwindmill. Supposing this, one should, when visiting within it, find\nonly parts pushing one another, and never anything by which to explain\na perception. Thus it is in the simple substance, and not in the\ncomposite or in the machine, that one must look for perception. (G VI,\n609/A&G 215)\n\n\nLeibniz’s argument seems to be this: the visitor of the machine,\nupon entering it, would observe nothing but the properties of the\nparts and the relations they bear to one another. But no explanation\nof perception or consciousness can possibly be deduced from this\nconglomerate. No matter how complex the inner workings of this\nmachine, nothing about them reveals that what is being observed are\nthe inner workings of a conscious being. Hence, materialism must be\nfalse, for there is no possible way that the purely mechanical\nprinciples of materialism can account for the phenomena of\nconsciousness. (For detailed discussion of this argument, see Lodge\nand Bobro 1998; Lodge 2014.)\n\nIn other writings, Leibniz suggests exactly what characteristic it is\nof perception and consciousness for which the mechanical principles of\nmaterialism cannot account. The following passages, the first from the\nNew System of Nature (1695), the second from the Reply to\nBayle (1702), are revealing in this regard:\n\nFurthermore, by means of the soul or form, there is a true unity which\ncorresponds to what is called the I in us; such a thing could\nnot occur in artificial machines, nor in the simple mass of matter,\nhowever organized it may be. (G IV, 482/W&F 16)\n\n\nBut in addition to the general principles which establish the monads\nof which compound things are merely the results, internal experience\nrefutes the Epicurean [i.e. materialist] doctrine. This experience is\nthe consciousness which is in us of this I which apperceives\nthings which occur in the body. This perception cannot be explained by\nfigures and movements. (G IV, 559f./W&F 113)\n\n\nLeibniz’s point is that whatever is the subject of perception\nand consciousness must be truly one, a single “I” properly\nregarded as one conscious being. An aggregate of matter is\nnot truly one and so cannot be regarded as a single I capable\nof being the subject of a unified mental life. This interpretation\nfits nicely with Lebniz’s oft-repeated definition of perception\nas “the representation in the simple of the compound, or of that\nwhich is outside” (Principles of Nature and Grace,\nsec.2 (1714)). More explicitly, in a letter to Antoine Arnauld of 9\nOctober 1687, Leibniz wrote that “in natural perception and\nsensation, it is enough for what is divisible and material and\ndispersed into many entities to be expressed or represented in a\nsingle indivisible entity or in a substance which is endowed with\ngenuine unity.” If perception (and hence, consciousness)\nessentially involves a representation of a variety of content in a\nsimple, indivisible “I,” then we may construct\nLeibniz’s argument against materialism as follows: Materialism\nholds that matter can explain (is identical with, can give rise to)\nperception. A perception is a state whereby a variety of content is\nrepresented in a true unity. Thus, whatever is not a true unity cannot\ngive rise to perception. Whatever is divisible is not a true unity.\nMatter is infinitely divisible. Hence, matter cannot form a true\nunity. Hence, matter cannot explain (be identical with, give rise to)\nperception. If matter cannot explain (be identical to, give rise to)\nperception, then materialism is false. Hence, materialism is\nfalse.\n\nLeibniz rejected materialism on the grounds that it could not, in\nprinciple, ever capture the “true unity” of perceptual\nconsciousness, that characteristic of the self which can\nsimultaneously unify a manifoldness of perceptual content. If this is\nLeibniz’s argument, it is of some historical interest that it\nbears striking resemblances to contemporary objections to certain\nmaterialist theories of mind. Many contemporary philosophers have\nobjected to some versions of materialism on the basis of thought\nexperiments similar to Leibniz’s, experiments designed to show\nthat qualia and consciousness are bound to elude certain materialist\nconceptions of the mind (cf. Searle 1980; Nagel 1974; McGinn 1989;\nJackson 1982). It is also of historical interest that Leibniz coupled\nhis rejection of materialism with a version of naturalism (or what\nhe would have regarded as naturalism - see Jorgensen 2019).\n\nLeibniz’s rejection of materialist conceptions of the mind was\ncoupled with a strong opposition to dualistic views concerning the\nrelationship between mind and body, particularly the substance dualism\nthat figured in the philosophy of Descartes and his followers.\nAccording to this dualism, the world fundamentally consists of two\ndisparate substances: extended material substance (body) and\nunextended thinking substance (mind). This bifurcation, of course,\ncarries no burden of holding that the operations of the mental are\nrealized by the operations of the physical. But despite his claim that\nconsciousness and perception cannot be realized by, nor reduced to,\nthe mechanical operations of matter, Leibniz found the alternative of\npostulating two distinct kinds of substance equally implausible.\n\nLeibniz’s opposition to Cartesian dualism stems not from a\nrejection of unextended substance, but from his denial of the\nexistence of genuine extended material substance. To begin with,\nLeibniz held the Scholastic thesis that “being” and\n“one” are equivalent. He writes to Arnauld: “To be\nbrief, I hold as axiomatic the identical proposition which varies only\nin emphasis: that what is not truly one being is not truly\none being either” (30 April 1687; G II, 97/LA 121). For\nLeibniz, in order for something to count as a real being—a\nsubstance—it must be “truly one,” an entity endowed\nwith genuine unity. And, as we saw above, in order for something to be\na genuine unity, it must be a simple, indivisible entity.\n“Substantial unity,” he writes, “requires a\ncomplete, indivisible and naturally indestructible entity” (to\nArnauld, 28 November 1686; G II, 76/LA 94). But matter is extended,\nand thus, Leibniz believes, infinitely divisible. Hence, there is no\nsuch thing, for Leibniz, as material substance.\n\nThere is a positive thesis which goes hand-in-hand with\nLeibniz’s negative thesis against material substance and which\nhelps to explain further his rejection of material substance. It is\nsummarized in the following passage from a letter to Arnauld of 30\nApril 1687:\n\nI believe that where there are only beings through aggregation,\nthere will not even be real beings. For every being through\naggregation presupposes beings endowed with a true unity, because it\nobtains its reality from nowhere but that of its constituents, so that\nit will have no reality at all if each constituent being is still an\nentity through aggregation; or else, one must yet seek another basis\nto its reality, which in this way, if one must constantly go on\nsearching, can never be found…. If there are aggregates of\nsubstances, there must also be genuine substances from which all the\naggregates result. One must therefore necessarily arrive either at\nmathematical points from which certain authors make up extension, or\nat Epicurus’ and M. Cordemoy’s atoms (which you, like me,\ndismiss), or else one must acknowledge that no reality can be found in\nbodies, or finally one must recognize certain substances in them that\npossess a true unity. (G II, 96/LA 120)\n\n\nAccording to Leibniz, bodies (qua material) are aggregates, and an\naggregate, of course, is not a substance on account of its lack of\nunity. The claim in the above passage is that whatever being or\nreality an aggregate has derives from the being and reality of its\nconstituents. Thus, Leibniz thinks that if a body is to have any\nreality at all, if it is to be more than a mere “phenomenon,\nlacking all reality as would a coherent dream,” then it must\nultimately be composed of things which are real beings. Atoms, he\nclaims, are unfit for this role, because they are themselves extended\nbeings, and for Leibniz, divisibility is of the essence of extension.\nThat is, those who believe in indivisible atoms make matter\n“divisible in one place, indivisible in another” (On\nNature Itself (1698); G IV, 513/A&G 165), but “we\ncannot explain why bodies of a definite smallness [i.e. atoms] should\nnot be further divisible” (Primary Truths (1686); C\n522/A&G 34). Every extended mass, for Leibniz, is composed of\nextended parts, and so even if we could conceive of an atom as\ncomposed of parts which cannot be physically divided, “an\ninvincible attachment of one part to another would not at all destroy\nthe diversity of these parts” (New System of Nature,\n(1695); G IV, 482/W&F 16), or it would not at all overcome the\nfact that it is an aggregate composed of parts and not truly one\nbeing. Likewise, mathematical points, “even an infinity of\npoints gathered into one, will not make extension,” (to Des\nBosses, 30 April 1709; G II, 370/L 597) and so cannot be understood as\nthe constituents of extended bodies. Hence, Leibniz opts for the last\nof the above quoted alternatives: the constituents of bodies are\n“certain substances … that possess a true unity.”\nThese substances are partless, unextended, and indivisible, and\ntherefore real beings in Leibniz’s sense. Indeed, in several\nwritings, Leibniz invites us to conceive of these substances on the\nmodel of our notion of souls. These simple substances are the only\nthings which suffice for grounding the reality of bodies. To be sure,\nsubstances, Leibniz tells us, do not constitute a body as parts of the\nbody, but as the “first elements,” or “primitive\nunities,” of the body. As he sometimes puts it, bodies\n“result from” these constitutive unities. That is, bodies\njust are aggregates of substances which appear to us as\nextended corporeal phenomena, though they are\n“well-founded” phenomena; they have their foundation in\nreal beings.\n\nIn short, Leibniz stands in a special position with respect to the\nhistory of views concerning thought and its relationship to matter. He\nrejects the materialist position that thought and consciousness can be\ncaptured by purely mechanical principles. But he also rejects the\ndualist position that the universe must therefore be bifurcated into\ntwo different kinds of substance, thinking substance and material\nsubstance. Rather, it is his view that the world consists solely of\none type of substance, though there are infinitely many\nsubstances of that type. These substances are partless, unextended\nentities, some of which are endowed with thought and consciousness,\nand others of which found the phenomenality of the corporeal world.\nThe sum of these views secures Leibniz a distinctive position in the\nhistory of the philosophy of mind.\n",
    "section_title": "1. Matter and Thought",
    "entry_title": "Leibniz’s Philosophy of Mind",
    "hierarchy_title": "Leibniz’s Philosophy of Mind || Matter and Thought",
    "tokenized_text": [
        "matter",
        "thought",
        "matter",
        "thought",
        "present",
        "purpose",
        "may",
        "think",
        "materialism",
        "view",
        "everything",
        "exists",
        "material",
        "physical",
        "view",
        "closely",
        "allied",
        "another",
        "namely",
        "mental",
        "state",
        "process",
        "either",
        "identical",
        "realized",
        "physical",
        "state",
        "process",
        "leibniz",
        "remained",
        "opposed",
        "materialism",
        "throughout",
        "career",
        "particularly",
        "figured",
        "writing",
        "epicurus",
        "hobbes",
        "realm",
        "mental",
        "physical",
        "leibniz",
        "form",
        "two",
        "distinct",
        "realmsbut",
        "way",
        "conducive",
        "dualism",
        "view",
        "exists",
        "thinking",
        "substance",
        "extended",
        "substance",
        "opposing",
        "materialism",
        "dualism",
        "leibniz",
        "carved",
        "interesting",
        "place",
        "history",
        "view",
        "concerning",
        "relationship",
        "thought",
        "matter",
        "leibniz",
        "argument",
        "materialism",
        "directly",
        "aimed",
        "thesis",
        "perception",
        "consciousness",
        "given",
        "mechanical",
        "ie",
        "physical",
        "explanation",
        "position",
        "perception",
        "consciousness",
        "possibly",
        "explained",
        "mechanically",
        "hence",
        "could",
        "physical",
        "process",
        "famous",
        "argument",
        "possibility",
        "materialism",
        "found",
        "section",
        "monadology",
        "one",
        "obliged",
        "admit",
        "perception",
        "depends",
        "upon",
        "inexplicable",
        "mechanical",
        "principle",
        "figure",
        "motion",
        "imagining",
        "machine",
        "whose",
        "construction",
        "would",
        "enable",
        "think",
        "sense",
        "perception",
        "one",
        "could",
        "conceive",
        "enlarged",
        "retaining",
        "proportion",
        "one",
        "could",
        "enter",
        "like",
        "windmill",
        "supposing",
        "one",
        "visiting",
        "within",
        "find",
        "part",
        "pushing",
        "one",
        "another",
        "never",
        "anything",
        "explain",
        "perception",
        "thus",
        "simple",
        "substance",
        "composite",
        "machine",
        "one",
        "must",
        "look",
        "perception",
        "g",
        "vi",
        "a",
        "g",
        "leibniz",
        "argument",
        "seems",
        "visitor",
        "machine",
        "upon",
        "entering",
        "would",
        "observe",
        "nothing",
        "property",
        "part",
        "relation",
        "bear",
        "one",
        "another",
        "explanation",
        "perception",
        "consciousness",
        "possibly",
        "deduced",
        "conglomerate",
        "matter",
        "complex",
        "inner",
        "working",
        "machine",
        "nothing",
        "reveals",
        "observed",
        "inner",
        "working",
        "conscious",
        "hence",
        "materialism",
        "must",
        "false",
        "possible",
        "way",
        "purely",
        "mechanical",
        "principle",
        "materialism",
        "account",
        "phenomenon",
        "consciousness",
        "detailed",
        "discussion",
        "argument",
        "see",
        "lodge",
        "bobro",
        "lodge",
        "writing",
        "leibniz",
        "suggests",
        "exactly",
        "characteristic",
        "perception",
        "consciousness",
        "mechanical",
        "principle",
        "materialism",
        "account",
        "following",
        "passage",
        "first",
        "new",
        "system",
        "nature",
        "second",
        "reply",
        "bayle",
        "revealing",
        "regard",
        "furthermore",
        "mean",
        "soul",
        "form",
        "true",
        "unity",
        "corresponds",
        "called",
        "u",
        "thing",
        "could",
        "occur",
        "artificial",
        "machine",
        "simple",
        "mass",
        "matter",
        "however",
        "organized",
        "may",
        "g",
        "iv",
        "w",
        "f",
        "addition",
        "general",
        "principle",
        "establish",
        "monad",
        "compound",
        "thing",
        "merely",
        "result",
        "internal",
        "experience",
        "refutes",
        "epicurean",
        "ie",
        "materialist",
        "doctrine",
        "experience",
        "consciousness",
        "u",
        "apperceives",
        "thing",
        "occur",
        "body",
        "perception",
        "explained",
        "figure",
        "movement",
        "g",
        "iv",
        "fw",
        "f",
        "leibniz",
        "point",
        "whatever",
        "subject",
        "perception",
        "consciousness",
        "must",
        "truly",
        "one",
        "single",
        "properly",
        "regarded",
        "one",
        "conscious",
        "aggregate",
        "matter",
        "truly",
        "one",
        "regarded",
        "single",
        "capable",
        "subject",
        "unified",
        "mental",
        "life",
        "interpretation",
        "fit",
        "nicely",
        "lebniz",
        "oftrepeated",
        "definition",
        "perception",
        "representation",
        "simple",
        "compound",
        "outside",
        "principle",
        "nature",
        "grace",
        "sec",
        "explicitly",
        "letter",
        "antoine",
        "arnauld",
        "october",
        "leibniz",
        "wrote",
        "natural",
        "perception",
        "sensation",
        "enough",
        "divisible",
        "material",
        "dispersed",
        "many",
        "entity",
        "expressed",
        "represented",
        "single",
        "indivisible",
        "entity",
        "substance",
        "endowed",
        "genuine",
        "unity",
        "perception",
        "hence",
        "consciousness",
        "essentially",
        "involves",
        "representation",
        "variety",
        "content",
        "simple",
        "indivisible",
        "may",
        "construct",
        "leibniz",
        "argument",
        "materialism",
        "follows",
        "materialism",
        "hold",
        "matter",
        "explain",
        "identical",
        "give",
        "rise",
        "perception",
        "perception",
        "state",
        "whereby",
        "variety",
        "content",
        "represented",
        "true",
        "unity",
        "thus",
        "whatever",
        "true",
        "unity",
        "give",
        "rise",
        "perception",
        "whatever",
        "divisible",
        "true",
        "unity",
        "matter",
        "infinitely",
        "divisible",
        "hence",
        "matter",
        "form",
        "true",
        "unity",
        "hence",
        "matter",
        "explain",
        "identical",
        "give",
        "rise",
        "perception",
        "matter",
        "explain",
        "identical",
        "give",
        "rise",
        "perception",
        "materialism",
        "false",
        "hence",
        "materialism",
        "false",
        "leibniz",
        "rejected",
        "materialism",
        "ground",
        "could",
        "principle",
        "ever",
        "capture",
        "true",
        "unity",
        "perceptual",
        "consciousness",
        "characteristic",
        "self",
        "simultaneously",
        "unify",
        "manifoldness",
        "perceptual",
        "content",
        "leibniz",
        "argument",
        "historical",
        "interest",
        "bear",
        "striking",
        "resemblance",
        "contemporary",
        "objection",
        "certain",
        "materialist",
        "theory",
        "mind",
        "many",
        "contemporary",
        "philosopher",
        "objected",
        "version",
        "materialism",
        "basis",
        "thought",
        "experiment",
        "similar",
        "leibniz",
        "experiment",
        "designed",
        "show",
        "qualia",
        "consciousness",
        "bound",
        "elude",
        "certain",
        "materialist",
        "conception",
        "mind",
        "cf",
        "searle",
        "nagel",
        "mcginn",
        "jackson",
        "also",
        "historical",
        "interest",
        "leibniz",
        "coupled",
        "rejection",
        "materialism",
        "version",
        "naturalism",
        "would",
        "regarded",
        "naturalism",
        "see",
        "jorgensen",
        "leibniz",
        "rejection",
        "materialist",
        "conception",
        "mind",
        "coupled",
        "strong",
        "opposition",
        "dualistic",
        "view",
        "concerning",
        "relationship",
        "mind",
        "body",
        "particularly",
        "substance",
        "dualism",
        "figured",
        "philosophy",
        "descartes",
        "follower",
        "according",
        "dualism",
        "world",
        "fundamentally",
        "consists",
        "two",
        "disparate",
        "substance",
        "extended",
        "material",
        "substance",
        "body",
        "unextended",
        "thinking",
        "substance",
        "mind",
        "bifurcation",
        "course",
        "carry",
        "burden",
        "holding",
        "operation",
        "mental",
        "realized",
        "operation",
        "physical",
        "despite",
        "claim",
        "consciousness",
        "perception",
        "realized",
        "reduced",
        "mechanical",
        "operation",
        "matter",
        "leibniz",
        "found",
        "alternative",
        "postulating",
        "two",
        "distinct",
        "kind",
        "substance",
        "equally",
        "implausible",
        "leibniz",
        "opposition",
        "cartesian",
        "dualism",
        "stem",
        "rejection",
        "unextended",
        "substance",
        "denial",
        "existence",
        "genuine",
        "extended",
        "material",
        "substance",
        "begin",
        "leibniz",
        "held",
        "scholastic",
        "thesis",
        "one",
        "equivalent",
        "writes",
        "arnauld",
        "brief",
        "hold",
        "axiomatic",
        "identical",
        "proposition",
        "varies",
        "emphasis",
        "truly",
        "one",
        "truly",
        "one",
        "either",
        "april",
        "g",
        "ii",
        "la",
        "leibniz",
        "order",
        "something",
        "count",
        "real",
        "beinga",
        "substanceit",
        "must",
        "truly",
        "one",
        "entity",
        "endowed",
        "genuine",
        "unity",
        "saw",
        "order",
        "something",
        "genuine",
        "unity",
        "must",
        "simple",
        "indivisible",
        "entity",
        "substantial",
        "unity",
        "writes",
        "requires",
        "complete",
        "indivisible",
        "naturally",
        "indestructible",
        "entity",
        "arnauld",
        "november",
        "g",
        "ii",
        "la",
        "matter",
        "extended",
        "thus",
        "leibniz",
        "belief",
        "infinitely",
        "divisible",
        "hence",
        "thing",
        "leibniz",
        "material",
        "substance",
        "positive",
        "thesis",
        "go",
        "handinhand",
        "leibniz",
        "negative",
        "thesis",
        "material",
        "substance",
        "help",
        "explain",
        "rejection",
        "material",
        "substance",
        "summarized",
        "following",
        "passage",
        "letter",
        "arnauld",
        "april",
        "believe",
        "being",
        "aggregation",
        "even",
        "real",
        "being",
        "every",
        "aggregation",
        "presupposes",
        "being",
        "endowed",
        "true",
        "unity",
        "obtains",
        "reality",
        "nowhere",
        "constituent",
        "reality",
        "constituent",
        "still",
        "entity",
        "aggregation",
        "else",
        "one",
        "must",
        "yet",
        "seek",
        "another",
        "basis",
        "reality",
        "way",
        "one",
        "must",
        "constantly",
        "go",
        "searching",
        "never",
        "found",
        "aggregate",
        "substance",
        "must",
        "also",
        "genuine",
        "substance",
        "aggregate",
        "result",
        "one",
        "must",
        "therefore",
        "necessarily",
        "arrive",
        "either",
        "mathematical",
        "point",
        "certain",
        "author",
        "make",
        "extension",
        "epicurus",
        "m",
        "cordemoy",
        "atom",
        "like",
        "dismiss",
        "else",
        "one",
        "must",
        "acknowledge",
        "reality",
        "found",
        "body",
        "finally",
        "one",
        "must",
        "recognize",
        "certain",
        "substance",
        "posse",
        "true",
        "unity",
        "g",
        "ii",
        "la",
        "according",
        "leibniz",
        "body",
        "qua",
        "material",
        "aggregate",
        "aggregate",
        "course",
        "substance",
        "account",
        "lack",
        "unity",
        "claim",
        "passage",
        "whatever",
        "reality",
        "aggregate",
        "derives",
        "reality",
        "constituent",
        "thus",
        "leibniz",
        "think",
        "body",
        "reality",
        "mere",
        "phenomenon",
        "lacking",
        "reality",
        "would",
        "coherent",
        "dream",
        "must",
        "ultimately",
        "composed",
        "thing",
        "real",
        "being",
        "atom",
        "claim",
        "unfit",
        "role",
        "extended",
        "being",
        "leibniz",
        "divisibility",
        "essence",
        "extension",
        "believe",
        "indivisible",
        "atom",
        "make",
        "matter",
        "divisible",
        "one",
        "place",
        "indivisible",
        "another",
        "nature",
        "g",
        "iv",
        "a",
        "g",
        "explain",
        "body",
        "definite",
        "smallness",
        "ie",
        "atom",
        "divisible",
        "primary",
        "truth",
        "c",
        "a",
        "g",
        "every",
        "extended",
        "mass",
        "leibniz",
        "composed",
        "extended",
        "part",
        "even",
        "could",
        "conceive",
        "atom",
        "composed",
        "part",
        "physically",
        "divided",
        "invincible",
        "attachment",
        "one",
        "part",
        "another",
        "would",
        "destroy",
        "diversity",
        "part",
        "new",
        "system",
        "nature",
        "g",
        "iv",
        "w",
        "f",
        "would",
        "overcome",
        "fact",
        "aggregate",
        "composed",
        "part",
        "truly",
        "one",
        "likewise",
        "mathematical",
        "point",
        "even",
        "infinity",
        "point",
        "gathered",
        "one",
        "make",
        "extension",
        "de",
        "boss",
        "april",
        "g",
        "ii",
        "l",
        "understood",
        "constituent",
        "extended",
        "body",
        "hence",
        "leibniz",
        "opts",
        "last",
        "quoted",
        "alternative",
        "constituent",
        "body",
        "certain",
        "substance",
        "posse",
        "true",
        "unity",
        "substance",
        "partless",
        "unextended",
        "indivisible",
        "therefore",
        "real",
        "being",
        "leibniz",
        "sense",
        "indeed",
        "several",
        "writing",
        "leibniz",
        "invite",
        "u",
        "conceive",
        "substance",
        "model",
        "notion",
        "soul",
        "simple",
        "substance",
        "thing",
        "suffice",
        "grounding",
        "reality",
        "body",
        "sure",
        "substance",
        "leibniz",
        "tell",
        "u",
        "constitute",
        "body",
        "part",
        "body",
        "first",
        "element",
        "primitive",
        "unity",
        "body",
        "sometimes",
        "put",
        "body",
        "result",
        "constitutive",
        "unity",
        "body",
        "aggregate",
        "substance",
        "appear",
        "u",
        "extended",
        "corporeal",
        "phenomenon",
        "though",
        "wellfounded",
        "phenomenon",
        "foundation",
        "real",
        "being",
        "short",
        "leibniz",
        "stand",
        "special",
        "position",
        "respect",
        "history",
        "view",
        "concerning",
        "thought",
        "relationship",
        "matter",
        "reject",
        "materialist",
        "position",
        "thought",
        "consciousness",
        "captured",
        "purely",
        "mechanical",
        "principle",
        "also",
        "reject",
        "dualist",
        "position",
        "universe",
        "must",
        "therefore",
        "bifurcated",
        "two",
        "different",
        "kind",
        "substance",
        "thinking",
        "substance",
        "material",
        "substance",
        "rather",
        "view",
        "world",
        "consists",
        "solely",
        "one",
        "type",
        "substance",
        "though",
        "infinitely",
        "many",
        "substance",
        "type",
        "substance",
        "partless",
        "unextended",
        "entity",
        "endowed",
        "thought",
        "consciousness",
        "others",
        "found",
        "phenomenality",
        "corporeal",
        "world",
        "sum",
        "view",
        "secures",
        "leibniz",
        "distinctive",
        "position",
        "history",
        "philosophy",
        "mind"
    ]
}