{
    "main_text": "Selective Omission in Leibniz’s Système Nouveau\n5. Selective Omission in Leibniz’s Système Nouveau\n\nLeibniz first presented his philosophy to the public in an essay\ntitled “Système nouveau de la nature et de la\ncommunication des substances, aussi bien que de l’union\nqu’il y a entre l’âme et le corps”\n(New system of the nature and communication of substances, and of\nthe union of the soul and body). This essay was published in 1695\nin the Journal des savants. If one were to read this essay in\nisolation from Leibniz’s other writings (as would have been the\ncase with most of his readers) one would likely have no idea that it\nis an exoteric text. He prefaces the essay in the following way:\n\n\nFinally, since some important persons have desired to see my opinions\nfurther clarified, I have risked publishing these meditations, even\nthough they are not at all popular [populaires], nor can they\nbe appreciated by all sorts of minds. I have decided upon this mainly\nto profit from the judgments of persons enlightened in these matters,\nsince it would be too troublesome to seek out and call individually\nupon all those who would be disposed to give me\ninstruction—which I shall always be glad to receive, provided\nthat it contains the love of truth, rather than a passion for\npreconceived opinions. (G 4:477; AG 138)\n\n\nNote that Leibniz claims that his meditations are “not at all\npopular” and that many people will not be able to appreciate\nthem. These remarks, in conjunction with the comment on preconceived\nopinions, are designed to encourage the reader to seriously consider\nthe views that he will be presenting despite the fact that they will\nbe difficult to understand and will likely diverge—perhaps\nsignificantly—from the reader’s current beliefs. What\nLeibniz leaves unsaid, however, is that the Système\nnouveau is written according to the exoteric mode of\npresentation. First, the essay is clearly not written in accordance\nwith the formal apparatus of definitions and demonstrations that is\nrequired in a strictly esoteric presentation. Second, and perhaps more\nsignificantly, Leibniz purposefully omits some of the most\ncontroversial features of his philosophical system in this essay.\n\nIn order to more fully appreciate the exoteric features of the\nSystème nouveau it will be helpful to consider this\ntext in relation to Leibniz’s earlier Discours de\nmétaphysique (Discourse on Metaphysics). Leibniz\nwrote the Discours in 1686. Although it was not published\nduring his lifetime, this text has become one of Leibniz’s most\nfamous works. It is best known for presenting the complete concept\ntheory of substance. This theory states, roughly, that each substance\nhas an infinitely complex complete concept that specifies everything\nthat will ever happen to that substance. It is contained in the\ncomplete concept of Judas, for example, that he betrays Jesus (along\nwith everything else that can be truly predicated of Judas). Leibniz\nwas well aware that his readers might think that the complete concept\ntheory implies that all of a person’s actions are necessary, and\nthus that no person is free. In the main text of the Discours\nand in its section headings Leibniz attempts to show that Judas’\nbetrayal of Jesus, for example, is both contingent and a free action\ndespite being foreseen in Judas’ complete concept for all\neternity. Part of Leibniz’s strategy for showing this is his\nclaim that Judas’ reasons for betraying Jesus “incline\nwithout necessitating”. Leibniz’s discussion of these\nthorny philosophical issues is exoteric, at least to a certain degree.\nLike the Système nouveau it was not written in strict\naccordance with the esoteric mode of presentation. And arguably,\nLeibniz’s use of language such as “inclination without\nnecessitation” is carefully chosen with the aim of making his\nposition seem closer to received views.\n\nThe section headings of the Discours were sent to Antoine\nArnauld, a well-regarded theologian and philosopher of the day, to see\nhow the text would be received. Leibniz could not have been encouraged\nby Arnauld’s response:\n\n\nI find in these thoughts so many things which alarm me and which\nalmost all men, if I am not mistaken, will find so shocking, that I do\nnot see of what use a writing can be, which apparently all the world\nwill reject. (G 2:15)\n\n\nArnauld singled out as an example the complete concept theory of\nsubstance, which he took to imply a “more than fatal\nnecessity” that would undermine the very possibility of human\nfreedom. Leibniz’s attempts to forestall this implication in the\nsections headings of the Discours had not worked as planned,\nat least for Arnauld. Leibniz attempted to assuage Arnauld’s\nconcerns in subsequent letters with moderate success.\n\nIt is no surprise that Leibniz chose not to publish the\nDiscours. It is also no surprise that the complete concept\ntheory of substance does not make an appearance in the\nSystème nouveau. This does not imply that Leibniz\nabandoned the complete concept theory; it might just be that he came\nto realize that it was not the most effective way of introducing\nreaders to his philosophical system. Leibniz utilizes the exoteric\nstrategy of selective omission, choosing to avoid a detailed\ndiscussion of necessity and contingency. Instead he introduces his\ntheory of substance by appealing to the less controversial\ncharacteristics of unity and activity, and by trying to show how his\ntheory could resolve the notorious problem of mind-body interaction.\nLetters to some of Leibniz’s correspondents confirm that he was\n“testing the waters” in the Système\nnouveau, and that he would reveal more of his system to the\npublic if it was well received. He writes to Simon Foucher, for\nexample:\n\n\nIf the public receives these meditations well, I will be encouraged to\noffer in addition some rather remarkable ideas I have for alleviating\nthe difficulties concerning fate and contingency, and to clarify an\nessential distinction that can be drawn between material forms and\nintelligences or spirits. (1695, G 1:423)\n\n\nLeibniz’s aim was not to permanently hide his views on\ncontingency, fate, and freedom. By selectively omitting some of these\nmore controversial features of his system he increased the likelihood\nthat his readers would grasp the features of his system that were\npresented in the Système nouveau. Once they endorsed\nthese parts of the system they would be more receptive to\nLeibniz’s views on more controversial topics. Such was\nLeibniz’s hope, in any case.\n\nLeibniz returned to the topics of fate, necessity, and contingency in\nthe one philosophical book that he published during his lifetime, the\nEssais de théodicée of 1710. It has been\nsuggested in the secondary literature that Leibniz’s treatment\nof necessity and contingency in this text is exoteric to a significant\ndegree (Adams 1994:52). For example, Leibniz frequently uses terms\nsuch as “inclination without necessitating”, “moral\nnecessity”, and “hypothetical necessity” without\nproviding strict definitions of them. Some of Leibniz’s\npredecessors understood these terms in ways that implied a\nnon-deterministic view of human action. According to most\ninterpretations of Leibniz’s considered views on these issues\n(based on a number of texts other than the Essais de\nthéodicée), he was committed to a strict\ndeterminism (but not necessitarianism) about human actions. However,\nby omitting definitions of terms like “moral necessity” in\nthe Essais de théodicée Leibniz might have\nallowed readers that were committed to non-deterministic accounts of\n“moral necessity” to assume that he was using this concept\nin a way that was less deterministic than his considered view allowed.\nThis is in keeping with Leibniz’s stated strategy of not\npresenting anything to the public that is too far removed from\nreceived opinions. One way of not presenting something to the public\nthat is far removed from received opinions is to selectively omit it\n(his strategy in the Système nouveau). Another\nstrategy is to present a view that is far removed from received\nopinions in a way that makes it seem less removed than it actually is.\nIf Leibniz is utilizing this latter strategy in the discussions of\nnecessity and contingency in the Essais de\nthéodicée, it does not imply that he is trying to\npermanently mislead his readers. As we have seen, he has several\ngeneral strategies for helping his reader progress to a more rigorous\nunderstanding of his views. One of the strategies is to provide subtle\nhints such that a “more profound” examination of the text\nwould yield a deeper understanding. By omitting clear definitions of\nterms such as “moral necessity”, however, it is not clear\nwhether there is enough material in the Essais de\nthéodicée for even a discerning reader to grasp\nLeibniz’s views on necessity and contingency. But Leibniz did\nnot claim that such inferences could always be made on the basis of an\nexoteric text alone. In a number of cases his exoteric treatments need\nto be supplemented by a more rigorous work. And we must keep in mind\nthat Leibniz clearly did conceive of the Essais de\nthéodicée in precisely this way (see Antognazza\n2009: 481–2). He writes to Charles Hugony shortly after its\npublication:\n\n\nMy essays on the goodness of God, the freedom of man, and the origin\nof evil have been printed in Holland, but I did not want to put my\nname on them. They are woven together from what I said and wrote at\nvarious times to the Queen of Prussia, who enjoyed reading M. Bayle\nand in whose company the difficulties that he raises on these matters\nwere often discussed. I try to explain one part of my views in a\nrather informal manner [un peu familierement]. As you know,\nsome of my views cannot be presented in a straightforward manner\n[ne peut donner cruement], since people are liable to\nmisunderstand them, not in relation to religion, which is strongly\nsupported, but in relation to the senses. I am therefore thinking of\n[writing] a Latin work in which I will try to unfold my entire system.\n(6 November 1710, G 3:680)\n\n\nLeibniz’s remarks in this passage cohere well with the other\nremarks on exoteric philosophy that we have considered thus far. As in\nthe case of the Système nouveau and Leibniz’s\nother journal articles, he conceives of the Essais de\nthéodicée as a preparatory work that will help\nprepare his readers for a more systematic and rigorous presentation of\nhis views.\n",
    "section_title": "5. Selective Omission in Leibniz’s Système Nouveau",
    "entry_title": "Leibniz’s Exoteric Philosophy",
    "hierarchy_title": "Leibniz’s Exoteric Philosophy || Selective Omission in Leibniz’s Système Nouveau",
    "tokenized_text": [
        "selective",
        "omission",
        "leibniz",
        "système",
        "nouveau",
        "selective",
        "omission",
        "leibniz",
        "système",
        "nouveau",
        "leibniz",
        "first",
        "presented",
        "philosophy",
        "public",
        "essay",
        "titled",
        "système",
        "nouveau",
        "de",
        "la",
        "nature",
        "et",
        "de",
        "la",
        "communication",
        "de",
        "substance",
        "aussi",
        "bien",
        "que",
        "de",
        "l",
        "union",
        "qu",
        "il",
        "entre",
        "l",
        "âme",
        "et",
        "le",
        "corp",
        "new",
        "system",
        "nature",
        "communication",
        "substance",
        "union",
        "soul",
        "body",
        "essay",
        "published",
        "journal",
        "de",
        "savant",
        "one",
        "read",
        "essay",
        "isolation",
        "leibniz",
        "writing",
        "would",
        "case",
        "reader",
        "one",
        "would",
        "likely",
        "idea",
        "exoteric",
        "text",
        "preface",
        "essay",
        "following",
        "way",
        "finally",
        "since",
        "important",
        "person",
        "desired",
        "see",
        "opinion",
        "clarified",
        "risked",
        "publishing",
        "meditation",
        "even",
        "though",
        "popular",
        "populaires",
        "appreciated",
        "sort",
        "mind",
        "decided",
        "upon",
        "mainly",
        "profit",
        "judgment",
        "person",
        "enlightened",
        "matter",
        "since",
        "would",
        "troublesome",
        "seek",
        "call",
        "individually",
        "upon",
        "would",
        "disposed",
        "give",
        "instructionwhich",
        "shall",
        "always",
        "glad",
        "receive",
        "provided",
        "contains",
        "love",
        "truth",
        "rather",
        "passion",
        "preconceived",
        "opinion",
        "g",
        "ag",
        "note",
        "leibniz",
        "claim",
        "meditation",
        "popular",
        "many",
        "people",
        "able",
        "appreciate",
        "remark",
        "conjunction",
        "comment",
        "preconceived",
        "opinion",
        "designed",
        "encourage",
        "reader",
        "seriously",
        "consider",
        "view",
        "presenting",
        "despite",
        "fact",
        "difficult",
        "understand",
        "likely",
        "divergeperhaps",
        "significantlyfrom",
        "reader",
        "current",
        "belief",
        "leibniz",
        "leaf",
        "unsaid",
        "however",
        "système",
        "nouveau",
        "written",
        "according",
        "exoteric",
        "mode",
        "presentation",
        "first",
        "essay",
        "clearly",
        "written",
        "accordance",
        "formal",
        "apparatus",
        "definition",
        "demonstration",
        "required",
        "strictly",
        "esoteric",
        "presentation",
        "second",
        "perhaps",
        "significantly",
        "leibniz",
        "purposefully",
        "omits",
        "controversial",
        "feature",
        "philosophical",
        "system",
        "essay",
        "order",
        "fully",
        "appreciate",
        "exoteric",
        "feature",
        "système",
        "nouveau",
        "helpful",
        "consider",
        "text",
        "relation",
        "leibniz",
        "earlier",
        "discours",
        "de",
        "métaphysique",
        "discourse",
        "metaphysics",
        "leibniz",
        "wrote",
        "discours",
        "although",
        "published",
        "lifetime",
        "text",
        "become",
        "one",
        "leibniz",
        "famous",
        "work",
        "best",
        "known",
        "presenting",
        "complete",
        "concept",
        "theory",
        "substance",
        "theory",
        "state",
        "roughly",
        "substance",
        "infinitely",
        "complex",
        "complete",
        "concept",
        "specifies",
        "everything",
        "ever",
        "happen",
        "substance",
        "contained",
        "complete",
        "concept",
        "juda",
        "example",
        "betrays",
        "jesus",
        "along",
        "everything",
        "else",
        "truly",
        "predicated",
        "juda",
        "leibniz",
        "well",
        "aware",
        "reader",
        "might",
        "think",
        "complete",
        "concept",
        "theory",
        "implies",
        "person",
        "action",
        "necessary",
        "thus",
        "person",
        "free",
        "main",
        "text",
        "discours",
        "section",
        "heading",
        "leibniz",
        "attempt",
        "show",
        "juda",
        "betrayal",
        "jesus",
        "example",
        "contingent",
        "free",
        "action",
        "despite",
        "foreseen",
        "juda",
        "complete",
        "concept",
        "eternity",
        "part",
        "leibniz",
        "strategy",
        "showing",
        "claim",
        "juda",
        "reason",
        "betraying",
        "jesus",
        "incline",
        "without",
        "necessitating",
        "leibniz",
        "discussion",
        "thorny",
        "philosophical",
        "issue",
        "exoteric",
        "least",
        "certain",
        "degree",
        "like",
        "système",
        "nouveau",
        "written",
        "strict",
        "accordance",
        "esoteric",
        "mode",
        "presentation",
        "arguably",
        "leibniz",
        "use",
        "language",
        "inclination",
        "without",
        "necessitation",
        "carefully",
        "chosen",
        "aim",
        "making",
        "position",
        "seem",
        "closer",
        "received",
        "view",
        "section",
        "heading",
        "discours",
        "sent",
        "antoine",
        "arnauld",
        "wellregarded",
        "theologian",
        "philosopher",
        "day",
        "see",
        "text",
        "would",
        "received",
        "leibniz",
        "could",
        "encouraged",
        "arnauld",
        "response",
        "find",
        "thought",
        "many",
        "thing",
        "alarm",
        "almost",
        "men",
        "mistaken",
        "find",
        "shocking",
        "see",
        "use",
        "writing",
        "apparently",
        "world",
        "reject",
        "g",
        "arnauld",
        "singled",
        "example",
        "complete",
        "concept",
        "theory",
        "substance",
        "took",
        "imply",
        "fatal",
        "necessity",
        "would",
        "undermine",
        "possibility",
        "human",
        "freedom",
        "leibniz",
        "attempt",
        "forestall",
        "implication",
        "section",
        "heading",
        "discours",
        "worked",
        "planned",
        "least",
        "arnauld",
        "leibniz",
        "attempted",
        "assuage",
        "arnauld",
        "concern",
        "subsequent",
        "letter",
        "moderate",
        "success",
        "surprise",
        "leibniz",
        "chose",
        "publish",
        "discours",
        "also",
        "surprise",
        "complete",
        "concept",
        "theory",
        "substance",
        "make",
        "appearance",
        "système",
        "nouveau",
        "imply",
        "leibniz",
        "abandoned",
        "complete",
        "concept",
        "theory",
        "might",
        "came",
        "realize",
        "effective",
        "way",
        "introducing",
        "reader",
        "philosophical",
        "system",
        "leibniz",
        "utilizes",
        "exoteric",
        "strategy",
        "selective",
        "omission",
        "choosing",
        "avoid",
        "detailed",
        "discussion",
        "necessity",
        "contingency",
        "instead",
        "introduces",
        "theory",
        "substance",
        "appealing",
        "le",
        "controversial",
        "characteristic",
        "unity",
        "activity",
        "trying",
        "show",
        "theory",
        "could",
        "resolve",
        "notorious",
        "problem",
        "mindbody",
        "interaction",
        "letter",
        "leibniz",
        "correspondent",
        "confirm",
        "testing",
        "water",
        "système",
        "nouveau",
        "would",
        "reveal",
        "system",
        "public",
        "well",
        "received",
        "writes",
        "simon",
        "foucher",
        "example",
        "public",
        "receives",
        "meditation",
        "well",
        "encouraged",
        "offer",
        "addition",
        "rather",
        "remarkable",
        "idea",
        "alleviating",
        "difficulty",
        "concerning",
        "fate",
        "contingency",
        "clarify",
        "essential",
        "distinction",
        "drawn",
        "material",
        "form",
        "intelligence",
        "spirit",
        "g",
        "leibniz",
        "aim",
        "permanently",
        "hide",
        "view",
        "contingency",
        "fate",
        "freedom",
        "selectively",
        "omitting",
        "controversial",
        "feature",
        "system",
        "increased",
        "likelihood",
        "reader",
        "would",
        "grasp",
        "feature",
        "system",
        "presented",
        "système",
        "nouveau",
        "endorsed",
        "part",
        "system",
        "would",
        "receptive",
        "leibniz",
        "view",
        "controversial",
        "topic",
        "leibniz",
        "hope",
        "case",
        "leibniz",
        "returned",
        "topic",
        "fate",
        "necessity",
        "contingency",
        "one",
        "philosophical",
        "book",
        "published",
        "lifetime",
        "essais",
        "de",
        "théodicée",
        "suggested",
        "secondary",
        "literature",
        "leibniz",
        "treatment",
        "necessity",
        "contingency",
        "text",
        "exoteric",
        "significant",
        "degree",
        "adam",
        "example",
        "leibniz",
        "frequently",
        "us",
        "term",
        "inclination",
        "without",
        "necessitating",
        "moral",
        "necessity",
        "hypothetical",
        "necessity",
        "without",
        "providing",
        "strict",
        "definition",
        "leibniz",
        "predecessor",
        "understood",
        "term",
        "way",
        "implied",
        "nondeterministic",
        "view",
        "human",
        "action",
        "according",
        "interpretation",
        "leibniz",
        "considered",
        "view",
        "issue",
        "based",
        "number",
        "text",
        "essais",
        "de",
        "théodicée",
        "committed",
        "strict",
        "determinism",
        "necessitarianism",
        "human",
        "action",
        "however",
        "omitting",
        "definition",
        "term",
        "like",
        "moral",
        "necessity",
        "essais",
        "de",
        "théodicée",
        "leibniz",
        "might",
        "allowed",
        "reader",
        "committed",
        "nondeterministic",
        "account",
        "moral",
        "necessity",
        "assume",
        "using",
        "concept",
        "way",
        "le",
        "deterministic",
        "considered",
        "view",
        "allowed",
        "keeping",
        "leibniz",
        "stated",
        "strategy",
        "presenting",
        "anything",
        "public",
        "far",
        "removed",
        "received",
        "opinion",
        "one",
        "way",
        "presenting",
        "something",
        "public",
        "far",
        "removed",
        "received",
        "opinion",
        "selectively",
        "omit",
        "strategy",
        "système",
        "nouveau",
        "another",
        "strategy",
        "present",
        "view",
        "far",
        "removed",
        "received",
        "opinion",
        "way",
        "make",
        "seem",
        "le",
        "removed",
        "actually",
        "leibniz",
        "utilizing",
        "latter",
        "strategy",
        "discussion",
        "necessity",
        "contingency",
        "essais",
        "de",
        "théodicée",
        "imply",
        "trying",
        "permanently",
        "mislead",
        "reader",
        "seen",
        "several",
        "general",
        "strategy",
        "helping",
        "reader",
        "progress",
        "rigorous",
        "understanding",
        "view",
        "one",
        "strategy",
        "provide",
        "subtle",
        "hint",
        "profound",
        "examination",
        "text",
        "would",
        "yield",
        "deeper",
        "understanding",
        "omitting",
        "clear",
        "definition",
        "term",
        "moral",
        "necessity",
        "however",
        "clear",
        "whether",
        "enough",
        "material",
        "essais",
        "de",
        "théodicée",
        "even",
        "discerning",
        "reader",
        "grasp",
        "leibniz",
        "view",
        "necessity",
        "contingency",
        "leibniz",
        "claim",
        "inference",
        "could",
        "always",
        "made",
        "basis",
        "exoteric",
        "text",
        "alone",
        "number",
        "case",
        "exoteric",
        "treatment",
        "need",
        "supplemented",
        "rigorous",
        "work",
        "must",
        "keep",
        "mind",
        "leibniz",
        "clearly",
        "conceive",
        "essais",
        "de",
        "théodicée",
        "precisely",
        "way",
        "see",
        "antognazza",
        "writes",
        "charles",
        "hugony",
        "shortly",
        "publication",
        "essay",
        "goodness",
        "god",
        "freedom",
        "man",
        "origin",
        "evil",
        "printed",
        "holland",
        "want",
        "put",
        "name",
        "woven",
        "together",
        "said",
        "wrote",
        "various",
        "time",
        "queen",
        "prussia",
        "enjoyed",
        "reading",
        "m",
        "bayle",
        "whose",
        "company",
        "difficulty",
        "raise",
        "matter",
        "often",
        "discussed",
        "try",
        "explain",
        "one",
        "part",
        "view",
        "rather",
        "informal",
        "manner",
        "un",
        "peu",
        "familierement",
        "know",
        "view",
        "presented",
        "straightforward",
        "manner",
        "ne",
        "peut",
        "donner",
        "cruement",
        "since",
        "people",
        "liable",
        "misunderstand",
        "relation",
        "religion",
        "strongly",
        "supported",
        "relation",
        "sens",
        "therefore",
        "thinking",
        "writing",
        "latin",
        "work",
        "try",
        "unfold",
        "entire",
        "system",
        "november",
        "g",
        "leibniz",
        "remark",
        "passage",
        "cohere",
        "well",
        "remark",
        "exoteric",
        "philosophy",
        "considered",
        "thus",
        "far",
        "case",
        "système",
        "nouveau",
        "leibniz",
        "journal",
        "article",
        "conceives",
        "essais",
        "de",
        "théodicée",
        "preparatory",
        "work",
        "help",
        "prepare",
        "reader",
        "systematic",
        "rigorous",
        "presentation",
        "view"
    ]
}