{
    "main_text": "Jewish Faith and Jewish Law\n4. Jewish Faith and Jewish Law\n\nThe “top-down” approach to Leibowitz’s theology\ntaken so far places extreme limits on what one can say or know about\nGod but does not yield a constructive account of the nature of Jewish\nfaith. His positive formulation therefore proceeds from an altogether\ndifferent direction. Taking a more “bottom-up” approach\nmethodologically speaking, Leibowitz utilizes a historical argument in\ndefining Jewish faith, arguing that throughout history, at least until\nthe emancipation of European Jewry beginning at the end of the\neighteenth century, Judaism was defined through adherence to Jewish\npractice, to the commandments of the Torah itself, and the subsequent\ndevelopment of these commandments into the all encompassing system of\nJewish law, or Halakhah. Any definition of Jewish faith must therefore\ncentre upon Jewish practice, on the mitzvoth that governed the\neveryday life of Jews until modern times. Moreover, Leibowitz’s\nhistorical account of faith makes no allowances for any theological\naccretions, be they mystical or philosophical, which would purport to\ndefine it. Jewish theology through the ages has always adapted itself\nto prevailing philosophical or mystical winds, and is seen by\nLeibowitz as “episodic and fleeting” (Judaism,\n8). Whether the conceptual scaffolding was kabbalah or rationalist\nphilosophy, Judaism “was never dependent upon some specific\nphilosophy, ethic, world view, or theology” (Judaism,\n8–9), though it is mysticism and not rationalism which, along\nwith Reform Judaism, he classifies one of “the two great\ndistortions of Jewish faith” (Judaism, 111).\n\nThis historical account also melds with Leibowitz’s theological\nstarting point. Given God’s transcendence, we know that the\nrealm of natural or historical fact cannot be holy. Faith cannot\ntherefore be “a conclusion a person may come to after pondering\ncertain facts about the world,” and instead is “an\nevaluative decision that one makes, and, like all\nevaluations, it does not result from any information one has acquired,\nbut is a commitment to which one binds himself”\n(Judaism, 37, emphasis added). Jewish faith, therefore, since\nit cannot consist of propositional beliefs concerning God upon which\nhalakhic observance is based, is instead founded upon the evaluative\ndecision to commit to that very system of observance. For Leibowitz it\nis the mitzvoth themselves “which demarcate the realm of the\nsacred … [and] anything outside that realm lacks sanctity and\nis unworthy of religious adoration” (Judaism, 25).\n\nThis assertion of the primacy of practice is not unique to Leibowitz,\nreaching back in modern Jewish philosophy to Moses Mendelssohn and\nresurrected in recent decades by scholars such as Menachem Kellner\n(2006) and Kenneth Seeskin (1990). Steven Schwarzschild memorably\ntermed this “the Jewish twist” (Schwarzschild 1977, 139)\nthat in his view Jewish thinkers had applied since time immemorial to\nthe systems of thought with which they grappled. Leibowitz, however,\ngives this idea its most extreme formulation.\n\nOrdinarily one might assume that the commitment to the practice of the\nhalakhic way of life is an independently specifiable mental act and\ncertain statements that Leibowitz makes in his earlier writings,\nvestiges of which remain in some less careful later formulations,\nmight still appear to suggest\n this.[11]\n Yet for Leibowitz, faith is not an independently specifiable\npsychological state that can be defined in isolation from its\npractical fruits. Indeed he castigates those who “wish to\ndistinguish a specific psychological-conceptual content of the\nreligious consciousness from its concrete institutionalized\nembodiment” (Judaism, 38). Leibowitz will not allow us\nto pinpoint a particular psychological state that constitutes this\ncommitment, and correlatively is highly critical of mystical\napproaches to Judaism that revolve around putative religious\nexperiences. A religion devoted to halakhic practice “does not\ndepend upon the incidence of religious experience”\n(Judaism, 13), which is a mere “embellishment” to\nhalakhic practice. Indeed, “the aim of proximity to God is\nunattainable” (Judaism, 16).\n\nClearly for Leibowitz, the problem with specifying some psychological\nbasis for this commitment is defining what the content of this mental\nact would be. To what am I committed? The natural answer is that we\nare committed to worshipping God. But any attempt to unpack that\nstatement further will lead us to transgress the previously noted\nboundaries of human cognition. The proposition “I am committed\nto God” is not open to further elaboration if God is beyond our\ncategories of language and thought. Belief in God for Leibowitz, which\ncannot be formulated propositionally, can only then be embodied in a\ncommitment to a particular way of life, which is expressed by\nsubordination to the actual practical regime of halakhic practice.\nThus, we are thrust back to the practice itself as the\ncontent of our faith rather than the symptom of some\nindependently specifiable form of faith as psychological commitment.\nIt turns out then that, “[Jewish] faith is nothing but its\nsystem of mitzvoth, which was the embodiment of Judaism”\n(Judaism, 38, emphasis added). Obviously, it is almost a\ntruism that Jewish faith understood this way must involve\nsome form of mental state as the causal motivator of halakhic\naction. Moreover, as we will see presently, the nature of this mental\nstate does make a difference to one’s faith; it is only when\nintended as “worship of God” that such acts are to be\nunderstood as full expressions of faith. But ultimately, in the\nabsence of the practical fruits, one has nothing for Leibowitz. Much\nas “belief in” (in contradistinction to “belief\nthat”) is incorrectly attributed to someone who consistently\nfails to act in accordance with that mental attitude, for Leibowitz\nJewish faith cannot be correctly attributed to a mere psychological\nstate in the absence of actual adherence to the halakhic system.\nJewish faith is therefore equivalent to the observance of mitzvoth\nintended as acts of worship; the concept is exhausted by such\nintentional performance of mitzvoth.\n\nThis contraction of faith to an almost behavioural definition,\nhowever, means that halakhic observance itself constitutes\nthe faith upon which it is usually thought to be based, and this faith\ncannot be identified independently of this practice, which Leibowitz\nconcedes might create the appearance of paradox:\n\n\nHalakhah is founded on faith, yet at the same time constitutes\nthis faith. In other words, Judaism as a living religion creates the\nfaith upon which it is founded. This is a logical paradox but not a\nreligious paradox. (Judaism, 11)\n\n\nAsa Kasher, a neo-Leibowitzian, has argued that Leibowitz here does\nnot present a paradox at all, but instead a circle that is related to\nthe one discussed earlier in section 3. Kasher contends that Leibowitz\nis arguing that halakhah creates its faith through its designation of\nthe institutions of Judaism, primarily the divinity of Scripture, with\nits demand to serve God, while Scripture designates the halakhic\nsystem as the way in which such divine service is realized. (A.\nKasher, 1976, 239–40). Leibowitz in response concedes to Kasher\nthat there is no paradox, but stresses that no matter how many times\none goes around the circle, the ultimate commitment to the life of\nmitzvoth must come from beyond the circle, from a conative – rather \nthan cognitive – commitment that is beyond reason (see\n“Responses,” 277–278).\n\nAs a justificatory argument for engaging in the practice, this might\nindeed create an impression of circularity – though circular\narguments are neither formally invalid, nor paradoxical, but\n“merely” unpersuasive. Leibowitz, however, emphasizes time\nand again that he is not attempting to “justify” the\ncommandments. Medieval Jewish thinkers believed that it was possible\nto “justify” Judaism by appeal to universal standards.\nThus, to take Maimonides for example, if truth is the standard, then\nJudaism is clearly the most rational religion since it is a superior\nexemplar of, or means to attaining the truth, relative to the other\nmonotheistic alternatives. If one were to begin from a neutral\nperspective, a rational being insofar as he is rational, could, in\nprinciple, be convinced of the superiority of Judaism. But this idea\nof a neutral rational starting point from which we can assess\naxiological alternatives is one that Leibowitz rejects.\n\nHere we again see evidence of Leibowitz’s strict fact/value\ndistinction, and the corresponding limits it places on rationalism\nwhen it is understood as the metaphysical thesis that the world is\nintelligible “all the way down.” The world and in\nparticular our evaluative commitments within it are not\nrational all the way down. The fiction that as fully formed rational\nbeings we cast our eye without prejudice over the various modes of\npractical evaluation and decide in favor of the most rational is\ndismissed by Leibowitz. Once we have certain commitments, as\nevery person does at the time at which he begins to reflect on them,\nour rational faculties can indeed be used as tools for exploring them,\nbut not in the expectation that such reflection can be expected to\nproduce a justification or meaning that will convince all rational\nbeings to commit themselves to such a practice. And if we do ask\n“why commit?” in the expectation of some such answer, we\nare assuming the factual or theoretical stance towards faith that\nLeibowitz contends is rejected by Judaism. When it comes to faith, in\nLeibowitz’s words:\n\n\nI know of no ways to faith other than faith itself….\n[It] cannot be taught. One can only present it in all its might and\npower. (Judaism, 37)\n\n",
    "section_title": "4. Jewish Faith and Jewish Law",
    "entry_title": "Yeshayahu Leibowitz",
    "hierarchy_title": "Yeshayahu Leibowitz || Jewish Faith and Jewish Law",
    "tokenized_text": [
        "jewish",
        "faith",
        "jewish",
        "law",
        "jewish",
        "faith",
        "jewish",
        "law",
        "topdown",
        "approach",
        "leibowitz",
        "theology",
        "taken",
        "far",
        "place",
        "extreme",
        "limit",
        "one",
        "say",
        "know",
        "god",
        "yield",
        "constructive",
        "account",
        "nature",
        "jewish",
        "faith",
        "positive",
        "formulation",
        "therefore",
        "proceeds",
        "altogether",
        "different",
        "direction",
        "taking",
        "bottomup",
        "approach",
        "methodologically",
        "speaking",
        "leibowitz",
        "utilizes",
        "historical",
        "argument",
        "defining",
        "jewish",
        "faith",
        "arguing",
        "throughout",
        "history",
        "least",
        "emancipation",
        "european",
        "jewry",
        "beginning",
        "end",
        "eighteenth",
        "century",
        "judaism",
        "defined",
        "adherence",
        "jewish",
        "practice",
        "commandment",
        "torah",
        "subsequent",
        "development",
        "commandment",
        "encompassing",
        "system",
        "jewish",
        "law",
        "halakhah",
        "definition",
        "jewish",
        "faith",
        "must",
        "therefore",
        "centre",
        "upon",
        "jewish",
        "practice",
        "mitzvah",
        "governed",
        "everyday",
        "life",
        "jew",
        "modern",
        "time",
        "moreover",
        "leibowitz",
        "historical",
        "account",
        "faith",
        "make",
        "allowance",
        "theological",
        "accretion",
        "mystical",
        "philosophical",
        "would",
        "purport",
        "define",
        "jewish",
        "theology",
        "age",
        "always",
        "adapted",
        "prevailing",
        "philosophical",
        "mystical",
        "wind",
        "seen",
        "leibowitz",
        "episodic",
        "fleeting",
        "judaism",
        "whether",
        "conceptual",
        "scaffolding",
        "kabbalah",
        "rationalist",
        "philosophy",
        "judaism",
        "never",
        "dependent",
        "upon",
        "specific",
        "philosophy",
        "ethic",
        "world",
        "view",
        "theology",
        "judaism",
        "though",
        "mysticism",
        "rationalism",
        "along",
        "reform",
        "judaism",
        "classifies",
        "one",
        "two",
        "great",
        "distortion",
        "jewish",
        "faith",
        "judaism",
        "historical",
        "account",
        "also",
        "meld",
        "leibowitz",
        "theological",
        "starting",
        "point",
        "given",
        "god",
        "transcendence",
        "know",
        "realm",
        "natural",
        "historical",
        "fact",
        "holy",
        "faith",
        "therefore",
        "conclusion",
        "person",
        "may",
        "come",
        "pondering",
        "certain",
        "fact",
        "world",
        "instead",
        "evaluative",
        "decision",
        "one",
        "make",
        "like",
        "evaluation",
        "result",
        "information",
        "one",
        "acquired",
        "commitment",
        "one",
        "bind",
        "judaism",
        "emphasis",
        "added",
        "jewish",
        "faith",
        "therefore",
        "since",
        "consist",
        "propositional",
        "belief",
        "concerning",
        "god",
        "upon",
        "halakhic",
        "observance",
        "based",
        "instead",
        "founded",
        "upon",
        "evaluative",
        "decision",
        "commit",
        "system",
        "observance",
        "leibowitz",
        "mitzvah",
        "demarcate",
        "realm",
        "sacred",
        "anything",
        "outside",
        "realm",
        "lack",
        "sanctity",
        "unworthy",
        "religious",
        "adoration",
        "judaism",
        "assertion",
        "primacy",
        "practice",
        "unique",
        "leibowitz",
        "reaching",
        "back",
        "modern",
        "jewish",
        "philosophy",
        "moses",
        "mendelssohn",
        "resurrected",
        "recent",
        "decade",
        "scholar",
        "menachem",
        "kellner",
        "kenneth",
        "seeskin",
        "steven",
        "schwarzschild",
        "memorably",
        "termed",
        "jewish",
        "twist",
        "schwarzschild",
        "view",
        "jewish",
        "thinker",
        "applied",
        "since",
        "time",
        "immemorial",
        "system",
        "thought",
        "grappled",
        "leibowitz",
        "however",
        "give",
        "idea",
        "extreme",
        "formulation",
        "ordinarily",
        "one",
        "might",
        "assume",
        "commitment",
        "practice",
        "halakhic",
        "way",
        "life",
        "independently",
        "specifiable",
        "mental",
        "act",
        "certain",
        "statement",
        "leibowitz",
        "make",
        "earlier",
        "writing",
        "vestige",
        "remain",
        "le",
        "careful",
        "later",
        "formulation",
        "might",
        "still",
        "appear",
        "suggest",
        "yet",
        "leibowitz",
        "faith",
        "independently",
        "specifiable",
        "psychological",
        "state",
        "defined",
        "isolation",
        "practical",
        "fruit",
        "indeed",
        "castigates",
        "wish",
        "distinguish",
        "specific",
        "psychologicalconceptual",
        "content",
        "religious",
        "consciousness",
        "concrete",
        "institutionalized",
        "embodiment",
        "judaism",
        "leibowitz",
        "allow",
        "u",
        "pinpoint",
        "particular",
        "psychological",
        "state",
        "constitutes",
        "commitment",
        "correlatively",
        "highly",
        "critical",
        "mystical",
        "approach",
        "judaism",
        "revolve",
        "around",
        "putative",
        "religious",
        "experience",
        "religion",
        "devoted",
        "halakhic",
        "practice",
        "depend",
        "upon",
        "incidence",
        "religious",
        "experience",
        "judaism",
        "mere",
        "embellishment",
        "halakhic",
        "practice",
        "indeed",
        "aim",
        "proximity",
        "god",
        "unattainable",
        "judaism",
        "clearly",
        "leibowitz",
        "problem",
        "specifying",
        "psychological",
        "basis",
        "commitment",
        "defining",
        "content",
        "mental",
        "act",
        "would",
        "committed",
        "natural",
        "answer",
        "committed",
        "worshipping",
        "god",
        "attempt",
        "unpack",
        "statement",
        "lead",
        "u",
        "transgress",
        "previously",
        "noted",
        "boundary",
        "human",
        "cognition",
        "proposition",
        "committed",
        "god",
        "open",
        "elaboration",
        "god",
        "beyond",
        "category",
        "language",
        "thought",
        "belief",
        "god",
        "leibowitz",
        "formulated",
        "propositionally",
        "embodied",
        "commitment",
        "particular",
        "way",
        "life",
        "expressed",
        "subordination",
        "actual",
        "practical",
        "regime",
        "halakhic",
        "practice",
        "thus",
        "thrust",
        "back",
        "practice",
        "content",
        "faith",
        "rather",
        "symptom",
        "independently",
        "specifiable",
        "form",
        "faith",
        "psychological",
        "commitment",
        "turn",
        "jewish",
        "faith",
        "nothing",
        "system",
        "mitzvah",
        "embodiment",
        "judaism",
        "judaism",
        "emphasis",
        "added",
        "obviously",
        "almost",
        "truism",
        "jewish",
        "faith",
        "understood",
        "way",
        "must",
        "involve",
        "form",
        "mental",
        "state",
        "causal",
        "motivator",
        "halakhic",
        "action",
        "moreover",
        "see",
        "presently",
        "nature",
        "mental",
        "state",
        "make",
        "difference",
        "one",
        "faith",
        "intended",
        "worship",
        "god",
        "act",
        "understood",
        "full",
        "expression",
        "faith",
        "ultimately",
        "absence",
        "practical",
        "fruit",
        "one",
        "nothing",
        "leibowitz",
        "much",
        "belief",
        "contradistinction",
        "belief",
        "incorrectly",
        "attributed",
        "someone",
        "consistently",
        "fails",
        "act",
        "accordance",
        "mental",
        "attitude",
        "leibowitz",
        "jewish",
        "faith",
        "correctly",
        "attributed",
        "mere",
        "psychological",
        "state",
        "absence",
        "actual",
        "adherence",
        "halakhic",
        "system",
        "jewish",
        "faith",
        "therefore",
        "equivalent",
        "observance",
        "mitzvah",
        "intended",
        "act",
        "worship",
        "concept",
        "exhausted",
        "intentional",
        "performance",
        "mitzvah",
        "contraction",
        "faith",
        "almost",
        "behavioural",
        "definition",
        "however",
        "mean",
        "halakhic",
        "observance",
        "constitutes",
        "faith",
        "upon",
        "usually",
        "thought",
        "based",
        "faith",
        "identified",
        "independently",
        "practice",
        "leibowitz",
        "concedes",
        "might",
        "create",
        "appearance",
        "paradox",
        "halakhah",
        "founded",
        "faith",
        "yet",
        "time",
        "constitutes",
        "faith",
        "word",
        "judaism",
        "living",
        "religion",
        "creates",
        "faith",
        "upon",
        "founded",
        "logical",
        "paradox",
        "religious",
        "paradox",
        "judaism",
        "asa",
        "kasher",
        "neoleibowitzian",
        "argued",
        "leibowitz",
        "present",
        "paradox",
        "instead",
        "circle",
        "related",
        "one",
        "discussed",
        "earlier",
        "section",
        "kasher",
        "contends",
        "leibowitz",
        "arguing",
        "halakhah",
        "creates",
        "faith",
        "designation",
        "institution",
        "judaism",
        "primarily",
        "divinity",
        "scripture",
        "demand",
        "serve",
        "god",
        "scripture",
        "designates",
        "halakhic",
        "system",
        "way",
        "divine",
        "service",
        "realized",
        "a",
        "kasher",
        "leibowitz",
        "response",
        "concedes",
        "kasher",
        "paradox",
        "stress",
        "matter",
        "many",
        "time",
        "one",
        "go",
        "around",
        "circle",
        "ultimate",
        "commitment",
        "life",
        "mitzvah",
        "must",
        "come",
        "beyond",
        "circle",
        "conative",
        "rather",
        "cognitive",
        "commitment",
        "beyond",
        "reason",
        "see",
        "response",
        "justificatory",
        "argument",
        "engaging",
        "practice",
        "might",
        "indeed",
        "create",
        "impression",
        "circularity",
        "though",
        "circular",
        "argument",
        "neither",
        "formally",
        "invalid",
        "paradoxical",
        "merely",
        "unpersuasive",
        "leibowitz",
        "however",
        "emphasizes",
        "time",
        "attempting",
        "justify",
        "commandment",
        "medieval",
        "jewish",
        "thinker",
        "believed",
        "possible",
        "justify",
        "judaism",
        "appeal",
        "universal",
        "standard",
        "thus",
        "take",
        "maimonides",
        "example",
        "truth",
        "standard",
        "judaism",
        "clearly",
        "rational",
        "religion",
        "since",
        "superior",
        "exemplar",
        "mean",
        "attaining",
        "truth",
        "relative",
        "monotheistic",
        "alternative",
        "one",
        "begin",
        "neutral",
        "perspective",
        "rational",
        "insofar",
        "rational",
        "could",
        "principle",
        "convinced",
        "superiority",
        "judaism",
        "idea",
        "neutral",
        "rational",
        "starting",
        "point",
        "ass",
        "axiological",
        "alternative",
        "one",
        "leibowitz",
        "reject",
        "see",
        "evidence",
        "leibowitz",
        "strict",
        "factvalue",
        "distinction",
        "corresponding",
        "limit",
        "place",
        "rationalism",
        "understood",
        "metaphysical",
        "thesis",
        "world",
        "intelligible",
        "way",
        "down",
        "world",
        "particular",
        "evaluative",
        "commitment",
        "within",
        "rational",
        "way",
        "fiction",
        "fully",
        "formed",
        "rational",
        "being",
        "cast",
        "eye",
        "without",
        "prejudice",
        "various",
        "mode",
        "practical",
        "evaluation",
        "decide",
        "favor",
        "rational",
        "dismissed",
        "leibowitz",
        "certain",
        "commitment",
        "every",
        "person",
        "time",
        "begin",
        "reflect",
        "rational",
        "faculty",
        "indeed",
        "used",
        "tool",
        "exploring",
        "expectation",
        "reflection",
        "expected",
        "produce",
        "justification",
        "meaning",
        "convince",
        "rational",
        "being",
        "commit",
        "practice",
        "ask",
        "commit",
        "expectation",
        "answer",
        "assuming",
        "factual",
        "theoretical",
        "stance",
        "towards",
        "faith",
        "leibowitz",
        "contends",
        "rejected",
        "judaism",
        "come",
        "faith",
        "leibowitz",
        "word",
        "know",
        "way",
        "faith",
        "faith",
        "itself",
        "taught",
        "one",
        "present",
        "might",
        "power",
        "judaism"
    ]
}