{
    "main_text": "The Underachiever Problem\n2. The Underachiever Problem\n\n\nThe core of Leibniz's solution to the underachiever problem is\nstraightforward. Leibniz argues that God does not underachieve in\ncreating this world because this world is the best of all possible\nworlds. Many thinkers have supposed that commitment to the claim that\nthis world is the best of all possible worlds follows\nstraightforwardly from monotheism. Because God is omnipotent and\nomniscient, nothing can prevent him from creating the best world, and\nhis omnibenevolence obliges him to create the best world. So the\ncreated world is the best world.\n\n\nLeibniz's reasoning to this conclusion does not, however, follow this\nstraightforward path: among other things, this reasoning is not cogent\nas it stands. A number of seventeenth-century figures recognized that\nGod would not be obliged to create the best world if there were no\nsuch thing as the best world. There would be no best world if the\nseries of possible worlds formed a continuum of increasingly good\nworlds ad infinitum. And if there is no best world, God\ncannot be faulted for failing to create the best one since to do so\nwould be as impossible as, say, naming the highest number. There is no\nsuch number of course, and likewise no such world. So while God may be\nobliged to create a world that has at least some measure of goodness,\nhe cannot be obliged, on this view, to create the best. And therefore\nit might be the case that God simply chose arbitrarily to create one\nof infinitely many morally acceptable worlds. [This line of argument\nwas common among certain Jesuit scholastics of the period. For\ndiscussions of this issue, see, for example, Ruiz de\nMontoya, Commentaria ac Disputationes in primam partem Sancti\nThomae. De voluntate Dei et propiis actibus eius, Lyon 1630,\ndisp. 9 and 10, and Diego Granado, Comentarii in primam partem\nSummae Theologicae S. Thomae, Pont-a-Mousson, 1624,\npp.420–433.]\n\n\nLeibniz was aware of this argument denying God's obligation to create\nthe best, but he was firmly committed to rejecting it, in virtue of a\ncentral principle of his philosophical system, the Principle of\nSufficient Reason. According to the Principle of Sufficient Reason,\nfor any state of affairs, there must be a sufficient reason that\nexplains why that state of affairs and not some other state of affairs\nobtains. When it comes to our world, then, there must be some reason\nthat explains why it, and not some other world, obtains. But there can\nbe no such reason if it is the case that the goodness of worlds\nincreases ad infinitum. Leibniz therefore concluded that\nthere can be no infinite continuum of worlds.\n\n\nOne might be tempted to resist Leibniz's argument by saying that even\naccording to the view on which there is an “infinite continuum\nof good worlds,” there is something that can serve as the\nsufficient reason for existence of this world, namely, God's\ndecree that this world be actual. But such a response, Leibniz\nobserves, would merely push the problem back, because the Principle of\nSufficient Reason applies to free choices just as it applies to any\nother event or state of affairs.  Thus, we would have to provide a\nsufficient reason for God's choice of this world instead of some other\nworld on the continuum of morally acceptable worlds. And it seems that\nsuch a sufficient reason cannot be given on the infinite continuum of\ngood worlds view. Note that the sufficient reason cannot be derived\nfrom some feature or fact about the world that is actually chosen, for\nthis would raise the obvious question: Why did this feature\nin particular serve as the sufficient reason for God's choice? The\nonly possible answers, it appears, would be: (a) Because God\narbitrarily selected that feature as the one he would favor in\ndeciding which world to create; or (b) Because that feature made that\nworld better than all its competitors. But notice that neither of\nthese answers is acceptable. The first is inconsistent with the\nPrinciple of Sufficient Reason. The second is incompatible with the\nhypothesis at issue, that there is no “best world.”\n\n\nOne might think that declaring this world to be the best possible\nworld does not constitute a valid response to the underachiever\nproblem. Indeed, such a response might be taken to provide the basis\nfor a new underachiever argument along the following lines:\n\nIf God were all-powerful, all-knowing, and all-good,\nthen this world would be the best possible world. \nBut surely this world is not the best possible world.\nThus, God is not all-powerful, all-knowing, and all-good.\n\n\n\nLeibniz believes, however, that there was overwhelming evidence that\nthe conclusion of this argument was false. He therefore must take one\nof the two premises in this argument to be false. Given that he\nhimself is committed to the first premise, he must reject the second\npremise. And this is precisely what he does. \n\n\nWhat reason, Leibniz asks, does the critic have for thinking that (2)\nis true? When Leibniz addresses this issue, he usually has the critic\nsay something along the following lines:\nSurely this world is not the best possible world since we\ncan easily conceive of possible worlds that are better. Take some\ntoken instance of suffering: the tragic bombing of the Oklahoma City\nfederal building. Surely a world without that event would be better\nthan the actual world. And there is no reason why God couldn't have\ncreated the world without that event. Thus, this is not the best\npossible world.  [See Theodicy 118–119 (H\n188–191; G VI 168–172).]\n\n\nLeibniz's response to this sort of criticism comes in two stages.\nFirst, Leibniz says that while we can think of certain token features\nof the world that in and of themselves might be better than they are,\nwe do not know whether it is possible to create a better world lacking\nthose features, because we can never be certain of the nature of the\nconnections between the token events in question and other events in\nthe world. If we could improve or eliminate the token event in\nquestion without otherwise changing the world, we might well have a\nbetter world. Unfortunately, we have no way of knowing whether such a\nchange to the token event would leave the world otherwise unchanged,\nor might instead make things, on balance,\nworse. [See Theodicy 211–214 (H 260–2; G VI\n244–7) and Gr, p.64f., for examples of this sort of\nresponse.]\n\n\nSecond, examples such as these are deceptive because they presume that\nGod utilizes standards of world goodness that he may not in fact\nuse. For example, it may presume that a world is good only if each\npart taken in isolation is good (a standard, we have seen, that\nLeibniz rejects), or it might presume that a world is good only if\nhuman beings enjoy happiness in it.\n\n\nLeibniz argues in numerous texts that it is parochial to think that\nhuman happiness is the standard whereby the goodness of worlds is to\nbe judged. A more reasonable standard, according to Leibniz, would be\nthe happiness of all sentient beings. But once we admit this, it may\nturn out that the amount of unhappiness in the created realm is quite\nsmall, given that for all we know, the sentient beings on Earth might\nconstitute a very small percentage of the sentient beings created by\nGod. Here Leibniz includes not only preternatural beings such as\nangels, but also the possibility of extraterrestrial rational beings\n[Theodicy 19 (H 134–5; G VI 113–4)].\n\n\nThere is disagreement among Leibniz scholars about the basis for\njudging the goodness of worlds. Various scholars have defended one or\nmore of the following:\n\nThe best world is the one that maximizes the happiness\n(i.e., virtue) of rational beings. \nThe best world is the one that maximizes the “quantity of\nessence.”\nThe best world is the one that yields the greatest variety of\nphenomena governed by the simplest set of laws.\n\n\n\nThere is scholarly dispute about whether Leibniz believed that the\nmaximization of the happiness or virtue of rational beings is one of\nthe standards by which God judges the goodness of the world. [For\nsupporters of this claim see Rutherford, c.3; Blumenfeld, Brown; for\ndetractors see Russell, p. 199, Gale.] It is unlikely that Leibniz\nbelieved that (1) alone was the true standard of goodness of the world\nin light of following comment on an argument advanced by Bayle: \nthe author is still presupposing that false maxim …\nstating that the happiness of rational creatures is the sole aim of God.\n[Theodicy 120 (H 192; G VI 172)]\n\n\nIn part, the dispute over this standard hangs on whether or not (1) is\ncompatible with the more metaphysical standards embodied in (2) and (3),\nsince it is these more metaphysical standards that Leibniz seems to\nendorse most consistently. In some cases, Leibniz writes as if the\nstandard of happiness is fully compatible with the more metaphysical\ncriteria. For example, within a single work, the Discourse on\nMetaphysics, Leibniz entitled Section 5 “What the rules of the\nperfection of divine conduct consist in, and that the simplicity of the\nways is in balance with the richness of effects,” and he entitled Section\n36: “God is the monarch of the most perfect republic, composed of all\nminds, and the happiness of this city of God is his principal purpose.”\nSo Leibniz seems to advance both standards (1) and (3) in the same work\n[For another example, see R p. 105 (K X pp.9–10)]. In other places\nhowever, he writes as if they compete with one another [See Theodicy\n124 (H 197–8; G VI 178–9).] \n\n\nWhatever position one comes to hold on this matter, Leibniz often\npoints to the more metaphysical standards as the ones God utilizes in\nassessing the goodness of worlds. But there is further controversy\nover exactly which metaphysical standard, (2) or (3), Leibniz\nendorses. In general, Leibniz holds that God creates the world in\norder to share his goodness with created things in the most perfect\nmanner possible [Gr 355–6].  In light of the fact that created\nbeings, in virtue of their limitations, can mirror the divine goodness\nonly in limited respects, God creates a variety of things, each of\nwhich has an essence that reflects a different facet of divine\nperfection in its own unique way. Since this is God's purpose in\ncreating the world, it would be reasonable to think that maximizing\nthe mirroring of divine goodness in creation is the goal that God\nseeks to achieve. And this in fact is one of the standards Leibniz\nseems to endorse. We might call this the “maximization of\nessence” standard. Leibniz seems convinced that the actual world\nmeets this standard and that creatures are to be found that mirror the\ndivine perfections in all the sorts of ways that creatures can do\nthis. Thus, there are creatures with bodies and creatures without,\ncreatures with freedom and intelligence and creatures without,\ncreatures with sentience and creatures without, etc. [See, for\nexample, MP pp. 75–6 and 138 (G VII 303–4 and 310).]\n\n\nIn some texts, however, Leibniz frames the standard of goodness in\nwhat some have taken to be a third distinct way. In these places he\nargues that the goodness of a world is measured by the ratio between the\nvariety of phenomena that a world contains and the simplicity of the laws\nthat govern that world. Here Leibniz emphasizes the fact that the perfection\nof a world that maximizes the variety of phenomena it contains is\nenhanced by the simplicity of its laws since this displays the\nintelligence of the creator who created it.\n\n\nSome scholars have argued that one or the other of these\ntwo more metaphysical standards represents Leibniz's settled view on\nthe true standard of goodness [Gale, for example]. Other scholars have argued\nthat, in the end, the two standards are not exclusive of each other.\n[See Rutherford, cc.2–3 and Rescher, c.1 for two very different ways of\nharmonizing (2) and (3).]\n\n\nRegardless of which of these interpretations is correct, if these are\nthe standards by which God judges the world's goodness, it becomes\nmuch more difficult to defend the claim that this is not the best\npossible world. We can use standard (3) to illustrate. In order, for\nexample, for God to eliminate the Oklahoma City bombing from the\nworld, what would be required in order for him to do so? There are\npresumably a number of ways in which this might be done. The most\nobvious would involve miraculous intervention somewhere in the chain\nof events leading up to the explosion. God might miraculously prevent\nthe explosives from detonating, or he might eliminate the truck and\nits contents from the world. But this sort of miraculous intervention\nwould require that the laws governing the world become more\ncomplex. Consequently, Leibniz, and others who share this view of what\nthe goodness of a world consists in, such as Malebranche, think that\nmiraculous intervention is generally repugnant and would require\nvastly outweighing goods to result from a miraculous intervention in\norder for such an intervention to be\npermissible. [See Theodicy 129 (H 192–3; G VI 182).]\n\n\nIn any event, Leibniz holds that we are simply unable to know how\nchanging certain events would change the world's capacity to meet the\nstandards of goodness described in (2) and (3). Thus, according to\nLeibniz, we are not justified in claiming that this world is not as\ngood, all things considered, as some other possible world. According\nto Leibniz, then, the underachiever problem cannot get off the ground\nunless the critic is able to defend the claim that this world is not\nthe best possible world. It should be noted that Leibniz's approach to\nthe underachiever problem thus seems be immune to the line of\ncriticism pressed by Voltaire in Candide, namely, that it is\nobvious that this world is not the best possible world because there\nare so many manifest evils in it.  Leibniz does not believe that each\nindividual event is the best possible event, and he does not think\nthat it is possible for finite minds to demonstrate that every\nindividual event must be a part of the best possible world: rather, he\nbelieves that the world as a whole is the best possible world.  (That\nsaid, it should be noted that there is considerable scholarly\ncontroversy as to whether Voltaire's target in Candide is\nindeed Leibniz: it has been claimed, for example, that the\n“optimism” lampooned in Candide is closer to that\nof Pope (see Rutherford (1995); on the general reception of Leibniz in\nFrance, see Barber (1955)].) In any event, on Leibniz's view, our\ninability to know how changing certain events in the world would\naffect other events and our inability to know how such changes would\naffect the overall goodness of the world make it impossible to defend\nthe claim that the manifest evils in the world constitute evidence\nthat this is not the best possible world.\n",
    "section_title": "2. The Underachiever Problem",
    "entry_title": "Leibniz on the Problem of Evil",
    "hierarchy_title": "Leibniz on the Problem of Evil || The Underachiever Problem",
    "tokenized_text": [
        "underachiever",
        "problem",
        "underachiever",
        "problem",
        "core",
        "leibniz",
        "s",
        "solution",
        "underachiever",
        "problem",
        "straightforward",
        "leibniz",
        "argues",
        "god",
        "underachieve",
        "creating",
        "world",
        "world",
        "best",
        "possible",
        "world",
        "many",
        "thinker",
        "supposed",
        "commitment",
        "claim",
        "world",
        "best",
        "possible",
        "world",
        "follows",
        "straightforwardly",
        "monotheism",
        "god",
        "omnipotent",
        "omniscient",
        "nothing",
        "prevent",
        "creating",
        "best",
        "world",
        "omnibenevolence",
        "obliges",
        "create",
        "best",
        "world",
        "created",
        "world",
        "best",
        "world",
        "leibniz",
        "s",
        "reasoning",
        "conclusion",
        "however",
        "follow",
        "straightforward",
        "path",
        "among",
        "thing",
        "reasoning",
        "cogent",
        "stand",
        "number",
        "seventeenthcentury",
        "figure",
        "recognized",
        "god",
        "would",
        "obliged",
        "create",
        "best",
        "world",
        "thing",
        "best",
        "world",
        "would",
        "best",
        "world",
        "series",
        "possible",
        "world",
        "formed",
        "continuum",
        "increasingly",
        "good",
        "world",
        "ad",
        "infinitum",
        "best",
        "world",
        "god",
        "faulted",
        "failing",
        "create",
        "best",
        "one",
        "since",
        "would",
        "impossible",
        "say",
        "naming",
        "highest",
        "number",
        "number",
        "course",
        "likewise",
        "world",
        "god",
        "may",
        "obliged",
        "create",
        "world",
        "least",
        "measure",
        "goodness",
        "obliged",
        "view",
        "create",
        "best",
        "therefore",
        "might",
        "case",
        "god",
        "simply",
        "chose",
        "arbitrarily",
        "create",
        "one",
        "infinitely",
        "many",
        "morally",
        "acceptable",
        "world",
        "line",
        "argument",
        "common",
        "among",
        "certain",
        "jesuit",
        "scholastic",
        "period",
        "discussion",
        "issue",
        "see",
        "example",
        "ruiz",
        "de",
        "montoya",
        "commentaria",
        "ac",
        "disputationes",
        "primam",
        "partem",
        "sancti",
        "thomae",
        "de",
        "voluntate",
        "dei",
        "et",
        "propiis",
        "actibus",
        "eius",
        "lyon",
        "disp",
        "diego",
        "granado",
        "comentarii",
        "primam",
        "partem",
        "summae",
        "theologicae",
        "s",
        "thomae",
        "pontamousson",
        "pp",
        "leibniz",
        "aware",
        "argument",
        "denying",
        "god",
        "s",
        "obligation",
        "create",
        "best",
        "firmly",
        "committed",
        "rejecting",
        "virtue",
        "central",
        "principle",
        "philosophical",
        "system",
        "principle",
        "sufficient",
        "reason",
        "according",
        "principle",
        "sufficient",
        "reason",
        "state",
        "affair",
        "must",
        "sufficient",
        "reason",
        "explains",
        "state",
        "affair",
        "state",
        "affair",
        "obtains",
        "come",
        "world",
        "must",
        "reason",
        "explains",
        "world",
        "obtains",
        "reason",
        "case",
        "goodness",
        "world",
        "increase",
        "ad",
        "infinitum",
        "leibniz",
        "therefore",
        "concluded",
        "infinite",
        "continuum",
        "world",
        "one",
        "might",
        "tempted",
        "resist",
        "leibniz",
        "s",
        "argument",
        "saying",
        "even",
        "according",
        "view",
        "infinite",
        "continuum",
        "good",
        "world",
        "something",
        "serve",
        "sufficient",
        "reason",
        "existence",
        "world",
        "namely",
        "god",
        "s",
        "decree",
        "world",
        "actual",
        "response",
        "leibniz",
        "observes",
        "would",
        "merely",
        "push",
        "problem",
        "back",
        "principle",
        "sufficient",
        "reason",
        "applies",
        "free",
        "choice",
        "applies",
        "event",
        "state",
        "affair",
        "thus",
        "would",
        "provide",
        "sufficient",
        "reason",
        "god",
        "s",
        "choice",
        "world",
        "instead",
        "world",
        "continuum",
        "morally",
        "acceptable",
        "world",
        "seems",
        "sufficient",
        "reason",
        "given",
        "infinite",
        "continuum",
        "good",
        "world",
        "view",
        "note",
        "sufficient",
        "reason",
        "derived",
        "feature",
        "fact",
        "world",
        "actually",
        "chosen",
        "would",
        "raise",
        "obvious",
        "question",
        "feature",
        "particular",
        "serve",
        "sufficient",
        "reason",
        "god",
        "s",
        "choice",
        "possible",
        "answer",
        "appears",
        "would",
        "god",
        "arbitrarily",
        "selected",
        "feature",
        "one",
        "would",
        "favor",
        "deciding",
        "world",
        "create",
        "b",
        "feature",
        "made",
        "world",
        "better",
        "competitor",
        "notice",
        "neither",
        "answer",
        "acceptable",
        "first",
        "inconsistent",
        "principle",
        "sufficient",
        "reason",
        "second",
        "incompatible",
        "hypothesis",
        "issue",
        "best",
        "world",
        "one",
        "might",
        "think",
        "declaring",
        "world",
        "best",
        "possible",
        "world",
        "constitute",
        "valid",
        "response",
        "underachiever",
        "problem",
        "indeed",
        "response",
        "might",
        "taken",
        "provide",
        "basis",
        "new",
        "underachiever",
        "argument",
        "along",
        "following",
        "line",
        "god",
        "allpowerful",
        "allknowing",
        "allgood",
        "world",
        "would",
        "best",
        "possible",
        "world",
        "surely",
        "world",
        "best",
        "possible",
        "world",
        "thus",
        "god",
        "allpowerful",
        "allknowing",
        "allgood",
        "leibniz",
        "belief",
        "however",
        "overwhelming",
        "evidence",
        "conclusion",
        "argument",
        "false",
        "therefore",
        "must",
        "take",
        "one",
        "two",
        "premise",
        "argument",
        "false",
        "given",
        "committed",
        "first",
        "premise",
        "must",
        "reject",
        "second",
        "premise",
        "precisely",
        "reason",
        "leibniz",
        "asks",
        "critic",
        "thinking",
        "true",
        "leibniz",
        "address",
        "issue",
        "usually",
        "critic",
        "say",
        "something",
        "along",
        "following",
        "line",
        "surely",
        "world",
        "best",
        "possible",
        "world",
        "since",
        "easily",
        "conceive",
        "possible",
        "world",
        "better",
        "take",
        "token",
        "instance",
        "suffering",
        "tragic",
        "bombing",
        "oklahoma",
        "city",
        "federal",
        "building",
        "surely",
        "world",
        "without",
        "event",
        "would",
        "better",
        "actual",
        "world",
        "reason",
        "god",
        "could",
        "nt",
        "created",
        "world",
        "without",
        "event",
        "thus",
        "best",
        "possible",
        "world",
        "see",
        "theodicy",
        "h",
        "g",
        "vi",
        "leibniz",
        "s",
        "response",
        "sort",
        "criticism",
        "come",
        "two",
        "stage",
        "first",
        "leibniz",
        "say",
        "think",
        "certain",
        "token",
        "feature",
        "world",
        "might",
        "better",
        "know",
        "whether",
        "possible",
        "create",
        "better",
        "world",
        "lacking",
        "feature",
        "never",
        "certain",
        "nature",
        "connection",
        "token",
        "event",
        "question",
        "event",
        "world",
        "could",
        "improve",
        "eliminate",
        "token",
        "event",
        "question",
        "without",
        "otherwise",
        "changing",
        "world",
        "might",
        "well",
        "better",
        "world",
        "unfortunately",
        "way",
        "knowing",
        "whether",
        "change",
        "token",
        "event",
        "would",
        "leave",
        "world",
        "otherwise",
        "unchanged",
        "might",
        "instead",
        "make",
        "thing",
        "balance",
        "worse",
        "see",
        "theodicy",
        "h",
        "g",
        "vi",
        "gr",
        "pf",
        "example",
        "sort",
        "response",
        "second",
        "example",
        "deceptive",
        "presume",
        "god",
        "utilizes",
        "standard",
        "world",
        "goodness",
        "may",
        "fact",
        "use",
        "example",
        "may",
        "presume",
        "world",
        "good",
        "part",
        "taken",
        "isolation",
        "good",
        "standard",
        "seen",
        "leibniz",
        "reject",
        "might",
        "presume",
        "world",
        "good",
        "human",
        "being",
        "enjoy",
        "happiness",
        "leibniz",
        "argues",
        "numerous",
        "text",
        "parochial",
        "think",
        "human",
        "happiness",
        "standard",
        "whereby",
        "goodness",
        "world",
        "judged",
        "reasonable",
        "standard",
        "according",
        "leibniz",
        "would",
        "happiness",
        "sentient",
        "being",
        "admit",
        "may",
        "turn",
        "amount",
        "unhappiness",
        "created",
        "realm",
        "quite",
        "small",
        "given",
        "know",
        "sentient",
        "being",
        "earth",
        "might",
        "constitute",
        "small",
        "percentage",
        "sentient",
        "being",
        "created",
        "god",
        "leibniz",
        "includes",
        "preternatural",
        "being",
        "angel",
        "also",
        "possibility",
        "extraterrestrial",
        "rational",
        "being",
        "theodicy",
        "h",
        "g",
        "vi",
        "disagreement",
        "among",
        "leibniz",
        "scholar",
        "basis",
        "judging",
        "goodness",
        "world",
        "various",
        "scholar",
        "defended",
        "one",
        "following",
        "best",
        "world",
        "one",
        "maximizes",
        "happiness",
        "ie",
        "virtue",
        "rational",
        "being",
        "best",
        "world",
        "one",
        "maximizes",
        "quantity",
        "essence",
        "best",
        "world",
        "one",
        "yield",
        "greatest",
        "variety",
        "phenomenon",
        "governed",
        "simplest",
        "set",
        "law",
        "scholarly",
        "dispute",
        "whether",
        "leibniz",
        "believed",
        "maximization",
        "happiness",
        "virtue",
        "rational",
        "being",
        "one",
        "standard",
        "god",
        "judge",
        "goodness",
        "world",
        "supporter",
        "claim",
        "see",
        "rutherford",
        "c",
        "blumenfeld",
        "brown",
        "detractor",
        "see",
        "russell",
        "p",
        "gale",
        "unlikely",
        "leibniz",
        "believed",
        "alone",
        "true",
        "standard",
        "goodness",
        "world",
        "light",
        "following",
        "comment",
        "argument",
        "advanced",
        "bayle",
        "author",
        "still",
        "presupposing",
        "false",
        "maxim",
        "stating",
        "happiness",
        "rational",
        "creature",
        "sole",
        "aim",
        "god",
        "theodicy",
        "h",
        "g",
        "vi",
        "part",
        "dispute",
        "standard",
        "hang",
        "whether",
        "compatible",
        "metaphysical",
        "standard",
        "embodied",
        "since",
        "metaphysical",
        "standard",
        "leibniz",
        "seems",
        "endorse",
        "consistently",
        "case",
        "leibniz",
        "writes",
        "standard",
        "happiness",
        "fully",
        "compatible",
        "metaphysical",
        "criterion",
        "example",
        "within",
        "single",
        "work",
        "discourse",
        "metaphysics",
        "leibniz",
        "entitled",
        "section",
        "rule",
        "perfection",
        "divine",
        "conduct",
        "consist",
        "simplicity",
        "way",
        "balance",
        "richness",
        "effect",
        "entitled",
        "section",
        "god",
        "monarch",
        "perfect",
        "republic",
        "composed",
        "mind",
        "happiness",
        "city",
        "god",
        "principal",
        "purpose",
        "leibniz",
        "seems",
        "advance",
        "standard",
        "work",
        "another",
        "example",
        "see",
        "r",
        "p",
        "k",
        "x",
        "pp",
        "place",
        "however",
        "writes",
        "compete",
        "one",
        "another",
        "see",
        "theodicy",
        "h",
        "g",
        "vi",
        "whatever",
        "position",
        "one",
        "come",
        "hold",
        "matter",
        "leibniz",
        "often",
        "point",
        "metaphysical",
        "standard",
        "one",
        "god",
        "utilizes",
        "assessing",
        "goodness",
        "world",
        "controversy",
        "exactly",
        "metaphysical",
        "standard",
        "leibniz",
        "endorses",
        "general",
        "leibniz",
        "hold",
        "god",
        "creates",
        "world",
        "order",
        "share",
        "goodness",
        "created",
        "thing",
        "perfect",
        "manner",
        "possible",
        "gr",
        "light",
        "fact",
        "created",
        "being",
        "virtue",
        "limitation",
        "mirror",
        "divine",
        "goodness",
        "limited",
        "respect",
        "god",
        "creates",
        "variety",
        "thing",
        "essence",
        "reflects",
        "different",
        "facet",
        "divine",
        "perfection",
        "unique",
        "way",
        "since",
        "god",
        "s",
        "purpose",
        "creating",
        "world",
        "would",
        "reasonable",
        "think",
        "maximizing",
        "mirroring",
        "divine",
        "goodness",
        "creation",
        "goal",
        "god",
        "seek",
        "achieve",
        "fact",
        "one",
        "standard",
        "leibniz",
        "seems",
        "endorse",
        "might",
        "call",
        "maximization",
        "essence",
        "standard",
        "leibniz",
        "seems",
        "convinced",
        "actual",
        "world",
        "meet",
        "standard",
        "creature",
        "found",
        "mirror",
        "divine",
        "perfection",
        "sort",
        "way",
        "creature",
        "thus",
        "creature",
        "body",
        "creature",
        "without",
        "creature",
        "freedom",
        "intelligence",
        "creature",
        "without",
        "creature",
        "sentience",
        "creature",
        "without",
        "etc",
        "see",
        "example",
        "mp",
        "pp",
        "g",
        "vii",
        "text",
        "however",
        "leibniz",
        "frame",
        "standard",
        "goodness",
        "taken",
        "third",
        "distinct",
        "way",
        "place",
        "argues",
        "goodness",
        "world",
        "measured",
        "ratio",
        "variety",
        "phenomenon",
        "world",
        "contains",
        "simplicity",
        "law",
        "govern",
        "world",
        "leibniz",
        "emphasizes",
        "fact",
        "perfection",
        "world",
        "maximizes",
        "variety",
        "phenomenon",
        "contains",
        "enhanced",
        "simplicity",
        "law",
        "since",
        "display",
        "intelligence",
        "creator",
        "created",
        "scholar",
        "argued",
        "one",
        "two",
        "metaphysical",
        "standard",
        "represents",
        "leibniz",
        "s",
        "settled",
        "view",
        "true",
        "standard",
        "goodness",
        "gale",
        "example",
        "scholar",
        "argued",
        "end",
        "two",
        "standard",
        "exclusive",
        "see",
        "rutherford",
        "cc",
        "rescher",
        "c",
        "two",
        "different",
        "way",
        "harmonizing",
        "regardless",
        "interpretation",
        "correct",
        "standard",
        "god",
        "judge",
        "world",
        "s",
        "goodness",
        "becomes",
        "much",
        "difficult",
        "defend",
        "claim",
        "best",
        "possible",
        "world",
        "use",
        "standard",
        "illustrate",
        "order",
        "example",
        "god",
        "eliminate",
        "oklahoma",
        "city",
        "bombing",
        "world",
        "would",
        "required",
        "order",
        "presumably",
        "number",
        "way",
        "might",
        "done",
        "obvious",
        "would",
        "involve",
        "miraculous",
        "intervention",
        "somewhere",
        "chain",
        "event",
        "leading",
        "explosion",
        "god",
        "might",
        "miraculously",
        "prevent",
        "explosive",
        "detonating",
        "might",
        "eliminate",
        "truck",
        "content",
        "world",
        "sort",
        "miraculous",
        "intervention",
        "would",
        "require",
        "law",
        "governing",
        "world",
        "become",
        "complex",
        "consequently",
        "leibniz",
        "others",
        "share",
        "view",
        "goodness",
        "world",
        "consists",
        "malebranche",
        "think",
        "miraculous",
        "intervention",
        "generally",
        "repugnant",
        "would",
        "require",
        "vastly",
        "outweighing",
        "good",
        "result",
        "miraculous",
        "intervention",
        "order",
        "intervention",
        "permissible",
        "see",
        "theodicy",
        "h",
        "g",
        "vi",
        "event",
        "leibniz",
        "hold",
        "simply",
        "unable",
        "know",
        "changing",
        "certain",
        "event",
        "would",
        "change",
        "world",
        "s",
        "capacity",
        "meet",
        "standard",
        "goodness",
        "described",
        "thus",
        "according",
        "leibniz",
        "justified",
        "claiming",
        "world",
        "good",
        "thing",
        "considered",
        "possible",
        "world",
        "according",
        "leibniz",
        "underachiever",
        "problem",
        "get",
        "ground",
        "unless",
        "critic",
        "able",
        "defend",
        "claim",
        "world",
        "best",
        "possible",
        "world",
        "noted",
        "leibniz",
        "s",
        "approach",
        "underachiever",
        "problem",
        "thus",
        "seems",
        "immune",
        "line",
        "criticism",
        "pressed",
        "voltaire",
        "candide",
        "namely",
        "obvious",
        "world",
        "best",
        "possible",
        "world",
        "many",
        "manifest",
        "evil",
        "leibniz",
        "believe",
        "individual",
        "event",
        "best",
        "possible",
        "event",
        "think",
        "possible",
        "finite",
        "mind",
        "demonstrate",
        "every",
        "individual",
        "event",
        "must",
        "part",
        "best",
        "possible",
        "world",
        "rather",
        "belief",
        "world",
        "whole",
        "best",
        "possible",
        "world",
        "said",
        "noted",
        "considerable",
        "scholarly",
        "controversy",
        "whether",
        "voltaire",
        "s",
        "target",
        "candide",
        "indeed",
        "leibniz",
        "claimed",
        "example",
        "optimism",
        "lampooned",
        "candide",
        "closer",
        "pope",
        "see",
        "rutherford",
        "general",
        "reception",
        "leibniz",
        "france",
        "see",
        "barber",
        "event",
        "leibniz",
        "s",
        "view",
        "inability",
        "know",
        "changing",
        "certain",
        "event",
        "world",
        "would",
        "affect",
        "event",
        "inability",
        "know",
        "change",
        "would",
        "affect",
        "overall",
        "goodness",
        "world",
        "make",
        "impossible",
        "defend",
        "claim",
        "manifest",
        "evil",
        "world",
        "constitute",
        "evidence",
        "best",
        "possible",
        "world"
    ]
}