{
    "main_text": "Jewish Faith and Jewish Law || Faith, Practice, and God\n4.1 Faith, Practice, and God\n\nWhile Leibowitz’s very bare account of faith seems hardly robust\nenough as an account of religious commitment, there is more to be said\nfor Leibowitz’s account than first might seem.\n\nThe claim ultimately for Leibowitz – that the practice of\nhalakhah constitutes faith, while faith is the basis for practice\n– can be broken down into the following two claims:\n\nClaim 1:\n\nFaith is defined as, or constituted by halakhic practice.\n\nClaim 2:\n\nFaith, defined as halakhic practice, is founded on that practice.\n\nClaim 1 can initially be understood as the simple\nempirical/theological claim discussed at the beginning of section 4.\nIn Claim 2, Leibowitz’s point appears to be\nthat while one may wish to argue that one’s practice is founded\non some independently specifiable faith such as the belief that God\ngave these commandments to the Jewish people, given that belief in God\nhas no meaning other than one’s committed practice, in fact\none’s commitment to halakhic practice cannot but be founded on\nthe practice itself.\n\nThe first thing to note here is that as a matter of empirical fact,\nClaim 2 is more often than not true. It is indeed\nusually the case that halakhic practice precedes belief in God, such\nthat one’s initial practice is not based on that belief in any\nmeaningful sense. At the point at which we are beings who are able to\nreflect thoughtfully about our commitment to our practices and the\norigins of that commitment, we are already implicated in and formed by\nthem. Thus, practice is generally not based on an initial belief in\nGod, but on practice itself, passed down through parents or others. It\nis only subsequent to being committed to the practice that we reflect,\nanalyse, and even formulate the very idea that we are practicing out\nof a commitment to God. Talk of God thus supervenes on the commitment\nto the practice rather than being a justification for it. Jewish\nfaith, Leibowitz tells us, “cannot be understood at all if the\nTorah and its precepts are not construed as data preceding recognition\nof the Giver of the Torah” (Judaism, 5).\n\nThis goes on to yield an important sense in which Leibowitz’s\ncircle is a virtuous one. Over time if we are good Leibowitzians who\nobserve the mitzvoth, presumably including that of study of Torah\nitself, we will come to understand that this very practice in fact\ndefines the nature of Jewish faith altogether. Thus Claim\n1, initially understood as a historical definition, takes on\nepistemic meaning for the person who practices mitzvoth. One will\nunderstand that faith is indeed this commitment to practice and\nnothing else – for Leibowitz “the purpose of the mitzvoth\nis to educate man to recognize that knowing God and cleaving to him\nconsist in the practice of these very precepts”\n(Judaism, 27). What one comes to realize is that the faith\ncommitment cannot be cashed out other than in terms of that practice\nitself. One might thus read Claim 2 as saying that\nfaith is founded on mitzvoth, in the sense both of being acquired and\nmaintained through practice, and also by creating the understanding of\nfaith spoken of in Claim 1, as over time one comes to\nunderstand that Jewish faith can indeed only be defined\npractically. Much as Aristotle believed that virtuous action precedes\nthe true acquisition of the virtues – the latter involves that\nwe know what we are doing – our commitment to the mitzvoth and\nknowledge of their definitive role within Jewish faith (Claim\n1), or at least the conscious commitment that we make to this\nas reflective beings, is founded on or created by participation in\nthose very halakhic practices (Claim\n 2).[12]\n Just as for Aristotle it is only once we have acquired the virtues\nthat those same acts becomes truly virtuous, in the same way halakhic\nactions only latterly become true acts of religious faith, in which\none is conscious of the manner in which they constitute faith.\n\nOne might therefore argue that the virtue of the circle is that\ncontinued practice reinforces faith – the practical circle\nis persuasive as a way of reinforcing faith (i.e., practice\nof the mitzvoth) in a way that the circle of logical justification is\nnot. In the original version of this entry, this idea was used to\nargue that Leibowitz could in this way be seen as offering a\nquasi-justificatory phenomenology of faith, whereby the meaning of\nmitzvoth is revealed to its adherents through practice in a manner\nthat simply cannot be presented in discursive terms. As Leibowitz\nwrites in homage to Wittgenstein: “That which cannot be said, is\nsaid by the religion of the Torah and the Mitzvoth,”\n(Yahadut, 343) – or at least by a commitment to them\nthat cannot be given a specification independent of their practice.\nYonatan Brafman, however, correctly points out that “if\none’s commitment to halakhic norms stems from habituation to\ntheir practice, then one has not adopted service of God as a\nvalue” (Brafman, 2014, 82–83); as we noted earlier, it is\nonly if intended as worship of God that an act is a genuine act of\nreligious faith. At the same time, if “service of God” can\nonly be specified in terms of practice, the extent to which such\nhabituation differs from this “service of God” is not\nentirely clear.\n\nUltimately then, the central problem that Brafman’s critique\nhighlights is that of the difficulty Leibowitz has in specifying any\ncontent for the intent to serve God beyond the commitment to the\npractice. First, what meaning can Leibowitz give to the idea that God\nexists as the object of our worship? It would appear that Leibowitz\nmust at least retain an ontological commitment to there being an\nentity that we can call God, to whom halakhic practices are directed,\nsuch that “God is radically transcendent” remains a\ncognitive statement. But beyond that, there is nothing more that can\nbe said. Of possibly greater concern though is the related question of\nhow the mitzvoth can be seen to be God’s commands. The mitzvoth\nare only “holy” inasmuch as they constitute holiness\nthrough being God’s commands. It is in this way that\nthis practice can constitute faith. Otherwise his model renders\nany commitment to a value system an expression of faith, at\nleast in the sense of being a conative leap that cannot be a result of\nrational\n reflection.[13]\n What then marks this out as Jewish faith is simply that it\nis the Jewish form of life, one that derives from specifically Jewish\nsources and has a specifically Jewish history. But as noted\npreviously, Leibowitz cannot construe statements in the Torah\nregarding the event of revelation at Sinai as historical statements.\nSo the problem remains of how a people could have actually been\ncommanded if it is not the case that at some point in history the\ncommandments were revealed by God. That they could not have been on\nLeibowitz’s theology, renders problematic the idea that they are\nGod’s commands in any meaningful sense, and that our practice is\nthus divine worship.\n\nThe problem here for Leibowitz is that mitzvoth are indeed enacted by\nhuman beings and thus play a role in the natural world. As a result,\nthey must have a history. At the very least we can say that\nat some point they made their incursion into history. But how? If not\nthrough some miraculous revelatory event – a possibility that\nLeibowitz excludes – then it must have been through some form of\nhuman initiative. Thus, in parallel to the attribution of divinity to\nScripture, as Sagi notes, “the system is made religiously\nmeaningful by the believers’ perception of it as concerned with\nthe worship of God,” while God collapses into a formal\nrequirement of the system, “the supreme concept, uniting the\nsystem and endowing it with religious significance” (Sagi 1997a,\n213). Though it is not clear that this would concern Leibowitz, one\nought to note that the mere institutional decision to categorize the\nmitzvoth as holy is hardly a firm basis for recovering their divinity\nin any sense that would satisfy most of the religious adherents the\nnature of whose faith he is attempting to delineate.\n\nLeibowitz’s exclusion of God from history thus leaves him\napparently unable to account for the divinity of the commandments in a\nmanner that would render their performance acts of commitment to\nGod in the ordinary sense. Indeed, when asked directly whether\nthe statement “I believe in God” is meaningful,\nLeibowitz’s response was: “I do not understand these words\nif they are divorced from the obligations that derive from them\n… faith in God is not what I know about God, but what I know\nabout my obligations to God” (Sihot, 97). Talk of\ndivinity should not be understood cognitively but in terms of the\nnormative demands it imposes. Even talk of the revelation at Sinai is\nto be construed along these lines – “The meaning of the\nrevelation at Sinai is the recognition of the command that we have\nbeen commanded” (Emunah, 154). Again, whether this\nyields a system that can genuinely be termed divine rather than one\nthat is merely designated as such by humans, who after all, for\nLeibowitz, cannot themselves be a locus of holiness, is brought into\nquestion.\n",
    "section_title": "4.1 Faith, Practice, and God",
    "entry_title": "Yeshayahu Leibowitz",
    "hierarchy_title": "Yeshayahu Leibowitz || Jewish Faith and Jewish Law || Faith, Practice, and God",
    "tokenized_text": [
        "jewish",
        "faith",
        "jewish",
        "law",
        "faith",
        "practice",
        "god",
        "faith",
        "practice",
        "god",
        "leibowitz",
        "bare",
        "account",
        "faith",
        "seems",
        "hardly",
        "robust",
        "enough",
        "account",
        "religious",
        "commitment",
        "said",
        "leibowitz",
        "account",
        "first",
        "might",
        "seem",
        "claim",
        "ultimately",
        "leibowitz",
        "practice",
        "halakhah",
        "constitutes",
        "faith",
        "faith",
        "basis",
        "practice",
        "broken",
        "following",
        "two",
        "claim",
        "claim",
        "faith",
        "defined",
        "constituted",
        "halakhic",
        "practice",
        "claim",
        "faith",
        "defined",
        "halakhic",
        "practice",
        "founded",
        "practice",
        "claim",
        "initially",
        "understood",
        "simple",
        "empiricaltheological",
        "claim",
        "discussed",
        "beginning",
        "section",
        "claim",
        "leibowitz",
        "point",
        "appears",
        "one",
        "may",
        "wish",
        "argue",
        "one",
        "practice",
        "founded",
        "independently",
        "specifiable",
        "faith",
        "belief",
        "god",
        "gave",
        "commandment",
        "jewish",
        "people",
        "given",
        "belief",
        "god",
        "meaning",
        "one",
        "committed",
        "practice",
        "fact",
        "one",
        "commitment",
        "halakhic",
        "practice",
        "founded",
        "practice",
        "first",
        "thing",
        "note",
        "matter",
        "empirical",
        "fact",
        "claim",
        "often",
        "true",
        "indeed",
        "usually",
        "case",
        "halakhic",
        "practice",
        "precedes",
        "belief",
        "god",
        "one",
        "initial",
        "practice",
        "based",
        "belief",
        "meaningful",
        "sense",
        "point",
        "being",
        "able",
        "reflect",
        "thoughtfully",
        "commitment",
        "practice",
        "origin",
        "commitment",
        "already",
        "implicated",
        "formed",
        "thus",
        "practice",
        "generally",
        "based",
        "initial",
        "belief",
        "god",
        "practice",
        "passed",
        "parent",
        "others",
        "subsequent",
        "committed",
        "practice",
        "reflect",
        "analyse",
        "even",
        "formulate",
        "idea",
        "practicing",
        "commitment",
        "god",
        "talk",
        "god",
        "thus",
        "supervenes",
        "commitment",
        "practice",
        "rather",
        "justification",
        "jewish",
        "faith",
        "leibowitz",
        "tell",
        "u",
        "understood",
        "torah",
        "precept",
        "construed",
        "data",
        "preceding",
        "recognition",
        "giver",
        "torah",
        "judaism",
        "go",
        "yield",
        "important",
        "sense",
        "leibowitz",
        "circle",
        "virtuous",
        "one",
        "time",
        "good",
        "leibowitzians",
        "observe",
        "mitzvah",
        "presumably",
        "including",
        "study",
        "torah",
        "come",
        "understand",
        "practice",
        "fact",
        "defines",
        "nature",
        "jewish",
        "faith",
        "altogether",
        "thus",
        "claim",
        "initially",
        "understood",
        "historical",
        "definition",
        "take",
        "epistemic",
        "meaning",
        "person",
        "practice",
        "mitzvah",
        "one",
        "understand",
        "faith",
        "indeed",
        "commitment",
        "practice",
        "nothing",
        "else",
        "leibowitz",
        "purpose",
        "mitzvah",
        "educate",
        "man",
        "recognize",
        "knowing",
        "god",
        "cleaving",
        "consist",
        "practice",
        "precept",
        "judaism",
        "one",
        "come",
        "realize",
        "faith",
        "commitment",
        "cashed",
        "term",
        "practice",
        "one",
        "might",
        "thus",
        "read",
        "claim",
        "saying",
        "faith",
        "founded",
        "mitzvah",
        "sense",
        "acquired",
        "maintained",
        "practice",
        "also",
        "creating",
        "understanding",
        "faith",
        "spoken",
        "claim",
        "time",
        "one",
        "come",
        "understand",
        "jewish",
        "faith",
        "indeed",
        "defined",
        "practically",
        "much",
        "aristotle",
        "believed",
        "virtuous",
        "action",
        "precedes",
        "true",
        "acquisition",
        "virtue",
        "latter",
        "involves",
        "know",
        "commitment",
        "mitzvah",
        "knowledge",
        "definitive",
        "role",
        "within",
        "jewish",
        "faith",
        "claim",
        "least",
        "conscious",
        "commitment",
        "make",
        "reflective",
        "being",
        "founded",
        "created",
        "participation",
        "halakhic",
        "practice",
        "claim",
        "aristotle",
        "acquired",
        "virtue",
        "act",
        "becomes",
        "truly",
        "virtuous",
        "way",
        "halakhic",
        "action",
        "latterly",
        "become",
        "true",
        "act",
        "religious",
        "faith",
        "one",
        "conscious",
        "manner",
        "constitute",
        "faith",
        "one",
        "might",
        "therefore",
        "argue",
        "virtue",
        "circle",
        "continued",
        "practice",
        "reinforces",
        "faith",
        "practical",
        "circle",
        "persuasive",
        "way",
        "reinforcing",
        "faith",
        "ie",
        "practice",
        "mitzvah",
        "way",
        "circle",
        "logical",
        "justification",
        "original",
        "version",
        "entry",
        "idea",
        "used",
        "argue",
        "leibowitz",
        "could",
        "way",
        "seen",
        "offering",
        "quasijustificatory",
        "phenomenology",
        "faith",
        "whereby",
        "meaning",
        "mitzvah",
        "revealed",
        "adherent",
        "practice",
        "manner",
        "simply",
        "presented",
        "discursive",
        "term",
        "leibowitz",
        "writes",
        "homage",
        "wittgenstein",
        "said",
        "said",
        "religion",
        "torah",
        "mitzvah",
        "yahadut",
        "least",
        "commitment",
        "given",
        "specification",
        "independent",
        "practice",
        "yonatan",
        "brafman",
        "however",
        "correctly",
        "point",
        "one",
        "commitment",
        "halakhic",
        "norm",
        "stem",
        "habituation",
        "practice",
        "one",
        "adopted",
        "service",
        "god",
        "value",
        "brafman",
        "noted",
        "earlier",
        "intended",
        "worship",
        "god",
        "act",
        "genuine",
        "act",
        "religious",
        "faith",
        "time",
        "service",
        "god",
        "specified",
        "term",
        "practice",
        "extent",
        "habituation",
        "differs",
        "service",
        "god",
        "entirely",
        "clear",
        "ultimately",
        "central",
        "problem",
        "brafman",
        "critique",
        "highlight",
        "difficulty",
        "leibowitz",
        "specifying",
        "content",
        "intent",
        "serve",
        "god",
        "beyond",
        "commitment",
        "practice",
        "first",
        "meaning",
        "leibowitz",
        "give",
        "idea",
        "god",
        "exists",
        "object",
        "worship",
        "would",
        "appear",
        "leibowitz",
        "must",
        "least",
        "retain",
        "ontological",
        "commitment",
        "entity",
        "call",
        "god",
        "halakhic",
        "practice",
        "directed",
        "god",
        "radically",
        "transcendent",
        "remains",
        "cognitive",
        "statement",
        "beyond",
        "nothing",
        "said",
        "possibly",
        "greater",
        "concern",
        "though",
        "related",
        "question",
        "mitzvah",
        "seen",
        "god",
        "command",
        "mitzvah",
        "holy",
        "inasmuch",
        "constitute",
        "holiness",
        "god",
        "command",
        "way",
        "practice",
        "constitute",
        "faith",
        "otherwise",
        "model",
        "render",
        "commitment",
        "value",
        "system",
        "expression",
        "faith",
        "least",
        "sense",
        "conative",
        "leap",
        "result",
        "rational",
        "reflection",
        "mark",
        "jewish",
        "faith",
        "simply",
        "jewish",
        "form",
        "life",
        "one",
        "derives",
        "specifically",
        "jewish",
        "source",
        "specifically",
        "jewish",
        "history",
        "noted",
        "previously",
        "leibowitz",
        "construe",
        "statement",
        "torah",
        "regarding",
        "event",
        "revelation",
        "sinai",
        "historical",
        "statement",
        "problem",
        "remains",
        "people",
        "could",
        "actually",
        "commanded",
        "case",
        "point",
        "history",
        "commandment",
        "revealed",
        "god",
        "could",
        "leibowitz",
        "theology",
        "render",
        "problematic",
        "idea",
        "god",
        "command",
        "meaningful",
        "sense",
        "practice",
        "thus",
        "divine",
        "worship",
        "problem",
        "leibowitz",
        "mitzvah",
        "indeed",
        "enacted",
        "human",
        "being",
        "thus",
        "play",
        "role",
        "natural",
        "world",
        "result",
        "must",
        "history",
        "least",
        "say",
        "point",
        "made",
        "incursion",
        "history",
        "miraculous",
        "revelatory",
        "event",
        "possibility",
        "leibowitz",
        "excludes",
        "must",
        "form",
        "human",
        "initiative",
        "thus",
        "parallel",
        "attribution",
        "divinity",
        "scripture",
        "sagi",
        "note",
        "system",
        "made",
        "religiously",
        "meaningful",
        "believer",
        "perception",
        "concerned",
        "worship",
        "god",
        "god",
        "collapse",
        "formal",
        "requirement",
        "system",
        "supreme",
        "concept",
        "uniting",
        "system",
        "endowing",
        "religious",
        "significance",
        "sagi",
        "a",
        "though",
        "clear",
        "would",
        "concern",
        "leibowitz",
        "one",
        "ought",
        "note",
        "mere",
        "institutional",
        "decision",
        "categorize",
        "mitzvah",
        "holy",
        "hardly",
        "firm",
        "basis",
        "recovering",
        "divinity",
        "sense",
        "would",
        "satisfy",
        "religious",
        "adherent",
        "nature",
        "whose",
        "faith",
        "attempting",
        "delineate",
        "leibowitz",
        "exclusion",
        "god",
        "history",
        "thus",
        "leaf",
        "apparently",
        "unable",
        "account",
        "divinity",
        "commandment",
        "manner",
        "would",
        "render",
        "performance",
        "act",
        "commitment",
        "god",
        "ordinary",
        "sense",
        "indeed",
        "asked",
        "directly",
        "whether",
        "statement",
        "believe",
        "god",
        "meaningful",
        "leibowitz",
        "response",
        "understand",
        "word",
        "divorced",
        "obligation",
        "derive",
        "faith",
        "god",
        "know",
        "god",
        "know",
        "obligation",
        "god",
        "sihot",
        "talk",
        "divinity",
        "understood",
        "cognitively",
        "term",
        "normative",
        "demand",
        "imposes",
        "even",
        "talk",
        "revelation",
        "sinai",
        "construed",
        "along",
        "line",
        "meaning",
        "revelation",
        "sinai",
        "recognition",
        "command",
        "commanded",
        "emunah",
        "whether",
        "yield",
        "system",
        "genuinely",
        "termed",
        "divine",
        "rather",
        "one",
        "merely",
        "designated",
        "human",
        "leibowitz",
        "locus",
        "holiness",
        "brought",
        "question"
    ]
}