{
    "main_text": "Philosophical Aspects of Leśniewski’s Logic || Semantic Categories\n4.1 Semantic Categories\n\n \nOne of Leśniewski’s most lasting contributions to the metatheory\nof logic is his theory of semantic categories. This replaced the\ntheory of simple types which he developed in 1921, about which he\nwrote, “[E]ven as I was constructing my theory of types, I\nconsidered it to be only an inadequate stop-gap […] In 1922 I\noutlined a concept of semantical categories as a replacement for the\nhierarchy of types, which is quite unintuitive to me”\n(Collected Works, 421). In type theory, expressions belonging\nto different logical types cannot be substituted for one another\nwithout turning grammatical or well-formed expressions into\nungrammatical or ill-formed ones. Only well-formed or grammatical\nexpressions may have a sense or meaning. The theory was developed by\nBertrand Russell as a way of blocking set-theoretic paradoxes, though\nthere were anticipations in the work of Ernst Schröder and\nGottlob Frege. In type theory it is usually assumed that variables at\neach type range over a domain of entities specific to that type, and\nthat all such domains are mutually disjoint. In Frege for instance\nthe domains were objects and functions of various levels, while in\nRussell they are usually taken to be a hierarchy of propositional\nfunctions. This presumptively platonistic and ontologically\ninflationary position was naturally uncongenial to the nominalist\nLeśniewski, and he readjusted the notion of category, turning\ncategories from classes of entities (with their attendant expressions)\nto classes of expressions alone. His inspiration was in part the\ntraditional syntactic theory of different parts of speech, and in part\nHusserl’s theory of Bedeutungskategorien (meaning categories)\nfrom the latter’s Logical Investigations. Where Husserl’s\ncategories were of abstract meanings, Leśniewski, ever the\nnominalist, substituted categories of (concrete) expressions. Although\nlike later writers he could have called the classes of expressions\n‘syntactic categories’, he deliberately chose the\nexpression ‘semantic categories’ in order to emphasize\nthat the expressions combined grammatically are all meaningful, unlike\nthe meaningless marks proposed by formalist writers of the Hilbert\nSchool.\n\n Leśniewski himself never gave an explicit formulation of the\ntheory of semantic categories, being content to work with them in\npractice. The first formulation was by his contemporary Kazimierz\nAjdukiewicz, in the 1935 article ‘Syntactic Connection’.\nAjdukiewicz’s essay became the fountainhead of the subsequent\nsubdiscipline of categorial grammar. Modifying Ajdukiewicz’s\nnotation, we may explain semantic categories as Leśniewski used\nthem. Leśniewski thought that the theory applies only to\nhis logical systems, not to ordinary language,\nabout which he became rather sceptical as to its ability\nto be unambiguously precise. Subsequently it has been shown that\ncategorial grammar can be applied quite successfully to the syntax of\nnatural languages.\n\n There are in Leśniewski two basic categories: sentence (S) and\nname (N). In Protothetic, only the former is used: Ontology and\nMereology add the latter. The distinction between sentences and names\nis ultimate: what we can say about sentences is that they are there to\nsay things that are true or false (obviously from a logical point of\nview we are overlooking questions and commands), whereas names are\nthere to denote things. Leśniewski, following tradition, allows\nnames to denote several things, or one thing, or indeed no things as\nall. So ‘Istanbul’ denotes one thing, namely the Turkish\ncity, ‘city’ denotes many things, namely all cities, and\n‘unicorn’ denotes nothing at all. In\nLeśniewski’s mature work Mill’s notion of connotation\nis dropped, along with the concept of property which it employs, so the\nsole logical function of names is denoting. Again following tradition\nrather than the modern approach of Frege and Russell, Leśniewski\nmakes no syntactic distinction between general terms or common\nnouns on the one hand and singular terms or proper names on the other.\nThis is often said to be because his native Polish lacks definite and\nindefinite articles, which make the distinction more grammatically\nobvious, but this conjecture is nonsense because Leśniewski spoke\nand wrote fluent German, and German is awash with articles. It seems much more\nlikely that Leśniewski deliberately chose to follow the\ntraditional rather than the modern way because he thought it both more\nexpressively powerful and closer to natural language.\n\n Since language does not consist solely of unarticulated sentences or\nnames, there are expressions of other categories, which combine in a\nrule-governed way with one another to produce further expressions,\nultimately sentences. In the regimented environment of\nLeśniewski’s logical languages this always takes place in\nthe following way: a combining expression, which we may call a\nfunctor, precedes a left parenthesis of some kind, which is\nthen followed by a sequence of one or more argument\nexpressions, followed by a right parenthesis symmetric to the other\none, which terminates the complex. The general schema is then\n\n functor + left parenthesis + argument 1 + … + argument \\(n\\) + right parenthesis\n\n\n \nas exemplified by\n\n\\[F(a_1 \\ldots a_n)\n\\]\n\n \nor, more concretely, \\({\\sim}(p), \\koppa(pq), \\isa \\{Aa\\}\\).\n\n Now let us provide a notation, inspired by Ajdukiewicz, for the\ncategory of a functor such as ‘\\(F\\)’. If the category of\n‘\\(a_1\\)’ is \\(\\alpha_1\\), the category of\n‘\\(a_n\\)’ is \\(\\alpha_n\\), and the category of the whole\nexpression ‘\\(F(a_1 \\ldots a_n)\\)’ is \\(\\beta\\), then the\ncategory of the functor expression ‘\\(F\\)’ we write as\n\n\\[\\beta \\langle \\alpha_1 \\ldots \\alpha_n \\rangle\n\\]\n\n\n \nwhich indicates the category of the output to the left and the\ncategory of its inputs in order within the angled brackets. Call this\nthe categorial index of the expression. Thus the category of\nsentential negation is\n \\(\\rS\\langle\\rS\\rangle\\),\n that of conjunction is\n\\(\\rS\\langle\\rS\\rS\\rangle\\),\n while that of the epsilon functor ‘\\(\\isa\\)’ is \n \\(\\rS\\langle\\rN\\rN\\rangle\\),\n since it builds a sentence using two names as arguments.\n\n What Ajdukiewicz showed in his 1935 paper was that we can develop a\ncalculus of grammatical combination using such a notation: we take a\nputatively well-formed expression, rearrange it if necessary into\nfunctor-first order, then see if we can “multiply out”\narguments and functors to arrive at a single categorial index. If we\ncan, the complex expression is grammatical, well-formed, or\nsyntactically connected. For example\n‘\\(\\isa\\{Aa\\}\\)’ is syntactically connected as\nfollows: writing the category of an expression \\(e\\) as\n\\(|e|\\) we have\n\n\\[\n|\\isa | = \\rS\\langle\\rN\\rN\\rangle,\\\n|A| = |a| = \\rN, \\text{ so } |\\isa \\{Aa\\}| = \\rS\\langle\\rN\\rN\\rangle \\times (\\rN \\times \\rN) = \\rS\n\\]\n\n\n \nas we would expect. Ajdukiewicz used a “quotient”\nnotation instead of our angled brackets; this makes the idea of\n“multiplying out” more graphic, but becomes cumbersome for\ncomplex cases.\n\n There may be functors whose arguments are functors: for example a\nconjunction holding between two binary predicates has a category\n \\(\\rS\\langle\\rS\\langle\\rN\\rN\\rangle\\rS\\langle\\rN\\rN\\rangle \\rangle\\).\n There may also be what are called many-link functors, which\nare functors whose values are functors. For example, the English\nmorpheme ‘–ly’ converts an adjective, category\n \\(\\rN\\langle\\rN\\rangle\\),\n into an adverb, for example of category \n \\(\\rS\\langle\\rN\\rangle \\langle\\rS\\langle\\rN\\rangle \\rangle\\),\n so ‘–ly’ has effective category\n \\(\\rS\\langle\\rN\\rangle \\langle\\rS\\langle\\rN\\rangle \\rangle \\langle\\rN\\langle\\rN\\rangle \\rangle\\). \n In some subsequent categorial grammars, transitive verbs are quite\nplausibly taken to have the many-link category\n \\(\\rS\\langle\\rN\\rangle \\langle\\rN\\rangle\\)\n rather than the binary predicate category \n \\(\\rS\\langle\\rN\\rN\\rangle\\).\n This move is indeed a standard trick in logic, first introduced by\nMoses Schönfinkel in 1924, for dispensing with many-placed\nfunctors in favor of many-link but one-placed functors. Had he known\nof this, Leśniewski would no doubt have disapproved. While there\nis no loss of logical power in eliminating many-placed functors, the\nmove is unnatural, and Leśniewski would not have countenanced\ndefining many-placed functors as many-link ones in disguise,\nas we find in Church for instance.\n\n With the two basic categories of sentence and name, every category and\nexpression, no matter how complex, will have a categorial index\nbeginning either with ‘S’, so ultimately leading to the\nformation of a sentence, or ‘N’, so ultimately leading to\nthe formation of a name. Following a useful terminological suggestion\nof Eugene Luschei, we may call the former propositive\ncategories and expressions, the latter nominative categories\nand expressions (Luschei 1962, 169).\n\n Note that the parentheses in Leśniewski’s notation do not\nthemselves have a category: they are syncategorematic. Their function\nis twofold: to mark the beginnings and ends of argument strings, and to\nhelp indicate the semantic category of the functors. Thus\nLeśniewski used round parentheses for functors yielding sentences\nfrom sentences, i.e. connectives, and braces for functors yielding\nsentences from names, i.e. predicates. In principle an unlimited number\nof shapes of parentheses might be required, and indeed in some works of\nstudents of Sobociński there are several dozens of different\nshapes. Leśniewski gave parentheses this second role because he\nwished to remain very flexible about the forms of expression used for\nfunctors, even allowing the same shape to be used in\n“analogous” functors, for example 3-placed conjunction, or\n“higher-order” epsilons and equivalences, or other logical\nconstants. Obviously this is a contingent feature of his notation:\nother conventions will do just as well.\n\nMore important for metalogical purposes is the fact that the universal\nquantifier too is syncategorematic in Leśniewski. This is marked\nsymbolically in that the lower corners which he used to symbolize the\nuniversal quantifier are no more than a container for the variables,\nbut more crucially, in that any finite string of different variables\nmay occur in such a quantifier, no matter how assorted their\ncategories. There are some advantages in this\nflexibility. Leśniewski does not need to give rules for many\ndifferent kinds of universal quantifier, but gives rules for the one\nsort in one go. But there are some disadvantages too. In his\n“official” notation for his logics, Leśniewski has\nonly the universal quantifier, and does not define the particular\nquantifier or any others in the standard way. This was also Frege’s\npractice, but whereas in Frege’s case the parsimony seems to have been\nself-inflicted, in Leśniewski’s case there is a systematic\nreason. Leśniewski was scrupulous about giving exact rules for\nadmitting new expressions by definition. He gave such rules for\nProtothetic, and extended them to Ontology. These rules govern only\nbasic and functor category expressions. Quantifiers, being variable\nbinders, are neither basic nor functor expressions, but\nLeśniewski was unable to come up with acceptable canons of\ndefinition for such variable binders. He would have liked to have done\nso, and indeed offered students any degree they wanted, from Master’s\nto\nHabilitation, if they could formulate adequate rules, but no\none could. Therefore in the “official” system the\nuniversal quantifier remained as a syncategorematic expression, but\nstill entered into legal combinations, which meant that the syntax of\nhis systems was not fully captured by categorial grammar. Such a\nlimitation became apparent to Ajdukiewicz also, who made an\nunsuccessful attempt to rectify it. Ajdukiewicz noted perceptively\nthat a language containing Russell’s circumflex abstraction operator,\nwhich Alonzo Church had notated using the Greek lambda, would be able\nto express any operator as a combination of an abstraction operator with a\nfunctor. Church employed this method to considerable advantage in his\nlogic, but this work came too late to help Leśniewski. In any\ncase, in Church it simply pushed the problem of syncategorematicity\nover to the lambda operator.\n",
    "section_title": "4.1 Semantic Categories",
    "entry_title": "Stanisław Leśniewski",
    "hierarchy_title": "Stanisław Leśniewski || Philosophical Aspects of Leśniewski’s Logic || Semantic Categories",
    "tokenized_text": [
        "philosophical",
        "aspect",
        "leśniewski",
        "logic",
        "semantic",
        "category",
        "semantic",
        "category",
        "one",
        "leśniewski",
        "lasting",
        "contribution",
        "metatheory",
        "logic",
        "theory",
        "semantic",
        "category",
        "replaced",
        "theory",
        "simple",
        "type",
        "developed",
        "wrote",
        "e",
        "ven",
        "constructing",
        "theory",
        "type",
        "considered",
        "inadequate",
        "stopgap",
        "outlined",
        "concept",
        "semantical",
        "category",
        "replacement",
        "hierarchy",
        "type",
        "quite",
        "unintuitive",
        "collected",
        "work",
        "type",
        "theory",
        "expression",
        "belonging",
        "different",
        "logical",
        "type",
        "substituted",
        "one",
        "another",
        "without",
        "turning",
        "grammatical",
        "wellformed",
        "expression",
        "ungrammatical",
        "illformed",
        "one",
        "wellformed",
        "grammatical",
        "expression",
        "may",
        "sense",
        "meaning",
        "theory",
        "developed",
        "bertrand",
        "russell",
        "way",
        "blocking",
        "settheoretic",
        "paradox",
        "though",
        "anticipation",
        "work",
        "ernst",
        "schröder",
        "gottlob",
        "frege",
        "type",
        "theory",
        "usually",
        "assumed",
        "variable",
        "type",
        "range",
        "domain",
        "entity",
        "specific",
        "type",
        "domain",
        "mutually",
        "disjoint",
        "frege",
        "instance",
        "domain",
        "object",
        "function",
        "various",
        "level",
        "russell",
        "usually",
        "taken",
        "hierarchy",
        "propositional",
        "function",
        "presumptively",
        "platonistic",
        "ontologically",
        "inflationary",
        "position",
        "naturally",
        "uncongenial",
        "nominalist",
        "leśniewski",
        "readjusted",
        "notion",
        "category",
        "turning",
        "category",
        "class",
        "entity",
        "attendant",
        "expression",
        "class",
        "expression",
        "alone",
        "inspiration",
        "part",
        "traditional",
        "syntactic",
        "theory",
        "different",
        "part",
        "speech",
        "part",
        "husserl",
        "theory",
        "bedeutungskategorien",
        "meaning",
        "category",
        "latter",
        "logical",
        "investigation",
        "husserl",
        "category",
        "abstract",
        "meaning",
        "leśniewski",
        "ever",
        "nominalist",
        "substituted",
        "category",
        "concrete",
        "expression",
        "although",
        "like",
        "later",
        "writer",
        "could",
        "called",
        "class",
        "expression",
        "syntactic",
        "category",
        "deliberately",
        "chose",
        "expression",
        "semantic",
        "category",
        "order",
        "emphasize",
        "expression",
        "combined",
        "grammatically",
        "meaningful",
        "unlike",
        "meaningless",
        "mark",
        "proposed",
        "formalist",
        "writer",
        "hilbert",
        "school",
        "leśniewski",
        "never",
        "gave",
        "explicit",
        "formulation",
        "theory",
        "semantic",
        "category",
        "content",
        "work",
        "practice",
        "first",
        "formulation",
        "contemporary",
        "kazimierz",
        "ajdukiewicz",
        "article",
        "syntactic",
        "connection",
        "ajdukiewicz",
        "essay",
        "became",
        "fountainhead",
        "subsequent",
        "subdiscipline",
        "categorial",
        "grammar",
        "modifying",
        "ajdukiewicz",
        "notation",
        "may",
        "explain",
        "semantic",
        "category",
        "leśniewski",
        "used",
        "leśniewski",
        "thought",
        "theory",
        "applies",
        "logical",
        "system",
        "ordinary",
        "language",
        "became",
        "rather",
        "sceptical",
        "ability",
        "unambiguously",
        "precise",
        "subsequently",
        "shown",
        "categorial",
        "grammar",
        "applied",
        "quite",
        "successfully",
        "syntax",
        "natural",
        "language",
        "leśniewski",
        "two",
        "basic",
        "category",
        "sentence",
        "name",
        "n",
        "protothetic",
        "former",
        "used",
        "ontology",
        "mereology",
        "add",
        "latter",
        "distinction",
        "sentence",
        "name",
        "ultimate",
        "say",
        "sentence",
        "say",
        "thing",
        "true",
        "false",
        "obviously",
        "logical",
        "point",
        "view",
        "overlooking",
        "question",
        "command",
        "whereas",
        "name",
        "denote",
        "thing",
        "leśniewski",
        "following",
        "tradition",
        "allows",
        "name",
        "denote",
        "several",
        "thing",
        "one",
        "thing",
        "indeed",
        "thing",
        "istanbul",
        "denotes",
        "one",
        "thing",
        "namely",
        "turkish",
        "city",
        "city",
        "denotes",
        "many",
        "thing",
        "namely",
        "city",
        "unicorn",
        "denotes",
        "nothing",
        "leśniewski",
        "mature",
        "work",
        "mill",
        "notion",
        "connotation",
        "dropped",
        "along",
        "concept",
        "property",
        "employ",
        "sole",
        "logical",
        "function",
        "name",
        "denoting",
        "following",
        "tradition",
        "rather",
        "modern",
        "approach",
        "frege",
        "russell",
        "leśniewski",
        "make",
        "syntactic",
        "distinction",
        "general",
        "term",
        "common",
        "noun",
        "one",
        "hand",
        "singular",
        "term",
        "proper",
        "name",
        "often",
        "said",
        "native",
        "polish",
        "lack",
        "definite",
        "indefinite",
        "article",
        "make",
        "distinction",
        "grammatically",
        "obvious",
        "conjecture",
        "nonsense",
        "leśniewski",
        "spoke",
        "wrote",
        "fluent",
        "german",
        "german",
        "awash",
        "article",
        "seems",
        "much",
        "likely",
        "leśniewski",
        "deliberately",
        "chose",
        "follow",
        "traditional",
        "rather",
        "modern",
        "way",
        "thought",
        "expressively",
        "powerful",
        "closer",
        "natural",
        "language",
        "since",
        "language",
        "consist",
        "solely",
        "unarticulated",
        "sentence",
        "name",
        "expression",
        "category",
        "combine",
        "rulegoverned",
        "way",
        "one",
        "another",
        "produce",
        "expression",
        "ultimately",
        "sentence",
        "regimented",
        "environment",
        "leśniewski",
        "logical",
        "language",
        "always",
        "take",
        "place",
        "following",
        "way",
        "combining",
        "expression",
        "may",
        "call",
        "functor",
        "precedes",
        "left",
        "parenthesis",
        "kind",
        "followed",
        "sequence",
        "one",
        "argument",
        "expression",
        "followed",
        "right",
        "parenthesis",
        "symmetric",
        "one",
        "terminates",
        "complex",
        "general",
        "schema",
        "functor",
        "left",
        "parenthesis",
        "argument",
        "argument",
        "n",
        "right",
        "parenthesis",
        "exemplified",
        "f",
        "a_",
        "ldots",
        "a_n",
        "concretely",
        "sim",
        "p",
        "koppa",
        "pq",
        "isa",
        "aa",
        "let",
        "u",
        "provide",
        "notation",
        "inspired",
        "ajdukiewicz",
        "category",
        "functor",
        "f",
        "category",
        "a_",
        "alpha_",
        "category",
        "a_n",
        "alpha_n",
        "category",
        "whole",
        "expression",
        "f",
        "a_",
        "ldots",
        "a_n",
        "beta",
        "category",
        "functor",
        "expression",
        "f",
        "write",
        "beta",
        "langle",
        "alpha_",
        "ldots",
        "alpha_n",
        "rangle",
        "indicates",
        "category",
        "output",
        "left",
        "category",
        "input",
        "order",
        "within",
        "angled",
        "bracket",
        "call",
        "categorial",
        "index",
        "expression",
        "thus",
        "category",
        "sentential",
        "negation",
        "rslanglersrangle",
        "conjunction",
        "rslanglersrsrangle",
        "epsilon",
        "functor",
        "isa",
        "rslanglernrnrangle",
        "since",
        "build",
        "sentence",
        "using",
        "two",
        "name",
        "argument",
        "ajdukiewicz",
        "showed",
        "paper",
        "develop",
        "calculus",
        "grammatical",
        "combination",
        "using",
        "notation",
        "take",
        "putatively",
        "wellformed",
        "expression",
        "rearrange",
        "necessary",
        "functorfirst",
        "order",
        "see",
        "multiply",
        "argument",
        "functors",
        "arrive",
        "single",
        "categorial",
        "index",
        "complex",
        "expression",
        "grammatical",
        "wellformed",
        "syntactically",
        "connected",
        "example",
        "isa",
        "aa",
        "syntactically",
        "connected",
        "follows",
        "writing",
        "category",
        "expression",
        "e",
        "e",
        "isa",
        "rslanglernrnrangle",
        "a",
        "a",
        "rn",
        "text",
        "isa",
        "aa",
        "rslanglernrnrangle",
        "times",
        "rn",
        "times",
        "rn",
        "rs",
        "would",
        "expect",
        "ajdukiewicz",
        "used",
        "quotient",
        "notation",
        "instead",
        "angled",
        "bracket",
        "make",
        "idea",
        "multiplying",
        "graphic",
        "becomes",
        "cumbersome",
        "complex",
        "case",
        "may",
        "functors",
        "whose",
        "argument",
        "functors",
        "example",
        "conjunction",
        "holding",
        "two",
        "binary",
        "predicate",
        "category",
        "rslanglerslanglernrnranglerslanglernrnrangle",
        "rangle",
        "may",
        "also",
        "called",
        "manylink",
        "functors",
        "functors",
        "whose",
        "value",
        "functors",
        "example",
        "english",
        "morpheme",
        "ly",
        "convert",
        "adjective",
        "category",
        "rnlanglernrangle",
        "adverb",
        "example",
        "category",
        "rslanglernrangle",
        "langlerslanglernrangle",
        "rangle",
        "ly",
        "effective",
        "category",
        "rslanglernrangle",
        "langlerslanglernrangle",
        "rangle",
        "langlernlanglernrangle",
        "rangle",
        "subsequent",
        "categorial",
        "grammar",
        "transitive",
        "verb",
        "quite",
        "plausibly",
        "taken",
        "manylink",
        "category",
        "rslanglernrangle",
        "langlernrangle",
        "rather",
        "binary",
        "predicate",
        "category",
        "rslanglernrnrangle",
        "move",
        "indeed",
        "standard",
        "trick",
        "logic",
        "first",
        "introduced",
        "moses",
        "schönfinkel",
        "dispensing",
        "manyplaced",
        "functors",
        "favor",
        "manylink",
        "oneplaced",
        "functors",
        "known",
        "leśniewski",
        "would",
        "doubt",
        "disapproved",
        "loss",
        "logical",
        "power",
        "eliminating",
        "manyplaced",
        "functors",
        "move",
        "unnatural",
        "leśniewski",
        "would",
        "countenanced",
        "defining",
        "manyplaced",
        "functors",
        "manylink",
        "one",
        "disguise",
        "find",
        "church",
        "instance",
        "two",
        "basic",
        "category",
        "sentence",
        "name",
        "every",
        "category",
        "expression",
        "matter",
        "complex",
        "categorial",
        "index",
        "beginning",
        "either",
        "ultimately",
        "leading",
        "formation",
        "sentence",
        "n",
        "ultimately",
        "leading",
        "formation",
        "name",
        "following",
        "useful",
        "terminological",
        "suggestion",
        "eugene",
        "luschei",
        "may",
        "call",
        "former",
        "propositive",
        "category",
        "expression",
        "latter",
        "nominative",
        "category",
        "expression",
        "luschei",
        "note",
        "parenthesis",
        "leśniewski",
        "notation",
        "category",
        "syncategorematic",
        "function",
        "twofold",
        "mark",
        "beginning",
        "end",
        "argument",
        "string",
        "help",
        "indicate",
        "semantic",
        "category",
        "functors",
        "thus",
        "leśniewski",
        "used",
        "round",
        "parenthesis",
        "functors",
        "yielding",
        "sentence",
        "sentence",
        "ie",
        "connective",
        "brace",
        "functors",
        "yielding",
        "sentence",
        "name",
        "ie",
        "predicate",
        "principle",
        "unlimited",
        "number",
        "shape",
        "parenthesis",
        "might",
        "required",
        "indeed",
        "work",
        "student",
        "sobociński",
        "several",
        "dozen",
        "different",
        "shape",
        "leśniewski",
        "gave",
        "parenthesis",
        "second",
        "role",
        "wished",
        "remain",
        "flexible",
        "form",
        "expression",
        "used",
        "functors",
        "even",
        "allowing",
        "shape",
        "used",
        "analogous",
        "functors",
        "example",
        "placed",
        "conjunction",
        "higherorder",
        "epsilon",
        "equivalence",
        "logical",
        "constant",
        "obviously",
        "contingent",
        "feature",
        "notation",
        "convention",
        "well",
        "important",
        "metalogical",
        "purpose",
        "fact",
        "universal",
        "quantifier",
        "syncategorematic",
        "leśniewski",
        "marked",
        "symbolically",
        "lower",
        "corner",
        "used",
        "symbolize",
        "universal",
        "quantifier",
        "container",
        "variable",
        "crucially",
        "finite",
        "string",
        "different",
        "variable",
        "may",
        "occur",
        "quantifier",
        "matter",
        "assorted",
        "category",
        "advantage",
        "flexibility",
        "leśniewski",
        "need",
        "give",
        "rule",
        "many",
        "different",
        "kind",
        "universal",
        "quantifier",
        "give",
        "rule",
        "one",
        "sort",
        "one",
        "go",
        "disadvantage",
        "official",
        "notation",
        "logic",
        "leśniewski",
        "universal",
        "quantifier",
        "define",
        "particular",
        "quantifier",
        "others",
        "standard",
        "way",
        "also",
        "frege",
        "practice",
        "whereas",
        "frege",
        "case",
        "parsimony",
        "seems",
        "selfinflicted",
        "leśniewski",
        "case",
        "systematic",
        "reason",
        "leśniewski",
        "scrupulous",
        "giving",
        "exact",
        "rule",
        "admitting",
        "new",
        "expression",
        "definition",
        "gave",
        "rule",
        "protothetic",
        "extended",
        "ontology",
        "rule",
        "govern",
        "basic",
        "functor",
        "category",
        "expression",
        "quantifier",
        "variable",
        "binder",
        "neither",
        "basic",
        "functor",
        "expression",
        "leśniewski",
        "unable",
        "come",
        "acceptable",
        "canon",
        "definition",
        "variable",
        "binder",
        "would",
        "liked",
        "done",
        "indeed",
        "offered",
        "student",
        "degree",
        "wanted",
        "master",
        "habilitation",
        "could",
        "formulate",
        "adequate",
        "rule",
        "one",
        "could",
        "therefore",
        "official",
        "system",
        "universal",
        "quantifier",
        "remained",
        "syncategorematic",
        "expression",
        "still",
        "entered",
        "legal",
        "combination",
        "meant",
        "syntax",
        "system",
        "fully",
        "captured",
        "categorial",
        "grammar",
        "limitation",
        "became",
        "apparent",
        "ajdukiewicz",
        "also",
        "made",
        "unsuccessful",
        "attempt",
        "rectify",
        "ajdukiewicz",
        "noted",
        "perceptively",
        "language",
        "containing",
        "russell",
        "circumflex",
        "abstraction",
        "operator",
        "alonzo",
        "church",
        "notated",
        "using",
        "greek",
        "lambda",
        "would",
        "able",
        "express",
        "operator",
        "combination",
        "abstraction",
        "operator",
        "functor",
        "church",
        "employed",
        "method",
        "considerable",
        "advantage",
        "logic",
        "work",
        "came",
        "late",
        "help",
        "leśniewski",
        "case",
        "church",
        "simply",
        "pushed",
        "problem",
        "syncategorematicity",
        "lambda",
        "operator"
    ]
}