{
    "main_text": "Early Works\n2. Early Works\n\n Leśniewski’s early writings are all papers on topics in\nthe philosophy of logic and language, concerned with such issues as\ntruth, denotation and connotation, the status of the laws of logic, and\nRussell’s Antinomy. The primary influences in this period were\nJohn Stuart Mill, Anton Marty, and Edmund Husserl: he himself described\nthe works as grammatical in nature. Although Leśniewski later\nrepudiated his early works, they contain many seeds of his later\ninterests, attitudes, and working practices. From the beginning there\nis an obsessive rigor in developing logical principles, including an\ninstinctively clear and consistent marking of the use/mention\ndistinction, that is, distinguishing talk in a language from talk about\na language. Leśniewski’s early works are mainly reactions to\nwork by others, whether Brentano and Cornelius on existential\npropositions, Łukasiewicz on the Principles of Contradiction and\nExcluded Middle, Twardowski on universals, or Kotarbiński on the\ntimelessness of truth.\n\n The turning point in this period came when in 1911 Leśniewski read\nŁukasiewicz’s groundbreaking 1910 monograph O zasadzie\nsprzeczności u Arystotelesa [On the Principle of\nContradiction in Aristotle], a radical rethink of the status of the\nprinciple of contradiction in the light of modern logic. That work\ncontained an appendix in which there was a short exposition of modern\nsymbolic logic, in the notation of Couturat, and in Chapter 18 a brief\ndiscussion of Russell’s antinomy of the set of sets which are not\nmembers of themselves. Leśniewski initially thought the Russell\nAntinomy was easy to fix—and while trying to fix it missed a\nonce-a-day train when changing stations in Russia. He spent the next\nyears perfecting his solution, and indeed the rest of his life was\ndevoted to providing a rigorous, antinomy-free foundation for\nmathematics which avoided both the sloppiness of Principia and\nwhat he considered the fiction of standard set theory.\n\n According to Leśniewski’s dissertation and first paper, all\npositive existential propositions are analytic. This sounds absurd, but\nLeśniewski has reasons. Like Mill, he distinguishes between a\nterm’s denotation, which is the object or objects it stands for,\nand its connotation, which is the property or properties it ascribes to\nsomething. A proposition is defined to be analytic if it is (1) in\npositive subject–predicate form, and (2) contains no predicates\nconnoting properties not connoted by the subject. A proposition is\nsynthetic if it is (1) positive and (2) contains some predicate\nconnoting a property not connoted by the subject. Contrary to Mill, who\nsaid that ‘being’ connotes the property of existing,\nLeśniewski thinks the predicate ‘exist’ does not\nconnote any properties. A fortiori, ‘exist’ used as a\npredicate connotes no property not contained in the subject. Negative\nexistential propositions, which have the form ‘\\(X\\) is/are\nnon-existing’ are synthetic, except for such whose subject\nconnotes non-existence, e.g. ‘A square circle does not\nexist’ does not, so it is synthetic, but ‘All non-existing\nobjects are non-existing’ is analytic. All negative existential\npropositions are contradictory, because every subject connotes\nsomething of the form ‘being which possesses properties\n\\(A, B, C, D\\), etc.’ Analytic\nnegative existentials have contradictory subjects. So instead of saying\n‘\\(X\\) exists’ we should, to express the proposition\nwe want to be synthetic and contingent, rather say ‘Some being is\nthe object \\(X\\)’.\n\n Leśniewski saves appearances, which are that some existential\npropositions are true and others are false, by proposing a normative\nschema that propositions should fulfill to be proper expressions of the\nthought intended. Every proposition is to represent the possessing by\nthe object(s) denoted by the subject of the properties connoted by the\npredicate. Sentences which fail to conform to this norm are improper or\ninadequate, and should be replaced by proper alternatives. For example\n‘People exist’, which is true but is intended to be\nsynthetic, should be expressed as ‘Some beings are people’,\nwhile ‘A square circle does not exist’ should be expressed\nby ‘No being is a square circle’. Here is a table of some\nof the equivalences:\n\n\nInadequate Expression\nAdequate Alternative\n\n\nOnly objects \\(A\\) exist\nAll beings are objects \\(A\\)\n\n\nObjects \\(A\\) exist\nSome beings are objects \\(A\\)\n\n\nObject \\(A\\) exists\nOne (a certain) being is object \\(A\\)\n\n\nObject \\(A\\) does not exist \nObjects \\(A\\) do not exist\nNo being is a/the object \\(A\\)\n\n\n\n In “An Attempt at a Proof of the Ontological Principle of\nContradiction” (1912) Leśniewski argues that ‘No\nobject is able to be both \\(B\\) and not\\(-B\\)’ is true\nbut disagrees with the equivalence (now generally accepted) that\n‘No \\(A\\) is \\(B\\)’ is equivalent to ‘If\nsomething is \\(A\\) then it is not \\(B\\)’. The article\nis written in criticism of some ideas of Łukasiewicz and it\nafforded the occasion for the first personal meeting of the two later\ncolleagues. Łukasiewicz described the meeting decades later in a\npoignant diary entry for 9 May 1949:\n\n\nYesterday was the feast of St. Stanislaus, Bishop. This was\nLeśniewski’s name day. On his last one he already lay in the\nsame hospital in which five days later he was to die. I met\nLeśniewski in Lwów in 1912. I lived then with my uncle in\n10, Chmielowski Street. One afternoon someone rang at the entrance\ndoor. I opened the door and I saw a young man with a light, pointed\nbeard, a hat with a wide brim and a big black cockade instead of a tie.\nThe young man bowed and asked politely: “Does Professor\nŁukasiewicz live here?”. I replied that it was so.\n“Are you Professor Łukasiewicz?” asked the stranger. I\nreplied that it was so. “I am Leśniewski, and I have come to\nshow you the proofs of an article I have written against you.” I\ninvited the man into my room. It turned out that Leśniewski was\npublishing in Przegląd Filozoficzny an article containing\ncriticism of some my views in The Principle of Contradiction in\nAristotle. This criticism was written with such scientific\nexactness that I could not find any points which I could take up with\nhim. I remember that when, after hours of discussion, Leśniewski\nparted from me, I went out as usual to the Kawiarnia Szkocka [Scottish\nCafé, a favorite meeting-place for academics in Lwów],\nand I declared to my colleagues waiting there that I would have to give\nup my logical interests. A firm had sprung up whose competition I was\nnot able to face. [Translated by Arianna Betti and Owen LeBlanc;\nsee Polish Philosophy Page: Stanislaw Lesniewski, in the\nOther Internet Resources section below]\n\n\n\n In “The Critique of the Logical Principle of the Excluded\nMiddle” (1913) Leśniewski distinguishes between an\nontological principle – Every object is either \\(A\\) or not\n\\(A\\) – and a logical principle – Of two\ncontradictory propositions, at least one must be true. He rejects the\nlatter because he takes ‘Every centaur has a tail’ and\n‘Some centaur does not have a tail’ to be contradictories,\nbut both to be false because the subject-term ‘centaur’ is\nempty. This clearly depends on a reading of the universal with\nexistential import. If instead for the universal we take ‘Any\ncentaur has a tail’, which is true if there are no centaurs,\nthen we do get a contradictory pair with opposite truth-values.\n\n In the course of this paper Leśniewski argues against\nTwardowski’s theory of general objects and Meinong’s theory\nof impossible objects, as well as offering solutions to the paradoxes\nof Grelling and the Liar. The paper is the richest of his early\n“logico-grammatical” works. The argument against Twardowski\ngoes as follows. Call a general object one which has all and\nonly the properties shared by some group of objects. For example the\ngeneral horse has all and only the properties shared by all horses: it\nis neither black nor brown nor white, neither male nor female, neither\nyoung nor old, but it is indisputably equine, mammalian, and born of\ntwo equine parents. Leśniewski now reduces the definition to\nabsurdity. Of any group of at least two objects, there will be some\nproperty that some of them have that others do not have. For example,\nsome horses are black and others are not black. So the general horse is\nnot black, because some horses are not black; but nor is it not black,\nbecause some horses are not not black. Hence the general horse is\nneither black nor not black, which is a contradiction. Hence there are\nno general objects for groups of more than one thing. Leśniewski\nliked this argument well enough to retain his allegiance to it even\nwhile repudiating all other parts of his early work; he rejected\nuniversals consistently thereafter. But the argument does not affect\nthose theories of universals which are happy to accept that universals\nmay have properties their instances do not, for example being\ninstantiated, or repeated.\n\n In “Is truth only eternal or both eternal and without a\nbeginning?” (1913) he argues for timeless bivalence against\nKotarbiński’s view that future contingent propositions lack\na determinate truth-value. This paper convinced Kotarbiński he had\nbeen in error. The exchange is notable for showing that the discussion\nof the logical status of future contingent propositions, which inspired\nŁukasiewicz to invent many-valued logic a few years later, was\nalready under way in Lwów before the First World War.\n\n In “Is the class of classes not subordinate to themselves\nsubordinate to itself?” (1914) Leśniewski offers his first\npublished analysis of Russell’s Paradox, claiming that ‘the\nclass of \\(A\\)s’ refers to the unique mereological sum of\n\\(A\\)s, so that since every object is subordinate to itself, no\nclass of objects is not subordinate to itself, and Russell’s\nParadox fails to arise. The non-standard term ‘subordinate\nto’ which he took from Łukasiewicz, is defined by\nLeśniewski as follows. An object \\(P\\) is subordinate to a\nclass \\(K\\) if and only if, for some a, \\(K\\) is a class of\n\\(a\\)s (a mereological sum of \\(a\\)s, as we shall see), and\n\\(P\\) is an \\(a\\). Let \\(P\\) be a hemispherical part of\na sphere \\(Q\\). The class of all hemispheres of \\(Q\\) is, on\nLeśniewski’s understanding, simply \\(Q\\) itself, so\n\\(P\\) is subordinate to \\(Q\\). In fact, according to this\nview, any object is a class, and subordinate to itself. Leśniewski\nretained this “concrete” understanding of classes\nthroughout his life, claiming that it conformed to Cantor’s own\nstatements. That other set theories gave a different account of things\nwas in Leśniewski’s view their problem, not his.\n\n During World War I, when Leśniewski lived in Moscow, he completed\n“Foundations of a General Theory of Sets I” (1916). Despite\nthe use of the term ‘mnogość’ (set),\nthis was a first rigorous deductive presentation of the theory of\nparts, wholes and concrete collections. Leśniewski later dropped\nthe term ‘mnogość’ and instead invented\nthe term ‘Mereology’, meaning ‘theory of\nparts’, an irregular coinage from the Greek\nμερος, part, in order to\ndifferentiate his view from what he ironically called\n“official” set theory. In this paper the language is a\nhighly regimented Polish supplemented with variables, because at the\ntime Leśniewski did not trust symbolic methods, having found the\nuse/mention confusions in Whitehead and Russell’s Principia\nMathematica a barrier to understanding, and assuming any symbolic\nlogic had to be like that. Only later did Leśniewski discover the\nmuch tidier work of Frege, which he thereafter held up as the foremost\nexample of symbolic logic to that date. Leśniewski was one of the\nearliest logicians to appreciate the virtues of Frege’s logical\nwork as largely independent of its inconsistency. In later years,\nLeśniewski proved that Frege’s “way out” of the\nparadox, which involved a restriction of the fatal abstraction\nprinciple Basic Law V, had the unacceptable consequence that there\ncould not be more than one object. This work was not published, but was\nreconstructed after World War II by Sobociński (1949).\n",
    "section_title": "2. Early Works",
    "entry_title": "Stanisław Leśniewski",
    "hierarchy_title": "Stanisław Leśniewski || Early Works",
    "tokenized_text": [
        "early",
        "work",
        "early",
        "work",
        "leśniewski",
        "early",
        "writing",
        "paper",
        "topic",
        "philosophy",
        "logic",
        "language",
        "concerned",
        "issue",
        "truth",
        "denotation",
        "connotation",
        "status",
        "law",
        "logic",
        "russell",
        "antinomy",
        "primary",
        "influence",
        "period",
        "john",
        "stuart",
        "mill",
        "anton",
        "marty",
        "edmund",
        "husserl",
        "described",
        "work",
        "grammatical",
        "nature",
        "although",
        "leśniewski",
        "later",
        "repudiated",
        "early",
        "work",
        "contain",
        "many",
        "seed",
        "later",
        "interest",
        "attitude",
        "working",
        "practice",
        "beginning",
        "obsessive",
        "rigor",
        "developing",
        "logical",
        "principle",
        "including",
        "instinctively",
        "clear",
        "consistent",
        "marking",
        "usemention",
        "distinction",
        "distinguishing",
        "talk",
        "language",
        "talk",
        "language",
        "leśniewski",
        "early",
        "work",
        "mainly",
        "reaction",
        "work",
        "others",
        "whether",
        "brentano",
        "cornelius",
        "existential",
        "proposition",
        "łukasiewicz",
        "principle",
        "contradiction",
        "excluded",
        "middle",
        "twardowski",
        "universal",
        "kotarbiński",
        "timelessness",
        "truth",
        "turning",
        "point",
        "period",
        "came",
        "leśniewski",
        "read",
        "łukasiewicz",
        "groundbreaking",
        "monograph",
        "zasadzie",
        "sprzeczności",
        "u",
        "arystotelesa",
        "principle",
        "contradiction",
        "aristotle",
        "radical",
        "rethink",
        "status",
        "principle",
        "contradiction",
        "light",
        "modern",
        "logic",
        "work",
        "contained",
        "appendix",
        "short",
        "exposition",
        "modern",
        "symbolic",
        "logic",
        "notation",
        "couturat",
        "chapter",
        "brief",
        "discussion",
        "russell",
        "antinomy",
        "set",
        "set",
        "member",
        "leśniewski",
        "initially",
        "thought",
        "russell",
        "antinomy",
        "easy",
        "fixand",
        "trying",
        "fix",
        "missed",
        "onceaday",
        "train",
        "changing",
        "station",
        "russia",
        "spent",
        "next",
        "year",
        "perfecting",
        "solution",
        "indeed",
        "rest",
        "life",
        "devoted",
        "providing",
        "rigorous",
        "antinomyfree",
        "foundation",
        "mathematics",
        "avoided",
        "sloppiness",
        "principia",
        "considered",
        "fiction",
        "standard",
        "set",
        "theory",
        "according",
        "leśniewski",
        "dissertation",
        "first",
        "paper",
        "positive",
        "existential",
        "proposition",
        "analytic",
        "sound",
        "absurd",
        "leśniewski",
        "reason",
        "like",
        "mill",
        "distinguishes",
        "term",
        "denotation",
        "object",
        "object",
        "stand",
        "connotation",
        "property",
        "property",
        "ascribes",
        "something",
        "proposition",
        "defined",
        "analytic",
        "positive",
        "subjectpredicate",
        "form",
        "contains",
        "predicate",
        "connoting",
        "property",
        "connoted",
        "subject",
        "proposition",
        "synthetic",
        "positive",
        "contains",
        "predicate",
        "connoting",
        "property",
        "connoted",
        "subject",
        "contrary",
        "mill",
        "said",
        "connotes",
        "property",
        "existing",
        "leśniewski",
        "think",
        "predicate",
        "exist",
        "connote",
        "property",
        "fortiori",
        "exist",
        "used",
        "predicate",
        "connotes",
        "property",
        "contained",
        "subject",
        "negative",
        "existential",
        "proposition",
        "form",
        "x",
        "isare",
        "nonexisting",
        "synthetic",
        "except",
        "whose",
        "subject",
        "connotes",
        "nonexistence",
        "eg",
        "square",
        "circle",
        "exist",
        "synthetic",
        "nonexisting",
        "object",
        "nonexisting",
        "analytic",
        "negative",
        "existential",
        "proposition",
        "contradictory",
        "every",
        "subject",
        "connotes",
        "something",
        "form",
        "posse",
        "property",
        "b",
        "c",
        "d",
        "etc",
        "analytic",
        "negative",
        "existentials",
        "contradictory",
        "subject",
        "instead",
        "saying",
        "x",
        "exists",
        "express",
        "proposition",
        "want",
        "synthetic",
        "contingent",
        "rather",
        "say",
        "object",
        "x",
        "leśniewski",
        "save",
        "appearance",
        "existential",
        "proposition",
        "true",
        "others",
        "false",
        "proposing",
        "normative",
        "schema",
        "proposition",
        "fulfill",
        "proper",
        "expression",
        "thought",
        "intended",
        "every",
        "proposition",
        "represent",
        "possessing",
        "object",
        "denoted",
        "subject",
        "property",
        "connoted",
        "predicate",
        "sentence",
        "fail",
        "conform",
        "norm",
        "improper",
        "inadequate",
        "replaced",
        "proper",
        "alternative",
        "example",
        "people",
        "exist",
        "true",
        "intended",
        "synthetic",
        "expressed",
        "being",
        "people",
        "square",
        "circle",
        "exist",
        "expressed",
        "square",
        "circle",
        "table",
        "equivalence",
        "inadequate",
        "expression",
        "adequate",
        "alternative",
        "object",
        "a",
        "exist",
        "being",
        "object",
        "a",
        "object",
        "a",
        "exist",
        "being",
        "object",
        "a",
        "object",
        "a",
        "exists",
        "one",
        "certain",
        "object",
        "a",
        "object",
        "a",
        "exist",
        "object",
        "a",
        "exist",
        "athe",
        "object",
        "a",
        "attempt",
        "proof",
        "ontological",
        "principle",
        "contradiction",
        "leśniewski",
        "argues",
        "object",
        "able",
        "b",
        "not",
        "b",
        "true",
        "disagrees",
        "equivalence",
        "generally",
        "accepted",
        "a",
        "b",
        "equivalent",
        "something",
        "a",
        "b",
        "article",
        "written",
        "criticism",
        "idea",
        "łukasiewicz",
        "afforded",
        "occasion",
        "first",
        "personal",
        "meeting",
        "two",
        "later",
        "colleague",
        "łukasiewicz",
        "described",
        "meeting",
        "decade",
        "later",
        "poignant",
        "diary",
        "entry",
        "may",
        "yesterday",
        "feast",
        "st",
        "stanislaus",
        "bishop",
        "leśniewski",
        "name",
        "day",
        "last",
        "one",
        "already",
        "lay",
        "hospital",
        "five",
        "day",
        "later",
        "die",
        "met",
        "leśniewski",
        "lwów",
        "lived",
        "uncle",
        "chmielowski",
        "street",
        "one",
        "afternoon",
        "someone",
        "rang",
        "entrance",
        "door",
        "opened",
        "door",
        "saw",
        "young",
        "man",
        "light",
        "pointed",
        "beard",
        "hat",
        "wide",
        "brim",
        "big",
        "black",
        "cockade",
        "instead",
        "tie",
        "young",
        "man",
        "bowed",
        "asked",
        "politely",
        "professor",
        "łukasiewicz",
        "live",
        "replied",
        "professor",
        "łukasiewicz",
        "asked",
        "stranger",
        "replied",
        "leśniewski",
        "come",
        "show",
        "proof",
        "article",
        "written",
        "you",
        "invited",
        "man",
        "room",
        "turned",
        "leśniewski",
        "publishing",
        "przegląd",
        "filozoficzny",
        "article",
        "containing",
        "criticism",
        "view",
        "principle",
        "contradiction",
        "aristotle",
        "criticism",
        "written",
        "scientific",
        "exactness",
        "could",
        "find",
        "point",
        "could",
        "take",
        "remember",
        "hour",
        "discussion",
        "leśniewski",
        "parted",
        "went",
        "usual",
        "kawiarnia",
        "szkocka",
        "scottish",
        "café",
        "favorite",
        "meetingplace",
        "academic",
        "lwów",
        "declared",
        "colleague",
        "waiting",
        "would",
        "give",
        "logical",
        "interest",
        "firm",
        "sprung",
        "whose",
        "competition",
        "able",
        "face",
        "translated",
        "arianna",
        "betti",
        "owen",
        "leblanc",
        "see",
        "polish",
        "philosophy",
        "page",
        "stanislaw",
        "lesniewski",
        "internet",
        "resource",
        "section",
        "critique",
        "logical",
        "principle",
        "excluded",
        "middle",
        "leśniewski",
        "distinguishes",
        "ontological",
        "principle",
        "every",
        "object",
        "either",
        "a",
        "a",
        "logical",
        "principle",
        "two",
        "contradictory",
        "proposition",
        "least",
        "one",
        "must",
        "true",
        "reject",
        "latter",
        "take",
        "every",
        "centaur",
        "tail",
        "centaur",
        "tail",
        "contradictory",
        "false",
        "subjectterm",
        "centaur",
        "empty",
        "clearly",
        "depends",
        "reading",
        "universal",
        "existential",
        "import",
        "instead",
        "universal",
        "take",
        "centaur",
        "tail",
        "true",
        "centaur",
        "get",
        "contradictory",
        "pair",
        "opposite",
        "truthvalues",
        "course",
        "paper",
        "leśniewski",
        "argues",
        "twardowski",
        "theory",
        "general",
        "object",
        "meinong",
        "theory",
        "impossible",
        "object",
        "well",
        "offering",
        "solution",
        "paradox",
        "grelling",
        "liar",
        "paper",
        "richest",
        "early",
        "logicogrammatical",
        "work",
        "argument",
        "twardowski",
        "go",
        "follows",
        "call",
        "general",
        "object",
        "one",
        "property",
        "shared",
        "group",
        "object",
        "example",
        "general",
        "horse",
        "property",
        "shared",
        "horse",
        "neither",
        "black",
        "brown",
        "white",
        "neither",
        "male",
        "female",
        "neither",
        "young",
        "old",
        "indisputably",
        "equine",
        "mammalian",
        "born",
        "two",
        "equine",
        "parent",
        "leśniewski",
        "reduces",
        "definition",
        "absurdity",
        "group",
        "least",
        "two",
        "object",
        "property",
        "others",
        "example",
        "horse",
        "black",
        "others",
        "black",
        "general",
        "horse",
        "black",
        "horse",
        "black",
        "black",
        "horse",
        "black",
        "hence",
        "general",
        "horse",
        "neither",
        "black",
        "black",
        "contradiction",
        "hence",
        "general",
        "object",
        "group",
        "one",
        "thing",
        "leśniewski",
        "liked",
        "argument",
        "well",
        "enough",
        "retain",
        "allegiance",
        "even",
        "repudiating",
        "part",
        "early",
        "work",
        "rejected",
        "universal",
        "consistently",
        "thereafter",
        "argument",
        "affect",
        "theory",
        "universal",
        "happy",
        "accept",
        "universal",
        "may",
        "property",
        "instance",
        "example",
        "instantiated",
        "repeated",
        "truth",
        "eternal",
        "eternal",
        "without",
        "beginning",
        "argues",
        "timeless",
        "bivalence",
        "kotarbiński",
        "view",
        "future",
        "contingent",
        "proposition",
        "lack",
        "determinate",
        "truthvalue",
        "paper",
        "convinced",
        "kotarbiński",
        "error",
        "exchange",
        "notable",
        "showing",
        "discussion",
        "logical",
        "status",
        "future",
        "contingent",
        "proposition",
        "inspired",
        "łukasiewicz",
        "invent",
        "manyvalued",
        "logic",
        "year",
        "later",
        "already",
        "way",
        "lwów",
        "first",
        "world",
        "war",
        "class",
        "class",
        "subordinate",
        "subordinate",
        "leśniewski",
        "offer",
        "first",
        "published",
        "analysis",
        "russell",
        "paradox",
        "claiming",
        "class",
        "a",
        "refers",
        "unique",
        "mereological",
        "sum",
        "a",
        "since",
        "every",
        "object",
        "subordinate",
        "class",
        "object",
        "subordinate",
        "russell",
        "paradox",
        "fails",
        "arise",
        "nonstandard",
        "term",
        "subordinate",
        "took",
        "łukasiewicz",
        "defined",
        "leśniewski",
        "follows",
        "object",
        "p",
        "subordinate",
        "class",
        "k",
        "k",
        "class",
        "a",
        "mereological",
        "sum",
        "a",
        "shall",
        "see",
        "p",
        "a",
        "let",
        "p",
        "hemispherical",
        "part",
        "sphere",
        "q",
        "class",
        "hemisphere",
        "q",
        "leśniewski",
        "understanding",
        "simply",
        "q",
        "p",
        "subordinate",
        "q",
        "fact",
        "according",
        "view",
        "object",
        "class",
        "subordinate",
        "leśniewski",
        "retained",
        "concrete",
        "understanding",
        "class",
        "throughout",
        "life",
        "claiming",
        "conformed",
        "cantor",
        "statement",
        "set",
        "theory",
        "gave",
        "different",
        "account",
        "thing",
        "leśniewski",
        "view",
        "problem",
        "world",
        "war",
        "leśniewski",
        "lived",
        "moscow",
        "completed",
        "foundation",
        "general",
        "theory",
        "set",
        "despite",
        "use",
        "term",
        "mnogość",
        "set",
        "first",
        "rigorous",
        "deductive",
        "presentation",
        "theory",
        "part",
        "whole",
        "concrete",
        "collection",
        "leśniewski",
        "later",
        "dropped",
        "term",
        "mnogość",
        "instead",
        "invented",
        "term",
        "mereology",
        "meaning",
        "theory",
        "part",
        "irregular",
        "coinage",
        "greek",
        "μερος",
        "part",
        "order",
        "differentiate",
        "view",
        "ironically",
        "called",
        "official",
        "set",
        "theory",
        "paper",
        "language",
        "highly",
        "regimented",
        "polish",
        "supplemented",
        "variable",
        "time",
        "leśniewski",
        "trust",
        "symbolic",
        "method",
        "found",
        "usemention",
        "confusion",
        "whitehead",
        "russell",
        "principia",
        "mathematica",
        "barrier",
        "understanding",
        "assuming",
        "symbolic",
        "logic",
        "like",
        "later",
        "leśniewski",
        "discover",
        "much",
        "tidier",
        "work",
        "frege",
        "thereafter",
        "held",
        "foremost",
        "example",
        "symbolic",
        "logic",
        "date",
        "leśniewski",
        "one",
        "earliest",
        "logician",
        "appreciate",
        "virtue",
        "frege",
        "logical",
        "work",
        "largely",
        "independent",
        "inconsistency",
        "later",
        "year",
        "leśniewski",
        "proved",
        "frege",
        "way",
        "paradox",
        "involved",
        "restriction",
        "fatal",
        "abstraction",
        "principle",
        "basic",
        "law",
        "v",
        "unacceptable",
        "consequence",
        "could",
        "one",
        "object",
        "work",
        "published",
        "reconstructed",
        "world",
        "war",
        "ii",
        "sobociński"
    ]
}