{
    "main_text": "The historical origins of the concept\n1. The historical origins of the concept\n\nWhen levels of organization are understood as belonging to the broader\ncategory of hierarchical depictions of nature, their history can be\ntraced back to the early days of western science and philosophy.\nAristotle suggested that living things could be arranged in a graded\nscale, starting from plants at the bottom and ending with humans at\nthe top. This idea was further developed in Neoplatonism, and in\nMedieval times, it transformed into the idea of “the Great Chain\nof Being” (Lovejoy 1936). This Scala Naturae conveyed a\nhierarchical conception of the world: at the top, there is God, and at\nlower rungs, angels, humans, animals, plants, and so on. After the\nscientific revolution, more scientific hierarchical classifications of\nnature started to appear, the most famous ones being Linneaus’\ntaxonomical system and Auguste Comte’s hierarchy of the sciences\n(Comte 1830–1842 [1853]).\n\nAt the beginning of the twentieth century, several notions of\n“levels” began to circulate in the philosophical and\nscientific literature. Prominent among these was the idea of\n“levels of existence” (alternatively: “being”;\n“complexity”) developed by philosophers Samuel Alexander\n(1920: 3, 45) and Charles Dunbar Broad (1925), which figured\nprominently in the emergentist and emergent evolution literature of\nthe 1920’s (Sellars 1926; McLaughlin 1992; Stephan 1999). This\nintroduced a number of themes that have become germane to general\nlevels-language. These themes include level-specific laws (Broad 1925:\n77; cf. Woodger 1929) and the idea that ‘levels’ exhibit a\ntendency in nature towards increasing complexity (Sellars 1917: 224;\ncf. Needham 1937). Although most of these themes were severely\nunderdeveloped and divorced from the cutting-edge work in the life\nsciences happening at the time (Needham 1937: 242 ff. 4), this\ntradition has been an influential historical source for explicating\nlevels language in philosophy of mind (see the entries on\n emergent properties\n and\n supervenience;\n McLaughlin 1992; Beckermann, Flohr, & Kim 1992; Kim 1999,\n2002).\n\nThe roots of the contemporary notion of levels of organization and the\nassociated hierarchical thinking are best linked to the efforts of\norganicist biologists of the early-mid twentieth century (for primers\non the organicist movement, see Peterson 2014; Nicholson & Gawne\n2015). Particularly important to the introduction and development of\nthe levels concept were Joseph Woodger (1929; 1930), Ludwig von\nBertalanffy (1928 [1933]; 1932), and Joseph Needham (1936b; 1937).\nThese individuals were in turn influenced by Alfred North\nWhitehead’s philosophy (see, e.g., Whitehead 1929; Needham\n1941).\n\nOrganicism (alternatively “organismal” or\n“organismic” biology) did not designate a clearly-defined\ngroup or movement, but rather a loosely-threaded confluence of\nscientists and philosophers distributed among many disciplines and\nacross Europe and the Americas. The organicists (like the\nemergentists) were in part responding to the dispute between the\nmechanists and the neovitalists of the early twentieth century. The\nmechanists held that biological phenomena were “nothing over and\nabove” their physico-chemical components, meaning that\nbiological phenomena can in principle, and eventually will, be\nexhaustively accounted for in chemical or physical terms (Loeb 1912;\n1916). They also argued that biological phenomena, though seemingly\ncomplex, are fundamentally similar to machines (Loeb 1912; 1916; see\nalso G. Allen 2005: 264; Bechtel & Richardson 1993 [2010: 17];\nNicholson 2012: 160). Neovitalists such as Hans Driesch and Henri\nBergson rejected these ideas, arguing that living things cannot be\nexplained solely based on their physico-chemical components, and that\nbiological phenomena therefore must involve non-physical forces or\nentities. The organicists sought to offer a “third way”\ninto the mechanist-vitalist dispute that served as a middle ground\nbetween the austerity of the mechanists and the extravagance of the\nneovitalists (Peterson 2014: 286; Nicholson & Gawne 2015:\n358).\n\nThree major tenets of organicism were particularly congenial to the\ndevelopment of the levels concept. Firstly, the central preoccupation\nof organicist thought with organization laid down a\nfoundation for levels thinking (cf. Nicholson & Gawne 2015: 364).\nFor the organicists, organization marked the decisive feature for\ndemarcating living phenomena from non-living physico-chemical\nphenomena (e.g., Woodger 1929: 290–1; von Bertalanffy 1928\n[1933: 48]; Needham 1936b: ch. 1). Unlike the neovitalists, however,\nthe organicists did not hold organization to be inscrutable, but\nrather an important explanandum of biological study (Nicholson &\nGawne 2015: 365). Moreover, living organisms exhibited a\nhierarchical ordering among their distinct parts (Woodger\n1930: 8; von Bertalanffy 1932: 83; Needham 1936b: ch. 5; see also\nNicholson & Gawne 2015: 366). This combined nicely with the focus\non organization as the major explanandum of biology in that the series\nof elements that compose different organisms required specific and\ncontextualized treatment. This in turn complemented another main tenet\nof the organicists, namely the autonomy of biology as a\nnatural science (cf. Nicholson & Gawne 2015: 366–7).\n\nThe levels concept proved to be a linchpin of these main tenets.\nJoseph Woodger, combining these features, thus expresses the basic\nthinking behind levels of organization:\n\n\nTwo principal factors appear to have been responsible for the failure\nto take organization seriously in biology. First there is the vague\nbelief that only atoms and molecules are ‘real’, and\nsecondly the incautious use of the notion of chemical composition.\nAlso the biological entities are found to be composite in the same\nsense, and moreover, some of the relata in the relation of composition\nin the physico-chemical objects are also relata in the biological\nobjects. But the analysis of organisms as carried out by\nbiologists reveal other relata in mutual relation of\ncomposition in a different sense, i.e., not in\nchemical composition, e.g., the organism is analysable\ninto organ-systems, organs, tissues, cells and cell-parts. There is a\nhierarchy of composing parts or relata in a hierarchy of organizing\nrelations. These relations and relata can only be studied at\ntheir own levels (cf. the quartz crystal) and not simply in\nterms of the lower levels. (Woodger 1929: 292–293,\nemphasis modified; see also Bertalanffy 1932: 100–101; Needham\n1937 [1943: 234])\n\n\nUnlike the emergentists’ “levels of existence”, the\nhierarchical view expounded by the organicists emphasized\ndifferentiating the many distinct classes of matter’s possible\nforms to accommodate the diversity in biological entities. This in\nturn led them to posit many more levels in the world than the four\n‘super levels’ of the emergentists (the physical the\nchemical, the vital, and the mental), and also implied an increase in\ncomplexity as more levels of organization were brought to bear on\ntreating living systems. Woodger again remarks:\n\n\nIf the parts [of an organism] were homogeneous then we should be able\nto call them units and there would only be one level of organization.\nBut if each part were itself composed of parts forming in each an\norganized system, then clearly we should have two levels of\norganization and if the composing sub-parts of the first organization\nwere intrinsically only numerically different we could speak of two\nhomogeneous levels of organization. If, however, the sub-parts were\nintrinsically different then the first-order parts would be different\nand we should have a heterogeneous type of organization. By carrying\nout this process of subdivision further we could obtain very complex\ntypes of organization exhibiting a hierarchy of successive levels. And\nif now we consider one of the higher living organisms it is evident at\nonce that its organization will belong to one of these heterogeneous\nhierarchical types. (Woodger 1929: 298)\n\n\nThis idea that levels of organization of organization form\n“nested” compositional hierarchies where there are wholes\nat higher levels and their components at lower levels, and the\ncomponents themselves can be further decomposed into parts, remains\none of the core features of the notion of levels of organization up to\nthis day.\n\nIn the aftermath of organicism, development of the levels concept\nsplintered into different intellectual trajectories, with little\noverall theoretical or conceptual coherence. One direction of\ndevelopment flowed through the framework of general systems theory\n(von Bertalanffy 1950, 1968), and particularly through so-called\nhierarchy theory (Whyte, Wilson, & Wilson 1969; Weiss 1971; Pattee\n1973). General systems theory sought to construct isomorphisms between\nlaws of different scientific fields based on their generic system\nproperties (von Bertalanffy 1950: 136), but nonetheless continued to\nemphasize the hierarchical part-whole structure of systems (von\nBertalanffy 1968). ‘Levels of organization’ in this\ntradition was ultimately given secondary consideration to the\narticulation of system-generic properties and laws. Similarly, in\nhierarchy theory, ‘levels’ tended to be treated as\nderivative of the more general notion of a hierarchy, or the ordering\nof a system into nested subsystems (Simon 1962 [1996: 184–5];\nsee also Weiss 1971). Hierarchy and levels alike continued to be\ntreated as generic structures of systems of all stripes (see also T.\nAllen & Starr 1982; O’Neill et al. 1986). However, one\nimportant distinction to come out of this tradition was the\ndistinction between levels of composition and levels of control (Simon\n1962; Pattee 1973). The former speaks to the nested compositionality\ntypically identified with levels of organization, while the latter\nrefers to the idea that higher levels impose constraints on the\nprocesses at lower levels, for example by limiting the degrees of\nfreedom of the system at a lower level (Pattee 1973: 85; see also\nUmerez 2021).\n\nOther early attempts at clarifying the concept of levels were carried\nout by individual researchers working alone on similar or related\nissues, such as reduction or multilevel selection. Mario Bunge (1960;\n1977), Marjorie Grene (1969; 1987), and William Wimsatt (1976a; 1981;\n1994) each developed several ground-laying observations concerning\nlevels. Bunge (1960) remarks on the plethora of meanings the term can\npossess, then offers a long taxonomy of nine different meanings of the\nterm “levels”, ranging from the innocuous (levels as\ndegrees or quantity, as in ‘levels of stress’) to the\nsense of nature being ordered into an evolutionary series, with\nseveral corollary senses of levels falling between (such as degrees of\ncomplexity). In his 1977 paper, Bunge goes further, offering a\nset-theoretic treatment of levels, and claiming that the leveled\nstructure of the natural world is what renders natural phenomena\nintelligible to us (Bunge 1977: R82). Grene (1969) also discusses the\npolysemic nature of the term “hierarchy”, and later (1987)\ndistinguishes between two notions of hierarchy, one falling under a\nmixed notion of levels as composition and control, and the other\nexemplifying phylogenetic ranks. Wimsatt’s work will be\nconsidered in more detail below in\n section 2.3.\n",
    "section_title": "1. The historical origins of the concept",
    "entry_title": "Levels of Organization in Biology",
    "hierarchy_title": "Levels of Organization in Biology || The historical origins of the concept",
    "tokenized_text": [
        "historical",
        "origin",
        "concept",
        "historical",
        "origin",
        "concept",
        "level",
        "organization",
        "understood",
        "belonging",
        "broader",
        "category",
        "hierarchical",
        "depiction",
        "nature",
        "history",
        "traced",
        "back",
        "early",
        "day",
        "western",
        "science",
        "philosophy",
        "aristotle",
        "suggested",
        "living",
        "thing",
        "could",
        "arranged",
        "graded",
        "scale",
        "starting",
        "plant",
        "bottom",
        "ending",
        "human",
        "top",
        "idea",
        "developed",
        "neoplatonism",
        "medieval",
        "time",
        "transformed",
        "idea",
        "great",
        "chain",
        "lovejoy",
        "scala",
        "naturae",
        "conveyed",
        "hierarchical",
        "conception",
        "world",
        "top",
        "god",
        "lower",
        "rung",
        "angel",
        "human",
        "animal",
        "plant",
        "scientific",
        "revolution",
        "scientific",
        "hierarchical",
        "classification",
        "nature",
        "started",
        "appear",
        "famous",
        "one",
        "linneaus",
        "taxonomical",
        "system",
        "auguste",
        "comte",
        "hierarchy",
        "science",
        "comte",
        "beginning",
        "twentieth",
        "century",
        "several",
        "notion",
        "level",
        "began",
        "circulate",
        "philosophical",
        "scientific",
        "literature",
        "prominent",
        "among",
        "idea",
        "level",
        "existence",
        "alternatively",
        "complexity",
        "developed",
        "philosopher",
        "samuel",
        "alexander",
        "charles",
        "dunbar",
        "broad",
        "figured",
        "prominently",
        "emergentist",
        "emergent",
        "evolution",
        "literature",
        "sellars",
        "mclaughlin",
        "stephan",
        "introduced",
        "number",
        "theme",
        "become",
        "germane",
        "general",
        "levelslanguage",
        "theme",
        "include",
        "levelspecific",
        "law",
        "broad",
        "cf",
        "woodger",
        "idea",
        "level",
        "exhibit",
        "tendency",
        "nature",
        "towards",
        "increasing",
        "complexity",
        "sellars",
        "cf",
        "needham",
        "although",
        "theme",
        "severely",
        "underdeveloped",
        "divorced",
        "cuttingedge",
        "work",
        "life",
        "science",
        "happening",
        "time",
        "needham",
        "ff",
        "tradition",
        "influential",
        "historical",
        "source",
        "explicating",
        "level",
        "language",
        "philosophy",
        "mind",
        "see",
        "entry",
        "emergent",
        "property",
        "supervenience",
        "mclaughlin",
        "beckermann",
        "flohr",
        "kim",
        "kim",
        "root",
        "contemporary",
        "notion",
        "level",
        "organization",
        "associated",
        "hierarchical",
        "thinking",
        "best",
        "linked",
        "effort",
        "organicist",
        "biologist",
        "earlymid",
        "twentieth",
        "century",
        "primer",
        "organicist",
        "movement",
        "see",
        "peterson",
        "nicholson",
        "gawne",
        "particularly",
        "important",
        "introduction",
        "development",
        "level",
        "concept",
        "joseph",
        "woodger",
        "ludwig",
        "von",
        "bertalanffy",
        "joseph",
        "needham",
        "b",
        "individual",
        "turn",
        "influenced",
        "alfred",
        "north",
        "whitehead",
        "philosophy",
        "see",
        "eg",
        "whitehead",
        "needham",
        "organicism",
        "alternatively",
        "organismal",
        "organismic",
        "biology",
        "designate",
        "clearlydefined",
        "group",
        "movement",
        "rather",
        "looselythreaded",
        "confluence",
        "scientist",
        "philosopher",
        "distributed",
        "among",
        "many",
        "discipline",
        "across",
        "europe",
        "america",
        "organicists",
        "like",
        "emergentists",
        "part",
        "responding",
        "dispute",
        "mechanist",
        "neovitalists",
        "early",
        "twentieth",
        "century",
        "mechanist",
        "held",
        "biological",
        "phenomenon",
        "nothing",
        "physicochemical",
        "component",
        "meaning",
        "biological",
        "phenomenon",
        "principle",
        "eventually",
        "exhaustively",
        "accounted",
        "chemical",
        "physical",
        "term",
        "loeb",
        "also",
        "argued",
        "biological",
        "phenomenon",
        "though",
        "seemingly",
        "complex",
        "fundamentally",
        "similar",
        "machine",
        "loeb",
        "see",
        "also",
        "g",
        "allen",
        "bechtel",
        "richardson",
        "nicholson",
        "neovitalists",
        "han",
        "driesch",
        "henri",
        "bergson",
        "rejected",
        "idea",
        "arguing",
        "living",
        "thing",
        "explained",
        "solely",
        "based",
        "physicochemical",
        "component",
        "biological",
        "phenomenon",
        "therefore",
        "must",
        "involve",
        "nonphysical",
        "force",
        "entity",
        "organicists",
        "sought",
        "offer",
        "third",
        "way",
        "mechanistvitalist",
        "dispute",
        "served",
        "middle",
        "ground",
        "austerity",
        "mechanist",
        "extravagance",
        "neovitalists",
        "peterson",
        "nicholson",
        "gawne",
        "three",
        "major",
        "tenet",
        "organicism",
        "particularly",
        "congenial",
        "development",
        "level",
        "concept",
        "firstly",
        "central",
        "preoccupation",
        "organicist",
        "thought",
        "organization",
        "laid",
        "foundation",
        "level",
        "thinking",
        "cf",
        "nicholson",
        "gawne",
        "organicists",
        "organization",
        "marked",
        "decisive",
        "feature",
        "demarcating",
        "living",
        "phenomenon",
        "nonliving",
        "physicochemical",
        "phenomenon",
        "eg",
        "woodger",
        "von",
        "bertalanffy",
        "needham",
        "b",
        "ch",
        "unlike",
        "neovitalists",
        "however",
        "organicists",
        "hold",
        "organization",
        "inscrutable",
        "rather",
        "important",
        "explanandum",
        "biological",
        "study",
        "nicholson",
        "gawne",
        "moreover",
        "living",
        "organism",
        "exhibited",
        "hierarchical",
        "ordering",
        "among",
        "distinct",
        "part",
        "woodger",
        "von",
        "bertalanffy",
        "needham",
        "b",
        "ch",
        "see",
        "also",
        "nicholson",
        "gawne",
        "combined",
        "nicely",
        "focus",
        "organization",
        "major",
        "explanandum",
        "biology",
        "series",
        "element",
        "compose",
        "different",
        "organism",
        "required",
        "specific",
        "contextualized",
        "treatment",
        "turn",
        "complemented",
        "another",
        "main",
        "tenet",
        "organicists",
        "namely",
        "autonomy",
        "biology",
        "natural",
        "science",
        "cf",
        "nicholson",
        "gawne",
        "level",
        "concept",
        "proved",
        "linchpin",
        "main",
        "tenet",
        "joseph",
        "woodger",
        "combining",
        "feature",
        "thus",
        "express",
        "basic",
        "thinking",
        "behind",
        "level",
        "organization",
        "two",
        "principal",
        "factor",
        "appear",
        "responsible",
        "failure",
        "take",
        "organization",
        "seriously",
        "biology",
        "first",
        "vague",
        "belief",
        "atom",
        "molecule",
        "real",
        "secondly",
        "incautious",
        "use",
        "notion",
        "chemical",
        "composition",
        "also",
        "biological",
        "entity",
        "found",
        "composite",
        "sense",
        "moreover",
        "relatum",
        "relation",
        "composition",
        "physicochemical",
        "object",
        "also",
        "relatum",
        "biological",
        "object",
        "analysis",
        "organism",
        "carried",
        "biologist",
        "reveal",
        "relatum",
        "mutual",
        "relation",
        "composition",
        "different",
        "sense",
        "ie",
        "chemical",
        "composition",
        "eg",
        "organism",
        "analysable",
        "organsystems",
        "organ",
        "tissue",
        "cell",
        "cellparts",
        "hierarchy",
        "composing",
        "part",
        "relatum",
        "hierarchy",
        "organizing",
        "relation",
        "relation",
        "relatum",
        "studied",
        "level",
        "cf",
        "quartz",
        "crystal",
        "simply",
        "term",
        "lower",
        "level",
        "woodger",
        "emphasis",
        "modified",
        "see",
        "also",
        "bertalanffy",
        "needham",
        "unlike",
        "emergentists",
        "level",
        "existence",
        "hierarchical",
        "view",
        "expounded",
        "organicists",
        "emphasized",
        "differentiating",
        "many",
        "distinct",
        "class",
        "matter",
        "possible",
        "form",
        "accommodate",
        "diversity",
        "biological",
        "entity",
        "turn",
        "led",
        "posit",
        "many",
        "level",
        "world",
        "four",
        "super",
        "level",
        "emergentists",
        "physical",
        "chemical",
        "vital",
        "mental",
        "also",
        "implied",
        "increase",
        "complexity",
        "level",
        "organization",
        "brought",
        "bear",
        "treating",
        "living",
        "system",
        "woodger",
        "remark",
        "part",
        "organism",
        "homogeneous",
        "able",
        "call",
        "unit",
        "would",
        "one",
        "level",
        "organization",
        "part",
        "composed",
        "part",
        "forming",
        "organized",
        "system",
        "clearly",
        "two",
        "level",
        "organization",
        "composing",
        "subparts",
        "first",
        "organization",
        "intrinsically",
        "numerically",
        "different",
        "could",
        "speak",
        "two",
        "homogeneous",
        "level",
        "organization",
        "however",
        "subparts",
        "intrinsically",
        "different",
        "firstorder",
        "part",
        "would",
        "different",
        "heterogeneous",
        "type",
        "organization",
        "carrying",
        "process",
        "subdivision",
        "could",
        "obtain",
        "complex",
        "type",
        "organization",
        "exhibiting",
        "hierarchy",
        "successive",
        "level",
        "consider",
        "one",
        "higher",
        "living",
        "organism",
        "evident",
        "organization",
        "belong",
        "one",
        "heterogeneous",
        "hierarchical",
        "type",
        "woodger",
        "idea",
        "level",
        "organization",
        "organization",
        "form",
        "nested",
        "compositional",
        "hierarchy",
        "whole",
        "higher",
        "level",
        "component",
        "lower",
        "level",
        "component",
        "decomposed",
        "part",
        "remains",
        "one",
        "core",
        "feature",
        "notion",
        "level",
        "organization",
        "day",
        "aftermath",
        "organicism",
        "development",
        "level",
        "concept",
        "splintered",
        "different",
        "intellectual",
        "trajectory",
        "little",
        "overall",
        "theoretical",
        "conceptual",
        "coherence",
        "one",
        "direction",
        "development",
        "flowed",
        "framework",
        "general",
        "system",
        "theory",
        "von",
        "bertalanffy",
        "particularly",
        "socalled",
        "hierarchy",
        "theory",
        "whyte",
        "wilson",
        "wilson",
        "wei",
        "pattee",
        "general",
        "system",
        "theory",
        "sought",
        "construct",
        "isomorphism",
        "law",
        "different",
        "scientific",
        "field",
        "based",
        "generic",
        "system",
        "property",
        "von",
        "bertalanffy",
        "nonetheless",
        "continued",
        "emphasize",
        "hierarchical",
        "partwhole",
        "structure",
        "system",
        "von",
        "bertalanffy",
        "level",
        "organization",
        "tradition",
        "ultimately",
        "given",
        "secondary",
        "consideration",
        "articulation",
        "systemgeneric",
        "property",
        "law",
        "similarly",
        "hierarchy",
        "theory",
        "level",
        "tended",
        "treated",
        "derivative",
        "general",
        "notion",
        "hierarchy",
        "ordering",
        "system",
        "nested",
        "subsystem",
        "simon",
        "see",
        "also",
        "wei",
        "hierarchy",
        "level",
        "alike",
        "continued",
        "treated",
        "generic",
        "structure",
        "system",
        "stripe",
        "see",
        "also",
        "t",
        "allen",
        "starr",
        "neill",
        "et",
        "al",
        "however",
        "one",
        "important",
        "distinction",
        "come",
        "tradition",
        "distinction",
        "level",
        "composition",
        "level",
        "control",
        "simon",
        "pattee",
        "former",
        "speaks",
        "nested",
        "compositionality",
        "typically",
        "identified",
        "level",
        "organization",
        "latter",
        "refers",
        "idea",
        "higher",
        "level",
        "impose",
        "constraint",
        "process",
        "lower",
        "level",
        "example",
        "limiting",
        "degree",
        "freedom",
        "system",
        "lower",
        "level",
        "pattee",
        "see",
        "also",
        "umerez",
        "early",
        "attempt",
        "clarifying",
        "concept",
        "level",
        "carried",
        "individual",
        "researcher",
        "working",
        "alone",
        "similar",
        "related",
        "issue",
        "reduction",
        "multilevel",
        "selection",
        "mario",
        "bunge",
        "marjorie",
        "grene",
        "william",
        "wimsatt",
        "a",
        "developed",
        "several",
        "groundlaying",
        "observation",
        "concerning",
        "level",
        "bunge",
        "remark",
        "plethora",
        "meaning",
        "term",
        "posse",
        "offer",
        "long",
        "taxonomy",
        "nine",
        "different",
        "meaning",
        "term",
        "level",
        "ranging",
        "innocuous",
        "level",
        "degree",
        "quantity",
        "level",
        "stress",
        "sense",
        "nature",
        "ordered",
        "evolutionary",
        "series",
        "several",
        "corollary",
        "sens",
        "level",
        "falling",
        "degree",
        "complexity",
        "paper",
        "bunge",
        "go",
        "offering",
        "settheoretic",
        "treatment",
        "level",
        "claiming",
        "leveled",
        "structure",
        "natural",
        "world",
        "render",
        "natural",
        "phenomenon",
        "intelligible",
        "u",
        "bunge",
        "r",
        "grene",
        "also",
        "discus",
        "polysemic",
        "nature",
        "term",
        "hierarchy",
        "later",
        "distinguishes",
        "two",
        "notion",
        "hierarchy",
        "one",
        "falling",
        "mixed",
        "notion",
        "level",
        "composition",
        "control",
        "exemplifying",
        "phylogenetic",
        "rank",
        "wimsatt",
        "work",
        "considered",
        "detail",
        "section"
    ]
}