{
    "main_text": "Thematic Exposition of Levinas’ Philosophy || Philosophical Beginnings: On Escape (1935) or Transcendence as the Need to Escape\n2.1 Philosophical Beginnings: On Escape (1935) or Transcendence as the Need to Escape\n\nLevinas published his thesis, The Theory of Intuition in\nHusserl’s Phenomenology, in 1930. It was the first\nbook-length introduction to Husserl’s thought in French. By\nfocusing on the theme of intuition, Levinas established what\nphilosophical readers find notably in Husserl’s Ideas I\nand II (published in 1913 and, for Ideas II, partially in\n1930): every human experience is open to phenomenological description;\nevery human experience carries meaning from the outset, and can be\nexamined as a mode of intentionality (Ideas II: §56 h and\n§§57–61). The following year, he published his\nco-translation of Husserl’s Cartesian Meditations, in\nwhich Husserl had laid out a systematic presentation of transcendental\nphenomenology. In the 1930s, Levinas continued to publish studies of\nthe thought of his two principal teachers, Husserl and Heidegger.\nThese included the essays “Martin Heidegger and Ontology”\n(EDE: 53–76) and the extensive “The Work of Edmund\nHusserl” (DEH: 47–89). In the 1930s and 1940s, his\nphilosophical project was influenced by Husserl’s\nphenomenological method, whose foundation arguably lay in the\ncentrality of the “transcendental ego” (Ideas I:\n§49). However, suspicious of the intellectualism of\nHusserl’s approach to essences (phenomenological\n“eidetics”), Levinas gravitated toward Heidegger’s\nmore worldly approach to existence in Being and\n Time.[3]\n Between 1930 and 1935, he will nevertheless turn away from\nHeidegger’s approach to being and transcendence and develop the\noutlines of a new ontology. As we shall see, he will reconceive\ntranscendence as a need for escape from existence, and work out a\ndifferent analysis of lived time in that project.\n\nLevinas’ first original essay, On Escape (De\nl’évasion, 1935), examined the relationship between\nthe embodied (sentient) self and the intentional\n ego[4]\n from the perspectives of physical and affective states including\nneed, pleasure, shame, and nausea. In this succinct philosophical\nwork, Levinas was less concerned than was Heidegger with the question\nof existence as it opens up before us when we experience the\ndissolving of things in the world in anxiety (he-BT:\n §40).[5]\n Levinas’ question was not: “Why is there being instead of\nsimply nothing?” His concern was to approach existence\ndifferently, through the (human) being as Heidegger had also done, but\nin light of more embodied experiences like the above-mentioned ones\n(OE: §6). Enlarging Heidegger’s hermeneutics of\nbeing-in-the-world, Levinas gave priority to lived moods and physical\nstates that revealed existence as oppressive and indeterminate.\nIndeed, in escapism and its various aesthetic expressions, we discover\nhumans’ failed attempts to get away from the being that they\nthemselves are. “Escape”, he wrote, \n\n\nis the need to get out of oneself, that is, to break that most radical\nand unalterably binding of chains, the fact that the I [moi]\nis oneself [soi-même]. (OE: §1) \n\n\nIn the two imbricated dimensions of human life, sentient-affective and\nintentional, our experience of being comes to pass, in the\nrelationship between body and egoic consciousness.\n\nLevinas’ youthful project approached transcendence secularly, in\nlight of humans’ irreducible urge to get past the limits of\ntheir physical and social circumstances. His transcendence is less a\nquestion of cognition reaching reality or humans seeking to pass\n‘beyond’ themselves (respectively he-BT: §§43,\n10) than transcendence attempted through sensuous evasions. This quite\nmaterialist approach to transcendence is nevertheless motivated by the\nquestion of our mortality and finite being, but unlike Heidegger, it\nalso examines the enigma called infinity.\n\nLevinas thus accepted Heidegger’s arguments that a human being\nexperiences itself as if thrown into its world (he-BT: §38),\nwithout cognitive mastery over its birth and death. Heidegger’s\nhuman being, or Da-sein (being-there), lives out its time\nprojecting itself toward its diverse possibilities. It flees its\nuncanny thrownness by distracting itself in social pursuits, a\nposition that Levinas will not adopt. On the other hand, the\nprojective element of transcendence, which Heidegger described in\nThe Basic Problems of Phenomenology\n (he-BPP)[6]\n as merely a “stepping over to … as such”, was of\ngreat interest to Levinas. But he would enquire: to what and from what\nare we ‘stepping over’? Levinas then observed: \n\n\n[M]odern sensibility wrestles with problems that indicate … the\nabandonment of this concern with transcendence. As if it had the\ncertainty that the idea of the limit could not apply to the\nexistence of what is … and as if modern sensibility\nperceived in being a defect still more profound. (OE:\n§1, emph. added)\n\n\nHis argument here concerns a conceit of our ‘modern’\nsensibility (and philosophy); namely, that we presume we could\nthoughtfully frame a better conception of being, wherein existence was\nin some sense self-sufficient. What Levinas calls the\n“insufficiency of the human condition” (OE: §1)\nsimply denotes the limitation of our existence, whose transcendence,\nwhen understood as escape, promises that we might somehow surpass it,\nas if through an infinite experience. When transcendence is removed\nfrom theological or metaphysical frameworks (i.e., secularized as\nHeidegger’s “stepping over”), then we grasp it in\nits historical context-dependency, as the illusions of a finite being\npondering pure self-sufficiency. Reconceived in this way, the entire\nquestion of transcendence changes, revealing the struggle to get out\nof our all too finite existence. That is why Levinas asks: “[Is]\nthe need for escape not the exclusive matter of a finite\nbeing? … Would an infinite being have the need to take leave of\nitself” (OE: §2)? In short, is our first response to\nmortality not the urge to take leave of our existence, if\nperiodically? This question is not so different from Heidegger’s\nconception of inauthenticity. But unlike Heidegger, true authenticity\ndoes not lie in securing our freedom for our most personal\npossibility, death. Levinas argued that we can approach death as\npossibility only through that of others and that we grasp being as\nfinite by way of their mortality. On the other hand, when secularized,\nthe idea of infinity refers to something absolute in human\nconsciousness (OE: §1), which motivates our repeated efforts at\nescaping ourselves into various ecstasies. This is clearly a\nconception of being different from Heidegger’s. Later, of\ncourse, Levinas will attribute infinity to a different experience,\nthat of the unbounded quality of the face of the other. However,\nintersubjectivity is little discussed in the 1935 essay. The encounter\nwith the other first comes into view as a theme in his 1940s works (TO\nand EE). Significant here, nevertheless, are the following two points:\n(1) Levinas’ argument that Heidegger’s conception of\nexistence is specific to a history, that of German thought and that of\nhermeneutics; (2) to be an embodied psyche is to struggle with the\nlimits of one’s facticity or existential situation, and it is\nthere that the question of being as our existence initially\narises.\n\nHeidegger’s Da-sein confronted the question of being\nwhen it found itself brought before itself in anxiety (he-BT:\n§40). In contrast, Levinas proposed other ways by which the gap\nnarrows between being itself and the beings that we are. Following his\nleitmotif of our recurrent urge to escape, Levinas examined\nthe invariable disappointments following our attempts at transcending\nour existence: the aforementioned states of need and pleasure give way\nto a sobering up or disillusionment. In affective and physical states\nlike shame and nausea, the bodily self is experienced as a substance\ntrapped in its stifling existence and desperate for a way out.\nCommentator Jacques Rolland has explored Levinas’ return to the\nbody, to concreteness, escape, and the way in which he deformalized\neven Heidegger’s hermeneutics (OE: 29–32). Rolland adds\nthat this approach was inspired by Levinas’ critical meditation,\npublished one year earlier (1934), on the materialist “blood and\nsoil” philosophy popular with National Socialism (RPH). As\nregards stifling existence, when Levinas refers to being, it is as\nongoing presence, rather than the event of disclosure that Heidegger\ndescribed. It remains a matter of debate whether this interpretation\nof being constitutes a step back to an older metaphysics prior to\nHeidegger’s innovations, or not (Franck 2008: 31).\n\nWhether we choose to take Levinas’ approach to being as\ndeformalizing Heidegger or as inspired by him, commentators often\nunderscore its fresh empiricism. Megan Craig compares the early works\nof Levinas with the “radical empiricism” of William James\n(Craig 2010: xv). Lisa Guenther, in turn, has examined embodiment and\nthe experience of maternity in the later Levinas (2006: 119–136,\nsee §3.4.5). From the outset, the “fact of existing”\nrefers to philosophically unexplored phenomena of our embodiment, our\naforementioned I-self (moi-soi) dualism.\n\nPolemically, Levinas urged that the most extreme state he described,\nnausea, amounts to being-there, what Husserl’s phenomenology\ncalled “self-positing”: “… nausea posits\nitself not only as something absolute, but as the very act of\nself-positing: it is the affirmation itself of being” (OE:\n§6). Other forms of self-positing occur, of course, as this event\nrefers to the experience of unity between the embodied self and the\nego of intentions, or indeed between what Raoul Moati compared with\nthe “first-” and the “third-person”\nperspectives (2012 [2017: 38–71]). Thus, in immediate\nexperience, I am my joy or my pain, provisionally, just as I\nmay observe myself joyful, like a third person. Nevertheless, our\nvarious efforts to get out of our concrete situations are not the same\nas what Heidegger deemed projections toward new possibilities, wherein\nour death lies at the end of all the others, as the ultimate limit, or\n“possibility of impossibility” (he-BT: §50). For\nLevinas, by contrast, escape represents a positive, dynamic need. In\nthis youthful work, he also rethinks need as fullness rather than as\nmere privation. As we indicated, he is working toward a different\nunderstanding of existence itself. Whether it is characterized by\npleasure or suffering, need is the very ground of that existence. A\nsecular transcendence responds to need, promising a path toward\n“something other than ourselves” (OE: §3), which is\nwhy the deep motivation of need is to get out of our finite condition.\nAlready by 1935, Levinas’ ontology has displaced\nHeidegger’s being in light of the dynamic relation between the\nsentient self and the intentional ‘I’; it has refocused\nattention on the present over Heidegger’s emphasis on the\nfuture, and explored new modes by which we experience the being that\nwe are.\n\nReconceived as need, pleasure, and nausea, our attempts at\ntranscendence open access to an experience of time different from both\nAristotle’s “measure of motion”, and the fullness of\nawaiting (the anticipated moment or khairos that Heidegger\ndeveloped in his early work). Pleasure and pain are intensities:\n“something like abysses, ever deeper, into which our\nexistence … hurls itself” (OE: §4). The priority of\npresent-time, concentrated into an extended now-moment is opened up\nthrough sensibility and affectivity. In pleasure as in pain, we\nneed—not out of lack—but in desire or in\nhope. “Pleasure is … nothing less than a concentration\nin the instant” (OE: §4). Over Heidegger’s ongoing\nopenness to possibility (he-BT: §31), the present of embodiment\nhere receives existential priority. Levinas’ emphasis on the\npresent is a theme he never\n abandons.[7]\n Moreover, though he adapts it from Husserl’s phenomenology of\n“psychic reality”, he will also enrich\n it.[8]\n\n\nIn sum, Levinas’ early essay is structured around his\nreconceptualization of fundamental existential categories. If\nHusserl’s transcendental ego returns as the “I” of\nintentions in Levinas, it remains that the embodied self has\ngreat importance as the locus or situation from which egoic\ntranscendence arises (i.e., we wake up as if out of our sleeping body,\nour soi). If the self and “I” duality is where\nthe weight of being shows itself most clearly, most affectively, then\nthe precedence Heidegger accorded to the world and to being qua call\nare decisively displaced. As indicated earlier, the latter’s\nfocus on being, as the event of disclosure and withdrawal, is\ninterpreted by Levinas in a pre-Heideggerian fashion, as the constant\npresence which Heidegger had characterized skeptically as\nmetaphysical. Levinas approaches that presence through modalizations\nprovided by sensations and affects that were unexplored by either\nHeidegger or Husserl.\n\nIn 1935, Levinas was convinced that through sensation and states of\nmind we also discover the futility of getting out of existence. In the\nphysical torment of nausea, we experience being in its simplest, most\nburdensome neutrality. To this, Levinas adds three provocative themes.\nFirst, if being is disclosed only through the being that we are, then\nany being that seeks to escape itself because it feels trapped in its\nown facticity, is a “creature”, carrying “the\nstigmatum of [finite] existence” (OE: §8). Second, nausea\nis not simply a physiological event. It shows us dramatically how\nexistence can encircle us on all sides, to the point of submerging us.\nAs Rolland observes, in that case social and political life may also\nnauseate us. Third, if being is experienced in its pure form as\nweighty indeterminacy, then we can neither bypass it (following the\n“aspirations of Idealism” [OE: §8]), nor even simply\naccept it as passive subjects. Being is existence, and it is firstly\nour existence. The mark of creaturely existence is need and,\nby extension, a struggle with being. Levinas concludes polemically,\n\n\n\n[e]very civilization that accepts being—with the tragic despair\nit contains and the crimes it justifies—merits the name\n“barbarian”. (OE: §8) \n\n\nThe question remains: how shall we best think through the sensuous\nneed to transcend being? Embodied need is not an illusion; is\ntranscendence one? Levinas will answer this question fully in\n1961.\n",
    "section_title": "2.1 Philosophical Beginnings: On Escape (1935) or Transcendence as the Need to Escape",
    "entry_title": "Emmanuel Levinas",
    "hierarchy_title": "Emmanuel Levinas || Thematic Exposition of Levinas’ Philosophy || Philosophical Beginnings: On Escape (1935) or Transcendence as the Need to Escape",
    "tokenized_text": [
        "thematic",
        "exposition",
        "levinas",
        "philosophy",
        "philosophical",
        "beginning",
        "escape",
        "transcendence",
        "need",
        "escape",
        "philosophical",
        "beginning",
        "escape",
        "transcendence",
        "need",
        "escape",
        "levinas",
        "published",
        "thesis",
        "theory",
        "intuition",
        "husserl",
        "phenomenology",
        "first",
        "booklength",
        "introduction",
        "husserl",
        "thought",
        "french",
        "focusing",
        "theme",
        "intuition",
        "levinas",
        "established",
        "philosophical",
        "reader",
        "find",
        "notably",
        "husserl",
        "idea",
        "ii",
        "published",
        "idea",
        "ii",
        "partially",
        "every",
        "human",
        "experience",
        "open",
        "phenomenological",
        "description",
        "every",
        "human",
        "experience",
        "carry",
        "meaning",
        "outset",
        "examined",
        "mode",
        "intentionality",
        "idea",
        "ii",
        "h",
        "following",
        "year",
        "published",
        "cotranslation",
        "husserl",
        "cartesian",
        "meditation",
        "husserl",
        "laid",
        "systematic",
        "presentation",
        "transcendental",
        "phenomenology",
        "s",
        "levinas",
        "continued",
        "publish",
        "study",
        "thought",
        "two",
        "principal",
        "teacher",
        "husserl",
        "heidegger",
        "included",
        "essay",
        "martin",
        "heidegger",
        "ontology",
        "ede",
        "extensive",
        "work",
        "edmund",
        "husserl",
        "deh",
        "s",
        "s",
        "philosophical",
        "project",
        "influenced",
        "husserl",
        "phenomenological",
        "method",
        "whose",
        "foundation",
        "arguably",
        "lay",
        "centrality",
        "transcendental",
        "ego",
        "idea",
        "however",
        "suspicious",
        "intellectualism",
        "husserl",
        "approach",
        "essence",
        "phenomenological",
        "eidetics",
        "levinas",
        "gravitated",
        "toward",
        "heidegger",
        "worldly",
        "approach",
        "existence",
        "time",
        "nevertheless",
        "turn",
        "away",
        "heidegger",
        "approach",
        "transcendence",
        "develop",
        "outline",
        "new",
        "ontology",
        "shall",
        "see",
        "reconceive",
        "transcendence",
        "need",
        "escape",
        "existence",
        "work",
        "different",
        "analysis",
        "lived",
        "time",
        "project",
        "levinas",
        "first",
        "original",
        "essay",
        "escape",
        "de",
        "l",
        "évasion",
        "examined",
        "relationship",
        "embodied",
        "sentient",
        "self",
        "intentional",
        "ego",
        "perspective",
        "physical",
        "affective",
        "state",
        "including",
        "need",
        "pleasure",
        "shame",
        "nausea",
        "succinct",
        "philosophical",
        "work",
        "levinas",
        "le",
        "concerned",
        "heidegger",
        "question",
        "existence",
        "open",
        "u",
        "experience",
        "dissolving",
        "thing",
        "world",
        "anxiety",
        "hebt",
        "levinas",
        "question",
        "instead",
        "simply",
        "nothing",
        "concern",
        "approach",
        "existence",
        "differently",
        "human",
        "heidegger",
        "also",
        "done",
        "light",
        "embodied",
        "experience",
        "like",
        "abovementioned",
        "one",
        "oe",
        "enlarging",
        "heidegger",
        "hermeneutics",
        "beingintheworld",
        "levinas",
        "gave",
        "priority",
        "lived",
        "mood",
        "physical",
        "state",
        "revealed",
        "existence",
        "oppressive",
        "indeterminate",
        "indeed",
        "escapism",
        "various",
        "aesthetic",
        "expression",
        "discover",
        "human",
        "failed",
        "attempt",
        "get",
        "away",
        "escape",
        "wrote",
        "need",
        "get",
        "oneself",
        "break",
        "radical",
        "unalterably",
        "binding",
        "chain",
        "fact",
        "moi",
        "oneself",
        "soimême",
        "oe",
        "two",
        "imbricated",
        "dimension",
        "human",
        "life",
        "sentientaffective",
        "intentional",
        "experience",
        "come",
        "pas",
        "relationship",
        "body",
        "egoic",
        "consciousness",
        "levinas",
        "youthful",
        "project",
        "approached",
        "transcendence",
        "secularly",
        "light",
        "human",
        "irreducible",
        "urge",
        "get",
        "past",
        "limit",
        "physical",
        "social",
        "circumstance",
        "transcendence",
        "le",
        "question",
        "cognition",
        "reaching",
        "reality",
        "human",
        "seeking",
        "pas",
        "beyond",
        "respectively",
        "hebt",
        "transcendence",
        "attempted",
        "sensuous",
        "evasion",
        "quite",
        "materialist",
        "approach",
        "transcendence",
        "nevertheless",
        "motivated",
        "question",
        "mortality",
        "finite",
        "unlike",
        "heidegger",
        "also",
        "examines",
        "enigma",
        "called",
        "infinity",
        "levinas",
        "thus",
        "accepted",
        "heidegger",
        "argument",
        "human",
        "experience",
        "thrown",
        "world",
        "hebt",
        "without",
        "cognitive",
        "mastery",
        "birth",
        "death",
        "heidegger",
        "human",
        "dasein",
        "beingthere",
        "life",
        "time",
        "projecting",
        "toward",
        "diverse",
        "possibility",
        "flees",
        "uncanny",
        "thrownness",
        "distracting",
        "social",
        "pursuit",
        "position",
        "levinas",
        "adopt",
        "hand",
        "projective",
        "element",
        "transcendence",
        "heidegger",
        "described",
        "basic",
        "problem",
        "phenomenology",
        "hebpp",
        "merely",
        "stepping",
        "great",
        "interest",
        "levinas",
        "would",
        "enquire",
        "stepping",
        "levinas",
        "observed",
        "odern",
        "sensibility",
        "wrestle",
        "problem",
        "indicate",
        "abandonment",
        "concern",
        "transcendence",
        "certainty",
        "idea",
        "limit",
        "could",
        "apply",
        "existence",
        "modern",
        "sensibility",
        "perceived",
        "defect",
        "still",
        "profound",
        "oe",
        "emph",
        "added",
        "argument",
        "concern",
        "conceit",
        "modern",
        "sensibility",
        "philosophy",
        "namely",
        "presume",
        "could",
        "thoughtfully",
        "frame",
        "better",
        "conception",
        "wherein",
        "existence",
        "sense",
        "selfsufficient",
        "levinas",
        "call",
        "insufficiency",
        "human",
        "condition",
        "oe",
        "simply",
        "denotes",
        "limitation",
        "existence",
        "whose",
        "transcendence",
        "understood",
        "escape",
        "promise",
        "might",
        "somehow",
        "surpass",
        "infinite",
        "experience",
        "transcendence",
        "removed",
        "theological",
        "metaphysical",
        "framework",
        "ie",
        "secularized",
        "heidegger",
        "stepping",
        "grasp",
        "historical",
        "contextdependency",
        "illusion",
        "finite",
        "pondering",
        "pure",
        "selfsufficiency",
        "reconceived",
        "way",
        "entire",
        "question",
        "transcendence",
        "change",
        "revealing",
        "struggle",
        "get",
        "finite",
        "existence",
        "levinas",
        "asks",
        "need",
        "escape",
        "exclusive",
        "matter",
        "finite",
        "would",
        "infinite",
        "need",
        "take",
        "leave",
        "oe",
        "short",
        "first",
        "response",
        "mortality",
        "urge",
        "take",
        "leave",
        "existence",
        "periodically",
        "question",
        "different",
        "heidegger",
        "conception",
        "inauthenticity",
        "unlike",
        "heidegger",
        "true",
        "authenticity",
        "lie",
        "securing",
        "freedom",
        "personal",
        "possibility",
        "death",
        "levinas",
        "argued",
        "approach",
        "death",
        "possibility",
        "others",
        "grasp",
        "finite",
        "way",
        "mortality",
        "hand",
        "secularized",
        "idea",
        "infinity",
        "refers",
        "something",
        "absolute",
        "human",
        "consciousness",
        "oe",
        "motivates",
        "repeated",
        "effort",
        "escaping",
        "various",
        "ecstasy",
        "clearly",
        "conception",
        "different",
        "heidegger",
        "later",
        "course",
        "levinas",
        "attribute",
        "infinity",
        "different",
        "experience",
        "unbounded",
        "quality",
        "face",
        "however",
        "intersubjectivity",
        "little",
        "discussed",
        "essay",
        "encounter",
        "first",
        "come",
        "view",
        "theme",
        "s",
        "work",
        "ee",
        "significant",
        "nevertheless",
        "following",
        "two",
        "point",
        "levinas",
        "argument",
        "heidegger",
        "conception",
        "existence",
        "specific",
        "history",
        "german",
        "thought",
        "hermeneutics",
        "embodied",
        "psyche",
        "struggle",
        "limit",
        "one",
        "facticity",
        "existential",
        "situation",
        "question",
        "existence",
        "initially",
        "arises",
        "heidegger",
        "dasein",
        "confronted",
        "question",
        "found",
        "brought",
        "anxiety",
        "hebt",
        "contrast",
        "levinas",
        "proposed",
        "way",
        "gap",
        "narrow",
        "being",
        "following",
        "leitmotif",
        "recurrent",
        "urge",
        "escape",
        "levinas",
        "examined",
        "invariable",
        "disappointment",
        "following",
        "attempt",
        "transcending",
        "existence",
        "aforementioned",
        "state",
        "need",
        "pleasure",
        "give",
        "way",
        "sobering",
        "disillusionment",
        "affective",
        "physical",
        "state",
        "like",
        "shame",
        "nausea",
        "bodily",
        "self",
        "experienced",
        "substance",
        "trapped",
        "stifling",
        "existence",
        "desperate",
        "way",
        "commentator",
        "jacques",
        "rolland",
        "explored",
        "levinas",
        "return",
        "body",
        "concreteness",
        "escape",
        "way",
        "deformalized",
        "even",
        "heidegger",
        "hermeneutics",
        "oe",
        "rolland",
        "add",
        "approach",
        "inspired",
        "levinas",
        "critical",
        "meditation",
        "published",
        "one",
        "year",
        "earlier",
        "materialist",
        "blood",
        "soil",
        "philosophy",
        "popular",
        "national",
        "socialism",
        "rph",
        "regard",
        "stifling",
        "existence",
        "levinas",
        "refers",
        "ongoing",
        "presence",
        "rather",
        "event",
        "disclosure",
        "heidegger",
        "described",
        "remains",
        "matter",
        "debate",
        "whether",
        "interpretation",
        "constitutes",
        "step",
        "back",
        "older",
        "metaphysics",
        "prior",
        "heidegger",
        "innovation",
        "franck",
        "whether",
        "choose",
        "take",
        "levinas",
        "approach",
        "deformalizing",
        "heidegger",
        "inspired",
        "commentator",
        "often",
        "underscore",
        "fresh",
        "empiricism",
        "megan",
        "craig",
        "compare",
        "early",
        "work",
        "levinas",
        "radical",
        "empiricism",
        "william",
        "james",
        "craig",
        "xv",
        "lisa",
        "guenther",
        "turn",
        "examined",
        "embodiment",
        "experience",
        "maternity",
        "later",
        "levinas",
        "see",
        "outset",
        "fact",
        "existing",
        "refers",
        "philosophically",
        "unexplored",
        "phenomenon",
        "embodiment",
        "aforementioned",
        "iself",
        "moisoi",
        "dualism",
        "polemically",
        "levinas",
        "urged",
        "extreme",
        "state",
        "described",
        "nausea",
        "amount",
        "beingthere",
        "husserl",
        "phenomenology",
        "called",
        "selfpositing",
        "nausea",
        "posit",
        "something",
        "absolute",
        "act",
        "selfpositing",
        "affirmation",
        "oe",
        "form",
        "selfpositing",
        "occur",
        "course",
        "event",
        "refers",
        "experience",
        "unity",
        "embodied",
        "self",
        "ego",
        "intention",
        "indeed",
        "raoul",
        "moati",
        "compared",
        "first",
        "thirdperson",
        "perspective",
        "thus",
        "immediate",
        "experience",
        "joy",
        "pain",
        "provisionally",
        "may",
        "observe",
        "joyful",
        "like",
        "third",
        "person",
        "nevertheless",
        "various",
        "effort",
        "get",
        "concrete",
        "situation",
        "heidegger",
        "deemed",
        "projection",
        "toward",
        "new",
        "possibility",
        "wherein",
        "death",
        "lie",
        "end",
        "others",
        "ultimate",
        "limit",
        "possibility",
        "impossibility",
        "hebt",
        "levinas",
        "contrast",
        "escape",
        "represents",
        "positive",
        "dynamic",
        "need",
        "youthful",
        "work",
        "also",
        "rethink",
        "need",
        "fullness",
        "rather",
        "mere",
        "privation",
        "indicated",
        "working",
        "toward",
        "different",
        "understanding",
        "existence",
        "whether",
        "characterized",
        "pleasure",
        "suffering",
        "need",
        "ground",
        "existence",
        "secular",
        "transcendence",
        "responds",
        "need",
        "promising",
        "path",
        "toward",
        "something",
        "oe",
        "deep",
        "motivation",
        "need",
        "get",
        "finite",
        "condition",
        "already",
        "levinas",
        "ontology",
        "displaced",
        "heidegger",
        "light",
        "dynamic",
        "relation",
        "sentient",
        "self",
        "intentional",
        "refocused",
        "attention",
        "present",
        "heidegger",
        "emphasis",
        "future",
        "explored",
        "new",
        "mode",
        "experience",
        "reconceived",
        "need",
        "pleasure",
        "nausea",
        "attempt",
        "transcendence",
        "open",
        "access",
        "experience",
        "time",
        "different",
        "aristotle",
        "measure",
        "motion",
        "fullness",
        "awaiting",
        "anticipated",
        "moment",
        "khairos",
        "heidegger",
        "developed",
        "early",
        "work",
        "pleasure",
        "pain",
        "intensity",
        "something",
        "like",
        "abyss",
        "ever",
        "deeper",
        "existence",
        "hurl",
        "oe",
        "priority",
        "presenttime",
        "concentrated",
        "extended",
        "nowmoment",
        "opened",
        "sensibility",
        "affectivity",
        "pleasure",
        "pain",
        "neednot",
        "lackbut",
        "desire",
        "hope",
        "pleasure",
        "nothing",
        "le",
        "concentration",
        "instant",
        "oe",
        "heidegger",
        "ongoing",
        "openness",
        "possibility",
        "hebt",
        "present",
        "embodiment",
        "receives",
        "existential",
        "priority",
        "levinas",
        "emphasis",
        "present",
        "theme",
        "never",
        "abandon",
        "moreover",
        "though",
        "adapts",
        "husserl",
        "phenomenology",
        "psychic",
        "reality",
        "also",
        "enrich",
        "sum",
        "levinas",
        "early",
        "essay",
        "structured",
        "around",
        "reconceptualization",
        "fundamental",
        "existential",
        "category",
        "husserl",
        "transcendental",
        "ego",
        "return",
        "intention",
        "levinas",
        "remains",
        "embodied",
        "self",
        "great",
        "importance",
        "locus",
        "situation",
        "egoic",
        "transcendence",
        "arises",
        "ie",
        "wake",
        "sleeping",
        "body",
        "soi",
        "self",
        "duality",
        "weight",
        "show",
        "clearly",
        "affectively",
        "precedence",
        "heidegger",
        "accorded",
        "world",
        "qua",
        "call",
        "decisively",
        "displaced",
        "indicated",
        "earlier",
        "latter",
        "focus",
        "event",
        "disclosure",
        "withdrawal",
        "interpreted",
        "levinas",
        "preheideggerian",
        "fashion",
        "constant",
        "presence",
        "heidegger",
        "characterized",
        "skeptically",
        "metaphysical",
        "levinas",
        "approach",
        "presence",
        "modalizations",
        "provided",
        "sensation",
        "affect",
        "unexplored",
        "either",
        "heidegger",
        "husserl",
        "levinas",
        "convinced",
        "sensation",
        "state",
        "mind",
        "also",
        "discover",
        "futility",
        "getting",
        "existence",
        "physical",
        "torment",
        "nausea",
        "experience",
        "simplest",
        "burdensome",
        "neutrality",
        "levinas",
        "add",
        "three",
        "provocative",
        "theme",
        "first",
        "disclosed",
        "seek",
        "escape",
        "feel",
        "trapped",
        "facticity",
        "creature",
        "carrying",
        "stigmatum",
        "finite",
        "existence",
        "oe",
        "second",
        "nausea",
        "simply",
        "physiological",
        "event",
        "show",
        "u",
        "dramatically",
        "existence",
        "encircle",
        "u",
        "side",
        "point",
        "submerging",
        "u",
        "rolland",
        "observes",
        "case",
        "social",
        "political",
        "life",
        "may",
        "also",
        "nauseate",
        "u",
        "third",
        "experienced",
        "pure",
        "form",
        "weighty",
        "indeterminacy",
        "neither",
        "bypass",
        "following",
        "aspiration",
        "idealism",
        "oe",
        "even",
        "simply",
        "accept",
        "passive",
        "subject",
        "existence",
        "firstly",
        "existence",
        "mark",
        "creaturely",
        "existence",
        "need",
        "extension",
        "struggle",
        "levinas",
        "concludes",
        "polemically",
        "e",
        "civilization",
        "accepts",
        "beingwith",
        "tragic",
        "despair",
        "contains",
        "crime",
        "justifiesmerits",
        "name",
        "barbarian",
        "oe",
        "question",
        "remains",
        "shall",
        "best",
        "think",
        "sensuous",
        "need",
        "transcend",
        "embodied",
        "need",
        "illusion",
        "transcendence",
        "one",
        "levinas",
        "answer",
        "question",
        "fully"
    ]
}