{
    "main_text": "Thematic Exposition of Levinas’ Philosophy || Essays and Interviews after Otherwise than Being: The Tension between Ethics and Justice\n2.5 Essays and Interviews after Otherwise than Being: The Tension between Ethics and Justice\n\nSubsequent to Otherwise than Being,Levinas’ works\nreturn to and refine his major themes. These works include\nTranscendence and Intelligibility (1984), In the Time of\nthe Nations (1988), Entre Nous (1991), and Alterity\nand Transcendence (1995), all of which are collections of essays\nfrom various periods between 1951 and 1989. However, the first of\nthese collections to appear, entitled Of God Who Comes to\nMind (1982), contains the important essay “God and\nPhilosophy” (1975; OGCM: 55–78), which is a critical\nconfrontation with the God of Descartes and Malebranche, and a subtle\ndebate with Heidegger. This essay is followed by the transcript of a\ntwo-hour discussion with professors from the University of Leyden\n(OGCM: 79–99), in which social problems infrequently addressed\nby Levinas are\n raised.[48]\n Despite the wide temporal gamut run by these publications, we find\nfew new developments, other than a clearer resolve to address the\nambiguity intrinsic to the signifier “God” (OGCM:\n§§10–13, 17–19), and the verbal dynamics of\nbeing (corresponding to Heidegger’s Wesen), henceforth\ncharacterized by Levinas’ neologism\n“essance” (OGCM: 43–51).\n\nHowever, Franck has detected a profound divergence in these new\ndevelopments. In a highly sophisticated reading of the essays and\ninterviews written or given after Otherwise than Being, he\nnotes that the tension between the two aforementioned conceptions of\njustice (that of 1961 and that of 1974) has come to look like an\nepistemological inconsistency. This inconsistency is due to\nLevinas’ later choice to hold justice and (empirical) social\nlife at a significant distance from each other. Indeed, by\nprogressively aligning justice with transcendence, Levinas runs into\nan important difficulty after 1974. That is, either justice belongs to\nresponsibility from the outset (1961), whereupon the “third\nparty” refers simply to the tendency of intentional\nconsciousness to reconnect any sensuous gaps in itself, or\nresponsibility and transcendence firstly require justice in\norder to be pondered and communicated. In other words, for Franck,\neither justice and responsibility are co-originary, in which case\nresponsibility cannot leave a trace in justice and being, or\nresponsibility itself presupposes justice, a constituted\nworld, and linguistic concepts. In the first case, that of aligning\nresponsibility and justice, the third party would simply denote\neveryday consciousness (TI). In the second case, justice would in fact\ngravitate toward illeity, the “He-ness” of the absent God\n(OBBE and after). Once again, in the first case and in terms of lived\ntime, the third party is indeed largely simultaneous with the other,\ngiven our social life and context. As Franck explains, we clearly live\nin society and any phenomenological description must operate\nwithin reflection, which is also the domain called the third party.\nBut in the second case, if we hold the third party close to illeity,\nthen the question why I receive justice “for\nmyself” from others can only be answered\nquasi-theologically, as “thanks to God”. Yet this second\noption shifts our attention from justice within social life toward the\nenigma posed by the fact that I do receive justice from\nothers thanks to some near-miraculous concern of theirs for me. But\nthen, should justice for all refer to our social and legal contexts or\nrather to an absolute called illeity? Mobilizing extensive arguments,\nFranck shows that this difficulty comes into a crude light in the late\nworks. And indeed, if the later Levinas chooses to hold these two\nconceptions together, then justice is both social and in some sense\ndivine, like a godly justice or a theopolitics (Franck 2008: 239). If\nit is the latter, then Levinas’ hermeneutics of an ethical\n“otherwise than being” just amounts to an abstraction\nrooted essentially in theology. \n\nAs if anticipating Franck’s strong, structural critique, Levinas\nstaked out a surprising claim for the social simultaneity of the other\nand the third party in a 1982 interview entitled “Philosophy,\nJustice, and Love” (EN: 103–122). He there argues, \n\n\nI do not live in a world where there is but one ‘first\ncome’. There is always a third [party] in the world; he too\nis my other, my neighbor. Consequently, it matters to me to know\nwhich of the two passes first: is the one not the persecutor of the\nother? Must men, [although understood] as incomparable, not be\ncompared? Justice is thus prior here to taking the\nother’s fortunes upon oneself. (EN: 103–104, emph. added)\n\n\n\nThe supposed priority of the other would thus depend on one’s\napproach, which can be ethical or socio-juridical. Indeed, the problem\nof priority is further complicated by the fact that, as early as 1974,\nLevinas cited Isaiah 57:19, deliberately inverting the order of the\nterms, “neighbor” and “the one far away”. He\nthus writes, “Peace to the neighbor and to the distant\none” (OBBE: 157). Eleven years later, he corrects his citation\nin an interview entitled “On Jewish Philosophy” (1985;\nITN: 167–183): “‘Peace, peace, to him that is far\noff and to him that is near’, says the Eternal”. And he\nadds, \n\n\nOutside the one who is near … he who is far off compels\nrecognition. Outside the other there is the third party. He is\nalso an other, also a neighbor. But which is the closest\nproximity? […] There must be knowledge of such things! (ITN:\n172, emph. added)\n\n\nAs a critical reader of Levinas, Franck appears to be the only\ncommentator who has raised Levinas’ later remarks to the status\nof epistemological inconsistency. Franck argues cogently that if we\nmust be able to determine whether the third party is also an other, or\na persecutor of others, or a criminal, then justice must\nprecede responsibility, rather than the reverse. That is,\nrather than responsibility grounding justice thanks to the trace it\nleaves within justice, the latter must have priority (2008,\n240–242). Franck’s objection has important implications\nfor the relationship between ethics and politics in Levinas. We live\nin human society, and we cannot escape that, he says. But does this\nnot imply that it is impossible to set justice decisively outside\npolitics, and as if outside ontology, as Levinas’ later work\nseems to do? That also means that we can never separate the sincerity\nthat Levinas calls “the Saying” (or le dire) from\nthe very words (le dit) that express and describe it. We\ntherefore need words, and intentionality, to make what Levinas\ncharacterized as the pre-thematic into a theme (OBBE: 99). We even\nneed words to stabilize the affect called sincerity or the Saying.\nFailing words, sincerity and with it proximity are simply\nabstractions, philosophical constructions. There is nothing wrong\nper se with such philosophical constructs, if that is what\nthese concepts are. It is illegitimate, however, to argue that they\nprecede intentional consciousness and even reflection.\n\nNow, given Otherwise than Being’s\nrapprochement between the third party and illeity, must the\nthird party not admit two distinct, even irreconcilable senses? The\n1961 sense would still refer to social existence and the moderation of\nresponsibility, while the 1974 sense would henceforth point to a\nradically absent Il, also called “God”. This too\nhas consequences for the question of justice—i.e., whether it is\nprimary to Levinas’ existential ethics, or secondary and largely\nderivative from responsibility. As we know, the Jewish tradition, and\nothers as well, holds the judge responsible for fair decisions; this\nspecialist of laws is also a member of the community and must obey the\nLaw he adjudicates. This is more than simply a platitude; the\njudge’s dual status casts light on the competing priorities of\nresponsibility versus justice. To explain his positions Levinas recurs\nto Psalm 82: “God stands in the divine assembly, among the\ndivine beings. He pronounces judgment”. In other words, only if\nilleity refers to a transcendent absolute, viz., “God in the\ndivine assembly”, can the third party (understood as the others\nor society) be raised above an everyday social function and confer on\njustice something like a regulative idea able to preserve a trace of\ntranscendence.\n\nLevinas’ reference to Psalm 82 is less surprising than we might\nsuppose. Echoing Carl Schmitt’s Political Theology,\nFagenblat points out, firstly, that all the important concepts in\nmodern statehood theory are secularized religious ideas. But,\nsecondly, the secularization process does not stop with statehood\ntheory, “a similar phenomenon applies to secular moral\nconcepts” (Fagenblat 2010: xi, emph. added). \nIn short, “God”\nis the crucial name for an absolute, indispensable to justice\nunderstood as an ongoing project. To be sure, for Franck, the\nreference to a “God” who judges is less a problem of\nsecularization than a reason why it is impossible to argue\nfor the priority of responsibility over justice. And this is\ntrue whether the priority is defined as ontological or\npractical. But Franck fails to acknowledge that Levinas is aware of\nthis tension. In “Philosophy, Justice, and Love”, Levinas\ndraws a complex portrait of the third party as “God” based\non a new, and crucial, distinction between the meaning of\n“God” as Elohim and “God” as the\nTetragrammaton (YHWH; EN:\n 108).[49]\n In the rabbinic tradition, Elohim, God of justice, first\ncreated the world. That world did not survive by itself; that is,\nwithout the “supplement” provided by YHWH, the God of\nmercy. Hence, the necessity of a second creation where justice was\nmore than equal treatment.\n\nGiven the mythic alignment of Elohim with justice, and YHWH\nwith mercifulness, Levinas argues that illeity has two\npossible modalizations: justice or equity; mercy or compassion. The\npriority of one God thus depends on the perspective we adopt: justice\nwould belong to ontology, compassion to an ethical perspective. For\nFagenblat, the ethical priority emerges as the possibility of creating\nand safeguarding meaning—by extension, as creation tout\ncourt (2010: 44–53). \nThat is, in Biblical symbolism, when read in the\nrabbinic tradition, a world created first on justice (as equality and\ncomparison) does not survive, because demands for equality (and with\nthem, for blind justice) are unceasing and do not admit an outside or\ntranscendent term allowing for considerations beyond bilateral\ncomparison. It is the transcendent term, the outside as it were, that\nmotivates justice to strive asymptotically towards an idea. That is\nwhy Levinas observes that being human implies that we are certainly\nborn into a social world, a world of many others and third parties.\nBut we are sustained, and individuated, by mercy. Moreover, mercy\nrepresents, for justice, the trace of responsibility. This becomes\nclear only when one reads Levinas’ philosophy together with his\nTalmudic texts.\n\nFor this and other reasons, the all-important question of the priority\nof responsibility as against justice must be approached as a complex\none, in part dependent on lived circumstances. From the\n“metaphysical” perspective that Levinas defined as desire\nfor the other in Totality and Infinity (TI: 39),\nresponsibility and proximity come first (EN: 107–108). From the\nperspective of practice and our living-in-society, justice stands\ncloser to ethics and may sometimes precede it. Gérard Bensussan\nhas pondered this question in light of the Christian tradition in the\nWest, for which Judaism already represents an alterity—in text\nand in act; for example, when the Passover seder re-enacts the escape\nfrom enslavement in Egypt, it ritually recalls: “strangers we\nwere, and thus, strangers we are”, even now (Bensussan\n2008: 78). A more rigorously philosophical reckoning may require that\nthe relationship between the two perspectives, justice and mercy, be\nfurther clarified. Be that as it may, this is one point on which the\nJewish writings of Levinas enrich, even ground, his philosophical\narguments.\n",
    "section_title": "2.5 Essays and Interviews after Otherwise than Being: The Tension between Ethics and Justice",
    "entry_title": "Emmanuel Levinas",
    "hierarchy_title": "Emmanuel Levinas || Thematic Exposition of Levinas’ Philosophy || Essays and Interviews after Otherwise than Being: The Tension between Ethics and Justice",
    "tokenized_text": [
        "thematic",
        "exposition",
        "levinas",
        "philosophy",
        "essay",
        "interview",
        "otherwise",
        "tension",
        "ethic",
        "justice",
        "essay",
        "interview",
        "otherwise",
        "tension",
        "ethic",
        "justice",
        "subsequent",
        "otherwise",
        "levinas",
        "work",
        "return",
        "refine",
        "major",
        "theme",
        "work",
        "include",
        "transcendence",
        "intelligibility",
        "time",
        "nation",
        "entre",
        "nous",
        "alterity",
        "transcendence",
        "collection",
        "essay",
        "various",
        "period",
        "however",
        "first",
        "collection",
        "appear",
        "entitled",
        "god",
        "come",
        "mind",
        "contains",
        "important",
        "essay",
        "god",
        "philosophy",
        "ogcm",
        "critical",
        "confrontation",
        "god",
        "descartes",
        "malebranche",
        "subtle",
        "debate",
        "heidegger",
        "essay",
        "followed",
        "transcript",
        "twohour",
        "discussion",
        "professor",
        "university",
        "leyden",
        "ogcm",
        "social",
        "problem",
        "infrequently",
        "addressed",
        "levinas",
        "raised",
        "despite",
        "wide",
        "temporal",
        "gamut",
        "run",
        "publication",
        "find",
        "new",
        "development",
        "clearer",
        "resolve",
        "address",
        "ambiguity",
        "intrinsic",
        "signifier",
        "god",
        "ogcm",
        "verbal",
        "dynamic",
        "corresponding",
        "heidegger",
        "wesen",
        "henceforth",
        "characterized",
        "levinas",
        "neologism",
        "essance",
        "ogcm",
        "however",
        "franck",
        "detected",
        "profound",
        "divergence",
        "new",
        "development",
        "highly",
        "sophisticated",
        "reading",
        "essay",
        "interview",
        "written",
        "given",
        "otherwise",
        "note",
        "tension",
        "two",
        "aforementioned",
        "conception",
        "justice",
        "come",
        "look",
        "like",
        "epistemological",
        "inconsistency",
        "inconsistency",
        "due",
        "levinas",
        "later",
        "choice",
        "hold",
        "justice",
        "empirical",
        "social",
        "life",
        "significant",
        "distance",
        "indeed",
        "progressively",
        "aligning",
        "justice",
        "transcendence",
        "levinas",
        "run",
        "important",
        "difficulty",
        "either",
        "justice",
        "belongs",
        "responsibility",
        "outset",
        "whereupon",
        "third",
        "party",
        "refers",
        "simply",
        "tendency",
        "intentional",
        "consciousness",
        "reconnect",
        "sensuous",
        "gap",
        "responsibility",
        "transcendence",
        "firstly",
        "require",
        "justice",
        "order",
        "pondered",
        "communicated",
        "word",
        "franck",
        "either",
        "justice",
        "responsibility",
        "cooriginary",
        "case",
        "responsibility",
        "leave",
        "trace",
        "justice",
        "responsibility",
        "presupposes",
        "justice",
        "constituted",
        "world",
        "linguistic",
        "concept",
        "first",
        "case",
        "aligning",
        "responsibility",
        "justice",
        "third",
        "party",
        "would",
        "simply",
        "denote",
        "everyday",
        "consciousness",
        "ti",
        "second",
        "case",
        "justice",
        "would",
        "fact",
        "gravitate",
        "toward",
        "illeity",
        "heness",
        "absent",
        "god",
        "obbe",
        "first",
        "case",
        "term",
        "lived",
        "time",
        "third",
        "party",
        "indeed",
        "largely",
        "simultaneous",
        "given",
        "social",
        "life",
        "context",
        "franck",
        "explains",
        "clearly",
        "live",
        "society",
        "phenomenological",
        "description",
        "must",
        "operate",
        "within",
        "reflection",
        "also",
        "domain",
        "called",
        "third",
        "party",
        "second",
        "case",
        "hold",
        "third",
        "party",
        "close",
        "illeity",
        "question",
        "receive",
        "justice",
        "others",
        "answered",
        "quasitheologically",
        "thanks",
        "god",
        "yet",
        "second",
        "option",
        "shift",
        "attention",
        "justice",
        "within",
        "social",
        "life",
        "toward",
        "enigma",
        "posed",
        "fact",
        "receive",
        "justice",
        "others",
        "thanks",
        "nearmiraculous",
        "concern",
        "justice",
        "refer",
        "social",
        "legal",
        "context",
        "rather",
        "absolute",
        "called",
        "illeity",
        "mobilizing",
        "extensive",
        "argument",
        "franck",
        "show",
        "difficulty",
        "come",
        "crude",
        "light",
        "late",
        "work",
        "indeed",
        "later",
        "levinas",
        "chooses",
        "hold",
        "two",
        "conception",
        "together",
        "justice",
        "social",
        "sense",
        "divine",
        "like",
        "godly",
        "justice",
        "theopolitics",
        "franck",
        "latter",
        "levinas",
        "hermeneutics",
        "ethical",
        "otherwise",
        "amount",
        "abstraction",
        "rooted",
        "essentially",
        "theology",
        "anticipating",
        "franck",
        "strong",
        "structural",
        "critique",
        "levinas",
        "staked",
        "surprising",
        "claim",
        "social",
        "simultaneity",
        "third",
        "party",
        "interview",
        "entitled",
        "philosophy",
        "justice",
        "love",
        "en",
        "argues",
        "live",
        "world",
        "one",
        "first",
        "come",
        "always",
        "third",
        "party",
        "world",
        "neighbor",
        "consequently",
        "matter",
        "know",
        "two",
        "pass",
        "first",
        "one",
        "persecutor",
        "must",
        "men",
        "although",
        "understood",
        "incomparable",
        "compared",
        "justice",
        "thus",
        "prior",
        "taking",
        "fortune",
        "upon",
        "oneself",
        "en",
        "emph",
        "added",
        "supposed",
        "priority",
        "would",
        "thus",
        "depend",
        "one",
        "approach",
        "ethical",
        "sociojuridical",
        "indeed",
        "problem",
        "priority",
        "complicated",
        "fact",
        "early",
        "levinas",
        "cited",
        "isaiah",
        "deliberately",
        "inverting",
        "order",
        "term",
        "neighbor",
        "one",
        "far",
        "away",
        "thus",
        "writes",
        "peace",
        "neighbor",
        "distant",
        "one",
        "obbe",
        "eleven",
        "year",
        "later",
        "corrects",
        "citation",
        "interview",
        "entitled",
        "jewish",
        "philosophy",
        "itn",
        "peace",
        "peace",
        "far",
        "near",
        "say",
        "eternal",
        "add",
        "outside",
        "one",
        "near",
        "far",
        "compels",
        "recognition",
        "outside",
        "third",
        "party",
        "also",
        "also",
        "neighbor",
        "closest",
        "proximity",
        "must",
        "knowledge",
        "thing",
        "itn",
        "emph",
        "added",
        "critical",
        "reader",
        "levinas",
        "franck",
        "appears",
        "commentator",
        "raised",
        "levinas",
        "later",
        "remark",
        "status",
        "epistemological",
        "inconsistency",
        "franck",
        "argues",
        "cogently",
        "must",
        "able",
        "determine",
        "whether",
        "third",
        "party",
        "also",
        "persecutor",
        "others",
        "criminal",
        "justice",
        "must",
        "precede",
        "responsibility",
        "rather",
        "reverse",
        "rather",
        "responsibility",
        "grounding",
        "justice",
        "thanks",
        "trace",
        "leaf",
        "within",
        "justice",
        "latter",
        "must",
        "priority",
        "franck",
        "objection",
        "important",
        "implication",
        "relationship",
        "ethic",
        "politics",
        "levinas",
        "live",
        "human",
        "society",
        "escape",
        "say",
        "imply",
        "impossible",
        "set",
        "justice",
        "decisively",
        "outside",
        "politics",
        "outside",
        "ontology",
        "levinas",
        "later",
        "work",
        "seems",
        "also",
        "mean",
        "never",
        "separate",
        "sincerity",
        "levinas",
        "call",
        "saying",
        "le",
        "dire",
        "word",
        "le",
        "dit",
        "express",
        "describe",
        "therefore",
        "need",
        "word",
        "intentionality",
        "make",
        "levinas",
        "characterized",
        "prethematic",
        "theme",
        "obbe",
        "even",
        "need",
        "word",
        "stabilize",
        "affect",
        "called",
        "sincerity",
        "saying",
        "failing",
        "word",
        "sincerity",
        "proximity",
        "simply",
        "abstraction",
        "philosophical",
        "construction",
        "nothing",
        "wrong",
        "per",
        "se",
        "philosophical",
        "construct",
        "concept",
        "illegitimate",
        "however",
        "argue",
        "precede",
        "intentional",
        "consciousness",
        "even",
        "reflection",
        "given",
        "otherwise",
        "rapprochement",
        "third",
        "party",
        "illeity",
        "must",
        "third",
        "party",
        "admit",
        "two",
        "distinct",
        "even",
        "irreconcilable",
        "sens",
        "sense",
        "would",
        "still",
        "refer",
        "social",
        "existence",
        "moderation",
        "responsibility",
        "sense",
        "would",
        "henceforth",
        "point",
        "radically",
        "absent",
        "il",
        "also",
        "called",
        "god",
        "consequence",
        "question",
        "justiceie",
        "whether",
        "primary",
        "levinas",
        "existential",
        "ethic",
        "secondary",
        "largely",
        "derivative",
        "responsibility",
        "know",
        "jewish",
        "tradition",
        "others",
        "well",
        "hold",
        "judge",
        "responsible",
        "fair",
        "decision",
        "specialist",
        "law",
        "also",
        "member",
        "community",
        "must",
        "obey",
        "law",
        "adjudicates",
        "simply",
        "platitude",
        "judge",
        "dual",
        "status",
        "cast",
        "light",
        "competing",
        "priority",
        "responsibility",
        "versus",
        "justice",
        "explain",
        "position",
        "levinas",
        "recurs",
        "psalm",
        "god",
        "stand",
        "divine",
        "assembly",
        "among",
        "divine",
        "being",
        "pronounces",
        "judgment",
        "word",
        "illeity",
        "refers",
        "transcendent",
        "absolute",
        "viz",
        "god",
        "divine",
        "assembly",
        "third",
        "party",
        "understood",
        "others",
        "society",
        "raised",
        "everyday",
        "social",
        "function",
        "confer",
        "justice",
        "something",
        "like",
        "regulative",
        "idea",
        "able",
        "preserve",
        "trace",
        "transcendence",
        "levinas",
        "reference",
        "psalm",
        "le",
        "surprising",
        "might",
        "suppose",
        "echoing",
        "carl",
        "schmitt",
        "political",
        "theology",
        "fagenblat",
        "point",
        "firstly",
        "important",
        "concept",
        "modern",
        "statehood",
        "theory",
        "secularized",
        "religious",
        "idea",
        "secondly",
        "secularization",
        "process",
        "stop",
        "statehood",
        "theory",
        "similar",
        "phenomenon",
        "applies",
        "secular",
        "moral",
        "concept",
        "fagenblat",
        "xi",
        "emph",
        "added",
        "short",
        "god",
        "crucial",
        "name",
        "absolute",
        "indispensable",
        "justice",
        "understood",
        "ongoing",
        "project",
        "sure",
        "franck",
        "reference",
        "god",
        "judge",
        "le",
        "problem",
        "secularization",
        "reason",
        "impossible",
        "argue",
        "priority",
        "responsibility",
        "justice",
        "true",
        "whether",
        "priority",
        "defined",
        "ontological",
        "practical",
        "franck",
        "fails",
        "acknowledge",
        "levinas",
        "aware",
        "tension",
        "philosophy",
        "justice",
        "love",
        "levinas",
        "draw",
        "complex",
        "portrait",
        "third",
        "party",
        "god",
        "based",
        "new",
        "crucial",
        "distinction",
        "meaning",
        "god",
        "elohim",
        "god",
        "tetragrammaton",
        "yhwh",
        "en",
        "rabbinic",
        "tradition",
        "elohim",
        "god",
        "justice",
        "first",
        "created",
        "world",
        "world",
        "survive",
        "without",
        "supplement",
        "provided",
        "yhwh",
        "god",
        "mercy",
        "hence",
        "necessity",
        "second",
        "creation",
        "justice",
        "equal",
        "treatment",
        "given",
        "mythic",
        "alignment",
        "elohim",
        "justice",
        "yhwh",
        "mercifulness",
        "levinas",
        "argues",
        "illeity",
        "two",
        "possible",
        "modalizations",
        "justice",
        "equity",
        "mercy",
        "compassion",
        "priority",
        "one",
        "god",
        "thus",
        "depends",
        "perspective",
        "adopt",
        "justice",
        "would",
        "belong",
        "ontology",
        "compassion",
        "ethical",
        "perspective",
        "fagenblat",
        "ethical",
        "priority",
        "emerges",
        "possibility",
        "creating",
        "safeguarding",
        "meaningby",
        "extension",
        "creation",
        "tout",
        "court",
        "biblical",
        "symbolism",
        "read",
        "rabbinic",
        "tradition",
        "world",
        "created",
        "first",
        "justice",
        "equality",
        "comparison",
        "survive",
        "demand",
        "equality",
        "blind",
        "justice",
        "unceasing",
        "admit",
        "outside",
        "transcendent",
        "term",
        "allowing",
        "consideration",
        "beyond",
        "bilateral",
        "comparison",
        "transcendent",
        "term",
        "outside",
        "motivates",
        "justice",
        "strive",
        "asymptotically",
        "towards",
        "idea",
        "levinas",
        "observes",
        "human",
        "implies",
        "certainly",
        "born",
        "social",
        "world",
        "world",
        "many",
        "others",
        "third",
        "party",
        "sustained",
        "individuated",
        "mercy",
        "moreover",
        "mercy",
        "represents",
        "justice",
        "trace",
        "responsibility",
        "becomes",
        "clear",
        "one",
        "read",
        "levinas",
        "philosophy",
        "together",
        "talmudic",
        "text",
        "reason",
        "allimportant",
        "question",
        "priority",
        "responsibility",
        "justice",
        "must",
        "approached",
        "complex",
        "one",
        "part",
        "dependent",
        "lived",
        "circumstance",
        "metaphysical",
        "perspective",
        "levinas",
        "defined",
        "desire",
        "totality",
        "infinity",
        "ti",
        "responsibility",
        "proximity",
        "come",
        "first",
        "en",
        "perspective",
        "practice",
        "livinginsociety",
        "justice",
        "stand",
        "closer",
        "ethic",
        "may",
        "sometimes",
        "precede",
        "gérard",
        "bensussan",
        "pondered",
        "question",
        "light",
        "christian",
        "tradition",
        "west",
        "judaism",
        "already",
        "represents",
        "alterityin",
        "text",
        "act",
        "example",
        "passover",
        "seder",
        "reenacts",
        "escape",
        "enslavement",
        "egypt",
        "ritually",
        "recall",
        "stranger",
        "thus",
        "stranger",
        "even",
        "bensussan",
        "rigorously",
        "philosophical",
        "reckoning",
        "may",
        "require",
        "relationship",
        "two",
        "perspective",
        "justice",
        "mercy",
        "clarified",
        "may",
        "one",
        "point",
        "jewish",
        "writing",
        "levinas",
        "enrich",
        "even",
        "ground",
        "philosophical",
        "argument"
    ]
}