{
    "main_text": "The Given\n6. The Given\n\nLewis’ views about the given are at once among his best known\nand among his most criticized. The pre-analytic datum for\nphilosophical reflection is our “thick” experience and\nknowledge of the world around us, but reflection on this experience\nand knowledge reveals two elements: the given or immediate data of\nexperience and the activity of thought whereby we conceptually\ninterpret the given. The given in sense experience consists of\nspecific sensuous qualities that we are immediately aware of when, for\nexample, we take ourselves to be seeing or hearing or tasting or\nsmelling or touching something, or even to be hallucinating or\ndreaming instead. These distinct qualities or qualia\n(singular quale) are the repeatable felt characters of\nexperience, and include the felt goodness or felt badness of\nparticular experiences or stretches of experience, as well as\nqualities of sight, sound, taste, smell, touch, motion, and other\nfamiliar modes of experience. On the other hand, the repeatability of\nthese qualities, or the similarity of current instances to past\ninstances, isn’t something that is given to us. When we\nconceptually interpret the given, we form hypothetical expectations\nand make predictions, in the light of past experience, concerning\nexperiences we would have were we to engage in specific actions, and\nso, in applying concepts, as Kant suggests, we relate our experiences\nto each other. However, usually, we do so automatically and without\nconscious reflection, in ways that express habitual attitudes and\nassociations rather than engaging in (explicit) inference. The given,\nunlike our conceptual interpretation of it, isn’t alterable by\nour will. It consists of what remains when we subtract from ordinary\nperceptual cognition all that could conceivably be mistaken (Lewis\n(1946), 182–3). Our apprehension of the given isn’t,\ntherefore, subject to any error and isn’t subject to correction\nor verification or disconfirmation from further experience, and\nisn’t, as a result, to be classified as knowledge. Any\ncomparative classification of experience in terms of similarities and\ndifferences with other experiences, on the other hand, relates\nexperiences to each other and and isn’t certain. What we recall\nof past experience, even immediately, isn’t given to us or\ncertain, but, as Lewis makes clear in AKV, our immediate recollection\nor sense of past experience as having been so and so is. \n\nIn MWO, Lewis (1929, 401) says that the given in experience never\noccurs in the absence of interpretation and characterizes the\ndistinction as an “abstraction” of elements that are\nsynthesized in our judgment, but which we may realize are common to\nquite different conceptualizations such as those of the adult and the\nchild (Lewis 1929, 49–50). AKV is more circumspect. Although the\ngiven is what we are immediately aware of or directly apprehend as it\nguides and corrects our interpretations, it isn’t something we\nfocus on or attend to or are “clearly conscious”of in our\nautomatic interpretations (Lewis 1946, 153) any more than in riding a\nbicycle we attend to or focus on the various sensory and motion and\nbalance sensations that are elements in and guide our activity, though\nwe could on reflection and perhaps did in learning (Lewis 1946, 10).\nIn perceptual cognition, what is given in sense experience serves as a\nnatural sign of future experience contingent on action in the light of\npast experience, and prompts the anticipation of such experience. What\nis given is of no interest to active beings apart from what it\nsignifies for future experience and anticipations it prompts for\naction. (Lewis 1946, 10). \n\nNonetheless, Lewis (1952a, reprinted in Lewis 1970, 326) says\n“the validity of this interpretation is that and that\nonly which could attach to it as an inductive inference from the given\nvisual presentation...the incorrigible presentational element”.\nWhat matters for the credibility or warrant or validity of the belief\nis that there is a logical, inferential relation between the belief\nand grounds in experience that prompt it in the light of past\nexperience and that can be elicited on critical reflection and the\ncharacter of the relation made clear enough for our theoretical\npurposes. However, the credibility or validity of the belief\nisn’t created by the reflective attempt to elicit sufficient\ngrounds (Lewis 1946, 186, 189, 262, 329–32) The given, thus,\nplays both a causal role as the ultimate or remote ground responsible\nfor belief and an epistemic role as the ultimate justifying grounds of\nempirical belief. (Lewis 1946, 262, 328–30). \n\nProbability, for Lewis, concerns a logical relation between a\nconclusion and premises, and a statement is categorically assertable\nwith a degree of probability or credibility, or a belief warranted or\ncredible to that degree, as opposed to being merely hypothetically\nprobable a priori to that degree on premises, only to the\nextent that the premises or data are sufficiently credible or\nwarranted or probable. (Lewis 1946, 315–27). Ultimately, the\nconclusion must be warranted or credible or probable on premises or\ndata that are certain, not just true, and that are not just warranted\nor credible only on other premises or data, even if we may never reach\nthese ultimate premises ordinarily in showing probability or\njustification. Otherwise we have “an indefinite regress of the\nmerely probable...and the probability will fail to be genuine”\n(Lewis 1946, 186). Here he echoes MWO where he says that the validity\nof a probability judgement is a relation between the judgement and\n“ultimate premises” that (a) “may verbally be quite\nremote”, unlike the “immediate premises” we might\ninitially and normally cite, that (b) must be a\n“certainty” rather than merely probable on yet further\npremises, and that (c) must be “actual given data for the\nindividual” (Lewis 1929, 328–9). Lewis is defending a\nnormative standard for empirical knowledge that he thinks is implicit\nin cognition and revealed on reflection but which is also\npsychologically and verbally remote from everyday cognitive practices\nof justifying beliefs to ourselves or others in the light of more\nproximate assumptions taken for granted in the context of inquiry or\ndiscussion. Some pragmatists might feel there is tension here. \n\nIn MWO, Lewis (1929, 53) also famously says that the given is\n“ineffable”. So how can what is ineffable even be true,\nand how can what is neither true nor false, nor as a result, neither\nprobably true nor probably false, serve as the ultimate premises of\na priori valid logical probability relations licensing\nbelief or assertion with probability or credibility? And how can we\nanticipate or predict future experience that isn’t yet given,\nexcept in conceptual or comparative terms that won’t allow for\ndecisive falsification? Again, there may seem to be tension in\nLewis’ views of the given and the epistemic role he assigns it.\nLewis (1936a and 1936b, reprinted in Lewis 1970, 155–7,\n292–3) clearly recognizes the logical and epistemological\nproblems, and he responds by introducing categories of\nexpressive statements and the expressive use of\nlanguage. This carries over into AKV. Expressive statements like\n“It seems as though I am seeing a red round thing” serve\nto convey or express or denote what we directly apprehend in\nexperience without conceptualizing and interpreting it. They are true\nby virtue of the qualitative character of experience they express and\nare verified by it, and false only when we knowingly lie about our\nexperience, and the ineffability of what they express just consists in\ntheir not implying possibilities of further experience. Moreover,\ntheir truth is something that we know, or, as he more carefully and\nrepeatedly says in AKV, something about which we are certain (Lewis\n1946, 171–2, 183, 204, 327). The expressive use of language is\nto convey or express what is not only directly apprehended but what\nmay be directly apprehensible in the future or, perhaps, was directly\napprehensible in the past. (Lewis 1946, 179). Nonetheless, Lewis notes\nthat the expressive use of language is needed only for the discussion\nof knowledge, not for knowledge itself (Lewis 1946, 183; 1952a,\nreprinted in Lewis 1970, 327). So perhaps it isn’t surprising\nthat later he also talks of “immediately given facts of\nsense” and “facts of our seeming to remember” (Lewis\n1946, 327, 353) and “datum facts” and “logical\nrelations of facts” (Lewis 1952a, reprinted in Lewis 1970, 325).\n\n\nSellars (1963, 132) thought that the classical empiricist given was an\ninconsistent triad of three claims: (1) being appeared to as if there\nwere something red entails non-inferentially knowing that one is\nappeared redly to, (2) the ability to be appeared to is unacquired,\nand (3) the ability to know facts of the form x is F is acquired.\nLewis clearly denied (1), but he recognized this was the result of a\nchoice about how to use “know” and that others,\n“without fault”, might choose to extend it to direct\napprehensions of sense because they are certain for us (Lewis 1946,\n183). However, if Lewis followed suit and granted (1), it seems he\nwould deny (3) on the grounds that the ability to be certain of the\ngiven wasn’t acquired. Sellars might question whether such\ncertainty, or the expressive language in which it was couched, was\nsufficiently rich in content to support other knowledge inferentially.\nIn any case, Lewis’ defense of the certainty of the given rests\non two claims. First, it is just an undeniable fact, apparent to\nanyone who reflects on experience, that there is a sensuous character\nof experience which we are aware of and can’t be mistaken about\nand which, until it fades to memory, isn’t subject to correction\nand isn’t further confirmable. As Lewis (1952a, reprinted in\nLewis 1970, 329) put it in his symposium on the given with Reichenbach\n(1952) and Goodman (1952), there is no requirement of “inductive\nconsistency” on protocols or expressive statments. Second, the\nsupposition that probability is always relative to something else that\nis itself only probable means that probabilities can never get off the\nground. As Lewis famously says, “if anything is to be probable,\nsomething must be certain” (Lewis 1946, 186). Goodman (1952), in\nhis symposium contribution, argued that the premises relative to which\nother statements are credible or probable just have to be initially\ncredible on their own to some degree, not certain, though subject to\nfuture confirmation or disconfirmation in the light of further\nexperience. So long as they are initially credible on their own rather\nthan because something else is initially credible, Lewis’\nregress fails. This is a view that attracted many epistemologists\nafter Lewis in some form or other. \n\nLewis’ response is instructive for his understanding of\nepistemology. For Lewis (1952a, reprinted in Lewis 1970, 330), a\nprincipal task of epistemology is with the “validity” of\nknowledge, that is to say with the justification or warrant for\ncognition that distinguishes empirically warranted belief from lucky\nor unlucky guess or hazard of belief. If a class of beliefs in\nprinciple may be false, we need some reason or grounds for thinking\nits members true or likely to be true, especially if we plan to base\nother beliefs on them. That requires present or past justifying\ngrounds of belief, not just future potential for verification or\nconfirmation as he thinks Goodman proposes. Otherwise, we confuse\njustification with verification, or ignore the former for the latter.\nNor can the grounds consist solely in other beliefs that might be\nmistaken without grounds for thinking them true or likely to be true,\nor in beliefs that stand in conditional probabilistic relations to\neach other, as he thinks Reichenbach proposes, without any antecedent\nprobabilities deriving from something else (Lewis 1952a, reprinted in\nLewis 1970, 328). Lewis acknowledges that his (somewhat traditional)\nconcerns with validation or justification, skepticism, and the need\nfor given justifying grounds, lead him to depart from or supplement\nstandard pragmatic theories. \n\nFinally, we can’t directly verify the existence of other\nsubjects of experience or what is given to them in their experience.\nNonetheless, Lewis (1934, 1941b) claimed that by empathy, in terms of\nour own conscious experience, we can imagine or envisage the conscious\nexperience of others, rather than simply our own experience of others\nand their bodies and our interactions with them. Moreover, the\nsupposition of another consciousness like ours, with a body like ours,\ncan be indirectly confirmed and supported by induction. However, Lewis\nprovided no details concerning this inductive support for our belief\nin other minds. \n",
    "section_title": "6. The Given",
    "entry_title": "Clarence Irving Lewis",
    "hierarchy_title": "Clarence Irving Lewis || The Given",
    "tokenized_text": [
        "given",
        "given",
        "lewis",
        "view",
        "given",
        "among",
        "best",
        "known",
        "among",
        "criticized",
        "preanalytic",
        "datum",
        "philosophical",
        "reflection",
        "thick",
        "experience",
        "knowledge",
        "world",
        "around",
        "u",
        "reflection",
        "experience",
        "knowledge",
        "reveals",
        "two",
        "element",
        "given",
        "immediate",
        "data",
        "experience",
        "activity",
        "thought",
        "whereby",
        "conceptually",
        "interpret",
        "given",
        "given",
        "sense",
        "experience",
        "consists",
        "specific",
        "sensuous",
        "quality",
        "immediately",
        "aware",
        "example",
        "take",
        "seeing",
        "hearing",
        "tasting",
        "smelling",
        "touching",
        "something",
        "even",
        "hallucinating",
        "dreaming",
        "instead",
        "distinct",
        "quality",
        "qualia",
        "singular",
        "quale",
        "repeatable",
        "felt",
        "character",
        "experience",
        "include",
        "felt",
        "goodness",
        "felt",
        "badness",
        "particular",
        "experience",
        "stretch",
        "experience",
        "well",
        "quality",
        "sight",
        "sound",
        "taste",
        "smell",
        "touch",
        "motion",
        "familiar",
        "mode",
        "experience",
        "hand",
        "repeatability",
        "quality",
        "similarity",
        "current",
        "instance",
        "past",
        "instance",
        "something",
        "given",
        "u",
        "conceptually",
        "interpret",
        "given",
        "form",
        "hypothetical",
        "expectation",
        "make",
        "prediction",
        "light",
        "past",
        "experience",
        "concerning",
        "experience",
        "would",
        "engage",
        "specific",
        "action",
        "applying",
        "concept",
        "kant",
        "suggests",
        "relate",
        "experience",
        "however",
        "usually",
        "automatically",
        "without",
        "conscious",
        "reflection",
        "way",
        "express",
        "habitual",
        "attitude",
        "association",
        "rather",
        "engaging",
        "explicit",
        "inference",
        "given",
        "unlike",
        "conceptual",
        "interpretation",
        "alterable",
        "consists",
        "remains",
        "subtract",
        "ordinary",
        "perceptual",
        "cognition",
        "could",
        "conceivably",
        "mistaken",
        "lewis",
        "apprehension",
        "given",
        "therefore",
        "subject",
        "error",
        "subject",
        "correction",
        "verification",
        "disconfirmation",
        "experience",
        "result",
        "classified",
        "knowledge",
        "comparative",
        "classification",
        "experience",
        "term",
        "similarity",
        "difference",
        "experience",
        "hand",
        "relates",
        "experience",
        "certain",
        "recall",
        "past",
        "experience",
        "even",
        "immediately",
        "given",
        "u",
        "certain",
        "lewis",
        "make",
        "clear",
        "akv",
        "immediate",
        "recollection",
        "sense",
        "past",
        "experience",
        "mwo",
        "lewis",
        "say",
        "given",
        "experience",
        "never",
        "occurs",
        "absence",
        "interpretation",
        "characterizes",
        "distinction",
        "abstraction",
        "element",
        "synthesized",
        "judgment",
        "may",
        "realize",
        "common",
        "quite",
        "different",
        "conceptualization",
        "adult",
        "child",
        "lewis",
        "akv",
        "circumspect",
        "although",
        "given",
        "immediately",
        "aware",
        "directly",
        "apprehend",
        "guide",
        "corrects",
        "interpretation",
        "something",
        "focus",
        "attend",
        "clearly",
        "conscious",
        "automatic",
        "interpretation",
        "lewis",
        "riding",
        "bicycle",
        "attend",
        "focus",
        "various",
        "sensory",
        "motion",
        "balance",
        "sensation",
        "element",
        "guide",
        "activity",
        "though",
        "could",
        "reflection",
        "perhaps",
        "learning",
        "lewis",
        "perceptual",
        "cognition",
        "given",
        "sense",
        "experience",
        "serf",
        "natural",
        "sign",
        "future",
        "experience",
        "contingent",
        "action",
        "light",
        "past",
        "experience",
        "prompt",
        "anticipation",
        "experience",
        "given",
        "interest",
        "active",
        "being",
        "apart",
        "signifies",
        "future",
        "experience",
        "anticipation",
        "prompt",
        "action",
        "lewis",
        "nonetheless",
        "lewis",
        "a",
        "reprinted",
        "lewis",
        "say",
        "validity",
        "interpretation",
        "could",
        "attach",
        "inductive",
        "inference",
        "given",
        "visual",
        "presentation",
        "incorrigible",
        "presentational",
        "element",
        "matter",
        "credibility",
        "warrant",
        "validity",
        "belief",
        "logical",
        "inferential",
        "relation",
        "belief",
        "ground",
        "experience",
        "prompt",
        "light",
        "past",
        "experience",
        "elicited",
        "critical",
        "reflection",
        "character",
        "relation",
        "made",
        "clear",
        "enough",
        "theoretical",
        "purpose",
        "however",
        "credibility",
        "validity",
        "belief",
        "created",
        "reflective",
        "attempt",
        "elicit",
        "sufficient",
        "ground",
        "lewis",
        "given",
        "thus",
        "play",
        "causal",
        "role",
        "ultimate",
        "remote",
        "ground",
        "responsible",
        "belief",
        "epistemic",
        "role",
        "ultimate",
        "justifying",
        "ground",
        "empirical",
        "belief",
        "lewis",
        "probability",
        "lewis",
        "concern",
        "logical",
        "relation",
        "conclusion",
        "premise",
        "statement",
        "categorically",
        "assertable",
        "degree",
        "probability",
        "credibility",
        "belief",
        "warranted",
        "credible",
        "degree",
        "opposed",
        "merely",
        "hypothetically",
        "probable",
        "priori",
        "degree",
        "premise",
        "extent",
        "premise",
        "data",
        "sufficiently",
        "credible",
        "warranted",
        "probable",
        "lewis",
        "ultimately",
        "conclusion",
        "must",
        "warranted",
        "credible",
        "probable",
        "premise",
        "data",
        "certain",
        "true",
        "warranted",
        "credible",
        "premise",
        "data",
        "even",
        "may",
        "never",
        "reach",
        "ultimate",
        "premise",
        "ordinarily",
        "showing",
        "probability",
        "justification",
        "otherwise",
        "indefinite",
        "regress",
        "merely",
        "probable",
        "probability",
        "fail",
        "genuine",
        "lewis",
        "echo",
        "mwo",
        "say",
        "validity",
        "probability",
        "judgement",
        "relation",
        "judgement",
        "ultimate",
        "premise",
        "may",
        "verbally",
        "quite",
        "remote",
        "unlike",
        "immediate",
        "premise",
        "might",
        "initially",
        "normally",
        "cite",
        "b",
        "must",
        "certainty",
        "rather",
        "merely",
        "probable",
        "yet",
        "premise",
        "c",
        "must",
        "actual",
        "given",
        "data",
        "individual",
        "lewis",
        "lewis",
        "defending",
        "normative",
        "standard",
        "empirical",
        "knowledge",
        "think",
        "implicit",
        "cognition",
        "revealed",
        "reflection",
        "also",
        "psychologically",
        "verbally",
        "remote",
        "everyday",
        "cognitive",
        "practice",
        "justifying",
        "belief",
        "others",
        "light",
        "proximate",
        "assumption",
        "taken",
        "granted",
        "context",
        "inquiry",
        "discussion",
        "pragmatist",
        "might",
        "feel",
        "tension",
        "mwo",
        "lewis",
        "also",
        "famously",
        "say",
        "given",
        "ineffable",
        "ineffable",
        "even",
        "true",
        "neither",
        "true",
        "false",
        "result",
        "neither",
        "probably",
        "true",
        "probably",
        "false",
        "serve",
        "ultimate",
        "premise",
        "priori",
        "valid",
        "logical",
        "probability",
        "relation",
        "licensing",
        "belief",
        "assertion",
        "probability",
        "credibility",
        "anticipate",
        "predict",
        "future",
        "experience",
        "yet",
        "given",
        "except",
        "conceptual",
        "comparative",
        "term",
        "allow",
        "decisive",
        "falsification",
        "may",
        "seem",
        "tension",
        "lewis",
        "view",
        "given",
        "epistemic",
        "role",
        "assigns",
        "lewis",
        "a",
        "b",
        "reprinted",
        "lewis",
        "clearly",
        "recognizes",
        "logical",
        "epistemological",
        "problem",
        "responds",
        "introducing",
        "category",
        "expressive",
        "statement",
        "expressive",
        "use",
        "language",
        "carry",
        "akv",
        "expressive",
        "statement",
        "like",
        "seems",
        "though",
        "seeing",
        "red",
        "round",
        "thing",
        "serve",
        "convey",
        "express",
        "denote",
        "directly",
        "apprehend",
        "experience",
        "without",
        "conceptualizing",
        "interpreting",
        "true",
        "virtue",
        "qualitative",
        "character",
        "experience",
        "express",
        "verified",
        "false",
        "knowingly",
        "lie",
        "experience",
        "ineffability",
        "express",
        "consists",
        "implying",
        "possibility",
        "experience",
        "moreover",
        "truth",
        "something",
        "know",
        "carefully",
        "repeatedly",
        "say",
        "akv",
        "something",
        "certain",
        "lewis",
        "expressive",
        "use",
        "language",
        "convey",
        "express",
        "directly",
        "apprehended",
        "may",
        "directly",
        "apprehensible",
        "future",
        "perhaps",
        "directly",
        "apprehensible",
        "past",
        "lewis",
        "nonetheless",
        "lewis",
        "note",
        "expressive",
        "use",
        "language",
        "needed",
        "discussion",
        "knowledge",
        "knowledge",
        "lewis",
        "a",
        "reprinted",
        "lewis",
        "perhaps",
        "surprising",
        "later",
        "also",
        "talk",
        "immediately",
        "given",
        "fact",
        "sense",
        "fact",
        "seeming",
        "remember",
        "lewis",
        "datum",
        "fact",
        "logical",
        "relation",
        "fact",
        "lewis",
        "a",
        "reprinted",
        "lewis",
        "sellars",
        "thought",
        "classical",
        "empiricist",
        "given",
        "inconsistent",
        "triad",
        "three",
        "claim",
        "appeared",
        "something",
        "red",
        "entail",
        "noninferentially",
        "knowing",
        "one",
        "appeared",
        "redly",
        "ability",
        "appeared",
        "unacquired",
        "ability",
        "know",
        "fact",
        "form",
        "x",
        "f",
        "acquired",
        "lewis",
        "clearly",
        "denied",
        "recognized",
        "result",
        "choice",
        "use",
        "know",
        "others",
        "without",
        "fault",
        "might",
        "choose",
        "extend",
        "direct",
        "apprehension",
        "sense",
        "certain",
        "u",
        "lewis",
        "however",
        "lewis",
        "followed",
        "suit",
        "granted",
        "seems",
        "would",
        "deny",
        "ground",
        "ability",
        "certain",
        "given",
        "acquired",
        "sellars",
        "might",
        "question",
        "whether",
        "certainty",
        "expressive",
        "language",
        "couched",
        "sufficiently",
        "rich",
        "content",
        "support",
        "knowledge",
        "inferentially",
        "case",
        "lewis",
        "defense",
        "certainty",
        "given",
        "rest",
        "two",
        "claim",
        "first",
        "undeniable",
        "fact",
        "apparent",
        "anyone",
        "reflects",
        "experience",
        "sensuous",
        "character",
        "experience",
        "aware",
        "mistaken",
        "fade",
        "memory",
        "subject",
        "correction",
        "confirmable",
        "lewis",
        "a",
        "reprinted",
        "lewis",
        "put",
        "symposium",
        "given",
        "reichenbach",
        "goodman",
        "requirement",
        "inductive",
        "consistency",
        "protocol",
        "expressive",
        "statments",
        "second",
        "supposition",
        "probability",
        "always",
        "relative",
        "something",
        "else",
        "probable",
        "mean",
        "probability",
        "never",
        "get",
        "ground",
        "lewis",
        "famously",
        "say",
        "anything",
        "probable",
        "something",
        "must",
        "certain",
        "lewis",
        "goodman",
        "symposium",
        "contribution",
        "argued",
        "premise",
        "relative",
        "statement",
        "credible",
        "probable",
        "initially",
        "credible",
        "degree",
        "certain",
        "though",
        "subject",
        "future",
        "confirmation",
        "disconfirmation",
        "light",
        "experience",
        "long",
        "initially",
        "credible",
        "rather",
        "something",
        "else",
        "initially",
        "credible",
        "lewis",
        "regress",
        "fails",
        "view",
        "attracted",
        "many",
        "epistemologist",
        "lewis",
        "form",
        "lewis",
        "response",
        "instructive",
        "understanding",
        "epistemology",
        "lewis",
        "a",
        "reprinted",
        "lewis",
        "principal",
        "task",
        "epistemology",
        "validity",
        "knowledge",
        "say",
        "justification",
        "warrant",
        "cognition",
        "distinguishes",
        "empirically",
        "warranted",
        "belief",
        "lucky",
        "unlucky",
        "guess",
        "hazard",
        "belief",
        "class",
        "belief",
        "principle",
        "may",
        "false",
        "need",
        "reason",
        "ground",
        "thinking",
        "member",
        "true",
        "likely",
        "true",
        "especially",
        "plan",
        "base",
        "belief",
        "requires",
        "present",
        "past",
        "justifying",
        "ground",
        "belief",
        "future",
        "potential",
        "verification",
        "confirmation",
        "think",
        "goodman",
        "proposes",
        "otherwise",
        "confuse",
        "justification",
        "verification",
        "ignore",
        "former",
        "latter",
        "ground",
        "consist",
        "solely",
        "belief",
        "might",
        "mistaken",
        "without",
        "ground",
        "thinking",
        "true",
        "likely",
        "true",
        "belief",
        "stand",
        "conditional",
        "probabilistic",
        "relation",
        "think",
        "reichenbach",
        "proposes",
        "without",
        "antecedent",
        "probability",
        "deriving",
        "something",
        "else",
        "lewis",
        "a",
        "reprinted",
        "lewis",
        "lewis",
        "acknowledges",
        "somewhat",
        "traditional",
        "concern",
        "validation",
        "justification",
        "skepticism",
        "need",
        "given",
        "justifying",
        "ground",
        "lead",
        "depart",
        "supplement",
        "standard",
        "pragmatic",
        "theory",
        "finally",
        "directly",
        "verify",
        "existence",
        "subject",
        "experience",
        "given",
        "experience",
        "nonetheless",
        "lewis",
        "b",
        "claimed",
        "empathy",
        "term",
        "conscious",
        "experience",
        "imagine",
        "envisage",
        "conscious",
        "experience",
        "others",
        "rather",
        "simply",
        "experience",
        "others",
        "body",
        "interaction",
        "moreover",
        "supposition",
        "another",
        "consciousness",
        "like",
        "body",
        "like",
        "indirectly",
        "confirmed",
        "supported",
        "induction",
        "however",
        "lewis",
        "provided",
        "detail",
        "concerning",
        "inductive",
        "support",
        "belief",
        "mind"
    ]
}