{
    "main_text": "The A Priori and the Analytic\n4. The A Priori and the Analytic\n\nLewis (1946, 29–31) thought that necessary truths are knowable\na priori, independently of experience. In applying concepts\nlike those of red or apple to current experience, and so interpreting\nexperience, we form expectations and make predictions about future\nexperience, conditional on actions we might perform. Our beliefs\nconstitute empirical knowledge in so far as past experience gives us\ngood reason (largely inductive) for making these predictions. However,\nwe aren’t making predictions about future experience simply in\nstating what these concepts are, and what their definitions are, and\nwhat defining criteria they provide for applying them to experience.\nSuch statements are explicative, not predictive, and so neither\nfalsifiable by failed prediction nor verifiable by successful\nprediction nor justified by inductive evidence. The a priori\nis what we are not required to abandon, no matter what experience may\nbring, and in that sense, true no matter what, and in that sense\nnecessary (Lewis 1929, 267.) However, a priori principles are\nneither principles that are universal nor ones that we have to accept.\nThe acceptance of a set of concepts is a matter of decision or\nlegislation or the adoption of an intention to employ certain criteria\nin the interpretation of experience, something for which there are\nalternatives but for which the criteria are not empirical but\npragmatic. \n\nIn MWO Lewis (1929, 254) also thought that the a priori\nextended to fundamental laws of nature defining basic concepts like\nmass or energy or simultaneity, and thus included some of what are\ntypically regarded as the basic principles of a scientific theory.\nFurther, besides criteria like convenience and conformity to human\nbent, pragmatic considerations mentioned in MWO (Lewis 1929, 267)\ninclude factors like intellectual simplicity, economy,\ncomprehensiveness, and thus the overall achievement of intellectual\norder. However, unlike Wilfrid Sellars and many others in the latter\nhalf of the 20th century, Lewis never recognized such\nfactors as criteria of empirical justification. The reason seems to be\nthat Lewis (1936b, reprinted in Lewis 1970, 286) didn’t think\nthat these factors make a hypothesis any more probable, in contrast,\npresumably, to conformity to standard criteria of induction:\n“What such simplicity and convenience determine is not truth or\neven probability but merely simplicity and convenience, which have\ntheir reasonable place in the choice of working hypotheses when no\nmore decisive criterion is presently at hand”. At the same time,\nhe thought that the acceptance and rejection of scientific theories\nwasn’t entirely empirical. The choice of a system of concepts\nand a priori explicative principles to apply to experience\nand to interpret it in the light of is determined by pragmatic\nconsiderations, not truth or probability. The simpler set of\nscientific concepts and explicative principles is no more true or\nlikely to be true than the simpler logic is more true or valid.\nMoreover, pragmatic considerations might lead us in the face of\nexperience to abandon our scientific concepts and a priori\nprinciples explicating them without making the latter empirically\nunwarranted or any less a priori warranted.\n\nEmpirical belief and a priori belief aren’t logically\nseparated but intertwined for Lewis. The empirical belief that there\nare no unicorns presupposes the concepts of negation and unicorn, and\nthus more general a priori principles governing negation and\nexplicating the concept of unicorn, e.g. unicorns are horse-like\ncreatures with a horn in their nose. Repeatedly failing to apply the\nconcept of unicorn successfully to experience may make it extremely\nlikely that there are no unicorns and eventually lead us to drop the\nconcept altogether from our conceptual repertoire as useless clutter,\nalong with beliefs explicating the concept, but it doesn’t do so\nby disconfirming or making any less likely the belief that if anything\nis a unicorn, it is a horned horse-like creature. More important cases\nLewis discusses are ones where we discover that there are no Euclidean\nfigures in our space and cease employing Euclidean geometry to\ninterpret experience, or ones where cruder categories for interpreting\nexperience are replaced by more fine grained ones that carve up\nexperience in novel ways that are more valuable for our purposes, or\nones where inventions open up the bounds of experience and lead us to\nabandon an old theory that can accommodate such experience but in a\nless simple way than a novel one. Categories for Lewis don’t\nreally change or alter but are given up and replaced, and old a\npriori truths are replaced by new ones, not contradicted by them\nand not made false by them (Lewis 1929, 267–8). \n\nThe most radical challenge to Lewis came from Quine (1951 [1953]) who\nargued that the distinction between so called a priori truths\nand a posteriori truths is just one of degree. The argument\nhas two steps. First, empirical hypotheses have implications for\nexperience only in conjunction with various empirical generalizatons\nand other background assumptions, e.g. about the circumstances of\nperception. Recalcitrant experience thus tells us only that some\nbelief or assumption in the total set that implies a contrary\nexperience is false, not which one, and thus any statement can be held\ntrue, no matter what experience brings, so long as we make enough\nadjustments to the rest of our beliefs and assumptions. Second,\nempirical hypotheses can’t logically imply anything about\nexperience except against a background of assumed laws of logic.\nRecalcitrant experience can, in principle, then, lead us to revise an\nassumed logical principle in our web of belief rather one of our other\nbeliefs. \n\nWith respect to the second step, some philosophers might object that\nlogic is part of the framework within which beliefs have logical\nimplications and can’t be part of the same system of belief\nitself. However, Lewis himself might have trouble with this\nsuggestion, since he recognized the possibility of alternative logics,\nand presumably, any decision, even pragmatic, about the adoption or\nrejection of a logic must operate on some logical assumptions. In any\ncase, Lewis himself recognizes that in principle experience could lead\nus to abandon logical beliefs and replace them with others. What he\nwill deny is that it does so by making these principles empirically\nimprobable, and thus any less a priori warranted. Arguably,\nhe may be assuming an excessively narrow view of what makes for\nprobability. \n\nWith respect to the first step, Lewis (1946) in AKV will deny\nQuine’s assumption that objective statements never entail\nconditionals about experience without supposing other objective\nstatements true and his assumption that the antecedents of these\nconditionals are never themselves certain, as we shall see in the next\ntwo sections. Moreover, objective hypotheses, despite their various\ninterconnections in a system of empirical belief, aren’t tested\nas a “block”, but have separable and distinct\nprobabilistic connections to others (but not thereby to all) and to\nexperience establishing differing antecedent probabilities and degrees\nof confidence, in the light of which the relevance of tests for the\nprobability of the various hypotheses needs to be assessed\ndifferentially. (Lewis, 1936b, reprinted in Lewis 1970, 285–6,\nLewis 1946, 349–52). However, even so, there may be room for\nalternative ways of modifying systems of hypotheses and their degrees\nof credibility in the light of experience, and different responses to\nprobabilities that are unsettled and may change with future testing.\nSo, in an unpublished lecture, Lewis (1936b, 282–7) says we are\nleft with pragmatic factors like economy, convenience, simplicity, or\nmaking the least alteration to beliefs, at least for the time being,\nto choose “working hypotheses” even if they don’t\ncount as empirical knowledge. Lewis (1946) omits this discussion from\nAKV. Nonetheless it highlights the need for Lewis to provide a\npositive account of non-empirical, non-inductive a priori\nknowledge of principles explicating our concepts and how we have it,\nnot just a negative account that simply contrasts it with empirical\nknowledge. \n\nIn MWO, he says the a priori is knowable by the reflective\nand critical formulation of our own principles of classification, at\nleast with respect to meaning connections explicitly before the mind\n(Lewis 1929, 287–8) and in AKV that a priori truths are\ncertifiable by reference to meanings alone (and their relations like\ninclusion), and tested simply by what we can think or imagine being so\n(Lewis 1946, 35, 151–3). However, the only explanation he gives\nof why this should warrant us in thinking anything necessary or\npossible is that “as what we intend at the moment at least, a\nmeaning seems to be as open to direct examination as anything we are\nlikely to discover” (Lewis 1946, 145). It is this that warrants\nus as dismissing any apparent Euclidean triangle the sum of whose\nangles isn’t 180 degrees as either a mismeasurement or not a\nEuclidean triangle rather than a counterexample to Euclidean geometry.\nBarring certainty, there seems to be a half-acknowledged,\nnon-inductive, basic principle of a priori credibility\nassumed here, to the effect that if on reflection on our concepts and\nmeanings and classificatory intentions, we think A includes B, then we\nare at least prima facie warranted in thinking A does include\nB. In the next section, we shall see that Lewis isn’t in\nprinciple averse to non-inductively supported principles of prima\nfacie warrant. \n",
    "section_title": "4. The A Priori and the Analytic",
    "entry_title": "Clarence Irving Lewis",
    "hierarchy_title": "Clarence Irving Lewis || The A Priori and the Analytic",
    "tokenized_text": [
        "priori",
        "analytic",
        "priori",
        "analytic",
        "lewis",
        "thought",
        "necessary",
        "truth",
        "knowable",
        "priori",
        "independently",
        "experience",
        "applying",
        "concept",
        "like",
        "red",
        "apple",
        "current",
        "experience",
        "interpreting",
        "experience",
        "form",
        "expectation",
        "make",
        "prediction",
        "future",
        "experience",
        "conditional",
        "action",
        "might",
        "perform",
        "belief",
        "constitute",
        "empirical",
        "knowledge",
        "far",
        "past",
        "experience",
        "give",
        "u",
        "good",
        "reason",
        "largely",
        "inductive",
        "making",
        "prediction",
        "however",
        "making",
        "prediction",
        "future",
        "experience",
        "simply",
        "stating",
        "concept",
        "definition",
        "defining",
        "criterion",
        "provide",
        "applying",
        "experience",
        "statement",
        "explicative",
        "predictive",
        "neither",
        "falsifiable",
        "failed",
        "prediction",
        "verifiable",
        "successful",
        "prediction",
        "justified",
        "inductive",
        "evidence",
        "priori",
        "required",
        "abandon",
        "matter",
        "experience",
        "may",
        "bring",
        "sense",
        "true",
        "matter",
        "sense",
        "necessary",
        "lewis",
        "however",
        "priori",
        "principle",
        "neither",
        "principle",
        "universal",
        "one",
        "accept",
        "acceptance",
        "set",
        "concept",
        "matter",
        "decision",
        "legislation",
        "adoption",
        "intention",
        "employ",
        "certain",
        "criterion",
        "interpretation",
        "experience",
        "something",
        "alternative",
        "criterion",
        "empirical",
        "pragmatic",
        "mwo",
        "lewis",
        "also",
        "thought",
        "priori",
        "extended",
        "fundamental",
        "law",
        "nature",
        "defining",
        "basic",
        "concept",
        "like",
        "mass",
        "energy",
        "simultaneity",
        "thus",
        "included",
        "typically",
        "regarded",
        "basic",
        "principle",
        "scientific",
        "theory",
        "besides",
        "criterion",
        "like",
        "convenience",
        "conformity",
        "human",
        "bent",
        "pragmatic",
        "consideration",
        "mentioned",
        "mwo",
        "lewis",
        "include",
        "factor",
        "like",
        "intellectual",
        "simplicity",
        "economy",
        "comprehensiveness",
        "thus",
        "overall",
        "achievement",
        "intellectual",
        "order",
        "however",
        "unlike",
        "wilfrid",
        "sellars",
        "many",
        "others",
        "latter",
        "half",
        "th",
        "century",
        "lewis",
        "never",
        "recognized",
        "factor",
        "criterion",
        "empirical",
        "justification",
        "reason",
        "seems",
        "lewis",
        "b",
        "reprinted",
        "lewis",
        "think",
        "factor",
        "make",
        "hypothesis",
        "probable",
        "contrast",
        "presumably",
        "conformity",
        "standard",
        "criterion",
        "induction",
        "simplicity",
        "convenience",
        "determine",
        "truth",
        "even",
        "probability",
        "merely",
        "simplicity",
        "convenience",
        "reasonable",
        "place",
        "choice",
        "working",
        "hypothesis",
        "decisive",
        "criterion",
        "presently",
        "hand",
        "time",
        "thought",
        "acceptance",
        "rejection",
        "scientific",
        "theory",
        "entirely",
        "empirical",
        "choice",
        "system",
        "concept",
        "priori",
        "explicative",
        "principle",
        "apply",
        "experience",
        "interpret",
        "light",
        "determined",
        "pragmatic",
        "consideration",
        "truth",
        "probability",
        "simpler",
        "set",
        "scientific",
        "concept",
        "explicative",
        "principle",
        "true",
        "likely",
        "true",
        "simpler",
        "logic",
        "true",
        "valid",
        "moreover",
        "pragmatic",
        "consideration",
        "might",
        "lead",
        "u",
        "face",
        "experience",
        "abandon",
        "scientific",
        "concept",
        "priori",
        "principle",
        "explicating",
        "without",
        "making",
        "latter",
        "empirically",
        "unwarranted",
        "le",
        "priori",
        "warranted",
        "empirical",
        "belief",
        "priori",
        "belief",
        "logically",
        "separated",
        "intertwined",
        "lewis",
        "empirical",
        "belief",
        "unicorn",
        "presupposes",
        "concept",
        "negation",
        "unicorn",
        "thus",
        "general",
        "priori",
        "principle",
        "governing",
        "negation",
        "explicating",
        "concept",
        "unicorn",
        "eg",
        "unicorn",
        "horselike",
        "creature",
        "horn",
        "nose",
        "repeatedly",
        "failing",
        "apply",
        "concept",
        "unicorn",
        "successfully",
        "experience",
        "may",
        "make",
        "extremely",
        "likely",
        "unicorn",
        "eventually",
        "lead",
        "u",
        "drop",
        "concept",
        "altogether",
        "conceptual",
        "repertoire",
        "useless",
        "clutter",
        "along",
        "belief",
        "explicating",
        "concept",
        "disconfirming",
        "making",
        "le",
        "likely",
        "belief",
        "anything",
        "unicorn",
        "horned",
        "horselike",
        "creature",
        "important",
        "case",
        "lewis",
        "discus",
        "one",
        "discover",
        "euclidean",
        "figure",
        "space",
        "cease",
        "employing",
        "euclidean",
        "geometry",
        "interpret",
        "experience",
        "one",
        "cruder",
        "category",
        "interpreting",
        "experience",
        "replaced",
        "fine",
        "grained",
        "one",
        "carve",
        "experience",
        "novel",
        "way",
        "valuable",
        "purpose",
        "one",
        "invention",
        "open",
        "bound",
        "experience",
        "lead",
        "u",
        "abandon",
        "old",
        "theory",
        "accommodate",
        "experience",
        "le",
        "simple",
        "way",
        "novel",
        "one",
        "category",
        "lewis",
        "really",
        "change",
        "alter",
        "given",
        "replaced",
        "old",
        "priori",
        "truth",
        "replaced",
        "new",
        "one",
        "contradicted",
        "made",
        "false",
        "lewis",
        "radical",
        "challenge",
        "lewis",
        "came",
        "quine",
        "argued",
        "distinction",
        "called",
        "priori",
        "truth",
        "posteriori",
        "truth",
        "one",
        "degree",
        "argument",
        "two",
        "step",
        "first",
        "empirical",
        "hypothesis",
        "implication",
        "experience",
        "conjunction",
        "various",
        "empirical",
        "generalizatons",
        "background",
        "assumption",
        "eg",
        "circumstance",
        "perception",
        "recalcitrant",
        "experience",
        "thus",
        "tell",
        "u",
        "belief",
        "assumption",
        "total",
        "set",
        "implies",
        "contrary",
        "experience",
        "false",
        "one",
        "thus",
        "statement",
        "held",
        "true",
        "matter",
        "experience",
        "brings",
        "long",
        "make",
        "enough",
        "adjustment",
        "rest",
        "belief",
        "assumption",
        "second",
        "empirical",
        "hypothesis",
        "logically",
        "imply",
        "anything",
        "experience",
        "except",
        "background",
        "assumed",
        "law",
        "logic",
        "recalcitrant",
        "experience",
        "principle",
        "lead",
        "u",
        "revise",
        "assumed",
        "logical",
        "principle",
        "web",
        "belief",
        "rather",
        "one",
        "belief",
        "respect",
        "second",
        "step",
        "philosopher",
        "might",
        "object",
        "logic",
        "part",
        "framework",
        "within",
        "belief",
        "logical",
        "implication",
        "part",
        "system",
        "belief",
        "however",
        "lewis",
        "might",
        "trouble",
        "suggestion",
        "since",
        "recognized",
        "possibility",
        "alternative",
        "logic",
        "presumably",
        "decision",
        "even",
        "pragmatic",
        "adoption",
        "rejection",
        "logic",
        "must",
        "operate",
        "logical",
        "assumption",
        "case",
        "lewis",
        "recognizes",
        "principle",
        "experience",
        "could",
        "lead",
        "u",
        "abandon",
        "logical",
        "belief",
        "replace",
        "others",
        "deny",
        "making",
        "principle",
        "empirically",
        "improbable",
        "thus",
        "le",
        "priori",
        "warranted",
        "arguably",
        "may",
        "assuming",
        "excessively",
        "narrow",
        "view",
        "make",
        "probability",
        "respect",
        "first",
        "step",
        "lewis",
        "akv",
        "deny",
        "quine",
        "assumption",
        "objective",
        "statement",
        "never",
        "entail",
        "conditionals",
        "experience",
        "without",
        "supposing",
        "objective",
        "statement",
        "true",
        "assumption",
        "antecedent",
        "conditionals",
        "never",
        "certain",
        "shall",
        "see",
        "next",
        "two",
        "section",
        "moreover",
        "objective",
        "hypothesis",
        "despite",
        "various",
        "interconnection",
        "system",
        "empirical",
        "belief",
        "tested",
        "block",
        "separable",
        "distinct",
        "probabilistic",
        "connection",
        "others",
        "thereby",
        "experience",
        "establishing",
        "differing",
        "antecedent",
        "probability",
        "degree",
        "confidence",
        "light",
        "relevance",
        "test",
        "probability",
        "various",
        "hypothesis",
        "need",
        "assessed",
        "differentially",
        "lewis",
        "b",
        "reprinted",
        "lewis",
        "lewis",
        "however",
        "even",
        "may",
        "room",
        "alternative",
        "way",
        "modifying",
        "system",
        "hypothesis",
        "degree",
        "credibility",
        "light",
        "experience",
        "different",
        "response",
        "probability",
        "unsettled",
        "may",
        "change",
        "future",
        "testing",
        "unpublished",
        "lecture",
        "lewis",
        "b",
        "say",
        "left",
        "pragmatic",
        "factor",
        "like",
        "economy",
        "convenience",
        "simplicity",
        "making",
        "least",
        "alteration",
        "belief",
        "least",
        "time",
        "choose",
        "working",
        "hypothesis",
        "even",
        "count",
        "empirical",
        "knowledge",
        "lewis",
        "omits",
        "discussion",
        "akv",
        "nonetheless",
        "highlight",
        "need",
        "lewis",
        "provide",
        "positive",
        "account",
        "nonempirical",
        "noninductive",
        "priori",
        "knowledge",
        "principle",
        "explicating",
        "concept",
        "negative",
        "account",
        "simply",
        "contrast",
        "empirical",
        "knowledge",
        "mwo",
        "say",
        "priori",
        "knowable",
        "reflective",
        "critical",
        "formulation",
        "principle",
        "classification",
        "least",
        "respect",
        "meaning",
        "connection",
        "explicitly",
        "mind",
        "lewis",
        "akv",
        "priori",
        "truth",
        "certifiable",
        "reference",
        "meaning",
        "alone",
        "relation",
        "like",
        "inclusion",
        "tested",
        "simply",
        "think",
        "imagine",
        "lewis",
        "however",
        "explanation",
        "give",
        "warrant",
        "u",
        "thinking",
        "anything",
        "necessary",
        "possible",
        "intend",
        "moment",
        "least",
        "meaning",
        "seems",
        "open",
        "direct",
        "examination",
        "anything",
        "likely",
        "discover",
        "lewis",
        "warrant",
        "u",
        "dismissing",
        "apparent",
        "euclidean",
        "triangle",
        "sum",
        "whose",
        "angle",
        "degree",
        "either",
        "mismeasurement",
        "euclidean",
        "triangle",
        "rather",
        "counterexample",
        "euclidean",
        "geometry",
        "barring",
        "certainty",
        "seems",
        "halfacknowledged",
        "noninductive",
        "basic",
        "principle",
        "priori",
        "credibility",
        "assumed",
        "effect",
        "reflection",
        "concept",
        "meaning",
        "classificatory",
        "intention",
        "think",
        "includes",
        "b",
        "least",
        "prima",
        "facie",
        "warranted",
        "thinking",
        "include",
        "b",
        "next",
        "section",
        "shall",
        "see",
        "lewis",
        "principle",
        "averse",
        "noninductively",
        "supported",
        "principle",
        "prima",
        "facie",
        "warrant"
    ]
}