{
    "main_text": "Liberal Anti-Clericalism\n6. Liberal Anti-Clericalism\n\nThe region where the confrontation between liberals and conservatives\nover the religious problem was most violent was Mexico, where the\ncolonial church had been the most powerful. The first confrontation\nwith the church took place in 1833, but the decisive blow to the\nchurch came with the “Reform Laws” in 1855–1863,\nwhich, among other measures, nationalized most of its property and\nestablished a separation between church and State. The political\nchallenge that the church posed to the liberal regimes pushed some\nMexican liberals to move beyond their constitutionalism and to press\nfor social and economic reform. This was the case of José\nMaría Luis Mora (1794–1850), the most prominent Mexican\nliberal and whose liberal identity came to be centered on his\nanti-clericalism. He was a historian, politician, legislator, and a\npriest. His liberalism was strongly influenced by his admiration of\nthe Cádiz constitution of 1812, the writings of\nMontesquieu and Constant, and by the course of political events that\nled him to assume anticlerical views. Mora began his career as a\nliberal intellectual as a partisan of constitutionalism. A constant\ntheme in his writings is the defense of the “absolute”\nliberty of opinion and the criticism of any limits to freedom of the\npress. He argued that it is impossible to limit the freedom to think\nand to have opinions since men cannot divest themselves from their\nopinions through external force. Thus, he claimed, it is neither just\nnor convenient to prevent them from expressing their thoughts. The\ncrucial point for public order, in his view, is that men observe the\nlaw regardless of the opinions that they may hold. He maintained that\nno principle of justice can ground the prohibition of doctrines\nconsidered false since men are fallible and the best or only means for\narriving at knowledge of the truth is to subject doctrines to\nexamination in a free discussion. The amendment of wrong opinions\ncannot be attained through prohibition but through the free\ncirculation of ideas (Mora 1837: 491–5). Following Montesquieu,\nMora placed great emphasis on the security of the person and affirmed\nthe conception of civil freedom as the faculty of doing everything\nthat the law does not expressly prohibit (Mora 1837: 504–6).\n\nAs an admirer of the Cadiz constitution, Mora espoused the idea of\npopular sovereignty but, following Constant, claimed that the latter\nwas not unlimited. In his engagement with Rousseau, Constant had\naffirmed the notion of the general will as the source of legitimate\npolitical authority, but had denied the unlimited authority of society\nover the individual. According to Constant, individual rights are the\nlimits that the political authority must not trespass. Mora warned\nthat any unlimited authority was essentially tyrannical and, following\nMontesquieu, characterized despotism as the lawless, absolute, and\nunlimited use of political power regardless of the hands in which it\nfalls and the particular form of government that it takes (Mora 1837:\n475). According to Mora, individual rights and liberties limit the\nexercise of political power lest it become despotic. As was\nconventional wisdom in nineteenth century French liberalism, Mora\nargued for a franchise limited to proprietors who, in his view, were\nthe only members of society capable of exerting an independent\njudgment, of displaying true civic virtues, and of caring for the\npublic good (Mora 1837: 633–4). At the same time, however, he\nstrove for the improvement of “the moral condition of popular\nclasses” through various forms of education. However, Mora\ndeparted from the conventional wisdom of nineteenth century French\nliberalism in various ways. First, he rejected monarchism, continued\nto regard individual rights as natural, and subscribed to the doctrine\nof the social contract. He held that men’s purpose in\nestablishing society is the preservation of their “liberty,\nsecurity, equality and properties” (Mora 1837: 475). Second,\nMora explicitly rejected Constant’s defense of a\n“conservative power”, which was one of the latter’s\nmost popular conceptions in Latin America, though not among liberals\n(Mora 1837: 681). Constant had conceived of the constitutional monarch\nas a neutral power that could moderate conflicts among the executive,\nthe legislative, and the judicial branches. As already mentioned, this\nnotion was adopted by the Brazilian monarchy.\n\nThe third way in which Mora departed from French liberalism was his\nanticlericalism, which was motivated by local political events.\nDespite his admiration for the Cádiz constitution, Mora\ncriticized the fact that it did not abolish the special privileges\nenjoyed by the military and the church. With respect to the latter in\nparticular, Mora reacted against the church’s opposition to the\nestablishment of republican values and came to regard it as a power\ncapable of destabilizing the republic, to subvert its laws, and to\nturn the mass of the population against it (Mora 1837: 66). He\nregarded the church as having a esprit des corps that was\nopposed to both the national spirit and the representative system\ninsofar as the church sought to maintain special privileges and\nimmunities that were contrary to civil equality. He emphasized the\nchurch’s refusal to submit to civil and criminal law, its\nopposition to freedom of worship as well as to freedom of thought and\nof the press. On his view, the church opposed these freedoms because\ntheir exercise threatened the former’s rule over consciences. In\nthe same vein, Mora regarded the church as an obstacle to public\neducation insofar as education was instrumental to the masses’\nemancipation from priestly power (Mora 1837: 63). He also considered\nthe church as an obstacle to colonization of scarcely populated\nterritories in virtue of its opposition to freedom of worship. He even\ncriticized the clergy’s celibacy, which, on his view, isolates\nits members from society insofar as family ties are the “primary\nlink that binds men to society” (Mora 1837: 61). Mora advocated\nthe confiscation of the church’s property on the grounds that\nthe clergy was not a productive class and lacked an inclination to\nindustrious work. In Mexico, the church was indeed the wealthiest\nfinancial agent and the largest single proprietor in the nineteenth\ncentury until most of its property was nationalized in 1859.\n\nDespite his multifaceted condemnation of the church, Mora’s\nanticlericalism did not entail hostility to religion. He held that the\nchurch should be free to devote itself to its spiritual mission since\n“religious beliefs and principles of conscience are man’s\nmost sacred property considered as an individual” (Mora 1837:\n74). His concern was to argue for the separation between the religious\nand the political “principles.” He maintained that the\nchurch should have no share in the exercise of political power, nor\nshould it have any power to coerce citizens either in the form of\nforced economic contributions or punishments that are not solely\nspiritual. He warned that the religious principle degenerates when it\nis not kept separate from the political one. By contrast with the\nArgentinian Alberdi, who did not have to deal with a similarly\npowerful Catholic Church, Mora advocated a strong reformist state\ncapable of curbing the opposition to liberal values by established\nsocial powers. According to Mora, a reformist state had to create the\nconditions for citizen’s freedom and equality. This was a\nposition that was contrary to Alberdi’s commitment to more\nlaissez faire liberalism.\n\nIndeed, those countries in which liberalism became the dominant\nideology in the late nineteenth century implemented secularizing\nreform laws that emancipated official institutions from control by the\nCatholic Church. Such reform laws created a civil registry,\nestablished civil matrimony and, in some cases, the possibility of\ndivorce. Church property was often confiscated, convents and\nmonasteries closed, and the Catholic Church’s legal immunities\nabolished. Central among such reforms was the secularization of\nofficial schooling, which became “laicist”. This process\nof secularization, along the lines suggested by Mora, took place\ncomparatively early in Mexico (beginning in the 1850’s\n–after a failed attempt in the 1830’s) and Colombia\n(1850’s and 60’s). In both countries the process turned\nbitter and violent since the Church was powerful and was able to\noppose resistance. The “laicist” State was consolidated in\nMexico with the total defeat of the conservative pro-clerical\nadversaries, while in Colombia the secularizing reforms were almost\nfully reverted with the triumph of pro-clerical conservative\n“Regeneración” (1885–1904). During the 1870’s\nand 80’s similar processes of secularization took place in\nVenezuela and the Central American republics. Much less\nconfrontational and violent were comparable changes in Chile,\nArgentina, and Uruguay in the 1880’s, and in later years in\nEcuador, Bolivia, and Perú (where religious freedom was\nestablished only in 1915). The process in Brazil was rather different\nsince the monarchy had maintained control over the Church through the\npatronage system (priests received State salaries and the monarch\nappointed clerical authorities, among other measures). The\nestablishment of the republic in the late 1880’s, strongly\ninfluenced by positivism, brought with it full religious freedom and\nthe separation of Church and State. With the exception Colombia, the\nliberal forces of secularization won out during this period displacing\nthe Catholic Church from its traditional participation in the ruling\nof society through official political institutions.\n",
    "section_title": "6. Liberal Anti-Clericalism",
    "entry_title": "Liberalism in Latin America",
    "hierarchy_title": "Liberalism in Latin America || Liberal Anti-Clericalism",
    "tokenized_text": [
        "liberal",
        "anticlericalism",
        "liberal",
        "anticlericalism",
        "region",
        "confrontation",
        "liberal",
        "conservative",
        "religious",
        "problem",
        "violent",
        "mexico",
        "colonial",
        "church",
        "powerful",
        "first",
        "confrontation",
        "church",
        "took",
        "place",
        "decisive",
        "blow",
        "church",
        "came",
        "reform",
        "law",
        "among",
        "measure",
        "nationalized",
        "property",
        "established",
        "separation",
        "church",
        "state",
        "political",
        "challenge",
        "church",
        "posed",
        "liberal",
        "regime",
        "pushed",
        "mexican",
        "liberal",
        "move",
        "beyond",
        "constitutionalism",
        "press",
        "social",
        "economic",
        "reform",
        "case",
        "josé",
        "maría",
        "luis",
        "mora",
        "prominent",
        "mexican",
        "liberal",
        "whose",
        "liberal",
        "identity",
        "came",
        "centered",
        "anticlericalism",
        "historian",
        "politician",
        "legislator",
        "priest",
        "liberalism",
        "strongly",
        "influenced",
        "admiration",
        "cádiz",
        "constitution",
        "writing",
        "montesquieu",
        "constant",
        "course",
        "political",
        "event",
        "led",
        "assume",
        "anticlerical",
        "view",
        "mora",
        "began",
        "career",
        "liberal",
        "intellectual",
        "partisan",
        "constitutionalism",
        "constant",
        "theme",
        "writing",
        "defense",
        "absolute",
        "liberty",
        "opinion",
        "criticism",
        "limit",
        "freedom",
        "press",
        "argued",
        "impossible",
        "limit",
        "freedom",
        "think",
        "opinion",
        "since",
        "men",
        "divest",
        "opinion",
        "external",
        "force",
        "thus",
        "claimed",
        "neither",
        "convenient",
        "prevent",
        "expressing",
        "thought",
        "crucial",
        "point",
        "public",
        "order",
        "view",
        "men",
        "observe",
        "law",
        "regardless",
        "opinion",
        "may",
        "hold",
        "maintained",
        "principle",
        "justice",
        "ground",
        "prohibition",
        "doctrine",
        "considered",
        "false",
        "since",
        "men",
        "fallible",
        "best",
        "mean",
        "arriving",
        "knowledge",
        "truth",
        "subject",
        "doctrine",
        "examination",
        "free",
        "discussion",
        "amendment",
        "wrong",
        "opinion",
        "attained",
        "prohibition",
        "free",
        "circulation",
        "idea",
        "mora",
        "following",
        "montesquieu",
        "mora",
        "placed",
        "great",
        "emphasis",
        "security",
        "person",
        "affirmed",
        "conception",
        "civil",
        "freedom",
        "faculty",
        "everything",
        "law",
        "expressly",
        "prohibit",
        "mora",
        "admirer",
        "cadiz",
        "constitution",
        "mora",
        "espoused",
        "idea",
        "popular",
        "sovereignty",
        "following",
        "constant",
        "claimed",
        "latter",
        "unlimited",
        "engagement",
        "rousseau",
        "constant",
        "affirmed",
        "notion",
        "general",
        "source",
        "legitimate",
        "political",
        "authority",
        "denied",
        "unlimited",
        "authority",
        "society",
        "individual",
        "according",
        "constant",
        "individual",
        "right",
        "limit",
        "political",
        "authority",
        "must",
        "trespass",
        "mora",
        "warned",
        "unlimited",
        "authority",
        "essentially",
        "tyrannical",
        "following",
        "montesquieu",
        "characterized",
        "despotism",
        "lawless",
        "absolute",
        "unlimited",
        "use",
        "political",
        "power",
        "regardless",
        "hand",
        "fall",
        "particular",
        "form",
        "government",
        "take",
        "mora",
        "according",
        "mora",
        "individual",
        "right",
        "liberty",
        "limit",
        "exercise",
        "political",
        "power",
        "lest",
        "become",
        "despotic",
        "conventional",
        "wisdom",
        "nineteenth",
        "century",
        "french",
        "liberalism",
        "mora",
        "argued",
        "franchise",
        "limited",
        "proprietor",
        "view",
        "member",
        "society",
        "capable",
        "exerting",
        "independent",
        "judgment",
        "displaying",
        "true",
        "civic",
        "virtue",
        "caring",
        "public",
        "good",
        "mora",
        "time",
        "however",
        "strove",
        "improvement",
        "moral",
        "condition",
        "popular",
        "class",
        "various",
        "form",
        "education",
        "however",
        "mora",
        "departed",
        "conventional",
        "wisdom",
        "nineteenth",
        "century",
        "french",
        "liberalism",
        "various",
        "way",
        "first",
        "rejected",
        "monarchism",
        "continued",
        "regard",
        "individual",
        "right",
        "natural",
        "subscribed",
        "doctrine",
        "social",
        "contract",
        "held",
        "men",
        "purpose",
        "establishing",
        "society",
        "preservation",
        "liberty",
        "security",
        "equality",
        "property",
        "mora",
        "second",
        "mora",
        "explicitly",
        "rejected",
        "constant",
        "defense",
        "conservative",
        "power",
        "one",
        "latter",
        "popular",
        "conception",
        "latin",
        "america",
        "though",
        "among",
        "liberal",
        "mora",
        "constant",
        "conceived",
        "constitutional",
        "monarch",
        "neutral",
        "power",
        "could",
        "moderate",
        "conflict",
        "among",
        "executive",
        "legislative",
        "judicial",
        "branch",
        "already",
        "mentioned",
        "notion",
        "adopted",
        "brazilian",
        "monarchy",
        "third",
        "way",
        "mora",
        "departed",
        "french",
        "liberalism",
        "anticlericalism",
        "motivated",
        "local",
        "political",
        "event",
        "despite",
        "admiration",
        "cádiz",
        "constitution",
        "mora",
        "criticized",
        "fact",
        "abolish",
        "special",
        "privilege",
        "enjoyed",
        "military",
        "church",
        "respect",
        "latter",
        "particular",
        "mora",
        "reacted",
        "church",
        "opposition",
        "establishment",
        "republican",
        "value",
        "came",
        "regard",
        "power",
        "capable",
        "destabilizing",
        "republic",
        "subvert",
        "law",
        "turn",
        "mass",
        "population",
        "mora",
        "regarded",
        "church",
        "esprit",
        "de",
        "corp",
        "opposed",
        "national",
        "spirit",
        "representative",
        "system",
        "insofar",
        "church",
        "sought",
        "maintain",
        "special",
        "privilege",
        "immunity",
        "contrary",
        "civil",
        "equality",
        "emphasized",
        "church",
        "refusal",
        "submit",
        "civil",
        "criminal",
        "law",
        "opposition",
        "freedom",
        "worship",
        "well",
        "freedom",
        "thought",
        "press",
        "view",
        "church",
        "opposed",
        "freedom",
        "exercise",
        "threatened",
        "former",
        "rule",
        "conscience",
        "vein",
        "mora",
        "regarded",
        "church",
        "obstacle",
        "public",
        "education",
        "insofar",
        "education",
        "instrumental",
        "mass",
        "emancipation",
        "priestly",
        "power",
        "mora",
        "also",
        "considered",
        "church",
        "obstacle",
        "colonization",
        "scarcely",
        "populated",
        "territory",
        "virtue",
        "opposition",
        "freedom",
        "worship",
        "even",
        "criticized",
        "clergy",
        "celibacy",
        "view",
        "isolates",
        "member",
        "society",
        "insofar",
        "family",
        "tie",
        "primary",
        "link",
        "bind",
        "men",
        "society",
        "mora",
        "mora",
        "advocated",
        "confiscation",
        "church",
        "property",
        "ground",
        "clergy",
        "productive",
        "class",
        "lacked",
        "inclination",
        "industrious",
        "work",
        "mexico",
        "church",
        "indeed",
        "wealthiest",
        "financial",
        "agent",
        "largest",
        "single",
        "proprietor",
        "nineteenth",
        "century",
        "property",
        "nationalized",
        "despite",
        "multifaceted",
        "condemnation",
        "church",
        "mora",
        "anticlericalism",
        "entail",
        "hostility",
        "religion",
        "held",
        "church",
        "free",
        "devote",
        "spiritual",
        "mission",
        "since",
        "religious",
        "belief",
        "principle",
        "conscience",
        "man",
        "sacred",
        "property",
        "considered",
        "individual",
        "mora",
        "concern",
        "argue",
        "separation",
        "religious",
        "political",
        "principles",
        "maintained",
        "church",
        "share",
        "exercise",
        "political",
        "power",
        "power",
        "coerce",
        "citizen",
        "either",
        "form",
        "forced",
        "economic",
        "contribution",
        "punishment",
        "solely",
        "spiritual",
        "warned",
        "religious",
        "principle",
        "degenerate",
        "kept",
        "separate",
        "political",
        "one",
        "contrast",
        "argentinian",
        "alberdi",
        "deal",
        "similarly",
        "powerful",
        "catholic",
        "church",
        "mora",
        "advocated",
        "strong",
        "reformist",
        "state",
        "capable",
        "curbing",
        "opposition",
        "liberal",
        "value",
        "established",
        "social",
        "power",
        "according",
        "mora",
        "reformist",
        "state",
        "create",
        "condition",
        "citizen",
        "freedom",
        "equality",
        "position",
        "contrary",
        "alberdi",
        "commitment",
        "laissez",
        "faire",
        "liberalism",
        "indeed",
        "country",
        "liberalism",
        "became",
        "dominant",
        "ideology",
        "late",
        "nineteenth",
        "century",
        "implemented",
        "secularizing",
        "reform",
        "law",
        "emancipated",
        "official",
        "institution",
        "control",
        "catholic",
        "church",
        "reform",
        "law",
        "created",
        "civil",
        "registry",
        "established",
        "civil",
        "matrimony",
        "case",
        "possibility",
        "divorce",
        "church",
        "property",
        "often",
        "confiscated",
        "convent",
        "monastery",
        "closed",
        "catholic",
        "church",
        "legal",
        "immunity",
        "abolished",
        "central",
        "among",
        "reform",
        "secularization",
        "official",
        "schooling",
        "became",
        "laicist",
        "process",
        "secularization",
        "along",
        "line",
        "suggested",
        "mora",
        "took",
        "place",
        "comparatively",
        "early",
        "mexico",
        "beginning",
        "after",
        "failed",
        "attempt",
        "colombia",
        "country",
        "process",
        "turned",
        "bitter",
        "violent",
        "since",
        "church",
        "powerful",
        "able",
        "oppose",
        "resistance",
        "laicist",
        "state",
        "consolidated",
        "mexico",
        "total",
        "defeat",
        "conservative",
        "proclerical",
        "adversary",
        "colombia",
        "secularizing",
        "reform",
        "almost",
        "fully",
        "reverted",
        "triumph",
        "proclerical",
        "conservative",
        "regeneración",
        "similar",
        "process",
        "secularization",
        "took",
        "place",
        "venezuela",
        "central",
        "american",
        "republic",
        "much",
        "le",
        "confrontational",
        "violent",
        "comparable",
        "change",
        "chile",
        "argentina",
        "uruguay",
        "later",
        "year",
        "ecuador",
        "bolivia",
        "perú",
        "religious",
        "freedom",
        "established",
        "process",
        "brazil",
        "rather",
        "different",
        "since",
        "monarchy",
        "maintained",
        "control",
        "church",
        "patronage",
        "system",
        "priest",
        "received",
        "state",
        "salary",
        "monarch",
        "appointed",
        "clerical",
        "authority",
        "among",
        "measure",
        "establishment",
        "republic",
        "late",
        "strongly",
        "influenced",
        "positivism",
        "brought",
        "full",
        "religious",
        "freedom",
        "separation",
        "church",
        "state",
        "exception",
        "colombia",
        "liberal",
        "force",
        "secularization",
        "period",
        "displacing",
        "catholic",
        "church",
        "traditional",
        "participation",
        "ruling",
        "society",
        "official",
        "political",
        "institution"
    ]
}