{
    "main_text": "\n\nLibertarianism is a family of views in political philosophy.\nLibertarians take individual freedom as the paramount political value\nand understand coercion to be the antithesis of that freedom. While\npeople can justifiably be forced to do certain things—most\nobviously, to refrain from infringing the liberty of others—they\ncannot be coerced to serve the good of other members of society, nor\neven their own personal good.\n\nWithin philosophical debates over justice, libertarian positions are\nmost controversial in the realm of distributive justice. In\nthis context, libertarians typically endorse something like a\nfree-market economy—an economic order based on private property\nrights, freedom of contract, and voluntary cooperation. Libertarians\nusually regard contemporary democratic states’ redistribution of\nwealth as an unjustified use of coercion that violates the rights of\nindividuals. The same is true of many forms of economic regulation.\nJust as people have strong rights to individual freedom in their\npersonal and social affairs, libertarians argue, they also have strong\nrights to freedom in their economic affairs. Thus, rights of freedom\nof contract and exchange, freedom of occupation, and private property\nare taken as seriously as rights to choose who to be friends with,\nwhat kind of clothes to wear, and which religion to follow, and so\nforth.\n\nIn respect to justice, libertarian theory inherits a political\nmorality from the classical (or proto-) liberal tradition, embodied by\nJohn Locke, David Hume, Adam Smith, and Immanuel Kant. These authors\nregard the moral function of the state to be the enforcement of a\nsystem of rights that facilitate socioeconomic cooperation, and little\nelse. Moreover, it inherits a political sociology from the\nradical—individualist anarchist—side of the liberal\ntradition associated with Benjamin Tucker, Thomas Hodgskin, and\nLysander Spooner. On their view, state action even when seemingly\nwell-intentioned, is largely an outcome of, or heavily conditioned by,\nthe dynamics of class. In its strongest form, this view takes\nthe state to be the vehicle by which a dominant class uses coercion to\nplunder the rest of society (an idea that was heavily drawn upon, and\naltered, by Karl Marx).\n\nThose engaged in marrying the contemporary libertarian approaches to\nrights and justice with radical critique of the class-state dynamics\nrefer to themselves as “left-libertarians1” to\ncontrast themselves with a libertarian mainstream or\n“right-libertarianism1” that they take to be\nmore comfortable with actually-existing economic inequality as it\nexists under most capitalist systems, taking it to be an approximation\nof that which would occur in a truly free market. This is to be\ndistinguished from another school of thought known as\n“left-libertarianism2” that occupies a position\nnarrowly within the contemporary debate over distributive justice.\nLeft-libertarianism2 endorse similar rights over the person\nbut differ with respect to how much people can appropriate in terms of\nunowned natural resources (land, air, water, minerals, etc.).\nRight-libertarianism2 holds that such resources may be\nappropriated, for example, by the first person who discovers them,\nmixes her labor with them, or merely claims them—regardless of\nthe pattern of distribution of property across society this might\ngenerate. Left-libertarianism2, by contrast, holds that\nunappropriated natural resources belong to everyone in some\negalitarian manner. It can, for example, require those who claim\nrights over natural resources to make a payment to others for the\nvalue of those rights. This can provide the basis for a kind of\negalitarian redistribution.\n\nIt is popular to label libertarianism as a “right-wing”\ndoctrine. But this is mistaken. For one, on social—rather than\neconomic—issues, libertarianism tends to be\n“left-wing” in advocating for radical social liberty in\nthe form of freedom of association, of cultural and religious\nexpression, and sexual liberation. On foreign policy it is also\naligned more with the left in opposing border restrictions and war.\nIts historical entanglement with both radicalism and reaction, as well\nas its approach to rights being used to endorse distributive\negalitarianism, means that it cannot be easily placed on a\ncontemporary left-right partisan spectrum. In a sense, the left-right\nspectrum is itself reiterated within libertarianism, given\nits internal diversity.\n\nLibertarianism is typically taken to be a variety of liberal political\ntheory, though some do contest this (Freeman 2001). The word\n“libertarian” was first used in the 18th\ncentury to refer to a metaphysical view regarding freedom of the will,\nand it was first used as a political term in 19th century\nFrance to refer to communist anarchists (for example, in the journal\nLe Libertaire: Journal du Mouvement Social, edited by Joseph\nDéjacque), and in the late 19th century it would be\nused by individualist anarchists (for example, in the journal\nLiberty, edited by Benjamin Tucker). In the\nmid-20th century, the label was adopted by liberals who\nwanted to resist certain political developments in many Western states\nfollowing World War 2. After the war, many of the worlds affluent\ndemocracies adopted greater amounts of state involvement in the\neconomy. The sexual revolution had generated significant support for\nsocial liberalism, but those who came to be known as\nclassical liberals and libertarians were concerned to safeguard\neconomic liberalism from a state engaging in more and more central\nplanning of the economy (see Hayek 1944). Whilst many who called\nthemselves liberals were in favour of the state taking a\nbigger role in the economy, those who opposed it called themselves\nclassical liberals or libertarians to\ndistance themselves from these former liberals, and perhaps to\nemphasize that they regarded their position as a purer form\nof liberalism.\n\nThe first and most important text that self-consciously defended\nclassical liberalism in this sense was F. A. Hayek’s three\nvolume work Law, Legislation, and Liberty, with the first\nvolume being published in 1973 just after the publication of John\nRawls’s defence of post-war, interventionist liberalism, A\nTheory of Justice (1971). Hayek is often referred to as a\nclassical liberal as opposed to a libertarian. The latter label is\noften associated particularly with the philosophical framework of\nnatural rights, whereas Hayek focusses on concepts of\npolitical economy and jurisprudence, with an implicitly\nrule-consequentialist normative overtone.\n\nNonetheless, libertarian political philosophy has a great deal to do\nwith Hayek in its concern with addressing an audience that it takes to\nalready be convinced of social liberalism, that economic liberalism\nlogically and normatively follows. Libertarianism, broadly speaking,\nis concerned with proving that just as freedom of association and\nexpression is the social and cultural order of a free people, so the\nfree market is the economic order of a free people.\n\nHayek was a leading figure of the Austrian School of\neconomics, within which Murray Rothbard, a generation younger than\nHayek, was also educated. Rothbard was the major voice of\nlibertarianism in the United States during and after his lifetime. He\nco-founded the libertarian think-tank The Cato Institute, the\nCentre for Libertarian Studies, and the Ludwig von Mises\nInstitute. He would also become a significant influence on Robert\nNozick when they met in New York City, who would then bring that very\nlibertarianism into academic philosophy.\n\nThe content of libertarian political philosophy, broadly speaking, is\na claim that the initiation of interpersonal force is unjust. This is\ncombined with an understanding of property rights as an essential\ncomponent of personal liberty, as well as an analysis of law, that\nrenders all state-made law on a moral par with any other threat of\nforce. On this basis, libertarians usually argue that almost all state\naction is unjust, and that state interventions in the economy are as\nmorally problematic as state interventions in our personal choices\nregarding our bodies and social lives.\n\nThere are a variety of moral foundations that libertarians draw upon\nfor their central normative claims. Within the discipline of\nphilosophy, libertarianism is most famously deontological (Rothbard\n1978, 1982, Nozick 1974, Mack 1981, 1989, 1990, 1998, 1999, 2010,\n2018, Steiner 1994), taking a cue from both John Locke and Immanuel\nKant. However, others are Aristotelian eudaimonists (Rasmussen and Den\nUyl 1991, 2005, 2016, 2020), contractualists of various kinds\n(Narveson 2011, Lomasky 1987, 2016, Gaus 2009, 2010, 2012), or\nrule-consequentialists (Epstein, 1995, 1998, 2015, Barnett 1998b).\nMany are implicitly rule-consequentialist, depending\nprimarily on economic arguments rather than moral philosophical ones\n(Friedman 1997, Pennington 2011, Tebble 2016). Note that whilst it is\nvery common for libertarians of all stripes to articulate their\npolitical philosophy in terms of rights, they will not all\nground those rights deontologically. For example, for Aristotelian\neudaimonists, rights are the metaethical framework that makes\nself-directed virtue possible in a social context; for\ncontractualists, sets of rights might be the output of a contractarian\nprocedure; for economists, rights might be an efficient legal\nframework, etc.\n",
    "section_title": "Preamble",
    "entry_title": "Libertarianism",
    "hierarchy_title": "Libertarianism || Preamble",
    "tokenized_text": [
        "libertarianism",
        "family",
        "view",
        "political",
        "philosophy",
        "libertarian",
        "take",
        "individual",
        "freedom",
        "paramount",
        "political",
        "value",
        "understand",
        "coercion",
        "antithesis",
        "freedom",
        "people",
        "justifiably",
        "forced",
        "certain",
        "thingsmost",
        "obviously",
        "refrain",
        "infringing",
        "liberty",
        "othersthey",
        "coerced",
        "serve",
        "good",
        "member",
        "society",
        "even",
        "personal",
        "good",
        "within",
        "philosophical",
        "debate",
        "justice",
        "libertarian",
        "position",
        "controversial",
        "realm",
        "distributive",
        "justice",
        "context",
        "libertarian",
        "typically",
        "endorse",
        "something",
        "like",
        "freemarket",
        "economyan",
        "economic",
        "order",
        "based",
        "private",
        "property",
        "right",
        "freedom",
        "contract",
        "voluntary",
        "cooperation",
        "libertarian",
        "usually",
        "regard",
        "contemporary",
        "democratic",
        "state",
        "redistribution",
        "wealth",
        "unjustified",
        "use",
        "coercion",
        "violates",
        "right",
        "individual",
        "true",
        "many",
        "form",
        "economic",
        "regulation",
        "people",
        "strong",
        "right",
        "individual",
        "freedom",
        "personal",
        "social",
        "affair",
        "libertarian",
        "argue",
        "also",
        "strong",
        "right",
        "freedom",
        "economic",
        "affair",
        "thus",
        "right",
        "freedom",
        "contract",
        "exchange",
        "freedom",
        "occupation",
        "private",
        "property",
        "taken",
        "seriously",
        "right",
        "choose",
        "friend",
        "kind",
        "clothes",
        "wear",
        "religion",
        "follow",
        "forth",
        "respect",
        "justice",
        "libertarian",
        "theory",
        "inherits",
        "political",
        "morality",
        "classical",
        "proto",
        "liberal",
        "tradition",
        "embodied",
        "john",
        "locke",
        "david",
        "hume",
        "adam",
        "smith",
        "immanuel",
        "kant",
        "author",
        "regard",
        "moral",
        "function",
        "state",
        "enforcement",
        "system",
        "right",
        "facilitate",
        "socioeconomic",
        "cooperation",
        "little",
        "else",
        "moreover",
        "inherits",
        "political",
        "sociology",
        "radicalindividualist",
        "anarchistside",
        "liberal",
        "tradition",
        "associated",
        "benjamin",
        "tucker",
        "thomas",
        "hodgskin",
        "lysander",
        "spooner",
        "view",
        "state",
        "action",
        "even",
        "seemingly",
        "wellintentioned",
        "largely",
        "outcome",
        "heavily",
        "conditioned",
        "dynamic",
        "class",
        "strongest",
        "form",
        "view",
        "take",
        "state",
        "vehicle",
        "dominant",
        "class",
        "us",
        "coercion",
        "plunder",
        "rest",
        "society",
        "idea",
        "heavily",
        "drawn",
        "upon",
        "altered",
        "karl",
        "marx",
        "engaged",
        "marrying",
        "contemporary",
        "libertarian",
        "approach",
        "right",
        "justice",
        "radical",
        "critique",
        "classstate",
        "dynamic",
        "refer",
        "leftlibertarians",
        "contrast",
        "libertarian",
        "mainstream",
        "rightlibertarianism",
        "take",
        "comfortable",
        "actuallyexisting",
        "economic",
        "inequality",
        "exists",
        "capitalist",
        "system",
        "taking",
        "approximation",
        "would",
        "occur",
        "truly",
        "free",
        "market",
        "distinguished",
        "another",
        "school",
        "thought",
        "known",
        "leftlibertarianism",
        "occupies",
        "position",
        "narrowly",
        "within",
        "contemporary",
        "debate",
        "distributive",
        "justice",
        "leftlibertarianism",
        "endorse",
        "similar",
        "right",
        "person",
        "differ",
        "respect",
        "much",
        "people",
        "appropriate",
        "term",
        "unowned",
        "natural",
        "resource",
        "land",
        "air",
        "water",
        "mineral",
        "etc",
        "rightlibertarianism",
        "hold",
        "resource",
        "may",
        "appropriated",
        "example",
        "first",
        "person",
        "discovers",
        "mix",
        "labor",
        "merely",
        "claim",
        "themregardless",
        "pattern",
        "distribution",
        "property",
        "across",
        "society",
        "might",
        "generate",
        "leftlibertarianism",
        "contrast",
        "hold",
        "unappropriated",
        "natural",
        "resource",
        "belong",
        "everyone",
        "egalitarian",
        "manner",
        "example",
        "require",
        "claim",
        "right",
        "natural",
        "resource",
        "make",
        "payment",
        "others",
        "value",
        "right",
        "provide",
        "basis",
        "kind",
        "egalitarian",
        "redistribution",
        "popular",
        "label",
        "libertarianism",
        "rightwing",
        "doctrine",
        "mistaken",
        "one",
        "socialrather",
        "economicissues",
        "libertarianism",
        "tends",
        "leftwing",
        "advocating",
        "radical",
        "social",
        "liberty",
        "form",
        "freedom",
        "association",
        "cultural",
        "religious",
        "expression",
        "sexual",
        "liberation",
        "foreign",
        "policy",
        "also",
        "aligned",
        "left",
        "opposing",
        "border",
        "restriction",
        "war",
        "historical",
        "entanglement",
        "radicalism",
        "reaction",
        "well",
        "approach",
        "right",
        "used",
        "endorse",
        "distributive",
        "egalitarianism",
        "mean",
        "easily",
        "placed",
        "contemporary",
        "leftright",
        "partisan",
        "spectrum",
        "sense",
        "leftright",
        "spectrum",
        "reiterated",
        "within",
        "libertarianism",
        "given",
        "internal",
        "diversity",
        "libertarianism",
        "typically",
        "taken",
        "variety",
        "liberal",
        "political",
        "theory",
        "though",
        "contest",
        "freeman",
        "word",
        "libertarian",
        "first",
        "used",
        "th",
        "century",
        "refer",
        "metaphysical",
        "view",
        "regarding",
        "freedom",
        "first",
        "used",
        "political",
        "term",
        "th",
        "century",
        "france",
        "refer",
        "communist",
        "anarchist",
        "example",
        "journal",
        "le",
        "libertaire",
        "journal",
        "du",
        "mouvement",
        "social",
        "edited",
        "joseph",
        "déjacque",
        "late",
        "th",
        "century",
        "would",
        "used",
        "individualist",
        "anarchist",
        "example",
        "journal",
        "liberty",
        "edited",
        "benjamin",
        "tucker",
        "midth",
        "century",
        "label",
        "adopted",
        "liberal",
        "wanted",
        "resist",
        "certain",
        "political",
        "development",
        "many",
        "western",
        "state",
        "following",
        "world",
        "war",
        "war",
        "many",
        "world",
        "affluent",
        "democracy",
        "adopted",
        "greater",
        "amount",
        "state",
        "involvement",
        "economy",
        "sexual",
        "revolution",
        "generated",
        "significant",
        "support",
        "social",
        "liberalism",
        "came",
        "known",
        "classical",
        "liberal",
        "libertarian",
        "concerned",
        "safeguard",
        "economic",
        "liberalism",
        "state",
        "engaging",
        "central",
        "planning",
        "economy",
        "see",
        "hayek",
        "whilst",
        "many",
        "called",
        "liberal",
        "favour",
        "state",
        "taking",
        "bigger",
        "role",
        "economy",
        "opposed",
        "called",
        "classical",
        "liberal",
        "libertarian",
        "distance",
        "former",
        "liberal",
        "perhaps",
        "emphasize",
        "regarded",
        "position",
        "purer",
        "form",
        "liberalism",
        "first",
        "important",
        "text",
        "selfconsciously",
        "defended",
        "classical",
        "liberalism",
        "sense",
        "f",
        "a",
        "hayek",
        "three",
        "volume",
        "work",
        "law",
        "legislation",
        "liberty",
        "first",
        "volume",
        "published",
        "publication",
        "john",
        "rawls",
        "defence",
        "postwar",
        "interventionist",
        "liberalism",
        "theory",
        "justice",
        "hayek",
        "often",
        "referred",
        "classical",
        "liberal",
        "opposed",
        "libertarian",
        "latter",
        "label",
        "often",
        "associated",
        "particularly",
        "philosophical",
        "framework",
        "natural",
        "right",
        "whereas",
        "hayek",
        "focus",
        "concept",
        "political",
        "economy",
        "jurisprudence",
        "implicitly",
        "ruleconsequentialist",
        "normative",
        "overtone",
        "nonetheless",
        "libertarian",
        "political",
        "philosophy",
        "great",
        "deal",
        "hayek",
        "concern",
        "addressing",
        "audience",
        "take",
        "already",
        "convinced",
        "social",
        "liberalism",
        "economic",
        "liberalism",
        "logically",
        "normatively",
        "follows",
        "libertarianism",
        "broadly",
        "speaking",
        "concerned",
        "proving",
        "freedom",
        "association",
        "expression",
        "social",
        "cultural",
        "order",
        "free",
        "people",
        "free",
        "market",
        "economic",
        "order",
        "free",
        "people",
        "hayek",
        "leading",
        "figure",
        "austrian",
        "school",
        "economics",
        "within",
        "murray",
        "rothbard",
        "generation",
        "younger",
        "hayek",
        "also",
        "educated",
        "rothbard",
        "major",
        "voice",
        "libertarianism",
        "united",
        "state",
        "lifetime",
        "cofounded",
        "libertarian",
        "thinktank",
        "cato",
        "institute",
        "centre",
        "libertarian",
        "study",
        "ludwig",
        "von",
        "mi",
        "institute",
        "would",
        "also",
        "become",
        "significant",
        "influence",
        "robert",
        "nozick",
        "met",
        "new",
        "york",
        "city",
        "would",
        "bring",
        "libertarianism",
        "academic",
        "philosophy",
        "content",
        "libertarian",
        "political",
        "philosophy",
        "broadly",
        "speaking",
        "claim",
        "initiation",
        "interpersonal",
        "force",
        "unjust",
        "combined",
        "understanding",
        "property",
        "right",
        "essential",
        "component",
        "personal",
        "liberty",
        "well",
        "analysis",
        "law",
        "render",
        "statemade",
        "law",
        "moral",
        "par",
        "threat",
        "force",
        "basis",
        "libertarian",
        "usually",
        "argue",
        "almost",
        "state",
        "action",
        "unjust",
        "state",
        "intervention",
        "economy",
        "morally",
        "problematic",
        "state",
        "intervention",
        "personal",
        "choice",
        "regarding",
        "body",
        "social",
        "life",
        "variety",
        "moral",
        "foundation",
        "libertarian",
        "draw",
        "upon",
        "central",
        "normative",
        "claim",
        "within",
        "discipline",
        "philosophy",
        "libertarianism",
        "famously",
        "deontological",
        "rothbard",
        "nozick",
        "mack",
        "steiner",
        "taking",
        "cue",
        "john",
        "locke",
        "immanuel",
        "kant",
        "however",
        "others",
        "aristotelian",
        "eudaimonists",
        "rasmussen",
        "den",
        "uyl",
        "contractualists",
        "various",
        "kind",
        "narveson",
        "lomasky",
        "gaus",
        "ruleconsequentialists",
        "epstein",
        "barnett",
        "b",
        "many",
        "implicitly",
        "ruleconsequentialist",
        "depending",
        "primarily",
        "economic",
        "argument",
        "rather",
        "moral",
        "philosophical",
        "one",
        "friedman",
        "pennington",
        "tebble",
        "note",
        "whilst",
        "common",
        "libertarian",
        "stripe",
        "articulate",
        "political",
        "philosophy",
        "term",
        "right",
        "ground",
        "right",
        "deontologically",
        "example",
        "aristotelian",
        "eudaimonists",
        "right",
        "metaethical",
        "framework",
        "make",
        "selfdirected",
        "virtue",
        "possible",
        "social",
        "context",
        "contractualists",
        "set",
        "right",
        "might",
        "output",
        "contractarian",
        "procedure",
        "economist",
        "right",
        "might",
        "efficient",
        "legal",
        "framework",
        "etc"
    ]
}