{
    "main_text": "The Influence of Positivism\n8. The Decline of Liberalism, its alleged failure, and contemporary conceptual debates\n\nAfter having been the triumphant ideology of nation building in most\nof Latin America in the late nineteenth century and early twentieth,\nliberalism entered a phase of decline. In most of the region the\nliberal political and economic order was made unstable by social\nmovements that contested the oligarchical nature of the regimes and\npressed for both democratization and the inclusion of the masses in\nthe benefits of economic growth. For reasons having to do with each\nparticular national context, critics objected that the sought after\ntransformation of Latin American societies in light of liberal ideas\nand values had been a failure. Where the liberal order had led to\nauthoritarian regimes, as in Venezuela and Mexico, critics maintained\nthat liberalism had proved inadequate for these societies. In Mexico,\nthis skepticism emerged from within the liberal establishment itself\n(Rabasa 1912). In Venezuela, the positivist sociologist Laureano\nVallenilla famously argued that authoritarian forms of governance were\nmore suitable for Hispanic American societies (Vallenilla 1919). In\nChile, the liberal parliamentarian regime that had successfully\nlimited executive power in the 1870’s and 80’s was\ngradually eroded and finally displaced by a new presidentialism in the\n1920’s. Chilean liberal parliamentarism proved unable to manage\nsocial unrest and criticism (Correa Sutil 2004 & 2008). There\nbegan a new conservative narrative that glorified the authoritarian\nregimes of the 1830’s and served to legitimize authoritarian\nrule (Edwards 1928). In Argentina, the liberal oligarchical regime was\ndisplaced in elections in which universal male suffrage was mandatory\nfor the first time. The Brazilian republic, which had been established\nthrough a military coup, was in turn overthrown by another military\ncoup and replaced with a dictatorship in the 1930s. By midcentury,\ncorporativisms of various sorts as well as socialist,\nMarxist, indigenous, agrarian, and populist political movements and\nideologies had become dominant and displaced liberalism in the\nregion.\n\nThe idea view that liberal reformers had failed because liberal ideas\nwere “imported” and not adequate for Latin American\nsocieties has not ceased to occupy interpreters ever since (a\ndiscussion is in Hale 1984). A notable exception to this dominant view\nis the reconstruction, by an official ideologue, of Mexican liberalism\nas the official and triumphant ideology of the political regimes\nemanated from the 1910 revolution (Reyes Heroles 1957). However, there\nis currently a growing tendency to abandon the “failure”\nview of liberalism and to focus on the reconstruction of what\nnineteenth century liberals aimed and accomplished, as a recent\ncollection of essays shows (Jaksic and Posada Carbó 2011b).\nScholars have engaged in conceptual debates regarding the adequate\nframework for a more sympathetic and accurate reconstruction of\nintellectual political history. The starting point has been the\ncriticism of the “traditional history of ideas” that\nallegedly presumed political ideas to have a definite content subject\nto little, if any, historical change (Detailed discussions are in\nPalti 2005 & 2007, Linares Londoño 2021). On this\n“traditional” view, which is usually attributed to\nintellectual historian Leopoldo Zea, liberalism was some sort of\npolitical “model” originated in Europe and Anglo North\nAmerica that was transplanted and adapted to Latin American societies,\nwhich were, the view goes, unsuitable (Escalante 1992, Montalvo Ortega\n1995). Whatever resulted in this “adaptation”, this\ntraditional view continues, was a “deviation” from the\noriginal model. As a commentator puts it in a recent work when\npresenting this view: “the importance of studying Latin American\nideas does not lie in their contribution to western thought but in the\n‘mistakes’ that the former contain in relation to the\nlatter, that is, in the refractions or deviations that Latin American\nnational circumstances impressed on the original ideas” (Linares\nLondoño 2021: 47). The traditional history of ideas, thus\nunderstood, would make at least three mistaken assumptions: First,\nthat the meaning of liberalism can be established conceptually, apart\nfrom the historically changing conditions in which the notion has been\ndeployed; second, that liberal Latin American political actors sought\nto “apply” this already complete model of liberalism to\ntheir own societies; and third, that to understand Latin American\nliberalism is primarily to trace its intellectual sources or\n“influences” in European and Anglo North American liberal\nauthors and political movements.\n\nScholars who have sought to distance themselves from the traditional\nhistory of ideas thus understood have been motivated by various\ntheoretical concerns. Some political theorists have attempted to\nshow that Latin American liberals were not mere\n“imitators” engaged in the application of foreign models\nbut also did produce “original” ideas that are relevant to\n“western thought” (Aguilar 2000 & 2010). Intellectual\nhistorians, on the other hand, have been motivated to avoid\nanachronisms that inevitable arise when current definitions are\nassumed in the reconstruction of past political thought and movements\n(Palti 2005 & 2007). They have also been reluctant to impose\npreconceived theoretical dichotomies in carrying out this\nreconstruction, such as tradition/modernity and\norganicism/individualism, and to avoid teleological approaches that\nregard history as pointing towards the triumph of liberalism. Instead,\nintellectual historians have attempted to offer sympathetic\nreconstructions that seek to capture what intellectuals and political\nactors meant (explicitly or implicitly) when they advocated or\ncriticized liberal ideas and institutions. There has been a growing\ninterest to seek to understand what nineteenth century liberal\npolitical actors and intellectuals meant when they affirmed a liberal\nview or other in the particular circumstances in which they did so.\nSome authors have purported to engage in professional history\ndistancing themselves from national ideologies and political\nmythologies (Hale 1968 & 1989). Others have engaged in\nconstitutional history for the sake of comparative analysis\n(Gargarella 2010 & 2013). Intellectual historians have engaged in\ndebates regarding what should be the subject matter in this\nreconstruction, whether the uses of the term “liberal”,\nthe concept of “liberalism” regardless of the terminology\nthat political actors and movements in fact employed (Fernández\nSebastián 2009), or the political languages in which they\narticulated their own views (Palti 2007 & 2007).\n\nThese multiple approaches have called into question the historical\nstability of what we mean by “liberalism” and have raised\nthe issue whether anything that political actors and intellectuals\ncalled “liberal” can rightfully be considered as such for\nscholarly purposes. Some have resisted this conclusion and insisted on\nthe need for a prior definition of liberalism in order to properly\nidentify the subject matter of reconstruction (Aguilar 2000 &\n2010, Gargarella 2010 & 2013). On approaches of this sort,\ndefinitions of “liberalism” are taken from twentieth or\ntwenty-first century authors and applied retrospectively to discern\nwhat can rightfully be considered “liberal” and what not\nin nineteenth century Latin America. From this perspective, whatever\ndoes not fit the preferred definitions readily falls out of view, such\nas liberal social and economic reformism. Unsurprisingly, the failure\nview has to a great extent been nurtured by this kind of approach\n(Escalante 1992). In general, historians have been more willing than\npolitical theorists and philosophers to take as bona fide\n“liberal” positions whatever political actors and\nintellectuals claimed to be so. Some historians have assumed rather\nwide understandings of liberalism (Collier 2003), and have called to\nfree the discipline from the grip of the failure view (Hale 1989).\n\nThe late twentieth and early twenty-first centuries have seen a modest\nrevival of a liberal political discourse that is partly due to the\ndecline of socialist and Marxist political movements and ideologies.\nTwo salient instances of this revival in political discourse are the\nrecognition of the pluralism of forms of life and the demands for\nprotection of the rights of minorities. In the sphere of academia,\nmany scholars have enthusiastically welcomed the influence of\nAnglo-American contemporary liberalism. The works by John Rawls,\nRonald Dworkin, Joseph Raz, and many others have received much\nattention and have been amply discussed in academic publications. It\nis interesting to notice, however, that there is a sharp separation\nbetween the reconstruction of nineteenth century Latin American\nliberalism, which largely continues to be the province of historians,\non the one hand, and systematic reflection on liberal ideas and values\nby professional philosophers and political theorists, on the other.\nLittle effort has been made to relate current work on liberal ideas\nand values inspired by Anglo-American authors to the nineteenth\ncentury Latin American tradition.\n",
    "section_title": "8. The Decline of Liberalism",
    "entry_title": "Liberalism in Latin America",
    "hierarchy_title": "Liberalism in Latin America || The Influence of Positivism",
    "tokenized_text": [
        "influence",
        "positivism",
        "decline",
        "liberalism",
        "alleged",
        "failure",
        "contemporary",
        "conceptual",
        "debate",
        "triumphant",
        "ideology",
        "nation",
        "building",
        "latin",
        "america",
        "late",
        "nineteenth",
        "century",
        "early",
        "twentieth",
        "liberalism",
        "entered",
        "phase",
        "decline",
        "region",
        "liberal",
        "political",
        "economic",
        "order",
        "made",
        "unstable",
        "social",
        "movement",
        "contested",
        "oligarchical",
        "nature",
        "regime",
        "pressed",
        "democratization",
        "inclusion",
        "mass",
        "benefit",
        "economic",
        "growth",
        "reason",
        "particular",
        "national",
        "context",
        "critic",
        "objected",
        "sought",
        "transformation",
        "latin",
        "american",
        "society",
        "light",
        "liberal",
        "idea",
        "value",
        "failure",
        "liberal",
        "order",
        "led",
        "authoritarian",
        "regime",
        "venezuela",
        "mexico",
        "critic",
        "maintained",
        "liberalism",
        "proved",
        "inadequate",
        "society",
        "mexico",
        "skepticism",
        "emerged",
        "within",
        "liberal",
        "establishment",
        "rabasa",
        "venezuela",
        "positivist",
        "sociologist",
        "laureano",
        "vallenilla",
        "famously",
        "argued",
        "authoritarian",
        "form",
        "governance",
        "suitable",
        "hispanic",
        "american",
        "society",
        "vallenilla",
        "chile",
        "liberal",
        "parliamentarian",
        "regime",
        "successfully",
        "limited",
        "executive",
        "power",
        "gradually",
        "eroded",
        "finally",
        "displaced",
        "new",
        "presidentialism",
        "chilean",
        "liberal",
        "parliamentarism",
        "proved",
        "unable",
        "manage",
        "social",
        "unrest",
        "criticism",
        "correa",
        "sutil",
        "began",
        "new",
        "conservative",
        "narrative",
        "glorified",
        "authoritarian",
        "regime",
        "served",
        "legitimize",
        "authoritarian",
        "rule",
        "edward",
        "argentina",
        "liberal",
        "oligarchical",
        "regime",
        "displaced",
        "election",
        "universal",
        "male",
        "suffrage",
        "mandatory",
        "first",
        "time",
        "brazilian",
        "republic",
        "established",
        "military",
        "coup",
        "turn",
        "overthrown",
        "another",
        "military",
        "coup",
        "replaced",
        "dictatorship",
        "s",
        "midcentury",
        "corporativisms",
        "various",
        "sort",
        "well",
        "socialist",
        "marxist",
        "indigenous",
        "agrarian",
        "populist",
        "political",
        "movement",
        "ideology",
        "become",
        "dominant",
        "displaced",
        "liberalism",
        "region",
        "idea",
        "view",
        "liberal",
        "reformer",
        "failed",
        "liberal",
        "idea",
        "imported",
        "adequate",
        "latin",
        "american",
        "society",
        "ceased",
        "occupy",
        "interpreter",
        "ever",
        "since",
        "discussion",
        "hale",
        "notable",
        "exception",
        "dominant",
        "view",
        "reconstruction",
        "official",
        "ideologue",
        "mexican",
        "liberalism",
        "official",
        "triumphant",
        "ideology",
        "political",
        "regime",
        "emanated",
        "revolution",
        "reyes",
        "heroles",
        "however",
        "currently",
        "growing",
        "tendency",
        "abandon",
        "failure",
        "view",
        "liberalism",
        "focus",
        "reconstruction",
        "nineteenth",
        "century",
        "liberal",
        "aimed",
        "accomplished",
        "recent",
        "collection",
        "essay",
        "show",
        "jaksic",
        "posada",
        "carbó",
        "b",
        "scholar",
        "engaged",
        "conceptual",
        "debate",
        "regarding",
        "adequate",
        "framework",
        "sympathetic",
        "accurate",
        "reconstruction",
        "intellectual",
        "political",
        "history",
        "starting",
        "point",
        "criticism",
        "traditional",
        "history",
        "idea",
        "allegedly",
        "presumed",
        "political",
        "idea",
        "definite",
        "content",
        "subject",
        "little",
        "historical",
        "change",
        "detailed",
        "discussion",
        "palti",
        "linares",
        "londoño",
        "traditional",
        "view",
        "usually",
        "attributed",
        "intellectual",
        "historian",
        "leopoldo",
        "zea",
        "liberalism",
        "sort",
        "political",
        "model",
        "originated",
        "europe",
        "anglo",
        "north",
        "america",
        "transplanted",
        "adapted",
        "latin",
        "american",
        "society",
        "view",
        "go",
        "unsuitable",
        "escalante",
        "montalvo",
        "ortega",
        "whatever",
        "resulted",
        "adaptation",
        "traditional",
        "view",
        "continues",
        "deviation",
        "original",
        "model",
        "commentator",
        "put",
        "recent",
        "work",
        "presenting",
        "view",
        "importance",
        "studying",
        "latin",
        "american",
        "idea",
        "lie",
        "contribution",
        "western",
        "thought",
        "mistake",
        "former",
        "contain",
        "relation",
        "latter",
        "refraction",
        "deviation",
        "latin",
        "american",
        "national",
        "circumstance",
        "impressed",
        "original",
        "idea",
        "linares",
        "londoño",
        "traditional",
        "history",
        "idea",
        "thus",
        "understood",
        "would",
        "make",
        "least",
        "three",
        "mistaken",
        "assumption",
        "first",
        "meaning",
        "liberalism",
        "established",
        "conceptually",
        "apart",
        "historically",
        "changing",
        "condition",
        "notion",
        "deployed",
        "second",
        "liberal",
        "latin",
        "american",
        "political",
        "actor",
        "sought",
        "apply",
        "already",
        "complete",
        "model",
        "liberalism",
        "society",
        "third",
        "understand",
        "latin",
        "american",
        "liberalism",
        "primarily",
        "trace",
        "intellectual",
        "source",
        "influence",
        "european",
        "anglo",
        "north",
        "american",
        "liberal",
        "author",
        "political",
        "movement",
        "scholar",
        "sought",
        "distance",
        "traditional",
        "history",
        "idea",
        "thus",
        "understood",
        "motivated",
        "various",
        "theoretical",
        "concern",
        "political",
        "theorist",
        "attempted",
        "show",
        "latin",
        "american",
        "liberal",
        "mere",
        "imitator",
        "engaged",
        "application",
        "foreign",
        "model",
        "also",
        "produce",
        "original",
        "idea",
        "relevant",
        "western",
        "thought",
        "aguilar",
        "intellectual",
        "historian",
        "hand",
        "motivated",
        "avoid",
        "anachronism",
        "inevitable",
        "arise",
        "current",
        "definition",
        "assumed",
        "reconstruction",
        "past",
        "political",
        "thought",
        "movement",
        "palti",
        "also",
        "reluctant",
        "impose",
        "preconceived",
        "theoretical",
        "dichotomy",
        "carrying",
        "reconstruction",
        "traditionmodernity",
        "organicismindividualism",
        "avoid",
        "teleological",
        "approach",
        "regard",
        "history",
        "pointing",
        "towards",
        "triumph",
        "liberalism",
        "instead",
        "intellectual",
        "historian",
        "attempted",
        "offer",
        "sympathetic",
        "reconstruction",
        "seek",
        "capture",
        "intellectual",
        "political",
        "actor",
        "meant",
        "explicitly",
        "implicitly",
        "advocated",
        "criticized",
        "liberal",
        "idea",
        "institution",
        "growing",
        "interest",
        "seek",
        "understand",
        "nineteenth",
        "century",
        "liberal",
        "political",
        "actor",
        "intellectual",
        "meant",
        "affirmed",
        "liberal",
        "view",
        "particular",
        "circumstance",
        "author",
        "purported",
        "engage",
        "professional",
        "history",
        "distancing",
        "national",
        "ideology",
        "political",
        "mythology",
        "hale",
        "others",
        "engaged",
        "constitutional",
        "history",
        "sake",
        "comparative",
        "analysis",
        "gargarella",
        "intellectual",
        "historian",
        "engaged",
        "debate",
        "regarding",
        "subject",
        "matter",
        "reconstruction",
        "whether",
        "us",
        "term",
        "liberal",
        "concept",
        "liberalism",
        "regardless",
        "terminology",
        "political",
        "actor",
        "movement",
        "fact",
        "employed",
        "fernández",
        "sebastián",
        "political",
        "language",
        "articulated",
        "view",
        "palti",
        "multiple",
        "approach",
        "called",
        "question",
        "historical",
        "stability",
        "mean",
        "liberalism",
        "raised",
        "issue",
        "whether",
        "anything",
        "political",
        "actor",
        "intellectual",
        "called",
        "liberal",
        "rightfully",
        "considered",
        "scholarly",
        "purpose",
        "resisted",
        "conclusion",
        "insisted",
        "need",
        "prior",
        "definition",
        "liberalism",
        "order",
        "properly",
        "identify",
        "subject",
        "matter",
        "reconstruction",
        "aguilar",
        "gargarella",
        "approach",
        "sort",
        "definition",
        "liberalism",
        "taken",
        "twentieth",
        "twentyfirst",
        "century",
        "author",
        "applied",
        "retrospectively",
        "discern",
        "rightfully",
        "considered",
        "liberal",
        "nineteenth",
        "century",
        "latin",
        "america",
        "perspective",
        "whatever",
        "fit",
        "preferred",
        "definition",
        "readily",
        "fall",
        "view",
        "liberal",
        "social",
        "economic",
        "reformism",
        "unsurprisingly",
        "failure",
        "view",
        "great",
        "extent",
        "nurtured",
        "kind",
        "approach",
        "escalante",
        "general",
        "historian",
        "willing",
        "political",
        "theorist",
        "philosopher",
        "take",
        "bona",
        "fide",
        "liberal",
        "position",
        "whatever",
        "political",
        "actor",
        "intellectual",
        "claimed",
        "historian",
        "assumed",
        "rather",
        "wide",
        "understanding",
        "liberalism",
        "collier",
        "called",
        "free",
        "discipline",
        "grip",
        "failure",
        "view",
        "hale",
        "late",
        "twentieth",
        "early",
        "twentyfirst",
        "century",
        "seen",
        "modest",
        "revival",
        "liberal",
        "political",
        "discourse",
        "partly",
        "due",
        "decline",
        "socialist",
        "marxist",
        "political",
        "movement",
        "ideology",
        "two",
        "salient",
        "instance",
        "revival",
        "political",
        "discourse",
        "recognition",
        "pluralism",
        "form",
        "life",
        "demand",
        "protection",
        "right",
        "minority",
        "sphere",
        "academia",
        "many",
        "scholar",
        "enthusiastically",
        "welcomed",
        "influence",
        "angloamerican",
        "contemporary",
        "liberalism",
        "work",
        "john",
        "rawls",
        "ronald",
        "dworkin",
        "joseph",
        "raz",
        "many",
        "others",
        "received",
        "much",
        "attention",
        "amply",
        "discussed",
        "academic",
        "publication",
        "interesting",
        "notice",
        "however",
        "sharp",
        "separation",
        "reconstruction",
        "nineteenth",
        "century",
        "latin",
        "american",
        "liberalism",
        "largely",
        "continues",
        "province",
        "historian",
        "one",
        "hand",
        "systematic",
        "reflection",
        "liberal",
        "idea",
        "value",
        "professional",
        "philosopher",
        "political",
        "theorist",
        "little",
        "effort",
        "made",
        "relate",
        "current",
        "work",
        "liberal",
        "idea",
        "value",
        "inspired",
        "angloamerican",
        "author",
        "nineteenth",
        "century",
        "latin",
        "american",
        "tradition"
    ]
}