{
    "main_text": "Linguistic Methodology and Data || What informal methods actually are\n3.5 What informal methods actually are\n\nInformal methods of acceptability judgment data have often been\ndescribed as excessively casual. Ferreira described the informal\nmethod this way:\n\nAn example sentence that is predicted to be ungrammatical is\ncontrasted with some other sentence that is supposed to be similar in\nall relevant ways; these two sentences constitute a “minimal\npair”. The author of the article provides the judgment that the\nsentence hypothesized to be bad is in fact ungrammatical, as indicated\nby the star annotating the example. But there are serious problems\nwith this methodology. The example that is tested could have\nidiosyncratic properties due to its unique lexical content.\nOccasionally a second or third minimal pair is provided, but no\nattempt is made to consider the range of relevant extraneous variables\nthat must be accounted for and held constant to make sure there\nisn’t some correlated property that is responsible for the\ncontrast in judgments. Even worse, the “subject” who\nprovides the data is not a naïve informant, but is in fact the\ntheorist himself or herself, and that person has a stake in whether\nthe sentence is judged grammatical or ungrammatical. That is, the\nperson’s theory would be falsified if the prediction were wrong,\nand this is a potential source of bias. (Ferreira 2005: 372)\n\n\n(It would be appropriate to read ‘grammatical’ and\n‘grammaticality’ in Ferreira’s text as meaning\n‘acceptable’ and ‘acceptability’.)\n\nThis critical characterization exemplifies the kind of method that\nSchütze and Cowart aimed to improve on. More recently, Gibson and\nFedorenko describe the traditional informal method this way:\n\nAs has often been noted in recent years (Cowart, 1997; Edelman &\nChristiansen, 2003; Featherston, 2007; Ferreira, 2005; Gibson &\nFedorenko, 2010a; Marantz, 2005; Myers, 2009; Schütze, 1996;\nWasow & Arnold, 2005), the results obtained using this method are\nnot necessarily generalisable because of (a) the small number of\nexperimental participants (typically one); (b) the small number of\nexperimental stimuli (typically one); (c) cognitive biases on the part\nof the researcher and participants; and (d) the effect of the\npreceding context (e.g., other constructions the researcher may have\nbeen recently considering). (Gibson and Fedorenko, 2013)\n\n\nWhile some Essentialists have acknowledged these problems with the\nreliability of informal methods, others have, in effect, denied their\nrelevance. For example, Colin Phillips (2010) argues that “there\nis little evidence for the frequent claim that sloppy data-collection\npractices have harmed the development of linguistic theories”.\nHe admits that not all is epistemologically well in syntactic theory,\nbut adds, “I just don’t think that the problems will be\nsolved by a few rating surveys.” He concludes:\n\nI do not think that we should be fooled into thinking that informal\njudgment gathering is the root of the problem or that more formalized\njudgment collection will solve the problems. (Phillips 2010: 61)\n\n\nTo suggest that informal methods are as fully reliable as controlled\nexperimental ones would be a serious charge, implying that researchers\nlike Bard, Robinson, Sorace, Cowart, Schütze, Gibson, Fedorenko,\nand others have been wasting their time. But Phillips actually seems\nto be making a different claim. He suggests first that informally\ngathered data has not actually harmed linguistics, and second that\nlinguists are in danger of being “fooled” by critics who\ninvent stories about unreliable data having harmed linguistics.\n\nThe harm that Phillips claims has not occurred relates to the charge\nthat “mainstream linguistics” (he means the current\ngenerative Essentialist framework called ‘Minimalism’) is\n“irrelevant” to broader interests in the cognitive\nsciences, and has lost “the initiative in language study”.\nOf course, Phillips is right in a sense: one cannot insure that\nexperimental judgment collection methods will address every way in\nwhich Minimalist theorizing is irrelevant to particular endeavors\n(language description, language teaching, natural language processing,\nor broader questions in cognitive psychological research). But this\nclaim does not bear on what Schütze (1996) and Cowart (1997) show\nabout the unreliability of informal methods.\n\nPhillips does not fully accept the view of Chomsky (1969) that\nexperimental methods are useless for data gathering (he says, “I\ndo not mean to argue that comprehensive data gathering studies of\nacceptability are worthless”). But his defense of informal\nmethods of data collection rests on whether these methods have damaged\nEssentialist theory testing:\n\n\nThe critiques I have read present no evidence of the supposed damage\nthat informal intuitions have caused, and among those who do provide\nspecific examples it is rare to provide clear evidence of the supposed\ndamage that informal intuitions have caused…\n\nWhat I am specifically questioning is whether informal (and\noccasionally careless) gathering of acceptability judgments has\nactually held back progress in linguistics, and whether more careful\ngathering of acceptability judgments will provide the key to future\nprogress.\n\n\nEither Phillips is fronting the surprising opinion that generative\ntheorizing has never been led down the wrong track by demonstrably\nunreliable data, or he is changing the subject. And unless clear\ncriteria are established for what counts as “damage” and\n“holding back,” Phillips is not offering any testable\nhypothesis about data collection methodology. For example, Phillips\ndiscounts the observation of Schütze (1996) that conflicting\njudgments of relative unacceptability of violations of two linguistic\nuniversals held back the development of Government and Binding (GB),\non the grounds that two sets of conflicting judgments and their\nanalyses “are now largely forgotten, supplanted by theories that\nhave little to say about such examples.” But the fact that the\nproposed universals are discarded principles of UG is irrelevant to\nthe effect that unreliable data once had on the (now largely\nabandoned) GB theory. A methodological concern cannot be dismissed on\nthe basis of a move to a new theory that abandons the old theory but\nnot its methods!\n\nMore recently, Bresnan (2007) claims that many theoretical claims have\narguably been supported by unreliable informally gathered syntactic\nacceptability judgments. She observes:\n\nErroneous generalizations based on linguistic intuitions about\nisolated, constructed examples occur throughout all parts of the\ngrammar. They often seriously underestimate the space of grammatical\npossibility (Taylor 1994, 1996, Bresnan & Nikitina 2003, Fellbaum\n2005, Lødrup 2006, among others), reflect relative frequency\ninstead of categorical grammaticality (Labov 1996, Lapata 1999,\nManning 2003), overlook complex constraint interactions (Green 1971,\nGries 2003) and processing effects (Arnon et al. 2005a, b), and fail\nto address the problems of investigator bias (Labov 1975, Naro 1980,\nChambers 2003: 34) and social intervention (Labov 1996, Milroy 2001,\nCornips & Poletto 2005). (Bresnan 2007: 301)\n\n\nHer discussion supports the view that various highly abstract\ntheoretical hypotheses have been defended through the use of\ngeneralizations based on unreliable data.\n\nThe debate over the harm that the acceptance of informally collected\ndata has had on theory testing is somewhat difficult to understand for\nEssentialist, Externalist, and Emergentist researchers who have been\ntrained in the methods of the cognitive and behavioral sciences. Why\ntry to support one’s theories of universal grammar, or of the\ngrammars of particular languages, by using questionably reliable\ndata?\n\nOne clue might be found in Culicover and Jackendoff (2010), who\nwrite:\n\n[T]heoreticians’ subjective judgments are essential in\nformulating linguistic theories. It would cripple linguistic\ninvestigation if it were required that all judgments of ambiguity and\ngrammaticality be subject to statistically rigorous experiments on\nnaive subjects. (Culicover and Jackendoff 2010)\n\n\nThe worry is that use of experimental methods is so resource\nconsumptive that it would impede the formulation of linguistic\ntheories. But this changes the subject from the importance of using\nreliable data as evidence in theory testing to using only\nexperimentally gathered data in theory formulation. We are\nnot aware of anyone who has ever suggested that at the stage of\nhypothesis development or theory formulation the linguist should\neschew intuition. Certainly Bard et al., Schütze, Cowart, Gibson\n& Fedorenko, and Ferreira say no such thing. The relevant issue\nconcerns what data should be used to test theories, which is\na very different matter.\n\nWe noted earlier that there are clear and uncontroversial\nacceptability judgments, and that these judgments are reliable data.\nThe difficulty lies in distinguishing the clear, uncontroversial, and\nreliable data from what only appears to be clear, uncontroversial, and\nreliable to a research community at a time. William Labov, the founder\nof modern quantitative sociolinguistics, who takes an Emergentist\napproach, proposed a set of working methodological principles in Labov\n(1975) for adjudicating when experimental methods should be\nemployed.\n\n\nThe Consensus Principle: If there is no reason to\nthink otherwise, assume that the judgments of any native speaker are\ncharacteristic of all speakers.\n\nThe Experimenter Principle: If there is any\ndisagreement on introspective judgments, the judgments of those who\nare familiar with the theoretical issues may not be counted as\nevidence.\n\nThe Clear Case Principle: Disputed judgments should\nbe shown to include at least one consistent pattern in the speech\ncommunity or be abandoned. If differing judgments are said to\nrepresent different dialects, enough investigation of each dialect\nshould be carried out to show that each judgment is a clear case in\nthat dialect. (Labov 1975, quoted in Schütze 1996: 200)\n\n\nIf we accept that ‘introspective judgments’ are\nacceptability judgments, then Labov’s rules of thumb are guides\nfor when to deploy experimental methods, although they no doubt need\nrefinement. However, it seems vastly more likely that careful\ndevelopment of such methodological rules of thumb can serve to improve\nthe reliability of linguistic data and adjudicate these methodological\ndisputes that seem largely independent of any particular approach to\nlinguistics.\n",
    "section_title": "3.5 What informal methods actually are",
    "entry_title": "Philosophy of Linguistics",
    "hierarchy_title": "Philosophy of Linguistics || Linguistic Methodology and Data || What informal methods actually are",
    "tokenized_text": [
        "linguistic",
        "methodology",
        "data",
        "informal",
        "method",
        "actually",
        "informal",
        "method",
        "actually",
        "informal",
        "method",
        "acceptability",
        "judgment",
        "data",
        "often",
        "described",
        "excessively",
        "casual",
        "ferreira",
        "described",
        "informal",
        "method",
        "way",
        "example",
        "sentence",
        "predicted",
        "ungrammatical",
        "contrasted",
        "sentence",
        "supposed",
        "similar",
        "relevant",
        "way",
        "two",
        "sentence",
        "constitute",
        "minimal",
        "pair",
        "author",
        "article",
        "provides",
        "judgment",
        "sentence",
        "hypothesized",
        "bad",
        "fact",
        "ungrammatical",
        "indicated",
        "star",
        "annotating",
        "example",
        "serious",
        "problem",
        "methodology",
        "example",
        "tested",
        "could",
        "idiosyncratic",
        "property",
        "due",
        "unique",
        "lexical",
        "content",
        "occasionally",
        "second",
        "third",
        "minimal",
        "pair",
        "provided",
        "attempt",
        "made",
        "consider",
        "range",
        "relevant",
        "extraneous",
        "variable",
        "must",
        "accounted",
        "held",
        "constant",
        "make",
        "sure",
        "correlated",
        "property",
        "responsible",
        "contrast",
        "judgment",
        "even",
        "worse",
        "subject",
        "provides",
        "data",
        "naïve",
        "informant",
        "fact",
        "theorist",
        "person",
        "stake",
        "whether",
        "sentence",
        "judged",
        "grammatical",
        "ungrammatical",
        "person",
        "theory",
        "would",
        "falsified",
        "prediction",
        "wrong",
        "potential",
        "source",
        "bias",
        "ferreira",
        "would",
        "appropriate",
        "read",
        "grammatical",
        "grammaticality",
        "ferreira",
        "text",
        "meaning",
        "acceptable",
        "acceptability",
        "critical",
        "characterization",
        "exemplifies",
        "kind",
        "method",
        "schütze",
        "cowart",
        "aimed",
        "improve",
        "recently",
        "gibson",
        "fedorenko",
        "describe",
        "traditional",
        "informal",
        "method",
        "way",
        "often",
        "noted",
        "recent",
        "year",
        "cowart",
        "edelman",
        "christiansen",
        "featherston",
        "ferreira",
        "gibson",
        "fedorenko",
        "a",
        "marantz",
        "myers",
        "schütze",
        "wasow",
        "arnold",
        "result",
        "obtained",
        "using",
        "method",
        "necessarily",
        "generalisable",
        "small",
        "number",
        "experimental",
        "participant",
        "typically",
        "one",
        "b",
        "small",
        "number",
        "experimental",
        "stimulus",
        "typically",
        "one",
        "c",
        "cognitive",
        "bias",
        "part",
        "researcher",
        "participant",
        "effect",
        "preceding",
        "context",
        "eg",
        "construction",
        "researcher",
        "may",
        "recently",
        "considering",
        "gibson",
        "fedorenko",
        "essentialists",
        "acknowledged",
        "problem",
        "reliability",
        "informal",
        "method",
        "others",
        "effect",
        "denied",
        "relevance",
        "example",
        "colin",
        "phillips",
        "argues",
        "little",
        "evidence",
        "frequent",
        "claim",
        "sloppy",
        "datacollection",
        "practice",
        "harmed",
        "development",
        "linguistic",
        "theory",
        "admits",
        "epistemologically",
        "well",
        "syntactic",
        "theory",
        "add",
        "think",
        "problem",
        "solved",
        "rating",
        "surveys",
        "concludes",
        "think",
        "fooled",
        "thinking",
        "informal",
        "judgment",
        "gathering",
        "root",
        "problem",
        "formalized",
        "judgment",
        "collection",
        "solve",
        "problem",
        "phillips",
        "suggest",
        "informal",
        "method",
        "fully",
        "reliable",
        "controlled",
        "experimental",
        "one",
        "would",
        "serious",
        "charge",
        "implying",
        "researcher",
        "like",
        "bard",
        "robinson",
        "sorace",
        "cowart",
        "schütze",
        "gibson",
        "fedorenko",
        "others",
        "wasting",
        "time",
        "phillips",
        "actually",
        "seems",
        "making",
        "different",
        "claim",
        "suggests",
        "first",
        "informally",
        "gathered",
        "data",
        "actually",
        "harmed",
        "linguistics",
        "second",
        "linguist",
        "danger",
        "fooled",
        "critic",
        "invent",
        "story",
        "unreliable",
        "data",
        "harmed",
        "linguistics",
        "harm",
        "phillips",
        "claim",
        "occurred",
        "relates",
        "charge",
        "mainstream",
        "linguistics",
        "mean",
        "current",
        "generative",
        "essentialist",
        "framework",
        "called",
        "minimalism",
        "irrelevant",
        "broader",
        "interest",
        "cognitive",
        "science",
        "lost",
        "initiative",
        "language",
        "study",
        "course",
        "phillips",
        "right",
        "sense",
        "one",
        "insure",
        "experimental",
        "judgment",
        "collection",
        "method",
        "address",
        "every",
        "way",
        "minimalist",
        "theorizing",
        "irrelevant",
        "particular",
        "endeavor",
        "language",
        "description",
        "language",
        "teaching",
        "natural",
        "language",
        "processing",
        "broader",
        "question",
        "cognitive",
        "psychological",
        "research",
        "claim",
        "bear",
        "schütze",
        "cowart",
        "show",
        "unreliability",
        "informal",
        "method",
        "phillips",
        "fully",
        "accept",
        "view",
        "chomsky",
        "experimental",
        "method",
        "useless",
        "data",
        "gathering",
        "say",
        "mean",
        "argue",
        "comprehensive",
        "data",
        "gathering",
        "study",
        "acceptability",
        "worthless",
        "defense",
        "informal",
        "method",
        "data",
        "collection",
        "rest",
        "whether",
        "method",
        "damaged",
        "essentialist",
        "theory",
        "testing",
        "critique",
        "read",
        "present",
        "evidence",
        "supposed",
        "damage",
        "informal",
        "intuition",
        "caused",
        "among",
        "provide",
        "specific",
        "example",
        "rare",
        "provide",
        "clear",
        "evidence",
        "supposed",
        "damage",
        "informal",
        "intuition",
        "caused",
        "specifically",
        "questioning",
        "whether",
        "informal",
        "occasionally",
        "careless",
        "gathering",
        "acceptability",
        "judgment",
        "actually",
        "held",
        "back",
        "progress",
        "linguistics",
        "whether",
        "careful",
        "gathering",
        "acceptability",
        "judgment",
        "provide",
        "key",
        "future",
        "progress",
        "either",
        "phillips",
        "fronting",
        "surprising",
        "opinion",
        "generative",
        "theorizing",
        "never",
        "led",
        "wrong",
        "track",
        "demonstrably",
        "unreliable",
        "data",
        "changing",
        "subject",
        "unless",
        "clear",
        "criterion",
        "established",
        "count",
        "damage",
        "holding",
        "back",
        "phillips",
        "offering",
        "testable",
        "hypothesis",
        "data",
        "collection",
        "methodology",
        "example",
        "phillips",
        "discount",
        "observation",
        "schütze",
        "conflicting",
        "judgment",
        "relative",
        "unacceptability",
        "violation",
        "two",
        "linguistic",
        "universal",
        "held",
        "back",
        "development",
        "government",
        "binding",
        "gb",
        "ground",
        "two",
        "set",
        "conflicting",
        "judgment",
        "analysis",
        "largely",
        "forgotten",
        "supplanted",
        "theory",
        "little",
        "say",
        "examples",
        "fact",
        "proposed",
        "universal",
        "discarded",
        "principle",
        "ug",
        "irrelevant",
        "effect",
        "unreliable",
        "data",
        "largely",
        "abandoned",
        "gb",
        "theory",
        "methodological",
        "concern",
        "dismissed",
        "basis",
        "move",
        "new",
        "theory",
        "abandon",
        "old",
        "theory",
        "method",
        "recently",
        "bresnan",
        "claim",
        "many",
        "theoretical",
        "claim",
        "arguably",
        "supported",
        "unreliable",
        "informally",
        "gathered",
        "syntactic",
        "acceptability",
        "judgment",
        "observes",
        "erroneous",
        "generalization",
        "based",
        "linguistic",
        "intuition",
        "isolated",
        "constructed",
        "example",
        "occur",
        "throughout",
        "part",
        "grammar",
        "often",
        "seriously",
        "underestimate",
        "space",
        "grammatical",
        "possibility",
        "taylor",
        "bresnan",
        "nikitina",
        "fellbaum",
        "lødrup",
        "among",
        "others",
        "reflect",
        "relative",
        "frequency",
        "instead",
        "categorical",
        "grammaticality",
        "labov",
        "lapata",
        "manning",
        "overlook",
        "complex",
        "constraint",
        "interaction",
        "green",
        "gries",
        "processing",
        "effect",
        "arnon",
        "et",
        "al",
        "a",
        "b",
        "fail",
        "address",
        "problem",
        "investigator",
        "bias",
        "labov",
        "naro",
        "chamber",
        "social",
        "intervention",
        "labov",
        "milroy",
        "cornips",
        "poletto",
        "bresnan",
        "discussion",
        "support",
        "view",
        "various",
        "highly",
        "abstract",
        "theoretical",
        "hypothesis",
        "defended",
        "use",
        "generalization",
        "based",
        "unreliable",
        "data",
        "debate",
        "harm",
        "acceptance",
        "informally",
        "collected",
        "data",
        "theory",
        "testing",
        "somewhat",
        "difficult",
        "understand",
        "essentialist",
        "externalist",
        "emergentist",
        "researcher",
        "trained",
        "method",
        "cognitive",
        "behavioral",
        "science",
        "try",
        "support",
        "one",
        "theory",
        "universal",
        "grammar",
        "grammar",
        "particular",
        "language",
        "using",
        "questionably",
        "reliable",
        "data",
        "one",
        "clue",
        "might",
        "found",
        "culicover",
        "jackendoff",
        "write",
        "heoreticians",
        "subjective",
        "judgment",
        "essential",
        "formulating",
        "linguistic",
        "theory",
        "would",
        "cripple",
        "linguistic",
        "investigation",
        "required",
        "judgment",
        "ambiguity",
        "grammaticality",
        "subject",
        "statistically",
        "rigorous",
        "experiment",
        "naive",
        "subject",
        "culicover",
        "jackendoff",
        "worry",
        "use",
        "experimental",
        "method",
        "resource",
        "consumptive",
        "would",
        "impede",
        "formulation",
        "linguistic",
        "theory",
        "change",
        "subject",
        "importance",
        "using",
        "reliable",
        "data",
        "evidence",
        "theory",
        "testing",
        "using",
        "experimentally",
        "gathered",
        "data",
        "theory",
        "formulation",
        "aware",
        "anyone",
        "ever",
        "suggested",
        "stage",
        "hypothesis",
        "development",
        "theory",
        "formulation",
        "linguist",
        "eschew",
        "intuition",
        "certainly",
        "bard",
        "et",
        "al",
        "schütze",
        "cowart",
        "gibson",
        "fedorenko",
        "ferreira",
        "say",
        "thing",
        "relevant",
        "issue",
        "concern",
        "data",
        "used",
        "test",
        "theory",
        "different",
        "matter",
        "noted",
        "earlier",
        "clear",
        "uncontroversial",
        "acceptability",
        "judgment",
        "judgment",
        "reliable",
        "data",
        "difficulty",
        "lie",
        "distinguishing",
        "clear",
        "uncontroversial",
        "reliable",
        "data",
        "appears",
        "clear",
        "uncontroversial",
        "reliable",
        "research",
        "community",
        "time",
        "william",
        "labov",
        "founder",
        "modern",
        "quantitative",
        "sociolinguistics",
        "take",
        "emergentist",
        "approach",
        "proposed",
        "set",
        "working",
        "methodological",
        "principle",
        "labov",
        "adjudicating",
        "experimental",
        "method",
        "employed",
        "consensus",
        "principle",
        "reason",
        "think",
        "otherwise",
        "assume",
        "judgment",
        "native",
        "speaker",
        "characteristic",
        "speaker",
        "experimenter",
        "principle",
        "disagreement",
        "introspective",
        "judgment",
        "judgment",
        "familiar",
        "theoretical",
        "issue",
        "may",
        "counted",
        "evidence",
        "clear",
        "case",
        "principle",
        "disputed",
        "judgment",
        "shown",
        "include",
        "least",
        "one",
        "consistent",
        "pattern",
        "speech",
        "community",
        "abandoned",
        "differing",
        "judgment",
        "said",
        "represent",
        "different",
        "dialect",
        "enough",
        "investigation",
        "dialect",
        "carried",
        "show",
        "judgment",
        "clear",
        "case",
        "dialect",
        "labov",
        "quoted",
        "schütze",
        "accept",
        "introspective",
        "judgment",
        "acceptability",
        "judgment",
        "labov",
        "rule",
        "thumb",
        "guide",
        "deploy",
        "experimental",
        "method",
        "although",
        "doubt",
        "need",
        "refinement",
        "however",
        "seems",
        "vastly",
        "likely",
        "careful",
        "development",
        "methodological",
        "rule",
        "thumb",
        "serve",
        "improve",
        "reliability",
        "linguistic",
        "data",
        "adjudicate",
        "methodological",
        "dispute",
        "seem",
        "largely",
        "independent",
        "particular",
        "approach",
        "linguistics"
    ]
}