{
    "main_text": "Linguistic Methodology and Data || Corpus data\n3.6 Corpus data\n\nIn linguistics, the goal of collecting corpus data is to identify and\norganize a representative sample of a written and/or spoken variety\nfrom which characteristics of the entire variety or genre can be\ninduced. Concordances of word usage in linguistic context have long\nbeen used to aid in the translation and interpretation of literary and\nsacred texts of particular authors (e.g. Plato, Aristotle, Aquinas)\nand of particular texts (e.g. the Torah, the rest of the Old\nTestament, the Gospels, the Epistles). Formal textual criticism, the\nidentification of antecedently existing oral traditions that were\nlater redacted into Biblical texts, and author identification (e.g.\nfiguring out which of the Epistles were written by Paul and which were\nprobably not) began to develop in the late 19th century.\n\nThe development of computational methods for collecting, analyzing,\nand searching corpora have seen rapid development as computer memory\nhas become less expensive and search and analysis programs have become\nfaster. The first computer searchable corpus of American English, the\nBrown Corpus, developed in the 1960s, contained just over one million\nword tokens. The British National Corpus (BNC) is a balanced corpus\ncontaining over 100 million words—a hundredfold size\nincrease—of which 90% is written prose published from 1991 to\n1994 and 10% is spoken English. Between 2005 and 2007, billion-word\ncorpora were released for British English (ukWaC), German (deWaC), and\nItalian (itWaC)—a thousand times bigger than the Brown corpus.\nAnd the entire World Wide Web probably holds about a thousand times as\nmuch as that—around a trillion words. Thus corpus linguistics\nhas gone from megabytes of data (∼ 103kB) to terabytes\nof data (∼ 109kB) in fifty years.\n\nJust as a central issue concerning acceptability judgment data\nconcerns its reliability as evidence for empirical generalizations\nabout languages or idiolects, a central question concerning the\ncollection of corpus data concerns whether or not it is representative\nof the language variety it purports to represent. Some linguists make\nthe criterion of representativeness definitional: they call a\ncollection of samples of language use a corpus only if it has been\ncarefully balanced between different genres (conversation, informal\nwriting, journalism, literature, etc.), regional varieties, or\nwhatever.\n\nBut corpora are of many different kinds. Some are just very large\ncompilations of text from individual sources such as newspapers of\nrecord or the World Wide Web—compilations large enough for the\ndiversity in the source to act as a surrogate for representativeness.\nFor example, a billion words of a newspaper, despite coming from a\nsingle source, will include not only journalists’ news reports\nand prepared editorials but also quoted speech, political rhetoric,\nhumor columns, light features, theater and film reviews,\nreaders’ letters, fiction items, and so on, and will thus\nprovide examples of a much wider variety of styles than one might have\nthought.\n\nCorpora are cleaned up through automatic or manual removal of such\nelements as numerical tables, typographical slips, spelling mistakes,\nmarkup tags, accidental repetitions (the the), larger-scale\nduplications (e.g., copies on mirror sites), boilerplate text\n(Opinions expressed in this email do not necessarily\nreflect…), and so on (see Baroni et al. 2009 for a fuller\ndiscussion of corpus cleaning).\n\nThe entire web itself can be used as a corpus to some degree, despite\nits constantly changing content, its multilinguality, its many tables\nand images, and its total lack of quality control; but when it is, the\noutputs of searches are nearly always cleaned by disregarding unwanted\nresults. For example, Google searches are blind to punctuation,\ncapitalization, and sentence boundaries, so search results for to\nbe will unfortunately include irrelevant cases, such as where a\nsentence like Do you want to? happens to be followed by a\nsentence like Be careful.\n\nCorpora can be annotated in ways that permit certain kinds of analysis\nand grammar testing. One basic kind of annotation is part-of-speech\ntagging, in which each word is labeled with its syntactic category.\nAnother is lemmatization, which classifies the different\nmorphologically inflected forms of a word as belonging together\n(goes, gone, going, and went\nbelong with go, for example). A more thoroughgoing kind of\nannotation involves adding markup that encodes trees representing\ntheir structure; an example like That road leads to the\nfreeway might be marked up as a Clause within which the first two\nwords make up a Noun Phrase (NP), the last four constitute a Verb\nPhrase (VP), and so on, giving a structural analysis represented\nthus:\n\n\n\n\nSuch a diagram is isomorphic to (and the one shown was computed\ndirectly from) a labeled bracketing like this:\n\n(.Clause. (.NP. (.D. ‘that’ ) (.N. ‘road’ ) )\n(.VP. (.V. ‘leads’ ) (.PP. (.P. ‘to’ ) (.NP.\n(.D. ‘the’ ) (.N. ‘freeway’ ) ) ) ) )\n\nand this in turn could be represented in a markup language like XML\nas:\n\n\n<clause>\n <nounphrase>\n\n<determiner>that</determiner>\n\n<noun>road</noun>\n </nounphrase>\n\n<verbphrase>\n <verb>leads</verb>\n\n<prepphrase>\n <prep>to</prep>\n\n<nounphrase>\n <determiner>the</determiner>\n\n<noun>freeway</noun>\n </nounphrase>\n\n</prepphrase>\n\n</verbphrase>\n</clause>\n\n\n\nA corpus annotated with tree structure is known as a\ntreebank. Clearly, such a corpus is not a raw record\nof attested utterances at all; it is a combination of a collection of\nattested utterances together with a systematic attempt at analysing\ntheir structure. Whether the analysis is added manually or\nsemi-automatically, it is ultimately based on native speaker\njudgments. (Treebanks are often developed by graduate student\nannotators tutored by computational linguists; naturally, consistency\nbetween annotators is an issue that needs regular attention. See\nArtstein and Poesio, 2008, for discussion of the methodological\nissues.).\n\nOne of the purposes of a treebank is to permit the further\ninvestigation of a language and the checking of further linguistic\nhypotheses by searching a large database of previously established\nanalyses. It can also be used to test grammars, natural language\nprocessing systems, or machine learning programs.\n\nGoing beyond syntactic parse trees, it is possible to annotate corpora\nfurther, with information of a semantic and pragmatic nature. There is\nongoing computational linguistic research aimed at discovering\nwhether, for example, semantic annotation that is semi-automatically\nadded might suffice for recognition of whether a product review is\npositive or negative (what computational linguists call\n‘sentiment analysis’).\n\nNotice, then, that using corpus data does not mean abandoning or\nescaping from the use of intuitions about acceptability or grammatical\nstructure: the results of a corpus search are generally filtered\nthrough the judgments of an investigator who decides which pieces of\ncorpus data are to be taken at face value and which are just bad hits\nor irrelevant noise.\n\nDifficult methodological issues arise in connection with the\ncollection, annotation, and use of corpus data. For example, there is\nthe issue of extremely rare expression tokens. Are they accurately\nrecorded tokens of expression types that turn up only in consequence\nof sporadic errors and should be dismissed as irrelevant unless the\ntopic of interest is performance errors? Are they due to errors in the\ncompilation of the corpus itself, corresponding to neither accepted\nusage nor sporadic speech errors? Or are they perfectly grammatical\nbut (for some extraneous reason) very rare, at least in that\nparticular corpus?\n\nMany questions arise about what kind of corpus is best suited to the\nresearch questions under consideration, as well as what kind of\nannotation is most appropriate. For example, as Ferreira (2005: 375)\npoints out, some large corpora, insofar as they have not been\ncleaned of speech errors, provide relevant data for studying the\ndistribution of speech disfluencies. In addition, probabilistic\ninformation about the relation between a particular verb and its\narguments has been used to show that “verb-argument preferences\n[are] an essential part of the process of sentence\ninterpretation” (Roland and Jurafsky 2002: 325): acceptability\njudgments on individual expressions do not provide information about\nthe distribution of a verb and its arguments in various kinds of\nspeech and writing. Studying conveyed meaning in context and\nidentification of speech acts will require a kind of data that\ndecontextualized acceptability judgments do not provide but\nsemantically annotated corpora might.\n\nMany Essentialists have been skeptical of the reliability of\nuncleaned, unanalyzed corpus data as evidence to support linguistic\ntheorizing, because it is assumed to be replete with strings that any\nnative speaker would judge unacceptable. And many Emergentists and\nExternalists, as well as some Essentialists, have charged that\ninformally gathered acceptability judgments can be highly unreliable\ntoo. Both worries are apposite; but the former does not hold for\nadequately cleaned and analyzed corpora, and the latter does not hold\nfor judgment data that has been gathered using appropriately\ncontrolled methods. In certain contested cases of acceptability, it\nwill of course be important to use both corpus and controlled\nelicitation methods to cross-compare.\n\nNotice that we have not in any way suggested that our three broad\napproaches to linguistics should differ in the kinds of data they use\nfor theory testing: Essentialists are not limited to informal\nelicitation; nor are Emergentists and Externalists denied access to\nit. In matters of methodology, at least, there is in principle an open\nmarket—even if many linguists seem to think otherwise.\n",
    "section_title": "3.6 Corpus data",
    "entry_title": "Philosophy of Linguistics",
    "hierarchy_title": "Philosophy of Linguistics || Linguistic Methodology and Data || Corpus data",
    "tokenized_text": [
        "linguistic",
        "methodology",
        "data",
        "corpus",
        "data",
        "corpus",
        "data",
        "linguistics",
        "goal",
        "collecting",
        "corpus",
        "data",
        "identify",
        "organize",
        "representative",
        "sample",
        "written",
        "andor",
        "spoken",
        "variety",
        "characteristic",
        "entire",
        "variety",
        "genre",
        "induced",
        "concordance",
        "word",
        "usage",
        "linguistic",
        "context",
        "long",
        "used",
        "aid",
        "translation",
        "interpretation",
        "literary",
        "sacred",
        "text",
        "particular",
        "author",
        "eg",
        "plato",
        "aristotle",
        "aquinas",
        "particular",
        "text",
        "eg",
        "torah",
        "rest",
        "old",
        "testament",
        "gospel",
        "epistle",
        "formal",
        "textual",
        "criticism",
        "identification",
        "antecedently",
        "existing",
        "oral",
        "tradition",
        "later",
        "redacted",
        "biblical",
        "text",
        "author",
        "identification",
        "eg",
        "figuring",
        "epistle",
        "written",
        "paul",
        "probably",
        "began",
        "develop",
        "late",
        "th",
        "century",
        "development",
        "computational",
        "method",
        "collecting",
        "analyzing",
        "searching",
        "corpus",
        "seen",
        "rapid",
        "development",
        "computer",
        "memory",
        "become",
        "le",
        "expensive",
        "search",
        "analysis",
        "program",
        "become",
        "faster",
        "first",
        "computer",
        "searchable",
        "corpus",
        "american",
        "english",
        "brown",
        "corpus",
        "developed",
        "s",
        "contained",
        "one",
        "million",
        "word",
        "token",
        "british",
        "national",
        "corpus",
        "bnc",
        "balanced",
        "corpus",
        "containing",
        "million",
        "wordsa",
        "hundredfold",
        "size",
        "increaseof",
        "written",
        "prose",
        "published",
        "spoken",
        "english",
        "billionword",
        "corpus",
        "released",
        "british",
        "english",
        "ukwac",
        "german",
        "dewac",
        "italian",
        "itwac",
        "a",
        "thousand",
        "time",
        "bigger",
        "brown",
        "corpus",
        "entire",
        "world",
        "wide",
        "web",
        "probably",
        "hold",
        "thousand",
        "time",
        "much",
        "thataround",
        "trillion",
        "word",
        "thus",
        "corpus",
        "linguistics",
        "gone",
        "megabyte",
        "data",
        "kb",
        "terabyte",
        "data",
        "kb",
        "fifty",
        "year",
        "central",
        "issue",
        "concerning",
        "acceptability",
        "judgment",
        "data",
        "concern",
        "reliability",
        "evidence",
        "empirical",
        "generalization",
        "language",
        "idiolect",
        "central",
        "question",
        "concerning",
        "collection",
        "corpus",
        "data",
        "concern",
        "whether",
        "representative",
        "language",
        "variety",
        "purport",
        "represent",
        "linguist",
        "make",
        "criterion",
        "representativeness",
        "definitional",
        "call",
        "collection",
        "sample",
        "language",
        "use",
        "corpus",
        "carefully",
        "balanced",
        "different",
        "genre",
        "conversation",
        "informal",
        "writing",
        "journalism",
        "literature",
        "etc",
        "regional",
        "variety",
        "whatever",
        "corpus",
        "many",
        "different",
        "kind",
        "large",
        "compilation",
        "text",
        "individual",
        "source",
        "newspaper",
        "record",
        "world",
        "wide",
        "webcompilations",
        "large",
        "enough",
        "diversity",
        "source",
        "act",
        "surrogate",
        "representativeness",
        "example",
        "billion",
        "word",
        "newspaper",
        "despite",
        "coming",
        "single",
        "source",
        "include",
        "journalist",
        "news",
        "report",
        "prepared",
        "editorial",
        "also",
        "quoted",
        "speech",
        "political",
        "rhetoric",
        "humor",
        "column",
        "light",
        "feature",
        "theater",
        "film",
        "review",
        "reader",
        "letter",
        "fiction",
        "item",
        "thus",
        "provide",
        "example",
        "much",
        "wider",
        "variety",
        "style",
        "one",
        "might",
        "thought",
        "corpus",
        "cleaned",
        "automatic",
        "manual",
        "removal",
        "element",
        "numerical",
        "table",
        "typographical",
        "slip",
        "spelling",
        "mistake",
        "markup",
        "tag",
        "accidental",
        "repetition",
        "largerscale",
        "duplication",
        "eg",
        "copy",
        "mirror",
        "site",
        "boilerplate",
        "text",
        "opinion",
        "expressed",
        "email",
        "necessarily",
        "reflect",
        "see",
        "baroni",
        "et",
        "al",
        "fuller",
        "discussion",
        "corpus",
        "cleaning",
        "entire",
        "web",
        "used",
        "corpus",
        "degree",
        "despite",
        "constantly",
        "changing",
        "content",
        "multilinguality",
        "many",
        "table",
        "image",
        "total",
        "lack",
        "quality",
        "control",
        "output",
        "search",
        "nearly",
        "always",
        "cleaned",
        "disregarding",
        "unwanted",
        "result",
        "example",
        "google",
        "search",
        "blind",
        "punctuation",
        "capitalization",
        "sentence",
        "boundary",
        "search",
        "result",
        "unfortunately",
        "include",
        "irrelevant",
        "case",
        "sentence",
        "like",
        "want",
        "happens",
        "followed",
        "sentence",
        "like",
        "careful",
        "corpus",
        "annotated",
        "way",
        "permit",
        "certain",
        "kind",
        "analysis",
        "grammar",
        "testing",
        "one",
        "basic",
        "kind",
        "annotation",
        "partofspeech",
        "tagging",
        "word",
        "labeled",
        "syntactic",
        "category",
        "another",
        "lemmatization",
        "classifies",
        "different",
        "morphologically",
        "inflected",
        "form",
        "word",
        "belonging",
        "together",
        "go",
        "gone",
        "going",
        "went",
        "belong",
        "go",
        "example",
        "thoroughgoing",
        "kind",
        "annotation",
        "involves",
        "adding",
        "markup",
        "encodes",
        "tree",
        "representing",
        "structure",
        "example",
        "like",
        "road",
        "lead",
        "freeway",
        "might",
        "marked",
        "clause",
        "within",
        "first",
        "two",
        "word",
        "make",
        "noun",
        "phrase",
        "np",
        "last",
        "four",
        "constitute",
        "verb",
        "phrase",
        "vp",
        "giving",
        "structural",
        "analysis",
        "represented",
        "thus",
        "diagram",
        "isomorphic",
        "one",
        "shown",
        "computed",
        "directly",
        "labeled",
        "bracketing",
        "like",
        "clause",
        "np",
        "d",
        "n",
        "road",
        "vp",
        "v",
        "lead",
        "pp",
        "p",
        "np",
        "d",
        "n",
        "freeway",
        "turn",
        "could",
        "represented",
        "markup",
        "language",
        "like",
        "xml",
        "clause",
        "nounphrase",
        "determiner",
        "determiner",
        "noun",
        "road",
        "noun",
        "nounphrase",
        "verbphrase",
        "verb",
        "lead",
        "verb",
        "prepphrase",
        "prep",
        "prep",
        "nounphrase",
        "determiner",
        "determiner",
        "noun",
        "freeway",
        "noun",
        "nounphrase",
        "prepphrase",
        "verbphrase",
        "clause",
        "corpus",
        "annotated",
        "tree",
        "structure",
        "known",
        "treebank",
        "clearly",
        "corpus",
        "raw",
        "record",
        "attested",
        "utterance",
        "combination",
        "collection",
        "attested",
        "utterance",
        "together",
        "systematic",
        "attempt",
        "analysing",
        "structure",
        "whether",
        "analysis",
        "added",
        "manually",
        "semiautomatically",
        "ultimately",
        "based",
        "native",
        "speaker",
        "judgment",
        "treebanks",
        "often",
        "developed",
        "graduate",
        "student",
        "annotator",
        "tutored",
        "computational",
        "linguist",
        "naturally",
        "consistency",
        "annotator",
        "issue",
        "need",
        "regular",
        "attention",
        "see",
        "artstein",
        "poesio",
        "discussion",
        "methodological",
        "issues",
        "one",
        "purpose",
        "treebank",
        "permit",
        "investigation",
        "language",
        "checking",
        "linguistic",
        "hypothesis",
        "searching",
        "large",
        "database",
        "previously",
        "established",
        "analysis",
        "also",
        "used",
        "test",
        "grammar",
        "natural",
        "language",
        "processing",
        "system",
        "machine",
        "learning",
        "program",
        "going",
        "beyond",
        "syntactic",
        "parse",
        "tree",
        "possible",
        "annotate",
        "corpus",
        "information",
        "semantic",
        "pragmatic",
        "nature",
        "ongoing",
        "computational",
        "linguistic",
        "research",
        "aimed",
        "discovering",
        "whether",
        "example",
        "semantic",
        "annotation",
        "semiautomatically",
        "added",
        "might",
        "suffice",
        "recognition",
        "whether",
        "product",
        "review",
        "positive",
        "negative",
        "computational",
        "linguist",
        "call",
        "sentiment",
        "analysis",
        "notice",
        "using",
        "corpus",
        "data",
        "mean",
        "abandoning",
        "escaping",
        "use",
        "intuition",
        "acceptability",
        "grammatical",
        "structure",
        "result",
        "corpus",
        "search",
        "generally",
        "filtered",
        "judgment",
        "investigator",
        "decides",
        "piece",
        "corpus",
        "data",
        "taken",
        "face",
        "value",
        "bad",
        "hit",
        "irrelevant",
        "noise",
        "difficult",
        "methodological",
        "issue",
        "arise",
        "connection",
        "collection",
        "annotation",
        "use",
        "corpus",
        "data",
        "example",
        "issue",
        "extremely",
        "rare",
        "expression",
        "token",
        "accurately",
        "recorded",
        "token",
        "expression",
        "type",
        "turn",
        "consequence",
        "sporadic",
        "error",
        "dismissed",
        "irrelevant",
        "unless",
        "topic",
        "interest",
        "performance",
        "error",
        "due",
        "error",
        "compilation",
        "corpus",
        "corresponding",
        "neither",
        "accepted",
        "usage",
        "sporadic",
        "speech",
        "error",
        "perfectly",
        "grammatical",
        "extraneous",
        "reason",
        "rare",
        "least",
        "particular",
        "corpus",
        "many",
        "question",
        "arise",
        "kind",
        "corpus",
        "best",
        "suited",
        "research",
        "question",
        "consideration",
        "well",
        "kind",
        "annotation",
        "appropriate",
        "example",
        "ferreira",
        "point",
        "large",
        "corpus",
        "insofar",
        "cleaned",
        "speech",
        "error",
        "provide",
        "relevant",
        "data",
        "studying",
        "distribution",
        "speech",
        "disfluency",
        "addition",
        "probabilistic",
        "information",
        "relation",
        "particular",
        "verb",
        "argument",
        "used",
        "show",
        "verbargument",
        "preference",
        "essential",
        "part",
        "process",
        "sentence",
        "interpretation",
        "roland",
        "jurafsky",
        "acceptability",
        "judgment",
        "individual",
        "expression",
        "provide",
        "information",
        "distribution",
        "verb",
        "argument",
        "various",
        "kind",
        "speech",
        "writing",
        "studying",
        "conveyed",
        "meaning",
        "context",
        "identification",
        "speech",
        "act",
        "require",
        "kind",
        "data",
        "decontextualized",
        "acceptability",
        "judgment",
        "provide",
        "semantically",
        "annotated",
        "corpus",
        "might",
        "many",
        "essentialists",
        "skeptical",
        "reliability",
        "uncleaned",
        "unanalyzed",
        "corpus",
        "data",
        "evidence",
        "support",
        "linguistic",
        "theorizing",
        "assumed",
        "replete",
        "string",
        "native",
        "speaker",
        "would",
        "judge",
        "unacceptable",
        "many",
        "emergentists",
        "externalists",
        "well",
        "essentialists",
        "charged",
        "informally",
        "gathered",
        "acceptability",
        "judgment",
        "highly",
        "unreliable",
        "worry",
        "apposite",
        "former",
        "hold",
        "adequately",
        "cleaned",
        "analyzed",
        "corpus",
        "latter",
        "hold",
        "judgment",
        "data",
        "gathered",
        "using",
        "appropriately",
        "controlled",
        "method",
        "certain",
        "contested",
        "case",
        "acceptability",
        "course",
        "important",
        "use",
        "corpus",
        "controlled",
        "elicitation",
        "method",
        "crosscompare",
        "notice",
        "way",
        "suggested",
        "three",
        "broad",
        "approach",
        "linguistics",
        "differ",
        "kind",
        "data",
        "use",
        "theory",
        "testing",
        "essentialists",
        "limited",
        "informal",
        "elicitation",
        "emergentists",
        "externalists",
        "denied",
        "access",
        "matter",
        "methodology",
        "least",
        "principle",
        "open",
        "marketeven",
        "many",
        "linguist",
        "seem",
        "think",
        "otherwise"
    ]
}