{
    "main_text": "Multilocation || For Multilocation #3: from Examples\n6.3 For Multilocation #3: from Examples\n\nA third kind of argument for the possibility of multilocation simply\npoints to examples. Entities that have been taken to be multilocated\ninclude: immanent universals, enduring material objects, enduring\ntropes, four-dimensional perduring objects, backward time travelers,\nfission products, transworld individuals, works of music, and an\nomnipresent God.\n6.3.1 Immanent universals\n\nAs we have noted, immanent realists say that universals are\nspatiotemporal entities that are in some sense ‘wholly\npresent’ in the things that instantiate them. This seems to be\nthe view under discussion in the following passage from Plato's\nParmenides, 131a–131b (in Hamilton and Cairns 1961:\n925):\n\n\nParmenides\nDo you hold, then that the form as a whole, a single thing, is in\neach of the many, or how?\nSocrates\nWhy should it not be in each, Parmenides?\nParmenides\nIf so, a form which is one and the same will be at the same time,\nas a whole, in a number of things which are separate, and consequently\nwill be separate from itself.\n\n\n\nOne natural way to translate immanent realism into the terminology of\nexact location is via the following principle:\n\n(16)\nNecessarily, for any x, any y, and any z, if\nx is exactly located at y and x instantiates\nz, then z is exactly located at y.\n\n\nTo see how this leads to multilocation, suppose that some monadic\nuniversal u is instantiated by an entity e1\nthat is exactly located at region r1 and by a\ndifferent entity, e2, that is exactly located at\nregion r2, disjoint from r1. Then,\ngiven (16), u itself is exactly located both at\nr1 and at r2 (Paul 2006; Lafrance\n2015).\n\n(16) is not inevitable, even for immanent realists. Some of them might\nprefer to say that a monadic universal is exactly located only at the\nfusion of the exact locations of its instances (Bigelow,\n1988: 18–27, can in places be read as embracing this, and\nEffingham 2015 argues that this is what immanent realists should say).\nOn this view, a simple monadic universal might be scattered but would\nnot be multilocated. Others (Armstrong 1989: 99) prefer to say that\nuniversals do not have exact locations at all, though they are parts\nor constituents of things that have exact locations or of spacetime\nitself. This was dubbed the ‘Burying Strategy’ in\n Section 4.1.[9]\n6.3.2 Enduring material objects\n\nThe debate over persistence through time centers around two rival\nviews, endurantism and perdurantism. Endurantists often say that a\npersisting material object is temporally unextended and in some sense\n‘wholly present’ at each instant of its career.\nPerdurantists often say that a persisting material object is a\ntemporally extended entity that has a different temporal part at each\ndifferent instant of its career and is at most partially present at\nany one instant.\n\n(Informally, an instantaneous temporal part of me is an object that is\na part of me, is made of the exactly same matter as I am whenever it\nexists, and has exactly the same spatial location as I do whenever it\nexists, but exists at only a single\n instant.[10])\n\nRecently, a number of philosophers have suggested that the traditional\nendurantism versus perdurantism dispute runs together a pair of\nindependent disputes about persistence: a mereological dispute\nconcerning the existence of temporal parts, and a locational dispute\nconcerning exact locations (Gilmore 2006, 2008; Hawthorne 2006; Sattig\n2006; Donnelly 2010, 2011b; Eddon 2010; Rychter 2011; Calosi and Fano\n2015). Stated somewhat loosely, the mereological dispute is between\nthe following views:\n\nMereological perdurance:\nthere are persisting material objects, and each such object has a\ndifferent temporal part at each different instant at which the object\nexists.\nMereological endurance:\nthere are persisting material objects, but none of them has a\ndifferent temporal part at each different instant of its career.\n(Perhaps none of them have any instantaneous temporal parts—or\nany temporal parts aside from themselves—at all.)\n\n\nTo frame the locational dispute, it will be useful to have one further\npiece of terminology. Say that y is a path of x\nif and only if y is a fusion of the exact locations of x\n(Gilmore 2006: 204). Informally, a path of an object is a region at\nwhich the object's complete career is exactly located.\n\nWe can then state the locational dispute as follows:\n\nLocational perdurance:\nthere are persisting material objects, and each of them has exactly\none exact location—its path.\nLocational endurance: there\nare persisting material objects, and each of them has many different\nexact locations, each such location being instantaneous or\n‘spacelike’. Typically, each of these exact locations will\ncount as an instantaneous temporal part of the object's path.\n\n\nPhilosophers on both sides of this dispute can agree about which\nspacetime regions are the paths of which material objects. They will\ndisagree about which spacetime regions are the exact locations of\nwhich objects. The locational perdurantist will say that material\nobjects are exactly located only at their paths. The locational\nendurantist will say that a persisting material object is exactly\nlocated at many regions, each of them a slice of its path. The\ninteraction between the two disputes about persistence is summarized\nin Figure 7 (from Gilmore 2008: 1230).\n\n\nFigure 7\n\n\n\nLocational endurance entails multilocation: it says that some material\nobjects are exactly located at many different regions. Mereological\nendurance, which merely rejects temporal parts, does not entail\nmultilocation. Thus one might reject temporal parts while retaining\nFunctionality. This is the position of Parsons (2000, 2007). It\ncorresponds to the lower left-hand box in Figure\n 7.[11]\n6.3.3 Enduring tropes\n\nWhether or not one takes material objects to be multilocated in the\nmanner of locational endurantism, one might hold such a view about\ntropes. Ehring (1997b, 2011) defends the view that tropes endure,\nthough he does not say whether he takes them to be multilocated in our\nsense. Consider some simple, spatially unextended trope e, and\nsuppose that it persists. Let the temporally extended, one-dimensional\nspacetime region r be e's path. Then there are at least\ntwo natural things one could say regarding e's locations. One\ncould say that (i) e has just one exact location, r, in\nwhich case e is a temporally extended simple but not\nmultilocated. Alternatively, one could say (ii) e is exactly\nlocated at each point in r and nowhere else, in which case\ne is multilocated but not extended.\n6.3.4 Multilocated 4D worms\n\nHudson (2001) defends a version of mereological perdurantism according\nto which each ordinary material object is exactly located at a great\nmany (mostly overlapping) four-dimensional spacetime regions. Hudson\noffers his view as a solution to\n the problem of the many\n among other things.\n\n(Hudson also argues that, given his view, the fundamental parthood\nrelation should be taken to be a three-place relation holding between\ntwo objects and a region. See Gilmore (2009) and Donnelly (2010) for\ndiscussion.)\n6.3.5 Backward Time Travelers\n\nSuppose that Suzy is born at time t0 and dies 90\nyears later, at time t90. At time\nt40, the forty-year-old Suzy steps into a time\nmachine and disappears, reappearing (with her time machine) out of\nthin air many years earlier. Suzy then enters the nursery in the house\nwhere she was raised and, at t1, sees a one-year-old\nbaby, whom she knows to be herself. (The character Suzy originates in\nVihvelin 1996.)\n\nIf one is an endurantist, one will find it natural to describe this\nsituation as involving multi-location in space or spacetime: Suzy is\nexactly located at rA, a region with the size\nand shape of an adult; Baby Suzy is exactly located at\nrB, a disjoint but simultaneous region with\nthe size and shape of a baby; and Suzy=Baby Suzy. Hence there is a\nsingle thing (namely, Suzy/Baby Suzy) that is exactly located at two\ndifferent, simultaneous regions, rA and\nrB (MacBride 1998, Keller and Nelson 2001;\nGilmore 2003, 2006, 2007; Miller 2006; Carroll 2011; Kleinschmidt\n2011; Effingham 2015). All of this holds even if one rejects talk of\nregions of spacetime in favor of talk of regions of space.\n\nTo be sure, even endurantists can deny that the situation involves\nmultilocation. Those who accept mereological endurantism and\nlocational perdurantism will say that Suzy does not have temporal\nparts but is still four-dimensional in at least the following sense:\nshe is exactly located at only one region: her four-dimensional path\n(Parsons 2000, 2007, 2008). If one is a presentist—one who says\nthat only the present time and its contents exist—one might say\nthat, at t1, Suzy is exactly located only at a\nfusion of rA and rB,\nnot at either of those regions themselves (Markosian 2004c).\n\nHowever, if Suzy is exactly located only at the sum of\nrA and rB at\nt1 then she is not shaped like a human being at\nt1; rather, she is a scattered object shaped like\nthe sum of two human beings. It might seem doubtful that Suzy can\nexist at a time without being even approximately human-shaped at that\ntime. This would speak in favor of the view that Suzy is multilocated,\nrather than scattered, at\n t1.[12]\n6.3.6 Fission\n\nDainton (2008: 364–408) argues that if a person were to undergo\nfission (in roughly the manner of an amoeba), the person would\ncontinue to exist after the fission in bilocated form: she would be\nwholly present in two different places at once. (This view is also\ndiscussed by Johnston 1989). Dainton's view is naturally understood as\ninvolving multilocation, either in spacetime or in space at a time:\nafter the fission, the person is exactly located at two different\nregions (see Gilmore, 2008: 1246, for an objection to Dainton's\nview).\n6.3.7 Modal Realism with Overlap\n\nMcDaniel (2004) develops a version of concrete modal realism that\nposits multilocation; he dubs the view Modal Realism with\nOverlap (MRO). Like Lewis's (1986) modal realism, MRO treats\npossible worlds as concrete, spatiotemporal entities and holds that\nspacetime regions are ‘worldbound’: no spacetime region\nthat is part of one world overlaps any spacetime region that is part\nof another world. Unlike Lewis's view, however, MRO claims that\nmaterial objects are wholly present in more than one world.\nSpecifically, MRO entails multilocation. It says that if Lewis is a\nphilosopher in world w1 and a plumber but not a\nphilosopher in world w2, then he is exactly located\nat two or more regions (one of which is a part of w1\nand another of which is a part of w2).\n6.3.8 Works of Music\n\nTillman (2011) develops a view about the ontology of musical works\naccording to which Beethoven's 9th Symphony (the\nsymphony itself, as opposed to any particular performance of it) is\nmultilocated. The view has it that a work of music is exactly located\nat a spacetime region r if and only if some performance of that\nwork is exactly located at r. When combined with facts about\nthe relevant performances, this principle yields the result that\nBeethoven's 9th is exactly located at spacetime regions\nconfined to the 19th century Vienna and also at other\nregions confined to 20th century New York; it is\nmultilocated. Tillman argues that this view is preferable to other\nforms of ‘musical materialism’. He does not say whether it\nis preferable to the view that works of music are abstract objects\nwith no spatiotemporal location.\n6.3.9 God\n\nOn some interpretations, the doctrine of divine\n omnipresence\n entails that God is exactly located at each region of space or\nspacetime (Hudson 2009, Inman 2017). The relevance of multilocation to\nissues in Christian theology, including the real presence of Christ in\nthe eucharist and the resurrection of the dead, is discussed in Pruss\n(2009, 2013), Hudson (2010, 2014), Baber (2013), Effingham (2015), and\nPickup (2015).\n\nFor an additional argument in favor of multilocation, see Section 3.1\nof the supplementary document\n Additional Arguments.\n",
    "section_title": "6.3 For Multilocation #3: from Examples",
    "entry_title": "Location and Mereology",
    "hierarchy_title": "Location and Mereology || Multilocation || For Multilocation #3: from Examples",
    "tokenized_text": [
        "multilocation",
        "multilocation",
        "example",
        "multilocation",
        "example",
        "third",
        "kind",
        "argument",
        "possibility",
        "multilocation",
        "simply",
        "point",
        "example",
        "entity",
        "taken",
        "multilocated",
        "include",
        "immanent",
        "universal",
        "enduring",
        "material",
        "object",
        "enduring",
        "trope",
        "fourdimensional",
        "perduring",
        "object",
        "backward",
        "time",
        "traveler",
        "fission",
        "product",
        "transworld",
        "individual",
        "work",
        "music",
        "omnipresent",
        "god",
        "immanent",
        "universal",
        "noted",
        "immanent",
        "realist",
        "say",
        "universal",
        "spatiotemporal",
        "entity",
        "sense",
        "wholly",
        "present",
        "thing",
        "instantiate",
        "seems",
        "view",
        "discussion",
        "following",
        "passage",
        "plato",
        "s",
        "parmenides",
        "ab",
        "hamilton",
        "cairn",
        "parmenides",
        "hold",
        "form",
        "whole",
        "single",
        "thing",
        "many",
        "socrates",
        "parmenides",
        "parmenides",
        "form",
        "one",
        "time",
        "whole",
        "number",
        "thing",
        "separate",
        "consequently",
        "separate",
        "one",
        "natural",
        "way",
        "translate",
        "immanent",
        "realism",
        "terminology",
        "exact",
        "location",
        "via",
        "following",
        "principle",
        "necessarily",
        "x",
        "z",
        "x",
        "exactly",
        "located",
        "x",
        "instantiates",
        "z",
        "z",
        "exactly",
        "located",
        "y",
        "see",
        "lead",
        "multilocation",
        "suppose",
        "monadic",
        "universal",
        "u",
        "instantiated",
        "entity",
        "e",
        "exactly",
        "located",
        "region",
        "r",
        "different",
        "entity",
        "e",
        "exactly",
        "located",
        "region",
        "r",
        "disjoint",
        "r",
        "given",
        "u",
        "exactly",
        "located",
        "r",
        "r",
        "paul",
        "lafrance",
        "inevitable",
        "even",
        "immanent",
        "realist",
        "might",
        "prefer",
        "say",
        "monadic",
        "universal",
        "exactly",
        "located",
        "fusion",
        "exact",
        "location",
        "instance",
        "bigelow",
        "place",
        "read",
        "embracing",
        "effingham",
        "argues",
        "immanent",
        "realist",
        "say",
        "view",
        "simple",
        "monadic",
        "universal",
        "might",
        "scattered",
        "would",
        "multilocated",
        "others",
        "armstrong",
        "prefer",
        "say",
        "universal",
        "exact",
        "location",
        "though",
        "part",
        "constituent",
        "thing",
        "exact",
        "location",
        "spacetime",
        "dubbed",
        "burying",
        "strategy",
        "section",
        "enduring",
        "material",
        "object",
        "debate",
        "persistence",
        "time",
        "center",
        "around",
        "two",
        "rival",
        "view",
        "endurantism",
        "perdurantism",
        "endurantists",
        "often",
        "say",
        "persisting",
        "material",
        "object",
        "temporally",
        "unextended",
        "sense",
        "wholly",
        "present",
        "instant",
        "career",
        "perdurantists",
        "often",
        "say",
        "persisting",
        "material",
        "object",
        "temporally",
        "extended",
        "entity",
        "different",
        "temporal",
        "part",
        "different",
        "instant",
        "career",
        "partially",
        "present",
        "one",
        "instant",
        "informally",
        "instantaneous",
        "temporal",
        "part",
        "object",
        "part",
        "made",
        "exactly",
        "matter",
        "whenever",
        "exists",
        "exactly",
        "spatial",
        "location",
        "whenever",
        "exists",
        "exists",
        "single",
        "instant",
        "recently",
        "number",
        "philosopher",
        "suggested",
        "traditional",
        "endurantism",
        "versus",
        "perdurantism",
        "dispute",
        "run",
        "together",
        "pair",
        "independent",
        "dispute",
        "persistence",
        "mereological",
        "dispute",
        "concerning",
        "existence",
        "temporal",
        "part",
        "locational",
        "dispute",
        "concerning",
        "exact",
        "location",
        "gilmore",
        "hawthorne",
        "sattig",
        "donnelly",
        "b",
        "eddon",
        "rychter",
        "calosi",
        "fano",
        "stated",
        "somewhat",
        "loosely",
        "mereological",
        "dispute",
        "following",
        "view",
        "mereological",
        "perdurance",
        "persisting",
        "material",
        "object",
        "object",
        "different",
        "temporal",
        "part",
        "different",
        "instant",
        "object",
        "exists",
        "mereological",
        "endurance",
        "persisting",
        "material",
        "object",
        "none",
        "different",
        "temporal",
        "part",
        "different",
        "instant",
        "career",
        "perhaps",
        "none",
        "instantaneous",
        "temporal",
        "partsor",
        "temporal",
        "part",
        "aside",
        "themselvesat",
        "frame",
        "locational",
        "dispute",
        "useful",
        "one",
        "piece",
        "terminology",
        "say",
        "path",
        "x",
        "fusion",
        "exact",
        "location",
        "x",
        "gilmore",
        "informally",
        "path",
        "object",
        "region",
        "object",
        "s",
        "complete",
        "career",
        "exactly",
        "located",
        "state",
        "locational",
        "dispute",
        "follows",
        "locational",
        "perdurance",
        "persisting",
        "material",
        "object",
        "exactly",
        "one",
        "exact",
        "locationits",
        "path",
        "locational",
        "endurance",
        "persisting",
        "material",
        "object",
        "many",
        "different",
        "exact",
        "location",
        "location",
        "instantaneous",
        "spacelike",
        "typically",
        "exact",
        "location",
        "count",
        "instantaneous",
        "temporal",
        "part",
        "object",
        "s",
        "path",
        "philosopher",
        "side",
        "dispute",
        "agree",
        "spacetime",
        "region",
        "path",
        "material",
        "object",
        "disagree",
        "spacetime",
        "region",
        "exact",
        "location",
        "object",
        "locational",
        "perdurantist",
        "say",
        "material",
        "object",
        "exactly",
        "located",
        "path",
        "locational",
        "endurantist",
        "say",
        "persisting",
        "material",
        "object",
        "exactly",
        "located",
        "many",
        "region",
        "slice",
        "path",
        "interaction",
        "two",
        "dispute",
        "persistence",
        "summarized",
        "figure",
        "gilmore",
        "figure",
        "locational",
        "endurance",
        "entail",
        "multilocation",
        "say",
        "material",
        "object",
        "exactly",
        "located",
        "many",
        "different",
        "region",
        "mereological",
        "endurance",
        "merely",
        "reject",
        "temporal",
        "part",
        "entail",
        "multilocation",
        "thus",
        "one",
        "might",
        "reject",
        "temporal",
        "part",
        "retaining",
        "functionality",
        "position",
        "parson",
        "corresponds",
        "lower",
        "lefthand",
        "box",
        "figure",
        "enduring",
        "trope",
        "whether",
        "one",
        "take",
        "material",
        "object",
        "multilocated",
        "manner",
        "locational",
        "endurantism",
        "one",
        "might",
        "hold",
        "view",
        "trope",
        "ehring",
        "b",
        "defends",
        "view",
        "trope",
        "endure",
        "though",
        "say",
        "whether",
        "take",
        "multilocated",
        "sense",
        "consider",
        "simple",
        "spatially",
        "unextended",
        "trope",
        "e",
        "suppose",
        "persists",
        "let",
        "temporally",
        "extended",
        "onedimensional",
        "spacetime",
        "region",
        "r",
        "e",
        "s",
        "path",
        "least",
        "two",
        "natural",
        "thing",
        "one",
        "could",
        "say",
        "regarding",
        "e",
        "s",
        "location",
        "one",
        "could",
        "say",
        "e",
        "one",
        "exact",
        "location",
        "r",
        "case",
        "e",
        "temporally",
        "extended",
        "simple",
        "multilocated",
        "alternatively",
        "one",
        "could",
        "say",
        "ii",
        "e",
        "exactly",
        "located",
        "point",
        "r",
        "nowhere",
        "else",
        "case",
        "e",
        "multilocated",
        "extended",
        "multilocated",
        "d",
        "worm",
        "hudson",
        "defends",
        "version",
        "mereological",
        "perdurantism",
        "according",
        "ordinary",
        "material",
        "object",
        "exactly",
        "located",
        "great",
        "many",
        "mostly",
        "overlapping",
        "fourdimensional",
        "spacetime",
        "region",
        "hudson",
        "offer",
        "view",
        "solution",
        "problem",
        "many",
        "among",
        "thing",
        "hudson",
        "also",
        "argues",
        "given",
        "view",
        "fundamental",
        "parthood",
        "relation",
        "taken",
        "threeplace",
        "relation",
        "holding",
        "two",
        "object",
        "region",
        "see",
        "gilmore",
        "donnelly",
        "discussion",
        "backward",
        "time",
        "traveler",
        "suppose",
        "suzy",
        "born",
        "time",
        "t",
        "dy",
        "year",
        "later",
        "time",
        "t",
        "time",
        "t",
        "fortyyearold",
        "suzy",
        "step",
        "time",
        "machine",
        "disappears",
        "reappearing",
        "time",
        "machine",
        "thin",
        "air",
        "many",
        "year",
        "earlier",
        "suzy",
        "enters",
        "nursery",
        "house",
        "raised",
        "t",
        "see",
        "oneyearold",
        "baby",
        "know",
        "character",
        "suzy",
        "originates",
        "vihvelin",
        "one",
        "endurantist",
        "one",
        "find",
        "natural",
        "describe",
        "situation",
        "involving",
        "multilocation",
        "space",
        "spacetime",
        "suzy",
        "exactly",
        "located",
        "ra",
        "region",
        "size",
        "shape",
        "adult",
        "baby",
        "suzy",
        "exactly",
        "located",
        "rb",
        "disjoint",
        "simultaneous",
        "region",
        "size",
        "shape",
        "baby",
        "suzybaby",
        "suzy",
        "hence",
        "single",
        "thing",
        "namely",
        "suzybaby",
        "suzy",
        "exactly",
        "located",
        "two",
        "different",
        "simultaneous",
        "region",
        "ra",
        "rb",
        "macbride",
        "keller",
        "nelson",
        "gilmore",
        "miller",
        "carroll",
        "kleinschmidt",
        "effingham",
        "hold",
        "even",
        "one",
        "reject",
        "talk",
        "region",
        "spacetime",
        "favor",
        "talk",
        "region",
        "space",
        "sure",
        "even",
        "endurantists",
        "deny",
        "situation",
        "involves",
        "multilocation",
        "accept",
        "mereological",
        "endurantism",
        "locational",
        "perdurantism",
        "say",
        "suzy",
        "temporal",
        "part",
        "still",
        "fourdimensional",
        "least",
        "following",
        "sense",
        "exactly",
        "located",
        "one",
        "region",
        "fourdimensional",
        "path",
        "parson",
        "one",
        "presentistone",
        "say",
        "present",
        "time",
        "content",
        "existone",
        "might",
        "say",
        "t",
        "suzy",
        "exactly",
        "located",
        "fusion",
        "ra",
        "rb",
        "either",
        "region",
        "markosian",
        "c",
        "however",
        "suzy",
        "exactly",
        "located",
        "sum",
        "ra",
        "rb",
        "t",
        "shaped",
        "like",
        "human",
        "t",
        "rather",
        "scattered",
        "object",
        "shaped",
        "like",
        "sum",
        "two",
        "human",
        "being",
        "might",
        "seem",
        "doubtful",
        "suzy",
        "exist",
        "time",
        "without",
        "even",
        "approximately",
        "humanshaped",
        "time",
        "would",
        "speak",
        "favor",
        "view",
        "suzy",
        "multilocated",
        "rather",
        "scattered",
        "t",
        "fission",
        "dainton",
        "argues",
        "person",
        "undergo",
        "fission",
        "roughly",
        "manner",
        "amoeba",
        "person",
        "would",
        "continue",
        "exist",
        "fission",
        "bilocated",
        "form",
        "would",
        "wholly",
        "present",
        "two",
        "different",
        "place",
        "view",
        "also",
        "discussed",
        "johnston",
        "dainton",
        "s",
        "view",
        "naturally",
        "understood",
        "involving",
        "multilocation",
        "either",
        "spacetime",
        "space",
        "time",
        "fission",
        "person",
        "exactly",
        "located",
        "two",
        "different",
        "region",
        "see",
        "gilmore",
        "objection",
        "dainton",
        "s",
        "view",
        "modal",
        "realism",
        "overlap",
        "mcdaniel",
        "develops",
        "version",
        "concrete",
        "modal",
        "realism",
        "posit",
        "multilocation",
        "dub",
        "view",
        "modal",
        "realism",
        "overlap",
        "mro",
        "like",
        "lewis",
        "s",
        "modal",
        "realism",
        "mro",
        "treat",
        "possible",
        "world",
        "concrete",
        "spatiotemporal",
        "entity",
        "hold",
        "spacetime",
        "region",
        "worldbound",
        "spacetime",
        "region",
        "part",
        "one",
        "world",
        "overlap",
        "spacetime",
        "region",
        "part",
        "another",
        "world",
        "unlike",
        "lewis",
        "s",
        "view",
        "however",
        "mro",
        "claim",
        "material",
        "object",
        "wholly",
        "present",
        "one",
        "world",
        "specifically",
        "mro",
        "entail",
        "multilocation",
        "say",
        "lewis",
        "philosopher",
        "world",
        "w",
        "plumber",
        "philosopher",
        "world",
        "w",
        "exactly",
        "located",
        "two",
        "region",
        "one",
        "part",
        "w",
        "another",
        "part",
        "w",
        "work",
        "music",
        "tillman",
        "develops",
        "view",
        "ontology",
        "musical",
        "work",
        "according",
        "beethoven",
        "s",
        "th",
        "symphony",
        "symphony",
        "opposed",
        "particular",
        "performance",
        "multilocated",
        "view",
        "work",
        "music",
        "exactly",
        "located",
        "spacetime",
        "region",
        "r",
        "performance",
        "work",
        "exactly",
        "located",
        "r",
        "combined",
        "fact",
        "relevant",
        "performance",
        "principle",
        "yield",
        "result",
        "beethoven",
        "s",
        "th",
        "exactly",
        "located",
        "spacetime",
        "region",
        "confined",
        "th",
        "century",
        "vienna",
        "also",
        "region",
        "confined",
        "th",
        "century",
        "new",
        "york",
        "multilocated",
        "tillman",
        "argues",
        "view",
        "preferable",
        "form",
        "musical",
        "materialism",
        "say",
        "whether",
        "preferable",
        "view",
        "work",
        "music",
        "abstract",
        "object",
        "spatiotemporal",
        "location",
        "god",
        "interpretation",
        "doctrine",
        "divine",
        "omnipresence",
        "entail",
        "god",
        "exactly",
        "located",
        "region",
        "space",
        "spacetime",
        "hudson",
        "inman",
        "relevance",
        "multilocation",
        "issue",
        "christian",
        "theology",
        "including",
        "real",
        "presence",
        "christ",
        "eucharist",
        "resurrection",
        "dead",
        "discussed",
        "pruss",
        "hudson",
        "baber",
        "effingham",
        "pickup",
        "additional",
        "argument",
        "favor",
        "multilocation",
        "see",
        "section",
        "supplementary",
        "document",
        "additional",
        "argument"
    ]
}