{
    "main_text": "Freedom in Respect of Willing\n6. Freedom in Respect of Willing\nThe fact that it makes no sense to suppose that the will itself is\nfree (or unfree) does not entail that there are no significant\nquestions to be asked about the relation between freedom and the\nwill. Indeed, Locke thinks that there are two such questions, and that\nthese are the questions that capture “what is meant, when it is\ndisputed, Whether the will be free” (E2–5 II.xxi.22:\n245). The first (discussed at E1–5 II.xxi.23–24) is whether\nagents (human beings, persons) are free with respect to\nwilling-one-way-or-another; more particularly, whether agents are\nable, if they so will, to avoid willing one way or the other with\nrespect to a proposed action. The second (discussed at E1–5 II.xxi.25)\nis whether agents are free with respect to\nwilling-a-particular-action. The majority of commentators think that\nLocke answers both of these questions negatively, at least in E1–4\n(see Chappell 1994, Lowe 1995, Jolley 1999, Glauser 2003, Stuart 2013,\nand Leisinger 2017), and some think that Locke then qualifies his\nanswer(s) in E2–5 in a way that potentially introduces inconsistency\ninto his moral psychology (e.g., Chappell 1994). Other commentators\nthink that Locke answers the first question negatively for most\nactions, but with one important qualification that is clarified and\nmade more explicit in E5, and that he answers the second question\npositively, all without falling into inconsistency (Rickless 2000;\nGarrett 2015). What follows is a summary of the interpretive\ncontroversies. In the rest of this Section, we focus on the first\nquestion. In the next, we focus on the second question.\nIn E1–4, Locke states his answer to the first question thus:\n[A] Man in respect of willing any\nAction in his power once proposed to his Thoughts cannot be\nfree. (E1–4 II.xxi.23: 245)\nHis argument for the necessity of having either a volition that\naction A occur or a volition that action A not occur,\nonce A has been proposed to one’s thoughts, is simple and\nclever: (1) Either A will occur or A will not occur; (2)\nIf A occurs, this will be the result of the agent having\nwilled A to occur; (3) If A does not occur, this will be\nthe result of the agent having willed A not to occur;\ntherefore, (4) The agent necessarily wills one way or the other with\nrespect to A’s occurrence (see Chappell 1994:\n105–106). It follows directly that “in respect of the act\nof willing, a Man is not free” (E1–4 II.xxi.23:\n245). For, first, “Willing, or Volition [is]\nan Action” (E1–5 II.xxi.23: 245—this because actions\ncomprise motions of the body and operations of mind, and volition is\none of the most important mental operations—E1–5 II.vi.2: 128),\nand, second, freedom with respect to action A, as Locke defines\nit, consists in (i) the power to do A if one wills to\ndo A and (ii) the power not to do A if one wills not to\ndo A. Thus, if an agent does not have the power to avoid\nwilling one way or the other with respect to A (even if the\nagent wills to avoid willing one way or the other with respect\nto A), then the agent is not free with respect to willing one\nway or the other with respect to A.\nIn his New Essays on Human Understanding (ready for\npublication in 1704, but not published then because that was the year\nof Locke’s death) Gottfried Leibniz famously questions premise\n(3) of this argument:\nI would have thought that one can suspend\none’s choice, and that this happens quite often, especially when\nother thoughts interrupt one’s deliberation. Thus, although it\nis necessary that the action about which one is deliberating must\nexist or not exist, it doesn’t follow at all that one\nnecessarily has to decide on its existence or non-existence. For its\nnon-existence could well come about in the absence of any decision.\n(Leibniz 1704 [1981]: 181)\nLeibniz’s worry is that, even if one is thinking about\nwhether or not to do A, it is often possible to postpone\nwilling whether to do A, and the non-occurrence of A\nmight well result from such postponement. Under these conditions, it\nwould be false to say that A’s non-occurrence results\nfrom any sort of volition that A not occur. Leibniz illustrates\nthe claim with an amusing reference to a case that the Areopagites\n(judges on the Areopagus, the highest court of appeals in Ancient\nAthens) were having trouble deciding, their solution (i.e., de\nfacto, but not de jure, acquittal) being to adjourn it\n“to a date in the distant future, giving themselves a hundred\nyears to think about it” (Leibniz 1704 [1981]: 181).\nIt is something of a concern, then, that Locke himself appears\ncommitted to agreeing with Leibniz’s criticism of his own\nargument, at least in E2–5. For in E2–5 (but not in E1) Locke\nemphasizes his acceptance of the doctrine of suspension, according to\nwhich any agent has the “power to suspend the execution\nand satisfaction of any of its desires”, during which time the\nwill is not yet “determined to action” (E2–5 II.xxi.47:\n263). That is, Locke acknowledges in E2–5, even as he does not remove\nor alter the argument of II.xxi.23 in E2–4, that it is possible to\npostpone willing with respect to whether to will one way or the other\nwith respect to some proposed action (see Chappell 1994:\n106–107).\nHowever, Locke makes changes in E5 that have suggested to some\ncommentators how he would avoid Leibniz’s criticism without\ngiving up the doctrine of suspension. Recall Locke’s answer to\nthe first question:\n[A] Man in respect of willing any Action in\nhis power once proposed to his Thoughts cannot be free. (E1–4\nII.xxi.23: 245)\nHere, now, is Locke’s restatement of\n his answer in E5:\n[A] Man in respect of willing, or the Act\nof Volition, when any Action in his power is once proposed to his\nThoughts, as presently to be done, cannot be free.  (E5\nII.xxi.23: 245—added material italicized)\nThe crucial addition here is the phrase\n“as presently to be done”. In E5, Locke is not saying that\nit is with respect to willing one way or the other with respect\nto any proposed action that an agent is not free: what he is\nsaying is that it is with respect to willing one way or the other with\nrespect to any proposed action as presently to be done that\nan agent is not free. Some actions that are proposed to us are to\noccur at the time of proposal: as I am singing, a friend\nmight propose that I stop singing right now. Other actions\nthat are proposed to us are to occur at a time later than the time\nof proposal: at the beginning of a long bicycle trip, a friend\nmight propose that we take a rest once we have reached our\ndestination. Locke is telling us in E5 that premise (3) is supposed to\napply to the former, not to the latter, sort of actions. If this is\nright, then it is no accident that Locke’s own illustration of\nthe argument of II.xxi.23 involves “a Man that is walking, to\nwhom it is proposed to give off walking” (E1–5 II.xxi.24:\n246). \nSo, as Locke incipiently recognizes as early as E1 but explicitly\nunderlines in E5, his initial answer to the first question is an\novergeneralization, and needs to be restricted to those actions that\nare proposed to us as presently to be done (see Rickless 2000:\n49–55; Glauser 2003: 710; Garrett 2015: 274–277). But it\nis also possible that Locke comes to recognize, and eventually\nunderline, a second restriction. At the moment, I am sitting in a\nchair.  In a few minutes, my children will walk in and propose that I\nget up and make dinner. I am busy, my mind is occupied, so I will\nlikely postpone (perhaps only for a few minutes) making a decision\nabout whether to get up. The result of such postponement is that I\nwill not get up right away, but this will not be because I\nhave willed not to get up right away. Again, it seems that\npremise (3) is false, for reasons similar to the ones described by\nLeibniz. But this time, the relevant action (getting up) is proposed\nas presently to be done. Locke’s E5 emendations do not\nexplicitly address this sort of example.\nHowever, in E2–5, but not in E1, Locke emphasizes the fact that in\nhis “walking man” example, the man either “continues\nthe Action [of walking], or puts an end to it” (E2–5 II.xxi.24:\n246). This suggests a different restriction, on top of the “as\npresently to be done” restriction. It may be that Locke is\nthinking that premise (3) applies, not to actions of all kinds, but\nonly to processes in which one is currently engaged.  The walking man\nis already in motion, constantly putting one leg in front of the\nother. When it is proposed to him that he give off walking, he has no\noption but to will one way or the other with respect to whether to\ngive off walking: if he stops walking, this will be because he willed\nthat his walking cease; and if he continues to walk, this will be\nbecause he willed that his walking continue. Either way, he must will\none way or the other with respect to whether to stop walking. By\ncontrast, when I am sitting in my chair, I am not engaged in a\nprocess: I am (or, at least, my body is) simply at rest. It is for\nthis reason that it is possible for me to avoid willing with respect\nto whether to get up right now: processes require volition to secure\ntheir continuation, but mere states (non-processes) do not (see\nRickless 2000: 49–55; for a contrary view, see Glauser 2003:\n710).\nLocke’s considered answer to the first question, then, is\nthis: (i) when an action that is a process in which the agent is\ncurrently engaged is proposed as presently to be continued or stopped,\nthe agent is not free with respect to willing one way or the other\nwith respect to its continuing, but (ii) when an action is not a\nprocess in which the agent is currently engaged or is proposed as to\nbe done sometime in the future, then it is possible for the agent to\nbe free with respect to willing one way or the other with respect to\nits performance or non-performance. Given that, as Locke puts it in\nE5, the vast majority of voluntary actions “that succeed one\nanother every moment that we are awake” (E5 II.xxi.24: 246) are\n(i)-actions rather than (ii)-actions, it makes sense for him to\nsummarize his answer to the first question as that it is “in\nmost cases [that] a Man is not at Liberty to forbear the act of\nvolition” (E5 II.xxi.56: 270). But, as Locke also emphasizes,\none has the ability, at least with respect to (ii)-actions, to suspend\nwilling. So there is no inconsistency at the heart of Locke’s\ntheory of freedom in respect of willing.\n\n",
    "section_title": "6. Freedom in Respect of Willing",
    "entry_title": "Locke On Freedom",
    "hierarchy_title": "Locke On Freedom || Freedom in Respect of Willing",
    "tokenized_text": [
        "freedom",
        "respect",
        "willing",
        "freedom",
        "respect",
        "willing",
        "fact",
        "make",
        "sense",
        "suppose",
        "free",
        "unfree",
        "entail",
        "significant",
        "question",
        "asked",
        "relation",
        "freedom",
        "indeed",
        "locke",
        "think",
        "two",
        "question",
        "question",
        "capture",
        "meant",
        "disputed",
        "whether",
        "free",
        "e",
        "iixxi",
        "first",
        "discussed",
        "e",
        "iixxi",
        "whether",
        "agent",
        "human",
        "being",
        "person",
        "free",
        "respect",
        "willingonewayoranother",
        "particularly",
        "whether",
        "agent",
        "able",
        "avoid",
        "willing",
        "one",
        "way",
        "respect",
        "proposed",
        "action",
        "second",
        "discussed",
        "e",
        "iixxi",
        "whether",
        "agent",
        "free",
        "respect",
        "willingaparticularaction",
        "majority",
        "commentator",
        "think",
        "locke",
        "answer",
        "question",
        "negatively",
        "least",
        "e",
        "see",
        "chappell",
        "lowe",
        "jolley",
        "glauser",
        "stuart",
        "leisinger",
        "think",
        "locke",
        "qualifies",
        "answer",
        "e",
        "way",
        "potentially",
        "introduces",
        "inconsistency",
        "moral",
        "psychology",
        "eg",
        "chappell",
        "commentator",
        "think",
        "locke",
        "answer",
        "first",
        "question",
        "negatively",
        "action",
        "one",
        "important",
        "qualification",
        "clarified",
        "made",
        "explicit",
        "e",
        "answer",
        "second",
        "question",
        "positively",
        "without",
        "falling",
        "inconsistency",
        "rickless",
        "garrett",
        "follows",
        "summary",
        "interpretive",
        "controversy",
        "rest",
        "section",
        "focus",
        "first",
        "question",
        "next",
        "focus",
        "second",
        "question",
        "e",
        "locke",
        "state",
        "answer",
        "first",
        "question",
        "thus",
        "man",
        "respect",
        "willing",
        "action",
        "power",
        "proposed",
        "thought",
        "free",
        "e",
        "iixxi",
        "argument",
        "necessity",
        "either",
        "volition",
        "action",
        "occur",
        "volition",
        "action",
        "occur",
        "proposed",
        "one",
        "thought",
        "simple",
        "clever",
        "either",
        "occur",
        "occur",
        "occurs",
        "result",
        "agent",
        "willed",
        "occur",
        "occur",
        "result",
        "agent",
        "willed",
        "occur",
        "therefore",
        "agent",
        "necessarily",
        "will",
        "one",
        "way",
        "respect",
        "occurrence",
        "see",
        "chappell",
        "follows",
        "directly",
        "respect",
        "act",
        "willing",
        "man",
        "free",
        "e",
        "iixxi",
        "first",
        "willing",
        "volition",
        "action",
        "e",
        "iixxi",
        "this",
        "action",
        "comprise",
        "motion",
        "body",
        "operation",
        "mind",
        "volition",
        "one",
        "important",
        "mental",
        "operationse",
        "iivi",
        "second",
        "freedom",
        "respect",
        "action",
        "locke",
        "defines",
        "consists",
        "power",
        "one",
        "will",
        "ii",
        "power",
        "one",
        "will",
        "a",
        "thus",
        "agent",
        "power",
        "avoid",
        "willing",
        "one",
        "way",
        "respect",
        "even",
        "agent",
        "will",
        "avoid",
        "willing",
        "one",
        "way",
        "respect",
        "agent",
        "free",
        "respect",
        "willing",
        "one",
        "way",
        "respect",
        "a",
        "new",
        "essay",
        "human",
        "understanding",
        "ready",
        "publication",
        "published",
        "year",
        "locke",
        "death",
        "gottfried",
        "leibniz",
        "famously",
        "question",
        "premise",
        "argument",
        "would",
        "thought",
        "one",
        "suspend",
        "one",
        "choice",
        "happens",
        "quite",
        "often",
        "especially",
        "thought",
        "interrupt",
        "one",
        "deliberation",
        "thus",
        "although",
        "necessary",
        "action",
        "one",
        "deliberating",
        "must",
        "exist",
        "exist",
        "follow",
        "one",
        "necessarily",
        "decide",
        "existence",
        "nonexistence",
        "nonexistence",
        "could",
        "well",
        "come",
        "absence",
        "decision",
        "leibniz",
        "leibniz",
        "worry",
        "even",
        "one",
        "thinking",
        "whether",
        "often",
        "possible",
        "postpone",
        "willing",
        "whether",
        "nonoccurrence",
        "might",
        "well",
        "result",
        "postponement",
        "condition",
        "would",
        "false",
        "say",
        "nonoccurrence",
        "result",
        "sort",
        "volition",
        "occur",
        "leibniz",
        "illustrates",
        "claim",
        "amusing",
        "reference",
        "case",
        "areopagite",
        "judge",
        "areopagus",
        "highest",
        "court",
        "appeal",
        "ancient",
        "athens",
        "trouble",
        "deciding",
        "solution",
        "ie",
        "de",
        "facto",
        "de",
        "jure",
        "acquittal",
        "adjourn",
        "date",
        "distant",
        "future",
        "giving",
        "hundred",
        "year",
        "think",
        "leibniz",
        "something",
        "concern",
        "locke",
        "appears",
        "committed",
        "agreeing",
        "leibniz",
        "criticism",
        "argument",
        "least",
        "e",
        "e",
        "e",
        "locke",
        "emphasizes",
        "acceptance",
        "doctrine",
        "suspension",
        "according",
        "agent",
        "power",
        "suspend",
        "execution",
        "satisfaction",
        "desire",
        "time",
        "yet",
        "determined",
        "action",
        "e",
        "iixxi",
        "locke",
        "acknowledges",
        "e",
        "even",
        "remove",
        "alter",
        "argument",
        "iixxi",
        "e",
        "possible",
        "postpone",
        "willing",
        "respect",
        "whether",
        "one",
        "way",
        "respect",
        "proposed",
        "action",
        "see",
        "chappell",
        "however",
        "locke",
        "make",
        "change",
        "e",
        "suggested",
        "commentator",
        "would",
        "avoid",
        "leibniz",
        "criticism",
        "without",
        "giving",
        "doctrine",
        "suspension",
        "recall",
        "locke",
        "answer",
        "first",
        "question",
        "man",
        "respect",
        "willing",
        "action",
        "power",
        "proposed",
        "thought",
        "free",
        "e",
        "iixxi",
        "locke",
        "restatement",
        "answer",
        "e",
        "man",
        "respect",
        "willing",
        "act",
        "volition",
        "action",
        "power",
        "proposed",
        "thought",
        "presently",
        "done",
        "free",
        "e",
        "iixxi",
        "added",
        "material",
        "italicized",
        "crucial",
        "addition",
        "phrase",
        "presently",
        "done",
        "e",
        "locke",
        "saying",
        "respect",
        "willing",
        "one",
        "way",
        "respect",
        "proposed",
        "action",
        "agent",
        "free",
        "saying",
        "respect",
        "willing",
        "one",
        "way",
        "respect",
        "proposed",
        "action",
        "presently",
        "done",
        "agent",
        "free",
        "action",
        "proposed",
        "u",
        "occur",
        "time",
        "proposal",
        "singing",
        "friend",
        "might",
        "propose",
        "stop",
        "singing",
        "right",
        "action",
        "proposed",
        "u",
        "occur",
        "time",
        "later",
        "time",
        "proposal",
        "beginning",
        "long",
        "bicycle",
        "trip",
        "friend",
        "might",
        "propose",
        "take",
        "rest",
        "reached",
        "destination",
        "locke",
        "telling",
        "u",
        "e",
        "premise",
        "supposed",
        "apply",
        "former",
        "latter",
        "sort",
        "action",
        "right",
        "accident",
        "locke",
        "illustration",
        "argument",
        "iixxi",
        "involves",
        "man",
        "walking",
        "proposed",
        "give",
        "walking",
        "e",
        "iixxi",
        "locke",
        "incipiently",
        "recognizes",
        "early",
        "e",
        "explicitly",
        "underline",
        "e",
        "initial",
        "answer",
        "first",
        "question",
        "overgeneralization",
        "need",
        "restricted",
        "action",
        "proposed",
        "u",
        "presently",
        "done",
        "see",
        "rickless",
        "glauser",
        "garrett",
        "also",
        "possible",
        "locke",
        "come",
        "recognize",
        "eventually",
        "underline",
        "second",
        "restriction",
        "moment",
        "sitting",
        "chair",
        "minute",
        "child",
        "walk",
        "propose",
        "get",
        "make",
        "dinner",
        "busy",
        "mind",
        "occupied",
        "likely",
        "postpone",
        "perhaps",
        "minute",
        "making",
        "decision",
        "whether",
        "get",
        "result",
        "postponement",
        "get",
        "right",
        "away",
        "willed",
        "get",
        "right",
        "away",
        "seems",
        "premise",
        "false",
        "reason",
        "similar",
        "one",
        "described",
        "leibniz",
        "time",
        "relevant",
        "action",
        "getting",
        "proposed",
        "presently",
        "done",
        "locke",
        "e",
        "emendation",
        "explicitly",
        "address",
        "sort",
        "example",
        "however",
        "e",
        "e",
        "locke",
        "emphasizes",
        "fact",
        "walking",
        "man",
        "example",
        "man",
        "either",
        "continues",
        "action",
        "walking",
        "put",
        "end",
        "e",
        "iixxi",
        "suggests",
        "different",
        "restriction",
        "top",
        "presently",
        "done",
        "restriction",
        "may",
        "locke",
        "thinking",
        "premise",
        "applies",
        "action",
        "kind",
        "process",
        "one",
        "currently",
        "engaged",
        "walking",
        "man",
        "already",
        "motion",
        "constantly",
        "putting",
        "one",
        "leg",
        "front",
        "proposed",
        "give",
        "walking",
        "option",
        "one",
        "way",
        "respect",
        "whether",
        "give",
        "walking",
        "stop",
        "walking",
        "willed",
        "walking",
        "cease",
        "continues",
        "walk",
        "willed",
        "walking",
        "continue",
        "either",
        "way",
        "must",
        "one",
        "way",
        "respect",
        "whether",
        "stop",
        "walking",
        "contrast",
        "sitting",
        "chair",
        "engaged",
        "process",
        "least",
        "body",
        "simply",
        "rest",
        "reason",
        "possible",
        "avoid",
        "willing",
        "respect",
        "whether",
        "get",
        "right",
        "process",
        "require",
        "volition",
        "secure",
        "continuation",
        "mere",
        "state",
        "nonprocesses",
        "see",
        "rickless",
        "contrary",
        "view",
        "see",
        "glauser",
        "locke",
        "considered",
        "answer",
        "first",
        "question",
        "action",
        "process",
        "agent",
        "currently",
        "engaged",
        "proposed",
        "presently",
        "continued",
        "stopped",
        "agent",
        "free",
        "respect",
        "willing",
        "one",
        "way",
        "respect",
        "continuing",
        "ii",
        "action",
        "process",
        "agent",
        "currently",
        "engaged",
        "proposed",
        "done",
        "sometime",
        "future",
        "possible",
        "agent",
        "free",
        "respect",
        "willing",
        "one",
        "way",
        "respect",
        "performance",
        "nonperformance",
        "given",
        "locke",
        "put",
        "e",
        "vast",
        "majority",
        "voluntary",
        "action",
        "succeed",
        "one",
        "another",
        "every",
        "moment",
        "awake",
        "e",
        "iixxi",
        "actions",
        "rather",
        "ii",
        "actions",
        "make",
        "sense",
        "summarize",
        "answer",
        "first",
        "question",
        "case",
        "man",
        "liberty",
        "forbear",
        "act",
        "volition",
        "e",
        "iixxi",
        "locke",
        "also",
        "emphasizes",
        "one",
        "ability",
        "least",
        "respect",
        "ii",
        "actions",
        "suspend",
        "willing",
        "inconsistency",
        "heart",
        "locke",
        "theory",
        "freedom",
        "respect",
        "willing"
    ]
}