{
    "main_text": "The Two Treatises Of Government || Rebellion and Regicide\n5. Locke and Religious Toleration\n\nThe issue of religious toleration was of widespread interest in Europe\nin the seventeenth century, largely because religious intolerance with\naccompanying violence was so pervasive. The Reformation had split\nEurope into competing religious camps, and this provoked civil wars\nand massive religious persecutions. John Marshall, in his massive study\nJohn Locke, Toleration and Early Enlightenment Culture notes\nthat the 1680s were the climactic decade for this kind of\npersecution. The Dutch Republic, where Locke spent years in exile, had\nbeen founded as a secular state which would allow religious\ndifferences. This was a reaction to the Catholic persecution of\nProtestants. However, once the Calvinist Church gained power, they\nbegan persecuting other sects, such as the Remonstrants, who disagreed\nwith them. Nonetheless, The Dutch Republic remained the most tolerant\ncountry in Europe. In France, religious conflict had been temporarily\nquieted by the edict of Nantes. But in 1685, the year in which Locke\nwrote the First Letter concerning religious toleration, Louis XIV had\nrevoked the Edict of Nantes, and the Huguenots were being persecuted.\nThough prohibited from doing so, some 200,000 emigrated, while\nprobably 700,000 were forced to convert to Catholicism. People in\nEngland were keenly aware of the events taking place in France.\n\nIn England itself, religious conflict dominated the seventeenth\ncentury, contributing in important respects to the coming of the\nEnglish Civil War, and the abolishing of the Anglican Church during\nthe Protectorate. After the Restoration of Charles II, Anglicans in\nparliament passed laws that repressed both Catholics and Protestant\nsects such as Presbyterians, Baptists, Quakers and Unitarians who did\nnot agree with the doctrines or practices of the state Church. Of\nthese various dissenting sects, some were closer to the Anglicans,\nothers more remote. One reason, among others, why King Charles may\nhave found Shaftesbury useful was that they were both concerned about\nreligious toleration. They parted when it became clear that the King\nwas mainly interested in toleration for Catholics, and Shaftesbury for\nProtestant dissenters.\n\nOne widely discussed strategy for reducing religious conflict in\nEngland was called comprehension. The idea was to reduce the doctrines\nand practices of the Anglican church to a minimum so that most, if not\nall, of the dissenting sects would be included in the state church.\nFor those which even this measure would not serve, there was to be\ntoleration. Toleration we may define as a lack of state persecution.\nNeither of these strategies made much progress during the course of\nthe Restoration.\n\nWhen Locke fled to Holland after the discovery of the Rye house plot,\nhe became involved with a group of scholars advocating religious\ntoleration. This group included Benjamin Furly, a quaker with whom\nLocke lived for a while, the noted philosopher Pierre Bayle, several\nDutch theologians, and many others. This group read all the arguments\nfor religious intolerance and discussed them in book and conversation\nclubs. Members of the group considered toleration not only for\nProtestants and Protestant dissenters but Jews, Moslems, and Catholics. A\nrecent discovery of a page of Locke’s reflections on toleration\nof Catholics shows that Locke considered even the pros and cons of\ntoleration for Catholics (Walmsley and Waldmann 2019). Some members\nof the group also wrote tolerationist articles and books. They helped\neach other get jobs. Some of their members founded journals that\nreviewed books and articles on religious, scientific, and other\ntopics. The group took the notion of free speech, civility, and\npoliteness in discourse seriously. They called themselves the\n‘the Republic of Letters’ or in Locke’s phrase\n‘the commonwealth of learning.’\n\nWhat were Locke’s religious views and where did he fit into the\ndebates about religious toleration? This is a quite difficult question\nto answer. Religion and Christianity in particular, is perhaps the\nmost important influence on the shape of Locke’s philosophy. But\nwhat kind of Christian was Locke? Locke’s family were Puritans.\nAt Oxford, Locke avoided becoming an Anglican priest. Still, Locke\nhimself claimed to be an Anglican until he died and Locke’s\nnineteenth-century biographer Fox Bourne thought that Locke was an\nAnglican. Others have identified him with the Latitudinarians—a\nmovement among Anglicans to argue for a reasonable Christianity that\ndissenters ought to accept. Still, there are some reasons to think\nthat Locke was neither an orthodox Anglican or a Latitudinarian. Locke\ngot Isaac Newton to write Newton’s most powerful\nanti-Trinitarian tract. Locke arranged to have the work published\nanonymously in Holland though in the end, Newton decided not to\npublish (McLachlan 1941). This strongly suggests that Locke too was by\nthis time an Arian or unitarian. (Arius, c. 250–336, asserted\nthe primacy of the Father over the Son and thus rejected the doctrine\nof the Trinity and was condemned as a heretic at the Council of Nicaea\nin 325. Newton held that the Church had gone in the wrong direction in\ncondemning Arius.) Given that one main theme of Locke’s\nLetter on Toleration is that there should be a separation\nbetween Church and State, this does not seem like the view of a man\ndevoted to a state religion. It might appear that Locke’s\nwriting The Reasonableness of Christianity in which he argues\nthat the basic doctrines of Christianity are few and compatible with\nreason make him a Latitudinarian. Yet Richard Ashcraft has argued that\ncomprehension for the Anglicans meant conforming to the existing\npractices of the Anglican Church; that is, the abandonment of\nreligious dissent. Ashcraft also suggests that Latitudinarians were\nthus not a moderate middle ground between contending extremes but part\nof one of the extremes—“the acceptable face of the\npersecution of religious dissent” (Ashcraft 1992: 155). Ashcraft\nholds that while the Latitudinarians may have represented the\n“rational theology” of the Anglican church, there was a\ncompeting dissenting “rational theology”. Thus, while it\nis true that Locke had Latitudinarian friends, given Ashcraft’s\ndistinction between Anglican and dissenting “rational\ntheologies”, it is entirely possible that The Reasonableness\nof Christianity is a work of dissenting “rational\ntheology”.\n\nLocke had been thinking, talking and writing about religious\ntoleration since 1659. His views evolved. In the early 1660s he very\nlikely was an orthodox Anglican. He and Shaftesbury had instituted\nreligious toleration in the Fundamental Constitutions of the\nCarolinas (1669). He wrote the Epistola de Tolerantia in\nLatin in 1685 while in exile in Holland. He very likely was seeing\nProtestant refugees pouring over the borders from France where Louis\nXIV had just revoked the Edict of Nantes. Holland itself was a\nCalvinist theocracy with significant problems with religious\ntoleration. But Locke’s Letter does not confine itself to the\nissues of the time. Locke gives a principled account of religious\ntoleration, though this is mixed in with arguments which apply only to\nChristians, and perhaps in some cases only to Protestants. He excluded\nboth Catholics and atheists from religious toleration. In the case of\nCatholics it was because he regarded them as agents of a foreign\npower. Because they do not believe in God, atheists, on Locke’s\naccount: “Promises, covenants and oaths, which are the bonds of\nhuman society, can have no hold upon an atheist” (Mendus 1991:\n47). He gives his general defense of religious toleration while\ncontinuing the anti-Papist rhetoric of the Country party which sought\nto exclude James II from the throne.\n\nLocke’s arguments for religious toleration connect nicely to his\naccount of civil government. Locke defines life, liberty, health and\nproperty as our civil interests. These are the proper concern of a\nmagistrate or civil government. The magistrate can use force and\nviolence where this is necessary to preserve civil interests against\nattack. This is the central function of the state. One’s\nreligious concerns with salvation, however, are not within the domain\nof civil interests, and so lie outside of the legitimate concern of\nthe magistrate or the civil government. In effect, Locke adds an\nadditional right to the natural rights of life, liberty, health and\nproperty—the right of freedom to choose one’s own road to\nsalvation. (See the section on\n Toleration\n in the entry on Locke’s Political Philosophy.)\n\nLocke holds that the use of force by the state to get people to hold\ncertain beliefs or engage in certain ceremonies or practices is\nillegitimate. The chief means which the magistrate has at her disposal\nis force, but force is not an effective means for changing or\nmaintaining belief. Suppose then, that the magistrate uses force so as\nto make people profess that they believe. Locke writes:\n\n\nA sweet religion, indeed, that obliges men to dissemble, and tell lies\nto both God and man, for the salvation of their souls! If the\nmagistrate thinks to save men thus, he seems to understand little of\nthe way of salvation; and if he does it not in order to save them, why\nis he so solicitous of the articles of faith as to enact them by a\nlaw? (Mendus 1991: 41)\n\n\nSo, religious persecution by the state is inappropriate. Locke holds\nthat “Whatever is lawful in the commonwealth cannot be\nprohibited by the magistrate in the church”. This means that the\nuse of bread and wine, or even the sacrificing of a calf could not be\nprohibited by the magistrate.\n\nIf there are competing churches, one might ask which one should have\nthe power? The answer is clearly that power should go to the true\nchurch and not to the heretical church. But Locke claims this amounts\nto saying nothing. For every church believes itself to be the true\nchurch, and there is no judge but God who can determine which of these\nclaims is correct. Thus, skepticism about the possibility of religious\nknowledge is central to Locke’s argument for religious\ntoleration.\n\nFinally, for an account of the influence of Locke’s works, see\nthe supplementary document:\n Supplement on the Influence of Locke’s Works\n\n",
    "section_title": "5. Locke and Religious Toleration",
    "entry_title": "John Locke",
    "hierarchy_title": "John Locke || The Two Treatises Of Government || Rebellion and Regicide",
    "tokenized_text": [
        "two",
        "treatise",
        "government",
        "rebellion",
        "regicide",
        "locke",
        "religious",
        "toleration",
        "issue",
        "religious",
        "toleration",
        "widespread",
        "interest",
        "europe",
        "seventeenth",
        "century",
        "largely",
        "religious",
        "intolerance",
        "accompanying",
        "violence",
        "pervasive",
        "reformation",
        "split",
        "europe",
        "competing",
        "religious",
        "camp",
        "provoked",
        "civil",
        "war",
        "massive",
        "religious",
        "persecution",
        "john",
        "marshall",
        "massive",
        "study",
        "john",
        "locke",
        "toleration",
        "early",
        "enlightenment",
        "culture",
        "note",
        "s",
        "climactic",
        "decade",
        "kind",
        "persecution",
        "dutch",
        "republic",
        "locke",
        "spent",
        "year",
        "exile",
        "founded",
        "secular",
        "state",
        "would",
        "allow",
        "religious",
        "difference",
        "reaction",
        "catholic",
        "persecution",
        "protestant",
        "however",
        "calvinist",
        "church",
        "gained",
        "power",
        "began",
        "persecuting",
        "sect",
        "remonstrants",
        "disagreed",
        "nonetheless",
        "dutch",
        "republic",
        "remained",
        "tolerant",
        "country",
        "europe",
        "france",
        "religious",
        "conflict",
        "temporarily",
        "quieted",
        "edict",
        "nantes",
        "year",
        "locke",
        "wrote",
        "first",
        "letter",
        "concerning",
        "religious",
        "toleration",
        "louis",
        "xiv",
        "revoked",
        "edict",
        "nantes",
        "huguenot",
        "persecuted",
        "though",
        "prohibited",
        "emigrated",
        "probably",
        "forced",
        "convert",
        "catholicism",
        "people",
        "england",
        "keenly",
        "aware",
        "event",
        "taking",
        "place",
        "france",
        "england",
        "religious",
        "conflict",
        "dominated",
        "seventeenth",
        "century",
        "contributing",
        "important",
        "respect",
        "coming",
        "english",
        "civil",
        "war",
        "abolishing",
        "anglican",
        "church",
        "protectorate",
        "restoration",
        "charles",
        "ii",
        "anglican",
        "parliament",
        "passed",
        "law",
        "repressed",
        "catholic",
        "protestant",
        "sect",
        "presbyterian",
        "baptist",
        "quaker",
        "unitarian",
        "agree",
        "doctrine",
        "practice",
        "state",
        "church",
        "various",
        "dissenting",
        "sect",
        "closer",
        "anglican",
        "others",
        "remote",
        "one",
        "reason",
        "among",
        "others",
        "king",
        "charles",
        "may",
        "found",
        "shaftesbury",
        "useful",
        "concerned",
        "religious",
        "toleration",
        "parted",
        "became",
        "clear",
        "king",
        "mainly",
        "interested",
        "toleration",
        "catholic",
        "shaftesbury",
        "protestant",
        "dissenter",
        "one",
        "widely",
        "discussed",
        "strategy",
        "reducing",
        "religious",
        "conflict",
        "england",
        "called",
        "comprehension",
        "idea",
        "reduce",
        "doctrine",
        "practice",
        "anglican",
        "church",
        "minimum",
        "dissenting",
        "sect",
        "would",
        "included",
        "state",
        "church",
        "even",
        "measure",
        "would",
        "serve",
        "toleration",
        "toleration",
        "may",
        "define",
        "lack",
        "state",
        "persecution",
        "neither",
        "strategy",
        "made",
        "much",
        "progress",
        "course",
        "restoration",
        "locke",
        "fled",
        "holland",
        "discovery",
        "rye",
        "house",
        "plot",
        "became",
        "involved",
        "group",
        "scholar",
        "advocating",
        "religious",
        "toleration",
        "group",
        "included",
        "benjamin",
        "furly",
        "quaker",
        "locke",
        "lived",
        "noted",
        "philosopher",
        "pierre",
        "bayle",
        "several",
        "dutch",
        "theologian",
        "many",
        "others",
        "group",
        "read",
        "argument",
        "religious",
        "intolerance",
        "discussed",
        "book",
        "conversation",
        "club",
        "member",
        "group",
        "considered",
        "toleration",
        "protestant",
        "protestant",
        "dissenter",
        "jew",
        "moslem",
        "catholic",
        "recent",
        "discovery",
        "page",
        "locke",
        "reflection",
        "toleration",
        "catholic",
        "show",
        "locke",
        "considered",
        "even",
        "pro",
        "con",
        "toleration",
        "catholic",
        "walmsley",
        "waldmann",
        "member",
        "group",
        "also",
        "wrote",
        "tolerationist",
        "article",
        "book",
        "helped",
        "get",
        "job",
        "member",
        "founded",
        "journal",
        "reviewed",
        "book",
        "article",
        "religious",
        "scientific",
        "topic",
        "group",
        "took",
        "notion",
        "free",
        "speech",
        "civility",
        "politeness",
        "discourse",
        "seriously",
        "called",
        "republic",
        "letter",
        "locke",
        "phrase",
        "commonwealth",
        "learning",
        "locke",
        "religious",
        "view",
        "fit",
        "debate",
        "religious",
        "toleration",
        "quite",
        "difficult",
        "question",
        "answer",
        "religion",
        "christianity",
        "particular",
        "perhaps",
        "important",
        "influence",
        "shape",
        "locke",
        "philosophy",
        "kind",
        "christian",
        "locke",
        "locke",
        "family",
        "puritan",
        "oxford",
        "locke",
        "avoided",
        "becoming",
        "anglican",
        "priest",
        "still",
        "locke",
        "claimed",
        "anglican",
        "died",
        "locke",
        "nineteenthcentury",
        "biographer",
        "fox",
        "bourne",
        "thought",
        "locke",
        "anglican",
        "others",
        "identified",
        "latitudinariansa",
        "movement",
        "among",
        "anglican",
        "argue",
        "reasonable",
        "christianity",
        "dissenter",
        "ought",
        "accept",
        "still",
        "reason",
        "think",
        "locke",
        "neither",
        "orthodox",
        "anglican",
        "latitudinarian",
        "locke",
        "got",
        "isaac",
        "newton",
        "write",
        "newton",
        "powerful",
        "antitrinitarian",
        "tract",
        "locke",
        "arranged",
        "work",
        "published",
        "anonymously",
        "holland",
        "though",
        "end",
        "newton",
        "decided",
        "publish",
        "mclachlan",
        "strongly",
        "suggests",
        "locke",
        "time",
        "arian",
        "unitarian",
        "arius",
        "c",
        "asserted",
        "primacy",
        "father",
        "son",
        "thus",
        "rejected",
        "doctrine",
        "trinity",
        "condemned",
        "heretic",
        "council",
        "nicaea",
        "newton",
        "held",
        "church",
        "gone",
        "wrong",
        "direction",
        "condemning",
        "arius",
        "given",
        "one",
        "main",
        "theme",
        "locke",
        "letter",
        "toleration",
        "separation",
        "church",
        "state",
        "seem",
        "like",
        "view",
        "man",
        "devoted",
        "state",
        "religion",
        "might",
        "appear",
        "locke",
        "writing",
        "reasonableness",
        "christianity",
        "argues",
        "basic",
        "doctrine",
        "christianity",
        "compatible",
        "reason",
        "make",
        "latitudinarian",
        "yet",
        "richard",
        "ashcraft",
        "argued",
        "comprehension",
        "anglican",
        "meant",
        "conforming",
        "existing",
        "practice",
        "anglican",
        "church",
        "abandonment",
        "religious",
        "dissent",
        "ashcraft",
        "also",
        "suggests",
        "latitudinarian",
        "thus",
        "moderate",
        "middle",
        "ground",
        "contending",
        "extreme",
        "part",
        "one",
        "extremes",
        "acceptable",
        "face",
        "persecution",
        "religious",
        "dissent",
        "ashcraft",
        "ashcraft",
        "hold",
        "latitudinarian",
        "may",
        "represented",
        "rational",
        "theology",
        "anglican",
        "church",
        "competing",
        "dissenting",
        "rational",
        "theology",
        "thus",
        "true",
        "locke",
        "latitudinarian",
        "friend",
        "given",
        "ashcraft",
        "distinction",
        "anglican",
        "dissenting",
        "rational",
        "theology",
        "entirely",
        "possible",
        "reasonableness",
        "christianity",
        "work",
        "dissenting",
        "rational",
        "theology",
        "locke",
        "thinking",
        "talking",
        "writing",
        "religious",
        "toleration",
        "since",
        "view",
        "evolved",
        "early",
        "s",
        "likely",
        "orthodox",
        "anglican",
        "shaftesbury",
        "instituted",
        "religious",
        "toleration",
        "fundamental",
        "constitution",
        "carolina",
        "wrote",
        "epistola",
        "de",
        "tolerantia",
        "latin",
        "exile",
        "holland",
        "likely",
        "seeing",
        "protestant",
        "refugee",
        "pouring",
        "border",
        "france",
        "louis",
        "xiv",
        "revoked",
        "edict",
        "nantes",
        "holland",
        "calvinist",
        "theocracy",
        "significant",
        "problem",
        "religious",
        "toleration",
        "locke",
        "letter",
        "confine",
        "issue",
        "time",
        "locke",
        "give",
        "principled",
        "account",
        "religious",
        "toleration",
        "though",
        "mixed",
        "argument",
        "apply",
        "christian",
        "perhaps",
        "case",
        "protestant",
        "excluded",
        "catholic",
        "atheist",
        "religious",
        "toleration",
        "case",
        "catholic",
        "regarded",
        "agent",
        "foreign",
        "power",
        "believe",
        "god",
        "atheist",
        "locke",
        "account",
        "promise",
        "covenant",
        "oath",
        "bond",
        "human",
        "society",
        "hold",
        "upon",
        "atheist",
        "mendus",
        "give",
        "general",
        "defense",
        "religious",
        "toleration",
        "continuing",
        "antipapist",
        "rhetoric",
        "country",
        "party",
        "sought",
        "exclude",
        "james",
        "ii",
        "throne",
        "locke",
        "argument",
        "religious",
        "toleration",
        "connect",
        "nicely",
        "account",
        "civil",
        "government",
        "locke",
        "defines",
        "life",
        "liberty",
        "health",
        "property",
        "civil",
        "interest",
        "proper",
        "concern",
        "magistrate",
        "civil",
        "government",
        "magistrate",
        "use",
        "force",
        "violence",
        "necessary",
        "preserve",
        "civil",
        "interest",
        "attack",
        "central",
        "function",
        "state",
        "one",
        "religious",
        "concern",
        "salvation",
        "however",
        "within",
        "domain",
        "civil",
        "interest",
        "lie",
        "outside",
        "legitimate",
        "concern",
        "magistrate",
        "civil",
        "government",
        "effect",
        "locke",
        "add",
        "additional",
        "right",
        "natural",
        "right",
        "life",
        "liberty",
        "health",
        "propertythe",
        "right",
        "freedom",
        "choose",
        "one",
        "road",
        "salvation",
        "see",
        "section",
        "toleration",
        "entry",
        "locke",
        "political",
        "philosophy",
        "locke",
        "hold",
        "use",
        "force",
        "state",
        "get",
        "people",
        "hold",
        "certain",
        "belief",
        "engage",
        "certain",
        "ceremony",
        "practice",
        "illegitimate",
        "chief",
        "mean",
        "magistrate",
        "disposal",
        "force",
        "force",
        "effective",
        "mean",
        "changing",
        "maintaining",
        "belief",
        "suppose",
        "magistrate",
        "us",
        "force",
        "make",
        "people",
        "profess",
        "believe",
        "locke",
        "writes",
        "sweet",
        "religion",
        "indeed",
        "obliges",
        "men",
        "dissemble",
        "tell",
        "lie",
        "god",
        "man",
        "salvation",
        "soul",
        "magistrate",
        "think",
        "save",
        "men",
        "thus",
        "seems",
        "understand",
        "little",
        "way",
        "salvation",
        "order",
        "save",
        "solicitous",
        "article",
        "faith",
        "enact",
        "law",
        "mendus",
        "religious",
        "persecution",
        "state",
        "inappropriate",
        "locke",
        "hold",
        "whatever",
        "lawful",
        "commonwealth",
        "prohibited",
        "magistrate",
        "church",
        "mean",
        "use",
        "bread",
        "wine",
        "even",
        "sacrificing",
        "calf",
        "could",
        "prohibited",
        "magistrate",
        "competing",
        "church",
        "one",
        "might",
        "ask",
        "one",
        "power",
        "answer",
        "clearly",
        "power",
        "go",
        "true",
        "church",
        "heretical",
        "church",
        "locke",
        "claim",
        "amount",
        "saying",
        "nothing",
        "every",
        "church",
        "belief",
        "true",
        "church",
        "judge",
        "god",
        "determine",
        "claim",
        "correct",
        "thus",
        "skepticism",
        "possibility",
        "religious",
        "knowledge",
        "central",
        "locke",
        "argument",
        "religious",
        "toleration",
        "finally",
        "account",
        "influence",
        "locke",
        "work",
        "see",
        "supplementary",
        "document",
        "supplement",
        "influence",
        "locke",
        "work"
    ]
}