{
    "main_text": "Introduction || The puzzle of Locke’s moral philosophy\n1.1 The puzzle of Locke’s moral philosophy\n\nThere are two main stumbling blocks to the study of Locke’s moral\nphilosophy. The first regards the singular lack of attention the\nsubject receives in Locke’s most important and influential published\nworks; not only did Locke never publish a work devoted to moral\nphilosophy, but he dedicates little space to its discussion in the\nworks he did publish. The traditional moral concept of natural law\narises in Locke’s Two Treatises of Government (1690) serving\nas a major plank in his argument regarding the basis for civil law and\nthe protection of individual liberty, but he does not go into any\ndetail regarding how we come to know natural law nor how we might be\nobligated, or even motivated, to obey it. In his Essay Concerning\nHuman Understanding (first edition 1690; fourth edition 1700,\nhereafter referred to as the Essay) Locke spends little time\ndiscussing morality, and what he does provide in the way of a moral\nepistemology seems underdeveloped, offering, at best, the suggestion\nof what a moral system might look like rather than a fully-realized\npositive moral position. This brings us to the second major stumbling\nblock: What Locke does provide us by way of moral theory in these\nworks is diffuse, with the air of being what J.B. Schneewind has\ncharacterized as “brief, scattered and sometimes puzzling”\n(Schneewind 1994, 200). This is not to suggest that Locke says nothing\nspecific or concrete about morality. Locke makes references,\nthroughout his works, to morality and moral obligation. However, two\nquite distinct positions on morality seem to emerge from Locke’s works\nand it is this dichotomous aspect of Locke’s view that has generated\nthe greatest degree of controversy. The first is a natural\nlaw position, which Locke refers to in the Essay, but\nwhich finds its clearest articulation in an early work from the 1660s,\nentitled Essays on the Law of Nature. In this work, we find\nLocke espousing a fairly traditional rationalistic natural law\nposition, which consists broadly in the following three propositions:\nfirst, that moral rules are founded on divine, universal and absolute\nlaws; second, that these divine moral laws are discernible by human\nreason; and third, that by dint of their divine authorship these rules\nare obligatory and rationally discernible as such. On the other hand,\nLocke also espouses a hedonistic moral theory, in evidence in his\nearly work, but developed most fully in the Essay. This\nlatter view holds that all goods and evils reduce to specific kinds of\npleasures and pains. The emphasis here is on sanctions, and how\nrewards and punishments serve to provide morality with its normative\nforce. Both elements find their way into Locke’s published works, and,\nas a result, Locke seems to be holding what seem to be incommensurable\nviews. The trick for Locke scholars has been to figure out how, or\neven if, they can be made to cohere. The question is not easily\nsettled by looking to Locke’s unpublished works, either, since Locke\nalso seems to hold a natural law view at some times and a hedonistic\nview at others.\n\nOne might conclude, with J.B. Schneewind, among others, that Locke’s\nattempts at constructing a morality were unsuccessful. Schneewind does\nnot mince words when he writes the following: “Locke’s failures\nare sometimes as significant as his successes. His views on morality\nare a case in point” (Schneewind 1994, 199). Schneewind argues\nthat the two strands of Locke’s moral theory are irreconcilable, and\nthat this is a fact Locke must have realized. This view is indeed an\napt representation of the frustration many readers have felt with\nLocke’s moral theory. Locke’s eighteenth-century apologist, Catharine\nTrotter Cockburn thought Locke provided a promising, but incomplete,\nstarting point for a positive moral system, imploring, in her work\n“A Defense of Mr. Locke’s Essay of Human\nUnderstanding,”\n\nI wish, Sir, you may only find it enough worth your notice, to incite\nyou to show the world, how far it falls short of doing justice to your\nprinciples; which you may do without interrupting the great business\nof your life, by a work, that will be an universal benefit, and which\nyou have given the world some right to exact of you. Who is there so\ncapable of pursuing to a demonstration those reflections on\nthe grounds of morality, which you have already made?\n(Cockburn 1702, 36)\n\n\nLocke’s friend William Molyneux similarly implored Locke to make good\non the promise found in the Essay. In a letter written to\nLocke on September 16th, 1693, Molyneux presses Locke to\nwork on a moral treatise once he has finished editing the second\nedition of his Essay, writing as follows:\n\nI am very sensible how closely you are engaged, till you have\ndischarged this Work off your Hands; and therefore will not venture,\ntill it be over, to press you again to what you have promis’d in the\nBusiness of Man’s Life, Morality. (Locke 1742, 53)\n\n\nSeveral months later, in December of the same year, Molyneux concludes\na letter by asking Locke about what other projects he currently has on\nthe go “amongst which, I hope you will not forget your\nThoughts on Morality” (Locke 1742, 54).\n\nLocke never did produce such a work, and we might well wonder if he\nhimself ever considered the project a “failure”. There is\nno doubt that morality was of central importance to Locke, a fact we\ncan discern from the Essay itself; there are two important\nfeatures of the Essay that serve to enlighten us regarding\nthe significance of this work in the development of Locke’s moral\nviews. First of all, morality seems to have inspired Locke to write\nthe Essay in the first place. In recounting his original\ninclination to embark on the project, he recalls a discussion with\n“five or six friends”, at which they discoursed “on\na Subject very remote from this” (Locke 1700, 7). According to\nLocke, the discussion eventually hit a standstill, at which point it\nwas agreed that in order to settle the issue at hand it would first be\nnecessary to, as Locke puts it, “examine our own Abilities, and\nsee, what Objects our Understandings were, or were not fitted to deal\nwith” (Locke 1700, 7). This was, he explains, his first entrance\ninto the problems that inspired the Essay itself. But, what\nis most interesting for our purposes is just what the remote subject\nwas that first got Locke and his friends thinking about fundamental\nquestions of epistemology. James Tyrell, one of those who attended\nthat evening, is a source of enlightenment on this matter—he\nlater recalled that the discussion concerned morality and revealed\nreligion. But, Locke himself refers to the subjects they discussed\nthat fateful evening as ‘very remote’ from the matters of\nthe Essay. That may well be, but it is also true that Locke,\nin the Essay, identifies morality as a central feature of\nhuman intellectual and practical life, which brings us to the second\nimportant fact about Locke’s view of morality. Locke writes, in the\nEssay, that “Morality is the proper Science, and\nBusiness of Mankind in general” (Essay, 4.12.11; these\nnumber are, book, chapter and section, respectively, from Locke’s\nEssay). For a book aiming to set out the limits and extent of\nhuman knowledge, this comes as no small claim. We must, Locke writes,\n“know our own Strength” (Essay, 1.1.6)\nand turn our attention to those areas in which we can have certainty,\ni.e., “those [things] which concern our Conduct”\n(Essay, 1.1.6). The amount of attention given to the question\nof morality itself would seem to belie its primacy for Locke. The\nEssay is certainly not intended as a work of moral\nphilosophy; it is a work of epistemology, laying the foundations for\nknowledge. However, a very big part of the programme involves\nidentifying what true knowledge is and what it is we as humans can\nhave knowledge about, and morality is accorded a distinctive and\nfairly exclusive status in Locke’s epistemology as one of “the\nSciences capable of Demonstration” (Essay, 4.3.18). The\nonly other area of inquiry accorded this status is mathematics;\nclearly, for Locke, morality represents a unique and defining aspect\nof what it means to be human. We have to conclude, then, that the\nEssay is strongly motivated by an interest in establishing\nthe groundwork for moral reasoning. However, while morality clearly\nhas a position of the highest regard in his epistemological system,\nhis promise of a demonstrable moral science is never realized here, or\nin later works.\n\nIt seems we can safely say that the subject of morality was a weighty\none for Locke. However, just what Locke takes morality to involve is\nsubstantially more complicated an issue. There are two broad lines of\ninterpretation of Locke’s moral views, which I will briefly outline\nhere.\n",
    "section_title": "1.1 The puzzle of Locke’s moral philosophy",
    "entry_title": "Locke’s Moral Philosophy",
    "hierarchy_title": "Locke’s Moral Philosophy || Introduction || The puzzle of Locke’s moral philosophy",
    "tokenized_text": [
        "introduction",
        "puzzle",
        "locke",
        "moral",
        "philosophy",
        "puzzle",
        "locke",
        "moral",
        "philosophy",
        "two",
        "main",
        "stumbling",
        "block",
        "study",
        "locke",
        "moral",
        "philosophy",
        "first",
        "regard",
        "singular",
        "lack",
        "attention",
        "subject",
        "receives",
        "locke",
        "important",
        "influential",
        "published",
        "work",
        "locke",
        "never",
        "publish",
        "work",
        "devoted",
        "moral",
        "philosophy",
        "dedicates",
        "little",
        "space",
        "discussion",
        "work",
        "publish",
        "traditional",
        "moral",
        "concept",
        "natural",
        "law",
        "arises",
        "locke",
        "two",
        "treatise",
        "government",
        "serving",
        "major",
        "plank",
        "argument",
        "regarding",
        "basis",
        "civil",
        "law",
        "protection",
        "individual",
        "liberty",
        "go",
        "detail",
        "regarding",
        "come",
        "know",
        "natural",
        "law",
        "might",
        "obligated",
        "even",
        "motivated",
        "obey",
        "essay",
        "concerning",
        "human",
        "understanding",
        "first",
        "edition",
        "fourth",
        "edition",
        "hereafter",
        "referred",
        "essay",
        "locke",
        "spends",
        "little",
        "time",
        "discussing",
        "morality",
        "provide",
        "way",
        "moral",
        "epistemology",
        "seems",
        "underdeveloped",
        "offering",
        "best",
        "suggestion",
        "moral",
        "system",
        "might",
        "look",
        "like",
        "rather",
        "fullyrealized",
        "positive",
        "moral",
        "position",
        "brings",
        "u",
        "second",
        "major",
        "stumbling",
        "block",
        "locke",
        "provide",
        "u",
        "way",
        "moral",
        "theory",
        "work",
        "diffuse",
        "air",
        "jb",
        "schneewind",
        "characterized",
        "brief",
        "scattered",
        "sometimes",
        "puzzling",
        "schneewind",
        "suggest",
        "locke",
        "say",
        "nothing",
        "specific",
        "concrete",
        "morality",
        "locke",
        "make",
        "reference",
        "throughout",
        "work",
        "morality",
        "moral",
        "obligation",
        "however",
        "two",
        "quite",
        "distinct",
        "position",
        "morality",
        "seem",
        "emerge",
        "locke",
        "work",
        "dichotomous",
        "aspect",
        "locke",
        "view",
        "generated",
        "greatest",
        "degree",
        "controversy",
        "first",
        "natural",
        "law",
        "position",
        "locke",
        "refers",
        "essay",
        "find",
        "clearest",
        "articulation",
        "early",
        "work",
        "s",
        "entitled",
        "essay",
        "law",
        "nature",
        "work",
        "find",
        "locke",
        "espousing",
        "fairly",
        "traditional",
        "rationalistic",
        "natural",
        "law",
        "position",
        "consists",
        "broadly",
        "following",
        "three",
        "proposition",
        "first",
        "moral",
        "rule",
        "founded",
        "divine",
        "universal",
        "absolute",
        "law",
        "second",
        "divine",
        "moral",
        "law",
        "discernible",
        "human",
        "reason",
        "third",
        "dint",
        "divine",
        "authorship",
        "rule",
        "obligatory",
        "rationally",
        "discernible",
        "hand",
        "locke",
        "also",
        "espouses",
        "hedonistic",
        "moral",
        "theory",
        "evidence",
        "early",
        "work",
        "developed",
        "fully",
        "essay",
        "latter",
        "view",
        "hold",
        "good",
        "evil",
        "reduce",
        "specific",
        "kind",
        "pleasure",
        "pain",
        "emphasis",
        "sanction",
        "reward",
        "punishment",
        "serve",
        "provide",
        "morality",
        "normative",
        "force",
        "element",
        "find",
        "way",
        "locke",
        "published",
        "work",
        "result",
        "locke",
        "seems",
        "holding",
        "seem",
        "incommensurable",
        "view",
        "trick",
        "locke",
        "scholar",
        "figure",
        "even",
        "made",
        "cohere",
        "question",
        "easily",
        "settled",
        "looking",
        "locke",
        "unpublished",
        "work",
        "either",
        "since",
        "locke",
        "also",
        "seems",
        "hold",
        "natural",
        "law",
        "view",
        "time",
        "hedonistic",
        "view",
        "others",
        "one",
        "might",
        "conclude",
        "jb",
        "schneewind",
        "among",
        "others",
        "locke",
        "attempt",
        "constructing",
        "morality",
        "unsuccessful",
        "schneewind",
        "mince",
        "word",
        "writes",
        "following",
        "locke",
        "failure",
        "sometimes",
        "significant",
        "success",
        "view",
        "morality",
        "case",
        "point",
        "schneewind",
        "schneewind",
        "argues",
        "two",
        "strand",
        "locke",
        "moral",
        "theory",
        "irreconcilable",
        "fact",
        "locke",
        "must",
        "realized",
        "view",
        "indeed",
        "apt",
        "representation",
        "frustration",
        "many",
        "reader",
        "felt",
        "locke",
        "moral",
        "theory",
        "locke",
        "eighteenthcentury",
        "apologist",
        "catharine",
        "trotter",
        "cockburn",
        "thought",
        "locke",
        "provided",
        "promising",
        "incomplete",
        "starting",
        "point",
        "positive",
        "moral",
        "system",
        "imploring",
        "work",
        "defense",
        "mr",
        "locke",
        "essay",
        "human",
        "understanding",
        "wish",
        "sir",
        "may",
        "find",
        "enough",
        "worth",
        "notice",
        "incite",
        "show",
        "world",
        "far",
        "fall",
        "short",
        "justice",
        "principle",
        "may",
        "without",
        "interrupting",
        "great",
        "business",
        "life",
        "work",
        "universal",
        "benefit",
        "given",
        "world",
        "right",
        "exact",
        "capable",
        "pursuing",
        "demonstration",
        "reflection",
        "ground",
        "morality",
        "already",
        "made",
        "cockburn",
        "locke",
        "friend",
        "william",
        "molyneux",
        "similarly",
        "implored",
        "locke",
        "make",
        "good",
        "promise",
        "found",
        "essay",
        "letter",
        "written",
        "locke",
        "september",
        "th",
        "molyneux",
        "press",
        "locke",
        "work",
        "moral",
        "treatise",
        "finished",
        "editing",
        "second",
        "edition",
        "essay",
        "writing",
        "follows",
        "sensible",
        "closely",
        "engaged",
        "till",
        "discharged",
        "work",
        "hand",
        "therefore",
        "venture",
        "till",
        "press",
        "promis",
        "business",
        "man",
        "life",
        "morality",
        "locke",
        "several",
        "month",
        "later",
        "december",
        "year",
        "molyneux",
        "concludes",
        "letter",
        "asking",
        "locke",
        "project",
        "currently",
        "go",
        "amongst",
        "hope",
        "forget",
        "thought",
        "morality",
        "locke",
        "locke",
        "never",
        "produce",
        "work",
        "might",
        "well",
        "wonder",
        "ever",
        "considered",
        "project",
        "failure",
        "doubt",
        "morality",
        "central",
        "importance",
        "locke",
        "fact",
        "discern",
        "essay",
        "two",
        "important",
        "feature",
        "essay",
        "serve",
        "enlighten",
        "u",
        "regarding",
        "significance",
        "work",
        "development",
        "locke",
        "moral",
        "view",
        "first",
        "morality",
        "seems",
        "inspired",
        "locke",
        "write",
        "essay",
        "first",
        "place",
        "recounting",
        "original",
        "inclination",
        "embark",
        "project",
        "recall",
        "discussion",
        "five",
        "six",
        "friend",
        "discoursed",
        "subject",
        "remote",
        "locke",
        "according",
        "locke",
        "discussion",
        "eventually",
        "hit",
        "standstill",
        "point",
        "agreed",
        "order",
        "settle",
        "issue",
        "hand",
        "would",
        "first",
        "necessary",
        "locke",
        "put",
        "examine",
        "ability",
        "see",
        "object",
        "understanding",
        "fitted",
        "deal",
        "locke",
        "explains",
        "first",
        "entrance",
        "problem",
        "inspired",
        "essay",
        "interesting",
        "purpose",
        "remote",
        "subject",
        "first",
        "got",
        "locke",
        "friend",
        "thinking",
        "fundamental",
        "question",
        "epistemology",
        "james",
        "tyrell",
        "one",
        "attended",
        "evening",
        "source",
        "enlightenment",
        "matterhe",
        "later",
        "recalled",
        "discussion",
        "concerned",
        "morality",
        "revealed",
        "religion",
        "locke",
        "refers",
        "subject",
        "discussed",
        "fateful",
        "evening",
        "remote",
        "matter",
        "essay",
        "may",
        "well",
        "also",
        "true",
        "locke",
        "essay",
        "identifies",
        "morality",
        "central",
        "feature",
        "human",
        "intellectual",
        "practical",
        "life",
        "brings",
        "u",
        "second",
        "important",
        "fact",
        "locke",
        "view",
        "morality",
        "locke",
        "writes",
        "essay",
        "morality",
        "proper",
        "science",
        "business",
        "mankind",
        "general",
        "essay",
        "number",
        "book",
        "chapter",
        "section",
        "respectively",
        "locke",
        "essay",
        "book",
        "aiming",
        "set",
        "limit",
        "extent",
        "human",
        "knowledge",
        "come",
        "small",
        "claim",
        "must",
        "locke",
        "writes",
        "know",
        "strength",
        "essay",
        "turn",
        "attention",
        "area",
        "certainty",
        "ie",
        "thing",
        "concern",
        "conduct",
        "essay",
        "amount",
        "attention",
        "given",
        "question",
        "morality",
        "would",
        "seem",
        "belie",
        "primacy",
        "locke",
        "essay",
        "certainly",
        "intended",
        "work",
        "moral",
        "philosophy",
        "work",
        "epistemology",
        "laying",
        "foundation",
        "knowledge",
        "however",
        "big",
        "part",
        "programme",
        "involves",
        "identifying",
        "true",
        "knowledge",
        "human",
        "knowledge",
        "morality",
        "accorded",
        "distinctive",
        "fairly",
        "exclusive",
        "status",
        "locke",
        "epistemology",
        "one",
        "science",
        "capable",
        "demonstration",
        "essay",
        "area",
        "inquiry",
        "accorded",
        "status",
        "mathematics",
        "clearly",
        "locke",
        "morality",
        "represents",
        "unique",
        "defining",
        "aspect",
        "mean",
        "human",
        "conclude",
        "essay",
        "strongly",
        "motivated",
        "interest",
        "establishing",
        "groundwork",
        "moral",
        "reasoning",
        "however",
        "morality",
        "clearly",
        "position",
        "highest",
        "regard",
        "epistemological",
        "system",
        "promise",
        "demonstrable",
        "moral",
        "science",
        "never",
        "realized",
        "later",
        "work",
        "seems",
        "safely",
        "say",
        "subject",
        "morality",
        "weighty",
        "one",
        "locke",
        "however",
        "locke",
        "take",
        "morality",
        "involve",
        "substantially",
        "complicated",
        "issue",
        "two",
        "broad",
        "line",
        "interpretation",
        "locke",
        "moral",
        "view",
        "briefly",
        "outline"
    ]
}