{
    "main_text": "Historical Background and Locke’s Life || Locke and Lord Shaftesbury 1666 to 1688\n1.2 Locke and Lord Shaftesbury 1666 to 1688\n\nLocke’s chief work while living at Lord Ashley’s\nresidence, Exeter House, in 1668 was as Ashley’s physician.\nLocke used his medical training to organize a successful operation on\nAshley. This was perhaps the most carefully documented operation in\nthe 17th century. Locke consulted doctors across the country to\ndetermine what the best practices were for this operation and made\ncleanliness a priority. In doing so he saved his patron’s life\nand thus changed English history.\n\nLocke had a number of other jobs. He worked as secretary of the Board\nof Trade and Plantations and Secretary to the Lords Proprietors of the\nCarolinas. Lord Ashley was one of the advocates of the view that\nEngland would prosper through trade and that colonies could play an\nimportant role in promoting trade. Ashley persuaded Charles II to\ncreate a Board of Trade and Plantations to collect information about\ntrade and colonies, and Locke became its secretary. In his capacity as\nthe secretary of the Board of Trade Locke was the collection point for\ninformation from around the globe about trade and colonies for the\nEnglish government. Among Ashley’s commercial projects was an\neffort to found colonies in the Carolinas. In his capacity as the\nsecretary to the Lords Proprietors, Locke was involved in the writing\nof the fundamental constitution of the Carolinas. There is some\ncontroversy about the extent of Locke’s role in writing the\n constitution.[2]\n In addition to issues about trade and colonies, Locke was involved\nthrough Shaftesbury in other controversies about public policy. There\nwas a monetary crisis in England involving the value of money, and the\nclipping of coins. Locke wrote papers for Lord Ashley on economic\nmatters, including the coinage crisis.\n\nWhile living in London at Exeter House, Locke continued to be involved\nin philosophical discussions. He tells us that:\n\n\nWere it fit to trouble thee with the history of this Essay, I should\ntell thee, that five or six friends meeting at my chamber, and\ndiscoursing on a subject very remote from this, found themselves\nquickly at a stand, by the difficulties that rose on every side. After\nwe had awhile puzzled ourselves, without coming any nearer a\nresolution of those doubts which perplexed us, it came into my\nthoughts that we took a wrong course; and that before we set ourselves\nupon inquiries of that nature, it was necessary to examine our own\nabilities, and see what objects our understandings were, or were not,\nfitted to deal with. This I proposed to the company, who all readily\nassented; and thereupon it was agreed that this should be our first\ninquiry. Some hasty and undigested thoughts, on a subject I had never\nbefore considered, which I set down against our next meeting, gave the\nfirst entrance into this Discourse; which having been thus begun by\nchance, was continued by intreaty; written by incoherent parcels; and\nafter long intervals of neglect, resumed again, as my humour or\noccasions permitted; and at last, in a retirement where an attendance\non my health gave me leisure, it was brought into that order thou now\nseest it. (Epistle to the Reader, N: 7)\n\n\nJames Tyrrell, one of Locke’s friends was at that meeting. He\nrecalls the discussion being about the principles of morality and\nrevealed religion (Cranston 1957: 140–1). Thus the Oxford\nscholar and medical researcher came to begin the work which was to\noccupy him off and on over the next twenty years.\n\nIn 1674 after Shaftesbury had left the government, Locke went back to\nOxford, where he acquired the degree Bachelor of medicine, and a\nlicense to practice medicine, and then went to France (Cranston 1957:\n160). In France Locke went from Calais to Paris, Lyons and on to\nMontpellier, where he spent the next fifteen months. Much of\nLocke’s time was spent learning about Protestantism in France.\nThe Edict of Nantes (promulgated by Henry IV in 1598) was in force,\nand so there was a degree of religious toleration in France. Louis XIV\nwas to revoke the edict in 1685 and French Protestants were then\nkilled while some 400,000 went into exile.\n\nWhile Locke was in France, Shaftesbury’s fortunes fluctuated. In\n1676 Shaftesbury was imprisoned in the tower. His imprisonment lasted\nfor a year. In 1678, after the mysterious murder of a London judge,\ninformers (most notably Titus Oates) started coming forward to reveal\na supposed Catholic conspiracy to assassinate the King and put his\nbrother on the throne. This whipped up public anti-Catholic frenzy.\nThough Shaftesbury had not fabricated the conspiracy story, nor did he\nprompt Oates to come forward, he did exploit the situation to the\nadvantage of his party. In the public chaos surrounding the\nsensational revelations, Shaftesbury organized an extensive party\nnetwork, exercised great control over elections, and built up a large\nparliamentary majority. His strategy was to secure the passage of an\nExclusion bill that would prevent Charles II’s openly Catholic\nbrother from becoming King. Although the Exclusion bill passed in the\nCommons it was rejected in the House of Lords because of the\nKing’s strong opposition to it. As the panic over the Popish\nplot receded, Shaftesbury was left without a following or a cause.\nShaftesbury was seized on July 21, 1681 and again put in the tower. He\nwas tried on trumped-up charges of treason but acquitted by a London\ngrand jury (filled with his supporters) in November.\n\nAt this point some of the Country Party leaders began plotting an\narmed insurrection which, had it come off, would have begun with the\nassassination of Charles and his brother on their way back to London\nfrom the races at Newmarket. The chances of such a rising occurring\nwere not as good as the plotters supposed. Memories of the turmoil of\nthe civil war were still relatively fresh. Eventually Shaftesbury, who\nwas moving from safe house to safe house, gave up and fled to Holland\nin November 1682. He died there in January 1683. Locke stayed in\nEngland until the Rye House Plot (named after the house from which the\nplotters were to fire upon the King and his brother) was discovered in\nJune of 1683. Locke left for the West country to put his affairs in\norder the very week the plot was revealed to the government and by\nSeptember he was in exile in\n Holland.[3]\n\nWhile in exile, Locke finished An Essay Concerning Human\nUnderstanding and published a fifty-page advanced notice of it in\nFrench. (This was to provide the intellectual world on the continent\nwith most of their information about the Essay until Pierre\nCoste’s French translation appeared in 1704.) He also wrote and\npublished his Epistola de Tolerentia in Latin. Richard\nAshcraft, in his Revolutionary Politics and Locke’s Two\nTreatises of Government (1986) suggests that while in Holland,\nLocke was not only finishing An Essay Concerning Human\nUnderstanding and nursing his health, he was closely associated\nwith the English revolutionaries in exile. The English government was\nmuch concerned with this group. They tried to get a number of them,\nincluding Locke, extradited to England. Locke’s studentship at\nOxford was taken away from him. In the meanwhile, the English\nintelligence service infiltrated the rebel group in Holland and\neffectively thwarted their efforts—at least for a while. While\nLocke was living in exile in Holland, Charles II died on Feb. 6, 1685,\nand was succeeded by his brother, who became James II of England. Soon\nafter this, the rebels in Holland sent a force of soldiers under the\nDuke of Monmouth to England to try to overthrow James II. The revolt\nwas crushed, and Monmouth was captured and executed (Ashcraft 1986).\nFor a meticulous, if cautious review, of the evidence concerning\nLocke’s involvement with the English rebels in exile see Roger\nWoolhouse’s Locke: A Biography (2007).\n\nUltimately, however, the rebels were successful. James II alienated\nmost of his supporters, and William of Orange was invited to bring a\nDutch force to England. After William’s army landed, James II,\nrealizing that he could not mount an effective resistance, fled the\ncountry to exile in France. This became known as the Glorious\nRevolution of 1688. It is a watershed in English history. For it marks\nthe point at which the balance of power in the English government\npassed from the King to the Parliament. Locke returned to England in\nFebruary 1689.\n",
    "section_title": "1.2 Locke and Lord Shaftesbury 1666 to 1688",
    "entry_title": "John Locke",
    "hierarchy_title": "John Locke || Historical Background and Locke’s Life || Locke and Lord Shaftesbury 1666 to 1688",
    "tokenized_text": [
        "historical",
        "background",
        "locke",
        "life",
        "locke",
        "lord",
        "shaftesbury",
        "locke",
        "lord",
        "shaftesbury",
        "locke",
        "chief",
        "work",
        "living",
        "lord",
        "ashley",
        "residence",
        "exeter",
        "house",
        "ashley",
        "physician",
        "locke",
        "used",
        "medical",
        "training",
        "organize",
        "successful",
        "operation",
        "ashley",
        "perhaps",
        "carefully",
        "documented",
        "operation",
        "th",
        "century",
        "locke",
        "consulted",
        "doctor",
        "across",
        "country",
        "determine",
        "best",
        "practice",
        "operation",
        "made",
        "cleanliness",
        "priority",
        "saved",
        "patron",
        "life",
        "thus",
        "changed",
        "english",
        "history",
        "locke",
        "number",
        "job",
        "worked",
        "secretary",
        "board",
        "trade",
        "plantation",
        "secretary",
        "lord",
        "proprietor",
        "carolina",
        "lord",
        "ashley",
        "one",
        "advocate",
        "view",
        "england",
        "would",
        "prosper",
        "trade",
        "colony",
        "could",
        "play",
        "important",
        "role",
        "promoting",
        "trade",
        "ashley",
        "persuaded",
        "charles",
        "ii",
        "create",
        "board",
        "trade",
        "plantation",
        "collect",
        "information",
        "trade",
        "colony",
        "locke",
        "became",
        "secretary",
        "capacity",
        "secretary",
        "board",
        "trade",
        "locke",
        "collection",
        "point",
        "information",
        "around",
        "globe",
        "trade",
        "colony",
        "english",
        "government",
        "among",
        "ashley",
        "commercial",
        "project",
        "effort",
        "found",
        "colony",
        "carolina",
        "capacity",
        "secretary",
        "lord",
        "proprietor",
        "locke",
        "involved",
        "writing",
        "fundamental",
        "constitution",
        "carolina",
        "controversy",
        "extent",
        "locke",
        "role",
        "writing",
        "constitution",
        "addition",
        "issue",
        "trade",
        "colony",
        "locke",
        "involved",
        "shaftesbury",
        "controversy",
        "public",
        "policy",
        "monetary",
        "crisis",
        "england",
        "involving",
        "value",
        "money",
        "clipping",
        "coin",
        "locke",
        "wrote",
        "paper",
        "lord",
        "ashley",
        "economic",
        "matter",
        "including",
        "coinage",
        "crisis",
        "living",
        "london",
        "exeter",
        "house",
        "locke",
        "continued",
        "involved",
        "philosophical",
        "discussion",
        "tell",
        "u",
        "fit",
        "trouble",
        "thee",
        "history",
        "essay",
        "tell",
        "thee",
        "five",
        "six",
        "friend",
        "meeting",
        "chamber",
        "discoursing",
        "subject",
        "remote",
        "found",
        "quickly",
        "stand",
        "difficulty",
        "rose",
        "every",
        "side",
        "awhile",
        "puzzled",
        "without",
        "coming",
        "nearer",
        "resolution",
        "doubt",
        "perplexed",
        "u",
        "came",
        "thought",
        "took",
        "wrong",
        "course",
        "set",
        "upon",
        "inquiry",
        "nature",
        "necessary",
        "examine",
        "ability",
        "see",
        "object",
        "understanding",
        "fitted",
        "deal",
        "proposed",
        "company",
        "readily",
        "assented",
        "thereupon",
        "agreed",
        "first",
        "inquiry",
        "hasty",
        "undigested",
        "thought",
        "subject",
        "never",
        "considered",
        "set",
        "next",
        "meeting",
        "gave",
        "first",
        "entrance",
        "discourse",
        "thus",
        "begun",
        "chance",
        "continued",
        "intreaty",
        "written",
        "incoherent",
        "parcel",
        "long",
        "interval",
        "neglect",
        "resumed",
        "humour",
        "occasion",
        "permitted",
        "last",
        "retirement",
        "attendance",
        "health",
        "gave",
        "leisure",
        "brought",
        "order",
        "thou",
        "seest",
        "epistle",
        "reader",
        "n",
        "james",
        "tyrrell",
        "one",
        "locke",
        "friend",
        "meeting",
        "recall",
        "discussion",
        "principle",
        "morality",
        "revealed",
        "religion",
        "cranston",
        "thus",
        "oxford",
        "scholar",
        "medical",
        "researcher",
        "came",
        "begin",
        "work",
        "occupy",
        "next",
        "twenty",
        "year",
        "shaftesbury",
        "left",
        "government",
        "locke",
        "went",
        "back",
        "oxford",
        "acquired",
        "degree",
        "bachelor",
        "medicine",
        "license",
        "practice",
        "medicine",
        "went",
        "france",
        "cranston",
        "france",
        "locke",
        "went",
        "calais",
        "paris",
        "lyon",
        "montpellier",
        "spent",
        "next",
        "fifteen",
        "month",
        "much",
        "locke",
        "time",
        "spent",
        "learning",
        "protestantism",
        "france",
        "edict",
        "nantes",
        "promulgated",
        "henry",
        "iv",
        "force",
        "degree",
        "religious",
        "toleration",
        "france",
        "louis",
        "xiv",
        "revoke",
        "edict",
        "french",
        "protestant",
        "killed",
        "went",
        "exile",
        "locke",
        "france",
        "shaftesbury",
        "fortune",
        "fluctuated",
        "shaftesbury",
        "imprisoned",
        "tower",
        "imprisonment",
        "lasted",
        "year",
        "mysterious",
        "murder",
        "london",
        "judge",
        "informer",
        "notably",
        "titus",
        "oates",
        "started",
        "coming",
        "forward",
        "reveal",
        "supposed",
        "catholic",
        "conspiracy",
        "assassinate",
        "king",
        "put",
        "brother",
        "throne",
        "whipped",
        "public",
        "anticatholic",
        "frenzy",
        "though",
        "shaftesbury",
        "fabricated",
        "conspiracy",
        "story",
        "prompt",
        "oates",
        "come",
        "forward",
        "exploit",
        "situation",
        "advantage",
        "party",
        "public",
        "chaos",
        "surrounding",
        "sensational",
        "revelation",
        "shaftesbury",
        "organized",
        "extensive",
        "party",
        "network",
        "exercised",
        "great",
        "control",
        "election",
        "built",
        "large",
        "parliamentary",
        "majority",
        "strategy",
        "secure",
        "passage",
        "exclusion",
        "bill",
        "would",
        "prevent",
        "charles",
        "ii",
        "openly",
        "catholic",
        "brother",
        "becoming",
        "king",
        "although",
        "exclusion",
        "bill",
        "passed",
        "common",
        "rejected",
        "house",
        "lord",
        "king",
        "strong",
        "opposition",
        "panic",
        "popish",
        "plot",
        "receded",
        "shaftesbury",
        "left",
        "without",
        "following",
        "cause",
        "shaftesbury",
        "seized",
        "july",
        "put",
        "tower",
        "tried",
        "trumpedup",
        "charge",
        "treason",
        "acquitted",
        "london",
        "grand",
        "jury",
        "filled",
        "supporter",
        "november",
        "point",
        "country",
        "party",
        "leader",
        "began",
        "plotting",
        "armed",
        "insurrection",
        "come",
        "would",
        "begun",
        "assassination",
        "charles",
        "brother",
        "way",
        "back",
        "london",
        "race",
        "newmarket",
        "chance",
        "rising",
        "occurring",
        "good",
        "plotter",
        "supposed",
        "memory",
        "turmoil",
        "civil",
        "war",
        "still",
        "relatively",
        "fresh",
        "eventually",
        "shaftesbury",
        "moving",
        "safe",
        "house",
        "safe",
        "house",
        "gave",
        "fled",
        "holland",
        "november",
        "died",
        "january",
        "locke",
        "stayed",
        "england",
        "rye",
        "house",
        "plot",
        "named",
        "house",
        "plotter",
        "fire",
        "upon",
        "king",
        "brother",
        "discovered",
        "june",
        "locke",
        "left",
        "west",
        "country",
        "put",
        "affair",
        "order",
        "week",
        "plot",
        "revealed",
        "government",
        "september",
        "exile",
        "holland",
        "exile",
        "locke",
        "finished",
        "essay",
        "concerning",
        "human",
        "understanding",
        "published",
        "fiftypage",
        "advanced",
        "notice",
        "french",
        "provide",
        "intellectual",
        "world",
        "continent",
        "information",
        "essay",
        "pierre",
        "coste",
        "french",
        "translation",
        "appeared",
        "also",
        "wrote",
        "published",
        "epistola",
        "de",
        "tolerentia",
        "latin",
        "richard",
        "ashcraft",
        "revolutionary",
        "politics",
        "locke",
        "two",
        "treatise",
        "government",
        "suggests",
        "holland",
        "locke",
        "finishing",
        "essay",
        "concerning",
        "human",
        "understanding",
        "nursing",
        "health",
        "closely",
        "associated",
        "english",
        "revolutionary",
        "exile",
        "english",
        "government",
        "much",
        "concerned",
        "group",
        "tried",
        "get",
        "number",
        "including",
        "locke",
        "extradited",
        "england",
        "locke",
        "studentship",
        "oxford",
        "taken",
        "away",
        "meanwhile",
        "english",
        "intelligence",
        "service",
        "infiltrated",
        "rebel",
        "group",
        "holland",
        "effectively",
        "thwarted",
        "effortsat",
        "least",
        "locke",
        "living",
        "exile",
        "holland",
        "charles",
        "ii",
        "died",
        "feb",
        "succeeded",
        "brother",
        "became",
        "james",
        "ii",
        "england",
        "soon",
        "rebel",
        "holland",
        "sent",
        "force",
        "soldier",
        "duke",
        "monmouth",
        "england",
        "try",
        "overthrow",
        "james",
        "ii",
        "revolt",
        "crushed",
        "monmouth",
        "captured",
        "executed",
        "ashcraft",
        "meticulous",
        "cautious",
        "review",
        "evidence",
        "concerning",
        "locke",
        "involvement",
        "english",
        "rebel",
        "exile",
        "see",
        "roger",
        "woolhouse",
        "locke",
        "biography",
        "ultimately",
        "however",
        "rebel",
        "successful",
        "james",
        "ii",
        "alienated",
        "supporter",
        "william",
        "orange",
        "invited",
        "bring",
        "dutch",
        "force",
        "england",
        "william",
        "army",
        "landed",
        "james",
        "ii",
        "realizing",
        "could",
        "mount",
        "effective",
        "resistance",
        "fled",
        "country",
        "exile",
        "france",
        "became",
        "known",
        "glorious",
        "revolution",
        "watershed",
        "english",
        "history",
        "mark",
        "point",
        "balance",
        "power",
        "english",
        "government",
        "passed",
        "king",
        "parliament",
        "locke",
        "returned",
        "england",
        "february"
    ]
}