{
    "main_text": "Natural Law and Natural Rights\n1. Natural Law and Natural Rights\n\nPerhaps the most central concept in Locke’s political philosophy\nis his theory of natural law and natural rights. The natural law\nconcept existed long before Locke as a way of expressing the idea that\nthere were certain moral truths that applied to all people, regardless\nof the particular place where they lived or the agreements they had\nmade. The most important early contrast was between laws that were by\nnature, and thus generally applicable, and those that were\nconventional and operated only in those places where the particular\nconvention had been established. This distinction is sometimes\nformulated as the difference between natural law and positive law.\n\nNatural law is also distinct from divine law in that the latter, in\nthe Christian tradition, normally referred to those laws that God had\ndirectly revealed through prophets and other inspired writers. Natural\nlaw can be discovered by reason alone and applies to all people, while\ndivine law can be discovered only through God’s special\nrevelation and applies only to those to whom it is revealed and whom\nGod specifically indicates are to be bound. Thus some\nseventeenth-century commentators, Locke included, held that not all of\nthe 10 commandments, much less the rest of the Old Testament law, were\nbinding on all people. The 10 commandments begin “Hear O\nIsrael” and thus are only binding on the people to whom they\nwere addressed (Works 6:37). (Spelling and formatting are\nmodernized in quotations from Locke in this entry). As we will see\nbelow, even though Locke thought natural law could be known apart from\nspecial revelation, he saw no contradiction in God playing a part in\nthe argument, so long as the relevant aspects of God’s character\ncould be discovered by reason alone. In Locke’s theory, divine\nlaw and natural law are consistent and can overlap in content, but\nthey are not coextensive. Thus there is no problem for Locke if the\nBible commands a moral code that is stricter than the one that can be\nderived from natural law, but there is a real problem if the Bible\nteaches what is contrary to natural law. In practice, Locke avoided\nthis problem because consistency with natural law was one of the\ncriteria he used when deciding the proper interpretation of Biblical\npassages.\n\nThe language of natural rights also gained prominence through the\nwritings of thinkers in the generation before Locke, such as Grotius\nand Hobbes, and of his contemporary Pufendorf. Whereas natural law\nemphasized duties, natural rights normally emphasized privileges or\nclaims to which an individual was entitled. There is considerable\ndisagreement as to how these factors are to be understood in relation\nto each other in Locke’s theory. Leo Strauss (1953), and many of\nhis followers, take rights to be paramount, going so far as to portray\nLocke’s position as essentially similar to that of Hobbes. They\npoint out that Locke defended a hedonist theory of human motivation\n(Essay 2.20) and claim that he must agree with Hobbes about\nthe essentially self-interested nature of human beings. Locke, they\nclaim, recognizes natural law obligations only in those situations\nwhere our own preservation is not in conflict, further emphasizing\nthat our right to preserve ourselves trumps any duties we may\nhave.\n\nOn the other end of the spectrum, more scholars have adopted the view\nof Dunn (1969), Tully (1980), and Ashcraft (1986) that it is natural\nlaw, not natural rights, that is primary. They hold that when Locke\nemphasized the right to life, liberty, and property he was primarily\nmaking a point about the duties we have toward other people: duties\nnot to kill, enslave, or steal. Most scholars also argue that Locke\nrecognized a general duty to assist with the preservation of mankind,\nincluding a duty of charity to those who have no other way to procure\ntheir subsistence (Two Treatises 1.42). These scholars regard\nduties as primary in Locke because rights exist to ensure that we are\nable to fulfill our duties. Simmons (1992) takes a position similar to\nthe latter group, but claims that rights are not just the flip side of\nduties in Locke, nor merely a means to performing our duties. Instead,\nrights and duties are equally fundamental because Locke believes in a\n“robust zone of indifference” in which rights protect our\nability to make choices. While these choices cannot violate natural\nlaw, they are not a mere means to fulfilling natural law either. Brian\nTierney (2014) questions whether one needs to prioritize natural law\nor natural right since both typically function as corollaries. He\nargues that modern natural rights theories are a development from\nmedieval conceptions of natural law that included permissions to act\nor not act in certain ways. \n\nThere have been some attempts to find a compromise between these\npositions. Michael Zuckert’s (1994) version of the Straussian\nposition acknowledges more differences between Hobbes and Locke.\nZuckert still questions the sincerity of Locke’s theism, but\nthinks that Locke does develop a position that grounds property rights\nin the fact that human beings own themselves, something Hobbes denied.\nAdam Seagrave (2014) has gone a step further. He argues that the\ncontradiction between Locke’s claim that human beings are owned\nby God and that human beings own themselves is only apparent. He bases\nthis argument on passages from Locke’s other writings\n(especially the Essay Concerning Human Understanding). In the\npassages about divine ownership, Locke is speaking about humanity as a\nwhole, while in the passages about self-ownership he is talking about\nindividual human beings with the capacity for property ownership. God\ncreated human beings who are capable of having property rights with\nrespect to one another on the basis of owning their labor. Both of\nthem emphasize differences between Locke’s use of natural rights\nand the earlier tradition of natural law. \n\nAnother point of contestation has to do with the extent to which Locke\nthought natural law could, in fact, be known by reason. Both Strauss\n(1953) and Peter Laslett (Introduction to Locke’s Two\nTreatises), though very different in their interpretations of\nLocke generally, see Locke’s theory of natural law as filled\nwith contradictions. In the Essay Concerning Human\nUnderstanding, Locke defends a theory of moral knowledge that\nnegates the possibility of innate ideas (Essay Book 1) and\nclaims that morality is capable of demonstration in the same way that\nMathematics is (Essay 3.11.16, 4.3.18–20). Yet nowhere\nin any of his works does Locke make a full deduction of natural law\nfrom first premises. More than that, Locke at times seems to appeal to\ninnate ideas in the Second Treatise (2.11), and in The\nReasonableness of Christianity (Works 7:139) he admits\nthat no one has ever worked out all of natural law from reason alone.\nStrauss infers from this that the contradictions exist to show the\nattentive reader that Locke does not really believe in natural law at\nall. Laslett, more conservatively, simply says that Locke the\nphilosopher and Locke the political writer should be kept very\nseparate.\n\nMany scholars reject this position. Yolton (1958), Colman (1883),\nAshcraft (1987), Grant (1987), Simmons (1992), Tuckness (1999),\nIsraelson (2013), Rossiter (2016), Connolly (2019), and others all\nargue that there is nothing strictly inconsistent in Locke’s\nadmission in The Reasonableness of Christianity. That no one\nhas deduced all of natural law from first principles does not mean\nthat none of it has been deduced. The supposedly contradictory\npassages in the Two Treatises are far from decisive. While it\nis true that Locke does not provide a deduction in the Essay,\nit is not clear that he was trying to. Section 4.10.1–19 of that\nwork seems more concerned to show how reasoning with moral terms is\npossible, not to actually provide a full account of natural law.\nNonetheless, it must be admitted that Locke did not treat the topic of\nnatural law as systematically as one might like. Attempts to work out\nhis theory in more detail with respect to its ground and its content\nmust try to reconstruct it from scattered passages in many different\ntexts.\n\nTo understand Locke’s position on the ground of natural law it\nmust be situated within a larger debate in natural law theory that\npredates Locke, the so-called\n“voluntarism-intellectualism,” or\n“voluntarist-rationalist” debate. At its simplest, the\nvoluntarist declares that right and wrong are determined by\nGod’s will and that we are obliged to obey the will of God\nsimply because it is the will of God. Unless these positions are\nmaintained, the voluntarist argues, God becomes superfluous to\nmorality since both the content and the binding force of morality can\nbe explained without reference to God. The intellectualist replies\nthat this understanding makes morality arbitrary and fails to explain\nwhy we have an obligation to obey God. Graedon Zorzi (2019) has argued\nthat “person” is a relational term for Locke, indicating\nthat we will be held accountable by God for whether we have followed\nthe law.\n\nWith respect to the grounds and content of natural law, Locke is not\ncompletely clear. On the one hand, there are many instances where he\nmakes statements that sound voluntarist to the effect that law\nrequires a legislator with authority (Essay 1.3.6, 4.10.7).\nLocke also repeatedly insists in the Essays on the Law of\nNature that created beings have an obligation to obey their\ncreator (Political Essays 116–120). On the other hand\nthere are statements that seem to imply an external moral standard to\nwhich God must conform (Two Treatises 2.195; Works\n7:6). Locke clearly wants to avoid the implication that the content of\nnatural law is arbitrary. Several solutions have been proposed. One\nsolution suggested by Herzog (1985) makes Locke an intellectualist by\ngrounding our obligation to obey God on a prior duty of gratitude that\nexists independent of God. A second option, suggested by Simmons\n(1992), is simply to take Locke as a voluntarist since that is where\nthe preponderance of his statements point. A third option, suggested\nby Tuckness (1999) (and implied by Grant 1987 and affirmed by\nIsraelson 2013), is to treat the question of voluntarism as having two\ndifferent parts, grounds and content. On this view, Locke was indeed a\nvoluntarist with respect to the question “why should we obey the\nlaw of nature?” Locke thought that reason, apart from the will\nof a superior, could only be advisory. With respect to content, divine\nreason and human reason must be sufficiently analogous that human\nbeings can reason about what God likely wills. Locke takes it for\ngranted that since God created us with reason in order to follow\nGod’s will, human reason and divine reason are sufficiently\nsimilar that natural law will not seem arbitrary to us.\n\nThose interested in the contemporary relevance of Locke’s\npolitical theory must confront its theological aspects. Straussians\nmake Locke’s theory relevant by claiming that the theological\ndimensions of his thought are primarily rhetorical; they were\n“cover” to keep him from being persecuted by the religious\nauthorities of his day. Others, such as Dunn (1969) and Stanton\n(2018), take Locke to be of only limited relevance to contemporary\npolitics precisely because so many of his arguments depend on\nreligious assumptions that are no longer widely shared. Some authors,\nsuch as Simmons (1992) and Vernon (1997), have tried to separate the\nfoundations of Locke’s argument from other aspects of it.\nSimmons, for example, argues that Locke’s thought is\nover-determined, containing both religious and secular arguments. He\nclaims that for Locke the fundamental law of nature is that “as\nmuch as possible mankind is to be preserved” (Two\nTreatises 2.135). At times, he claims, Locke presents this\nprinciple in rule-consequentialist terms: it is the principle we use\nto determine the more specific rights and duties that all have. At\nother times, Locke hints at a more Kantian justification that\nemphasizes the impropriety of treating our equals as if they were mere\nmeans to our ends. Waldron (2002) explores the opposite claim: that\nLocke’s theology actually provides a more solid basis for his\npremise of political equality than do contemporary secular approaches\nthat tend to simply assert equality.\n\nWith respect to the specific content of natural law, Locke never\nprovides a comprehensive statement of what it requires. In the Two\nTreatises, Locke frequently states that the fundamental law of\nnature is that as much as possible mankind is to be preserved. Simmons\n(1992) argues that in Two Treatises 2.6 Locke presents (1) a\nduty to preserve one’s self, (2) a duty to preserve others when\nself-preservation does not conflict, (3) a duty not to take away the\nlife of another, and (4) a duty not to act in a way that “tends\nto destroy” others. Libertarian interpreters of Locke tend to\ndownplay duties of type 1 and 2. Locke presents a more extensive list\nin his earlier, and unpublished in his lifetime, Essays on the Law\nof Nature. Interestingly, Locke here includes praise and honor of\nthe deity as required by natural law as well as what we might call\ngood character qualities.\n",
    "section_title": "1. Natural Law and Natural Rights",
    "entry_title": "Locke’s Political Philosophy",
    "hierarchy_title": "Locke’s Political Philosophy || Natural Law and Natural Rights",
    "tokenized_text": [
        "natural",
        "law",
        "natural",
        "right",
        "natural",
        "law",
        "natural",
        "right",
        "perhaps",
        "central",
        "concept",
        "locke",
        "political",
        "philosophy",
        "theory",
        "natural",
        "law",
        "natural",
        "right",
        "natural",
        "law",
        "concept",
        "existed",
        "long",
        "locke",
        "way",
        "expressing",
        "idea",
        "certain",
        "moral",
        "truth",
        "applied",
        "people",
        "regardless",
        "particular",
        "place",
        "lived",
        "agreement",
        "made",
        "important",
        "early",
        "contrast",
        "law",
        "nature",
        "thus",
        "generally",
        "applicable",
        "conventional",
        "operated",
        "place",
        "particular",
        "convention",
        "established",
        "distinction",
        "sometimes",
        "formulated",
        "difference",
        "natural",
        "law",
        "positive",
        "law",
        "natural",
        "law",
        "also",
        "distinct",
        "divine",
        "law",
        "latter",
        "christian",
        "tradition",
        "normally",
        "referred",
        "law",
        "god",
        "directly",
        "revealed",
        "prophet",
        "inspired",
        "writer",
        "natural",
        "law",
        "discovered",
        "reason",
        "alone",
        "applies",
        "people",
        "divine",
        "law",
        "discovered",
        "god",
        "special",
        "revelation",
        "applies",
        "revealed",
        "god",
        "specifically",
        "indicates",
        "bound",
        "thus",
        "seventeenthcentury",
        "commentator",
        "locke",
        "included",
        "held",
        "commandment",
        "much",
        "le",
        "rest",
        "old",
        "testament",
        "law",
        "binding",
        "people",
        "commandment",
        "begin",
        "hear",
        "israel",
        "thus",
        "binding",
        "people",
        "addressed",
        "work",
        "spelling",
        "formatting",
        "modernized",
        "quotation",
        "locke",
        "entry",
        "see",
        "even",
        "though",
        "locke",
        "thought",
        "natural",
        "law",
        "could",
        "known",
        "apart",
        "special",
        "revelation",
        "saw",
        "contradiction",
        "god",
        "playing",
        "part",
        "argument",
        "long",
        "relevant",
        "aspect",
        "god",
        "character",
        "could",
        "discovered",
        "reason",
        "alone",
        "locke",
        "theory",
        "divine",
        "law",
        "natural",
        "law",
        "consistent",
        "overlap",
        "content",
        "coextensive",
        "thus",
        "problem",
        "locke",
        "bible",
        "command",
        "moral",
        "code",
        "stricter",
        "one",
        "derived",
        "natural",
        "law",
        "real",
        "problem",
        "bible",
        "teach",
        "contrary",
        "natural",
        "law",
        "practice",
        "locke",
        "avoided",
        "problem",
        "consistency",
        "natural",
        "law",
        "one",
        "criterion",
        "used",
        "deciding",
        "proper",
        "interpretation",
        "biblical",
        "passage",
        "language",
        "natural",
        "right",
        "also",
        "gained",
        "prominence",
        "writing",
        "thinker",
        "generation",
        "locke",
        "grotius",
        "hobbes",
        "contemporary",
        "pufendorf",
        "whereas",
        "natural",
        "law",
        "emphasized",
        "duty",
        "natural",
        "right",
        "normally",
        "emphasized",
        "privilege",
        "claim",
        "individual",
        "entitled",
        "considerable",
        "disagreement",
        "factor",
        "understood",
        "relation",
        "locke",
        "theory",
        "leo",
        "strauss",
        "many",
        "follower",
        "take",
        "right",
        "paramount",
        "going",
        "far",
        "portray",
        "locke",
        "position",
        "essentially",
        "similar",
        "hobbes",
        "point",
        "locke",
        "defended",
        "hedonist",
        "theory",
        "human",
        "motivation",
        "essay",
        "claim",
        "must",
        "agree",
        "hobbes",
        "essentially",
        "selfinterested",
        "nature",
        "human",
        "being",
        "locke",
        "claim",
        "recognizes",
        "natural",
        "law",
        "obligation",
        "situation",
        "preservation",
        "conflict",
        "emphasizing",
        "right",
        "preserve",
        "trump",
        "duty",
        "may",
        "end",
        "spectrum",
        "scholar",
        "adopted",
        "view",
        "dunn",
        "tully",
        "ashcraft",
        "natural",
        "law",
        "natural",
        "right",
        "primary",
        "hold",
        "locke",
        "emphasized",
        "right",
        "life",
        "liberty",
        "property",
        "primarily",
        "making",
        "point",
        "duty",
        "toward",
        "people",
        "duty",
        "kill",
        "enslave",
        "steal",
        "scholar",
        "also",
        "argue",
        "locke",
        "recognized",
        "general",
        "duty",
        "assist",
        "preservation",
        "mankind",
        "including",
        "duty",
        "charity",
        "way",
        "procure",
        "subsistence",
        "two",
        "treatise",
        "scholar",
        "regard",
        "duty",
        "primary",
        "locke",
        "right",
        "exist",
        "ensure",
        "able",
        "fulfill",
        "duty",
        "simmons",
        "take",
        "position",
        "similar",
        "latter",
        "group",
        "claim",
        "right",
        "flip",
        "side",
        "duty",
        "locke",
        "merely",
        "mean",
        "performing",
        "duty",
        "instead",
        "right",
        "duty",
        "equally",
        "fundamental",
        "locke",
        "belief",
        "robust",
        "zone",
        "indifference",
        "right",
        "protect",
        "ability",
        "make",
        "choice",
        "choice",
        "violate",
        "natural",
        "law",
        "mere",
        "mean",
        "fulfilling",
        "natural",
        "law",
        "either",
        "brian",
        "tierney",
        "question",
        "whether",
        "one",
        "need",
        "prioritize",
        "natural",
        "law",
        "natural",
        "right",
        "since",
        "typically",
        "function",
        "corollary",
        "argues",
        "modern",
        "natural",
        "right",
        "theory",
        "development",
        "medieval",
        "conception",
        "natural",
        "law",
        "included",
        "permission",
        "act",
        "act",
        "certain",
        "way",
        "attempt",
        "find",
        "compromise",
        "position",
        "michael",
        "zuckert",
        "version",
        "straussian",
        "position",
        "acknowledges",
        "difference",
        "hobbes",
        "locke",
        "zuckert",
        "still",
        "question",
        "sincerity",
        "locke",
        "theism",
        "think",
        "locke",
        "develop",
        "position",
        "ground",
        "property",
        "right",
        "fact",
        "human",
        "being",
        "something",
        "hobbes",
        "denied",
        "adam",
        "seagrave",
        "gone",
        "step",
        "argues",
        "contradiction",
        "locke",
        "claim",
        "human",
        "being",
        "owned",
        "god",
        "human",
        "being",
        "apparent",
        "base",
        "argument",
        "passage",
        "locke",
        "writing",
        "especially",
        "essay",
        "concerning",
        "human",
        "understanding",
        "passage",
        "divine",
        "ownership",
        "locke",
        "speaking",
        "humanity",
        "whole",
        "passage",
        "selfownership",
        "talking",
        "individual",
        "human",
        "being",
        "capacity",
        "property",
        "ownership",
        "god",
        "created",
        "human",
        "being",
        "capable",
        "property",
        "right",
        "respect",
        "one",
        "another",
        "basis",
        "owning",
        "labor",
        "emphasize",
        "difference",
        "locke",
        "use",
        "natural",
        "right",
        "earlier",
        "tradition",
        "natural",
        "law",
        "another",
        "point",
        "contestation",
        "extent",
        "locke",
        "thought",
        "natural",
        "law",
        "could",
        "fact",
        "known",
        "reason",
        "strauss",
        "peter",
        "laslett",
        "introduction",
        "locke",
        "two",
        "treatise",
        "though",
        "different",
        "interpretation",
        "locke",
        "generally",
        "see",
        "locke",
        "theory",
        "natural",
        "law",
        "filled",
        "contradiction",
        "essay",
        "concerning",
        "human",
        "understanding",
        "locke",
        "defends",
        "theory",
        "moral",
        "knowledge",
        "negates",
        "possibility",
        "innate",
        "idea",
        "essay",
        "book",
        "claim",
        "morality",
        "capable",
        "demonstration",
        "way",
        "mathematics",
        "essay",
        "yet",
        "nowhere",
        "work",
        "locke",
        "make",
        "full",
        "deduction",
        "natural",
        "law",
        "first",
        "premise",
        "locke",
        "time",
        "seems",
        "appeal",
        "innate",
        "idea",
        "second",
        "treatise",
        "reasonableness",
        "christianity",
        "work",
        "admits",
        "one",
        "ever",
        "worked",
        "natural",
        "law",
        "reason",
        "alone",
        "strauss",
        "infers",
        "contradiction",
        "exist",
        "show",
        "attentive",
        "reader",
        "locke",
        "really",
        "believe",
        "natural",
        "law",
        "laslett",
        "conservatively",
        "simply",
        "say",
        "locke",
        "philosopher",
        "locke",
        "political",
        "writer",
        "kept",
        "separate",
        "many",
        "scholar",
        "reject",
        "position",
        "yolton",
        "colman",
        "ashcraft",
        "grant",
        "simmons",
        "tuckness",
        "israelson",
        "rossiter",
        "connolly",
        "others",
        "argue",
        "nothing",
        "strictly",
        "inconsistent",
        "locke",
        "admission",
        "reasonableness",
        "christianity",
        "one",
        "deduced",
        "natural",
        "law",
        "first",
        "principle",
        "mean",
        "none",
        "deduced",
        "supposedly",
        "contradictory",
        "passage",
        "two",
        "treatise",
        "far",
        "decisive",
        "true",
        "locke",
        "provide",
        "deduction",
        "essay",
        "clear",
        "trying",
        "section",
        "work",
        "seems",
        "concerned",
        "show",
        "reasoning",
        "moral",
        "term",
        "possible",
        "actually",
        "provide",
        "full",
        "account",
        "natural",
        "law",
        "nonetheless",
        "must",
        "admitted",
        "locke",
        "treat",
        "topic",
        "natural",
        "law",
        "systematically",
        "one",
        "might",
        "like",
        "attempt",
        "work",
        "theory",
        "detail",
        "respect",
        "ground",
        "content",
        "must",
        "try",
        "reconstruct",
        "scattered",
        "passage",
        "many",
        "different",
        "text",
        "understand",
        "locke",
        "position",
        "ground",
        "natural",
        "law",
        "must",
        "situated",
        "within",
        "larger",
        "debate",
        "natural",
        "law",
        "theory",
        "predates",
        "locke",
        "socalled",
        "voluntarismintellectualism",
        "voluntaristrationalist",
        "debate",
        "simplest",
        "voluntarist",
        "declares",
        "right",
        "wrong",
        "determined",
        "god",
        "obliged",
        "obey",
        "god",
        "simply",
        "god",
        "unless",
        "position",
        "maintained",
        "voluntarist",
        "argues",
        "god",
        "becomes",
        "superfluous",
        "morality",
        "since",
        "content",
        "binding",
        "force",
        "morality",
        "explained",
        "without",
        "reference",
        "god",
        "intellectualist",
        "reply",
        "understanding",
        "make",
        "morality",
        "arbitrary",
        "fails",
        "explain",
        "obligation",
        "obey",
        "god",
        "graedon",
        "zorzi",
        "argued",
        "person",
        "relational",
        "term",
        "locke",
        "indicating",
        "held",
        "accountable",
        "god",
        "whether",
        "followed",
        "law",
        "respect",
        "ground",
        "content",
        "natural",
        "law",
        "locke",
        "completely",
        "clear",
        "one",
        "hand",
        "many",
        "instance",
        "make",
        "statement",
        "sound",
        "voluntarist",
        "effect",
        "law",
        "requires",
        "legislator",
        "authority",
        "essay",
        "locke",
        "also",
        "repeatedly",
        "insists",
        "essay",
        "law",
        "nature",
        "created",
        "being",
        "obligation",
        "obey",
        "creator",
        "political",
        "essay",
        "hand",
        "statement",
        "seem",
        "imply",
        "external",
        "moral",
        "standard",
        "god",
        "must",
        "conform",
        "two",
        "treatise",
        "work",
        "locke",
        "clearly",
        "want",
        "avoid",
        "implication",
        "content",
        "natural",
        "law",
        "arbitrary",
        "several",
        "solution",
        "proposed",
        "one",
        "solution",
        "suggested",
        "herzog",
        "make",
        "locke",
        "intellectualist",
        "grounding",
        "obligation",
        "obey",
        "god",
        "prior",
        "duty",
        "gratitude",
        "exists",
        "independent",
        "god",
        "second",
        "option",
        "suggested",
        "simmons",
        "simply",
        "take",
        "locke",
        "voluntarist",
        "since",
        "preponderance",
        "statement",
        "point",
        "third",
        "option",
        "suggested",
        "tuckness",
        "implied",
        "grant",
        "affirmed",
        "israelson",
        "treat",
        "question",
        "voluntarism",
        "two",
        "different",
        "part",
        "ground",
        "content",
        "view",
        "locke",
        "indeed",
        "voluntarist",
        "respect",
        "question",
        "obey",
        "law",
        "nature",
        "locke",
        "thought",
        "reason",
        "apart",
        "superior",
        "could",
        "advisory",
        "respect",
        "content",
        "divine",
        "reason",
        "human",
        "reason",
        "must",
        "sufficiently",
        "analogous",
        "human",
        "being",
        "reason",
        "god",
        "likely",
        "will",
        "locke",
        "take",
        "granted",
        "since",
        "god",
        "created",
        "u",
        "reason",
        "order",
        "follow",
        "god",
        "human",
        "reason",
        "divine",
        "reason",
        "sufficiently",
        "similar",
        "natural",
        "law",
        "seem",
        "arbitrary",
        "u",
        "interested",
        "contemporary",
        "relevance",
        "locke",
        "political",
        "theory",
        "must",
        "confront",
        "theological",
        "aspect",
        "straussians",
        "make",
        "locke",
        "theory",
        "relevant",
        "claiming",
        "theological",
        "dimension",
        "thought",
        "primarily",
        "rhetorical",
        "cover",
        "keep",
        "persecuted",
        "religious",
        "authority",
        "day",
        "others",
        "dunn",
        "stanton",
        "take",
        "locke",
        "limited",
        "relevance",
        "contemporary",
        "politics",
        "precisely",
        "many",
        "argument",
        "depend",
        "religious",
        "assumption",
        "longer",
        "widely",
        "shared",
        "author",
        "simmons",
        "vernon",
        "tried",
        "separate",
        "foundation",
        "locke",
        "argument",
        "aspect",
        "simmons",
        "example",
        "argues",
        "locke",
        "thought",
        "overdetermined",
        "containing",
        "religious",
        "secular",
        "argument",
        "claim",
        "locke",
        "fundamental",
        "law",
        "nature",
        "much",
        "possible",
        "mankind",
        "preserved",
        "two",
        "treatise",
        "time",
        "claim",
        "locke",
        "present",
        "principle",
        "ruleconsequentialist",
        "term",
        "principle",
        "use",
        "determine",
        "specific",
        "right",
        "duty",
        "time",
        "locke",
        "hint",
        "kantian",
        "justification",
        "emphasizes",
        "impropriety",
        "treating",
        "equal",
        "mere",
        "mean",
        "end",
        "waldron",
        "explores",
        "opposite",
        "claim",
        "locke",
        "theology",
        "actually",
        "provides",
        "solid",
        "basis",
        "premise",
        "political",
        "equality",
        "contemporary",
        "secular",
        "approach",
        "tend",
        "simply",
        "assert",
        "equality",
        "respect",
        "specific",
        "content",
        "natural",
        "law",
        "locke",
        "never",
        "provides",
        "comprehensive",
        "statement",
        "requires",
        "two",
        "treatise",
        "locke",
        "frequently",
        "state",
        "fundamental",
        "law",
        "nature",
        "much",
        "possible",
        "mankind",
        "preserved",
        "simmons",
        "argues",
        "two",
        "treatise",
        "locke",
        "present",
        "duty",
        "preserve",
        "one",
        "self",
        "duty",
        "preserve",
        "others",
        "selfpreservation",
        "conflict",
        "duty",
        "take",
        "away",
        "life",
        "another",
        "duty",
        "act",
        "way",
        "tends",
        "destroy",
        "others",
        "libertarian",
        "interpreter",
        "locke",
        "tend",
        "downplay",
        "duty",
        "type",
        "locke",
        "present",
        "extensive",
        "list",
        "earlier",
        "unpublished",
        "lifetime",
        "essay",
        "law",
        "nature",
        "interestingly",
        "locke",
        "includes",
        "praise",
        "honor",
        "deity",
        "required",
        "natural",
        "law",
        "well",
        "might",
        "call",
        "good",
        "character",
        "quality"
    ]
}