{
    "main_text": "Consent, Political Obligation, and the Ends of Government\n4. Consent, Political Obligation, and the Ends of Government\n\nThe most direct reading of Locke’s political philosophy finds\nthe concept of consent playing a central role. His analysis begins\nwith individuals in a state of nature where they are not subject to a\ncommon legitimate authority with the power to legislate or adjudicate\ndisputes. From this natural state of freedom and independence, Locke\nstresses individual consent as the mechanism by which political\nsocieties are created and individuals join those societies. While\nthere are of course some general obligations and rights that all\npeople have from the law of nature, special obligations come about\nonly when we voluntarily undertake them. Locke clearly states that one\ncan only become a full member of society by an act of express consent\n(Two Treatises 2.122). The literature on Locke’s theory\nof consent tends to focus on how Locke does or does not successfully\nanswer the following objection: few people have actually consented to\ntheir governments so no, or almost no, governments are actually\nlegitimate. This conclusion is problematic since it is clearly\ncontrary to Locke’s intention.\n\nLocke’s most obvious solution to this problem is his doctrine of\ntacit consent. Simply by walking along the highways of a country a\nperson gives tacit consent to the government and agrees to obey it\nwhile living in its territory. This, Locke thinks, explains why\nresident aliens have an obligation to obey the laws of the state where\nthey reside, though only while they live there. Inheriting property\ncreates an even stronger bond, since the original owner of the\nproperty permanently put the property under the jurisdiction of the\ncommonwealth. Children, when they accept the property of their\nparents, consent to the jurisdiction of the commonwealth over that\nproperty (Two Treatises 2.120). There is debate over whether\nthe inheritance of property should be regarded as tacit or express\nconsent. On one interpretation, by accepting the property, Locke\nthinks a person becomes a full member of society, which implies that\nhe must regard this as an act of express consent. Grant (1987)\nsuggests that Locke’s ideal would have been an explicit\nmechanism of society whereupon adults would give express consent and\nthis would be a precondition of inheriting property. On the other\ninterpretation, Locke recognized that people inheriting property did\nnot in the process of doing so make any explicit declaration about\ntheir political obligation.\n\nHowever this debate is resolved, there will be in any current or\npreviously existing society many people who have never given express\nconsent, and thus some version of tacit consent seems needed to\nexplain how governments could still be legitimate. Simmons finds it\ndifficult to see how merely walking on a street or inheriting land can\nbe thought of as an example of a “deliberate, voluntary\nalienating of rights” (Simmons 1993, 69). It is one thing, he\nargues, for a person to consent by actions rather than words; it is\nquite another to claim a person has consented without being aware that\nthey have done so. To require a person to leave behind all of their\nproperty and emigrate in order to avoid giving tacit consent is to\ncreate a situation where continued residence is not a free and\nvoluntary choice. Simmons’ approach is to agree with Locke that\nreal consent is necessary for political obligation but disagree about\nwhether most people in fact have given that kind of consent. Simmons\nclaims that Locke’s arguments push toward “philosophical\nanarchism,” the position that most people do not have a moral\nobligation to obey the government, even though Locke himself would not\nhave made this claim.\n\nHannah Pitkin (1965) takes a very different approach. She claims that\nthe logic of Locke’s argument makes consent far less important\nin practice than it might appear. Tacit consent is indeed a watering\ndown of the concept of consent, but Locke can do this because the\nbasic content of what governments are to be like is set by natural law\nand not by consent. If consent were truly foundational in\nLocke’s scheme, we would discover the legitimate powers of any\ngiven government by finding out what contract the original founders\nsigned. Pitkin, however, thinks that for Locke the form and powers of\ngovernment are determined by natural law. What really matters,\ntherefore, is not previous acts of consent but the quality of the\npresent government, whether it corresponds to what natural law\nrequires. Locke does not think, for example, that walking the streets\nor inheriting property in a tyrannical regime means we have consented\nto that regime. It is thus the quality of the government, not acts of\nactual consent, that determine whether a government is legitimate.\nSimmons objects to this interpretation, saying that it fails to\naccount for the many places where Locke does indeed say a person\nacquires political obligations only by his own consent.\n\nJohn Dunn (1967) takes a still different approach. He claims that it\nis anachronistic to read into Locke a modern conception of what counts\nas “consent.” While modern theories do insist that consent\nis truly consent only if it is deliberate and voluntary, Locke’s\nconcept of consent was far broader. For Locke, it was enough that\npeople be “not unwilling.” Voluntary acquiescence, on\nDunn’s interpretation, is all that is needed. As evidence Dunn\ncan point to the fact that many of the instances of consent Locke\nuses, such as “consenting” to the use of money, make more\nsense on this broad interpretation. Simmons objects that this ignores\nthe instances where Locke does talk about consent as a deliberate\nchoice and that, in any case, it would only make Locke consistent at\nthe price of making him unconvincing.\n\nRecent scholarship has continued to probe these issues. Davis (2014)\nclosely examines Locke’s terminology and argues that we must\ndistinguish between political society and legitimate government. Only\nthose who have expressly consented are members of political society,\nwhile the government exercises legitimate authority over various types\nof people who have not so consented. The government is supreme in some\nrespects, but there is no sovereign. He also argues (2017) that one\ncould give actual consent in Locke’s day by declaring\none’s intent to cast a vote, rather than by voting for a\nparticular candidate. The former is more plausibly interpreted as an\nact of affirmative consent to be a member of a political society.\nRegistering to vote, as opposed to actually voting, would be a\ncontemporary analogue. Van der Vossen (2015) makes a related argument,\nclaiming that the initial consent of property owners is not the\nmechanism by which governments come to rule over a particular\nterritory. Rather, Locke thinks that people (probably fathers\ninitially) simply begin exercising political authority and people\ntacitly consent. This tacit consent is sufficient to justify a\nrudimentary state that rules over the consenters. Treaties between\nthese governments would then fix the territorial borders. Hoff (2015)\ngoes still further, arguing that we need not even think of specific\nacts of tacit consent (such as deciding not to emigrate) as necessary\nfor generating political obligation. Instead, consent is implied if\nthe government itself functions in ways that show it is answerable to\nthe people.\n\nA related question has to do with the extent of our obligation once\nconsent has been given. The interpretive school influenced by Strauss\nemphasizes the primacy of preservation. Since the duties of natural\nlaw apply only when our preservation is not threatened (Two\nTreatises 2.6), then our obligations cease in cases where our\npreservation is directly threatened. This has important implications\nif we consider a soldier who is being sent on a mission where death is\nextremely likely. Grant (1987) points out that Locke believes a\nsoldier who deserts from such a mission (2.139) is justly sentenced to\ndeath. Grant takes Locke to be claiming not only that desertion laws\nare legitimate in the sense that they can be blamelessly enforced\n(something Hobbes would grant) but that they also imply a moral\nobligation on the part of the soldier to give up his life for the\ncommon good (something Hobbes would deny). According to Grant, Locke\nthinks that our acts of consent can, in fact, extend to cases where\nliving up to our commitments will risk our lives. The decision to\nenter political society is a permanent one for precisely this reason:\nthe society will have to be defended and if people can revoke their\nconsent to help protect it when attacked, the act of consent made when\nentering political society would be pointless since the political\ncommunity would fail at the very point where it is most needed. People\nmake a calculated decision when they enter society, and the risk of\ndying in combat is part of that calculation. Grant also thinks Locke\nrecognizes a duty based on reciprocity since others risk their lives\nas well.\n\nMost of these approaches focus on Locke’s doctrine of consent as\na solution to the problem of political obligation. A different\napproach asks what role consent plays in determining, here and now,\nthe legitimate ends that governments can pursue. One part of this\ndebate is captured by the debate between Seliger (1968) and Kendall\n(1959), the former viewing Locke as a constitutionalist and the latter\nviewing him as giving almost unlimited power to majorities. On the\nformer interpretation, a constitution is created by the consent of the\npeople as part of the creation of the commonwealth. On the latter\ninterpretation, the people create a legislature which rules by\nmajority vote. A third view, advanced by Tuckness (2002a), holds that\nLocke was flexible at this point and gave people considerable\nflexibility in constitutional drafting.\n\nA second part of the debate focuses on ends rather than institutions.\nLocke states in the Two Treatises that the power of the\nGovernment is limited to the public good. It is a power “that\nhath no other end but preservation” and therefore cannot justify\nkilling, enslaving, or plundering the citizens (2.135). Libertarians\nlike Nozick (1974) read this as stating that governments exist only to\nprotect people from infringements on their rights. An alternate\ninterpretation, advanced by Tuckness (2002b, 2008a), draws attention\nto the fact that in the following sentences the formulation of natural\nlaw that Locke focuses on is a positive one, that “as much as\npossible” mankind is to be preserved. On this second reading,\ngovernment is limited to fulfilling the purposes of natural law, but\nthese include positive goals as well as negative rights. On this view,\nthe power to promote the common good extends to actions designed to\nincrease population, improve the military, strengthen the economy and\ninfrastructure, and so on, provided these steps are indirectly useful\nto the goal of preserving the society. This would explain why Locke,\nin the Letter, describes government promotion of “arms,\nriches, and multitude of citizens” as the proper remedy for the\ndanger of foreign attack (Works 6: 42).\n",
    "section_title": "4. Consent, Political Obligation, and the Ends of Government",
    "entry_title": "Locke’s Political Philosophy",
    "hierarchy_title": "Locke’s Political Philosophy || Consent, Political Obligation, and the Ends of Government",
    "tokenized_text": [
        "consent",
        "political",
        "obligation",
        "end",
        "government",
        "consent",
        "political",
        "obligation",
        "end",
        "government",
        "direct",
        "reading",
        "locke",
        "political",
        "philosophy",
        "find",
        "concept",
        "consent",
        "playing",
        "central",
        "role",
        "analysis",
        "begin",
        "individual",
        "state",
        "nature",
        "subject",
        "common",
        "legitimate",
        "authority",
        "power",
        "legislate",
        "adjudicate",
        "dispute",
        "natural",
        "state",
        "freedom",
        "independence",
        "locke",
        "stress",
        "individual",
        "consent",
        "mechanism",
        "political",
        "society",
        "created",
        "individual",
        "join",
        "society",
        "course",
        "general",
        "obligation",
        "right",
        "people",
        "law",
        "nature",
        "special",
        "obligation",
        "come",
        "voluntarily",
        "undertake",
        "locke",
        "clearly",
        "state",
        "one",
        "become",
        "full",
        "member",
        "society",
        "act",
        "express",
        "consent",
        "two",
        "treatise",
        "literature",
        "locke",
        "theory",
        "consent",
        "tends",
        "focus",
        "locke",
        "successfully",
        "answer",
        "following",
        "objection",
        "people",
        "actually",
        "consented",
        "government",
        "almost",
        "government",
        "actually",
        "legitimate",
        "conclusion",
        "problematic",
        "since",
        "clearly",
        "contrary",
        "locke",
        "intention",
        "locke",
        "obvious",
        "solution",
        "problem",
        "doctrine",
        "tacit",
        "consent",
        "simply",
        "walking",
        "along",
        "highway",
        "country",
        "person",
        "give",
        "tacit",
        "consent",
        "government",
        "agrees",
        "obey",
        "living",
        "territory",
        "locke",
        "think",
        "explains",
        "resident",
        "alien",
        "obligation",
        "obey",
        "law",
        "state",
        "reside",
        "though",
        "live",
        "inheriting",
        "property",
        "creates",
        "even",
        "stronger",
        "bond",
        "since",
        "original",
        "owner",
        "property",
        "permanently",
        "put",
        "property",
        "jurisdiction",
        "commonwealth",
        "child",
        "accept",
        "property",
        "parent",
        "consent",
        "jurisdiction",
        "commonwealth",
        "property",
        "two",
        "treatise",
        "debate",
        "whether",
        "inheritance",
        "property",
        "regarded",
        "tacit",
        "express",
        "consent",
        "one",
        "interpretation",
        "accepting",
        "property",
        "locke",
        "think",
        "person",
        "becomes",
        "full",
        "member",
        "society",
        "implies",
        "must",
        "regard",
        "act",
        "express",
        "consent",
        "grant",
        "suggests",
        "locke",
        "ideal",
        "would",
        "explicit",
        "mechanism",
        "society",
        "whereupon",
        "adult",
        "would",
        "give",
        "express",
        "consent",
        "would",
        "precondition",
        "inheriting",
        "property",
        "interpretation",
        "locke",
        "recognized",
        "people",
        "inheriting",
        "property",
        "process",
        "make",
        "explicit",
        "declaration",
        "political",
        "obligation",
        "however",
        "debate",
        "resolved",
        "current",
        "previously",
        "existing",
        "society",
        "many",
        "people",
        "never",
        "given",
        "express",
        "consent",
        "thus",
        "version",
        "tacit",
        "consent",
        "seems",
        "needed",
        "explain",
        "government",
        "could",
        "still",
        "legitimate",
        "simmons",
        "find",
        "difficult",
        "see",
        "merely",
        "walking",
        "street",
        "inheriting",
        "land",
        "thought",
        "example",
        "deliberate",
        "voluntary",
        "alienating",
        "right",
        "simmons",
        "one",
        "thing",
        "argues",
        "person",
        "consent",
        "action",
        "rather",
        "word",
        "quite",
        "another",
        "claim",
        "person",
        "consented",
        "without",
        "aware",
        "done",
        "require",
        "person",
        "leave",
        "behind",
        "property",
        "emigrate",
        "order",
        "avoid",
        "giving",
        "tacit",
        "consent",
        "create",
        "situation",
        "continued",
        "residence",
        "free",
        "voluntary",
        "choice",
        "simmons",
        "approach",
        "agree",
        "locke",
        "real",
        "consent",
        "necessary",
        "political",
        "obligation",
        "disagree",
        "whether",
        "people",
        "fact",
        "given",
        "kind",
        "consent",
        "simmons",
        "claim",
        "locke",
        "argument",
        "push",
        "toward",
        "philosophical",
        "anarchism",
        "position",
        "people",
        "moral",
        "obligation",
        "obey",
        "government",
        "even",
        "though",
        "locke",
        "would",
        "made",
        "claim",
        "hannah",
        "pitkin",
        "take",
        "different",
        "approach",
        "claim",
        "logic",
        "locke",
        "argument",
        "make",
        "consent",
        "far",
        "le",
        "important",
        "practice",
        "might",
        "appear",
        "tacit",
        "consent",
        "indeed",
        "watering",
        "concept",
        "consent",
        "locke",
        "basic",
        "content",
        "government",
        "like",
        "set",
        "natural",
        "law",
        "consent",
        "consent",
        "truly",
        "foundational",
        "locke",
        "scheme",
        "would",
        "discover",
        "legitimate",
        "power",
        "given",
        "government",
        "finding",
        "contract",
        "original",
        "founder",
        "signed",
        "pitkin",
        "however",
        "think",
        "locke",
        "form",
        "power",
        "government",
        "determined",
        "natural",
        "law",
        "really",
        "matter",
        "therefore",
        "previous",
        "act",
        "consent",
        "quality",
        "present",
        "government",
        "whether",
        "corresponds",
        "natural",
        "law",
        "requires",
        "locke",
        "think",
        "example",
        "walking",
        "street",
        "inheriting",
        "property",
        "tyrannical",
        "regime",
        "mean",
        "consented",
        "regime",
        "thus",
        "quality",
        "government",
        "act",
        "actual",
        "consent",
        "determine",
        "whether",
        "government",
        "legitimate",
        "simmons",
        "object",
        "interpretation",
        "saying",
        "fails",
        "account",
        "many",
        "place",
        "locke",
        "indeed",
        "say",
        "person",
        "acquires",
        "political",
        "obligation",
        "consent",
        "john",
        "dunn",
        "take",
        "still",
        "different",
        "approach",
        "claim",
        "anachronistic",
        "read",
        "locke",
        "modern",
        "conception",
        "count",
        "consent",
        "modern",
        "theory",
        "insist",
        "consent",
        "truly",
        "consent",
        "deliberate",
        "voluntary",
        "locke",
        "concept",
        "consent",
        "far",
        "broader",
        "locke",
        "enough",
        "people",
        "unwilling",
        "voluntary",
        "acquiescence",
        "dunn",
        "interpretation",
        "needed",
        "evidence",
        "dunn",
        "point",
        "fact",
        "many",
        "instance",
        "consent",
        "locke",
        "us",
        "consenting",
        "use",
        "money",
        "make",
        "sense",
        "broad",
        "interpretation",
        "simmons",
        "object",
        "ignores",
        "instance",
        "locke",
        "talk",
        "consent",
        "deliberate",
        "choice",
        "case",
        "would",
        "make",
        "locke",
        "consistent",
        "price",
        "making",
        "unconvincing",
        "recent",
        "scholarship",
        "continued",
        "probe",
        "issue",
        "davis",
        "closely",
        "examines",
        "locke",
        "terminology",
        "argues",
        "must",
        "distinguish",
        "political",
        "society",
        "legitimate",
        "government",
        "expressly",
        "consented",
        "member",
        "political",
        "society",
        "government",
        "exercise",
        "legitimate",
        "authority",
        "various",
        "type",
        "people",
        "consented",
        "government",
        "supreme",
        "respect",
        "sovereign",
        "also",
        "argues",
        "one",
        "could",
        "give",
        "actual",
        "consent",
        "locke",
        "day",
        "declaring",
        "one",
        "intent",
        "cast",
        "vote",
        "rather",
        "voting",
        "particular",
        "candidate",
        "former",
        "plausibly",
        "interpreted",
        "act",
        "affirmative",
        "consent",
        "member",
        "political",
        "society",
        "registering",
        "vote",
        "opposed",
        "actually",
        "voting",
        "would",
        "contemporary",
        "analogue",
        "van",
        "der",
        "vossen",
        "make",
        "related",
        "argument",
        "claiming",
        "initial",
        "consent",
        "property",
        "owner",
        "mechanism",
        "government",
        "come",
        "rule",
        "particular",
        "territory",
        "rather",
        "locke",
        "think",
        "people",
        "probably",
        "father",
        "initially",
        "simply",
        "begin",
        "exercising",
        "political",
        "authority",
        "people",
        "tacitly",
        "consent",
        "tacit",
        "consent",
        "sufficient",
        "justify",
        "rudimentary",
        "state",
        "rule",
        "consenters",
        "treaty",
        "government",
        "would",
        "fix",
        "territorial",
        "border",
        "hoff",
        "go",
        "still",
        "arguing",
        "need",
        "even",
        "think",
        "specific",
        "act",
        "tacit",
        "consent",
        "deciding",
        "emigrate",
        "necessary",
        "generating",
        "political",
        "obligation",
        "instead",
        "consent",
        "implied",
        "government",
        "function",
        "way",
        "show",
        "answerable",
        "people",
        "related",
        "question",
        "extent",
        "obligation",
        "consent",
        "given",
        "interpretive",
        "school",
        "influenced",
        "strauss",
        "emphasizes",
        "primacy",
        "preservation",
        "since",
        "duty",
        "natural",
        "law",
        "apply",
        "preservation",
        "threatened",
        "two",
        "treatise",
        "obligation",
        "cease",
        "case",
        "preservation",
        "directly",
        "threatened",
        "important",
        "implication",
        "consider",
        "soldier",
        "sent",
        "mission",
        "death",
        "extremely",
        "likely",
        "grant",
        "point",
        "locke",
        "belief",
        "soldier",
        "desert",
        "mission",
        "justly",
        "sentenced",
        "death",
        "grant",
        "take",
        "locke",
        "claiming",
        "desertion",
        "law",
        "legitimate",
        "sense",
        "blamelessly",
        "enforced",
        "something",
        "hobbes",
        "would",
        "grant",
        "also",
        "imply",
        "moral",
        "obligation",
        "part",
        "soldier",
        "give",
        "life",
        "common",
        "good",
        "something",
        "hobbes",
        "would",
        "deny",
        "according",
        "grant",
        "locke",
        "think",
        "act",
        "consent",
        "fact",
        "extend",
        "case",
        "living",
        "commitment",
        "risk",
        "life",
        "decision",
        "enter",
        "political",
        "society",
        "permanent",
        "one",
        "precisely",
        "reason",
        "society",
        "defended",
        "people",
        "revoke",
        "consent",
        "help",
        "protect",
        "attacked",
        "act",
        "consent",
        "made",
        "entering",
        "political",
        "society",
        "would",
        "pointless",
        "since",
        "political",
        "community",
        "would",
        "fail",
        "point",
        "needed",
        "people",
        "make",
        "calculated",
        "decision",
        "enter",
        "society",
        "risk",
        "dying",
        "combat",
        "part",
        "calculation",
        "grant",
        "also",
        "think",
        "locke",
        "recognizes",
        "duty",
        "based",
        "reciprocity",
        "since",
        "others",
        "risk",
        "life",
        "well",
        "approach",
        "focus",
        "locke",
        "doctrine",
        "consent",
        "solution",
        "problem",
        "political",
        "obligation",
        "different",
        "approach",
        "asks",
        "role",
        "consent",
        "play",
        "determining",
        "legitimate",
        "end",
        "government",
        "pursue",
        "one",
        "part",
        "debate",
        "captured",
        "debate",
        "seliger",
        "kendall",
        "former",
        "viewing",
        "locke",
        "constitutionalist",
        "latter",
        "viewing",
        "giving",
        "almost",
        "unlimited",
        "power",
        "majority",
        "former",
        "interpretation",
        "constitution",
        "created",
        "consent",
        "people",
        "part",
        "creation",
        "commonwealth",
        "latter",
        "interpretation",
        "people",
        "create",
        "legislature",
        "rule",
        "majority",
        "vote",
        "third",
        "view",
        "advanced",
        "tuckness",
        "a",
        "hold",
        "locke",
        "flexible",
        "point",
        "gave",
        "people",
        "considerable",
        "flexibility",
        "constitutional",
        "drafting",
        "second",
        "part",
        "debate",
        "focus",
        "end",
        "rather",
        "institution",
        "locke",
        "state",
        "two",
        "treatise",
        "power",
        "government",
        "limited",
        "public",
        "good",
        "power",
        "hath",
        "end",
        "preservation",
        "therefore",
        "justify",
        "killing",
        "enslaving",
        "plundering",
        "citizen",
        "libertarian",
        "like",
        "nozick",
        "read",
        "stating",
        "government",
        "exist",
        "protect",
        "people",
        "infringement",
        "right",
        "alternate",
        "interpretation",
        "advanced",
        "tuckness",
        "b",
        "a",
        "draw",
        "attention",
        "fact",
        "following",
        "sentence",
        "formulation",
        "natural",
        "law",
        "locke",
        "focus",
        "positive",
        "one",
        "much",
        "possible",
        "mankind",
        "preserved",
        "second",
        "reading",
        "government",
        "limited",
        "fulfilling",
        "purpose",
        "natural",
        "law",
        "include",
        "positive",
        "goal",
        "well",
        "negative",
        "right",
        "view",
        "power",
        "promote",
        "common",
        "good",
        "extends",
        "action",
        "designed",
        "increase",
        "population",
        "improve",
        "military",
        "strengthen",
        "economy",
        "infrastructure",
        "provided",
        "step",
        "indirectly",
        "useful",
        "goal",
        "preserving",
        "society",
        "would",
        "explain",
        "locke",
        "letter",
        "describes",
        "government",
        "promotion",
        "arm",
        "rich",
        "multitude",
        "citizen",
        "proper",
        "remedy",
        "danger",
        "foreign",
        "attack",
        "work"
    ]
}