{
    "main_text": "Inductive Logic and Inductive Probabilities || The Historical Origins of Probabilistic Logic\n2.1 The Historical Origins of Probabilistic Logic\n\nThe mathematical study of probability originated with Blaise Pascal\nand Pierre de Fermat in the mid-17th century. From that\ntime through the early 19th century, as the mathematical\ntheory continued to develop, probability theory was primarily applied\nto the assessment of risk in games of chance and to drawing simple\nstatistical inferences about characteristics of large\npopulations—e.g., to compute appropriate life insurance premiums\nbased on mortality rates. In the early 19th century Pierre\nde Laplace made further theoretical advances and showed how to apply\nprobabilistic reasoning to a much wider range of scientific and\npractical problems. Since that time probability has become an\nindispensable tool in the sciences, business, and many other areas of\nmodern life.\n\nThroughout the development of probability theory various researchers appear to have thought of it as a kind of logic. But the first extended treatment of\nprobability as an explicit part of logic was George Boole’s\nThe Laws of Thought (1854). John Venn followed two decades\nlater with an alternative empirical frequentist account of probability\nin The Logic of Chance (1876). Not long after that the whole\ndiscipline of logic was transformed by new developments in deductive\nlogic.\n\nIn the late 19th and early 20th century Frege,\nfollowed by Russell and Whitehead, showed how deductive logic may be\nrepresented in the kind of rigorous formal system we now call\nquantified predicate logic. For the\nfirst time logicians had a fully formal deductive logic powerful\nenough to represent all valid deductive arguments that arise in\nmathematics and the sciences. In this logic the validity of deductive\narguments depends only on the logical structure of the sentences\ninvolved. This development in deductive logic spurred some logicians\nto attempt to apply a similar approach to inductive reasoning. The\nidea was to extend the deductive entailment relation to a notion of\nprobabilistic entailment for cases where premises provide\nless than conclusive support for conclusions. These partial\nentailments are expressed in terms of conditional\nprobabilities, probabilities of the form \\(P[C \\pmid B] = r\\)\n(read “the probability of C given B is\nr”), where P is a probability function, C\nis a conclusion sentence, B is a conjunction of premise\nsentences, and r is the probabilistic degree of support that\npremises B provide for conclusion C. Attempts to develop\nsuch a logic vary somewhat with regard to the ways in which they attempt to\nemulate the paradigm of formal deductive logic.\n\nSome inductive logicians have tried to follow the deductive paradigm\nby attempting to specify inductive support probabilities solely in\nterms of the syntactic structures of premise and conclusion sentences.\nIn deductive logic the syntactic structure of the sentences involved\ncompletely determines whether premises logically entail a conclusion.\nSo these inductive logicians have attempted to follow suit. \nIn such a system each sentence confers a\nsyntactically specified degree of support on each of the other\nsentences of the language. Thus, the inductive probabilities in such a\nsystem are logical in the sense that they depend on syntactic\nstructure alone. This kind of conception was articulated to some\nextent by John Maynard Keynes in his Treatise on Probability\n(1921). Rudolf Carnap pursued this idea with greater rigor in his\nLogical Foundations of Probability (1950) and in several\nsubsequent works (e.g., Carnap 1952). (For details of Carnap’s\napproach see the section on\n logical probability\n in the entry on\n interpretations of the probability calculus,\n in this Encyclopedia.) \n\nIn the inductive logics of Keynes and Carnap, Bayes’ theorem, a\nstraightforward theorem of probability theory, plays a central role in\nexpressing how evidence comes to bear on hypotheses. Bayes’\ntheorem expresses\nhow the probability of a hypothesis h on the evidence\ne, \\(P[h \\pmid e]\\), depends on the probability that e\nshould occur if h is true, \\(P[e \\pmid h]\\), and on the\nprobability of hypothesis h prior to taking the\nevidence into account, \\(P[h]\\) (called the prior probability\nof h). (Later we’ll examine Bayes’ theorem in detail.) So, such approaches might well be called Bayesian\nlogicist inductive logics. Other prominent Bayesian logicist\nattempts to develop a probabilistic inductive logic include the works\nof Jeffreys (1939), Jaynes (1968), and Rosenkrantz (1981).\n\nIt is now widely held that the core idea of this syntactic approach to\nBayesian logicism is fatally flawed—that syntactic logical\nstructure cannot be the sole determiner of the degree to which\npremises inductively support conclusions. A crucial facet of the\nproblem faced by syntactic Bayesian logicism involves how the logic is\nsupposed to apply in scientific contexts where the conclusion sentence\nis some scientific hypothesis or theory, and the premises are evidence\nclaims. The difficulty is that in any probabilistic logic\nthat satisfies the usual axioms for probabilities, the inductive\nsupport for a hypothesis must depend in part on its prior\nprobability. This prior probability represents\n(arguably) how plausible the hypothesis is taken to be on the basis of\nconsiderations other than the observational and experimental evidence\n(e.g., perhaps due to various plausibility arguments). A syntactic\nBayesian logicist must tell us how to assign values to these\npre-evidential prior probabilities of hypotheses in a way\nthat relies only on the syntactic logical structure of the hypothesis,\nperhaps based on some measure of syntactic simplicity. There are\nsevere problems with getting this idea to work. Various\nkinds of examples seem to show that such an approach must assign\nintuitively quite unreasonable prior probabilities to hypotheses in\nspecific cases (see the footnote cited near the end of\n Section 3.2\n for details). Furthermore, for this idea to apply to the evidential\nsupport of real scientific theories, scientists would have to\nformalize theories in a way that makes their relevant syntactic\nstructures apparent, and then evaluate theories solely on that\nsyntactic basis (together with their syntactic relationships to\nevidence statements). Are we to evaluate alternative theories of\ngravitation, and alternative quantum theories, this way? This seems an\nextremely dubious approach to the evaluation of real scientific\nhypotheses and theories. Thus, it seems that logical structure alone\nmay not suffice for the inductive evaluation of scientific hypotheses.\n(This issue will be treated in more detail in\n Section 3,\n after we first see how probabilistic logics employ Bayes’\ntheorem to represent the evidential support for hypotheses as a\nfunction of prior probabilities together with\nevidential likelihoods.)\n\nAt about the time that the syntactic Bayesian logicist idea was\ndeveloping, an alternative conception of probabilistic inductive\nreasoning was also emerging. This approach is now generally referred\nto as the Bayesian subjectivist or personalist\napproach to inductive reasoning (see, e.g., Ramsey 1926; De Finetti\n1937; Savage 1954; Edwards, Lindman, & Savage 1963; Jeffrey 1983,\n1992; Howson & Urbach 1993; Joyce 1999). This approach treats\ninductive probability as a measure of an agent’s\ndegree-of-belief that a hypothesis is true, given the truth\nof the evidence. This approach was originally developed as part of a\nlarger normative theory of belief and action known as Bayesian\ndecision theory. The principal idea is that the strength of an\nagent’s desires for various possible outcomes should combine\nwith her belief-strengths regarding claims about the world to produce\noptimally rational decisions. Bayesian subjectivists provide a logic\nof decision that captures this idea, and they attempt to justify this\nlogic by showing that in principle it leads to optimal decisions about\nwhich of various risky alternatives should be pursued. On the Bayesian\nsubjectivist or personalist account of inductive probability,\ninductive probability functions represent the subjective (or personal)\nbelief-strengths of ideally rational agents, the kind of belief\nstrengths that figure into rational decision making. (See the section\non\n subjective probability\n in the entry on\n interpretations of the probability calculus,\n in this Encyclopedia.)\n\nElements of a logicist conception of inductive logic live on today as\npart of the general approach called Bayesian inductive logic.\nHowever, among philosophers and statisticians the term\n‘Bayesian’ is now most closely associated with the\nsubjectivist or personalist account of belief and decision. And the\nterm ‘Bayesian inductive logic’ has come to carry the\nconnotation of a logic that involves purely subjective probabilities.\nThis usage is misleading since, for inductive logics, the\nBayesian/non-Bayesian distinction should really turn on whether the\nlogic gives Bayes’ theorem a prominent role, or the approach largely eschews the use of Bayes’ theorem in inductive\ninferences, as do the classical approaches to statistical\ninference developed by R. A. Fisher (1922) and by Neyman & Pearson\n(1967)). Indeed, any inductive logic that employs the same probability\nfunctions to represent both the probabilities of evidence claims\ndue to hypotheses and the probabilities of hypotheses due to\nthose evidence claims must be a Bayesian inductive logic\nin this broader sense; because Bayes’ theorem follows directly\nfrom the axioms that each probability function must satisfy, and\nBayes’ theorem expresses a necessary connection between the\nprobabilities of evidence claims due to hypotheses and the\nprobabilities of hypotheses due to those evidence claims.\n\nIn this article the probabilistic inductive logic we will\nexamine is a Bayesian inductive logic in this broader sense.\nThis logic will not presuppose the subjectivist Bayesian\ntheory of belief and decision, and will avoid the objectionable\nfeatures of the syntactic version of Bayesian logicism. We will see\nthat there are good reasons to distinguish inductive\nprobabilities from degree-of-belief probabilities and\nfrom purely syntactic logical probabilities. So, the\nprobabilistic logic articulated in this article will be presented in a\nway that depends on neither of these conceptions of what the\nprobability functions are. However, this version of the logic\nwill be general enough that it may be fitted to a Bayesian\nsubjectivist or Bayesian syntactic-logicist program, if one desires to\ndo that.\n",
    "section_title": "2.1 The Historical Origins of Probabilistic Logic",
    "entry_title": "Inductive Logic",
    "hierarchy_title": "Inductive Logic || Inductive Logic and Inductive Probabilities || The Historical Origins of Probabilistic Logic",
    "tokenized_text": [
        "inductive",
        "logic",
        "inductive",
        "probability",
        "historical",
        "origin",
        "probabilistic",
        "logic",
        "historical",
        "origin",
        "probabilistic",
        "logic",
        "mathematical",
        "study",
        "probability",
        "originated",
        "blaise",
        "pascal",
        "pierre",
        "de",
        "fermat",
        "midth",
        "century",
        "time",
        "early",
        "th",
        "century",
        "mathematical",
        "theory",
        "continued",
        "develop",
        "probability",
        "theory",
        "primarily",
        "applied",
        "assessment",
        "risk",
        "game",
        "chance",
        "drawing",
        "simple",
        "statistical",
        "inference",
        "characteristic",
        "large",
        "populationseg",
        "compute",
        "appropriate",
        "life",
        "insurance",
        "premium",
        "based",
        "mortality",
        "rate",
        "early",
        "th",
        "century",
        "pierre",
        "de",
        "laplace",
        "made",
        "theoretical",
        "advance",
        "showed",
        "apply",
        "probabilistic",
        "reasoning",
        "much",
        "wider",
        "range",
        "scientific",
        "practical",
        "problem",
        "since",
        "time",
        "probability",
        "become",
        "indispensable",
        "tool",
        "science",
        "business",
        "many",
        "area",
        "modern",
        "life",
        "throughout",
        "development",
        "probability",
        "theory",
        "various",
        "researcher",
        "appear",
        "thought",
        "kind",
        "logic",
        "first",
        "extended",
        "treatment",
        "probability",
        "explicit",
        "part",
        "logic",
        "george",
        "boole",
        "law",
        "thought",
        "john",
        "venn",
        "followed",
        "two",
        "decade",
        "later",
        "alternative",
        "empirical",
        "frequentist",
        "account",
        "probability",
        "logic",
        "chance",
        "long",
        "whole",
        "discipline",
        "logic",
        "transformed",
        "new",
        "development",
        "deductive",
        "logic",
        "late",
        "th",
        "early",
        "th",
        "century",
        "frege",
        "followed",
        "russell",
        "whitehead",
        "showed",
        "deductive",
        "logic",
        "may",
        "represented",
        "kind",
        "rigorous",
        "formal",
        "system",
        "call",
        "quantified",
        "predicate",
        "logic",
        "first",
        "time",
        "logician",
        "fully",
        "formal",
        "deductive",
        "logic",
        "powerful",
        "enough",
        "represent",
        "valid",
        "deductive",
        "argument",
        "arise",
        "mathematics",
        "science",
        "logic",
        "validity",
        "deductive",
        "argument",
        "depends",
        "logical",
        "structure",
        "sentence",
        "involved",
        "development",
        "deductive",
        "logic",
        "spurred",
        "logician",
        "attempt",
        "apply",
        "similar",
        "approach",
        "inductive",
        "reasoning",
        "idea",
        "extend",
        "deductive",
        "entailment",
        "relation",
        "notion",
        "probabilistic",
        "entailment",
        "case",
        "premise",
        "provide",
        "le",
        "conclusive",
        "support",
        "conclusion",
        "partial",
        "entailment",
        "expressed",
        "term",
        "conditional",
        "probability",
        "probability",
        "form",
        "p",
        "c",
        "pmid",
        "b",
        "r",
        "read",
        "probability",
        "c",
        "given",
        "b",
        "r",
        "p",
        "probability",
        "function",
        "c",
        "conclusion",
        "sentence",
        "b",
        "conjunction",
        "premise",
        "sentence",
        "r",
        "probabilistic",
        "degree",
        "support",
        "premise",
        "b",
        "provide",
        "conclusion",
        "c",
        "attempt",
        "develop",
        "logic",
        "vary",
        "somewhat",
        "regard",
        "way",
        "attempt",
        "emulate",
        "paradigm",
        "formal",
        "deductive",
        "logic",
        "inductive",
        "logician",
        "tried",
        "follow",
        "deductive",
        "paradigm",
        "attempting",
        "specify",
        "inductive",
        "support",
        "probability",
        "solely",
        "term",
        "syntactic",
        "structure",
        "premise",
        "conclusion",
        "sentence",
        "deductive",
        "logic",
        "syntactic",
        "structure",
        "sentence",
        "involved",
        "completely",
        "determines",
        "whether",
        "premise",
        "logically",
        "entail",
        "conclusion",
        "inductive",
        "logician",
        "attempted",
        "follow",
        "suit",
        "system",
        "sentence",
        "confers",
        "syntactically",
        "specified",
        "degree",
        "support",
        "sentence",
        "language",
        "thus",
        "inductive",
        "probability",
        "system",
        "logical",
        "sense",
        "depend",
        "syntactic",
        "structure",
        "alone",
        "kind",
        "conception",
        "articulated",
        "extent",
        "john",
        "maynard",
        "keynes",
        "treatise",
        "probability",
        "rudolf",
        "carnap",
        "pursued",
        "idea",
        "greater",
        "rigor",
        "logical",
        "foundation",
        "probability",
        "several",
        "subsequent",
        "work",
        "eg",
        "carnap",
        "detail",
        "carnap",
        "approach",
        "see",
        "section",
        "logical",
        "probability",
        "entry",
        "interpretation",
        "probability",
        "calculus",
        "encyclopedia",
        "inductive",
        "logic",
        "keynes",
        "carnap",
        "bayes",
        "theorem",
        "straightforward",
        "theorem",
        "probability",
        "theory",
        "play",
        "central",
        "role",
        "expressing",
        "evidence",
        "come",
        "bear",
        "hypothesis",
        "bayes",
        "theorem",
        "express",
        "probability",
        "hypothesis",
        "h",
        "evidence",
        "e",
        "p",
        "h",
        "pmid",
        "e",
        "depends",
        "probability",
        "e",
        "occur",
        "h",
        "true",
        "p",
        "e",
        "pmid",
        "h",
        "probability",
        "hypothesis",
        "h",
        "prior",
        "taking",
        "evidence",
        "account",
        "p",
        "h",
        "called",
        "prior",
        "probability",
        "h",
        "later",
        "examine",
        "bayes",
        "theorem",
        "detail",
        "approach",
        "might",
        "well",
        "called",
        "bayesian",
        "logicist",
        "inductive",
        "logic",
        "prominent",
        "bayesian",
        "logicist",
        "attempt",
        "develop",
        "probabilistic",
        "inductive",
        "logic",
        "include",
        "work",
        "jeffreys",
        "jaynes",
        "rosenkrantz",
        "widely",
        "held",
        "core",
        "idea",
        "syntactic",
        "approach",
        "bayesian",
        "logicism",
        "fatally",
        "flawedthat",
        "syntactic",
        "logical",
        "structure",
        "sole",
        "determiner",
        "degree",
        "premise",
        "inductively",
        "support",
        "conclusion",
        "crucial",
        "facet",
        "problem",
        "faced",
        "syntactic",
        "bayesian",
        "logicism",
        "involves",
        "logic",
        "supposed",
        "apply",
        "scientific",
        "context",
        "conclusion",
        "sentence",
        "scientific",
        "hypothesis",
        "theory",
        "premise",
        "evidence",
        "claim",
        "difficulty",
        "probabilistic",
        "logic",
        "satisfies",
        "usual",
        "axiom",
        "probability",
        "inductive",
        "support",
        "hypothesis",
        "must",
        "depend",
        "part",
        "prior",
        "probability",
        "prior",
        "probability",
        "represents",
        "arguably",
        "plausible",
        "hypothesis",
        "taken",
        "basis",
        "consideration",
        "observational",
        "experimental",
        "evidence",
        "eg",
        "perhaps",
        "due",
        "various",
        "plausibility",
        "argument",
        "syntactic",
        "bayesian",
        "logicist",
        "must",
        "tell",
        "u",
        "assign",
        "value",
        "preevidential",
        "prior",
        "probability",
        "hypothesis",
        "way",
        "relies",
        "syntactic",
        "logical",
        "structure",
        "hypothesis",
        "perhaps",
        "based",
        "measure",
        "syntactic",
        "simplicity",
        "severe",
        "problem",
        "getting",
        "idea",
        "work",
        "various",
        "kind",
        "example",
        "seem",
        "show",
        "approach",
        "must",
        "assign",
        "intuitively",
        "quite",
        "unreasonable",
        "prior",
        "probability",
        "hypothesis",
        "specific",
        "case",
        "see",
        "footnote",
        "cited",
        "near",
        "end",
        "section",
        "detail",
        "furthermore",
        "idea",
        "apply",
        "evidential",
        "support",
        "real",
        "scientific",
        "theory",
        "scientist",
        "would",
        "formalize",
        "theory",
        "way",
        "make",
        "relevant",
        "syntactic",
        "structure",
        "apparent",
        "evaluate",
        "theory",
        "solely",
        "syntactic",
        "basis",
        "together",
        "syntactic",
        "relationship",
        "evidence",
        "statement",
        "evaluate",
        "alternative",
        "theory",
        "gravitation",
        "alternative",
        "quantum",
        "theory",
        "way",
        "seems",
        "extremely",
        "dubious",
        "approach",
        "evaluation",
        "real",
        "scientific",
        "hypothesis",
        "theory",
        "thus",
        "seems",
        "logical",
        "structure",
        "alone",
        "may",
        "suffice",
        "inductive",
        "evaluation",
        "scientific",
        "hypothesis",
        "issue",
        "treated",
        "detail",
        "section",
        "first",
        "see",
        "probabilistic",
        "logic",
        "employ",
        "bayes",
        "theorem",
        "represent",
        "evidential",
        "support",
        "hypothesis",
        "function",
        "prior",
        "probability",
        "together",
        "evidential",
        "likelihood",
        "time",
        "syntactic",
        "bayesian",
        "logicist",
        "idea",
        "developing",
        "alternative",
        "conception",
        "probabilistic",
        "inductive",
        "reasoning",
        "also",
        "emerging",
        "approach",
        "generally",
        "referred",
        "bayesian",
        "subjectivist",
        "personalist",
        "approach",
        "inductive",
        "reasoning",
        "see",
        "eg",
        "ramsey",
        "de",
        "finetti",
        "savage",
        "edward",
        "lindman",
        "savage",
        "jeffrey",
        "howson",
        "urbach",
        "joyce",
        "approach",
        "treat",
        "inductive",
        "probability",
        "measure",
        "agent",
        "degreeofbelief",
        "hypothesis",
        "true",
        "given",
        "truth",
        "evidence",
        "approach",
        "originally",
        "developed",
        "part",
        "larger",
        "normative",
        "theory",
        "belief",
        "action",
        "known",
        "bayesian",
        "decision",
        "theory",
        "principal",
        "idea",
        "strength",
        "agent",
        "desire",
        "various",
        "possible",
        "outcome",
        "combine",
        "beliefstrengths",
        "regarding",
        "claim",
        "world",
        "produce",
        "optimally",
        "rational",
        "decision",
        "bayesian",
        "subjectivist",
        "provide",
        "logic",
        "decision",
        "capture",
        "idea",
        "attempt",
        "justify",
        "logic",
        "showing",
        "principle",
        "lead",
        "optimal",
        "decision",
        "various",
        "risky",
        "alternative",
        "pursued",
        "bayesian",
        "subjectivist",
        "personalist",
        "account",
        "inductive",
        "probability",
        "inductive",
        "probability",
        "function",
        "represent",
        "subjective",
        "personal",
        "beliefstrengths",
        "ideally",
        "rational",
        "agent",
        "kind",
        "belief",
        "strength",
        "figure",
        "rational",
        "decision",
        "making",
        "see",
        "section",
        "subjective",
        "probability",
        "entry",
        "interpretation",
        "probability",
        "calculus",
        "encyclopedia",
        "element",
        "logicist",
        "conception",
        "inductive",
        "logic",
        "live",
        "today",
        "part",
        "general",
        "approach",
        "called",
        "bayesian",
        "inductive",
        "logic",
        "however",
        "among",
        "philosopher",
        "statistician",
        "term",
        "bayesian",
        "closely",
        "associated",
        "subjectivist",
        "personalist",
        "account",
        "belief",
        "decision",
        "term",
        "bayesian",
        "inductive",
        "logic",
        "come",
        "carry",
        "connotation",
        "logic",
        "involves",
        "purely",
        "subjective",
        "probability",
        "usage",
        "misleading",
        "since",
        "inductive",
        "logic",
        "bayesiannonbayesian",
        "distinction",
        "really",
        "turn",
        "whether",
        "logic",
        "give",
        "bayes",
        "theorem",
        "prominent",
        "role",
        "approach",
        "largely",
        "eschews",
        "use",
        "bayes",
        "theorem",
        "inductive",
        "inference",
        "classical",
        "approach",
        "statistical",
        "inference",
        "developed",
        "r",
        "a",
        "fisher",
        "neyman",
        "pearson",
        "indeed",
        "inductive",
        "logic",
        "employ",
        "probability",
        "function",
        "represent",
        "probability",
        "evidence",
        "claim",
        "due",
        "hypothesis",
        "probability",
        "hypothesis",
        "due",
        "evidence",
        "claim",
        "must",
        "bayesian",
        "inductive",
        "logic",
        "broader",
        "sense",
        "bayes",
        "theorem",
        "follows",
        "directly",
        "axiom",
        "probability",
        "function",
        "must",
        "satisfy",
        "bayes",
        "theorem",
        "express",
        "necessary",
        "connection",
        "probability",
        "evidence",
        "claim",
        "due",
        "hypothesis",
        "probability",
        "hypothesis",
        "due",
        "evidence",
        "claim",
        "article",
        "probabilistic",
        "inductive",
        "logic",
        "examine",
        "bayesian",
        "inductive",
        "logic",
        "broader",
        "sense",
        "logic",
        "presuppose",
        "subjectivist",
        "bayesian",
        "theory",
        "belief",
        "decision",
        "avoid",
        "objectionable",
        "feature",
        "syntactic",
        "version",
        "bayesian",
        "logicism",
        "see",
        "good",
        "reason",
        "distinguish",
        "inductive",
        "probability",
        "degreeofbelief",
        "probability",
        "purely",
        "syntactic",
        "logical",
        "probability",
        "probabilistic",
        "logic",
        "articulated",
        "article",
        "presented",
        "way",
        "depends",
        "neither",
        "conception",
        "probability",
        "function",
        "however",
        "version",
        "logic",
        "general",
        "enough",
        "may",
        "fitted",
        "bayesian",
        "subjectivist",
        "bayesian",
        "syntacticlogicist",
        "program",
        "one",
        "desire"
    ]
}