{
    "main_text": "David Hilbert and Paul Bernays\n8. David Hilbert and Paul Bernays\n\nLet us briefly take stock of the situation as it existed in 1915.\nPeirce had differentiated between first-order and second-order logic,\nbut had put the distinction to no mathematical use, and it dropped\nfrom sight. Both Frege and Russell had formulated versions of\nmulti-level type theory, but neither had singled out the first-order\nfragment as an object worthy of study. The American postulate\ntheorists, Edward Huntington and Oswald Veblen, had formulated various\nnotions of completeness and categoricity, and Veblen had remarked that\naxiomatic deducibility might diverge from semantic implication (Awodey\n& Reck 2002: 15–19). But Veblen did not possess a precise\ncharacterization of formal deduction, and his observation remained\ninert. Löwenheim had proved a deep theorem about what in\nretrospect could be characterized as first-order formulas,\nbut had not isolated a system of first order logic. A similar\npoint holds for Hermann Weyl, who in 1910 proposed (in effect) to use\nfirst-order logic to make precise the concept of “definite\nproperty” in Zermelo’s axiom of separation. But this, too,\nis a retrospective characterization, and Weyl’s interest was in\nset theory, not in the study of a system of first-order logic.\n\nThe next large step was taken by David Hilbert in his lecture course\nPrinzipien der Mathematik, delivered in Göttingen in the\nwinter semester of 1917/18. Hilbert had lectured and published on\nfoundational topics in the years 1899–1905; in the intervening\ntime, as he concentrated on other matters, the publications had\nceased, though the extensive classroom lecturing continued. He kept up\nwith current developments, and in particular was informed about the\nlogical work of Whitehead and Russell, largely through his student\nHeinrich Behmann. In September, 1917, he delivered his programmatic\nlecture “Axiomatisches Denken” in Zürich calling for\nan axiomatic treatment of logic along the lines he had earlier\nexplored in his axiomatization of geometry, and explicitly proposing\nmetalogical investigations:\n\n\nWhen we consider the matter more closely, we soon recognize that the\nquestion of the consistency for integers and for sets is not one that\nstands alone, but that it belongs to a vast domain of difficult\nepistemological questions which have a specifically mathematical tint:\nfor example (to characterize this domain of questions briefly), the\nproblem of the solvability in principle of every mathematical\nquestion, the problem of the subsequent checkability of the results of\na mathematical investigation, the question of a criterion of\nsimplicity for mathematical proofs, the question of the relationship\nbetween content and formalism in mathematics and logic, and finally\nthe problem of the decidability of a mathematical question in a finite\nnumber of operations. (Hilbert 1917: 412–413)\n\n\nIt was on this trip to Zürich that he invited Paul Bernays to\nreturn to Göttingen as his assistant in foundational matters.\nAlthough Bernays had little previous experience in foundations, this\nturned out to be a shrewd choice, and the beginning of a close and\nfruitful research partnership.\n\nThe Göttingen lectures that shortly followed the Zürich\naddress (and that were recorded in an official protocol by Bernays)\nare a remarkable document, and mark the birth of modern mathematical\nlogic. They are substantially the same as the published monograph\nknown as “Hilbert and Ackermann” (1928), and even today,\nwith modest supplementation, could serve as an introductory textbook\nfor logic. Hilbert for the first time clearly distinguishes\nmetalanguage from object language, and step-by-step presents a\nsequence of formal logical calculi of gradually increasing strength.\nEach calculus is carefully studied in its turn; its strengths and its\nweaknesses are identified and balanced, and the analysis of the\nweaknesses is used to prepare the transition to the next calculus. He\nbegins with the propositional calculus, then moves to monadic\nquantificational logic (with an extended discussion of the calculus of\nclasses, and of the Aristotelian syllogism), and then to the\n“function calculus”. \n\nThe function calculus is a system of (many-sorted) first-order logic,\nwith variables for sentences as well as for relations. It is here, for\nthe first time, that we encounter a precise, modern formulation of\nfirst-order logic, clearly differentiated from the other calculi,\ngiven an axiomatic foundation, and with metalogical questions\nexplicitly formulated. Hilbert concludes his discussion of first-order\nlogic with the remark: \n\n\nThe basic discussion of the logical calculus could cease here if we\nhad no other end in view for this calculus than the formalization of\nlogical inference. But we cannot be satisfied with this application of\nsymbolic logic. Not only do we want to be able to develop individual\ntheories from their principles in a purely formal way, but we also\nwant to investigate the foundations of the mathematical theories\nthemselves and examine how they are related to logic and how far they\ncan be built up from purely logical operations and concept formations;\nand for this purpose the logical calculus is to serve us as a tool.\n(1917/18: 188)\n\n\nThis leads him next to introduce higher-order logic, and thence to a\nconsideration of logical paradoxes and their resolution through\nRussell’s ramified theory of types; the axiom of reducibility is\nbriefly discussed and adopted as a foundation for mathematics. The\nlecture protocol ends with the sentence: \n\n\nThus it is clear that the introduction of the Axiom of Reducibility is\nthe appropriate means to turn the calculus of levels into a system out\nof which the foundations for higher mathematics can be developed. \n\n\nThis sentence appeared essentially unchanged when the 1917 lectures\nwere re-worked as the monograph (Hilbert & Ackermann 1928).\n\nIn the course of his lectures, Hilbert addresses the metalogical\nquestions he had stated in “Axiomatisches Denken”, and (at\nleast tacitly) shows how the questions of completeness, consistency,\nand decidability are to be answered for the propositional case. The\ncompleteness question for first-order logic is not explicitly raised\nin Bernays’s record of the lectures, though an attentive reader\nwould easily have recognized it as an open problem. The following\nsummer, Bernays produced a Habilitation thesis in which he\ndeveloped, with full rigor, a Hilbert-style, axiomatic analysis of\npropositional logic. He presents the axiomatic system as an\nuninterpreted formal calculus; provides it with a semantics; and then\nproves the completeness theorem linking the syntax to the semantics in\nthe form, “Every provable formula is universally valid, and vice\nversa”. He then proceeds to investigate questions of\ndecidability, consistency, and the mutual independence of various\ncombinations of axioms.\n\nThe Hilbert 1917 lectures and the 1918 Bernays Habilitation are a milestone in the\ndevelopment of first-order logic. In the lectures, for the first time,\nfirst-order logic is presented in its own right as an axiomatic\nlogical system, suitable for study using the new metalogical\ntechniques. It was those metalogical techniques that represented the\ncrucial advance over Peirce and Frege and Russell, and that were in\ntime to bring first-order logic into focus. But that did not happen at\nonce, and a great deal of work still lay ahead. In the 1917/18\nlectures Hilbert’s sequence of logical calculi were presented as\nstepping-stones on the way to full higher-order ramified type theory,\nwhich he continued to regard as the “right” logical\nframework for investigating the foundations of mathematics. It was\ncharacteristic of Hilbert to break complex mathematical phenomena into\ntheir elements: the sequence of calculi can be viewed as a\ndecomposition of higher-order logic into its simpler component parts,\nrevealing to his students precisely the steps that went into the\nbuilding of the full system. Although he discusses the functional\ncalculus, he does not single it out for special attention. In other\nwords (and as with Peirce three decades earlier) first-order logic is\nintroduced primarily as an expository device: its importance was not\nyet clear.\n\nMoreover, Hilbert’s own treatment of the metalogical issues is\nsomewhat hasty and informal. He experiments with several versions of\nthe concept of “completeness”: one has the sense that he\nwas rapidly breaking new ground, and was not yet certain which\nconcepts would prove the most fruitful. His proof of the completeness\nof propositional calculus is a mere sketch, and relegated to a\nfootnote; the parallel problem for first-order logic is not even\nraised as a conjecture. Even more strikingly, when Bernays eventually\nin 1926 published his Habilitation, he omitted his proof of the\ncompleteness theorem because (as he later ruefully said) the result\nseemed at the time straightforward and unimportant. (For discussion of\nthis point, see Hilbert [LFL]: 229. For readily available general\ndiscussions, see Sieg 1999, Zach 1999, and the essays collected in Sieg 2013; for the original\ndocuments and detailed analysis, see Hilbert [LFL.)\n\nIn other words, even in Göttingen in the 1920s a full\nunderstanding of the significance of the ideas Hilbert had introduced\nin 1917 was missing. The Hilbert school throughout the 1920s regarded\nfirst-order logic as a fragment of type theory, and made no argument\nfor it as a uniquely favored system. It was not until the monograph\nHilbert & Ackermann 1928 (and the contemporaneous “Bologna\nLecture”, Hilbert 1928) that Hilbert explicitly called attention\nto the completeness of first-order logic as an open question. That set\nthe stage for the work of Gödel: but before coming to that, we\nneed to take a chronological step backwards. \n",
    "section_title": "8. David Hilbert and Paul Bernays",
    "entry_title": "The Emergence of First-Order Logic",
    "hierarchy_title": "The Emergence of First-Order Logic || David Hilbert and Paul Bernays",
    "tokenized_text": [
        "david",
        "hilbert",
        "paul",
        "bernays",
        "david",
        "hilbert",
        "paul",
        "bernays",
        "let",
        "u",
        "briefly",
        "take",
        "stock",
        "situation",
        "existed",
        "peirce",
        "differentiated",
        "firstorder",
        "secondorder",
        "logic",
        "put",
        "distinction",
        "mathematical",
        "use",
        "dropped",
        "sight",
        "frege",
        "russell",
        "formulated",
        "version",
        "multilevel",
        "type",
        "theory",
        "neither",
        "singled",
        "firstorder",
        "fragment",
        "object",
        "worthy",
        "study",
        "american",
        "postulate",
        "theorist",
        "edward",
        "huntington",
        "oswald",
        "veblen",
        "formulated",
        "various",
        "notion",
        "completeness",
        "categoricity",
        "veblen",
        "remarked",
        "axiomatic",
        "deducibility",
        "might",
        "diverge",
        "semantic",
        "implication",
        "awodey",
        "reck",
        "veblen",
        "posse",
        "precise",
        "characterization",
        "formal",
        "deduction",
        "observation",
        "remained",
        "inert",
        "löwenheim",
        "proved",
        "deep",
        "theorem",
        "retrospect",
        "could",
        "characterized",
        "firstorder",
        "formula",
        "isolated",
        "system",
        "first",
        "order",
        "logic",
        "similar",
        "point",
        "hold",
        "hermann",
        "weyl",
        "proposed",
        "effect",
        "use",
        "firstorder",
        "logic",
        "make",
        "precise",
        "concept",
        "definite",
        "property",
        "zermelo",
        "axiom",
        "separation",
        "retrospective",
        "characterization",
        "weyl",
        "interest",
        "set",
        "theory",
        "study",
        "system",
        "firstorder",
        "logic",
        "next",
        "large",
        "step",
        "taken",
        "david",
        "hilbert",
        "lecture",
        "course",
        "prinzipien",
        "der",
        "mathematik",
        "delivered",
        "göttingen",
        "winter",
        "semester",
        "hilbert",
        "lectured",
        "published",
        "foundational",
        "topic",
        "year",
        "intervening",
        "time",
        "concentrated",
        "matter",
        "publication",
        "ceased",
        "though",
        "extensive",
        "classroom",
        "lecturing",
        "continued",
        "kept",
        "current",
        "development",
        "particular",
        "informed",
        "logical",
        "work",
        "whitehead",
        "russell",
        "largely",
        "student",
        "heinrich",
        "behmann",
        "september",
        "delivered",
        "programmatic",
        "lecture",
        "axiomatisches",
        "denken",
        "zürich",
        "calling",
        "axiomatic",
        "treatment",
        "logic",
        "along",
        "line",
        "earlier",
        "explored",
        "axiomatization",
        "geometry",
        "explicitly",
        "proposing",
        "metalogical",
        "investigation",
        "consider",
        "matter",
        "closely",
        "soon",
        "recognize",
        "question",
        "consistency",
        "integer",
        "set",
        "one",
        "stand",
        "alone",
        "belongs",
        "vast",
        "domain",
        "difficult",
        "epistemological",
        "question",
        "specifically",
        "mathematical",
        "tint",
        "example",
        "characterize",
        "domain",
        "question",
        "briefly",
        "problem",
        "solvability",
        "principle",
        "every",
        "mathematical",
        "question",
        "problem",
        "subsequent",
        "checkability",
        "result",
        "mathematical",
        "investigation",
        "question",
        "criterion",
        "simplicity",
        "mathematical",
        "proof",
        "question",
        "relationship",
        "content",
        "formalism",
        "mathematics",
        "logic",
        "finally",
        "problem",
        "decidability",
        "mathematical",
        "question",
        "finite",
        "number",
        "operation",
        "hilbert",
        "trip",
        "zürich",
        "invited",
        "paul",
        "bernays",
        "return",
        "göttingen",
        "assistant",
        "foundational",
        "matter",
        "although",
        "bernays",
        "little",
        "previous",
        "experience",
        "foundation",
        "turned",
        "shrewd",
        "choice",
        "beginning",
        "close",
        "fruitful",
        "research",
        "partnership",
        "göttingen",
        "lecture",
        "shortly",
        "followed",
        "zürich",
        "address",
        "recorded",
        "official",
        "protocol",
        "bernays",
        "remarkable",
        "document",
        "mark",
        "birth",
        "modern",
        "mathematical",
        "logic",
        "substantially",
        "published",
        "monograph",
        "known",
        "hilbert",
        "ackermann",
        "even",
        "today",
        "modest",
        "supplementation",
        "could",
        "serve",
        "introductory",
        "textbook",
        "logic",
        "hilbert",
        "first",
        "time",
        "clearly",
        "distinguishes",
        "metalanguage",
        "object",
        "language",
        "stepbystep",
        "present",
        "sequence",
        "formal",
        "logical",
        "calculus",
        "gradually",
        "increasing",
        "strength",
        "calculus",
        "carefully",
        "studied",
        "turn",
        "strength",
        "weakness",
        "identified",
        "balanced",
        "analysis",
        "weakness",
        "used",
        "prepare",
        "transition",
        "next",
        "calculus",
        "begin",
        "propositional",
        "calculus",
        "move",
        "monadic",
        "quantificational",
        "logic",
        "extended",
        "discussion",
        "calculus",
        "class",
        "aristotelian",
        "syllogism",
        "function",
        "calculus",
        "function",
        "calculus",
        "system",
        "manysorted",
        "firstorder",
        "logic",
        "variable",
        "sentence",
        "well",
        "relation",
        "first",
        "time",
        "encounter",
        "precise",
        "modern",
        "formulation",
        "firstorder",
        "logic",
        "clearly",
        "differentiated",
        "calculus",
        "given",
        "axiomatic",
        "foundation",
        "metalogical",
        "question",
        "explicitly",
        "formulated",
        "hilbert",
        "concludes",
        "discussion",
        "firstorder",
        "logic",
        "remark",
        "basic",
        "discussion",
        "logical",
        "calculus",
        "could",
        "cease",
        "end",
        "view",
        "calculus",
        "formalization",
        "logical",
        "inference",
        "satisfied",
        "application",
        "symbolic",
        "logic",
        "want",
        "able",
        "develop",
        "individual",
        "theory",
        "principle",
        "purely",
        "formal",
        "way",
        "also",
        "want",
        "investigate",
        "foundation",
        "mathematical",
        "theory",
        "examine",
        "related",
        "logic",
        "far",
        "built",
        "purely",
        "logical",
        "operation",
        "concept",
        "formation",
        "purpose",
        "logical",
        "calculus",
        "serve",
        "u",
        "tool",
        "lead",
        "next",
        "introduce",
        "higherorder",
        "logic",
        "thence",
        "consideration",
        "logical",
        "paradox",
        "resolution",
        "russell",
        "ramified",
        "theory",
        "type",
        "axiom",
        "reducibility",
        "briefly",
        "discussed",
        "adopted",
        "foundation",
        "mathematics",
        "lecture",
        "protocol",
        "end",
        "sentence",
        "thus",
        "clear",
        "introduction",
        "axiom",
        "reducibility",
        "appropriate",
        "mean",
        "turn",
        "calculus",
        "level",
        "system",
        "foundation",
        "higher",
        "mathematics",
        "developed",
        "sentence",
        "appeared",
        "essentially",
        "unchanged",
        "lecture",
        "reworked",
        "monograph",
        "hilbert",
        "ackermann",
        "course",
        "lecture",
        "hilbert",
        "address",
        "metalogical",
        "question",
        "stated",
        "axiomatisches",
        "denken",
        "least",
        "tacitly",
        "show",
        "question",
        "completeness",
        "consistency",
        "decidability",
        "answered",
        "propositional",
        "case",
        "completeness",
        "question",
        "firstorder",
        "logic",
        "explicitly",
        "raised",
        "bernays",
        "record",
        "lecture",
        "though",
        "attentive",
        "reader",
        "would",
        "easily",
        "recognized",
        "open",
        "problem",
        "following",
        "summer",
        "bernays",
        "produced",
        "habilitation",
        "thesis",
        "developed",
        "full",
        "rigor",
        "hilbertstyle",
        "axiomatic",
        "analysis",
        "propositional",
        "logic",
        "present",
        "axiomatic",
        "system",
        "uninterpreted",
        "formal",
        "calculus",
        "provides",
        "semantics",
        "prof",
        "completeness",
        "theorem",
        "linking",
        "syntax",
        "semantics",
        "form",
        "every",
        "provable",
        "formula",
        "universally",
        "valid",
        "vice",
        "versa",
        "proceeds",
        "investigate",
        "question",
        "decidability",
        "consistency",
        "mutual",
        "independence",
        "various",
        "combination",
        "axiom",
        "hilbert",
        "lecture",
        "bernays",
        "habilitation",
        "milestone",
        "development",
        "firstorder",
        "logic",
        "lecture",
        "first",
        "time",
        "firstorder",
        "logic",
        "presented",
        "right",
        "axiomatic",
        "logical",
        "system",
        "suitable",
        "study",
        "using",
        "new",
        "metalogical",
        "technique",
        "metalogical",
        "technique",
        "represented",
        "crucial",
        "advance",
        "peirce",
        "frege",
        "russell",
        "time",
        "bring",
        "firstorder",
        "logic",
        "focus",
        "happen",
        "great",
        "deal",
        "work",
        "still",
        "lay",
        "ahead",
        "lecture",
        "hilbert",
        "sequence",
        "logical",
        "calculus",
        "presented",
        "steppingstones",
        "way",
        "full",
        "higherorder",
        "ramified",
        "type",
        "theory",
        "continued",
        "regard",
        "right",
        "logical",
        "framework",
        "investigating",
        "foundation",
        "mathematics",
        "characteristic",
        "hilbert",
        "break",
        "complex",
        "mathematical",
        "phenomenon",
        "element",
        "sequence",
        "calculus",
        "viewed",
        "decomposition",
        "higherorder",
        "logic",
        "simpler",
        "component",
        "part",
        "revealing",
        "student",
        "precisely",
        "step",
        "went",
        "building",
        "full",
        "system",
        "although",
        "discus",
        "functional",
        "calculus",
        "single",
        "special",
        "attention",
        "word",
        "peirce",
        "three",
        "decade",
        "earlier",
        "firstorder",
        "logic",
        "introduced",
        "primarily",
        "expository",
        "device",
        "importance",
        "yet",
        "clear",
        "moreover",
        "hilbert",
        "treatment",
        "metalogical",
        "issue",
        "somewhat",
        "hasty",
        "informal",
        "experiment",
        "several",
        "version",
        "concept",
        "completeness",
        "one",
        "sense",
        "rapidly",
        "breaking",
        "new",
        "ground",
        "yet",
        "certain",
        "concept",
        "would",
        "prove",
        "fruitful",
        "proof",
        "completeness",
        "propositional",
        "calculus",
        "mere",
        "sketch",
        "relegated",
        "footnote",
        "parallel",
        "problem",
        "firstorder",
        "logic",
        "even",
        "raised",
        "conjecture",
        "even",
        "strikingly",
        "bernays",
        "eventually",
        "published",
        "habilitation",
        "omitted",
        "proof",
        "completeness",
        "theorem",
        "later",
        "ruefully",
        "said",
        "result",
        "seemed",
        "time",
        "straightforward",
        "unimportant",
        "discussion",
        "point",
        "see",
        "hilbert",
        "lfl",
        "readily",
        "available",
        "general",
        "discussion",
        "see",
        "sieg",
        "zach",
        "essay",
        "collected",
        "sieg",
        "original",
        "document",
        "detailed",
        "analysis",
        "see",
        "hilbert",
        "lfl",
        "word",
        "even",
        "göttingen",
        "s",
        "full",
        "understanding",
        "significance",
        "idea",
        "hilbert",
        "introduced",
        "missing",
        "hilbert",
        "school",
        "throughout",
        "s",
        "regarded",
        "firstorder",
        "logic",
        "fragment",
        "type",
        "theory",
        "made",
        "argument",
        "uniquely",
        "favored",
        "system",
        "monograph",
        "hilbert",
        "ackermann",
        "contemporaneous",
        "bologna",
        "lecture",
        "hilbert",
        "hilbert",
        "explicitly",
        "called",
        "attention",
        "completeness",
        "firstorder",
        "logic",
        "open",
        "question",
        "set",
        "stage",
        "work",
        "gödel",
        "coming",
        "need",
        "take",
        "chronological",
        "step",
        "backwards"
    ]
}