{
    "main_text": "Proof Systems\n3. Proof Systems\n\n\nWe have already seen a fragment of one way to present substructural\nlogics, in terms of proofs. We have used the residuation condition,\nwhich can be understood as including two rules for the conditional, one\nto introduce a conditional \n\n\\[\n\\cfrac{X, A \\vdash B}\n {X \\vdash A \\rightarrow B}\n\\]\n\n\n\nand another to eliminate it. \n\n\\[\n\\cfrac{X \\vdash A \\rightarrow B \\ \\ \\ Y \\vdash A}\n      {X, Y \\vdash B}\n\\]\n\n\n\nRules like these form the cornerstone of a natural deduction system,\nand these systems are available for the wide sweep of substructural\nlogics. But proof theory can be done in other ways. Gentzen\nsystems operate not by introducing and eliminating connectives, but by\nintroducing them both on the left and the right of the turnstile of\nlogical consequence. We keep the introduction rule above, and replace\nthe elimination rule by one introducing the conditional on the left: \n\n\\[\n\\cfrac{X \\vdash A \\ \\ \\ Y(B) \\vdash C}\n  {Y(A \\rightarrow B, X) \\vdash C}\n\\]\n\n\n\nThis rule is more complex, but it has the same effect as the arrow\nelimination rule: It says that if \\(X\\) suffices for \\(A\\), and if you\nuse \\(B\\) (in some context \\(Y)\\) to prove \\(C\\) then you could just\nas well have used \\(A \\rightarrow B\\) together with \\(X\\) (in that\nsame context \\(Y)\\) to prove \\(C\\), since \\(A \\rightarrow B\\) together\nwith \\(X\\) gives you \\(B\\). \n\n\nGentzen systems, with their introduction rules on the left and the\nright, have very special properties which are useful in studying\nlogics. Since connectives are always introduced in a proof\n(read from top to bottom) proofs never lose structure. If a\nconnective does not appear in the conclusion of a proof, it will not\nappear in the proof at all, since connectives cannot be eliminated.\n\n\nIn certain substructural logics, such as linear logic and the Lambek\ncalculus, and in the fragment of the relevant logic \\(\\mathbf{R}\\)\nwithout disjunction, a Gentzen system can be used to show that the\nlogic is decidable, in that an algorithm can be found to\ndetermine whether or not an argument \\(X \\vdash A\\) is valid. This is\ndone by searching for proofs of \\(X \\vdash A\\) in a Gentzen\nsystem. Since premises of this conclusion must feature no language not\nin this conclusion, and they have no greater complexity (in these\nsystems), there are only a finite number of possible premises. An\nalgorithm can check if these satisfy the rules of the system, and\nproceed to look for premises for these, or to quit if we hit an\naxiom. In this way, decidability of some substructural logics is\nassured.\n\n\nHowever, not all substructural logics are decidable in this sense.\nMost famously, the relevant logic \\(\\mathbf{R}\\) is not decidable.\nThis is partly because its proof theory is more complex than that of\nother substructural logics. \\(\\mathbf{R}\\) differs from linear\nlogic and the Lambek calculus in having a straightforward treatment of\nconjunction and disjunction. In particular, conjunction and disjunction\nsatisfy the rule of distribution:\n\n\\[\np \\amp(q \\vee r) \\vdash (p \\amp q) \\vee (p \\amp r)\n\\]\n\n\n\nThe natural proof of distribution in any proof system uses both\nweakening and contraction, so it is not available in the relevant logic\n\\(\\mathbf{R}\\), which does not contain weakening. As a result,\nproof theories for \\(\\mathbf{R}\\) either contain distribution as a\nprimitive rule, or contain a second form of premise combination (so\ncalled extensional combination, as opposed to the\nintensional premise combination we have seen) which satisfies\nweakening and contraction. \n\n\nIn recent years, a great deal of work has been done on the proof\ntheory of classical logic, inspired and informed by research\ninto substructural logics. Classical logic has the full complement of\nstructural rules, and is historically prior to more recent systems of\nsubstructural logics. However, when it comes to attempting to\nunderstand the deep structure of classical proof systems (and\nin particular, when two derivations that differ in some superficial\nsyntactic way are really different ways to represent the one\nunderlying ‘proof’) it is enlightening to think of\nclassical logic as formed by a basic substructural logic, in which\nextra structural rules are imposed as additions. In particular, it has\nbecome clear that what distinguishes classical proof from its siblings\nis the presence of the structural rules of contraction and weakening in\ntheir complete generality (see, for example, Bellin et al.\n2006 and the literature cited therein).\n4. Model Theory\n\n\nWhile the relevant logic \\(\\mathbf{R}\\) has a proof system more\ncomplex than the substructural logics such as linear logic, which lack\ndistribution of (extensional) conjunction over disjunction, its\nmodel theory is altogether more simple. A Routley-Meyer\nmodel for the relevant logic \\(\\mathbf{R}\\) is comprised\nof a set of points \\(P\\) with a three-place relation\n\\(R\\) on \\(P\\). A conditional \\(A \\rightarrow B\\) is\nevaluated at a world as follows: \n\n\\(A \\rightarrow B\\) is true at \\(x\\) if and only if for each \\(y\\) and\n\\(z\\) where \\(Rxyz\\), if \\(A\\) is true at \\(y, B\\) is true at \\(z\\).\n\n\n\nAn argument is valid in a model just when in any point at\nwhich the premises are true, so is the conclusion. The argument \\(A\n\\vdash B \\rightarrow B\\) is invalid because we may have a point \\(x\\)\nat which \\(A\\) is true, but at which \\(B \\rightarrow B\\) is not.  We\ncan have \\(B \\rightarrow B\\) fail to be true at \\(x\\) simply by having\n\\(Rxyz\\) where \\(B\\) is true at \\(y\\) but not at \\(z\\). \n\n\nThe three place relation \\(R\\) follows closely the behaviour of the\nmode of premise combination in the proof theory for a substructural\nlogic. For different logics, different conditions can be placed on\n\\(R\\). For example, if premise combination is commutative, we place\na symmetry condition on \\(R\\) like this: \\(Rxyz\\) if and only\nif \\(Ryxz\\). Ternary relational semantics gives us great facility\nto model the behaviour of substructural logics. (The extent\nof the correspondence between the proof theory and algebra of\nsubstructural logics and the semantics is charted in Dunn’s work\non Gaggle Theory (1991) and is summarised in\nRestall’s Introduction to Substructural Logics\n(2000).)\n\n\nFurthermore, if conjunction and disjunction satisfy the distribution\naxiom mentioned in the previous section, they can be modelled\nstraightforwardly too: a conjunction is true at a point just when both\nconjuncts are true at that point, and a disjunction is true at a point\njust when at least one disjunct is true there. For logics, such as\nlinear logic, without the distribution axiom, the semantics\nmust be more complex, with a different clause for disjunction required\nto invalidate the inference of distribution.\n\n\nIt is one thing to use a semantics as a formal device to model a\nlogic. It is another to use a semantics as an interpretive\ndevice to apply a logic. The literature on substructural\nlogics provides us with a number of different ways that the ternary\nrelational semantics can be applied to describe the logical structure\nof some phenomena in which the traditional structural rules do not\napply.\n\n\nFor logics like the Lambek calculus, the interpretation of the\nsemantics is straightforward. We can take the points to be linguistic\nitems, and the ternary relation to be the relation of concatenation\n(\\(Rxyz\\) if and only if \\(x\\) concatenated with \\(y\\)\nresults in \\(z)\\). In these models, the structural rules of\ncontraction, weakening and permutation all fail, but premise\ncombination is associative.\n\n\nThe contemporary literature on linguistic classification extends the\nbasic Lambek Calculus with richer forms of combination, in which more\nsyntactic features can be modelled (see Moortgat 1995).\n\n\nAnother application of these models is in the treatment of the\nsemantics of function application. We can think of the points\nin a model structure as both functions and data, and\nhold that \\(Rxyz\\) if and only if \\(x\\) (considered as a\nfunction) applied to \\(y\\) (considered as data) is \\(z\\).\nTraditional accounts of functions do not encourage this dual use, since\nfunctions are taken to be of a ‘higher’ than their inputs\nor outputs (on the traditional set-theoretic model of functions, a\nfunction \\(is\\) the set of its input-output pairs, and\nso, it can never take itself as an input, since sets cannot\ncontain themselves as members). However, systems of functions modelled\nby the untyped \\(\\lambda\\)-calculus, for example, allow for\nself-application. Given this reading of points in a model, a point is\nof type \\(A \\rightarrow B\\) just if whenever it takes inputs\nof type \\(A\\), it takes outputs of type \\(B\\). The inference\nrules of this system are then principles governing types of functions:\nthe sequent\n\n\\[\n(A \\rightarrow B) \\amp(A \\rightarrow C) \\vdash A \\rightarrow (B \\amp C)\n\\]\n\n\n\ntells us that whenever a function takes \\(A\\)s to \\(B\\)s and\n\\(A\\)s to \\(C\\)s, then it takes \\(A\\)s to things that\nare both \\(B\\) and \\(C\\). \n\n\nThis example gives us a model in which the appropriate substructural\nlogic is extremely weak. None of the usual structural rules\n(not even associativity) are satisfied in this model. This example of a\nternary relational model is discussed in (Restall 2000, Chapter\n11).\n\n\nFor the relevant logic \\(\\mathbf{R}\\) and its interpretation of\nnatural language conditionals, more work must be done in identifying\nwhat features of reality the formal semantics models. This has been a\nmatter of some controversy, since not only is the ternary relation\nunfamiliar to those whose exposure is primarily to modal logics with a\nsimpler binary accessibility relation between possible worlds,\nbut also because of the novelty of the treatment of negation\nin models for relevant logics. It is not our place to discuss this\ndebate in much detail here, Some of this work is reported in the\narticle on\n relevant logic\n in this\nEncyclopedia, and a book-length treatment of relevant logic in this\nlight is Mares’ Relevant Logic: a philosophical\ninterpretation (2004).\n5. Quantifiers\n\nThe treatment of quantifiers in models for substructural logics has\nproved to be quite difficult, but advances have been made in the early\n2000s. The difficulty came in what seemed to be a mismatch between the\nproof theory and model theory for quantifiers. Appropriate axioms or\nrules for the quantifiers are relatively straightforward. The\nuniversal quantifier elimination axiom \\[ \\forall xA \\rightarrow\nA[t/x] \\] states that an instance follows (in the relevant sense) from\nits universal generalisation. The introduction rule \\[ \\cfrac{\\vdash\nA\\rightarrow B} {\\vdash A\\rightarrow \\forall xB} \\] (where the proviso\nthat \\(x\\) is not free in \\(A\\) holds) tells us that if we can prove\nan instance of the generalisation \\(\\forall xB\\), as a matter of\nlogic, from some assumption which makes no particular claim about that\ninstance, we can also prove the generalisation from that\nassumption. This axiom and rule seems to fit nicely with any\ninterpretation of the first-order quantifiers in a range of\nsubstructural logics, from the weakest systems, to strong systems like\n\\(\\mathbf{R}\\).\n\n\nWhile the proof theory for quantifiers seems well behaved, the\ngeneralisation to model theory for substructural logics has proved\ndifficult. Richard Routley (1980) showed that  adding the rules for\nthe quantifiers to a very weak system of substructural logic\n\\(\\mathbf{B}\\) fits appropriately with the ternary relational\nsemantics, where quantifiers are interpreted as ranging over a domain\nof objects, constant across all of the points in the model. This fact\ndoes not apply for stronger logics, in particular, the\nrelevant logic \\(\\mathbf{R}\\).  Kit Fine (1989) showed that there\nexists a complex formula which holds in all constant domain frame\nmodels for \\(\\mathbf{R}\\) but which is not derivable from the axioms.\nThe details of Fine’s argument are not important for our purposes, but\nthe underlying cause for the mismatch is relatively straightforward to\nexplain. In the constant domain semantics, the universal\ngeneralisation \\(\\forall x Fx\\) has exactly the same truth\nconditions—at every point in the model—as the family of\ninstances \\(Fx_1\\), \\(Fx_2\\), \\(Fx_3,\\ldots\\), \\(Fx_\\lambda,\\ldots\\),\nwhere the objects of the domains are enumerated by the values of the\nterms \\(x_i\\).  So, the quantified expression \\(\\forall x Fx\\) is\nsemantically indistinguishable from the (possibly infinite)\nconjunction \\(Fx_1\\land Fx_2\\land Fx_3\\land\\cdots \\). However, no\nconjunction of instances (even an infinite one) could\nbe relevantly equivalent to the universally quantified claim\n\\(\\forall x Fx\\), because the instances could be true in a\ncircumstance (or could be made true by a circumstance) without also\nmaking true the generalisation—if there had been more\nthings than those. So, constant domain models seem ill-suited to the\nproject of a relevant theory of quantification.\n\n\nRecent work by Goldblatt and Mares (2006) has shown that there is an\nalternative, and it turns out to be elegant and relatively\nstraightforward. The crucial idea is to modify the ternary relational\nsemantics just a little, so that not every set of points need count as\na ‘proposition’. That is, not every set of points is the\npossible semantic value for a sentence. So, while there is a set of\nworlds determined by the infinite conjunction of instances of\n\\(\\forall xFx\\): \\(Fx_1\\land Fx_2\\land Fx_3\\land\\cdots \\), that\nprecise set of worlds may not count as a proposition. (Perhaps there\nis no way to single out those particular objects in such a way as to\ndraw them together in the one judgement.) What we can say is\nthe generalisation \\(\\forall xFx\\) and that is a proposition that\nentails each of the instances (that is the universal quantifier\nelimination axiom), and if a proposition entails each instance, it\nentails the generalisation (that is the introduction rule), so the\nproposition expressed by \\(\\forall xFx\\) is the semantically\nweakest proposition that entails each instance Fa. This\nis precisely the modelling condition for the universal quantifier in\nGoldblatt & Mares’ models, and it matches the axioms exactly.\n",
    "section_title": "3. Proof Systems",
    "entry_title": "Substructural Logics",
    "hierarchy_title": "Substructural Logics || Proof Systems",
    "tokenized_text": [
        "proof",
        "system",
        "proof",
        "system",
        "already",
        "seen",
        "fragment",
        "one",
        "way",
        "present",
        "substructural",
        "logic",
        "term",
        "proof",
        "used",
        "residuation",
        "condition",
        "understood",
        "including",
        "two",
        "rule",
        "conditional",
        "one",
        "introduce",
        "conditional",
        "cfrac",
        "x",
        "vdash",
        "b",
        "x",
        "vdash",
        "rightarrow",
        "b",
        "another",
        "eliminate",
        "cfrac",
        "x",
        "vdash",
        "rightarrow",
        "b",
        "vdash",
        "x",
        "vdash",
        "b",
        "rule",
        "like",
        "form",
        "cornerstone",
        "natural",
        "deduction",
        "system",
        "system",
        "available",
        "wide",
        "sweep",
        "substructural",
        "logic",
        "proof",
        "theory",
        "done",
        "way",
        "gentzen",
        "system",
        "operate",
        "introducing",
        "eliminating",
        "connective",
        "introducing",
        "left",
        "right",
        "turnstile",
        "logical",
        "consequence",
        "keep",
        "introduction",
        "rule",
        "replace",
        "elimination",
        "rule",
        "one",
        "introducing",
        "conditional",
        "left",
        "cfrac",
        "x",
        "vdash",
        "b",
        "vdash",
        "c",
        "rightarrow",
        "b",
        "x",
        "vdash",
        "c",
        "rule",
        "complex",
        "effect",
        "arrow",
        "elimination",
        "rule",
        "say",
        "x",
        "suffices",
        "a",
        "use",
        "b",
        "context",
        "prove",
        "c",
        "could",
        "well",
        "used",
        "rightarrow",
        "b",
        "together",
        "x",
        "context",
        "prove",
        "c",
        "since",
        "rightarrow",
        "b",
        "together",
        "x",
        "give",
        "b",
        "gentzen",
        "system",
        "introduction",
        "rule",
        "left",
        "right",
        "special",
        "property",
        "useful",
        "studying",
        "logic",
        "since",
        "connective",
        "always",
        "introduced",
        "proof",
        "read",
        "top",
        "bottom",
        "proof",
        "never",
        "lose",
        "structure",
        "connective",
        "appear",
        "conclusion",
        "proof",
        "appear",
        "proof",
        "since",
        "connective",
        "eliminated",
        "certain",
        "substructural",
        "logic",
        "linear",
        "logic",
        "lambek",
        "calculus",
        "fragment",
        "relevant",
        "logic",
        "mathbf",
        "r",
        "without",
        "disjunction",
        "gentzen",
        "system",
        "used",
        "show",
        "logic",
        "decidable",
        "algorithm",
        "found",
        "determine",
        "whether",
        "argument",
        "x",
        "vdash",
        "a",
        "valid",
        "done",
        "searching",
        "proof",
        "x",
        "vdash",
        "a",
        "gentzen",
        "system",
        "since",
        "premise",
        "conclusion",
        "must",
        "feature",
        "language",
        "conclusion",
        "greater",
        "complexity",
        "system",
        "finite",
        "number",
        "possible",
        "premise",
        "algorithm",
        "check",
        "satisfy",
        "rule",
        "system",
        "proceed",
        "look",
        "premise",
        "quit",
        "hit",
        "axiom",
        "way",
        "decidability",
        "substructural",
        "logic",
        "assured",
        "however",
        "substructural",
        "logic",
        "decidable",
        "sense",
        "famously",
        "relevant",
        "logic",
        "mathbf",
        "r",
        "decidable",
        "partly",
        "proof",
        "theory",
        "complex",
        "substructural",
        "logic",
        "mathbf",
        "r",
        "differs",
        "linear",
        "logic",
        "lambek",
        "calculus",
        "straightforward",
        "treatment",
        "conjunction",
        "disjunction",
        "particular",
        "conjunction",
        "disjunction",
        "satisfy",
        "rule",
        "distribution",
        "p",
        "amp",
        "q",
        "vee",
        "r",
        "vdash",
        "p",
        "amp",
        "q",
        "vee",
        "p",
        "amp",
        "r",
        "natural",
        "proof",
        "distribution",
        "proof",
        "system",
        "us",
        "weakening",
        "contraction",
        "available",
        "relevant",
        "logic",
        "mathbf",
        "r",
        "contain",
        "weakening",
        "result",
        "proof",
        "theory",
        "mathbf",
        "r",
        "either",
        "contain",
        "distribution",
        "primitive",
        "rule",
        "contain",
        "second",
        "form",
        "premise",
        "combination",
        "called",
        "extensional",
        "combination",
        "opposed",
        "intensional",
        "premise",
        "combination",
        "seen",
        "satisfies",
        "weakening",
        "contraction",
        "recent",
        "year",
        "great",
        "deal",
        "work",
        "done",
        "proof",
        "theory",
        "classical",
        "logic",
        "inspired",
        "informed",
        "research",
        "substructural",
        "logic",
        "classical",
        "logic",
        "full",
        "complement",
        "structural",
        "rule",
        "historically",
        "prior",
        "recent",
        "system",
        "substructural",
        "logic",
        "however",
        "come",
        "attempting",
        "understand",
        "deep",
        "structure",
        "classical",
        "proof",
        "system",
        "particular",
        "two",
        "derivation",
        "differ",
        "superficial",
        "syntactic",
        "way",
        "really",
        "different",
        "way",
        "represent",
        "one",
        "underlying",
        "proof",
        "enlightening",
        "think",
        "classical",
        "logic",
        "formed",
        "basic",
        "substructural",
        "logic",
        "extra",
        "structural",
        "rule",
        "imposed",
        "addition",
        "particular",
        "become",
        "clear",
        "distinguishes",
        "classical",
        "proof",
        "sibling",
        "presence",
        "structural",
        "rule",
        "contraction",
        "weakening",
        "complete",
        "generality",
        "see",
        "example",
        "bellin",
        "et",
        "al",
        "literature",
        "cited",
        "therein",
        "model",
        "theory",
        "relevant",
        "logic",
        "mathbf",
        "r",
        "proof",
        "system",
        "complex",
        "substructural",
        "logic",
        "linear",
        "logic",
        "lack",
        "distribution",
        "extensional",
        "conjunction",
        "disjunction",
        "model",
        "theory",
        "altogether",
        "simple",
        "routleymeyer",
        "model",
        "relevant",
        "logic",
        "mathbf",
        "r",
        "comprised",
        "set",
        "point",
        "p",
        "threeplace",
        "relation",
        "r",
        "p",
        "conditional",
        "rightarrow",
        "b",
        "evaluated",
        "world",
        "follows",
        "rightarrow",
        "b",
        "true",
        "x",
        "y",
        "z",
        "rxyz",
        "a",
        "true",
        "b",
        "true",
        "z",
        "argument",
        "valid",
        "model",
        "point",
        "premise",
        "true",
        "conclusion",
        "argument",
        "vdash",
        "b",
        "rightarrow",
        "b",
        "invalid",
        "may",
        "point",
        "x",
        "a",
        "true",
        "b",
        "rightarrow",
        "b",
        "b",
        "rightarrow",
        "b",
        "fail",
        "true",
        "x",
        "simply",
        "rxyz",
        "b",
        "true",
        "y",
        "z",
        "three",
        "place",
        "relation",
        "r",
        "follows",
        "closely",
        "behaviour",
        "mode",
        "premise",
        "combination",
        "proof",
        "theory",
        "substructural",
        "logic",
        "different",
        "logic",
        "different",
        "condition",
        "placed",
        "r",
        "example",
        "premise",
        "combination",
        "commutative",
        "place",
        "symmetry",
        "condition",
        "r",
        "like",
        "rxyz",
        "ryxz",
        "ternary",
        "relational",
        "semantics",
        "give",
        "u",
        "great",
        "facility",
        "model",
        "behaviour",
        "substructural",
        "logic",
        "extent",
        "correspondence",
        "proof",
        "theory",
        "algebra",
        "substructural",
        "logic",
        "semantics",
        "charted",
        "dunn",
        "work",
        "gaggle",
        "theory",
        "summarised",
        "restall",
        "introduction",
        "substructural",
        "logic",
        "furthermore",
        "conjunction",
        "disjunction",
        "satisfy",
        "distribution",
        "axiom",
        "mentioned",
        "previous",
        "section",
        "modelled",
        "straightforwardly",
        "conjunction",
        "true",
        "point",
        "conjuncts",
        "true",
        "point",
        "disjunction",
        "true",
        "point",
        "least",
        "one",
        "disjunct",
        "true",
        "logic",
        "linear",
        "logic",
        "without",
        "distribution",
        "axiom",
        "semantics",
        "must",
        "complex",
        "different",
        "clause",
        "disjunction",
        "required",
        "invalidate",
        "inference",
        "distribution",
        "one",
        "thing",
        "use",
        "semantics",
        "formal",
        "device",
        "model",
        "logic",
        "another",
        "use",
        "semantics",
        "interpretive",
        "device",
        "apply",
        "logic",
        "literature",
        "substructural",
        "logic",
        "provides",
        "u",
        "number",
        "different",
        "way",
        "ternary",
        "relational",
        "semantics",
        "applied",
        "describe",
        "logical",
        "structure",
        "phenomenon",
        "traditional",
        "structural",
        "rule",
        "apply",
        "logic",
        "like",
        "lambek",
        "calculus",
        "interpretation",
        "semantics",
        "straightforward",
        "take",
        "point",
        "linguistic",
        "item",
        "ternary",
        "relation",
        "relation",
        "concatenation",
        "rxyz",
        "x",
        "concatenated",
        "y",
        "result",
        "z",
        "model",
        "structural",
        "rule",
        "contraction",
        "weakening",
        "permutation",
        "fail",
        "premise",
        "combination",
        "associative",
        "contemporary",
        "literature",
        "linguistic",
        "classification",
        "extends",
        "basic",
        "lambek",
        "calculus",
        "richer",
        "form",
        "combination",
        "syntactic",
        "feature",
        "modelled",
        "see",
        "moortgat",
        "another",
        "application",
        "model",
        "treatment",
        "semantics",
        "function",
        "application",
        "think",
        "point",
        "model",
        "structure",
        "function",
        "data",
        "hold",
        "rxyz",
        "x",
        "considered",
        "function",
        "applied",
        "y",
        "considered",
        "data",
        "z",
        "traditional",
        "account",
        "function",
        "encourage",
        "dual",
        "use",
        "since",
        "function",
        "taken",
        "higher",
        "input",
        "output",
        "traditional",
        "settheoretic",
        "model",
        "function",
        "function",
        "is",
        "set",
        "inputoutput",
        "pair",
        "never",
        "take",
        "input",
        "since",
        "set",
        "contain",
        "member",
        "however",
        "system",
        "function",
        "modelled",
        "untyped",
        "lambda",
        "calculus",
        "example",
        "allow",
        "selfapplication",
        "given",
        "reading",
        "point",
        "model",
        "point",
        "type",
        "rightarrow",
        "b",
        "whenever",
        "take",
        "input",
        "type",
        "a",
        "take",
        "output",
        "type",
        "b",
        "inference",
        "rule",
        "system",
        "principle",
        "governing",
        "type",
        "function",
        "sequent",
        "rightarrow",
        "b",
        "amp",
        "rightarrow",
        "c",
        "vdash",
        "rightarrow",
        "b",
        "amp",
        "c",
        "tell",
        "u",
        "whenever",
        "function",
        "take",
        "a",
        "b",
        "a",
        "c",
        "take",
        "a",
        "thing",
        "b",
        "c",
        "example",
        "give",
        "u",
        "model",
        "appropriate",
        "substructural",
        "logic",
        "extremely",
        "weak",
        "none",
        "usual",
        "structural",
        "rule",
        "even",
        "associativity",
        "satisfied",
        "model",
        "example",
        "ternary",
        "relational",
        "model",
        "discussed",
        "restall",
        "chapter",
        "relevant",
        "logic",
        "mathbf",
        "r",
        "interpretation",
        "natural",
        "language",
        "conditionals",
        "work",
        "must",
        "done",
        "identifying",
        "feature",
        "reality",
        "formal",
        "semantics",
        "model",
        "matter",
        "controversy",
        "since",
        "ternary",
        "relation",
        "unfamiliar",
        "whose",
        "exposure",
        "primarily",
        "modal",
        "logic",
        "simpler",
        "binary",
        "accessibility",
        "relation",
        "possible",
        "world",
        "also",
        "novelty",
        "treatment",
        "negation",
        "model",
        "relevant",
        "logic",
        "place",
        "discus",
        "debate",
        "much",
        "detail",
        "work",
        "reported",
        "article",
        "relevant",
        "logic",
        "encyclopedia",
        "booklength",
        "treatment",
        "relevant",
        "logic",
        "light",
        "mare",
        "relevant",
        "logic",
        "philosophical",
        "interpretation",
        "quantifier",
        "treatment",
        "quantifier",
        "model",
        "substructural",
        "logic",
        "proved",
        "quite",
        "difficult",
        "advance",
        "made",
        "early",
        "s",
        "difficulty",
        "came",
        "seemed",
        "mismatch",
        "proof",
        "theory",
        "model",
        "theory",
        "quantifier",
        "appropriate",
        "axiom",
        "rule",
        "quantifier",
        "relatively",
        "straightforward",
        "universal",
        "quantifier",
        "elimination",
        "axiom",
        "forall",
        "xa",
        "rightarrow",
        "tx",
        "state",
        "instance",
        "follows",
        "relevant",
        "sense",
        "universal",
        "generalisation",
        "introduction",
        "rule",
        "cfrac",
        "vdash",
        "arightarrow",
        "b",
        "vdash",
        "arightarrow",
        "forall",
        "xb",
        "proviso",
        "x",
        "free",
        "a",
        "hold",
        "tell",
        "u",
        "prove",
        "instance",
        "generalisation",
        "forall",
        "xb",
        "matter",
        "logic",
        "assumption",
        "make",
        "particular",
        "claim",
        "instance",
        "also",
        "prove",
        "generalisation",
        "assumption",
        "axiom",
        "rule",
        "seems",
        "fit",
        "nicely",
        "interpretation",
        "firstorder",
        "quantifier",
        "range",
        "substructural",
        "logic",
        "weakest",
        "system",
        "strong",
        "system",
        "like",
        "mathbf",
        "r",
        "proof",
        "theory",
        "quantifier",
        "seems",
        "well",
        "behaved",
        "generalisation",
        "model",
        "theory",
        "substructural",
        "logic",
        "proved",
        "difficult",
        "richard",
        "routley",
        "showed",
        "adding",
        "rule",
        "quantifier",
        "weak",
        "system",
        "substructural",
        "logic",
        "mathbf",
        "b",
        "fit",
        "appropriately",
        "ternary",
        "relational",
        "semantics",
        "quantifier",
        "interpreted",
        "ranging",
        "domain",
        "object",
        "constant",
        "across",
        "point",
        "model",
        "fact",
        "apply",
        "stronger",
        "logic",
        "particular",
        "relevant",
        "logic",
        "mathbf",
        "r",
        "kit",
        "fine",
        "showed",
        "exists",
        "complex",
        "formula",
        "hold",
        "constant",
        "domain",
        "frame",
        "model",
        "mathbf",
        "r",
        "derivable",
        "axiom",
        "detail",
        "fine",
        "argument",
        "important",
        "purpose",
        "underlying",
        "cause",
        "mismatch",
        "relatively",
        "straightforward",
        "explain",
        "constant",
        "domain",
        "semantics",
        "universal",
        "generalisation",
        "forall",
        "x",
        "fx",
        "exactly",
        "truth",
        "conditionsat",
        "every",
        "point",
        "modelas",
        "family",
        "instance",
        "fx_",
        "fx_",
        "fx_",
        "ldots",
        "fx_lambda",
        "ldots",
        "object",
        "domain",
        "enumerated",
        "value",
        "term",
        "x_i",
        "quantified",
        "expression",
        "forall",
        "x",
        "fx",
        "semantically",
        "indistinguishable",
        "possibly",
        "infinite",
        "conjunction",
        "fx_land",
        "fx_land",
        "fx_landcdots",
        "however",
        "conjunction",
        "instance",
        "even",
        "infinite",
        "one",
        "could",
        "relevantly",
        "equivalent",
        "universally",
        "quantified",
        "claim",
        "forall",
        "x",
        "fx",
        "instance",
        "could",
        "true",
        "circumstance",
        "could",
        "made",
        "true",
        "circumstance",
        "without",
        "also",
        "making",
        "true",
        "generalisationif",
        "thing",
        "constant",
        "domain",
        "model",
        "seem",
        "illsuited",
        "project",
        "relevant",
        "theory",
        "quantification",
        "recent",
        "work",
        "goldblatt",
        "mare",
        "shown",
        "alternative",
        "turn",
        "elegant",
        "relatively",
        "straightforward",
        "crucial",
        "idea",
        "modify",
        "ternary",
        "relational",
        "semantics",
        "little",
        "every",
        "set",
        "point",
        "need",
        "count",
        "proposition",
        "every",
        "set",
        "point",
        "possible",
        "semantic",
        "value",
        "sentence",
        "set",
        "world",
        "determined",
        "infinite",
        "conjunction",
        "instance",
        "forall",
        "xfx",
        "fx_land",
        "fx_land",
        "fx_landcdots",
        "precise",
        "set",
        "world",
        "may",
        "count",
        "proposition",
        "perhaps",
        "way",
        "single",
        "particular",
        "object",
        "way",
        "draw",
        "together",
        "one",
        "judgement",
        "say",
        "generalisation",
        "forall",
        "xfx",
        "proposition",
        "entail",
        "instance",
        "universal",
        "quantifier",
        "elimination",
        "axiom",
        "proposition",
        "entail",
        "instance",
        "entail",
        "generalisation",
        "introduction",
        "rule",
        "proposition",
        "expressed",
        "forall",
        "xfx",
        "semantically",
        "weakest",
        "proposition",
        "entail",
        "instance",
        "fa",
        "precisely",
        "modelling",
        "condition",
        "universal",
        "quantifier",
        "goldblatt",
        "mare",
        "model",
        "match",
        "axiom",
        "exactly"
    ]
}