{
    "main_text": "Issues || Probability\n4.4 Probability\n\nThere are two broad approaches to probability represented in logical\nempiricism. One of these, the so-called frequentist approach, has an\nextensive 19th century history and was further developed\nfrom about 1920 onward by Richard von Mises and Hans Reichenbach. The\nother is the epistemic approach to probability. This goes back at\nleast to Laplace at the end of the 18th century. In the\n20th century Rudolf Carnap, who explored what he called\nlogical probability, and Frank Ramsey and Richard Jeffrey whose\naccounts can be distinguished from Carnap’s and are often called\nsubjective probability, all defended the epistemic approach. While\nRamsey visited the Vienna Circle he was not much influenced by its\nmembers on these matters. By contrast, Jeffrey studied and later\ncollaborated with Carnap but also made significant contributions of\nhis own.\n\nIt is natural to begin thinking about probabilities with a simple\nmathematical account that takes as its point of departure various\ngames of chance involving cards, dice, or coins. Bettors have long\nnoted that some outcomes are much more likely than others. In this\ncontext it is convenient to take the probability of a kind of outcome\nto be the ratio of such outcomes to all possible outcomes. Usually for\nreasons of symmetry in the physical set up, the possible outcomes are\nassumed to be equally likely. Where that assumption happens to be true\nor nearly so the empirical results of, say, a great many throws of a\npair of dice tends to be close to what the simple mathematical account\nwould suggest. Conversely, where the outcomes deviate from the\nexpected ratios, bettors begin to suspect that the dice, coins, and\ncards (or the manipulations of them) are not all that they seem. The\nsuspicion is that the outcomes are not equally likely and that the\nsimple mathematical account does not apply.\n\nThese facts suggest both two limitations of the simple account and the\nbeginnings of a way around them. The first limitation is that the\naccount applies only where the outcomes can be partitioned into\nalternatives that are equally likely. This is not the case when dice\nare loaded or in such real world cases as radioactive decay or weather\nforecasting. A second limitation is that the account, in describing\nthe possible outcomes as equally likely, implicitly appeals to the\nvery probability notion for which clarification was sought. The\nrealization that we can sometimes discover the falsehood of the\nassumption of equal likelihood and make a much more reasonable\nestimate of probability by making a large number of trials is very\nsuggestive. And from his dissertation onward Reichenbach worked out a\nvariety of imagined physical models that could guide ones thinking\nabout probability in useful ways. The result is what is often called\nthe frequency theory of probability (or sometimes the statistical\nfrequency theory or the limit frequency theory).\n\nEven a perfectly fair coin in an odd number of flips will never result\nin exactly the same number of heads and of tails. When the coin is\nfair and the number of flips is even, an outcome perfectly balanced\nbetween heads and tails is not guaranteed either. So, even on the\nassumption that the probability of the coin’s coming up heads\ndoes not change over the course of the trials, we need to be cautious.\nA larger number of flips might make us more confident that the ratio\nwe have seen is close to the “actual” value, but there is\nno finite number of flips after which we can say that the observed\nratio is exactly right. We will never make an infinite number of flips\neither, and in actual cases a large finite number of flips might so\nerode the coin as to bias the coin and discredit the result.\nNotwithstanding these limitations on an actual series of trials one\ncan imagine an infinite series of trials and define a notion of\nprobability with respect to it. This raises its own difficulty, namely\nthat ratios are not defined for infinite collections. They would be\ndefined, however, for any finite initial segment of such an infinite\nseries, thus giving a sequence of ratios. If this sequence of ratios\nsettles down on a limit, the probability of the coin showing a head\ngiven that it has been flipped can be defined as the limit of the\nratio of heads to total flips as the number of flips goes to\ninfinity.\n\nWhile probability thus defined has a somewhat counterfactual\ncharacter, that is not an obvious defect. Moreover, this notion of\nprobability applies perfectly well to biased coins and loaded dice, as\nwell as to radioactive decay. On the surface at least it also seem to\navoid using the notion of probability in its own definition, and in\nthese respects it seems to be an important improvement over the simple\nmathematical model with which we began. The definition locates the\nprobability objectively “out in nature” so to speak, and\nthis comports well with Reichenbach’s scientific realism.\n\nA problem that remained troublesome concerns the fact that one often\nwants to assign probabilities to particular events, events that in the\nnature of things cannot be repeated in all their particularity. Thus\nit is unclear how a frequency theory of probability is to be applied\nto such individual cases. This is often called the problem of the\nsingle case. It is a little difficult to assess how serious this is,\nbecause in actual practice we often have no difficulty in making\nprobability assignments to single cases. Suppose we are interested in\nthe probability of rain tomorrow. Tomorrow will never be repeated, and\nwe want to estimate the probability now. What we do is to look back\nthrough the records to find days relevantly like today and determine\nin what fraction of those cases those days were followed by rainy days\nand use that as our estimate. Even if we are comfortable with this\npractice, however, it is another matter to say why this should give us\na reasonable estimate of the value of the limit involved in a\nlogically impossible infinite sequence. This problem of the single\ncase was much discussed, and Wesley Salmon made progress in dealing\nwith it. Indeed, Salmon’s account of statistical explanation can\nbe viewed as a substantial mitigation of the problem of the single\ncase (W. Salmon 1970).\n\nThere are residual difficulties in making estimates of the\nprobabilities on the basis of finite evidence. The problem is that\neven when we are assured that the sequence of ratios has a limit, we\nhave no a priori grounds for saying how close the current ratio is to\nthat limit. We can boldly estimate the limit by means of the so-called\n“straight rule”. This just takes the most recent ratio as\nthe desired estimate. This is a good practical solution where the\nnumber of trials is already high, but this does not really say why the\nestimate should be good, how good it is supposed to be, or how many\ntrials would be high enough. In addition, the straight rule can yield\ncounterintuitive results where the number of trials is small.\n\nThough there are these issues outstanding, frequency theories define a\nconcept of probability indispensable for quantum theories and for a\nwide variety of other applications in the natural and social sciences.\nIt was not the only concept of probability to be developed by the\nlogical empiricist tradition. The primary other such concept was the\nepistemic conception of probability. We will begin with Carnap and\nthen move to those who developed a subjectivist account.\n\nCarnap is addressing a different issue than was addressed by von Mises\nand Reichenbach. Instead of focusing on physical phenomena and ratios\nwithin them, Carnap focuses on arguments and takes as his point of\ndeparture the widespread conviction that some arguments are stronger,\nin varying degrees, than others, even for the same conclusion.\nSimilarly some bodies of evidence can give us more reason to believe a\ngiven conclusion than would another body of evidence. Carnap sets as\nhis task the development of a quantitative concept of probability that\nwill clarify and explicate these widespread convictions. Such a\nquantitative concept would be an extraordinarily useful tool, and it\nwould be a useful successor to our ordinary, somewhat scattered\nnotions of confirmation and induction.\n\nCarnap approaches the problem by first considering extremely limited\nartificial languages and trying to find a confirmation function that\nwill work for that. If he succeeds he would then try to develop an\naccount that would work for a broader and richer range of languages.\nIn this his approach is like that of a physicist developing a physical\ntheory for the highly artificial situation of a billiard table or air\ntrack and then broadening the theory to deal with a wider range of\ncases. In Carnap’s case, however, it is somewhat unclear what\nsuccess would be in an artificial language very much unlike our own.\nIn any case, Carnap is not trying to describe our linguistic habits\nbut to clarify or even to replace them with something more useful.\n\nAs early as Logical Syntax (Carnap 1934/1937,\n244/316–17) Carnap had suggested that Wittgenstein’s\nremarks in the Tractatus about ranges (Tractatus,\n4.463) might be a starting point for thinking about probability. By\n1945 Carnap also distinguished the two approaches described here,\ninsisting that they were not competitors but were attempting to\nexplicate two different concepts of probability. One need not choose\none as the only concept; both concepts were useful. Reichenbach, by\ncontrast, never conceded that both concepts were needed and insisted\nthat his frequency notion could serve all epistemic purposes for which\nany notion of probability is needed.\n\nCarnap’s general strategy was first to identify a broad class of\nconfirmation functions, as subjectivists Ramsay and de Finetti were\nalso to do, and then find a natural way of limiting this class still\nfurther. The confirmation functions have to meet some basic\nmathematical conditions. The axioms that state these conditions\npartially define a function, and this function can be interpreted in a\nnumber of ways. Carnap himself lists three in Carnap 1950. In (1955),\nJohn Kemeny (one of Carnap’s collaborators and later a\nco-inventor of BASIC programming language and still later president of\nDartmouth College) gave an argument that persuaded Carnap that it was\nmore fruitful to think of the function as indicating fair betting\nquotients rather than evidential support. This took Carnap even closer\nin conception to the work of such subjectivists as Ramsey and de\nFinetti. Indeed, the discussion of fair betting quotients, and related\nissues of Dutch book arguments had been initiated by de Finetti.\n\nIn Logical Foundations of Probability (1950) Carnap had\ndiscussed Bayes’ theorem and promised to expand the discussion\nin a second volume. Carnap’s interest in Bayesianism grew, but\nthat second volume never materialized, quite possibly because rapid\ndevelopment of the field was still under way at the time of\nCarnap’s death. As his work proceeded Carnap tended to explain\nprobabilities by reference to events and propositions rather than\nspeak overtly about sentences. A similar change appears in the rest of\nCarnap’s work as well. It is not clear, however, whether this\namounts to a major change of view or a change in what he sees as the\nmost felicitous mode of expression. As the years progressed Carnap\ntended to see the remaining differences between himself and his\nsubjectivist co-workers as chiefly differences in emphasis. In any\ncase the subjectivist tradition is now dominant in philosophical\ndiscussions of probability (Zabell 2007, 293). Richard Jeffrey, whose\nown work arose out of logical empiricism, carried on that tradition\nfor 35 years after Carnap’s death. Jeffrey himself made major\ncontributions including a principle for updating ones beliefs when the\nevidence one learns is not certain. The world knows this principle as\n“Jeffrey conditionalization”; he called it simply\n“probability kinematics”.\n\nPopper’s view of probability, his propensity theory, differs\nfrom either of the two approaches discussed above. Unlike the\nepistemic approach of Carnap and others, Popper was not trying to\nclarify inductive relations because he did not believe that there are\ninductive inferences. Theories can be corroborated by their passing\nsevere tests, but they are not thereby inductively confirmed or made\nmore probable. For a discussion of whether there are any significant\nsimilarities between Popper’s idea of corroboration and the\nideas of inductive confirmation that he rejects, see (Salmon 1967,\n1968).\n\nPropensities are thought of as tendencies of a physical event or state\nto produce another event or state. Because propensities are to be\nfeatures of external events and not, to use Hume’s phrase,\nrelations of ideas, the propensity theory and the\nstatistical-frequency theory are sometimes grouped together as\naccounts of chance. Popper has specifically applied propensities to\nsingle non-repeatable events (1957), and that suggests that the\nconcept of propensity does not involve any essential reference to long\nsequences of events. Popper has also taken propensities as producing\noutcomes with a certain limit frequency (1959). This does suggest a\nrather closer tie to the statistical frequency approach. Later\nphilosophers developed both sorts of propensity theories, single-case\ntheories and long-run theories. (Gillies 2000) And like other\napproaches to probability and induction all these views remain\ncontroversial. While we will not discuss the relative merits of the\nvarious approaches further, those who are interested in Popper’s\nviews in this area should look at the many papers on probability,\ninduction, confirmation, and corroboration, and Popper’s\nreplies, in The Philosophy of Karl Popper (Schilpp 1974).\n",
    "section_title": "4.4 Probability",
    "entry_title": "Logical Empiricism",
    "hierarchy_title": "Logical Empiricism || Issues || Probability",
    "tokenized_text": [
        "issue",
        "probability",
        "probability",
        "two",
        "broad",
        "approach",
        "probability",
        "represented",
        "logical",
        "empiricism",
        "one",
        "socalled",
        "frequentist",
        "approach",
        "extensive",
        "th",
        "century",
        "history",
        "developed",
        "onward",
        "richard",
        "von",
        "mi",
        "han",
        "reichenbach",
        "epistemic",
        "approach",
        "probability",
        "go",
        "back",
        "least",
        "laplace",
        "end",
        "th",
        "century",
        "th",
        "century",
        "rudolf",
        "carnap",
        "explored",
        "called",
        "logical",
        "probability",
        "frank",
        "ramsey",
        "richard",
        "jeffrey",
        "whose",
        "account",
        "distinguished",
        "carnap",
        "often",
        "called",
        "subjective",
        "probability",
        "defended",
        "epistemic",
        "approach",
        "ramsey",
        "visited",
        "vienna",
        "circle",
        "much",
        "influenced",
        "member",
        "matter",
        "contrast",
        "jeffrey",
        "studied",
        "later",
        "collaborated",
        "carnap",
        "also",
        "made",
        "significant",
        "contribution",
        "natural",
        "begin",
        "thinking",
        "probability",
        "simple",
        "mathematical",
        "account",
        "take",
        "point",
        "departure",
        "various",
        "game",
        "chance",
        "involving",
        "card",
        "dice",
        "coin",
        "bettor",
        "long",
        "noted",
        "outcome",
        "much",
        "likely",
        "others",
        "context",
        "convenient",
        "take",
        "probability",
        "kind",
        "outcome",
        "ratio",
        "outcome",
        "possible",
        "outcome",
        "usually",
        "reason",
        "symmetry",
        "physical",
        "set",
        "possible",
        "outcome",
        "assumed",
        "equally",
        "likely",
        "assumption",
        "happens",
        "true",
        "nearly",
        "empirical",
        "result",
        "say",
        "great",
        "many",
        "throw",
        "pair",
        "dice",
        "tends",
        "close",
        "simple",
        "mathematical",
        "account",
        "would",
        "suggest",
        "conversely",
        "outcome",
        "deviate",
        "expected",
        "ratio",
        "bettor",
        "begin",
        "suspect",
        "dice",
        "coin",
        "card",
        "manipulation",
        "seem",
        "suspicion",
        "outcome",
        "equally",
        "likely",
        "simple",
        "mathematical",
        "account",
        "apply",
        "fact",
        "suggest",
        "two",
        "limitation",
        "simple",
        "account",
        "beginning",
        "way",
        "around",
        "first",
        "limitation",
        "account",
        "applies",
        "outcome",
        "partitioned",
        "alternative",
        "equally",
        "likely",
        "case",
        "dice",
        "loaded",
        "real",
        "world",
        "case",
        "radioactive",
        "decay",
        "weather",
        "forecasting",
        "second",
        "limitation",
        "account",
        "describing",
        "possible",
        "outcome",
        "equally",
        "likely",
        "implicitly",
        "appeal",
        "probability",
        "notion",
        "clarification",
        "sought",
        "realization",
        "sometimes",
        "discover",
        "falsehood",
        "assumption",
        "equal",
        "likelihood",
        "make",
        "much",
        "reasonable",
        "estimate",
        "probability",
        "making",
        "large",
        "number",
        "trial",
        "suggestive",
        "dissertation",
        "onward",
        "reichenbach",
        "worked",
        "variety",
        "imagined",
        "physical",
        "model",
        "could",
        "guide",
        "one",
        "thinking",
        "probability",
        "useful",
        "way",
        "result",
        "often",
        "called",
        "frequency",
        "theory",
        "probability",
        "sometimes",
        "statistical",
        "frequency",
        "theory",
        "limit",
        "frequency",
        "theory",
        "even",
        "perfectly",
        "fair",
        "coin",
        "odd",
        "number",
        "flip",
        "never",
        "result",
        "exactly",
        "number",
        "head",
        "tail",
        "coin",
        "fair",
        "number",
        "flip",
        "even",
        "outcome",
        "perfectly",
        "balanced",
        "head",
        "tail",
        "guaranteed",
        "either",
        "even",
        "assumption",
        "probability",
        "coin",
        "coming",
        "head",
        "change",
        "course",
        "trial",
        "need",
        "cautious",
        "larger",
        "number",
        "flip",
        "might",
        "make",
        "u",
        "confident",
        "ratio",
        "seen",
        "close",
        "actual",
        "value",
        "finite",
        "number",
        "flip",
        "say",
        "observed",
        "ratio",
        "exactly",
        "right",
        "never",
        "make",
        "infinite",
        "number",
        "flip",
        "either",
        "actual",
        "case",
        "large",
        "finite",
        "number",
        "flip",
        "might",
        "erode",
        "coin",
        "bias",
        "coin",
        "discredit",
        "result",
        "notwithstanding",
        "limitation",
        "actual",
        "series",
        "trial",
        "one",
        "imagine",
        "infinite",
        "series",
        "trial",
        "define",
        "notion",
        "probability",
        "respect",
        "raise",
        "difficulty",
        "namely",
        "ratio",
        "defined",
        "infinite",
        "collection",
        "would",
        "defined",
        "however",
        "finite",
        "initial",
        "segment",
        "infinite",
        "series",
        "thus",
        "giving",
        "sequence",
        "ratio",
        "sequence",
        "ratio",
        "settle",
        "limit",
        "probability",
        "coin",
        "showing",
        "head",
        "given",
        "flipped",
        "defined",
        "limit",
        "ratio",
        "head",
        "total",
        "flip",
        "number",
        "flip",
        "go",
        "infinity",
        "probability",
        "thus",
        "defined",
        "somewhat",
        "counterfactual",
        "character",
        "obvious",
        "defect",
        "moreover",
        "notion",
        "probability",
        "applies",
        "perfectly",
        "well",
        "biased",
        "coin",
        "loaded",
        "dice",
        "well",
        "radioactive",
        "decay",
        "surface",
        "least",
        "also",
        "seem",
        "avoid",
        "using",
        "notion",
        "probability",
        "definition",
        "respect",
        "seems",
        "important",
        "improvement",
        "simple",
        "mathematical",
        "model",
        "began",
        "definition",
        "locates",
        "probability",
        "objectively",
        "nature",
        "speak",
        "comports",
        "well",
        "reichenbach",
        "scientific",
        "realism",
        "problem",
        "remained",
        "troublesome",
        "concern",
        "fact",
        "one",
        "often",
        "want",
        "assign",
        "probability",
        "particular",
        "event",
        "event",
        "nature",
        "thing",
        "repeated",
        "particularity",
        "thus",
        "unclear",
        "frequency",
        "theory",
        "probability",
        "applied",
        "individual",
        "case",
        "often",
        "called",
        "problem",
        "single",
        "case",
        "little",
        "difficult",
        "ass",
        "serious",
        "actual",
        "practice",
        "often",
        "difficulty",
        "making",
        "probability",
        "assignment",
        "single",
        "case",
        "suppose",
        "interested",
        "probability",
        "rain",
        "tomorrow",
        "tomorrow",
        "never",
        "repeated",
        "want",
        "estimate",
        "probability",
        "look",
        "back",
        "record",
        "find",
        "day",
        "relevantly",
        "like",
        "today",
        "determine",
        "fraction",
        "case",
        "day",
        "followed",
        "rainy",
        "day",
        "use",
        "estimate",
        "even",
        "comfortable",
        "practice",
        "however",
        "another",
        "matter",
        "say",
        "give",
        "u",
        "reasonable",
        "estimate",
        "value",
        "limit",
        "involved",
        "logically",
        "impossible",
        "infinite",
        "sequence",
        "problem",
        "single",
        "case",
        "much",
        "discussed",
        "wesley",
        "salmon",
        "made",
        "progress",
        "dealing",
        "indeed",
        "salmon",
        "account",
        "statistical",
        "explanation",
        "viewed",
        "substantial",
        "mitigation",
        "problem",
        "single",
        "case",
        "w",
        "salmon",
        "residual",
        "difficulty",
        "making",
        "estimate",
        "probability",
        "basis",
        "finite",
        "evidence",
        "problem",
        "even",
        "assured",
        "sequence",
        "ratio",
        "limit",
        "priori",
        "ground",
        "saying",
        "close",
        "current",
        "ratio",
        "limit",
        "boldly",
        "estimate",
        "limit",
        "mean",
        "socalled",
        "straight",
        "rule",
        "take",
        "recent",
        "ratio",
        "desired",
        "estimate",
        "good",
        "practical",
        "solution",
        "number",
        "trial",
        "already",
        "high",
        "really",
        "say",
        "estimate",
        "good",
        "good",
        "supposed",
        "many",
        "trial",
        "would",
        "high",
        "enough",
        "addition",
        "straight",
        "rule",
        "yield",
        "counterintuitive",
        "result",
        "number",
        "trial",
        "small",
        "though",
        "issue",
        "outstanding",
        "frequency",
        "theory",
        "define",
        "concept",
        "probability",
        "indispensable",
        "quantum",
        "theory",
        "wide",
        "variety",
        "application",
        "natural",
        "social",
        "science",
        "concept",
        "probability",
        "developed",
        "logical",
        "empiricist",
        "tradition",
        "primary",
        "concept",
        "epistemic",
        "conception",
        "probability",
        "begin",
        "carnap",
        "move",
        "developed",
        "subjectivist",
        "account",
        "carnap",
        "addressing",
        "different",
        "issue",
        "addressed",
        "von",
        "mi",
        "reichenbach",
        "instead",
        "focusing",
        "physical",
        "phenomenon",
        "ratio",
        "within",
        "carnap",
        "focus",
        "argument",
        "take",
        "point",
        "departure",
        "widespread",
        "conviction",
        "argument",
        "stronger",
        "varying",
        "degree",
        "others",
        "even",
        "conclusion",
        "similarly",
        "body",
        "evidence",
        "give",
        "u",
        "reason",
        "believe",
        "given",
        "conclusion",
        "would",
        "another",
        "body",
        "evidence",
        "carnap",
        "set",
        "task",
        "development",
        "quantitative",
        "concept",
        "probability",
        "clarify",
        "explicate",
        "widespread",
        "conviction",
        "quantitative",
        "concept",
        "would",
        "extraordinarily",
        "useful",
        "tool",
        "would",
        "useful",
        "successor",
        "ordinary",
        "somewhat",
        "scattered",
        "notion",
        "confirmation",
        "induction",
        "carnap",
        "approach",
        "problem",
        "first",
        "considering",
        "extremely",
        "limited",
        "artificial",
        "language",
        "trying",
        "find",
        "confirmation",
        "function",
        "work",
        "succeeds",
        "would",
        "try",
        "develop",
        "account",
        "would",
        "work",
        "broader",
        "richer",
        "range",
        "language",
        "approach",
        "like",
        "physicist",
        "developing",
        "physical",
        "theory",
        "highly",
        "artificial",
        "situation",
        "billiard",
        "table",
        "air",
        "track",
        "broadening",
        "theory",
        "deal",
        "wider",
        "range",
        "case",
        "carnap",
        "case",
        "however",
        "somewhat",
        "unclear",
        "success",
        "would",
        "artificial",
        "language",
        "much",
        "unlike",
        "case",
        "carnap",
        "trying",
        "describe",
        "linguistic",
        "habit",
        "clarify",
        "even",
        "replace",
        "something",
        "useful",
        "early",
        "logical",
        "syntax",
        "carnap",
        "carnap",
        "suggested",
        "wittgenstein",
        "remark",
        "tractatus",
        "range",
        "tractatus",
        "might",
        "starting",
        "point",
        "thinking",
        "probability",
        "carnap",
        "also",
        "distinguished",
        "two",
        "approach",
        "described",
        "insisting",
        "competitor",
        "attempting",
        "explicate",
        "two",
        "different",
        "concept",
        "probability",
        "one",
        "need",
        "choose",
        "one",
        "concept",
        "concept",
        "useful",
        "reichenbach",
        "contrast",
        "never",
        "conceded",
        "concept",
        "needed",
        "insisted",
        "frequency",
        "notion",
        "could",
        "serve",
        "epistemic",
        "purpose",
        "notion",
        "probability",
        "needed",
        "carnap",
        "general",
        "strategy",
        "first",
        "identify",
        "broad",
        "class",
        "confirmation",
        "function",
        "subjectivist",
        "ramsay",
        "de",
        "finetti",
        "also",
        "find",
        "natural",
        "way",
        "limiting",
        "class",
        "still",
        "confirmation",
        "function",
        "meet",
        "basic",
        "mathematical",
        "condition",
        "axiom",
        "state",
        "condition",
        "partially",
        "define",
        "function",
        "function",
        "interpreted",
        "number",
        "way",
        "carnap",
        "list",
        "three",
        "carnap",
        "john",
        "kemeny",
        "one",
        "carnap",
        "collaborator",
        "later",
        "coinventor",
        "basic",
        "programming",
        "language",
        "still",
        "later",
        "president",
        "dartmouth",
        "college",
        "gave",
        "argument",
        "persuaded",
        "carnap",
        "fruitful",
        "think",
        "function",
        "indicating",
        "fair",
        "betting",
        "quotient",
        "rather",
        "evidential",
        "support",
        "took",
        "carnap",
        "even",
        "closer",
        "conception",
        "work",
        "subjectivist",
        "ramsey",
        "de",
        "finetti",
        "indeed",
        "discussion",
        "fair",
        "betting",
        "quotient",
        "related",
        "issue",
        "dutch",
        "book",
        "argument",
        "initiated",
        "de",
        "finetti",
        "logical",
        "foundation",
        "probability",
        "carnap",
        "discussed",
        "bayes",
        "theorem",
        "promised",
        "expand",
        "discussion",
        "second",
        "volume",
        "carnap",
        "interest",
        "bayesianism",
        "grew",
        "second",
        "volume",
        "never",
        "materialized",
        "quite",
        "possibly",
        "rapid",
        "development",
        "field",
        "still",
        "way",
        "time",
        "carnap",
        "death",
        "work",
        "proceeded",
        "carnap",
        "tended",
        "explain",
        "probability",
        "reference",
        "event",
        "proposition",
        "rather",
        "speak",
        "overtly",
        "sentence",
        "similar",
        "change",
        "appears",
        "rest",
        "carnap",
        "work",
        "well",
        "clear",
        "however",
        "whether",
        "amount",
        "major",
        "change",
        "view",
        "change",
        "see",
        "felicitous",
        "mode",
        "expression",
        "year",
        "progressed",
        "carnap",
        "tended",
        "see",
        "remaining",
        "difference",
        "subjectivist",
        "coworker",
        "chiefly",
        "difference",
        "emphasis",
        "case",
        "subjectivist",
        "tradition",
        "dominant",
        "philosophical",
        "discussion",
        "probability",
        "zabell",
        "richard",
        "jeffrey",
        "whose",
        "work",
        "arose",
        "logical",
        "empiricism",
        "carried",
        "tradition",
        "year",
        "carnap",
        "death",
        "jeffrey",
        "made",
        "major",
        "contribution",
        "including",
        "principle",
        "updating",
        "one",
        "belief",
        "evidence",
        "one",
        "learns",
        "certain",
        "world",
        "know",
        "principle",
        "jeffrey",
        "conditionalization",
        "called",
        "simply",
        "probability",
        "kinematics",
        "popper",
        "view",
        "probability",
        "propensity",
        "theory",
        "differs",
        "either",
        "two",
        "approach",
        "discussed",
        "unlike",
        "epistemic",
        "approach",
        "carnap",
        "others",
        "popper",
        "trying",
        "clarify",
        "inductive",
        "relation",
        "believe",
        "inductive",
        "inference",
        "theory",
        "corroborated",
        "passing",
        "severe",
        "test",
        "thereby",
        "inductively",
        "confirmed",
        "made",
        "probable",
        "discussion",
        "whether",
        "significant",
        "similarity",
        "popper",
        "idea",
        "corroboration",
        "idea",
        "inductive",
        "confirmation",
        "reject",
        "see",
        "salmon",
        "propensity",
        "thought",
        "tendency",
        "physical",
        "event",
        "state",
        "produce",
        "another",
        "event",
        "state",
        "propensity",
        "feature",
        "external",
        "event",
        "use",
        "hume",
        "phrase",
        "relation",
        "idea",
        "propensity",
        "theory",
        "statisticalfrequency",
        "theory",
        "sometimes",
        "grouped",
        "together",
        "account",
        "chance",
        "popper",
        "specifically",
        "applied",
        "propensity",
        "single",
        "nonrepeatable",
        "event",
        "suggests",
        "concept",
        "propensity",
        "involve",
        "essential",
        "reference",
        "long",
        "sequence",
        "event",
        "popper",
        "also",
        "taken",
        "propensity",
        "producing",
        "outcome",
        "certain",
        "limit",
        "frequency",
        "suggest",
        "rather",
        "closer",
        "tie",
        "statistical",
        "frequency",
        "approach",
        "later",
        "philosopher",
        "developed",
        "sort",
        "propensity",
        "theory",
        "singlecase",
        "theory",
        "longrun",
        "theory",
        "gillie",
        "like",
        "approach",
        "probability",
        "induction",
        "view",
        "remain",
        "controversial",
        "discus",
        "relative",
        "merit",
        "various",
        "approach",
        "interested",
        "popper",
        "view",
        "area",
        "look",
        "many",
        "paper",
        "probability",
        "induction",
        "confirmation",
        "corroboration",
        "popper",
        "reply",
        "philosophy",
        "karl",
        "popper",
        "schilpp"
    ]
}