{
    "main_text": "Bridge principles\n4. Bridge principles\n\nLet us focus on\n IMP\n for now. Harman’s objections establish that\n IMP—in\n its current form, at least—is untenable. The question is\nwhether\n IMP\n can be improved upon in a way that is invulnerable to Harman’s\nobjections. In other words, the question is whether a tenable version\nof what MacFarlane (MF2004) calls a bridge principle is to be\nhad. A bridge principle, in this context, is a general principle that\narticulates a substantive relation between “facts” about\nlogical consequence (or perhaps an agent’s attitudes towards\nsuch facts) on the one hand, and norms governing the agent’s\ndoxastic attitudes vis-à-vis the propositions standing\nin these logical relations on the other.\n IMP\n is a bridge principle, albeit not a promising one.\n\nHarman’s skepticism about the normativity of logic can thus be\nunderstood as skepticism as to whether a serviceable bridge principle\nis to be had. In order properly to adjudicate whether Harman’s\nskepticism is justified, we need to know what “the options\nare”. But how? John MacFarlane (MF2004) offers a helpful taxonomy of bridge principles which constitutes a very good\nfirst approximation of the range of options. This section briefly\nsummarizes MacFarlane’s classification, as well as subsequent\ndevelopments in the literature.\n\nLet us begin with a general blue print for constructing bridge\n principles:[16]\n\n\n(\\(\\star\\))\nIf \\(A_{1},\\dots, A_{n} \\models C, \\textrm{ then } N(\\alpha(A_{1}),\n\\dots, \\alpha(A_{n}), \\beta(C))\\). \n\n\nA bridge principle thus takes the form of a material conditional. The\nconditional’s antecedent states “facts” about\nlogical consequence (or attitudes toward such “facts”).\nIts consequent contains a (broadly) normative claim concerning the\nagent’s doxastic attitudes towards the relevant propositions.\nDoxastic attitudes, as I use the term, include belief, disbelief, and\ndegree of\n belief.[17]\n Here \\(\\alpha\\) may (but need not) represent the same attitude as\n\\(\\beta\\). In fact, for principles with negative polarity, it may\nrepresent the negation of an attitude: “do not disbelieve the\nconclusion, if you believe the premises”.\n\nIn what ways, now, can we vary this schema so as to generate the space\nof possible bridge principles? MacFarlane introduces three parameters\nalong which the schema may be varied. Each parameter allows for\nmultiple “discrete settings”. We can think of the logical\nspace of bridge principles as the range of possible combinations among\nthese parameter settings.\n\n\n\nIn order to express the normative claims, we will need deontic\nvocabulary. Bridge principles may differ in the deontic operator they\ndeploy: does the normative constraint take the form of an\nought (o), a permission (p) or merely of having (defeasible)\nreason (r)? \n\n\nWhat is the polarity of the normative claim? Is it a\npositive obligation/permission/reason to believe a\ncertain proposition given one’s belief in a number of premises (+)? Or rather is it a\nnegative obligation/prohibition/reason not to\ndisbelieve (−)? \n\n\nWhat is the scope of the deontic operator? Different bridge principles\nresult from varying the scope of the deontic operator. Let \\(O\\) stand\ngenerically for one of the above deontic operators. Given that the\nconsequent of a bridge principle will typically itself take the form\nof a conditional, the operator can take\n\nnarrow scope with respect to the consequent (C): \\(A\n\\supset O(B)\\)\nwide scope (W): \\(O(A \\supset\nB)\\)\nor it can govern both the antecedent and the consequent of the\nconditional\n (B):[18]\n\\(O(A) \\supset O(B)\\)\n\n\n\nThese three parameters admit of a total of eighteen combinations of\ntheir settings and hence eighteen bridge principles. The symbols in\nparentheses associated with each parameter setting combine to\ndetermine a unique label for each of the principles: The first letter\nindicates the scope of the deontic operator (C, W or B), the second\nletter indicates the type of deontic operator (o[bligation],\np[ermissions], r[easons]) and the “+” or\n“−” indicate positive and negative polarity\n respectively.[19]\n For example, the label “Co+” corresponds to our original\nprinciple\n IMP:\n\n\n\nIf \\(A_{1}, A_{2}, \\dots, A_{n} \\models C\\), then if \\(S\\) believes\n\\(A_{1}, A_{2}, \\dots, A_{n}\\), \\(S\\) ought to believe\n\\(C\\). \n\n\nAnd “Wr−” designates:\n\n\n\nIf \\(A_{1}, A_{2}, \\dots, A_{n} \\models C\\), then \\(S\\) has reason to\n(believe \\(A_{1}, A_{2}, \\dots, A_{n}\\), only if \\(S\\) does not\ndisbelieve \\(C\\)). \n\n\nMany will regard the bridge principles we have presented thus far to\nbe problematic. They all relate “facts” about logical\nentailment—assuming there are such things—to certain\nnormative constraints on the agent’s attitudes. The trouble, they will say, is\nthat these principles are not sensitive to the cognitive limitations\nof ordinary agents. Agents, if they are even remotely like us, are not\napprised of all entailment “facts”. Consequently,\nespecially the “ought”-based principles (at least on some\nunderstanding of “ought”) are therefore vulnerable to\nHarman’s\n Objection from Excessive Demands.\n\nA natural response is to consider attitudinal bridge principles.  I\ncall attitudinal bridge principles whose antecedents are\nrestricted to logical implications to which the agent bears an\nattitude. For instance, to take the type of attitudinal principle\nconsidered by MacFarlane, Co+ may be transformed into:\n\n(Co+k) If\n\\(S\\) knows that \\(A_{1},\\dots, A_{n} \\models C\\), then if \\(S\\)\nbelieves the \\(A_{i}\\), \\(S\\) ought to believe \\(C\\). \n\n\nAccording to (Co+k), the agent’s belief set ought to be closed\nonly under known logical consequence. Let us call this an\nattitudinally constrained or, more specifically, the\nepistemically constrained variant of Co+ (whence the\n“k” in the label). Different authors may go in for\ndifferent types of attitudes. Knowledge, of course, is a factive\nattitude. Some will wish to leave room for the possibility of\n(systematic) logical error. For instance, an agent might mistakenly\ncomply with the principle \\(A\\supset B, B \\models A\\). Perhaps even\nsomeone with erroneous logical convictions such as this should, for\nthe sake of internal coherence, comply with the principles he deems\ncorrect. An agent who sincerely took an erroneous principle to be\ncorrect but failed to reason in accordance with it may be seen to\nmanifest a greater degree of irrationality than someone who at least\nconformed to principles he endorses. But we can also imagine more\ninteresting cases of systematic error. Suppose I am impressed with an\nargument for a particular non-classical logic as a means of parrying\nthe semantic paradoxes. I thus come to espouse the logic in question\nand begin to manage my doxastic attitudes accordingly. But now suppose\nin addition that unbeknownst to me the arguments that persuaded me are\nnot in fact sound. Again, it might be thought that though I am\nmistaken in my adherence to the logic, so long as I had good reasons\nto espouse it, it may nevertheless be proper for me to comply with its\nprinciples. If logical error in either of these two senses is to be\naccommodated, the appropriate attitude would have to be\nnon-factive.\n\nA further issue is that ordinary agents are presumably normatively\nbound by logical principles without being able to articulate or\nrepresent those principles to themselves explicitly. Assuming\notherwise runs the risk of overly intellectualizing our ability to\nconform to logical norms. The attitudes borne by such logically\nuntrained agents to the logical principles therefore presumably are\nnot belief-like. Perhaps such agents are better thought of as\nexercising an ability or having a disposition to take certain forms of\nentailment to be correct. See Corine Besson 2012 for a criticism of\ndispositionalist accounts of logical competence, and Murzi &\nSteinberger 2013 for a partial defense.\n\nHaving thus outlined the classificatory scheme, a number of additional\ncomments are in order. Notice that disbelieving \\(A\\) is to be\ndistinguished from not believing \\(A\\). One cannot rationally believe\nand disbelieve the same proposition (although see\n note 12).\n Hence, I ought to ensure that when I disbelieve \\(A\\), I do not\nbelieve \\(A\\). The converse, however, obviously does not hold since I\ncan fail to believe \\(A\\) without actively disbelieving it. I may, for\ninstance, choose to suspend my judgment as to whether \\(A\\) pending\nfurther evidence, or I may simply never have considered whether \\(A\\).\nFurthermore, I will remain neutral on the question as to whether the\nattitude of disbelieving \\(A\\) should be identified with that of\nbelieving \\(\\neg A\\).\n\nMoreover, a note on deontic modals is in order. “You ought not\n\\(\\Phi\\)” (\\(O\\neg \\Phi\\)) is not the same as saying “It\nis not the case that you ought to \\(\\Phi\\)” (\\(\\neg O \\Phi\\)).\nBut rather “You are forbidden from \\(\\Phi\\)ing”.\nConsequently, “You ought not disbelieve \\(A\\)” should be\nread as “disbelieving \\(A\\) would be a mistake”, as\nopposed to “it is not the case that you ought to disbelieve\n\\(A\\)”, which is compatible with the permissibility of\ndisbelieving \\(A\\).\n\nOught and may are understood to be strict notions. By contrast,\nreason is a pro tanto or contributory notion. Having\nreason to \\(\\Phi\\) is compatible with simultaneously having reason not\nto \\(\\Phi\\) and indeed with it being the case that I ought not to\n\\(\\Phi\\). Reasons, unlike oughts, may be weighed against each\nother; the side that wins out determines what ought to be done.\nFinally, I am here treating all deontic modals as propositional\noperators. This too is not uncontroversial. Peter Geach (1982) and\nmore recently Mark Schroeder (2011) have argued that so-called\ndeliberative or practical oughts are best analyzed not as\noperators acting on propositions but rather as expressing relations\nbetween agents and actions. (Interestingly, MacFarlane (2014: Ch. 11)\nhas recently followed suit.) Nevertheless, I will assume without\nargument that the operator-reading can be made to work even in the case of deliberative oughts. For defenses\nof this position see e.g., Broome 2000, 2013; Chrisman 2012; and\nWedgwood 2006. We can capture the particular connection between an\nagent and the obligation she has towards a proposition at a particular\ntime, by indexing the operator: \\(O_{S, t}\\). I will drop the indices\nin what follows.\n\nA last comment: MacFarlane is not explicit as to whether bridge\nprinciples are to be understood as synchronic\nnorms—norms that instruct us which patterns of doxastic\nattitudes are, in a specified sense, obligatory, permissible or\nreasonable at a given point in time; or whether they are to provide\ndiachronic norms—norms that instruct us how an\nagent’s doxastic state should or may evolve over time. To\nillustrate the distinction, let us consider Co+ (aka\n IMP)\n once again. Understood synchronically, the principle should be\nspelled out as follows.\n\n\n\nIf \\(A_{1}, A_{2}, \\dots, A_{n} \\models C\\), then if, at time \\(t\\),\n\\(S\\) believes \\(A_{1}, A_{2}, \\dots, A_{n}\\), then \\(S\\)\nought to believe \\(C\\) at time \\(t\\). \n\n\nIn other words, the principle demands that one’s beliefs be, at\nall times, closed under logical consequence. Alternatively, on might\ninterpret Co+ as a diachronic norm as follows:\n\n\n\nIf \\(A_{1}, A_{2}, \\dots, A_{n} \\models C\\), then if, at time \\(t\\),\n\\(S\\) believes \\(A_{1}, A_{2}, \\dots, A_{n}\\), then \\(S\\)\nought to believe \\(C\\) at time \\(t'\\) (where \\(t\\) precedes\n\\(t'\\) suitably closely). \n\n\nDifferent principles lend themselves more or less well to these two\nreadings. \\(C\\)- and \\(B\\)-type principles can be interpreted as\neither synchronic or diachronic principles on account of the fact that\nthey make explicit claims as to what an agent ought, may or has reason\nto believe or disbelieve given her other beliefs. The \\(W\\)s, by\ncontrast, are most plausibly read as synchronic principles. Such\nprinciples do not, in and of themselves, instruct the subject which\ninferences to make. Rather, they tend to proscribe certain patterns of\nbelief (and, perhaps, disbelief) or distributions of degrees of belief.\n",
    "section_title": "4. Bridge principles",
    "entry_title": "The Normative Status of Logic",
    "hierarchy_title": "The Normative Status of Logic || Bridge principles",
    "tokenized_text": [
        "bridge",
        "principle",
        "bridge",
        "principle",
        "let",
        "u",
        "focus",
        "imp",
        "harman",
        "objection",
        "establish",
        "impin",
        "current",
        "form",
        "leastis",
        "untenable",
        "question",
        "whether",
        "imp",
        "improved",
        "upon",
        "way",
        "invulnerable",
        "harman",
        "objection",
        "word",
        "question",
        "whether",
        "tenable",
        "version",
        "macfarlane",
        "mf",
        "call",
        "bridge",
        "principle",
        "bridge",
        "principle",
        "context",
        "general",
        "principle",
        "articulates",
        "substantive",
        "relation",
        "fact",
        "logical",
        "consequence",
        "perhaps",
        "agent",
        "attitude",
        "towards",
        "fact",
        "one",
        "hand",
        "norm",
        "governing",
        "agent",
        "doxastic",
        "attitude",
        "visàvis",
        "proposition",
        "standing",
        "logical",
        "relation",
        "imp",
        "bridge",
        "principle",
        "albeit",
        "promising",
        "one",
        "harman",
        "skepticism",
        "normativity",
        "logic",
        "thus",
        "understood",
        "skepticism",
        "whether",
        "serviceable",
        "bridge",
        "principle",
        "order",
        "properly",
        "adjudicate",
        "whether",
        "harman",
        "skepticism",
        "justified",
        "need",
        "know",
        "option",
        "john",
        "macfarlane",
        "mf",
        "offer",
        "helpful",
        "taxonomy",
        "bridge",
        "principle",
        "constitutes",
        "good",
        "first",
        "approximation",
        "range",
        "option",
        "section",
        "briefly",
        "summarizes",
        "macfarlane",
        "classification",
        "well",
        "subsequent",
        "development",
        "literature",
        "let",
        "u",
        "begin",
        "general",
        "blue",
        "print",
        "constructing",
        "bridge",
        "principle",
        "star",
        "a_",
        "dots",
        "a_",
        "n",
        "models",
        "c",
        "textrm",
        "n",
        "alpha",
        "a_",
        "dots",
        "alpha",
        "a_",
        "n",
        "beta",
        "c",
        "bridge",
        "principle",
        "thus",
        "take",
        "form",
        "material",
        "conditional",
        "conditional",
        "antecedent",
        "state",
        "fact",
        "logical",
        "consequence",
        "attitude",
        "toward",
        "fact",
        "consequent",
        "contains",
        "broadly",
        "normative",
        "claim",
        "concerning",
        "agent",
        "doxastic",
        "attitude",
        "towards",
        "relevant",
        "proposition",
        "doxastic",
        "attitude",
        "use",
        "term",
        "include",
        "belief",
        "disbelief",
        "degree",
        "belief",
        "alpha",
        "may",
        "need",
        "represent",
        "attitude",
        "beta",
        "fact",
        "principle",
        "negative",
        "polarity",
        "may",
        "represent",
        "negation",
        "attitude",
        "disbelieve",
        "conclusion",
        "believe",
        "premise",
        "way",
        "vary",
        "schema",
        "generate",
        "space",
        "possible",
        "bridge",
        "principle",
        "macfarlane",
        "introduces",
        "three",
        "parameter",
        "along",
        "schema",
        "may",
        "varied",
        "parameter",
        "allows",
        "multiple",
        "discrete",
        "setting",
        "think",
        "logical",
        "space",
        "bridge",
        "principle",
        "range",
        "possible",
        "combination",
        "among",
        "parameter",
        "setting",
        "order",
        "express",
        "normative",
        "claim",
        "need",
        "deontic",
        "vocabulary",
        "bridge",
        "principle",
        "may",
        "differ",
        "deontic",
        "operator",
        "deploy",
        "normative",
        "constraint",
        "take",
        "form",
        "ought",
        "permission",
        "p",
        "merely",
        "defeasible",
        "reason",
        "r",
        "polarity",
        "normative",
        "claim",
        "positive",
        "obligationpermissionreason",
        "believe",
        "certain",
        "proposition",
        "given",
        "one",
        "belief",
        "number",
        "premise",
        "rather",
        "negative",
        "obligationprohibitionreason",
        "disbelieve",
        "scope",
        "deontic",
        "operator",
        "different",
        "bridge",
        "principle",
        "result",
        "varying",
        "scope",
        "deontic",
        "operator",
        "let",
        "o",
        "stand",
        "generically",
        "one",
        "deontic",
        "operator",
        "given",
        "consequent",
        "bridge",
        "principle",
        "typically",
        "take",
        "form",
        "conditional",
        "operator",
        "take",
        "narrow",
        "scope",
        "respect",
        "consequent",
        "c",
        "supset",
        "b",
        "wide",
        "scope",
        "w",
        "supset",
        "b",
        "govern",
        "antecedent",
        "consequent",
        "conditional",
        "b",
        "supset",
        "b",
        "three",
        "parameter",
        "admit",
        "total",
        "eighteen",
        "combination",
        "setting",
        "hence",
        "eighteen",
        "bridge",
        "principle",
        "symbol",
        "parenthesis",
        "associated",
        "parameter",
        "setting",
        "combine",
        "determine",
        "unique",
        "label",
        "principle",
        "first",
        "letter",
        "indicates",
        "scope",
        "deontic",
        "operator",
        "c",
        "w",
        "b",
        "second",
        "letter",
        "indicates",
        "type",
        "deontic",
        "operator",
        "bligation",
        "p",
        "ermissions",
        "r",
        "easons",
        "indicate",
        "positive",
        "negative",
        "polarity",
        "respectively",
        "example",
        "label",
        "co",
        "corresponds",
        "original",
        "principle",
        "imp",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "models",
        "c",
        "s",
        "belief",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "s",
        "ought",
        "believe",
        "c",
        "wr",
        "designates",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "models",
        "c",
        "s",
        "reason",
        "believe",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "s",
        "disbelieve",
        "c",
        "many",
        "regard",
        "bridge",
        "principle",
        "presented",
        "thus",
        "far",
        "problematic",
        "relate",
        "fact",
        "logical",
        "entailmentassuming",
        "thingsto",
        "certain",
        "normative",
        "constraint",
        "agent",
        "attitude",
        "trouble",
        "say",
        "principle",
        "sensitive",
        "cognitive",
        "limitation",
        "ordinary",
        "agent",
        "agent",
        "even",
        "remotely",
        "like",
        "u",
        "apprised",
        "entailment",
        "fact",
        "consequently",
        "especially",
        "ought",
        "based",
        "principle",
        "least",
        "understanding",
        "ought",
        "therefore",
        "vulnerable",
        "harman",
        "objection",
        "excessive",
        "demand",
        "natural",
        "response",
        "consider",
        "attitudinal",
        "bridge",
        "principle",
        "call",
        "attitudinal",
        "bridge",
        "principle",
        "whose",
        "antecedent",
        "restricted",
        "logical",
        "implication",
        "agent",
        "bear",
        "attitude",
        "instance",
        "take",
        "type",
        "attitudinal",
        "principle",
        "considered",
        "macfarlane",
        "co",
        "may",
        "transformed",
        "cok",
        "s",
        "know",
        "a_",
        "dots",
        "a_",
        "n",
        "models",
        "c",
        "s",
        "belief",
        "a_",
        "s",
        "ought",
        "believe",
        "c",
        "according",
        "cok",
        "agent",
        "belief",
        "set",
        "ought",
        "closed",
        "known",
        "logical",
        "consequence",
        "let",
        "u",
        "call",
        "attitudinally",
        "constrained",
        "specifically",
        "epistemically",
        "constrained",
        "variant",
        "co",
        "whence",
        "k",
        "label",
        "different",
        "author",
        "may",
        "go",
        "different",
        "type",
        "attitude",
        "knowledge",
        "course",
        "factive",
        "attitude",
        "wish",
        "leave",
        "room",
        "possibility",
        "systematic",
        "logical",
        "error",
        "instance",
        "agent",
        "might",
        "mistakenly",
        "comply",
        "principle",
        "asupset",
        "b",
        "b",
        "models",
        "a",
        "perhaps",
        "even",
        "someone",
        "erroneous",
        "logical",
        "conviction",
        "sake",
        "internal",
        "coherence",
        "comply",
        "principle",
        "deems",
        "correct",
        "agent",
        "sincerely",
        "took",
        "erroneous",
        "principle",
        "correct",
        "failed",
        "reason",
        "accordance",
        "may",
        "seen",
        "manifest",
        "greater",
        "degree",
        "irrationality",
        "someone",
        "least",
        "conformed",
        "principle",
        "endorses",
        "also",
        "imagine",
        "interesting",
        "case",
        "systematic",
        "error",
        "suppose",
        "impressed",
        "argument",
        "particular",
        "nonclassical",
        "logic",
        "mean",
        "parrying",
        "semantic",
        "paradox",
        "thus",
        "come",
        "espouse",
        "logic",
        "question",
        "begin",
        "manage",
        "doxastic",
        "attitude",
        "accordingly",
        "suppose",
        "addition",
        "unbeknownst",
        "argument",
        "persuaded",
        "fact",
        "sound",
        "might",
        "thought",
        "though",
        "mistaken",
        "adherence",
        "logic",
        "long",
        "good",
        "reason",
        "espouse",
        "may",
        "nevertheless",
        "proper",
        "comply",
        "principle",
        "logical",
        "error",
        "either",
        "two",
        "sens",
        "accommodated",
        "appropriate",
        "attitude",
        "would",
        "nonfactive",
        "issue",
        "ordinary",
        "agent",
        "presumably",
        "normatively",
        "bound",
        "logical",
        "principle",
        "without",
        "able",
        "articulate",
        "represent",
        "principle",
        "explicitly",
        "assuming",
        "otherwise",
        "run",
        "risk",
        "overly",
        "intellectualizing",
        "ability",
        "conform",
        "logical",
        "norm",
        "attitude",
        "borne",
        "logically",
        "untrained",
        "agent",
        "logical",
        "principle",
        "therefore",
        "presumably",
        "belieflike",
        "perhaps",
        "agent",
        "better",
        "thought",
        "exercising",
        "ability",
        "disposition",
        "take",
        "certain",
        "form",
        "entailment",
        "correct",
        "see",
        "corine",
        "besson",
        "criticism",
        "dispositionalist",
        "account",
        "logical",
        "competence",
        "murzi",
        "steinberger",
        "partial",
        "defense",
        "thus",
        "outlined",
        "classificatory",
        "scheme",
        "number",
        "additional",
        "comment",
        "order",
        "notice",
        "disbelieving",
        "a",
        "distinguished",
        "believing",
        "a",
        "one",
        "rationally",
        "believe",
        "disbelieve",
        "proposition",
        "although",
        "see",
        "note",
        "hence",
        "ought",
        "ensure",
        "disbelieve",
        "a",
        "believe",
        "a",
        "converse",
        "however",
        "obviously",
        "hold",
        "since",
        "fail",
        "believe",
        "a",
        "without",
        "actively",
        "disbelieving",
        "may",
        "instance",
        "choose",
        "suspend",
        "judgment",
        "whether",
        "a",
        "pending",
        "evidence",
        "may",
        "simply",
        "never",
        "considered",
        "whether",
        "a",
        "furthermore",
        "remain",
        "neutral",
        "question",
        "whether",
        "attitude",
        "disbelieving",
        "a",
        "identified",
        "believing",
        "neg",
        "a",
        "moreover",
        "note",
        "deontic",
        "modal",
        "order",
        "ought",
        "phi",
        "oneg",
        "phi",
        "saying",
        "case",
        "ought",
        "phi",
        "neg",
        "phi",
        "rather",
        "forbidden",
        "phi",
        "ing",
        "consequently",
        "ought",
        "disbelieve",
        "a",
        "read",
        "disbelieving",
        "a",
        "would",
        "mistake",
        "opposed",
        "case",
        "ought",
        "disbelieve",
        "a",
        "compatible",
        "permissibility",
        "disbelieving",
        "a",
        "ought",
        "may",
        "understood",
        "strict",
        "notion",
        "contrast",
        "reason",
        "pro",
        "tanto",
        "contributory",
        "notion",
        "reason",
        "phi",
        "compatible",
        "simultaneously",
        "reason",
        "phi",
        "indeed",
        "case",
        "ought",
        "phi",
        "reason",
        "unlike",
        "oughts",
        "may",
        "weighed",
        "side",
        "win",
        "determines",
        "ought",
        "done",
        "finally",
        "treating",
        "deontic",
        "modal",
        "propositional",
        "operator",
        "uncontroversial",
        "peter",
        "geach",
        "recently",
        "mark",
        "schroeder",
        "argued",
        "socalled",
        "deliberative",
        "practical",
        "oughts",
        "best",
        "analyzed",
        "operator",
        "acting",
        "proposition",
        "rather",
        "expressing",
        "relation",
        "agent",
        "action",
        "interestingly",
        "macfarlane",
        "ch",
        "recently",
        "followed",
        "suit",
        "nevertheless",
        "assume",
        "without",
        "argument",
        "operatorreading",
        "made",
        "work",
        "even",
        "case",
        "deliberative",
        "oughts",
        "defense",
        "position",
        "see",
        "eg",
        "broome",
        "chrisman",
        "wedgwood",
        "capture",
        "particular",
        "connection",
        "agent",
        "obligation",
        "towards",
        "proposition",
        "particular",
        "time",
        "indexing",
        "operator",
        "o_",
        "drop",
        "index",
        "follows",
        "last",
        "comment",
        "macfarlane",
        "explicit",
        "whether",
        "bridge",
        "principle",
        "understood",
        "synchronic",
        "normsnorms",
        "instruct",
        "u",
        "pattern",
        "doxastic",
        "attitude",
        "specified",
        "sense",
        "obligatory",
        "permissible",
        "reasonable",
        "given",
        "point",
        "time",
        "whether",
        "provide",
        "diachronic",
        "normsnorms",
        "instruct",
        "u",
        "agent",
        "doxastic",
        "state",
        "may",
        "evolve",
        "time",
        "illustrate",
        "distinction",
        "let",
        "u",
        "consider",
        "co",
        "aka",
        "imp",
        "understood",
        "synchronically",
        "principle",
        "spelled",
        "follows",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "models",
        "c",
        "time",
        "t",
        "s",
        "belief",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "s",
        "ought",
        "believe",
        "c",
        "time",
        "t",
        "word",
        "principle",
        "demand",
        "one",
        "belief",
        "time",
        "closed",
        "logical",
        "consequence",
        "alternatively",
        "might",
        "interpret",
        "co",
        "diachronic",
        "norm",
        "follows",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "models",
        "c",
        "time",
        "t",
        "s",
        "belief",
        "a_",
        "a_",
        "dots",
        "a_",
        "n",
        "s",
        "ought",
        "believe",
        "c",
        "time",
        "t",
        "t",
        "precedes",
        "t",
        "suitably",
        "closely",
        "different",
        "principle",
        "lend",
        "le",
        "well",
        "two",
        "reading",
        "c",
        "b",
        "type",
        "principle",
        "interpreted",
        "either",
        "synchronic",
        "diachronic",
        "principle",
        "account",
        "fact",
        "make",
        "explicit",
        "claim",
        "agent",
        "ought",
        "may",
        "reason",
        "believe",
        "disbelieve",
        "given",
        "belief",
        "w",
        "contrast",
        "plausibly",
        "read",
        "synchronic",
        "principle",
        "principle",
        "instruct",
        "subject",
        "inference",
        "make",
        "rather",
        "tend",
        "proscribe",
        "certain",
        "pattern",
        "belief",
        "perhaps",
        "disbelief",
        "distribution",
        "degree",
        "belief"
    ]
}