{
    "main_text": "Motivations for Revision\n3. Motivations for Revision\n\nTowards the end of the eighteenth century, Kant could say (without\nmuch exaggeration) that logic had followed a single path since its\ninception, and that “since Aristotle it has not had to retrace a\nsingle step.” He also said that syllogistic logic was “to\nall appearance complete and perfect.” But this was exuberance.\nThe successes also highlighted problems that had been recognized.\n\nSome valid schemata are reducible to others, in that any inference of\nthe reducible form can be revealed as valid (with a little work) given\nother schemata. Consider (9).\n\n(9)\nIf Al ran then either Al did not run or Bob did not\nswim, and Al ran; so Bob did not swim.\n\n\nAssume that ‘Al did not run’ negates ‘Al ran’,\nwhile ‘Bob did not swim’ negates ‘Bob swam’.\nThen (9) is an instance of the following valid form: if\nA then either not-A or\nnot-B, and A; so\nnot-B. But we can treat this as a derived form, by\nshowing that any instance of this form is valid given two (intuitively\nmore basic) Stoic inference forms: if the first then\nthe second, and the first, so\nthe second; either not the first or\nnot the second, and the first; so\nnot the second. For suppose we are given the\nfollowing premises: A; and if A,\nthen either not-A or not-B. We can\nsafely infer that either not-A or\nnot-B; and since we were given A, we\ncan safely infer not-B. Similarly, the syllogistic\nschema (10) can be treated as a derived form.\n\n(10)\nSome S is not P, and every\nD is P; so not every S is D.\n\n\nIf some S is not P, and every D is\nP, then it isn’t true that every S is\nD. For if every S is D, and every\nD is P, then every S is P. But\nif some S is not P, then as we saw above,\nnot every S is P. So given the premises of (10),\nadding ‘every S is D’ would lead to\ncontradiction: every S is P, and not every\nS is P. So the premises imply the negation of\n‘every S is D’. This reasoning shows how\n(10) can be reduced to inferential patterns that seem more\nbasic—raising the question of how much reduction is possible.\nEuclid’s geometry had provided a model for how to present a body\nof knowledge as a network of propositions that follow from a few basic\naxioms. Aristotle himself indicated how to reduce all the valid\nsyllogistic schemata to four basic patterns, given a few principles\nthat govern how the basic patterns can be used to derive others; see\nParsons (2014) for discussion. And further reduction is possible given\ninsights from the medieval period.\n\nConsider the following pair of valid inferences: Fido is a brown dog,\nso Fido is a dog; Fido is not a dog, so Fido is not a brown dog. As\nillustrated with the first example, replacing a predicate (or general\nterm) like ‘brown dog’ with a less restrictive\npredicate like ‘dog’ is often valid. But\nsometimes—paradigmatically, in cases involving\nnegation—replacing a predicate like ‘dog’ with a\nmore restrictive predicate like ‘brown dog’ is\nvalid. Plausibly, the first pattern reflects the default direction of\nvalid replacement: removing a restriction preserves truth, except in\nspecial cases like those involving negation. Suppose we take it as\ngiven that poodles are dogs of a particular sort, and hence that every\npoodle is a dog. Then replacing‘poodle’ with\n‘dog’ in ‘Fido is P’ is valid,\nregardless of what ‘Fido’ names. This can be viewed as a\nspecial case of ‘n is P, and every P\nis D; so n is D’. But the validity of\nthis inference form can also be viewed as symptom of a basic principle\nthat came be called dictum de omni: whatever is true of every\nP is true of any P. Or as Aristotle might have put\nit, if the property of being a dog belongs to every poodle, then it\nbelongs to any poodle. In which case, Fido is a dog if Fido is a\npoodle. And since the property of being a dog surely belongs to every\nbrown dog, any brown dog is a dog. The flip side of this point is that\nnegation inverts the default direction of inference. Anything that\nisn’t a dog isn’t a brown dog; and similarly, if Fido\nisn’t a dog, then Fido isn’t a poodle. So in special\ncases, adding a restriction to a general term like ‘dog’\ncan preserve truth.\n\nFrom this perspective, the Aristotelian quantifier ‘Some’\nis a default-style quantifier that validates removing\nrestrictions. If some brown dog is a clever mutt, it follows that some\ndog is a clever mutt, and hence that some dog is a mutt. By contrast,\n‘No’ is an inverted-style quantifier that validates\nadding restrictions. If no dog is a mutt, it follows that no\ndog is a clever mutt, and hence that no brown dog is a clever mutt.\nThe corresponding principle, dictum de nullo, encodes this\npattern: whatever is true of no P is not true of any\nP; so if the property of being a mutt belongs to no dog, it\nbelongs to no poodle. (And as Aristotle noted, instances of ‘No\nS is P’ can be analyzed as the propositional\nnegations of corresponding instances of ‘Some S\nisn’t P’.)\n\nInterestingly, ‘Every’ is like ‘No’ in one\nrespect, and like ‘Some’ in another respect. If every dog\nis clever, it follows that every brown dog is clever; but if every dog\nis a clever mutt, it follows that every dog is a mutt. So when the\nuniversal quantifier combines with a general term S to form a\nsubject, S is governed by the inverted rule of\nreplacement. But when a universally quantified subject combines with a\nsecond general term to form a proposition, this second term is\ngoverned by the default rule of replacement. Given that\n‘Every’ has this mixed logical character, the valid\nsyllogisms can be derived from two basic patterns (noted above), both\nof which reflect dictum de omni: whatever is true of every\nP is true of any P.\n\n\nEvery S is P, and every P is D; so\nevery S is D.\n\nEvery S is P, and some D is S; so\nsome D is P.\n\n\nThe first principle reflects the sense in which universal\nquantification is transitive. The second principle captures the idea\nthat the universal premise can license replacement of\n‘S’ with ‘P’ in a\nproposition about some individual. In this sense, classical logic\nexhibits a striking unity and simplicity, at least with regard to\ninferences involving the Aristotelian quantifiers and predication. For\nfurther discussion, see Sommers (1984), van Bentham (1986), Sanchez\n(1991, 1994), and Ludlow (2005).\n\nAlas, matters become more complicated once we consider relations.\n\nSentences like ‘Juliet kissed Romeo’ do not seem to have\nSubject-copula-Predicate form. One might suggest ‘Juliet was a\nkisser of Romeo’ as a paraphrase. But ‘kisser of\nRomeo’ differs, in ways that matter to inference, from general\nterms like ‘politician’. If Juliet (or anyone) was a\nkisser of Romeo, it follows that someone was kissed; whereas if Juliet\nwas a politician, there is no corresponding logical consequence to the\neffect that someone was __-ed. Put another way, the proposition that\nJuliet kissed someone exhibits interesting logical structure, even if\nwe can express this proposition via the sentence ‘Juliet was a\nkisser of someone’. A quantifier can be part of a complex\npredicate. But classical logic did not capture the validity of\ninferences involving predicates that have quantificational\nconstituents. Consider (11).\n\n(11)\nSome patient respects every doctor, and some doctor\nis a liar; so some patient respects some liar.\n\n\nIf ‘respects every doctor’ and ‘respects some\nliar’ indicate nonrelational proposition-parts, much like\n‘is sick’ or ‘is happy’, then inference (11)\nhas the following form ‘Some P is S, and some\nD is L; so some P is H’. But\nthis schema, which fails to reflect the quantificational structure\nwithin the predicates is not valid. Its instances include bad\ninferences like the following: some patient is sick, and some doctor\nis a liar; so some patient is happy. This dramatizes the point that\n‘respects every doctor’ and ‘respects some\nliar’ are—unlike ‘is sick’ and ‘is\ntall’—logically related in a way that matters given the\nsecond premise of (11).\n\nOne can adopt the view that many propositions have relational parts,\nintroducing a variable ‘R’ intended to range over\nrelations; see the entries on\n medieval relations,\n and\n medieval terms.\n One can also formulate the following schema: some P R\nevery D, and some D is L; so some\nP R some L. But the problem remains.\nQuantifiers can appear in complex predicates that figure in valid\ninferences like (12).\n\n(12)\nEvery patient who respects every doctor is sick,\nand\n\nsome patient who saw every lawyer respects every doctor; so\n\nsome patient who saw every lawyer is sick.\n\n\nBut if ‘patient who respects every doctor’ and\n‘patient who saw every lawyer’ are nonrelational, much\nlike ‘old patient’ or ‘young patient’, then\n(12) has the following form: every O is S, and some\nY R every D; so some Y is\nS. And many inferences of this form are invalid. For example:\nevery otter is sick, and some yak respects every doctor; so some yak\nis sick. Again, one can abstract a valid schema that covers (12),\nletting parentheses indicate a relative clause that restricts the\nadjacent predicate.\n\nEvery P(R1 every D) is S, and some\nP(R2 every L) R1 every D; so\nsome P(R2 every L) is S.\n\n\nBut no matter how complex the schema, the relevant predicates can\nexhibit further quantificational structure. (Consider the proposition\nthat every patient who met some doctor who saw no lawyer\nrespects some lawyer who saw no patient who met every\ndoctor.) Moreover, schemata like the one above are poor\ncandidates for basic inference patterns.\n\nAs medieval logicians knew, propositions expressed with relative\nclauses also pose other difficulties; see the entry on\n medieval syllogism.\n If every doctor is healthy, it follows that every young doctor is\nhealthy. By itself, this is expected, since a universally quantified\nsubject licenses replacement of ‘doctor’ with the more\nrestrictive predicate ‘young doctor’. But consider (13)\nand (14).\n\n(13)\nNo patient who saw every young doctor is\nhealthy.\n(14)\nNo patient who saw every doctor is healthy.\n\n\nHere, the direction of valid inference is from ‘young\ndoctor’ to ‘doctor’, as if the inference is governed\nby the (default) inference rule that licenses replacement of\n‘young doctor’ with the less restrictive predicate\n‘doctor’. One can say that the default direction of\nimplication, from more restrictive to less restrictive predicates, has\nbeen inverted twice—once by ‘No’, and once by\n‘every’. But one wants a systematic account of\npropositional structure that explains the net effect; see Ludlow\n(2002) for further discussion. Sommers (1982) offers a strategy for\nrecoding and extending classical logic, in part by exploiting an idea\nsuggested by\n Leibniz\n (and arguably Pāṇini): a relational sentence like\n‘Juliet loved Romeo’ somehow combines an active-voice\nsentence with a passive-voice sentence, perhaps along the lines of\n‘Juliet loved, and thereby Romeo was loved’; cp.\n section nine.\n But one way or another, quantifiers need to be characterized in a way\nthat captures their general logical role—and not just their role\nas potential subjects of Aristotelian propositions—if\nimpeccability is to be revealed as a matter of form. Quantifiers are\nnot simply devices for creating schemata like ‘Every S\nis P’, into which general terms like\n‘politician’ and ‘deceitful’ can be inserted.\nInstances of ‘S’ and ‘P’ can\nthemselves have quantificational structure and relational\nconstituents.\n",
    "section_title": "3. Motivations for Revision",
    "entry_title": "Logical Form",
    "hierarchy_title": "Logical Form || Motivations for Revision",
    "tokenized_text": [
        "motivation",
        "revision",
        "motivation",
        "revision",
        "towards",
        "end",
        "eighteenth",
        "century",
        "kant",
        "could",
        "say",
        "without",
        "much",
        "exaggeration",
        "logic",
        "followed",
        "single",
        "path",
        "since",
        "inception",
        "since",
        "aristotle",
        "retrace",
        "single",
        "step",
        "also",
        "said",
        "syllogistic",
        "logic",
        "appearance",
        "complete",
        "perfect",
        "exuberance",
        "success",
        "also",
        "highlighted",
        "problem",
        "recognized",
        "valid",
        "schema",
        "reducible",
        "others",
        "inference",
        "reducible",
        "form",
        "revealed",
        "valid",
        "little",
        "work",
        "given",
        "schema",
        "consider",
        "al",
        "ran",
        "either",
        "al",
        "run",
        "bob",
        "swim",
        "al",
        "ran",
        "bob",
        "swim",
        "assume",
        "al",
        "run",
        "negates",
        "al",
        "ran",
        "bob",
        "swim",
        "negates",
        "bob",
        "swam",
        "instance",
        "following",
        "valid",
        "form",
        "either",
        "nota",
        "notb",
        "notb",
        "treat",
        "derived",
        "form",
        "showing",
        "instance",
        "form",
        "valid",
        "given",
        "two",
        "intuitively",
        "basic",
        "stoic",
        "inference",
        "form",
        "first",
        "second",
        "first",
        "second",
        "either",
        "first",
        "second",
        "first",
        "second",
        "suppose",
        "given",
        "following",
        "premise",
        "either",
        "nota",
        "notb",
        "safely",
        "infer",
        "either",
        "nota",
        "notb",
        "since",
        "given",
        "safely",
        "infer",
        "notb",
        "similarly",
        "syllogistic",
        "schema",
        "treated",
        "derived",
        "form",
        "p",
        "every",
        "p",
        "every",
        "d",
        "p",
        "every",
        "p",
        "true",
        "every",
        "d",
        "every",
        "every",
        "p",
        "every",
        "p",
        "p",
        "saw",
        "every",
        "p",
        "given",
        "premise",
        "adding",
        "every",
        "would",
        "lead",
        "contradiction",
        "every",
        "p",
        "every",
        "p",
        "premise",
        "imply",
        "negation",
        "every",
        "reasoning",
        "show",
        "reduced",
        "inferential",
        "pattern",
        "seem",
        "basicraising",
        "question",
        "much",
        "reduction",
        "possible",
        "euclid",
        "geometry",
        "provided",
        "model",
        "present",
        "body",
        "knowledge",
        "network",
        "proposition",
        "follow",
        "basic",
        "axiom",
        "aristotle",
        "indicated",
        "reduce",
        "valid",
        "syllogistic",
        "schema",
        "four",
        "basic",
        "pattern",
        "given",
        "principle",
        "govern",
        "basic",
        "pattern",
        "used",
        "derive",
        "others",
        "see",
        "parson",
        "discussion",
        "reduction",
        "possible",
        "given",
        "insight",
        "medieval",
        "period",
        "consider",
        "following",
        "pair",
        "valid",
        "inference",
        "fido",
        "brown",
        "dog",
        "fido",
        "dog",
        "fido",
        "dog",
        "fido",
        "brown",
        "dog",
        "illustrated",
        "first",
        "example",
        "replacing",
        "predicate",
        "general",
        "term",
        "like",
        "brown",
        "dog",
        "le",
        "restrictive",
        "predicate",
        "like",
        "dog",
        "often",
        "valid",
        "sometimesparadigmatically",
        "case",
        "involving",
        "negationreplacing",
        "predicate",
        "like",
        "dog",
        "restrictive",
        "predicate",
        "like",
        "brown",
        "dog",
        "valid",
        "plausibly",
        "first",
        "pattern",
        "reflects",
        "default",
        "direction",
        "valid",
        "replacement",
        "removing",
        "restriction",
        "preserve",
        "truth",
        "except",
        "special",
        "case",
        "like",
        "involving",
        "negation",
        "suppose",
        "take",
        "given",
        "poodle",
        "dog",
        "particular",
        "sort",
        "hence",
        "every",
        "poodle",
        "dog",
        "replacing",
        "poodle",
        "dog",
        "fido",
        "p",
        "valid",
        "regardless",
        "fido",
        "name",
        "viewed",
        "special",
        "case",
        "n",
        "p",
        "every",
        "p",
        "n",
        "validity",
        "inference",
        "form",
        "also",
        "viewed",
        "symptom",
        "basic",
        "principle",
        "came",
        "called",
        "dictum",
        "de",
        "omni",
        "whatever",
        "true",
        "every",
        "p",
        "true",
        "p",
        "aristotle",
        "might",
        "put",
        "property",
        "dog",
        "belongs",
        "every",
        "poodle",
        "belongs",
        "poodle",
        "case",
        "fido",
        "dog",
        "fido",
        "poodle",
        "since",
        "property",
        "dog",
        "surely",
        "belongs",
        "every",
        "brown",
        "dog",
        "brown",
        "dog",
        "dog",
        "flip",
        "side",
        "point",
        "negation",
        "inverts",
        "default",
        "direction",
        "inference",
        "anything",
        "dog",
        "brown",
        "dog",
        "similarly",
        "fido",
        "dog",
        "fido",
        "poodle",
        "special",
        "case",
        "adding",
        "restriction",
        "general",
        "term",
        "like",
        "dog",
        "preserve",
        "truth",
        "perspective",
        "aristotelian",
        "quantifier",
        "defaultstyle",
        "quantifier",
        "validates",
        "removing",
        "restriction",
        "brown",
        "dog",
        "clever",
        "mutt",
        "follows",
        "dog",
        "clever",
        "mutt",
        "hence",
        "dog",
        "mutt",
        "contrast",
        "invertedstyle",
        "quantifier",
        "validates",
        "adding",
        "restriction",
        "dog",
        "mutt",
        "follows",
        "dog",
        "clever",
        "mutt",
        "hence",
        "brown",
        "dog",
        "clever",
        "mutt",
        "corresponding",
        "principle",
        "dictum",
        "de",
        "nullo",
        "encodes",
        "pattern",
        "whatever",
        "true",
        "p",
        "true",
        "p",
        "property",
        "mutt",
        "belongs",
        "dog",
        "belongs",
        "poodle",
        "aristotle",
        "noted",
        "instance",
        "p",
        "analyzed",
        "propositional",
        "negation",
        "corresponding",
        "instance",
        "p",
        "interestingly",
        "every",
        "like",
        "one",
        "respect",
        "like",
        "another",
        "respect",
        "every",
        "dog",
        "clever",
        "follows",
        "every",
        "brown",
        "dog",
        "clever",
        "every",
        "dog",
        "clever",
        "mutt",
        "follows",
        "every",
        "dog",
        "mutt",
        "universal",
        "quantifier",
        "combine",
        "general",
        "term",
        "form",
        "subject",
        "governed",
        "inverted",
        "rule",
        "replacement",
        "universally",
        "quantified",
        "subject",
        "combine",
        "second",
        "general",
        "term",
        "form",
        "proposition",
        "second",
        "term",
        "governed",
        "default",
        "rule",
        "replacement",
        "given",
        "every",
        "mixed",
        "logical",
        "character",
        "valid",
        "syllogism",
        "derived",
        "two",
        "basic",
        "pattern",
        "noted",
        "reflect",
        "dictum",
        "de",
        "omni",
        "whatever",
        "true",
        "every",
        "p",
        "true",
        "p",
        "every",
        "p",
        "every",
        "p",
        "every",
        "d",
        "every",
        "p",
        "p",
        "first",
        "principle",
        "reflects",
        "sense",
        "universal",
        "quantification",
        "transitive",
        "second",
        "principle",
        "capture",
        "idea",
        "universal",
        "premise",
        "license",
        "replacement",
        "p",
        "proposition",
        "individual",
        "sense",
        "classical",
        "logic",
        "exhibit",
        "striking",
        "unity",
        "simplicity",
        "least",
        "regard",
        "inference",
        "involving",
        "aristotelian",
        "quantifier",
        "predication",
        "discussion",
        "see",
        "sommers",
        "van",
        "bentham",
        "sanchez",
        "ludlow",
        "ala",
        "matter",
        "become",
        "complicated",
        "consider",
        "relation",
        "sentence",
        "like",
        "juliet",
        "kissed",
        "romeo",
        "seem",
        "subjectcopulapredicate",
        "form",
        "one",
        "might",
        "suggest",
        "juliet",
        "kisser",
        "romeo",
        "paraphrase",
        "kisser",
        "romeo",
        "differs",
        "way",
        "matter",
        "inference",
        "general",
        "term",
        "like",
        "politician",
        "juliet",
        "anyone",
        "kisser",
        "romeo",
        "follows",
        "someone",
        "kissed",
        "whereas",
        "juliet",
        "politician",
        "corresponding",
        "logical",
        "consequence",
        "effect",
        "someone",
        "__ed",
        "put",
        "another",
        "way",
        "proposition",
        "juliet",
        "kissed",
        "someone",
        "exhibit",
        "interesting",
        "logical",
        "structure",
        "even",
        "express",
        "proposition",
        "via",
        "sentence",
        "juliet",
        "kisser",
        "someone",
        "quantifier",
        "part",
        "complex",
        "predicate",
        "classical",
        "logic",
        "capture",
        "validity",
        "inference",
        "involving",
        "predicate",
        "quantificational",
        "constituent",
        "consider",
        "patient",
        "respect",
        "every",
        "doctor",
        "doctor",
        "liar",
        "patient",
        "respect",
        "liar",
        "respect",
        "every",
        "doctor",
        "respect",
        "liar",
        "indicate",
        "nonrelational",
        "propositionparts",
        "much",
        "like",
        "sick",
        "happy",
        "inference",
        "following",
        "form",
        "p",
        "l",
        "p",
        "h",
        "schema",
        "fails",
        "reflect",
        "quantificational",
        "structure",
        "within",
        "predicate",
        "valid",
        "instance",
        "include",
        "bad",
        "inference",
        "like",
        "following",
        "patient",
        "sick",
        "doctor",
        "liar",
        "patient",
        "happy",
        "dramatizes",
        "point",
        "respect",
        "every",
        "doctor",
        "respect",
        "liar",
        "areunlike",
        "sick",
        "tall",
        "logically",
        "related",
        "way",
        "matter",
        "given",
        "second",
        "premise",
        "one",
        "adopt",
        "view",
        "many",
        "proposition",
        "relational",
        "part",
        "introducing",
        "variable",
        "r",
        "intended",
        "range",
        "relation",
        "see",
        "entry",
        "medieval",
        "relation",
        "medieval",
        "term",
        "one",
        "also",
        "formulate",
        "following",
        "schema",
        "p",
        "r",
        "every",
        "l",
        "p",
        "r",
        "l",
        "problem",
        "remains",
        "quantifier",
        "appear",
        "complex",
        "predicate",
        "figure",
        "valid",
        "inference",
        "like",
        "every",
        "patient",
        "respect",
        "every",
        "doctor",
        "sick",
        "patient",
        "saw",
        "every",
        "lawyer",
        "respect",
        "every",
        "doctor",
        "patient",
        "saw",
        "every",
        "lawyer",
        "sick",
        "patient",
        "respect",
        "every",
        "doctor",
        "patient",
        "saw",
        "every",
        "lawyer",
        "nonrelational",
        "much",
        "like",
        "old",
        "patient",
        "young",
        "patient",
        "following",
        "form",
        "every",
        "r",
        "every",
        "s",
        "many",
        "inference",
        "form",
        "invalid",
        "example",
        "every",
        "otter",
        "sick",
        "yak",
        "respect",
        "every",
        "doctor",
        "yak",
        "sick",
        "one",
        "abstract",
        "valid",
        "schema",
        "cover",
        "letting",
        "parenthesis",
        "indicate",
        "relative",
        "clause",
        "restricts",
        "adjacent",
        "predicate",
        "every",
        "p",
        "r",
        "every",
        "p",
        "r",
        "every",
        "l",
        "r",
        "every",
        "p",
        "r",
        "every",
        "l",
        "s",
        "matter",
        "complex",
        "schema",
        "relevant",
        "predicate",
        "exhibit",
        "quantificational",
        "structure",
        "consider",
        "proposition",
        "every",
        "patient",
        "met",
        "doctor",
        "saw",
        "lawyer",
        "respect",
        "lawyer",
        "saw",
        "patient",
        "met",
        "every",
        "doctor",
        "moreover",
        "schema",
        "like",
        "one",
        "poor",
        "candidate",
        "basic",
        "inference",
        "pattern",
        "medieval",
        "logician",
        "knew",
        "proposition",
        "expressed",
        "relative",
        "clause",
        "also",
        "pose",
        "difficulty",
        "see",
        "entry",
        "medieval",
        "syllogism",
        "every",
        "doctor",
        "healthy",
        "follows",
        "every",
        "young",
        "doctor",
        "healthy",
        "expected",
        "since",
        "universally",
        "quantified",
        "subject",
        "license",
        "replacement",
        "doctor",
        "restrictive",
        "predicate",
        "young",
        "doctor",
        "consider",
        "patient",
        "saw",
        "every",
        "young",
        "doctor",
        "healthy",
        "patient",
        "saw",
        "every",
        "doctor",
        "healthy",
        "direction",
        "valid",
        "inference",
        "young",
        "doctor",
        "doctor",
        "inference",
        "governed",
        "default",
        "inference",
        "rule",
        "license",
        "replacement",
        "young",
        "doctor",
        "le",
        "restrictive",
        "predicate",
        "doctor",
        "one",
        "say",
        "default",
        "direction",
        "implication",
        "restrictive",
        "le",
        "restrictive",
        "predicate",
        "inverted",
        "twiceonce",
        "every",
        "one",
        "want",
        "systematic",
        "account",
        "propositional",
        "structure",
        "explains",
        "net",
        "effect",
        "see",
        "ludlow",
        "discussion",
        "sommers",
        "offer",
        "strategy",
        "recoding",
        "extending",
        "classical",
        "logic",
        "part",
        "exploiting",
        "idea",
        "suggested",
        "leibniz",
        "arguably",
        "pāṇini",
        "relational",
        "sentence",
        "like",
        "juliet",
        "loved",
        "romeo",
        "somehow",
        "combine",
        "activevoice",
        "sentence",
        "passivevoice",
        "sentence",
        "perhaps",
        "along",
        "line",
        "juliet",
        "loved",
        "thereby",
        "romeo",
        "loved",
        "cp",
        "section",
        "nine",
        "one",
        "way",
        "another",
        "quantifier",
        "need",
        "characterized",
        "way",
        "capture",
        "general",
        "logical",
        "roleand",
        "role",
        "potential",
        "subject",
        "aristotelian",
        "propositionsif",
        "impeccability",
        "revealed",
        "matter",
        "form",
        "quantifier",
        "simply",
        "device",
        "creating",
        "schema",
        "like",
        "every",
        "p",
        "general",
        "term",
        "like",
        "politician",
        "deceitful",
        "inserted",
        "instance",
        "p",
        "quantificational",
        "structure",
        "relational",
        "constituent"
    ]
}