{
    "main_text": "The Application of Inductive Probabilities to the Evaluation of Scientific Hypotheses || Posterior Probabilities and Prior Probabilities\n3.2 Posterior Probabilities and Prior Probabilities\n\nThe probabilistic logic of evidential support represents the net\nsupport of a hypothesis by the posterior probability of the\nhypothesis, \n\n\\(P_{\\alpha}[h_i \\pmid  b\\cdot c^{n}\\cdot e^{n}]\\).\n\nThe posterior probability represents the net support for the\nhypothesis that results from the evidence, \\(c^n \\cdot e^n\\), together\nwith whatever plausibility considerations are taken to be\nrelevant to the assessment of \\(h_i\\). Whereas the likelihoods are the\nmeans through which evidence contributes to the posterior probability\nof a hypothesis, all other relevant plausibility consideration are\nrepresented by a separate factor, called the prior probability of\nthe hypothesis: \\(P_{\\alpha}[h_i \\pmid b]\\). The prior\nprobability represents the weight of any important considerations\nnot captured by the evidential likelihoods. Any relevant\nconsiderations that go beyond the evidence itself may be explicitly\nstated within expression \\(b\\) (in addition to whatever auxiliary hypotheses\n\\(b\\) may contain in support of the likelihoods). Thus, the prior probability of \\(h_i\\)\nmay depend explicitly on the content of \\(b\\). It turns out that posterior\nprobabilities depend only on the values of evidential\nlikelihoods together with the values of prior probabilities.\n\nAs an illustration of the role of prior probabilities, consider the\nHIV test example described in the previous section. What the\nphysician and the patient want to know is the value of the posterior\nprobability, \\(P_{\\alpha}[h \\pmid b\\cdot c\\cdot e]\\), that the patient\nhas HIV, \\(h\\), given the evidence of the positive test, \\(c\\cdot\ne\\), and given the error rates of the test, described within \\(b\\).\nThe value of this posterior probability depends on the likelihood (due\nto the error rates) of this patient obtaining a true-positive result,\n\\(P[e \\pmid h\\cdot b\\cdot c] = .99\\), and of obtaining a\nfalse-positive result, \\(P[e \\pmid {\\nsim}h\\cdot b\\cdot c] = .05\\). In\naddition, the value of the of the posterior probability depends on how\nplausible it is that the patient has HIV prior to taking the test\nresults into account, \\(P_{\\alpha}[h \\pmid b]\\). In the context of\nmedical diagnosis, this prior probability is usually assessed on the\nbasis of the base rate for HIV in the patient’s risk\ngroup (i.e., whether the patient is an IV drug user, has unprotected sex with\nmultiple partners, etc.). On a rigorous approach to the logic, such\ninformation and its risk-relevance should be explicitly stated within the\nbackground information \\(b\\). To see the importance of this\ninformation, consider the following numerical results (which may be\ncalculated using the formula called Bayes’ Theorem, presented in\nthe next section). If the base rate for the patient’s risk group\nis relatively high, say \\(P_{\\alpha}[h \\pmid b] = .10\\), then the\npositive test result yields a posterior probability value for his\nhaving HIV of \\(P_{\\alpha}[h \\pmid b\\cdot c\\cdot e] = .69\\). However,\nif the patient is in a very low risk group, say \\(P_{\\alpha}[h \\pmid\nb] = .001\\), then a positive test result only raises the posterior\nprobability of his having an HIV infection to \\(P_{\\alpha}[h \\pmid\nb\\cdot c\\cdot e] = .02\\). This posterior probability is much higher\nthan the prior probability of .001, but should not worry the patient\ntoo much. This positive test result may well be due to the comparatively high\nfalse-positive rate for the test, rather than to the presence of HIV.\nThis sort of test, with a false-positive rate as large as .05, is\nbest used as a screening test; a positive result warrants conducting a\nsecond, more rigorous, less error-prone test.\n\nMore generally, in the evidential evaluation of scientific hypotheses and theories, prior\nprobabilities represent assessments of non-evidential plausibility weightings among hypotheses. However, because the strengths of such plausibility assessments may\nvary among members of a scientific community, critics often brand such assessments as merely subjective, and take their role in Bayesian inference to be highly problematic. Bayesian inductivists counter that plausibility\nassessments play an important, legitimate role in the sciences, especially\nwhen evidence cannot suffice to distinguish among some alternative hypotheses. And, they argue, the epithet “merely subjective” is unwarranted. Such plausibility assessments are\noften backed by extensive arguments that may draw on forceful\nconceptual considerations.\n\nScientists often bring plausibility arguments to bear\nin assessing competing views. Although such arguments are seldom\ndecisive, they may bring the scientific community into widely shared\nagreement, especially with regard to the implausibility of some\nlogically possible alternatives. This seems to be the primary\nepistemic role of thought experiments.\nConsider, for example, the kinds of plausibility arguments that have\nbeen brought to bear on the various interpretations of quantum theory\n(e.g., those related to the measurement problem). These arguments go\nto the heart of conceptual issues that were central to the original\ndevelopment of the theory. Many of these issues were first raised by\nthose scientists who made the greatest contributions to the development of quantum theory, in their attempts to get a conceptual hold on the theory and its implications.\n\nGiven any body of evidence, it is fairly easy to cook up\na host of logically possible alternative hypotheses that make the evidence as probable as desired. In particular, it is easy to cook up hypotheses that logically entail any given body evidence, providing likelihood values equal to 1 for all the available evidence. Although most of these cooked up hypotheses will be laughably implausible, evidential likelihoods cannot rule them out. But, the only factors other than likelihoods that figure into the values of posterior probabilities for hypotheses are the values of their prior probabilities; so only prior probability assessments provide a place for the Bayesian logic to bring important plausibility considerations to bear. Thus, the Bayesian logic can only give implausible hypotheses their due via prior probability assessments.\n\nIt turns out that the mathematical structure of Bayesian inference makes prior probabilities especially well-suited to represent plausibility assessments among competing hypotheses. For, in the fully fleshed out account of evidential support for hypotheses (spelled out below), it will turn out that only ratios of prior probabilities for competing hypotheses, \\(P_{\\alpha}[h_j \\pmid b] / P_{\\alpha}[h_i \\pmid b]\\), together with ratios of likelihoods, \\(P_{\\alpha}[e \\pmid  h_j\\cdot b\\cdot c] / P_{\\alpha}[e \\pmid  h_2\\cdot b\\cdot c]\\), play essential roles. The ratio of prior probabilities is well-suited to represent how much more (or less) plausible hypothesis \\(h_j\\) is than competing hypothesis \\(h_i\\). Furthermore, the plausibility arguments on which such this comparative assessment is based may be explicitly stated within \\(b\\). So, given that an inductive logic needs to incorporate well-considered plausibility assessments (e.g. in order to lay low wildly implausible alternative hypotheses), the comparative assessment of Bayesian prior probabilities seems well-suited to do the job.\n\nThus, although prior probabilities may be subjective in the sense that\nagents may disagree on the relative strengths of plausibility\narguments, the priors used in scientific contexts need not\nrepresent mere subjective whims. Rather, the comparative strengths of the priors for hypotheses should be supported by arguments about\nhow much more plausible one hypothesis is than another. The important\nrole of plausibility assessments is captured by such received bits of\nscientific wisdom as the well-known scientific aphorism, extraordinary claims require\nextraordinary evidence. That is, it takes especially strong\nevidence, in the form of extremely high values for (ratios of)\nlikelihoods, to overcome the extremely low pre-evidential plausibility values\npossessed by some hypotheses. In the next section we’ll see precisely how this idea works, and we’ll return to it again in\n Section 3.4.\n\nWhen sufficiently strong evidence becomes available, it turns out that the contributions of prior plausibility assessments to the values of posterior probabilities may be substantially “washed\nout”, overridden by the evidence. That is, provided the prior probability of a true hypothesis isn’t assessed to be too\nclose to zero, the influence of the values of\nthe prior probabilities will very probably fade away as evidence accumulates. In Section 4 we’ll see precisely how this kind of Bayesian convergence to the true hypothesis works.\nThus, it turns out that prior plausibility assessments play their most important role\nwhen the distinguishing evidence represented by the likelihoods remains weak.\n\nOne more point before moving on to the logic of Bayes’ Theorem. Some Bayesian logicists have maintained that posterior\nprobabilities of hypotheses should be determined by syntactic logical\nform alone. The idea is that the likelihoods might reasonably be\nspecified in terms of syntactic logical form; so if syntactic form\nmight be made to determine the values of prior probabilities as well,\nthen inductive logic would be fully “formal” in the same\nway that deductive logic is “formal”. Keynes and Carnap\ntried to implement this idea through syntactic versions of the\nprinciple of indifference—the idea that syntactically similar\nhypotheses should be assigned the same prior probability values.\nCarnap showed how to carry out this project in detail, but only for\nextremely simple formal languages. Most logicians now take the project\nto have failed because of a fatal flaw with the whole idea that\nreasonable prior probabilities can be made to depend on logical form\nalone. Semantic content should matter. Goodmanian grue-predicates\nprovide one way to illustrate this\n point.[8]\n Furthermore, as suggested earlier, for this idea to apply to the\nevidential support of real scientific theories, scientists would have\nto assess the prior probabilities of each alternative theory based\nonly on its syntactic structure. That seems an unreasonable way to\nproceed. Are we to evaluate the prior probabilities of alternative\ntheories of gravitation, or for alternative quantum theories, by\nexploring only their syntactic structures, with absolutely no regard\nfor their content—with no regard for what they\nsay about the world? This seems an extremely dubious approach\nto the evaluation of real scientific theories. Logical structure alone\ncannot, and should not suffice for determining reasonable prior\nprobability values for real scientific theories. Moreover, real\nscientific hypotheses and theories are inevitably subject to\nplausibility considerations based on what they say about the\nworld. Prior probabilities are well-suited to represent the comparative weight of plausibility considerations for alternative hypotheses. But no reasonable assessment of comparative plausibility can derive solely from the logical form of hypotheses.\n\nWe will return to a discussion of prior probabilities a bit later. Let’s now see how Bayesian logic combines likelihoods with prior probabilities\nto yield posterior probabilities for hypotheses.\n",
    "section_title": "3.2 Posterior Probabilities and Prior Probabilities",
    "entry_title": "Inductive Logic",
    "hierarchy_title": "Inductive Logic || The Application of Inductive Probabilities to the Evaluation of Scientific Hypotheses || Posterior Probabilities and Prior Probabilities",
    "tokenized_text": [
        "application",
        "inductive",
        "probability",
        "evaluation",
        "scientific",
        "hypothesis",
        "posterior",
        "probability",
        "prior",
        "probability",
        "posterior",
        "probability",
        "prior",
        "probability",
        "probabilistic",
        "logic",
        "evidential",
        "support",
        "represents",
        "net",
        "support",
        "hypothesis",
        "posterior",
        "probability",
        "hypothesis",
        "p_",
        "alpha",
        "h_i",
        "pmid",
        "bcdot",
        "c",
        "n",
        "cdot",
        "e",
        "n",
        "posterior",
        "probability",
        "represents",
        "net",
        "support",
        "hypothesis",
        "result",
        "evidence",
        "cn",
        "cdot",
        "en",
        "together",
        "whatever",
        "plausibility",
        "consideration",
        "taken",
        "relevant",
        "assessment",
        "h_i",
        "whereas",
        "likelihood",
        "mean",
        "evidence",
        "contributes",
        "posterior",
        "probability",
        "hypothesis",
        "relevant",
        "plausibility",
        "consideration",
        "represented",
        "separate",
        "factor",
        "called",
        "prior",
        "probability",
        "hypothesis",
        "p_",
        "alpha",
        "h_i",
        "pmid",
        "b",
        "prior",
        "probability",
        "represents",
        "weight",
        "important",
        "consideration",
        "captured",
        "evidential",
        "likelihood",
        "relevant",
        "consideration",
        "go",
        "beyond",
        "evidence",
        "may",
        "explicitly",
        "stated",
        "within",
        "expression",
        "b",
        "addition",
        "whatever",
        "auxiliary",
        "hypothesis",
        "b",
        "may",
        "contain",
        "support",
        "likelihood",
        "thus",
        "prior",
        "probability",
        "h_i",
        "may",
        "depend",
        "explicitly",
        "content",
        "b",
        "turn",
        "posterior",
        "probability",
        "depend",
        "value",
        "evidential",
        "likelihood",
        "together",
        "value",
        "prior",
        "probability",
        "illustration",
        "role",
        "prior",
        "probability",
        "consider",
        "hiv",
        "test",
        "example",
        "described",
        "previous",
        "section",
        "physician",
        "patient",
        "want",
        "know",
        "value",
        "posterior",
        "probability",
        "p_",
        "alpha",
        "h",
        "pmid",
        "bcdot",
        "ccdot",
        "e",
        "patient",
        "hiv",
        "h",
        "given",
        "evidence",
        "positive",
        "test",
        "ccdot",
        "e",
        "given",
        "error",
        "rate",
        "test",
        "described",
        "within",
        "b",
        "value",
        "posterior",
        "probability",
        "depends",
        "likelihood",
        "due",
        "error",
        "rate",
        "patient",
        "obtaining",
        "truepositive",
        "result",
        "p",
        "e",
        "pmid",
        "hcdot",
        "bcdot",
        "c",
        "obtaining",
        "falsepositive",
        "result",
        "p",
        "e",
        "pmid",
        "nsim",
        "hcdot",
        "bcdot",
        "c",
        "addition",
        "value",
        "posterior",
        "probability",
        "depends",
        "plausible",
        "patient",
        "hiv",
        "prior",
        "taking",
        "test",
        "result",
        "account",
        "p_",
        "alpha",
        "h",
        "pmid",
        "b",
        "context",
        "medical",
        "diagnosis",
        "prior",
        "probability",
        "usually",
        "assessed",
        "basis",
        "base",
        "rate",
        "hiv",
        "patient",
        "risk",
        "group",
        "ie",
        "whether",
        "patient",
        "iv",
        "drug",
        "user",
        "unprotected",
        "sex",
        "multiple",
        "partner",
        "etc",
        "rigorous",
        "approach",
        "logic",
        "information",
        "riskrelevance",
        "explicitly",
        "stated",
        "within",
        "background",
        "information",
        "b",
        "see",
        "importance",
        "information",
        "consider",
        "following",
        "numerical",
        "result",
        "may",
        "calculated",
        "using",
        "formula",
        "called",
        "bayes",
        "theorem",
        "presented",
        "next",
        "section",
        "base",
        "rate",
        "patient",
        "risk",
        "group",
        "relatively",
        "high",
        "say",
        "p_",
        "alpha",
        "h",
        "pmid",
        "b",
        "positive",
        "test",
        "result",
        "yield",
        "posterior",
        "probability",
        "value",
        "hiv",
        "p_",
        "alpha",
        "h",
        "pmid",
        "bcdot",
        "ccdot",
        "e",
        "however",
        "patient",
        "low",
        "risk",
        "group",
        "say",
        "p_",
        "alpha",
        "h",
        "pmid",
        "b",
        "positive",
        "test",
        "result",
        "raise",
        "posterior",
        "probability",
        "hiv",
        "infection",
        "p_",
        "alpha",
        "h",
        "pmid",
        "bcdot",
        "ccdot",
        "e",
        "posterior",
        "probability",
        "much",
        "higher",
        "prior",
        "probability",
        "worry",
        "patient",
        "much",
        "positive",
        "test",
        "result",
        "may",
        "well",
        "due",
        "comparatively",
        "high",
        "falsepositive",
        "rate",
        "test",
        "rather",
        "presence",
        "hiv",
        "sort",
        "test",
        "falsepositive",
        "rate",
        "large",
        "best",
        "used",
        "screening",
        "test",
        "positive",
        "result",
        "warrant",
        "conducting",
        "second",
        "rigorous",
        "le",
        "errorprone",
        "test",
        "generally",
        "evidential",
        "evaluation",
        "scientific",
        "hypothesis",
        "theory",
        "prior",
        "probability",
        "represent",
        "assessment",
        "nonevidential",
        "plausibility",
        "weighting",
        "among",
        "hypothesis",
        "however",
        "strength",
        "plausibility",
        "assessment",
        "may",
        "vary",
        "among",
        "member",
        "scientific",
        "community",
        "critic",
        "often",
        "brand",
        "assessment",
        "merely",
        "subjective",
        "take",
        "role",
        "bayesian",
        "inference",
        "highly",
        "problematic",
        "bayesian",
        "inductivists",
        "counter",
        "plausibility",
        "assessment",
        "play",
        "important",
        "legitimate",
        "role",
        "science",
        "especially",
        "evidence",
        "suffice",
        "distinguish",
        "among",
        "alternative",
        "hypothesis",
        "argue",
        "epithet",
        "merely",
        "subjective",
        "unwarranted",
        "plausibility",
        "assessment",
        "often",
        "backed",
        "extensive",
        "argument",
        "may",
        "draw",
        "forceful",
        "conceptual",
        "consideration",
        "scientist",
        "often",
        "bring",
        "plausibility",
        "argument",
        "bear",
        "assessing",
        "competing",
        "view",
        "although",
        "argument",
        "seldom",
        "decisive",
        "may",
        "bring",
        "scientific",
        "community",
        "widely",
        "shared",
        "agreement",
        "especially",
        "regard",
        "implausibility",
        "logically",
        "possible",
        "alternative",
        "seems",
        "primary",
        "epistemic",
        "role",
        "thought",
        "experiment",
        "consider",
        "example",
        "kind",
        "plausibility",
        "argument",
        "brought",
        "bear",
        "various",
        "interpretation",
        "quantum",
        "theory",
        "eg",
        "related",
        "measurement",
        "problem",
        "argument",
        "go",
        "heart",
        "conceptual",
        "issue",
        "central",
        "original",
        "development",
        "theory",
        "many",
        "issue",
        "first",
        "raised",
        "scientist",
        "made",
        "greatest",
        "contribution",
        "development",
        "quantum",
        "theory",
        "attempt",
        "get",
        "conceptual",
        "hold",
        "theory",
        "implication",
        "given",
        "body",
        "evidence",
        "fairly",
        "easy",
        "cook",
        "host",
        "logically",
        "possible",
        "alternative",
        "hypothesis",
        "make",
        "evidence",
        "probable",
        "desired",
        "particular",
        "easy",
        "cook",
        "hypothesis",
        "logically",
        "entail",
        "given",
        "body",
        "evidence",
        "providing",
        "likelihood",
        "value",
        "equal",
        "available",
        "evidence",
        "although",
        "cooked",
        "hypothesis",
        "laughably",
        "implausible",
        "evidential",
        "likelihood",
        "rule",
        "factor",
        "likelihood",
        "figure",
        "value",
        "posterior",
        "probability",
        "hypothesis",
        "value",
        "prior",
        "probability",
        "prior",
        "probability",
        "assessment",
        "provide",
        "place",
        "bayesian",
        "logic",
        "bring",
        "important",
        "plausibility",
        "consideration",
        "bear",
        "thus",
        "bayesian",
        "logic",
        "give",
        "implausible",
        "hypothesis",
        "due",
        "via",
        "prior",
        "probability",
        "assessment",
        "turn",
        "mathematical",
        "structure",
        "bayesian",
        "inference",
        "make",
        "prior",
        "probability",
        "especially",
        "wellsuited",
        "represent",
        "plausibility",
        "assessment",
        "among",
        "competing",
        "hypothesis",
        "fully",
        "fleshed",
        "account",
        "evidential",
        "support",
        "hypothesis",
        "spelled",
        "turn",
        "ratio",
        "prior",
        "probability",
        "competing",
        "hypothesis",
        "p_",
        "alpha",
        "h_j",
        "pmid",
        "b",
        "p_",
        "alpha",
        "h_i",
        "pmid",
        "b",
        "together",
        "ratio",
        "likelihood",
        "p_",
        "alpha",
        "e",
        "pmid",
        "h_jcdot",
        "bcdot",
        "c",
        "p_",
        "alpha",
        "e",
        "pmid",
        "h_cdot",
        "bcdot",
        "c",
        "play",
        "essential",
        "role",
        "ratio",
        "prior",
        "probability",
        "wellsuited",
        "represent",
        "much",
        "le",
        "plausible",
        "hypothesis",
        "h_j",
        "competing",
        "hypothesis",
        "h_i",
        "furthermore",
        "plausibility",
        "argument",
        "comparative",
        "assessment",
        "based",
        "may",
        "explicitly",
        "stated",
        "within",
        "b",
        "given",
        "inductive",
        "logic",
        "need",
        "incorporate",
        "wellconsidered",
        "plausibility",
        "assessment",
        "eg",
        "order",
        "lay",
        "low",
        "wildly",
        "implausible",
        "alternative",
        "hypothesis",
        "comparative",
        "assessment",
        "bayesian",
        "prior",
        "probability",
        "seems",
        "wellsuited",
        "job",
        "thus",
        "although",
        "prior",
        "probability",
        "may",
        "subjective",
        "sense",
        "agent",
        "may",
        "disagree",
        "relative",
        "strength",
        "plausibility",
        "argument",
        "prior",
        "used",
        "scientific",
        "context",
        "need",
        "represent",
        "mere",
        "subjective",
        "whim",
        "rather",
        "comparative",
        "strength",
        "prior",
        "hypothesis",
        "supported",
        "argument",
        "much",
        "plausible",
        "one",
        "hypothesis",
        "another",
        "important",
        "role",
        "plausibility",
        "assessment",
        "captured",
        "received",
        "bit",
        "scientific",
        "wisdom",
        "wellknown",
        "scientific",
        "aphorism",
        "extraordinary",
        "claim",
        "require",
        "extraordinary",
        "evidence",
        "take",
        "especially",
        "strong",
        "evidence",
        "form",
        "extremely",
        "high",
        "value",
        "ratio",
        "likelihood",
        "overcome",
        "extremely",
        "low",
        "preevidential",
        "plausibility",
        "value",
        "possessed",
        "hypothesis",
        "next",
        "section",
        "see",
        "precisely",
        "idea",
        "work",
        "return",
        "section",
        "sufficiently",
        "strong",
        "evidence",
        "becomes",
        "available",
        "turn",
        "contribution",
        "prior",
        "plausibility",
        "assessment",
        "value",
        "posterior",
        "probability",
        "may",
        "substantially",
        "washed",
        "overridden",
        "evidence",
        "provided",
        "prior",
        "probability",
        "true",
        "hypothesis",
        "assessed",
        "close",
        "zero",
        "influence",
        "value",
        "prior",
        "probability",
        "probably",
        "fade",
        "away",
        "evidence",
        "accumulates",
        "section",
        "see",
        "precisely",
        "kind",
        "bayesian",
        "convergence",
        "true",
        "hypothesis",
        "work",
        "thus",
        "turn",
        "prior",
        "plausibility",
        "assessment",
        "play",
        "important",
        "role",
        "distinguishing",
        "evidence",
        "represented",
        "likelihood",
        "remains",
        "weak",
        "one",
        "point",
        "moving",
        "logic",
        "bayes",
        "theorem",
        "bayesian",
        "logicists",
        "maintained",
        "posterior",
        "probability",
        "hypothesis",
        "determined",
        "syntactic",
        "logical",
        "form",
        "alone",
        "idea",
        "likelihood",
        "might",
        "reasonably",
        "specified",
        "term",
        "syntactic",
        "logical",
        "form",
        "syntactic",
        "form",
        "might",
        "made",
        "determine",
        "value",
        "prior",
        "probability",
        "well",
        "inductive",
        "logic",
        "would",
        "fully",
        "formal",
        "way",
        "deductive",
        "logic",
        "formal",
        "keynes",
        "carnap",
        "tried",
        "implement",
        "idea",
        "syntactic",
        "version",
        "principle",
        "indifferencethe",
        "idea",
        "syntactically",
        "similar",
        "hypothesis",
        "assigned",
        "prior",
        "probability",
        "value",
        "carnap",
        "showed",
        "carry",
        "project",
        "detail",
        "extremely",
        "simple",
        "formal",
        "language",
        "logician",
        "take",
        "project",
        "failed",
        "fatal",
        "flaw",
        "whole",
        "idea",
        "reasonable",
        "prior",
        "probability",
        "made",
        "depend",
        "logical",
        "form",
        "alone",
        "semantic",
        "content",
        "matter",
        "goodmanian",
        "gruepredicates",
        "provide",
        "one",
        "way",
        "illustrate",
        "point",
        "furthermore",
        "suggested",
        "earlier",
        "idea",
        "apply",
        "evidential",
        "support",
        "real",
        "scientific",
        "theory",
        "scientist",
        "would",
        "ass",
        "prior",
        "probability",
        "alternative",
        "theory",
        "based",
        "syntactic",
        "structure",
        "seems",
        "unreasonable",
        "way",
        "proceed",
        "evaluate",
        "prior",
        "probability",
        "alternative",
        "theory",
        "gravitation",
        "alternative",
        "quantum",
        "theory",
        "exploring",
        "syntactic",
        "structure",
        "absolutely",
        "regard",
        "contentwith",
        "regard",
        "say",
        "world",
        "seems",
        "extremely",
        "dubious",
        "approach",
        "evaluation",
        "real",
        "scientific",
        "theory",
        "logical",
        "structure",
        "alone",
        "suffice",
        "determining",
        "reasonable",
        "prior",
        "probability",
        "value",
        "real",
        "scientific",
        "theory",
        "moreover",
        "real",
        "scientific",
        "hypothesis",
        "theory",
        "inevitably",
        "subject",
        "plausibility",
        "consideration",
        "based",
        "say",
        "world",
        "prior",
        "probability",
        "wellsuited",
        "represent",
        "comparative",
        "weight",
        "plausibility",
        "consideration",
        "alternative",
        "hypothesis",
        "reasonable",
        "assessment",
        "comparative",
        "plausibility",
        "derive",
        "solely",
        "logical",
        "form",
        "hypothesis",
        "return",
        "discussion",
        "prior",
        "probability",
        "bit",
        "later",
        "let",
        "see",
        "bayesian",
        "logic",
        "combine",
        "likelihood",
        "prior",
        "probability",
        "yield",
        "posterior",
        "probability",
        "hypothesis"
    ]
}