{
    "main_text": "Second-order logic with Hume’s Principle\n3. Second-order logic with Hume’s Principle\n\nThe neo-Fregean revival began in earnest with\n Wright.[37]\n Wright (1983) sought to derive the Dedekind-Peano axioms for\nsuccessor arithmetic from what was called N\\(^=\\) and has since come\nto be known as Hume’s Principle (that is, Parsons’s\nprinciple (A) above): \n\\[\\# xFx = \\# xGx \\leftrightarrow \\exists R (R\n\\text{ maps the \\(F\\)s \\(1\\text{-}1\\) onto the \\(G\\)s}).\\]\n\n\nWright sketched a derivation of the Dedekind-Peano axioms from\nHume’s Principle. The deductions sketched would be carried out\nin standard second-order logic—‘standard’ in the\nsense that, in the presence of HP, all number-abstractive terms of the\nform \\(\\# x\\Phi(x)\\) can be proved to denote. Such a system is\nunfree with respect to its number-abstractive terms. This\npoint holds even if the second-order logic in question is a\nfree logic in the official sense of not being committed to the\ntheorem-scheme \\(\\exists !t\\) (i.e., \\(\\exists x\\, x = t\\)) for any\nwell-formed singular term \\(t\\). The proof of this point is short and\neasy, and is like the one given in\n §1.2.3.\n We shall given an informal version as follows.\n\n\nClearly, the identity relation is a one-one correspondence of the\n\\(\\Phi\\)s onto the \\(\\Phi\\)s. Therefore it is a theorem of\nsecond-order logic that \n\\[\\exists R(R \\text{ maps the \\(\\Phi\\)s \\(1\\text{-}1\\) onto the\n\\(\\Phi\\)s}).\\]\n\n\nThis is the right-hand side of that instance of HP whose left-hand\nside is \n\\[\\# x\\Phi(x) = \\# x\\Phi(x).\\]\n\n\nThe latter has now been established as a theorem-scheme of\nsecond-order logic with HP. Hence in this system we have the\ntheorem-scheme \n\\[\\exists !\\# x\\Phi(x).\\]\n\n\n\nThe overarching theme is that we can redeem Frege’s key\nphilosophical insights concerning (natural and real) numbers and our\nknowledge of them, despite Russell’s discovery of paradox in\nFrege’s own theory of classes. That paradox notwithstanding,\nnumbers are still logical objects, characterized by methods or\nprinciples of abstraction—which of course cannot be as ambitious\nas Frege’s Basic Law V. These principles afford a distinctive\nform of epistemic access to numbers. The usual mathematical axioms\ngoverning the two kinds of numbers are to be derived as results in\n(higher-order) logic—essentially following Frege’s\ndeductive plan. These derivations will exploit appropriate definitions\nof the primitive constants, functions, and predicates of the brand of\nnumber theory concerned. (For example: 0, 1; \\(s, +, \\times\\);\n\\(\\lt\\); \\(N(x)\\);  \\(\\mathbb{R}(x)\\).)  \n\nThe main difference is this: the neo-Fregean no longer accepts\nFrege’s definition of numbers as classes of equinumerous\nclasses. Instead, the numbers are vouchsafed as sui generis,\ncourtesy of newly chosen abstraction principles. The Wrightian\nneo-logicist (henceforth: the HP-er) opts for HP; the constructive\nlogicist opts, much more modestly, for rules permitting the\nintroduction of zero and of successors. Apart from this key\ndifference, however, the neo-Fregeans hew in other places quite\nclosely to Frege’s overall deductive strategy when deriving the\nDedekind-Peano postulates.\n\nNo supplementation by intuition or sensory experience will be needed\nin the derivations of these postulates. The trains of reasoning\ninvolved will depend only on our grasp of logical validities,\nsupplemented by appropriate definitions. Purported result (for the\nHP-er): because HP is analytic, logicism is vindicated; and\nthe mathematical knowledge derived in this way is revealed to be\nanalytic, not synthetic.\n\nFor reservations about this claimed result, however, see Boolos\n(1997). The main objection with which the HP-er needs to contend is\nthat Hume’s Principle is neither a logical nor an analytic\ntruth. It cannot be logical, so the objection would go, because it has\nsuch a huge ledger of ontological commitments: for every\nconcept, its alleged number. And it cannot be analytic, because the\ntwo sides of the biconditional have different ontological\ncommitments: the right-hand side has no commitments to numbers,\nwhile the left-hand side is brimming with such commitments. In order\nto defend against these objections, the HP-er needs to do two things.\nFirst—as any logicist needs to do—he needs to challenge\nthe dogma that no logical principle can carry any ontological\ncommitments. Secondly, he needs to provide an account of analyticity\naccording to which a biconditional can be analytic even when the\nexplicit ontological commitments of each side of the biconditional\ndiffer. (These commitments are to be judged by considering each side\nas a sentence in the restricted language whose vocabulary is just\nsufficient to allow the sentence in question to be formed.)\n\nThe HP-er advocates Hume’s Principle in its unrestricted form,\nand is thereby committed, as we have seen, to the existence of a\ndenotation for every term of the form \\(\\{x \\mid \\Phi(x)\\}\\). The\nHP-er is committed, not only to the number of all natural numbers, but\nalso to the number of all self-identical things—or, at least, so\nWright was in Wright (1983). This ‘universal number’ \\(\\#\nx(x = x\\)) is sometimes called ‘anti-zero’. In n. 5 on p.\n187 one reads\n\n\nIt is worth stressing that it is, of course, absolutely essential that\nthere be such a number as \\(Nx : x = x\\); for it is impossible to\nimagine what sort of ground there could be for admitting \\(Nx : x \\ne\nx\\) if that were in doubt.\n\n\nBoolos (1987), after raising qualms about the universal number,\nprovided an ingenious model (which had been anticipated informally by\nGeach (1975: 446–7)) to allay the misgiving about the\nconsistency of full second-order logic with HP (the system now known\nas FA, for ‘Frege Arithmetic’). Simply take the natural\nnumbers along with the distinct object \\(\\omega\\) as the elements of\nthe domain. The element \\(\\omega\\) serves as the denotation of any\nterm of the form \\(\\# x\\Phi(x)\\) where \\(\\Phi\\) is satisfied by\ninfinitely many elements. Note, however, that this consistency proof\nworks only when FA is taken on its\n own.[38]\n The Geach–Boolos model cannot be relied upon to secure the\nconsistency of FA in conjunction with other theories, such as\nset theory, that one might wish to extend with FA. Since, however,\ncounting finite extensions ought to be a universally applicable\nintellectual operation, regardless of subject matter, it will be the\nexception rather than the rule that FA is to be applied only to\nthe natural numbers (plus, perhaps, the unnatural factotum\n\\(\\omega)\\). Rather, FA should be applicable not only to concrete\nobjects, but also to abstract mathematical entities such as real\nnumbers and sets. Provided only that one has a criterion of identity\nfor the objects in question, one should be in a position to count any\nfinite collection of them.\n\nSubsequently, in Hale and Wright 2001 (p. 315), Wright expressed\nreservations over whether “\\(x = x\\)” counts as a sortal\npredicate eligible to be prefixed by “the number of \\(x\\) such\nthat”. Now Wright was inquiring after what “is wanted for\nthe exorcism of anti-zero” (p. 314, emphasis added).\nHis considered answer is that a term of the form \\(\\# xFx\\) will\ndenote a number only if the concept \\(F\\) is both sortal and not\nindefinitely\n extensible.[39]\n So Wright subsequently hoped to make actual what he had previously\nalleged to be impossible to imagine. The technical proposal must\ntherefore be that Hume’s Principle is to be restricted to\npredicates that (express concepts that) are both sortal and not\nindefinitely extensible. But this, of course, raises the question\nwhether there is an effective method for determining, of any given\npredicate \\(F\\), whether \\(F\\) (expresses a concept that) is both\nsortal and not indefinitely extensible. In the absence of any such\neffective method, the theory will not have been axiomatized.\n\nThis survey perforce confines itself, in the main, to (neo-)logicist\naccounts of the natural numbers. But it is worth raising one\nmore question about the extension of a neo-Fregean account in an\nattempt to cope with the real numbers. We shall call it the\ninclusion question. How is one to appreciate that the natural\nnumbers qua reals are (in the non-punning sense of\nnumerical identity) the natural numbers vouchsafed by logicism about\nthe\n naturals?[40]\n This question is not answered by the neo-Fregean abstractionist\naccount of the reals in Shapiro (2000). In that account, the various\nnew abstracta are abstracted from quite varying equivalence relations,\nand no attempt is made to leave it open as a possibility that the\nnatural number \\(n\\) is the integer \\(n\\), is the\nrational number \\(n\\), and is the real number \\(n\\).\n(Although on p. 339 Shapiro writes that he proposes “to avoid\nthe issue [of identity under inclusion] here”, his\nproposed treatment nevertheless answers the inclusion question\nnegatively.)\n\nOne issue that is not satisfactorily disposed of, is this: in what\nsense can Wright’s neo-Fregean logicist claim to be furnishing\nan epistemic foundation for, let us say, first-order Peano\narithmetic, if their axiomatic principle HP, along with the\nsecond-order logic employed (\\(=\\text{FA}\\)), puts the supposed\n‘foundation’ much higher in the hierarchy of\nconsistency-strengths than the weaker theory being\n‘founded’? (This is to raise once again the worry\nexpressed by Boolos (1997:\n 248–9).)[41]\n\nIt is an age-old tradition in foundational investigations to provide a\nfoundation that is not only obviously consistent, but obviously true,\nand from which all the results in the branch(es) of mathematics being\nfounded will follow logically. Moreover, this following logically is\nitself something that must be epistemically accessible—hence the\nimportance of checkable proof. A foundational effort can be directed\nat many different branches of mathematics simultaneously, or just at\nsome particular branch, such as arithmetic. In the former case, it is\nunderstandable if the foundational theory chosen (such as ZFC) has a\nhigher consistency strength in relation to any one branch of\nmathematics being founded. But if the effort is directed at just that\none branch (say, arithmetic), then the foundation provided should be\nof a consistency-strength that is as low as possible, in relation to\nthat branch.\n\nThe consistency-strength of FA is that of second-order arithmetic\n\\(Z_2\\) (i.e., real analysis), which is equal to that of\nZermelo–Fraenkel set theory without the Axiom of Power Sets. The\nconsistency-strength of first-order Peano arithmetic is much weaker,\nnamely that of Zermelo–Fraenkel set theory without the Axiom of\nPower Sets and without the Axiom of Infinity.\n\nBy adopting second-order logic along with Hume’s Principle in an\nunrestricted form, Wright incurred commitment (as a matter of\nanalyticity) not only to each natural number, seriatim, but\nalso to the cardinal number of any concept whatsoever. We\nknow now, however, that Gödel’s prescient\n‘completionary’ insight has long since been fully borne\nout. The insight in question was that the set-theorist’s key to\nproving stronger and stronger results in mathematics—and in\nparticular the consistency of each newly attained system—is to\npostulate the existence of ever-larger cardinal numbers. If all these\ncardinals were available across the board courtesy of Hume’s\nPrinciple applied to appropriately expressed concepts, then Wright\nwould be proposing a foundational theory of enormous strength. The\nonly reason why FA is not even more powerful than \\(Z_2\\) is that the\nformer system’s ontology is being generated solely by the\nabstractions. There is no other source of existential postulation, as\nthere would be if one were to add, say, set theory to the theoretical\nmix.\n\nUpon such addition further care would be needed when considering the\nnature of Wright’s transfinite cardinals begotten by\nHume’s Principle. As the investigations of Kit Fine (1998: 515;\n2002) have revealed, any attempt to combine such an abstractive\naccount of transfinite cardinals with set theory must resort to\ntreating the abstracted cardinals as Urelemente rather than\nas sets. Set theory cannot, by itself, provide a set-surrogate for\nevery transfinite cardinal that would be generated by Hume’s\nPrinciple.\n\nAnother and rather different line of criticism of the claim that HP is\nanalytic can be found in Mancosu (2016: Chapter 4). Ironically,\nMancosu advances what he calls a Good Company objection to\nHP. HP jostles for primacy with at least infinitely many ‘Good\nCompanion’ abstraction principles. They are good because, like\nHP, they permit the logical derivation of the Dedekind-Peano axioms.\nThey do so via their respective ‘number’-abstraction\noperators with predicates whose extensions are\n(Dedekind-)finite. They assign such extensions the right\nnatural numbers as their cardinal numbers. When that operator is\napplied to a predicate whose extension is\n(Dedekind-)infinite, however, these other principles give\nresults arbitrarily different from what one would expect from the more\nCantorian principle HP. HP and these Good Companions get matters right\non all finite extensions. But the Good Companions give rise to a\nconfusing variety of ‘number’-assignments to infinite\nextensions. The problem for the HP-er, as Mancosu sees it, is how to\nmaintain the case for the analyticity of HP in light of all this good\ncompany. We see here another manifestation of the epistemological\nworry that HP is of excessive consistency strength when the logicist\nproject is simply to furnish a deeper but analytic foundation for\nDedekind-Peano arithmetic. All that such a foundation requires is what\nHP and these competing Good Companion principles agree\nupon—namely, that predicates with\n(Dedekind-)finite extensions should get the right numbers\nassigned to them (i.e., the natural numbers). There is no need for the\nlogicist about Dedekind-Peano arithmetic to make pronouncements about\nany infinite numbers.\n\nMancosu’s Good Companions to HP arise only because he shares\nwith the HP-er a fundamental logical commitment: every\nsingular term of the language must denote. This means that the logic\nfurnishing the supposed logicist foundation for arithmetic is not a\nfree logic. Every singular term formed by applying the\nnumber-abstraction operator to a predicate is taken to stand for some\nobject. This refusal to adopt a free logic complicates matters unduly\nif ones sees as part of the logicist project the task of generating\nonly epistemically justifiable commitment to numbers as\nabstract existents. We want, as it were, to be able to recognize only\nthose numbers whose existential credentials are absolutely compelling.\nIn particular, the logicist should be able to deliver only\nthe natural numbers, when furnishing deeper logical derivations of the\nDedekind-Peano postulates.\n",
    "section_title": "3. Second-order logic with Hume’s Principle",
    "entry_title": "Logicism and Neologicism",
    "hierarchy_title": "Logicism and Neologicism || Second-order logic with Hume’s Principle",
    "tokenized_text": [
        "secondorder",
        "logic",
        "hume",
        "principle",
        "secondorder",
        "logic",
        "hume",
        "principle",
        "neofregean",
        "revival",
        "began",
        "earnest",
        "wright",
        "wright",
        "sought",
        "derive",
        "dedekindpeano",
        "axiom",
        "successor",
        "arithmetic",
        "called",
        "n",
        "since",
        "come",
        "known",
        "hume",
        "principle",
        "parson",
        "principle",
        "xfx",
        "xgx",
        "leftrightarrow",
        "exists",
        "r",
        "r",
        "text",
        "map",
        "f",
        "text",
        "onto",
        "g",
        "wright",
        "sketched",
        "derivation",
        "dedekindpeano",
        "axiom",
        "hume",
        "principle",
        "deduction",
        "sketched",
        "would",
        "carried",
        "standard",
        "secondorder",
        "logic",
        "standard",
        "sense",
        "presence",
        "hp",
        "numberabstractive",
        "term",
        "form",
        "xphi",
        "x",
        "proved",
        "denote",
        "system",
        "unfree",
        "respect",
        "numberabstractive",
        "term",
        "point",
        "hold",
        "even",
        "secondorder",
        "logic",
        "question",
        "free",
        "logic",
        "official",
        "sense",
        "committed",
        "theoremscheme",
        "exists",
        "t",
        "ie",
        "exists",
        "x",
        "x",
        "t",
        "wellformed",
        "singular",
        "term",
        "t",
        "proof",
        "point",
        "short",
        "easy",
        "like",
        "one",
        "given",
        "shall",
        "given",
        "informal",
        "version",
        "follows",
        "clearly",
        "identity",
        "relation",
        "oneone",
        "correspondence",
        "phi",
        "onto",
        "phi",
        "s",
        "therefore",
        "theorem",
        "secondorder",
        "logic",
        "exists",
        "r",
        "r",
        "text",
        "map",
        "phi",
        "text",
        "onto",
        "phi",
        "righthand",
        "side",
        "instance",
        "hp",
        "whose",
        "lefthand",
        "side",
        "xphi",
        "x",
        "xphi",
        "x",
        "latter",
        "established",
        "theoremscheme",
        "secondorder",
        "logic",
        "hp",
        "hence",
        "system",
        "theoremscheme",
        "exists",
        "xphi",
        "x",
        "overarching",
        "theme",
        "redeem",
        "frege",
        "key",
        "philosophical",
        "insight",
        "concerning",
        "natural",
        "real",
        "number",
        "knowledge",
        "despite",
        "russell",
        "discovery",
        "paradox",
        "frege",
        "theory",
        "class",
        "paradox",
        "notwithstanding",
        "number",
        "still",
        "logical",
        "object",
        "characterized",
        "method",
        "principle",
        "abstractionwhich",
        "course",
        "ambitious",
        "frege",
        "basic",
        "law",
        "v",
        "principle",
        "afford",
        "distinctive",
        "form",
        "epistemic",
        "access",
        "number",
        "usual",
        "mathematical",
        "axiom",
        "governing",
        "two",
        "kind",
        "number",
        "derived",
        "result",
        "higherorder",
        "logicessentially",
        "following",
        "frege",
        "deductive",
        "plan",
        "derivation",
        "exploit",
        "appropriate",
        "definition",
        "primitive",
        "constant",
        "function",
        "predicate",
        "brand",
        "number",
        "theory",
        "concerned",
        "example",
        "times",
        "lt",
        "n",
        "x",
        "mathbb",
        "r",
        "x",
        "main",
        "difference",
        "neofregean",
        "longer",
        "accepts",
        "frege",
        "definition",
        "number",
        "class",
        "equinumerous",
        "class",
        "instead",
        "number",
        "vouchsafed",
        "sui",
        "generis",
        "courtesy",
        "newly",
        "chosen",
        "abstraction",
        "principle",
        "wrightian",
        "neologicist",
        "henceforth",
        "hper",
        "opts",
        "hp",
        "constructive",
        "logicist",
        "opts",
        "much",
        "modestly",
        "rule",
        "permitting",
        "introduction",
        "zero",
        "successor",
        "apart",
        "key",
        "difference",
        "however",
        "neofregeans",
        "hew",
        "place",
        "quite",
        "closely",
        "frege",
        "overall",
        "deductive",
        "strategy",
        "deriving",
        "dedekindpeano",
        "postulate",
        "supplementation",
        "intuition",
        "sensory",
        "experience",
        "needed",
        "derivation",
        "postulate",
        "train",
        "reasoning",
        "involved",
        "depend",
        "grasp",
        "logical",
        "validity",
        "supplemented",
        "appropriate",
        "definition",
        "purported",
        "result",
        "hper",
        "hp",
        "analytic",
        "logicism",
        "vindicated",
        "mathematical",
        "knowledge",
        "derived",
        "way",
        "revealed",
        "analytic",
        "synthetic",
        "reservation",
        "claimed",
        "result",
        "however",
        "see",
        "boolos",
        "main",
        "objection",
        "hper",
        "need",
        "contend",
        "hume",
        "principle",
        "neither",
        "logical",
        "analytic",
        "truth",
        "logical",
        "objection",
        "would",
        "go",
        "huge",
        "ledger",
        "ontological",
        "commitment",
        "every",
        "concept",
        "alleged",
        "number",
        "analytic",
        "two",
        "side",
        "biconditional",
        "different",
        "ontological",
        "commitment",
        "righthand",
        "side",
        "commitment",
        "number",
        "lefthand",
        "side",
        "brimming",
        "commitment",
        "order",
        "defend",
        "objection",
        "hper",
        "need",
        "two",
        "thing",
        "firstas",
        "logicist",
        "need",
        "dohe",
        "need",
        "challenge",
        "dogma",
        "logical",
        "principle",
        "carry",
        "ontological",
        "commitment",
        "secondly",
        "need",
        "provide",
        "account",
        "analyticity",
        "according",
        "biconditional",
        "analytic",
        "even",
        "explicit",
        "ontological",
        "commitment",
        "side",
        "biconditional",
        "differ",
        "commitment",
        "judged",
        "considering",
        "side",
        "sentence",
        "restricted",
        "language",
        "whose",
        "vocabulary",
        "sufficient",
        "allow",
        "sentence",
        "question",
        "formed",
        "hper",
        "advocate",
        "hume",
        "principle",
        "unrestricted",
        "form",
        "thereby",
        "committed",
        "seen",
        "existence",
        "denotation",
        "every",
        "term",
        "form",
        "x",
        "mid",
        "phi",
        "x",
        "hper",
        "committed",
        "number",
        "natural",
        "number",
        "also",
        "number",
        "selfidentical",
        "thingsor",
        "least",
        "wright",
        "wright",
        "universal",
        "number",
        "x",
        "x",
        "x",
        "sometimes",
        "called",
        "antizero",
        "n",
        "p",
        "one",
        "read",
        "worth",
        "stressing",
        "course",
        "absolutely",
        "essential",
        "number",
        "nx",
        "x",
        "x",
        "impossible",
        "imagine",
        "sort",
        "ground",
        "could",
        "admitting",
        "nx",
        "x",
        "ne",
        "x",
        "doubt",
        "boolos",
        "raising",
        "qualm",
        "universal",
        "number",
        "provided",
        "ingenious",
        "model",
        "anticipated",
        "informally",
        "geach",
        "allay",
        "misgiving",
        "consistency",
        "full",
        "secondorder",
        "logic",
        "hp",
        "system",
        "known",
        "fa",
        "frege",
        "arithmetic",
        "simply",
        "take",
        "natural",
        "number",
        "along",
        "distinct",
        "object",
        "omega",
        "element",
        "domain",
        "element",
        "omega",
        "serf",
        "denotation",
        "term",
        "form",
        "xphi",
        "x",
        "phi",
        "satisfied",
        "infinitely",
        "many",
        "element",
        "note",
        "however",
        "consistency",
        "proof",
        "work",
        "fa",
        "taken",
        "geachboolos",
        "model",
        "relied",
        "upon",
        "secure",
        "consistency",
        "fa",
        "conjunction",
        "theory",
        "set",
        "theory",
        "one",
        "might",
        "wish",
        "extend",
        "fa",
        "since",
        "however",
        "counting",
        "finite",
        "extension",
        "ought",
        "universally",
        "applicable",
        "intellectual",
        "operation",
        "regardless",
        "subject",
        "matter",
        "exception",
        "rather",
        "rule",
        "fa",
        "applied",
        "natural",
        "number",
        "plus",
        "perhaps",
        "unnatural",
        "factotum",
        "omega",
        "rather",
        "fa",
        "applicable",
        "concrete",
        "object",
        "also",
        "abstract",
        "mathematical",
        "entity",
        "real",
        "number",
        "set",
        "provided",
        "one",
        "criterion",
        "identity",
        "object",
        "question",
        "one",
        "position",
        "count",
        "finite",
        "collection",
        "subsequently",
        "hale",
        "wright",
        "p",
        "wright",
        "expressed",
        "reservation",
        "whether",
        "x",
        "x",
        "count",
        "sortal",
        "predicate",
        "eligible",
        "prefixed",
        "number",
        "x",
        "wright",
        "inquiring",
        "wanted",
        "exorcism",
        "antizero",
        "p",
        "emphasis",
        "added",
        "considered",
        "answer",
        "term",
        "form",
        "xfx",
        "denote",
        "number",
        "concept",
        "f",
        "sortal",
        "indefinitely",
        "extensible",
        "wright",
        "subsequently",
        "hoped",
        "make",
        "actual",
        "previously",
        "alleged",
        "impossible",
        "imagine",
        "technical",
        "proposal",
        "must",
        "therefore",
        "hume",
        "principle",
        "restricted",
        "predicate",
        "express",
        "concept",
        "sortal",
        "indefinitely",
        "extensible",
        "course",
        "raise",
        "question",
        "whether",
        "effective",
        "method",
        "determining",
        "given",
        "predicate",
        "f",
        "whether",
        "f",
        "express",
        "concept",
        "sortal",
        "indefinitely",
        "extensible",
        "absence",
        "effective",
        "method",
        "theory",
        "axiomatized",
        "survey",
        "perforce",
        "confines",
        "main",
        "neo",
        "logicist",
        "account",
        "natural",
        "number",
        "worth",
        "raising",
        "one",
        "question",
        "extension",
        "neofregean",
        "account",
        "attempt",
        "cope",
        "real",
        "number",
        "shall",
        "call",
        "inclusion",
        "question",
        "one",
        "appreciate",
        "natural",
        "number",
        "qua",
        "real",
        "nonpunning",
        "sense",
        "numerical",
        "identity",
        "natural",
        "number",
        "vouchsafed",
        "logicism",
        "natural",
        "question",
        "answered",
        "neofregean",
        "abstractionist",
        "account",
        "real",
        "shapiro",
        "account",
        "various",
        "new",
        "abstracta",
        "abstracted",
        "quite",
        "varying",
        "equivalence",
        "relation",
        "attempt",
        "made",
        "leave",
        "open",
        "possibility",
        "natural",
        "number",
        "n",
        "integer",
        "n",
        "rational",
        "number",
        "n",
        "real",
        "number",
        "n",
        "although",
        "p",
        "shapiro",
        "writes",
        "proposes",
        "avoid",
        "issue",
        "identity",
        "inclusion",
        "proposed",
        "treatment",
        "nevertheless",
        "answer",
        "inclusion",
        "question",
        "negatively",
        "one",
        "issue",
        "satisfactorily",
        "disposed",
        "sense",
        "wright",
        "neofregean",
        "logicist",
        "claim",
        "furnishing",
        "epistemic",
        "foundation",
        "let",
        "u",
        "say",
        "firstorder",
        "peano",
        "arithmetic",
        "axiomatic",
        "principle",
        "hp",
        "along",
        "secondorder",
        "logic",
        "employed",
        "text",
        "fa",
        "put",
        "supposed",
        "foundation",
        "much",
        "higher",
        "hierarchy",
        "consistencystrengths",
        "weaker",
        "theory",
        "founded",
        "raise",
        "worry",
        "expressed",
        "boolos",
        "ageold",
        "tradition",
        "foundational",
        "investigation",
        "provide",
        "foundation",
        "obviously",
        "consistent",
        "obviously",
        "true",
        "result",
        "branch",
        "e",
        "mathematics",
        "founded",
        "follow",
        "logically",
        "moreover",
        "following",
        "logically",
        "something",
        "must",
        "epistemically",
        "accessiblehence",
        "importance",
        "checkable",
        "proof",
        "foundational",
        "effort",
        "directed",
        "many",
        "different",
        "branch",
        "mathematics",
        "simultaneously",
        "particular",
        "branch",
        "arithmetic",
        "former",
        "case",
        "understandable",
        "foundational",
        "theory",
        "chosen",
        "zfc",
        "higher",
        "consistency",
        "strength",
        "relation",
        "one",
        "branch",
        "mathematics",
        "founded",
        "effort",
        "directed",
        "one",
        "branch",
        "say",
        "arithmetic",
        "foundation",
        "provided",
        "consistencystrength",
        "low",
        "possible",
        "relation",
        "branch",
        "consistencystrength",
        "fa",
        "secondorder",
        "arithmetic",
        "z_",
        "ie",
        "real",
        "analysis",
        "equal",
        "zermelofraenkel",
        "set",
        "theory",
        "without",
        "axiom",
        "power",
        "set",
        "consistencystrength",
        "firstorder",
        "peano",
        "arithmetic",
        "much",
        "weaker",
        "namely",
        "zermelofraenkel",
        "set",
        "theory",
        "without",
        "axiom",
        "power",
        "set",
        "without",
        "axiom",
        "infinity",
        "adopting",
        "secondorder",
        "logic",
        "along",
        "hume",
        "principle",
        "unrestricted",
        "form",
        "wright",
        "incurred",
        "commitment",
        "matter",
        "analyticity",
        "natural",
        "number",
        "seriatim",
        "also",
        "cardinal",
        "number",
        "concept",
        "whatsoever",
        "know",
        "however",
        "gödel",
        "prescient",
        "completionary",
        "insight",
        "long",
        "since",
        "fully",
        "borne",
        "insight",
        "question",
        "settheorist",
        "key",
        "proving",
        "stronger",
        "stronger",
        "result",
        "mathematicsand",
        "particular",
        "consistency",
        "newly",
        "attained",
        "systemis",
        "postulate",
        "existence",
        "everlarger",
        "cardinal",
        "number",
        "cardinal",
        "available",
        "across",
        "board",
        "courtesy",
        "hume",
        "principle",
        "applied",
        "appropriately",
        "expressed",
        "concept",
        "wright",
        "would",
        "proposing",
        "foundational",
        "theory",
        "enormous",
        "strength",
        "reason",
        "fa",
        "even",
        "powerful",
        "z_",
        "former",
        "system",
        "ontology",
        "generated",
        "solely",
        "abstraction",
        "source",
        "existential",
        "postulation",
        "would",
        "one",
        "add",
        "say",
        "set",
        "theory",
        "theoretical",
        "mix",
        "upon",
        "addition",
        "care",
        "would",
        "needed",
        "considering",
        "nature",
        "wright",
        "transfinite",
        "cardinal",
        "begotten",
        "hume",
        "principle",
        "investigation",
        "kit",
        "fine",
        "revealed",
        "attempt",
        "combine",
        "abstractive",
        "account",
        "transfinite",
        "cardinal",
        "set",
        "theory",
        "must",
        "resort",
        "treating",
        "abstracted",
        "cardinal",
        "urelemente",
        "rather",
        "set",
        "set",
        "theory",
        "provide",
        "setsurrogate",
        "every",
        "transfinite",
        "cardinal",
        "would",
        "generated",
        "hume",
        "principle",
        "another",
        "rather",
        "different",
        "line",
        "criticism",
        "claim",
        "hp",
        "analytic",
        "found",
        "mancosu",
        "chapter",
        "ironically",
        "mancosu",
        "advance",
        "call",
        "good",
        "company",
        "objection",
        "hp",
        "hp",
        "jostle",
        "primacy",
        "least",
        "infinitely",
        "many",
        "good",
        "companion",
        "abstraction",
        "principle",
        "good",
        "like",
        "hp",
        "permit",
        "logical",
        "derivation",
        "dedekindpeano",
        "axiom",
        "via",
        "respective",
        "number",
        "abstraction",
        "operator",
        "predicate",
        "whose",
        "extension",
        "dedekind",
        "finite",
        "assign",
        "extension",
        "right",
        "natural",
        "number",
        "cardinal",
        "number",
        "operator",
        "applied",
        "predicate",
        "whose",
        "extension",
        "dedekind",
        "infinite",
        "however",
        "principle",
        "give",
        "result",
        "arbitrarily",
        "different",
        "one",
        "would",
        "expect",
        "cantorian",
        "principle",
        "hp",
        "hp",
        "good",
        "companion",
        "get",
        "matter",
        "right",
        "finite",
        "extension",
        "good",
        "companion",
        "give",
        "rise",
        "confusing",
        "variety",
        "number",
        "assignments",
        "infinite",
        "extension",
        "problem",
        "hper",
        "mancosu",
        "see",
        "maintain",
        "case",
        "analyticity",
        "hp",
        "light",
        "good",
        "company",
        "see",
        "another",
        "manifestation",
        "epistemological",
        "worry",
        "hp",
        "excessive",
        "consistency",
        "strength",
        "logicist",
        "project",
        "simply",
        "furnish",
        "deeper",
        "analytic",
        "foundation",
        "dedekindpeano",
        "arithmetic",
        "foundation",
        "requires",
        "hp",
        "competing",
        "good",
        "companion",
        "principle",
        "agree",
        "uponnamely",
        "predicate",
        "dedekind",
        "finite",
        "extension",
        "get",
        "right",
        "number",
        "assigned",
        "ie",
        "natural",
        "number",
        "need",
        "logicist",
        "dedekindpeano",
        "arithmetic",
        "make",
        "pronouncement",
        "infinite",
        "number",
        "mancosu",
        "good",
        "companion",
        "hp",
        "arise",
        "share",
        "hper",
        "fundamental",
        "logical",
        "commitment",
        "every",
        "singular",
        "term",
        "language",
        "must",
        "denote",
        "mean",
        "logic",
        "furnishing",
        "supposed",
        "logicist",
        "foundation",
        "arithmetic",
        "free",
        "logic",
        "every",
        "singular",
        "term",
        "formed",
        "applying",
        "numberabstraction",
        "operator",
        "predicate",
        "taken",
        "stand",
        "object",
        "refusal",
        "adopt",
        "free",
        "logic",
        "complicates",
        "matter",
        "unduly",
        "one",
        "see",
        "part",
        "logicist",
        "project",
        "task",
        "generating",
        "epistemically",
        "justifiable",
        "commitment",
        "number",
        "abstract",
        "existents",
        "want",
        "able",
        "recognize",
        "number",
        "whose",
        "existential",
        "credential",
        "absolutely",
        "compelling",
        "particular",
        "logicist",
        "able",
        "deliver",
        "natural",
        "number",
        "furnishing",
        "deeper",
        "logical",
        "derivation",
        "dedekindpeano",
        "postulate"
    ]
}