{
    "main_text": "Areas of overlap || Formal languages and ontological commitment. (L1) meets (O1) and (O4)\n4.1 Formal languages and ontological commitment. (L1) meets (O1) and (O4)\n\nSuppose we have a set of beliefs, and we wonder what the answer to the\nontological question ‘Are there numbers?’ is, assuming\n(O4) tells us this is the ontological question about numbers. One\nstrategy to see whether our beliefs already commit us to an answer of\nthis question is as follows: first, write out all those beliefs in a\npublic language, like English. This by itself might not seem to help\nmuch, since if it wasn’t clear what my beliefs commit me to, why\nwould it help to look at what acceptance of what these sentences say\ncommits me to? But now, secondly, write these sentences in what is\noften called ‘canonical notation’. Canonical notation can\nbe understood as a formal or semi-formal language that brings out the\ntrue underlying structure, or ‘logical form’ of a natural\nlanguage sentence. In particular, such a canonical notation will make\nexplicit which quantifiers do occur in these sentences, what their\nscope is, and the like. This is where formal languages come into the\npicture. After that, and thirdly, look at the variables that are bound\nby these\n quantifiers.[3]\n What values do they have to have in order for these sentences all to\nbe true? If the answer is that the variables have to have numbers as\ntheir values, then you are committed to numbers. If not then you\naren’t committed to numbers. The latter doesn’t mean that\nthere are no numbers, of course, just as you being committed to them\ndoesn’t mean that there are numbers. But if your beliefs are all\ntrue then there have to be numbers, if you are committed to numbers.\nOr so this strategy goes.\n\nAll this might seem a lot of extra work for little. What do we really\ngain from these ‘canonical notations’ in determining\nontological commitment? One attempt to answer this, which partly\nmotivates the above way of doing things, is based on the following\nconsideration: We might wonder why we should think that quantifiers\nare of great importance for making ontological commitments explicit.\nAfter all, if I accept the apparently trivial mathematical fact that\nthere is a number between 6 and 8, does this already commit me to an\nanswer to the ontological question whether there are numbers out\nthere, as part of reality? The above strategy tries to make explicit\nthat and why it in fact does commit me to such an answer. This is so\nsince natural language quantifiers are fully captured by their formal\nanalogues in canonical notation, and the latter make ontological\ncommitments obvious because of their semantics. Such formal\nquantifiers are given what is called an ‘objectual\nsemantics’. This is to say that a particular quantified\nstatement \\(\\lsquo \\exists x\\,Fx\\rsquo\\) is true just in case there\nis an object in the domain of quantification that, when assigned as\nthe value of the variable \\(\\lsquo x\\rsquo\\), satisfies the open formula\n\\(\\lsquo Fx\\rsquo\\). This makes obvious that the truth of a\nquantified statement is ontologically relevant, and in fact ideally\nsuited to make ontological commitment explicit, since we need entities\nto assign as the values of the variables. Thus (L1) is tied to (O1).\nThe philosopher most closely associated with this way of determining\nontological commitment, and with the meta-ontological view on which it\nis based, is Quine (in particular Quine 1948). See also van Inwagen\n1998 for a presentation sympathetic to Quine.\n\nThe above account of ontological commitment has been criticized from a\nvariety of different angles. One criticism focuses on the semantics\nthat is given for quantifiers in the formal language that is used as\nthe canonical notation of the natural language representations of the\ncontents of beliefs. The above, objectual semantics is not the only\none that can be given to quantifiers. One widely discussed alternative\nis the so-called ‘substitutional semantics’. According to\nit we do not assign entities as values of variables. Rather, a\nparticular quantified statement \\(\\lsquo \\exists x\\,Fx\\rsquo\\) is\ntrue just in case there is a term in the language that when\nsubstituted for \\(\\lsquo x\\rsquo\\) in \\(\\lsquo Fx\\rsquo\\) has a true\nsentence as its result. Thus, \\(\\lsquo \\exists x\\,Fx\\rsquo\\) is true\njust in case there is an instance \\(\\lsquo Ft\\rsquo\\) which is true,\nfor \\(\\lsquo t\\rsquo\\) a term in the language in question,\nsubstituted for all (free) occurrences of \\(\\lsquo x\\rsquo\\) in\n\\(\\lsquo Fx\\rsquo\\). The substitutional semantics for the quantifiers\nhas often been used to argue that there are ontologically innocent\nuses of quantifiers, and that what quantified statements we accept\ndoes not directly reveal ontological commitment. Gottlieb (1980)\nprovides more details on substitutional quantification, and an attempt\nto use it in the philosophy of mathematics. Earlier work was done by\nRuth Marcus, and is reprinted in Marcus 1993.\n\nAnother objection to the above account of determining ontological\ncommitment goes further and questions the use of a canonical notation,\nand of formal tools in general. It states that if the ontological\nquestion about numbers simply is the question ‘Are there\nnumbers?’ then all that matters for ontological commitment is\nwhether or not what we accept implies ‘There are numbers’.\nIn particular, it is irrelevant what the semantics for quantifiers in\na formal language is, in particular, whether it is objectual or\nsubstitutional. What ontological commitment comes down to can be\ndetermined at the level of ordinary English. Formal tools are of no,\nor at best limited, importance. Ontological commitment can thus\naccording to this line of thought be formulated simply as follows: you\nare committed to numbers if what you believe implies that there are\nnumbers. Notwithstanding the debate between the substitutional and\nobjectual semantics, we do not need any formal tools to spell out the\nsemantics of quantifiers. All that matters is that a certain\nquantified statement ‘There are \\(F\\)s’ is implied by what\nwe believe for us to be committed to \\(F\\)s. What does not matter is\nwhether the semantics of the quantifier in “There are\n\\(F\\)s” (assuming it contains a\n quantifier[4])\n is objectual or substitutional.\n\nHowever, even if one agrees that what matters for ontological\ncommitment is whether or not what one believes implies that there are\n\\(F\\)s, for a certain kind of thing \\(F\\), there might still be room\nfor formal tools. First of all, it isn’t clear what implies\nwhat. Whether or not a set of statements that express my beliefs imply\nthat there are entities of a certain kind might not be obvious, and\nmight even be controversial. Formal methods can be useful in\ndetermining what implies what. On the other hand, even though formal\nmethods can be useful in determining what implies what, it is not\nclear which formal tools are the right ones for modeling a natural\nsystem of representations. It might seem that to determine which are\nthe right formal tools we already need to know what the implicational\nrelations are between the natural representations that we attempt to\nmodel, at least in basic cases. This could mean that formal tools are\nonly of limited use for deciding controversial cases of\nimplication.\n\nBut then, again, it has been argued that often it is not at all clear\nwhich statements really involve quantifiers at a more fundamental\nlevel of analysis, or\n logical form.\n Russell (1905) famously argued that “the King of France”\nis a quantified expression, even though it appears to be a referring\nexpression on the face of it, a claim now accepted by many. And\nDavidson (1967) argued, that ‘action sentences’ like\n“Fred buttered the toast” involve quantification over\nevents in the logical form, though not on the surface, a claim that is\nmore controversial. One might argue in light of these debates that\nwhich sentences involve quantification over what can’t be\nfinally settled until we have a formal semantics of all of our natural\nlanguage, and that this formal semantics will give us the ultimate\nanswer to what we are quantifying over. But then again, how are we to\ntell that the formal semantics proposed is correct, if we don’t\nknow the inferential relations in our own language?\n\nOne further use that formal tools could have besides all the above is\nto make ambiguities and different ‘readings’ explicit, and\nto model their respective inferential behavior. For example, formal\ntools are especially useful to make scope ambiguities explicit, since\ndifferent scope readings of one and the same natural language sentence\ncan be represented with different formal sentences which themselves\nhave no scope ambiguities. This use of formal tools is not restricted\nto ontology, but applies to any debates where ambiguities can be a\nhindrance. It does help in ontology, though, if some of the relevant\nexpressions in ontological debates, like the quantifiers themselves,\nexhibit such different readings. Then formal tools will be most useful\nto make this explicit. Whether or not quantifiers indeed do have\ndifferent readings is a question that will not be solved with formal\ntools, but if they do then these tools will be most useful in\nspecifying what these readings are. For a proposal of this latter\nkind, see Hofweber 2016. One consequence of this is a meta-ontology\ndifferent from Quine’s, as we will discuss below.\n\nAll this discussion in this section assumed that ontological\ncommitment is connected to a conception of ontology that concerns what\nthere is. But this is not universally accepted, in particular\nrecently. Maybe ontology does not concern what there is, but what is\nfundamental, in some sense of the word. If so, then issues tied to\nquantifiers are not of the most central importance when it comes to\nontological commitment, although they would still play a role. The\nmain question would then be connected to fundamentality. And here,\ntoo, formal languages might play a role in determining what one is\ncommitted to being fundamental. We will more closely discuss the role\nof formal languages in conceptions of ontology as concerning the\nfundamental below, in section 4.5. \n",
    "section_title": "4.1 Formal languages and ontological commitment. (L1) meets (O1) and (O4)",
    "entry_title": "Logic and Ontology",
    "hierarchy_title": "Logic and Ontology || Areas of overlap || Formal languages and ontological commitment. (L1) meets (O1) and (O4)",
    "tokenized_text": [
        "area",
        "overlap",
        "formal",
        "language",
        "ontological",
        "commitment",
        "l",
        "meet",
        "o",
        "o",
        "formal",
        "language",
        "ontological",
        "commitment",
        "l",
        "meet",
        "o",
        "o",
        "suppose",
        "set",
        "belief",
        "wonder",
        "answer",
        "ontological",
        "question",
        "number",
        "assuming",
        "o",
        "tell",
        "u",
        "ontological",
        "question",
        "number",
        "one",
        "strategy",
        "see",
        "whether",
        "belief",
        "already",
        "commit",
        "u",
        "answer",
        "question",
        "follows",
        "first",
        "write",
        "belief",
        "public",
        "language",
        "like",
        "english",
        "might",
        "seem",
        "help",
        "much",
        "since",
        "clear",
        "belief",
        "commit",
        "would",
        "help",
        "look",
        "acceptance",
        "sentence",
        "say",
        "commits",
        "secondly",
        "write",
        "sentence",
        "often",
        "called",
        "canonical",
        "notation",
        "canonical",
        "notation",
        "understood",
        "formal",
        "semiformal",
        "language",
        "brings",
        "true",
        "underlying",
        "structure",
        "logical",
        "form",
        "natural",
        "language",
        "sentence",
        "particular",
        "canonical",
        "notation",
        "make",
        "explicit",
        "quantifier",
        "occur",
        "sentence",
        "scope",
        "like",
        "formal",
        "language",
        "come",
        "picture",
        "thirdly",
        "look",
        "variable",
        "bound",
        "quantifier",
        "value",
        "order",
        "sentence",
        "true",
        "answer",
        "variable",
        "number",
        "value",
        "committed",
        "number",
        "committed",
        "number",
        "latter",
        "mean",
        "number",
        "course",
        "committed",
        "mean",
        "number",
        "belief",
        "true",
        "number",
        "committed",
        "number",
        "strategy",
        "go",
        "might",
        "seem",
        "lot",
        "extra",
        "work",
        "little",
        "really",
        "gain",
        "canonical",
        "notation",
        "determining",
        "ontological",
        "commitment",
        "one",
        "attempt",
        "answer",
        "partly",
        "motivates",
        "way",
        "thing",
        "based",
        "following",
        "consideration",
        "might",
        "wonder",
        "think",
        "quantifier",
        "great",
        "importance",
        "making",
        "ontological",
        "commitment",
        "explicit",
        "accept",
        "apparently",
        "trivial",
        "mathematical",
        "fact",
        "number",
        "already",
        "commit",
        "answer",
        "ontological",
        "question",
        "whether",
        "number",
        "part",
        "reality",
        "strategy",
        "try",
        "make",
        "explicit",
        "fact",
        "commit",
        "answer",
        "since",
        "natural",
        "language",
        "quantifier",
        "fully",
        "captured",
        "formal",
        "analogue",
        "canonical",
        "notation",
        "latter",
        "make",
        "ontological",
        "commitment",
        "obvious",
        "semantics",
        "formal",
        "quantifier",
        "given",
        "called",
        "objectual",
        "semantics",
        "say",
        "particular",
        "quantified",
        "statement",
        "lsquo",
        "exists",
        "x",
        "fxrsquo",
        "true",
        "case",
        "object",
        "domain",
        "quantification",
        "assigned",
        "value",
        "variable",
        "lsquo",
        "xrsquo",
        "satisfies",
        "open",
        "formula",
        "lsquo",
        "fxrsquo",
        "make",
        "obvious",
        "truth",
        "quantified",
        "statement",
        "ontologically",
        "relevant",
        "fact",
        "ideally",
        "suited",
        "make",
        "ontological",
        "commitment",
        "explicit",
        "since",
        "need",
        "entity",
        "assign",
        "value",
        "variable",
        "thus",
        "l",
        "tied",
        "o",
        "philosopher",
        "closely",
        "associated",
        "way",
        "determining",
        "ontological",
        "commitment",
        "metaontological",
        "view",
        "based",
        "quine",
        "particular",
        "quine",
        "see",
        "also",
        "van",
        "inwagen",
        "presentation",
        "sympathetic",
        "quine",
        "account",
        "ontological",
        "commitment",
        "criticized",
        "variety",
        "different",
        "angle",
        "one",
        "criticism",
        "focus",
        "semantics",
        "given",
        "quantifier",
        "formal",
        "language",
        "used",
        "canonical",
        "notation",
        "natural",
        "language",
        "representation",
        "content",
        "belief",
        "objectual",
        "semantics",
        "one",
        "given",
        "quantifier",
        "one",
        "widely",
        "discussed",
        "alternative",
        "socalled",
        "substitutional",
        "semantics",
        "according",
        "assign",
        "entity",
        "value",
        "variable",
        "rather",
        "particular",
        "quantified",
        "statement",
        "lsquo",
        "exists",
        "x",
        "fxrsquo",
        "true",
        "case",
        "term",
        "language",
        "substituted",
        "lsquo",
        "xrsquo",
        "lsquo",
        "fxrsquo",
        "true",
        "sentence",
        "result",
        "thus",
        "lsquo",
        "exists",
        "x",
        "fxrsquo",
        "true",
        "case",
        "instance",
        "lsquo",
        "ftrsquo",
        "true",
        "lsquo",
        "trsquo",
        "term",
        "language",
        "question",
        "substituted",
        "free",
        "occurrence",
        "lsquo",
        "xrsquo",
        "lsquo",
        "fxrsquo",
        "substitutional",
        "semantics",
        "quantifier",
        "often",
        "used",
        "argue",
        "ontologically",
        "innocent",
        "us",
        "quantifier",
        "quantified",
        "statement",
        "accept",
        "directly",
        "reveal",
        "ontological",
        "commitment",
        "gottlieb",
        "provides",
        "detail",
        "substitutional",
        "quantification",
        "attempt",
        "use",
        "philosophy",
        "mathematics",
        "earlier",
        "work",
        "done",
        "ruth",
        "marcus",
        "reprinted",
        "marcus",
        "another",
        "objection",
        "account",
        "determining",
        "ontological",
        "commitment",
        "go",
        "question",
        "use",
        "canonical",
        "notation",
        "formal",
        "tool",
        "general",
        "state",
        "ontological",
        "question",
        "number",
        "simply",
        "question",
        "number",
        "matter",
        "ontological",
        "commitment",
        "whether",
        "accept",
        "implies",
        "number",
        "particular",
        "irrelevant",
        "semantics",
        "quantifier",
        "formal",
        "language",
        "particular",
        "whether",
        "objectual",
        "substitutional",
        "ontological",
        "commitment",
        "come",
        "determined",
        "level",
        "ordinary",
        "english",
        "formal",
        "tool",
        "best",
        "limited",
        "importance",
        "ontological",
        "commitment",
        "thus",
        "according",
        "line",
        "thought",
        "formulated",
        "simply",
        "follows",
        "committed",
        "number",
        "believe",
        "implies",
        "number",
        "notwithstanding",
        "debate",
        "substitutional",
        "objectual",
        "semantics",
        "need",
        "formal",
        "tool",
        "spell",
        "semantics",
        "quantifier",
        "matter",
        "certain",
        "quantified",
        "statement",
        "f",
        "implied",
        "believe",
        "u",
        "committed",
        "f",
        "s",
        "matter",
        "whether",
        "semantics",
        "quantifier",
        "f",
        "assuming",
        "contains",
        "quantifier",
        "objectual",
        "substitutional",
        "however",
        "even",
        "one",
        "agrees",
        "matter",
        "ontological",
        "commitment",
        "whether",
        "one",
        "belief",
        "implies",
        "f",
        "certain",
        "kind",
        "thing",
        "f",
        "might",
        "still",
        "room",
        "formal",
        "tool",
        "first",
        "clear",
        "implies",
        "whether",
        "set",
        "statement",
        "express",
        "belief",
        "imply",
        "entity",
        "certain",
        "kind",
        "might",
        "obvious",
        "might",
        "even",
        "controversial",
        "formal",
        "method",
        "useful",
        "determining",
        "implies",
        "hand",
        "even",
        "though",
        "formal",
        "method",
        "useful",
        "determining",
        "implies",
        "clear",
        "formal",
        "tool",
        "right",
        "one",
        "modeling",
        "natural",
        "system",
        "representation",
        "might",
        "seem",
        "determine",
        "right",
        "formal",
        "tool",
        "already",
        "need",
        "know",
        "implicational",
        "relation",
        "natural",
        "representation",
        "attempt",
        "model",
        "least",
        "basic",
        "case",
        "could",
        "mean",
        "formal",
        "tool",
        "limited",
        "use",
        "deciding",
        "controversial",
        "case",
        "implication",
        "argued",
        "often",
        "clear",
        "statement",
        "really",
        "involve",
        "quantifier",
        "fundamental",
        "level",
        "analysis",
        "logical",
        "form",
        "russell",
        "famously",
        "argued",
        "king",
        "france",
        "quantified",
        "expression",
        "even",
        "though",
        "appears",
        "referring",
        "expression",
        "face",
        "claim",
        "accepted",
        "many",
        "davidson",
        "argued",
        "action",
        "sentence",
        "like",
        "fred",
        "buttered",
        "toast",
        "involve",
        "quantification",
        "event",
        "logical",
        "form",
        "though",
        "surface",
        "claim",
        "controversial",
        "one",
        "might",
        "argue",
        "light",
        "debate",
        "sentence",
        "involve",
        "quantification",
        "finally",
        "settled",
        "formal",
        "semantics",
        "natural",
        "language",
        "formal",
        "semantics",
        "give",
        "u",
        "ultimate",
        "answer",
        "quantifying",
        "tell",
        "formal",
        "semantics",
        "proposed",
        "correct",
        "know",
        "inferential",
        "relation",
        "language",
        "one",
        "use",
        "formal",
        "tool",
        "could",
        "besides",
        "make",
        "ambiguity",
        "different",
        "reading",
        "explicit",
        "model",
        "respective",
        "inferential",
        "behavior",
        "example",
        "formal",
        "tool",
        "especially",
        "useful",
        "make",
        "scope",
        "ambiguity",
        "explicit",
        "since",
        "different",
        "scope",
        "reading",
        "one",
        "natural",
        "language",
        "sentence",
        "represented",
        "different",
        "formal",
        "sentence",
        "scope",
        "ambiguity",
        "use",
        "formal",
        "tool",
        "restricted",
        "ontology",
        "applies",
        "debate",
        "ambiguity",
        "hindrance",
        "help",
        "ontology",
        "though",
        "relevant",
        "expression",
        "ontological",
        "debate",
        "like",
        "quantifier",
        "exhibit",
        "different",
        "reading",
        "formal",
        "tool",
        "useful",
        "make",
        "explicit",
        "whether",
        "quantifier",
        "indeed",
        "different",
        "reading",
        "question",
        "solved",
        "formal",
        "tool",
        "tool",
        "useful",
        "specifying",
        "reading",
        "proposal",
        "latter",
        "kind",
        "see",
        "hofweber",
        "one",
        "consequence",
        "metaontology",
        "different",
        "quine",
        "discus",
        "discussion",
        "section",
        "assumed",
        "ontological",
        "commitment",
        "connected",
        "conception",
        "ontology",
        "concern",
        "universally",
        "accepted",
        "particular",
        "recently",
        "maybe",
        "ontology",
        "concern",
        "fundamental",
        "sense",
        "word",
        "issue",
        "tied",
        "quantifier",
        "central",
        "importance",
        "come",
        "ontological",
        "commitment",
        "although",
        "would",
        "still",
        "play",
        "role",
        "main",
        "question",
        "would",
        "connected",
        "fundamentality",
        "formal",
        "language",
        "might",
        "play",
        "role",
        "determining",
        "one",
        "committed",
        "fundamental",
        "closely",
        "discus",
        "role",
        "formal",
        "language",
        "conception",
        "ontology",
        "concerning",
        "fundamental",
        "section"
    ]
}