{
    "main_text": "Ontological Aspects of Russell’s Logical Atomism || Atomic Propositions, Logical Independence and Necessity\n4.3 Atomic Propositions, Logical Independence and Necessity\n\n \nAnother important issue often discussed in connection with logical\natomism worth discussing in greater detail is the supposition that\natomic propositions are logically independent of each other, or that\nthe truth or falsity of any one atomic proposition does not logically\nimply or necessitate the truth or falsity of any other atomic\nproposition. This supposition is often taken to be a central aspect of\nthe very notion of “logical atomism”, perhaps largely because it is\nfound explicitly in Wittgenstein’s Tractatus\nLogico-Philosophicus, almost certainly the most important account\nof a logical atomist philosophy found outside of Russell’s\nwork. Wittgenstein claimed:\n\n\n 4.211   It is a sign of a proposition’s being elementary\nthat there can be no elementary proposition contradicting\nit. (Wittgenstein 1922, 89)\n\n\n \n5.134   From an elementary proposition no other can be\ninferred.  (Wittgenstein 1922, 109)\n\n\n The lack of any logical relations between atomic propositions goes\nhand in hand with a similar view about atomic facts; each\natomic fact is metaphysically independent of every other, and any one\ncould obtain or fail to obtain regardless of the obtaining (or not) of\nany other.\nThis position also pairs well with a broader view on the nature of necessity: that all necessity reduces to features of logical form. There is nothing in the form of one atomic statement that would allow us to infer (or reject) another. Hence, if all necessary connections are a result of logical form, atomic facts must be independent. If what appears to be a simple subject-predicate statement is necessary, it must in fact have a more complicated form when analyzed, so that the necessity of the statement is explained by its form. Similar remarks might be suggested what appear to be simple necessary relational statements. Wittgenstein, at least, explicitly endorsed the position that all necessity is logical necessity (6.37). Some commentators also take the thesis that all necessity is logical necessity (Landini 2010, chap. 4; 2018), or the thesis that de re modality is to be rejected in favor of de dicto necessity (Cocchiarella 2007, chap. 3), to be key to Russell’s logical atomism as well.\n\nRussell’s precise positions on these matters is not as clear as one\nmight hope and nowhere does he treat them at any\nlength. The few pertinent remarks he does make are either somewhat\nambivalent or seem to work against interpreting him as holding strong\nversions of these theses.  For example, in 1914, in arguing that\natomic facts are typically known by direct empirical means rather than\nby inference, he wrote that “[p]erhaps one atomic fact may\nsometimes be capable of being inferred from another, though I do not\nbelieve this to be the case; but in any case it cannot be inferred\nfrom premises no one of which is an atomic fact” (OKEW,\n48). Here, Russell expressed doubt about the existence of any\nrelations of logical dependence between atomic propositions, but the\nfact that he left it as an open possibility makes it seem that he would\nnot consider it a defining feature of an atomic proposition that it\nmust be independent from all others, or a central tenet of logical\natomism generally that atomic facts are independent from one\nanother. In 1936 he even went so far as to mock Wittgenstein’s claims\nthat atomic facts are independent of one another, and that all\ndeductions must be formal, by claiming that “no one in fact holds\nthese views, and a philosophy which professes them cannot be wholly\nsincere” (LE, 319).\n\n \nNevertheless, there a number of aspects of Russell’s philosophical\npositions that lead to the conclusion that they cohere best with\nsome doctrine about the independence of atomic facts or\npropositions. Russell did often speak about the constituents\nof atomic facts as independently existing entities. He writes for\nexample that “each particular has its being independently of any other\nand does not depend upon anything else for the logical possibility of\nits existence” (PLA, 203). It is not altogether clear what\nRussell meant by speaking of particulars or entities as being\nlogically independent. In contemporary parlance, typically, “logical\nindependence” is used solely to speak of a relation between sentences,\npropositions, or perhaps facts or states of affairs. One possible\ninterpretation would be to take Russell as holding that any atomic\nfact involving a certain group of particulars is logically independent\nof an atomic fact involving a distinct group of particulars, even if\nthe two facts involve the same quality or relation (see, e.g., Bell\nand Demopoulos 1996, 118–19).  This weakened version of the\nindependence thesis even has certain attractions over the stronger\nprinciple endorsed by Wittgenstein. Most of the usual counterexamples\ngiven against the thesis that atomic facts or propositions are always\nindependent involve simple properties that are thought to be\nexclusive. Consider, for example, what has come to be called the\n“color exclusion problem”. The propositions “a is red” and\n“a is blue” do not seem to be independent from one another:\nfrom the truth of one the falsity of the other can seemingly be\ninferred. However, the weakened version of the independence principle,\non which only atomic facts involving different particulars\nare independent, does not entail that it is possible that “a\nis red” and “a is blue” may both be true.\n\n \nIt is likely that Russell’s contention that particulars are\nindependent from one another was connected in his mind with his views\non relations. In holding the view that relations among simple\nparticulars are external, Russell saw himself as denying the view that\nwhen a bears R to b, there is some part of\na’s “nature” as an entity that involves its relatedness to\nb. It might be thought that Russell’s doctrine of external\nrelations committed him at least to certain principles regarding the\nmodal status of atomic facts (if not the independence principle).\nAccording to certain ways of defining the phrase, what it\nmeans for a relation to be internal is that it is a\nrelation that its relata could not fail to have; an\nexternal relation is one its relata could possibly not\nhave. Russell then might be seen as committed to the view that atomic\nfacts (all of which involve particulars standing in relations, in the\nbroad sense above) are always contingent. While this does not directly\nbear on the question of their independence, it would nevertheless\ncommit Russell to certain tenets regarding the modal features of\natomic facts.\n\n \nHowever, Russell himself warned against interpreting his position on\nrelations this way, writing, “the doctrine that relations are\n‘external’ … is not correctly expressed by saying\nthat two terms which have a certain relation might not have had that\nrelation. Such a statement introduces the notion of possibility and\nthus raises irrelevant difficulties” (BReal,  87).\nComplicating matters here are Russell’s own rather idiosyncratic and\nskeptical views about modal notions. Russell was dissatisfied with the\nprevailing conceptions of necessity and possibility among philosophers\nof his day, and argued instead against necessity (or possibility) as a\nfundamental or irreducible concept (see NP passim).\n\n \nDespite Russell’s misgivings about modal notions, it is clear enough\nfrom Russell’s conception of logic that logical relations\nbetween propositions would always obtain in virtue of their form\n(IMP, 197–98; PLA, 237–39). Again, atomic propositions are\nof the simplest possible forms, and there is certainly nothing in\ntheir forms that would suggest any logical connection to, or\nincompatibility with, other atomic propositions.\n\n \nPerhaps the most illuminating remarks to be found in Russell’s work\nthat would lead one to expect complete logical independence among\natomic propositions involve the claims he made about how it is that\none recognizes a certain class of purported entities as “logical\nconstructions”, and the recommendations he gives about analyzing\npropositions involving them.  Russell writes:\n\n When some set of supposed entities has neat logical properties, it\nturns out, in a great many instances, that the supposed entities can\nbe replaced by purely logical constructions composed of entities which\nhave not such neat properties. In that case, in interpreting a body of\npropositions hitherto believed to be about the supposed entities, we\ncan substitute the logical structures without altering any detail of\nthe body of propositions in question (LA, 326).\n\n Russell did not define here what he means by “neat logical\nproperties”, but it is possible to understand what he had in mind by\nway of the examples he gave. He cited as “neat properties” of material\nobjects that it is impossible for two material objects to occupy the\nsame place at the same time, and that it is impossible for one\nmaterial object to occupy distinct places in space at the same time\n(LA, 329; cf. AMi, 264–65; AMa,\n385). Consider then the propositions “O1 is\nlocated at p1 at t1”, and\n“O1 is located at p2 at\nt1” where “O1” is the name of\na physical object, “p1” and\n“p2” represent distinct locations in space, and\n“t1” the name of a certain instant in time.  Prior\nto analysis, such propositions appear to be logically incompatible\natomic propositions. However, Russell explains that the logical\nnecessities involved in cases such as these are due to the nature of\nmaterial objects, points and instants as logical constructions. At a\ncertain point in time, a physical object might be regarded as a class\nof sensible particulars bearing certain resemblance relations to one\nanother occupying a continuous region of space. It is\ntherefore impossible by definition for the same physical\nobject to occupy wholly distinct locations at the same time. When\nanalyzed, such propositions as “O1 is located at\np1 at t1” are revealed as\nhaving a much more complicated logical form, and hence may have\nlogical consequences not evident before analysis. We do not have here\nany reason to think that truly atomic propositions, those containing\nnames of genuine particulars and their relations, are not always\nindependent.\n\n \nRussell strongly intimated that it is a part of the very nature of\nlogical analysis that if our pre-analyzed understanding of a certain\nphenomenon involves the postulation of entities with certain\nstructural or modal properties, one should seek to replace talk of\nsuch entities with logical constructions specifically constituted so\nas to have these features by definition (PLA, 272–79;\nLA, 326–29). A logical construction would typically be\nunderstood as a sort of class; since discourse about classes was\nregarded by Russell as a convenience, which would be eliminated in a\nfully analyzed language in favor of speaking of their defining\nproperties and relations, by such a process Russell believed it is\npossible to replace commitment to entities having “neat logical\nproperties” with commitment to those that do not possess such\nfeatures. Russell’s work on mathematics provides us with what he would have taken as many examples of this phenomenon. If we take \"3 > 2” and \"3 < 2” at face-value as expressing simple dyadic relations between simple entities named “2” and “3”, then these appear to be two atomic propositions, one necessary, one impossible, which are not independent of each other. But after analysis, “2” and “3” are revealed not to be names at all, and the necessity, impossibility, and mutual incompatibility of these statements is rendered purely logical.\nAssuming that there is a final terminus of analysis in\nabsolutely simple entities and fully atomic facts, one might suppose\nthat here  the logical necessities and relationships between them\nwould have completely disappeared.\nRussell later summarized the\nattitude of his logical atomist period by writing that “it seemed to result that none of the raw material of the world has smooth logical\nproperties, but that whatever appears to have such properties is\nconstructed artificially in order to have them” (IPOM,\nxi). While this is not exactly an endorsement of the claim that atomic\nfacts are logically independent of one another, it is perhaps the\nclosest sentiment one can find in his philosophy. It is again perhaps better understood as an endorsement of a methodological maxim. If a certain stage of analysis seems to portray entities as having “neat” logical properties, i.e., necessary features or relations not explained by logical form, this is a sign that more analysis is needed. Perhaps by analyzing the statements further, “busting open” the apparent terms for these things to reveal more complicated logical forms, what appear to be necessary connections between atomic facts will be shown actually to be logically necessary relationships between non-atomic facts owed to their logical forms (cf. Elkind forthcoming).\n",
    "section_title": "4.3 Atomic Propositions, Logical Independence and Necessity",
    "entry_title": "Russell’s Logical Atomism",
    "hierarchy_title": "Russell’s Logical Atomism || Ontological Aspects of Russell’s Logical Atomism || Atomic Propositions, Logical Independence and Necessity",
    "tokenized_text": [
        "ontological",
        "aspect",
        "russell",
        "logical",
        "atomism",
        "atomic",
        "proposition",
        "logical",
        "independence",
        "necessity",
        "atomic",
        "proposition",
        "logical",
        "independence",
        "necessity",
        "another",
        "important",
        "issue",
        "often",
        "discussed",
        "connection",
        "logical",
        "atomism",
        "worth",
        "discussing",
        "greater",
        "detail",
        "supposition",
        "atomic",
        "proposition",
        "logically",
        "independent",
        "truth",
        "falsity",
        "one",
        "atomic",
        "proposition",
        "logically",
        "imply",
        "necessitate",
        "truth",
        "falsity",
        "atomic",
        "proposition",
        "supposition",
        "often",
        "taken",
        "central",
        "aspect",
        "notion",
        "logical",
        "atomism",
        "perhaps",
        "largely",
        "found",
        "explicitly",
        "wittgenstein",
        "tractatus",
        "logicophilosophicus",
        "almost",
        "certainly",
        "important",
        "account",
        "logical",
        "atomist",
        "philosophy",
        "found",
        "outside",
        "russell",
        "work",
        "wittgenstein",
        "claimed",
        "sign",
        "proposition",
        "elementary",
        "elementary",
        "proposition",
        "contradicting",
        "wittgenstein",
        "elementary",
        "proposition",
        "inferred",
        "wittgenstein",
        "lack",
        "logical",
        "relation",
        "atomic",
        "proposition",
        "go",
        "hand",
        "hand",
        "similar",
        "view",
        "atomic",
        "fact",
        "atomic",
        "fact",
        "metaphysically",
        "independent",
        "every",
        "one",
        "could",
        "obtain",
        "fail",
        "obtain",
        "regardless",
        "obtaining",
        "position",
        "also",
        "pair",
        "well",
        "broader",
        "view",
        "nature",
        "necessity",
        "necessity",
        "reduces",
        "feature",
        "logical",
        "form",
        "nothing",
        "form",
        "one",
        "atomic",
        "statement",
        "would",
        "allow",
        "u",
        "infer",
        "reject",
        "another",
        "hence",
        "necessary",
        "connection",
        "result",
        "logical",
        "form",
        "atomic",
        "fact",
        "must",
        "independent",
        "appears",
        "simple",
        "subjectpredicate",
        "statement",
        "necessary",
        "must",
        "fact",
        "complicated",
        "form",
        "analyzed",
        "necessity",
        "statement",
        "explained",
        "form",
        "similar",
        "remark",
        "might",
        "suggested",
        "appear",
        "simple",
        "necessary",
        "relational",
        "statement",
        "wittgenstein",
        "least",
        "explicitly",
        "endorsed",
        "position",
        "necessity",
        "logical",
        "necessity",
        "commentator",
        "also",
        "take",
        "thesis",
        "necessity",
        "logical",
        "necessity",
        "landini",
        "chap",
        "thesis",
        "de",
        "modality",
        "rejected",
        "favor",
        "de",
        "dicto",
        "necessity",
        "cocchiarella",
        "chap",
        "key",
        "russell",
        "logical",
        "atomism",
        "well",
        "russell",
        "precise",
        "position",
        "matter",
        "clear",
        "one",
        "might",
        "hope",
        "nowhere",
        "treat",
        "length",
        "pertinent",
        "remark",
        "make",
        "either",
        "somewhat",
        "ambivalent",
        "seem",
        "work",
        "interpreting",
        "holding",
        "strong",
        "version",
        "thesis",
        "example",
        "arguing",
        "atomic",
        "fact",
        "typically",
        "known",
        "direct",
        "empirical",
        "mean",
        "rather",
        "inference",
        "wrote",
        "p",
        "erhaps",
        "one",
        "atomic",
        "fact",
        "may",
        "sometimes",
        "capable",
        "inferred",
        "another",
        "though",
        "believe",
        "case",
        "case",
        "inferred",
        "premise",
        "one",
        "atomic",
        "fact",
        "okew",
        "russell",
        "expressed",
        "doubt",
        "existence",
        "relation",
        "logical",
        "dependence",
        "atomic",
        "proposition",
        "fact",
        "left",
        "open",
        "possibility",
        "make",
        "seem",
        "would",
        "consider",
        "defining",
        "feature",
        "atomic",
        "proposition",
        "must",
        "independent",
        "others",
        "central",
        "tenet",
        "logical",
        "atomism",
        "generally",
        "atomic",
        "fact",
        "independent",
        "one",
        "another",
        "even",
        "went",
        "far",
        "mock",
        "wittgenstein",
        "claim",
        "atomic",
        "fact",
        "independent",
        "one",
        "another",
        "deduction",
        "must",
        "formal",
        "claiming",
        "one",
        "fact",
        "hold",
        "view",
        "philosophy",
        "professes",
        "wholly",
        "sincere",
        "le",
        "nevertheless",
        "number",
        "aspect",
        "russell",
        "philosophical",
        "position",
        "lead",
        "conclusion",
        "cohere",
        "best",
        "doctrine",
        "independence",
        "atomic",
        "fact",
        "proposition",
        "russell",
        "often",
        "speak",
        "constituent",
        "atomic",
        "fact",
        "independently",
        "existing",
        "entity",
        "writes",
        "example",
        "particular",
        "independently",
        "depend",
        "upon",
        "anything",
        "else",
        "logical",
        "possibility",
        "existence",
        "pla",
        "altogether",
        "clear",
        "russell",
        "meant",
        "speaking",
        "particular",
        "entity",
        "logically",
        "independent",
        "contemporary",
        "parlance",
        "typically",
        "logical",
        "independence",
        "used",
        "solely",
        "speak",
        "relation",
        "sentence",
        "proposition",
        "perhaps",
        "fact",
        "state",
        "affair",
        "one",
        "possible",
        "interpretation",
        "would",
        "take",
        "russell",
        "holding",
        "atomic",
        "fact",
        "involving",
        "certain",
        "group",
        "particular",
        "logically",
        "independent",
        "atomic",
        "fact",
        "involving",
        "distinct",
        "group",
        "particular",
        "even",
        "two",
        "fact",
        "involve",
        "quality",
        "relation",
        "see",
        "eg",
        "bell",
        "demopoulos",
        "weakened",
        "version",
        "independence",
        "thesis",
        "even",
        "certain",
        "attraction",
        "stronger",
        "principle",
        "endorsed",
        "wittgenstein",
        "usual",
        "counterexample",
        "given",
        "thesis",
        "atomic",
        "fact",
        "proposition",
        "always",
        "independent",
        "involve",
        "simple",
        "property",
        "thought",
        "exclusive",
        "consider",
        "example",
        "come",
        "called",
        "color",
        "exclusion",
        "problem",
        "proposition",
        "red",
        "blue",
        "seem",
        "independent",
        "one",
        "another",
        "truth",
        "one",
        "falsity",
        "seemingly",
        "inferred",
        "however",
        "weakened",
        "version",
        "independence",
        "principle",
        "atomic",
        "fact",
        "involving",
        "different",
        "particular",
        "independent",
        "entail",
        "possible",
        "red",
        "blue",
        "may",
        "true",
        "likely",
        "russell",
        "contention",
        "particular",
        "independent",
        "one",
        "another",
        "connected",
        "mind",
        "view",
        "relation",
        "holding",
        "view",
        "relation",
        "among",
        "simple",
        "particular",
        "external",
        "russell",
        "saw",
        "denying",
        "view",
        "bear",
        "r",
        "b",
        "part",
        "nature",
        "entity",
        "involves",
        "relatedness",
        "b",
        "might",
        "thought",
        "russell",
        "doctrine",
        "external",
        "relation",
        "committed",
        "least",
        "certain",
        "principle",
        "regarding",
        "modal",
        "status",
        "atomic",
        "fact",
        "independence",
        "principle",
        "according",
        "certain",
        "way",
        "defining",
        "phrase",
        "mean",
        "relation",
        "internal",
        "relation",
        "relatum",
        "could",
        "fail",
        "external",
        "relation",
        "one",
        "relatum",
        "could",
        "possibly",
        "russell",
        "might",
        "seen",
        "committed",
        "view",
        "atomic",
        "fact",
        "involve",
        "particular",
        "standing",
        "relation",
        "broad",
        "sense",
        "always",
        "contingent",
        "directly",
        "bear",
        "question",
        "independence",
        "would",
        "nevertheless",
        "commit",
        "russell",
        "certain",
        "tenet",
        "regarding",
        "modal",
        "feature",
        "atomic",
        "fact",
        "however",
        "russell",
        "warned",
        "interpreting",
        "position",
        "relation",
        "way",
        "writing",
        "doctrine",
        "relation",
        "external",
        "correctly",
        "expressed",
        "saying",
        "two",
        "term",
        "certain",
        "relation",
        "might",
        "relation",
        "statement",
        "introduces",
        "notion",
        "possibility",
        "thus",
        "raise",
        "irrelevant",
        "difficulty",
        "breal",
        "complicating",
        "matter",
        "russell",
        "rather",
        "idiosyncratic",
        "skeptical",
        "view",
        "modal",
        "notion",
        "russell",
        "dissatisfied",
        "prevailing",
        "conception",
        "necessity",
        "possibility",
        "among",
        "philosopher",
        "day",
        "argued",
        "instead",
        "necessity",
        "possibility",
        "fundamental",
        "irreducible",
        "concept",
        "see",
        "np",
        "passim",
        "despite",
        "russell",
        "misgiving",
        "modal",
        "notion",
        "clear",
        "enough",
        "russell",
        "conception",
        "logic",
        "logical",
        "relation",
        "proposition",
        "would",
        "always",
        "obtain",
        "virtue",
        "form",
        "imp",
        "pla",
        "atomic",
        "proposition",
        "simplest",
        "possible",
        "form",
        "certainly",
        "nothing",
        "form",
        "would",
        "suggest",
        "logical",
        "connection",
        "incompatibility",
        "atomic",
        "proposition",
        "perhaps",
        "illuminating",
        "remark",
        "found",
        "russell",
        "work",
        "would",
        "lead",
        "one",
        "expect",
        "complete",
        "logical",
        "independence",
        "among",
        "atomic",
        "proposition",
        "involve",
        "claim",
        "made",
        "one",
        "recognizes",
        "certain",
        "class",
        "purported",
        "entity",
        "logical",
        "construction",
        "recommendation",
        "give",
        "analyzing",
        "proposition",
        "involving",
        "russell",
        "writes",
        "set",
        "supposed",
        "entity",
        "neat",
        "logical",
        "property",
        "turn",
        "great",
        "many",
        "instance",
        "supposed",
        "entity",
        "replaced",
        "purely",
        "logical",
        "construction",
        "composed",
        "entity",
        "neat",
        "property",
        "case",
        "interpreting",
        "body",
        "proposition",
        "hitherto",
        "believed",
        "supposed",
        "entity",
        "substitute",
        "logical",
        "structure",
        "without",
        "altering",
        "detail",
        "body",
        "proposition",
        "question",
        "la",
        "russell",
        "define",
        "mean",
        "neat",
        "logical",
        "property",
        "possible",
        "understand",
        "mind",
        "way",
        "example",
        "gave",
        "cited",
        "neat",
        "property",
        "material",
        "object",
        "impossible",
        "two",
        "material",
        "object",
        "occupy",
        "place",
        "time",
        "impossible",
        "one",
        "material",
        "object",
        "occupy",
        "distinct",
        "place",
        "space",
        "time",
        "la",
        "cf",
        "ami",
        "ama",
        "consider",
        "proposition",
        "o",
        "located",
        "p",
        "t",
        "o",
        "located",
        "p",
        "t",
        "o",
        "name",
        "physical",
        "object",
        "p",
        "p",
        "represent",
        "distinct",
        "location",
        "space",
        "t",
        "name",
        "certain",
        "instant",
        "time",
        "prior",
        "analysis",
        "proposition",
        "appear",
        "logically",
        "incompatible",
        "atomic",
        "proposition",
        "however",
        "russell",
        "explains",
        "logical",
        "necessity",
        "involved",
        "case",
        "due",
        "nature",
        "material",
        "object",
        "point",
        "instant",
        "logical",
        "construction",
        "certain",
        "point",
        "time",
        "physical",
        "object",
        "might",
        "regarded",
        "class",
        "sensible",
        "particular",
        "bearing",
        "certain",
        "resemblance",
        "relation",
        "one",
        "another",
        "occupying",
        "continuous",
        "region",
        "space",
        "therefore",
        "impossible",
        "definition",
        "physical",
        "object",
        "occupy",
        "wholly",
        "distinct",
        "location",
        "time",
        "analyzed",
        "proposition",
        "o",
        "located",
        "p",
        "t",
        "revealed",
        "much",
        "complicated",
        "logical",
        "form",
        "hence",
        "may",
        "logical",
        "consequence",
        "evident",
        "analysis",
        "reason",
        "think",
        "truly",
        "atomic",
        "proposition",
        "containing",
        "name",
        "genuine",
        "particular",
        "relation",
        "always",
        "independent",
        "russell",
        "strongly",
        "intimated",
        "part",
        "nature",
        "logical",
        "analysis",
        "preanalyzed",
        "understanding",
        "certain",
        "phenomenon",
        "involves",
        "postulation",
        "entity",
        "certain",
        "structural",
        "modal",
        "property",
        "one",
        "seek",
        "replace",
        "talk",
        "entity",
        "logical",
        "construction",
        "specifically",
        "constituted",
        "feature",
        "definition",
        "pla",
        "la",
        "logical",
        "construction",
        "would",
        "typically",
        "understood",
        "sort",
        "class",
        "since",
        "discourse",
        "class",
        "regarded",
        "russell",
        "convenience",
        "would",
        "eliminated",
        "fully",
        "analyzed",
        "language",
        "favor",
        "speaking",
        "defining",
        "property",
        "relation",
        "process",
        "russell",
        "believed",
        "possible",
        "replace",
        "commitment",
        "entity",
        "neat",
        "logical",
        "property",
        "commitment",
        "posse",
        "feature",
        "russell",
        "work",
        "mathematics",
        "provides",
        "u",
        "would",
        "taken",
        "many",
        "example",
        "phenomenon",
        "take",
        "facevalue",
        "expressing",
        "simple",
        "dyadic",
        "relation",
        "simple",
        "entity",
        "named",
        "appear",
        "two",
        "atomic",
        "proposition",
        "one",
        "necessary",
        "one",
        "impossible",
        "independent",
        "analysis",
        "revealed",
        "name",
        "necessity",
        "impossibility",
        "mutual",
        "incompatibility",
        "statement",
        "rendered",
        "purely",
        "logical",
        "assuming",
        "final",
        "terminus",
        "analysis",
        "absolutely",
        "simple",
        "entity",
        "fully",
        "atomic",
        "fact",
        "one",
        "might",
        "suppose",
        "logical",
        "necessity",
        "relationship",
        "would",
        "completely",
        "disappeared",
        "russell",
        "later",
        "summarized",
        "attitude",
        "logical",
        "atomist",
        "period",
        "writing",
        "seemed",
        "result",
        "none",
        "raw",
        "material",
        "world",
        "smooth",
        "logical",
        "property",
        "whatever",
        "appears",
        "property",
        "constructed",
        "artificially",
        "order",
        "ipom",
        "xi",
        "exactly",
        "endorsement",
        "claim",
        "atomic",
        "fact",
        "logically",
        "independent",
        "one",
        "another",
        "perhaps",
        "closest",
        "sentiment",
        "one",
        "find",
        "philosophy",
        "perhaps",
        "better",
        "understood",
        "endorsement",
        "methodological",
        "maxim",
        "certain",
        "stage",
        "analysis",
        "seems",
        "portray",
        "entity",
        "neat",
        "logical",
        "property",
        "ie",
        "necessary",
        "feature",
        "relation",
        "explained",
        "logical",
        "form",
        "sign",
        "analysis",
        "needed",
        "perhaps",
        "analyzing",
        "statement",
        "busting",
        "open",
        "apparent",
        "term",
        "thing",
        "reveal",
        "complicated",
        "logical",
        "form",
        "appear",
        "necessary",
        "connection",
        "atomic",
        "fact",
        "shown",
        "actually",
        "logically",
        "necessary",
        "relationship",
        "nonatomic",
        "fact",
        "owed",
        "logical",
        "form",
        "cf",
        "elkind",
        "forthcoming"
    ]
}