{
    "main_text": "Foundations of Mathematics\n13. Foundations of Mathematics\n\nMathematics can be based on set theory. This means that mathematical\nobjects are construed as sets and their properties are derived from\nthe axioms of set theory. The intuitive informal picture behind set\ntheory is that there is a cumulative hierarchy \\(V_\\alpha\\)\n(\\(\\alpha\\) an ordinal) of sets and the axioms are intended to\ndescribe the basic properties of such sets. This kind of set\ntheoretical foundation of mathematics has become widely accepted among\nworking mathematicians. We refer to the SEP entry on\n set theory\n for more details. Alternatives to set theory are at least\n category theory,\n constructive mathematics, and second-order logic.\n\nIf one tries to follow as a logician the language mathematicians use\nin their research, one cannot help seeing that they use second-order\nconcepts very freely. For example, the Induction Axiom is without\ndoubt used by mathematicians in the second-order form depicted in\n(\\ref{ind}). In their natural language mathematicians do not hesitate\nto use higher order concepts, and indeed do not always even (need to)\nknow the difference.\n\nSecond-order logic as a foundation for mathematics focuses on\nmathematical structures rather than mathematical\n“objects”, as set theory does. In principle every\nstructure has its own “foundation” based on the special\nfeatures of the structure. The role of second-order logic is to\nprovide a common framework for this. The intuitive informal picture\nbehind second-order logic on a structure is that there is a domain\nA of individuals and then separate domains for all n-ary\nrelations for all \\(n\\in\\oN\\) and for all n-ary functions for\nall \\(n\\in\\oN\\), associated with A. In comparison to the\ninformal picture of set theory, we have only the domains of subsets,\nrelations and functions, not iterations such as sets of sets, sets of\nsets of sets and so on, as in set theory. Therefore the intuitive\npicture behind second-order logic is simpler than the picture behind\nset theory. In particular, there is no transfinite iteration over all\nordinals. Most structures \\(\\ma\\) used in mathematics have a\nsecond-order characterization \\(\\theta_\\ma\\), see\n §10.\n Proving (second order) properties \\(\\phi\\) of such structures means\nderiving \\(\\phi\\) from \\(\\theta_\\ma\\). Opinions differ as to whether\nthis derivation should be a syntactic (formal) derivation using some\n(incomplete) axiom system of second-order logic or whether it should\nbe a semantic derivation (of the form “Every model of the\nassumptions is a model of the conclusion”). For a working\nmathematician there is not much difference and probably a semantic\nderivation is usually favored.\n\nSuppose a mathematician wants to convince someone about the truth of\nBolzano’s Theorem “If a continuous function on the reals\nhas negative values as well as positive values inside an interval,\nthen it has a root in that interval”. They would start with the\nordered field of real numbers. It would be (thought to be) clear what\nthis means because the second-order axiomatization of the field is\ncategorical. Then they would take an arbitrary continuous function\nf on this field such that it has values of opposite sign inside\na fixed interval \\((a,b)\\). It would be clear what this means because\nsecond-order logic has variables for functions. Let \\(c,d\\in (a,b)\\)\nsuch that \\(f(c)<0\\) and \\(f(d)>0\\). Without loss of generality,\n\\(c<d\\). Let \\(X=\\{e\\in(a,b) : f(e)<0\\}\\). Since we have\nrelation variables for subsets of the domain, we can think of X\nsimply as a value of such a relation variable. It is obvious that\nX exists, but a priori we could have imposed contradictory\nconditions on X (e.g., \\(X=\\{e : e\\notin X\\}\\)) and then we\nshould not be able to claim that it exists. However, in this case the\nComprehension Axiom Schema implies that X exists. Clearly,\n\\(X\\ne\\emptyset\\) and X is bounded from above by d. One\nof the second-order axioms characterizing the field of real numbers is\nthat every non-empty set which is bounded from above has a supremum.\nThus we can let z to be the supremum of X. Now it\nfollows from basic properties of continuous functions that\n\\(f(z)=0\\).\n\nIt would be difficult to tell in the above proof whether it was a\nsyntactical derivation from the axioms or a semantic argument. On the\nsurface it looks like a semantic argument. But every step can be\nderived from the axioms, so it could be considered a shorthand version\nof a syntactic derivation.\n\nSyntactic derivations in second-order logic based on the Comprehension\nAxiom Schema and Axioms of Choice are very much like syntactic\nderivations in set theory. In neither case would a working\nmathematicians write all the details of the argument but would resort\nto shorthand notation. In both cases—second-order logic and set\ntheory—we can interpret the proofs as shorthand versions of\nsyntactic formal proofs or as semantic proofs. First order logic\nsatisfies the Completeness Theorem with the help of which semantic\nproofs can be turned into syntactic formal proofs. Since the\nCompleteness Theorem uses the concept of a first order structure,\nsentences proved from the axioms are true in all models of the axioms,\nboth countable models and non-standard models. Are they true in the\nintuitive model of cumulative hierarchy of sets? By the Reflection\nTheorem such sentences are true in the class of all sets, but since\nthe intuitive model is informal, we cannot prove that the\nclass of all sets is the same as the intuitive model.\n\nOn the other hand, in order for the Completeness Theorem to be\napplicable, a semantic argument has to be such that it works whatever\nmodel of set theory we are using. This means that a semantic argument\nin set theory should not use properties of individual models of set\ntheory unless they are universal first order properties of all models\nof ZFC. In practice this means that if a property such as \\(CH\\),\n\\(\\Diamond\\), \\(2^{\\aleph_0}=\\aleph_2\\), and so on, is used, it is\nmentioned separately as an assumption. Non-first order properties of\nmodels cannot be used at all, or else the Completeness Theorem cannot\nbe used. Still, sometimes non-first order properties are\nused. For example, we may have an argument that every\ncountable model of ZFC satisfies \\(\\phi\\). But then, by the\nDownward Löwenheim-Skolem Theorem, every model of ZFC\nsatisfies \\(\\phi\\). Thus we have been able to eliminate the non-first\norder assumption of the countability of the model.\n\nSecond-order logic satisfies the Completeness Theorem if Henkin models\nare used. Thus semantic arguments in second-order logic can be turned\ninto syntactic formal proofs, but as with set theory the semantic\nargument has to be valid in all Henkin models, not only in\nall of the full Henkin models. Thus, as in set theory, the\nsemantic argument cannot use properties of the Henkin models that are\nnot shared by all Henkin models, In particular, fullness (see\n §9.1)\n cannot be assumed because in general models it is not a second-order\nproperty. What happens to categoricity when fullness is abandoned? We\nstill have internal categoricity, so we can use categoricity in proofs\nas long as we make sure we work inside one model. One certain way to\nmake sure of this is that we base everything on the axioms, the\nComprehension Axiom Schema and the Axioms of Choice.\n\nWhen second-order logic is used as a foundation for mathematics, a\nsituation may emerge in which third order logic is needed. For\nexample, a topology is usually defined as a family of sets\nand is therefore a third order object. It would be well in the spirit\nof second-order logic to simply include third (or higher) order logic\nwhen needed. Naturally, the Comprehension Axiom Schema and the Axioms\nof Choice have to be then assumed for third order quantifiers.\n\nWe have devoted a fair amount of space in this entry to the power of\nsecond-order logic to characterize structures (see\n §7.1).\n Putting it briefly, if a structure has mathematical interest, it is\nsecond-order characterizable. Structures constructed by means of the\nAxiom of Choice may escape being second-order characterizable. But\nwhat is the power of second-order logic to demonstrate the\nexistence of structures? The axioms, including the\nComprehension Axioms and the Axioms of Choice, can be satisfied in a\none element domain. So we cannot prove from the axioms that\nthere are any structures of any size \\(>1\\). This undermines\nQuine’s characterization of second-order logic as “set\ntheory in sheep’s clothing” (1970, section heading in\nchapter 5), meant probably to suggest that the ontological commitments\nof second-order logic are on the same level as those of set\ntheory.\n\nPerhaps the philosophy of second-order logic is that if a structure\ncan be characterized, it exists, echoing Hilbert’s formalist\nphilosophy. However, even in that sense we need to know that the\ncharacterizing sentence \\(\\theta_\\ma\\) is consistent. A trivial\napproach is to observe that \\(\\ma\\) itself certainly satisfies\n\\(\\theta_\\ma\\), but this clearly begs the question. Still, this is how\nHilbert argues for the consistency of his axioms for the real numbers\n(1900). If \\(\\ma=(\\oN,+,\\cdot)\\), an Axiom of Infinity saying that\nthat a proper subset of the domain has the same cardinality as the\nentire domain, is what is needed. In combination with the\nComprehension Axiom Schema the existence of \\(\\ma\\) follows. For\n\\((\\oR,+,\\cdot,0,1)\\) this is not enough, we need a stronger Axiom of\nInfinity, for example the existence of a dense order which satisfies\nthe Completeness Axiom: Every bounded non-empty set has a supremum. It\nseems inevitable that when we move from a structure to a bigger\nstructure we need to make a largeness assumption. Such assumptions are\ncalled Large Domain Assumptions in Väänänen (2012). In\nset theory this aspect is taken care of at the outset by assuming the\nPower Set Axiom and the Replacement Axioms which together make sure\nthat there are large enough sets. In second-order logic we have to\nassume new and new Large Domain Assumptions, as we move along. This\ncan be seen as a drawback, having to make new assumptions all the\ntime. On the other hand it can be seen as an asset, not having to make\ntoo ambitious assumptions before they are really needed.\n\n",
    "section_title": "13. Foundations of Mathematics",
    "entry_title": "Second-order and Higher-order Logic",
    "hierarchy_title": "Second-order and Higher-order Logic || Foundations of Mathematics",
    "tokenized_text": [
        "foundation",
        "mathematics",
        "foundation",
        "mathematics",
        "mathematics",
        "based",
        "set",
        "theory",
        "mean",
        "mathematical",
        "object",
        "construed",
        "set",
        "property",
        "derived",
        "axiom",
        "set",
        "theory",
        "intuitive",
        "informal",
        "picture",
        "behind",
        "set",
        "theory",
        "cumulative",
        "hierarchy",
        "v_alpha",
        "alpha",
        "ordinal",
        "set",
        "axiom",
        "intended",
        "describe",
        "basic",
        "property",
        "set",
        "kind",
        "set",
        "theoretical",
        "foundation",
        "mathematics",
        "become",
        "widely",
        "accepted",
        "among",
        "working",
        "mathematician",
        "refer",
        "sep",
        "entry",
        "set",
        "theory",
        "detail",
        "alternative",
        "set",
        "theory",
        "least",
        "category",
        "theory",
        "constructive",
        "mathematics",
        "secondorder",
        "logic",
        "one",
        "try",
        "follow",
        "logician",
        "language",
        "mathematician",
        "use",
        "research",
        "one",
        "help",
        "seeing",
        "use",
        "secondorder",
        "concept",
        "freely",
        "example",
        "induction",
        "axiom",
        "without",
        "doubt",
        "used",
        "mathematician",
        "secondorder",
        "form",
        "depicted",
        "ref",
        "ind",
        "natural",
        "language",
        "mathematician",
        "hesitate",
        "use",
        "higher",
        "order",
        "concept",
        "indeed",
        "always",
        "even",
        "need",
        "know",
        "difference",
        "secondorder",
        "logic",
        "foundation",
        "mathematics",
        "focus",
        "mathematical",
        "structure",
        "rather",
        "mathematical",
        "object",
        "set",
        "theory",
        "principle",
        "every",
        "structure",
        "foundation",
        "based",
        "special",
        "feature",
        "structure",
        "role",
        "secondorder",
        "logic",
        "provide",
        "common",
        "framework",
        "intuitive",
        "informal",
        "picture",
        "behind",
        "secondorder",
        "logic",
        "structure",
        "domain",
        "individual",
        "separate",
        "domain",
        "nary",
        "relation",
        "ninon",
        "nary",
        "function",
        "ninon",
        "associated",
        "a",
        "comparison",
        "informal",
        "picture",
        "set",
        "theory",
        "domain",
        "subset",
        "relation",
        "function",
        "iteration",
        "set",
        "set",
        "set",
        "set",
        "set",
        "set",
        "theory",
        "therefore",
        "intuitive",
        "picture",
        "behind",
        "secondorder",
        "logic",
        "simpler",
        "picture",
        "behind",
        "set",
        "theory",
        "particular",
        "transfinite",
        "iteration",
        "ordinal",
        "structure",
        "ma",
        "used",
        "mathematics",
        "secondorder",
        "characterization",
        "theta_ma",
        "see",
        "proving",
        "second",
        "order",
        "property",
        "phi",
        "structure",
        "mean",
        "deriving",
        "phi",
        "theta_ma",
        "opinion",
        "differ",
        "whether",
        "derivation",
        "syntactic",
        "formal",
        "derivation",
        "using",
        "incomplete",
        "axiom",
        "system",
        "secondorder",
        "logic",
        "whether",
        "semantic",
        "derivation",
        "form",
        "every",
        "model",
        "assumption",
        "model",
        "conclusion",
        "working",
        "mathematician",
        "much",
        "difference",
        "probably",
        "semantic",
        "derivation",
        "usually",
        "favored",
        "suppose",
        "mathematician",
        "want",
        "convince",
        "someone",
        "truth",
        "bolzano",
        "theorem",
        "continuous",
        "function",
        "real",
        "negative",
        "value",
        "well",
        "positive",
        "value",
        "inside",
        "interval",
        "root",
        "interval",
        "would",
        "start",
        "ordered",
        "field",
        "real",
        "number",
        "would",
        "thought",
        "clear",
        "mean",
        "secondorder",
        "axiomatization",
        "field",
        "categorical",
        "would",
        "take",
        "arbitrary",
        "continuous",
        "function",
        "f",
        "field",
        "value",
        "opposite",
        "sign",
        "inside",
        "fixed",
        "interval",
        "b",
        "would",
        "clear",
        "mean",
        "secondorder",
        "logic",
        "variable",
        "function",
        "let",
        "c",
        "din",
        "b",
        "f",
        "c",
        "f",
        "without",
        "loss",
        "generality",
        "c",
        "d",
        "let",
        "x",
        "ein",
        "b",
        "f",
        "e",
        "since",
        "relation",
        "variable",
        "subset",
        "domain",
        "think",
        "x",
        "simply",
        "value",
        "relation",
        "variable",
        "obvious",
        "x",
        "exists",
        "priori",
        "could",
        "imposed",
        "contradictory",
        "condition",
        "x",
        "eg",
        "x",
        "e",
        "enotin",
        "x",
        "able",
        "claim",
        "exists",
        "however",
        "case",
        "comprehension",
        "axiom",
        "schema",
        "implies",
        "x",
        "exists",
        "clearly",
        "xneemptyset",
        "x",
        "bounded",
        "d",
        "one",
        "secondorder",
        "axiom",
        "characterizing",
        "field",
        "real",
        "number",
        "every",
        "nonempty",
        "set",
        "bounded",
        "supremum",
        "thus",
        "let",
        "z",
        "supremum",
        "x",
        "follows",
        "basic",
        "property",
        "continuous",
        "function",
        "f",
        "z",
        "would",
        "difficult",
        "tell",
        "proof",
        "whether",
        "syntactical",
        "derivation",
        "axiom",
        "semantic",
        "argument",
        "surface",
        "look",
        "like",
        "semantic",
        "argument",
        "every",
        "step",
        "derived",
        "axiom",
        "could",
        "considered",
        "shorthand",
        "version",
        "syntactic",
        "derivation",
        "syntactic",
        "derivation",
        "secondorder",
        "logic",
        "based",
        "comprehension",
        "axiom",
        "schema",
        "axiom",
        "choice",
        "much",
        "like",
        "syntactic",
        "derivation",
        "set",
        "theory",
        "neither",
        "case",
        "would",
        "working",
        "mathematician",
        "write",
        "detail",
        "argument",
        "would",
        "resort",
        "shorthand",
        "notation",
        "casessecondorder",
        "logic",
        "set",
        "theorywe",
        "interpret",
        "proof",
        "shorthand",
        "version",
        "syntactic",
        "formal",
        "proof",
        "semantic",
        "proof",
        "first",
        "order",
        "logic",
        "satisfies",
        "completeness",
        "theorem",
        "help",
        "semantic",
        "proof",
        "turned",
        "syntactic",
        "formal",
        "proof",
        "since",
        "completeness",
        "theorem",
        "us",
        "concept",
        "first",
        "order",
        "structure",
        "sentence",
        "proved",
        "axiom",
        "true",
        "model",
        "axiom",
        "countable",
        "model",
        "nonstandard",
        "model",
        "true",
        "intuitive",
        "model",
        "cumulative",
        "hierarchy",
        "set",
        "reflection",
        "theorem",
        "sentence",
        "true",
        "class",
        "set",
        "since",
        "intuitive",
        "model",
        "informal",
        "prove",
        "class",
        "set",
        "intuitive",
        "model",
        "hand",
        "order",
        "completeness",
        "theorem",
        "applicable",
        "semantic",
        "argument",
        "work",
        "whatever",
        "model",
        "set",
        "theory",
        "using",
        "mean",
        "semantic",
        "argument",
        "set",
        "theory",
        "use",
        "property",
        "individual",
        "model",
        "set",
        "theory",
        "unless",
        "universal",
        "first",
        "order",
        "property",
        "model",
        "zfc",
        "practice",
        "mean",
        "property",
        "ch",
        "diamond",
        "aleph_",
        "aleph_",
        "used",
        "mentioned",
        "separately",
        "assumption",
        "nonfirst",
        "order",
        "property",
        "model",
        "used",
        "else",
        "completeness",
        "theorem",
        "used",
        "still",
        "sometimes",
        "nonfirst",
        "order",
        "property",
        "used",
        "example",
        "may",
        "argument",
        "every",
        "countable",
        "model",
        "zfc",
        "satisfies",
        "phi",
        "downward",
        "löwenheimskolem",
        "theorem",
        "every",
        "model",
        "zfc",
        "satisfies",
        "phi",
        "thus",
        "able",
        "eliminate",
        "nonfirst",
        "order",
        "assumption",
        "countability",
        "model",
        "secondorder",
        "logic",
        "satisfies",
        "completeness",
        "theorem",
        "henkin",
        "model",
        "used",
        "thus",
        "semantic",
        "argument",
        "secondorder",
        "logic",
        "turned",
        "syntactic",
        "formal",
        "proof",
        "set",
        "theory",
        "semantic",
        "argument",
        "valid",
        "henkin",
        "model",
        "full",
        "henkin",
        "model",
        "thus",
        "set",
        "theory",
        "semantic",
        "argument",
        "use",
        "property",
        "henkin",
        "model",
        "shared",
        "henkin",
        "model",
        "particular",
        "fullness",
        "see",
        "assumed",
        "general",
        "model",
        "secondorder",
        "property",
        "happens",
        "categoricity",
        "fullness",
        "abandoned",
        "still",
        "internal",
        "categoricity",
        "use",
        "categoricity",
        "proof",
        "long",
        "make",
        "sure",
        "work",
        "inside",
        "one",
        "model",
        "one",
        "certain",
        "way",
        "make",
        "sure",
        "base",
        "everything",
        "axiom",
        "comprehension",
        "axiom",
        "schema",
        "axiom",
        "choice",
        "secondorder",
        "logic",
        "used",
        "foundation",
        "mathematics",
        "situation",
        "may",
        "emerge",
        "third",
        "order",
        "logic",
        "needed",
        "example",
        "topology",
        "usually",
        "defined",
        "family",
        "set",
        "therefore",
        "third",
        "order",
        "object",
        "would",
        "well",
        "spirit",
        "secondorder",
        "logic",
        "simply",
        "include",
        "third",
        "higher",
        "order",
        "logic",
        "needed",
        "naturally",
        "comprehension",
        "axiom",
        "schema",
        "axiom",
        "choice",
        "assumed",
        "third",
        "order",
        "quantifier",
        "devoted",
        "fair",
        "amount",
        "space",
        "entry",
        "power",
        "secondorder",
        "logic",
        "characterize",
        "structure",
        "see",
        "putting",
        "briefly",
        "structure",
        "mathematical",
        "interest",
        "secondorder",
        "characterizable",
        "structure",
        "constructed",
        "mean",
        "axiom",
        "choice",
        "may",
        "escape",
        "secondorder",
        "characterizable",
        "power",
        "secondorder",
        "logic",
        "demonstrate",
        "existence",
        "structure",
        "axiom",
        "including",
        "comprehension",
        "axiom",
        "axiom",
        "choice",
        "satisfied",
        "one",
        "element",
        "domain",
        "prove",
        "axiom",
        "structure",
        "size",
        "undermines",
        "quine",
        "characterization",
        "secondorder",
        "logic",
        "set",
        "theory",
        "sheep",
        "clothing",
        "section",
        "heading",
        "chapter",
        "meant",
        "probably",
        "suggest",
        "ontological",
        "commitment",
        "secondorder",
        "logic",
        "level",
        "set",
        "theory",
        "perhaps",
        "philosophy",
        "secondorder",
        "logic",
        "structure",
        "characterized",
        "exists",
        "echoing",
        "hilbert",
        "formalist",
        "philosophy",
        "however",
        "even",
        "sense",
        "need",
        "know",
        "characterizing",
        "sentence",
        "theta_ma",
        "consistent",
        "trivial",
        "approach",
        "observe",
        "ma",
        "certainly",
        "satisfies",
        "theta_ma",
        "clearly",
        "begs",
        "question",
        "still",
        "hilbert",
        "argues",
        "consistency",
        "axiom",
        "real",
        "number",
        "ma",
        "on",
        "cdot",
        "axiom",
        "infinity",
        "saying",
        "proper",
        "subset",
        "domain",
        "cardinality",
        "entire",
        "domain",
        "needed",
        "combination",
        "comprehension",
        "axiom",
        "schema",
        "existence",
        "ma",
        "follows",
        "or",
        "cdot",
        "enough",
        "need",
        "stronger",
        "axiom",
        "infinity",
        "example",
        "existence",
        "dense",
        "order",
        "satisfies",
        "completeness",
        "axiom",
        "every",
        "bounded",
        "nonempty",
        "set",
        "supremum",
        "seems",
        "inevitable",
        "move",
        "structure",
        "bigger",
        "structure",
        "need",
        "make",
        "largeness",
        "assumption",
        "assumption",
        "called",
        "large",
        "domain",
        "assumption",
        "väänänen",
        "set",
        "theory",
        "aspect",
        "taken",
        "care",
        "outset",
        "assuming",
        "power",
        "set",
        "axiom",
        "replacement",
        "axiom",
        "together",
        "make",
        "sure",
        "large",
        "enough",
        "set",
        "secondorder",
        "logic",
        "assume",
        "new",
        "new",
        "large",
        "domain",
        "assumption",
        "move",
        "along",
        "seen",
        "drawback",
        "make",
        "new",
        "assumption",
        "time",
        "hand",
        "seen",
        "asset",
        "make",
        "ambitious",
        "assumption",
        "really",
        "needed"
    ]
}