{
    "main_text": "Further Kinds of Logical Pluralism || Pluralism by Restriction\n6. What’s at Stake in the Debate about Logical Pluralism?\n\nWe’ve seen that there’s a vibrant debate about logical\npluralism. But there is also an undercurrent of skepticism about\nwhether the debate is worth having. Such suspicion has long been\ndeployed by monists to criticise pluralists of various kinds: if\nthat’s what pluralism is, then it’s true, but\nuninteresting (Goddu 2002: 222–6; Priest 2006: ch. 12; see also\nStei 2020a). But more recently it’s been pointed out that it is\nincumbent on the monist no less than the pluralist to answer the\nquestion of what’s at stake in the debate about how many logics\nare correct (Eklund 2020; Clarke-Doane manuscript\n [Other Internet Resources]).\n In this final section, we tackle some of these issues, which have\nbeen implicit in the preceding discussion.\n\nAny pluralism that relativises logics to different domains\n (§5.3)\n or otherwise restricts pluralism to different areas of discourse\n (§5.5)\n needs to explain how it conflicts with monism. A monist can agree\nthat, given background assumptions about a domain, it may be\nappropriate to deploy a different logic than the one they endorse. As\nwe’ve seen\n (§2.4.1),\n the subclassical monist allows strength recapture in the right\ndomain. For instance, a proponent of LP can allow that, when reasoning\nabout a consistent domain, one can use classical logic, rather than a\nparaconsistent logic. So what is it about domain-relative pluralism\nthat makes it different from monism? One strategy is to appeal to the\npractices of those working in the relevant domains. Stewart Shapiro\n(2014: ch. 3), for instance, derives a pluralism from the practices of\nmathematicians working in areas that deploy nonclassical logics, such\nas Smooth Infinitesimal Analysis. Shapiro’s argument depends on\ncontroversial assumptions in the philosophy of mathematics, but\nperhaps it can be made independently of such commitments (Caret 2021).\nEven so, the challenge remains of defending the pluralist’s\ninterpretation of the data over the monist’s. Why think that\nthere really are two different correct logics rather than that for the\npurposes of, say, doing Smooth Infinitesimal Analysis, it’s\nuseful to reason according to an intuitionist logic, rather than\nclassical logic?\n\nPerhaps a domain-neutral pluralism, such as Beall and Restall’s\nCase-Based Logical Pluralism\n (§1),\n which holds that different logics are correct of the very same\ndomain, is a more promising candidate for a substantive thesis. There\nare at least two versions of such a pluralism: semantic and\n telic.[8]\n The semantic version has it that some logical term or concept is\nunsettled, vague, or ambiguous. Let’s take it to be the term\n“valid” for concreteness’s sake. Then the semantic\nversion of domain-neutral pluralism holds that—even keeping\nfixed the domain—“valid” has different referents, or\nadmits of different precisifications, all of which are correct. Even\nsetting aside the worries about background commitments in philosophy\nof language canvased in\n §1.1,\n the onus on the pluralist is to explain why the claim of semantic\nindeterminacy is a philosophically, rather than merely a\nlinguistically, substantive thesis. The worry is that the\nmonism-pluralism debate is about how many (and which) logics are\ncorrect, not how many are picked out by our terms. So even if\n“valid” does admit of different precifisications, as Beall\nand Restall suggest, the pluralist needs further argument to get the\nconclusion that the different referents of “valid” are\ncorrect logics. Otherwise the monist can object that, if\n“valid” in English is indeterminate or ambiguous, so much\nthe worse for English. There is only one correct logic, even if\nspeakers of English don’t always manage to pick it out. To meet\nthis objection, domain-neutral pluralists are often better understood\nas offering a telic version of pluralism (see Eklund 2020:\n440–443 for discussion).\n\nThe telic version of domain-neutral pluralism consists in two claims.\nFirst, there is at least one telos or goal that a logic must\nmeet in order to be correct. Second, more than one logic meets that\ngoal or goals. The second claim might be held either because there is\na single telos and more than one logic meets it, or because\nthere is more than one goal that multiple logics meet. Field’s\n(2009) pluralism about epistemic normativity\n (§5.4)\n is an explicit version of telic pluralism. But even Case-Based\nLogical Pluralism, which is officially about the unsettledness of\nvarious terms, might be better interpreted as telic pluralism. This is\nin part because of the concerns of the previous paragraph, about\nimbuing semantic versions of pluralism with substantive content. But\ncase-based pluralists themselves sometimes write as if they’re\nmore interested in a telic project. For instance, in responding to a\nversion of the normativity objection\n (§2.2),\n Beall & Restall (2006: 94–97) suggest that the goal of a\ncorrect logic is to preserve epistemic entitlement or warrant.\n\nRegardless of how particular authors understand their construals of\npluralism, telic interpretations of logical pluralism seem to deliver\nphilosophically substantive and interesting theses, not least because\nmany monists agree that there is a goal that a logic must meet in\norder to be correct. (Let’s suppose that there is only one such\ngoal, to keep things tractable.) Priest (2006: 196), for instance,\ntakes the goal of logic to be providing an analysis of reasoning and\nargues that only a paraconsistent logic best meets that goal. So it\nlooks like we have substantive room for disagreement: there’s\nsome goal that a logic must meet to be correct; the pluralist claims\nthat more than one logic does that equally well, the monist that only\none logic best meets the goal. A problem arises if we have pluralism\nabout what it is for logic to meet a goal, however (see Clarke-Doane\nmanuscript: 17–19\n [Other Internet Resources],\n for a similar argument in a slightly different context). A monist who\nendorses only classical logic might agree that intuitionist logic best\nmeets\\(_I\\) the goal of logic, where meeting\\(_I\\) the goal of logic\ntakes into account considerations that motivate truth-value gaps. But\nthe classical monist might nonetheless insist that the correct logic\nmust meet the goal of logic in some other sense.\n\nSo the challenge is to articulate the monism-pluralism debate in a way\nthat is substantive. There are several ways this might be done.\nPerhaps, after getting clearer about what it takes to meet the goal of\nlogic, the telic pluralist and the monist will find some common ground\nfrom which to conduct their debate. Or perhaps we can interpret\ndisagreements between pluralists and monists as involving\nmetalinguistic negotiation. Very roughly, a disagreement involves\nmetalinguistic negotiation if it is conducted at a first-order level,\nbut is best interpreted metalinguistically (Plunkett & Sundell\n2013). For instance, a disagreement about whether there is more than\none correct logic might best be interpreted about how we should use\nsome of the terms in the disagreement, such as “valid”.\nKouri Kissel (2021) deploys this strategy to argue that\ndomain-relative pluralism can allow for substantive disagreement\nacross domains. Perhaps the broader debate about logical pluralism can\nalso be understood in this way.\n\nA final word on monism. One might think that the monist can avoid\nthese vexed issues about what it is for a logic to be correct by just\ndenying pluralism and claiming that it is not the case that\nthere is more than one correct logic.\n\nBut this won’t do, for two reasons. First, the monist will need\nto say which logic is correct. That will involve similar\nissues to those raised above. If the claim that a certain logic is\ncorrect is given a semantic interpretation, then the philosophical\nupshot of that needs drawing out. If the monist’s claim is given\na telic interpretation, then there will need to be careful\narticulation of, and agreement about, both what the goal of logic is\nand also of what it would be for a logic to best meet that goal.\n\nSecond, denying that there is more than one correct logic is\ncompatible with both logical monism (there is one and only one correct\nlogic) and logical nihilism (there are no correct\n logics).[9]\n In order to be distinguished from nihilism, monism needs to be\ninterpreted in a way that is philosophically substantive. That will\nrequire the monist to say what it is for a logic to be correct in a\nway that the nihilist will disagree with. For instance, the nihilist\nmight grant that some logic is best suited for a given purpose, like\nanalysing certain kinds of electrical circuit, but deny that that\nsuffices for the logic’s being correct. Or the nihilist\nmight allow strength recapture under certain conditions\n (§2.4.1).\n One option available to the monist is to interpret the claim that\nthere is one and only one correct logic noncognitively. Clarke-Doane\n(manuscript\n [Other Internet Resources]),\n after finding no satisfying factualist construal of monism,\ninterprets the claim as expressing an attitude. Perhaps this strategy\ncould be extended to the debate between monists and pluralists more\nbroadly.\n\nTo sum up this section, it’s surprisingly difficult to interpret\nlogical pluralism in a way that is clearly philosophically\nsubstantive. That does not mean the debate about logical pluralism is\nfruitless, not least because it is similarly difficult to interpret\nmonism in a philosophically substantive way. Thus monists and\npluralists alike would do well to be clearer both about their views\nand the philosophical import of them. But the debate about logical\npluralism is also worth having because it brings into relief other\nissues in the philosophy of logic. As we’ve seen, these include\nissues to do with meaning, normativity, and metalogic. Furthermore, by\nasking whether there is more than one correct logic, logical pluralism\nurges us to pay closer attention to what it is for a logic to be\ncorrect, and to consider whether nonclassical logics might meet that\nstandard.\n",
    "section_title": "6. What’s at Stake in the Debate about Logical Pluralism?",
    "entry_title": "Logical Pluralism",
    "hierarchy_title": "Logical Pluralism || Further Kinds of Logical Pluralism || Pluralism by Restriction",
    "tokenized_text": [
        "kind",
        "logical",
        "pluralism",
        "pluralism",
        "restriction",
        "stake",
        "debate",
        "logical",
        "pluralism",
        "seen",
        "vibrant",
        "debate",
        "logical",
        "pluralism",
        "also",
        "undercurrent",
        "skepticism",
        "whether",
        "debate",
        "worth",
        "suspicion",
        "long",
        "deployed",
        "monists",
        "criticise",
        "pluralist",
        "various",
        "kind",
        "pluralism",
        "true",
        "uninteresting",
        "goddu",
        "priest",
        "ch",
        "see",
        "also",
        "stei",
        "a",
        "recently",
        "pointed",
        "incumbent",
        "monist",
        "le",
        "pluralist",
        "answer",
        "question",
        "stake",
        "debate",
        "many",
        "logic",
        "correct",
        "eklund",
        "clarkedoane",
        "manuscript",
        "internet",
        "resource",
        "final",
        "section",
        "tackle",
        "issue",
        "implicit",
        "preceding",
        "discussion",
        "pluralism",
        "relativises",
        "logic",
        "different",
        "domain",
        "otherwise",
        "restricts",
        "pluralism",
        "different",
        "area",
        "discourse",
        "need",
        "explain",
        "conflict",
        "monism",
        "monist",
        "agree",
        "given",
        "background",
        "assumption",
        "domain",
        "may",
        "appropriate",
        "deploy",
        "different",
        "logic",
        "one",
        "endorse",
        "seen",
        "subclassical",
        "monist",
        "allows",
        "strength",
        "recapture",
        "right",
        "domain",
        "instance",
        "proponent",
        "lp",
        "allow",
        "reasoning",
        "consistent",
        "domain",
        "one",
        "use",
        "classical",
        "logic",
        "rather",
        "paraconsistent",
        "logic",
        "domainrelative",
        "pluralism",
        "make",
        "different",
        "monism",
        "one",
        "strategy",
        "appeal",
        "practice",
        "working",
        "relevant",
        "domain",
        "stewart",
        "shapiro",
        "ch",
        "instance",
        "derives",
        "pluralism",
        "practice",
        "mathematician",
        "working",
        "area",
        "deploy",
        "nonclassical",
        "logic",
        "smooth",
        "infinitesimal",
        "analysis",
        "shapiro",
        "argument",
        "depends",
        "controversial",
        "assumption",
        "philosophy",
        "mathematics",
        "perhaps",
        "made",
        "independently",
        "commitment",
        "caret",
        "even",
        "challenge",
        "remains",
        "defending",
        "pluralist",
        "interpretation",
        "data",
        "monist",
        "think",
        "really",
        "two",
        "different",
        "correct",
        "logic",
        "rather",
        "purpose",
        "say",
        "smooth",
        "infinitesimal",
        "analysis",
        "useful",
        "reason",
        "according",
        "intuitionist",
        "logic",
        "rather",
        "classical",
        "logic",
        "perhaps",
        "domainneutral",
        "pluralism",
        "beall",
        "restall",
        "casebased",
        "logical",
        "pluralism",
        "hold",
        "different",
        "logic",
        "correct",
        "domain",
        "promising",
        "candidate",
        "substantive",
        "thesis",
        "least",
        "two",
        "version",
        "pluralism",
        "semantic",
        "telic",
        "semantic",
        "version",
        "logical",
        "term",
        "concept",
        "unsettled",
        "vague",
        "ambiguous",
        "let",
        "take",
        "term",
        "valid",
        "concreteness",
        "sake",
        "semantic",
        "version",
        "domainneutral",
        "pluralism",
        "hold",
        "thateven",
        "keeping",
        "fixed",
        "domain",
        "valid",
        "different",
        "referent",
        "admits",
        "different",
        "precisifications",
        "correct",
        "even",
        "setting",
        "aside",
        "worry",
        "background",
        "commitment",
        "philosophy",
        "language",
        "canvased",
        "onus",
        "pluralist",
        "explain",
        "claim",
        "semantic",
        "indeterminacy",
        "philosophically",
        "rather",
        "merely",
        "linguistically",
        "substantive",
        "thesis",
        "worry",
        "monismpluralism",
        "debate",
        "many",
        "logic",
        "correct",
        "many",
        "picked",
        "term",
        "even",
        "valid",
        "admit",
        "different",
        "precifisications",
        "beall",
        "restall",
        "suggest",
        "pluralist",
        "need",
        "argument",
        "get",
        "conclusion",
        "different",
        "referent",
        "valid",
        "correct",
        "logic",
        "otherwise",
        "monist",
        "object",
        "valid",
        "english",
        "indeterminate",
        "ambiguous",
        "much",
        "worse",
        "english",
        "one",
        "correct",
        "logic",
        "even",
        "speaker",
        "english",
        "always",
        "manage",
        "pick",
        "meet",
        "objection",
        "domainneutral",
        "pluralist",
        "often",
        "better",
        "understood",
        "offering",
        "telic",
        "version",
        "pluralism",
        "see",
        "eklund",
        "discussion",
        "telic",
        "version",
        "domainneutral",
        "pluralism",
        "consists",
        "two",
        "claim",
        "first",
        "least",
        "one",
        "telos",
        "goal",
        "logic",
        "must",
        "meet",
        "order",
        "correct",
        "second",
        "one",
        "logic",
        "meet",
        "goal",
        "goal",
        "second",
        "claim",
        "might",
        "held",
        "either",
        "single",
        "telos",
        "one",
        "logic",
        "meet",
        "one",
        "goal",
        "multiple",
        "logic",
        "meet",
        "field",
        "pluralism",
        "epistemic",
        "normativity",
        "explicit",
        "version",
        "telic",
        "pluralism",
        "even",
        "casebased",
        "logical",
        "pluralism",
        "officially",
        "unsettledness",
        "various",
        "term",
        "might",
        "better",
        "interpreted",
        "telic",
        "pluralism",
        "part",
        "concern",
        "previous",
        "paragraph",
        "imbuing",
        "semantic",
        "version",
        "pluralism",
        "substantive",
        "content",
        "casebased",
        "pluralist",
        "sometimes",
        "write",
        "interested",
        "telic",
        "project",
        "instance",
        "responding",
        "version",
        "normativity",
        "objection",
        "beall",
        "restall",
        "suggest",
        "goal",
        "correct",
        "logic",
        "preserve",
        "epistemic",
        "entitlement",
        "warrant",
        "regardless",
        "particular",
        "author",
        "understand",
        "construal",
        "pluralism",
        "telic",
        "interpretation",
        "logical",
        "pluralism",
        "seem",
        "deliver",
        "philosophically",
        "substantive",
        "interesting",
        "thesis",
        "least",
        "many",
        "monists",
        "agree",
        "goal",
        "logic",
        "must",
        "meet",
        "order",
        "correct",
        "let",
        "suppose",
        "one",
        "goal",
        "keep",
        "thing",
        "tractable",
        "priest",
        "instance",
        "take",
        "goal",
        "logic",
        "providing",
        "analysis",
        "reasoning",
        "argues",
        "paraconsistent",
        "logic",
        "best",
        "meet",
        "goal",
        "look",
        "like",
        "substantive",
        "room",
        "disagreement",
        "goal",
        "logic",
        "must",
        "meet",
        "correct",
        "pluralist",
        "claim",
        "one",
        "logic",
        "equally",
        "well",
        "monist",
        "one",
        "logic",
        "best",
        "meet",
        "goal",
        "problem",
        "arises",
        "pluralism",
        "logic",
        "meet",
        "goal",
        "however",
        "see",
        "clarkedoane",
        "manuscript",
        "internet",
        "resource",
        "similar",
        "argument",
        "slightly",
        "different",
        "context",
        "monist",
        "endorses",
        "classical",
        "logic",
        "might",
        "agree",
        "intuitionist",
        "logic",
        "best",
        "meets",
        "_i",
        "goal",
        "logic",
        "meeting",
        "_i",
        "goal",
        "logic",
        "take",
        "account",
        "consideration",
        "motivate",
        "truthvalue",
        "gap",
        "classical",
        "monist",
        "might",
        "nonetheless",
        "insist",
        "correct",
        "logic",
        "must",
        "meet",
        "goal",
        "logic",
        "sense",
        "challenge",
        "articulate",
        "monismpluralism",
        "debate",
        "way",
        "substantive",
        "several",
        "way",
        "might",
        "done",
        "perhaps",
        "getting",
        "clearer",
        "take",
        "meet",
        "goal",
        "logic",
        "telic",
        "pluralist",
        "monist",
        "find",
        "common",
        "ground",
        "conduct",
        "debate",
        "perhaps",
        "interpret",
        "disagreement",
        "pluralist",
        "monists",
        "involving",
        "metalinguistic",
        "negotiation",
        "roughly",
        "disagreement",
        "involves",
        "metalinguistic",
        "negotiation",
        "conducted",
        "firstorder",
        "level",
        "best",
        "interpreted",
        "metalinguistically",
        "plunkett",
        "sundell",
        "instance",
        "disagreement",
        "whether",
        "one",
        "correct",
        "logic",
        "might",
        "best",
        "interpreted",
        "use",
        "term",
        "disagreement",
        "valid",
        "kouri",
        "kissel",
        "deploys",
        "strategy",
        "argue",
        "domainrelative",
        "pluralism",
        "allow",
        "substantive",
        "disagreement",
        "across",
        "domain",
        "perhaps",
        "broader",
        "debate",
        "logical",
        "pluralism",
        "also",
        "understood",
        "way",
        "final",
        "word",
        "monism",
        "one",
        "might",
        "think",
        "monist",
        "avoid",
        "vexed",
        "issue",
        "logic",
        "correct",
        "denying",
        "pluralism",
        "claiming",
        "case",
        "one",
        "correct",
        "logic",
        "two",
        "reason",
        "first",
        "monist",
        "need",
        "say",
        "logic",
        "correct",
        "involve",
        "similar",
        "issue",
        "raised",
        "claim",
        "certain",
        "logic",
        "correct",
        "given",
        "semantic",
        "interpretation",
        "philosophical",
        "upshot",
        "need",
        "drawing",
        "monist",
        "claim",
        "given",
        "telic",
        "interpretation",
        "need",
        "careful",
        "articulation",
        "agreement",
        "goal",
        "logic",
        "also",
        "would",
        "logic",
        "best",
        "meet",
        "goal",
        "second",
        "denying",
        "one",
        "correct",
        "logic",
        "compatible",
        "logical",
        "monism",
        "one",
        "one",
        "correct",
        "logic",
        "logical",
        "nihilism",
        "correct",
        "logic",
        "order",
        "distinguished",
        "nihilism",
        "monism",
        "need",
        "interpreted",
        "way",
        "philosophically",
        "substantive",
        "require",
        "monist",
        "say",
        "logic",
        "correct",
        "way",
        "nihilist",
        "disagree",
        "instance",
        "nihilist",
        "might",
        "grant",
        "logic",
        "best",
        "suited",
        "given",
        "purpose",
        "like",
        "analysing",
        "certain",
        "kind",
        "electrical",
        "circuit",
        "deny",
        "suffices",
        "logic",
        "correct",
        "nihilist",
        "might",
        "allow",
        "strength",
        "recapture",
        "certain",
        "condition",
        "one",
        "option",
        "available",
        "monist",
        "interpret",
        "claim",
        "one",
        "one",
        "correct",
        "logic",
        "noncognitively",
        "clarkedoane",
        "manuscript",
        "internet",
        "resource",
        "finding",
        "satisfying",
        "factualist",
        "construal",
        "monism",
        "interprets",
        "claim",
        "expressing",
        "attitude",
        "perhaps",
        "strategy",
        "could",
        "extended",
        "debate",
        "monists",
        "pluralist",
        "broadly",
        "sum",
        "section",
        "surprisingly",
        "difficult",
        "interpret",
        "logical",
        "pluralism",
        "way",
        "clearly",
        "philosophically",
        "substantive",
        "mean",
        "debate",
        "logical",
        "pluralism",
        "fruitless",
        "least",
        "similarly",
        "difficult",
        "interpret",
        "monism",
        "philosophically",
        "substantive",
        "way",
        "thus",
        "monists",
        "pluralist",
        "alike",
        "would",
        "well",
        "clearer",
        "view",
        "philosophical",
        "import",
        "debate",
        "logical",
        "pluralism",
        "also",
        "worth",
        "brings",
        "relief",
        "issue",
        "philosophy",
        "logic",
        "seen",
        "include",
        "issue",
        "meaning",
        "normativity",
        "metalogic",
        "furthermore",
        "asking",
        "whether",
        "one",
        "correct",
        "logic",
        "logical",
        "pluralism",
        "urge",
        "u",
        "pay",
        "closer",
        "attention",
        "logic",
        "correct",
        "consider",
        "whether",
        "nonclassical",
        "logic",
        "might",
        "meet",
        "standard"
    ]
}