{
    "main_text": "The normative status of what? || Logical pluralism\n1.2 Logical pluralism\n\nWe said that not much of our discussion below hinges on the choice of\none’s logic. However, while we countenanced the possibility of\ndisagreement over which logic is correct, we have simply presupposed\nthat there must be a unique correct logic. And this latter assumption\ndoes seem to bear on our question in potentially significant ways. The\nissue has yet to be explored more fully. Here I offer a number of preliminary distinctions\nand observations.\n\nLogical pluralists maintain that there is more than one correct logic\n(see entry on\n logical pluralism).\n Now, there are perfectly uncontroversial senses in which several distinct\nlogical systems might be thought to be equally legitimate: different\nlogical formalisms might lend themselves more or less well to\ndifferent applications, e.g., classical propositional logic may be\nused to model electric circuits, the Lambek calculus naturally models\nphrase structure grammars, and so forth. If “correct” or\n“legitimate” is merely understood as “having a\nuseful application”, monists should have no complaints about\nsuch anodyne forms of “pluralism”. The monist may happily admit that there is a vast number of systems of logic that make for\nworthy objects of study, many of which will have useful\napplications. What monists must have in mind, then, is a more demanding sense of “correctness”.\nAccording to Priest, the monist takes there to be, over and above\nquestions of local applicability, a core or “canonical”\n(Priest 2006: 196) application of logic. The canonical use of logic\nconsists in determining “what follows from what—what\npremises support what conclusion—and why” (idem). It is\nonly when the question is framed in these terms, that the full force\nof the opposition between monists and pluralists can be appreciated.\nThe monist maintains that there is but one logic fit to play this core\nrole; the pluralist insists that several logics have an equally good\nclaim to playing it.\n\nOne consequence of pluralism, then, is that in a dispute between\nadvocates of different logics both of which lay claim to being the\ncorrect logic in this sense—say, a dispute between a classical\nlogician and an advocate of intuitionistic logic—neither party\nto the dispute needs to be at fault. Each logic may be equally\nlegitimate. For this to be possible, it must be the case that even the\ncanonical application of logic can be realized in multiple ways.\nPluralists differ in the accounts they offer of this multiple\nrealizability. One\ninfluential such account has been advanced by J.C. Beall and Greg\nRestall (2005). According to their account, several logics may be\nequally qualified to fulfill the core function of logic, because “logical consequence” admits of several distinct interpretations (within a specified range). Roughly, \\(A\\) is a logical consequence of a set of formulas \\(\\Gamma\\) if and\nonly if, in every case in which all of the members of \\(\\Gamma\\) are\ntrue, so is \\(A\\). Depending on how we understand “case”\nin our definition—e.g., as Tarskian models (classical logic),\nstages (intuitionistic logic), situations (relevant logic),\netc.—we arrive at different concepts of logical consequence.\n\nWhat does this mean for the question of logic’s normative\nstatus? It follows that it is only once we choose to disambiguate\n“logical consequence” in a particular way—as classical or\nintuitionistic, say—that the normative import of that particular\nconception of consequence makes itself felt. After all, on the\npluralist picture a given conception of consequence cannot be\nnormatively binding in virtue of being (uniquely) correct, i.e., in\nvirtue of being descriptively adequate with respect to the entailment\nfacts, as it were. Hence, if I opt for an intuitionistic conception of\nconsequence and you go in for a classical one, I have no grounds for\ncriticizing your move from, say, \\(\\neg \\neg A\\) to \\(A\\), save\nperhaps pragmatic ones. To be sure, such a move would be impermissible\naccording to my preferred notion of consequence, but it is perfectly\nacceptable according to yours. According to the pluralist, then, there\nexists no absolute sense, but only system-relative senses, in which a\nlogic can normatively bind us. Pluralism about logic thus seems to give rise\nto pluralism about logical normativity: If there are several equally\nlegitimate consequence relations, there are also several equally legitimate sets of logical norms. Consequently, it is hard to see prima\nfacie how substantive normative conflicts can arise. If the consequence\nrelations of classical and intuitionistic logic are equally\nlegitimate, there is little to disagree about when it comes to the\nnorms they induce. The classicist and the intuitionist simply have\nopted to play by different rules.\n\nThis line of thought leads to a potential worry, however. For logical\nnorms do not merely bind us in the way that the rules of a game bind\nus. I hold myself to be answerable to the rules governing a game\n(of chess, say) so long as I wish to participate in it. However, the\nnormativity of logic does not seem to be optional in the same way. The\nnorms of logic are themselves responsible to our broader epistemic\naims (and would thus need to be coordinated with other epistemic\nnorms). Hence, if my epistemic aim is, say, acquiring true beliefs\n(and avoiding false ones), this may give me a reason to prefer one set\nof logical norms over another. For imagine I could choose either of\ntwo logics \\(L_{1}\\) and \\(L_{2}\\). Suppose, moreover, that \\(A\\) is\ntrue and that \\(A \\models_{L_{1}} B\\) but \\(A \\not \\models_{L_{2}}\nB\\), for some relevant proposition \\(B\\). Even according to Beall and\nRestall, not all logics are equal. To pass muster, a logic must\nsatisfy certain core conditions. In particular, it must be\ntruth-preserving. Assuming that both \\(L_{1}\\) and \\(L_{2}\\) are\ntruth-preserving, it follows that \\(B\\) is true. But then it would\nseem that there is a clear sense in which \\(L_{1}\\) outperforms\n\\(L_{2}\\) in terms of the guidance it affords us. According to the\nnorms \\(L_{2}\\) gives rise to, there is presumably nothing amiss about\nan agent who believes \\(A\\) but not \\(B\\); according to \\(L_{1}\\)\nthere presumably is. Hence, \\(L_{1}\\) is more conducive to our\nepistemic aims. It follows that whenever two putatively equally\ncorrect logics, \\(L_{1}\\) and \\(L_{2}\\) are such that \\(L_{2}\\) is a\nproper sub-system of \\(L_{1}\\), one would appear to have reason to opt\nfor \\(L_{1}\\) since it is more conducive to one’s aim of having\ntrue beliefs. In cases where we are dealing with two logics \\(L_{1}\\)\nand \\(L_{2}\\) such that \\(\\models_{L_{1}}\\) and \\(\\models_{L_{2}}\\)\nare not sub-relations of one another, things may be more complicated.\nAll the same, even in such cases, it may well be that our overarching\nepistemic aims and norms give us reason to prefer one logic over\nanother, and hence that from the standpoint of these epistemic aims,\nthe logics are not equally good after all. The aim of these\nconsiderations is not to undermine forms of logical pluralism like the\none advanced by Beall and Restall, but merely to point out that once\nwe take the normative dimension of logic into account, we must also\nreckon with the broader epistemic goals, which the norms of logic\nmay be thought to be subservient to.\n\nField (2009b) argues for a different form of logical pluralism, one\nwhich leaves more room for normative conflict. Logical pluralism is\nnot, for Field, the result of ambiguity in our notion of logical\nconsequence. Rather, it has its source in non-factualism of epistemic\nnorms. His non-factualism, in turn, is fueled partly by general\nconcerns, partly by the nature of how we choose such norms. Among the\ngeneral concerns Field (2009c) mentions are Hume-style worries about\nthe impossibility of integrating irreducible normative facts into a\nnaturalistic world view, Benacerraf-style worries about our ability to\ngain epistemic access to such facts, and Mackie-style worries about\nthe “queerness” of such facts (i.e., that they not only\nappear to have no room within our scientific picture of the world, but\nthat, furthermore, they are supposed to have a somewhat mysterious\nmotivational pull to them). The latter issue of norm selection amounts\nto this. Given a set of epistemic goals, we evaluate candidate norms\nas better or worse depending how well they promote those goals.\nAccording to Field, we have no reason to assume that there should be a\nfact of the matter as to which choice of logic is the uniquely correct\none; there will typically not be a unique system that best optimizes\nour (often competing) constraints.\n\nThat being said, it seems that we can sensibly engage in rational\ndebates over which logic to adopt in the light of various issues\n(vagueness, the semantic paradoxes, etc.). Consequently, there is a\nclear sense in which normative conflicts do arise. Now, since Field\ntakes it to be an essential component of the notion of logical\nconsequence that it should induce norms (Field 2009a,b, 2015), we\nchoose a logic by finding out which logical norms it makes most sense\nfor us to adopt. But because Field does not take there to be a fact of\nthe matter as to which set of norms is correct and since the question\nas to which of the norms best promotes our epistemic ends is often\nunderdetermined, we may expect there to be several candidate sets of\nlogical norms all of which are equally well-motivated. We are thus\nleft with a (more modest) form of logical pluralism on our hands.\n\nWhat both of these types of pluralism have in common from the\npoint of view of the question of the normativity of logic, though, is\ntheir rejection of the view that logical norms might impose themselves\nupon us simply as a result of the correctness of the corresponding\nlogical principles. As such, pluralist views stand diametrically\nopposed to realist forms of monism such as the one championed by Gila\nSher (2011). According to Sher, logical principles are grounded,\nultimately, in “formal laws” and so in reality. It is\nthese formal laws that ultimately also ground the corresponding\nlogical\n norms.[4]\n\n",
    "section_title": "1.2 Logical pluralism",
    "entry_title": "The Normative Status of Logic",
    "hierarchy_title": "The Normative Status of Logic || The normative status of what? || Logical pluralism",
    "tokenized_text": [
        "normative",
        "status",
        "logical",
        "pluralism",
        "logical",
        "pluralism",
        "said",
        "much",
        "discussion",
        "hinge",
        "choice",
        "one",
        "logic",
        "however",
        "countenanced",
        "possibility",
        "disagreement",
        "logic",
        "correct",
        "simply",
        "presupposed",
        "must",
        "unique",
        "correct",
        "logic",
        "latter",
        "assumption",
        "seem",
        "bear",
        "question",
        "potentially",
        "significant",
        "way",
        "issue",
        "yet",
        "explored",
        "fully",
        "offer",
        "number",
        "preliminary",
        "distinction",
        "observation",
        "logical",
        "pluralist",
        "maintain",
        "one",
        "correct",
        "logic",
        "see",
        "entry",
        "logical",
        "pluralism",
        "perfectly",
        "uncontroversial",
        "sens",
        "several",
        "distinct",
        "logical",
        "system",
        "might",
        "thought",
        "equally",
        "legitimate",
        "different",
        "logical",
        "formalism",
        "might",
        "lend",
        "le",
        "well",
        "different",
        "application",
        "eg",
        "classical",
        "propositional",
        "logic",
        "may",
        "used",
        "model",
        "electric",
        "circuit",
        "lambek",
        "calculus",
        "naturally",
        "model",
        "phrase",
        "structure",
        "grammar",
        "forth",
        "correct",
        "legitimate",
        "merely",
        "understood",
        "useful",
        "application",
        "monists",
        "complaint",
        "anodyne",
        "form",
        "pluralism",
        "monist",
        "may",
        "happily",
        "admit",
        "vast",
        "number",
        "system",
        "logic",
        "make",
        "worthy",
        "object",
        "study",
        "many",
        "useful",
        "application",
        "monists",
        "must",
        "mind",
        "demanding",
        "sense",
        "correctness",
        "according",
        "priest",
        "monist",
        "take",
        "question",
        "local",
        "applicability",
        "core",
        "canonical",
        "priest",
        "application",
        "logic",
        "canonical",
        "use",
        "logic",
        "consists",
        "determining",
        "follows",
        "whatwhat",
        "premise",
        "support",
        "conclusionand",
        "idem",
        "question",
        "framed",
        "term",
        "full",
        "force",
        "opposition",
        "monists",
        "pluralist",
        "appreciated",
        "monist",
        "maintains",
        "one",
        "logic",
        "fit",
        "play",
        "core",
        "role",
        "pluralist",
        "insists",
        "several",
        "logic",
        "equally",
        "good",
        "claim",
        "playing",
        "one",
        "consequence",
        "pluralism",
        "dispute",
        "advocate",
        "different",
        "logic",
        "lay",
        "claim",
        "correct",
        "logic",
        "sensesay",
        "dispute",
        "classical",
        "logician",
        "advocate",
        "intuitionistic",
        "logicneither",
        "party",
        "dispute",
        "need",
        "fault",
        "logic",
        "may",
        "equally",
        "legitimate",
        "possible",
        "must",
        "case",
        "even",
        "canonical",
        "application",
        "logic",
        "realized",
        "multiple",
        "way",
        "pluralist",
        "differ",
        "account",
        "offer",
        "multiple",
        "realizability",
        "one",
        "influential",
        "account",
        "advanced",
        "jc",
        "beall",
        "greg",
        "restall",
        "according",
        "account",
        "several",
        "logic",
        "may",
        "equally",
        "qualified",
        "fulfill",
        "core",
        "function",
        "logic",
        "logical",
        "consequence",
        "admits",
        "several",
        "distinct",
        "interpretation",
        "within",
        "specified",
        "range",
        "roughly",
        "a",
        "logical",
        "consequence",
        "set",
        "formula",
        "gamma",
        "every",
        "case",
        "member",
        "gamma",
        "true",
        "a",
        "depending",
        "understand",
        "case",
        "definitioneg",
        "tarskian",
        "model",
        "classical",
        "logic",
        "stage",
        "intuitionistic",
        "logic",
        "situation",
        "relevant",
        "logic",
        "etcwe",
        "arrive",
        "different",
        "concept",
        "logical",
        "consequence",
        "mean",
        "question",
        "logic",
        "normative",
        "status",
        "follows",
        "choose",
        "disambiguate",
        "logical",
        "consequence",
        "particular",
        "wayas",
        "classical",
        "intuitionistic",
        "saythat",
        "normative",
        "import",
        "particular",
        "conception",
        "consequence",
        "make",
        "felt",
        "pluralist",
        "picture",
        "given",
        "conception",
        "consequence",
        "normatively",
        "binding",
        "virtue",
        "uniquely",
        "correct",
        "ie",
        "virtue",
        "descriptively",
        "adequate",
        "respect",
        "entailment",
        "fact",
        "hence",
        "opt",
        "intuitionistic",
        "conception",
        "consequence",
        "go",
        "classical",
        "one",
        "ground",
        "criticizing",
        "move",
        "say",
        "neg",
        "neg",
        "a",
        "a",
        "save",
        "perhaps",
        "pragmatic",
        "one",
        "sure",
        "move",
        "would",
        "impermissible",
        "according",
        "preferred",
        "notion",
        "consequence",
        "perfectly",
        "acceptable",
        "according",
        "according",
        "pluralist",
        "exists",
        "absolute",
        "sense",
        "systemrelative",
        "sens",
        "logic",
        "normatively",
        "bind",
        "u",
        "pluralism",
        "logic",
        "thus",
        "seems",
        "give",
        "rise",
        "pluralism",
        "logical",
        "normativity",
        "several",
        "equally",
        "legitimate",
        "consequence",
        "relation",
        "also",
        "several",
        "equally",
        "legitimate",
        "set",
        "logical",
        "norm",
        "consequently",
        "hard",
        "see",
        "prima",
        "facie",
        "substantive",
        "normative",
        "conflict",
        "arise",
        "consequence",
        "relation",
        "classical",
        "intuitionistic",
        "logic",
        "equally",
        "legitimate",
        "little",
        "disagree",
        "come",
        "norm",
        "induce",
        "classicist",
        "intuitionist",
        "simply",
        "opted",
        "play",
        "different",
        "rule",
        "line",
        "thought",
        "lead",
        "potential",
        "worry",
        "however",
        "logical",
        "norm",
        "merely",
        "bind",
        "u",
        "way",
        "rule",
        "game",
        "bind",
        "u",
        "hold",
        "answerable",
        "rule",
        "governing",
        "game",
        "chess",
        "say",
        "long",
        "wish",
        "participate",
        "however",
        "normativity",
        "logic",
        "seem",
        "optional",
        "way",
        "norm",
        "logic",
        "responsible",
        "broader",
        "epistemic",
        "aim",
        "would",
        "thus",
        "need",
        "coordinated",
        "epistemic",
        "norm",
        "hence",
        "epistemic",
        "aim",
        "say",
        "acquiring",
        "true",
        "belief",
        "avoiding",
        "false",
        "one",
        "may",
        "give",
        "reason",
        "prefer",
        "one",
        "set",
        "logical",
        "norm",
        "another",
        "imagine",
        "could",
        "choose",
        "either",
        "two",
        "logic",
        "l_",
        "l_",
        "suppose",
        "moreover",
        "a",
        "true",
        "models_",
        "l_",
        "b",
        "not",
        "models_",
        "l_",
        "b",
        "relevant",
        "proposition",
        "b",
        "even",
        "according",
        "beall",
        "restall",
        "logic",
        "equal",
        "pas",
        "muster",
        "logic",
        "must",
        "satisfy",
        "certain",
        "core",
        "condition",
        "particular",
        "must",
        "truthpreserving",
        "assuming",
        "l_",
        "l_",
        "truthpreserving",
        "follows",
        "b",
        "true",
        "would",
        "seem",
        "clear",
        "sense",
        "l_",
        "outperforms",
        "l_",
        "term",
        "guidance",
        "affords",
        "u",
        "according",
        "norm",
        "l_",
        "give",
        "rise",
        "presumably",
        "nothing",
        "amiss",
        "agent",
        "belief",
        "a",
        "b",
        "according",
        "l_",
        "presumably",
        "hence",
        "l_",
        "conducive",
        "epistemic",
        "aim",
        "follows",
        "whenever",
        "two",
        "putatively",
        "equally",
        "correct",
        "logic",
        "l_",
        "l_",
        "l_",
        "proper",
        "subsystem",
        "l_",
        "one",
        "would",
        "appear",
        "reason",
        "opt",
        "l_",
        "since",
        "conducive",
        "one",
        "aim",
        "true",
        "belief",
        "case",
        "dealing",
        "two",
        "logic",
        "l_",
        "l_",
        "models_",
        "l_",
        "models_",
        "l_",
        "subrelations",
        "one",
        "another",
        "thing",
        "may",
        "complicated",
        "even",
        "case",
        "may",
        "well",
        "overarching",
        "epistemic",
        "aim",
        "norm",
        "give",
        "u",
        "reason",
        "prefer",
        "one",
        "logic",
        "another",
        "hence",
        "standpoint",
        "epistemic",
        "aim",
        "logic",
        "equally",
        "good",
        "aim",
        "consideration",
        "undermine",
        "form",
        "logical",
        "pluralism",
        "like",
        "one",
        "advanced",
        "beall",
        "restall",
        "merely",
        "point",
        "take",
        "normative",
        "dimension",
        "logic",
        "account",
        "must",
        "also",
        "reckon",
        "broader",
        "epistemic",
        "goal",
        "norm",
        "logic",
        "may",
        "thought",
        "subservient",
        "field",
        "b",
        "argues",
        "different",
        "form",
        "logical",
        "pluralism",
        "one",
        "leaf",
        "room",
        "normative",
        "conflict",
        "logical",
        "pluralism",
        "field",
        "result",
        "ambiguity",
        "notion",
        "logical",
        "consequence",
        "rather",
        "source",
        "nonfactualism",
        "epistemic",
        "norm",
        "nonfactualism",
        "turn",
        "fueled",
        "partly",
        "general",
        "concern",
        "partly",
        "nature",
        "choose",
        "norm",
        "among",
        "general",
        "concern",
        "field",
        "c",
        "mention",
        "humestyle",
        "worry",
        "impossibility",
        "integrating",
        "irreducible",
        "normative",
        "fact",
        "naturalistic",
        "world",
        "view",
        "benacerrafstyle",
        "worry",
        "ability",
        "gain",
        "epistemic",
        "access",
        "fact",
        "mackiestyle",
        "worry",
        "queerness",
        "fact",
        "ie",
        "appear",
        "room",
        "within",
        "scientific",
        "picture",
        "world",
        "furthermore",
        "supposed",
        "somewhat",
        "mysterious",
        "motivational",
        "pull",
        "latter",
        "issue",
        "norm",
        "selection",
        "amount",
        "given",
        "set",
        "epistemic",
        "goal",
        "evaluate",
        "candidate",
        "norm",
        "better",
        "worse",
        "depending",
        "well",
        "promote",
        "goal",
        "according",
        "field",
        "reason",
        "assume",
        "fact",
        "matter",
        "choice",
        "logic",
        "uniquely",
        "correct",
        "one",
        "typically",
        "unique",
        "system",
        "best",
        "optimizes",
        "often",
        "competing",
        "constraint",
        "said",
        "seems",
        "sensibly",
        "engage",
        "rational",
        "debate",
        "logic",
        "adopt",
        "light",
        "various",
        "issue",
        "vagueness",
        "semantic",
        "paradox",
        "etc",
        "consequently",
        "clear",
        "sense",
        "normative",
        "conflict",
        "arise",
        "since",
        "field",
        "take",
        "essential",
        "component",
        "notion",
        "logical",
        "consequence",
        "induce",
        "norm",
        "field",
        "a",
        "b",
        "choose",
        "logic",
        "finding",
        "logical",
        "norm",
        "make",
        "sense",
        "u",
        "adopt",
        "field",
        "take",
        "fact",
        "matter",
        "set",
        "norm",
        "correct",
        "since",
        "question",
        "norm",
        "best",
        "promotes",
        "epistemic",
        "end",
        "often",
        "underdetermined",
        "may",
        "expect",
        "several",
        "candidate",
        "set",
        "logical",
        "norm",
        "equally",
        "wellmotivated",
        "thus",
        "left",
        "modest",
        "form",
        "logical",
        "pluralism",
        "hand",
        "type",
        "pluralism",
        "common",
        "point",
        "view",
        "question",
        "normativity",
        "logic",
        "though",
        "rejection",
        "view",
        "logical",
        "norm",
        "might",
        "impose",
        "upon",
        "u",
        "simply",
        "result",
        "correctness",
        "corresponding",
        "logical",
        "principle",
        "pluralist",
        "view",
        "stand",
        "diametrically",
        "opposed",
        "realist",
        "form",
        "monism",
        "one",
        "championed",
        "gila",
        "sher",
        "according",
        "sher",
        "logical",
        "principle",
        "grounded",
        "ultimately",
        "formal",
        "law",
        "reality",
        "formal",
        "law",
        "ultimately",
        "also",
        "ground",
        "corresponding",
        "logical",
        "norm"
    ]
}