{
    "main_text": "Mathematical Tools: Models and Proofs || The model-theoretic account of logical consequence\n3.1 The model-theoretic account of logical consequence\n\nWe have characterized logical consequence as necessary truth\npreservation in virtue of form. This idea can be explicated\nformally. One can use mathematical structures to account for the range\nof possibilities over which truth needs to be preserved. The formality\nof logical consequence can be explicated formally by giving a special\nrole to the logical vocabulary, taken as constituting the forms of\nsentences. Let us see how model theory attends to both these\ntasks.\n\nThe model-centered approach to logical consequence takes the\nvalidity of an argument to be absence of counterexample. A\ncounterexample to an argument is, in general, some way of\nmanifesting the manner in which the premises of the argument\nfail to lead to a conclusion. One way to do this is to\nprovide an argument of the same form for which the premises are\nclearly true and the conclusion is clearly false. Another way to do\nthis is to provide a circumstance in which the premises are\ntrue and the conclusion is false. In the contemporary literature, the\nintuitive idea of a counterexample is developed into a theory of\nmodels.\n\nThe exact structure of a model will depend on the kind of language at\nhand (extensional/intensional, first/higher-order, etc.). A model for\nan extensional first order language consists of a non-empty set which\nconstitutes the domain, and an interpretation\nfunction, which assigns to each nonlogical term an extension over\nthe domain—any extension agreeing with its semantic type\n(individual constants are assigned elements of the domain, function\nsymbols are assigned functions from the domain to itself, one-place\nfirst-order predicates are assigned subsets of the domain, etc.).\n\nThe contemporary model-theoretic definition of logical consequence\ntraces back to Tarski (1936). It builds on the definition of truth\nin a model given by Tarski in (1935). Tarski defines a true\nsentence in a model recursively, by giving truth (or\nsatisfaction) conditions on the logical vocabulary. A conjunction, for\nexample, is true in a model if and only if both conjuncts are true in\nthat model. A universally quantified sentence \\(\\forall xFx\\) is\ntrue in a model if and only if each instance is true in the model.\n(Or, on the Tarskian account of satisfaction, if and only if the open\nsentence \\(Fx\\) is satisfied by every object in the domain of the\nmodel. For detail on how this is accomplished, see the entry on\n Tarski’s truth definitions.)\n Now we can define logical consequence as preservation of truth over\nmodels: an argument is valid if in any model in which the\npremises are true (or in any interpretation of the premises\naccording to which they are true), the conclusion is true too.\n\nThe model-theoretic definition is one of the most successful\nmathematical explications of a philosophical concept to date. It\npromises to capture both the necessity of logical consequence—by\nlooking at truth over all models, and the formality of logical\nconsequence—by varying the interpretations of the nonlogical\nvocabulary across models: an argument is valid no matter what the\nnonlogical vocabulary means. Yet, models are just sets, which are\nmerely mathematical objects. How do they account for the range of\npossibilities, or circumstances required? John Etchemendy (1990)\noffers two perspectives for understanding models. On the\nrepresentational approach, each model is taken to represent a\npossible world. If an argument preserves truth over models, we are\nthen guaranteed that it preserves truth over possible worlds, and if\nwe accept the identification of necessity with truth in all possible\nworlds, we have the necessary truth preservation of logical\nconsequence. The problem with this approach is that it identifies\nlogical consequence with metaphysical consequence, and it gives no\naccount of the formality of logical consequence. On the\nrepresentational approach, there is no basis for a distinction between\nthe logical and the nonlogical vocabulary, and there is no explanation\nof why the interpretations of the nonlogical vocabulary are maximally\nvaried. The second perspective on models is afforded by the\ninterpretational approach, by which each model assigns\nextensions to the nonlogical vocabulary from the actual world: what\nvaries between models is not the world depicted but the meaning of the\nterms. Here, the worry is that necessity isn’t captured. For\ninstance, on the usual division of the vocabulary into logical and\nnonlogical, identity is considered a logical term, and can be used to\nform statements about the cardinality of the domain (e.g.,\n‘‘there are at least two things’’) which are\ntrue under every reinterpretation, but perhaps are not necessarily\ntrue. On this approach, there is no basis for considering models with\ndomains other than the universe of what actually exists, and\nspecifically, there is no explanation of model theory’s use of\ndomains of different sizes. Each approach, as described here, is\nflawed with respect to our analysis of logical consequence as\nnecessary and formal. The interpretational approach, by looking only\nat the actual world fails to account for necessity, and the\nrepresentational approach fails to account for formality (for details,\nsee Etchemendy 1990, Sher 1996, and Shapiro 1998, and for refinements\nsee Etchemendy 2008). A possible response to Etchemendy would be to\nblend the representational and the interpretational perspectives,\nviewing each model as representing a possible world under a\nre-interpretation of the nonlogical vocabulary (Shapiro 1998, see also\nSher 1996 and Hanson 1997 for alternative responses).\n\nOne of the main challenges set by the model-theoretic definition of\nlogical consequence is to distinguish between the logical and the\nnonlogical vocabulary. The logical vocabulary is defined in all models\nby the recursive clauses (such as those mentioned above for\nconjunction and the universal quantifier), and in that sense its\nmeaning is fixed. The choice of the logical vocabulary determines the\nclass of models considered when evaluating validity, and thus it\ndetermines the class of the logically valid arguments. Now, while each\nformal language is typically defined with a choice of a logical\nvocabulary, one can ask for a more principled characterization of\nlogical vocabulary. Tarski left the question of a principled\ndistinction open in his 1936, and only gave the lines of a\nrelativistic stance, by which different choices of the logical\nvocabulary may be admissible. Others have proposed criteria for\nlogicality, demanding that logical constants be appropriately formal,\ngeneral or topic neutral (for references and details, see the entry on\n logical constants).\n Note that a choice of the logical vocabulary is a special case of\nsetting constraints on the class of models to be used. It has been\nsuggested that the focus on criteria for the logical vocabulary misses\nthis point, and that more generally the question is which semantic\nconstraints should be adopted, limiting the admissible\nmodels for a language (Sagi 2014a, Zinke 2017). \n\nAnother challenge faced by the model-theoretic account is due to the\nlimitations of its set-theoretic basis. Recall that models are sets.\nThe worry is that truth-preservation over models might not guarantee\nnecessary truth preservation—moreover, it might not even\nguarantee material truth preservation (truth preservation in the\nactual world). The reason is that each model domain is a set, but the\nactual world presumably contains all sets, and as a collection which\nincludes all sets is too ‘‘large’’ to be a set\n(it constitutes a proper class), the actual world is not\naccounted for by any model (see Shapiro 1987).\n\nOne way of dealing with this worry is to employ external means, such\nas proof theory, in support of the model-theoretic definition. This is\ndone by Georg Kreisel in his “squeezing argument”, which\nwe present in section 3.3. Kreisel’s argument crucially depends\non the language in question having a sound and complete proof system.\nAnother option is to use set-theoretic reflection principles.\nGenerally speaking, reflection principles state that whatever is true\nof the universe of sets, is already true in an initial segment thereof\n(which is always a set). If reflection principles are accepted, then\nat least as concerns the relevant language, one can argue that an\nargument is valid if and only if there is no counter set-model (see\nKreisel 1967, Shapiro 1987, Kennedy & Väänänen\n2017).\n\nFinally, the explanation of logical consequence in terms of truth in\nmodels is typically preferred by “Realists”, who take\ntruth of sentences to be independent of what can be known. Explaining\nlogical consequence in terms of truth in models is rather close to\nexplaining logical consequence in terms of truth, and the\nanalysis of truth-in-a-model is sometimes taken to be an explication\nof truth in terms of correspondence, a typically Realist notion. Some,\nhowever, view logical consequence as having an indispensable epistemic\ncomponent, having to do with the way we establish the conclusion on\nthe basis of the premises. “Anti-realists”, who eschew\ntaking truth (or at least, correspondence-truth) as an explanatory\nnotion, will typically prefer explaining logical consequence in terms\nof proof—to which we turn next.\n",
    "section_title": "3.1 The model-theoretic account of logical consequence",
    "entry_title": "Logical Consequence",
    "hierarchy_title": "Logical Consequence || Mathematical Tools: Models and Proofs || The model-theoretic account of logical consequence",
    "tokenized_text": [
        "mathematical",
        "tool",
        "model",
        "proof",
        "modeltheoretic",
        "account",
        "logical",
        "consequence",
        "modeltheoretic",
        "account",
        "logical",
        "consequence",
        "characterized",
        "logical",
        "consequence",
        "necessary",
        "truth",
        "preservation",
        "virtue",
        "form",
        "idea",
        "explicated",
        "formally",
        "one",
        "use",
        "mathematical",
        "structure",
        "account",
        "range",
        "possibility",
        "truth",
        "need",
        "preserved",
        "formality",
        "logical",
        "consequence",
        "explicated",
        "formally",
        "giving",
        "special",
        "role",
        "logical",
        "vocabulary",
        "taken",
        "constituting",
        "form",
        "sentence",
        "let",
        "u",
        "see",
        "model",
        "theory",
        "attends",
        "task",
        "modelcentered",
        "approach",
        "logical",
        "consequence",
        "take",
        "validity",
        "argument",
        "absence",
        "counterexample",
        "counterexample",
        "argument",
        "general",
        "way",
        "manifesting",
        "manner",
        "premise",
        "argument",
        "fail",
        "lead",
        "conclusion",
        "one",
        "way",
        "provide",
        "argument",
        "form",
        "premise",
        "clearly",
        "true",
        "conclusion",
        "clearly",
        "false",
        "another",
        "way",
        "provide",
        "circumstance",
        "premise",
        "true",
        "conclusion",
        "false",
        "contemporary",
        "literature",
        "intuitive",
        "idea",
        "counterexample",
        "developed",
        "theory",
        "model",
        "exact",
        "structure",
        "model",
        "depend",
        "kind",
        "language",
        "hand",
        "extensionalintensional",
        "firsthigherorder",
        "etc",
        "model",
        "extensional",
        "first",
        "order",
        "language",
        "consists",
        "nonempty",
        "set",
        "constitutes",
        "domain",
        "interpretation",
        "function",
        "assigns",
        "nonlogical",
        "term",
        "extension",
        "domainany",
        "extension",
        "agreeing",
        "semantic",
        "type",
        "individual",
        "constant",
        "assigned",
        "element",
        "domain",
        "function",
        "symbol",
        "assigned",
        "function",
        "domain",
        "oneplace",
        "firstorder",
        "predicate",
        "assigned",
        "subset",
        "domain",
        "etc",
        "contemporary",
        "modeltheoretic",
        "definition",
        "logical",
        "consequence",
        "trace",
        "back",
        "tarski",
        "build",
        "definition",
        "truth",
        "model",
        "given",
        "tarski",
        "tarski",
        "defines",
        "true",
        "sentence",
        "model",
        "recursively",
        "giving",
        "truth",
        "satisfaction",
        "condition",
        "logical",
        "vocabulary",
        "conjunction",
        "example",
        "true",
        "model",
        "conjuncts",
        "true",
        "model",
        "universally",
        "quantified",
        "sentence",
        "forall",
        "xfx",
        "true",
        "model",
        "instance",
        "true",
        "model",
        "tarskian",
        "account",
        "satisfaction",
        "open",
        "sentence",
        "fx",
        "satisfied",
        "every",
        "object",
        "domain",
        "model",
        "detail",
        "accomplished",
        "see",
        "entry",
        "tarski",
        "truth",
        "definition",
        "define",
        "logical",
        "consequence",
        "preservation",
        "truth",
        "model",
        "argument",
        "valid",
        "model",
        "premise",
        "true",
        "interpretation",
        "premise",
        "according",
        "true",
        "conclusion",
        "true",
        "modeltheoretic",
        "definition",
        "one",
        "successful",
        "mathematical",
        "explication",
        "philosophical",
        "concept",
        "date",
        "promise",
        "capture",
        "necessity",
        "logical",
        "consequenceby",
        "looking",
        "truth",
        "model",
        "formality",
        "logical",
        "consequenceby",
        "varying",
        "interpretation",
        "nonlogical",
        "vocabulary",
        "across",
        "model",
        "argument",
        "valid",
        "matter",
        "nonlogical",
        "vocabulary",
        "mean",
        "yet",
        "model",
        "set",
        "merely",
        "mathematical",
        "object",
        "account",
        "range",
        "possibility",
        "circumstance",
        "required",
        "john",
        "etchemendy",
        "offer",
        "two",
        "perspective",
        "understanding",
        "model",
        "representational",
        "approach",
        "model",
        "taken",
        "represent",
        "possible",
        "world",
        "argument",
        "preserve",
        "truth",
        "model",
        "guaranteed",
        "preserve",
        "truth",
        "possible",
        "world",
        "accept",
        "identification",
        "necessity",
        "truth",
        "possible",
        "world",
        "necessary",
        "truth",
        "preservation",
        "logical",
        "consequence",
        "problem",
        "approach",
        "identifies",
        "logical",
        "consequence",
        "metaphysical",
        "consequence",
        "give",
        "account",
        "formality",
        "logical",
        "consequence",
        "representational",
        "approach",
        "basis",
        "distinction",
        "logical",
        "nonlogical",
        "vocabulary",
        "explanation",
        "interpretation",
        "nonlogical",
        "vocabulary",
        "maximally",
        "varied",
        "second",
        "perspective",
        "model",
        "afforded",
        "interpretational",
        "approach",
        "model",
        "assigns",
        "extension",
        "nonlogical",
        "vocabulary",
        "actual",
        "world",
        "varies",
        "model",
        "world",
        "depicted",
        "meaning",
        "term",
        "worry",
        "necessity",
        "captured",
        "instance",
        "usual",
        "division",
        "vocabulary",
        "logical",
        "nonlogical",
        "identity",
        "considered",
        "logical",
        "term",
        "used",
        "form",
        "statement",
        "cardinality",
        "domain",
        "eg",
        "least",
        "two",
        "thing",
        "true",
        "every",
        "reinterpretation",
        "perhaps",
        "necessarily",
        "true",
        "approach",
        "basis",
        "considering",
        "model",
        "domain",
        "universe",
        "actually",
        "exists",
        "specifically",
        "explanation",
        "model",
        "theory",
        "use",
        "domain",
        "different",
        "size",
        "approach",
        "described",
        "flawed",
        "respect",
        "analysis",
        "logical",
        "consequence",
        "necessary",
        "formal",
        "interpretational",
        "approach",
        "looking",
        "actual",
        "world",
        "fails",
        "account",
        "necessity",
        "representational",
        "approach",
        "fails",
        "account",
        "formality",
        "detail",
        "see",
        "etchemendy",
        "sher",
        "shapiro",
        "refinement",
        "see",
        "etchemendy",
        "possible",
        "response",
        "etchemendy",
        "would",
        "blend",
        "representational",
        "interpretational",
        "perspective",
        "viewing",
        "model",
        "representing",
        "possible",
        "world",
        "reinterpretation",
        "nonlogical",
        "vocabulary",
        "shapiro",
        "see",
        "also",
        "sher",
        "hanson",
        "alternative",
        "response",
        "one",
        "main",
        "challenge",
        "set",
        "modeltheoretic",
        "definition",
        "logical",
        "consequence",
        "distinguish",
        "logical",
        "nonlogical",
        "vocabulary",
        "logical",
        "vocabulary",
        "defined",
        "model",
        "recursive",
        "clause",
        "mentioned",
        "conjunction",
        "universal",
        "quantifier",
        "sense",
        "meaning",
        "fixed",
        "choice",
        "logical",
        "vocabulary",
        "determines",
        "class",
        "model",
        "considered",
        "evaluating",
        "validity",
        "thus",
        "determines",
        "class",
        "logically",
        "valid",
        "argument",
        "formal",
        "language",
        "typically",
        "defined",
        "choice",
        "logical",
        "vocabulary",
        "one",
        "ask",
        "principled",
        "characterization",
        "logical",
        "vocabulary",
        "tarski",
        "left",
        "question",
        "principled",
        "distinction",
        "open",
        "gave",
        "line",
        "relativistic",
        "stance",
        "different",
        "choice",
        "logical",
        "vocabulary",
        "may",
        "admissible",
        "others",
        "proposed",
        "criterion",
        "logicality",
        "demanding",
        "logical",
        "constant",
        "appropriately",
        "formal",
        "general",
        "topic",
        "neutral",
        "reference",
        "detail",
        "see",
        "entry",
        "logical",
        "constant",
        "note",
        "choice",
        "logical",
        "vocabulary",
        "special",
        "case",
        "setting",
        "constraint",
        "class",
        "model",
        "used",
        "suggested",
        "focus",
        "criterion",
        "logical",
        "vocabulary",
        "miss",
        "point",
        "generally",
        "question",
        "semantic",
        "constraint",
        "adopted",
        "limiting",
        "admissible",
        "model",
        "language",
        "sagi",
        "a",
        "zinke",
        "another",
        "challenge",
        "faced",
        "modeltheoretic",
        "account",
        "due",
        "limitation",
        "settheoretic",
        "basis",
        "recall",
        "model",
        "set",
        "worry",
        "truthpreservation",
        "model",
        "might",
        "guarantee",
        "necessary",
        "truth",
        "preservationmoreover",
        "might",
        "even",
        "guarantee",
        "material",
        "truth",
        "preservation",
        "truth",
        "preservation",
        "actual",
        "world",
        "reason",
        "model",
        "domain",
        "set",
        "actual",
        "world",
        "presumably",
        "contains",
        "set",
        "collection",
        "includes",
        "set",
        "large",
        "set",
        "constitutes",
        "proper",
        "class",
        "actual",
        "world",
        "accounted",
        "model",
        "see",
        "shapiro",
        "one",
        "way",
        "dealing",
        "worry",
        "employ",
        "external",
        "mean",
        "proof",
        "theory",
        "support",
        "modeltheoretic",
        "definition",
        "done",
        "georg",
        "kreisel",
        "squeezing",
        "argument",
        "present",
        "section",
        "kreisel",
        "argument",
        "crucially",
        "depends",
        "language",
        "question",
        "sound",
        "complete",
        "proof",
        "system",
        "another",
        "option",
        "use",
        "settheoretic",
        "reflection",
        "principle",
        "generally",
        "speaking",
        "reflection",
        "principle",
        "state",
        "whatever",
        "true",
        "universe",
        "set",
        "already",
        "true",
        "initial",
        "segment",
        "thereof",
        "always",
        "set",
        "reflection",
        "principle",
        "accepted",
        "least",
        "concern",
        "relevant",
        "language",
        "one",
        "argue",
        "argument",
        "valid",
        "counter",
        "setmodel",
        "see",
        "kreisel",
        "shapiro",
        "kennedy",
        "väänänen",
        "finally",
        "explanation",
        "logical",
        "consequence",
        "term",
        "truth",
        "model",
        "typically",
        "preferred",
        "realist",
        "take",
        "truth",
        "sentence",
        "independent",
        "known",
        "explaining",
        "logical",
        "consequence",
        "term",
        "truth",
        "model",
        "rather",
        "close",
        "explaining",
        "logical",
        "consequence",
        "term",
        "truth",
        "analysis",
        "truthinamodel",
        "sometimes",
        "taken",
        "explication",
        "truth",
        "term",
        "correspondence",
        "typically",
        "realist",
        "notion",
        "however",
        "view",
        "logical",
        "consequence",
        "indispensable",
        "epistemic",
        "component",
        "way",
        "establish",
        "conclusion",
        "basis",
        "premise",
        "antirealists",
        "eschew",
        "taking",
        "truth",
        "least",
        "correspondencetruth",
        "explanatory",
        "notion",
        "typically",
        "prefer",
        "explaining",
        "logical",
        "consequence",
        "term",
        "proofto",
        "turn",
        "next"
    ]
}