{
    "main_text": "Moral Philosophy\n4. Moral Philosophy\n\nThe same critical spirit also infuses Valla’s work on moral\nphilosophy. In his dialogue, published as De voluptate in\n1431, when he was still in his mid-twenties, and revised two years\nlater under the title De vero bono (On the True\nGood), Valla presents a discussion between an\n“Epicurean,” a “Stoic,” and a\n“Christian” on an age-old question: what is the highest\nethical good? The result of this confrontation between pagan and\nChristian moral thought is a combination of Pauline fideism and\nEpicurean hedonism, in which the Christian concepts of charity and\nbeatitude are identified with hedonist pleasure, and the\n“Stoic” concept of virtue is rejected (Valla, De vero\nfalsoque bono). Valla thus treats Epicureanism as a\nstepping-stone to the development of a Christian morality based on the\nconcept of pleasure, and repudiates the traditional synthesis of\nStoicism and Christianity, popular among scholastics and humanists\nalike. The substance of the dialogue is repeated in a long chapter in\nhis Repastinatio (Repastinatio, 1:73–98;\n2:411–418; DD 1:130–75).\n\nValla’s strategy is to reduce the traditional four\nvirtues— prudence, justice, fortitude, and propriety (or\ntemperance)—to fortitude, and then to equate fortitude with\ncharity and love. For Valla, fortitude is the essential virtue, since\nit shows that we do not allow ourselves to be conquered by the wrong\nemotions, but instead to act for the good. As a true virtue of action,\nit is closely connected to justice and is defined as “a certain\nresistance against both the harsh and the pleasant things which\nprudence has declared to be evils.” It is the power to tolerate\nand suffer adversity and bad luck, but also to resist the\nblandishments of a fortune which can be all too good, thus weakening\nthe spirit. Fortitude is the only true virtue, because virtue resides\nin the will, since our actions, to which we assign moral\nqualifications, proceed from the will.\n\nValla’s reductive strategy has a clear aim: to equate this\nessential virtue of action, fortitude, with the biblical concept of\nlove and charity. This step requires some hermeneutic manipulation,\nbut the Stoic overtones of Cicero’s account in De\nofficiis have prepared the way for it—ironically, perhaps,\nin view of Valla’s professed hostility towards\nStoicism—since enduring hardship with Stoic patience is easily\nlinked to the Pauline message that we become strong by being tested\n(II Cor. 12:10, quoted by Valla). The labor, sweat, and trouble we\nmust bear, though bad in themselves, “are called good because\nthey lead to that victory,” Valla writes, echoing St Paul\n(Repastinatio, 1:88–89; 2:415; DD 1:156). We\ndo not, then, strive to attain virtue for its own sake, since it is\nfull of toil and hardship, but rather because it leads us to our goal.\nThis is one of Valla’s major claims against the Stoics and the\nPeripatetics, who—at least in Valla’s\ninterpretation— regarded virtue as the end of life, that is, the\ngoal which is sought for its own sake. Because virtuous behavior is\ndifficult, requiring us to put up with harsh and bitter afflictions,\nno one naturally and voluntarily seeks virtue as an end in itself.\nWhat we seek is pleasure or delectation, both in this life\nand—far more importantly —in the life to come.\n\nBy equating pleasure with love, Valla can argue that it is love or\npleasure that is our ultimate end. This entails the striking notion\nthat God is not loved for his own sake, but for the sake of love:\n“For nothing is loved for its own sake or for the sake of\nsomething else as another end, but the love itself is the end”\n(Repastinatio, 2:417). This is a daring move. Traditionally,\nGod was said to be loved for his own sake, not for his usefulness in\ngaining something else. Many thinkers agreed with Augustine that\nconcupiscent love was to be distinguished from friendship, and, with\nrespect to heavenly beatitude, use from fruition. We can love\nsomething as a means to an end (use), and we can love something for\nits own sake (fruition). But because Valla has maintained that\npleasure is our highest good, God can only be loved as a means to that\nend.\n\nIt is therefore a moot point whether Valla successfully integrated\nEpicurean hedonism with Christian morality. He seems to argue that the\nEpicurean position is valid only for the period before the coming of\nChrist. In our unredeemed state, we are rightly regarded as\npleasure-seeking animals, governed by self-interest and utilitarian\nmotives. After Christ’s coming, however, we have a different\npicture: repudiating Epicurean pleasure, we should choose the harsh\nand difficult life of Christian honestas (virtue) as a step\ntowards heavenly beatitude. Yet, the two views of human beings are not\nso readily combined. On the one hand, there is the positive evaluation\nof pleasure as the fundamental principle in human\npsychology—which is confirmed and underscored by the\nterminological equation of voluptas (pleasure),\nbeatitudo (beatitude), fruitio (fruition),\ndelectatio (delectation), and amor (love). On the\nother hand, Valla states apodictically that there are two pleasures:\nan earthly one, which is the mother of vice, and a heavenly one, which\nis the mother of virtue; that we should abstain from the former if we\nwant to enjoy the latter; and that the natural, pre-Christian life is\n“empty and worthy of punishment” if not put in the wider\nperspective of human destiny. In other words, we are commanded to live\nthe arduous and difficult life of Christian honestas, ruled\nby restraint, self-denial, and propriety (temperance), and, at the\nsame time, to live a hedonist life, which consists of the joyful,\nfree, and natural gratification of the senses.\n\nAnother of his targets is the Aristotelian account of virtue as a mean\nbetween two extremes. According to Valla, each individual vice is\ninstead the opposite of an individual virtue. He makes this point by\ndistinguishing between two different senses of the same virtue,\nshowing that they have different opposites. So, while Aristotle\nregards fortitude as the mean between the vices of rashness and\ncowardice, Valla argues that there are two aspects to fortitude:\nfighting bravely and being cautious (for instance, in yielding to the\nvictorious enemy), with cowardice and rashness as their respective\nopposites. Likewise, generosity is not the mean between avarice and\nprodigality, but has two aspects: giving and not giving. Prodigality\nis the opposite of the first aspect, avarice of the second, for which\nwe should use the term frugality or thrift rather than generosity.\nMore generally, the terminology of vices as defects and excesses and\nvirtue as a mean is misleading; virtues and vices should not be ranked\n“according to whether they are at the bottom, or halfway up, or\nat the top.” Interestingly, a similar critique of\nAristotle’s notion of virtue as a mean between two extremes has\nbeen raised in modern scholarship (for example, by W. D. Ross).\n\nValla regards the Aristotelian notion of virtue as too static and\ninflexible, so that it does not do justice to the impulsive nature of\nour moral behavior. For him, virtue is not a habit, as Aristotle\nbelieved, but rather an affect, an emotion or feeling that can be\nacquired and lost in a moment’s time. Virtue is the domain\nsolely of the will. The greatest virtue or the worse vice may arise\nout of one single act. And because virtue is painful and vice\ntempting, one may easily slide from the one into the other, unlike\nknowledge, which does not turn into ignorance all of a sudden. Valla\ntherefore frequently removes the notions of knowledge, truth, and\nprudence from the sphere of moral action. Virtues as affects are\nlocated in the rear part of the soul, the will, while the domains of\nknowledge, truth, and opinion reside in the other two faculties,\nmemory and reason (Repastinatio, 1:73–74; DD\n1:130). This is not to say that the will is independent from the\nintellectual capacities. The affects need reason as their guide, and\nthe lack of such guidance can result in vice. But Valla is not\nentirely clear as to what element we should assign the moral\nqualification “good” or “bad.” He identifies\nvirtues with affects, and says that only these merit praise and blame\n(Repastinatio, 1:74; DD 1:130–32); however, he also\nwrites that the virtues, as affects, cannot be called good or bad in\nthemselves, but that these judgments apply only to the will, that is,\nto the will’s choice. This is underlined by his remark that\nvirtue resides in the will rather than in an action\n(Repastinatio, 1:77; DD 1:136). In his discussion of\nthe soul, however, he frequently calls reason the will’s guide\n(e.g., Valla Repastinatio, 1:75; DD 1:132), and also\nsays that the affects should follow reason, so that it, too, may be\nheld responsible, in the final analysis, for moral behavior (even\nthough he also explicitly denies that the will is determined by\nreason). Finally, pleasure, delectation, or beatitude are also called\nvirtue by the equation of virtue with love and with charity\n(Repastinatio, 1:85; DD 1:150–52).\n\nMoreover, Valla’s insistence on the will as the locus of moral\nbehavior seems compromised by the predestinarianism advocated by the\ninterlocutor “Lorenzo” in his dialogue De libero\narbitrio (On Free Will). In this highly rhetorical work,\nValla—if we can assume that Lorenzo represents Valla’s own\nposition—stresses that in his inscrutable wisdom God hardens the\nhearts of some, while saving those of others. We do not know why, and\nit is presumptuous and vain to inquire into the matter. Yet, somehow\nwe do have free will, “Now, indeed, He brings no necessity, and\nHis hardening one and showing another mercy does not deprive us of\nfree will, since He does this most wisely and in full holiness”\n(Valla 1948, 177). So, we are free, after all, and God’s\nforeknowledge does not necessitate the future; but how exactly Valla\nthinks his views settle these issues is not clear. His fideistic point\nis that we humans cannot settle the issue; ‘the cause of the\ndivine will which hardens one and shows mercy to another is known\nneither to man nor to angels’. Yet, in spite of his fideism and\nanti-intellectualism, his own discussion of God and free will, as well\nas his account of the Trinity in the Repastinatio, makes\nsubstantive claims about what God is.\n\nIn conclusion, Valla’s moral thought can be described—with\nsome justice—as hedonistic, voluntarist, and perhaps also\nempirical (in the sense of taking account of how people actually\nbehave). On closer inspection, however, his account seems to contain\nthe seeds of several ideas that are not so easily reconciled with one\nanother. This is doubtless due, in no small measure, to his\neclecticism, his attempt to bring into one picture Aristotelian\nethics, the Stoic virtues of Cicero, the biblical concepts of charity\nand beatitude, and the Epicurean notion of hedonist pleasure—\neach with its own distinctive terminology, definitions, and\nphilosophical context.\n",
    "section_title": "4. Moral Philosophy",
    "entry_title": "Lorenzo Valla",
    "hierarchy_title": "Lorenzo Valla || Moral Philosophy",
    "tokenized_text": [
        "moral",
        "philosophy",
        "moral",
        "philosophy",
        "critical",
        "spirit",
        "also",
        "infuses",
        "valla",
        "work",
        "moral",
        "philosophy",
        "dialogue",
        "published",
        "de",
        "voluptate",
        "still",
        "midtwenties",
        "revised",
        "two",
        "year",
        "later",
        "title",
        "de",
        "vero",
        "bono",
        "true",
        "good",
        "valla",
        "present",
        "discussion",
        "epicurean",
        "stoic",
        "christian",
        "ageold",
        "question",
        "highest",
        "ethical",
        "good",
        "result",
        "confrontation",
        "pagan",
        "christian",
        "moral",
        "thought",
        "combination",
        "pauline",
        "fideism",
        "epicurean",
        "hedonism",
        "christian",
        "concept",
        "charity",
        "beatitude",
        "identified",
        "hedonist",
        "pleasure",
        "stoic",
        "concept",
        "virtue",
        "rejected",
        "valla",
        "de",
        "vero",
        "falsoque",
        "bono",
        "valla",
        "thus",
        "treat",
        "epicureanism",
        "steppingstone",
        "development",
        "christian",
        "morality",
        "based",
        "concept",
        "pleasure",
        "repudiates",
        "traditional",
        "synthesis",
        "stoicism",
        "christianity",
        "popular",
        "among",
        "scholastic",
        "humanist",
        "alike",
        "substance",
        "dialogue",
        "repeated",
        "long",
        "chapter",
        "repastinatio",
        "repastinatio",
        "dd",
        "valla",
        "strategy",
        "reduce",
        "traditional",
        "four",
        "virtues",
        "prudence",
        "justice",
        "fortitude",
        "propriety",
        "temperance",
        "to",
        "fortitude",
        "equate",
        "fortitude",
        "charity",
        "love",
        "valla",
        "fortitude",
        "essential",
        "virtue",
        "since",
        "show",
        "allow",
        "conquered",
        "wrong",
        "emotion",
        "instead",
        "act",
        "good",
        "true",
        "virtue",
        "action",
        "closely",
        "connected",
        "justice",
        "defined",
        "certain",
        "resistance",
        "harsh",
        "pleasant",
        "thing",
        "prudence",
        "declared",
        "evils",
        "power",
        "tolerate",
        "suffer",
        "adversity",
        "bad",
        "luck",
        "also",
        "resist",
        "blandishment",
        "fortune",
        "good",
        "thus",
        "weakening",
        "spirit",
        "fortitude",
        "true",
        "virtue",
        "virtue",
        "resides",
        "since",
        "action",
        "assign",
        "moral",
        "qualification",
        "proceed",
        "valla",
        "reductive",
        "strategy",
        "clear",
        "aim",
        "equate",
        "essential",
        "virtue",
        "action",
        "fortitude",
        "biblical",
        "concept",
        "love",
        "charity",
        "step",
        "requires",
        "hermeneutic",
        "manipulation",
        "stoic",
        "overtone",
        "cicero",
        "account",
        "de",
        "officiis",
        "prepared",
        "way",
        "itironically",
        "perhaps",
        "view",
        "valla",
        "professed",
        "hostility",
        "towards",
        "stoicismsince",
        "enduring",
        "hardship",
        "stoic",
        "patience",
        "easily",
        "linked",
        "pauline",
        "message",
        "become",
        "strong",
        "tested",
        "ii",
        "cor",
        "quoted",
        "valla",
        "labor",
        "sweat",
        "trouble",
        "must",
        "bear",
        "though",
        "bad",
        "called",
        "good",
        "lead",
        "victory",
        "valla",
        "writes",
        "echoing",
        "st",
        "paul",
        "repastinatio",
        "dd",
        "strive",
        "attain",
        "virtue",
        "sake",
        "since",
        "full",
        "toil",
        "hardship",
        "rather",
        "lead",
        "u",
        "goal",
        "one",
        "valla",
        "major",
        "claim",
        "stoic",
        "peripatetic",
        "whoat",
        "least",
        "valla",
        "interpretation",
        "regarded",
        "virtue",
        "end",
        "life",
        "goal",
        "sought",
        "sake",
        "virtuous",
        "behavior",
        "difficult",
        "requiring",
        "u",
        "put",
        "harsh",
        "bitter",
        "affliction",
        "one",
        "naturally",
        "voluntarily",
        "seek",
        "virtue",
        "end",
        "seek",
        "pleasure",
        "delectation",
        "life",
        "andfar",
        "importantly",
        "in",
        "life",
        "come",
        "equating",
        "pleasure",
        "love",
        "valla",
        "argue",
        "love",
        "pleasure",
        "ultimate",
        "end",
        "entail",
        "striking",
        "notion",
        "god",
        "loved",
        "sake",
        "sake",
        "love",
        "nothing",
        "loved",
        "sake",
        "sake",
        "something",
        "else",
        "another",
        "end",
        "love",
        "end",
        "repastinatio",
        "daring",
        "move",
        "traditionally",
        "god",
        "said",
        "loved",
        "sake",
        "usefulness",
        "gaining",
        "something",
        "else",
        "many",
        "thinker",
        "agreed",
        "augustine",
        "concupiscent",
        "love",
        "distinguished",
        "friendship",
        "respect",
        "heavenly",
        "beatitude",
        "use",
        "fruition",
        "love",
        "something",
        "mean",
        "end",
        "use",
        "love",
        "something",
        "sake",
        "fruition",
        "valla",
        "maintained",
        "pleasure",
        "highest",
        "good",
        "god",
        "loved",
        "mean",
        "end",
        "therefore",
        "moot",
        "point",
        "whether",
        "valla",
        "successfully",
        "integrated",
        "epicurean",
        "hedonism",
        "christian",
        "morality",
        "seems",
        "argue",
        "epicurean",
        "position",
        "valid",
        "period",
        "coming",
        "christ",
        "unredeemed",
        "state",
        "rightly",
        "regarded",
        "pleasureseeking",
        "animal",
        "governed",
        "selfinterest",
        "utilitarian",
        "motif",
        "christ",
        "coming",
        "however",
        "different",
        "picture",
        "repudiating",
        "epicurean",
        "pleasure",
        "choose",
        "harsh",
        "difficult",
        "life",
        "christian",
        "honestas",
        "virtue",
        "step",
        "towards",
        "heavenly",
        "beatitude",
        "yet",
        "two",
        "view",
        "human",
        "being",
        "readily",
        "combined",
        "one",
        "hand",
        "positive",
        "evaluation",
        "pleasure",
        "fundamental",
        "principle",
        "human",
        "psychologywhich",
        "confirmed",
        "underscored",
        "terminological",
        "equation",
        "voluptas",
        "pleasure",
        "beatitudo",
        "beatitude",
        "fruitio",
        "fruition",
        "delectatio",
        "delectation",
        "amor",
        "love",
        "hand",
        "valla",
        "state",
        "apodictically",
        "two",
        "pleasure",
        "earthly",
        "one",
        "mother",
        "vice",
        "heavenly",
        "one",
        "mother",
        "virtue",
        "abstain",
        "former",
        "want",
        "enjoy",
        "latter",
        "natural",
        "prechristian",
        "life",
        "empty",
        "worthy",
        "punishment",
        "put",
        "wider",
        "perspective",
        "human",
        "destiny",
        "word",
        "commanded",
        "live",
        "arduous",
        "difficult",
        "life",
        "christian",
        "honestas",
        "ruled",
        "restraint",
        "selfdenial",
        "propriety",
        "temperance",
        "time",
        "live",
        "hedonist",
        "life",
        "consists",
        "joyful",
        "free",
        "natural",
        "gratification",
        "sens",
        "another",
        "target",
        "aristotelian",
        "account",
        "virtue",
        "mean",
        "two",
        "extreme",
        "according",
        "valla",
        "individual",
        "vice",
        "instead",
        "opposite",
        "individual",
        "virtue",
        "make",
        "point",
        "distinguishing",
        "two",
        "different",
        "sens",
        "virtue",
        "showing",
        "different",
        "opposite",
        "aristotle",
        "regard",
        "fortitude",
        "mean",
        "vice",
        "rashness",
        "cowardice",
        "valla",
        "argues",
        "two",
        "aspect",
        "fortitude",
        "fighting",
        "bravely",
        "cautious",
        "instance",
        "yielding",
        "victorious",
        "enemy",
        "cowardice",
        "rashness",
        "respective",
        "opposite",
        "likewise",
        "generosity",
        "mean",
        "avarice",
        "prodigality",
        "two",
        "aspect",
        "giving",
        "giving",
        "prodigality",
        "opposite",
        "first",
        "aspect",
        "avarice",
        "second",
        "use",
        "term",
        "frugality",
        "thrift",
        "rather",
        "generosity",
        "generally",
        "terminology",
        "vice",
        "defect",
        "excess",
        "virtue",
        "mean",
        "misleading",
        "virtue",
        "vice",
        "ranked",
        "according",
        "whether",
        "bottom",
        "halfway",
        "top",
        "interestingly",
        "similar",
        "critique",
        "aristotle",
        "notion",
        "virtue",
        "mean",
        "two",
        "extreme",
        "raised",
        "modern",
        "scholarship",
        "example",
        "w",
        "d",
        "ross",
        "valla",
        "regard",
        "aristotelian",
        "notion",
        "virtue",
        "static",
        "inflexible",
        "justice",
        "impulsive",
        "nature",
        "moral",
        "behavior",
        "virtue",
        "habit",
        "aristotle",
        "believed",
        "rather",
        "affect",
        "emotion",
        "feeling",
        "acquired",
        "lost",
        "moment",
        "time",
        "virtue",
        "domain",
        "solely",
        "greatest",
        "virtue",
        "worse",
        "vice",
        "may",
        "arise",
        "one",
        "single",
        "act",
        "virtue",
        "painful",
        "vice",
        "tempting",
        "one",
        "may",
        "easily",
        "slide",
        "one",
        "unlike",
        "knowledge",
        "turn",
        "ignorance",
        "sudden",
        "valla",
        "therefore",
        "frequently",
        "remove",
        "notion",
        "knowledge",
        "truth",
        "prudence",
        "sphere",
        "moral",
        "action",
        "virtue",
        "affect",
        "located",
        "rear",
        "part",
        "soul",
        "domain",
        "knowledge",
        "truth",
        "opinion",
        "reside",
        "two",
        "faculty",
        "memory",
        "reason",
        "repastinatio",
        "dd",
        "say",
        "independent",
        "intellectual",
        "capacity",
        "affect",
        "need",
        "reason",
        "guide",
        "lack",
        "guidance",
        "result",
        "vice",
        "valla",
        "entirely",
        "clear",
        "element",
        "assign",
        "moral",
        "qualification",
        "good",
        "bad",
        "identifies",
        "virtue",
        "affect",
        "say",
        "merit",
        "praise",
        "blame",
        "repastinatio",
        "dd",
        "however",
        "also",
        "writes",
        "virtue",
        "affect",
        "called",
        "good",
        "bad",
        "judgment",
        "apply",
        "choice",
        "underlined",
        "remark",
        "virtue",
        "resides",
        "rather",
        "action",
        "repastinatio",
        "dd",
        "discussion",
        "soul",
        "however",
        "frequently",
        "call",
        "reason",
        "guide",
        "eg",
        "valla",
        "repastinatio",
        "dd",
        "also",
        "say",
        "affect",
        "follow",
        "reason",
        "may",
        "held",
        "responsible",
        "final",
        "analysis",
        "moral",
        "behavior",
        "even",
        "though",
        "also",
        "explicitly",
        "denies",
        "determined",
        "reason",
        "finally",
        "pleasure",
        "delectation",
        "beatitude",
        "also",
        "called",
        "virtue",
        "equation",
        "virtue",
        "love",
        "charity",
        "repastinatio",
        "dd",
        "moreover",
        "valla",
        "insistence",
        "locus",
        "moral",
        "behavior",
        "seems",
        "compromised",
        "predestinarianism",
        "advocated",
        "interlocutor",
        "lorenzo",
        "dialogue",
        "de",
        "libero",
        "arbitrio",
        "free",
        "highly",
        "rhetorical",
        "work",
        "vallaif",
        "assume",
        "lorenzo",
        "represents",
        "valla",
        "positionstresses",
        "inscrutable",
        "wisdom",
        "god",
        "hardens",
        "heart",
        "saving",
        "others",
        "know",
        "presumptuous",
        "vain",
        "inquire",
        "matter",
        "yet",
        "somehow",
        "free",
        "indeed",
        "brings",
        "necessity",
        "hardening",
        "one",
        "showing",
        "another",
        "mercy",
        "deprive",
        "u",
        "free",
        "since",
        "wisely",
        "full",
        "holiness",
        "valla",
        "free",
        "god",
        "foreknowledge",
        "necessitate",
        "future",
        "exactly",
        "valla",
        "think",
        "view",
        "settle",
        "issue",
        "clear",
        "fideistic",
        "point",
        "human",
        "settle",
        "issue",
        "cause",
        "divine",
        "hardens",
        "one",
        "show",
        "mercy",
        "another",
        "known",
        "neither",
        "man",
        "angel",
        "yet",
        "spite",
        "fideism",
        "antiintellectualism",
        "discussion",
        "god",
        "free",
        "well",
        "account",
        "trinity",
        "repastinatio",
        "make",
        "substantive",
        "claim",
        "god",
        "conclusion",
        "valla",
        "moral",
        "thought",
        "describedwith",
        "justiceas",
        "hedonistic",
        "voluntarist",
        "perhaps",
        "also",
        "empirical",
        "sense",
        "taking",
        "account",
        "people",
        "actually",
        "behave",
        "closer",
        "inspection",
        "however",
        "account",
        "seems",
        "contain",
        "seed",
        "several",
        "idea",
        "easily",
        "reconciled",
        "one",
        "another",
        "doubtless",
        "due",
        "small",
        "measure",
        "eclecticism",
        "attempt",
        "bring",
        "one",
        "picture",
        "aristotelian",
        "ethic",
        "stoic",
        "virtue",
        "cicero",
        "biblical",
        "concept",
        "charity",
        "beatitude",
        "epicurean",
        "notion",
        "hedonist",
        "pleasure",
        "distinctive",
        "terminology",
        "definition",
        "philosophical",
        "context"
    ]
}