{
    "main_text": "Love as Union\n2. Love as Union\n\nThe\n union view claims that love consists in the formation of (or the\ndesire to form) some significant kind of union, a “we.” A\ncentral task for union theorists, therefore, is to spell out just what\nsuch a “we” comes to—whether it is literally a new\nentity in the world somehow composed of the lover and the beloved, or\nwhether it is merely metaphorical. Variants of this view perhaps go\nback to Aristotle (cf. Sherman 1993) and can also be found in\nMontaigne ([E]) and Hegel (1997); contemporary proponents include\nSolomon (1981, 1988), Scruton (1986), Nozick (1989), Fisher (1990),\nand Delaney (1996).\n\nScruton, writing in particular about romantic love, claims that love\nexists “just so soon as reciprocity becomes community: that is,\njust so soon as all distinction between my interests and your\ninterests is overcome” (1986, p. 230). The idea is that the\nunion is a union of concern, so that when I act out of that concern it\nis not for my sake alone or for your sake alone but for our\nsake. Fisher (1990) holds a similar, but somewhat more moderate view,\nclaiming that love is a partial fusion of the lovers’\ncares, concerns, emotional responses, and actions. What is striking\nabout both Scruton and Fisher is the claim that love requires the\nactual union of the lovers’ concerns, for it thus\nbecomes clear that they conceive of love not so much as an attitude we\ntake towards another but as a relationship: the distinction between\nyour interests and mine genuinely disappears only when we together\ncome to have shared cares, concerns, etc., and my merely having a\ncertain attitude towards you is not enough for love. This provides\ncontent to the notion of a “we” as the (metaphorical?)\nsubject of these shared cares and concerns, and as that for whose sake\nwe act.\n\nSolomon (1988) offers a union view as well, though one that tries\n“to make new sense out of ‘love’ through a literal\nrather than metaphoric sense of the ‘fusion’ of two\nsouls” (p. 24, cf. Solomon 1981; however, it is unclear exactly\nwhat he means by a “soul” here and so how love can be a\n“literal” fusion of two souls). What Solomon has in mind\nis the way in which, through love, the lovers redefine their\nidentities as persons in terms of the relationship: “Love is the\nconcentration and the intensive focus of mutual definition on a single\nindividual, subjecting virtually every personal aspect of one’s\nself to this process” (1988, p. 197). The result is that lovers\ncome to share the interests, roles, virtues, and so on that constitute\nwhat formerly was two individual identities but now has become a\nshared identity, and they do so in part by each allowing the other to\nplay an important role in defining his own identity.\n\nNozick (1989) offers a union view that differs from those of Scruton,\nFisher, and Solomon in that Nozick thinks that what is necessary for\nlove is merely the desire to form a “we,”\ntogether with the desire that your beloved reciprocates. Nonetheless,\nhe claims that this “we” is “a new entity in the\nworld…created by a new web of relationships between [the\nlovers] which makes them no longer separate” (p. 70). In\nspelling out this web of relationships, Nozick appeals to the lovers\n“pooling” not only their well-beings, in the sense that\nthe well-being of each is tied up with that of the other, but also\ntheir autonomy, in that “each transfers some previous rights to\nmake certain decisions unilaterally into a joint pool” (p. 71).\nIn addition, Nozick claims, the lovers each acquire a new identity as\na part of the “we,” a new identity constituted by their\n(a) wanting to be perceived publicly as a couple, (b) their attending\nto their pooled well-being, and (c) their accepting a “certain\nkind of division of labor” (p. 72):\n\nA person in a we might find himself coming across something\ninteresting to read yet leaving it for the other person, not because\nhe himself would not be interested in it but because the other would\nbe more interested, and one of them reading it is sufficient for it to\nbe registered by the wider identity now shared, the\n we.[3]\n\n\nOpponents of the union view have seized on claims like this as\nexcessive: union theorists, they claim, take too literally the\nontological commitments of this notion of a “we.” This\nleads to two specific criticisms of the union view. The first is that\nunion views do away with individual autonomy. Autonomy, it seems,\ninvolves a kind of independence on the part of the autonomous agent,\nsuch that she is in control over not only what she does but also who\nshe is, as this is constituted by her interests, values, concerns,\netc. However, union views, by doing away with a clear distinction\nbetween your interests and mine, thereby undermine this sort of\nindependence and so undermine the autonomy of the lovers. If autonomy\nis a part of the individual’s good, then, on the union view,\nlove is to this extent bad; so much the worse for the union view\n(Singer 1994; Soble 1997). Moreover, Singer (1994) argues that a\nnecessary part of having your beloved be the object of your love is\nrespect for your beloved as the particular person she is, and this\nrequires respecting her autonomy.\n\nUnion theorists have responded to this objection in several ways.\nNozick (1989) seems to think of a loss of autonomy in love as a\ndesirable feature of the sort of union lovers can achieve. Fisher\n(1990), somewhat more reluctantly, claims that the loss of autonomy in\nlove is an acceptable consequence of love. Yet without further\nargument these claims seem like mere bullet biting. Solomon (1988, pp.\n64ff) describes this “tension” between union and autonomy\nas “the paradox of love.” However, this a view that Soble\n(1997) derides: merely to call it a paradox, as Solomon does, is not\nto face up to the problem.\n\nThe second criticism involves a substantive view concerning love. Part\nof what it is to love someone, these opponents say, is to have concern\nfor him for his sake. However, union views make such concern\nunintelligible and eliminate the possibility of both selfishness and\nself-sacrifice, for by doing away with the distinction between my\ninterests and your interests they have in effect turned your interests\ninto mine and vice versa (Soble 1997; see also Blum 1980,\n1993). Some advocates of union views see this as a point in their\nfavor: we need to explain how it is I can have concern for people\nother than myself, and the union view apparently does this by\nunderstanding your interests to be part of my own. And Delaney,\nresponding to an apparent tension between our desire to be loved\nunselfishly (for fear of otherwise being exploited) and our desire to\nbe loved for reasons (which presumably are attractive to our lover and\nhence have a kind of selfish basis), says (1996, p. 346):\n\nGiven my view that the romantic ideal is primarily characterized by a\ndesire to achieve a profound consolidation of needs and interests\nthrough the formation of a we, I do not think a little\nselfishness of the sort described should pose a worry to either party.\n\n\nThe objection, however, lies precisely in this attempt to explain my\nconcern for my beloved egoistically. As Whiting (1991, p. 10) puts it,\nsuch an attempt “strikes me as unnecessary and potentially\nobjectionable colonization”: in love, I ought to be concerned\nwith my beloved for her sake, and not because I somehow get\nsomething out of it. (This can be true whether my concern with my\nbeloved is merely instrumental to my good or whether it is partly\nconstitutive of my good.)\n\nAlthough Whiting’s and Soble’s criticisms here succeed\nagainst the more radical advocates of the union view, they in part\nfail to acknowledge the kernel of truth to be gleaned from the idea of\nunion. Whiting’s way of formulating the second objection in\nterms of an unnecessary egoism in part points to a way out: we persons\nare in part social creatures, and love is one profound mode of that\nsociality. Indeed, part of the point of union accounts is to make\nsense of this social dimension: to make sense of a way in which we can\nsometimes identify ourselves with others not merely in becoming\ninterdependent with them (as Singer 1994, p. 165, suggests,\nunderstanding ‘interdependence’ to be a kind of reciprocal\nbenevolence and respect) but rather in making who we are as persons be\nconstituted in part by those we love (cf., e.g., Rorty 1986/1993;\nNussbaum 1990).\n\nAlong\n these lines, Friedman (1998), taking her inspiration in part from\nDelaney (1996), argues that we should understand the sort of union at\nissue in love to be a kind of federation of selves:\n\nOn the federation model, a third unified entity is constituted by the\ninteraction of the lovers, one which involves the lovers acting in\nconcert across a range of conditions and for a range of purposes. This\nconcerted action, however, does not erase the existence of the two\nlovers as separable and separate agents with continuing possibilities\nfor the exercise of their own respective agencies. [p. 165]\n\n\nGiven that on this view the lovers do not give up their individual\nidentities, there is no principled reason why the union view cannot\nmake sense of the lover’s concern for her beloved for his\n sake.[4]\n Moreover, Friedman argues, once we construe union as federation, we\ncan see that autonomy is not a zero-sum game; rather, love can both\ndirectly enhance the autonomy of each and promote the growth of\nvarious skills, like realistic and critical self-evaluation, that\nfoster autonomy.\n\nNonetheless, this federation model is not without its\nproblems—problems that affect other versions of the union view\nas well. For if the federation (or the “we”, as on\nNozick’s view) is understood as a third entity, we need a\nclearer account than has been given of its ontological status and how\nit comes to be. Relevant here is the literature on shared intention\nand plural subjects. Gilbert (1989, 1996, 2000) has argued that we\nshould take quite seriously the existence of a plural subject as an\nentity over and above its constituent members. Others, such as Tuomela\n(1984, 1995), Searle (1990), and Bratman (1999) are more cautious,\ntreating such talk of “us” having an intention as\nmetaphorical.\n",
    "section_title": "2. Love as Union",
    "entry_title": "Love",
    "hierarchy_title": "Love || Love as Union",
    "tokenized_text": [
        "love",
        "union",
        "love",
        "union",
        "union",
        "view",
        "claim",
        "love",
        "consists",
        "formation",
        "desire",
        "form",
        "significant",
        "kind",
        "union",
        "we",
        "central",
        "task",
        "union",
        "theorist",
        "therefore",
        "spell",
        "come",
        "towhether",
        "literally",
        "new",
        "entity",
        "world",
        "somehow",
        "composed",
        "lover",
        "beloved",
        "whether",
        "merely",
        "metaphorical",
        "variant",
        "view",
        "perhaps",
        "go",
        "back",
        "aristotle",
        "cf",
        "sherman",
        "also",
        "found",
        "montaigne",
        "e",
        "hegel",
        "contemporary",
        "proponent",
        "include",
        "solomon",
        "scruton",
        "nozick",
        "fisher",
        "delaney",
        "scruton",
        "writing",
        "particular",
        "romantic",
        "love",
        "claim",
        "love",
        "exists",
        "soon",
        "reciprocity",
        "becomes",
        "community",
        "soon",
        "distinction",
        "interest",
        "interest",
        "overcome",
        "p",
        "idea",
        "union",
        "union",
        "concern",
        "act",
        "concern",
        "sake",
        "alone",
        "sake",
        "alone",
        "sake",
        "fisher",
        "hold",
        "similar",
        "somewhat",
        "moderate",
        "view",
        "claiming",
        "love",
        "partial",
        "fusion",
        "lover",
        "care",
        "concern",
        "emotional",
        "response",
        "action",
        "striking",
        "scruton",
        "fisher",
        "claim",
        "love",
        "requires",
        "actual",
        "union",
        "lover",
        "concern",
        "thus",
        "becomes",
        "clear",
        "conceive",
        "love",
        "much",
        "attitude",
        "take",
        "towards",
        "another",
        "relationship",
        "distinction",
        "interest",
        "mine",
        "genuinely",
        "disappears",
        "together",
        "come",
        "shared",
        "care",
        "concern",
        "etc",
        "merely",
        "certain",
        "attitude",
        "towards",
        "enough",
        "love",
        "provides",
        "content",
        "notion",
        "metaphorical",
        "subject",
        "shared",
        "care",
        "concern",
        "whose",
        "sake",
        "act",
        "solomon",
        "offer",
        "union",
        "view",
        "well",
        "though",
        "one",
        "try",
        "make",
        "new",
        "sense",
        "love",
        "literal",
        "rather",
        "metaphoric",
        "sense",
        "fusion",
        "two",
        "soul",
        "p",
        "cf",
        "solomon",
        "however",
        "unclear",
        "exactly",
        "mean",
        "soul",
        "love",
        "literal",
        "fusion",
        "two",
        "soul",
        "solomon",
        "mind",
        "way",
        "love",
        "lover",
        "redefine",
        "identity",
        "person",
        "term",
        "relationship",
        "love",
        "concentration",
        "intensive",
        "focus",
        "mutual",
        "definition",
        "single",
        "individual",
        "subjecting",
        "virtually",
        "every",
        "personal",
        "aspect",
        "one",
        "self",
        "process",
        "p",
        "result",
        "lover",
        "come",
        "share",
        "interest",
        "role",
        "virtue",
        "constitute",
        "formerly",
        "two",
        "individual",
        "identity",
        "become",
        "shared",
        "identity",
        "part",
        "allowing",
        "play",
        "important",
        "role",
        "defining",
        "identity",
        "nozick",
        "offer",
        "union",
        "view",
        "differs",
        "scruton",
        "fisher",
        "solomon",
        "nozick",
        "think",
        "necessary",
        "love",
        "merely",
        "desire",
        "form",
        "together",
        "desire",
        "beloved",
        "reciprocates",
        "nonetheless",
        "claim",
        "new",
        "entity",
        "worldcreated",
        "new",
        "web",
        "relationship",
        "lover",
        "make",
        "longer",
        "separate",
        "p",
        "spelling",
        "web",
        "relationship",
        "nozick",
        "appeal",
        "lover",
        "pooling",
        "wellbeing",
        "sense",
        "wellbeing",
        "tied",
        "also",
        "autonomy",
        "transfer",
        "previous",
        "right",
        "make",
        "certain",
        "decision",
        "unilaterally",
        "joint",
        "pool",
        "p",
        "addition",
        "nozick",
        "claim",
        "lover",
        "acquire",
        "new",
        "identity",
        "part",
        "new",
        "identity",
        "constituted",
        "wanting",
        "perceived",
        "publicly",
        "couple",
        "b",
        "attending",
        "pooled",
        "wellbeing",
        "c",
        "accepting",
        "certain",
        "kind",
        "division",
        "labor",
        "p",
        "person",
        "might",
        "find",
        "coming",
        "across",
        "something",
        "interesting",
        "read",
        "yet",
        "leaving",
        "person",
        "would",
        "interested",
        "would",
        "interested",
        "one",
        "reading",
        "sufficient",
        "registered",
        "wider",
        "identity",
        "shared",
        "opponent",
        "union",
        "view",
        "seized",
        "claim",
        "like",
        "excessive",
        "union",
        "theorist",
        "claim",
        "take",
        "literally",
        "ontological",
        "commitment",
        "notion",
        "we",
        "lead",
        "two",
        "specific",
        "criticism",
        "union",
        "view",
        "first",
        "union",
        "view",
        "away",
        "individual",
        "autonomy",
        "autonomy",
        "seems",
        "involves",
        "kind",
        "independence",
        "part",
        "autonomous",
        "agent",
        "control",
        "also",
        "constituted",
        "interest",
        "value",
        "concern",
        "etc",
        "however",
        "union",
        "view",
        "away",
        "clear",
        "distinction",
        "interest",
        "mine",
        "thereby",
        "undermine",
        "sort",
        "independence",
        "undermine",
        "autonomy",
        "lover",
        "autonomy",
        "part",
        "individual",
        "good",
        "union",
        "view",
        "love",
        "extent",
        "bad",
        "much",
        "worse",
        "union",
        "view",
        "singer",
        "soble",
        "moreover",
        "singer",
        "argues",
        "necessary",
        "part",
        "beloved",
        "object",
        "love",
        "respect",
        "beloved",
        "particular",
        "person",
        "requires",
        "respecting",
        "autonomy",
        "union",
        "theorist",
        "responded",
        "objection",
        "several",
        "way",
        "nozick",
        "seems",
        "think",
        "loss",
        "autonomy",
        "love",
        "desirable",
        "feature",
        "sort",
        "union",
        "lover",
        "achieve",
        "fisher",
        "somewhat",
        "reluctantly",
        "claim",
        "loss",
        "autonomy",
        "love",
        "acceptable",
        "consequence",
        "love",
        "yet",
        "without",
        "argument",
        "claim",
        "seem",
        "like",
        "mere",
        "bullet",
        "biting",
        "solomon",
        "pp",
        "ff",
        "describes",
        "tension",
        "union",
        "autonomy",
        "paradox",
        "love",
        "however",
        "view",
        "soble",
        "derides",
        "merely",
        "call",
        "paradox",
        "solomon",
        "face",
        "problem",
        "second",
        "criticism",
        "involves",
        "substantive",
        "view",
        "concerning",
        "love",
        "part",
        "love",
        "someone",
        "opponent",
        "say",
        "concern",
        "sake",
        "however",
        "union",
        "view",
        "make",
        "concern",
        "unintelligible",
        "eliminate",
        "possibility",
        "selfishness",
        "selfsacrifice",
        "away",
        "distinction",
        "interest",
        "interest",
        "effect",
        "turned",
        "interest",
        "mine",
        "vice",
        "versa",
        "soble",
        "see",
        "also",
        "blum",
        "advocate",
        "union",
        "view",
        "see",
        "point",
        "favor",
        "need",
        "explain",
        "concern",
        "people",
        "union",
        "view",
        "apparently",
        "understanding",
        "interest",
        "part",
        "delaney",
        "responding",
        "apparent",
        "tension",
        "desire",
        "loved",
        "unselfishly",
        "fear",
        "otherwise",
        "exploited",
        "desire",
        "loved",
        "reason",
        "presumably",
        "attractive",
        "lover",
        "hence",
        "kind",
        "selfish",
        "basis",
        "say",
        "p",
        "given",
        "view",
        "romantic",
        "ideal",
        "primarily",
        "characterized",
        "desire",
        "achieve",
        "profound",
        "consolidation",
        "need",
        "interest",
        "formation",
        "think",
        "little",
        "selfishness",
        "sort",
        "described",
        "pose",
        "worry",
        "either",
        "party",
        "objection",
        "however",
        "lie",
        "precisely",
        "attempt",
        "explain",
        "concern",
        "beloved",
        "egoistically",
        "whiting",
        "p",
        "put",
        "attempt",
        "strike",
        "unnecessary",
        "potentially",
        "objectionable",
        "colonization",
        "love",
        "ought",
        "concerned",
        "beloved",
        "sake",
        "somehow",
        "get",
        "something",
        "true",
        "whether",
        "concern",
        "beloved",
        "merely",
        "instrumental",
        "good",
        "whether",
        "partly",
        "constitutive",
        "good",
        "although",
        "whiting",
        "soble",
        "criticism",
        "succeed",
        "radical",
        "advocate",
        "union",
        "view",
        "part",
        "fail",
        "acknowledge",
        "kernel",
        "truth",
        "gleaned",
        "idea",
        "union",
        "whiting",
        "way",
        "formulating",
        "second",
        "objection",
        "term",
        "unnecessary",
        "egoism",
        "part",
        "point",
        "way",
        "person",
        "part",
        "social",
        "creature",
        "love",
        "one",
        "profound",
        "mode",
        "sociality",
        "indeed",
        "part",
        "point",
        "union",
        "account",
        "make",
        "sense",
        "social",
        "dimension",
        "make",
        "sense",
        "way",
        "sometimes",
        "identify",
        "others",
        "merely",
        "becoming",
        "interdependent",
        "singer",
        "p",
        "suggests",
        "understanding",
        "interdependence",
        "kind",
        "reciprocal",
        "benevolence",
        "respect",
        "rather",
        "making",
        "person",
        "constituted",
        "part",
        "love",
        "cf",
        "eg",
        "rorty",
        "nussbaum",
        "along",
        "line",
        "friedman",
        "taking",
        "inspiration",
        "part",
        "delaney",
        "argues",
        "understand",
        "sort",
        "union",
        "issue",
        "love",
        "kind",
        "federation",
        "self",
        "federation",
        "model",
        "third",
        "unified",
        "entity",
        "constituted",
        "interaction",
        "lover",
        "one",
        "involves",
        "lover",
        "acting",
        "concert",
        "across",
        "range",
        "condition",
        "range",
        "purpose",
        "concerted",
        "action",
        "however",
        "erase",
        "existence",
        "two",
        "lover",
        "separable",
        "separate",
        "agent",
        "continuing",
        "possibility",
        "exercise",
        "respective",
        "agency",
        "p",
        "given",
        "view",
        "lover",
        "give",
        "individual",
        "identity",
        "principled",
        "reason",
        "union",
        "view",
        "make",
        "sense",
        "lover",
        "concern",
        "beloved",
        "sake",
        "moreover",
        "friedman",
        "argues",
        "construe",
        "union",
        "federation",
        "see",
        "autonomy",
        "zerosum",
        "game",
        "rather",
        "love",
        "directly",
        "enhance",
        "autonomy",
        "promote",
        "growth",
        "various",
        "skill",
        "like",
        "realistic",
        "critical",
        "selfevaluation",
        "foster",
        "autonomy",
        "nonetheless",
        "federation",
        "model",
        "without",
        "problemsproblems",
        "affect",
        "version",
        "union",
        "view",
        "well",
        "federation",
        "nozick",
        "view",
        "understood",
        "third",
        "entity",
        "need",
        "clearer",
        "account",
        "given",
        "ontological",
        "status",
        "come",
        "relevant",
        "literature",
        "shared",
        "intention",
        "plural",
        "subject",
        "gilbert",
        "argued",
        "take",
        "quite",
        "seriously",
        "existence",
        "plural",
        "subject",
        "entity",
        "constituent",
        "member",
        "others",
        "tuomela",
        "searle",
        "bratman",
        "cautious",
        "treating",
        "talk",
        "u",
        "intention",
        "metaphorical"
    ]
}