{
    "main_text": "The Nobility and Excellence of Women and the Defects and Vices of Men: context, sources, and structure\n2. The Nobility and Excellence of Women and the Defects and Vices of Men: context, sources, and structure\n\nAlthough many of Marinella’s works, especially the long poem\nL’Enrico, overo Bisantio acquistato (1635), include\nphilosophical themes, The Nobility stands as her most\nimportant, and perhaps her only uncontestable, contribution to\nphilosophy. It is a contribution to a debate about the nature and the\nmerits of women, which had its origin in The Book of the City of\nLadies (1405) by Christine de Pizan (an argument for the moral\nsuperiority of her sex) written in response to The Romance of the\nRose (~1275) by Guillaume de Lorris and Jean de Meun, in which\nwomen were vilified. Polemical works arguing that men were superior to\nwomen, or that women were superior to men, had proliferated in\nsubsequent centuries, in French, Italian, Latin, German, Spanish and\nEnglish. Such treatises generally relied on some combination of\nargument (usually drawn from ancient sources), examples, and citations\nfrom scripture and from literary or philosophical authorities.\n\nThe Nobility appeared when the debate had been running for\ntwo hundred years. Marinella was responding directly to the treatise\nby Giuseppe Passi, I donneschi diffetti (The Defects of\nWomen), published in 1599 in Venice and Milan, and so the\nstructure and methodology of The Nobility mirror those of\nThe Defects of Women (Kolsky 2001, 974). Passi had cited a\nvariety of ancient and medieval authorities, many of whom cite\nAristotle as the source of their arguments, which may explain\nMarinella’s particular concern both to use and to discredit\nAristotle; at any rate, she takes Passi to be a contemporary\nrepresentative of a misogynist tradition beginning with Aristotle and\nextending forward through Boccaccio. The Defects of Women\nstands as an extreme example of the genre of attacks on women, with\nPassi claiming that women are covered from head to toe in vices and\ndefects (Passi 1599, 240). The argument of the treatise begins with\nthe claim that the female is imperfect, created only as a\n‘necessary evil’. The imperfection of women is\nfundamentally that they are especially subject to passion (8). The\nheat of women’s bodies is both the source and the sign of her\nsubjection to passion (29). Because women are in thrall to their\npassions, they may not, strictly speaking, be rational animals (216).\nThis possibility is suggested and legitimized by Aristotle’s\nassertion that the deliberative faculty of women has no authority\n(215). Passi satirizes intellectual women (278–9), and comes\nclose to suggesting that women are a different species from men,\ninsisting that women should be treated like animals because both women\nand animals lack reason and virtue (Malpezzi Price and Ristaino 2008,\n108). The Defects of Women treatise is remarkable for its\nvirulence, but in no way original in substance. \n\nThere were precedents for many of Marinella’s claims and\narguments in The Nobility, perhaps as early as Christine de\nPizan (although there is no evidence that Marinella had read\nPizan—see Ross 2009, 326 (n.6)), but certainly in the work of\nHenricus Agrippus, De nobilitate et praecellentia foeminei\nsexus (On the Nobility and Excellence of the Feminine\nSex), published in Latin in 1529 and translated soon after into\nItalian (in 1549 by Alessandro Piccolomini), and the treatise Il\nCortegione (The Courtier) (1528) by Baldassare\nCastiglione. Agrippa drew an analogy between the subjection of women\nand political tyranny, and this may have paved the way for\nMarinella’s political approach to the issue of women’s\nnature. Castiglione, using the form of the dialogue, offers a\nrefutation of certain Aristotelian claims about the imperfection of\nwomen (through the voice of Giuliano de’ Medici), and an\nexposition of Neoplatonic love theory as popularized by Marsilio\nFicino (through the voice of Pietro Bembo). Marinella also draws on\nthe work of Leone Ebreo, the Dialoghi d’amore (1535),\nin which love is a cosmic force infusing all of creation, and the love\nbetween men and women, and not only between men, is recognized as a\nroute to divinity. Another important source for Marinella’s\ntreatise is the dialogue by Lodovico Domenichi entitled La\nnobiltà delle donne (The Nobility of Women),\npublished in Venice in 1549. This work features characters who voice\nopinions from both sides of the debate about women; it includes\narguments for the superior physiology of women that Marinella revises\nand elaborates in her treatise. While she drew on these works\nextensively, her argument marks a philosophical advance because it is\ndetailed, systematic, and cogent. Although The Nobility was\npublished in the same year that Moderata Fonte’s dialogue\n(Il merito delle donne) defending women, was published,\nIl merito had been written some years before. Marinella makes\nseveral references to Fonte, but none to Il merito. It is\nimpossible to know how well acquainted she was with Fonte’s\nwork, or what she thought of it. (For a discussion of\nMarinella’s knowledge of Fonte’s work see Kolsky 2001,\n981–2).\n\nIn The Nobility Marinella argues that there is a feminine\nnature that is different from, and superior to, masculine nature. It\nwas a commonplace that a person was called to a certain office in life\nby God; the nobility of a person was a function of that office and how\nwell one carried out its duties. “Questions of virtue thus\ninevitably allude to a social hierarchy that was generally accepted as\na reflection of the hierarchy of creation, an order in nature or\nof nature, instituted not fortuitously but providentially,\nand therefore not subject to alteration by human beings,”\n(Jordan 1990, 21). In this intellectual context, arguing that women\nwere superior in nature to men was a way of arguing that the office in\nlife that women were intended by God to fulfill was itself better.\n\nMarinella’s central claim in The Nobility is,\n“…that the female sex is nobler and more excellent than\nthe male,” (1601b, 39). More precisely, she says that she will\nshow “…that they [women] surpass men in the nobility of\ntheir names, causes, nature, operations and the things men say about\nthem,” (41). That names might indicate something about the\nthings to which they refer was a commonplace of the Renaissance, with\norigins in the interpretation of Plato’s Cratylus. The\ncauses of a phenomenon were similarly taken to indicate something\nimportant of the phenomenon itself—better causes producing\nbetter effects. The “nature” of woman Marinella shows to\nbe, on the one hand, a nature shared with men and, on the other, a\ndistinct nature; as the formal cause of a substance, the nature\ndetermines the worth of that substance. The “operations”\nof women are the things they are able to do insofar as they are\nensouled beings rather than inanimate objects. Since Marinella argues\nthat women have better souls than men, she takes as evidence for this\nthe superior merit of the activities that they perform with the soul.\nFinally, Marinella’s objective to demonstrate that men\nthemselves make evident the superiority of women (by means of\n“the things they say about women”) represents her most\nimportant strategy: to take the evidence usually adduced by men to\ndemonstrate the inferiority of women, and reveal through\ninterpretation that in fact it demonstrates the superiority of\nwomen.\n\nThe Nobility is divided into two parts, the first of which\ndemonstrates the nobility and excellence of women, the second of which\nsets out the defects and failings of men. Both the respects in which\nshe claims superiority for women and the contrast she draws between\nthe excellences of women and the vices of men are standard in the\ncontributions to the querelle des femmes that take the side\nof women. What is unusual with Marinella is the learning, the\nsophistication, and the systematic and cogent development of the\narguments. Unlike most pro-woman authors, she makes no concessions to\nthe convention of masculine excellence, asserting the superiority of\nwomen in all respects. The argument for women’s superiority is\nlargely set out in the first part of the treatise. But the second\npart, on the defects of men, is not incidental to the central claim\nthat women are nobler. Marinella details the defects of men, and in\nparticular their evil motives, in order to support her positive\nargument for women’s nobility, by demonstrating that the motives\nmen have for denigrating women are ignoble, stem from defects of\nnature, and are thus evidence of the inferiority of men. So the\ndefects of men are introduced not only so that women might appear more\nexcellent in comparison, but also, and more importantly, to show that\nthe deficiencies attributed to women by men are more properly the\ndeficiencies of male nature, and that those very deficiencies are\nresponsible for the fallacious claims about women made by some men\n(Aristotle and Passi in particular). So Marinella offers an\nexplanation for the misogynist claims to which she is responding, and\nthat explanation supports her claim that women are better than men in\ncertain precise respects.\n",
    "section_title": "2. The Nobility and Excellence of Women and the Defects and Vices of Men: context, sources, and structure",
    "entry_title": "Lucrezia Marinella",
    "hierarchy_title": "Lucrezia Marinella || The Nobility and Excellence of Women and the Defects and Vices of Men: context, sources, and structure",
    "tokenized_text": [
        "nobility",
        "excellence",
        "woman",
        "defect",
        "vice",
        "men",
        "context",
        "source",
        "structure",
        "nobility",
        "excellence",
        "woman",
        "defect",
        "vice",
        "men",
        "context",
        "source",
        "structure",
        "although",
        "many",
        "marinella",
        "work",
        "especially",
        "long",
        "poem",
        "l",
        "enrico",
        "overo",
        "bisantio",
        "acquistato",
        "include",
        "philosophical",
        "theme",
        "nobility",
        "stand",
        "important",
        "perhaps",
        "uncontestable",
        "contribution",
        "philosophy",
        "contribution",
        "debate",
        "nature",
        "merit",
        "woman",
        "origin",
        "book",
        "city",
        "lady",
        "christine",
        "de",
        "pizan",
        "argument",
        "moral",
        "superiority",
        "sex",
        "written",
        "response",
        "romance",
        "rose",
        "guillaume",
        "de",
        "lorris",
        "jean",
        "de",
        "meun",
        "woman",
        "vilified",
        "polemical",
        "work",
        "arguing",
        "men",
        "superior",
        "woman",
        "woman",
        "superior",
        "men",
        "proliferated",
        "subsequent",
        "century",
        "french",
        "italian",
        "latin",
        "german",
        "spanish",
        "english",
        "treatise",
        "generally",
        "relied",
        "combination",
        "argument",
        "usually",
        "drawn",
        "ancient",
        "source",
        "example",
        "citation",
        "scripture",
        "literary",
        "philosophical",
        "authority",
        "nobility",
        "appeared",
        "debate",
        "running",
        "two",
        "hundred",
        "year",
        "marinella",
        "responding",
        "directly",
        "treatise",
        "giuseppe",
        "passi",
        "donneschi",
        "diffetti",
        "defect",
        "woman",
        "published",
        "venice",
        "milan",
        "structure",
        "methodology",
        "nobility",
        "mirror",
        "defect",
        "woman",
        "kolsky",
        "passi",
        "cited",
        "variety",
        "ancient",
        "medieval",
        "authority",
        "many",
        "cite",
        "aristotle",
        "source",
        "argument",
        "may",
        "explain",
        "marinella",
        "particular",
        "concern",
        "use",
        "discredit",
        "aristotle",
        "rate",
        "take",
        "passi",
        "contemporary",
        "representative",
        "misogynist",
        "tradition",
        "beginning",
        "aristotle",
        "extending",
        "forward",
        "boccaccio",
        "defect",
        "woman",
        "stand",
        "extreme",
        "example",
        "genre",
        "attack",
        "woman",
        "passi",
        "claiming",
        "woman",
        "covered",
        "head",
        "toe",
        "vice",
        "defect",
        "passi",
        "argument",
        "treatise",
        "begin",
        "claim",
        "female",
        "imperfect",
        "created",
        "necessary",
        "evil",
        "imperfection",
        "woman",
        "fundamentally",
        "especially",
        "subject",
        "passion",
        "heat",
        "woman",
        "body",
        "source",
        "sign",
        "subjection",
        "passion",
        "woman",
        "thrall",
        "passion",
        "may",
        "strictly",
        "speaking",
        "rational",
        "animal",
        "possibility",
        "suggested",
        "legitimized",
        "aristotle",
        "assertion",
        "deliberative",
        "faculty",
        "woman",
        "authority",
        "passi",
        "satirizes",
        "intellectual",
        "woman",
        "come",
        "close",
        "suggesting",
        "woman",
        "different",
        "specie",
        "men",
        "insisting",
        "woman",
        "treated",
        "like",
        "animal",
        "woman",
        "animal",
        "lack",
        "reason",
        "virtue",
        "malpezzi",
        "price",
        "ristaino",
        "defect",
        "woman",
        "treatise",
        "remarkable",
        "virulence",
        "way",
        "original",
        "substance",
        "precedent",
        "many",
        "marinella",
        "claim",
        "argument",
        "nobility",
        "perhaps",
        "early",
        "christine",
        "de",
        "pizan",
        "although",
        "evidence",
        "marinella",
        "read",
        "pizansee",
        "ross",
        "n",
        "certainly",
        "work",
        "henricus",
        "agrippus",
        "de",
        "nobilitate",
        "et",
        "praecellentia",
        "foeminei",
        "sexus",
        "nobility",
        "excellence",
        "feminine",
        "sex",
        "published",
        "latin",
        "translated",
        "soon",
        "italian",
        "alessandro",
        "piccolomini",
        "treatise",
        "il",
        "cortegione",
        "courtier",
        "baldassare",
        "castiglione",
        "agrippa",
        "drew",
        "analogy",
        "subjection",
        "woman",
        "political",
        "tyranny",
        "may",
        "paved",
        "way",
        "marinella",
        "political",
        "approach",
        "issue",
        "woman",
        "nature",
        "castiglione",
        "using",
        "form",
        "dialogue",
        "offer",
        "refutation",
        "certain",
        "aristotelian",
        "claim",
        "imperfection",
        "woman",
        "voice",
        "giuliano",
        "de",
        "medici",
        "exposition",
        "neoplatonic",
        "love",
        "theory",
        "popularized",
        "marsilio",
        "ficino",
        "voice",
        "pietro",
        "bembo",
        "marinella",
        "also",
        "draw",
        "work",
        "leone",
        "ebreo",
        "dialoghi",
        "amore",
        "love",
        "cosmic",
        "force",
        "infusing",
        "creation",
        "love",
        "men",
        "woman",
        "men",
        "recognized",
        "route",
        "divinity",
        "another",
        "important",
        "source",
        "marinella",
        "treatise",
        "dialogue",
        "lodovico",
        "domenichi",
        "entitled",
        "la",
        "nobiltà",
        "delle",
        "donne",
        "nobility",
        "woman",
        "published",
        "venice",
        "work",
        "feature",
        "character",
        "voice",
        "opinion",
        "side",
        "debate",
        "woman",
        "includes",
        "argument",
        "superior",
        "physiology",
        "woman",
        "marinella",
        "revise",
        "elaborates",
        "treatise",
        "drew",
        "work",
        "extensively",
        "argument",
        "mark",
        "philosophical",
        "advance",
        "detailed",
        "systematic",
        "cogent",
        "although",
        "nobility",
        "published",
        "year",
        "moderata",
        "fonte",
        "dialogue",
        "il",
        "merito",
        "delle",
        "donne",
        "defending",
        "woman",
        "published",
        "il",
        "merito",
        "written",
        "year",
        "marinella",
        "make",
        "several",
        "reference",
        "fonte",
        "none",
        "il",
        "merito",
        "impossible",
        "know",
        "well",
        "acquainted",
        "fonte",
        "work",
        "thought",
        "discussion",
        "marinella",
        "knowledge",
        "fonte",
        "work",
        "see",
        "kolsky",
        "nobility",
        "marinella",
        "argues",
        "feminine",
        "nature",
        "different",
        "superior",
        "masculine",
        "nature",
        "commonplace",
        "person",
        "called",
        "certain",
        "office",
        "life",
        "god",
        "nobility",
        "person",
        "function",
        "office",
        "well",
        "one",
        "carried",
        "duty",
        "question",
        "virtue",
        "thus",
        "inevitably",
        "allude",
        "social",
        "hierarchy",
        "generally",
        "accepted",
        "reflection",
        "hierarchy",
        "creation",
        "order",
        "nature",
        "nature",
        "instituted",
        "fortuitously",
        "providentially",
        "therefore",
        "subject",
        "alteration",
        "human",
        "being",
        "jordan",
        "intellectual",
        "context",
        "arguing",
        "woman",
        "superior",
        "nature",
        "men",
        "way",
        "arguing",
        "office",
        "life",
        "woman",
        "intended",
        "god",
        "fulfill",
        "better",
        "marinella",
        "central",
        "claim",
        "nobility",
        "that",
        "female",
        "sex",
        "nobler",
        "excellent",
        "male",
        "b",
        "precisely",
        "say",
        "show",
        "that",
        "woman",
        "surpass",
        "men",
        "nobility",
        "name",
        "cause",
        "nature",
        "operation",
        "thing",
        "men",
        "say",
        "name",
        "might",
        "indicate",
        "something",
        "thing",
        "refer",
        "commonplace",
        "renaissance",
        "origin",
        "interpretation",
        "plato",
        "cratylus",
        "cause",
        "phenomenon",
        "similarly",
        "taken",
        "indicate",
        "something",
        "important",
        "phenomenon",
        "itselfbetter",
        "cause",
        "producing",
        "better",
        "effect",
        "nature",
        "woman",
        "marinella",
        "show",
        "one",
        "hand",
        "nature",
        "shared",
        "men",
        "distinct",
        "nature",
        "formal",
        "cause",
        "substance",
        "nature",
        "determines",
        "worth",
        "substance",
        "operation",
        "woman",
        "thing",
        "able",
        "insofar",
        "ensouled",
        "being",
        "rather",
        "inanimate",
        "object",
        "since",
        "marinella",
        "argues",
        "woman",
        "better",
        "soul",
        "men",
        "take",
        "evidence",
        "superior",
        "merit",
        "activity",
        "perform",
        "soul",
        "finally",
        "marinella",
        "objective",
        "demonstrate",
        "men",
        "make",
        "evident",
        "superiority",
        "woman",
        "mean",
        "thing",
        "say",
        "woman",
        "represents",
        "important",
        "strategy",
        "take",
        "evidence",
        "usually",
        "adduced",
        "men",
        "demonstrate",
        "inferiority",
        "woman",
        "reveal",
        "interpretation",
        "fact",
        "demonstrates",
        "superiority",
        "woman",
        "nobility",
        "divided",
        "two",
        "part",
        "first",
        "demonstrates",
        "nobility",
        "excellence",
        "woman",
        "second",
        "set",
        "defect",
        "failing",
        "men",
        "respect",
        "claim",
        "superiority",
        "woman",
        "contrast",
        "draw",
        "excellence",
        "woman",
        "vice",
        "men",
        "standard",
        "contribution",
        "querelle",
        "de",
        "femmes",
        "take",
        "side",
        "woman",
        "unusual",
        "marinella",
        "learning",
        "sophistication",
        "systematic",
        "cogent",
        "development",
        "argument",
        "unlike",
        "prowoman",
        "author",
        "make",
        "concession",
        "convention",
        "masculine",
        "excellence",
        "asserting",
        "superiority",
        "woman",
        "respect",
        "argument",
        "woman",
        "superiority",
        "largely",
        "set",
        "first",
        "part",
        "treatise",
        "second",
        "part",
        "defect",
        "men",
        "incidental",
        "central",
        "claim",
        "woman",
        "nobler",
        "marinella",
        "detail",
        "defect",
        "men",
        "particular",
        "evil",
        "motif",
        "order",
        "support",
        "positive",
        "argument",
        "woman",
        "nobility",
        "demonstrating",
        "motif",
        "men",
        "denigrating",
        "woman",
        "ignoble",
        "stem",
        "defect",
        "nature",
        "thus",
        "evidence",
        "inferiority",
        "men",
        "defect",
        "men",
        "introduced",
        "woman",
        "might",
        "appear",
        "excellent",
        "comparison",
        "also",
        "importantly",
        "show",
        "deficiency",
        "attributed",
        "woman",
        "men",
        "properly",
        "deficiency",
        "male",
        "nature",
        "deficiency",
        "responsible",
        "fallacious",
        "claim",
        "woman",
        "made",
        "men",
        "aristotle",
        "passi",
        "particular",
        "marinella",
        "offer",
        "explanation",
        "misogynist",
        "claim",
        "responding",
        "explanation",
        "support",
        "claim",
        "woman",
        "better",
        "men",
        "certain",
        "precise",
        "respect"
    ]
}