{
    "main_text": "Feuerbach as Historian of Philosophy\n3. Feuerbach as Historian of Philosophy\n\nThe understanding of reason as one and universal that underlies the\nworks discussed in the preceding section also informs the approach\ntaken by Feuerbach to the history of philosophy in the three\npreviously mentioned books, and in a series of lectures, that he\nproduced during the\n 1830s.[13]\n In his lectures on the history of modern philosophy, Feuerbach\nemphasizes that philosophical reflection is an activity to which human\nbeings are driven. The history of the philosophical systems\nthat this activity has produced, he maintains, is conceived only\nsubjectively, and thus inadequately, so long as it is regarded as the\nhistory of the opinions of individual thinkers. Because thinking is a\nspecies-activity, the philosophical systems that have arisen in the\ncourse of the history of philosophy should be regarded as necessary\nstandpoints of reason itself. The Idea is not something first produced\nby philosophical reflection. Rather, the individual thinker, to the\nextent the he or she succeeds in transcending his or her\nindividuality, comes to function as an instrument or organ through\nwhich the Idea actualizes one of its moments, which is later\nreproduced in the consciousness of the historian of philosophy. The\nactivity of the Idea is experienced subjectively as inspiration\n(Begeisterung). In producing itself, the Idea does not pass\nfrom nonbeing into being, but rather from one state of being (being in\nitself) to another (being for itself). The Idea produces itself by\ndetermining itself, and human consciousness is the medium of its\nself-actualization.\n\n\nReason is nothing but the self-activity of the eternal,\ninfinite idea, whether in art or religion or philosophy, but this\nactivity is always the activity of the Idea in a particular\ndetermination and thus also at a particular time, for it\nis precisely according to the particular determinations of the idea\nthat enter successively into human consciousness that we differentiate\nthe periods and epochs of history. (VGP 11)\n\n\nThe emergence of new philosophical systems results, on this view, from\na necessity that is both internal and external. Certain philosophical\nideas are only capable of being conceived and articulated under\nspecific historical conditions. Just as it was only possible for\nChristianity to appear at that point in history when the ties that\nbound family and nation in Greco-Roman antiquity were dissolving, so\nit was only possible for modern philosophy to appear under specific\nhistorical conditions. Feuerbach locates the beginning of the history\nof modern philosophy at the point where the modern spirit first begins\nto distinguish itself from the medieval spirit. The dominant principle\nof the medieval period was the Judeo-Christian, monotheistic\nprinciple, according to which God is conceived as an omnipotent person\nthrough an act of whose will the material world was created from\nnothing (ex nihilo). It is because nature, as conceived from\nthis standpoint, is excluded from the divine substance, according to\nFeuerbach, that medieval thought showed so little interest in the\ninvestigation of nature. It is only where the substantiality of nature\nbegins to be rediscovered that the spirit of modernity distinguishes\nitself from the medieval spirit. This occurs most clearly where matter\ncomes to be regarded as an attribute of the divine substance, so that\nGod is no longer conceived of as a being distinct from nature but\nrather as the immutable and eternal imminent cause from which the\nplenitude of finite shapes in nature pours forth. This happens first\namong the nature philosophers of the Italian Renaissance, and\nsubsequently in the speculative reflections of Jakob Böhme and in\nthe system of Spinoza. Indeed, it is one distinctive feature of\nFeuerbach’s view of the history of modern philosophy that he\nthinks of it as beginning, not with Descartes, but with the nature\nphilosophers of the Italian Renaissance. Feuerbach insists upon the\nspeculative significance of Bacon’s philosophy of nature. It is\nprecisely in subjecting nature to experimentation, and thereby to\nrational comprehension, that spirit raises itself above nature. But\nwhile Feuerbach emphasizes the philosophical importance of experience\nin the modern rediscovery of nature, he nevertheless insists that\nempiricism lacks a “principle” of its own. Later he will\nspeak of the need for an alliance between German metaphysics and\n“the anti-scholastic, sanguine principle of French\nsensualism and materialism” (VT 254–255/165,\nemphasis in the original).\n\nFeuerbach’s conviction that Christian faith is inimical to\nreason and philosophy was strengthened by his own studies of the\nhistory of modern philosophy, especially his studies of Leibniz and\nBayle. As previously noted, his monographs on these figures were\nwritten during the period of controversy following the appearance of\nStrauss’s Life of Jesus. Toward the end of the 1830s,\nthe Young Hegelians were increasingly opposed on two fronts: on the\none hand, by right-wing Hegelians such as Friedrich Göschel, who\ninsisted upon the compatibility of Hegelianism and Protestant\northodoxy, and, on the other, by representatives of the so-called\n“Positive Philosophy”, who, taking their inspiration from\nthe late Schelling, identified the personality of God as disclosed in\nthe Christian revelation as the supreme metaphysical principle (cf.\nBreckman 1999 and Gooch 2011). It is in light of these developments\nthat, beginning in the Leibniz monograph, Feuerbach sought\nincreasingly to distinguish from one another, and to demonstrate the\nincompatibility of, what he refers to there as “the\nphilosophical standpoint” and “the theological\nstandpoint”, respectively. Feuerbach regards the theological\nstandpoint as “practical” because it imagines God as a\nbeing separate from the world, upon which he acts according to\npurposes similar to those that guide the actions of human beings,\nrather than conceiving the world as a necessary, and hence rationally\nintelligible, consequence of the divine nature. To be sure, for\nLeibniz, there is nothing arbitrary about the divine will. God’s\nwill is determined by his infinite wisdom and goodness, which compel\nhim to choose to create the best possible world. But this attempt to\nsynthesize rational necessity and divine sovereignty remains in\nFeuerbach’s view an unacceptable compromise. Like Tycho Brahe,\nwho sought to combine the Ptolemaic and Copernican astronomies, he\nthinks Leibniz sought to reconcile the irreconcilable. Feuerbach took\nLeibniz’s theory of monads to be an original philosophical\nposition that offers a genuinely novel conception of substance, and an\nalternative to the mechanistic-mathematical Cartesian account of\nmotion, and thus constitutes an organic link in the developmental\nsequence of historical philosophical systems. He criticized Leibniz,\nhowever, for not having derived the unity or harmony of the monads\nfrom the nature of the monads themselves, and for appealing instead to\na theological representation of God as an alien, external power who\nachieves this harmonization miraculously, and hence, inexplicably.\n\nAlthough, considered superficially, Feuerbach’s study of Bayle\nis a continuation of the line of inquiry pursued in his earlier\nhistorical monographs, closer inspection confirms Rawidowicz’s\nobservation that this book marks an important turning point in his\nintellectual development (Rawidowicz 1964: 62–62). The book is\nfull of digressions that go on for many pages without making any\nreference to Bayle, which can produce an impression that it lacks a\nclearly defined focus. In fact Feuerbach is here moving toward, and\nbuilding a case for, a claim that he articulates more explicitly in\nsucceeding years, namely, that the “practical negation” of\nChristianity is a fait accompli insofar as the scientific,\neconomic, aesthetic, ethical and political values and institutions\nthat are constitutive of modern European culture are incompatible with\nthe demands of authentic Christian faith as expressed in the Bible and\nin the writings of patristic and medieval authors, who are either\nindifferent or inimical to the scientific investigation of nature, the\nacquisition of wealth, the pursuit of artistic creativity as an end in\nitself, and attempts to establish ethical and political norms on the\nbasis of universally valid rational principles rather than the\nauthority of revelation or of the Church.\n\nAlthough the Protestant Reformation, in its rejection of clerical\ncelibacy, its affirmation of the vocation of the laity, and its\nseparation of temporal and spiritual authority, resolved the\ncontradiction between the spirit and the flesh that was characteristic\nof medieval Catholicism, Feuerbach argues, it failed to resolve the\ncontradiction between faith and reason, or theology and philosophy.\nBayle’s historical significance for Feuerbach consists in his\nuncompromising exposure of this contradiction, which, because it was\nso deeply rooted in Bayle’s own character, he himself could only\nresolve by embracing fideism. Feuerbach sought to further expose this\ncontraction in his 1839 essay, “On Philosophy and\nChristianity”, in which he for the first time publicly\nrepudiated the Hegelian claim that philosophy affirms in the form of\nconceptual thinking the same truths affirmed by religion in the form\nof sensible representations.\n",
    "section_title": "3. Feuerbach as Historian of Philosophy",
    "entry_title": "Ludwig Andreas Feuerbach",
    "hierarchy_title": "Ludwig Andreas Feuerbach || Feuerbach as Historian of Philosophy",
    "tokenized_text": [
        "feuerbach",
        "historian",
        "philosophy",
        "feuerbach",
        "historian",
        "philosophy",
        "understanding",
        "reason",
        "one",
        "universal",
        "underlies",
        "work",
        "discussed",
        "preceding",
        "section",
        "also",
        "informs",
        "approach",
        "taken",
        "feuerbach",
        "history",
        "philosophy",
        "three",
        "previously",
        "mentioned",
        "book",
        "series",
        "lecture",
        "produced",
        "s",
        "lecture",
        "history",
        "modern",
        "philosophy",
        "feuerbach",
        "emphasizes",
        "philosophical",
        "reflection",
        "activity",
        "human",
        "being",
        "driven",
        "history",
        "philosophical",
        "system",
        "activity",
        "produced",
        "maintains",
        "conceived",
        "subjectively",
        "thus",
        "inadequately",
        "long",
        "regarded",
        "history",
        "opinion",
        "individual",
        "thinker",
        "thinking",
        "speciesactivity",
        "philosophical",
        "system",
        "arisen",
        "course",
        "history",
        "philosophy",
        "regarded",
        "necessary",
        "standpoint",
        "reason",
        "idea",
        "something",
        "first",
        "produced",
        "philosophical",
        "reflection",
        "rather",
        "individual",
        "thinker",
        "extent",
        "succeeds",
        "transcending",
        "individuality",
        "come",
        "function",
        "instrument",
        "organ",
        "idea",
        "actualizes",
        "one",
        "moment",
        "later",
        "reproduced",
        "consciousness",
        "historian",
        "philosophy",
        "activity",
        "idea",
        "experienced",
        "subjectively",
        "inspiration",
        "begeisterung",
        "producing",
        "idea",
        "pas",
        "nonbeing",
        "rather",
        "one",
        "state",
        "another",
        "idea",
        "produce",
        "determining",
        "human",
        "consciousness",
        "medium",
        "selfactualization",
        "reason",
        "nothing",
        "selfactivity",
        "eternal",
        "infinite",
        "idea",
        "whether",
        "art",
        "religion",
        "philosophy",
        "activity",
        "always",
        "activity",
        "idea",
        "particular",
        "determination",
        "thus",
        "also",
        "particular",
        "time",
        "precisely",
        "according",
        "particular",
        "determination",
        "idea",
        "enter",
        "successively",
        "human",
        "consciousness",
        "differentiate",
        "period",
        "epoch",
        "history",
        "vgp",
        "emergence",
        "new",
        "philosophical",
        "system",
        "result",
        "view",
        "necessity",
        "internal",
        "external",
        "certain",
        "philosophical",
        "idea",
        "capable",
        "conceived",
        "articulated",
        "specific",
        "historical",
        "condition",
        "possible",
        "christianity",
        "appear",
        "point",
        "history",
        "tie",
        "bound",
        "family",
        "nation",
        "grecoroman",
        "antiquity",
        "dissolving",
        "possible",
        "modern",
        "philosophy",
        "appear",
        "specific",
        "historical",
        "condition",
        "feuerbach",
        "locates",
        "beginning",
        "history",
        "modern",
        "philosophy",
        "point",
        "modern",
        "spirit",
        "first",
        "begin",
        "distinguish",
        "medieval",
        "spirit",
        "dominant",
        "principle",
        "medieval",
        "period",
        "judeochristian",
        "monotheistic",
        "principle",
        "according",
        "god",
        "conceived",
        "omnipotent",
        "person",
        "act",
        "whose",
        "material",
        "world",
        "created",
        "nothing",
        "ex",
        "nihilo",
        "nature",
        "conceived",
        "standpoint",
        "excluded",
        "divine",
        "substance",
        "according",
        "feuerbach",
        "medieval",
        "thought",
        "showed",
        "little",
        "interest",
        "investigation",
        "nature",
        "substantiality",
        "nature",
        "begin",
        "rediscovered",
        "spirit",
        "modernity",
        "distinguishes",
        "medieval",
        "spirit",
        "occurs",
        "clearly",
        "matter",
        "come",
        "regarded",
        "attribute",
        "divine",
        "substance",
        "god",
        "longer",
        "conceived",
        "distinct",
        "nature",
        "rather",
        "immutable",
        "eternal",
        "imminent",
        "cause",
        "plenitude",
        "finite",
        "shape",
        "nature",
        "pours",
        "forth",
        "happens",
        "first",
        "among",
        "nature",
        "philosopher",
        "italian",
        "renaissance",
        "subsequently",
        "speculative",
        "reflection",
        "jakob",
        "böhme",
        "system",
        "spinoza",
        "indeed",
        "one",
        "distinctive",
        "feature",
        "feuerbach",
        "view",
        "history",
        "modern",
        "philosophy",
        "think",
        "beginning",
        "descartes",
        "nature",
        "philosopher",
        "italian",
        "renaissance",
        "feuerbach",
        "insists",
        "upon",
        "speculative",
        "significance",
        "bacon",
        "philosophy",
        "nature",
        "precisely",
        "subjecting",
        "nature",
        "experimentation",
        "thereby",
        "rational",
        "comprehension",
        "spirit",
        "raise",
        "nature",
        "feuerbach",
        "emphasizes",
        "philosophical",
        "importance",
        "experience",
        "modern",
        "rediscovery",
        "nature",
        "nevertheless",
        "insists",
        "empiricism",
        "lack",
        "principle",
        "later",
        "speak",
        "need",
        "alliance",
        "german",
        "metaphysics",
        "antischolastic",
        "sanguine",
        "principle",
        "french",
        "sensualism",
        "materialism",
        "vt",
        "emphasis",
        "original",
        "feuerbach",
        "conviction",
        "christian",
        "faith",
        "inimical",
        "reason",
        "philosophy",
        "strengthened",
        "study",
        "history",
        "modern",
        "philosophy",
        "especially",
        "study",
        "leibniz",
        "bayle",
        "previously",
        "noted",
        "monograph",
        "figure",
        "written",
        "period",
        "controversy",
        "following",
        "appearance",
        "strauss",
        "life",
        "jesus",
        "toward",
        "end",
        "s",
        "young",
        "hegelian",
        "increasingly",
        "opposed",
        "two",
        "front",
        "one",
        "hand",
        "rightwing",
        "hegelian",
        "friedrich",
        "göschel",
        "insisted",
        "upon",
        "compatibility",
        "hegelianism",
        "protestant",
        "orthodoxy",
        "representative",
        "socalled",
        "positive",
        "philosophy",
        "taking",
        "inspiration",
        "late",
        "schelling",
        "identified",
        "personality",
        "god",
        "disclosed",
        "christian",
        "revelation",
        "supreme",
        "metaphysical",
        "principle",
        "cf",
        "breckman",
        "gooch",
        "light",
        "development",
        "beginning",
        "leibniz",
        "monograph",
        "feuerbach",
        "sought",
        "increasingly",
        "distinguish",
        "one",
        "another",
        "demonstrate",
        "incompatibility",
        "refers",
        "philosophical",
        "standpoint",
        "theological",
        "standpoint",
        "respectively",
        "feuerbach",
        "regard",
        "theological",
        "standpoint",
        "practical",
        "imago",
        "god",
        "separate",
        "world",
        "upon",
        "act",
        "according",
        "purpose",
        "similar",
        "guide",
        "action",
        "human",
        "being",
        "rather",
        "conceiving",
        "world",
        "necessary",
        "hence",
        "rationally",
        "intelligible",
        "consequence",
        "divine",
        "nature",
        "sure",
        "leibniz",
        "nothing",
        "arbitrary",
        "divine",
        "god",
        "determined",
        "infinite",
        "wisdom",
        "goodness",
        "compel",
        "choose",
        "create",
        "best",
        "possible",
        "world",
        "attempt",
        "synthesize",
        "rational",
        "necessity",
        "divine",
        "sovereignty",
        "remains",
        "feuerbach",
        "view",
        "unacceptable",
        "compromise",
        "like",
        "tycho",
        "brahe",
        "sought",
        "combine",
        "ptolemaic",
        "copernican",
        "astronomy",
        "think",
        "leibniz",
        "sought",
        "reconcile",
        "irreconcilable",
        "feuerbach",
        "took",
        "leibniz",
        "theory",
        "monad",
        "original",
        "philosophical",
        "position",
        "offer",
        "genuinely",
        "novel",
        "conception",
        "substance",
        "alternative",
        "mechanisticmathematical",
        "cartesian",
        "account",
        "motion",
        "thus",
        "constitutes",
        "organic",
        "link",
        "developmental",
        "sequence",
        "historical",
        "philosophical",
        "system",
        "criticized",
        "leibniz",
        "however",
        "derived",
        "unity",
        "harmony",
        "monad",
        "nature",
        "monad",
        "appealing",
        "instead",
        "theological",
        "representation",
        "god",
        "alien",
        "external",
        "power",
        "achieves",
        "harmonization",
        "miraculously",
        "hence",
        "inexplicably",
        "although",
        "considered",
        "superficially",
        "feuerbach",
        "study",
        "bayle",
        "continuation",
        "line",
        "inquiry",
        "pursued",
        "earlier",
        "historical",
        "monograph",
        "closer",
        "inspection",
        "confirms",
        "rawidowicz",
        "observation",
        "book",
        "mark",
        "important",
        "turning",
        "point",
        "intellectual",
        "development",
        "rawidowicz",
        "book",
        "full",
        "digression",
        "go",
        "many",
        "page",
        "without",
        "making",
        "reference",
        "bayle",
        "produce",
        "impression",
        "lack",
        "clearly",
        "defined",
        "focus",
        "fact",
        "feuerbach",
        "moving",
        "toward",
        "building",
        "case",
        "claim",
        "articulates",
        "explicitly",
        "succeeding",
        "year",
        "namely",
        "practical",
        "negation",
        "christianity",
        "fait",
        "accompli",
        "insofar",
        "scientific",
        "economic",
        "aesthetic",
        "ethical",
        "political",
        "value",
        "institution",
        "constitutive",
        "modern",
        "european",
        "culture",
        "incompatible",
        "demand",
        "authentic",
        "christian",
        "faith",
        "expressed",
        "bible",
        "writing",
        "patristic",
        "medieval",
        "author",
        "either",
        "indifferent",
        "inimical",
        "scientific",
        "investigation",
        "nature",
        "acquisition",
        "wealth",
        "pursuit",
        "artistic",
        "creativity",
        "end",
        "attempt",
        "establish",
        "ethical",
        "political",
        "norm",
        "basis",
        "universally",
        "valid",
        "rational",
        "principle",
        "rather",
        "authority",
        "revelation",
        "church",
        "although",
        "protestant",
        "reformation",
        "rejection",
        "clerical",
        "celibacy",
        "affirmation",
        "vocation",
        "laity",
        "separation",
        "temporal",
        "spiritual",
        "authority",
        "resolved",
        "contradiction",
        "spirit",
        "flesh",
        "characteristic",
        "medieval",
        "catholicism",
        "feuerbach",
        "argues",
        "failed",
        "resolve",
        "contradiction",
        "faith",
        "reason",
        "theology",
        "philosophy",
        "bayle",
        "historical",
        "significance",
        "feuerbach",
        "consists",
        "uncompromising",
        "exposure",
        "contradiction",
        "deeply",
        "rooted",
        "bayle",
        "character",
        "could",
        "resolve",
        "embracing",
        "fideism",
        "feuerbach",
        "sought",
        "expose",
        "contraction",
        "essay",
        "philosophy",
        "christianity",
        "first",
        "time",
        "publicly",
        "repudiated",
        "hegelian",
        "claim",
        "philosophy",
        "affirms",
        "form",
        "conceptual",
        "thinking",
        "truth",
        "affirmed",
        "religion",
        "form",
        "sensible",
        "representation"
    ]
}