{
    "main_text": "The Critique of Christianity\n4. The Critique of Christianity\n\nIn a section of the preface to the second edition of The Essence\nof Christianity (1843) that Eliot omitted from her translation,\nFeuerbach reveals that he had sought in this book to achieve two\nthings: First, to attack the Hegelian claim for the identity of\nreligious and philosophical truth by showing that Hegel succeeds in\nreconciling religion with philosophy only by robbing religion of its\nmost distinctive content. Second,\n\n\nto place the so-called positive philosophy in a most fatal light by\nshowing that the original of its idolatrous image of God\n[Götzenbild] is man, that flesh and blood belong to\npersonality essentially. (WC 10–11)\n\n\nAppreciation of each of these objectives requires further\nclarification of the historical context in which Feuerbach’s\nbook appeared, namely one year after the ascension to the Prussian\nthrone of the Romantic conservative, Friedrich Wilhelm IV. The new\nking’s inner circle of advisers consisted of devout aristocrats\nclosely associated with the neo-Pietist Awakening, who sought to\nestablish a German-Christian state as a bulwark against the influence\nof subversive ideas on the continent. 1840 also saw the death of the\nPrussian minister of culture, Karl vom Stein zum Altenstein, who had\nbeen a supporter of the Hegelian cause and a bearer of the hopes of\nthe Young Hegelians both for academic advancement and for a Prussian\nstate informed by a progressive Protestant ethos amenable to the\nfreedom of theoretical inquiry. The wedge driven by the outcry\nsurrounding the appearance of Strauss’s book between the right\nand left wings of the Hegelian camp made this “center”\nposition increasingly untenable. The policies of Altenstein’s\nsuccessor, including the appointment, in 1841, of Schelling to the\nchair in Berlin formerly occupied by Hegel, were aimed instead at\nslaying the “dragonseed” of Hegelian pantheism in the\nuniversities under Prussian jurisdiction (cf. Pinkard 2002:\n317–332).\n\nBy the time Feuerbach published his most famous book, The Essence\nof Christianity (1841), in which he sought to develop “a\nphilosophy of positive religion or revelation” (WC 3),\nhe had begun to move away from his earlier idealistic\n pantheism.[14]\n That he nevertheless sought in this book to criticize both Hegelian\nspeculative theology and the positive philosophy from “the same\nstandpoint” taken by Spinoza in his Theologico-Political\nTreatise (VWR 16/9; cf. WC 10–11) has\noften been overlooked. At one point in the Treatise Spinoza\nobserves that the biblical authors\n\n\nimagined God as ruler, legislator, king, merciful, just, etc., despite\nthe fact that all the latter are merely attributes of human nature and\nfar removed from the divine nature. (Spinoza [1677] 2007: 63)\n\n\nIn Christianity, Feuerbach makes a similar distinction\nbetween the metaphysical and personal divine predicates. God\nconsidered as the theoretical object of rational reflection, or\n“God as God”, is a timeless and impassible entity that is\nunaffected by human suffering and ultimately indistinguishable from\nreason itself.\n\n\nThe consciousness of human nullity that is bound up with consciousness\nof this being is in no way a religious consciousness; it is much more\ncharacteristic of skeptics, materialists, naturalists and pantheists.\n(WC 89/44)\n\n\nIt is God’s personal predicates that concern the religious\nbeliever, for whom God exists, not as an object of theoretical\ncontemplation, but of feeling, imagination, and prayerful\nsupplication.\n\nWhereas the metaphysical predicates, which “serve only as\nexternal points of support to religion” (WC 62/25), can\nbe thought of as ones that apply to the first person of the Trinity\n(i.e., God in his abstract universality), the second person of the\nTrinity, by virtue of his having subjected himself, for the salvation\nof humanity, to a humble birth and an ignominious death, “is the\nsole, true, first person in religion” (WC 106/51). The\ndoctrine of the Incarnation, Feuerbach argues against Hegel, is not,\nfor the Christian believer, a symbolic representation of the eternal\nprocession and return of infinite spirit into, and back from, its\nfinite manifestations. It is rather “a tear of divine compassion\n[Mitleid]” (WC 102/50), and, as such, the act\nof a sacred heart that is able to sympathize with human suffering.\nThat God was compelled by his love for humanity to renounce his\ndivinity and become human Feuerbach takes as proof that “Man was\nalready in God, was already God himself, before God\nbecame man” (ibid.), i.e., that belief in divine compassion\ninvolves the attribution or projection onto God of a moral sentiment\nthat can only be experienced by a being capable of suffering, which\n“God as God” is not.\n\nThe Essence of Christianity is divided into two parts. In the\nfirst part, Feuerbach considers religion “in its agreement with\nthe human essence” (WC 75). Here he argues that, when\npurportedly theological claims are understood in their proper sense,\nthey are recognized as expressing anthropological, rather than\ntheological, truths. That is, the predicates that religious believers\napply to God are predicates that properly apply to the human\nspecies-essence of which God is an imaginary representation. In the\nsecond part, Feuerbach considers religion “in its contradiction\nwith the human essence” (WC 316). Here he argues that,\nwhen theological claims are understood in the sense in which they are\nordinarily taken (i.e., as referring to a non-human divine person),\nthey are\n self-contradictory.[15]\n In early 1842, Feuerbach still preferred that his views be presented\nto the public under the label “anthropotheism” rather than\n“atheism” (GW v. 18, 164), emphasizing that his\noverriding purpose in negating “the false or theological essence\nof religion” had been to affirm its “true or\nanthropological essence”, i.e., the divinity of man.\n\nFeuerbach begins The Essence of Christianity by proposing\nthat, since human beings have religion and animals do not, the key to\nunderstanding religion must be directly related to whatever it is that\nmost essentially distinguishes human beings from animals. This, he\nmaintains, is the distinctive kind of consciousness that is involved\nin the cognition of\n universals.[16]\n A being endowed with such “species-consciousness” is able\nto take its own essential nature as an object of thought. The capacity\nfor thought is conceived here as the capacity to engage in internal\ndialogue, and thus to be aware of oneself as containing both an I and\na Thou (a generic other), so that, in the act of thinking, the human\nindividual stands in a relation to his species in which non-human\nanimals, and human beings qua biological organisms, are\nincapable of standing. When a human being is conscious of himself (or\nherself) as human, he is conscious of himself not only as a thinking\nbeing, but also as a willing and a feeling being.\n\n\nThe power of thinking is the light of knowledge [des\nErkenntnis], the power of the will is the energy of character,\nthe power of the heart is love. (WC 31/3)\n\n\nThese are not powers that the individual has at his or her disposal.\nThey are rather powers that manifest themselves psychologically in the\nform of non-egoistic species-drives (Gattungstriebe) by which\nindividuals periodically find themselves overwhelmed, especially those\npoets and thinkers in whose works the species-essence is most clearly\n instantiated.[17]\n Such manifestations include the experiences of erotic and platonic\nlove; the drive to knowledge; the experience of being moved by the\nemotion expressed in music; the voice of conscience, which compels us\nto moderate our desires to avoid infringing on the freedom of others;\ncompassion; admiration; and the urge to overcome our own moral and\nintellectual limitations. The latter urge, Feuerbach contends,\npresupposes an awareness that our individual limitations are\nnot limitations of the species-essence, which functions thus\nas the norm or ideal toward which the individual’s efforts at\nself-transcendence are directed.\n\nThe individual human being is limited both physically and morally. Our\nphysical existence is limited in time and space. We are also\nlimited—and often painfully aware of our being so—in our\nintellectual and moral capacities. But I only experience as a painful\nlimitation my inability to be and do things that others of my kind are\nable to be and to do, so that, in recognizing my own limitations, I\nsimultaneously recognize that they are not limitations of the\nspecies. If they were, either I would not be aware of them at all, or\nI would not experience my awareness of them as painful. For example, I\nonly reprove myself for cowardice because I am aware of the bravery of\nothers, which I myself lack, and for my stinginess because I am aware\nof the generosity of others, which I myself lack. The experience of\nconscience—taken in the broad sense as an awareness of\none’s moral and intellectual shortcomings and\ninadequacies—thus presupposes species-consciousness in the form\nof an awareness of qualities that one finds oneself lacking but can\nimagine oneself, under other circumstances, possessing.\n\nFeuerbach’s central claim in The Essence of\nChristianity is that Christian theism is predicated upon an\nalienated form of human self-consciousness wherein human beings relate\nthemselves to their own human species-essence as though it were a\nbeing distinct from themselves. Although, in developing this claim,\nFeuerbach was clearly influenced by Hegel’s account of Unhappy\nConsciousness in the Phenomenology, Ameriks’ contention\nthat\n\n\nFeuerbach’s philosophical doctrines […] can be understood\nas little more than a filling out of the details of Hegel’s\nscathing account of orthodox Christianity as a form of “unhappy\nconsciousness” (Ameriks 2000: 259)\n\n\nis problematic for several reasons. First, it overlooks the likelihood\nof Hegel’s having understood his analysis of Unhappy\nConsciousness to apply to the otherworldliness he associated with\nmedieval Catholicism, or perhaps to otherworldly religion more\ngenerally, but not in any case to the type of Protestantism that he\nregarded as “the religion of the modern age” (Hegel [1807]\n1977: 14), and in which he found the sacred and the secular\nreconciled. Second, it overlooks the fact that Feuerbach’s\nappropriation of themes found in Hegel’s account of Unhappy\nConsciousness occurs in the context of an explicit, albeit incomplete,\nrepudiation of Hegel’s philosophy of spirit. Unlike Hegel, who\nconceives of Unhappy Consciousness as a moment in the development of\nhuman self-consciousness that is also a moment in the\ncoming-to-be-for-itself of the absolute, Feuerbach has by this time\nreached the conclusion that one cannot distinguish absolute spirit\nfrom “subjective spirit or the essence of man” without, in\nthe end, continuing to occupy “the old standpoint of\ntheology” (VT 246–247). Third, it overlooks the\nsignificance of Feuerbach’s emphasis on the importance, for\ngrasping the essence of religion, of precisely those subjective\naspects of religious consciousness (imagination and feeling) that\nHegel himself regarded as inessential or of secondary importance.\nFinally, in connection with this third point, it overlooks the\nsignificance of Feuerbach’s agreement with Spinoza against Hegel\nthat “faith […] requires not so much truth as\npiety” (Spinoza [1677] 2007: 184).\n\nIn a short essay, published 1842, in which he sought to clarify the\ndifference between his own approach to the philosophy of religion and\nHegel’s, Feuerbach suggested that this difference is most\nevident in the relations in which each of them stands to\nSchleiermacher, who famously defined religion as the feeling of utter\ndependence. Whereas Hegel had “rebuked” Schleiermacher for\nabdicating the truth-claims of the Christian faith by taking the\narticles of faith as expressions of this feeling, Feuerbach says he\ndoes so only because Schleiermacher was prevented by his\n“theological prejudice” from drawing the unavoidable\nconclusion that, “if feeling is subjectively what religion is\nchiefly about, then God is objectively nothing but the essence of\nfeeling” (B 230). These comments fail to acknowledge\nthat, in The Essence of Christianity, Feuerbach had conceived\nof God as an alienated projection of the human species-essence, which\nwas said to include not only feeling, but reason and will, as\nwell. They nevertheless reflect Feuerbach’s generally overlooked\ndeployment against Hegel of resources derived from the philosophies of\nfeeling of Schleiermacher and\n Jacobi,[18]\n and they indicate the direction in which his thinking about religion\ncontinued to move after the publication of The Essence of\nChristianity, namely, away from an emphasis on\nspecies-consciousness conceived along Hegelian lines, and toward what\nHarvey has aptly referred to as the\n“naturalist-existentialist” themes that predominate in his\nlater writings on religion (cf. Harvey 1995). These are discussed in\n Section 6\n below.\n",
    "section_title": "4. The Critique of Christianity",
    "entry_title": "Ludwig Andreas Feuerbach",
    "hierarchy_title": "Ludwig Andreas Feuerbach || The Critique of Christianity",
    "tokenized_text": [
        "critique",
        "christianity",
        "critique",
        "christianity",
        "section",
        "preface",
        "second",
        "edition",
        "essence",
        "christianity",
        "eliot",
        "omitted",
        "translation",
        "feuerbach",
        "reveals",
        "sought",
        "book",
        "achieve",
        "two",
        "thing",
        "first",
        "attack",
        "hegelian",
        "claim",
        "identity",
        "religious",
        "philosophical",
        "truth",
        "showing",
        "hegel",
        "succeeds",
        "reconciling",
        "religion",
        "philosophy",
        "robbing",
        "religion",
        "distinctive",
        "content",
        "second",
        "place",
        "socalled",
        "positive",
        "philosophy",
        "fatal",
        "light",
        "showing",
        "original",
        "idolatrous",
        "image",
        "god",
        "götzenbild",
        "man",
        "flesh",
        "blood",
        "belong",
        "personality",
        "essentially",
        "wc",
        "appreciation",
        "objective",
        "requires",
        "clarification",
        "historical",
        "context",
        "feuerbach",
        "book",
        "appeared",
        "namely",
        "one",
        "year",
        "ascension",
        "prussian",
        "throne",
        "romantic",
        "conservative",
        "friedrich",
        "wilhelm",
        "iv",
        "new",
        "king",
        "inner",
        "circle",
        "adviser",
        "consisted",
        "devout",
        "aristocrat",
        "closely",
        "associated",
        "neopietist",
        "awakening",
        "sought",
        "establish",
        "germanchristian",
        "state",
        "bulwark",
        "influence",
        "subversive",
        "idea",
        "continent",
        "also",
        "saw",
        "death",
        "prussian",
        "minister",
        "culture",
        "karl",
        "vom",
        "stein",
        "zum",
        "altenstein",
        "supporter",
        "hegelian",
        "cause",
        "bearer",
        "hope",
        "young",
        "hegelian",
        "academic",
        "advancement",
        "prussian",
        "state",
        "informed",
        "progressive",
        "protestant",
        "ethos",
        "amenable",
        "freedom",
        "theoretical",
        "inquiry",
        "wedge",
        "driven",
        "outcry",
        "surrounding",
        "appearance",
        "strauss",
        "book",
        "right",
        "left",
        "wing",
        "hegelian",
        "camp",
        "made",
        "center",
        "position",
        "increasingly",
        "untenable",
        "policy",
        "altenstein",
        "successor",
        "including",
        "appointment",
        "schelling",
        "chair",
        "berlin",
        "formerly",
        "occupied",
        "hegel",
        "aimed",
        "instead",
        "slaying",
        "dragonseed",
        "hegelian",
        "pantheism",
        "university",
        "prussian",
        "jurisdiction",
        "cf",
        "pinkard",
        "time",
        "feuerbach",
        "published",
        "famous",
        "book",
        "essence",
        "christianity",
        "sought",
        "develop",
        "philosophy",
        "positive",
        "religion",
        "revelation",
        "wc",
        "begun",
        "move",
        "away",
        "earlier",
        "idealistic",
        "pantheism",
        "nevertheless",
        "sought",
        "book",
        "criticize",
        "hegelian",
        "speculative",
        "theology",
        "positive",
        "philosophy",
        "standpoint",
        "taken",
        "spinoza",
        "theologicopolitical",
        "treatise",
        "vwr",
        "cf",
        "wc",
        "often",
        "overlooked",
        "one",
        "point",
        "treatise",
        "spinoza",
        "observes",
        "biblical",
        "author",
        "imagined",
        "god",
        "ruler",
        "legislator",
        "king",
        "merciful",
        "etc",
        "despite",
        "fact",
        "latter",
        "merely",
        "attribute",
        "human",
        "nature",
        "far",
        "removed",
        "divine",
        "nature",
        "spinoza",
        "christianity",
        "feuerbach",
        "make",
        "similar",
        "distinction",
        "metaphysical",
        "personal",
        "divine",
        "predicate",
        "god",
        "considered",
        "theoretical",
        "object",
        "rational",
        "reflection",
        "god",
        "god",
        "timeless",
        "impassible",
        "entity",
        "unaffected",
        "human",
        "suffering",
        "ultimately",
        "indistinguishable",
        "reason",
        "consciousness",
        "human",
        "nullity",
        "bound",
        "consciousness",
        "way",
        "religious",
        "consciousness",
        "much",
        "characteristic",
        "skeptic",
        "materialist",
        "naturalist",
        "pantheist",
        "wc",
        "god",
        "personal",
        "predicate",
        "concern",
        "religious",
        "believer",
        "god",
        "exists",
        "object",
        "theoretical",
        "contemplation",
        "feeling",
        "imagination",
        "prayerful",
        "supplication",
        "whereas",
        "metaphysical",
        "predicate",
        "serve",
        "external",
        "point",
        "support",
        "religion",
        "wc",
        "thought",
        "one",
        "apply",
        "first",
        "person",
        "trinity",
        "ie",
        "god",
        "abstract",
        "universality",
        "second",
        "person",
        "trinity",
        "virtue",
        "subjected",
        "salvation",
        "humanity",
        "humble",
        "birth",
        "ignominious",
        "death",
        "sole",
        "true",
        "first",
        "person",
        "religion",
        "wc",
        "doctrine",
        "incarnation",
        "feuerbach",
        "argues",
        "hegel",
        "christian",
        "believer",
        "symbolic",
        "representation",
        "eternal",
        "procession",
        "return",
        "infinite",
        "spirit",
        "back",
        "finite",
        "manifestation",
        "rather",
        "tear",
        "divine",
        "compassion",
        "mitleid",
        "wc",
        "act",
        "sacred",
        "heart",
        "able",
        "sympathize",
        "human",
        "suffering",
        "god",
        "compelled",
        "love",
        "humanity",
        "renounce",
        "divinity",
        "become",
        "human",
        "feuerbach",
        "take",
        "proof",
        "man",
        "already",
        "god",
        "already",
        "god",
        "god",
        "became",
        "man",
        "ibid",
        "ie",
        "belief",
        "divine",
        "compassion",
        "involves",
        "attribution",
        "projection",
        "onto",
        "god",
        "moral",
        "sentiment",
        "experienced",
        "capable",
        "suffering",
        "god",
        "god",
        "essence",
        "christianity",
        "divided",
        "two",
        "part",
        "first",
        "part",
        "feuerbach",
        "considers",
        "religion",
        "agreement",
        "human",
        "essence",
        "wc",
        "argues",
        "purportedly",
        "theological",
        "claim",
        "understood",
        "proper",
        "sense",
        "recognized",
        "expressing",
        "anthropological",
        "rather",
        "theological",
        "truth",
        "predicate",
        "religious",
        "believer",
        "apply",
        "god",
        "predicate",
        "properly",
        "apply",
        "human",
        "speciesessence",
        "god",
        "imaginary",
        "representation",
        "second",
        "part",
        "feuerbach",
        "considers",
        "religion",
        "contradiction",
        "human",
        "essence",
        "wc",
        "argues",
        "theological",
        "claim",
        "understood",
        "sense",
        "ordinarily",
        "taken",
        "ie",
        "referring",
        "nonhuman",
        "divine",
        "person",
        "selfcontradictory",
        "early",
        "feuerbach",
        "still",
        "preferred",
        "view",
        "presented",
        "public",
        "label",
        "anthropotheism",
        "rather",
        "atheism",
        "gw",
        "v",
        "emphasizing",
        "overriding",
        "purpose",
        "negating",
        "false",
        "theological",
        "essence",
        "religion",
        "affirm",
        "true",
        "anthropological",
        "essence",
        "ie",
        "divinity",
        "man",
        "feuerbach",
        "begin",
        "essence",
        "christianity",
        "proposing",
        "since",
        "human",
        "being",
        "religion",
        "animal",
        "key",
        "understanding",
        "religion",
        "must",
        "directly",
        "related",
        "whatever",
        "essentially",
        "distinguishes",
        "human",
        "being",
        "animal",
        "maintains",
        "distinctive",
        "kind",
        "consciousness",
        "involved",
        "cognition",
        "universal",
        "endowed",
        "speciesconsciousness",
        "able",
        "take",
        "essential",
        "nature",
        "object",
        "thought",
        "capacity",
        "thought",
        "conceived",
        "capacity",
        "engage",
        "internal",
        "dialogue",
        "thus",
        "aware",
        "oneself",
        "containing",
        "thou",
        "generic",
        "act",
        "thinking",
        "human",
        "individual",
        "stand",
        "relation",
        "specie",
        "nonhuman",
        "animal",
        "human",
        "being",
        "qua",
        "biological",
        "organism",
        "incapable",
        "standing",
        "human",
        "conscious",
        "human",
        "conscious",
        "thinking",
        "also",
        "willing",
        "feeling",
        "power",
        "thinking",
        "light",
        "knowledge",
        "de",
        "erkenntnis",
        "power",
        "energy",
        "character",
        "power",
        "heart",
        "love",
        "wc",
        "power",
        "individual",
        "disposal",
        "rather",
        "power",
        "manifest",
        "psychologically",
        "form",
        "nonegoistic",
        "speciesdrives",
        "gattungstriebe",
        "individual",
        "periodically",
        "find",
        "overwhelmed",
        "especially",
        "poet",
        "thinker",
        "whose",
        "work",
        "speciesessence",
        "clearly",
        "instantiated",
        "manifestation",
        "include",
        "experience",
        "erotic",
        "platonic",
        "love",
        "drive",
        "knowledge",
        "experience",
        "moved",
        "emotion",
        "expressed",
        "music",
        "voice",
        "conscience",
        "compels",
        "u",
        "moderate",
        "desire",
        "avoid",
        "infringing",
        "freedom",
        "others",
        "compassion",
        "admiration",
        "urge",
        "overcome",
        "moral",
        "intellectual",
        "limitation",
        "latter",
        "urge",
        "feuerbach",
        "contends",
        "presupposes",
        "awareness",
        "individual",
        "limitation",
        "limitation",
        "speciesessence",
        "function",
        "thus",
        "norm",
        "ideal",
        "toward",
        "individual",
        "effort",
        "selftranscendence",
        "directed",
        "individual",
        "human",
        "limited",
        "physically",
        "morally",
        "physical",
        "existence",
        "limited",
        "time",
        "space",
        "also",
        "limitedand",
        "often",
        "painfully",
        "aware",
        "soin",
        "intellectual",
        "moral",
        "capacity",
        "experience",
        "painful",
        "limitation",
        "inability",
        "thing",
        "others",
        "kind",
        "able",
        "recognizing",
        "limitation",
        "simultaneously",
        "recognize",
        "limitation",
        "specie",
        "either",
        "would",
        "aware",
        "would",
        "experience",
        "awareness",
        "painful",
        "example",
        "reprove",
        "cowardice",
        "aware",
        "bravery",
        "others",
        "lack",
        "stinginess",
        "aware",
        "generosity",
        "others",
        "lack",
        "experience",
        "consciencetaken",
        "broad",
        "sense",
        "awareness",
        "one",
        "moral",
        "intellectual",
        "shortcoming",
        "inadequaciesthus",
        "presupposes",
        "speciesconsciousness",
        "form",
        "awareness",
        "quality",
        "one",
        "find",
        "oneself",
        "lacking",
        "imagine",
        "oneself",
        "circumstance",
        "possessing",
        "feuerbach",
        "central",
        "claim",
        "essence",
        "christianity",
        "christian",
        "theism",
        "predicated",
        "upon",
        "alienated",
        "form",
        "human",
        "selfconsciousness",
        "wherein",
        "human",
        "being",
        "relate",
        "human",
        "speciesessence",
        "though",
        "distinct",
        "although",
        "developing",
        "claim",
        "feuerbach",
        "clearly",
        "influenced",
        "hegel",
        "account",
        "unhappy",
        "consciousness",
        "phenomenology",
        "ameriks",
        "contention",
        "feuerbach",
        "philosophical",
        "doctrine",
        "understood",
        "little",
        "filling",
        "detail",
        "hegel",
        "scathing",
        "account",
        "orthodox",
        "christianity",
        "form",
        "unhappy",
        "consciousness",
        "ameriks",
        "problematic",
        "several",
        "reason",
        "first",
        "overlook",
        "likelihood",
        "hegel",
        "understood",
        "analysis",
        "unhappy",
        "consciousness",
        "apply",
        "otherworldliness",
        "associated",
        "medieval",
        "catholicism",
        "perhaps",
        "otherworldly",
        "religion",
        "generally",
        "case",
        "type",
        "protestantism",
        "regarded",
        "religion",
        "modern",
        "age",
        "hegel",
        "found",
        "sacred",
        "secular",
        "reconciled",
        "second",
        "overlook",
        "fact",
        "feuerbach",
        "appropriation",
        "theme",
        "found",
        "hegel",
        "account",
        "unhappy",
        "consciousness",
        "occurs",
        "context",
        "explicit",
        "albeit",
        "incomplete",
        "repudiation",
        "hegel",
        "philosophy",
        "spirit",
        "unlike",
        "hegel",
        "conceives",
        "unhappy",
        "consciousness",
        "moment",
        "development",
        "human",
        "selfconsciousness",
        "also",
        "moment",
        "comingtobeforitself",
        "absolute",
        "feuerbach",
        "time",
        "reached",
        "conclusion",
        "one",
        "distinguish",
        "absolute",
        "spirit",
        "subjective",
        "spirit",
        "essence",
        "man",
        "without",
        "end",
        "continuing",
        "occupy",
        "old",
        "standpoint",
        "theology",
        "vt",
        "third",
        "overlook",
        "significance",
        "feuerbach",
        "emphasis",
        "importance",
        "grasping",
        "essence",
        "religion",
        "precisely",
        "subjective",
        "aspect",
        "religious",
        "consciousness",
        "imagination",
        "feeling",
        "hegel",
        "regarded",
        "inessential",
        "secondary",
        "importance",
        "finally",
        "connection",
        "third",
        "point",
        "overlook",
        "significance",
        "feuerbach",
        "agreement",
        "spinoza",
        "hegel",
        "faith",
        "requires",
        "much",
        "truth",
        "piety",
        "spinoza",
        "short",
        "essay",
        "published",
        "sought",
        "clarify",
        "difference",
        "approach",
        "philosophy",
        "religion",
        "hegel",
        "feuerbach",
        "suggested",
        "difference",
        "evident",
        "relation",
        "stand",
        "schleiermacher",
        "famously",
        "defined",
        "religion",
        "feeling",
        "utter",
        "dependence",
        "whereas",
        "hegel",
        "rebuked",
        "schleiermacher",
        "abdicating",
        "truthclaims",
        "christian",
        "faith",
        "taking",
        "article",
        "faith",
        "expression",
        "feeling",
        "feuerbach",
        "say",
        "schleiermacher",
        "prevented",
        "theological",
        "prejudice",
        "drawing",
        "unavoidable",
        "conclusion",
        "feeling",
        "subjectively",
        "religion",
        "chiefly",
        "god",
        "objectively",
        "nothing",
        "essence",
        "feeling",
        "b",
        "comment",
        "fail",
        "acknowledge",
        "essence",
        "christianity",
        "feuerbach",
        "conceived",
        "god",
        "alienated",
        "projection",
        "human",
        "speciesessence",
        "said",
        "include",
        "feeling",
        "reason",
        "well",
        "nevertheless",
        "reflect",
        "feuerbach",
        "generally",
        "overlooked",
        "deployment",
        "hegel",
        "resource",
        "derived",
        "philosophy",
        "feeling",
        "schleiermacher",
        "jacobi",
        "indicate",
        "direction",
        "thinking",
        "religion",
        "continued",
        "move",
        "publication",
        "essence",
        "christianity",
        "namely",
        "away",
        "emphasis",
        "speciesconsciousness",
        "conceived",
        "along",
        "hegelian",
        "line",
        "toward",
        "harvey",
        "aptly",
        "referred",
        "naturalistexistentialist",
        "theme",
        "predominate",
        "later",
        "writing",
        "religion",
        "cf",
        "harvey",
        "discussed",
        "section"
    ]
}