{
    "main_text": "Early Work\n3. Early Work\n\nIn the years before World War I, Łukasiewicz worked predominantly\non matters to do with the methodology of science. His doctorate,\npublished in 1903 as “On induction as the inverse of\ndeduction”, investigated the relationship between the two forms\nof reasoning, in the light of work by Jevons, Sigwart and Erdmann.\nInductive reasoning, proceeding from singular empirical statements,\nattempts on his early view to reach a general conclusion to which a\ncertain probability can be ascribed. But he soon shifted to the view\nthat it is impossible to ascribe a determinate probability to a\ngeneral statement on the basis of induction. Rather the method of the\nempirical sciences is to creatively hazard the thought that a certain\ngeneralization is true, deduce singular conclusions from this, and\nthen see whether these are true. If one conclusion is not, then the\ngeneral statement is refuted. This, an early formulation of the\nhypothetico-deductive method of science, anticipates the ideas of\nPopper by more than two decades, though expressed less forcefully.\nŁukasiewicz also anticipated Popper by stressing what he called\n“creative elements in science”, against the idea that the\nscientist’s task is to reproduce or replicate the facts.\n\nIn 1906 Łukasiewicz published a substantial piece,\n“Analysis and construction of the concept of cause”, which\ngained him his Habilitation in Lwów. It is significant\nboth for its carefully argued method and for presaging themes that\nwere to occupy him later. Taking concepts platonistically as abstract\nobjects, Łukasiewicz rejects psychological, subjective and\nregularity accounts of causality and accepts that cause and effect are\nlinked by necessity, which he identifies with logical necessity:\n“a causal relation is a necessary relation, and the relative\nfeature […] due to which we call some object a cause, is the\nfeature ‘entailing or bringing-about with\nnecessity’.” The piece’s motto is Arceo\npsychologiam, “Reject psychology”, marking a clear\nbreak with Twardowski and Brentano, while the logical analysis is\naimed at extracting the logical features of the notion of cause. It is\na clear example of what later came to be called ‘analytic\nphilosophy’, and shows Łukasiewicz bringing logical\nconcepts to bear on scientifically central concepts, as he was later\nto do with his logical analysis of determinism.\n\nAn interest in probability lay behind one of Łukasiewicz’s\ntwo monographs published before the war, namely Logical\nFoundations of Probability Theory, which was written and\npublished not in Polish but in German. In 1908 and 1909\nŁukasiewicz visited Graz where both Alexius Meinong and Ernst\nMally were also working on probability theory at this time, so it is\nlikely that the book was written in German because their language of\ndiscussion was German, and also in order to ensure a wider audience.\nŁukasiewicz’s theory makes constructive use of ideas\nplucked from elsewhere: from Frege he took the idea of a truth-value,\nfrom Whitehead and Russell the idea of an indefinite proposition, and\nfrom Bolzano the idea of the ratio of true values to all values for a\nproposition. Consider the classical urn example, where an urn contains\nm black balls and n white balls. Let the indefinite\nproposition ‘\\(x\\) is a black ball in this urn’ be such\nthat the variable ‘\\(x\\)’ may take as value any expression\nnaming a ball in the urn: the variable is then said to range\nover the individual balls, and different expressions naming the\nsame ball to have the same value. (Note that Łukasiewicz indeed\nuses the terminology, later associated with Quine, of a variable\ntaking values, here expressions, and ranging over objects designated\nby said expressions.) An indefinite proposition is said to be true if\nit yields a true proposition (Łukasiewicz says\n‘judgement’ for a definite proposition) for all values of\nits variables, it is false if it yields a false judgement for all\nvalues, and is neither true nor false if it yields true judgements for\nsome values and false judgements for others. The ratio true values/all\nvalues is then called by Łukasiewicz the truth-value of\nthe indefinite proposition. For true indefinites it is 1, for false\nindefinites it is 0, and for others it is a rational number between 0\nand 1 (rational because only finite domains are considered). In our\nurn case the truth-value of the indefinite proposition\n‘x is a black ball in this urn’ is\n\\(\\frac{m}{m+n}\\).\n\nOn this basis Łukasiewicz develops a calculus of truth-values in\nwhich he can deal with logically complex propositions, conditional\nprobability, probabilistic independence, and derive Bayes’\nTheorem. The calculus of truth-values is used as a logical\ntheory of probability, assisting us in our dealings with definite\nreality: Łukasiewicz denies that there can be a theory either of\nobjective or of subjective probability as such. Two ideas from this\nshort but remarkable work are worth emphasizing because they resonate\nwith later ones of Łukasiewicz. Firstly, there is the idea of a\nproposition (in this case an indefinite proposition) being neither\ntrue nor false; secondly, and connected with this, of such a\nproposition having a numerical truth-value properly between 0 (false)\nand 1 (true). Łukasiewicz’s theory deserves to be better\nknown: it continues and extends earlier ideas of Bolzano, his\nprobability corresponding to the latter’s degree of validity of\na proposition (with respect to variable components). Its chief\ndrawback is that it is formulated for finite domains only.\n\nOf all the works Łukasiewicz published before World War I, one\nmost clearly anticipated his later concerns. This was the 1910\nmonograph On the Principle of Contradiction in Aristotle. It\nmarked a crucial turning point in the development of the\nLwów-Warsaw school. For Łukasiewicz it represented the\nfirst sustained questioning of the assumptions of traditional\nAristotelian logic.\n\nŁukasiewicz introduces the project of his monograph, a critical\ninvestigation of the legitimacy of the Principle of Contradiction (PC)\nas variously formulated by Aristotle, in the context of its critique\nby Hegel and the opportunity to re-examine the PC in the light of the\ndevelopment of mathematical logic from Boole to Russell.\nŁukasiewicz’s sources for the post-Hegelian discussion of\nthe ‘logical question’ are Ueberweg, Trendelenburg and\nSigwart. A more local background was probably Twardowski’s\naccount of the absolute and timeless nature of truth.\n\nŁukasiewicz distinguishes three different, non-equivalent\nversions of PC in Aristotle: an ontological version, a logical\nversion, and a psychological version, as follows:\n\nOntological (OPC): No object may at the same time possess and\nnot possess the same property.\n\nLogical (LPC): Contradictory statements are not\nsimultaneously true.\n\nPsychological (PPC): No one can simultaneously believe\ncontradictory things.\n\nŁukasiewicz criticises Aristotle for on the one hand claiming PC\ncannot be proved, and on the other hand attempting an indirect or\npragmatic “proof”. In partial agreement with the tradition\naccording to which PC is not the cornerstone or basic principle of\nlogic, Łukasiewicz claims that its status is less secure than\nsome other logical propositions, and that its function is principally\nto serve as a pragmatic norm. Nevertheless, in an Appendix to the book\nhe gives a formal derivation of one version of PC from other\nassumptions. This shows that PC is as it were just one logical theorem\namong others, a statement that would raise few eyebrows today but was\nfairly radical in its day. Among the assumptions used in the\nderivation is a version of the Principle of Bivalence, that every\nproposition is either true or false and none is both, so the\nderivation of PC is not after all such a surprise.\n\nŁukasiewicz described himself later as attempting in the\nmonograph to devise a “non-Aristotelian logic” but admits\nthat he did not succeed, principally because at this stage he was not\nprepared to reject the principle of bivalence. It may well be\nMeinong’s influence at work when Łukasiewicz comes to give\nhis natural-language renderings of the symbolism of Couturat’s\nalgebra of logic in the Appendix. There is little or no trace of the\npropositional logic that Łukasiewicz was to make very much his\nown: the renderings are clumsily object-theoretic: the constant\n‘0’ for example, which might be naturally construed as a\nconstant false proposition (and is so in later Łukasiewicz) is\nrendered as “the object that does not exist”. This is one\nreason why Łukasiewicz’s formal work in the Appendix to the\n1910 work appears relatively archaic. While the variable letters like\n\\(a, b\\) etc. “signify affirmative statements” and their\nnegations \\(a', b'\\) etc. “signify negative statements”,\nand in practice do work like propositional variables and their\nnegations in modern propositional logic, Łukasiewicz’s\nrenderings of them are curiously hybrid: ‘\\(a\\)’ is\nrendered as ‘\\(X\\) contains \\(a\\)’ and\n‘\\(a'\\)’ as ‘\\(X\\) contains no \\(a\\)’, while\n‘1’ signifies ‘\\(X\\) is an object’ and\n‘0’ signifies ‘\\(X\\) is not an object’. This\nis all very confused, and by no means a classical sentential logic in\nintent, even if it works like one in practice.\n\nWhile not in itself a success, the book shows Łukasiewicz on the\nthreshold of his later logical breakthroughs. It was read in 1911 by\nthe young Leśniewski, who sought against Łukasiewicz to\nprove OPC, and who first introduced himself in 1912 on\nŁukasiewicz’s doorstep with the words, “I am\nLeśniewski, and I have come to show you the proofs of an article\nI have written against you.” The book also contains a brief\ndiscussion of Russell’s Paradox, and it was reading this that\ninspired Leśniewski to become a logician, intent on providing a\nparadox-free logical foundation for mathematics. The book promoted\nfurther discussion in Lwów: Kotarbiński wrote in defense\nof Aristotle’s idea, discussed by Łukasiewicz, that a\nstatement about future contingent events may lack a truth-value before\nthe event and only gain one afterwards, while Leśniewski wrote in\nopposition to this and brought Kotarbiński round to his own view\n(which agreed with earlier views of Twardowski and later ones of\nTarski) that truth is timeless, or as Leśniewski expressed it,\nboth eternal and sempiternal. Łukasiewicz was soon to side with\nthe earlier Kotarbiński, and in so doing to make his most famous\ndiscovery, that of many-valued logic.\n",
    "section_title": "3. Early Work",
    "entry_title": "Jan Łukasiewicz",
    "hierarchy_title": "Jan Łukasiewicz || Early Work",
    "tokenized_text": [
        "early",
        "work",
        "early",
        "work",
        "year",
        "world",
        "war",
        "łukasiewicz",
        "worked",
        "predominantly",
        "matter",
        "methodology",
        "science",
        "doctorate",
        "published",
        "induction",
        "inverse",
        "deduction",
        "investigated",
        "relationship",
        "two",
        "form",
        "reasoning",
        "light",
        "work",
        "jevons",
        "sigwart",
        "erdmann",
        "inductive",
        "reasoning",
        "proceeding",
        "singular",
        "empirical",
        "statement",
        "attempt",
        "early",
        "view",
        "reach",
        "general",
        "conclusion",
        "certain",
        "probability",
        "ascribed",
        "soon",
        "shifted",
        "view",
        "impossible",
        "ascribe",
        "determinate",
        "probability",
        "general",
        "statement",
        "basis",
        "induction",
        "rather",
        "method",
        "empirical",
        "science",
        "creatively",
        "hazard",
        "thought",
        "certain",
        "generalization",
        "true",
        "deduce",
        "singular",
        "conclusion",
        "see",
        "whether",
        "true",
        "one",
        "conclusion",
        "general",
        "statement",
        "refuted",
        "early",
        "formulation",
        "hypotheticodeductive",
        "method",
        "science",
        "anticipates",
        "idea",
        "popper",
        "two",
        "decade",
        "though",
        "expressed",
        "le",
        "forcefully",
        "łukasiewicz",
        "also",
        "anticipated",
        "popper",
        "stressing",
        "called",
        "creative",
        "element",
        "science",
        "idea",
        "scientist",
        "task",
        "reproduce",
        "replicate",
        "fact",
        "łukasiewicz",
        "published",
        "substantial",
        "piece",
        "analysis",
        "construction",
        "concept",
        "cause",
        "gained",
        "habilitation",
        "lwów",
        "significant",
        "carefully",
        "argued",
        "method",
        "presaging",
        "theme",
        "occupy",
        "later",
        "taking",
        "concept",
        "platonistically",
        "abstract",
        "object",
        "łukasiewicz",
        "reject",
        "psychological",
        "subjective",
        "regularity",
        "account",
        "causality",
        "accepts",
        "cause",
        "effect",
        "linked",
        "necessity",
        "identifies",
        "logical",
        "necessity",
        "causal",
        "relation",
        "necessary",
        "relation",
        "relative",
        "feature",
        "due",
        "call",
        "object",
        "cause",
        "feature",
        "entailing",
        "bringingabout",
        "necessity",
        "piece",
        "motto",
        "arceo",
        "psychologiam",
        "reject",
        "psychology",
        "marking",
        "clear",
        "break",
        "twardowski",
        "brentano",
        "logical",
        "analysis",
        "aimed",
        "extracting",
        "logical",
        "feature",
        "notion",
        "cause",
        "clear",
        "example",
        "later",
        "came",
        "called",
        "analytic",
        "philosophy",
        "show",
        "łukasiewicz",
        "bringing",
        "logical",
        "concept",
        "bear",
        "scientifically",
        "central",
        "concept",
        "later",
        "logical",
        "analysis",
        "determinism",
        "interest",
        "probability",
        "lay",
        "behind",
        "one",
        "łukasiewicz",
        "two",
        "monograph",
        "published",
        "war",
        "namely",
        "logical",
        "foundation",
        "probability",
        "theory",
        "written",
        "published",
        "polish",
        "german",
        "łukasiewicz",
        "visited",
        "graz",
        "alexius",
        "meinong",
        "ernst",
        "mally",
        "also",
        "working",
        "probability",
        "theory",
        "time",
        "likely",
        "book",
        "written",
        "german",
        "language",
        "discussion",
        "german",
        "also",
        "order",
        "ensure",
        "wider",
        "audience",
        "łukasiewicz",
        "theory",
        "make",
        "constructive",
        "use",
        "idea",
        "plucked",
        "elsewhere",
        "frege",
        "took",
        "idea",
        "truthvalue",
        "whitehead",
        "russell",
        "idea",
        "indefinite",
        "proposition",
        "bolzano",
        "idea",
        "ratio",
        "true",
        "value",
        "value",
        "proposition",
        "consider",
        "classical",
        "urn",
        "example",
        "urn",
        "contains",
        "black",
        "ball",
        "n",
        "white",
        "ball",
        "let",
        "indefinite",
        "proposition",
        "x",
        "black",
        "ball",
        "urn",
        "variable",
        "x",
        "may",
        "take",
        "value",
        "expression",
        "naming",
        "ball",
        "urn",
        "variable",
        "said",
        "range",
        "individual",
        "ball",
        "different",
        "expression",
        "naming",
        "ball",
        "value",
        "note",
        "łukasiewicz",
        "indeed",
        "us",
        "terminology",
        "later",
        "associated",
        "quine",
        "variable",
        "taking",
        "value",
        "expression",
        "ranging",
        "object",
        "designated",
        "said",
        "expression",
        "indefinite",
        "proposition",
        "said",
        "true",
        "yield",
        "true",
        "proposition",
        "łukasiewicz",
        "say",
        "judgement",
        "definite",
        "proposition",
        "value",
        "variable",
        "false",
        "yield",
        "false",
        "judgement",
        "value",
        "neither",
        "true",
        "false",
        "yield",
        "true",
        "judgement",
        "value",
        "false",
        "judgement",
        "others",
        "ratio",
        "true",
        "valuesall",
        "value",
        "called",
        "łukasiewicz",
        "truthvalue",
        "indefinite",
        "proposition",
        "true",
        "indefinites",
        "false",
        "indefinites",
        "others",
        "rational",
        "number",
        "rational",
        "finite",
        "domain",
        "considered",
        "urn",
        "case",
        "truthvalue",
        "indefinite",
        "proposition",
        "x",
        "black",
        "ball",
        "urn",
        "frac",
        "mn",
        "basis",
        "łukasiewicz",
        "develops",
        "calculus",
        "truthvalues",
        "deal",
        "logically",
        "complex",
        "proposition",
        "conditional",
        "probability",
        "probabilistic",
        "independence",
        "derive",
        "bayes",
        "theorem",
        "calculus",
        "truthvalues",
        "used",
        "logical",
        "theory",
        "probability",
        "assisting",
        "u",
        "dealing",
        "definite",
        "reality",
        "łukasiewicz",
        "denies",
        "theory",
        "either",
        "objective",
        "subjective",
        "probability",
        "two",
        "idea",
        "short",
        "remarkable",
        "work",
        "worth",
        "emphasizing",
        "resonate",
        "later",
        "one",
        "łukasiewicz",
        "firstly",
        "idea",
        "proposition",
        "case",
        "indefinite",
        "proposition",
        "neither",
        "true",
        "false",
        "secondly",
        "connected",
        "proposition",
        "numerical",
        "truthvalue",
        "properly",
        "false",
        "true",
        "łukasiewicz",
        "theory",
        "deserves",
        "better",
        "known",
        "continues",
        "extends",
        "earlier",
        "idea",
        "bolzano",
        "probability",
        "corresponding",
        "latter",
        "degree",
        "validity",
        "proposition",
        "respect",
        "variable",
        "component",
        "chief",
        "drawback",
        "formulated",
        "finite",
        "domain",
        "work",
        "łukasiewicz",
        "published",
        "world",
        "war",
        "one",
        "clearly",
        "anticipated",
        "later",
        "concern",
        "monograph",
        "principle",
        "contradiction",
        "aristotle",
        "marked",
        "crucial",
        "turning",
        "point",
        "development",
        "lwówwarsaw",
        "school",
        "łukasiewicz",
        "represented",
        "first",
        "sustained",
        "questioning",
        "assumption",
        "traditional",
        "aristotelian",
        "logic",
        "łukasiewicz",
        "introduces",
        "project",
        "monograph",
        "critical",
        "investigation",
        "legitimacy",
        "principle",
        "contradiction",
        "pc",
        "variously",
        "formulated",
        "aristotle",
        "context",
        "critique",
        "hegel",
        "opportunity",
        "reexamine",
        "pc",
        "light",
        "development",
        "mathematical",
        "logic",
        "boole",
        "russell",
        "łukasiewicz",
        "source",
        "posthegelian",
        "discussion",
        "logical",
        "question",
        "ueberweg",
        "trendelenburg",
        "sigwart",
        "local",
        "background",
        "probably",
        "twardowski",
        "account",
        "absolute",
        "timeless",
        "nature",
        "truth",
        "łukasiewicz",
        "distinguishes",
        "three",
        "different",
        "nonequivalent",
        "version",
        "pc",
        "aristotle",
        "ontological",
        "version",
        "logical",
        "version",
        "psychological",
        "version",
        "follows",
        "ontological",
        "opc",
        "object",
        "may",
        "time",
        "posse",
        "posse",
        "property",
        "logical",
        "lpc",
        "contradictory",
        "statement",
        "simultaneously",
        "true",
        "psychological",
        "ppc",
        "one",
        "simultaneously",
        "believe",
        "contradictory",
        "thing",
        "łukasiewicz",
        "criticises",
        "aristotle",
        "one",
        "hand",
        "claiming",
        "pc",
        "proved",
        "hand",
        "attempting",
        "indirect",
        "pragmatic",
        "proof",
        "partial",
        "agreement",
        "tradition",
        "according",
        "pc",
        "cornerstone",
        "basic",
        "principle",
        "logic",
        "łukasiewicz",
        "claim",
        "status",
        "le",
        "secure",
        "logical",
        "proposition",
        "function",
        "principally",
        "serve",
        "pragmatic",
        "norm",
        "nevertheless",
        "appendix",
        "book",
        "give",
        "formal",
        "derivation",
        "one",
        "version",
        "pc",
        "assumption",
        "show",
        "pc",
        "one",
        "logical",
        "theorem",
        "among",
        "others",
        "statement",
        "would",
        "raise",
        "eyebrow",
        "today",
        "fairly",
        "radical",
        "day",
        "among",
        "assumption",
        "used",
        "derivation",
        "version",
        "principle",
        "bivalence",
        "every",
        "proposition",
        "either",
        "true",
        "false",
        "none",
        "derivation",
        "pc",
        "surprise",
        "łukasiewicz",
        "described",
        "later",
        "attempting",
        "monograph",
        "devise",
        "nonaristotelian",
        "logic",
        "admits",
        "succeed",
        "principally",
        "stage",
        "prepared",
        "reject",
        "principle",
        "bivalence",
        "may",
        "well",
        "meinong",
        "influence",
        "work",
        "łukasiewicz",
        "come",
        "give",
        "naturallanguage",
        "rendering",
        "symbolism",
        "couturat",
        "algebra",
        "logic",
        "appendix",
        "little",
        "trace",
        "propositional",
        "logic",
        "łukasiewicz",
        "make",
        "much",
        "rendering",
        "clumsily",
        "objecttheoretic",
        "constant",
        "example",
        "might",
        "naturally",
        "construed",
        "constant",
        "false",
        "proposition",
        "later",
        "łukasiewicz",
        "rendered",
        "object",
        "exist",
        "one",
        "reason",
        "łukasiewicz",
        "formal",
        "work",
        "appendix",
        "work",
        "appears",
        "relatively",
        "archaic",
        "variable",
        "letter",
        "like",
        "b",
        "etc",
        "signify",
        "affirmative",
        "statement",
        "negation",
        "b",
        "etc",
        "signify",
        "negative",
        "statement",
        "practice",
        "work",
        "like",
        "propositional",
        "variable",
        "negation",
        "modern",
        "propositional",
        "logic",
        "łukasiewicz",
        "rendering",
        "curiously",
        "hybrid",
        "a",
        "rendered",
        "x",
        "contains",
        "a",
        "a",
        "x",
        "contains",
        "a",
        "signifies",
        "x",
        "object",
        "signifies",
        "x",
        "object",
        "confused",
        "mean",
        "classical",
        "sentential",
        "logic",
        "intent",
        "even",
        "work",
        "like",
        "one",
        "practice",
        "success",
        "book",
        "show",
        "łukasiewicz",
        "threshold",
        "later",
        "logical",
        "breakthrough",
        "read",
        "young",
        "leśniewski",
        "sought",
        "łukasiewicz",
        "prove",
        "opc",
        "first",
        "introduced",
        "łukasiewicz",
        "doorstep",
        "word",
        "leśniewski",
        "come",
        "show",
        "proof",
        "article",
        "written",
        "you",
        "book",
        "also",
        "contains",
        "brief",
        "discussion",
        "russell",
        "paradox",
        "reading",
        "inspired",
        "leśniewski",
        "become",
        "logician",
        "intent",
        "providing",
        "paradoxfree",
        "logical",
        "foundation",
        "mathematics",
        "book",
        "promoted",
        "discussion",
        "lwów",
        "kotarbiński",
        "wrote",
        "defense",
        "aristotle",
        "idea",
        "discussed",
        "łukasiewicz",
        "statement",
        "future",
        "contingent",
        "event",
        "may",
        "lack",
        "truthvalue",
        "event",
        "gain",
        "one",
        "afterwards",
        "leśniewski",
        "wrote",
        "opposition",
        "brought",
        "kotarbiński",
        "round",
        "view",
        "agreed",
        "earlier",
        "view",
        "twardowski",
        "later",
        "one",
        "tarski",
        "truth",
        "timeless",
        "leśniewski",
        "expressed",
        "eternal",
        "sempiternal",
        "łukasiewicz",
        "soon",
        "side",
        "earlier",
        "kotarbiński",
        "make",
        "famous",
        "discovery",
        "manyvalued",
        "logic"
    ]
}