{
    "main_text": "History and Class Consciousness || Reification Theory\n3.1 Reification Theory\n\nAt the foundation of this new conception lies the theory of\nreification that Lukács introduces in the essay\n“Reification and the Consciousness of the Proletariat.”\nThis essay is credited not only with being one of the foundational\ntexts of “Western Marxism” (Anderson 1976), but also with\nspelling out the paradigmatic “central problem”\n(Brunkhorst 1998) of critical theory.\n\nLukács frames his argument as an extension of Marx’s analysis\nof the “fetishism of the commodity form” in Capital I\n(Marx [1867] 1992: 163–176), where Marx refers to the fact\nthat social relations between producers of commodities appear in\ncapitalism under the guise of objective, calculable, properties of\nthings (“value”). \n\nWhile in Marx the form that social relations acquire due to this\nfetishism (i.e., a form that furnishes commodities with features that\nmake taking an instrumental, quantifying attitude towards\nthem—and ultimately towards social relations\nthemselves—appropriate) is analyzed mainly with regard to how it\ndistorts the relationship between subjects and their economic\ncircumstances, Lukács adopts a far more radical claim. The\ncommodity form, he argues, has gradually become the “universal\ncategory of society as a whole” (1923a: 86). In capitalist\nsocieties, the commodity form even becomes the dominant form of\nobjectivity itself (Gegenständlichkeitsform). Drawing\non debates in contemporary Neo-Kantian thought (see Lotz 2020:\n27–31; Feenberg 2017: 113; Kavoulakos 2018), Lukács\nremains committed to the Kantian idea that the condition of the\npossibility of synthesizing our experience into an experience of\nobjects depends on our having access to “forms,” which\nthus have a transcendental status. In contrast to Kant, however,\nLukács understands these forms as both socially shared and\nhistorically variable. In capitalist societies in particular, the\ncommodity form thus becomes the transcendental determining factor of\nboth objectivity and subjectivity.\n\nBoth the objective and the subjective dimension of the emergence of\nthe commodity form are analyzed by Lukács as emerging from\nconcrete changes to the economic structure. On the objective side,\nwhen industrial work processes become rationalized as a result of\ntheir subsumption under the dominance of commodity exchange, these\nprocesses no longer display the typical “unity” of\nintentionally integrated human work. As each individual labor effort\ncan in principle constitute an input to many products, each operation\nis related to a “set of heterogeneous use-values” (1923a:\n89) and thus no longer forms part of a unique, unified work process.\nOn the subjective side, reification entails the fragmentation of human\nexperience, leading to an attitude of “contemplation” in\nwhich one passively adapts to a law-like system of social\n“second nature” and to an objectifying stance towards\none’s own mental states and capacities.\n\nAs Lukács writes concerning the commodity form:\n\n[it] stamps its imprint upon the whole consciousness of man; his\nqualities and abilities are no longer an organic part of his\npersonality, they are things which he can “own” or\n“dispose of” like the various objects of the external\nworld. And there is no natural form in which human relations can be\ncast, no way in which man can bring his physical and psychic\n“qualities” into play without their being subjected\nincreasingly to this reifying process. (1923a: 100)\n\nLukács calls this development “reification.” It is\na process that primarily affects the objective way in which human\nbeings relate to the totality of social relationships that is\nconstitutive of the meaning of their actions, separating this totality\n(and thus the meaning of their actions) from their self-understanding\nand establishing it as a form of objective reality. Derivatively, the\nsocially created features of objects (primarily their features as\ncommodities), relations between individual people, and their relations\nto themselves also acquire the character of a subject-independent,\nalien objectivity (Stahl 2011). The objective and subjective\ndimensions of the dominance of the commodity form constitute a complex\nof reification because the properties of objects, subjects, and social\nrelations become “thing-like” in this particular way.\nThese properties become independent, quantifiable, non-relational\nfeatures that must remain alien to any subjective meaning that one\ncould attach to them.\n\nWith this description of the way in which the dynamics of capitalist\nsociety affect not only people materially but the very form of\nobjectivity by which they can relate to the world, Lukács\ncombines Weber’s theory of rationalization, Simmel’s theory of\nmodern culture, and his own idea of a modern contradiction between\n“form” and “life” (see Dannemann 1987) with\nMarx’s theory of value. The resulting theory of reification as a\nsocially induced pathology not only had considerable influence on the\nFrankfurt School (Stahl 2018; on Lukács’s influence on\nAdorno, see Schiller 2011 and Braunstein/Duckheim 2015; on the\nengagement of the later generations of Frankfurt School criticism with\nLukács, see Habermas 1984: 355–365; Honneth 2008; cf.\nalso Chari 2010, Kavoulakos 2017) but also led Lucien Goldmann to\nspeculate that Heidegger’s Being and Time should be read as\nan answer to Lukács (Goldmann 1977).\n\nThe theory of social rationalization on which Lukács’s\nargument rests goes beyond a mere description of economic relations,\ntowards a theory of cultural change. The core of this argument is the\nclaim that the dominance of the commodity form in the economic sphere\nmust necessarily lead to the dominance of rational\ncalculation and formal reason in society as a whole and\nwill consequently involve a break with the organic unity and totality\nof previous forms of human existence. By forcing politics and law to\nadapt to the demands of capitalist exchange, the commodity form\ntransforms these spheres into a mode of rational calculability (a line\nof thought that clearly stems from Weber)—which helps to explain\nthe rise of the bureaucratic state and the dominance of formal,\npositive law that continues to alienate individuals from society and\nencourages their passivity in the face of objectified, mechanical\nrules (1923a: 98).\n\nThis development leads to a contradictory situation on both the\npractical and the theoretical level: because the process of\nrationalization precludes grasping society as a totality, it cannot\never succeed in making society subject to rational calculation in its\nentirety, for it must exclude all irrational, qualitative dimensions\nfrom such calculation. Here, Lukács rephrases his earlier\nargument regarding the tension between form and life in Marxist terms\n(López 2019: 72), as an inability of theories that express a reified\nperspective to grasp the concrete, material content of history. One\nexample, Lukács alleges, is the inability of economics as a\nscience to explain the movements of the economy (1923a:\n105–107). The same holds for formalist models of law, which\ncannot theoretically acknowledge the interdependence of their\nprinciples and their social content and must therefore treat this\ncontent as an extra-legal, irrational foundation (1923a:\n107–110).\n\nThis analysis of the social and cultural features of reification\nallows Lukács, in a third step, to present an analysis of the\n“antinomies of bourgeois thought” (1923a:\n110)—defending the radical claim that the unsolved\nepistemological problems of the entirety of modern philosophy are\nrooted in its failure to break through capitalist reification. In\nattempting to achieve a rational system of principles, Lukács\nclaims, modern philosophy is always confronted with the issue of there\nbeing a “content” necessary for the application of its\nformal principles of knowledge, a content which cannot be integrated\ninto a formal philosophical system—a prime example of which is\nKant’s “thing in itself” (see Bernstein 1984:\n15–22). Kantian dualism is nothing other than the most\nself-conscious expression of this “hiatus” between subject\n(the source of rational unity) and object (the source of non-rational\ncontent). This dualism between subject and object—and, in\nethics, between norms and facts—haunts modern philosophy. As\nFichte and Hegel partly recognize, Lukács argues, this problem\narises only because modern thought takes the contemplative subject of\nreified self-world relations as its paradigm, ignoring the alternative\nof an active subject that is engaged in the\nproduction of the content. Fichte’s proposal to postulate\nan “identical subject-object” (that is, a subject that\nproduces objectivity by positing objective reality as\ndistinct from itself) is also the key to Lukács’ answer. But\nFichte’s solution still suffers from an inadequacy in that he\nconceives of the constitutive activity still as the act of an\nindividual subject confronted with an external, alien reality (1923a:\n124).\n\nAn alternative is to be found in the idealist conception of art as an\nactivity directed at the creation of a meaningful totality and in\nSchiller’s view of artistic activity, which is not an application of\nexternal, given laws but a form of play (1923a: 138). However, the\nconceptualization of practice from the standpoint of aesthetics\nobscures its historical dimension. Lukács acknowledges Hegel as\nthe thinker who came nearest to finding a solution to this problem by\nrecognizing that it is the totality of concrete history,\nunderstood as the expression of a subject, of a “we”,\nwhich is the only standpoint from which the antinomies between form\nand content can be overcome (1923a: 146f.). But Hegel adopts a\nmythologizing view of this subjectivity in terms of a “World\nSpirit” that lies beyond any concrete historical agency. The\nsubject Hegel desperately tried to find could only be discovered by\nMarx—it is the proletariat to which Lukács assigns the\nrole of the “subject-object” of history (1923a: 149).\n",
    "section_title": "3.1 Reification Theory",
    "entry_title": "Georg [György] Lukács",
    "hierarchy_title": "Georg [György] Lukács || History and Class Consciousness || Reification Theory",
    "tokenized_text": [
        "history",
        "class",
        "consciousness",
        "reification",
        "theory",
        "reification",
        "theory",
        "foundation",
        "new",
        "conception",
        "lie",
        "theory",
        "reification",
        "lukács",
        "introduces",
        "essay",
        "reification",
        "consciousness",
        "proletariat",
        "essay",
        "credited",
        "one",
        "foundational",
        "text",
        "western",
        "marxism",
        "anderson",
        "also",
        "spelling",
        "paradigmatic",
        "central",
        "problem",
        "brunkhorst",
        "critical",
        "theory",
        "lukács",
        "frame",
        "argument",
        "extension",
        "marx",
        "analysis",
        "fetishism",
        "commodity",
        "form",
        "capital",
        "marx",
        "marx",
        "refers",
        "fact",
        "social",
        "relation",
        "producer",
        "commodity",
        "appear",
        "capitalism",
        "guise",
        "objective",
        "calculable",
        "property",
        "thing",
        "value",
        "marx",
        "form",
        "social",
        "relation",
        "acquire",
        "due",
        "fetishism",
        "ie",
        "form",
        "furnishes",
        "commodity",
        "feature",
        "make",
        "taking",
        "instrumental",
        "quantifying",
        "attitude",
        "towards",
        "themand",
        "ultimately",
        "towards",
        "social",
        "relation",
        "themselvesappropriate",
        "analyzed",
        "mainly",
        "regard",
        "distorts",
        "relationship",
        "subject",
        "economic",
        "circumstance",
        "lukács",
        "adopts",
        "far",
        "radical",
        "claim",
        "commodity",
        "form",
        "argues",
        "gradually",
        "become",
        "universal",
        "category",
        "society",
        "whole",
        "a",
        "capitalist",
        "society",
        "commodity",
        "form",
        "even",
        "becomes",
        "dominant",
        "form",
        "objectivity",
        "gegenständlichkeitsform",
        "drawing",
        "debate",
        "contemporary",
        "neokantian",
        "thought",
        "see",
        "lotz",
        "feenberg",
        "kavoulakos",
        "lukács",
        "remains",
        "committed",
        "kantian",
        "idea",
        "condition",
        "possibility",
        "synthesizing",
        "experience",
        "experience",
        "object",
        "depends",
        "access",
        "form",
        "thus",
        "transcendental",
        "status",
        "contrast",
        "kant",
        "however",
        "lukács",
        "understands",
        "form",
        "socially",
        "shared",
        "historically",
        "variable",
        "capitalist",
        "society",
        "particular",
        "commodity",
        "form",
        "thus",
        "becomes",
        "transcendental",
        "determining",
        "factor",
        "objectivity",
        "subjectivity",
        "objective",
        "subjective",
        "dimension",
        "emergence",
        "commodity",
        "form",
        "analyzed",
        "lukács",
        "emerging",
        "concrete",
        "change",
        "economic",
        "structure",
        "objective",
        "side",
        "industrial",
        "work",
        "process",
        "become",
        "rationalized",
        "result",
        "subsumption",
        "dominance",
        "commodity",
        "exchange",
        "process",
        "longer",
        "display",
        "typical",
        "unity",
        "intentionally",
        "integrated",
        "human",
        "work",
        "individual",
        "labor",
        "effort",
        "principle",
        "constitute",
        "input",
        "many",
        "product",
        "operation",
        "related",
        "set",
        "heterogeneous",
        "usevalues",
        "a",
        "thus",
        "longer",
        "form",
        "part",
        "unique",
        "unified",
        "work",
        "process",
        "subjective",
        "side",
        "reification",
        "entail",
        "fragmentation",
        "human",
        "experience",
        "leading",
        "attitude",
        "contemplation",
        "one",
        "passively",
        "adapts",
        "lawlike",
        "system",
        "social",
        "second",
        "nature",
        "objectifying",
        "stance",
        "towards",
        "one",
        "mental",
        "state",
        "capacity",
        "lukács",
        "writes",
        "concerning",
        "commodity",
        "form",
        "stamp",
        "imprint",
        "upon",
        "whole",
        "consciousness",
        "man",
        "quality",
        "ability",
        "longer",
        "organic",
        "part",
        "personality",
        "thing",
        "dispose",
        "like",
        "various",
        "object",
        "external",
        "world",
        "natural",
        "form",
        "human",
        "relation",
        "cast",
        "way",
        "man",
        "bring",
        "physical",
        "psychic",
        "quality",
        "play",
        "without",
        "subjected",
        "increasingly",
        "reifying",
        "process",
        "a",
        "lukács",
        "call",
        "development",
        "reification",
        "process",
        "primarily",
        "affect",
        "objective",
        "way",
        "human",
        "being",
        "relate",
        "totality",
        "social",
        "relationship",
        "constitutive",
        "meaning",
        "action",
        "separating",
        "totality",
        "thus",
        "meaning",
        "action",
        "selfunderstanding",
        "establishing",
        "form",
        "objective",
        "reality",
        "derivatively",
        "socially",
        "created",
        "feature",
        "object",
        "primarily",
        "feature",
        "commodity",
        "relation",
        "individual",
        "people",
        "relation",
        "also",
        "acquire",
        "character",
        "subjectindependent",
        "alien",
        "objectivity",
        "stahl",
        "objective",
        "subjective",
        "dimension",
        "dominance",
        "commodity",
        "form",
        "constitute",
        "complex",
        "reification",
        "property",
        "object",
        "subject",
        "social",
        "relation",
        "become",
        "thinglike",
        "particular",
        "way",
        "property",
        "become",
        "independent",
        "quantifiable",
        "nonrelational",
        "feature",
        "must",
        "remain",
        "alien",
        "subjective",
        "meaning",
        "one",
        "could",
        "attach",
        "description",
        "way",
        "dynamic",
        "capitalist",
        "society",
        "affect",
        "people",
        "materially",
        "form",
        "objectivity",
        "relate",
        "world",
        "lukács",
        "combine",
        "weber",
        "theory",
        "rationalization",
        "simmel",
        "theory",
        "modern",
        "culture",
        "idea",
        "modern",
        "contradiction",
        "form",
        "life",
        "see",
        "dannemann",
        "marx",
        "theory",
        "value",
        "resulting",
        "theory",
        "reification",
        "socially",
        "induced",
        "pathology",
        "considerable",
        "influence",
        "frankfurt",
        "school",
        "stahl",
        "lukács",
        "influence",
        "adorno",
        "see",
        "schiller",
        "braunsteinduckheim",
        "engagement",
        "later",
        "generation",
        "frankfurt",
        "school",
        "criticism",
        "lukács",
        "see",
        "habermas",
        "honneth",
        "cf",
        "also",
        "chari",
        "kavoulakos",
        "also",
        "led",
        "lucien",
        "goldmann",
        "speculate",
        "heidegger",
        "time",
        "read",
        "answer",
        "lukács",
        "goldmann",
        "theory",
        "social",
        "rationalization",
        "lukács",
        "argument",
        "rest",
        "go",
        "beyond",
        "mere",
        "description",
        "economic",
        "relation",
        "towards",
        "theory",
        "cultural",
        "change",
        "core",
        "argument",
        "claim",
        "dominance",
        "commodity",
        "form",
        "economic",
        "sphere",
        "must",
        "necessarily",
        "lead",
        "dominance",
        "rational",
        "calculation",
        "formal",
        "reason",
        "society",
        "whole",
        "consequently",
        "involve",
        "break",
        "organic",
        "unity",
        "totality",
        "previous",
        "form",
        "human",
        "existence",
        "forcing",
        "politics",
        "law",
        "adapt",
        "demand",
        "capitalist",
        "exchange",
        "commodity",
        "form",
        "transforms",
        "sphere",
        "mode",
        "rational",
        "calculability",
        "line",
        "thought",
        "clearly",
        "stem",
        "weber",
        "which",
        "help",
        "explain",
        "rise",
        "bureaucratic",
        "state",
        "dominance",
        "formal",
        "positive",
        "law",
        "continues",
        "alienate",
        "individual",
        "society",
        "encourages",
        "passivity",
        "face",
        "objectified",
        "mechanical",
        "rule",
        "a",
        "development",
        "lead",
        "contradictory",
        "situation",
        "practical",
        "theoretical",
        "level",
        "process",
        "rationalization",
        "precludes",
        "grasping",
        "society",
        "totality",
        "ever",
        "succeed",
        "making",
        "society",
        "subject",
        "rational",
        "calculation",
        "entirety",
        "must",
        "exclude",
        "irrational",
        "qualitative",
        "dimension",
        "calculation",
        "lukács",
        "rephrases",
        "earlier",
        "argument",
        "regarding",
        "tension",
        "form",
        "life",
        "marxist",
        "term",
        "lópez",
        "inability",
        "theory",
        "express",
        "reified",
        "perspective",
        "grasp",
        "concrete",
        "material",
        "content",
        "history",
        "one",
        "example",
        "lukács",
        "alleges",
        "inability",
        "economics",
        "science",
        "explain",
        "movement",
        "economy",
        "a",
        "hold",
        "formalist",
        "model",
        "law",
        "theoretically",
        "acknowledge",
        "interdependence",
        "principle",
        "social",
        "content",
        "must",
        "therefore",
        "treat",
        "content",
        "extralegal",
        "irrational",
        "foundation",
        "a",
        "analysis",
        "social",
        "cultural",
        "feature",
        "reification",
        "allows",
        "lukács",
        "third",
        "step",
        "present",
        "analysis",
        "antinomy",
        "bourgeois",
        "thought",
        "a",
        "defending",
        "radical",
        "claim",
        "unsolved",
        "epistemological",
        "problem",
        "entirety",
        "modern",
        "philosophy",
        "rooted",
        "failure",
        "break",
        "capitalist",
        "reification",
        "attempting",
        "achieve",
        "rational",
        "system",
        "principle",
        "lukács",
        "claim",
        "modern",
        "philosophy",
        "always",
        "confronted",
        "issue",
        "content",
        "necessary",
        "application",
        "formal",
        "principle",
        "knowledge",
        "content",
        "integrated",
        "formal",
        "philosophical",
        "systema",
        "prime",
        "example",
        "kant",
        "thing",
        "see",
        "bernstein",
        "kantian",
        "dualism",
        "nothing",
        "selfconscious",
        "expression",
        "hiatus",
        "subject",
        "source",
        "rational",
        "unity",
        "object",
        "source",
        "nonrational",
        "content",
        "dualism",
        "subject",
        "objectand",
        "ethic",
        "norm",
        "factshaunts",
        "modern",
        "philosophy",
        "fichte",
        "hegel",
        "partly",
        "recognize",
        "lukács",
        "argues",
        "problem",
        "arises",
        "modern",
        "thought",
        "take",
        "contemplative",
        "subject",
        "reified",
        "selfworld",
        "relation",
        "paradigm",
        "ignoring",
        "alternative",
        "active",
        "subject",
        "engaged",
        "production",
        "content",
        "fichte",
        "proposal",
        "postulate",
        "identical",
        "subjectobject",
        "subject",
        "produce",
        "objectivity",
        "positing",
        "objective",
        "reality",
        "distinct",
        "also",
        "key",
        "lukács",
        "answer",
        "fichte",
        "solution",
        "still",
        "suffers",
        "inadequacy",
        "conceives",
        "constitutive",
        "activity",
        "still",
        "act",
        "individual",
        "subject",
        "confronted",
        "external",
        "alien",
        "reality",
        "a",
        "alternative",
        "found",
        "idealist",
        "conception",
        "art",
        "activity",
        "directed",
        "creation",
        "meaningful",
        "totality",
        "schiller",
        "view",
        "artistic",
        "activity",
        "application",
        "external",
        "given",
        "law",
        "form",
        "play",
        "a",
        "however",
        "conceptualization",
        "practice",
        "standpoint",
        "aesthetic",
        "obscures",
        "historical",
        "dimension",
        "lukács",
        "acknowledges",
        "hegel",
        "thinker",
        "came",
        "nearest",
        "finding",
        "solution",
        "problem",
        "recognizing",
        "totality",
        "concrete",
        "history",
        "understood",
        "expression",
        "subject",
        "standpoint",
        "antinomy",
        "form",
        "content",
        "overcome",
        "a",
        "f",
        "hegel",
        "adopts",
        "mythologizing",
        "view",
        "subjectivity",
        "term",
        "world",
        "spirit",
        "lie",
        "beyond",
        "concrete",
        "historical",
        "agency",
        "subject",
        "hegel",
        "desperately",
        "tried",
        "find",
        "could",
        "discovered",
        "marxit",
        "proletariat",
        "lukács",
        "assigns",
        "role",
        "subjectobject",
        "history",
        "a"
    ]
}