{
    "main_text": "Life\n1. Life\n\nJan Łukasiewicz’s life was that of a career academic and\nscholar, seriously disrupted by the upheavals of war in the twentieth\ncentury. Born and educated in Polish Austria, he flourished in\nPoland’s Second Republic, endured the hardships of war, fled\nahead of the Red Army to Germany, and found a final haven in the\nRepublic of Ireland.\n\nJan Leopold Łukasiewicz was born on 21 December 1878 in\n Lwów[1],\n historically a Polish city, at that time the capital of Austrian\nGalicia. Łukasiewicz’s father Paweł was a captain in\nthe Austrian military, his mother Leopoldine, née Holtzer, was\ndaughter of an Austrian civil servant. Jan was their only child. The\nfamily spoke Polish. Łukasiewicz attended school (classical\nGimnazjum or grammar school, emphasizing classical languages)\nfrom 1890, completing in 1897 and beginning the study of law at the\nUniversity of Lwów. Under Austrian rule the university\npermitted instruction in Polish. In 1898 he switched to mathematics,\nstudying under Józef Puzyna, and philosophy, studying under\nKazimierz Twardowski, who had been appointed Extraordinary (Associate)\nProfessor there in 1895, and also Wojciech Dzieduszycki. In 1902\nŁukasiewicz was awarded his doctorate in philosophy under\nTwardowski with a dissertation “On induction as the inverse of\ndeduction”. Having achieved only top marks in all examinations\nbetween his school leaving examinations and his dissertation, he was\nawarded the doctorate sub auspiciis Imperatoris, a rare\ndistinction, and he received a diamond ring from Emperor Franz\nJosef.\n\nFrom 1902 he was employed as a private teacher and as a clerk in the\nuniversity library. In 1904 he obtained a scholarship from the\nGalician autonomous government and went to study in Berlin then in\nLouvain. In 1906 he obtained his Habilitation with a piece on\n“Analysis and construction of the concept of cause”. As a\nPrivatdozent in Philosophy, he was able to give lectures at\nthe university, becoming the first of Twardowski’s students to\njoin him in doing so. His first course of lectures, delivered in\nAutumn 1906, was on the algebra of logic, as formulated by Couturat.\nIn 1908 and 1909 he obtained a stipendium which enabled him to visit\nGraz, where he made acquaintance with Alexius Meinong and his school.\nIn 1911 he was appointed Extraordinary Professor, and continued to\nteach in Lwów until the outbreak of war in 1914. During this\ntime his students included Kazimierz Ajdukiewicz and Tadeusz\nKotarbiński, who would later become famous philosophers in their\nown right. He also in 1912 got to know Stanisław Leśniewski,\nwho had however come to Lwów after studying abroad and cannot\nbe counted as his pupil.\n\nIn 1915 the fortunes of war put Germany in control of Warsaw, and they\ndecided to re-open the university, which had not been allowed to\nfunction as a Polish-speaking university under Russian rule.\nŁukasiewicz became professor of philosophy there. In 1916 he was\ndean of the Faculty of Arts, and in 1917 prorector of the university.\nIn 1918 he left the university, being appointed Head of the Department\nof Higher Schools in the new Polish Ministry of Education, and after\nPoland obtained full independence he became Minister of Education in\nPaderewski’s Cabinet, serving from January to December 1919.\nFrom 1920 until 1939 he was, as was Leśniewski, a Professor in\nthe Faculty of Natural Sciences at the University of Warsaw. In\n1922/23 and again in 1931/32 he served as rector of the university. In\n1929 he married Regina Barwińska.\n\nThe interwar period was most fruitful for Łukasiewicz. He was a\nleading figure, with Leśniewski and Tarski, in what became known\nas the Warsaw School of Logic. He made a friend of the only German\nprofessor of mathematical logic, Heinrich Scholz, and was awarded an\nhonorary doctorate by the latter’s University of Münster in\n1938. Other honors awarded him in this period were Grand Commander of\nthe Order of Polonia Restituta (1923), Grand Commander of the\nHungarian Order of Merit, a monetary award from the City of Warsaw\n(1935) and memberships of the Polish Academy of Arts and Sciences in\nKraków, and the Polish Scientific Societies in Lwów and\nWarsaw.\n\nStudents whom he supervised through their doctoral dissertations were:\nMordechaj Wajsberg, Zygmunt Kobrzyński, Stanisław\nJaśkowski, Bolesław Sobociński, and Jerzy\nSłupecki.\n\nAt the outbreak of war in September 1939 the Łukasiewiczes’\nhome was bombed by the Luftwaffe: all his books, papers and\ncorrespondence were destroyed, except for one volume of his bound\noffprints. The Łukasiewiczes lived in provisional accommodation\nfor academics. The German occupiers closed the university and\nŁukasiewicz found employment for a meagre salary in the Warsaw\ncity archives. Additional financial support came from Scholz.\nŁukasiewicz taught in the underground university. From late 1943,\nfearing the imminent arrival and occupation of Poland by the Red Army,\nand under suspicion by some colleagues of being pro-German and\nanti-Jewish, Łukasiewicz expressed the wish to Scholz that he and\nhis wife should leave Poland. As a first step to their going to\nSwitzerland, Scholz managed to obtain permission for the\nŁukasiewiczes to travel to Münster. They left Warsaw on 17\nJuly 1944, just two weeks before the outbreak of the Warsaw Rising.\nFollowing the 20 July 1944 bomb plot against Hitler there was no hope\nof them obtaining permission to leave for Switzerland. They stayed in\nMünster, enduring allied bombing, until January 1945, when they\nwere offered accommodation by Jürgen von Kempski at his farm in\nHembsen (Kreis Höxter, Westphalia), where they were liberated by\nAmerican troops on 4 April.\n\nFrom the summer of 1945 Łukasiewicz taught logic at a Polish\nsecondary school set up at a former Polish POW camp in Dössel. In\nOctober 1945 they were allowed to travel to Brussels. There\nŁukasiewicz again taught logic at a provisional Polish Scientific\nInstitute. Being unwilling to return to a Poland under communist\ncontrol, Łukasiewicz looked for a post elsewhere. In February\n1946 he received an offer to go to Ireland. On 4 March 1946 the\nŁukasiewiczes arrived in Dublin, where they were received by the\nForeign Secretary and the Taoiseach Eamon de Valera. In autumn 1946\nŁukasiewicz was appointed Professor of Mathematical Logic at the\nRoyal Irish Academy (RIA), where he gave lectures at first once and\nthen twice a week.\n\nIn his final years in Ireland Łukasiewicz resumed contacts with\ncolleagues abroad, particularly Scholz, with whom he was in constant\ncorrespondence. He attended conferences in Britain, France and\nBelgium, sent papers to Poland before being expelled (with 15 other\nexiled Poles) from the Polish Academy in Kraków, lectured on\nmathematical logic at Queen’s University Belfast and on\nAristotle’s syllogistic at University College Dublin. His health\ndeteriorated and he had several heart attacks: by 1953 he was no\nlonger able to lecture at the Academy. In 1955 he received an honorary\ndoctorate from Trinity College Dublin. On 13 February 1956 after an\noperation to remove gallstones he suffered a third major coronary\nthrombosis and died in hospital. He was buried in Mount Jerome\nCemetery in Dublin, “far from dear Lwów and\nPoland”, as his gravestone reads. Regina deposited most of his\nscientific papers and correspondence with the RIA. In 1963 the Academy\ntransferred their holdings to the library of the University of\nManchester, where they remain, uncatalogued. The choice of Manchester\nwas due to the presence there as a lecturer of Czesław Lejewski,\nwho had studied with Łukasiewicz in Warsaw and twice been\nexamined by the latter for doctoral theses, once in 1939, when war\nintervened, a second time in London in 1954. Lejewski had seen the\nsecond edition of Łukasiewicz’s book on Aristotle’s\nsyllogistic through the press: it appeared posthumously in 1957. In\n2022 on the initiative of the Polish government his remains were\nrepatriated and reinterred with military honors in Warsaw’s\nPowązki Cemetery.\n",
    "section_title": "1. Life",
    "entry_title": "Jan Łukasiewicz",
    "hierarchy_title": "Jan Łukasiewicz || Life",
    "tokenized_text": [
        "life",
        "life",
        "jan",
        "łukasiewicz",
        "life",
        "career",
        "academic",
        "scholar",
        "seriously",
        "disrupted",
        "upheaval",
        "war",
        "twentieth",
        "century",
        "born",
        "educated",
        "polish",
        "austria",
        "flourished",
        "poland",
        "second",
        "republic",
        "endured",
        "hardship",
        "war",
        "fled",
        "ahead",
        "red",
        "army",
        "germany",
        "found",
        "final",
        "republic",
        "ireland",
        "jan",
        "leopold",
        "łukasiewicz",
        "born",
        "december",
        "lwów",
        "historically",
        "polish",
        "city",
        "time",
        "capital",
        "austrian",
        "galicia",
        "łukasiewicz",
        "father",
        "paweł",
        "captain",
        "austrian",
        "military",
        "mother",
        "leopoldine",
        "née",
        "holtzer",
        "daughter",
        "austrian",
        "civil",
        "servant",
        "jan",
        "child",
        "family",
        "spoke",
        "polish",
        "łukasiewicz",
        "attended",
        "school",
        "classical",
        "gimnazjum",
        "grammar",
        "school",
        "emphasizing",
        "classical",
        "language",
        "completing",
        "beginning",
        "study",
        "law",
        "university",
        "lwów",
        "austrian",
        "rule",
        "university",
        "permitted",
        "instruction",
        "polish",
        "switched",
        "mathematics",
        "studying",
        "józef",
        "puzyna",
        "philosophy",
        "studying",
        "kazimierz",
        "twardowski",
        "appointed",
        "extraordinary",
        "associate",
        "professor",
        "also",
        "wojciech",
        "dzieduszycki",
        "łukasiewicz",
        "awarded",
        "doctorate",
        "philosophy",
        "twardowski",
        "dissertation",
        "induction",
        "inverse",
        "deduction",
        "achieved",
        "top",
        "mark",
        "examination",
        "school",
        "leaving",
        "examination",
        "dissertation",
        "awarded",
        "doctorate",
        "sub",
        "auspiciis",
        "imperatoris",
        "rare",
        "distinction",
        "received",
        "diamond",
        "ring",
        "emperor",
        "franz",
        "josef",
        "employed",
        "private",
        "teacher",
        "clerk",
        "university",
        "library",
        "obtained",
        "scholarship",
        "galician",
        "autonomous",
        "government",
        "went",
        "study",
        "berlin",
        "louvain",
        "obtained",
        "habilitation",
        "piece",
        "analysis",
        "construction",
        "concept",
        "cause",
        "privatdozent",
        "philosophy",
        "able",
        "give",
        "lecture",
        "university",
        "becoming",
        "first",
        "twardowski",
        "student",
        "join",
        "first",
        "course",
        "lecture",
        "delivered",
        "autumn",
        "algebra",
        "logic",
        "formulated",
        "couturat",
        "obtained",
        "stipendium",
        "enabled",
        "visit",
        "graz",
        "made",
        "acquaintance",
        "alexius",
        "meinong",
        "school",
        "appointed",
        "extraordinary",
        "professor",
        "continued",
        "teach",
        "lwów",
        "outbreak",
        "war",
        "time",
        "student",
        "included",
        "kazimierz",
        "ajdukiewicz",
        "tadeusz",
        "kotarbiński",
        "would",
        "later",
        "become",
        "famous",
        "philosopher",
        "right",
        "also",
        "got",
        "know",
        "stanisław",
        "leśniewski",
        "however",
        "come",
        "lwów",
        "studying",
        "abroad",
        "counted",
        "pupil",
        "fortune",
        "war",
        "put",
        "germany",
        "control",
        "warsaw",
        "decided",
        "reopen",
        "university",
        "allowed",
        "function",
        "polishspeaking",
        "university",
        "russian",
        "rule",
        "łukasiewicz",
        "became",
        "professor",
        "philosophy",
        "dean",
        "faculty",
        "art",
        "prorector",
        "university",
        "left",
        "university",
        "appointed",
        "head",
        "department",
        "higher",
        "school",
        "new",
        "polish",
        "ministry",
        "education",
        "poland",
        "obtained",
        "full",
        "independence",
        "became",
        "minister",
        "education",
        "paderewski",
        "cabinet",
        "serving",
        "january",
        "december",
        "leśniewski",
        "professor",
        "faculty",
        "natural",
        "science",
        "university",
        "warsaw",
        "served",
        "rector",
        "university",
        "married",
        "regina",
        "barwińska",
        "interwar",
        "period",
        "fruitful",
        "łukasiewicz",
        "leading",
        "figure",
        "leśniewski",
        "tarski",
        "became",
        "known",
        "warsaw",
        "school",
        "logic",
        "made",
        "friend",
        "german",
        "professor",
        "mathematical",
        "logic",
        "heinrich",
        "scholz",
        "awarded",
        "honorary",
        "doctorate",
        "latter",
        "university",
        "münster",
        "honor",
        "awarded",
        "period",
        "grand",
        "commander",
        "order",
        "polonia",
        "restituta",
        "grand",
        "commander",
        "hungarian",
        "order",
        "merit",
        "monetary",
        "award",
        "city",
        "warsaw",
        "membership",
        "polish",
        "academy",
        "art",
        "science",
        "kraków",
        "polish",
        "scientific",
        "society",
        "lwów",
        "warsaw",
        "student",
        "supervised",
        "doctoral",
        "dissertation",
        "mordechaj",
        "wajsberg",
        "zygmunt",
        "kobrzyński",
        "stanisław",
        "jaśkowski",
        "bolesław",
        "sobociński",
        "jerzy",
        "słupecki",
        "outbreak",
        "war",
        "september",
        "łukasiewiczes",
        "home",
        "bombed",
        "luftwaffe",
        "book",
        "paper",
        "correspondence",
        "destroyed",
        "except",
        "one",
        "volume",
        "bound",
        "offprint",
        "łukasiewiczes",
        "lived",
        "provisional",
        "accommodation",
        "academic",
        "german",
        "occupier",
        "closed",
        "university",
        "łukasiewicz",
        "found",
        "employment",
        "meagre",
        "salary",
        "warsaw",
        "city",
        "archive",
        "additional",
        "financial",
        "support",
        "came",
        "scholz",
        "łukasiewicz",
        "taught",
        "underground",
        "university",
        "late",
        "fearing",
        "imminent",
        "arrival",
        "occupation",
        "poland",
        "red",
        "army",
        "suspicion",
        "colleague",
        "progerman",
        "antijewish",
        "łukasiewicz",
        "expressed",
        "wish",
        "scholz",
        "wife",
        "leave",
        "poland",
        "first",
        "step",
        "going",
        "switzerland",
        "scholz",
        "managed",
        "obtain",
        "permission",
        "łukasiewiczes",
        "travel",
        "münster",
        "left",
        "warsaw",
        "july",
        "two",
        "week",
        "outbreak",
        "warsaw",
        "rising",
        "following",
        "july",
        "bomb",
        "plot",
        "hitler",
        "hope",
        "obtaining",
        "permission",
        "leave",
        "switzerland",
        "stayed",
        "münster",
        "enduring",
        "allied",
        "bombing",
        "january",
        "offered",
        "accommodation",
        "jürgen",
        "von",
        "kempski",
        "farm",
        "hembsen",
        "kreis",
        "höxter",
        "westphalia",
        "liberated",
        "american",
        "troop",
        "april",
        "summer",
        "łukasiewicz",
        "taught",
        "logic",
        "polish",
        "secondary",
        "school",
        "set",
        "former",
        "polish",
        "pow",
        "camp",
        "dössel",
        "october",
        "allowed",
        "travel",
        "brussels",
        "łukasiewicz",
        "taught",
        "logic",
        "provisional",
        "polish",
        "scientific",
        "institute",
        "unwilling",
        "return",
        "poland",
        "communist",
        "control",
        "łukasiewicz",
        "looked",
        "post",
        "elsewhere",
        "february",
        "received",
        "offer",
        "go",
        "ireland",
        "march",
        "łukasiewiczes",
        "arrived",
        "dublin",
        "received",
        "foreign",
        "secretary",
        "taoiseach",
        "eamon",
        "de",
        "valera",
        "autumn",
        "łukasiewicz",
        "appointed",
        "professor",
        "mathematical",
        "logic",
        "royal",
        "irish",
        "academy",
        "ria",
        "gave",
        "lecture",
        "first",
        "twice",
        "week",
        "final",
        "year",
        "ireland",
        "łukasiewicz",
        "resumed",
        "contact",
        "colleague",
        "abroad",
        "particularly",
        "scholz",
        "constant",
        "correspondence",
        "attended",
        "conference",
        "britain",
        "france",
        "belgium",
        "sent",
        "paper",
        "poland",
        "expelled",
        "exiled",
        "pole",
        "polish",
        "academy",
        "kraków",
        "lectured",
        "mathematical",
        "logic",
        "queen",
        "university",
        "belfast",
        "aristotle",
        "syllogistic",
        "university",
        "college",
        "dublin",
        "health",
        "deteriorated",
        "several",
        "heart",
        "attack",
        "longer",
        "able",
        "lecture",
        "academy",
        "received",
        "honorary",
        "doctorate",
        "trinity",
        "college",
        "dublin",
        "february",
        "operation",
        "remove",
        "gallstone",
        "suffered",
        "third",
        "major",
        "coronary",
        "thrombosis",
        "died",
        "hospital",
        "buried",
        "mount",
        "jerome",
        "cemetery",
        "dublin",
        "far",
        "dear",
        "lwów",
        "poland",
        "gravestone",
        "read",
        "regina",
        "deposited",
        "scientific",
        "paper",
        "correspondence",
        "ria",
        "academy",
        "transferred",
        "holding",
        "library",
        "university",
        "manchester",
        "remain",
        "uncatalogued",
        "choice",
        "manchester",
        "due",
        "presence",
        "lecturer",
        "czesław",
        "lejewski",
        "studied",
        "łukasiewicz",
        "warsaw",
        "twice",
        "examined",
        "latter",
        "doctoral",
        "thesis",
        "war",
        "intervened",
        "second",
        "time",
        "london",
        "lejewski",
        "seen",
        "second",
        "edition",
        "łukasiewicz",
        "book",
        "aristotle",
        "syllogistic",
        "press",
        "appeared",
        "posthumously",
        "initiative",
        "polish",
        "government",
        "remains",
        "repatriated",
        "reinterred",
        "military",
        "honor",
        "warsaw",
        "powązki",
        "cemetery"
    ]
}