{
    "main_text": "Luther, Kant, and the Post-Kantians\n2. Luther, Kant, and the Post-Kantians\n\nBy virtue of their education and background, Luther continues to have\nan impact on the thought of significant philosophers after Leibniz,\nsuch as Christian Thomasius (1655–1728) and Christian Wolff\n(1679–1754). However, a more interesting point of contact can be\nfound with the crucial thinker who was not in fact brought up as a\nmainstream Lutheran but as a Pietist, namely Immanuel Kant\n (1724–1804).[13]\n This impact continues in the work of the Lutheran idealists who\nfollowed him, namely J. G. Fichte (1762–1814), F. W. J.\nSchelling (1775–1854) and G. W. F. Hegel (1770–1831), as\nwell as in the work of those who responded to Kant in a different way,\nnamely Gotthold Ephraim Lessing (1729–1781), J. G. Hamann\n(1730–1788), F. H. Jacobi (1743–1819) and J. G. Herder\n(1744–1803), in addition to Arthur Schopenhauer\n(1788–1860) and thinkers associated with Romanticism such as\nFriedrich von Hardenberg (aka Novalis) (1772–1801) and Friedrich\nSchlegel (1772–1829), and the convert Jewish writer and essayist\nHeinrich Heine (1797–1856). For reasons of space, it will not be\npossible to trace all these connections here, so I will focus mainly\non Kant and Hegel, with a brief mention of Fichte and Schelling. (A\nmore comprehensive study, which contains excerpts from key primary\ntexts, can be found in Bornkamm 1955; a brief overview can be found in\nAssel 2014. For discussions that extend into the twentieth century,\nsee Hampson 2017, Podmore 2017 and Rota 2017.)\n\nWhile Kant’s upbringing and education came from within Pietism\nrather than the orthodox Lutheran\n Church,[14]\n Pietism was still a reform movement within the Lutheran tradition,\nand in certain respects saw itself as returning to the views of Luther\nhimself, and away from what that Church had become (see Lindberg 2005\nand Shantz 2013 for further discussion). One issue this re-opened was\nthe role of reason in relation to faith, and the limitations of reason\nand hence academic theology in religious matters, while also taking\nseriously the fallenness of human beings, and the need for spiritual\nrebirth. As has been emphasised recently (see Kanterian 2017),\nKant’s adoption of this so-called “weakness motif”\nmay be seen as an importantly Lutheran theme in his work, and is\nreflected in the limitations he places on human reason and on our\ncapacities for moral goodness; nonetheless, Kant does not use his\nclaims concerning the constraints on reason to prioritise theology\nover philosophy, or to give revelation or scripture a special status,\nwhile he also departs from Luther over the issue of free will and of\ngrace.\n\nThat the human intellect is limited is a central theme in what Kant\ncalled his “critical philosophy”, which precisely aims to\nset out those limits. Moreover, as is suggested by his famous claim to\nhave “found it necessary to deny knowledge in order to make room\nfor faith” (Critique of Pure Reason, Bxxx), there is a\nreligious impetus behind this project of a sort that Luther might have\nrecognized, which is also reflected in Kant’s hostility to\nrationalistic attempts to prove the existence of God. Kant may also be\nsaid to share Luther’s Augustinian pessimism regarding human\nnature, where he frequently remarks on our evident self-concern, and\nin Religion Within the Boundaries of Mere Reason (1793)\nattributes the propensity to radical evil to all human beings, namely\n\n\n\nthe propensity of the power of choice to maxims that subordinate the\nincentives of the moral law to others (not moral ones). (6:30) \n\n\nThis conception of human moral weakness may also be said to lead Kant\nto adopt a Lutheran conception of the law, which only becomes binding\non us and takes the form of duty given our resistance to the good,\nwhereas for the holy will there is no such necessitation or constraint\n(cf. Groundwork for the Metaphysics of Morals,\n4:412–4).\n\nHowever, there are also limits on how far Kant is prepared to follow\nthese Lutheran themes. Firstly, while he is willing to accept that\ntheoretical reason may both lead itself astray and find itself\ncognitively impoverished in some respects, in a way that leaves room\nfor faith, he is not willing to allow that this means that theology\ncan eclipse philosophy, or that revelation or scripture can simply\nreplace the latter, as he took it that religion must remain compatible\nwith morality and thus stay within practical reason, out of which a\nphilosophical theology can arise (see Religion, Preface, and\nThe Conflict of the Faculties, Part 1). Secondly, Kant offers\na distinctive conception of the idea of free choice\n(Willkür) as involving the choice or adoption of our\nmaxims (see Metaphysics of Morals 6: 213–4, 226;\nReligion Within the Limits of Mere Reason 6:23–4),\nwhile he also argues for our freedom on the basis that “ought\nimplies can”, which puts him at odds with Luther’s\nposition as articulated in The Bondage of the Will (see,\ne.g., Religion 6:45, and White 1990 for more general\ndiscussion). Finally, in Religion Within the Limits of Mere\nReason, Kant rejects the Lutheran conception of grace, again on\nmoral grounds, arguing that we will be discouraged in our moral\nefforts unless we believe that we can do something to make ourselves\ndeserving of grace and hence of divine assistance to be good, while\nagain Kant appeals to the principle that “ought implies\ncan” to argue that we must have some capacity in this direction,\nhowever limited (see Religion Part 1). Thus, while there are\nsome affinities between Kant and Luther, there are important\ndivergences too.\n\nHegel’s reception of Luther contrasts with Kant’s in\nvarious ways. First, Kant never offers any significant discussion of\nLuther in his writings, and is implicitly critical of him in important\nrespects, while Hegel is more explicit in his engagement with Luther,\nand frequently lavish in his praise of the Reformer—though Hegel\nquickly dropped his youthful plans to be a Lutheran pastor, and was\ncritical of aspects of the Lutheran education he received as a student\nat the seminary (or Stift) in Tübingen. Secondly,\nKant’s relation to Luther is made more complex by his Pietistic\nupbringing; but while Hegel’s upbringing may also have involved\nsome Pietistic aspects (see Macgee 2001: 71–72), in later life\nHegel avowed his Lutheran orthodoxy, writing to the Pietistic\ntheologian Friedrich August Tholuck in 1826: “I am a Lutheran,\nand through philosophy have been at once completely confirmed in\nLutheranism” (Hegel 1984: 520). Thirdly, the two philosophers\nare almost diametrically opposed in what they accepted and what they\nrejected in Luther: while Kant followed Luther’s doubts\nconcerning reason and our capacities for moral goodness, Hegel was\nmore optimistic on both scores; but while Kant rejected Luther’s\nscepticism regarding free choice, Hegel used it to draw his\ndialectical connection between freedom and necessity. However, both\nKant and Hegel agree in standing against any attempt to prioritise\ntheology over philosophy on Lutheran grounds. After briefly outlining\nthe key texts for understanding Hegel’s engagement with Luther,\nthis third point will then be developed further.\n\nThe majority of Hegel’s references to Luther occur in the\nlectures on the philosophy of religion, and on philosophy of history,\nand on the history of philosophy, where in the case of the last two,\nthese are largely in the sections on the Reformation more generally.\nThe context therefore means that in these explicit discussions, Hegel\nis considering Luther’s place in subsequent historical developments. In\ngeneral, Hegel presents Luther as ushering in a new era of internality\nand individuality, as religion becomes less a matter of unthinkingly\nfollowing established authorities and rituals that are external and\nalien, and more a matter of grasping the truth for oneself and feeling\nat one with it, thus ushering in a distinctive form of\n“Christian freedom”: \n\n\nSubjective spirit comes to itself through this self-negation because\nit is absolutely at home with itself [bei sich]. Thus\nsubjective spirit gains freedom in the truth, negates its\nparticularity and comes to itself in its truth. In this way Christian\nfreedom is actualized. (1822–23 [Hegel 2011: 505]) \n\n\nAnd in his “Address on the Tercentenary of the Submission of the\nAugsburg Confession” (1830), Hegel even goes so far as to\npresent his own work as a “second reformation”: while\nLuther was the “trumpet which now proclaimed the\nwondrous sound of Christian freedom”, and that “the things\nwhich our Luther set in motion were truly new”, nonetheless\n“if religion is reformed, the political, legal, and ethical\nsystem [ratio civitatis et legum morumque] should also be\nreformed” (Hegel 1830 [1999: 189])—which thus connects\nLuther’s religious project to Hegel’s political one, as\nHegel also did in the Preface to the Philosophy of\n Right.[15]\n Heine, in his account of the development of German philosophy written\nfor a French audience in 1834 and published in book form a year later\n(Heine 1835 [2007]), tells a similar story, which begins with Luther\nand culminates in Hegel—indeed, its original title was De\nL’Allemagne depuis Luther. Heine’s work also reflects\nthe role that Hegel gave Luther, as a quintessentially\n“German” figure, which was to become a common trope in his\nsubsequent\n reception.[16]\n\nAs well as this focus on religious and political freedoms for the\nindividual, the emphasis on the relation between Lutheranism and\nfreedom in Hegel may be seen to have four more fundamental aspects,\nwhich reveal Luther’s influence on Hegel’s conception of\nfreedom, which is a central theme in the latter’s philosophy.\nFirst, as we have seen Hegel took Christian freedom to involve finding\noneself in the other, which may reflect Luther’s turn from God\nas an alien and forbidding judge, to God as forgiving and loving, in\nwhich a freedom as reconciliation can be achieved—albeit a unity\nthat must be achieved through a prior sense of alienation.\n [17]\n In Luther this alienation involves an element of hiddenness which is\nnot so evident in Hegel. Nonetheless, It could be added that just as\nLuther’s conception of divine hiddenness can involve the idea\nthat God’s nature is concealed under its contrary\n(abscondita sub contrario) (such as his mercy under his\nwrath, his strength under his weakness and suffering in Jesus\n Christ),[18]\n so there is a further connection here to Hegel’s conception of\nthe dialectic, where what appears one way to the understanding can be\nseen to be otherwise by reason, such as necessity really being\nfreedom, in a way that the former will find incomprehensible.\nMoreover, Hegel’s conception of freedom and self-knowledge as\nrequiring recognition by the other may be said to reflect\nLuther’s conception of our relational dependence on\n God.[19]\n Second, Hegel takes up the idea that this reconciliation with the\nother requires a kind of self-surrender, where he writes that: \n\n\nSubjective certainty, i.e. the subject’s knowledge of the true,\nwhich should be for it an objective truth, subsisting in and for\nitself, only becomes authentic when, in relation to this content,\nparticular subjectivity is surrendered; and this happens only by\nmaking the objective truth one’s own truth. (1822–23\n[Hegel 2011: 505]) \n\n\nAs Stephen Houlgate has\n noted,[20]\n this emphasis on the passivity is an important feature of\nHegel’s own method of inquiry, for example where Hegel remarks\nthat \n\n\n[p]hilosophical thinking proceeds analytically in that it simply takes\nup its object, the Idea, and lets it go its own way, while it simply\nwatches the movement and development of it, so to speak. To this\nextent, philosophising is wholly passive. (Encyclopaedia\nLogic §238 Addition)\n\n\nThird, Hegel takes up the Lutheran (and Pauline) view concerning the\nrelation between the Christian and the law, according to which the Christian should not require constraint by law, as\n\n\ntrue freedom…is a freedom to do good with pleasure and to live\nwell without compulsion of the law. (Preface to St Paul’s\nEpistle to the Romans, WA DB 7:18–19/LW 35:376) \n\n\nIt could be\nargued that this view is reflected in Hegel’s preference for\nlove over law, which is a particular feature of his early\n writings.[21]\n Finally, in The Bondage of the Will, Luther questions a\nconception of freedom as free choice (see\n Luther entry §4),\n arguing instead that the presence of this choice involves a lack of\nfreedom as the agent is no longer guided by the good; this view may\nalso be said to be echoed in Hegel’s own critique of free choice\n(Willkür), which underpins his claim that there is a way\nin which true freedom and necessity can be reconciled, as the truly\nfree agent only sees one option available to them, namely what is\nrequired by the good. In these respects, therefore, it can be argued\nthat there is a fundamentally Lutheran cast to this fundamental aspect\nof Hegel’s thought. However, Hegel surely departs from Luther in\nchampioning the role of reason in his speculative philosophy (albeit\nreason of a distinctive kind, which goes beyond the understanding),\nwhich is able to “sublate” Christianity within\nit—but this very sublation means that his philosophy takes up\nstructures of theological thinking, some of which are also Lutheran,\nso that in turn Hegel remains an important influence within Lutheran\n theology.[22]\n\nThere are interesting points of similarity and difference between\nHegel’s response to Luther, and that of the other post-Kantian\nGerman idealists such as Fichte and Schelling. Like Hegel, Fichte\ntreats Luther as a significant national figure, and associates him\nwith freedom, giving him prominence in his Addresses to the German\nNation which were written in 1808 as a rallying call in the wake\nof Napoleonic invasion. Both also praise Luther’s contribution\nto the German language through his translations of the Bible, though\nFichte is critical of the doctrine of sola scriptura, which\nwas to put too much value on “the printed\n letter”.[23]\n Moreover, if Luther can be said to have an influence of Hegel’s\nconception of recognition (see above), the same may be said of\nFichte’s account of recognition which foreshadowed\nHegel’s, though in neither case is this link made explicit.\nSchelling also gives Luther’s account of freedom a philosophical\nrole, appealing to Luther’s Bondage of the Will in his\nPhilosophical Investigations into the Essence of Human\nFreedom (1809), to draw a distinction between compulsion and\nnecessity, and more broadly arguing that \n\n\nreligiosity does not permit any choice between opposites, and\naequilibrium arbitrii (the plague of all morality), but\nrather only the highest resoluteness in favour of what is right\nwithout any choice. (1809 [2006: 57]) \n\n\nMoreover, in appealing in his later work to the significance of\nrevelation, it has been argued that Schelling is more consistently\nLutheran than Hegel, in thereby placing limits to the latter’s\nrationalism (see Wirth 2017).\n",
    "section_title": "2. Luther, Kant, and the Post-Kantians",
    "entry_title": "Luther’s Influence on Philosophy",
    "hierarchy_title": "Luther’s Influence on Philosophy || Luther, Kant, and the Post-Kantians",
    "tokenized_text": [
        "luther",
        "kant",
        "postkantians",
        "luther",
        "kant",
        "postkantians",
        "virtue",
        "education",
        "background",
        "luther",
        "continues",
        "impact",
        "thought",
        "significant",
        "philosopher",
        "leibniz",
        "christian",
        "thomasius",
        "christian",
        "wolff",
        "however",
        "interesting",
        "point",
        "contact",
        "found",
        "crucial",
        "thinker",
        "fact",
        "brought",
        "mainstream",
        "lutheran",
        "pietist",
        "namely",
        "immanuel",
        "kant",
        "impact",
        "continues",
        "work",
        "lutheran",
        "idealist",
        "followed",
        "namely",
        "j",
        "g",
        "fichte",
        "f",
        "w",
        "j",
        "schelling",
        "g",
        "w",
        "f",
        "hegel",
        "well",
        "work",
        "responded",
        "kant",
        "different",
        "way",
        "namely",
        "gotthold",
        "ephraim",
        "lessing",
        "j",
        "g",
        "hamann",
        "f",
        "h",
        "jacobi",
        "j",
        "g",
        "herder",
        "addition",
        "arthur",
        "schopenhauer",
        "thinker",
        "associated",
        "romanticism",
        "friedrich",
        "von",
        "hardenberg",
        "aka",
        "novalis",
        "friedrich",
        "schlegel",
        "convert",
        "jewish",
        "writer",
        "essayist",
        "heinrich",
        "heine",
        "reason",
        "space",
        "possible",
        "trace",
        "connection",
        "focus",
        "mainly",
        "kant",
        "hegel",
        "brief",
        "mention",
        "fichte",
        "schelling",
        "comprehensive",
        "study",
        "contains",
        "excerpt",
        "key",
        "primary",
        "text",
        "found",
        "bornkamm",
        "brief",
        "overview",
        "found",
        "assel",
        "discussion",
        "extend",
        "twentieth",
        "century",
        "see",
        "hampson",
        "podmore",
        "rota",
        "kant",
        "upbringing",
        "education",
        "came",
        "within",
        "pietism",
        "rather",
        "orthodox",
        "lutheran",
        "church",
        "pietism",
        "still",
        "reform",
        "movement",
        "within",
        "lutheran",
        "tradition",
        "certain",
        "respect",
        "saw",
        "returning",
        "view",
        "luther",
        "away",
        "church",
        "become",
        "see",
        "lindberg",
        "shantz",
        "discussion",
        "one",
        "issue",
        "reopened",
        "role",
        "reason",
        "relation",
        "faith",
        "limitation",
        "reason",
        "hence",
        "academic",
        "theology",
        "religious",
        "matter",
        "also",
        "taking",
        "seriously",
        "fallenness",
        "human",
        "being",
        "need",
        "spiritual",
        "rebirth",
        "emphasised",
        "recently",
        "see",
        "kanterian",
        "kant",
        "adoption",
        "socalled",
        "weakness",
        "motif",
        "may",
        "seen",
        "importantly",
        "lutheran",
        "theme",
        "work",
        "reflected",
        "limitation",
        "place",
        "human",
        "reason",
        "capacity",
        "moral",
        "goodness",
        "nonetheless",
        "kant",
        "use",
        "claim",
        "concerning",
        "constraint",
        "reason",
        "prioritise",
        "theology",
        "philosophy",
        "give",
        "revelation",
        "scripture",
        "special",
        "status",
        "also",
        "departs",
        "luther",
        "issue",
        "free",
        "grace",
        "human",
        "intellect",
        "limited",
        "central",
        "theme",
        "kant",
        "called",
        "critical",
        "philosophy",
        "precisely",
        "aim",
        "set",
        "limit",
        "moreover",
        "suggested",
        "famous",
        "claim",
        "found",
        "necessary",
        "deny",
        "knowledge",
        "order",
        "make",
        "room",
        "faith",
        "critique",
        "pure",
        "reason",
        "bxxx",
        "religious",
        "impetus",
        "behind",
        "project",
        "sort",
        "luther",
        "might",
        "recognized",
        "also",
        "reflected",
        "kant",
        "hostility",
        "rationalistic",
        "attempt",
        "prove",
        "existence",
        "god",
        "kant",
        "may",
        "also",
        "said",
        "share",
        "luther",
        "augustinian",
        "pessimism",
        "regarding",
        "human",
        "nature",
        "frequently",
        "remark",
        "evident",
        "selfconcern",
        "religion",
        "within",
        "boundary",
        "mere",
        "reason",
        "attribute",
        "propensity",
        "radical",
        "evil",
        "human",
        "being",
        "namely",
        "propensity",
        "power",
        "choice",
        "maxim",
        "subordinate",
        "incentive",
        "moral",
        "law",
        "others",
        "moral",
        "one",
        "conception",
        "human",
        "moral",
        "weakness",
        "may",
        "also",
        "said",
        "lead",
        "kant",
        "adopt",
        "lutheran",
        "conception",
        "law",
        "becomes",
        "binding",
        "u",
        "take",
        "form",
        "duty",
        "given",
        "resistance",
        "good",
        "whereas",
        "holy",
        "necessitation",
        "constraint",
        "cf",
        "groundwork",
        "metaphysics",
        "moral",
        "however",
        "also",
        "limit",
        "far",
        "kant",
        "prepared",
        "follow",
        "lutheran",
        "theme",
        "firstly",
        "willing",
        "accept",
        "theoretical",
        "reason",
        "may",
        "lead",
        "astray",
        "find",
        "cognitively",
        "impoverished",
        "respect",
        "way",
        "leaf",
        "room",
        "faith",
        "willing",
        "allow",
        "mean",
        "theology",
        "eclipse",
        "philosophy",
        "revelation",
        "scripture",
        "simply",
        "replace",
        "latter",
        "took",
        "religion",
        "must",
        "remain",
        "compatible",
        "morality",
        "thus",
        "stay",
        "within",
        "practical",
        "reason",
        "philosophical",
        "theology",
        "arise",
        "see",
        "religion",
        "preface",
        "conflict",
        "faculty",
        "part",
        "secondly",
        "kant",
        "offer",
        "distinctive",
        "conception",
        "idea",
        "free",
        "choice",
        "willkür",
        "involving",
        "choice",
        "adoption",
        "maxim",
        "see",
        "metaphysics",
        "moral",
        "religion",
        "within",
        "limit",
        "mere",
        "reason",
        "also",
        "argues",
        "freedom",
        "basis",
        "ought",
        "implies",
        "put",
        "odds",
        "luther",
        "position",
        "articulated",
        "bondage",
        "see",
        "eg",
        "religion",
        "white",
        "general",
        "discussion",
        "finally",
        "religion",
        "within",
        "limit",
        "mere",
        "reason",
        "kant",
        "reject",
        "lutheran",
        "conception",
        "grace",
        "moral",
        "ground",
        "arguing",
        "discouraged",
        "moral",
        "effort",
        "unless",
        "believe",
        "something",
        "make",
        "deserving",
        "grace",
        "hence",
        "divine",
        "assistance",
        "good",
        "kant",
        "appeal",
        "principle",
        "ought",
        "implies",
        "argue",
        "must",
        "capacity",
        "direction",
        "however",
        "limited",
        "see",
        "religion",
        "part",
        "thus",
        "affinity",
        "kant",
        "luther",
        "important",
        "divergence",
        "hegel",
        "reception",
        "luther",
        "contrast",
        "kant",
        "various",
        "way",
        "first",
        "kant",
        "never",
        "offer",
        "significant",
        "discussion",
        "luther",
        "writing",
        "implicitly",
        "critical",
        "important",
        "respect",
        "hegel",
        "explicit",
        "engagement",
        "luther",
        "frequently",
        "lavish",
        "praise",
        "reformerthough",
        "hegel",
        "quickly",
        "dropped",
        "youthful",
        "plan",
        "lutheran",
        "pastor",
        "critical",
        "aspect",
        "lutheran",
        "education",
        "received",
        "student",
        "seminary",
        "stift",
        "tübingen",
        "secondly",
        "kant",
        "relation",
        "luther",
        "made",
        "complex",
        "pietistic",
        "upbringing",
        "hegel",
        "upbringing",
        "may",
        "also",
        "involved",
        "pietistic",
        "aspect",
        "see",
        "macgee",
        "later",
        "life",
        "hegel",
        "avowed",
        "lutheran",
        "orthodoxy",
        "writing",
        "pietistic",
        "theologian",
        "friedrich",
        "august",
        "tholuck",
        "lutheran",
        "philosophy",
        "completely",
        "confirmed",
        "lutheranism",
        "hegel",
        "thirdly",
        "two",
        "philosopher",
        "almost",
        "diametrically",
        "opposed",
        "accepted",
        "rejected",
        "luther",
        "kant",
        "followed",
        "luther",
        "doubt",
        "concerning",
        "reason",
        "capacity",
        "moral",
        "goodness",
        "hegel",
        "optimistic",
        "score",
        "kant",
        "rejected",
        "luther",
        "scepticism",
        "regarding",
        "free",
        "choice",
        "hegel",
        "used",
        "draw",
        "dialectical",
        "connection",
        "freedom",
        "necessity",
        "however",
        "kant",
        "hegel",
        "agree",
        "standing",
        "attempt",
        "prioritise",
        "theology",
        "philosophy",
        "lutheran",
        "ground",
        "briefly",
        "outlining",
        "key",
        "text",
        "understanding",
        "hegel",
        "engagement",
        "luther",
        "third",
        "point",
        "developed",
        "majority",
        "hegel",
        "reference",
        "luther",
        "occur",
        "lecture",
        "philosophy",
        "religion",
        "philosophy",
        "history",
        "history",
        "philosophy",
        "case",
        "last",
        "two",
        "largely",
        "section",
        "reformation",
        "generally",
        "context",
        "therefore",
        "mean",
        "explicit",
        "discussion",
        "hegel",
        "considering",
        "luther",
        "place",
        "subsequent",
        "historical",
        "development",
        "general",
        "hegel",
        "present",
        "luther",
        "ushering",
        "new",
        "era",
        "internality",
        "individuality",
        "religion",
        "becomes",
        "le",
        "matter",
        "unthinkingly",
        "following",
        "established",
        "authority",
        "ritual",
        "external",
        "alien",
        "matter",
        "grasping",
        "truth",
        "oneself",
        "feeling",
        "one",
        "thus",
        "ushering",
        "distinctive",
        "form",
        "christian",
        "freedom",
        "subjective",
        "spirit",
        "come",
        "selfnegation",
        "absolutely",
        "home",
        "bei",
        "sich",
        "thus",
        "subjective",
        "spirit",
        "gain",
        "freedom",
        "truth",
        "negates",
        "particularity",
        "come",
        "truth",
        "way",
        "christian",
        "freedom",
        "actualized",
        "hegel",
        "address",
        "tercentenary",
        "submission",
        "augsburg",
        "confession",
        "hegel",
        "even",
        "go",
        "far",
        "present",
        "work",
        "second",
        "reformation",
        "luther",
        "trumpet",
        "proclaimed",
        "wondrous",
        "sound",
        "christian",
        "freedom",
        "thing",
        "luther",
        "set",
        "motion",
        "truly",
        "new",
        "nonetheless",
        "religion",
        "reformed",
        "political",
        "legal",
        "ethical",
        "system",
        "ratio",
        "civitatis",
        "et",
        "legum",
        "morumque",
        "also",
        "reformed",
        "hegel",
        "which",
        "thus",
        "connects",
        "luther",
        "religious",
        "project",
        "hegel",
        "political",
        "one",
        "hegel",
        "also",
        "preface",
        "philosophy",
        "right",
        "heine",
        "account",
        "development",
        "german",
        "philosophy",
        "written",
        "french",
        "audience",
        "published",
        "book",
        "form",
        "year",
        "later",
        "heine",
        "tell",
        "similar",
        "story",
        "begin",
        "luther",
        "culminates",
        "hegelindeed",
        "original",
        "title",
        "de",
        "l",
        "allemagne",
        "depuis",
        "luther",
        "heine",
        "work",
        "also",
        "reflects",
        "role",
        "hegel",
        "gave",
        "luther",
        "quintessentially",
        "german",
        "figure",
        "become",
        "common",
        "trope",
        "subsequent",
        "reception",
        "well",
        "focus",
        "religious",
        "political",
        "freedom",
        "individual",
        "emphasis",
        "relation",
        "lutheranism",
        "freedom",
        "hegel",
        "may",
        "seen",
        "four",
        "fundamental",
        "aspect",
        "reveal",
        "luther",
        "influence",
        "hegel",
        "conception",
        "freedom",
        "central",
        "theme",
        "latter",
        "philosophy",
        "first",
        "seen",
        "hegel",
        "took",
        "christian",
        "freedom",
        "involve",
        "finding",
        "oneself",
        "may",
        "reflect",
        "luther",
        "turn",
        "god",
        "alien",
        "forbidding",
        "judge",
        "god",
        "forgiving",
        "loving",
        "freedom",
        "reconciliation",
        "achievedalbeit",
        "unity",
        "must",
        "achieved",
        "prior",
        "sense",
        "alienation",
        "luther",
        "alienation",
        "involves",
        "element",
        "hiddenness",
        "evident",
        "hegel",
        "nonetheless",
        "could",
        "added",
        "luther",
        "conception",
        "divine",
        "hiddenness",
        "involve",
        "idea",
        "god",
        "nature",
        "concealed",
        "contrary",
        "abscondita",
        "sub",
        "contrario",
        "mercy",
        "wrath",
        "strength",
        "weakness",
        "suffering",
        "jesus",
        "christ",
        "connection",
        "hegel",
        "conception",
        "dialectic",
        "appears",
        "one",
        "way",
        "understanding",
        "seen",
        "otherwise",
        "reason",
        "necessity",
        "really",
        "freedom",
        "way",
        "former",
        "find",
        "incomprehensible",
        "moreover",
        "hegel",
        "conception",
        "freedom",
        "selfknowledge",
        "requiring",
        "recognition",
        "may",
        "said",
        "reflect",
        "luther",
        "conception",
        "relational",
        "dependence",
        "god",
        "second",
        "hegel",
        "take",
        "idea",
        "reconciliation",
        "requires",
        "kind",
        "selfsurrender",
        "writes",
        "subjective",
        "certainty",
        "ie",
        "subject",
        "knowledge",
        "true",
        "objective",
        "truth",
        "subsisting",
        "becomes",
        "authentic",
        "relation",
        "content",
        "particular",
        "subjectivity",
        "surrendered",
        "happens",
        "making",
        "objective",
        "truth",
        "one",
        "truth",
        "hegel",
        "stephen",
        "houlgate",
        "noted",
        "emphasis",
        "passivity",
        "important",
        "feature",
        "hegel",
        "method",
        "inquiry",
        "example",
        "hegel",
        "remark",
        "p",
        "hilosophical",
        "thinking",
        "proceeds",
        "analytically",
        "simply",
        "take",
        "object",
        "idea",
        "let",
        "go",
        "way",
        "simply",
        "watch",
        "movement",
        "development",
        "speak",
        "extent",
        "philosophising",
        "wholly",
        "passive",
        "encyclopaedia",
        "logic",
        "addition",
        "third",
        "hegel",
        "take",
        "lutheran",
        "pauline",
        "view",
        "concerning",
        "relation",
        "christian",
        "law",
        "according",
        "christian",
        "require",
        "constraint",
        "law",
        "true",
        "freedomis",
        "freedom",
        "good",
        "pleasure",
        "live",
        "well",
        "without",
        "compulsion",
        "law",
        "preface",
        "st",
        "paul",
        "epistle",
        "roman",
        "wa",
        "db",
        "lw",
        "could",
        "argued",
        "view",
        "reflected",
        "hegel",
        "preference",
        "love",
        "law",
        "particular",
        "feature",
        "early",
        "writing",
        "finally",
        "bondage",
        "luther",
        "question",
        "conception",
        "freedom",
        "free",
        "choice",
        "see",
        "luther",
        "entry",
        "arguing",
        "instead",
        "presence",
        "choice",
        "involves",
        "lack",
        "freedom",
        "agent",
        "longer",
        "guided",
        "good",
        "view",
        "may",
        "also",
        "said",
        "echoed",
        "hegel",
        "critique",
        "free",
        "choice",
        "willkür",
        "underpins",
        "claim",
        "way",
        "true",
        "freedom",
        "necessity",
        "reconciled",
        "truly",
        "free",
        "agent",
        "see",
        "one",
        "option",
        "available",
        "namely",
        "required",
        "good",
        "respect",
        "therefore",
        "argued",
        "fundamentally",
        "lutheran",
        "cast",
        "fundamental",
        "aspect",
        "hegel",
        "thought",
        "however",
        "hegel",
        "surely",
        "departs",
        "luther",
        "championing",
        "role",
        "reason",
        "speculative",
        "philosophy",
        "albeit",
        "reason",
        "distinctive",
        "kind",
        "go",
        "beyond",
        "understanding",
        "able",
        "sublate",
        "christianity",
        "within",
        "itbut",
        "sublation",
        "mean",
        "philosophy",
        "take",
        "structure",
        "theological",
        "thinking",
        "also",
        "lutheran",
        "turn",
        "hegel",
        "remains",
        "important",
        "influence",
        "within",
        "lutheran",
        "theology",
        "interesting",
        "point",
        "similarity",
        "difference",
        "hegel",
        "response",
        "luther",
        "postkantian",
        "german",
        "idealist",
        "fichte",
        "schelling",
        "like",
        "hegel",
        "fichte",
        "treat",
        "luther",
        "significant",
        "national",
        "figure",
        "associate",
        "freedom",
        "giving",
        "prominence",
        "address",
        "german",
        "nation",
        "written",
        "rallying",
        "call",
        "wake",
        "napoleonic",
        "invasion",
        "also",
        "praise",
        "luther",
        "contribution",
        "german",
        "language",
        "translation",
        "bible",
        "though",
        "fichte",
        "critical",
        "doctrine",
        "sola",
        "scriptura",
        "put",
        "much",
        "value",
        "printed",
        "letter",
        "moreover",
        "luther",
        "said",
        "influence",
        "hegel",
        "conception",
        "recognition",
        "see",
        "may",
        "said",
        "fichte",
        "account",
        "recognition",
        "foreshadowed",
        "hegel",
        "though",
        "neither",
        "case",
        "link",
        "made",
        "explicit",
        "schelling",
        "also",
        "give",
        "luther",
        "account",
        "freedom",
        "philosophical",
        "role",
        "appealing",
        "luther",
        "bondage",
        "philosophical",
        "investigation",
        "essence",
        "human",
        "freedom",
        "draw",
        "distinction",
        "compulsion",
        "necessity",
        "broadly",
        "arguing",
        "religiosity",
        "permit",
        "choice",
        "opposite",
        "aequilibrium",
        "arbitrii",
        "plague",
        "morality",
        "rather",
        "highest",
        "resoluteness",
        "favour",
        "right",
        "without",
        "choice",
        "moreover",
        "appealing",
        "later",
        "work",
        "significance",
        "revelation",
        "argued",
        "schelling",
        "consistently",
        "lutheran",
        "hegel",
        "thereby",
        "placing",
        "limit",
        "latter",
        "rationalism",
        "see",
        "wirth"
    ]
}