{
    "main_text": "Luther, Aristotle, and Nominalism\n3. Luther, Aristotle, and Nominalism\n\nTo the extent that Luther is critical of philosophy and of reason,\nthis hostility is often directed at Aristotle and the Aristotelian\ntradition in particular; and in general, Luther’s departure from\nAristotle marks one of the most philosophically distinctive and\ninteresting aspects of his thinking. As with Luther’s critique\nof reason, however, some of his more notoriously negative\njudgements—such as his claim in the Disputation Against\nScholastic Theology that “the whole Aristotle is to\ntheology as darkness is to light” (1517, WA 1:226/LW\n31:12)—need to be balanced against other more positive\njudgements, and set in context. Part of that context is the reception\nof Aristotle’s work itself, as it was interpreted in its own\nterms, and also placed against the background of Christian thought\nwithin the scholastic tradition, where it can be a complex matter to\nplace Luther himself into these debates (see Andreatta 1996, White 1996, Dieter 2001\n(discussed in Wicks 2007), Dieter 2017).\n\nBroadly speaking, there are three levels in Luther’s critical\nengagement with Aristotle and his influence: objections at the\ninstitutional level, at the level of general Christian theology, and\nat the level of Luther’s own theological outlook.\n\nAt the institutional level, Luther’s concern was over the place\nof Aristotle within the universities, which had been cemented through\nthe decision in 1255 of the faculty of liberal arts in Paris to\ninclude all Aristotle’s known works within the curriculum. This\nis the context of Luther’s assertion, in To the Christian\nNobility of 1520, that in the universities “the blind pagan\nteacher, Aristotle, is of more consequence than Christ”, so that\nthe universities “need a good, thorough reformation” (WA\n6:457/LW 44:200) in order to replace the centrality of\nAristotle’s works with the study of scripture and of the\nChristian faith—and Luther was not alone in having this concern.\nHe thus argues that Aristotle’s Physics,\nMetaphysics, De anima, and Ethics should\nall be removed from the curriculum, while his Logic,\nRhetoric and Poetics should be retained in an\nabridged form without commentary, as aids to speaking and preaching.\nIn this way, Luther clearly hoped, rather than “labouring with\npersistent industry to comprehend only Aristotle”\n(Explanations of the Ninety-Five Theses 1518, WA 1:611/LW\n1:222), students would have time to devote themselves to the more\nworthwhile study of the Bible\n instead.[21]\n\nLuther’s choice of works to set aside also reveals what he took\nto be theologically problematic about the content of Aristotle’s\nphilosophy at the second level. In commenting on De anima,\nLuther objects that it contradicts Christian teaching on the\nimmortality of the soul. He also says that the Physics is\nfundamentally flawed, elsewhere arguing that this is because Aristotle\nhas no conception of the Biblical account of creation (Lectures on\nGenesis, 1535–1545, WA 42:63/LW 1:84). In both areas,\nAristotle is hampered by his hylomorphism, his view that matter and\nform are interrelated, so that in this respect Luther favours Plato\nover Aristotle.\n\nMore interesting, however, is the third level of Luther’s\nengagement with Aristotle, where his critique focuses on issues\ncentral to Luther’s own theology. In To the Christian\nNobility, this can be seen in Luther’s response to\nAristotle’s Ethics, which is described as being\n“the worst of all books” as it \n\n\nflatly opposes divine grace and all Christian virtues, and yet it is\nconsidered one of his best works. Away with such books! Keep them away\nfrom Christians. (1520, WA 6:458/LW 44:201) \n\n\nLuther is here contrasting his own account of justification through\nfaith with the idea of justification through works, which he\nassociates with the Aristotelian tradition and traces back to\nAristotle’s Ethics. For here, Luther argued, one can\nfind the idea that virtue is something to be developed through our own\nefforts and instilled in us through habituation, thus making the idea\nof good works central to the idea of moral improvement. While perhaps\nplausible in a secular context, once this idea is transposed into\nunderstanding our relation to God, Luther took it to be disastrous as\nit led to the view both that we could act rightly without God’s\ngrace, and that we could to some extent earn his good judgement by\ndoing so, without seeing this grace as unmerited. This, however, is to\ngenerate a sense of pride in our own abilities which precisely negates\nthe possibility of good action, for reasons we will consider further\nin the next section. Luther thus sets his own view in opposition to\nthe Aristotelian one in the Disputation Against Scholastic\nPhilosophy when he writes that “We do not become righteous\nby doing righteous deeds but, having been made righteous, we do\nrighteous deeds”, so that as a result “Virtually the\nentire Ethics of Aristotle is the worst enemy of grace”\n(1517, WA 1:226/LW 1:12). Luther’s criticisms of Duns Scotus,\nGabriel Biel and William of Ockham on these issues elsewhere in the\nDisputation make clear how he sees them as relating to this\nfundamental Aristotelian error, while his reference to\nAugustine’s anti-Pelagianism in the first two theses equally\nmakes clear the theological mistake that Luther sees in all such\nviews. And while Luther does not mention him explicitly in the\nDisputation, not surprisingly he elsewhere occasionally but\nstrongly criticizes Aquinas for also falling under the baleful\ninfluence of Aristotle on this\n issue.[22]\n\nIt has also been argued by commentators that this radical critique of\nAristotle from the perspective of his view of justification and grace\nalso results in a departure not only from Aristotle’s ethics of\nthe virtues, but also some fundamental assumptions of Aristotelian\nmetaphysics, and its commitment to the substance/attribute model. This\nchange in outlook is said to arise out of Luther’s conception of\ngrace as unmerited, so that in attributing righteousness to a person,\nthis is extrinsic to them, a matter of God’s verdict and hence\nforensic assessment, and so grounded in his relation to the person\nrather than in the attributes of the person themselves, which from\nanother perspective remain that of the sinner. Viewed in this\nrelational way, the Christian is thus “both justified and\nsinner” (simul iustus et peccator), in a manner that is\nhard to capture on a traditional Aristotelian substance/attribute\n model.[23]\n However, the so-called “Finnish interpretation” of\nLuther, which challenges this purely forensic and relational approach\nto justification, correspondingly makes Luther’s challenge to\ntraditional Aristotelian ontology less radical. On the Finnish\ninterpretation, justification involves actual participation in the\ndivine life, and thus has ontological implications for the justified\n individual.[24]\n\nLuther also felt dissatisfied with the Aristotelian framework of\nsubstance and accidents, and matter and form, in relation to his\ndistinctive views concerning other aspects of Christian doctrine,\nparticularly concerning the Eucharist, where for example in The\nBabylonian Captivity of the Church, Luther argues strongly that\nthe Aristotelian assumptions which had structured much of the debate\non these matters were wrongly used to support the “babble”\nof transubstantiation rather than his preferred view of real presence\n(1520, WA 6:510–511/LW\n 36:32–4)[25]—though\n he also accuses Aquinas of causing difficulties through his\nmisinterpretation of Aristotle, rather than just blaming Aristotle\nhimself (1520, WA 6:508/LW 36:29). In general, Luther’s approach\nhere is that we should take literally the word of scripture which he\nthinks support his view, rather than fall for using a pre-Christian\nphilosophy which may seem to make the Eucharist more comprehensible,\nbut which really does not, and which anyway is not appropriate goal\nfor what should remain a mystery and a matter of faith.\n\nThrough Luther’s engagement with Aristotle, it is also\nintriguing to try to locate him in the complex patchwork of disputing\nschools that arose in this late medieval period concerning the proper\ninterpretation of Aristotle’s work, and the challenges it faced.\nOne such challenge was from Ockham’s nominalism or (to use the\nmore contemporary label) “termism”; and Luther was to\npresent himself as belonging to this\n position.[26]\n However, this issue is merely one of a broad spectrum of debates that\nshaped the wider dispute between the so-called via antiqua\nand via moderna, where the latter has links to (but cannot be\nidentified with) nominalist approaches. This has led to a considerable\namount of scholarly discussion and research, which has brought out how\nLuther’s education came through the via moderna, but\nthat he also occupied a position that was independent of any\n school.[27]\n",
    "section_title": "3. Luther, Aristotle, and Nominalism",
    "entry_title": "Martin Luther",
    "hierarchy_title": "Martin Luther || Luther, Aristotle, and Nominalism",
    "tokenized_text": [
        "luther",
        "aristotle",
        "nominalism",
        "luther",
        "aristotle",
        "nominalism",
        "extent",
        "luther",
        "critical",
        "philosophy",
        "reason",
        "hostility",
        "often",
        "directed",
        "aristotle",
        "aristotelian",
        "tradition",
        "particular",
        "general",
        "luther",
        "departure",
        "aristotle",
        "mark",
        "one",
        "philosophically",
        "distinctive",
        "interesting",
        "aspect",
        "thinking",
        "luther",
        "critique",
        "reason",
        "however",
        "notoriously",
        "negative",
        "judgementssuch",
        "claim",
        "disputation",
        "scholastic",
        "theology",
        "whole",
        "aristotle",
        "theology",
        "darkness",
        "light",
        "wa",
        "lw",
        "need",
        "balanced",
        "positive",
        "judgement",
        "set",
        "context",
        "part",
        "context",
        "reception",
        "aristotle",
        "work",
        "interpreted",
        "term",
        "also",
        "placed",
        "background",
        "christian",
        "thought",
        "within",
        "scholastic",
        "tradition",
        "complex",
        "matter",
        "place",
        "luther",
        "debate",
        "see",
        "andreatta",
        "white",
        "dieter",
        "discussed",
        "wick",
        "dieter",
        "broadly",
        "speaking",
        "three",
        "level",
        "luther",
        "critical",
        "engagement",
        "aristotle",
        "influence",
        "objection",
        "institutional",
        "level",
        "level",
        "general",
        "christian",
        "theology",
        "level",
        "luther",
        "theological",
        "outlook",
        "institutional",
        "level",
        "luther",
        "concern",
        "place",
        "aristotle",
        "within",
        "university",
        "cemented",
        "decision",
        "faculty",
        "liberal",
        "art",
        "paris",
        "include",
        "aristotle",
        "known",
        "work",
        "within",
        "curriculum",
        "context",
        "luther",
        "assertion",
        "christian",
        "nobility",
        "university",
        "blind",
        "pagan",
        "teacher",
        "aristotle",
        "consequence",
        "christ",
        "university",
        "need",
        "good",
        "thorough",
        "reformation",
        "wa",
        "lw",
        "order",
        "replace",
        "centrality",
        "aristotle",
        "work",
        "study",
        "scripture",
        "christian",
        "faithand",
        "luther",
        "alone",
        "concern",
        "thus",
        "argues",
        "aristotle",
        "physic",
        "metaphysics",
        "de",
        "anima",
        "ethic",
        "removed",
        "curriculum",
        "logic",
        "rhetoric",
        "poetics",
        "retained",
        "abridged",
        "form",
        "without",
        "commentary",
        "aid",
        "speaking",
        "preaching",
        "way",
        "luther",
        "clearly",
        "hoped",
        "rather",
        "labouring",
        "persistent",
        "industry",
        "comprehend",
        "aristotle",
        "explanation",
        "ninetyfive",
        "thesis",
        "wa",
        "lw",
        "student",
        "would",
        "time",
        "devote",
        "worthwhile",
        "study",
        "bible",
        "instead",
        "luther",
        "choice",
        "work",
        "set",
        "aside",
        "also",
        "reveals",
        "took",
        "theologically",
        "problematic",
        "content",
        "aristotle",
        "philosophy",
        "second",
        "level",
        "commenting",
        "de",
        "anima",
        "luther",
        "object",
        "contradicts",
        "christian",
        "teaching",
        "immortality",
        "soul",
        "also",
        "say",
        "physic",
        "fundamentally",
        "flawed",
        "elsewhere",
        "arguing",
        "aristotle",
        "conception",
        "biblical",
        "account",
        "creation",
        "lecture",
        "genesis",
        "wa",
        "lw",
        "area",
        "aristotle",
        "hampered",
        "hylomorphism",
        "view",
        "matter",
        "form",
        "interrelated",
        "respect",
        "luther",
        "favour",
        "plato",
        "aristotle",
        "interesting",
        "however",
        "third",
        "level",
        "luther",
        "engagement",
        "aristotle",
        "critique",
        "focus",
        "issue",
        "central",
        "luther",
        "theology",
        "christian",
        "nobility",
        "seen",
        "luther",
        "response",
        "aristotle",
        "ethic",
        "described",
        "worst",
        "book",
        "flatly",
        "opposes",
        "divine",
        "grace",
        "christian",
        "virtue",
        "yet",
        "considered",
        "one",
        "best",
        "work",
        "away",
        "book",
        "keep",
        "away",
        "christian",
        "wa",
        "lw",
        "luther",
        "contrasting",
        "account",
        "justification",
        "faith",
        "idea",
        "justification",
        "work",
        "associate",
        "aristotelian",
        "tradition",
        "trace",
        "back",
        "aristotle",
        "ethic",
        "luther",
        "argued",
        "one",
        "find",
        "idea",
        "virtue",
        "something",
        "developed",
        "effort",
        "instilled",
        "u",
        "habituation",
        "thus",
        "making",
        "idea",
        "good",
        "work",
        "central",
        "idea",
        "moral",
        "improvement",
        "perhaps",
        "plausible",
        "secular",
        "context",
        "idea",
        "transposed",
        "understanding",
        "relation",
        "god",
        "luther",
        "took",
        "disastrous",
        "led",
        "view",
        "could",
        "act",
        "rightly",
        "without",
        "god",
        "grace",
        "could",
        "extent",
        "earn",
        "good",
        "judgement",
        "without",
        "seeing",
        "grace",
        "unmerited",
        "however",
        "generate",
        "sense",
        "pride",
        "ability",
        "precisely",
        "negates",
        "possibility",
        "good",
        "action",
        "reason",
        "consider",
        "next",
        "section",
        "luther",
        "thus",
        "set",
        "view",
        "opposition",
        "aristotelian",
        "one",
        "disputation",
        "scholastic",
        "philosophy",
        "writes",
        "become",
        "righteous",
        "righteous",
        "deed",
        "made",
        "righteous",
        "righteous",
        "deed",
        "result",
        "virtually",
        "entire",
        "ethic",
        "aristotle",
        "worst",
        "enemy",
        "grace",
        "wa",
        "lw",
        "luther",
        "criticism",
        "dun",
        "scotus",
        "gabriel",
        "biel",
        "william",
        "ockham",
        "issue",
        "elsewhere",
        "disputation",
        "make",
        "clear",
        "see",
        "relating",
        "fundamental",
        "aristotelian",
        "error",
        "reference",
        "augustine",
        "antipelagianism",
        "first",
        "two",
        "thesis",
        "equally",
        "make",
        "clear",
        "theological",
        "mistake",
        "luther",
        "see",
        "view",
        "luther",
        "mention",
        "explicitly",
        "disputation",
        "surprisingly",
        "elsewhere",
        "occasionally",
        "strongly",
        "criticizes",
        "aquinas",
        "also",
        "falling",
        "baleful",
        "influence",
        "aristotle",
        "issue",
        "also",
        "argued",
        "commentator",
        "radical",
        "critique",
        "aristotle",
        "perspective",
        "view",
        "justification",
        "grace",
        "also",
        "result",
        "departure",
        "aristotle",
        "ethic",
        "virtue",
        "also",
        "fundamental",
        "assumption",
        "aristotelian",
        "metaphysics",
        "commitment",
        "substanceattribute",
        "model",
        "change",
        "outlook",
        "said",
        "arise",
        "luther",
        "conception",
        "grace",
        "unmerited",
        "attributing",
        "righteousness",
        "person",
        "extrinsic",
        "matter",
        "god",
        "verdict",
        "hence",
        "forensic",
        "assessment",
        "grounded",
        "relation",
        "person",
        "rather",
        "attribute",
        "person",
        "another",
        "perspective",
        "remain",
        "sinner",
        "viewed",
        "relational",
        "way",
        "christian",
        "thus",
        "justified",
        "sinner",
        "simul",
        "iustus",
        "et",
        "peccator",
        "manner",
        "hard",
        "capture",
        "traditional",
        "aristotelian",
        "substanceattribute",
        "model",
        "however",
        "socalled",
        "finnish",
        "interpretation",
        "luther",
        "challenge",
        "purely",
        "forensic",
        "relational",
        "approach",
        "justification",
        "correspondingly",
        "make",
        "luther",
        "challenge",
        "traditional",
        "aristotelian",
        "ontology",
        "le",
        "radical",
        "finnish",
        "interpretation",
        "justification",
        "involves",
        "actual",
        "participation",
        "divine",
        "life",
        "thus",
        "ontological",
        "implication",
        "justified",
        "individual",
        "luther",
        "also",
        "felt",
        "dissatisfied",
        "aristotelian",
        "framework",
        "substance",
        "accident",
        "matter",
        "form",
        "relation",
        "distinctive",
        "view",
        "concerning",
        "aspect",
        "christian",
        "doctrine",
        "particularly",
        "concerning",
        "eucharist",
        "example",
        "babylonian",
        "captivity",
        "church",
        "luther",
        "argues",
        "strongly",
        "aristotelian",
        "assumption",
        "structured",
        "much",
        "debate",
        "matter",
        "wrongly",
        "used",
        "support",
        "babble",
        "transubstantiation",
        "rather",
        "preferred",
        "view",
        "real",
        "presence",
        "wa",
        "lw",
        "though",
        "also",
        "accuses",
        "aquinas",
        "causing",
        "difficulty",
        "misinterpretation",
        "aristotle",
        "rather",
        "blaming",
        "aristotle",
        "wa",
        "lw",
        "general",
        "luther",
        "approach",
        "take",
        "literally",
        "word",
        "scripture",
        "think",
        "support",
        "view",
        "rather",
        "fall",
        "using",
        "prechristian",
        "philosophy",
        "may",
        "seem",
        "make",
        "eucharist",
        "comprehensible",
        "really",
        "anyway",
        "appropriate",
        "goal",
        "remain",
        "mystery",
        "matter",
        "faith",
        "luther",
        "engagement",
        "aristotle",
        "also",
        "intriguing",
        "try",
        "locate",
        "complex",
        "patchwork",
        "disputing",
        "school",
        "arose",
        "late",
        "medieval",
        "period",
        "concerning",
        "proper",
        "interpretation",
        "aristotle",
        "work",
        "challenge",
        "faced",
        "one",
        "challenge",
        "ockham",
        "nominalism",
        "use",
        "contemporary",
        "label",
        "termism",
        "luther",
        "present",
        "belonging",
        "position",
        "however",
        "issue",
        "merely",
        "one",
        "broad",
        "spectrum",
        "debate",
        "shaped",
        "wider",
        "dispute",
        "socalled",
        "via",
        "antiqua",
        "via",
        "moderna",
        "latter",
        "link",
        "identified",
        "nominalist",
        "approach",
        "led",
        "considerable",
        "amount",
        "scholarly",
        "discussion",
        "research",
        "brought",
        "luther",
        "education",
        "came",
        "via",
        "moderna",
        "also",
        "occupied",
        "position",
        "independent",
        "school"
    ]
}