{
    "main_text": "Political organisation\n5. Political organisation\n\n\nLuxemburg’s analysis on questions of strategy and political\norganisation was shaped by her reflections on the development of\ncapitalism, her emphasis on the global character of that development\nand her conviction that any discussion of the issue of political\norganisation had to be historically informed and sensitive to the\ninternal dynamic of the political movements of different countries.\nWhile historical materialism provided the methodological foundation,\nLuxemburg’s more specific interventions on the questions of the\nday (reform vs. revolution, economic vs. political struggle,\nspontaneous vs. centralised forms of political organisation) were\nshaped by her analysis of two very different experiences of working\nclass organisation. In Western Europe, the demands of workers were\nincreasingly driven (and constrained) by representation in the\ninstitutions of liberal parliamentary democracy, their demands\npresented in the language of civic rights, their appeals taking the\nform of a call to collective democratic responsibilty. In Eastern\nEurope, where the struggle for worker’s rights took place mostly\nunderground, political debate was constantly threatened by censorship,\nand mass actions were organised in secret and at great risk to\nactivists’ lives. The debate was therefore very different.\nLuxemburg’s essay on the The Mass Strike, the Political\nParty and the Trade Union, synthesises the lessons learned from\nthe Russian revolution of 1905 and reflects on them to better\nunderstand working class organisation as a whole.\n\n\nThe focus of the discussion were political and economic strikes as\nmethods in the struggle against capitalism. Such strikes, confined to\nparticular sectors of production or to particular towns, should not be\nunderstood in isolation from each other, Luxemburg argued. The mass\nstrike, she suggests, should not be seen as “a crafty method\ndiscovered by subtle reasoning for the purpose of making the\nproletarian struggle more effective but, the method of\nmotion of the proletarian mass, the phenomenal form of the\nproletarian struggle in the revolution” (Luxemburg 1905 [RLR:\n192]). While a strike may begin as a series of demands for, say,\nreduced working hours or improved pay, those demands for a fairer\ndistribution are inseparable from the question of workers’\naccess to political power. As Luxemburg puts it, “the economic\nstruggle is the transmitter from one political centre to another; the\npolitical struggle is the periodic fertilization of the soil for the\neconomic struggle” (Luxemburg 1905 [RLR: 195]). This\ninterdependence between economic and political struggle also meant\nthat the question of mass strike could not be separated from that of\nrevolution, observed not from the point of view of public order as\n“street disturbances”, “rioting” and\n“bloodshed” but as a “thoroughgoing internal\nreversal of existing class relations” (Luxemburg 1905 [RLR:\n195–196]). And yet precisely because the mass strike should not be\nunderstood as an isolated measure to be called at will but was\ninextricably linked to the fate of revolution, the decision to bring\nit about could not come even from “the highest committee of the\nstrongest Social Democratic party” (Luxemburg 1905 [RLR:\n197]). Of course, Luxemburg conceded that initiative, direction, mass\neducation and party discipline had a crucial role to play in\nrevolutionary organisation. But she was convinced that\n“revolutions do not allow anyone to play schoolmaster with\nthem” because, as she argued, “in every individual act of\nthe struggle so very many important economic, political and social,\ngeneral and local, material and psychical, factors react upon one\nanother in such a way that no single act can be arranged and resolved\nas if it were a mathematical problem” (Luxemburg 1905 [RLR:\n198]).\n\n\nThis then, is the essence of what has been labelled her theory of the\nrole of “spontaneity” in political organisation, which is\nnot so much a theory as an effort to understand the dynamic of\npolitical action grounded in the belief that, in the course of\npolitical mobilisation and activity, oppressed groups are themselves\nable to develop the epistemic insight, political tools and collective\nmotivation required to change the course of history. The lesson for\npolitical parties, Luxemburg argued, was not to focus on the\n“technical side”, with the “mechanisms of the mass\nstrike” but to ensure that “they never fall below the\nlevel demanded by the actual relations of forces, but rather rise\nabove it” (Luxemburg 1905 [RLR: 199]). Reforms, she explained,\nprovided crucial learning platforms through which the mass of\noppressed people would develop a capacity for autonomous\ndecision-making, and prepare for the conquest of political power. Yet\nsuch reforms were trials of freedom, they were not freedom itself.\n\n\nLuxemburg’s analysis of political organisation has received\nseveral critiques from contrasting perspectives. On the one hand, it\nhas been pointed out that while Luxemburg was able to navigate\ncarefully the choice between national parliamentary representation and\na revolutionary analysis of class conflict that transcended state\nboundaries, she opposed the Second International’s naïve\nfaith on national social democracy with a no less naïve belief on\nthe democratising effects of a continuously expanding wave of strikes\n(Eley 1980: 147). On the other hand, her faith in the spontanous power\nof the masses has often been interpreted as the unavoidable\nconsequence of a certain degree of “determinism” or\n“fatalism” embedded in her analysis of the limits of\ncapital accumulation and its emphasis on an inherent tendency towards\ncrisis (see for a discussion of this literature Geras 1976 [2015, ch\n1]). However, as Norman Geras has pointed out, while some of the\nphrasing in her texts resembles standard formulations of the\nSecond International to the extent that the collapse of\ncapitalism was perceived as inherently unavoidable, and while this\nrhetoric could occasionally serve a psychological motivating role,\nLuxemburg was far from considering the emergence of socialism a matter\nof fatal destiny (Geras 1976 [2015]). On the contrary, she made it\nclear that socialism was not going to fall as “manna from\nheaven” and that while “we can no more skip a period in\nour historical development than a man can jump over his shadow, it\nlies within our power to accelerate or to retard it” (Luxemburg\n1915 [RLR: 320–321]).  The meaning of Engels’s famous slogan\n“socialism or barbarism”, on which Luxemburg commented in\nthe Junius Pamphlet was quite the opposite of determinism:\nthe vindication of the conscious agency of the oppressed, the\ntransformation, she argued, of the proletariat from “a powerless\nvictim of history” to “its conscious guide”\n(Luxemburg 1915 [RLR: 321]).\n\n\nThis belief in the power of the oppressed masses, and the role of\nspontaneous action in developing revolutionary organisation informed\nLuxemburg’s response to her colleagues in the German social\ndemocratic party and her call to combine parliamentary initiatives\nwith the defence of the mass strike as the focal point of\nrevolutionary organisation. The extent to which these views were\nreflected in her attitude to the Polish workers movement, with regard\nto which Luxemburg is sometimes criticised for her rigidity and\nsectarian stance, is a contested question (Blanc 2017). However, there\nis no doubt that her political experience with both Polish and German\norganisations, played an important role in the analysis of the\npolitical developments in Russia, from the revolution of 1905 to the\nBolshevik conquest of power after October 1917. Initially sceptical of\nthe possibility that a workers’ government in Russia could last\nfor a long time, Luxemburg nevertheless praised the Bolsheviks for the\nsymbolic importance of showing to the world that a revolutionary\nprogramme led by the proletariat was worth fighting for despite the\nconstraints imposed by circumstances. She also urged her colleagues in\nthe SPD to abandon their caution and support the Bolsheviks with\ngreater conviction that the oppressed people of Russia would\neventually be able to find their orientation despite what many\nconsidered to be “unripe circumstances”. As she put it in\nher essay on the Russian revolution, writen while in prison during\nWorld War I but published after her death in 1922, “when the\nproletariat seizes power, it can never again follow Kautsky’s\ngood advice to dispense with a socialist transformation of a country\non the grounds that‘the country is unripe’”. What it\nneeds, she argues, is to “immediately embark on socialist\nmeasures in the most energetic, the most unyielding and the most\nruthless way; in other words, it must exercise a dictatorship, but a\ndictatorship of the class, not of a party or of a clique – and\ndictatorship of the class means: in full view of the broadest public,\nwith the most active, uninhibited participation of the popular masses\nin an unlimited democracy” (Luxemburg 1922 [RLR: 25, see also\n307–308]).\n\n\nLuxemburg interpreted the demand for a dictatorship of the proletariat\nin the same way Marx and Engels had done, as a transitional emergency\ninstitution required to realise democracy in a society rigged by class\nstruggle (see for a broader discussion of the concept Ypi 2020). She\nstrongly believed that the dictatorship of the proletariat should be\nbrought about by the masses of the oppressed in their effort to\nliberate themselves, and that it should not be inflicted on them by a\nsmall circle of revolutionary elites. This commitment to freedom as\nreflected in the practical activity of the working class movement\nrather than a static goal to be approximated with the right tools was\nalso reflected in her criticism of centralized models of political\norganization, motivating her scepticism towards the idea of a vanguard\nparty championed by Vladimir Lenin. For Lenin, the political vanguard\nconsisted of a selection of the most disciplined, intellectually\nsophisticated, and motivated revolutionaries whose role was to\ncultivate “agitation” with the aim of transforming\nworkers’ mobilisation to achieve short-term goals into a wide\nranging struggle aiming to secure their access to political\npower. Only a party guided by a small elite of revolutionaries aware\nof the twin dangers of both opportunism (too much compromise) and\nsectarianism (too little compromise), Lenin argued, was capable of\ngiving the working class movement a compass with which to orient\nitself in the long-term (Lenin 1929 [1987: 95]). As Lenin puts it, the\nprofessional revolutionary is not merely a trade union secretary but a\n“tribune of the people”, able to react to injustice\nregardless of where it takes place or which group of people it affects\nso as to “group all these manifestations into a single picture\nof political violence […] in order to explain to everyone the\nworld-historical significance of the struggle” (Lenin 1929\n[1987: 113]).\n\n\nLuxemburg was one of the first to draw attention to the risks of\nprogressive isolation from the wider movement that this conception of\npartisanship entailed. Although she applauded the October Revolution\nof 1917 for showing that the idea of a working class state was no\nhopeless utopia, she insisted that without connection to and guidance\nfrom the masses, the party would soon reach a state of bureaucratic\nstalemate, separate from the concerns of the rest of society which\nwould endanger the very freedoms that socialists promised to\nrealise. As she memorably put it: “Freedom for supporters of the\ngovernment only, for members of one part only – no matter how\nnumerous they might be is no freedom at all. Freedom is always freedom\nfor those who think differently” (Luxemburg 1922 [RLR:\n305]). This freedom to think differently, she believed could only\nflourish if it remained connected to democracy understood as rule by\nthe oppressed people, maturing the skills, epistemic insight and views\nnecessary to guide them in circumstances of revolutionary\ntransitions. She believed that political education of the mass of the\noppressed, and the ability to develop their views through practice was\nessential to working class rule. While a liberal democratic order\ncould maintain its stability thanks to the cooperation of an already\neducated elite, the challenge for a movement of the oppressed was to\ndevelop the knowledge necessary to develop a new political order in\nthe course of transforming the old one. This is why, democratic\npractice and the idea of historical experimentation as a learning\nprocess was crucial. Not, as Luxemburg put it, because of any\nfanaticism about the “concept of ‘justice’ but\nbecause all that is instructive, wholesome and purifying in political\nfreedom depends on this essential characteristic”, and\n“freedom” effectively loses its meaning once it becomes a\nprivilege (Luxemburg 1922 [RLR: 305]). Active participation in public\nlife required guaranteeing general elections, freedom of the press and\nassembly, and an uncensored exchange of opinions without which public\nlife “gradually falls asleep” and only buraucracy is kept\nalive.\n\nWhile remaining sensitive to the historical circumstances that\nconstrained the Bolsheviks (war, the pressure from the outside, the\ndifficulties in the development of the working class movement in\nRussia, and the infancy of its democratic institutions), Luxemburg was\none of the first Marxist theorists to highlight the importance of\ncombining the struggle for socialism with that for democracy, and to\nwarn against the dangers of divorcing the two. The history of\nsocialist states in the 20th century has proved her\nright. The concentration of power in the hands of a narrow elite of\nparty officials, the lack of transparency and accountability of\ninstitutions, their progressive isolation from the demands of the\npeople, ultimately led to their demise. The ongoing importance of\nLuxemburg’s writings on the Bolshevik revolution lies not so\nmuch in her commentary on a historical experiment of which she always\ndoubted the capacity to survive historical constraints. It consists in\nwhat they tell us about the ethics of revolution and the difficulties\nof constructing a movement of the oppressed which must realise freedom\nin circumstances in which it may lack the historical maturity,\nmaterial and epistemic means that the maintenance of the status quo\nmakes available.\n",
    "section_title": "5. Political organisation",
    "entry_title": "Rosa Luxemburg",
    "hierarchy_title": "Rosa Luxemburg || Political organisation",
    "tokenized_text": [
        "political",
        "organisation",
        "political",
        "organisation",
        "luxemburg",
        "analysis",
        "question",
        "strategy",
        "political",
        "organisation",
        "shaped",
        "reflection",
        "development",
        "capitalism",
        "emphasis",
        "global",
        "character",
        "development",
        "conviction",
        "discussion",
        "issue",
        "political",
        "organisation",
        "historically",
        "informed",
        "sensitive",
        "internal",
        "dynamic",
        "political",
        "movement",
        "different",
        "country",
        "historical",
        "materialism",
        "provided",
        "methodological",
        "foundation",
        "luxemburg",
        "specific",
        "intervention",
        "question",
        "day",
        "reform",
        "vs",
        "revolution",
        "economic",
        "vs",
        "political",
        "struggle",
        "spontaneous",
        "vs",
        "centralised",
        "form",
        "political",
        "organisation",
        "shaped",
        "analysis",
        "two",
        "different",
        "experience",
        "working",
        "class",
        "organisation",
        "western",
        "europe",
        "demand",
        "worker",
        "increasingly",
        "driven",
        "constrained",
        "representation",
        "institution",
        "liberal",
        "parliamentary",
        "democracy",
        "demand",
        "presented",
        "language",
        "civic",
        "right",
        "appeal",
        "taking",
        "form",
        "call",
        "collective",
        "democratic",
        "responsibilty",
        "eastern",
        "europe",
        "struggle",
        "worker",
        "right",
        "took",
        "place",
        "mostly",
        "underground",
        "political",
        "debate",
        "constantly",
        "threatened",
        "censorship",
        "mass",
        "action",
        "organised",
        "secret",
        "great",
        "risk",
        "activist",
        "life",
        "debate",
        "therefore",
        "different",
        "luxemburg",
        "essay",
        "mass",
        "strike",
        "political",
        "party",
        "trade",
        "union",
        "synthesis",
        "lesson",
        "learned",
        "russian",
        "revolution",
        "reflects",
        "better",
        "understand",
        "working",
        "class",
        "organisation",
        "whole",
        "focus",
        "discussion",
        "political",
        "economic",
        "strike",
        "method",
        "struggle",
        "capitalism",
        "strike",
        "confined",
        "particular",
        "sector",
        "production",
        "particular",
        "town",
        "understood",
        "isolation",
        "luxemburg",
        "argued",
        "mass",
        "strike",
        "suggests",
        "seen",
        "crafty",
        "method",
        "discovered",
        "subtle",
        "reasoning",
        "purpose",
        "making",
        "proletarian",
        "struggle",
        "effective",
        "method",
        "motion",
        "proletarian",
        "mass",
        "phenomenal",
        "form",
        "proletarian",
        "struggle",
        "revolution",
        "luxemburg",
        "rlr",
        "strike",
        "may",
        "begin",
        "series",
        "demand",
        "say",
        "reduced",
        "working",
        "hour",
        "improved",
        "pay",
        "demand",
        "fairer",
        "distribution",
        "inseparable",
        "question",
        "worker",
        "access",
        "political",
        "power",
        "luxemburg",
        "put",
        "economic",
        "struggle",
        "transmitter",
        "one",
        "political",
        "centre",
        "another",
        "political",
        "struggle",
        "periodic",
        "fertilization",
        "soil",
        "economic",
        "struggle",
        "luxemburg",
        "rlr",
        "interdependence",
        "economic",
        "political",
        "struggle",
        "also",
        "meant",
        "question",
        "mass",
        "strike",
        "could",
        "separated",
        "revolution",
        "observed",
        "point",
        "view",
        "public",
        "order",
        "street",
        "disturbance",
        "rioting",
        "bloodshed",
        "thoroughgoing",
        "internal",
        "reversal",
        "existing",
        "class",
        "relation",
        "luxemburg",
        "rlr",
        "yet",
        "precisely",
        "mass",
        "strike",
        "understood",
        "isolated",
        "measure",
        "called",
        "inextricably",
        "linked",
        "fate",
        "revolution",
        "decision",
        "bring",
        "could",
        "come",
        "even",
        "highest",
        "committee",
        "strongest",
        "social",
        "democratic",
        "party",
        "luxemburg",
        "rlr",
        "course",
        "luxemburg",
        "conceded",
        "initiative",
        "direction",
        "mass",
        "education",
        "party",
        "discipline",
        "crucial",
        "role",
        "play",
        "revolutionary",
        "organisation",
        "convinced",
        "revolution",
        "allow",
        "anyone",
        "play",
        "schoolmaster",
        "argued",
        "every",
        "individual",
        "act",
        "struggle",
        "many",
        "important",
        "economic",
        "political",
        "social",
        "general",
        "local",
        "material",
        "psychical",
        "factor",
        "react",
        "upon",
        "one",
        "another",
        "way",
        "single",
        "act",
        "arranged",
        "resolved",
        "mathematical",
        "problem",
        "luxemburg",
        "rlr",
        "essence",
        "labelled",
        "theory",
        "role",
        "spontaneity",
        "political",
        "organisation",
        "much",
        "theory",
        "effort",
        "understand",
        "dynamic",
        "political",
        "action",
        "grounded",
        "belief",
        "course",
        "political",
        "mobilisation",
        "activity",
        "oppressed",
        "group",
        "able",
        "develop",
        "epistemic",
        "insight",
        "political",
        "tool",
        "collective",
        "motivation",
        "required",
        "change",
        "course",
        "history",
        "lesson",
        "political",
        "party",
        "luxemburg",
        "argued",
        "focus",
        "technical",
        "side",
        "mechanism",
        "mass",
        "strike",
        "ensure",
        "never",
        "fall",
        "level",
        "demanded",
        "actual",
        "relation",
        "force",
        "rather",
        "rise",
        "luxemburg",
        "rlr",
        "reform",
        "explained",
        "provided",
        "crucial",
        "learning",
        "platform",
        "mass",
        "oppressed",
        "people",
        "would",
        "develop",
        "capacity",
        "autonomous",
        "decisionmaking",
        "prepare",
        "conquest",
        "political",
        "power",
        "yet",
        "reform",
        "trial",
        "freedom",
        "freedom",
        "luxemburg",
        "analysis",
        "political",
        "organisation",
        "received",
        "several",
        "critique",
        "contrasting",
        "perspective",
        "one",
        "hand",
        "pointed",
        "luxemburg",
        "able",
        "navigate",
        "carefully",
        "choice",
        "national",
        "parliamentary",
        "representation",
        "revolutionary",
        "analysis",
        "class",
        "conflict",
        "transcended",
        "state",
        "boundary",
        "opposed",
        "second",
        "international",
        "naïve",
        "faith",
        "national",
        "social",
        "democracy",
        "le",
        "naïve",
        "belief",
        "democratising",
        "effect",
        "continuously",
        "expanding",
        "wave",
        "strike",
        "eley",
        "hand",
        "faith",
        "spontanous",
        "power",
        "mass",
        "often",
        "interpreted",
        "unavoidable",
        "consequence",
        "certain",
        "degree",
        "determinism",
        "fatalism",
        "embedded",
        "analysis",
        "limit",
        "capital",
        "accumulation",
        "emphasis",
        "inherent",
        "tendency",
        "towards",
        "crisis",
        "see",
        "discussion",
        "literature",
        "geras",
        "ch",
        "however",
        "norman",
        "geras",
        "pointed",
        "phrasing",
        "text",
        "resembles",
        "standard",
        "formulation",
        "second",
        "international",
        "extent",
        "collapse",
        "capitalism",
        "perceived",
        "inherently",
        "unavoidable",
        "rhetoric",
        "could",
        "occasionally",
        "serve",
        "psychological",
        "motivating",
        "role",
        "luxemburg",
        "far",
        "considering",
        "emergence",
        "socialism",
        "matter",
        "fatal",
        "destiny",
        "geras",
        "contrary",
        "made",
        "clear",
        "socialism",
        "going",
        "fall",
        "manna",
        "heaven",
        "skip",
        "period",
        "historical",
        "development",
        "man",
        "jump",
        "shadow",
        "lie",
        "within",
        "power",
        "accelerate",
        "retard",
        "luxemburg",
        "rlr",
        "meaning",
        "engels",
        "famous",
        "slogan",
        "socialism",
        "barbarism",
        "luxemburg",
        "commented",
        "junius",
        "pamphlet",
        "quite",
        "opposite",
        "determinism",
        "vindication",
        "conscious",
        "agency",
        "oppressed",
        "transformation",
        "argued",
        "proletariat",
        "powerless",
        "victim",
        "history",
        "conscious",
        "guide",
        "luxemburg",
        "rlr",
        "belief",
        "power",
        "oppressed",
        "mass",
        "role",
        "spontaneous",
        "action",
        "developing",
        "revolutionary",
        "organisation",
        "informed",
        "luxemburg",
        "response",
        "colleague",
        "german",
        "social",
        "democratic",
        "party",
        "call",
        "combine",
        "parliamentary",
        "initiative",
        "defence",
        "mass",
        "strike",
        "focal",
        "point",
        "revolutionary",
        "organisation",
        "extent",
        "view",
        "reflected",
        "attitude",
        "polish",
        "worker",
        "movement",
        "regard",
        "luxemburg",
        "sometimes",
        "criticised",
        "rigidity",
        "sectarian",
        "stance",
        "contested",
        "question",
        "blanc",
        "however",
        "doubt",
        "political",
        "experience",
        "polish",
        "german",
        "organisation",
        "played",
        "important",
        "role",
        "analysis",
        "political",
        "development",
        "russia",
        "revolution",
        "bolshevik",
        "conquest",
        "power",
        "october",
        "initially",
        "sceptical",
        "possibility",
        "worker",
        "government",
        "russia",
        "could",
        "last",
        "long",
        "time",
        "luxemburg",
        "nevertheless",
        "praised",
        "bolshevik",
        "symbolic",
        "importance",
        "showing",
        "world",
        "revolutionary",
        "programme",
        "led",
        "proletariat",
        "worth",
        "fighting",
        "despite",
        "constraint",
        "imposed",
        "circumstance",
        "also",
        "urged",
        "colleague",
        "spd",
        "abandon",
        "caution",
        "support",
        "bolshevik",
        "greater",
        "conviction",
        "oppressed",
        "people",
        "russia",
        "would",
        "eventually",
        "able",
        "find",
        "orientation",
        "despite",
        "many",
        "considered",
        "unripe",
        "circumstance",
        "put",
        "essay",
        "russian",
        "revolution",
        "writen",
        "prison",
        "world",
        "war",
        "published",
        "death",
        "proletariat",
        "seizes",
        "power",
        "never",
        "follow",
        "kautsky",
        "good",
        "advice",
        "dispense",
        "socialist",
        "transformation",
        "country",
        "ground",
        "country",
        "unripe",
        "need",
        "argues",
        "immediately",
        "embark",
        "socialist",
        "measure",
        "energetic",
        "unyielding",
        "ruthless",
        "way",
        "word",
        "must",
        "exercise",
        "dictatorship",
        "dictatorship",
        "class",
        "party",
        "clique",
        "dictatorship",
        "class",
        "mean",
        "full",
        "view",
        "broadest",
        "public",
        "active",
        "uninhibited",
        "participation",
        "popular",
        "mass",
        "unlimited",
        "democracy",
        "luxemburg",
        "rlr",
        "see",
        "also",
        "luxemburg",
        "interpreted",
        "demand",
        "dictatorship",
        "proletariat",
        "way",
        "marx",
        "engels",
        "done",
        "transitional",
        "emergency",
        "institution",
        "required",
        "realise",
        "democracy",
        "society",
        "rigged",
        "class",
        "struggle",
        "see",
        "broader",
        "discussion",
        "concept",
        "ypi",
        "strongly",
        "believed",
        "dictatorship",
        "proletariat",
        "brought",
        "mass",
        "oppressed",
        "effort",
        "liberate",
        "inflicted",
        "small",
        "circle",
        "revolutionary",
        "elite",
        "commitment",
        "freedom",
        "reflected",
        "practical",
        "activity",
        "working",
        "class",
        "movement",
        "rather",
        "static",
        "goal",
        "approximated",
        "right",
        "tool",
        "also",
        "reflected",
        "criticism",
        "centralized",
        "model",
        "political",
        "organization",
        "motivating",
        "scepticism",
        "towards",
        "idea",
        "vanguard",
        "party",
        "championed",
        "vladimir",
        "lenin",
        "lenin",
        "political",
        "vanguard",
        "consisted",
        "selection",
        "disciplined",
        "intellectually",
        "sophisticated",
        "motivated",
        "revolutionary",
        "whose",
        "role",
        "cultivate",
        "agitation",
        "aim",
        "transforming",
        "worker",
        "mobilisation",
        "achieve",
        "shortterm",
        "goal",
        "wide",
        "ranging",
        "struggle",
        "aiming",
        "secure",
        "access",
        "political",
        "power",
        "party",
        "guided",
        "small",
        "elite",
        "revolutionary",
        "aware",
        "twin",
        "danger",
        "opportunism",
        "much",
        "compromise",
        "sectarianism",
        "little",
        "compromise",
        "lenin",
        "argued",
        "capable",
        "giving",
        "working",
        "class",
        "movement",
        "compass",
        "orient",
        "longterm",
        "lenin",
        "lenin",
        "put",
        "professional",
        "revolutionary",
        "merely",
        "trade",
        "union",
        "secretary",
        "tribune",
        "people",
        "able",
        "react",
        "injustice",
        "regardless",
        "take",
        "place",
        "group",
        "people",
        "affect",
        "group",
        "manifestation",
        "single",
        "picture",
        "political",
        "violence",
        "order",
        "explain",
        "everyone",
        "worldhistorical",
        "significance",
        "struggle",
        "lenin",
        "luxemburg",
        "one",
        "first",
        "draw",
        "attention",
        "risk",
        "progressive",
        "isolation",
        "wider",
        "movement",
        "conception",
        "partisanship",
        "entailed",
        "although",
        "applauded",
        "october",
        "revolution",
        "showing",
        "idea",
        "working",
        "class",
        "state",
        "hopeless",
        "utopia",
        "insisted",
        "without",
        "connection",
        "guidance",
        "mass",
        "party",
        "would",
        "soon",
        "reach",
        "state",
        "bureaucratic",
        "stalemate",
        "separate",
        "concern",
        "rest",
        "society",
        "would",
        "endanger",
        "freedom",
        "socialist",
        "promised",
        "realise",
        "memorably",
        "put",
        "freedom",
        "supporter",
        "government",
        "member",
        "one",
        "part",
        "matter",
        "numerous",
        "might",
        "freedom",
        "freedom",
        "always",
        "freedom",
        "think",
        "differently",
        "luxemburg",
        "rlr",
        "freedom",
        "think",
        "differently",
        "believed",
        "could",
        "flourish",
        "remained",
        "connected",
        "democracy",
        "understood",
        "rule",
        "oppressed",
        "people",
        "maturing",
        "skill",
        "epistemic",
        "insight",
        "view",
        "necessary",
        "guide",
        "circumstance",
        "revolutionary",
        "transition",
        "believed",
        "political",
        "education",
        "mass",
        "oppressed",
        "ability",
        "develop",
        "view",
        "practice",
        "essential",
        "working",
        "class",
        "rule",
        "liberal",
        "democratic",
        "order",
        "could",
        "maintain",
        "stability",
        "thanks",
        "cooperation",
        "already",
        "educated",
        "elite",
        "challenge",
        "movement",
        "oppressed",
        "develop",
        "knowledge",
        "necessary",
        "develop",
        "new",
        "political",
        "order",
        "course",
        "transforming",
        "old",
        "one",
        "democratic",
        "practice",
        "idea",
        "historical",
        "experimentation",
        "learning",
        "process",
        "crucial",
        "luxemburg",
        "put",
        "fanaticism",
        "concept",
        "justice",
        "instructive",
        "wholesome",
        "purifying",
        "political",
        "freedom",
        "depends",
        "essential",
        "characteristic",
        "freedom",
        "effectively",
        "loses",
        "meaning",
        "becomes",
        "privilege",
        "luxemburg",
        "rlr",
        "active",
        "participation",
        "public",
        "life",
        "required",
        "guaranteeing",
        "general",
        "election",
        "freedom",
        "press",
        "assembly",
        "uncensored",
        "exchange",
        "opinion",
        "without",
        "public",
        "life",
        "gradually",
        "fall",
        "asleep",
        "buraucracy",
        "kept",
        "alive",
        "remaining",
        "sensitive",
        "historical",
        "circumstance",
        "constrained",
        "bolshevik",
        "war",
        "pressure",
        "outside",
        "difficulty",
        "development",
        "working",
        "class",
        "movement",
        "russia",
        "infancy",
        "democratic",
        "institution",
        "luxemburg",
        "one",
        "first",
        "marxist",
        "theorist",
        "highlight",
        "importance",
        "combining",
        "struggle",
        "socialism",
        "democracy",
        "warn",
        "danger",
        "divorcing",
        "two",
        "history",
        "socialist",
        "state",
        "th",
        "century",
        "proved",
        "right",
        "concentration",
        "power",
        "hand",
        "narrow",
        "elite",
        "party",
        "official",
        "lack",
        "transparency",
        "accountability",
        "institution",
        "progressive",
        "isolation",
        "demand",
        "people",
        "ultimately",
        "led",
        "demise",
        "ongoing",
        "importance",
        "luxemburg",
        "writing",
        "bolshevik",
        "revolution",
        "lie",
        "much",
        "commentary",
        "historical",
        "experiment",
        "always",
        "doubted",
        "capacity",
        "survive",
        "historical",
        "constraint",
        "consists",
        "tell",
        "u",
        "ethic",
        "revolution",
        "difficulty",
        "constructing",
        "movement",
        "oppressed",
        "must",
        "realise",
        "freedom",
        "circumstance",
        "may",
        "lack",
        "historical",
        "maturity",
        "material",
        "epistemic",
        "mean",
        "maintenance",
        "status",
        "quo",
        "make",
        "available"
    ]
}