{
    "main_text": "Life\n1. Life\n\n\nRosa Luxemburg was born on March 5 1871 in Zamość, a\npredominantly Jewish centre in south-eastern Poland, then occupied by\nTzarist Russia. She was the youngest of five children in a progressive\nfamily of assimilated Jews who were timber merchants. Her father,\nEliasz (Eduard) Luxemburg, like her elder brothers, was educated in\nGermany. Her mother, Line, nee Löwenstein, was a well-read and\nhighly articulate woman with a passion for classical literature,\nespecially German and Polish, which she tried to inculcate on her\nchildren. Two years after Luxemburg’s birth, in 1873, the family\nmoved to Warsaw. At the age of three, Luxemburg contracted a hip\ndisease which was wrongly treated as tuberculosis, and caused her to\nwalk with a limp for the rest of her life. She was bedbound for a\nyear, a period during which she taught herself to read and write.\n\n\nAt the age of thirteen, Luxemburg joined the\ngirls’ Second High School in Warsaw, one of the country’s\nelite schools, dominated by the children of Russian officials, where\nthe use of Polish even among students was forbidden and the places for\nchildren of Jewish families were extremely limited. Luxemburg rebelled\nto the oppressive atmosphere in the school, and developed an interest\nin the activities of the various illegal revolutionary groups agitating\nagainst both capitalist oppression and the despotic character of\nRussian rule. By the time she finished secondary school in 1887, her\n“rebellious attitude towards authorities” was already\nmentioned in official school reports and deprived her of the gold medal\nawarded to the highest performing students (Nettl 1966 [2019: 17]). It is\nalso likely that during this time, she joined what was left of\nProletariat, the first Polish socialist party, at that point\nin disarray after the imprisonment and execution of many of its\nleaders as a result of the repressive measures taken by Russian\nauthorities following the assassination of Tzar Alexander II in\n1881. Faced with imminent arrest herself, she was smuggled out of the\ncountry in 1889 and migrated to Zurich. There she enrolled in the\nfaculty of philosophy, switched to law and wrote a doctoral\ndissertation on “The Industrial Development of Poland”,\nwhere she argued that the integration of the Polish economy into the\nRussian empire meant that the interests of the Polish working class\nwould be held back by championing the cause of national\nself-determination – a position to which she would remain\ncommitted her entire life. In Zurich, Luxemburg also met several other\nMarxists from Russian and Polish emigres circles, including Leo\nJogisches, her partner for many years and co-founder of the Social\nDemocracy of the Kingdom of Poland (SDKP), a Marxist party\ncharacterised by its opposition to the call for Polish independence\nand its staunch commitment to proletarian internationalism.\n\n\nThe Swiss years were characterised by a mix of\nacademic and political work. Luxemburg, just over twenty, was\nentangled in a fight against the main Polish Socialist Party (PSP) by\nthen fully committed to a mixture of progressive nationalism and\nMarxism, and for the recognition of the SDKP by the Socialist\nInternational. She conducted the struggle both on the political stage\nand in the main organs of international social democracy such as\nVorwärts and Neue Zeit, as well as in the\npolitical magazine she and Jogisches edited, Sprawa Robotnica\n(Workers’ Cause). All this meant that when she moved to Germany\nin 1898 with the help of a fictitious marriage to the son of one of her\nfriends, a German national, she was already well known to the\nleadership of the largest social democratic party in the world, the\nSozialdemokratische Partei Deutschlands (SPD). She rose quickly through\nthe ranks of the SPD, in no small part due to her sharply critical\ninterventions in the “revisionist” controversy which shook\nthe party to its core in the years of transition from the\n19th to the 20th century.\n\n\nIn 1905, the first Russian revolution broke up, the “dress\nrehearsal” for the subsequent Bolshevik revolution of 1917, in\nLenin’s famous sentence. It found the socialist movement deeply\ndivided. In the West, socialist parties made steady electoral gains,\nand united superficially in recognition of the moral authority of the\nSecond International but were deeply divided in matters of both\nprinciple and tactics. In Russia, there was no direct equivalent to\nthe debate on reform versus revolution: socialists worked underground\nand were divided mainly on questions of membership and party\norganisation. The 1905 revolution which broke out after decades of\nimpoverishment, a series of defeats by Russia in the Russo-Japanese\nwar, and subjection to authoritarian violence was not so much a single\nevent as the cumulative result of several years of mass strikes,\nborder unrest, and demonstrations which forced Marxists to put the\nquestion of party organisation at the centre of their\ndebates. Luxemburg, recently released from a few months in prison in\nZwickau on a charge of undermining the authority of the German\nemperor, followed the events closely. She published several\ninterventions in which she debated with Lenin on the role of the\nmasses and the party in revolutionary circumstances, and tried to\npersuade her colleagues in the SPD to adopt the mass strike as a\npolitical weapon to advance the cause of workers also in Germany. In\nDecember 1905 she smuggled herself on a military train to the Russian\npart of Poland, and tried to reach Warsaw, where martial law coexisted\nwith a general strike, to resume her work of agitation with the Polish\nworking classes. Within a year she was arrested again, first confined\nto a police prison in the Warsaw town hall then transferred on grounds\nof ill-health to the Warsaw Citadel.  There she spent a few months\nuntil her release following both her family’s intercessions and\npayment of the bail, and her reputation as one of the leading\nactivists of the German SPD.  Immediately after her release from\nprison she went to St Petersburg then Finland, where she met Lenin and\nwrote one of her most famous pamphlets: “The Mass Strike, the\nParty and the Trade Unions”, reflecting on the lessons of the\n1905 revolution.  The story goes that when she proposed these ideas to\nthe SPD Party Congress of Jena in 1905, August Bebel, one of the party\nfounders, joked that – as he listened to a debate with so much\nblood and revolution – he kept “glancing occasionally at\nmy boots to see if these weren’t in fact already wading in\nblood” (Nettl 1966 [2019: 310]).\n\n\nUpon her return to Germany, in 1907, “bloody\nRosa” as she became known to the liberal press was engaged as a\nteacher in the Party School, where she taught “Introduction to\nEconomics” and “Marx’s Capital” to rank and\nfile members of the SPD. Her “Introduction to Economics”\nbased on lecture notes survives only in fragments but “The\nAccumulation of Capital”, published in 1913, is one of the most\nimportant works of theory to have emerged from the Second\nInternational. At the same time, her political stance continued to\nevolve in a direction opposite to the SPD leadership, whose growing\nreluctance to condemn the imperialist ventures of Kaiser Wilhelm II in\nMorocco made her vividly aware both of the dangers of stirring\nnationalist sentiments to increase support for a possible war, and of\nthe evasive attitudes of her colleagues toward rising militarism. She\nfelt increasingly isolated. While the parliamentary party became\nentangled in debates around taxation and suffrage reform, she wrote to\nadvocate the importance of mass struggles, the agitation for a\ndemocratic republic and the conquest of political power by the\nproletariat. Her proposals were met with hostility even from erstwhile\nallies like Karl Kautsky, and the main party publications refused to\npublish her work.\n\n\nThe break came in 1914 when WW1 erupted and the\nSPD voted in favour of war credits, de facto embracing crude\nnationalism at the expense of the internationalist promise of concern\nfor the whole working class regardless of national boundaries. Workers\nonce united against capitalists would now kill each other at the border\nunder different flags. Together with Franz Mehring, Klara Zetkin, and\nKarl Liebknecht, the only SPD deputy in the Reichstag to have opposed\nwar credits until the end, Luxemburg founded the Spartakus\ngroup – initially part of the USPD (Unabhängige\nSozialdemokratische Partei Deutschlands) the anti-war splinter\nfaction from the SPD – and which was also known as the International\ngroup after Die Internationale, the joint publication which\nagitated for an end to the war and developing working class struggle\nagainst capitalism on an international basis. Soon after, Luxemburg was\nimprisoned, released, and then imprisoned again. Behind bars, she wrote\n“The Crisis of Social Democracy” better known as the Junius\npamphlet or Juniusbrochüre because of the pseudonym\nJunius under which it appeared. It was the synthesis of a life’s\ncritique of the limits of liberal parliamentarism, the pursuit of\ncompromise for compromise’s sake, and the consequences of a\nfailure to commit to principled internationalism on the side of social\ndemocratic parties which were organised on a national basis.\n\n\nWhen Luxemburg was released from prison in November 1918, Germany\nlooked very different. The success of the Bolsheviks in Russia in 1917\nwhich led to the peace treaty of Brest-Litovsk between Germany and\nRussia sparked mutiny at the border and a series of strikes and\ninsurrections among the German workers who demanded a democratic\nrepublic. From prison, Luxemburg had greeted the Russian revolution as\n“an act of world-historical significance whose traces will be\nnot be extinguished for aeons” (cited in Fröhlich 1940\n[2010: 239]). But as her verdict makes clear, she was not hopeful that\nthe victory would last, in no small part because she lacked confidence\nthat German social democrats would support their Russian\ncounterparts. While the Spartakus group continued to demand\nthe creation of a socialist republic based on workers’ councils,\nthe SPD greeted the abdication of Kaiser Wilhelm II by installing its\nleader, Friedrich Ebert as chancellor of the new liberal\nparliamentarian republic. From Berlin, Rosa Luxemburg and Karl\nLiebknecht published the first issue of Rote Fahne, the organ\nof the Spartakusbund, followed in December by the\nannouncement of the programme. The contrast between alternatives could\nnot have been starker: either the “traditional organs of\nbourgeois class rule, the federal councils, the parliaments, municipal\ncouncils etc.” or the proletariat’s own “class\norgans: Workers’ and Soldiers’ Councils” in which\nthey “occupy all public posts, superintend all public activity,\nand measure all the needs of the state by their own class interests\nand socialists tasks” (cited in Fröhlich 1940 [2010: 273]). A\ncouple of weeks later the same programme was presented in the\ninaugural Congress of the Communist Party of Germany (KPD) where\nLuxemburg argued in favour of participating in the upcoming January\nelections to the National Assembly. She was outvoted. In the first\ndays of January 1919, another wave of protests saw hundreds of\nthousands of workers descend into the streets and occupy train\nstations and newspapers. The Spartakists urged caution. Despite the\nanarchy in Berlin, Luxemburg, especially, did not think the German\npeople were ready for a socialist revolution. The Spartakist uprising\nmobilised the far right, while, Gustav Noske, the social-democratic\nInterior minister ordered the police to crush the protests. With the\nhelp of the Freikorps, the far-right, anti-republican, proto-nazi\nparamilitary groups, many activists were arrested and murdered. The\nsame fate would soon fall on Karl Liebknecht and Rosa Luxemburg. On\nthe 15th January 1919, they were discovered in their hiding\nplace, arrested, knocked unconscious with rifle buts then\nshot. Luxemburg’s body was thrown into Berlin’s Landwehr\nCanal, from where it washed ashore a few months after.\n",
    "section_title": "1. Life",
    "entry_title": "Rosa Luxemburg",
    "hierarchy_title": "Rosa Luxemburg || Life",
    "tokenized_text": [
        "life",
        "life",
        "rosa",
        "luxemburg",
        "born",
        "march",
        "zamość",
        "predominantly",
        "jewish",
        "centre",
        "southeastern",
        "poland",
        "occupied",
        "tzarist",
        "russia",
        "youngest",
        "five",
        "child",
        "progressive",
        "family",
        "assimilated",
        "jew",
        "timber",
        "merchant",
        "father",
        "eliasz",
        "eduard",
        "luxemburg",
        "like",
        "elder",
        "brother",
        "educated",
        "germany",
        "mother",
        "line",
        "nee",
        "löwenstein",
        "wellread",
        "highly",
        "articulate",
        "woman",
        "passion",
        "classical",
        "literature",
        "especially",
        "german",
        "polish",
        "tried",
        "inculcate",
        "child",
        "two",
        "year",
        "luxemburg",
        "birth",
        "family",
        "moved",
        "warsaw",
        "age",
        "three",
        "luxemburg",
        "contracted",
        "hip",
        "disease",
        "wrongly",
        "treated",
        "tuberculosis",
        "caused",
        "walk",
        "limp",
        "rest",
        "life",
        "bedbound",
        "year",
        "period",
        "taught",
        "read",
        "write",
        "age",
        "thirteen",
        "luxemburg",
        "joined",
        "girl",
        "second",
        "high",
        "school",
        "warsaw",
        "one",
        "country",
        "elite",
        "school",
        "dominated",
        "child",
        "russian",
        "official",
        "use",
        "polish",
        "even",
        "among",
        "student",
        "forbidden",
        "place",
        "child",
        "jewish",
        "family",
        "extremely",
        "limited",
        "luxemburg",
        "rebelled",
        "oppressive",
        "atmosphere",
        "school",
        "developed",
        "interest",
        "activity",
        "various",
        "illegal",
        "revolutionary",
        "group",
        "agitating",
        "capitalist",
        "oppression",
        "despotic",
        "character",
        "russian",
        "rule",
        "time",
        "finished",
        "secondary",
        "school",
        "rebellious",
        "attitude",
        "towards",
        "authority",
        "already",
        "mentioned",
        "official",
        "school",
        "report",
        "deprived",
        "gold",
        "medal",
        "awarded",
        "highest",
        "performing",
        "student",
        "nettl",
        "also",
        "likely",
        "time",
        "joined",
        "left",
        "proletariat",
        "first",
        "polish",
        "socialist",
        "party",
        "point",
        "disarray",
        "imprisonment",
        "execution",
        "many",
        "leader",
        "result",
        "repressive",
        "measure",
        "taken",
        "russian",
        "authority",
        "following",
        "assassination",
        "tzar",
        "alexander",
        "ii",
        "faced",
        "imminent",
        "arrest",
        "smuggled",
        "country",
        "migrated",
        "zurich",
        "enrolled",
        "faculty",
        "philosophy",
        "switched",
        "law",
        "wrote",
        "doctoral",
        "dissertation",
        "industrial",
        "development",
        "poland",
        "argued",
        "integration",
        "polish",
        "economy",
        "russian",
        "empire",
        "meant",
        "interest",
        "polish",
        "working",
        "class",
        "would",
        "held",
        "back",
        "championing",
        "cause",
        "national",
        "selfdetermination",
        "position",
        "would",
        "remain",
        "committed",
        "entire",
        "life",
        "zurich",
        "luxemburg",
        "also",
        "met",
        "several",
        "marxist",
        "russian",
        "polish",
        "emigre",
        "circle",
        "including",
        "leo",
        "jogisches",
        "partner",
        "many",
        "year",
        "cofounder",
        "social",
        "democracy",
        "kingdom",
        "poland",
        "sdkp",
        "marxist",
        "party",
        "characterised",
        "opposition",
        "call",
        "polish",
        "independence",
        "staunch",
        "commitment",
        "proletarian",
        "internationalism",
        "swiss",
        "year",
        "characterised",
        "mix",
        "academic",
        "political",
        "work",
        "luxemburg",
        "twenty",
        "entangled",
        "fight",
        "main",
        "polish",
        "socialist",
        "party",
        "psp",
        "fully",
        "committed",
        "mixture",
        "progressive",
        "nationalism",
        "marxism",
        "recognition",
        "sdkp",
        "socialist",
        "international",
        "conducted",
        "struggle",
        "political",
        "stage",
        "main",
        "organ",
        "international",
        "social",
        "democracy",
        "vorwärts",
        "neue",
        "zeit",
        "well",
        "political",
        "magazine",
        "jogisches",
        "edited",
        "sprawa",
        "robotnica",
        "worker",
        "cause",
        "meant",
        "moved",
        "germany",
        "help",
        "fictitious",
        "marriage",
        "son",
        "one",
        "friend",
        "german",
        "national",
        "already",
        "well",
        "known",
        "leadership",
        "largest",
        "social",
        "democratic",
        "party",
        "world",
        "sozialdemokratische",
        "partei",
        "deutschland",
        "spd",
        "rose",
        "quickly",
        "rank",
        "spd",
        "small",
        "part",
        "due",
        "sharply",
        "critical",
        "intervention",
        "revisionist",
        "controversy",
        "shook",
        "party",
        "core",
        "year",
        "transition",
        "th",
        "th",
        "century",
        "first",
        "russian",
        "revolution",
        "broke",
        "dress",
        "rehearsal",
        "subsequent",
        "bolshevik",
        "revolution",
        "lenin",
        "famous",
        "sentence",
        "found",
        "socialist",
        "movement",
        "deeply",
        "divided",
        "west",
        "socialist",
        "party",
        "made",
        "steady",
        "electoral",
        "gain",
        "united",
        "superficially",
        "recognition",
        "moral",
        "authority",
        "second",
        "international",
        "deeply",
        "divided",
        "matter",
        "principle",
        "tactic",
        "russia",
        "direct",
        "equivalent",
        "debate",
        "reform",
        "versus",
        "revolution",
        "socialist",
        "worked",
        "underground",
        "divided",
        "mainly",
        "question",
        "membership",
        "party",
        "organisation",
        "revolution",
        "broke",
        "decade",
        "impoverishment",
        "series",
        "defeat",
        "russia",
        "russojapanese",
        "war",
        "subjection",
        "authoritarian",
        "violence",
        "much",
        "single",
        "event",
        "cumulative",
        "result",
        "several",
        "year",
        "mass",
        "strike",
        "border",
        "unrest",
        "demonstration",
        "forced",
        "marxist",
        "put",
        "question",
        "party",
        "organisation",
        "centre",
        "debate",
        "luxemburg",
        "recently",
        "released",
        "month",
        "prison",
        "zwickau",
        "charge",
        "undermining",
        "authority",
        "german",
        "emperor",
        "followed",
        "event",
        "closely",
        "published",
        "several",
        "intervention",
        "debated",
        "lenin",
        "role",
        "mass",
        "party",
        "revolutionary",
        "circumstance",
        "tried",
        "persuade",
        "colleague",
        "spd",
        "adopt",
        "mass",
        "strike",
        "political",
        "weapon",
        "advance",
        "cause",
        "worker",
        "also",
        "germany",
        "december",
        "smuggled",
        "military",
        "train",
        "russian",
        "part",
        "poland",
        "tried",
        "reach",
        "warsaw",
        "martial",
        "law",
        "coexisted",
        "general",
        "strike",
        "resume",
        "work",
        "agitation",
        "polish",
        "working",
        "class",
        "within",
        "year",
        "arrested",
        "first",
        "confined",
        "police",
        "prison",
        "warsaw",
        "town",
        "hall",
        "transferred",
        "ground",
        "illhealth",
        "warsaw",
        "citadel",
        "spent",
        "month",
        "release",
        "following",
        "family",
        "intercession",
        "payment",
        "bail",
        "reputation",
        "one",
        "leading",
        "activist",
        "german",
        "spd",
        "immediately",
        "release",
        "prison",
        "went",
        "st",
        "petersburg",
        "finland",
        "met",
        "lenin",
        "wrote",
        "one",
        "famous",
        "pamphlet",
        "mass",
        "strike",
        "party",
        "trade",
        "union",
        "reflecting",
        "lesson",
        "revolution",
        "story",
        "go",
        "proposed",
        "idea",
        "spd",
        "party",
        "congress",
        "jena",
        "august",
        "bebel",
        "one",
        "party",
        "founder",
        "joked",
        "listened",
        "debate",
        "much",
        "blood",
        "revolution",
        "kept",
        "glancing",
        "occasionally",
        "boot",
        "see",
        "fact",
        "already",
        "wading",
        "blood",
        "nettl",
        "upon",
        "return",
        "germany",
        "bloody",
        "rosa",
        "became",
        "known",
        "liberal",
        "press",
        "engaged",
        "teacher",
        "party",
        "school",
        "taught",
        "introduction",
        "economics",
        "marx",
        "capital",
        "rank",
        "file",
        "member",
        "spd",
        "introduction",
        "economics",
        "based",
        "lecture",
        "note",
        "survives",
        "fragment",
        "accumulation",
        "capital",
        "published",
        "one",
        "important",
        "work",
        "theory",
        "emerged",
        "second",
        "international",
        "time",
        "political",
        "stance",
        "continued",
        "evolve",
        "direction",
        "opposite",
        "spd",
        "leadership",
        "whose",
        "growing",
        "reluctance",
        "condemn",
        "imperialist",
        "venture",
        "kaiser",
        "wilhelm",
        "ii",
        "morocco",
        "made",
        "vividly",
        "aware",
        "danger",
        "stirring",
        "nationalist",
        "sentiment",
        "increase",
        "support",
        "possible",
        "war",
        "evasive",
        "attitude",
        "colleague",
        "toward",
        "rising",
        "militarism",
        "felt",
        "increasingly",
        "isolated",
        "parliamentary",
        "party",
        "became",
        "entangled",
        "debate",
        "around",
        "taxation",
        "suffrage",
        "reform",
        "wrote",
        "advocate",
        "importance",
        "mass",
        "struggle",
        "agitation",
        "democratic",
        "republic",
        "conquest",
        "political",
        "power",
        "proletariat",
        "proposal",
        "met",
        "hostility",
        "even",
        "erstwhile",
        "ally",
        "like",
        "karl",
        "kautsky",
        "main",
        "party",
        "publication",
        "refused",
        "publish",
        "work",
        "break",
        "came",
        "ww",
        "erupted",
        "spd",
        "voted",
        "favour",
        "war",
        "credit",
        "de",
        "facto",
        "embracing",
        "crude",
        "nationalism",
        "expense",
        "internationalist",
        "promise",
        "concern",
        "whole",
        "working",
        "class",
        "regardless",
        "national",
        "boundary",
        "worker",
        "united",
        "capitalist",
        "would",
        "kill",
        "border",
        "different",
        "flag",
        "together",
        "franz",
        "mehring",
        "klara",
        "zetkin",
        "karl",
        "liebknecht",
        "spd",
        "deputy",
        "reichstag",
        "opposed",
        "war",
        "credit",
        "end",
        "luxemburg",
        "founded",
        "spartakus",
        "group",
        "initially",
        "part",
        "uspd",
        "unabhängige",
        "sozialdemokratische",
        "partei",
        "deutschland",
        "antiwar",
        "splinter",
        "faction",
        "spd",
        "also",
        "known",
        "international",
        "group",
        "die",
        "internationale",
        "joint",
        "publication",
        "agitated",
        "end",
        "war",
        "developing",
        "working",
        "class",
        "struggle",
        "capitalism",
        "international",
        "basis",
        "soon",
        "luxemburg",
        "imprisoned",
        "released",
        "imprisoned",
        "behind",
        "bar",
        "wrote",
        "crisis",
        "social",
        "democracy",
        "better",
        "known",
        "junius",
        "pamphlet",
        "juniusbrochüre",
        "pseudonym",
        "junius",
        "appeared",
        "synthesis",
        "life",
        "critique",
        "limit",
        "liberal",
        "parliamentarism",
        "pursuit",
        "compromise",
        "compromise",
        "sake",
        "consequence",
        "failure",
        "commit",
        "principled",
        "internationalism",
        "side",
        "social",
        "democratic",
        "party",
        "organised",
        "national",
        "basis",
        "luxemburg",
        "released",
        "prison",
        "november",
        "germany",
        "looked",
        "different",
        "success",
        "bolshevik",
        "russia",
        "led",
        "peace",
        "treaty",
        "brestlitovsk",
        "germany",
        "russia",
        "sparked",
        "mutiny",
        "border",
        "series",
        "strike",
        "insurrection",
        "among",
        "german",
        "worker",
        "demanded",
        "democratic",
        "republic",
        "prison",
        "luxemburg",
        "greeted",
        "russian",
        "revolution",
        "act",
        "worldhistorical",
        "significance",
        "whose",
        "trace",
        "extinguished",
        "aeon",
        "cited",
        "fröhlich",
        "verdict",
        "make",
        "clear",
        "hopeful",
        "victory",
        "would",
        "last",
        "small",
        "part",
        "lacked",
        "confidence",
        "german",
        "social",
        "democrat",
        "would",
        "support",
        "russian",
        "counterpart",
        "spartakus",
        "group",
        "continued",
        "demand",
        "creation",
        "socialist",
        "republic",
        "based",
        "worker",
        "council",
        "spd",
        "greeted",
        "abdication",
        "kaiser",
        "wilhelm",
        "ii",
        "installing",
        "leader",
        "friedrich",
        "ebert",
        "chancellor",
        "new",
        "liberal",
        "parliamentarian",
        "republic",
        "berlin",
        "rosa",
        "luxemburg",
        "karl",
        "liebknecht",
        "published",
        "first",
        "issue",
        "rote",
        "fahne",
        "organ",
        "spartakusbund",
        "followed",
        "december",
        "announcement",
        "programme",
        "contrast",
        "alternative",
        "could",
        "starker",
        "either",
        "traditional",
        "organ",
        "bourgeois",
        "class",
        "rule",
        "federal",
        "council",
        "parliament",
        "municipal",
        "council",
        "etc",
        "proletariat",
        "class",
        "organ",
        "worker",
        "soldier",
        "council",
        "occupy",
        "public",
        "post",
        "superintend",
        "public",
        "activity",
        "measure",
        "need",
        "state",
        "class",
        "interest",
        "socialist",
        "task",
        "cited",
        "fröhlich",
        "couple",
        "week",
        "later",
        "programme",
        "presented",
        "inaugural",
        "congress",
        "communist",
        "party",
        "germany",
        "kpd",
        "luxemburg",
        "argued",
        "favour",
        "participating",
        "upcoming",
        "january",
        "election",
        "national",
        "assembly",
        "outvoted",
        "first",
        "day",
        "january",
        "another",
        "wave",
        "protest",
        "saw",
        "hundred",
        "thousand",
        "worker",
        "descend",
        "street",
        "occupy",
        "train",
        "station",
        "newspaper",
        "spartakists",
        "urged",
        "caution",
        "despite",
        "anarchy",
        "berlin",
        "luxemburg",
        "especially",
        "think",
        "german",
        "people",
        "ready",
        "socialist",
        "revolution",
        "spartakist",
        "uprising",
        "mobilised",
        "far",
        "right",
        "gustav",
        "noske",
        "socialdemocratic",
        "interior",
        "minister",
        "ordered",
        "police",
        "crush",
        "protest",
        "help",
        "freikorps",
        "farright",
        "antirepublican",
        "protonazi",
        "paramilitary",
        "group",
        "many",
        "activist",
        "arrested",
        "murdered",
        "fate",
        "would",
        "soon",
        "fall",
        "karl",
        "liebknecht",
        "rosa",
        "luxemburg",
        "th",
        "january",
        "discovered",
        "hiding",
        "place",
        "arrested",
        "knocked",
        "unconscious",
        "rifle",
        "buts",
        "shot",
        "luxemburg",
        "body",
        "thrown",
        "berlin",
        "landwehr",
        "canal",
        "washed",
        "ashore",
        "month"
    ]
}