{
    "main_text": "Traditional Definition of Deception\n3.1 Objections to the Traditional Definition of Deception\n\n\nSeveral objections can be made to D1. One objection is that it is not\nnecessary that the deceiver causes another person to have a false\nbelief that is (truly) believed to be false by the deceiver: “if\nI intentionally cause you to believe that p where p is\nfalse and I neither believe that p is true nor believe\nthat p is false” (Carson 2010, 48) then this is still\ndeception (van Frassen 1988; Barnes 1997; cf. Shiffrin 2014, 13). For\nexample, if Michael has no belief whatsoever regarding the condition\nof the bridge, but he convinces Gertrude that the bridge is safe, and\nthe bridge happens to be dangerous, then Michael deceives Gertrude\nabout the bridge being safe (van Frassen 1988, 124). Or, if Alyce\nplaces a fake rabbit in Evelyn’s garden, in which lives a\nreclusive rabbit, in order to guarantee that Evelyn believes that she\nis seeing a rabbit in her garden (one way or the other), and Evelyn\nsees the fake rabbit, and calls Alyce on the phone and tells her\n“I am looking at a rabbit in my garden!” then Alyce has\ndeceived Evelyn, even though she cannot believe or know that Evelyn is\nseeing the fake rabbit rather than the real rabbit (Barnes 1997,\n11). Although this objection to D1 is not necessarily compelling\n(Mahon 2007, 191–2), a modified definition of interpersonal\ndeception that incorporates this objection is as follows:\n\n(D2)\nA person x deceives another person y if and only\nif x intentionally causes y to believe p,\nwhere p is false and x does not believe that p is\ntrue. (Carson 2010, 48)\n\n\n\nThe most common objection to D1 is that it is not necessary that the\ndeceiver intentionally cause another person to have a new\nfalse belief. Although this form of deception, according to which a\nperson intentionally brings about “the change from the state of\nnot being deceived… to that of being deceived” (Chisholm\nand Feehan 1977, 144), is the most normal form of deception, it is not\nthe only form. A person may deceive another person by causing that\nperson to continue to have a false belief (Fuller 1976, 21;\nChisholm and Feehan 1977, 144; Mahon 2007 189–190; Carson 2010, 50;\nShiffrin 2014, 19). This is where, “but for the act” of the\ndeceiver, the person “would have lost or given up” the\nfalse belief (Chisholm and Feehan 1977, 144), or least have a greater\nchance of losing the false belief. A modified definition of\ninterpersonal deception that incorporates this objection is the\nfollowing:\n\n(D3)\nA person x deceives another person y if and only\nif x intentionally causes y to believe p (or\npersist in believing p), where p is false and x\nknows or believes that p is false. (Carson 2010, 50)\n\n\n\nA further objection to D1 (and D2 and D3) is that it is not sufficient\nfor deception that a person intentionally causes another person to\nhave a false belief that she truly believes or knows to be false; it\nmust also be that this false belief is caused by evidence,\nand that the evidence is brought about by the person in order\nto cause the other person to have the false belief (Linsky 1970, 163;\nFuller 1976, 23; Schmitt 1988, 185; Barnes 1997, 14; Mahon 2007). If\nAndrew intentionally causes Ben to believe (falsely) that there are\nvampires in England by, for example, operating on Ben’s brain,\nor giving Ben an electric shock, or drugging Ben, then Andrew does\nnot deceive Ben about there being vampires in England. Also, if Andrew\ncauses Ben to believe falsely that there are vampires in England by\ngetting Ben to read a book that purports to demonstrate that there are\nvampires in England, then Andrew does not deceive Ben about there\nbeing vampires in England.  However, if Andrew writes a book that\npurports to demonstrate that there are vampires in England, and Ben\nreads the book, and as a result Ben comes to believe that there are\nvampires in England, then Andrew does deceive Ben about there being\nvampires in England (Fuller 1976). A modified definition of\ninterpersonal deception that incorporates this objection is the\nfollowing:\n\n(D4)\nTo deceive =df to intentionally cause another\nperson to have or continue to have a false belief that is known or\ntruly believed to be false by bringing about evidence on the basis of\nwhich the person has or continues to have the false belief.\n(Mahon 2007, 189–190)\n\n\n\nAll of the definitions so far considered are definitions of positive\ndeception, where a person “has been caused to add\nto his stock of false beliefs” or has been caused to continue to\nhave a false belief (Chisholm and Feehan 1977, 144). A further\nobjection to D1 (and D2, D3, and D4) is that it is not necessary for\ndeception to cause a new belief or to cause to continue to have a false\nbelief. One can deceive another person by causing the person to\ncease to have a true belief, or by preventing the person\nfrom acquiring a true belief. These are both cases of negative\ndeception, according to which a person “has been caused to\nlose one of his true beliefs” or been prevented from\ngaining a true belief (Chisholm and Feehan 1977, 143–144). For\nexample, if I intentionally distract someone who is prone to\nforgetting things irretrievably when distracted, in order to make that\nperson forget something irretrievably, and, as a result, that person\nloses a (veridical) memory irretrievably, then I have caused him to\ncease to have a true belief. (In science-fiction the same result can\nbe achieved by using a memory-erasing device, as in the neuralyzer\nused in the 1997 science-fiction film Men in Black). Also, if\nI hide a section of the newspaper from someone in order to prevent her\nfrom learning about some news item, such as an earthquake in a foreign\ncountry that harmed no-one, then I prevented her from acquiring a true\nbelief about a distant earthquake. A modified definition of\ninterpersonal deception that incorporates this objection is the\nfollowing:\n\n(D5)\nTo deceive =df to intentionally cause another person\nto acquire a false belief, or to continue to have a false belief, or to\ncease to have a true belief, or to be prevented from acquiring a true\nbelief.\n\n\n\nHowever, this objection to D1 (and D2, D3, and D4) is not\nnecessarily compelling. It may be argued that negative deception is not\ndeception at all. After all, no false belief has been acquired or sustained.\nIt may be argued that to prevent someone from acquiring a true belief\nis to keep that person in ignorance, or to keep that person “in\nthe dark,” rather than to deceive that person (Mahon 2007,\n187–188; cf. Carson 2010, 53). The state of being ignorant is not the\nsame as the state of being mistaken. One may not know what city is the\ncapital city of Estonia (Tallinn); this is different from mistakenly\nbelieving that Riga is the capital city of Estonia. Similarly, although\nit is more unusual, rendering a person ignorant of some matter is not\nthe same as deceiving that person, at least if it results in no false\nbelief. For example, in the 2004 science-fiction film The Eternal\nSunshine of the Spotless Mind, people go to Lacuna, Inc., to have\ntheir memories of their previous relationships, as well as their visits, erased.\nThose who run Lacuna, Inc., make their clients forget things, or render\nthem ignorant of things. They do not deceive them in doing this.\nChisholm and Feehan admit that Augustine and Aquinas “do not call\nit ‘deception’” to “hide the truth”\n(Chisholm and Feehan 1977, 187).\n\n\nD5 only counts as deception cases of deception “by\ncommission” (Chisholm and Feehan 1977, 143–144). According\nto Chisholm and Feehan, it is also possible to deceive “by\nomission” (Chisholm and Feehan 1977, 143–144). One may\nallow a person to acquire a false belief, or allow a\nperson to continue with a false belief, or allow a person to\ncease to have a true belief, or allow a person to continue\nwithout a true belief. For example, one may allow a person to read a\nnews story and acquire a belief that one knows is false (e.g., a news\nstory about the CEO of your company resigning for health reasons, when\nyou know he was forced out for mismanagement of funds), and one may\nallow a person to continue to have a false belief by not correcting\nthe person’s false belief (e.g., not correcting a child’s\nbelief in Santa Claus). Or, for example, one may allow a person to\nforget a veridical memory by not stopping them from getting\ndistracted, and one may allow a person to continue without knowing\nabout an earthquake that has occurred in a foreign country. According\nto Chisholm and Feehan, there can positive and negative deception by\ncommission and by omission. A modified definition of interpersonal\ndeception that incorporates this objection is the following:\n\n(D6)\nTo deceive =df to intentionally cause another person to\nacquire a false belief, or to continue to have a false belief, or to\ncease to have a true belief, or to be prevented from acquiring a true\nbelief, or to intentionally allow another person to acquire a false\nbelief, or to continue to have a false belief, or to cease to have a\ntrue belief, or to be prevented from acquiring a true\nbelief.\n\n\n\nFinally, D6 only counts as deception actions and omissions that are\nintentional. According to Chisholm and Feehan, however, deception can\nbe unintentional. A modified definition of interpersonal deception that\nincorporates this objection is the following:\n\n(D7)\nTo deceive =df to cause another person to acquire a\nfalse belief, or to continue to have a false belief, or to cease to\nhave a true belief, or be prevented from acquiring a true belief, or\nto allow another person to acquire a false belief, or to continue to\nhave a false belief, or to cease to have a true belief, or be\nprevented from acquiring a true belief. (Chisholm and Feehan 1977,\n145).\n\nThe objection to D5 that negative deception is not\ndeception also applies to D6 and D7.\n",
    "section_title": "3.1 Objections to the Traditional Definition of Deception",
    "entry_title": "The Definition of Lying and Deception",
    "hierarchy_title": "The Definition of Lying and Deception || Traditional Definition of Deception",
    "tokenized_text": [
        "traditional",
        "definition",
        "deception",
        "objection",
        "traditional",
        "definition",
        "deception",
        "several",
        "objection",
        "made",
        "d",
        "one",
        "objection",
        "necessary",
        "deceiver",
        "cause",
        "another",
        "person",
        "false",
        "belief",
        "truly",
        "believed",
        "false",
        "deceiver",
        "intentionally",
        "cause",
        "believe",
        "p",
        "p",
        "false",
        "neither",
        "believe",
        "p",
        "true",
        "believe",
        "p",
        "false",
        "carson",
        "still",
        "deception",
        "van",
        "frassen",
        "barnes",
        "cf",
        "shiffrin",
        "example",
        "michael",
        "belief",
        "whatsoever",
        "regarding",
        "condition",
        "bridge",
        "convinces",
        "gertrude",
        "bridge",
        "safe",
        "bridge",
        "happens",
        "dangerous",
        "michael",
        "deceives",
        "gertrude",
        "bridge",
        "safe",
        "van",
        "frassen",
        "alyce",
        "place",
        "fake",
        "rabbit",
        "evelyn",
        "garden",
        "life",
        "reclusive",
        "rabbit",
        "order",
        "guarantee",
        "evelyn",
        "belief",
        "seeing",
        "rabbit",
        "garden",
        "one",
        "way",
        "evelyn",
        "see",
        "fake",
        "rabbit",
        "call",
        "alyce",
        "phone",
        "tell",
        "looking",
        "rabbit",
        "garden",
        "alyce",
        "deceived",
        "evelyn",
        "even",
        "though",
        "believe",
        "know",
        "evelyn",
        "seeing",
        "fake",
        "rabbit",
        "rather",
        "real",
        "rabbit",
        "barnes",
        "although",
        "objection",
        "d",
        "necessarily",
        "compelling",
        "mahon",
        "modified",
        "definition",
        "interpersonal",
        "deception",
        "incorporates",
        "objection",
        "follows",
        "d",
        "person",
        "x",
        "deceives",
        "another",
        "person",
        "x",
        "intentionally",
        "cause",
        "believe",
        "p",
        "p",
        "false",
        "x",
        "believe",
        "p",
        "true",
        "carson",
        "common",
        "objection",
        "d",
        "necessary",
        "deceiver",
        "intentionally",
        "cause",
        "another",
        "person",
        "new",
        "false",
        "belief",
        "although",
        "form",
        "deception",
        "according",
        "person",
        "intentionally",
        "brings",
        "change",
        "state",
        "deceived",
        "deceived",
        "chisholm",
        "feehan",
        "normal",
        "form",
        "deception",
        "form",
        "person",
        "may",
        "deceive",
        "another",
        "person",
        "causing",
        "person",
        "continue",
        "false",
        "belief",
        "fuller",
        "chisholm",
        "feehan",
        "mahon",
        "carson",
        "shiffrin",
        "act",
        "deceiver",
        "person",
        "would",
        "lost",
        "given",
        "false",
        "belief",
        "chisholm",
        "feehan",
        "least",
        "greater",
        "chance",
        "losing",
        "false",
        "belief",
        "modified",
        "definition",
        "interpersonal",
        "deception",
        "incorporates",
        "objection",
        "following",
        "d",
        "person",
        "x",
        "deceives",
        "another",
        "person",
        "x",
        "intentionally",
        "cause",
        "believe",
        "p",
        "persist",
        "believing",
        "p",
        "p",
        "false",
        "x",
        "know",
        "belief",
        "p",
        "false",
        "carson",
        "objection",
        "d",
        "d",
        "d",
        "sufficient",
        "deception",
        "person",
        "intentionally",
        "cause",
        "another",
        "person",
        "false",
        "belief",
        "truly",
        "belief",
        "know",
        "false",
        "must",
        "also",
        "false",
        "belief",
        "caused",
        "evidence",
        "evidence",
        "brought",
        "person",
        "order",
        "cause",
        "person",
        "false",
        "belief",
        "linsky",
        "fuller",
        "schmitt",
        "barnes",
        "mahon",
        "andrew",
        "intentionally",
        "cause",
        "ben",
        "believe",
        "falsely",
        "vampire",
        "england",
        "example",
        "operating",
        "ben",
        "brain",
        "giving",
        "ben",
        "electric",
        "shock",
        "drugging",
        "ben",
        "andrew",
        "deceive",
        "ben",
        "vampire",
        "england",
        "also",
        "andrew",
        "cause",
        "ben",
        "believe",
        "falsely",
        "vampire",
        "england",
        "getting",
        "ben",
        "read",
        "book",
        "purport",
        "demonstrate",
        "vampire",
        "england",
        "andrew",
        "deceive",
        "ben",
        "vampire",
        "england",
        "however",
        "andrew",
        "writes",
        "book",
        "purport",
        "demonstrate",
        "vampire",
        "england",
        "ben",
        "read",
        "book",
        "result",
        "ben",
        "come",
        "believe",
        "vampire",
        "england",
        "andrew",
        "deceive",
        "ben",
        "vampire",
        "england",
        "fuller",
        "modified",
        "definition",
        "interpersonal",
        "deception",
        "incorporates",
        "objection",
        "following",
        "d",
        "deceive",
        "df",
        "intentionally",
        "cause",
        "another",
        "person",
        "continue",
        "false",
        "belief",
        "known",
        "truly",
        "believed",
        "false",
        "bringing",
        "evidence",
        "basis",
        "person",
        "continues",
        "false",
        "belief",
        "mahon",
        "definition",
        "far",
        "considered",
        "definition",
        "positive",
        "deception",
        "person",
        "caused",
        "add",
        "stock",
        "false",
        "belief",
        "caused",
        "continue",
        "false",
        "belief",
        "chisholm",
        "feehan",
        "objection",
        "d",
        "d",
        "d",
        "d",
        "necessary",
        "deception",
        "cause",
        "new",
        "belief",
        "cause",
        "continue",
        "false",
        "belief",
        "one",
        "deceive",
        "another",
        "person",
        "causing",
        "person",
        "cease",
        "true",
        "belief",
        "preventing",
        "person",
        "acquiring",
        "true",
        "belief",
        "case",
        "negative",
        "deception",
        "according",
        "person",
        "caused",
        "lose",
        "one",
        "true",
        "belief",
        "prevented",
        "gaining",
        "true",
        "belief",
        "chisholm",
        "feehan",
        "example",
        "intentionally",
        "distract",
        "someone",
        "prone",
        "forgetting",
        "thing",
        "irretrievably",
        "distracted",
        "order",
        "make",
        "person",
        "forget",
        "something",
        "irretrievably",
        "result",
        "person",
        "loses",
        "veridical",
        "memory",
        "irretrievably",
        "caused",
        "cease",
        "true",
        "belief",
        "sciencefiction",
        "result",
        "achieved",
        "using",
        "memoryerasing",
        "device",
        "neuralyzer",
        "used",
        "sciencefiction",
        "film",
        "men",
        "black",
        "also",
        "hide",
        "section",
        "newspaper",
        "someone",
        "order",
        "prevent",
        "learning",
        "news",
        "item",
        "earthquake",
        "foreign",
        "country",
        "harmed",
        "noone",
        "prevented",
        "acquiring",
        "true",
        "belief",
        "distant",
        "earthquake",
        "modified",
        "definition",
        "interpersonal",
        "deception",
        "incorporates",
        "objection",
        "following",
        "d",
        "deceive",
        "df",
        "intentionally",
        "cause",
        "another",
        "person",
        "acquire",
        "false",
        "belief",
        "continue",
        "false",
        "belief",
        "cease",
        "true",
        "belief",
        "prevented",
        "acquiring",
        "true",
        "belief",
        "however",
        "objection",
        "d",
        "d",
        "d",
        "d",
        "necessarily",
        "compelling",
        "may",
        "argued",
        "negative",
        "deception",
        "deception",
        "false",
        "belief",
        "acquired",
        "sustained",
        "may",
        "argued",
        "prevent",
        "someone",
        "acquiring",
        "true",
        "belief",
        "keep",
        "person",
        "ignorance",
        "keep",
        "person",
        "dark",
        "rather",
        "deceive",
        "person",
        "mahon",
        "cf",
        "carson",
        "state",
        "ignorant",
        "state",
        "mistaken",
        "one",
        "may",
        "know",
        "city",
        "capital",
        "city",
        "estonia",
        "tallinn",
        "different",
        "mistakenly",
        "believing",
        "riga",
        "capital",
        "city",
        "estonia",
        "similarly",
        "although",
        "unusual",
        "rendering",
        "person",
        "ignorant",
        "matter",
        "deceiving",
        "person",
        "least",
        "result",
        "false",
        "belief",
        "example",
        "sciencefiction",
        "film",
        "eternal",
        "sunshine",
        "spotless",
        "mind",
        "people",
        "go",
        "lacuna",
        "inc",
        "memory",
        "previous",
        "relationship",
        "well",
        "visit",
        "erased",
        "run",
        "lacuna",
        "inc",
        "make",
        "client",
        "forget",
        "thing",
        "render",
        "ignorant",
        "thing",
        "deceive",
        "chisholm",
        "feehan",
        "admit",
        "augustine",
        "aquinas",
        "call",
        "deception",
        "hide",
        "truth",
        "chisholm",
        "feehan",
        "d",
        "count",
        "deception",
        "case",
        "deception",
        "commission",
        "chisholm",
        "feehan",
        "according",
        "chisholm",
        "feehan",
        "also",
        "possible",
        "deceive",
        "omission",
        "chisholm",
        "feehan",
        "one",
        "may",
        "allow",
        "person",
        "acquire",
        "false",
        "belief",
        "allow",
        "person",
        "continue",
        "false",
        "belief",
        "allow",
        "person",
        "cease",
        "true",
        "belief",
        "allow",
        "person",
        "continue",
        "without",
        "true",
        "belief",
        "example",
        "one",
        "may",
        "allow",
        "person",
        "read",
        "news",
        "story",
        "acquire",
        "belief",
        "one",
        "know",
        "false",
        "eg",
        "news",
        "story",
        "ceo",
        "company",
        "resigning",
        "health",
        "reason",
        "know",
        "forced",
        "mismanagement",
        "fund",
        "one",
        "may",
        "allow",
        "person",
        "continue",
        "false",
        "belief",
        "correcting",
        "person",
        "false",
        "belief",
        "eg",
        "correcting",
        "child",
        "belief",
        "santa",
        "claus",
        "example",
        "one",
        "may",
        "allow",
        "person",
        "forget",
        "veridical",
        "memory",
        "stopping",
        "getting",
        "distracted",
        "one",
        "may",
        "allow",
        "person",
        "continue",
        "without",
        "knowing",
        "earthquake",
        "occurred",
        "foreign",
        "country",
        "according",
        "chisholm",
        "feehan",
        "positive",
        "negative",
        "deception",
        "commission",
        "omission",
        "modified",
        "definition",
        "interpersonal",
        "deception",
        "incorporates",
        "objection",
        "following",
        "d",
        "deceive",
        "df",
        "intentionally",
        "cause",
        "another",
        "person",
        "acquire",
        "false",
        "belief",
        "continue",
        "false",
        "belief",
        "cease",
        "true",
        "belief",
        "prevented",
        "acquiring",
        "true",
        "belief",
        "intentionally",
        "allow",
        "another",
        "person",
        "acquire",
        "false",
        "belief",
        "continue",
        "false",
        "belief",
        "cease",
        "true",
        "belief",
        "prevented",
        "acquiring",
        "true",
        "belief",
        "finally",
        "d",
        "count",
        "deception",
        "action",
        "omission",
        "intentional",
        "according",
        "chisholm",
        "feehan",
        "however",
        "deception",
        "unintentional",
        "modified",
        "definition",
        "interpersonal",
        "deception",
        "incorporates",
        "objection",
        "following",
        "d",
        "deceive",
        "df",
        "cause",
        "another",
        "person",
        "acquire",
        "false",
        "belief",
        "continue",
        "false",
        "belief",
        "cease",
        "true",
        "belief",
        "prevented",
        "acquiring",
        "true",
        "belief",
        "allow",
        "another",
        "person",
        "acquire",
        "false",
        "belief",
        "continue",
        "false",
        "belief",
        "cease",
        "true",
        "belief",
        "prevented",
        "acquiring",
        "true",
        "belief",
        "chisholm",
        "feehan",
        "objection",
        "d",
        "negative",
        "deception",
        "deception",
        "also",
        "applies",
        "d",
        "d"
    ]
}