{
    "main_text": "Major Works || The Differend\n3.3 The Differend\n\nShortly after completing Libidinal Economy, Lyotard began\nnine years of efforts crafting his masterwork, The Differend\n(1983). The book begins with a “Reading Dossier” that sets\nout clearly the question, theses, context, addressee, and so forth of\nthe work in separate paragraphs. The context, he argues, is the\nlinguistic turn in philosophy, and his avowed method is to engage\npolitical disputes on the model of linguistic affairs\n(Differend, xiii). The book itself contains 264 numbered\nparagraphs, building on arguments he had been making in the years\nleading up to the work. The major change is that Lyotard no longer\nuses the term “language games”, which led some readers to\nthink that subjects could be outside these games as players. Lyotard\nis clear that subjects are only such in the way that they move and are\nproduced by moves within different language games. The\n“object”, of The Differend will be\n“phrases”, which are indubitable since “to doubt\nthat one phrases is still to phrase”, he argues, since even\n“one’s silence makes a phrase” (Differend,\n11).\n\nDespite this linguistic model, phrases may be extralinguistic,\nincluding the very gestures, shadings, and libidinal energetics he had\ndiscussed in his earlier writings. Anything, then, can be a phrase in\nLyotard’s understanding. For every phrase, there is a regimen\nwithin which it exists, the possible significations of that phrase,\nthe referent of the phrase, the one from whom the phrase arrives, and\nthe addressee, the one to whom the phrase is addressed. Within each\nphrase regimen, there is a certain play, since there may be\nambiguities along each aspect above. Any reader of Twitter knows the\nproblem: is this meant as irony? In the form of a question? Who is\nbeing addressed and why? Only with continual phrases, linked to the\ninitial phrase, does the initial ambiguity become clearer, but of\ncourse, with these newer phrases, further ambiguities may take place,\nsince they face the same problems as the initial phrase. Nevertheless\nthere are rules followed within phrase regimens such that certain\nphrases are allowable while others are not. Lyotard writes:\n\n\nThere are a number of phrase regimens: knowing, describing,\nrecounting, questioning, showing, ordering. etc. Phrases from\nheterogeneous regimens cannot be translated from one into the other.\nThey can be linked one onto the other in accordance with an end fixed\nby the a genre of discourse …Genres of discourse supply rules\nfor linking together heterogeneous phrases, rules that are proper for\nattaining certain goals: to know, to teach, to be just, to seduce, to\njustify, to evaluate, to rouse emotion, to oversee.\n(Differend, xii).\n\n\nThis notion of linkages is important. Links follow the rules of the\nparticular regimen or genre, while linking different phrases together\nis “the problem of politics” (Differend, xiii).\nLinking phrases, he says, is necessary but contingent in how it is\ndone (Differend, 29). Linkages among phrases occur within\ngenres, and these links are successful when the goals of the discourse\nare met: one seduces another, a question is met with an answer, or an\neconomic exchange is performed. Yet these rules only apply within\nspecific genres and there are no rules for how to make links between\nthe different genres themselves. Lyotard argues that within genres, we\ncannot help but make linkages, and the hope is to escape the problem\nof what Lyotard calls a differend, where one move makes a link from\nwithin one discourse in other to colonize, that is, silence, another.\nThus, though we cannot do anything other than make linkages among\nphrases and create new events, hegemonic discourses or grand\nnarratives often want to pre-program how those links are to be made\nand thus control all future phrases or events (Differend,\n80).\n\nThis is not to say that links within regimens are not without\nconflict: within the regimen of parliamentary democracy, within courts\nof law, within art criticism, there are always forms of\n“litigation” where one takes the rules within that genre\nand apply them to a particular case and arguments ensue. For example,\nto use the court example from which Lyotard borrows his term, in court\none may use rules of evidence, case law, and so forth both in\ndefending and prosecuting a certain defendant, all of which remains\nwithin the regimen of criminal law, and even if there are\n“damages”—one loses—one has at least been\ngiven one’s “rights” within that phrase regimen.\nThis is not the case where there is a differend\n(différend):\n\n\nAs distinguished from a litigation, a differend would be a case of\nconflict, between (at least) two parties, that cannot be resolved for\nlack of a rule of judgement applicable to both of the arguments. One\nside’s legitimacy does not imply the other’s lack of legitimacy.\nHowever, applying a single rule of judgement to both in order to\nsettle their differend as though it were merely a litigation would\nwrong (at least) one of them (and both of them if neither side admits\nthis rule). (Differend, xi)\n\n\nLyotard offers a number of examples of differends: the relation of\ncolonizer and the colonized or between the bourgeoisie and the\nproletariat, but he opens The Differend with the case of the\nFrench Holocaust denier Robert Faurisson, who claimed that the only\ntestimony that he would accept would be that of someone who had\nactually been through the gas chambers. This, of course, sets off a\ndifferend since to have seen the gas chambers in operation would be to\nhave been its victim, and thus silences all other genres, the various\nlinkages of communication within the genre of history, for example,\nthat would testify to the Shoah. One set of phrases is absolutely\nincommunicable with the other. But this does not mean that there is an\n“equivalence” between the discourse of the denier and the\ndiscourses of historians and survivors alike. Lyotard’s response\nto this problem is complicated. He argues, not always persuasively,\nthat the Nazis were in many ways successful in destroying the means by\nwhich historians adduce historical events: they not only killed their\nvictims and destroyed their bodies, but also the paperwork and\nbuildings that would be evidence of their crimes. “The\nresult”, he writes, “is that one cannot adduce numerical\nproof of the massacre and that a historian pleading for the trial’s\nrevision will be able to object at great length that the crime has not\nbeen established in its quantity” (Differend, 56). But\nthe task of justice, he claims, is not to let the Nazis or their\nmodern apologists claim a relativism of different discourses. Lyotard\nargues that Auschwitz offers something that is unpresentable in the\npresentation of history itself: an inverted sublime, a horror so\ninfinite that a “silence” is “imposed on\nknowledge”, though it does “not impose the silence of\nforgetting” (Differend, 56). Indeed, he says, it\nimposes a sentiment, if not an obligation: \n\n\nThe silence that surrounds the phrase, Auschwitz was the extermination\ncamp is not a state of mind, is the sign that something remains to be\nphrased which is not. (Differend, 57) \n\n\nIn other words, the Shoah leaves us silent before its void, since it\ndoes not belong to any previous political phrase regimen or means for\nrepresenting it. To represent it is to misrepresent it, and hence any\nregime is going to leave this powerful silence always on the edge of\nany discourse about it. From his early work on phenomenology through\nDiscourse, Figure, Libidinal Economy, and The\nPostmodern Condition, Lyotard argued that events occur always in\nthe face of what is not presentable to a phenomenology, discourse,\nlanguage game, or phrase regimen. An event, if it occurs, is not\nsimply unforseeable within any of these, but in fact explodes our\nability to represent them within any language game or phrase regimen.\nThe Shoah is one such event.\n\nThe political import of differends is easy to see: Israelis and\nPalestinians are not “litigating” a\n“political” impasse, but have completely different phrase\nregimens within which situations are interpreted and understood, and\nthey are completely irreconcilable. There is no link to be found\nbetween the genre of discourse of the Apartheid South Africa and those\nwho were silenced and violently suffered under white hegemony. There\nis, in these cases, no possibility for litigation, since one side has\nno right to claim justice within the dominant language of the\npolitical regime. This is what Lyotard had in earlier works called\n“terror” and in The Differend calls a wrong:\n\n\nThis is what a wrong would be: a damage accompanied by the lose of the\nmeans to prove the damage. This is the case if the victim is deprived\nof life, or all of his or her liberties, or of the freedom to make his\nor her ideas or opinions public, or simply the right to testify to the\ndamage… In all of these cases, to the privation constituted by\nthe damage there is added the impossibility of bringing it to the\nknowledge of others. (Differend, 5)\n\n\nThis should not be taken to mean that linkages cannot eventually be\nmade, that justice cannot be done in spite of a differend. But new\nphrases regimens will need to be invented, new gestures or ways of\nexisting together will have to be found, to get around this\nincommensurability. In fact, the cause of justice means that one\nphrase regimen (e.g., that of the Apartheid government) will need to\nbe rooted out in order for its hegemony to end. For Lyotard, then, the\npolitics of the differend does not call for valuing different\ndiscourses equally or one recognizing another, since, of course,\nconflict occurs precisely where neither side finds meaning in the\nphrase regimen of the other. Lyotard thus does not model the different\nphrase regimens as a marketplace of ideas, since the existence of one\nphrase regimen may mean the violent silencing of another.\n\nThis is what gives us the ability to name the unjust. The plurality of\nphrase regimens is a fact, and what is unjust or wrong would be\nprecisely using one phrase regimen to silence that of others, to\nintroduce a localized narrative as a metanarrative that would put all\nothers in their place and render them mute and unseen. The postmodern\nobligation, then, as we saw at the end of The Postmodern\nCondition, is, yes, to deny “reality”, but only as\nthat reality tends to be defined by hegemonic discourses, not the\nplenitude of plural ways of being in the world.\n",
    "section_title": "3.3 The Differend",
    "entry_title": "Jean François Lyotard",
    "hierarchy_title": "Jean François Lyotard || Major Works || The Differend",
    "tokenized_text": [
        "major",
        "work",
        "differend",
        "differend",
        "shortly",
        "completing",
        "libidinal",
        "economy",
        "lyotard",
        "began",
        "nine",
        "year",
        "effort",
        "crafting",
        "masterwork",
        "differend",
        "book",
        "begin",
        "reading",
        "dossier",
        "set",
        "clearly",
        "question",
        "thesis",
        "context",
        "addressee",
        "forth",
        "work",
        "separate",
        "paragraph",
        "context",
        "argues",
        "linguistic",
        "turn",
        "philosophy",
        "avowed",
        "method",
        "engage",
        "political",
        "dispute",
        "model",
        "linguistic",
        "affair",
        "differend",
        "xiii",
        "book",
        "contains",
        "numbered",
        "paragraph",
        "building",
        "argument",
        "making",
        "year",
        "leading",
        "work",
        "major",
        "change",
        "lyotard",
        "longer",
        "us",
        "term",
        "language",
        "game",
        "led",
        "reader",
        "think",
        "subject",
        "could",
        "outside",
        "game",
        "player",
        "lyotard",
        "clear",
        "subject",
        "way",
        "move",
        "produced",
        "move",
        "within",
        "different",
        "language",
        "game",
        "object",
        "differend",
        "phrase",
        "indubitable",
        "since",
        "doubt",
        "one",
        "phrase",
        "still",
        "phrase",
        "argues",
        "since",
        "even",
        "one",
        "silence",
        "make",
        "phrase",
        "differend",
        "despite",
        "linguistic",
        "model",
        "phrase",
        "may",
        "extralinguistic",
        "including",
        "gesture",
        "shading",
        "libidinal",
        "energetics",
        "discussed",
        "earlier",
        "writing",
        "anything",
        "phrase",
        "lyotard",
        "understanding",
        "every",
        "phrase",
        "regimen",
        "within",
        "exists",
        "possible",
        "signification",
        "phrase",
        "referent",
        "phrase",
        "one",
        "phrase",
        "arrives",
        "addressee",
        "one",
        "phrase",
        "addressed",
        "within",
        "phrase",
        "regimen",
        "certain",
        "play",
        "since",
        "may",
        "ambiguity",
        "along",
        "aspect",
        "reader",
        "twitter",
        "know",
        "problem",
        "meant",
        "irony",
        "form",
        "question",
        "addressed",
        "continual",
        "phrase",
        "linked",
        "initial",
        "phrase",
        "initial",
        "ambiguity",
        "become",
        "clearer",
        "course",
        "newer",
        "phrase",
        "ambiguity",
        "may",
        "take",
        "place",
        "since",
        "face",
        "problem",
        "initial",
        "phrase",
        "nevertheless",
        "rule",
        "followed",
        "within",
        "phrase",
        "regimen",
        "certain",
        "phrase",
        "allowable",
        "others",
        "lyotard",
        "writes",
        "number",
        "phrase",
        "regimen",
        "knowing",
        "describing",
        "recounting",
        "questioning",
        "showing",
        "ordering",
        "etc",
        "phrase",
        "heterogeneous",
        "regimen",
        "translated",
        "one",
        "linked",
        "one",
        "onto",
        "accordance",
        "end",
        "fixed",
        "genre",
        "discourse",
        "genres",
        "discourse",
        "supply",
        "rule",
        "linking",
        "together",
        "heterogeneous",
        "phrase",
        "rule",
        "proper",
        "attaining",
        "certain",
        "goal",
        "know",
        "teach",
        "seduce",
        "justify",
        "evaluate",
        "rouse",
        "emotion",
        "oversee",
        "differend",
        "xii",
        "notion",
        "linkage",
        "important",
        "link",
        "follow",
        "rule",
        "particular",
        "regimen",
        "genre",
        "linking",
        "different",
        "phrase",
        "together",
        "problem",
        "politics",
        "differend",
        "xiii",
        "linking",
        "phrase",
        "say",
        "necessary",
        "contingent",
        "done",
        "differend",
        "linkage",
        "among",
        "phrase",
        "occur",
        "within",
        "genre",
        "link",
        "successful",
        "goal",
        "discourse",
        "met",
        "one",
        "seduces",
        "another",
        "question",
        "met",
        "answer",
        "economic",
        "exchange",
        "performed",
        "yet",
        "rule",
        "apply",
        "within",
        "specific",
        "genre",
        "rule",
        "make",
        "link",
        "different",
        "genre",
        "lyotard",
        "argues",
        "within",
        "genre",
        "help",
        "make",
        "linkage",
        "hope",
        "escape",
        "problem",
        "lyotard",
        "call",
        "differend",
        "one",
        "move",
        "make",
        "link",
        "within",
        "one",
        "discourse",
        "colonize",
        "silence",
        "another",
        "thus",
        "though",
        "anything",
        "make",
        "linkage",
        "among",
        "phrase",
        "create",
        "new",
        "event",
        "hegemonic",
        "discourse",
        "grand",
        "narrative",
        "often",
        "want",
        "preprogram",
        "link",
        "made",
        "thus",
        "control",
        "future",
        "phrase",
        "event",
        "differend",
        "say",
        "link",
        "within",
        "regimen",
        "without",
        "conflict",
        "within",
        "regimen",
        "parliamentary",
        "democracy",
        "within",
        "court",
        "law",
        "within",
        "art",
        "criticism",
        "always",
        "form",
        "litigation",
        "one",
        "take",
        "rule",
        "within",
        "genre",
        "apply",
        "particular",
        "case",
        "argument",
        "ensue",
        "example",
        "use",
        "court",
        "example",
        "lyotard",
        "borrows",
        "term",
        "court",
        "one",
        "may",
        "use",
        "rule",
        "evidence",
        "case",
        "law",
        "forth",
        "defending",
        "prosecuting",
        "certain",
        "defendant",
        "remains",
        "within",
        "regimen",
        "criminal",
        "law",
        "even",
        "damage",
        "one",
        "losesone",
        "least",
        "given",
        "one",
        "right",
        "within",
        "phrase",
        "regimen",
        "case",
        "differend",
        "différend",
        "distinguished",
        "litigation",
        "differend",
        "would",
        "case",
        "conflict",
        "least",
        "two",
        "party",
        "resolved",
        "lack",
        "rule",
        "judgement",
        "applicable",
        "argument",
        "one",
        "side",
        "legitimacy",
        "imply",
        "lack",
        "legitimacy",
        "however",
        "applying",
        "single",
        "rule",
        "judgement",
        "order",
        "settle",
        "differend",
        "though",
        "merely",
        "litigation",
        "would",
        "wrong",
        "least",
        "one",
        "neither",
        "side",
        "admits",
        "rule",
        "differend",
        "xi",
        "lyotard",
        "offer",
        "number",
        "example",
        "differends",
        "relation",
        "colonizer",
        "colonized",
        "bourgeoisie",
        "proletariat",
        "open",
        "differend",
        "case",
        "french",
        "holocaust",
        "denier",
        "robert",
        "faurisson",
        "claimed",
        "testimony",
        "would",
        "accept",
        "would",
        "someone",
        "actually",
        "gas",
        "chamber",
        "course",
        "set",
        "differend",
        "since",
        "seen",
        "gas",
        "chamber",
        "operation",
        "would",
        "victim",
        "thus",
        "silence",
        "genre",
        "various",
        "linkage",
        "communication",
        "within",
        "genre",
        "history",
        "example",
        "would",
        "testify",
        "shoah",
        "one",
        "set",
        "phrase",
        "absolutely",
        "incommunicable",
        "mean",
        "equivalence",
        "discourse",
        "denier",
        "discourse",
        "historian",
        "survivor",
        "alike",
        "lyotard",
        "response",
        "problem",
        "complicated",
        "argues",
        "always",
        "persuasively",
        "nazi",
        "many",
        "way",
        "successful",
        "destroying",
        "mean",
        "historian",
        "adduce",
        "historical",
        "event",
        "killed",
        "victim",
        "destroyed",
        "body",
        "also",
        "paperwork",
        "building",
        "would",
        "evidence",
        "crime",
        "result",
        "writes",
        "one",
        "adduce",
        "numerical",
        "proof",
        "massacre",
        "historian",
        "pleading",
        "trial",
        "revision",
        "able",
        "object",
        "great",
        "length",
        "crime",
        "established",
        "quantity",
        "differend",
        "task",
        "justice",
        "claim",
        "let",
        "nazi",
        "modern",
        "apologist",
        "claim",
        "relativism",
        "different",
        "discourse",
        "lyotard",
        "argues",
        "auschwitz",
        "offer",
        "something",
        "unpresentable",
        "presentation",
        "history",
        "inverted",
        "sublime",
        "horror",
        "infinite",
        "silence",
        "imposed",
        "knowledge",
        "though",
        "impose",
        "silence",
        "forgetting",
        "differend",
        "indeed",
        "say",
        "imposes",
        "sentiment",
        "obligation",
        "silence",
        "surround",
        "phrase",
        "auschwitz",
        "extermination",
        "camp",
        "state",
        "mind",
        "sign",
        "something",
        "remains",
        "phrased",
        "differend",
        "word",
        "shoah",
        "leaf",
        "u",
        "silent",
        "void",
        "since",
        "belong",
        "previous",
        "political",
        "phrase",
        "regimen",
        "mean",
        "representing",
        "represent",
        "misrepresent",
        "hence",
        "regime",
        "going",
        "leave",
        "powerful",
        "silence",
        "always",
        "edge",
        "discourse",
        "early",
        "work",
        "phenomenology",
        "discourse",
        "figure",
        "libidinal",
        "economy",
        "postmodern",
        "condition",
        "lyotard",
        "argued",
        "event",
        "occur",
        "always",
        "face",
        "presentable",
        "phenomenology",
        "discourse",
        "language",
        "game",
        "phrase",
        "regimen",
        "event",
        "occurs",
        "simply",
        "unforseeable",
        "within",
        "fact",
        "explodes",
        "ability",
        "represent",
        "within",
        "language",
        "game",
        "phrase",
        "regimen",
        "shoah",
        "one",
        "event",
        "political",
        "import",
        "differends",
        "easy",
        "see",
        "israeli",
        "palestinian",
        "litigating",
        "political",
        "impasse",
        "completely",
        "different",
        "phrase",
        "regimen",
        "within",
        "situation",
        "interpreted",
        "understood",
        "completely",
        "irreconcilable",
        "link",
        "found",
        "genre",
        "discourse",
        "apartheid",
        "south",
        "africa",
        "silenced",
        "violently",
        "suffered",
        "white",
        "hegemony",
        "case",
        "possibility",
        "litigation",
        "since",
        "one",
        "side",
        "right",
        "claim",
        "justice",
        "within",
        "dominant",
        "language",
        "political",
        "regime",
        "lyotard",
        "earlier",
        "work",
        "called",
        "terror",
        "differend",
        "call",
        "wrong",
        "wrong",
        "would",
        "damage",
        "accompanied",
        "lose",
        "mean",
        "prove",
        "damage",
        "case",
        "victim",
        "deprived",
        "life",
        "liberty",
        "freedom",
        "make",
        "idea",
        "opinion",
        "public",
        "simply",
        "right",
        "testify",
        "damage",
        "case",
        "privation",
        "constituted",
        "damage",
        "added",
        "impossibility",
        "bringing",
        "knowledge",
        "others",
        "differend",
        "taken",
        "mean",
        "linkage",
        "eventually",
        "made",
        "justice",
        "done",
        "spite",
        "differend",
        "new",
        "phrase",
        "regimen",
        "need",
        "invented",
        "new",
        "gesture",
        "way",
        "existing",
        "together",
        "found",
        "get",
        "around",
        "incommensurability",
        "fact",
        "cause",
        "justice",
        "mean",
        "one",
        "phrase",
        "regimen",
        "eg",
        "apartheid",
        "government",
        "need",
        "rooted",
        "order",
        "hegemony",
        "end",
        "lyotard",
        "politics",
        "differend",
        "call",
        "valuing",
        "different",
        "discourse",
        "equally",
        "one",
        "recognizing",
        "another",
        "since",
        "course",
        "conflict",
        "occurs",
        "precisely",
        "neither",
        "side",
        "find",
        "meaning",
        "phrase",
        "regimen",
        "lyotard",
        "thus",
        "model",
        "different",
        "phrase",
        "regimen",
        "marketplace",
        "idea",
        "since",
        "existence",
        "one",
        "phrase",
        "regimen",
        "may",
        "mean",
        "violent",
        "silencing",
        "another",
        "give",
        "u",
        "ability",
        "name",
        "unjust",
        "plurality",
        "phrase",
        "regimen",
        "fact",
        "unjust",
        "wrong",
        "would",
        "precisely",
        "using",
        "one",
        "phrase",
        "regimen",
        "silence",
        "others",
        "introduce",
        "localized",
        "narrative",
        "metanarrative",
        "would",
        "put",
        "others",
        "place",
        "render",
        "mute",
        "unseen",
        "postmodern",
        "obligation",
        "saw",
        "end",
        "postmodern",
        "condition",
        "yes",
        "deny",
        "reality",
        "reality",
        "tends",
        "defined",
        "hegemonic",
        "discourse",
        "plenitude",
        "plural",
        "way",
        "world"
    ]
}