{
    "main_text": "Candrakīrti\n5. Candrakīrti\n5.1 Life and works\n\nAs is usual for the majority of Indian philosophers, very little is\nknown about the life of Candrakīrti. Modern scholars place him at\nthe beginning of the seventh century. His two best-known works are his\ncommentary to MMK entitled Prasannapadā\nMadhyamakavṛtti (Clear-worded Commentary on Centrism),\nwhich survives in Sanskrit as well as in Tibetan translation, and an\nindependent treatise called Madhyamakāvatāra\n(Introduction to Centrism) available only in Tibetan translation.\nMadhyamakāvatāra is a verse text to which\nCandrakīrti provided a prose commentary. It is clearly an earlier\nwork than his commentary to MMK, since in that commentary he refers\nthe reader repeatedly to Madhyamakāvatāra for the\nfull arguments for the positions he endorses. Both\nPrasannapadā and Madhyamakāvatāra\nhave been studied by modern scholars and a significant number of\npassages have been translated into modern European languages. In\naddition to those works, Candrakīrti wrote a number of\ncommentaries to relatively short texts by Nāgārjuna and\nĀryadeva.\n5.2 Contributions\n\nAt the beginning of his commentary to MMK, Candrakīrti offers an\nextended criticism of Bhāvaviveka and a defense of\nBuddhapālita against the criticisms of Bhāvaviveka. Many\ncenturies after he wrote, Buddhist scholastics in Tibet portrayed\nCandrakīrti as the founder of one of the subschools of the\nMadhyamaka that they perceived. Because Bhāvaviveka had advocated\nfor producing independent (svatantra) arguments for the view\nthat all phenomena are empty of inherent natures, the Tibetan\nscholastics dubbed his subschool the Svātantrika school; because\nCandrakīrti criticized that approach and advocated for being\ncontent to show the unwelcome consequences (prasaṅga)\nof all possible positions on any given philosophical issue, his\nsubschool was named by Tibetans the Prāsaṅgika school of\nMadhyamaka. Although those terms were not used by Indian\nMādhyamikas themselves, it has become standard practice in modern\nscholarship to portray the Madhyamaka school as comprising at least\ntwo subschools with those names and to see Bhāvaviveka and\nCandrakīrti as the founders of those two subschools.\n\nThe earlier of Candrakīrti’s two principal works,\nMadhyamakāvatāra, has ten chapters, one for each of\nthe ten stages of the path of the bodhisattva. At each of these stages\nthe bodhisattva focuses attention on one of the virtues that are to be\nbrought to a stage of perfection (pāramitā). The\nvirtues to be perfected are generosity; good habits of thought, word\nand deed; patience; courage; meditation; wisdom; proselytizing skill;\napplication of vows; strength of character; and transcendental\nknowledge. The chapter dedicated to the sixth stage, at which wisdom\nis cultivated to perfection, is the chapter in which Candrakīrti\nlays out his most detailed exposition of the Madhyamaka school of\nphilosophy. Candrakīrti begins this chapter with the claim that\nwisdom is like a sighted person who is capable of leading a group of\nblind people safely to a destination; similarly, wisdom guides all the\nother virtues to their destination of perfection. As for the content\nof wisdom, it is the realization that no phenomena come into being.\nPhenomena cannot arise from themselves, since that possibility would\nmake arising unnecessary or redundant; if a thing already exists, it\nhas no need to come into being. If, on the other hand, it were allowed\nthat one being might rise out of a being other than itself, then there\nwould be nothing to prevent one from saying that pitch darkness arises\nout of light. Another way of looking at the issue of production from\ncauses is that the effect either already exists in the cause or it\ndoes not exist. If it already exists, it has no need or coming into\nbeing. If it does not exist, then it cannot be an agent that does the\naction of coming into being; but if there is no agent, then there is\nno action.\n\nAfter showing that there cannot be any intelligible account of the\narising of phenomena, Candrakīrti acknowledges that in everyday\nexperience we encounter phenomena coming into being all the time. This\nleads to a discussion of the two truths. The ultimate truth—that\nis, truth concerning the highest goal—is that phenomena do not\ncome into being; the conventional transactional truth, on the other\nhand, is that things do come into being and that their arising is\nconditioned. This conventional truth can therefore be understood as a\nkind of screen, an obstacle that stands in the way of seeing the\nultimate truth. In other words, the putative truths of quotidian life\nare actually delusions that, if believed, prevent one from attaining\nthe wisdom that is capable of leading to the imperturbable peace of\nnirvana. The truth of the highest goal cannot be conveyed in language;\nit can only be manifested in silence. That notwithstanding, the Buddha\ngave many teachings in words, so how is one to understand that? The\nBuddha, said Candrakīrti, spoke according to the linguistic\nconventions of the people to whom he talked. It is conventional to use\npronouns such as “I” and “you” and words like\n“self”; without such pronouns, grammatically correct\nsentences cannot be formed. It does not follow from grammatical\ncorrectness, however, that those words used in sentences have\nreferents. The Buddha’s insight was that there is no self, and\nyet he used the sort of conventional language that is commonly used by\nthose who do believe that there is a self. Similarly, even though the\nBuddha realized that there are no phenomena coming into being and\nperishing, he spoke the same kinds of sentences used by those who\nbelieve that phenomena come into being through conditions and then\nperish when the conditions that sustain them are no longer operative.\nIf one is going to use language at all, then one cannot avoid using\nwords and constructions that apparently commit one to accepting the\npresuppositions upon which language rests. It is the task of the\nMādhyamika philosopher to expose those presuppositions as\nuntenable, to see that language is not grounded in realities but is\npurely conventional in nature. The Buddha, knowing what kinds of\nbeliefs his listeners had, gave doctrines that helped people get past\ntheir false beliefs. For example, to those who believed in an enduring\nand unified and essentially independent self, says Candrakīrti,\nthe Buddha taught that the self is not to be found in any of the\naspects of being human that might be a candidate for being regarded as\na self; he taught that the self is not the body, the personality,\nawareness, thoughts or feelings or anything else that arises through\ncauses and conditions, nor is there anything outside those things that\ncounts as a candidate for what people intuitively take to be their\nselves. To people who were inclined to a materialistic monism, the\nBuddha emphasized the importance of the mind as something that is\nindependent of the body. (About this, more will be said below.)\n\nAs was discussed above\n (section 4.2),\n Bhāvaviveka criticized Buddhapālita for failing to state\nand defend the thesis of the Mādhyamikas. In the first chapter of\nhis commentary to MMK, Candrakīrti comes to\nBuddhapālita’s defense and offers a sustained criticism of\nBhāvaviveka, and of the tradition of Dignāga on whom\nBhāvaviveka had based much of his approach.\nBhāvaviveka’s call for an independent argument in favor of\na conclusion accepted by Mādhyamikas, says Candrakīrti, is\ndiametrically opposed to what Nāgārjuna and Āryadeva\nhad written. Nāgārjuna had written in VV that he has no\nthesis to advance. He had also written that he apprehends no objects\nat all and therefore has no need to affirm or deny anything, and since\nhe neither affirms nor denies any proposition, he need not supply any\nreasons to justify his stance. And Āryadeva had written that a\nperson who makes no claims, either that anything exists or that\nsomething does not exist, cannot be refuted. Candrakīrti cites\nthose passages with the additional comment that Buddhapālita had\nunderstood the spirit of Madhyamaka as set forth by those early\nMādhyamikas. The Mādhyamika, Candrakīrti goes on to\nexplain, does not put forward counter positions in opposition to the\nclaims of other philosophers; rather, he shows the problems involved\nin the positions of others and argues only until the other\nphilosophers realize the inadequacy of their positions and become\nsilent. In the process of bringing others to silence, the\nMādhyamika need not construct formal arguments, nor need he be\nconsistent in what he says. Following Āryadeva’s\nobservation, Candrakīrti says that the Mādhyamika cannot be\nrefuted, precisely because he has no position to defend. If\nBuddhapālita had put forth arguments, then he would have opened\nhimself up to endless disputation; since, however, he knew that the\npurpose of Madhyamaka is to bring all disputation, and indeed all\nkinds of idle chatter, to an end, he wisely avoided putting forth\nformal arguments that a persistent opponent might take as an\ninvitation to debate. If Bhāvaviveka had understood the point of\nMadhyamaka, concludes Candrakīrti, he would not have made the\ncriticisms he made of Buddhapālita.\n\nAfter offering his criticisms of Bhāvaviveka, Candrakīrti\naddresses the school of Buddhist logic and epistemology founded by\nDignāga. The followers of this school did not present themselves\nas Mādhyamikas, so Candrakīrti does not accuse them of\nhaving failed to understand Nāgārjuna properly. He does,\nhowever, confront them with having failed to supply a convincing\nresponse to the radical critique Nāgārjuna had made of the\nvery enterprise of grounding convictions on indisputable foundations.\nHe recapitulates a passage of Nāgārjuna’s VV in which\nit is said that any proposition that is supposed to be warranted must\nrest upon a foundation of either direct experience or one of three\nkinds of reasoning. But the very claim that a proposition is warranted\nby a foundation is itself a proposition, and as such it must either\nrequire a warrant of its own or be deemed self-validating. If it\nrequires a warrant of its own, the result will be an infinite regress\nof propositions needing warrants; if it is declared self-validating,\nthen why not say of all propositions they are self-validating?\nDignāga and his followers went ahead and talked about the\ngrounding of propositions as if Nāgārjuna had never\nquestioned the enterprise. Unless they provide a clear and convincing\nresponse to what Nāgārjuna said, there is no reason for\nanyone to take them seriously.\n\nOne further Buddhist movement that Candrakīrti criticizes is the\nYogācāra school, which he presents as advocating a form of\nsubjective idealism. Their claim that the world of experience is\nconsciousness only and that the contents of consciousness cannot be\nobjects external to consciousness itself is supported by several texts\nwithin the Mahāyāna scriptural tradition. Candrakīrti\nexplains these scriptures as examples of teachings that the Buddha\ngave to counter a particular kind of commonly held wrong view. There\nare, says Candrakīrti, those who mistakenly believe that all\ntheir suffering is due to causes outside themselves; they see\nthemselves as unfortunate victims of a hostile world. The Buddha,\nwishing to make it clear that the predominant factor in\ndissatisfaction is the way one thinks about one’s experiences,\nsaid, in effect “It’s all in the mind.” It would be\na mistake to take that statement literally and to conclude that\nnothing but consciousness exists and that the world of experience that\nfeels as though it is external to consciousness is in fact produced by\nconsciousness or is inseparable from consciousness. The\nYogācāra offers good reasons to show that the contents of\nconsciousness are conditioned and therefore are empty of inherent\nexistence, but they fail to appreciate that exactly the same can be\nsaid of awareness itself. In other words, says Candrakīrti, the\nYogācāra philosophers fail to acknowledge that\neverything, including consciousness itself, is empty.\n\nIn making the kinds of criticisms of other philosophers that\nCandrakīrti makes, he repeatedly advocates for taking ordinary\nexperience seriously and at face value. In everyday experience, we\nfeel that things arise and perish because of causes and conditions,\nand we feel that we are conscious subjects on whom an external world\nis impinging. We communicate with one another in readily\ncomprehensible language. There is no reason to change any of that, no\nreason to replace everyday language with a more precise technical\nlanguage that helps avoid misrepresenting the nature of things. At the\nsame time, it is important to be aware that it cannot be shown that\nthings have fixed natures and that there is no reason to believe about\nany of our beliefs that they are grounded. The task of philosophy for\nCandrakīrti is not to replace unwarranted beliefs with justified\ntrue beliefs, but to break the habit of forming beliefs, declaring\nthem to be true, and then becoming attached to them.\n",
    "section_title": "5. Candrakīrti",
    "entry_title": "Madhyamaka",
    "hierarchy_title": "Madhyamaka || Candrakīrti",
    "tokenized_text": [
        "candrakīrti",
        "candrakīrti",
        "life",
        "work",
        "usual",
        "majority",
        "indian",
        "philosopher",
        "little",
        "known",
        "life",
        "candrakīrti",
        "modern",
        "scholar",
        "place",
        "beginning",
        "seventh",
        "century",
        "two",
        "bestknown",
        "work",
        "commentary",
        "mmk",
        "entitled",
        "prasannapadā",
        "madhyamakavṛtti",
        "clearworded",
        "commentary",
        "centrism",
        "survives",
        "sanskrit",
        "well",
        "tibetan",
        "translation",
        "independent",
        "treatise",
        "called",
        "madhyamakāvatāra",
        "introduction",
        "centrism",
        "available",
        "tibetan",
        "translation",
        "madhyamakāvatāra",
        "verse",
        "text",
        "candrakīrti",
        "provided",
        "prose",
        "commentary",
        "clearly",
        "earlier",
        "work",
        "commentary",
        "mmk",
        "since",
        "commentary",
        "refers",
        "reader",
        "repeatedly",
        "madhyamakāvatāra",
        "full",
        "argument",
        "position",
        "endorses",
        "prasannapadā",
        "madhyamakāvatāra",
        "studied",
        "modern",
        "scholar",
        "significant",
        "number",
        "passage",
        "translated",
        "modern",
        "european",
        "language",
        "addition",
        "work",
        "candrakīrti",
        "wrote",
        "number",
        "commentary",
        "relatively",
        "short",
        "text",
        "nāgārjuna",
        "āryadeva",
        "contribution",
        "beginning",
        "commentary",
        "mmk",
        "candrakīrti",
        "offer",
        "extended",
        "criticism",
        "bhāvaviveka",
        "defense",
        "buddhapālita",
        "criticism",
        "bhāvaviveka",
        "many",
        "century",
        "wrote",
        "buddhist",
        "scholastic",
        "tibet",
        "portrayed",
        "candrakīrti",
        "founder",
        "one",
        "subschools",
        "madhyamaka",
        "perceived",
        "bhāvaviveka",
        "advocated",
        "producing",
        "independent",
        "svatantra",
        "argument",
        "view",
        "phenomenon",
        "empty",
        "inherent",
        "nature",
        "tibetan",
        "scholastic",
        "dubbed",
        "subschool",
        "svātantrika",
        "school",
        "candrakīrti",
        "criticized",
        "approach",
        "advocated",
        "content",
        "show",
        "unwelcome",
        "consequence",
        "prasaṅga",
        "possible",
        "position",
        "given",
        "philosophical",
        "issue",
        "subschool",
        "named",
        "tibetan",
        "prāsaṅgika",
        "school",
        "madhyamaka",
        "although",
        "term",
        "used",
        "indian",
        "mādhyamikas",
        "become",
        "standard",
        "practice",
        "modern",
        "scholarship",
        "portray",
        "madhyamaka",
        "school",
        "comprising",
        "least",
        "two",
        "subschools",
        "name",
        "see",
        "bhāvaviveka",
        "candrakīrti",
        "founder",
        "two",
        "subschools",
        "earlier",
        "candrakīrti",
        "two",
        "principal",
        "work",
        "madhyamakāvatāra",
        "ten",
        "chapter",
        "one",
        "ten",
        "stage",
        "path",
        "bodhisattva",
        "stage",
        "bodhisattva",
        "focus",
        "attention",
        "one",
        "virtue",
        "brought",
        "stage",
        "perfection",
        "pāramitā",
        "virtue",
        "perfected",
        "generosity",
        "good",
        "habit",
        "thought",
        "word",
        "deed",
        "patience",
        "courage",
        "meditation",
        "wisdom",
        "proselytizing",
        "skill",
        "application",
        "vow",
        "strength",
        "character",
        "transcendental",
        "knowledge",
        "chapter",
        "dedicated",
        "sixth",
        "stage",
        "wisdom",
        "cultivated",
        "perfection",
        "chapter",
        "candrakīrti",
        "lay",
        "detailed",
        "exposition",
        "madhyamaka",
        "school",
        "philosophy",
        "candrakīrti",
        "begin",
        "chapter",
        "claim",
        "wisdom",
        "like",
        "sighted",
        "person",
        "capable",
        "leading",
        "group",
        "blind",
        "people",
        "safely",
        "destination",
        "similarly",
        "wisdom",
        "guide",
        "virtue",
        "destination",
        "perfection",
        "content",
        "wisdom",
        "realization",
        "phenomenon",
        "come",
        "phenomenon",
        "arise",
        "since",
        "possibility",
        "would",
        "make",
        "arising",
        "unnecessary",
        "redundant",
        "thing",
        "already",
        "exists",
        "need",
        "come",
        "hand",
        "allowed",
        "one",
        "might",
        "rise",
        "would",
        "nothing",
        "prevent",
        "one",
        "saying",
        "pitch",
        "darkness",
        "arises",
        "light",
        "another",
        "way",
        "looking",
        "issue",
        "production",
        "cause",
        "effect",
        "either",
        "already",
        "exists",
        "cause",
        "exist",
        "already",
        "exists",
        "need",
        "coming",
        "exist",
        "agent",
        "action",
        "coming",
        "agent",
        "action",
        "showing",
        "intelligible",
        "account",
        "arising",
        "phenomenon",
        "candrakīrti",
        "acknowledges",
        "everyday",
        "experience",
        "encounter",
        "phenomenon",
        "coming",
        "time",
        "lead",
        "discussion",
        "two",
        "truth",
        "ultimate",
        "truththat",
        "truth",
        "concerning",
        "highest",
        "goalis",
        "phenomenon",
        "come",
        "conventional",
        "transactional",
        "truth",
        "hand",
        "thing",
        "come",
        "arising",
        "conditioned",
        "conventional",
        "truth",
        "therefore",
        "understood",
        "kind",
        "screen",
        "obstacle",
        "stand",
        "way",
        "seeing",
        "ultimate",
        "truth",
        "word",
        "putative",
        "truth",
        "quotidian",
        "life",
        "actually",
        "delusion",
        "believed",
        "prevent",
        "one",
        "attaining",
        "wisdom",
        "capable",
        "leading",
        "imperturbable",
        "peace",
        "nirvana",
        "truth",
        "highest",
        "goal",
        "conveyed",
        "language",
        "manifested",
        "silence",
        "notwithstanding",
        "buddha",
        "gave",
        "many",
        "teaching",
        "word",
        "one",
        "understand",
        "buddha",
        "said",
        "candrakīrti",
        "spoke",
        "according",
        "linguistic",
        "convention",
        "people",
        "talked",
        "conventional",
        "use",
        "pronoun",
        "word",
        "like",
        "self",
        "without",
        "pronoun",
        "grammatically",
        "correct",
        "sentence",
        "formed",
        "follow",
        "grammatical",
        "correctness",
        "however",
        "word",
        "used",
        "sentence",
        "referent",
        "buddha",
        "insight",
        "self",
        "yet",
        "used",
        "sort",
        "conventional",
        "language",
        "commonly",
        "used",
        "believe",
        "self",
        "similarly",
        "even",
        "though",
        "buddha",
        "realized",
        "phenomenon",
        "coming",
        "perishing",
        "spoke",
        "kind",
        "sentence",
        "used",
        "believe",
        "phenomenon",
        "come",
        "condition",
        "perish",
        "condition",
        "sustain",
        "longer",
        "operative",
        "one",
        "going",
        "use",
        "language",
        "one",
        "avoid",
        "using",
        "word",
        "construction",
        "apparently",
        "commit",
        "one",
        "accepting",
        "presupposition",
        "upon",
        "language",
        "rest",
        "task",
        "mādhyamika",
        "philosopher",
        "expose",
        "presupposition",
        "untenable",
        "see",
        "language",
        "grounded",
        "reality",
        "purely",
        "conventional",
        "nature",
        "buddha",
        "knowing",
        "kind",
        "belief",
        "listener",
        "gave",
        "doctrine",
        "helped",
        "people",
        "get",
        "past",
        "false",
        "belief",
        "example",
        "believed",
        "enduring",
        "unified",
        "essentially",
        "independent",
        "self",
        "say",
        "candrakīrti",
        "buddha",
        "taught",
        "self",
        "found",
        "aspect",
        "human",
        "might",
        "candidate",
        "regarded",
        "self",
        "taught",
        "self",
        "body",
        "personality",
        "awareness",
        "thought",
        "feeling",
        "anything",
        "else",
        "arises",
        "cause",
        "condition",
        "anything",
        "outside",
        "thing",
        "count",
        "candidate",
        "people",
        "intuitively",
        "take",
        "self",
        "people",
        "inclined",
        "materialistic",
        "monism",
        "buddha",
        "emphasized",
        "importance",
        "mind",
        "something",
        "independent",
        "body",
        "said",
        "discussed",
        "section",
        "bhāvaviveka",
        "criticized",
        "buddhapālita",
        "failing",
        "state",
        "defend",
        "thesis",
        "mādhyamikas",
        "first",
        "chapter",
        "commentary",
        "mmk",
        "candrakīrti",
        "come",
        "buddhapālita",
        "defense",
        "offer",
        "sustained",
        "criticism",
        "bhāvaviveka",
        "tradition",
        "dignāga",
        "bhāvaviveka",
        "based",
        "much",
        "approach",
        "bhāvaviveka",
        "call",
        "independent",
        "argument",
        "favor",
        "conclusion",
        "accepted",
        "mādhyamikas",
        "say",
        "candrakīrti",
        "diametrically",
        "opposed",
        "nāgārjuna",
        "āryadeva",
        "written",
        "nāgārjuna",
        "written",
        "vv",
        "thesis",
        "advance",
        "also",
        "written",
        "apprehends",
        "object",
        "therefore",
        "need",
        "affirm",
        "deny",
        "anything",
        "since",
        "neither",
        "affirms",
        "denies",
        "proposition",
        "need",
        "supply",
        "reason",
        "justify",
        "stance",
        "āryadeva",
        "written",
        "person",
        "make",
        "claim",
        "either",
        "anything",
        "exists",
        "something",
        "exist",
        "refuted",
        "candrakīrti",
        "cite",
        "passage",
        "additional",
        "comment",
        "buddhapālita",
        "understood",
        "spirit",
        "madhyamaka",
        "set",
        "forth",
        "early",
        "mādhyamikas",
        "mādhyamika",
        "candrakīrti",
        "go",
        "explain",
        "put",
        "forward",
        "counter",
        "position",
        "opposition",
        "claim",
        "philosopher",
        "rather",
        "show",
        "problem",
        "involved",
        "position",
        "others",
        "argues",
        "philosopher",
        "realize",
        "inadequacy",
        "position",
        "become",
        "silent",
        "process",
        "bringing",
        "others",
        "silence",
        "mādhyamika",
        "need",
        "construct",
        "formal",
        "argument",
        "need",
        "consistent",
        "say",
        "following",
        "āryadeva",
        "observation",
        "candrakīrti",
        "say",
        "mādhyamika",
        "refuted",
        "precisely",
        "position",
        "defend",
        "buddhapālita",
        "put",
        "forth",
        "argument",
        "would",
        "opened",
        "endless",
        "disputation",
        "since",
        "however",
        "knew",
        "purpose",
        "madhyamaka",
        "bring",
        "disputation",
        "indeed",
        "kind",
        "idle",
        "chatter",
        "end",
        "wisely",
        "avoided",
        "putting",
        "forth",
        "formal",
        "argument",
        "persistent",
        "opponent",
        "might",
        "take",
        "invitation",
        "debate",
        "bhāvaviveka",
        "understood",
        "point",
        "madhyamaka",
        "concludes",
        "candrakīrti",
        "would",
        "made",
        "criticism",
        "made",
        "buddhapālita",
        "offering",
        "criticism",
        "bhāvaviveka",
        "candrakīrti",
        "address",
        "school",
        "buddhist",
        "logic",
        "epistemology",
        "founded",
        "dignāga",
        "follower",
        "school",
        "present",
        "mādhyamikas",
        "candrakīrti",
        "accuse",
        "failed",
        "understand",
        "nāgārjuna",
        "properly",
        "however",
        "confront",
        "failed",
        "supply",
        "convincing",
        "response",
        "radical",
        "critique",
        "nāgārjuna",
        "made",
        "enterprise",
        "grounding",
        "conviction",
        "indisputable",
        "foundation",
        "recapitulates",
        "passage",
        "nāgārjuna",
        "vv",
        "said",
        "proposition",
        "supposed",
        "warranted",
        "must",
        "rest",
        "upon",
        "foundation",
        "either",
        "direct",
        "experience",
        "one",
        "three",
        "kind",
        "reasoning",
        "claim",
        "proposition",
        "warranted",
        "foundation",
        "proposition",
        "must",
        "either",
        "require",
        "warrant",
        "deemed",
        "selfvalidating",
        "requires",
        "warrant",
        "result",
        "infinite",
        "regress",
        "proposition",
        "needing",
        "warrant",
        "declared",
        "selfvalidating",
        "say",
        "proposition",
        "selfvalidating",
        "dignāga",
        "follower",
        "went",
        "ahead",
        "talked",
        "grounding",
        "proposition",
        "nāgārjuna",
        "never",
        "questioned",
        "enterprise",
        "unless",
        "provide",
        "clear",
        "convincing",
        "response",
        "nāgārjuna",
        "said",
        "reason",
        "anyone",
        "take",
        "seriously",
        "one",
        "buddhist",
        "movement",
        "candrakīrti",
        "criticizes",
        "yogācāra",
        "school",
        "present",
        "advocating",
        "form",
        "subjective",
        "idealism",
        "claim",
        "world",
        "experience",
        "consciousness",
        "content",
        "consciousness",
        "object",
        "external",
        "consciousness",
        "supported",
        "several",
        "text",
        "within",
        "mahāyāna",
        "scriptural",
        "tradition",
        "candrakīrti",
        "explains",
        "scripture",
        "example",
        "teaching",
        "buddha",
        "gave",
        "counter",
        "particular",
        "kind",
        "commonly",
        "held",
        "wrong",
        "view",
        "say",
        "candrakīrti",
        "mistakenly",
        "believe",
        "suffering",
        "due",
        "cause",
        "outside",
        "see",
        "unfortunate",
        "victim",
        "hostile",
        "world",
        "buddha",
        "wishing",
        "make",
        "clear",
        "predominant",
        "factor",
        "dissatisfaction",
        "way",
        "one",
        "think",
        "one",
        "experience",
        "said",
        "effect",
        "mind",
        "would",
        "mistake",
        "take",
        "statement",
        "literally",
        "conclude",
        "nothing",
        "consciousness",
        "exists",
        "world",
        "experience",
        "feel",
        "though",
        "external",
        "consciousness",
        "fact",
        "produced",
        "consciousness",
        "inseparable",
        "consciousness",
        "yogācāra",
        "offer",
        "good",
        "reason",
        "show",
        "content",
        "consciousness",
        "conditioned",
        "therefore",
        "empty",
        "inherent",
        "existence",
        "fail",
        "appreciate",
        "exactly",
        "said",
        "awareness",
        "word",
        "say",
        "candrakīrti",
        "yogācāra",
        "philosopher",
        "fail",
        "acknowledge",
        "everything",
        "including",
        "consciousness",
        "empty",
        "making",
        "kind",
        "criticism",
        "philosopher",
        "candrakīrti",
        "make",
        "repeatedly",
        "advocate",
        "taking",
        "ordinary",
        "experience",
        "seriously",
        "face",
        "value",
        "everyday",
        "experience",
        "feel",
        "thing",
        "arise",
        "perish",
        "cause",
        "condition",
        "feel",
        "conscious",
        "subject",
        "external",
        "world",
        "impinging",
        "communicate",
        "one",
        "another",
        "readily",
        "comprehensible",
        "language",
        "reason",
        "change",
        "reason",
        "replace",
        "everyday",
        "language",
        "precise",
        "technical",
        "language",
        "help",
        "avoid",
        "misrepresenting",
        "nature",
        "thing",
        "time",
        "important",
        "aware",
        "shown",
        "thing",
        "fixed",
        "nature",
        "reason",
        "believe",
        "belief",
        "grounded",
        "task",
        "philosophy",
        "candrakīrti",
        "replace",
        "unwarranted",
        "belief",
        "justified",
        "true",
        "belief",
        "break",
        "habit",
        "forming",
        "belief",
        "declaring",
        "true",
        "becoming",
        "attached"
    ]
}