{
    "main_text": "Practical Philosophy\n6. Practical Philosophy\n\n\nWe have already seen that for Maimonides the highest perfection is\nintellectual and consists in ascertaining in divine matters everything\nthat can be ascertained. Proper behavior, whether for the individual or\nthe community, is a means to this end (GP 3.27). On a\npolitical level, this means that the state must do more than protect\nlife and property; it must see to it that all its citizens are educated\nin religious matters and that a small number achieve mastery\n(GP 2.40). On a personal level, it means that morality is not\nan end in itself but a way of controlling the passions and creating an\natmosphere in which science and philosophy can flourish (GP\n3.8). While intellectual perfection is oriented to truth and falsity\nand aims at demonstration, moral perfection is oriented to good and bad\nand rests on commonly accepted opinions.\n\n\nAccordingly Adam was blessed with perfect metaphysical knowledge in\nthe Garden of Eden but still did not know that it is wrong not to cover\none’s genitals. Although this knowledge cannot be known with scientific\nprecision, it does not follow that it is arbitrary. On the contrary, it\nis among the most basic customs one can imagine. Maimonides expresses\nthis point (GP 2.40) by saying that revealed law\n“although it is not natural, enters into what is natural.”\nI take this to mean that unlike scientific truth, law presupposes a\nsocial context and a sense of shame. In Maimonides’ opinion, it still\nneeds to be studied in detail. Thus the quote continues: “It is a\npart of the wisdom of the deity with regard to the permanence of this\nspecies.”\n\n\nMaimonides’ practical philosophy begins with Eight\nChapters, an introduction to his commentary on the tractate\nPirkei Avot and part of his Commentary on the\n Mishnah.[5]\n In concert with Plato and Aristotle, he holds that like the body, the\nsoul can be diseased or healthy. Just as those with sick bodies seek a\nphysician, those with sick souls need to seek the wise rulers, who are\nphysicians of the soul. Not surprisingly major portions of his work\nattempt to show that Jewish law is based on a thorough understanding\nof the soul and the conditions needed for its perfection.  Chief among\nthem is the attainment of a mean between extremes. In Eight\nChapters 3, he writes: “The virtues are states of the soul\nand settled dispositions in the mean between two bad states, one of\nwhich is excessive, the other deficient.” Later, in the first\nbook of the Mishneh Torah (1, Character Traits, 1.4), he\nfollows up by saying: “The right way is the mean in every one of\na person’s character traits.”\n\n\nLike Aristotle, Maimonides recognizes there will be variations from\none person to another and that sometimes a person may have to overshoot\nthe mean for therapeutic reasons (Eight Chapters 4 and\nMT 1, Character Traits, 2.2). Also like Aristotle, he stresses\nthat virtue is a habit that can only be developed by practice. A wise\nruler will therefore prescribe actions and moral habits that must be\nrepeated until they are no longer burdensome and become part of a\nperson’s character. If a person develops the wrong habits and goes to\nexcess, the ruler “must follow the same course in treating it as\nin the medical treatment of bodies,” which is to reestablish\nequilibrium (“Eight Chapters” 4).\n\n\nMaimonides claims his theory is sound in its own right and can be\ndistilled from the sayings of the prophets and sages. He offers Psalm\n19:8 (“The law of the Lord is perfect, restoring the soul; the\ntestimony of the Lord is sure, making wise the simple”) as\nevidence that the Bible recognizes the idea of psychic health and\ndisease. He also connects adherence to the mean with the doctrine of\nimitatio Dei (imitation of God), by arguing that (GP\n2.28): “The works of the deity are most perfect, and with regard\nto them there is no possibility of an excess or a deficiency.” As\nGod governs nature, so Maimonides thinks, the wise ruler will attempt\nto govern society.\n\n\nIt is true, as Maimonides says many times, that Jewish law does not\nask people to live as hermits, starve themselves, beat themselves, or\njeopardize their health. Though it allows for a category of extremists\nin the laws dealing with the Nazirite, Maimonides is right to say that\nit treats the Nazirite with suspicion (“Eight Chapters” 4).\nThe qualities that really matter are good judgment, kindness, and\ncompassion — all things Maimonides explains by going back to the\ndoctrine of the mean. People are asked to give to charity, honor their\nparents, refrain from certain sexual relations, not hate or take\nvengeance, and not eat certain foods in order establish a moderate\ndisposition. By the same token, the holidays are arranged so that some\ninvolve rejoicing while others involve moderate forms of self-denial.\nIn no case does the law require anything for the sake of obedience\nalone.\n\n\nMaimonides points out there are cases where the analogy between body\nand soul breaks down, in particular the fact that legal reasoning is\ndifferent from medical reasoning. The physician does not treat the\nconcept humanity but the particular person who comes to her. But this\nis not true of the law, which, in Maimonides’ opinion (GP\n3.34), treats the general case and pays no attention to rarities. That\nis why the law is not dependent on time and place but tries to\nestablish a standard that is absolute and universal. To take a modern\nexample, the law prescribes a limit to the amount of alcohol a person\ncan have in his blood and still be able to drive. Undoubtedly there are\nvariations among individuals that allow one person with a certain\namount of alcohol to be much more alert than another. But it is not the\npurpose of the law to take these differences into account. All it can\ndo is set a norm and enforce it equally.\n\n\nStill anyone familiar with Maimonides will see that acceptance of\nthe mean is hard to reconcile with other aspects of his thought. When\nhe describes God as governor of the universe balancing justice with\nmercy, the doctrine of the mean makes good sense; when he describes God\nas lacking emotion and incomparable to anything in the created order,\nit does not. Similarly, when he describes prophets as law-givers, the\nmean is an appropriate standard; when he describes them as people who\nbegrudge the time they spend with others and prefer to contemplate God\nalone in silent meditation (GP 3.51), it fails.\n\n\nMuch has been written on which of these approaches represents\nMaimonides’ real view (Fox 1990, Davidson 1987, Schwarzschild 1990).\nFortunately we do not have to survey all of this literature because the\nproblem arises in the space of a few paragraphs in MT 1,\nCharacter Traits, 1.4–6. Unlike “Eight Chapters,” where the\nonly justification for overshooting the mean is therapeutic, this\npassage recognizes that there are times when deviation from the mean\nrepresents a higher standard. As Maimonides puts it, a person whose\ncharacter traits are balanced can be called wise (hakham),\nwhile a person who goes beyond the mean when circumstances warrant is\nknown as pious (hasid):\n Whoever moves away from a haughty heart to the opposite\nextreme so that he is exceedingly lowly in spirit is called pious; this\nis the measure of piety. If someone moves only to the mean and is\nhumble, he is called wise; this is the measure of wisdom. The same\napplies to all the rest of the character traits. The pious of old used\nto direct their character traits from the middle way toward one of the\ntwo extremes; some character traits toward the last extreme, and some\ntoward the first extreme. This is the meaning of “inside the line\nof the law” [i.e. going beyond the letter of the law].\n\n\n\nPiety then involves going beyond the mean to a higher standard. In\nthis connection Maimonides cites Numbers 12:3, which does not say that\nMoses was meek but that he was very meek.\n\n\nSimilar remarks apply to Maimonides’ analysis of anger. For\nAristotle [Nicomachean Ethics 1125b31–1126a8] a person should\nbe praised for being angry with the right people in the right way and\nat the right time. A person who allows himself to be abused by insults\nwithout getting angry lacks feeling and behaves in a manner that is\nslavish. Virtue is worthy of honor. Just as it is wrong to ask for too\nmuch, it is equally wrong to ask for too little.\n\n\nWith respect to anger, Maimonides disagrees, claiming (MT\n1, Character Traits, 2.3) it is “an extremely bad character\ntrait” and that “it is proper for someone to move away from\nit to the other extreme and to teach himself not to be angry, even over\nsomething it is proper to be angry about” (Frank 1990). For\nAristotle meekness indicates a loss of self-esteem; for Maimonides it\nis not a virtue but virtue par excellence. By ascribing it to\nMoses, he implies that it represents the highest level a person can\nachieve.\n\n\nA similar sentiment is expressed earlier in the Mishneh\nTorah (1, Basic Principles, 4. 12), when Maimonides discusses the\nneed to study physics and metaphysics. He concludes with praise for\nthose who are lowly of spirit:\nWhen a man reflects on these things, studies all these\ncreated beings, from the angels and spheres down to human beings and so\non, and realizes the divine wisdom manifested in them all, his love for\nGod will increase, his soul will thirst, his very flesh will yearn to\nlove God. He will be filled with fear and trembling, as he becomes\nconscious of his lowly condition, poverty, and insignificance, and\ncompares himself with any of the great and holy bodies; still more when\nhe compares himself with any one of the pure forms that are incorporeal\nand have never had association with any corporeal substance. He will\nthen realize that he is a vessel full of shame, dishonor, and reproach,\nempty and deficient. \n\n\nIt is not that Maimonides has abandoned the idea that nature avoids\nexcess or deficiency but that he seems to be saying the highest level\nof human excellence sometimes requires an extreme. Thus Moses went\nwithout water for forty days and nights when he was alone on the\nmountain and attained such a high level of concentration that in\nMaimonides opinion “all the gross faculties in the body ceased to\nfunction.” Seen in this light, the highest goal is not practical\nwisdom in the Aristotelian sense but humility, awe, and shame in the\npresence of God.\n\n\nIn other places, Maimonides argues that our goal should not be to\nmoderate emotion but to rise above it. We saw that God is not subject\nto emotion. Maimonides takes this to mean that the ideal state is one\nin which a person acts in a completely dispassionate way deciding cases\non their merit without recourse to feeling. While such a person must\nstill make the appropriate judgment, there will be no character trait\nor disposition from which it springs. According to Guide\n1.54:\nIt behooves the governor of a city, if he is a prophet,\nto acquire similarity to these attributes [jealousy, hatred, or anger],\nso that these actions may proceed from him according to a determined\nmeasure and according to the deserts of the people who are affected by\nthem and not merely because of his following a passion. He should not\nlet loose the reins of anger nor let passion gain mastery over him, for\nall passions are evil; but, on the contrary, he should guard against\nthem as far as this lies within the capacity of man. Sometimes, with\nregard to some people, he should be merciful and gracious, not out of\nmere compassion and pity, but in accordance with what is fitting.\n\n\n\nIn the treatise on Character Traits, he admits that there may be\ntimes when it is necessary for a person to show anger, but insists that\ninwardly she should remain completely tranquil.\n\n\nWhat happened to balance and the idea of mental health? The answer\nis that while they are still valuable, they are not ends in themselves.\nThroughout his rabbinic and philosophic works, Maimonides insists\n(MT 1, Character Traits, 3.1) that it is impossible to love\nGod and achieve the highest levels of concentration if one is sick,\nundisciplined, or living in fear of bodily harm. But in the end, moral\nperfection is only a necessary condition for intellectual\nperfection.\n\n\nLike Plato, Maimonides believes in the therapeutic effects of\nphilosophy. In the last chapter of the Guide (3.54), he claims\nthat philosophy teaches that most of the things to which people direct\ntheir lives are “nothing but an effort with a view to something\npurely imaginary, to a thing that has no permanence.” Just as Job\ncame to see that the things he once valued are unimportant, philosophy\nteaches us to give up our obsession with money, garments, and land and\nfocus attention on the eternal.\n\n\nIn the end, the relation between moral and intellectual virtue is\nmore complicated than Maimonides first presents. It is not just that\nthe former is a means to the latter but that after the latter is\nachieved, after one comes to see that earthly goods are fleeting and\nultimately unsatisfying, his behavior will undergo a transformation:\nrather than aim for a moderate amount of earthly goods, he will forgo\nthem and spend as much time as possible in a state of awe and\nreverence, where the distinction between moral and intellectual\nperfection may even break down.\n",
    "section_title": "6. Practical Philosophy",
    "entry_title": "Maimonides",
    "hierarchy_title": "Maimonides || Practical Philosophy",
    "tokenized_text": [
        "practical",
        "philosophy",
        "practical",
        "philosophy",
        "already",
        "seen",
        "maimonides",
        "highest",
        "perfection",
        "intellectual",
        "consists",
        "ascertaining",
        "divine",
        "matter",
        "everything",
        "ascertained",
        "proper",
        "behavior",
        "whether",
        "individual",
        "community",
        "mean",
        "end",
        "gp",
        "political",
        "level",
        "mean",
        "state",
        "must",
        "protect",
        "life",
        "property",
        "must",
        "see",
        "citizen",
        "educated",
        "religious",
        "matter",
        "small",
        "number",
        "achieve",
        "mastery",
        "gp",
        "personal",
        "level",
        "mean",
        "morality",
        "end",
        "way",
        "controlling",
        "passion",
        "creating",
        "atmosphere",
        "science",
        "philosophy",
        "flourish",
        "gp",
        "intellectual",
        "perfection",
        "oriented",
        "truth",
        "falsity",
        "aim",
        "demonstration",
        "moral",
        "perfection",
        "oriented",
        "good",
        "bad",
        "rest",
        "commonly",
        "accepted",
        "opinion",
        "accordingly",
        "adam",
        "blessed",
        "perfect",
        "metaphysical",
        "knowledge",
        "garden",
        "eden",
        "still",
        "know",
        "wrong",
        "cover",
        "one",
        "genitals",
        "although",
        "knowledge",
        "known",
        "scientific",
        "precision",
        "follow",
        "arbitrary",
        "contrary",
        "among",
        "basic",
        "custom",
        "one",
        "imagine",
        "maimonides",
        "express",
        "point",
        "gp",
        "saying",
        "revealed",
        "law",
        "although",
        "natural",
        "enters",
        "natural",
        "take",
        "mean",
        "unlike",
        "scientific",
        "truth",
        "law",
        "presupposes",
        "social",
        "context",
        "sense",
        "shame",
        "maimonides",
        "opinion",
        "still",
        "need",
        "studied",
        "detail",
        "thus",
        "quote",
        "continues",
        "part",
        "wisdom",
        "deity",
        "regard",
        "permanence",
        "species",
        "maimonides",
        "practical",
        "philosophy",
        "begin",
        "eight",
        "chapter",
        "introduction",
        "commentary",
        "tractate",
        "pirkei",
        "avot",
        "part",
        "commentary",
        "mishnah",
        "concert",
        "plato",
        "aristotle",
        "hold",
        "like",
        "body",
        "soul",
        "diseased",
        "healthy",
        "sick",
        "body",
        "seek",
        "physician",
        "sick",
        "soul",
        "need",
        "seek",
        "wise",
        "ruler",
        "physician",
        "soul",
        "surprisingly",
        "major",
        "portion",
        "work",
        "attempt",
        "show",
        "jewish",
        "law",
        "based",
        "thorough",
        "understanding",
        "soul",
        "condition",
        "needed",
        "perfection",
        "chief",
        "among",
        "attainment",
        "mean",
        "extreme",
        "eight",
        "chapter",
        "writes",
        "virtue",
        "state",
        "soul",
        "settled",
        "disposition",
        "mean",
        "two",
        "bad",
        "state",
        "one",
        "excessive",
        "deficient",
        "later",
        "first",
        "book",
        "mishneh",
        "torah",
        "character",
        "trait",
        "follows",
        "saying",
        "right",
        "way",
        "mean",
        "every",
        "one",
        "person",
        "character",
        "traits",
        "like",
        "aristotle",
        "maimonides",
        "recognizes",
        "variation",
        "one",
        "person",
        "another",
        "sometimes",
        "person",
        "may",
        "overshoot",
        "mean",
        "therapeutic",
        "reason",
        "eight",
        "chapter",
        "mt",
        "character",
        "trait",
        "also",
        "like",
        "aristotle",
        "stress",
        "virtue",
        "habit",
        "developed",
        "practice",
        "wise",
        "ruler",
        "therefore",
        "prescribe",
        "action",
        "moral",
        "habit",
        "must",
        "repeated",
        "longer",
        "burdensome",
        "become",
        "part",
        "person",
        "character",
        "person",
        "develops",
        "wrong",
        "habit",
        "go",
        "excess",
        "ruler",
        "must",
        "follow",
        "course",
        "treating",
        "medical",
        "treatment",
        "body",
        "reestablish",
        "equilibrium",
        "eight",
        "chapter",
        "maimonides",
        "claim",
        "theory",
        "sound",
        "right",
        "distilled",
        "saying",
        "prophet",
        "sage",
        "offer",
        "psalm",
        "law",
        "lord",
        "perfect",
        "restoring",
        "soul",
        "testimony",
        "lord",
        "sure",
        "making",
        "wise",
        "simple",
        "evidence",
        "bible",
        "recognizes",
        "idea",
        "psychic",
        "health",
        "disease",
        "also",
        "connects",
        "adherence",
        "mean",
        "doctrine",
        "imitatio",
        "dei",
        "imitation",
        "god",
        "arguing",
        "gp",
        "work",
        "deity",
        "perfect",
        "regard",
        "possibility",
        "excess",
        "deficiency",
        "god",
        "governs",
        "nature",
        "maimonides",
        "think",
        "wise",
        "ruler",
        "attempt",
        "govern",
        "society",
        "true",
        "maimonides",
        "say",
        "many",
        "time",
        "jewish",
        "law",
        "ask",
        "people",
        "live",
        "hermit",
        "starve",
        "beat",
        "jeopardize",
        "health",
        "though",
        "allows",
        "category",
        "extremist",
        "law",
        "dealing",
        "nazirite",
        "maimonides",
        "right",
        "say",
        "treat",
        "nazirite",
        "suspicion",
        "eight",
        "chapter",
        "quality",
        "really",
        "matter",
        "good",
        "judgment",
        "kindness",
        "compassion",
        "thing",
        "maimonides",
        "explains",
        "going",
        "back",
        "doctrine",
        "mean",
        "people",
        "asked",
        "give",
        "charity",
        "honor",
        "parent",
        "refrain",
        "certain",
        "sexual",
        "relation",
        "hate",
        "take",
        "vengeance",
        "eat",
        "certain",
        "food",
        "order",
        "establish",
        "moderate",
        "disposition",
        "token",
        "holiday",
        "arranged",
        "involve",
        "rejoicing",
        "others",
        "involve",
        "moderate",
        "form",
        "selfdenial",
        "case",
        "law",
        "require",
        "anything",
        "sake",
        "obedience",
        "alone",
        "maimonides",
        "point",
        "case",
        "analogy",
        "body",
        "soul",
        "break",
        "particular",
        "fact",
        "legal",
        "reasoning",
        "different",
        "medical",
        "reasoning",
        "physician",
        "treat",
        "concept",
        "humanity",
        "particular",
        "person",
        "come",
        "true",
        "law",
        "maimonides",
        "opinion",
        "gp",
        "treat",
        "general",
        "case",
        "pay",
        "attention",
        "rarity",
        "law",
        "dependent",
        "time",
        "place",
        "try",
        "establish",
        "standard",
        "absolute",
        "universal",
        "take",
        "modern",
        "example",
        "law",
        "prescribes",
        "limit",
        "amount",
        "alcohol",
        "person",
        "blood",
        "still",
        "able",
        "drive",
        "undoubtedly",
        "variation",
        "among",
        "individual",
        "allow",
        "one",
        "person",
        "certain",
        "amount",
        "alcohol",
        "much",
        "alert",
        "another",
        "purpose",
        "law",
        "take",
        "difference",
        "account",
        "set",
        "norm",
        "enforce",
        "equally",
        "still",
        "anyone",
        "familiar",
        "maimonides",
        "see",
        "acceptance",
        "mean",
        "hard",
        "reconcile",
        "aspect",
        "thought",
        "describes",
        "god",
        "governor",
        "universe",
        "balancing",
        "justice",
        "mercy",
        "doctrine",
        "mean",
        "make",
        "good",
        "sense",
        "describes",
        "god",
        "lacking",
        "emotion",
        "incomparable",
        "anything",
        "created",
        "order",
        "similarly",
        "describes",
        "prophet",
        "lawgivers",
        "mean",
        "appropriate",
        "standard",
        "describes",
        "people",
        "begrudge",
        "time",
        "spend",
        "others",
        "prefer",
        "contemplate",
        "god",
        "alone",
        "silent",
        "meditation",
        "gp",
        "fails",
        "much",
        "written",
        "approach",
        "represents",
        "maimonides",
        "real",
        "view",
        "fox",
        "davidson",
        "schwarzschild",
        "fortunately",
        "survey",
        "literature",
        "problem",
        "arises",
        "space",
        "paragraph",
        "mt",
        "character",
        "trait",
        "unlike",
        "eight",
        "chapter",
        "justification",
        "overshooting",
        "mean",
        "therapeutic",
        "passage",
        "recognizes",
        "time",
        "deviation",
        "mean",
        "represents",
        "higher",
        "standard",
        "maimonides",
        "put",
        "person",
        "whose",
        "character",
        "trait",
        "balanced",
        "called",
        "wise",
        "hakham",
        "person",
        "go",
        "beyond",
        "mean",
        "circumstance",
        "warrant",
        "known",
        "pious",
        "hasid",
        "whoever",
        "move",
        "away",
        "haughty",
        "heart",
        "opposite",
        "extreme",
        "exceedingly",
        "lowly",
        "spirit",
        "called",
        "pious",
        "measure",
        "piety",
        "someone",
        "move",
        "mean",
        "humble",
        "called",
        "wise",
        "measure",
        "wisdom",
        "applies",
        "rest",
        "character",
        "trait",
        "pious",
        "old",
        "used",
        "direct",
        "character",
        "trait",
        "middle",
        "way",
        "toward",
        "one",
        "two",
        "extreme",
        "character",
        "trait",
        "toward",
        "last",
        "extreme",
        "toward",
        "first",
        "extreme",
        "meaning",
        "inside",
        "line",
        "law",
        "ie",
        "going",
        "beyond",
        "letter",
        "law",
        "piety",
        "involves",
        "going",
        "beyond",
        "mean",
        "higher",
        "standard",
        "connection",
        "maimonides",
        "cite",
        "number",
        "say",
        "moses",
        "meek",
        "meek",
        "similar",
        "remark",
        "apply",
        "maimonides",
        "analysis",
        "anger",
        "aristotle",
        "nicomachean",
        "ethic",
        "ba",
        "person",
        "praised",
        "angry",
        "right",
        "people",
        "right",
        "way",
        "right",
        "time",
        "person",
        "allows",
        "abused",
        "insult",
        "without",
        "getting",
        "angry",
        "lack",
        "feeling",
        "behaves",
        "manner",
        "slavish",
        "virtue",
        "worthy",
        "honor",
        "wrong",
        "ask",
        "much",
        "equally",
        "wrong",
        "ask",
        "little",
        "respect",
        "anger",
        "maimonides",
        "disagrees",
        "claiming",
        "mt",
        "character",
        "trait",
        "extremely",
        "bad",
        "character",
        "trait",
        "proper",
        "someone",
        "move",
        "away",
        "extreme",
        "teach",
        "angry",
        "even",
        "something",
        "proper",
        "angry",
        "frank",
        "aristotle",
        "meekness",
        "indicates",
        "loss",
        "selfesteem",
        "maimonides",
        "virtue",
        "virtue",
        "par",
        "excellence",
        "ascribing",
        "moses",
        "implies",
        "represents",
        "highest",
        "level",
        "person",
        "achieve",
        "similar",
        "sentiment",
        "expressed",
        "earlier",
        "mishneh",
        "torah",
        "basic",
        "principle",
        "maimonides",
        "discus",
        "need",
        "study",
        "physic",
        "metaphysics",
        "concludes",
        "praise",
        "lowly",
        "spirit",
        "man",
        "reflects",
        "thing",
        "study",
        "created",
        "being",
        "angel",
        "sphere",
        "human",
        "being",
        "realizes",
        "divine",
        "wisdom",
        "manifested",
        "love",
        "god",
        "increase",
        "soul",
        "thirst",
        "flesh",
        "yearn",
        "love",
        "god",
        "filled",
        "fear",
        "trembling",
        "becomes",
        "conscious",
        "lowly",
        "condition",
        "poverty",
        "insignificance",
        "compare",
        "great",
        "holy",
        "body",
        "still",
        "compare",
        "one",
        "pure",
        "form",
        "incorporeal",
        "never",
        "association",
        "corporeal",
        "substance",
        "realize",
        "vessel",
        "full",
        "shame",
        "dishonor",
        "reproach",
        "empty",
        "deficient",
        "maimonides",
        "abandoned",
        "idea",
        "nature",
        "avoids",
        "excess",
        "deficiency",
        "seems",
        "saying",
        "highest",
        "level",
        "human",
        "excellence",
        "sometimes",
        "requires",
        "extreme",
        "thus",
        "moses",
        "went",
        "without",
        "water",
        "forty",
        "day",
        "night",
        "alone",
        "mountain",
        "attained",
        "high",
        "level",
        "concentration",
        "maimonides",
        "opinion",
        "gross",
        "faculty",
        "body",
        "ceased",
        "function",
        "seen",
        "light",
        "highest",
        "goal",
        "practical",
        "wisdom",
        "aristotelian",
        "sense",
        "humility",
        "awe",
        "shame",
        "presence",
        "god",
        "place",
        "maimonides",
        "argues",
        "goal",
        "moderate",
        "emotion",
        "rise",
        "saw",
        "god",
        "subject",
        "emotion",
        "maimonides",
        "take",
        "mean",
        "ideal",
        "state",
        "one",
        "person",
        "act",
        "completely",
        "dispassionate",
        "way",
        "deciding",
        "case",
        "merit",
        "without",
        "recourse",
        "feeling",
        "person",
        "must",
        "still",
        "make",
        "appropriate",
        "judgment",
        "character",
        "trait",
        "disposition",
        "spring",
        "according",
        "guide",
        "behooves",
        "governor",
        "city",
        "prophet",
        "acquire",
        "similarity",
        "attribute",
        "jealousy",
        "hatred",
        "anger",
        "action",
        "may",
        "proceed",
        "according",
        "determined",
        "measure",
        "according",
        "desert",
        "people",
        "affected",
        "merely",
        "following",
        "passion",
        "let",
        "loose",
        "rein",
        "anger",
        "let",
        "passion",
        "gain",
        "mastery",
        "passion",
        "evil",
        "contrary",
        "guard",
        "far",
        "lie",
        "within",
        "capacity",
        "man",
        "sometimes",
        "regard",
        "people",
        "merciful",
        "gracious",
        "mere",
        "compassion",
        "pity",
        "accordance",
        "fitting",
        "treatise",
        "character",
        "trait",
        "admits",
        "may",
        "time",
        "necessary",
        "person",
        "show",
        "anger",
        "insists",
        "inwardly",
        "remain",
        "completely",
        "tranquil",
        "happened",
        "balance",
        "idea",
        "mental",
        "health",
        "answer",
        "still",
        "valuable",
        "end",
        "throughout",
        "rabbinic",
        "philosophic",
        "work",
        "maimonides",
        "insists",
        "mt",
        "character",
        "trait",
        "impossible",
        "love",
        "god",
        "achieve",
        "highest",
        "level",
        "concentration",
        "one",
        "sick",
        "undisciplined",
        "living",
        "fear",
        "bodily",
        "harm",
        "end",
        "moral",
        "perfection",
        "necessary",
        "condition",
        "intellectual",
        "perfection",
        "like",
        "plato",
        "maimonides",
        "belief",
        "therapeutic",
        "effect",
        "philosophy",
        "last",
        "chapter",
        "guide",
        "claim",
        "philosophy",
        "teach",
        "thing",
        "people",
        "direct",
        "life",
        "nothing",
        "effort",
        "view",
        "something",
        "purely",
        "imaginary",
        "thing",
        "permanence",
        "job",
        "came",
        "see",
        "thing",
        "valued",
        "unimportant",
        "philosophy",
        "teach",
        "u",
        "give",
        "obsession",
        "money",
        "garment",
        "land",
        "focus",
        "attention",
        "eternal",
        "end",
        "relation",
        "moral",
        "intellectual",
        "virtue",
        "complicated",
        "maimonides",
        "first",
        "present",
        "former",
        "mean",
        "latter",
        "latter",
        "achieved",
        "one",
        "come",
        "see",
        "earthly",
        "good",
        "fleeting",
        "ultimately",
        "unsatisfying",
        "behavior",
        "undergo",
        "transformation",
        "rather",
        "aim",
        "moderate",
        "amount",
        "earthly",
        "good",
        "forgo",
        "spend",
        "much",
        "time",
        "possible",
        "state",
        "awe",
        "reverence",
        "distinction",
        "moral",
        "intellectual",
        "perfection",
        "may",
        "even",
        "break"
    ]
}