{
    "main_text": "Imagination, Politics, Allegory || Guidance\n7.1 Guidance\n\n\nIn his sensitivity to the importance of politics, Maimonides follows\nin the footsteps of other Islamic philosophers, noting, with Aristotle\nthat man is a political animal by nature (see G 3.27, P\n511). Maimonides understands that since average people cannot conjoin\nwith (and hence cannot receive truths from) active intellect\nthemselves, they need help—in the form of virtuous\nguidance—to help them live in accordance with the truth. And it\nis toward this end that Maimonides understands the importance of the\nprophet. The prophet must not only be able to receive truths from\nactive intellect, but must be able to guide people to living in\naccordance with those truths.\n\n\nIt is in this spirit that, following his Islamic predecessors,\nMaimonides describes the prophet as having both a perfected intellect\n(for knowing) and a perfected imagination (for guiding, teaching, and\nleading). For Maimonides, even the paradigmatic prophet Moses—a\nman whose prophecy is understood by Maimonides as a direct engagement\nbetween mind and active intellect without the intermediation of\nimagination[25]\n—must be understood as having a perfected imagination. Along\nthese lines, Maimonides, draws a distinction between the philosopher\nas having a perfected intellect, and the prophet as having perfected\nintellect plus perfected imagination:\n\n\n…the case in which the intellectual overflow overflows only\ntoward the rational faculty and does not overflow at all toward the\nimaginative faculty…is the characteristic of the class of men\nof science engaged in speculation. If, on the other hand, this\noverflow reaches both faculties—I mean both the rational and the\nimaginative—…and if the imaginative faculty is in a state\nof ultimate perfection owing to its natural disposition, this is\ncharacteristic of the class of prophets… (G 2.37, P 374)\n\n\n\n\nWhat is important about this distinction for Maimonides emerges from\nthe following description of two different kinds of perfect\nindividuals, the second kind being perfect not only in his own right,\nbut being further able to help others perfect themselves:\n\n\nFor sometimes something comes from it [viz. active intellect]\nto a certain individual, the measure of that something being such that\nit renders him perfect, but has no other effect. Sometimes, on the\nother hand, the measure of what comes to the individual overflows from\nrendering him perfect toward rendering others perfect… (G 2.37,\nP 373-4).\n\n\n\n\nFor Maimonides, both the philosopher and the prophet receive the truth\nin their intellects through conjunction with the active intellect,\nbut, only the prophet is able to use those truths to help other people\n(viz. the masses—those who cannot on their own receive\ntruths from active intellect) live in accordance with truth.  This\nfurther ability on the part of the prophet is precisely tied to his\nhaving a strong imaginative faculty. Following upon a decidedly\nPlatonic political sensibility, Maimonides, in line with his Islamic\nphilosophical predecessors and contemporaries, thinks that a leader\ncan't help average people live good lives (i.e. live lives in\naccordance with truth) by merely spewing intellectual truths at them.\nRather, the only way to help average people live good lives is to\ncouch those truths in terms which they can understand and which can,\nfurthermore, actually move them to appropriate action. On this\npicture, rhetoric and persuasion become key.\n\n\nThe importance of speaking in different ways to different people is a\ncornerstone not only of Maimonides but of Islamic political philosophy\nmore broadly. In fact, in these contexts, religion is itself\nunderstood as the rhetorically persuasive means, par excellence, for\ndirecting the average person towards appropriate living. Starting with\nal-Farabi, we find a distinction drawn between the ideas of philosophy\nand those of religion: while the former are ideas known through\nintellect and arrived at via demonstration, the latter are ideas known\nonly through imaginings of likenesses, and arrived at through\npersuasion (AH 77). Drawing on a Platonic distinction between\ntruths-as-they-are (as known to the intellect) on the one hand, and\nthe mere likenesses (or, pale reflections) of those truths on the\nother, al-Farabi explains the relationship between philosophy and\nreligion as follows:\n\n\n…according to the ancients, religion is an imitation of\nphilosophy…In everything of which philosophy gives an account\nbased on intellectual perception or conception, religion gives an\naccount based on imagination. In everything demonstrated by\nphilosophy, religion employs persuasion… (AH 77)\n\n\n\n\nIn his Book of Religion, al-Farabi explains along these same\nlines that most people are not able to grasp truths through an\nexercise of intellect, but rather, “either due to nature or\nbecause they are occupied with other things” these people (the\naverage folks) will “understand generally accepted or persuasive\nthings” (BR, B 98; BR, M § 48). In this context, rhetoric\nbecomes an important tool, helping the virtuous leader in his attempts\nto found a virtuous city by ably engaging average people's\nimaginations (and affecting them in a way that philosophical argument\ncould never affect them), and in this way guiding them along towards\nright action and the happiness that comes from human flourishing. (It\nis a matter for debate whether the average person even has a chance at\na further kind of happiness, viz. the kind of true philosophical\nhappiness that comes from intellectual apprehension.) . In The\nAttainment of Happiness, al-Farabi speaks in this regard of the\nlegislator's representing truths to “the multitude” (the\naverage people whom he also calls “the vulgar” in contrast\nto “the elite”—a distinction employed by Maimonides\nas well), providing guidance to them through images and persuasive\nspeech acts, all of which “take hold of their souls and dominate\nthem so that they are unable to resolve to do anything else” (AH\n79). He describes this same sort of visceral overtaking in his\ncommentary on Plato's Laws where, speaking to the importance\nof a leader's capturing the hearts of the people and leading them\ntowards virtue, al-Farabi takes note of Plato's own philosophical\nfocus on dancing and flute-playing. As al-Farabi sees it, the art of\nsinging is “truly very useful, especially because its working\npenetrates the soul; and since the law concerns itself with the soul,\nhe [i.e.  Plato] spoke at length about this subject” (PL\n94).  \n\n\nThere too, al-Farabi illumines the rhetorical task of the virtuous\nruler with an insightful lesson to be drawn from Plato's analogy of\nthe “gentle physician”:\n\n\nThe Lawgiver ought to address every group of men with what is closer\nto their comprehension and intellects, and to set them aright with\nwhat they are capable of doing. For sometimes it is difficult for men\nto comprehend a thing, or they are incapable of doing it; its\ndifficulty causes them to reject it and prompts them to neglect and\ndiscard it.  [Plato] gave as an example of this the skilled and gentle\nphysician who offers the sick man the drugs that are useful to him in\nhis familiar and appetizing food (PL 92).\n\n\n\n\nIn spite of differences from al-Farabi's political teachings, Averroes\nmirrors his predecessor, stressing the importance of rhetoric and its\nimpact on the imagination of the average person. In his Decisive\nTreatise, commenting on the person who is not “adept in\ndemonstration,” Averroes points out the sense in which “it\nis difficult [for that person] to come to assent to an existing thing\nthat is not linked with something imaginable” (DT, B 20). In his\nCommentary on Plato's Republic (preserved in a Hebrew\ntranslation from the Arabic by Samuel ben Judah in the early\n14th century), Averroes notes too that,\n\n\nNo bringer of a nomos is to be found who does not make use of\ninvented stories, for this is something necessary for the multitude to\nreach their happiness… (CPR 24)\n\n\n\n\nAnd commenting on why Aristotle took an interest in the art of\npoetics—here, in much the same spirit as al-Farabi's above\ncomments on why Plato took an interest in music, and flute\nplaying—Averroes notes that,\n\n\nAristotle came to the opinion that this art [viz., the art of\npoetics] was highly useful, because by means of it the soul of the\nmultitude could be moved to believe in or not believe in a certain\nthing and towards doing or abandoning a certain thing. For that\nreason, he enumerated the matters which enable a man to devise an\nimaginative representation for any particular thing he wishes and to\ndo so in the most complete manner possible for that thing… (CAP\n84)\n\n\n\n\nIn like manner, Averroes describes Aristotle's interest in rhetoric as\nan interest in “the means by which man is able to effect\npersuasion about each and every one of the particular matters and to\ndo so in the most complete and most artful manner possible with regard\nto each thing” (CAR 78). Of course, all of this is of interest\nto Averroes himself in that, like al-Farabi, he is sensitive to the\nfact that different people need to be guided in different ways, and\nthat it is the job of religion in particular to help lead “the\nrhetorical people, who are the overwhelming multitude” (DT, B\n26).\n\n\nLeaving a detailed consideration of differences between al-Farabi and\nAverroes aside, it is clear that Maimonides' own work falls within the\nbroad trajectory of these Islamic political philosophies, and it is in\ntheir spirit that we must work towards understanding his own thoughts\non the relation between philosophy and religion. Maimonides' own ideas\nabout the prophet—as lawgiver—are certainly developed\nagainst the backdrop of Farabian political theory. For Maimonides the\nprophet/lawgiver is not only, as philosopher, possessed of a perfected\nintellect, but he is also a gifted rhetorician, and (as such) teacher,\nleader, and religious guide; he is able to take the philosophical\ntruths he knows so well, and, by imaginatively devising an effective\nsystem of concepts, images, rituals, and stories, actually enable\nthese truths to work in the lives of ordinary people. As we have seen\nin al-Farabi's account of religion above, these persuasive words are\nimpressed upon the imagination of listeners, as they are themselves\ncrafted in the imagination of the lawgiver. In this context, the\nimaginatively devised system of concepts, images, rituals, and stories\nis religion, and the prophet, as Lawgiver, is the giver of religion:\nhe (the one with direct access to the truths found in active\nintellect) gives people a context in which they can actually live in\naccordance with truth, even while they themselves do not have access\nto truth directly (epistemologically failing, as they do, to conjoin\ntheir intellects to the active intellect; see discussion of active\nintellect in section 6).\n\n\nIn like manner, we might point to Maimonides’ own appreciation for the\npower of music—a point mentioned in connection with al-Farabi\nabove, and found too in the writings of\nal-Ghazali.[26]\nContrary to some who describe Maimonides as being opposed to music\n(see e.g. Idelsohn 1929, 126; Stroumsa, 52, n. 1), others emphasize\nMaimonides’ appreciating the importance of music for the soul,\nsomething that Bland calls the “utilitarian hedonism” of\nmusic according to which it can bring a soul to a better-ordered\nstate—either a contemplation-ready state that can lead to\nphilosophy, or simply an emotionally rested state that can lead to\nincreased human wellness. (See Bland 1993, 2000; see too Farmer\n1933)\n\n\nIn considering Maimonides on politics and prophecy, one might also\nconsider Leo Strauss’ emphasis on the significance of the divide\nbetween revelation and reason in Maimonides, and his connection of\nMaimonides along these lines to an ancient tradition that he sees as\nexemplified in Plato’s Laws and as continued in Islamic philosophical\ntradition in such thinkers as al-Farabi, Avicenna, and Averroes. There\nis scholarly debate about how to read Strauss, how to understand\nStrauss’ final sense of revelation’s status vis-à-vis reason, and, as\nsuch, how to understand Strauss’ final understanding of Maimonides’\nown brand of rationalism (all of which is made more difficult by\ndebates over whether—and if so, where and to what extent and to\nwhat end—Strauss himself utilizes the esoteric writing\nstrategies that he attributes to Maimonides and to his Islamic\npredecessors). The details and debates aside, we might simply note\nthat Strauss strongly places Maimonides into a Platonist-into-Islamic\ntradition of political philosophy with implications for the way\nMaimonides understands prophecy, religion, law, and the relationship\nbetween revelation and \nreason.[27] \n",
    "section_title": "7.1 Guidance",
    "entry_title": "The Influence of Islamic Thought on Maimonides",
    "hierarchy_title": "The Influence of Islamic Thought on Maimonides || Imagination, Politics, Allegory || Guidance",
    "tokenized_text": [
        "imagination",
        "politics",
        "allegory",
        "guidance",
        "guidance",
        "sensitivity",
        "importance",
        "politics",
        "maimonides",
        "follows",
        "footstep",
        "islamic",
        "philosopher",
        "noting",
        "aristotle",
        "man",
        "political",
        "animal",
        "nature",
        "see",
        "g",
        "p",
        "maimonides",
        "understands",
        "since",
        "average",
        "people",
        "conjoin",
        "hence",
        "receive",
        "truth",
        "active",
        "intellect",
        "need",
        "helpin",
        "form",
        "virtuous",
        "guidanceto",
        "help",
        "live",
        "accordance",
        "truth",
        "toward",
        "end",
        "maimonides",
        "understands",
        "importance",
        "prophet",
        "prophet",
        "must",
        "able",
        "receive",
        "truth",
        "active",
        "intellect",
        "must",
        "able",
        "guide",
        "people",
        "living",
        "accordance",
        "truth",
        "spirit",
        "following",
        "islamic",
        "predecessor",
        "maimonides",
        "describes",
        "prophet",
        "perfected",
        "intellect",
        "knowing",
        "perfected",
        "imagination",
        "guiding",
        "teaching",
        "leading",
        "maimonides",
        "even",
        "paradigmatic",
        "prophet",
        "mosesa",
        "man",
        "whose",
        "prophecy",
        "understood",
        "maimonides",
        "direct",
        "engagement",
        "mind",
        "active",
        "intellect",
        "without",
        "intermediation",
        "imagination",
        "must",
        "understood",
        "perfected",
        "imagination",
        "along",
        "line",
        "maimonides",
        "draw",
        "distinction",
        "philosopher",
        "perfected",
        "intellect",
        "prophet",
        "perfected",
        "intellect",
        "plus",
        "perfected",
        "imagination",
        "the",
        "case",
        "intellectual",
        "overflow",
        "overflow",
        "toward",
        "rational",
        "faculty",
        "overflow",
        "toward",
        "imaginative",
        "facultyis",
        "characteristic",
        "class",
        "men",
        "science",
        "engaged",
        "speculation",
        "hand",
        "overflow",
        "reach",
        "facultiesi",
        "mean",
        "rational",
        "imaginativeand",
        "imaginative",
        "faculty",
        "state",
        "ultimate",
        "perfection",
        "owing",
        "natural",
        "disposition",
        "characteristic",
        "class",
        "prophets",
        "g",
        "p",
        "important",
        "distinction",
        "maimonides",
        "emerges",
        "following",
        "description",
        "two",
        "different",
        "kind",
        "perfect",
        "individual",
        "second",
        "kind",
        "perfect",
        "right",
        "able",
        "help",
        "others",
        "perfect",
        "sometimes",
        "something",
        "come",
        "viz",
        "active",
        "intellect",
        "certain",
        "individual",
        "measure",
        "something",
        "render",
        "perfect",
        "effect",
        "sometimes",
        "hand",
        "measure",
        "come",
        "individual",
        "overflow",
        "rendering",
        "perfect",
        "toward",
        "rendering",
        "others",
        "perfect",
        "g",
        "p",
        "maimonides",
        "philosopher",
        "prophet",
        "receive",
        "truth",
        "intellect",
        "conjunction",
        "active",
        "intellect",
        "prophet",
        "able",
        "use",
        "truth",
        "help",
        "people",
        "viz",
        "massesthose",
        "receive",
        "truth",
        "active",
        "intellect",
        "live",
        "accordance",
        "truth",
        "ability",
        "part",
        "prophet",
        "precisely",
        "tied",
        "strong",
        "imaginative",
        "faculty",
        "following",
        "upon",
        "decidedly",
        "platonic",
        "political",
        "sensibility",
        "maimonides",
        "line",
        "islamic",
        "philosophical",
        "predecessor",
        "contemporary",
        "think",
        "leader",
        "ca",
        "nt",
        "help",
        "average",
        "people",
        "live",
        "good",
        "life",
        "ie",
        "live",
        "life",
        "accordance",
        "truth",
        "merely",
        "spewing",
        "intellectual",
        "truth",
        "rather",
        "way",
        "help",
        "average",
        "people",
        "live",
        "good",
        "life",
        "couch",
        "truth",
        "term",
        "understand",
        "furthermore",
        "actually",
        "move",
        "appropriate",
        "action",
        "picture",
        "rhetoric",
        "persuasion",
        "become",
        "key",
        "importance",
        "speaking",
        "different",
        "way",
        "different",
        "people",
        "cornerstone",
        "maimonides",
        "islamic",
        "political",
        "philosophy",
        "broadly",
        "fact",
        "context",
        "religion",
        "understood",
        "rhetorically",
        "persuasive",
        "mean",
        "par",
        "excellence",
        "directing",
        "average",
        "person",
        "towards",
        "appropriate",
        "living",
        "starting",
        "alfarabi",
        "find",
        "distinction",
        "drawn",
        "idea",
        "philosophy",
        "religion",
        "former",
        "idea",
        "known",
        "intellect",
        "arrived",
        "via",
        "demonstration",
        "latter",
        "idea",
        "known",
        "imaginings",
        "likeness",
        "arrived",
        "persuasion",
        "ah",
        "drawing",
        "platonic",
        "distinction",
        "truthsastheyare",
        "known",
        "intellect",
        "one",
        "hand",
        "mere",
        "likeness",
        "pale",
        "reflection",
        "truth",
        "alfarabi",
        "explains",
        "relationship",
        "philosophy",
        "religion",
        "follows",
        "according",
        "ancient",
        "religion",
        "imitation",
        "philosophyin",
        "everything",
        "philosophy",
        "give",
        "account",
        "based",
        "intellectual",
        "perception",
        "conception",
        "religion",
        "give",
        "account",
        "based",
        "imagination",
        "everything",
        "demonstrated",
        "philosophy",
        "religion",
        "employ",
        "persuasion",
        "ah",
        "book",
        "religion",
        "alfarabi",
        "explains",
        "along",
        "line",
        "people",
        "able",
        "grasp",
        "truth",
        "exercise",
        "intellect",
        "rather",
        "either",
        "due",
        "nature",
        "occupied",
        "thing",
        "people",
        "average",
        "folk",
        "understand",
        "generally",
        "accepted",
        "persuasive",
        "thing",
        "br",
        "b",
        "br",
        "context",
        "rhetoric",
        "becomes",
        "important",
        "tool",
        "helping",
        "virtuous",
        "leader",
        "attempt",
        "found",
        "virtuous",
        "city",
        "ably",
        "engaging",
        "average",
        "people",
        "s",
        "imagination",
        "affecting",
        "way",
        "philosophical",
        "argument",
        "could",
        "never",
        "affect",
        "way",
        "guiding",
        "along",
        "towards",
        "right",
        "action",
        "happiness",
        "come",
        "human",
        "flourishing",
        "matter",
        "debate",
        "whether",
        "average",
        "person",
        "even",
        "chance",
        "kind",
        "happiness",
        "viz",
        "kind",
        "true",
        "philosophical",
        "happiness",
        "come",
        "intellectual",
        "apprehension",
        "attainment",
        "happiness",
        "alfarabi",
        "speaks",
        "regard",
        "legislator",
        "s",
        "representing",
        "truth",
        "multitude",
        "average",
        "people",
        "also",
        "call",
        "vulgar",
        "contrast",
        "elite",
        "a",
        "distinction",
        "employed",
        "maimonides",
        "well",
        "providing",
        "guidance",
        "image",
        "persuasive",
        "speech",
        "act",
        "take",
        "hold",
        "soul",
        "dominate",
        "unable",
        "resolve",
        "anything",
        "else",
        "ah",
        "describes",
        "sort",
        "visceral",
        "overtaking",
        "commentary",
        "plato",
        "s",
        "law",
        "speaking",
        "importance",
        "leader",
        "s",
        "capturing",
        "heart",
        "people",
        "leading",
        "towards",
        "virtue",
        "alfarabi",
        "take",
        "note",
        "plato",
        "s",
        "philosophical",
        "focus",
        "dancing",
        "fluteplaying",
        "alfarabi",
        "see",
        "art",
        "singing",
        "truly",
        "useful",
        "especially",
        "working",
        "penetrates",
        "soul",
        "since",
        "law",
        "concern",
        "soul",
        "ie",
        "plato",
        "spoke",
        "length",
        "subject",
        "pl",
        "alfarabi",
        "illumines",
        "rhetorical",
        "task",
        "virtuous",
        "ruler",
        "insightful",
        "lesson",
        "drawn",
        "plato",
        "s",
        "analogy",
        "gentle",
        "physician",
        "lawgiver",
        "ought",
        "address",
        "every",
        "group",
        "men",
        "closer",
        "comprehension",
        "intellect",
        "set",
        "aright",
        "capable",
        "sometimes",
        "difficult",
        "men",
        "comprehend",
        "thing",
        "incapable",
        "difficulty",
        "cause",
        "reject",
        "prompt",
        "neglect",
        "discard",
        "plato",
        "gave",
        "example",
        "skilled",
        "gentle",
        "physician",
        "offer",
        "sick",
        "man",
        "drug",
        "useful",
        "familiar",
        "appetizing",
        "food",
        "pl",
        "spite",
        "difference",
        "alfarabi",
        "s",
        "political",
        "teaching",
        "averroes",
        "mirror",
        "predecessor",
        "stressing",
        "importance",
        "rhetoric",
        "impact",
        "imagination",
        "average",
        "person",
        "decisive",
        "treatise",
        "commenting",
        "person",
        "adept",
        "demonstration",
        "averroes",
        "point",
        "sense",
        "difficult",
        "person",
        "come",
        "assent",
        "existing",
        "thing",
        "linked",
        "something",
        "imaginable",
        "dt",
        "b",
        "commentary",
        "plato",
        "s",
        "republic",
        "preserved",
        "hebrew",
        "translation",
        "arabic",
        "samuel",
        "ben",
        "judah",
        "early",
        "th",
        "century",
        "averroes",
        "note",
        "bringer",
        "nomos",
        "found",
        "make",
        "use",
        "invented",
        "story",
        "something",
        "necessary",
        "multitude",
        "reach",
        "happiness",
        "cpr",
        "commenting",
        "aristotle",
        "took",
        "interest",
        "art",
        "poeticshere",
        "much",
        "spirit",
        "alfarabi",
        "s",
        "comment",
        "plato",
        "took",
        "interest",
        "music",
        "flute",
        "playingaverroes",
        "note",
        "aristotle",
        "came",
        "opinion",
        "art",
        "viz",
        "art",
        "poetics",
        "highly",
        "useful",
        "mean",
        "soul",
        "multitude",
        "could",
        "moved",
        "believe",
        "believe",
        "certain",
        "thing",
        "towards",
        "abandoning",
        "certain",
        "thing",
        "reason",
        "enumerated",
        "matter",
        "enable",
        "man",
        "devise",
        "imaginative",
        "representation",
        "particular",
        "thing",
        "wish",
        "complete",
        "manner",
        "possible",
        "thing",
        "cap",
        "like",
        "manner",
        "averroes",
        "describes",
        "aristotle",
        "s",
        "interest",
        "rhetoric",
        "interest",
        "mean",
        "man",
        "able",
        "effect",
        "persuasion",
        "every",
        "one",
        "particular",
        "matter",
        "complete",
        "artful",
        "manner",
        "possible",
        "regard",
        "thing",
        "car",
        "course",
        "interest",
        "averroes",
        "like",
        "alfarabi",
        "sensitive",
        "fact",
        "different",
        "people",
        "need",
        "guided",
        "different",
        "way",
        "job",
        "religion",
        "particular",
        "help",
        "lead",
        "rhetorical",
        "people",
        "overwhelming",
        "multitude",
        "dt",
        "b",
        "leaving",
        "detailed",
        "consideration",
        "difference",
        "alfarabi",
        "averroes",
        "aside",
        "clear",
        "maimonides",
        "work",
        "fall",
        "within",
        "broad",
        "trajectory",
        "islamic",
        "political",
        "philosophy",
        "spirit",
        "must",
        "work",
        "towards",
        "understanding",
        "thought",
        "relation",
        "philosophy",
        "religion",
        "maimonides",
        "idea",
        "prophetas",
        "lawgiverare",
        "certainly",
        "developed",
        "backdrop",
        "farabian",
        "political",
        "theory",
        "maimonides",
        "prophetlawgiver",
        "philosopher",
        "possessed",
        "perfected",
        "intellect",
        "also",
        "gifted",
        "rhetorician",
        "teacher",
        "leader",
        "religious",
        "guide",
        "able",
        "take",
        "philosophical",
        "truth",
        "know",
        "well",
        "imaginatively",
        "devising",
        "effective",
        "system",
        "concept",
        "image",
        "ritual",
        "story",
        "actually",
        "enable",
        "truth",
        "work",
        "life",
        "ordinary",
        "people",
        "seen",
        "alfarabi",
        "s",
        "account",
        "religion",
        "persuasive",
        "word",
        "impressed",
        "upon",
        "imagination",
        "listener",
        "crafted",
        "imagination",
        "lawgiver",
        "context",
        "imaginatively",
        "devised",
        "system",
        "concept",
        "image",
        "ritual",
        "story",
        "religion",
        "prophet",
        "lawgiver",
        "giver",
        "religion",
        "one",
        "direct",
        "access",
        "truth",
        "found",
        "active",
        "intellect",
        "give",
        "people",
        "context",
        "actually",
        "live",
        "accordance",
        "truth",
        "even",
        "access",
        "truth",
        "directly",
        "epistemologically",
        "failing",
        "conjoin",
        "intellect",
        "active",
        "intellect",
        "see",
        "discussion",
        "active",
        "intellect",
        "section",
        "like",
        "manner",
        "might",
        "point",
        "maimonides",
        "appreciation",
        "power",
        "musica",
        "point",
        "mentioned",
        "connection",
        "alfarabi",
        "found",
        "writing",
        "alghazali",
        "contrary",
        "describe",
        "maimonides",
        "opposed",
        "music",
        "see",
        "eg",
        "idelsohn",
        "stroumsa",
        "n",
        "others",
        "emphasize",
        "maimonides",
        "appreciating",
        "importance",
        "music",
        "soul",
        "something",
        "bland",
        "call",
        "utilitarian",
        "hedonism",
        "music",
        "according",
        "bring",
        "soul",
        "betterordered",
        "stateeither",
        "contemplationready",
        "state",
        "lead",
        "philosophy",
        "simply",
        "emotionally",
        "rested",
        "state",
        "lead",
        "increased",
        "human",
        "wellness",
        "see",
        "bland",
        "see",
        "farmer",
        "considering",
        "maimonides",
        "politics",
        "prophecy",
        "one",
        "might",
        "also",
        "consider",
        "leo",
        "strauss",
        "emphasis",
        "significance",
        "divide",
        "revelation",
        "reason",
        "maimonides",
        "connection",
        "maimonides",
        "along",
        "line",
        "ancient",
        "tradition",
        "see",
        "exemplified",
        "plato",
        "law",
        "continued",
        "islamic",
        "philosophical",
        "tradition",
        "thinker",
        "alfarabi",
        "avicenna",
        "averroes",
        "scholarly",
        "debate",
        "read",
        "strauss",
        "understand",
        "strauss",
        "final",
        "sense",
        "revelation",
        "status",
        "visàvis",
        "reason",
        "understand",
        "strauss",
        "final",
        "understanding",
        "maimonides",
        "brand",
        "rationalism",
        "made",
        "difficult",
        "debate",
        "whetherand",
        "extent",
        "endstrauss",
        "utilizes",
        "esoteric",
        "writing",
        "strategy",
        "attribute",
        "maimonides",
        "islamic",
        "predecessor",
        "detail",
        "debate",
        "aside",
        "might",
        "simply",
        "note",
        "strauss",
        "strongly",
        "place",
        "maimonides",
        "platonistintoislamic",
        "tradition",
        "political",
        "philosophy",
        "implication",
        "way",
        "maimonides",
        "understands",
        "prophecy",
        "religion",
        "law",
        "relationship",
        "revelation",
        "reason"
    ]
}