{
    "main_text": "Maimon’s Critique of Kant\n2. Maimon’s Critique of Kant\n\nIn the highly polarized German philosophical community in the 1790s,\nMaimon’s intellectual allegiances remained rather ambiguous. In\na letter of 1791, Maimon wrote to Kant that while he found the\nskeptical part of the Critique of Pure Reason wholly\nconvincing, he harbored doubts about the more dogmatic aspects of\nKant’s system. Kant, of course, viewed Maimon not as an ally,\nbut as the best of his critics — it remains an open question\nwhether Maimon saw himself as fundamentally a friend or foe of the\ncritical philosophy. At the very least, however, Maimon’s\ncriticisms of the Critique aim at the core of Kant’s\ntranscendental idealism, in particular because they engage with what\nMaimon sees as an internal problem for Kant’s\nsystem.\n\nPerhaps the most obvious problem — and certainly one of the\nearliest — that Kant faces concerns the issue of the thing in\nitself. In order to account for the content of cognition, Kant\nnotoriously posits a thing in itself that stands outside of the realm\nof possible experience yet nevertheless serves as the causal source of\ncognitive content. This mysterious entity was attacked most famously\nby Jacobi, with his accusation that one could not enter into\nKant’s system without the assumption of the thing in itself, but\nthat with such an assumption one could not remain within it. Maimon\ntoo was quick to point out that the thing in itself could not be\nunderstood realistically. Rather, Maimon argues, the thing in itself\nmust be understood not as a noumenal entity but rather as the complete\nconceptual determination of an object, which can be approached only\nasymptotically. Against Kant’s claims about a noumenal realm of\nthings as they are in themselves, Maimon holds that the thing in\nitself stands only as an object of inquiry, rather than an\nindependent, noumenal entity: in a letter he notes that the thing in\nitself is “nothing other than the complete cognition of\nappearances. Metaphysics is thus not the study of something apart from\nexperience, but rather merely of the limits (Ideas) of experience\nitself.” (in Ehrensperger (2004), 250–1) As such, while\nMaimon agrees with Kant that since we are finite beings the thing in\nitself is in fact beyond the realm of possible experience, this does\nnot imply that the thing in itself cannot in principle be an\nobject of cognition.\n\nMaimon’s criticisms of Kant’s account of the thing in\nitself, however, are connected to a deeper concern about the notions\nof experience and cognition that stand at the heart of Kant’s\ncritical idealism. Kant posits the thing in itself in large part\nbecause of his commitment to a type of cognitive dualism, in which\nhuman experience is taken to involve both a faculty of thought (the\nunderstanding), as well as a faculty of receptivity (sensibility). In\norder to have any content, experience requires data, which must be\ngiven to the subject through the senses. Moreover, the data of\nexperience cannot be produced by the faculty of thought itself. The\ngiven content of sensibility plays an ineliminable role in cognition,\nand its source must ultimately be traced to the subject’s being\naffected by something distinct from itself, a role played by the thing\nin itself. But while the content of thought is provided by the\naffection of an object on the faculty of sensibility, the way in which\nthis content is cognized remains the purview of the faculty of the\nunderstanding. Mere affection, in other words, is not equivalent to\ncognition. In Kant’s terms, the “understanding is not\ncapable of intuiting anything, and the senses are not capable of\nthinking anything.” (A52/B56)\n\nFor Maimon, Kant’s cognitive dualism — which begins with\ndistinct faculties of cognition — fails to explain how the\nvarious elements can come together in a way that makes experience\npossible. On this objection, Kant cannot justify his assumption that\nconcepts and intuitions necessarily unite in cognition. In more\nKantian terms, Maimon calls into question Kant’s answers to both\nthe quid facti and the quid juris that begin the\nTranscendental Deduction in the first Critique. According to\nMaimon, while the quid facti — the question of the fact\nof our use of a priori concepts in experience — is taken by Kant\nto be an unproblematic statement about the nature of human experience,\nthe very assumption that we in fact do possess the type of experience\nKant ascribes to us can be called into doubt. Kant’s central\nargument in the Transcendental Deduction begins by assuming that\nexperience exhibits a ‘dualistic’ structure, but according\nto Maimon, this position is not warranted, since the presumed\nconstituent elements of experience (bare intuitions or concepts) are\nnever themselves objects of experience. For Maimon, Kant’s\ntranscendental arguments remain mere ‘castles in the air’:\nwhile they might be valid, they fail to provide the ‘fact of\nexperience’ that would make them sound. From the beginning,\nthen, Maimon views Kant’s transcendental project with\nsuspicion.\n\nThe precise force of Maimon’s objections to Kant’s claims\nin the Transcendental Deduction remains, however, a bit unclear.\nCertainly the criticisms are forceful against regressive\ninterpretations of Kant’s argument, in which the Deduction\nbegins with strong premises about the nature and objectivity of our\nexperience, but other, less contentious premises perhaps fare better\nagainst Maimon’s attack. And, as some commentators have noted,\nMaimon’s own characterization of Kant’s ‘cognitive\ndualism’ itself might be viewed with suspicion, since Maimon\nattributes to Kant the view that the faculties of sensibility and\nunderstanding are really distinct, when in fact Kant’s\nconsidered position might be better understood as claiming only that\nthere is a modal distinction between the faculties (This is a point\nmade by Franks (2005), though Look (2017) challenges the claim that\nKant’s distinction can be understood in solely modal terms;\nNisenbaum (2016) also offers a good discussion of this issue). But, at\nthe very least, Maimon’s concerns demand that the Kantian\nattempt to clarify what remains a very obscure part of the Critical\nPhilosophy, and Maimon remains suspicious that any suitable answer is\npossible.\n\nThis suspicion becomes an explicit problem, Maimon claims, when the\nspecific structure of Kant’s system is examined. Here, Maimon\nargues, the quid juris of the deduction — the question\nabout the legitimate use of the categories — can likewise be\ncast into doubt. While Kant claims in the Deduction that the a\npriori concepts of the understanding — the categories\n— are necessary conditions on the unity of the manifold of\nsensible data given in intuition, Maimon argues that such a position\nleads to serious problems for the later claims Kant makes in the\n‘Schematism’ and ‘Principles’ sections of the\nCritique. According to Maimon, Kant cannot explain how\ndifferent categories are able to discriminate between different\nintuitive content. Using the example of causality, Maimon argues that\nKant has no way of explaining why some orders of perceptions represent\ncausal connections, and why other orders of perceptions are merely\nassociative. The reason for this claim is found in the fact that while\nKant grounds the category of causality in a necessary order of\nperceptions, his justification for this claim appeals not to the\ncontent of the perceptions, but only to their formal\n‘rule-governed’ connection — but, as Maimon argues,\nany order of perceptions can meet this formal requirement.\nYet since the content of intuitions by itself does not contain any\ntemporal ordering, Kant explicitly bars an appeal to such content in\napplying the category of causality. As such, Kant’s account of\ncognition faces a dilemma: either it must appeal to the content of\nexperience and so violate Kant’s own strictures, or the\napplication of categories is merely arbitrary. Kant’s central\nepistemological commitment — his ‘cognitive dualism’\n— then leads, Maimon claims, to insuperable problems.\n\nWhile Maimon’s objections to Kant focus on specific issues that\narise in the Critique, they all rest on Maimon’s\ncommitment to a type of ‘skeptical rationalism.’ Maimon\nnotes that in the Versuch über die\nTranscendentalphilosophie the important problem of the quid\njuris was “presented in a much wider sense than that in\nwhich Kant takes it, and thereby [such a position] allowed a place for\nHume’s skepticism in its complete power. On the other hand, the\ncomplete solution to this problem necessarily leads to Spinozistic or\nLeibnizian dogmatism.” (GW I, 558 | LB 254) Maimon’s\nposition is then dogmatically rationalist insofar as it endorses the\nstandards of reason found in Leibniz and Spinoza, but it remains\nempirically skeptical insofar as he agrees with Hume that such\nstandards of reason are never met in our experience of the\nworld–he is, in pithy phrase, a ‘rational dogmatist and an\nempirical skeptic.’\n\nMoreover, in the face of the question of how the understanding can\nsubsume or comprehend a given object, Maimon notes that “for the\nKantian system, [which claims] that our sensibility and understanding\nare two entirely different sources of our cognition, this question is\n… unanswerable; on the other hand, for the Leibnizian-Wolffian\nsystem, in which both [sensibility and understanding] flow from the\nsame cognitive source (their difference consisting only in the grades\nof completeness of this cognition), the question can easily be\nanswered.” (GW II, 63–4 | VT 63–4) But while Maimon\nsees in the dogmatism of Spinoza, Leibniz and Wolff a means of\navoiding the problems that attend Kant’s ‘cognitive\ndualism,’ he remains a skeptic about whether this solution can\never be carried out.\n",
    "section_title": "2. Maimon’s Critique of Kant",
    "entry_title": "Salomon Maimon",
    "hierarchy_title": "Salomon Maimon || Maimon’s Critique of Kant",
    "tokenized_text": [
        "maimon",
        "critique",
        "kant",
        "maimon",
        "critique",
        "kant",
        "highly",
        "polarized",
        "german",
        "philosophical",
        "community",
        "s",
        "maimon",
        "intellectual",
        "allegiance",
        "remained",
        "rather",
        "ambiguous",
        "letter",
        "maimon",
        "wrote",
        "kant",
        "found",
        "skeptical",
        "part",
        "critique",
        "pure",
        "reason",
        "wholly",
        "convincing",
        "harbored",
        "doubt",
        "dogmatic",
        "aspect",
        "kant",
        "system",
        "kant",
        "course",
        "viewed",
        "maimon",
        "ally",
        "best",
        "critic",
        "remains",
        "open",
        "question",
        "whether",
        "maimon",
        "saw",
        "fundamentally",
        "friend",
        "foe",
        "critical",
        "philosophy",
        "least",
        "however",
        "maimon",
        "criticism",
        "critique",
        "aim",
        "core",
        "kant",
        "transcendental",
        "idealism",
        "particular",
        "engage",
        "maimon",
        "see",
        "internal",
        "problem",
        "kant",
        "system",
        "perhaps",
        "obvious",
        "problem",
        "certainly",
        "one",
        "earliest",
        "kant",
        "face",
        "concern",
        "issue",
        "thing",
        "order",
        "account",
        "content",
        "cognition",
        "kant",
        "notoriously",
        "posit",
        "thing",
        "stand",
        "outside",
        "realm",
        "possible",
        "experience",
        "yet",
        "nevertheless",
        "serf",
        "causal",
        "source",
        "cognitive",
        "content",
        "mysterious",
        "entity",
        "attacked",
        "famously",
        "jacobi",
        "accusation",
        "one",
        "could",
        "enter",
        "kant",
        "system",
        "without",
        "assumption",
        "thing",
        "assumption",
        "one",
        "could",
        "remain",
        "within",
        "maimon",
        "quick",
        "point",
        "thing",
        "could",
        "understood",
        "realistically",
        "rather",
        "maimon",
        "argues",
        "thing",
        "must",
        "understood",
        "noumenal",
        "entity",
        "rather",
        "complete",
        "conceptual",
        "determination",
        "object",
        "approached",
        "asymptotically",
        "kant",
        "claim",
        "noumenal",
        "realm",
        "thing",
        "maimon",
        "hold",
        "thing",
        "stand",
        "object",
        "inquiry",
        "rather",
        "independent",
        "noumenal",
        "entity",
        "letter",
        "note",
        "thing",
        "nothing",
        "complete",
        "cognition",
        "appearance",
        "metaphysics",
        "thus",
        "study",
        "something",
        "apart",
        "experience",
        "rather",
        "merely",
        "limit",
        "idea",
        "experience",
        "itself",
        "ehrensperger",
        "maimon",
        "agrees",
        "kant",
        "since",
        "finite",
        "being",
        "thing",
        "fact",
        "beyond",
        "realm",
        "possible",
        "experience",
        "imply",
        "thing",
        "principle",
        "object",
        "cognition",
        "maimon",
        "criticism",
        "kant",
        "account",
        "thing",
        "however",
        "connected",
        "deeper",
        "concern",
        "notion",
        "experience",
        "cognition",
        "stand",
        "heart",
        "kant",
        "critical",
        "idealism",
        "kant",
        "posit",
        "thing",
        "large",
        "part",
        "commitment",
        "type",
        "cognitive",
        "dualism",
        "human",
        "experience",
        "taken",
        "involve",
        "faculty",
        "thought",
        "understanding",
        "well",
        "faculty",
        "receptivity",
        "sensibility",
        "order",
        "content",
        "experience",
        "requires",
        "data",
        "must",
        "given",
        "subject",
        "sens",
        "moreover",
        "data",
        "experience",
        "produced",
        "faculty",
        "thought",
        "given",
        "content",
        "sensibility",
        "play",
        "ineliminable",
        "role",
        "cognition",
        "source",
        "must",
        "ultimately",
        "traced",
        "subject",
        "affected",
        "something",
        "distinct",
        "role",
        "played",
        "thing",
        "content",
        "thought",
        "provided",
        "affection",
        "object",
        "faculty",
        "sensibility",
        "way",
        "content",
        "cognized",
        "remains",
        "purview",
        "faculty",
        "understanding",
        "mere",
        "affection",
        "word",
        "equivalent",
        "cognition",
        "kant",
        "term",
        "understanding",
        "capable",
        "intuiting",
        "anything",
        "sens",
        "capable",
        "thinking",
        "anything",
        "ab",
        "maimon",
        "kant",
        "cognitive",
        "dualism",
        "begin",
        "distinct",
        "faculty",
        "cognition",
        "fails",
        "explain",
        "various",
        "element",
        "come",
        "together",
        "way",
        "make",
        "experience",
        "possible",
        "objection",
        "kant",
        "justify",
        "assumption",
        "concept",
        "intuition",
        "necessarily",
        "unite",
        "cognition",
        "kantian",
        "term",
        "maimon",
        "call",
        "question",
        "kant",
        "answer",
        "quid",
        "facti",
        "quid",
        "juris",
        "begin",
        "transcendental",
        "deduction",
        "first",
        "critique",
        "according",
        "maimon",
        "quid",
        "facti",
        "question",
        "fact",
        "use",
        "priori",
        "concept",
        "experience",
        "taken",
        "kant",
        "unproblematic",
        "statement",
        "nature",
        "human",
        "experience",
        "assumption",
        "fact",
        "posse",
        "type",
        "experience",
        "kant",
        "ascribes",
        "u",
        "called",
        "doubt",
        "kant",
        "central",
        "argument",
        "transcendental",
        "deduction",
        "begin",
        "assuming",
        "experience",
        "exhibit",
        "dualistic",
        "structure",
        "according",
        "maimon",
        "position",
        "warranted",
        "since",
        "presumed",
        "constituent",
        "element",
        "experience",
        "bare",
        "intuition",
        "concept",
        "never",
        "object",
        "experience",
        "maimon",
        "kant",
        "transcendental",
        "argument",
        "remain",
        "mere",
        "castle",
        "air",
        "might",
        "valid",
        "fail",
        "provide",
        "fact",
        "experience",
        "would",
        "make",
        "sound",
        "beginning",
        "maimon",
        "view",
        "kant",
        "transcendental",
        "project",
        "suspicion",
        "precise",
        "force",
        "maimon",
        "objection",
        "kant",
        "claim",
        "transcendental",
        "deduction",
        "remains",
        "however",
        "bit",
        "unclear",
        "certainly",
        "criticism",
        "forceful",
        "regressive",
        "interpretation",
        "kant",
        "argument",
        "deduction",
        "begin",
        "strong",
        "premise",
        "nature",
        "objectivity",
        "experience",
        "le",
        "contentious",
        "premise",
        "perhaps",
        "fare",
        "better",
        "maimon",
        "attack",
        "commentator",
        "noted",
        "maimon",
        "characterization",
        "kant",
        "cognitive",
        "dualism",
        "might",
        "viewed",
        "suspicion",
        "since",
        "maimon",
        "attribute",
        "kant",
        "view",
        "faculty",
        "sensibility",
        "understanding",
        "really",
        "distinct",
        "fact",
        "kant",
        "considered",
        "position",
        "might",
        "better",
        "understood",
        "claiming",
        "modal",
        "distinction",
        "faculty",
        "point",
        "made",
        "frank",
        "though",
        "look",
        "challenge",
        "claim",
        "kant",
        "distinction",
        "understood",
        "solely",
        "modal",
        "term",
        "nisenbaum",
        "also",
        "offer",
        "good",
        "discussion",
        "issue",
        "least",
        "maimon",
        "concern",
        "demand",
        "kantian",
        "attempt",
        "clarify",
        "remains",
        "obscure",
        "part",
        "critical",
        "philosophy",
        "maimon",
        "remains",
        "suspicious",
        "suitable",
        "answer",
        "possible",
        "suspicion",
        "becomes",
        "explicit",
        "problem",
        "maimon",
        "claim",
        "specific",
        "structure",
        "kant",
        "system",
        "examined",
        "maimon",
        "argues",
        "quid",
        "juris",
        "deduction",
        "question",
        "legitimate",
        "use",
        "category",
        "likewise",
        "cast",
        "doubt",
        "kant",
        "claim",
        "deduction",
        "priori",
        "concept",
        "understanding",
        "category",
        "necessary",
        "condition",
        "unity",
        "manifold",
        "sensible",
        "data",
        "given",
        "intuition",
        "maimon",
        "argues",
        "position",
        "lead",
        "serious",
        "problem",
        "later",
        "claim",
        "kant",
        "make",
        "schematism",
        "principle",
        "section",
        "critique",
        "according",
        "maimon",
        "kant",
        "explain",
        "different",
        "category",
        "able",
        "discriminate",
        "different",
        "intuitive",
        "content",
        "using",
        "example",
        "causality",
        "maimon",
        "argues",
        "kant",
        "way",
        "explaining",
        "order",
        "perception",
        "represent",
        "causal",
        "connection",
        "order",
        "perception",
        "merely",
        "associative",
        "reason",
        "claim",
        "found",
        "fact",
        "kant",
        "ground",
        "category",
        "causality",
        "necessary",
        "order",
        "perception",
        "justification",
        "claim",
        "appeal",
        "content",
        "perception",
        "formal",
        "rulegoverned",
        "connection",
        "maimon",
        "argues",
        "order",
        "perception",
        "meet",
        "formal",
        "requirement",
        "yet",
        "since",
        "content",
        "intuition",
        "contain",
        "temporal",
        "ordering",
        "kant",
        "explicitly",
        "bar",
        "appeal",
        "content",
        "applying",
        "category",
        "causality",
        "kant",
        "account",
        "cognition",
        "face",
        "dilemma",
        "either",
        "must",
        "appeal",
        "content",
        "experience",
        "violate",
        "kant",
        "stricture",
        "application",
        "category",
        "merely",
        "arbitrary",
        "kant",
        "central",
        "epistemological",
        "commitment",
        "cognitive",
        "dualism",
        "lead",
        "maimon",
        "claim",
        "insuperable",
        "problem",
        "maimon",
        "objection",
        "kant",
        "focus",
        "specific",
        "issue",
        "arise",
        "critique",
        "rest",
        "maimon",
        "commitment",
        "type",
        "skeptical",
        "rationalism",
        "maimon",
        "note",
        "versuch",
        "über",
        "die",
        "transcendentalphilosophie",
        "important",
        "problem",
        "quid",
        "juris",
        "presented",
        "much",
        "wider",
        "sense",
        "kant",
        "take",
        "thereby",
        "position",
        "allowed",
        "place",
        "hume",
        "skepticism",
        "complete",
        "power",
        "hand",
        "complete",
        "solution",
        "problem",
        "necessarily",
        "lead",
        "spinozistic",
        "leibnizian",
        "dogmatism",
        "gw",
        "lb",
        "maimon",
        "position",
        "dogmatically",
        "rationalist",
        "insofar",
        "endorses",
        "standard",
        "reason",
        "found",
        "leibniz",
        "spinoza",
        "remains",
        "empirically",
        "skeptical",
        "insofar",
        "agrees",
        "hume",
        "standard",
        "reason",
        "never",
        "met",
        "experience",
        "worldhe",
        "pithy",
        "phrase",
        "rational",
        "dogmatist",
        "empirical",
        "skeptic",
        "moreover",
        "face",
        "question",
        "understanding",
        "subsume",
        "comprehend",
        "given",
        "object",
        "maimon",
        "note",
        "kantian",
        "system",
        "claim",
        "sensibility",
        "understanding",
        "two",
        "entirely",
        "different",
        "source",
        "cognition",
        "question",
        "unanswerable",
        "hand",
        "leibnizianwolffian",
        "system",
        "sensibility",
        "understanding",
        "flow",
        "cognitive",
        "source",
        "difference",
        "consisting",
        "grade",
        "completeness",
        "cognition",
        "question",
        "easily",
        "answered",
        "gw",
        "ii",
        "vt",
        "maimon",
        "see",
        "dogmatism",
        "spinoza",
        "leibniz",
        "wolff",
        "mean",
        "avoiding",
        "problem",
        "attend",
        "kant",
        "cognitive",
        "dualism",
        "remains",
        "skeptic",
        "whether",
        "solution",
        "ever",
        "carried"
    ]
}