{
    "main_text": "Overflow\n5. Overflow\n\n\nReturning to our earlier citation, we find in Maimonides' description\nof God's creative act the idea of a cosmic overflow:\n\n\nFor the universe exists in virtue of the existence of the Creator, and\nthe latter continually endows it with permanence in virtue of the\nthing that is spoken of as overflow—as we shall make clear in\none of the chapters of this Treatise… (G 1.69, P 168)\n\n\n\n\nRelated to the question of God's ontologically grounding relationship\nto the cosmos, there emerges not only in Maimonides but in his Islamic\nphilosophical context, an emanationist notion of divine\n“overflow” which incorporates—and, as it were, tries\nto reconcile—certain Aristotelian ideas about cosmic separate\nintellects (see De Anima 3.5, as well as Metaphysics\nΛ)[17]\ntogether with overtly Neoplatonic ideas found in the Theology of\nAristotle. For al-Farabi, as for Avicenna, the cosmic overflow\nis, in particular, a series of 10 emanating separate intellects, each\nlinked to its own celestial sphere (and in turn to the various planets\nwhich respectively occupy those spheres), with the lowest of these\nseparate intellects being al-‘aql\nal-fa‘‘āl, the “active intellect”\n(or: “agent intellect”). For al-Farabi and Avicenna, the\nactive intellect is seen as the emanating source and support of the\nentire sublunar realm, and also as the source for all human knowledge,\nincluding prophecy. In the Arabic philosophical tradition, this active\nintellect is further identified with the “separate\nintellect” spoken of by Aristotle at De Anima 3.5\n(though, other Islamic philosophers—such as Averroes, as well as\nancient Greek commentators of Aristotle and contemporary Aristotle\nscholars would, in their various interpretations, deny the idea of an\nemanating intellect responsible for the existence of the world\nin De Anima 3.5).\n\n\n\nThat Maimonides is influenced by at least some of these ideas about\noverflow and active intellect is certain. Offering an elaboration of\nthe idea of overflow at Guide 2.11 (G 2.11, P 275), Maimonides\ndescribes the cosmogonical activity through which the cosmos—as\nseen first in a series of intellects—is generated. Preparing in\n2.11 to address the world's having been created in time, Maimonides\ntalks of the divine overflow, promising us that “these views do\nnot contradict anything said by our prophets and the sustainer of our\nLaw” (G 2.11, P 276). On the views in question, there is a\ndivine overflow that brings about a series of cosmic intellects, these\nintellects themselves being related through a process of overflow to\none another and to the realities which follow from them\nrespectively. He begins:\n\n\nthe overflow (al-fayḍ) coming from Him, may He be\nexalted, for the bringing into being of separate intellects overflows\nlikewise from these intellects, so that one of them brings another one\ninto being and this continue up to the active intellect. With the\nlatter, the bringing into being of separate intellects comes to an end\n(G 2.11, P 275; Arabic at Munk 1931, 192).\n\n\n\n\nHere, Maimonides rehearses the idea, seen clearly in his Islamic\npredecessors, that there are a series of intellects which generate one\nanother (i.e. the highest generating the next highest, and so on until\nthe lowest intellect, viz. active intellect). Maimonides then\ngoes on to mirror the idea, also found in al-Farabi and Avicenna, that\neach intellect additionally generates the body of its sphere, and that\nthere is, furthermore, a set of influences which these spheres wield\nover the generation and corruption of terrestrial, corporeal beings on\nearth:\n\n\nMoreover a certain other act of bringing into being overflows from\nevery separate intellect until the spheres come to an end with the\nsphere of the moon. After it there is the body subject to generation\nand corruption, I mean the first matter [al-mādda\nal-ūlā (Munk 1931, 192), referring to Aristotelian\nprime matter] and what is composed of it. Furthermore, forces from\nevery sphere enter the elements until their overflow is completed with\nthe completion of generation and corruption (G 2.11, P 275).\n\n\n\n\nAll in all, Maimonides at Guide 2.11 wishes to\n\n\nshow that governance overflows from the deity, may He be exalted, to\nthe intellects according to their rank; that from the benefits\nreceived by the intellects, good things and lights overflow to the\nbodies of the spheres; and that from the spheres—because of the\ngreatness of the benefits they have received from their\nprinciples—forces and good things overflow to this body subject\nto generation and corruption (G 2.11, P 275).\n\n\n\n\nTo be sure, Maimonides here mirrors ideas found in earlier Islamic\nauthors. In this regard, consider al-Farabi's own explanation of the\ncosmic overflow:\n\n\nThe First [i.e. God] is that from which everything which exists comes\ninto existence…The genesis of that which comes into existence\nfrom it takes place by way of an emanation (fayḍ) (PS\n88), the existence of which is due to the existence of something else,\nso that the existence of something different from the First emanates\nfrom the First's existence… (PS 89-91)\n\n\n\n\nGoing on to elaborate the unfolding of the universe from God, the\nfirst intellect, al-Farabi describes the emanation of 10 discrete\nintellects from the First, explaining how the dual intellection of\neach of these intellects (intellection of its own essence on the one\nhand, and intellection of God on the other) in turn results in the\ncoming into being of (a) a heaven or celestial sphere, and (b) the\nintellect below it:\n\n\nFrom the First emanates the existence of the Second. This Second is,\nagain, an utterly incorporeal substance, and is not in matter. It\nthinks of its own essence and thinks the First. What it thinks of its\nown essence is no more than its essence. As a result of its thinking\nof the First, a third existent follows necessarily from it; and as a\nresult of its substantification in its specific essence, the existence\nof the First Heaven follows necessarily. The existence of the Third,\nagain, is not in matter, its substance is intellect, and it thinks its\nown essence and thinks the First. As a result of its substantification\nin its specific essence, the existence of the sphere of the fixed\nstars follows necessarily, and as a result of its thinking of the\nFirst, a fourth existence follows necessarily… (PS 101-3)\n\n\n\n\nAnd so on until the last intellect arises. This last intellect arising\nin the great cosmic chain of being is the active intellect, described\nby al-Farabi here as the “eleventh existence.” For\nal-Farabi, the active intellect is—as in other Arabic\nphilosophical texts—the 10th of the emanated\nintellects; its description as “eleventh existence” does\nnot challenge that idea, but simply follows from the fact that Farabi\ncounts God as a first intellect above the other separate intellects,\nthe first emanated intellect after God as the first intellect\n(separate, that is, from God), and so on until the active intellect,\nwhich, as the 10th emanated intellect after God, is the\n“eleventh existence,” (see PS II.3.9-10, W 105; PS\nIV.13.2, W 203).\n\n\n\nWith al-Farabi and Avicenna, Maimonides adopts a cosmology of 10\nseparate intellects, with active intellect governing the sublunar\nrealm in which we live. With his Islamic predecessors, Maimonides\nadditionally identifies these separate intellects with the angels\nspoken of in religious tradition. One Islamic philosophical example of\nthis view can be seen in al-Farabi who, in the introductory summary to\nhis treatise on the perfect state, describes the ten separate cosmic\nintellects as “the existents which should be believed to be the\nangels ” (PS 39), and as those “of which it should be said\nthat they are the angels ” (PS 41).\n\n\nOn the question of being's source, while Maimonides shares with his\nIslamic predecessors a commitment to God's role as the ultimate cause\nof the world, he additionally seems to share with al-Farabi and\nAvicenna, and in opposition to the views of Averroes, the idea that\nthe active intellect is a dator formarum (a giver of\nforms). On this view, the active intellect actually supplies the world\nin which we live with its forms and as such, plays a crucial causal\nrole in the very formation of existence. In this sense, the active\nintellect is allowed to play a shared role in God's creative,\nsustaining role as source of existence (in whatever way that process\nis ultimately understood).\n\n\nThat Maimonides is influenced by earlier Islamic writings on overflow\nand active intellect is certain. What is uncertain, though, is how all\nthe details of these ideas play out exactly in his own ultimate view\nof creation. Maimonides' own views on the issues related to\ncreation—the necessitation of creation, the role of will, and\nthe possibility of eternality—are, as we have already said,\nsubject to much debate, and for good reason given how many different\nthings he says about these subjects. Given the complexity of\nMaimonides' view of creation one must be careful not to make too many\nassumptions about what exactly is entailed by the Maimonidean\n“overflow” view. Not only can one not take Maimonides'\ntalk of “overflow” as automatically committing him to the\neternal emanation view espoused by Avicenna, but, one can't, it seems,\nbe too sure of what it means at all—even in Avicenna. In this\nspirit, we might cite al-Farabi's own reminder of the vicissitudes of\nlanguage in trying to explain the nature of the world's deepest\nunderpinnings. Al-Farabi warns of taking cosmological spatial\nlanguages of “higher and lower ” too literally, and offers\nthe same warning for the language of “overflow”:\n\n\nIndeed by “higher” and “lower,” he means the\nvenerable and superior, not spatial location…It is the same\nwith what [philosophers say] about the “overflowing” of\nthe intellect to the soul and the “overflowing” of the\nsoul to nature. By that, he means only the benefit the intellect\nprovides by assisting the soul to retain the universal forms when it\napprehends their particulars…By the “overflowing”\nof the soul to nature, he means the benefit it provides by yearning\nfor what is useful for its subsistence… (HTO sections 71-73; B\n163-4).\n\n\n\nYet one more reason to take care in approaching Maimonides'—or\nanyone else's—emanationist account of cosmic overflow. In fact,\nMaimonides himself mirrors this insight at Guide 2.12 where in the\ncontext of trying to explain some of the different ways the term\n“overflow” can be \n used,[18]\n and trying to explain what sense there is\nin using the term to describe God's activity, he stresses that\n“we are not capable of finding the true reality of a term that\nwould correspond to the true reality of the notion” (G 2.12, P\n279). In fact, this sensitivity to the temperamental nature of\nlanguage when it comes to transmitting important truths leads us to\nanother key aspect of Maimondean thought, one too which is deeply\ninfluenced by its Islamic context and to which we will turn below (see\n Section 7).\n",
    "section_title": "5. Overflow",
    "entry_title": "The Influence of Islamic Thought on Maimonides",
    "hierarchy_title": "The Influence of Islamic Thought on Maimonides || Overflow",
    "tokenized_text": [
        "overflow",
        "overflow",
        "returning",
        "earlier",
        "citation",
        "find",
        "maimonides",
        "description",
        "god",
        "s",
        "creative",
        "act",
        "idea",
        "cosmic",
        "overflow",
        "universe",
        "exists",
        "virtue",
        "existence",
        "creator",
        "latter",
        "continually",
        "endows",
        "permanence",
        "virtue",
        "thing",
        "spoken",
        "overflowas",
        "shall",
        "make",
        "clear",
        "one",
        "chapter",
        "treatise",
        "g",
        "p",
        "related",
        "question",
        "god",
        "s",
        "ontologically",
        "grounding",
        "relationship",
        "cosmos",
        "emerges",
        "maimonides",
        "islamic",
        "philosophical",
        "context",
        "emanationist",
        "notion",
        "divine",
        "overflow",
        "incorporatesand",
        "try",
        "reconcilecertain",
        "aristotelian",
        "idea",
        "cosmic",
        "separate",
        "intellect",
        "see",
        "de",
        "anima",
        "well",
        "metaphysics",
        "λ",
        "together",
        "overtly",
        "neoplatonic",
        "idea",
        "found",
        "theology",
        "aristotle",
        "alfarabi",
        "avicenna",
        "cosmic",
        "overflow",
        "particular",
        "series",
        "emanating",
        "separate",
        "intellect",
        "linked",
        "celestial",
        "sphere",
        "turn",
        "various",
        "planet",
        "respectively",
        "occupy",
        "sphere",
        "lowest",
        "separate",
        "intellect",
        "al",
        "aql",
        "alfa",
        "āl",
        "active",
        "intellect",
        "agent",
        "intellect",
        "alfarabi",
        "avicenna",
        "active",
        "intellect",
        "seen",
        "emanating",
        "source",
        "support",
        "entire",
        "sublunar",
        "realm",
        "also",
        "source",
        "human",
        "knowledge",
        "including",
        "prophecy",
        "arabic",
        "philosophical",
        "tradition",
        "active",
        "intellect",
        "identified",
        "separate",
        "intellect",
        "spoken",
        "aristotle",
        "de",
        "anima",
        "though",
        "islamic",
        "philosopherssuch",
        "averroes",
        "well",
        "ancient",
        "greek",
        "commentator",
        "aristotle",
        "contemporary",
        "aristotle",
        "scholar",
        "would",
        "various",
        "interpretation",
        "deny",
        "idea",
        "emanating",
        "intellect",
        "responsible",
        "existence",
        "world",
        "de",
        "anima",
        "maimonides",
        "influenced",
        "least",
        "idea",
        "overflow",
        "active",
        "intellect",
        "certain",
        "offering",
        "elaboration",
        "idea",
        "overflow",
        "guide",
        "g",
        "p",
        "maimonides",
        "describes",
        "cosmogonical",
        "activity",
        "cosmosas",
        "seen",
        "first",
        "series",
        "intellectsis",
        "generated",
        "preparing",
        "address",
        "world",
        "s",
        "created",
        "time",
        "maimonides",
        "talk",
        "divine",
        "overflow",
        "promising",
        "u",
        "view",
        "contradict",
        "anything",
        "said",
        "prophet",
        "sustainer",
        "law",
        "g",
        "p",
        "view",
        "question",
        "divine",
        "overflow",
        "brings",
        "series",
        "cosmic",
        "intellect",
        "intellect",
        "related",
        "process",
        "overflow",
        "one",
        "another",
        "reality",
        "follow",
        "respectively",
        "begin",
        "overflow",
        "alfayḍ",
        "coming",
        "may",
        "exalted",
        "bringing",
        "separate",
        "intellect",
        "overflow",
        "likewise",
        "intellect",
        "one",
        "brings",
        "another",
        "one",
        "continue",
        "active",
        "intellect",
        "latter",
        "bringing",
        "separate",
        "intellect",
        "come",
        "end",
        "g",
        "p",
        "arabic",
        "munk",
        "maimonides",
        "rehearses",
        "idea",
        "seen",
        "clearly",
        "islamic",
        "predecessor",
        "series",
        "intellect",
        "generate",
        "one",
        "another",
        "ie",
        "highest",
        "generating",
        "next",
        "highest",
        "lowest",
        "intellect",
        "viz",
        "active",
        "intellect",
        "maimonides",
        "go",
        "mirror",
        "idea",
        "also",
        "found",
        "alfarabi",
        "avicenna",
        "intellect",
        "additionally",
        "generates",
        "body",
        "sphere",
        "furthermore",
        "set",
        "influence",
        "sphere",
        "wield",
        "generation",
        "corruption",
        "terrestrial",
        "corporeal",
        "being",
        "earth",
        "moreover",
        "certain",
        "act",
        "bringing",
        "overflow",
        "every",
        "separate",
        "intellect",
        "sphere",
        "come",
        "end",
        "sphere",
        "moon",
        "body",
        "subject",
        "generation",
        "corruption",
        "mean",
        "first",
        "matter",
        "almādda",
        "alūlā",
        "munk",
        "referring",
        "aristotelian",
        "prime",
        "matter",
        "composed",
        "furthermore",
        "force",
        "every",
        "sphere",
        "enter",
        "element",
        "overflow",
        "completed",
        "completion",
        "generation",
        "corruption",
        "g",
        "p",
        "maimonides",
        "guide",
        "wish",
        "show",
        "governance",
        "overflow",
        "deity",
        "may",
        "exalted",
        "intellect",
        "according",
        "rank",
        "benefit",
        "received",
        "intellect",
        "good",
        "thing",
        "light",
        "overflow",
        "body",
        "sphere",
        "spheresbecause",
        "greatness",
        "benefit",
        "received",
        "principlesforces",
        "good",
        "thing",
        "overflow",
        "body",
        "subject",
        "generation",
        "corruption",
        "g",
        "p",
        "sure",
        "maimonides",
        "mirror",
        "idea",
        "found",
        "earlier",
        "islamic",
        "author",
        "regard",
        "consider",
        "alfarabi",
        "s",
        "explanation",
        "cosmic",
        "overflow",
        "first",
        "ie",
        "god",
        "everything",
        "exists",
        "come",
        "existencethe",
        "genesis",
        "come",
        "existence",
        "take",
        "place",
        "way",
        "emanation",
        "fayḍ",
        "p",
        "existence",
        "due",
        "existence",
        "something",
        "else",
        "existence",
        "something",
        "different",
        "first",
        "emanates",
        "first",
        "s",
        "existence",
        "p",
        "going",
        "elaborate",
        "unfolding",
        "universe",
        "god",
        "first",
        "intellect",
        "alfarabi",
        "describes",
        "emanation",
        "discrete",
        "intellect",
        "first",
        "explaining",
        "dual",
        "intellection",
        "intellect",
        "intellection",
        "essence",
        "one",
        "hand",
        "intellection",
        "god",
        "turn",
        "result",
        "coming",
        "heaven",
        "celestial",
        "sphere",
        "b",
        "intellect",
        "first",
        "emanates",
        "existence",
        "second",
        "second",
        "utterly",
        "incorporeal",
        "substance",
        "matter",
        "think",
        "essence",
        "think",
        "first",
        "think",
        "essence",
        "essence",
        "result",
        "thinking",
        "first",
        "third",
        "existent",
        "follows",
        "necessarily",
        "result",
        "substantification",
        "specific",
        "essence",
        "existence",
        "first",
        "heaven",
        "follows",
        "necessarily",
        "existence",
        "third",
        "matter",
        "substance",
        "intellect",
        "think",
        "essence",
        "think",
        "first",
        "result",
        "substantification",
        "specific",
        "essence",
        "existence",
        "sphere",
        "fixed",
        "star",
        "follows",
        "necessarily",
        "result",
        "thinking",
        "first",
        "fourth",
        "existence",
        "follows",
        "necessarily",
        "p",
        "last",
        "intellect",
        "arises",
        "last",
        "intellect",
        "arising",
        "great",
        "cosmic",
        "chain",
        "active",
        "intellect",
        "described",
        "alfarabi",
        "eleventh",
        "existence",
        "alfarabi",
        "active",
        "intellect",
        "isas",
        "arabic",
        "philosophical",
        "textsthe",
        "th",
        "emanated",
        "intellect",
        "description",
        "eleventh",
        "existence",
        "challenge",
        "idea",
        "simply",
        "follows",
        "fact",
        "farabi",
        "count",
        "god",
        "first",
        "intellect",
        "separate",
        "intellect",
        "first",
        "emanated",
        "intellect",
        "god",
        "first",
        "intellect",
        "separate",
        "god",
        "active",
        "intellect",
        "th",
        "emanated",
        "intellect",
        "god",
        "eleventh",
        "existence",
        "see",
        "p",
        "ii",
        "w",
        "p",
        "iv",
        "w",
        "alfarabi",
        "avicenna",
        "maimonides",
        "adopts",
        "cosmology",
        "separate",
        "intellect",
        "active",
        "intellect",
        "governing",
        "sublunar",
        "realm",
        "live",
        "islamic",
        "predecessor",
        "maimonides",
        "additionally",
        "identifies",
        "separate",
        "intellect",
        "angel",
        "spoken",
        "religious",
        "tradition",
        "one",
        "islamic",
        "philosophical",
        "example",
        "view",
        "seen",
        "alfarabi",
        "introductory",
        "summary",
        "treatise",
        "perfect",
        "state",
        "describes",
        "ten",
        "separate",
        "cosmic",
        "intellect",
        "existents",
        "believed",
        "angel",
        "p",
        "said",
        "angel",
        "p",
        "question",
        "s",
        "source",
        "maimonides",
        "share",
        "islamic",
        "predecessor",
        "commitment",
        "god",
        "s",
        "role",
        "ultimate",
        "cause",
        "world",
        "additionally",
        "seems",
        "share",
        "alfarabi",
        "avicenna",
        "opposition",
        "view",
        "averroes",
        "idea",
        "active",
        "intellect",
        "dator",
        "formarum",
        "giver",
        "form",
        "view",
        "active",
        "intellect",
        "actually",
        "supply",
        "world",
        "live",
        "form",
        "play",
        "crucial",
        "causal",
        "role",
        "formation",
        "existence",
        "sense",
        "active",
        "intellect",
        "allowed",
        "play",
        "shared",
        "role",
        "god",
        "s",
        "creative",
        "sustaining",
        "role",
        "source",
        "existence",
        "whatever",
        "way",
        "process",
        "ultimately",
        "understood",
        "maimonides",
        "influenced",
        "earlier",
        "islamic",
        "writing",
        "overflow",
        "active",
        "intellect",
        "certain",
        "uncertain",
        "though",
        "detail",
        "idea",
        "play",
        "exactly",
        "ultimate",
        "view",
        "creation",
        "maimonides",
        "view",
        "issue",
        "related",
        "creationthe",
        "necessitation",
        "creation",
        "role",
        "possibility",
        "eternalityare",
        "already",
        "said",
        "subject",
        "much",
        "debate",
        "good",
        "reason",
        "given",
        "many",
        "different",
        "thing",
        "say",
        "subject",
        "given",
        "complexity",
        "maimonides",
        "view",
        "creation",
        "one",
        "must",
        "careful",
        "make",
        "many",
        "assumption",
        "exactly",
        "entailed",
        "maimonidean",
        "overflow",
        "view",
        "one",
        "take",
        "maimonides",
        "talk",
        "overflow",
        "automatically",
        "committing",
        "eternal",
        "emanation",
        "view",
        "espoused",
        "avicenna",
        "one",
        "ca",
        "nt",
        "seems",
        "sure",
        "mean",
        "alleven",
        "avicenna",
        "spirit",
        "might",
        "cite",
        "alfarabi",
        "s",
        "reminder",
        "vicissitude",
        "language",
        "trying",
        "explain",
        "nature",
        "world",
        "s",
        "deepest",
        "underpinnings",
        "alfarabi",
        "warns",
        "taking",
        "cosmological",
        "spatial",
        "language",
        "higher",
        "lower",
        "literally",
        "offer",
        "warning",
        "language",
        "overflow",
        "indeed",
        "higher",
        "lower",
        "mean",
        "venerable",
        "superior",
        "spatial",
        "locationit",
        "philosopher",
        "say",
        "overflowing",
        "intellect",
        "soul",
        "overflowing",
        "soul",
        "nature",
        "mean",
        "benefit",
        "intellect",
        "provides",
        "assisting",
        "soul",
        "retain",
        "universal",
        "form",
        "apprehends",
        "particularsby",
        "overflowing",
        "soul",
        "nature",
        "mean",
        "benefit",
        "provides",
        "yearning",
        "useful",
        "subsistence",
        "hto",
        "section",
        "b",
        "yet",
        "one",
        "reason",
        "take",
        "care",
        "approaching",
        "maimonidesor",
        "anyone",
        "elsesemanationist",
        "account",
        "cosmic",
        "overflow",
        "fact",
        "maimonides",
        "mirror",
        "insight",
        "guide",
        "context",
        "trying",
        "explain",
        "different",
        "way",
        "term",
        "overflow",
        "used",
        "trying",
        "explain",
        "sense",
        "using",
        "term",
        "describe",
        "god",
        "s",
        "activity",
        "stress",
        "capable",
        "finding",
        "true",
        "reality",
        "term",
        "would",
        "correspond",
        "true",
        "reality",
        "notion",
        "g",
        "p",
        "fact",
        "sensitivity",
        "temperamental",
        "nature",
        "language",
        "come",
        "transmitting",
        "important",
        "truth",
        "lead",
        "u",
        "another",
        "key",
        "aspect",
        "maimondean",
        "thought",
        "one",
        "deeply",
        "influenced",
        "islamic",
        "context",
        "turn",
        "see",
        "section"
    ]
}