{
    "main_text": "Cosmos, Creation, Emanation\n4. Cosmos, Creation, Emanation\n\n\nFollowing in the Greek and Islamic traditions before him, Maimonides\nsets out to carefully investigate the workings of the\nworld—including terrestrial, celestial, and purely metaphysical\nrealities. Based on our consideration of divine “acts”\nabove, we can see how even investigations into the workings of\ncorporeal nature can be seen as having explicitly theological\nsignificance in a Maimonidean context. In this spirit, Maimonides can\nbe seen as finding value in the cosmological argument at play in\nAristotle and Averroes according to which the workings of the world\ngive rise to a proof for the existence of God as a first mover\n(though, it might be noted, that Maimonides, along with al-Farabi,\nAvicenna—and, in a somewhat different sense,\nAverroes—credits God with being the cause not only of motion,\nbut of existence as well). In this way, even studying the workings of\nnature can be seen in the service of theology—a point borne out\nfurther when we consider our above discussion of Maimonides and\nAverroes on God’s manifest role in the order of nature. In this\nregard, we might note that Maimonides goes so far as to describe\ndivine actions at 2.32 as natural actions. Furthermore, in a context\nwhere God Himself cannot be known per se and where (as we\nhave seen above) descriptions of God are best understood as describing\nnot God, but the effects of God in the world (that is, the\nmanifestation of God’s wisdom and goodness in the well-ordered design\nand workings of nature), a study of how the world works can be seen as\na study of God's actions (and as such, as an attempt to better get to\nknow God). As Maimonides makes clear, “There is…no way to\napprehend Him except…through the things He has made…” (G 1.34, P\n74).\n\n \nIn relation to the cosmos, it is clear that Maimonides' God stands as\nfirst cause and source for all existence. Far less, clear, however, is\nMaimonides' precise understanding of what God's role as “first\ncause and source for all existence”—His role, that is, as\nCreator—amounts to. (For an overview of key Arabic creation\nterms at play in Maimonides’ Islamic milieu as well as in his Jewish\nNeoplatonic context, the reader is well-served to consult\nthe Encyclopaedia of Islam entries\non ibdā‘, khalq, ḥudūth\nal-‘alām; see too Altman and Stern on Neoplatonic\ncreation terms in Israeli’s lexicon (including\nalso al-ikhtirā‘) and their relation to Greek and\nIslamic text traditions, including al-Kindi (Almann and Stern 1958;\nsee Israeli’s Book of Definitions 66-68, with comments at\n68-74).\n\nAt Guide 2.13, Maimonides seems, at least prima facie, to embrace a\ndoctrine of creation ex nihilo:\n\n\n…the opinion of all who believe in the Law of Moses our Master,\npeace be on him, is that the world as a whole—I mean to say,\nevery existent other than God, may He be exalted—was brought\ninto existence by God after having been purely and absolutely\nnonexistent, and that God, may He be exalted, had existed alone, and\nnothing else—neither an angel nor a sphere nor what subsists\nwithin the sphere. Afterwards, through His will and His volition, He\nbrought into existence out of nothing all the beings as they are, time\nitself being one of the created things…\n\n\n\n\nIn the context of 2.13, this view is contrasted with two other\ncosmogonical views: 1) creation ex aliquo (i.e., the Platonic\ncosmogony on which God invests an eternally existing material\nsubstrate with forms); and 2) the Aristotelian position that the world\nis eternal. Suffice it to say that there is much scholarly debate over\nthe exact nature of Maimonides' true view on creation. First of all,\nthere are theorists (following in the tradition of Leo Strauss) who\nview Maimonides as committed to esoteric writing strategies rooted in\nsocio-political considerations—essentially, on such a view,\nMaimonides will often be seen to have written the exact opposite of\nwhat he truly believed. For these theorists, the stated view of\nMaimonides will almost always be in extreme contrast to his true,\nunstated view [for a related discussion,\nsee Section 7].  Applying this theoretical\nstarting point to the case at hand, the fact that Maimonides seems to\nembrace creation ex nihilo would suggest to some that he\ntruly believed in Aristotelian eternity, the opposite\nview.[14]\n\n\n\nThere are, though, other compelling reasons to question Maimonides'\nview of creation. Leaving aside, that is, any particular commitments\nto Straussian writing strategies, we might simply note that\nMaimonides' own treatment of creation and its various sub-themes seems\nto leave room for interpretation, oftentime admitting of\nambiguous—and even changing—details. Careful readings and\nre-readings of the Guide seem to support more than one way of\nunderstanding the precise nature of and relationship between such\nconcepts as: creation [simpliciter], creation ex\nnihilo, creation ex aliquo, creation taken in a temporal\nsense, creation taken in a non-temporal sense, continuous creation,\nontological dependency, emanation, and will, among other inter-related\nconcepts. “Will,” for example, is sometimes described as a\nfeature of creation ex nihilo, but other times seems to\nemerge as a feature of “creation” more broadly; but, as we\nhave seen earlier in our discussion of The Theology of\nAristotle, in Maimonides' philosophical context\n“creation” (and even “creation ex\nnihilo”) might in theory be used to describe even\nNeoplatonic eternal \n emanation[15]\n or Aristotelian eternity viewed in a\ncertain way (for the explicit reconciliation of creation language with\ndoctrines of eternity in Maimonides' immediate philosophical milieu,\nsee Averroes). And so, scholarly debates about Maimonides' true view\non this matter abound: while some attribute to him a view of creation\nin time, others find in Maimonides a secret belief in Platonic\ncreation ex aliquo (Davidson 1979, 16-40), a secret belief in\nthe Aristotelian view of eternity, or a belief in the identity between\nthe notion of Biblical creation and Aristotelian eternity\n(W. Z. Harvey 1981).\n\n\n\nWhatever his ultimate view, Maimonides certainly engages the idea of\ncreation, describing God as the Creator (a description that is, of\ncourse, also used in the Theology of Aristotle tradition in a\nway that has nothing to do with the Bible, and nothing to do with\n“creation in time”):\n\n\nFor the universe exists in virtue of the existence of the Creator, and\nthe latter continually endows it with permanence in virtue of the\nthing that is spoken of as overflow—as we shall make clear in\none of the chapters of this Treatise… (G 1.69, P 168)\n\n\n\n\nHere, God emerges as the cause (in at least some sense) of the world's\nexistence. We see here too an emphasis on the continuous relationship\nbetween God and the world in this regard: As cause of the world's\n“permanence,” God is a continual sustainer. Here too, we\nlearn of the idea of a cosmic overflow, an idea to which we will\nreturn below.\n\n\nLooking to his Islamic context, it is important always keep in mind\nthat describing God as the source and cause of being (and even\ndescribing God as a “creator”) can mean very different\nthings, and so care must be taken not to assume we know what\nMaimonides is talking about just because his God is a creating source\nand cause.  Describing God as a cause of being, or as a creator, or\neven as a creator ex nihilo might mean—as it does in\nal-Kindi—that He brings about the existence of the world in time\n(in this way standing in clear opposition to an Aristotelian view of\neternity or a Plotinian view of emanation), or it might mean something\nelse entirely: It might mean for instance that God is an eternal\nontological source. This idea can be seen in Avicenna for whom God is\nthe Being eternally engaged in an ongoing process of emanation, and in\nthis way eternally generating existence itself. This idea of\nGod-as-source can be seen too in a somewhat different way in Averroes\nfor whom God-as-creator is the eternal-ontological source, the\nAristotelian uncaused cause who eternally sustains the universe\nand—absent an Avicennian process of emanationist\nintermediation—is the constant productive source—and in\nthis sense, the creator—of cosmic existence (see Leaman 1988,\nesp. 42-71 and Davidson 1987; see too Taylor 2012a, Other Internet\nResources).  Averroes in this regard champions an ab aeterno\ngeneration which can in part be characterized as\nnot-quite-a-creation-view, and can in part be characterized as\nnot-quite-an-eternity-view (depending, of course, on what one means by\nthose terms):\n\n\nBut in truth it [i.e. the world] is neither truly generated, nor is it\ntruly eternal. For what is truly generated is necessarily corruptible,\nand what is truly eternal has no cause…Thus the doctrines about\nthe world are not all so far apart from one another that some of them\nshould be charged as unbelief and others not. (DT sections 19-20, B\n15-16)\n\n\n\nAccording to Averroes, it is important to acknowledge that the\nexistence of the world has a cause, and so any philosophical account\nof eternity that suggests otherwise won't do, whereas it is equally\nimportant to recognize that existence itself along with time\n“extend continuously at both extremes,” and so, any\nunreflective religious commitment to origination in time won't\ndo. Exposing the weaknesses in holding either that the world is\ncreated in time (muhdath) or that it is eternal (in the sense\nof “uncaused”), Averroes instead upholds a notion of the\nworld's being “generated ab aeterno.”\n\n\nFor Avicenna and for Averroes—though in different ways—the\nidea of eternity does not exclude talking about the existence of the\nuniverse as a created effect of God: for Avicenna, God is the\n“cause of being” in the sense that He is the eternally\nemanating source of being, whereas for Averroes, God is the\n“cause of being” in the sense of an ab aeterno\nnon-emanative source of generation. Maimonides—given all of his\novert talk of emanation (fayḍ) in the Guide—would\nseem best grouped with Avicenna on this issue, though as we have seen\nabove, other aspects of his view of God’s role in the universe\nresonate strongly with Averroes. To be sure, the exact nature of\nMaimonides’ view—and the extent of its similarities to and/or\ninfluences from the views of Avicenna and Averroes—seems\nreasonably open to debate. Given the subtle interplay of the notions\nof emanation, creation, eternal sustenance, and ontological causal\ngrounding—in addition to Maimonides' own arguably ambiguous\nclaims about creation—it is difficult to know for sure what\nMaimonides is advocating, even when he is advocating\n“creation.”\n\n\nAdding to the conceptual complexity, one might note too that there\nare, in Maimonides' own Islamic context, debates about just how to\nunderstand the Quranic description of a Creator God. While Quran II,\n117 and VI, 101 describe God as the Badī‘, or\nAbsolute Creator, it is unclear exactly what is meant by the activity\nof ibdā‘ (absolute creation, or innovation) and\nhow it relates to an act of\nikhtirā‘ (invention, origination, or making \nanew).[16]\n Looking to certain Islamic interpretations of God's creative role as\ndescribed in the Quran, the idea of “creation  ex nihilo\n ” can be seen to fall away in light of Quranic verses—such as\nQuran XI, 7 (“…and His throne was on the\nwater…”) and XLI, 2 (“Then He directed Himself\ntowards the sky, and it was smoke”)—which can be taken\n(as they are by\n Averroes; see DT section 21, B 16), \n as overtly signifying substances co-eternal with\nGod (such as the “smoke” of XLI, 2 taken as denoting an\neternally co-existing something). For Averroes, the meaning of the\nQuran on creation is that “[the world's] form really is\ngenerated, whereas being itself and time extend continuously at both\n extremes…” (DT section 21, B 16). \n Along these lines, we might note that there is no reason that the\nambiguity (or openness) of what the Quran means in its description of God should\nnot have carried through to Maimonides' own thoughts on the Biblical\naccount, where the philosophically relevant details of God's Genesis\nact of creation (brī’ah) are arguably left unspecified and open to interpretation.\n\n\nSeen in this context, interpreting Maimonides' own views on\ncreation—including difficulties in ascertaining what on his view\ncounts as “the Biblical account” of creation—is\ndifficult. We might add a further difficulty: Maimonides' overall\ntreatment of creation is tempered by his acknowledgement (G 2.16) that\nthe question of creation v. eternity is an open question—in\nother words, there is no conclusive proof, according to Maimonides,\nfor creation and no conclusive proof for eternity (a claim which can\nbe seen too in Averroes'\nTahāfut, 1st discussion, 1st\n proof).\n In this spirit, Maimonides offers the following summary of a chapter\nin which the creation question has been considered:\n\n\nTo sum up: Nothing in the methods we have set forth in this chapter is\ncapable either of establishing an opinion [about the eternity of the\nworld] as correct or of proving it false or of arousing doubts with\nregard to it… (G 2.15, P 292)\n\n\n",
    "section_title": "4. Cosmos, Creation, Emanation",
    "entry_title": "The Influence of Islamic Thought on Maimonides",
    "hierarchy_title": "The Influence of Islamic Thought on Maimonides || Cosmos, Creation, Emanation",
    "tokenized_text": [
        "cosmos",
        "creation",
        "emanation",
        "cosmos",
        "creation",
        "emanation",
        "following",
        "greek",
        "islamic",
        "tradition",
        "maimonides",
        "set",
        "carefully",
        "investigate",
        "working",
        "worldincluding",
        "terrestrial",
        "celestial",
        "purely",
        "metaphysical",
        "reality",
        "based",
        "consideration",
        "divine",
        "act",
        "see",
        "even",
        "investigation",
        "working",
        "corporeal",
        "nature",
        "seen",
        "explicitly",
        "theological",
        "significance",
        "maimonidean",
        "context",
        "spirit",
        "maimonides",
        "seen",
        "finding",
        "value",
        "cosmological",
        "argument",
        "play",
        "aristotle",
        "averroes",
        "according",
        "working",
        "world",
        "give",
        "rise",
        "proof",
        "existence",
        "god",
        "first",
        "mover",
        "though",
        "might",
        "noted",
        "maimonides",
        "along",
        "alfarabi",
        "avicennaand",
        "somewhat",
        "different",
        "sense",
        "averroescredits",
        "god",
        "cause",
        "motion",
        "existence",
        "well",
        "way",
        "even",
        "studying",
        "working",
        "nature",
        "seen",
        "service",
        "theologya",
        "point",
        "borne",
        "consider",
        "discussion",
        "maimonides",
        "averroes",
        "god",
        "manifest",
        "role",
        "order",
        "nature",
        "regard",
        "might",
        "note",
        "maimonides",
        "go",
        "far",
        "describe",
        "divine",
        "action",
        "natural",
        "action",
        "furthermore",
        "context",
        "god",
        "known",
        "per",
        "se",
        "seen",
        "description",
        "god",
        "best",
        "understood",
        "describing",
        "god",
        "effect",
        "god",
        "world",
        "manifestation",
        "god",
        "wisdom",
        "goodness",
        "wellordered",
        "design",
        "working",
        "nature",
        "study",
        "world",
        "work",
        "seen",
        "study",
        "god",
        "s",
        "action",
        "attempt",
        "better",
        "get",
        "know",
        "god",
        "maimonides",
        "make",
        "clear",
        "isno",
        "way",
        "apprehend",
        "exceptthrough",
        "thing",
        "made",
        "g",
        "p",
        "relation",
        "cosmos",
        "clear",
        "maimonides",
        "god",
        "stand",
        "first",
        "cause",
        "source",
        "existence",
        "far",
        "le",
        "clear",
        "however",
        "maimonides",
        "precise",
        "understanding",
        "god",
        "s",
        "role",
        "first",
        "cause",
        "source",
        "existence",
        "his",
        "role",
        "creatoramounts",
        "overview",
        "key",
        "arabic",
        "creation",
        "term",
        "play",
        "maimonides",
        "islamic",
        "milieu",
        "well",
        "jewish",
        "neoplatonic",
        "context",
        "reader",
        "wellserved",
        "consult",
        "encyclopaedia",
        "islam",
        "entry",
        "ibdā",
        "khalq",
        "ḥudūth",
        "al",
        "alām",
        "see",
        "altman",
        "stern",
        "neoplatonic",
        "creation",
        "term",
        "israeli",
        "lexicon",
        "including",
        "also",
        "alikhtirā",
        "relation",
        "greek",
        "islamic",
        "text",
        "tradition",
        "including",
        "alkindi",
        "almann",
        "stern",
        "see",
        "israeli",
        "book",
        "definition",
        "comment",
        "guide",
        "maimonides",
        "seems",
        "least",
        "prima",
        "facie",
        "embrace",
        "doctrine",
        "creation",
        "ex",
        "nihilo",
        "the",
        "opinion",
        "believe",
        "law",
        "moses",
        "master",
        "peace",
        "world",
        "wholei",
        "mean",
        "say",
        "every",
        "existent",
        "god",
        "may",
        "exaltedwas",
        "brought",
        "existence",
        "god",
        "purely",
        "absolutely",
        "nonexistent",
        "god",
        "may",
        "exalted",
        "existed",
        "alone",
        "nothing",
        "elseneither",
        "angel",
        "sphere",
        "subsists",
        "within",
        "sphere",
        "afterwards",
        "volition",
        "brought",
        "existence",
        "nothing",
        "being",
        "time",
        "one",
        "created",
        "things",
        "context",
        "view",
        "contrasted",
        "two",
        "cosmogonical",
        "view",
        "creation",
        "ex",
        "aliquo",
        "ie",
        "platonic",
        "cosmogony",
        "god",
        "invests",
        "eternally",
        "existing",
        "material",
        "substrate",
        "form",
        "aristotelian",
        "position",
        "world",
        "eternal",
        "suffice",
        "say",
        "much",
        "scholarly",
        "debate",
        "exact",
        "nature",
        "maimonides",
        "true",
        "view",
        "creation",
        "first",
        "theorist",
        "following",
        "tradition",
        "leo",
        "strauss",
        "view",
        "maimonides",
        "committed",
        "esoteric",
        "writing",
        "strategy",
        "rooted",
        "sociopolitical",
        "considerationsessentially",
        "view",
        "maimonides",
        "often",
        "seen",
        "written",
        "exact",
        "opposite",
        "truly",
        "believed",
        "theorist",
        "stated",
        "view",
        "maimonides",
        "almost",
        "always",
        "extreme",
        "contrast",
        "true",
        "unstated",
        "view",
        "related",
        "discussion",
        "see",
        "section",
        "applying",
        "theoretical",
        "starting",
        "point",
        "case",
        "hand",
        "fact",
        "maimonides",
        "seems",
        "embrace",
        "creation",
        "ex",
        "nihilo",
        "would",
        "suggest",
        "truly",
        "believed",
        "aristotelian",
        "eternity",
        "opposite",
        "view",
        "though",
        "compelling",
        "reason",
        "question",
        "maimonides",
        "view",
        "creation",
        "leaving",
        "aside",
        "particular",
        "commitment",
        "straussian",
        "writing",
        "strategy",
        "might",
        "simply",
        "note",
        "maimonides",
        "treatment",
        "creation",
        "various",
        "subthemes",
        "seems",
        "leave",
        "room",
        "interpretation",
        "oftentime",
        "admitting",
        "ambiguousand",
        "even",
        "changingdetails",
        "careful",
        "reading",
        "rereadings",
        "guide",
        "seem",
        "support",
        "one",
        "way",
        "understanding",
        "precise",
        "nature",
        "relationship",
        "concept",
        "creation",
        "simpliciter",
        "creation",
        "ex",
        "nihilo",
        "creation",
        "ex",
        "aliquo",
        "creation",
        "taken",
        "temporal",
        "sense",
        "creation",
        "taken",
        "nontemporal",
        "sense",
        "continuous",
        "creation",
        "ontological",
        "dependency",
        "emanation",
        "among",
        "interrelated",
        "concept",
        "example",
        "sometimes",
        "described",
        "feature",
        "creation",
        "ex",
        "nihilo",
        "time",
        "seems",
        "emerge",
        "feature",
        "creation",
        "broadly",
        "seen",
        "earlier",
        "discussion",
        "theology",
        "aristotle",
        "maimonides",
        "philosophical",
        "context",
        "creation",
        "even",
        "creation",
        "ex",
        "nihilo",
        "might",
        "theory",
        "used",
        "describe",
        "even",
        "neoplatonic",
        "eternal",
        "emanation",
        "aristotelian",
        "eternity",
        "viewed",
        "certain",
        "way",
        "explicit",
        "reconciliation",
        "creation",
        "language",
        "doctrine",
        "eternity",
        "maimonides",
        "immediate",
        "philosophical",
        "milieu",
        "see",
        "averroes",
        "scholarly",
        "debate",
        "maimonides",
        "true",
        "view",
        "matter",
        "abound",
        "attribute",
        "view",
        "creation",
        "time",
        "others",
        "find",
        "maimonides",
        "secret",
        "belief",
        "platonic",
        "creation",
        "ex",
        "aliquo",
        "davidson",
        "secret",
        "belief",
        "aristotelian",
        "view",
        "eternity",
        "belief",
        "identity",
        "notion",
        "biblical",
        "creation",
        "aristotelian",
        "eternity",
        "w",
        "z",
        "harvey",
        "whatever",
        "ultimate",
        "view",
        "maimonides",
        "certainly",
        "engages",
        "idea",
        "creation",
        "describing",
        "god",
        "creator",
        "description",
        "course",
        "also",
        "used",
        "theology",
        "aristotle",
        "tradition",
        "way",
        "nothing",
        "bible",
        "nothing",
        "creation",
        "time",
        "universe",
        "exists",
        "virtue",
        "existence",
        "creator",
        "latter",
        "continually",
        "endows",
        "permanence",
        "virtue",
        "thing",
        "spoken",
        "overflowas",
        "shall",
        "make",
        "clear",
        "one",
        "chapter",
        "treatise",
        "g",
        "p",
        "god",
        "emerges",
        "cause",
        "least",
        "sense",
        "world",
        "s",
        "existence",
        "see",
        "emphasis",
        "continuous",
        "relationship",
        "god",
        "world",
        "regard",
        "cause",
        "world",
        "s",
        "permanence",
        "god",
        "continual",
        "sustainer",
        "learn",
        "idea",
        "cosmic",
        "overflow",
        "idea",
        "return",
        "looking",
        "islamic",
        "context",
        "important",
        "always",
        "keep",
        "mind",
        "describing",
        "god",
        "source",
        "cause",
        "even",
        "describing",
        "god",
        "creator",
        "mean",
        "different",
        "thing",
        "care",
        "must",
        "taken",
        "assume",
        "know",
        "maimonides",
        "talking",
        "god",
        "creating",
        "source",
        "cause",
        "describing",
        "god",
        "cause",
        "creator",
        "even",
        "creator",
        "ex",
        "nihilo",
        "might",
        "meanas",
        "alkindithat",
        "brings",
        "existence",
        "world",
        "time",
        "way",
        "standing",
        "clear",
        "opposition",
        "aristotelian",
        "view",
        "eternity",
        "plotinian",
        "view",
        "emanation",
        "might",
        "mean",
        "something",
        "else",
        "entirely",
        "might",
        "mean",
        "instance",
        "god",
        "eternal",
        "ontological",
        "source",
        "idea",
        "seen",
        "avicenna",
        "god",
        "eternally",
        "engaged",
        "ongoing",
        "process",
        "emanation",
        "way",
        "eternally",
        "generating",
        "existence",
        "idea",
        "godassource",
        "seen",
        "somewhat",
        "different",
        "way",
        "averroes",
        "godascreator",
        "eternalontological",
        "source",
        "aristotelian",
        "uncaused",
        "cause",
        "eternally",
        "sustains",
        "universe",
        "andabsent",
        "avicennian",
        "process",
        "emanationist",
        "intermediationis",
        "constant",
        "productive",
        "sourceand",
        "sense",
        "creatorof",
        "cosmic",
        "existence",
        "see",
        "leaman",
        "esp",
        "davidson",
        "see",
        "taylor",
        "a",
        "internet",
        "resource",
        "averroes",
        "regard",
        "champion",
        "ab",
        "aeterno",
        "generation",
        "part",
        "characterized",
        "notquiteacreationview",
        "part",
        "characterized",
        "notquiteaneternityview",
        "depending",
        "course",
        "one",
        "mean",
        "term",
        "truth",
        "ie",
        "world",
        "neither",
        "truly",
        "generated",
        "truly",
        "eternal",
        "truly",
        "generated",
        "necessarily",
        "corruptible",
        "truly",
        "eternal",
        "causethus",
        "doctrine",
        "world",
        "far",
        "apart",
        "one",
        "another",
        "charged",
        "unbelief",
        "others",
        "dt",
        "section",
        "b",
        "according",
        "averroes",
        "important",
        "acknowledge",
        "existence",
        "world",
        "cause",
        "philosophical",
        "account",
        "eternity",
        "suggests",
        "otherwise",
        "wo",
        "nt",
        "whereas",
        "equally",
        "important",
        "recognize",
        "existence",
        "along",
        "time",
        "extend",
        "continuously",
        "extreme",
        "unreflective",
        "religious",
        "commitment",
        "origination",
        "time",
        "wo",
        "nt",
        "exposing",
        "weakness",
        "holding",
        "either",
        "world",
        "created",
        "time",
        "muhdath",
        "eternal",
        "sense",
        "uncaused",
        "averroes",
        "instead",
        "upholds",
        "notion",
        "world",
        "s",
        "generated",
        "ab",
        "aeterno",
        "avicenna",
        "averroesthough",
        "different",
        "waysthe",
        "idea",
        "eternity",
        "exclude",
        "talking",
        "existence",
        "universe",
        "created",
        "effect",
        "god",
        "avicenna",
        "god",
        "cause",
        "sense",
        "eternally",
        "emanating",
        "source",
        "whereas",
        "averroes",
        "god",
        "cause",
        "sense",
        "ab",
        "aeterno",
        "nonemanative",
        "source",
        "generation",
        "maimonidesgiven",
        "overt",
        "talk",
        "emanation",
        "fayḍ",
        "guidewould",
        "seem",
        "best",
        "grouped",
        "avicenna",
        "issue",
        "though",
        "seen",
        "aspect",
        "view",
        "god",
        "role",
        "universe",
        "resonate",
        "strongly",
        "averroes",
        "sure",
        "exact",
        "nature",
        "maimonides",
        "viewand",
        "extent",
        "similarity",
        "andor",
        "influence",
        "view",
        "avicenna",
        "averroesseems",
        "reasonably",
        "open",
        "debate",
        "given",
        "subtle",
        "interplay",
        "notion",
        "emanation",
        "creation",
        "eternal",
        "sustenance",
        "ontological",
        "causal",
        "groundingin",
        "addition",
        "maimonides",
        "arguably",
        "ambiguous",
        "claim",
        "creationit",
        "difficult",
        "know",
        "sure",
        "maimonides",
        "advocating",
        "even",
        "advocating",
        "creation",
        "adding",
        "conceptual",
        "complexity",
        "one",
        "might",
        "note",
        "maimonides",
        "islamic",
        "context",
        "debate",
        "understand",
        "quranic",
        "description",
        "creator",
        "god",
        "quran",
        "ii",
        "vi",
        "describe",
        "god",
        "badī",
        "absolute",
        "creator",
        "unclear",
        "exactly",
        "meant",
        "activity",
        "ibdā",
        "absolute",
        "creation",
        "innovation",
        "relates",
        "act",
        "ikhtirā",
        "invention",
        "origination",
        "making",
        "anew",
        "looking",
        "certain",
        "islamic",
        "interpretation",
        "god",
        "s",
        "creative",
        "role",
        "described",
        "quran",
        "idea",
        "creation",
        "ex",
        "nihilo",
        "seen",
        "fall",
        "away",
        "light",
        "quranic",
        "versessuch",
        "quran",
        "xi",
        "and",
        "throne",
        "water",
        "xli",
        "directed",
        "towards",
        "sky",
        "smoke",
        "which",
        "taken",
        "averroes",
        "see",
        "dt",
        "section",
        "b",
        "overtly",
        "signifying",
        "substance",
        "coeternal",
        "god",
        "smoke",
        "xli",
        "taken",
        "denoting",
        "eternally",
        "coexisting",
        "something",
        "averroes",
        "meaning",
        "quran",
        "creation",
        "world",
        "s",
        "form",
        "really",
        "generated",
        "whereas",
        "time",
        "extend",
        "continuously",
        "extremes",
        "dt",
        "section",
        "b",
        "along",
        "line",
        "might",
        "note",
        "reason",
        "ambiguity",
        "openness",
        "quran",
        "mean",
        "description",
        "god",
        "carried",
        "maimonides",
        "thought",
        "biblical",
        "account",
        "philosophically",
        "relevant",
        "detail",
        "god",
        "s",
        "genesis",
        "act",
        "creation",
        "brī",
        "ah",
        "arguably",
        "left",
        "unspecified",
        "open",
        "interpretation",
        "seen",
        "context",
        "interpreting",
        "maimonides",
        "view",
        "creationincluding",
        "difficulty",
        "ascertaining",
        "view",
        "count",
        "biblical",
        "account",
        "creationis",
        "difficult",
        "might",
        "add",
        "difficulty",
        "maimonides",
        "overall",
        "treatment",
        "creation",
        "tempered",
        "acknowledgement",
        "g",
        "question",
        "creation",
        "v",
        "eternity",
        "open",
        "questionin",
        "word",
        "conclusive",
        "proof",
        "according",
        "maimonides",
        "creation",
        "conclusive",
        "proof",
        "eternity",
        "claim",
        "seen",
        "averroes",
        "tahāfut",
        "st",
        "discussion",
        "st",
        "proof",
        "spirit",
        "maimonides",
        "offer",
        "following",
        "summary",
        "chapter",
        "creation",
        "question",
        "considered",
        "sum",
        "nothing",
        "method",
        "set",
        "forth",
        "chapter",
        "capable",
        "either",
        "establishing",
        "opinion",
        "eternity",
        "world",
        "correct",
        "proving",
        "false",
        "arousing",
        "doubt",
        "regard",
        "it",
        "g",
        "p"
    ]
}