{
    "main_text": "Intellectual Biography\n1. Intellectual Biography\n\n“Scholars of Wisdom have no rest in this world or in the\nworld to come.”\n\nThis Talmudic saying, with which Maimon concludes his first\nphilosophical work, the Essay on Transcendental Philosophy\n(1790), applies strikingly well to the life story of Salomon Maimon.\nMaimon was born in 1753 in Suchowyborg (Sukowy Borek), a village on\nthe tributary of the Nieman river, next to the town of Mir (Mirz) in\nLithuania. His family, which originally was rather wealthy, fell into\npoverty due to poor management of its properties. Thus, Maimon’s\nfather became a children’s teacher, an example that was followed\nlater by his son Salomon. Maimon received a traditional religious\neducation, which concentrated mainly on the study of the\nTalmud. At the age of 11, shortly after the death of his\nmother and following a comedy of errors involving the mothers of two\nyoung girls, Maimon was married in an arranged ceremony, and three\nyears later, in 1767, his first son, David, was born. During his early\nadulthood, Maimon developed a keen curiosity about the sciences and\nphilosophy. The most crucial influence was that of Maimonides’\nGuide of the Perplexed, through which Maimon became\nacquainted with Aristotelian philosophy in its medieval cloth, and\nwith the iconoclastic spirit of Maimonides’ philosophy of\nreligion. Maimon’s attachment to Maimonides — both\npersonally and philosophically — ran throughout his life. Even\nMaimon’s own name was adopted as an expression of respect\ntowards this teacher. (At the time, few Jews adopted family names.\nBefore taking the surname ‘Maimon’, Maimon used to be\ncalled after his father: Salomon ben (“son\nof”) Joshua.) Maimon also developed an interest in\nKabbalistic texts, which in spite of his relatively young age, he\nattempted to study and interpret according to the bodies of knowledge\nhe had already mastered (i.e., Maimonidean philosophy). Around 1770\nMaimon went to visit the court of the Maggid (The\nPreacher) of Mezrich, the contemporary leader and one of the\nfounders of Hassidism. Maimon’s visit seems to have\nlasted no more than a few weeks; still it is clear that he was\nstrongly impressed by this new form of religious life and its teaching\nof self-annihilation in God. Maimon dedicates a chapter and half of\nhis 1792/3 Lebensgeschichte to the portrayal of early\nHassidism, and these chapters are indeed the most valuable external\nhistorical source on the emergence of Hassidism. Maimon passes a\nnegative judgment on some aspects of Hassidism, still even from the\nlate perspective of his writing in the 1790s his enthusiasm about some\nfeatures of the movement (such as, the use of improvisation in\nexpounding the Torah) are salient. Recent scholarship on Hassidism\nconfirmed virtually all of the teaching’s Maimon quotes in the\nname of the Maggid and his disciples (see Melamed 2018). It is also\nremarkable that the story of Maimon’s visit to the court of the\nMaggid is documented in Hassidic sources which describe Maimon as one\nof the disciples of the Maggid “she-shana\nu-firesh” (“who studied and reneged”). See\nHoizman (1962, 261–62). Maimon’s discussion of Hassidic\npantheism is highly sympathetic, and occasionally he alludes to the\nsimilarities between Hassidic acosmism, and Spinozism.\n\nIn his mid-twenties, hoping to widen his knowledge of philosophy and\nthe sciences, Maimon left his family and went to Berlin (under the\npretense of attempting to study medicine there). This first visit to\nBerlin ended shortly and grimly. Having confided to one of the\nofficers of the Jewish community that the purpose of his visit was to\nstudy philosophy and that he intended to publish a new commentary on\nMaimonides’ Guide of the Perplexed, Maimon was asked to\npack his belongings and leave the shelter of the Jewish community\n— and thus the city — at once. The following half year\nMaimon spent as a wandering beggar. Eventually, he and his beggar\nfriend decided to return to Poland. As they reached the border town of\nPosen, Maimon’s talent and erudition were recognized by the\nchief rabbi of the town, and he was offered a shelter and a position\nas a tutor at the house of one of the city’s Jews. During his\nstay in Posen Maimon wrote one of his Hebrew works, Hesheq\nShelomo (“Solomon’s Desire.” See the\nBibliography).\n\nIn 1780 Maimon, went again to Berlin. This journey was much more\nsuccessful and Maimon established a close connection with Moses\nMendelssohn and entered the circles of the Haskala (the\nJewish Enlightenment movement) in Berlin. Yet neither Berlin nor its\nenlightened Jews provided a real home for Maimon. For the cultured\nJews of Berlin, Maimon was a rude Ostjude (East-European\nJew), who spoke awful German accompanied by a variety of wild\ngesticulations. They did, however, acknowledge the genius of this\nperson, who could, for example, read a difficult book of mathematics\nfor the first time, and then explain it — in his savage manner\n— a short while later. Similarly, Maimon had little appreciation\nfor these fine bourgeois who, free from any barriers which would\nimpede their ability to study the sciences, only contented themselves\nwith a shallow acquaintance with what a civilized person\nshould know. Furthermore, they lacked the sharpness of mind\nof his fellow Talmudists in Poland. Maimon does seem to have had a\ngenuine appreciation for Mendelssohn, both because of his\nkindheartedness and because, unlike most others of the circles of the\nJewish Enlightenment, Mendelssohn had a reasonable grasp of the\nTalmud and rabbinic literature.\n\nIn 1783, Mendelssohn asked Maimon to leave Berlin due to\nMaimon’s open Spinozism and his bohemian lifestyle. After a\njourney to Hamburg, Amsterdam and then back to Hamburg, Maimon entered\nthe Gymnasium Christianeum in Altona, where he stayed for two years.\nDuring this period Maimon studied several European languages and\nimproved his knowledge of the natural sciences and his command of\nGerman. In 1785, Maimon left Altona for Berlin, where he met\nMendelssohn for the last time. Later that year Maimon moved to Dessau,\nwhere he wrote a Hebrew textbook on mathematics, and subsequently\nsettled in Breslau. Here, after a failed attempt to study medicine,\nMaimon again took up the position of a tutor. While staying in\nBreslau, Maimon translated Mendelssohn’s Morgenstunden\ninto Hebrew (a manuscript which is now lost) and wrote a Hebrew\ntextbook of Newtonian physics — Ta’alumoth Hochma\n(“Mysteries of Wisdom”). After more than a decade\nof separation, Maimon’s wife, Sarah, accompanied by their eldest\nson, David, succeeded in locating him in Breslau, and demanded that he\neither return to Lithuania or get a divorce. Reluctant to sever his\nties with his past, Maimon tried to postpone the decision, but after\nhis wife insisted that he must make the choice, he finally agreed to\nthe divorce.\n\nIn 1787 Maimon traveled again to Berlin. There he heard about\nKant’s new philosophy, and for a couple of months dedicated\nhimself to a careful study of the Critique of Pure Reason. In\nhis Autobiography, Maimon alludes to his “rather\ncurious” methods for understanding this text:\n\nIn the first reading I reached a vague sense of each section, which\nthrough subsequent readings I then sought to make determinate, and by\nthis to penetrate the meaning of the author. This is what is properly\nmeant when one thinks oneself into a system. Since I had already used\nthis method in mastering the systems of Spinoza, D. Hume, and Leibniz,\nit was natural that I would be led to think of them as a\n‘Coalition-System.’ This I actually discovered, and by and\nby set it out in the form of notes and observations on the\nCritique of Pure Reason (GW I, 557 | LB 253).\n\n\nMaimon put his thoughts about the Critique in a letter he\nsent to Kant through a common friend, Markus Herz. Kant responded in a\nletter full of praise for Maimon, describing him as “having an\nacumen for such deep investigation that very few men have” and\nclaiming that “none of my critics understood me and the main\nquestions as well as Herr Maimon does.” (Ak. 11:48)\n\nKant’s recognition opened for Maimon the salons of Berlin as\nwell as the contemporary leading journals, in which Maimon started\npublishing. The story of the crude genius who came from the East and\npenetrated the heart of German philosophy became a common topic of\nsmall talk in these circles. In 1790, Maimon published an expanded\nversion of his comments of Kant’s first Critique as the\nVersuch über die Transcendentalphilosophie (“An\nEssay on Transcendental Philosophy”). A year later, Maimon\ncollaborated with the members of the Jewish Enlightenment and prepared\na Hebrew commentary on Maimonides’ Guide of the\nPerplexed. (The publisher decided to publish only the first part\nof this work, since he found Maimon’s commentary much too deep\nphilosophically, and thus unfitting for the political purposes of\npropagating the ideology of the enlightenment among the Jews.)\n\nDuring the early 1790s, Maimon struck a close friendship with Karl\nPhilipp Moritz (the author of the first Bildungsroman, Anton\nReiser). Maimon became a frequent contributor and later the\nco-editor of Moritz’s Magazin zur\nErfahrungsseelenkunde, which was in fact the first journal\ndedicated to the study of psychology. Following Moritz’s death\nin 1793 Maimon attempted to find a new patron. He established a\nconnection with Goethe, who invited him to Weimar, yet because of\nreasons that remain unclear, this relationship did not succeed.\nMaimon’s material life in that period was quite miserable. He\nlived in extreme poverty, and spent the little money he earned on\nalcohol — for the price of a drink one could buy his\nconversation in a tavern. In 1795, Maimon accepted a generous offer by\na young Silesian nobleman, Graf Heinrich Wilhelm Adolf Kalkreuth, and\nmoved to the latter’s estate in Siegersdorf (currently:\nKozuchow) in Lower Silesia. From this time until his death in November\n22, 1800, Maimon led a quiet, though lonely and melancholic, life on\nKalkreuth’s estate. In May 1800, Maimon wrote to Lazarus\nBendavid, one of his Jewish friends in Berlin, attempting to arrange\nhis return to Berlin — and to find financial support for that\npurpose — but this plan never materialized.\n\nIn the last decade of his life, Maimon wrote ten books, and numerous\narticles. The most important among these books (apart from the\nTranscendentalphilosophie) are his philosophical works,\nVersuch einer neuen Logik, oder Theorie des Denkens (An\nAttempt at a New Logic, or a Theory of Thinking) (1793),\nKritische Untersuchungen über den menschlichen Geist, oder\ndas höhere Erkenntniß und Willensvermögen\n(Critical Investigations on the Human Mind, or the Highest Faculty\nof Knowledge and Will) (1797), and his Lebensgeschichte\n(Autobiography) (1792/3), which is his only work which\nachieved wide public recognition.\n",
    "section_title": "1. Intellectual Biography",
    "entry_title": "Salomon Maimon",
    "hierarchy_title": "Salomon Maimon || Intellectual Biography",
    "tokenized_text": [
        "intellectual",
        "biography",
        "intellectual",
        "biography",
        "scholar",
        "wisdom",
        "rest",
        "world",
        "world",
        "come",
        "talmudic",
        "saying",
        "maimon",
        "concludes",
        "first",
        "philosophical",
        "work",
        "essay",
        "transcendental",
        "philosophy",
        "applies",
        "strikingly",
        "well",
        "life",
        "story",
        "salomon",
        "maimon",
        "maimon",
        "born",
        "suchowyborg",
        "sukowy",
        "borek",
        "village",
        "tributary",
        "nieman",
        "river",
        "next",
        "town",
        "mir",
        "mirz",
        "lithuania",
        "family",
        "originally",
        "rather",
        "wealthy",
        "fell",
        "poverty",
        "due",
        "poor",
        "management",
        "property",
        "thus",
        "maimon",
        "father",
        "became",
        "child",
        "teacher",
        "example",
        "followed",
        "later",
        "son",
        "salomon",
        "maimon",
        "received",
        "traditional",
        "religious",
        "education",
        "concentrated",
        "mainly",
        "study",
        "talmud",
        "age",
        "shortly",
        "death",
        "mother",
        "following",
        "comedy",
        "error",
        "involving",
        "mother",
        "two",
        "young",
        "girl",
        "maimon",
        "married",
        "arranged",
        "ceremony",
        "three",
        "year",
        "later",
        "first",
        "son",
        "david",
        "born",
        "early",
        "adulthood",
        "maimon",
        "developed",
        "keen",
        "curiosity",
        "science",
        "philosophy",
        "crucial",
        "influence",
        "maimonides",
        "guide",
        "perplexed",
        "maimon",
        "became",
        "acquainted",
        "aristotelian",
        "philosophy",
        "medieval",
        "cloth",
        "iconoclastic",
        "spirit",
        "maimonides",
        "philosophy",
        "religion",
        "maimon",
        "attachment",
        "maimonides",
        "personally",
        "philosophically",
        "ran",
        "throughout",
        "life",
        "even",
        "maimon",
        "name",
        "adopted",
        "expression",
        "respect",
        "towards",
        "teacher",
        "time",
        "jew",
        "adopted",
        "family",
        "name",
        "taking",
        "surname",
        "maimon",
        "maimon",
        "used",
        "called",
        "father",
        "salomon",
        "ben",
        "son",
        "joshua",
        "maimon",
        "also",
        "developed",
        "interest",
        "kabbalistic",
        "text",
        "spite",
        "relatively",
        "young",
        "age",
        "attempted",
        "study",
        "interpret",
        "according",
        "body",
        "knowledge",
        "already",
        "mastered",
        "ie",
        "maimonidean",
        "philosophy",
        "around",
        "maimon",
        "went",
        "visit",
        "court",
        "maggid",
        "preacher",
        "mezrich",
        "contemporary",
        "leader",
        "one",
        "founder",
        "hassidism",
        "maimon",
        "visit",
        "seems",
        "lasted",
        "week",
        "still",
        "clear",
        "strongly",
        "impressed",
        "new",
        "form",
        "religious",
        "life",
        "teaching",
        "selfannihilation",
        "god",
        "maimon",
        "dedicates",
        "chapter",
        "half",
        "lebensgeschichte",
        "portrayal",
        "early",
        "hassidism",
        "chapter",
        "indeed",
        "valuable",
        "external",
        "historical",
        "source",
        "emergence",
        "hassidism",
        "maimon",
        "pass",
        "negative",
        "judgment",
        "aspect",
        "hassidism",
        "still",
        "even",
        "late",
        "perspective",
        "writing",
        "s",
        "enthusiasm",
        "feature",
        "movement",
        "use",
        "improvisation",
        "expounding",
        "torah",
        "salient",
        "recent",
        "scholarship",
        "hassidism",
        "confirmed",
        "virtually",
        "teaching",
        "maimon",
        "quote",
        "name",
        "maggid",
        "disciple",
        "see",
        "melamed",
        "also",
        "remarkable",
        "story",
        "maimon",
        "visit",
        "court",
        "maggid",
        "documented",
        "hassidic",
        "source",
        "describe",
        "maimon",
        "one",
        "disciple",
        "maggid",
        "sheshana",
        "ufiresh",
        "studied",
        "reneged",
        "see",
        "hoizman",
        "maimon",
        "discussion",
        "hassidic",
        "pantheism",
        "highly",
        "sympathetic",
        "occasionally",
        "alludes",
        "similarity",
        "hassidic",
        "acosmism",
        "spinozism",
        "midtwenties",
        "hoping",
        "widen",
        "knowledge",
        "philosophy",
        "science",
        "maimon",
        "left",
        "family",
        "went",
        "berlin",
        "pretense",
        "attempting",
        "study",
        "medicine",
        "first",
        "visit",
        "berlin",
        "ended",
        "shortly",
        "grimly",
        "confided",
        "one",
        "officer",
        "jewish",
        "community",
        "purpose",
        "visit",
        "study",
        "philosophy",
        "intended",
        "publish",
        "new",
        "commentary",
        "maimonides",
        "guide",
        "perplexed",
        "maimon",
        "asked",
        "pack",
        "belonging",
        "leave",
        "shelter",
        "jewish",
        "community",
        "thus",
        "city",
        "following",
        "half",
        "year",
        "maimon",
        "spent",
        "wandering",
        "beggar",
        "eventually",
        "beggar",
        "friend",
        "decided",
        "return",
        "poland",
        "reached",
        "border",
        "town",
        "posen",
        "maimon",
        "talent",
        "erudition",
        "recognized",
        "chief",
        "rabbi",
        "town",
        "offered",
        "shelter",
        "position",
        "tutor",
        "house",
        "one",
        "city",
        "jew",
        "stay",
        "posen",
        "maimon",
        "wrote",
        "one",
        "hebrew",
        "work",
        "hesheq",
        "shelomo",
        "solomon",
        "desire",
        "see",
        "bibliography",
        "maimon",
        "went",
        "berlin",
        "journey",
        "much",
        "successful",
        "maimon",
        "established",
        "close",
        "connection",
        "moses",
        "mendelssohn",
        "entered",
        "circle",
        "haskala",
        "jewish",
        "enlightenment",
        "movement",
        "berlin",
        "yet",
        "neither",
        "berlin",
        "enlightened",
        "jew",
        "provided",
        "real",
        "home",
        "maimon",
        "cultured",
        "jew",
        "berlin",
        "maimon",
        "rude",
        "ostjude",
        "easteuropean",
        "jew",
        "spoke",
        "awful",
        "german",
        "accompanied",
        "variety",
        "wild",
        "gesticulation",
        "however",
        "acknowledge",
        "genius",
        "person",
        "could",
        "example",
        "read",
        "difficult",
        "book",
        "mathematics",
        "first",
        "time",
        "explain",
        "savage",
        "manner",
        "short",
        "later",
        "similarly",
        "maimon",
        "little",
        "appreciation",
        "fine",
        "bourgeois",
        "free",
        "barrier",
        "would",
        "impede",
        "ability",
        "study",
        "science",
        "contented",
        "shallow",
        "acquaintance",
        "civilized",
        "person",
        "know",
        "furthermore",
        "lacked",
        "sharpness",
        "mind",
        "fellow",
        "talmudists",
        "poland",
        "maimon",
        "seem",
        "genuine",
        "appreciation",
        "mendelssohn",
        "kindheartedness",
        "unlike",
        "others",
        "circle",
        "jewish",
        "enlightenment",
        "mendelssohn",
        "reasonable",
        "grasp",
        "talmud",
        "rabbinic",
        "literature",
        "mendelssohn",
        "asked",
        "maimon",
        "leave",
        "berlin",
        "due",
        "maimon",
        "open",
        "spinozism",
        "bohemian",
        "lifestyle",
        "journey",
        "hamburg",
        "amsterdam",
        "back",
        "hamburg",
        "maimon",
        "entered",
        "gymnasium",
        "christianeum",
        "altona",
        "stayed",
        "two",
        "year",
        "period",
        "maimon",
        "studied",
        "several",
        "european",
        "language",
        "improved",
        "knowledge",
        "natural",
        "science",
        "command",
        "german",
        "maimon",
        "left",
        "altona",
        "berlin",
        "met",
        "mendelssohn",
        "last",
        "time",
        "later",
        "year",
        "maimon",
        "moved",
        "dessau",
        "wrote",
        "hebrew",
        "textbook",
        "mathematics",
        "subsequently",
        "settled",
        "breslau",
        "failed",
        "attempt",
        "study",
        "medicine",
        "maimon",
        "took",
        "position",
        "tutor",
        "staying",
        "breslau",
        "maimon",
        "translated",
        "mendelssohn",
        "morgenstunden",
        "hebrew",
        "manuscript",
        "lost",
        "wrote",
        "hebrew",
        "textbook",
        "newtonian",
        "physic",
        "ta",
        "alumoth",
        "hochma",
        "mystery",
        "wisdom",
        "decade",
        "separation",
        "maimon",
        "wife",
        "sarah",
        "accompanied",
        "eldest",
        "son",
        "david",
        "succeeded",
        "locating",
        "breslau",
        "demanded",
        "either",
        "return",
        "lithuania",
        "get",
        "divorce",
        "reluctant",
        "sever",
        "tie",
        "past",
        "maimon",
        "tried",
        "postpone",
        "decision",
        "wife",
        "insisted",
        "must",
        "make",
        "choice",
        "finally",
        "agreed",
        "divorce",
        "maimon",
        "traveled",
        "berlin",
        "heard",
        "kant",
        "new",
        "philosophy",
        "couple",
        "month",
        "dedicated",
        "careful",
        "study",
        "critique",
        "pure",
        "reason",
        "autobiography",
        "maimon",
        "alludes",
        "rather",
        "curious",
        "method",
        "understanding",
        "text",
        "first",
        "reading",
        "reached",
        "vague",
        "sense",
        "section",
        "subsequent",
        "reading",
        "sought",
        "make",
        "determinate",
        "penetrate",
        "meaning",
        "author",
        "properly",
        "meant",
        "one",
        "think",
        "oneself",
        "system",
        "since",
        "already",
        "used",
        "method",
        "mastering",
        "system",
        "spinoza",
        "d",
        "hume",
        "leibniz",
        "natural",
        "would",
        "led",
        "think",
        "coalitionsystem",
        "actually",
        "discovered",
        "set",
        "form",
        "note",
        "observation",
        "critique",
        "pure",
        "reason",
        "gw",
        "lb",
        "maimon",
        "put",
        "thought",
        "critique",
        "letter",
        "sent",
        "kant",
        "common",
        "friend",
        "markus",
        "herz",
        "kant",
        "responded",
        "letter",
        "full",
        "praise",
        "maimon",
        "describing",
        "acumen",
        "deep",
        "investigation",
        "men",
        "claiming",
        "none",
        "critic",
        "understood",
        "main",
        "question",
        "well",
        "herr",
        "maimon",
        "does",
        "ak",
        "kant",
        "recognition",
        "opened",
        "maimon",
        "salon",
        "berlin",
        "well",
        "contemporary",
        "leading",
        "journal",
        "maimon",
        "started",
        "publishing",
        "story",
        "crude",
        "genius",
        "came",
        "east",
        "penetrated",
        "heart",
        "german",
        "philosophy",
        "became",
        "common",
        "topic",
        "small",
        "talk",
        "circle",
        "maimon",
        "published",
        "expanded",
        "version",
        "comment",
        "kant",
        "first",
        "critique",
        "versuch",
        "über",
        "die",
        "transcendentalphilosophie",
        "essay",
        "transcendental",
        "philosophy",
        "year",
        "later",
        "maimon",
        "collaborated",
        "member",
        "jewish",
        "enlightenment",
        "prepared",
        "hebrew",
        "commentary",
        "maimonides",
        "guide",
        "perplexed",
        "publisher",
        "decided",
        "publish",
        "first",
        "part",
        "work",
        "since",
        "found",
        "maimon",
        "commentary",
        "much",
        "deep",
        "philosophically",
        "thus",
        "unfitting",
        "political",
        "purpose",
        "propagating",
        "ideology",
        "enlightenment",
        "among",
        "jew",
        "early",
        "s",
        "maimon",
        "struck",
        "close",
        "friendship",
        "karl",
        "philipp",
        "moritz",
        "author",
        "first",
        "bildungsroman",
        "anton",
        "reiser",
        "maimon",
        "became",
        "frequent",
        "contributor",
        "later",
        "coeditor",
        "moritz",
        "magazin",
        "zur",
        "erfahrungsseelenkunde",
        "fact",
        "first",
        "journal",
        "dedicated",
        "study",
        "psychology",
        "following",
        "moritz",
        "death",
        "maimon",
        "attempted",
        "find",
        "new",
        "patron",
        "established",
        "connection",
        "goethe",
        "invited",
        "weimar",
        "yet",
        "reason",
        "remain",
        "unclear",
        "relationship",
        "succeed",
        "maimon",
        "material",
        "life",
        "period",
        "quite",
        "miserable",
        "lived",
        "extreme",
        "poverty",
        "spent",
        "little",
        "money",
        "earned",
        "alcohol",
        "price",
        "drink",
        "one",
        "could",
        "buy",
        "conversation",
        "tavern",
        "maimon",
        "accepted",
        "generous",
        "offer",
        "young",
        "silesian",
        "nobleman",
        "graf",
        "heinrich",
        "wilhelm",
        "adolf",
        "kalkreuth",
        "moved",
        "latter",
        "estate",
        "siegersdorf",
        "currently",
        "kozuchow",
        "lower",
        "silesia",
        "time",
        "death",
        "november",
        "maimon",
        "led",
        "quiet",
        "though",
        "lonely",
        "melancholic",
        "life",
        "kalkreuth",
        "estate",
        "may",
        "maimon",
        "wrote",
        "lazarus",
        "bendavid",
        "one",
        "jewish",
        "friend",
        "berlin",
        "attempting",
        "arrange",
        "return",
        "berlin",
        "find",
        "financial",
        "support",
        "purpose",
        "plan",
        "never",
        "materialized",
        "last",
        "decade",
        "life",
        "maimon",
        "wrote",
        "ten",
        "book",
        "numerous",
        "article",
        "important",
        "among",
        "book",
        "apart",
        "transcendentalphilosophie",
        "philosophical",
        "work",
        "versuch",
        "einer",
        "neuen",
        "logik",
        "oder",
        "theorie",
        "de",
        "denkens",
        "attempt",
        "new",
        "logic",
        "theory",
        "thinking",
        "kritische",
        "untersuchungen",
        "über",
        "den",
        "menschlichen",
        "geist",
        "oder",
        "da",
        "höhere",
        "erkenntniß",
        "und",
        "willensvermögen",
        "critical",
        "investigation",
        "human",
        "mind",
        "highest",
        "faculty",
        "knowledge",
        "lebensgeschichte",
        "autobiography",
        "work",
        "achieved",
        "wide",
        "public",
        "recognition"
    ]
}