{
    "main_text": "The Nature and Scope of the Doctrine\n1. The Nature and Scope of the Doctrine\n\nThe doctrine of Vision in God is easily misunderstood. It is not the\nview that we see God’s essence – that vision in\nGod is vision of God – though Malebranche’s chief\ncritic, the Cartesian Antoine Arnauld, charged that it was. It is also\nnot the view that corporeal objects, such as olive trees and Old\nEnglish sheepdogs, reside in God, or that God himself is corporeal.\nThe former would make Malebranche an idealist or an immaterialist, the\nlatter a Spinozist, but he rejects all such epithets.\n\nTo appreciate Malebranche’s epistemological theory, one must\nremember that he was an orthodox Cartesian dualist and an orthodox\nChristian. Like Descartes, he maintained that there are two kinds of\ncreated substance – minds and bodies – and that the\nessence of bodies is extension (or spatial dimension). God, in turn,\nis an infinite, all-perfect, spiritual being. On this traditional\nChristian conception, it would be heresy to identify God with his\ncreatures, to suppose that God was extended, or to pretend to fathom\nGod’s essence. Concerning the latter, Malebranche stressed that\nwe don’t see God as he is in himself, for God’s essence is\nperfectly simple, and by his grace we see only the diversity of\nparticular beings. God’s simplicity also entails that he is not\nextended:\n\n\nGod’s essence is his own absolute being, and minds do not see\nthe divine substance taken absolutely but only as relative to\ncreatures and to the degree that they can participate in it. What they\nsee in God is very imperfect, whereas God is most perfect. They see\nmatter that is shaped, divisible, and so on, but there is nothing\ndivisible or shaped in God, for God is all being, since he is infinite\nand comprehends everything; but he is no being in particular. Yet what\nwe see is but one or more particular beings, and we do not understand\nthis perfect simplicity of God, which includes all beings.\n(Search 3.2.6, OC 1:439; LO 231)\n\n\nHere Malebranche underscores another feature of God: the divine\nsubstance is not any particular being but ‘all being’ or\nwhat he elsewhere calls ‘being in general.’ We can see\nmaterial beings in God precisely because he is indeterminate; in\nseeing creatures we are seeing how they determinately\n‘participate in’ or ‘imitate’ his\nperfections.\n\nIn conceiving God as ‘being in general’ Malebranche\nborrows much from the thirteenth-century scholastic thinker St. Thomas\nAquinas. Aquinas also conceives God as simple and indeterminate, and\nthinks it follows from this that we, with our finite minds, cannot\nfathom God’s essence, and so must know him through his effects.\nMalebranche qualifies this last point somewhat by saying that we know\nGod through his possible (material) effects, that is,\nrelative to what he can produce. Indeed, Malebranche holds\nthat in God we see an infinity of possible worlds:\n\n\nWhen you contemplate … extension, you still see only the\narchetype both of the material world in which we live, and of an\ninfinity of other possible worlds. You are then actually seeing the\ndivine substance, for that alone is visible or capable of enlightening\nthe mind. But you do not see it in itself or as it really is. You see\nit only in its relation to material creatures, only as it is\nparticipable by or representative of them. Consequently, it is not\nstrictly speaking God whom you see, but only the matter he can produce.\n(Dialogue 2, OC 12:51; JS 21)\n\n\nAs we have seen, there are no particular beings in God, for God is\nsimple and general. But still Malebranche will insist that we\nsee material objects in God. How is this possible? The answer\nto this question involves another aspect of his doctrine not yet\nbroached – the theory of ideas. Malebranche defends a\nrepresentational theory of ideas, which holds that we don’t see\nmaterial objects directly but only via the ideas that represent them.\nOn his version of this theory, material objects are unintelligible in\nthemselves and can be known only via something spiritual and\nimmediately present to the mind. Malebranche was not alone in the\nseventeenth-century in endorsing representationalism; in fact, it is\noften thought that he inherited this position from Descartes. Where\nthey clearly differ is in the ontological status they accord to ideas.\nDescartes develops a ‘Christianized’ version of the\nPlatonic theory of innate ideas, according to which ideas are created\nwith us at birth and constitute the very structure of our mind.\nMalebranche, in contrast, vehemently denies that ideas are created or\nthat they are modifications of finite minds, and instead regards them\nas eternal, necessary, and immutable realities that reside in God. To\nsay, then, that we perceive material things in God means that we\nimmediately perceive ideas in God, and via these ideas, we\nindirectly perceive corporeal objects. Ideas in God are the\n‘archetypes’ or models that he uses to create things.\nThus, we can be assured that our knowledge of material things is of\nthe highest order.\n\nAs already noted, Malebranche restricts the doctrine of Vision in God\nto our sensory perception of material objects and their properties and\nto the abstract thought of mathematical essences. It does not\nencompass knowledge of God’s essence, for as we have seen he\nthinks we know God only indirectly, by way of the material things that\nhe can create. But what about our knowledge of other things,\nespecially the self or the mind, or other minds? Why is that sort of\nknowledge excluded from the doctrine, especially since as a faithful\nCartesian dualist he maintains that there are both bodies and\nminds?\n\nGiven his theory of divine archetypes for creation, Malebranche must\nallow that there is an idea of the mind in God, but he does not think\nGod gives us access to this idea. We lack, therefore, what Descartes\nwould call a clear and distinct idea of the mind. And since ideas for\nMalebranche are the essences or natures of things, he denies that we\nhave knowledge of the mind’s essence. To be sure, he endorses\nDescartes’ cogito, or the claim that one knows\none’s own existence. But here Malebranche distinguishes two\nkinds of knowledge (connoître) – knowledge through\nideas as afforded by Vision in God and knowledge through consciousness\n– the latter being inferior. I have knowledge through\nconsciousness of the existence of my mind and its modifications, which\nis just to say that I know them by an inner awareness (sentiment\nintérieur) that attends all of my thoughts, beliefs,\nsensations, passions, etc. But this awareness is limited to their bare\nexistence and fails to reveal their underlying nature. Indeed,\nalthough sensations and other such modifications of the mind are\ntypically strong and lively in their affects, they are ‘confused\nmodalities … full of darkness’ (Dialogue 3, OC 12:65; JS\n33). Malebranche’s negative view of knowledge of the mind is the\nnatural complement to his theory of Vision in God. Following\nAugustine, Malebranche often stresses that the human mind is not a\nlight unto itself, and that God (or what he sometimes calls\n‘universal Reason’) is the only true light, that is, the\nonly source of truth and knowledge: ‘Man is not a light unto\nhimself. His substance, far from enlightening him, is itself\nunintelligible to him. He knows nothing except by the light of\nuniversal Reason which enlightens all minds, by the intelligible ideas\nwhich it discloses to them in its entirely luminous substance’\n(Dialogue 3, OC 12:64; JS 32). The human mind is so utterly devoid of\ncognitive resources, and thus so completely dependent on God, that it\ncannot even know its own nature (for Malebranche on self-knowledge,\nsee Jolley 2000, Nolan and Whipple 2005, and Schmaltz 1996).\n\nMalebranche thinks that knowledge of other minds is even more\nimpoverished (if this seems possible), for here we must rely on\nconjecture. Other minds are not immediately present to us in the way\nthat our own mind and its modifications are, and so they cannot even\nbe known by consciousness. Instead, we must conjecture, on the basis\nof our sensory perception of the behavior of bodies similar to our\nown, that they are united to minds and that these minds are affected\nwith the same sorts of sensations and passions as ours. Such\nknowledge, however, is ‘very liable to error’\n(Search 3.2.7, OC 1:455; LO 239). One might wonder why\nMalebranche calls this ‘knowledge’ (la\nconnoissance) at all, and not ‘opinion’ or\n‘belief,’ in keeping with the philosophical tradition. The\nsimple answer is that he is using the term broadly here to refer to\ndifferent forms of cognition – i.e., ways of perceiving\n(manières de voir) God, bodies, the self, and other\nminds.\n",
    "section_title": "1. The Nature and Scope of the Doctrine",
    "entry_title": "Malebranche’s Theory of Ideas and Vision in God",
    "hierarchy_title": "Malebranche’s Theory of Ideas and Vision in God || The Nature and Scope of the Doctrine",
    "tokenized_text": [
        "nature",
        "scope",
        "doctrine",
        "nature",
        "scope",
        "doctrine",
        "doctrine",
        "vision",
        "god",
        "easily",
        "misunderstood",
        "view",
        "see",
        "god",
        "essence",
        "vision",
        "god",
        "vision",
        "god",
        "though",
        "malebranche",
        "chief",
        "critic",
        "cartesian",
        "antoine",
        "arnauld",
        "charged",
        "also",
        "view",
        "corporeal",
        "object",
        "olive",
        "tree",
        "old",
        "english",
        "sheepdog",
        "reside",
        "god",
        "god",
        "corporeal",
        "former",
        "would",
        "make",
        "malebranche",
        "idealist",
        "immaterialist",
        "latter",
        "spinozist",
        "reject",
        "epithet",
        "appreciate",
        "malebranche",
        "epistemological",
        "theory",
        "one",
        "must",
        "remember",
        "orthodox",
        "cartesian",
        "dualist",
        "orthodox",
        "christian",
        "like",
        "descartes",
        "maintained",
        "two",
        "kind",
        "created",
        "substance",
        "mind",
        "body",
        "essence",
        "body",
        "extension",
        "spatial",
        "dimension",
        "god",
        "turn",
        "infinite",
        "allperfect",
        "spiritual",
        "traditional",
        "christian",
        "conception",
        "would",
        "heresy",
        "identify",
        "god",
        "creature",
        "suppose",
        "god",
        "extended",
        "pretend",
        "fathom",
        "god",
        "essence",
        "concerning",
        "latter",
        "malebranche",
        "stressed",
        "see",
        "god",
        "god",
        "essence",
        "perfectly",
        "simple",
        "grace",
        "see",
        "diversity",
        "particular",
        "being",
        "god",
        "simplicity",
        "also",
        "entail",
        "extended",
        "god",
        "essence",
        "absolute",
        "mind",
        "see",
        "divine",
        "substance",
        "taken",
        "absolutely",
        "relative",
        "creature",
        "degree",
        "participate",
        "see",
        "god",
        "imperfect",
        "whereas",
        "god",
        "perfect",
        "see",
        "matter",
        "shaped",
        "divisible",
        "nothing",
        "divisible",
        "shaped",
        "god",
        "god",
        "since",
        "infinite",
        "comprehends",
        "everything",
        "particular",
        "yet",
        "see",
        "one",
        "particular",
        "being",
        "understand",
        "perfect",
        "simplicity",
        "god",
        "includes",
        "being",
        "search",
        "oc",
        "lo",
        "malebranche",
        "underscore",
        "another",
        "feature",
        "god",
        "divine",
        "substance",
        "particular",
        "elsewhere",
        "call",
        "general",
        "see",
        "material",
        "being",
        "god",
        "precisely",
        "indeterminate",
        "seeing",
        "creature",
        "seeing",
        "determinately",
        "participate",
        "imitate",
        "perfection",
        "conceiving",
        "god",
        "general",
        "malebranche",
        "borrows",
        "much",
        "thirteenthcentury",
        "scholastic",
        "thinker",
        "st",
        "thomas",
        "aquinas",
        "aquinas",
        "also",
        "conceives",
        "god",
        "simple",
        "indeterminate",
        "think",
        "follows",
        "finite",
        "mind",
        "fathom",
        "god",
        "essence",
        "must",
        "know",
        "effect",
        "malebranche",
        "qualifies",
        "last",
        "point",
        "somewhat",
        "saying",
        "know",
        "god",
        "possible",
        "material",
        "effect",
        "relative",
        "produce",
        "indeed",
        "malebranche",
        "hold",
        "god",
        "see",
        "infinity",
        "possible",
        "world",
        "contemplate",
        "extension",
        "still",
        "see",
        "archetype",
        "material",
        "world",
        "live",
        "infinity",
        "possible",
        "world",
        "actually",
        "seeing",
        "divine",
        "substance",
        "alone",
        "visible",
        "capable",
        "enlightening",
        "mind",
        "see",
        "really",
        "see",
        "relation",
        "material",
        "creature",
        "participable",
        "representative",
        "consequently",
        "strictly",
        "speaking",
        "god",
        "see",
        "matter",
        "produce",
        "dialogue",
        "oc",
        "j",
        "seen",
        "particular",
        "being",
        "god",
        "god",
        "simple",
        "general",
        "still",
        "malebranche",
        "insist",
        "see",
        "material",
        "object",
        "god",
        "possible",
        "answer",
        "question",
        "involves",
        "another",
        "aspect",
        "doctrine",
        "yet",
        "broached",
        "theory",
        "idea",
        "malebranche",
        "defends",
        "representational",
        "theory",
        "idea",
        "hold",
        "see",
        "material",
        "object",
        "directly",
        "via",
        "idea",
        "represent",
        "version",
        "theory",
        "material",
        "object",
        "unintelligible",
        "known",
        "via",
        "something",
        "spiritual",
        "immediately",
        "present",
        "mind",
        "malebranche",
        "alone",
        "seventeenthcentury",
        "endorsing",
        "representationalism",
        "fact",
        "often",
        "thought",
        "inherited",
        "position",
        "descartes",
        "clearly",
        "differ",
        "ontological",
        "status",
        "accord",
        "idea",
        "descartes",
        "develops",
        "christianized",
        "version",
        "platonic",
        "theory",
        "innate",
        "idea",
        "according",
        "idea",
        "created",
        "u",
        "birth",
        "constitute",
        "structure",
        "mind",
        "malebranche",
        "contrast",
        "vehemently",
        "denies",
        "idea",
        "created",
        "modification",
        "finite",
        "mind",
        "instead",
        "regard",
        "eternal",
        "necessary",
        "immutable",
        "reality",
        "reside",
        "god",
        "say",
        "perceive",
        "material",
        "thing",
        "god",
        "mean",
        "immediately",
        "perceive",
        "idea",
        "god",
        "via",
        "idea",
        "indirectly",
        "perceive",
        "corporeal",
        "object",
        "idea",
        "god",
        "archetype",
        "model",
        "us",
        "create",
        "thing",
        "thus",
        "assured",
        "knowledge",
        "material",
        "thing",
        "highest",
        "order",
        "already",
        "noted",
        "malebranche",
        "restricts",
        "doctrine",
        "vision",
        "god",
        "sensory",
        "perception",
        "material",
        "object",
        "property",
        "abstract",
        "thought",
        "mathematical",
        "essence",
        "encompass",
        "knowledge",
        "god",
        "essence",
        "seen",
        "think",
        "know",
        "god",
        "indirectly",
        "way",
        "material",
        "thing",
        "create",
        "knowledge",
        "thing",
        "especially",
        "self",
        "mind",
        "mind",
        "sort",
        "knowledge",
        "excluded",
        "doctrine",
        "especially",
        "since",
        "faithful",
        "cartesian",
        "dualist",
        "maintains",
        "body",
        "mind",
        "given",
        "theory",
        "divine",
        "archetype",
        "creation",
        "malebranche",
        "must",
        "allow",
        "idea",
        "mind",
        "god",
        "think",
        "god",
        "give",
        "u",
        "access",
        "idea",
        "lack",
        "therefore",
        "descartes",
        "would",
        "call",
        "clear",
        "distinct",
        "idea",
        "mind",
        "since",
        "idea",
        "malebranche",
        "essence",
        "nature",
        "thing",
        "denies",
        "knowledge",
        "mind",
        "essence",
        "sure",
        "endorses",
        "descartes",
        "cogito",
        "claim",
        "one",
        "know",
        "one",
        "existence",
        "malebranche",
        "distinguishes",
        "two",
        "kind",
        "knowledge",
        "connoître",
        "knowledge",
        "idea",
        "afforded",
        "vision",
        "god",
        "knowledge",
        "consciousness",
        "latter",
        "inferior",
        "knowledge",
        "consciousness",
        "existence",
        "mind",
        "modification",
        "say",
        "know",
        "inner",
        "awareness",
        "sentiment",
        "intérieur",
        "attends",
        "thought",
        "belief",
        "sensation",
        "passion",
        "etc",
        "awareness",
        "limited",
        "bare",
        "existence",
        "fails",
        "reveal",
        "underlying",
        "nature",
        "indeed",
        "although",
        "sensation",
        "modification",
        "mind",
        "typically",
        "strong",
        "lively",
        "affect",
        "confused",
        "modality",
        "full",
        "darkness",
        "dialogue",
        "oc",
        "j",
        "malebranche",
        "negative",
        "view",
        "knowledge",
        "mind",
        "natural",
        "complement",
        "theory",
        "vision",
        "god",
        "following",
        "augustine",
        "malebranche",
        "often",
        "stress",
        "human",
        "mind",
        "light",
        "unto",
        "god",
        "sometimes",
        "call",
        "universal",
        "reason",
        "true",
        "light",
        "source",
        "truth",
        "knowledge",
        "man",
        "light",
        "unto",
        "substance",
        "far",
        "enlightening",
        "unintelligible",
        "know",
        "nothing",
        "except",
        "light",
        "universal",
        "reason",
        "enlightens",
        "mind",
        "intelligible",
        "idea",
        "discloses",
        "entirely",
        "luminous",
        "substance",
        "dialogue",
        "oc",
        "j",
        "human",
        "mind",
        "utterly",
        "devoid",
        "cognitive",
        "resource",
        "thus",
        "completely",
        "dependent",
        "god",
        "even",
        "know",
        "nature",
        "malebranche",
        "selfknowledge",
        "see",
        "jolley",
        "nolan",
        "whipple",
        "schmaltz",
        "malebranche",
        "think",
        "knowledge",
        "mind",
        "even",
        "impoverished",
        "seems",
        "possible",
        "must",
        "rely",
        "conjecture",
        "mind",
        "immediately",
        "present",
        "u",
        "way",
        "mind",
        "modification",
        "even",
        "known",
        "consciousness",
        "instead",
        "must",
        "conjecture",
        "basis",
        "sensory",
        "perception",
        "behavior",
        "body",
        "similar",
        "united",
        "mind",
        "mind",
        "affected",
        "sort",
        "sensation",
        "passion",
        "knowledge",
        "however",
        "liable",
        "error",
        "search",
        "oc",
        "lo",
        "one",
        "might",
        "wonder",
        "malebranche",
        "call",
        "knowledge",
        "la",
        "connoissance",
        "opinion",
        "belief",
        "keeping",
        "philosophical",
        "tradition",
        "simple",
        "answer",
        "using",
        "term",
        "broadly",
        "refer",
        "different",
        "form",
        "cognition",
        "ie",
        "way",
        "perceiving",
        "manières",
        "de",
        "voir",
        "god",
        "body",
        "self",
        "mind"
    ]
}