{
    "main_text": "Occasionalism\n4. Occasionalism\n\nMalebranche is known for his occasionalism, that is, his doctrine that\nGod is the only causal agent, and that creatures merely provide the\n“occasion” for divine action. On the old textbook account,\noccasionalism was an ad hoc response to the purported problem\nin Descartes of how substances as distinct in nature as mind and body\nare can causally interact (see, for instance, Copleston 1958, 176, and\nKeeling 1968, 224). According to this account, Malebranche was driven\nby this problem with Cartesian dualism to propose that it is God who\nbrings it about that our sensations and volitions are correlated with\nmotions in our body.\n\nHowever, occasionalism was already an old doctrine at the time that\nThomas Aquinas (1225–1274) wrote against it. (There is a helpful\nsurvey, in German, of the earlier history of occasionalism in Perler\nand Rudolph 2000.) Thomas indicated that the primary concern of the\noccasionalists was to strengthen the assertion of God’s\nomnipotence. Though he allowed that God must “concur” with\ncreatures in producing effects, Thomas also claimed that there is\nreason to conclude that creatures are true secondary causes. For\ninstance, he urged that it is more in accord with divine greatness to\nsay that God communicates His power to creatures. Moreover, he claimed\nthat it is simply evident to the senses that creatures have the power\nto bring about effects. Thomas also argued that if there were no\nnatures in creatures that explain effects, there could be no true\nscientific explanation of effects through their natural causes.\n\nMalebranche was concerned to respond to all of these arguments against\noccasionalism, particularly as they were developed in the work of\nscholastics such as Suárez. Against the first point that\nGod’s greatness requires the communication of His power, he\ncountered that it is in fact idolatrous to attribute divine power to\ncreatures. Malebranche’s argument that God alone can produce\neffects relies on the assumption that “a true cause … is\none such that the mind perceives a necessary connection [liaison\nnécessaire] between it and its effects” (Malebranche\n[OC], 2:316). He claims that there is such a connection neither among\nbodily states, nor between bodily and mental states, nor among mental\nstates. In all of these cases, one can deny the connections without\ncontradiction. There can be a necessary causal connection in only one\ncase, namely, the connection between the volitions of an omnipotent\nagent and its upshots. Thus, only such an agent, namely, God, can be a\ntrue cause. (For different interpretations of this argument, cf. Lee\n2008 and Ott 2008).\n\nIn the Entretiens sur la métaphysique, Malebranche\noffers a different argument based on Descartes’s suggestion in\n“Meditation III” that God conserves the world by\ncontinuously creating it. The argument begins with the claim that God\nmust create bodies in some particular place and in determinate\nrelations of distance to other bodies. If God conserves a body by\ncreating it in the same place from moment to moment, that body remains\nat rest, and if he conserves it by creating it in different places\nfrom moment to moment, it is in motion. We cannot even create motion\nin our own bodies. Rather, it is God who must produce it on the\noccasion of volitional states. Moreover, it is not motions in our\nbrain that cause our sensory states, but God who produces them on the\noccasion of the presence of such motions. Finally, I have indicated\nthe view in the Entretiens that God produces our intellectual\nstates through the union of our mind with His “intelligible\nextension.” While the argument from the necessity of the causal\nconnection yields the result that only an omnipotent being can be a\ncause, the argument here is that only that being which\ncreates/conserves the world can cause various bodily and mental\nstates. However, both arguments converge on the conclusion, which\nMalebranche claims to find in Augustine, that all creatures depend\nentirely on God. (For further discussion of Malebranche’s\nvarious arguments for occasionalism, see Lee 2007 and Lee 2008.)\n\nThe second scholastic argument against occasionalism appeals to the\npurported fact that it is evident to the senses that creatures have\ncausal power. For Malebranche, however, this argument is no more\npersuasive than the argument that bodies must have colors and tastes\nsince our senses tell us that they do. As indicated above, Malebranche\noffers Cartesian grounds for thinking that the purpose of our\nsensations is not to reveal the true nature of the material world, but\nrather to indicate what is helpful or harmful to our body. Malebranche\nheld that our attribution of causal powers to bodies manifests in\nparticular an attachment to the body that is an effect of original\nsin. Due to this attachment, we take objects in the material world to\nbe a cause of our happiness rather than God.\n\nIn “Eclaircissement XV,” Malebranche responds to the\nscholastic point that occasionalism renders scientific explanation\nimpossible by appealing to the fact that God is not an arbitrary\nagent, but acts in accord with His wisdom. This wisdom dictates that\nHe act “almost always” by means of a “general and\nefficacious will.” Such a will produces effects that are\nperfectly law-like. For instance, God acts by a general will in\nproducing changes in bodies in accord with the law of the\ncommunication of motion. Malebranche did allow that God can produce\nmiracles by “particular volitions” that are not law-like.\nHowever, he emphasizes that there are relatively few such volitions in\nGod. Thus, we can offer scientific explanations that appeal to the\nlaws of motion that reflect the nature of God’s general\nwill.\n\nThe appeal to God’s general will is relevant to a non-scholastic\nobjection to Malebranche’s occasionalism from his contemporary\nGottfried Wilhelm Leibniz (1646–1716). In his Système\nnouveau (1695), Leibniz agrees with Malebranche that “in\nmetaphysical rigor” created substances cannot be said to\ninteract, but he rejects Malebranche’s appeal to God to explain\nthis apparent interaction on the grounds that such an appeal invokes a\nDeus ex machina and thus involves a “recourse to a\nmiracle” (Leibniz 1997, 17). In the entry on Rorarius in the\nfirst edition of his Dictionnaire historique et critique\n(1697), Pierre Bayle (1647–1706) protests on Malebranche’s\nbehalf that since God produces the interactions between mind and body\n“only according to general laws, in doing so he never acts\nextraordinarily” (Leibniz 1997, 74). In a 1698 letter to Bayle,\nLeibniz responds that the mere fact that Malebranche takes God to act\nin nature according to general laws does not suffice to show that his\noccasionalism does not involve an appeal to a perpetual miracle.\nLeibniz explains that insofar as a miracle derives from\n“something which exceeds the power of created things,”\nanything that God produces directly without any causal contribution\nfrom created natures counts as miraculous (Leibniz 1997, 82). \n\nA further objection to Malebranche’s occasionalism from one of\nhis contemporaries is found in the work of Bernard le Bovier de\nFontenelle (1657–1757), the eventual perpetual secretary of the\nParis Académie des Sciences. In his 1686 Doutes sur le\nsystème physique des causes occasionelles, Fontenelle\nargues that Malebranche’s mechanistic physics is incompatible\nwith his occasionalism. This is so because according to mechanism,\nbodily collision necessitates change in motion. But then bodily\ncollision satisfies Malebranche’s main requirement for being a\ntrue cause insofar as it has a necessary connection to its effect;\nthus the conflict with occasionalism. In his 1688 Entretien sur la\nmétaphysique, Malebranche offers the response that the\nlaws governing the bodily effects of collision derive from God’s\nwill rather than from the nature of bodies (Malebranche [OC], 12:164).\nFor different assessments of this response to Fontenelle, cf. Downing\n(2005) and Schmaltz (2008).\n\nMalebranche was not the first Cartesian to endorse occasionalism.\nThere were followers of Descartes such as Louis de la Forge\n(1632–1666) and Claude Clerselier (1614–1684) who stressed\nthat God must be the cause of the communication of motion in bodily\ncollisions given the passivity of Cartesian matter. Clerselier in\nparticular attempted to preserve some room for the action of finite\nminds on bodies, but the Cartesian Geraud de Cordemoy\n(1626–1684) went further in claiming that only God can cause\nchanges in the material world. However, none of these thinkers went as\nfar as Malebranche in arguing explicitly that God must produce all\nreal changes in nature. Moreover, Malebranche is distinctive in\nproviding an explanation of God’s action that distinguishes His\ngeneral will from His particular volitions. For a recent discussion of\nissues connected to Malebranche’s notion of particular\nvolitions, see Walsh and Stencil (2016).\n",
    "section_title": "4. Occasionalism",
    "entry_title": "Nicolas Malebranche",
    "hierarchy_title": "Nicolas Malebranche || Occasionalism",
    "tokenized_text": [
        "occasionalism",
        "occasionalism",
        "malebranche",
        "known",
        "occasionalism",
        "doctrine",
        "god",
        "causal",
        "agent",
        "creature",
        "merely",
        "provide",
        "occasion",
        "divine",
        "action",
        "old",
        "textbook",
        "account",
        "occasionalism",
        "ad",
        "hoc",
        "response",
        "purported",
        "problem",
        "descartes",
        "substance",
        "distinct",
        "nature",
        "mind",
        "body",
        "causally",
        "interact",
        "see",
        "instance",
        "copleston",
        "keeling",
        "according",
        "account",
        "malebranche",
        "driven",
        "problem",
        "cartesian",
        "dualism",
        "propose",
        "god",
        "brings",
        "sensation",
        "volition",
        "correlated",
        "motion",
        "body",
        "however",
        "occasionalism",
        "already",
        "old",
        "doctrine",
        "time",
        "thomas",
        "aquinas",
        "wrote",
        "helpful",
        "survey",
        "german",
        "earlier",
        "history",
        "occasionalism",
        "perler",
        "rudolph",
        "thomas",
        "indicated",
        "primary",
        "concern",
        "occasionalists",
        "strengthen",
        "assertion",
        "god",
        "omnipotence",
        "though",
        "allowed",
        "god",
        "must",
        "concur",
        "creature",
        "producing",
        "effect",
        "thomas",
        "also",
        "claimed",
        "reason",
        "conclude",
        "creature",
        "true",
        "secondary",
        "cause",
        "instance",
        "urged",
        "accord",
        "divine",
        "greatness",
        "say",
        "god",
        "communicates",
        "power",
        "creature",
        "moreover",
        "claimed",
        "simply",
        "evident",
        "sens",
        "creature",
        "power",
        "bring",
        "effect",
        "thomas",
        "also",
        "argued",
        "nature",
        "creature",
        "explain",
        "effect",
        "could",
        "true",
        "scientific",
        "explanation",
        "effect",
        "natural",
        "cause",
        "malebranche",
        "concerned",
        "respond",
        "argument",
        "occasionalism",
        "particularly",
        "developed",
        "work",
        "scholastic",
        "suárez",
        "first",
        "point",
        "god",
        "greatness",
        "requires",
        "communication",
        "power",
        "countered",
        "fact",
        "idolatrous",
        "attribute",
        "divine",
        "power",
        "creature",
        "malebranche",
        "argument",
        "god",
        "alone",
        "produce",
        "effect",
        "relies",
        "assumption",
        "true",
        "cause",
        "one",
        "mind",
        "perceives",
        "necessary",
        "connection",
        "liaison",
        "nécessaire",
        "effect",
        "malebranche",
        "oc",
        "claim",
        "connection",
        "neither",
        "among",
        "bodily",
        "state",
        "bodily",
        "mental",
        "state",
        "among",
        "mental",
        "state",
        "case",
        "one",
        "deny",
        "connection",
        "without",
        "contradiction",
        "necessary",
        "causal",
        "connection",
        "one",
        "case",
        "namely",
        "connection",
        "volition",
        "omnipotent",
        "agent",
        "upshot",
        "thus",
        "agent",
        "namely",
        "god",
        "true",
        "cause",
        "different",
        "interpretation",
        "argument",
        "cf",
        "lee",
        "ott",
        "entretiens",
        "sur",
        "la",
        "métaphysique",
        "malebranche",
        "offer",
        "different",
        "argument",
        "based",
        "descartes",
        "suggestion",
        "meditation",
        "iii",
        "god",
        "conserve",
        "world",
        "continuously",
        "creating",
        "argument",
        "begin",
        "claim",
        "god",
        "must",
        "create",
        "body",
        "particular",
        "place",
        "determinate",
        "relation",
        "distance",
        "body",
        "god",
        "conserve",
        "body",
        "creating",
        "place",
        "moment",
        "moment",
        "body",
        "remains",
        "rest",
        "conserve",
        "creating",
        "different",
        "place",
        "moment",
        "moment",
        "motion",
        "even",
        "create",
        "motion",
        "body",
        "rather",
        "god",
        "must",
        "produce",
        "occasion",
        "volitional",
        "state",
        "moreover",
        "motion",
        "brain",
        "cause",
        "sensory",
        "state",
        "god",
        "produce",
        "occasion",
        "presence",
        "motion",
        "finally",
        "indicated",
        "view",
        "entretiens",
        "god",
        "produce",
        "intellectual",
        "state",
        "union",
        "mind",
        "intelligible",
        "extension",
        "argument",
        "necessity",
        "causal",
        "connection",
        "yield",
        "result",
        "omnipotent",
        "cause",
        "argument",
        "createsconserves",
        "world",
        "cause",
        "various",
        "bodily",
        "mental",
        "state",
        "however",
        "argument",
        "converge",
        "conclusion",
        "malebranche",
        "claim",
        "find",
        "augustine",
        "creature",
        "depend",
        "entirely",
        "god",
        "discussion",
        "malebranche",
        "various",
        "argument",
        "occasionalism",
        "see",
        "lee",
        "lee",
        "second",
        "scholastic",
        "argument",
        "occasionalism",
        "appeal",
        "purported",
        "fact",
        "evident",
        "sens",
        "creature",
        "causal",
        "power",
        "malebranche",
        "however",
        "argument",
        "persuasive",
        "argument",
        "body",
        "must",
        "color",
        "taste",
        "since",
        "sens",
        "tell",
        "u",
        "indicated",
        "malebranche",
        "offer",
        "cartesian",
        "ground",
        "thinking",
        "purpose",
        "sensation",
        "reveal",
        "true",
        "nature",
        "material",
        "world",
        "rather",
        "indicate",
        "helpful",
        "harmful",
        "body",
        "malebranche",
        "held",
        "attribution",
        "causal",
        "power",
        "body",
        "manifest",
        "particular",
        "attachment",
        "body",
        "effect",
        "original",
        "sin",
        "due",
        "attachment",
        "take",
        "object",
        "material",
        "world",
        "cause",
        "happiness",
        "rather",
        "god",
        "eclaircissement",
        "xv",
        "malebranche",
        "responds",
        "scholastic",
        "point",
        "occasionalism",
        "render",
        "scientific",
        "explanation",
        "impossible",
        "appealing",
        "fact",
        "god",
        "arbitrary",
        "agent",
        "act",
        "accord",
        "wisdom",
        "wisdom",
        "dictate",
        "act",
        "almost",
        "always",
        "mean",
        "general",
        "efficacious",
        "will",
        "produce",
        "effect",
        "perfectly",
        "lawlike",
        "instance",
        "god",
        "act",
        "general",
        "producing",
        "change",
        "body",
        "accord",
        "law",
        "communication",
        "motion",
        "malebranche",
        "allow",
        "god",
        "produce",
        "miracle",
        "particular",
        "volition",
        "lawlike",
        "however",
        "emphasizes",
        "relatively",
        "volition",
        "god",
        "thus",
        "offer",
        "scientific",
        "explanation",
        "appeal",
        "law",
        "motion",
        "reflect",
        "nature",
        "god",
        "general",
        "appeal",
        "god",
        "general",
        "relevant",
        "nonscholastic",
        "objection",
        "malebranche",
        "occasionalism",
        "contemporary",
        "gottfried",
        "wilhelm",
        "leibniz",
        "système",
        "nouveau",
        "leibniz",
        "agrees",
        "malebranche",
        "metaphysical",
        "rigor",
        "created",
        "substance",
        "said",
        "interact",
        "reject",
        "malebranche",
        "appeal",
        "god",
        "explain",
        "apparent",
        "interaction",
        "ground",
        "appeal",
        "invokes",
        "deus",
        "ex",
        "machina",
        "thus",
        "involves",
        "recourse",
        "miracle",
        "leibniz",
        "entry",
        "rorarius",
        "first",
        "edition",
        "dictionnaire",
        "historique",
        "et",
        "critique",
        "pierre",
        "bayle",
        "protest",
        "malebranche",
        "behalf",
        "since",
        "god",
        "produce",
        "interaction",
        "mind",
        "body",
        "according",
        "general",
        "law",
        "never",
        "act",
        "extraordinarily",
        "leibniz",
        "letter",
        "bayle",
        "leibniz",
        "responds",
        "mere",
        "fact",
        "malebranche",
        "take",
        "god",
        "act",
        "nature",
        "according",
        "general",
        "law",
        "suffice",
        "show",
        "occasionalism",
        "involve",
        "appeal",
        "perpetual",
        "miracle",
        "leibniz",
        "explains",
        "insofar",
        "miracle",
        "derives",
        "something",
        "exceeds",
        "power",
        "created",
        "thing",
        "anything",
        "god",
        "produce",
        "directly",
        "without",
        "causal",
        "contribution",
        "created",
        "nature",
        "count",
        "miraculous",
        "leibniz",
        "objection",
        "malebranche",
        "occasionalism",
        "one",
        "contemporary",
        "found",
        "work",
        "bernard",
        "le",
        "bovier",
        "de",
        "fontenelle",
        "eventual",
        "perpetual",
        "secretary",
        "paris",
        "académie",
        "de",
        "science",
        "doutes",
        "sur",
        "le",
        "système",
        "physique",
        "de",
        "cause",
        "occasionelles",
        "fontenelle",
        "argues",
        "malebranche",
        "mechanistic",
        "physic",
        "incompatible",
        "occasionalism",
        "according",
        "mechanism",
        "bodily",
        "collision",
        "necessitates",
        "change",
        "motion",
        "bodily",
        "collision",
        "satisfies",
        "malebranche",
        "main",
        "requirement",
        "true",
        "cause",
        "insofar",
        "necessary",
        "connection",
        "effect",
        "thus",
        "conflict",
        "occasionalism",
        "entretien",
        "sur",
        "la",
        "métaphysique",
        "malebranche",
        "offer",
        "response",
        "law",
        "governing",
        "bodily",
        "effect",
        "collision",
        "derive",
        "god",
        "rather",
        "nature",
        "body",
        "malebranche",
        "oc",
        "different",
        "assessment",
        "response",
        "fontenelle",
        "cf",
        "downing",
        "schmaltz",
        "malebranche",
        "first",
        "cartesian",
        "endorse",
        "occasionalism",
        "follower",
        "descartes",
        "louis",
        "de",
        "la",
        "forge",
        "claude",
        "clerselier",
        "stressed",
        "god",
        "must",
        "cause",
        "communication",
        "motion",
        "bodily",
        "collision",
        "given",
        "passivity",
        "cartesian",
        "matter",
        "clerselier",
        "particular",
        "attempted",
        "preserve",
        "room",
        "action",
        "finite",
        "mind",
        "body",
        "cartesian",
        "geraud",
        "de",
        "cordemoy",
        "went",
        "claiming",
        "god",
        "cause",
        "change",
        "material",
        "world",
        "however",
        "none",
        "thinker",
        "went",
        "far",
        "malebranche",
        "arguing",
        "explicitly",
        "god",
        "must",
        "produce",
        "real",
        "change",
        "nature",
        "moreover",
        "malebranche",
        "distinctive",
        "providing",
        "explanation",
        "god",
        "action",
        "distinguishes",
        "general",
        "particular",
        "volition",
        "recent",
        "discussion",
        "issue",
        "connected",
        "malebranche",
        "notion",
        "particular",
        "volition",
        "see",
        "walsh",
        "stencil"
    ]
}