{
    "main_text": "Ontology and Logic || Mally’s Theory of Objects\n2.2 Mally’s Theory of Objects\n\n\nMally’s most important distinction was between an object’s being\ndetermined (determiniert sein) by a property and an object’s satisfying\n(erfüllen) a property. This distinction allowed Mally to speak of\nobjects that are neither contradictory nor incomplete (with respect to\nsatisfaction), although they may be contradictory or incomplete with\nrespect to determination:\n\n\nEvery object satisfies a complete complex of objectives and is thus\n“complete” with respect to its actual determinations. But\nthere are objects that are mere formdeterminates of certain (defining)\nobjectives (without satisfying these objectives): such an object is\nonly incompletely determined by its defining objective (which is an\nincomplete complex of objectives), and thus it has to be called\n“incomplete” with respect to its formal determination.\nNevertheless, according to the first statement, it is complete with\nrespect to the objectives it satisfies: since it satisfies the\nobjective to be the formdeterminate of its definition, and it also\nsatisfies everything implied by this objective. (Mally 1912: 76; this\ntranslation, and all subsequent translations, by the authors)\n\n\n\nIt would help to reread this passage with the following interpretative\nsuggestions in mind. First, following Zalta (1983), we want to\ninterpret Mally’s notion of objectives (Objektive) in terms\nof the modern notion of a property, though the notion of\nattribute would also be appropriate. The linguistic expressions which\nsignify objectives are just open formulas like\n‘Px’, ‘Rxy’, etc. Therefore,\nin what follows, we use ‘property’ instead of\n‘objective’. Second, we can understand Mally’s notion of\nsatisfying an objective in terms of the modern notion\nof instantiating or exemplifying a property. Finally, let us\nreplace Mally’s talk of ‘formdeterminates’ by the talk of\n‘conceptual objects’. In contrast to ordinary\nobjects, the characteristic form of conceptual objects is determined\nby certain properties rather than by the properties it may\ninstantiate.  Although we have made these terminological substitutions\nfor interpreting Mally, we hope that the new terminology is close to\nMally’s original intent. So, using our modern terminology, we would\nsay that conceptual objects are determined by a certain group of\nproperties and don’t necessarily instantiate the properties that\ndetermine them.  Moreover, the property of being a conceptual object\nis one which implies that the objects which instantiate it are\nabstract entities. For an alternative interpretation of Mally’s\nconcept of determination, understood as encoding, see Linsky 2014.\n\n\nWith Zalta’s interpretation in mind, we can understand the above\npassage from Mally as follows. According to Mally, a group of\nproperties determines a conceptual object and thereby ensures that\nthere is such an object. E.g., the property of being triangular (alone)\ndetermines the conceptual object we might identify as the triangle.\nThis object is conceptual because it is not the case that it is a\nspecific triangle in the ordinary sense of the verb ‘to be’\n(understood as a copula). Mally would say the triangle does not\ninstantiate the property of being triangular. But since every object is\ncomplete with respect to instantiation, the triangle instantiates the\nproperty of being non-triangular. Indeed, this latter property is\nimplied by the property of being a conceptual object. Or, to put it in\na different way: the property of being triangular is excluded by the\nproperty of being a conceptual object—conceptual objects have\nno shape at all. (For the concept of inclusion (Einschließung),\nsee Mally 1912: 4 ff.) This results in the claim that the triangle is\nnon-triangular, which is perfectly understandable if we understand\n‘is’ in the sense of ‘instantiates’.\nAdditionally, Mally offers us an algebra of properties that ensures\nthat for each given property F there is an property non-F, i.e., its\nnegation, which behaves in the usual manner (see Mally 1912: 14 ff.).\nFor example, he implicitly assumes that instantiating non-F is\nmaterially equivalent to not instantiating F:\n\nx instantiates non-F iff x does not instantiate F.\n\n\n\nNow, if there were objects incomplete with respect to instantiation\nproblems would arise, since the law tertium non datur would be\nviolated. For example, if we ask the question, is the triangle\nright-angled, then the Law of Excluded Middle tells us that either it\nis right-angled or it is not. Although the conceptual object identified\nabove as the triangle neither is determined by being right-angled nor\nis it determined by being non-right-angled, it nevertheless\ninstantiates the property of being non-right-angled. So, according to\nMally, for every property F and every object x, the following\nholds:\nx instantiates F or x instantiates non-F.\n\n\n\nEach object, whether it is conceptual or not, either instantiates a\nproperty or its negation. The triangle instantiates the property of\nbeing abstract, but not its negation; it does not instantiate the\nproperty of being triangular, but it instantiates its negation. There\nis, of course, no object that instantiates both a property F and its\nnegation non-F, since this would clearly be a contradiction.\n\n\nOn the other hand, there are objects, namely, conceptual ones, that\nare incomplete with respect to determination. So the following is a\nconsequence of Mally’s theory:\n\n\nThere is an x and there is an F such that x is\nnot determined by F and x is not determined by\nnon-F.\n\n\n\nNote that this consequence of Mally’s theory does not violate any\nlogical principle because (a) being determined by F does not imply\ninstantiating F, and (b) not being determined by F does not imply being\ndetermined by non-F. There are objects that are not determined by a\nproperty F, but which are also not determined by non-F; as noted above,\nthe triangle is not determined by being right-angled, but it is also\nnot determined by being non-right-angled; the triangle is only\ndetermined by being triangular.\n\n\nThere are even objects that are determined by contradictory\nproperties; Mally would assert the following:\n\n\nThere is an x and there is an F such that x is\ndetermined by F and x is determined by non-F.\n\n\n\nThe non-square square may be seen as such an object. But, again, no\nlogical principles are being violated, because being determined by\nnon-F does not imply not being determined by F, nor does its being\ndetermined by these properties imply that it instantiates them.\n\n\nAs is well known, Bertrand Russell criticized Meinong’s theory\nof objects in “On Denoting” (Russell 1905: 482–484).\n(See also the entry on\nnonexistent objects\n (section 4), as well as the\nentry on Alexius Meinong, section 4.4.) According to Russell, Meinong\nhas to accept entities like the round square:\n\nthe round square\nis round, and also not round […]. But this is intolerable; and\nif any theory can be found to avoid this result, it is surely to be\npreferred. (Russell 1905: 438)\n\nAs we have already seen above,\nMally’s theory of objects is a theory that avoids this result. For\nMally, it holds that there is an x such that x is determined by\nroundness and x is determined by non-roundness. But we have already\nshown above that this is no problem, because it does not violate any\nlogical law.\n\n\nConceptual objects can be incomplete and even contradictory with\nrespect to the properties that determine them, but neither of these\ncircumstances violates a logical law. Like ordinary objects, conceptual\nobjects are always complete and consistent with respect to\ninstantiation, and thus the laws of logic are respected. Now, these\nconceptual objects serve as the content of intentionally directed acts.\nMally says that there may be no object that is instantiated by the\nproperties we posit (setzen) in our judgments, but there is always a\nconceptual object that is determined by these properties. Intentional\nacts will never be deprived of their content.\n\n\nWe want to stress that ordinary concrete objects are not determined\nby any property, they merely instantiate properties. So, the current\nPope, e.g., instantiates the properties of being human, being Catholic,\netc., but there is no property that determines the current Pope. On the\nother hand, there is the conceptual object which we could call\n‘the Pope’ which is determined by being Pope. Indeed,\nMally’s view also allows us to talk about the Pope*, which is\ndetermined by all the properties implied by (included in) being the\nPope. Understood this way, the Pope and the Pope* are neither human nor\nCatholic nor do they instantiate any other “ordinary”\nproperty. These conceptual objects are abstract, and are determined by\nbeing Pope, being human, being Catholic, etc. The Pope is, like the\ntriangle, a conceptual object (Begriffsgegenstand), while the (current)\nPope is concrete and a living human being. (Note that we use the verb\n‘to be’ in the sense of ‘to instantiate’,\nbecause we think that this suits best the everyday intuitions about the\nmeaning of ‘to be’, understood as a copula.) Mally says,\n“we grasp through the conceptual object at the object which\ninstantiates a set of determinations” (Findlay 1963: 183). In our\nexample, we apprehend the current Pope by way of the abstract\nconceptual object the Pope*, which is determined by all the properties\nimplied by being the current Pope.\n\n\nWe see from the above that the existence of conceptual objects\ndepends on which properties are accepted. If we assume with Mally that\nwe have a full Boolean Algebra of properties then the only question\nleft to be answered, is: what are the primitive properties? We can only\nmake a suggestion inspired by the theory of intentionality here: the\nprimitive properties are all the non-complex properties that can be\nposited by the subject(s). (For other English translations of crucial\npassages of Mally’s work on his theory of objects, as well as a summary\nof Mally’s theory of conceptual objects, see Zalta 1998.)\n",
    "section_title": "2.2 Mally’s Theory of Objects",
    "entry_title": "Ernst Mally",
    "hierarchy_title": "Ernst Mally || Ontology and Logic || Mally’s Theory of Objects",
    "tokenized_text": [
        "ontology",
        "logic",
        "mally",
        "theory",
        "object",
        "mally",
        "theory",
        "object",
        "mally",
        "important",
        "distinction",
        "object",
        "determined",
        "determiniert",
        "sein",
        "property",
        "object",
        "satisfying",
        "erfüllen",
        "property",
        "distinction",
        "allowed",
        "mally",
        "speak",
        "object",
        "neither",
        "contradictory",
        "incomplete",
        "respect",
        "satisfaction",
        "although",
        "may",
        "contradictory",
        "incomplete",
        "respect",
        "determination",
        "every",
        "object",
        "satisfies",
        "complete",
        "complex",
        "objective",
        "thus",
        "complete",
        "respect",
        "actual",
        "determination",
        "object",
        "mere",
        "formdeterminates",
        "certain",
        "defining",
        "objective",
        "without",
        "satisfying",
        "objective",
        "object",
        "incompletely",
        "determined",
        "defining",
        "objective",
        "incomplete",
        "complex",
        "objective",
        "thus",
        "called",
        "incomplete",
        "respect",
        "formal",
        "determination",
        "nevertheless",
        "according",
        "first",
        "statement",
        "complete",
        "respect",
        "objective",
        "satisfies",
        "since",
        "satisfies",
        "objective",
        "formdeterminate",
        "definition",
        "also",
        "satisfies",
        "everything",
        "implied",
        "objective",
        "mally",
        "translation",
        "subsequent",
        "translation",
        "author",
        "would",
        "help",
        "reread",
        "passage",
        "following",
        "interpretative",
        "suggestion",
        "mind",
        "first",
        "following",
        "zalta",
        "want",
        "interpret",
        "mally",
        "notion",
        "objective",
        "objektive",
        "term",
        "modern",
        "notion",
        "property",
        "though",
        "notion",
        "attribute",
        "would",
        "also",
        "appropriate",
        "linguistic",
        "expression",
        "signify",
        "objective",
        "open",
        "formula",
        "like",
        "px",
        "rxy",
        "etc",
        "therefore",
        "follows",
        "use",
        "property",
        "instead",
        "objective",
        "second",
        "understand",
        "mally",
        "notion",
        "satisfying",
        "objective",
        "term",
        "modern",
        "notion",
        "instantiating",
        "exemplifying",
        "property",
        "finally",
        "let",
        "u",
        "replace",
        "mally",
        "talk",
        "formdeterminates",
        "talk",
        "conceptual",
        "object",
        "contrast",
        "ordinary",
        "object",
        "characteristic",
        "form",
        "conceptual",
        "object",
        "determined",
        "certain",
        "property",
        "rather",
        "property",
        "may",
        "instantiate",
        "although",
        "made",
        "terminological",
        "substitution",
        "interpreting",
        "mally",
        "hope",
        "new",
        "terminology",
        "close",
        "mally",
        "original",
        "intent",
        "using",
        "modern",
        "terminology",
        "would",
        "say",
        "conceptual",
        "object",
        "determined",
        "certain",
        "group",
        "property",
        "necessarily",
        "instantiate",
        "property",
        "determine",
        "moreover",
        "property",
        "conceptual",
        "object",
        "one",
        "implies",
        "object",
        "instantiate",
        "abstract",
        "entity",
        "alternative",
        "interpretation",
        "mally",
        "concept",
        "determination",
        "understood",
        "encoding",
        "see",
        "linsky",
        "zalta",
        "interpretation",
        "mind",
        "understand",
        "passage",
        "mally",
        "follows",
        "according",
        "mally",
        "group",
        "property",
        "determines",
        "conceptual",
        "object",
        "thereby",
        "ensures",
        "object",
        "eg",
        "property",
        "triangular",
        "alone",
        "determines",
        "conceptual",
        "object",
        "might",
        "identify",
        "triangle",
        "object",
        "conceptual",
        "case",
        "specific",
        "triangle",
        "ordinary",
        "sense",
        "verb",
        "understood",
        "copula",
        "mally",
        "would",
        "say",
        "triangle",
        "instantiate",
        "property",
        "triangular",
        "since",
        "every",
        "object",
        "complete",
        "respect",
        "instantiation",
        "triangle",
        "instantiates",
        "property",
        "nontriangular",
        "indeed",
        "latter",
        "property",
        "implied",
        "property",
        "conceptual",
        "object",
        "put",
        "different",
        "way",
        "property",
        "triangular",
        "excluded",
        "property",
        "conceptual",
        "objectconceptual",
        "object",
        "shape",
        "concept",
        "inclusion",
        "einschließung",
        "see",
        "mally",
        "ff",
        "result",
        "claim",
        "triangle",
        "nontriangular",
        "perfectly",
        "understandable",
        "understand",
        "sense",
        "instantiates",
        "additionally",
        "mally",
        "offer",
        "u",
        "algebra",
        "property",
        "ensures",
        "given",
        "property",
        "f",
        "property",
        "nonf",
        "ie",
        "negation",
        "behaves",
        "usual",
        "manner",
        "see",
        "mally",
        "ff",
        "example",
        "implicitly",
        "assumes",
        "instantiating",
        "nonf",
        "materially",
        "equivalent",
        "instantiating",
        "f",
        "x",
        "instantiates",
        "nonf",
        "iff",
        "x",
        "instantiate",
        "f",
        "object",
        "incomplete",
        "respect",
        "instantiation",
        "problem",
        "would",
        "arise",
        "since",
        "law",
        "tertium",
        "non",
        "datur",
        "would",
        "violated",
        "example",
        "ask",
        "question",
        "triangle",
        "rightangled",
        "law",
        "excluded",
        "middle",
        "tell",
        "u",
        "either",
        "rightangled",
        "although",
        "conceptual",
        "object",
        "identified",
        "triangle",
        "neither",
        "determined",
        "rightangled",
        "determined",
        "nonrightangled",
        "nevertheless",
        "instantiates",
        "property",
        "nonrightangled",
        "according",
        "mally",
        "every",
        "property",
        "f",
        "every",
        "object",
        "x",
        "following",
        "hold",
        "x",
        "instantiates",
        "f",
        "x",
        "instantiates",
        "nonf",
        "object",
        "whether",
        "conceptual",
        "either",
        "instantiates",
        "property",
        "negation",
        "triangle",
        "instantiates",
        "property",
        "abstract",
        "negation",
        "instantiate",
        "property",
        "triangular",
        "instantiates",
        "negation",
        "course",
        "object",
        "instantiates",
        "property",
        "f",
        "negation",
        "nonf",
        "since",
        "would",
        "clearly",
        "contradiction",
        "hand",
        "object",
        "namely",
        "conceptual",
        "one",
        "incomplete",
        "respect",
        "determination",
        "following",
        "consequence",
        "mally",
        "theory",
        "x",
        "f",
        "x",
        "determined",
        "f",
        "x",
        "determined",
        "nonf",
        "note",
        "consequence",
        "mally",
        "theory",
        "violate",
        "logical",
        "principle",
        "determined",
        "f",
        "imply",
        "instantiating",
        "f",
        "b",
        "determined",
        "f",
        "imply",
        "determined",
        "nonf",
        "object",
        "determined",
        "property",
        "f",
        "also",
        "determined",
        "nonf",
        "noted",
        "triangle",
        "determined",
        "rightangled",
        "also",
        "determined",
        "nonrightangled",
        "triangle",
        "determined",
        "triangular",
        "even",
        "object",
        "determined",
        "contradictory",
        "property",
        "mally",
        "would",
        "assert",
        "following",
        "x",
        "f",
        "x",
        "determined",
        "f",
        "x",
        "determined",
        "nonf",
        "nonsquare",
        "square",
        "may",
        "seen",
        "object",
        "logical",
        "principle",
        "violated",
        "determined",
        "nonf",
        "imply",
        "determined",
        "f",
        "determined",
        "property",
        "imply",
        "instantiates",
        "well",
        "known",
        "bertrand",
        "russell",
        "criticized",
        "meinong",
        "theory",
        "object",
        "denoting",
        "russell",
        "see",
        "also",
        "entry",
        "nonexistent",
        "object",
        "section",
        "well",
        "entry",
        "alexius",
        "meinong",
        "section",
        "according",
        "russell",
        "meinong",
        "accept",
        "entity",
        "like",
        "round",
        "square",
        "round",
        "square",
        "round",
        "also",
        "round",
        "intolerable",
        "theory",
        "found",
        "avoid",
        "result",
        "surely",
        "preferred",
        "russell",
        "already",
        "seen",
        "mally",
        "theory",
        "object",
        "theory",
        "avoids",
        "result",
        "mally",
        "hold",
        "x",
        "x",
        "determined",
        "roundness",
        "x",
        "determined",
        "nonroundness",
        "already",
        "shown",
        "problem",
        "violate",
        "logical",
        "law",
        "conceptual",
        "object",
        "incomplete",
        "even",
        "contradictory",
        "respect",
        "property",
        "determine",
        "neither",
        "circumstance",
        "violates",
        "logical",
        "law",
        "like",
        "ordinary",
        "object",
        "conceptual",
        "object",
        "always",
        "complete",
        "consistent",
        "respect",
        "instantiation",
        "thus",
        "law",
        "logic",
        "respected",
        "conceptual",
        "object",
        "serve",
        "content",
        "intentionally",
        "directed",
        "act",
        "mally",
        "say",
        "may",
        "object",
        "instantiated",
        "property",
        "posit",
        "setzen",
        "judgment",
        "always",
        "conceptual",
        "object",
        "determined",
        "property",
        "intentional",
        "act",
        "never",
        "deprived",
        "content",
        "want",
        "stress",
        "ordinary",
        "concrete",
        "object",
        "determined",
        "property",
        "merely",
        "instantiate",
        "property",
        "current",
        "pope",
        "eg",
        "instantiates",
        "property",
        "human",
        "catholic",
        "etc",
        "property",
        "determines",
        "current",
        "pope",
        "hand",
        "conceptual",
        "object",
        "could",
        "call",
        "pope",
        "determined",
        "pope",
        "indeed",
        "mally",
        "view",
        "also",
        "allows",
        "u",
        "talk",
        "pope",
        "determined",
        "property",
        "implied",
        "included",
        "pope",
        "understood",
        "way",
        "pope",
        "pope",
        "neither",
        "human",
        "catholic",
        "instantiate",
        "ordinary",
        "property",
        "conceptual",
        "object",
        "abstract",
        "determined",
        "pope",
        "human",
        "catholic",
        "etc",
        "pope",
        "like",
        "triangle",
        "conceptual",
        "object",
        "begriffsgegenstand",
        "current",
        "pope",
        "concrete",
        "living",
        "human",
        "note",
        "use",
        "verb",
        "sense",
        "instantiate",
        "think",
        "suit",
        "best",
        "everyday",
        "intuition",
        "meaning",
        "understood",
        "copula",
        "mally",
        "say",
        "grasp",
        "conceptual",
        "object",
        "object",
        "instantiates",
        "set",
        "determination",
        "findlay",
        "example",
        "apprehend",
        "current",
        "pope",
        "way",
        "abstract",
        "conceptual",
        "object",
        "pope",
        "determined",
        "property",
        "implied",
        "current",
        "pope",
        "see",
        "existence",
        "conceptual",
        "object",
        "depends",
        "property",
        "accepted",
        "assume",
        "mally",
        "full",
        "boolean",
        "algebra",
        "property",
        "question",
        "left",
        "answered",
        "primitive",
        "property",
        "make",
        "suggestion",
        "inspired",
        "theory",
        "intentionality",
        "primitive",
        "property",
        "noncomplex",
        "property",
        "posited",
        "subject",
        "english",
        "translation",
        "crucial",
        "passage",
        "mally",
        "work",
        "theory",
        "object",
        "well",
        "summary",
        "mally",
        "theory",
        "conceptual",
        "object",
        "see",
        "zalta"
    ]
}