{
    "main_text": "The Aesthetic Dimension\n2. The Aesthetic Dimension\n\n\nThe bookends of Marcuse’s literary, philosophical, and political\nlife are works on aesthetics. In 1922 he completed a doctoral\ndissertation entitled Der deutsche Künstlerroman\n(The German Artist-Novel). In 1978, one year before his death\nhe published The Aesthetic Dimension: Toward A Critique of Marxist\nAesthetics. Between these two works are several smaller works on\naesthetics. However, even the works that do not deal directly with\naesthetics still contain (we might say) an aesthetic dimension. It is\nnot possible to discuss the role of aesthetics in all of\nMarcuse’s works. Therefore, the role of aesthetics in\nMarcuse’s critical theory in general will be discussed. There\nare three key works on aesthetics which were written at different\ntimes that reveal the overall point of Marcuse’s aesthetic\ntheory. \n Even in his youth, Marcuse had a love for the classics of German\nand world literature (Marcuse 2007a: 4). After serving military duty\nand after his brief period of political engagement Marcuse returned to\nhis literary studies. However, in the aftermath of his reading of\nMarxism, Marcuse’s literary studies had a decisive political\norientation. He was interested in the revolutionary and transformative\nfunction of art. \n\nThis turn to art and literature was a return to an earlier love with a\nnew mission. This new mission was of course inspired by his encounter\nwith Marxism and the crisis of Marxism. The turn toward literature was\nalso a quest for revolutionary subjectivity. Put another way, from the\nbeginning to the end of his literary career Marcuse looked for spaces\nof a critical consciousness that had not been completely whittled down\nby the oppressive and repressive forces of capitalism. Revolution and\nsocial change demands a space for thought and action that make\nresistance to the status quo possible. Well before he began\nto use the term “the Great Refusal”, he was in search of\nsuch.\n\nIn his dissertation of 1922, The German Artist-Novel, the\nartist represents a form of radical subjectivity. Marcuse makes a\ndistinction between epic poetry and the novel in this work. Epic\npoetry deals with the origin and development of a people and culture\nwhile the novel does not focus on the form of life of a people and\ntheir development, but rather, on a sense of longing and striving\n(Marcuse 2007a: 72). The novel indicates alienation from social\nlife. The details of Marcuse’s argument will not be addressed\nhere. The point is to show that there is a certain orientation of\nthought in Marcuse’s 1922 dissertation that is motivated by his\nencounter with Marxism and will stay with him as his project becomes\nmore philosophical. In short, the artist experiences a gap between the\nideal and the real. This ability to entertain, at least theoretically,\nan ideal form of existence for humanity, while at the same time living\nin far less than ideal conditions, produces a sense of alienation in\nthe artist. This alienation becomes the catalyst for social\nchange. This function of art stays with Marcuse and will be developed\nfurther as he engages with psychoanalysis and philosophy.\n\nAs a dialectical thinker, Marcuse was also able to see both sides of\nthe coin. That is, while art embodied revolutionary potential, it\nwas also produced, interpreted, and distributed in a repressive\nsociety. In an oppressive/repressive society the forces of\nliberation and the forces of domination do not develop in isolation\nfrom each other. Instead, they develop in a dialectical\nrelationship where one produces the conditions for the other. \nThis can be seen throughout almost all of Marcuse’s writings and\nwill be pointed out at different points in this essay. The task\nhere is to take a look at how this dialectic of liberation and\ndomination occurs within the context of Marcuse’s aesthetic\ntheory. This should not be taken to mean that there will never be\na point in time when human beings are liberated from the forces of\ndomination. This simply means that if an individual group seeks\nliberation, their analysis or critique of society must come to terms\nwith how things actually work at that moment in that society if any\nform of liberation is possible. As Marcuse saw it, there is a\nform of ideology that serves domination and creates the conditions for\nliberation at the same time. This will be discussed later. \nAlso, there is a form of liberation that lends itself to be co-opted by\nthe forces of domination.   \n Just as art embodied the potential for liberation and the\nformation of radical subjectivity, it was also capable of being taken\nup by systems of domination and used to further or maintain\ndomination.  This is the theme of Marcuse’s 1937 essay\n“The Affirmative Character of Culture”. Culture, which is\nthe domain of art, develops in tension with the overall structure of a\ngiven society. The values and ideals produced by culture call for the\ntranscending of oppressive social reality. Culture separates itself\nfrom the social order. That is, the social realm or civilization is\ncharacterized by labor, the working day, the realm of necessity,\noperational thought, etc. (Marcuse 1965: 16). This is the realm of real\nmaterial and social relations as well as the struggle for\nexistence. The cultural realm or civilization is characterized by\nintellectual work, leisure, non-operational thought, and freedom\n(Marcuse 1965: 16). The freedom to think and reflect that is made\npossible at the level of culture makes it possible to construct values\nand ideals that pose a challenge to the social order. This is the\nemancipatory function of art. However, art itself does not bring about\nliberation; it must be translated into political\nactivity. Nevertheless, art is important because it opens up the space\nfor thinking that may then produce revolution. \n\nThe separation between culture and society does not suggest a flight\nfrom social reality. Instead, it represents an alien or critical\nspace within social reality. The ideals produced by culture must\nwork within society as transformative ideas. In “The\nAffirmative Character of Culture”, Marcuse, in good dialectical\nfashion, shows how culture separates itself from society or\ncivilization and creates the space for critical thought and social\nchange but then succumbs to the oppressive demands of bourgeois\nsociety. It does this by “separating ‘culture’\nfrom the everyday world” (Marcuse 2007a: 23). In\naffirmative culture art becomes the object of spiritual\ncontemplation. The demand for happiness in the real world is\nabandoned for an internal form of happiness, the happiness of the\nsoul. Hence, bourgeois culture creates an interior of the human\nbeing where the highest ideals of culture can be realized. This\ninner transformation does not demand an external transformation of the\nreal world and its material conditions. \n\nIn such a society the cultivation of the soul becomes an important\npart of one’s education. The belief that the soul is more\nimportant than the body and material needs leads to political\nresignation insofar as freedom becomes internal. “The soul takes\nflight at the hard truth of theory, which points up the necessity of\nchanging as impoverished form of existence” (Marcuse 2007b:\n222). Hence, the soul accepts the facts of its material existence\nwithout fighting to change these facts. Affirmative culture with its\nidea of the soul has used art to erase radical subjectivity. \n\nIn his last book The Aesthetic Dimension (1978), Marcuse\ncontinues his attempt to rescue the radical transformative nature of\nart. In this text he takes a polemical stance against the problematic\ninterpretation of the function of art by orthodox Marxists. These\nMarxists claimed that only proletarian art could be\nrevolutionary. Marcuse attempts to establish the revolutionary\npotential of all art by establishing the autonomy of authentic\nart. Marcuse states: “It seems that art as art expresses a\ntruth, an experience, a necessity which, although not in the domain of\nradical praxis, are nevertheless essential components of\nrevolution” (Marcuse 1978: 1). It is the experience that art\ntries to express that Marcuse will focus on and it is this which\nseparates him from orthodox Marxists. \n It must be remembered that for Marcuse and the Frankfurt School\nthere was no evidence that the proletariat would rise up against their\noppressors. In addition to developing theories that disclosed the\nsocial and psychological mechanisms at work in society that made the\nproletariat complicit in their own domination, Marcuse saw\npossibilities for revolution in multiple places. Some of this will be\ndiscussed later. The student revolts of the 1960s confirmed much of\nthe direction of Marcuse’s critical theory from early on. That\nis, the need for social change includes class struggle but cannot be\nreduced to class struggle. There is a multiplicity of social groups in\nour society that seek social change for various reasons. There are\nmultiple forms of oppression and repression that make revolution\ndesirable. Hence, the form of art produced, and its revolutionary\nvision, may be determined by a multiplicity of oppressed/repressed\nsubject positions. \n\nOrthodox Marxism focused on the proletariat by excluding all other\npossible sites for revolution. For this reason, orthodox Marxism\nitself becomes a form of ideology and produces a reified state of\naffairs. In orthodox Marxist aesthetics\n\n The subjectivity of individuals, their own consciousness and\nunconscious tends to be dissolved into class consciousness. Thereby, a\nmajor prerequisite of revolution is minimized, namely, the fact that\nthe need for radical change must be rooted in the subjectivity of\nindividuals themselves, in their intelligence, and their passions,\ntheir drives and their goals. (Marcuse 1978: 3–4)\n\n In orthodox Marxism, radical subjectivity was reduced to one\nsocial group, the proletariat. Marcuse greatly expands the space\nwhere radical subjectivity can emerge. Marcuse argues that\n“liberating subjectivity constitutes itself in the inner history\nof the individuals” (Marcuse 1978: 5). Each subject as distinct\nfrom other subjects represents a particular subject position. For\nexample; white female, working class, mother of two, born in the\nmid-west, etc. However, with each distinct feature of the individual\nsubject corresponds a structural position. That is, in a given society,\ngender, race, class, level of education etc., are interpreted in\ncertain ways. Experiences and the opportunities provided by them are\noften affected by subject and structural position and produce what\nMarcuse calls “the inner history of the individual”\n(Marcuse 1978: 5). \n\nGiven that there are many subject positions that are positions of\nrepression and dehumanization, radical subjectivity and art may come\nfrom any of these positions. Economic class is just one structural\nposition among many. Hence, it is not only the proletariat who may\nhave an interest in social change.\n        \n",
    "section_title": "2. The Aesthetic Dimension",
    "entry_title": "Herbert Marcuse",
    "hierarchy_title": "Herbert Marcuse || The Aesthetic Dimension",
    "tokenized_text": [
        "aesthetic",
        "dimension",
        "aesthetic",
        "dimension",
        "bookend",
        "marcuse",
        "literary",
        "philosophical",
        "political",
        "life",
        "work",
        "aesthetic",
        "completed",
        "doctoral",
        "dissertation",
        "entitled",
        "der",
        "deutsche",
        "künstlerroman",
        "german",
        "artistnovel",
        "one",
        "year",
        "death",
        "published",
        "aesthetic",
        "dimension",
        "toward",
        "critique",
        "marxist",
        "aesthetic",
        "two",
        "work",
        "several",
        "smaller",
        "work",
        "aesthetic",
        "however",
        "even",
        "work",
        "deal",
        "directly",
        "aesthetic",
        "still",
        "contain",
        "might",
        "say",
        "aesthetic",
        "dimension",
        "possible",
        "discus",
        "role",
        "aesthetic",
        "marcuse",
        "work",
        "therefore",
        "role",
        "aesthetic",
        "marcuse",
        "critical",
        "theory",
        "general",
        "discussed",
        "three",
        "key",
        "work",
        "aesthetic",
        "written",
        "different",
        "time",
        "reveal",
        "overall",
        "point",
        "marcuse",
        "aesthetic",
        "theory",
        "even",
        "youth",
        "marcuse",
        "love",
        "classic",
        "german",
        "world",
        "literature",
        "marcuse",
        "a",
        "serving",
        "military",
        "duty",
        "brief",
        "period",
        "political",
        "engagement",
        "marcuse",
        "returned",
        "literary",
        "study",
        "however",
        "aftermath",
        "reading",
        "marxism",
        "marcuse",
        "literary",
        "study",
        "decisive",
        "political",
        "orientation",
        "interested",
        "revolutionary",
        "transformative",
        "function",
        "art",
        "turn",
        "art",
        "literature",
        "return",
        "earlier",
        "love",
        "new",
        "mission",
        "new",
        "mission",
        "course",
        "inspired",
        "encounter",
        "marxism",
        "crisis",
        "marxism",
        "turn",
        "toward",
        "literature",
        "also",
        "quest",
        "revolutionary",
        "subjectivity",
        "put",
        "another",
        "way",
        "beginning",
        "end",
        "literary",
        "career",
        "marcuse",
        "looked",
        "space",
        "critical",
        "consciousness",
        "completely",
        "whittled",
        "oppressive",
        "repressive",
        "force",
        "capitalism",
        "revolution",
        "social",
        "change",
        "demand",
        "space",
        "thought",
        "action",
        "make",
        "resistance",
        "status",
        "quo",
        "possible",
        "well",
        "began",
        "use",
        "term",
        "great",
        "refusal",
        "search",
        "dissertation",
        "german",
        "artistnovel",
        "artist",
        "represents",
        "form",
        "radical",
        "subjectivity",
        "marcuse",
        "make",
        "distinction",
        "epic",
        "poetry",
        "novel",
        "work",
        "epic",
        "poetry",
        "deal",
        "origin",
        "development",
        "people",
        "culture",
        "novel",
        "focus",
        "form",
        "life",
        "people",
        "development",
        "rather",
        "sense",
        "longing",
        "striving",
        "marcuse",
        "a",
        "novel",
        "indicates",
        "alienation",
        "social",
        "life",
        "detail",
        "marcuse",
        "argument",
        "addressed",
        "point",
        "show",
        "certain",
        "orientation",
        "thought",
        "marcuse",
        "dissertation",
        "motivated",
        "encounter",
        "marxism",
        "stay",
        "project",
        "becomes",
        "philosophical",
        "short",
        "artist",
        "experience",
        "gap",
        "ideal",
        "real",
        "ability",
        "entertain",
        "least",
        "theoretically",
        "ideal",
        "form",
        "existence",
        "humanity",
        "time",
        "living",
        "far",
        "le",
        "ideal",
        "condition",
        "produce",
        "sense",
        "alienation",
        "artist",
        "alienation",
        "becomes",
        "catalyst",
        "social",
        "change",
        "function",
        "art",
        "stay",
        "marcuse",
        "developed",
        "engages",
        "psychoanalysis",
        "philosophy",
        "dialectical",
        "thinker",
        "marcuse",
        "also",
        "able",
        "see",
        "side",
        "coin",
        "art",
        "embodied",
        "revolutionary",
        "potential",
        "also",
        "produced",
        "interpreted",
        "distributed",
        "repressive",
        "society",
        "oppressiverepressive",
        "society",
        "force",
        "liberation",
        "force",
        "domination",
        "develop",
        "isolation",
        "instead",
        "develop",
        "dialectical",
        "relationship",
        "one",
        "produce",
        "condition",
        "seen",
        "throughout",
        "almost",
        "marcuse",
        "writing",
        "pointed",
        "different",
        "point",
        "essay",
        "task",
        "take",
        "look",
        "dialectic",
        "liberation",
        "domination",
        "occurs",
        "within",
        "context",
        "marcuse",
        "aesthetic",
        "theory",
        "taken",
        "mean",
        "never",
        "point",
        "time",
        "human",
        "being",
        "liberated",
        "force",
        "domination",
        "simply",
        "mean",
        "individual",
        "group",
        "seek",
        "liberation",
        "analysis",
        "critique",
        "society",
        "must",
        "come",
        "term",
        "thing",
        "actually",
        "work",
        "moment",
        "society",
        "form",
        "liberation",
        "possible",
        "marcuse",
        "saw",
        "form",
        "ideology",
        "serf",
        "domination",
        "creates",
        "condition",
        "liberation",
        "time",
        "discussed",
        "later",
        "also",
        "form",
        "liberation",
        "lends",
        "coopted",
        "force",
        "domination",
        "art",
        "embodied",
        "potential",
        "liberation",
        "formation",
        "radical",
        "subjectivity",
        "also",
        "capable",
        "taken",
        "system",
        "domination",
        "used",
        "maintain",
        "domination",
        "theme",
        "marcuse",
        "essay",
        "affirmative",
        "character",
        "culture",
        "culture",
        "domain",
        "art",
        "develops",
        "tension",
        "overall",
        "structure",
        "given",
        "society",
        "value",
        "ideal",
        "produced",
        "culture",
        "call",
        "transcending",
        "oppressive",
        "social",
        "reality",
        "culture",
        "separate",
        "social",
        "order",
        "social",
        "realm",
        "civilization",
        "characterized",
        "labor",
        "working",
        "day",
        "realm",
        "necessity",
        "operational",
        "thought",
        "etc",
        "marcuse",
        "realm",
        "real",
        "material",
        "social",
        "relation",
        "well",
        "struggle",
        "existence",
        "cultural",
        "realm",
        "civilization",
        "characterized",
        "intellectual",
        "work",
        "leisure",
        "nonoperational",
        "thought",
        "freedom",
        "marcuse",
        "freedom",
        "think",
        "reflect",
        "made",
        "possible",
        "level",
        "culture",
        "make",
        "possible",
        "construct",
        "value",
        "ideal",
        "pose",
        "challenge",
        "social",
        "order",
        "emancipatory",
        "function",
        "art",
        "however",
        "art",
        "bring",
        "liberation",
        "must",
        "translated",
        "political",
        "activity",
        "nevertheless",
        "art",
        "important",
        "open",
        "space",
        "thinking",
        "may",
        "produce",
        "revolution",
        "separation",
        "culture",
        "society",
        "suggest",
        "flight",
        "social",
        "reality",
        "instead",
        "represents",
        "alien",
        "critical",
        "space",
        "within",
        "social",
        "reality",
        "ideal",
        "produced",
        "culture",
        "must",
        "work",
        "within",
        "society",
        "transformative",
        "idea",
        "affirmative",
        "character",
        "culture",
        "marcuse",
        "good",
        "dialectical",
        "fashion",
        "show",
        "culture",
        "separate",
        "society",
        "civilization",
        "creates",
        "space",
        "critical",
        "thought",
        "social",
        "change",
        "succumbs",
        "oppressive",
        "demand",
        "bourgeois",
        "society",
        "separating",
        "culture",
        "everyday",
        "world",
        "marcuse",
        "a",
        "affirmative",
        "culture",
        "art",
        "becomes",
        "object",
        "spiritual",
        "contemplation",
        "demand",
        "happiness",
        "real",
        "world",
        "abandoned",
        "internal",
        "form",
        "happiness",
        "happiness",
        "soul",
        "hence",
        "bourgeois",
        "culture",
        "creates",
        "interior",
        "human",
        "highest",
        "ideal",
        "culture",
        "realized",
        "inner",
        "transformation",
        "demand",
        "external",
        "transformation",
        "real",
        "world",
        "material",
        "condition",
        "society",
        "cultivation",
        "soul",
        "becomes",
        "important",
        "part",
        "one",
        "education",
        "belief",
        "soul",
        "important",
        "body",
        "material",
        "need",
        "lead",
        "political",
        "resignation",
        "insofar",
        "freedom",
        "becomes",
        "internal",
        "soul",
        "take",
        "flight",
        "hard",
        "truth",
        "theory",
        "point",
        "necessity",
        "changing",
        "impoverished",
        "form",
        "existence",
        "marcuse",
        "b",
        "hence",
        "soul",
        "accepts",
        "fact",
        "material",
        "existence",
        "without",
        "fighting",
        "change",
        "fact",
        "affirmative",
        "culture",
        "idea",
        "soul",
        "used",
        "art",
        "erase",
        "radical",
        "subjectivity",
        "last",
        "book",
        "aesthetic",
        "dimension",
        "marcuse",
        "continues",
        "attempt",
        "rescue",
        "radical",
        "transformative",
        "nature",
        "art",
        "text",
        "take",
        "polemical",
        "stance",
        "problematic",
        "interpretation",
        "function",
        "art",
        "orthodox",
        "marxist",
        "marxist",
        "claimed",
        "proletarian",
        "art",
        "could",
        "revolutionary",
        "marcuse",
        "attempt",
        "establish",
        "revolutionary",
        "potential",
        "art",
        "establishing",
        "autonomy",
        "authentic",
        "art",
        "marcuse",
        "state",
        "seems",
        "art",
        "art",
        "express",
        "truth",
        "experience",
        "necessity",
        "although",
        "domain",
        "radical",
        "praxis",
        "nevertheless",
        "essential",
        "component",
        "revolution",
        "marcuse",
        "experience",
        "art",
        "try",
        "express",
        "marcuse",
        "focus",
        "separate",
        "orthodox",
        "marxist",
        "must",
        "remembered",
        "marcuse",
        "frankfurt",
        "school",
        "evidence",
        "proletariat",
        "would",
        "rise",
        "oppressor",
        "addition",
        "developing",
        "theory",
        "disclosed",
        "social",
        "psychological",
        "mechanism",
        "work",
        "society",
        "made",
        "proletariat",
        "complicit",
        "domination",
        "marcuse",
        "saw",
        "possibility",
        "revolution",
        "multiple",
        "place",
        "discussed",
        "later",
        "student",
        "revolt",
        "s",
        "confirmed",
        "much",
        "direction",
        "marcuse",
        "critical",
        "theory",
        "early",
        "need",
        "social",
        "change",
        "includes",
        "class",
        "struggle",
        "reduced",
        "class",
        "struggle",
        "multiplicity",
        "social",
        "group",
        "society",
        "seek",
        "social",
        "change",
        "various",
        "reason",
        "multiple",
        "form",
        "oppression",
        "repression",
        "make",
        "revolution",
        "desirable",
        "hence",
        "form",
        "art",
        "produced",
        "revolutionary",
        "vision",
        "may",
        "determined",
        "multiplicity",
        "oppressedrepressed",
        "subject",
        "position",
        "orthodox",
        "marxism",
        "focused",
        "proletariat",
        "excluding",
        "possible",
        "site",
        "revolution",
        "reason",
        "orthodox",
        "marxism",
        "becomes",
        "form",
        "ideology",
        "produce",
        "reified",
        "state",
        "affair",
        "orthodox",
        "marxist",
        "aesthetic",
        "subjectivity",
        "individual",
        "consciousness",
        "unconscious",
        "tends",
        "dissolved",
        "class",
        "consciousness",
        "thereby",
        "major",
        "prerequisite",
        "revolution",
        "minimized",
        "namely",
        "fact",
        "need",
        "radical",
        "change",
        "must",
        "rooted",
        "subjectivity",
        "individual",
        "intelligence",
        "passion",
        "drive",
        "goal",
        "marcuse",
        "orthodox",
        "marxism",
        "radical",
        "subjectivity",
        "reduced",
        "one",
        "social",
        "group",
        "proletariat",
        "marcuse",
        "greatly",
        "expands",
        "space",
        "radical",
        "subjectivity",
        "emerge",
        "marcuse",
        "argues",
        "liberating",
        "subjectivity",
        "constitutes",
        "inner",
        "history",
        "individual",
        "marcuse",
        "subject",
        "distinct",
        "subject",
        "represents",
        "particular",
        "subject",
        "position",
        "example",
        "white",
        "female",
        "working",
        "class",
        "mother",
        "two",
        "born",
        "midwest",
        "etc",
        "however",
        "distinct",
        "feature",
        "individual",
        "subject",
        "corresponds",
        "structural",
        "position",
        "given",
        "society",
        "gender",
        "race",
        "class",
        "level",
        "education",
        "etc",
        "interpreted",
        "certain",
        "way",
        "experience",
        "opportunity",
        "provided",
        "often",
        "affected",
        "subject",
        "structural",
        "position",
        "produce",
        "marcuse",
        "call",
        "inner",
        "history",
        "individual",
        "marcuse",
        "given",
        "many",
        "subject",
        "position",
        "position",
        "repression",
        "dehumanization",
        "radical",
        "subjectivity",
        "art",
        "may",
        "come",
        "position",
        "economic",
        "class",
        "one",
        "structural",
        "position",
        "among",
        "many",
        "hence",
        "proletariat",
        "may",
        "interest",
        "social",
        "change"
    ]
}