{
    "main_text": "Introduction and Biography\n1. Introduction and Biography\n\nMargaret Lucas was born in 1623 in Colchester, Essex. She did not\nreceive a formal education in disciplines such as mathematics,\nhistory, philosophy, and the classical languages, but she had access\nto scholarly libraries and was an avid reader. She began to put her\nown ideas to paper at a very early age, and although it was regarded\nas unseemly at the time for a woman to be publicly intellectual, she\nwas able to be an intellectual in private in regular conversations\nwith her middle-brother John. This is noteworthy because John was\nalready a well-established scholar: a student of law, philosophy, and\nnatural science, he was fluent in Hebrew, Latin and Greek, and would\neventually become a founding member of the Royal Society (Whitaker\n2002, 11–12). In 1643, seeking a life of independence, Lucas\napplied to be a maid of honor at the court of Queen Henrietta Maria.\nWhen the queen was exiled to France in 1644, Lucas accompanied her and\nshortly thereafter met William Cavendish. They married in 1645, and\nwould remain in exile (in Paris, then Rotterdam, then Antwerp) until\nthe restoration of the crown in 1660 (Battigelli 1998,\n1–10).\n\nThere are two reasons why it is important to mention the marriage of\nMargaret Lucas and William Cavendish. One is that William regularly\norganized and hosted meetings of the “Cavendish Circle” in\nthe 1640s, and attendees included such seventeenth-century giants as\nThomas Hobbes, Rene Descartes, Marin Mersenne, Pierre Gassendi, and\nKenelm Digby (Hutton 1997a, 422–3; Whitaker 2002, 92–4;\nClucas 1994, 256–64). Margaret attended many of these meetings,\nthough we do not know the extent to which she participated. The second\nreason why it is important to mention the marriage of Margaret to\nWilliam is that in the mid-seventeenth-century it was uncommon for a\npublisher to print the philosophical and scientific work of a woman.\nMargaret Cavendish was a sufficiently brilliant and impressive writer\nthat she was able to publish some of her work without assistance\n(Whitaker 2002, 154), including her very first work [Poems and\nFancies, 1653], but her more philosophical writings were\npublished with the assistance of her well-connected husband. At the\ntime women were not taken very seriously as philosophers, and there\nwas not a large market for the work of a woman philosopher to be\ndistributed and discussed. Margaret was extremely proactive about\nmailing copies of her philosophical monographs to scholars and to\nlibraries in England and beyond, along with requests for commentary\nand continued correspondence, but the replies that she received tended\nto be very dismissive. For example, William Charleton wrote back to\nher that\n\nAmong many other things, by which your Grace is pleased to distinguish\nyour self from other Writers, this seems to be not the least\nremarkable; that whereas they imploy only their wit, labour, and time,\nin composing Books, You bestow also great summs of Money in Printing\nYours: and not content to enrich our Heads alone, with your rare\nNotions, you go higher, and adorn our Libraries, with your elegant\nVolumes…. I may have many rivals in these my thankful\nacknowledgements, you can have no Competitor in the Glory of their\noccasions. This double Felicity is augmented by the accession of two\nothers, no less worthy admiration. One is, that as you have\nmade your self an Original, so are you likewise secure from\nbeing Copied. … You exceed all of your delicate Sex,\nnot only in this age, but in all ages\n past.[1]\n\n\nHere the suggestion is that Cavendish had to expend an unusual sum of\nmoney to have her books printed and that those books are an adornment\non library shelves. Charleton also makes clear that Cavendish need\nhave no fear of being plagiarized. Other scholars and librarians were\nsimilarly dismissive, and with the exception of the case of Joseph\nGlanvill, a common denominator across the letters that Cavendish\nreceived in response is that there is almost no attempt to engage with\nher philosophical arguments and positions, and little evidence of\ntheir having been read (Cunning 2022). Unfortunately and sadly for her\nand for us, Cavendish was not able to participate in a\nphilosophical back-and-forth with her contemporaries. When they would\nnot critically correspond with her in print, she engaged their views\ncritically in the form of a correspondence between herself and a\nfictional third\n person.[2]\n Cavendish wanted to secure a wide correspondence – “out\nof a love to Truth, and to make my own opinions the more intelligible,\nwhich cannot better be done then by arguing and comparing other mens\nopinions with them. …For a Philosopher or Philosopheress is not\nproduced on a\n sudden.”[3]\n According to Cavendish, no one is a philosopher in a vacuum, just as\nno one is a military general, or barrister, or mathematician, or\ncoach. To develop the skills that are part and parcel of philosophical\ninquiry, and to engage in philosophical debate itself, one needs\ninterlocutors, and one needs to be seen as a potential authority. But\nthe people in her surrounding environment were not going to comply.\nShe left her books on the shelf in the hope that the self-same work\nmight be far more impactful in a future generation.\n\nCavendish lived and wrote in the thick of the mechanistic revolution\nof the seventeenth century, though many of her views—about\nthinking matter, the transfer of motion, and the nature of scientific\nexplanation—are largely anti-mechanistic, and in many respects\nher arguments run against the grain. In her own age, she was regarded\nalternately as mad, pretentious, a curiosity, and a genius. She\nfinally received some much-wanted recognition from her male peers in\n1667, when she was offered an extremely rare invitation to participate\nin a meeting of the Royal Society, though to be sure she was regarded\nas a spectacle by many in attendance (Whitaker 2002, 291–306).\nShe died in December 1673 and was buried at Westminster Abbey. Over\nthe course of her short life she produced a number of important works\nin philosophy. These include Worlds Olio (1655),\nPhilosophical and Physical Opinions (1656), Philosophical\nLetters (1664), Observations Upon Experimental\nPhilosophy (1666), The Description of a New World, Called the\nBlazing World (1666), and Grounds of Natural Philosophy\n(1668).\n\nThe central tenet of Cavendish’s philosophy is that everything in the\nuniverse—including human beings and their minds—is\ncompletely material. Her commitment to this tenet is reflected\nthroughout her corpus:\n\nNature is material, or corporeal, and so are all her Creatures, and\nwhatsoever is not material is no part of Nature, neither doth it\nbelong any ways to\n Nature….[4]\n\n\nAccording to Cavendish, none of the achievements of bodies are to be\ntraced to immaterial agents such as God, immaterial finite minds, or\nsubstantial forms, because bodies have the resources to bring about\neverything that they do on their own. Cavendish also holds that bodies\nare ubiquitous and that there is no vacuum, because extensions of\nspace cannot be extensions of nothing but must be extensions of\n matter.[5]\n Every body is infinitely divisible (Cavendish 1668a, 125, 263;\nCavendish 1668b, 239), and all of the bodies in nature, at every level\nof division, are intelligent and perceptive (Cavendish 1668a, 16, 156;\nCavendish 1668b, 7). As we will see, one of Cavendish’s motivations\nfor accepting the latter view is that it makes sense of the order that\nwe encounter in the natural world.\n\nCavendish is aware that she is writing in a tradition in which the\nprospect of thinking matter is not going to be taken seriously. In the\neyes of many of her contemporaries and predecessors, matter is not\nonly unintelligent, but also inert and utterly worthless. She\nwrites,\n\nI perceive man has a great spleen against self-moving corporeal\nnature, although himself is part of her, and the reason is his\nambition; for he would fain be supreme, and above all other creatures,\nas more towards a divine nature: he would be a God, if arguments could\nmake him\n such….[6]\n\n\nCavendish does not accept a conception of matter according to which\nmatter is low-grade being. Her view that minds are corporeal is not\nthe view that minds are\n\ncomposed of raggs and shreds, but it is the purest, simplest and\nsubtillest [sic] matter in Nature. (Cavendish 1664, 180)\n\n\nCavendish will argue that the processes that are traditionally\nidentified as material are wondrous and impressive and that the\nprocesses that she would identify as material, but that others would\nidentify as immaterial, are even more so. As we will see, her view on\nthe sophistication of matter also informs other aspects of her\nthinking – for example, her metaphysics of imagination,\naccording to which imaginings are not static pictures, but living\nfigures that are creative and able to take on a life of their own; and\nalso her view of the superiority of natural productions to human\nartifacts (Lascano 2020). According to Cavendish, the latter are\ncomposed of bodies that are put together quickly and do not have the\nsame history of communication and synchronization as the entities that\ncompose a production of nature (Cunning 2016, 185–196). When\nCavendish says that ideas are material images, or that natural\nproductions are more sophisticated than artifacts, she is not\nsupposing a conception of matter according to which it is static and\ninert and dead. Her own views employ some of the language of the\ntradition – for example matter, image, and\nidea – but she fleshes out such terms in novel\ndirections. She does not attempt to create an entirely new\nlanguage, given that no one would understant it. For the most\npart she retains existing terminology and notes the respects in which\nit has been misused or abused.\n\nThe Cavendish corpus is a tour de force, even if Cavendish was not\nrecognized in her own lifetime for the extent of her intellectual\nprowess. She wrote eight philosophical monographs, and she crafted\nplays and poems and fictional pieces that exhibit philosophical\narguments and thought experiments as\n well.[7]\n Her thinking has important implications and tentacles, providing us\nwith insights into the place of human beings in nature, the\ndistinction between the social and the natural, and the\ninterdependence of creatures. She also made significant\ncontributions on other philosophical topics like causation,\nperception, motion, agency, gender, God, and free will. Her views and\narguments might also be interpreted as bearing on contemporary\nmovements in deep ecology and environmental ethics. As we will see,\nshe holds that human beings would benefit from emulating the behavior\nand thinking of nonhuman creatures – for example in the case of\nsocial organization. However, Cavendish does not appear to have the\nresources to make any normative claims about our impact on nature. She\nadmires nature, but her list of the qualities that pertain to\nbodies include size, figure, motion, activity, thought, and\nperception, and not qualities like goodness and badness. She is also\nnot especially concerned about the long-term viability of the natural\nworld. It will be fine. As an eternal entity, it is not going\nanywhere, even if we happen to impact it in a way that leads to our\nown demise.\n\nCavendish died in 1673 at the early age of 50.\n",
    "section_title": "1. Introduction and Biography",
    "entry_title": "Margaret Lucas Cavendish",
    "hierarchy_title": "Margaret Lucas Cavendish || Introduction and Biography",
    "tokenized_text": [
        "introduction",
        "biography",
        "introduction",
        "biography",
        "margaret",
        "lucas",
        "born",
        "colchester",
        "essex",
        "receive",
        "formal",
        "education",
        "discipline",
        "mathematics",
        "history",
        "philosophy",
        "classical",
        "language",
        "access",
        "scholarly",
        "library",
        "avid",
        "reader",
        "began",
        "put",
        "idea",
        "paper",
        "early",
        "age",
        "although",
        "regarded",
        "unseemly",
        "time",
        "woman",
        "publicly",
        "intellectual",
        "able",
        "intellectual",
        "private",
        "regular",
        "conversation",
        "middlebrother",
        "john",
        "noteworthy",
        "john",
        "already",
        "wellestablished",
        "scholar",
        "student",
        "law",
        "philosophy",
        "natural",
        "science",
        "fluent",
        "hebrew",
        "latin",
        "greek",
        "would",
        "eventually",
        "become",
        "founding",
        "member",
        "royal",
        "society",
        "whitaker",
        "seeking",
        "life",
        "independence",
        "lucas",
        "applied",
        "maid",
        "honor",
        "court",
        "queen",
        "henrietta",
        "maria",
        "queen",
        "exiled",
        "france",
        "lucas",
        "accompanied",
        "shortly",
        "thereafter",
        "met",
        "william",
        "cavendish",
        "married",
        "would",
        "remain",
        "exile",
        "paris",
        "rotterdam",
        "antwerp",
        "restoration",
        "crown",
        "battigelli",
        "two",
        "reason",
        "important",
        "mention",
        "marriage",
        "margaret",
        "lucas",
        "william",
        "cavendish",
        "one",
        "william",
        "regularly",
        "organized",
        "hosted",
        "meeting",
        "cavendish",
        "circle",
        "s",
        "attendee",
        "included",
        "seventeenthcentury",
        "giant",
        "thomas",
        "hobbes",
        "rene",
        "descartes",
        "marin",
        "mersenne",
        "pierre",
        "gassendi",
        "kenelm",
        "digby",
        "hutton",
        "a",
        "whitaker",
        "clucas",
        "margaret",
        "attended",
        "many",
        "meeting",
        "though",
        "know",
        "extent",
        "participated",
        "second",
        "reason",
        "important",
        "mention",
        "marriage",
        "margaret",
        "william",
        "midseventeenthcentury",
        "uncommon",
        "publisher",
        "print",
        "philosophical",
        "scientific",
        "work",
        "woman",
        "margaret",
        "cavendish",
        "sufficiently",
        "brilliant",
        "impressive",
        "writer",
        "able",
        "publish",
        "work",
        "without",
        "assistance",
        "whitaker",
        "including",
        "first",
        "work",
        "poem",
        "fancy",
        "philosophical",
        "writing",
        "published",
        "assistance",
        "wellconnected",
        "husband",
        "time",
        "woman",
        "taken",
        "seriously",
        "philosopher",
        "large",
        "market",
        "work",
        "woman",
        "philosopher",
        "distributed",
        "discussed",
        "margaret",
        "extremely",
        "proactive",
        "mailing",
        "copy",
        "philosophical",
        "monograph",
        "scholar",
        "library",
        "england",
        "beyond",
        "along",
        "request",
        "commentary",
        "continued",
        "correspondence",
        "reply",
        "received",
        "tended",
        "dismissive",
        "example",
        "william",
        "charleton",
        "wrote",
        "back",
        "among",
        "many",
        "thing",
        "grace",
        "pleased",
        "distinguish",
        "self",
        "writer",
        "seems",
        "least",
        "remarkable",
        "whereas",
        "imploy",
        "wit",
        "labour",
        "time",
        "composing",
        "book",
        "bestow",
        "also",
        "great",
        "summs",
        "money",
        "printing",
        "content",
        "enrich",
        "head",
        "alone",
        "rare",
        "notion",
        "go",
        "higher",
        "adorn",
        "library",
        "elegant",
        "volumes",
        "may",
        "many",
        "rival",
        "thankful",
        "acknowledgement",
        "competitor",
        "glory",
        "occasion",
        "double",
        "felicity",
        "augmented",
        "accession",
        "two",
        "others",
        "le",
        "worthy",
        "admiration",
        "one",
        "made",
        "self",
        "original",
        "likewise",
        "secure",
        "copied",
        "exceed",
        "delicate",
        "sex",
        "age",
        "age",
        "past",
        "suggestion",
        "cavendish",
        "expend",
        "unusual",
        "sum",
        "money",
        "book",
        "printed",
        "book",
        "adornment",
        "library",
        "shelf",
        "charleton",
        "also",
        "make",
        "clear",
        "cavendish",
        "need",
        "fear",
        "plagiarized",
        "scholar",
        "librarian",
        "similarly",
        "dismissive",
        "exception",
        "case",
        "joseph",
        "glanvill",
        "common",
        "denominator",
        "across",
        "letter",
        "cavendish",
        "received",
        "response",
        "almost",
        "attempt",
        "engage",
        "philosophical",
        "argument",
        "position",
        "little",
        "evidence",
        "read",
        "cunning",
        "unfortunately",
        "sadly",
        "u",
        "cavendish",
        "able",
        "participate",
        "philosophical",
        "backandforth",
        "contemporary",
        "would",
        "critically",
        "correspond",
        "print",
        "engaged",
        "view",
        "critically",
        "form",
        "correspondence",
        "fictional",
        "third",
        "person",
        "cavendish",
        "wanted",
        "secure",
        "wide",
        "correspondence",
        "love",
        "truth",
        "make",
        "opinion",
        "intelligible",
        "better",
        "done",
        "arguing",
        "comparing",
        "men",
        "opinion",
        "for",
        "philosopher",
        "philosopheress",
        "produced",
        "sudden",
        "according",
        "cavendish",
        "one",
        "philosopher",
        "vacuum",
        "one",
        "military",
        "general",
        "barrister",
        "mathematician",
        "coach",
        "develop",
        "skill",
        "part",
        "parcel",
        "philosophical",
        "inquiry",
        "engage",
        "philosophical",
        "debate",
        "one",
        "need",
        "interlocutor",
        "one",
        "need",
        "seen",
        "potential",
        "authority",
        "people",
        "surrounding",
        "environment",
        "going",
        "comply",
        "left",
        "book",
        "shelf",
        "hope",
        "selfsame",
        "work",
        "might",
        "far",
        "impactful",
        "future",
        "generation",
        "cavendish",
        "lived",
        "wrote",
        "thick",
        "mechanistic",
        "revolution",
        "seventeenth",
        "century",
        "though",
        "many",
        "viewsabout",
        "thinking",
        "matter",
        "transfer",
        "motion",
        "nature",
        "scientific",
        "explanationare",
        "largely",
        "antimechanistic",
        "many",
        "respect",
        "argument",
        "run",
        "grain",
        "age",
        "regarded",
        "alternately",
        "mad",
        "pretentious",
        "curiosity",
        "genius",
        "finally",
        "received",
        "muchwanted",
        "recognition",
        "male",
        "peer",
        "offered",
        "extremely",
        "rare",
        "invitation",
        "participate",
        "meeting",
        "royal",
        "society",
        "though",
        "sure",
        "regarded",
        "spectacle",
        "many",
        "attendance",
        "whitaker",
        "died",
        "december",
        "buried",
        "westminster",
        "abbey",
        "course",
        "short",
        "life",
        "produced",
        "number",
        "important",
        "work",
        "philosophy",
        "include",
        "world",
        "olio",
        "philosophical",
        "physical",
        "opinion",
        "philosophical",
        "letter",
        "observation",
        "upon",
        "experimental",
        "philosophy",
        "description",
        "new",
        "world",
        "called",
        "blazing",
        "world",
        "ground",
        "natural",
        "philosophy",
        "central",
        "tenet",
        "cavendish",
        "philosophy",
        "everything",
        "universeincluding",
        "human",
        "being",
        "mindsis",
        "completely",
        "material",
        "commitment",
        "tenet",
        "reflected",
        "throughout",
        "corpus",
        "nature",
        "material",
        "corporeal",
        "creature",
        "whatsoever",
        "material",
        "part",
        "nature",
        "neither",
        "doth",
        "belong",
        "way",
        "nature",
        "according",
        "cavendish",
        "none",
        "achievement",
        "body",
        "traced",
        "immaterial",
        "agent",
        "god",
        "immaterial",
        "finite",
        "mind",
        "substantial",
        "form",
        "body",
        "resource",
        "bring",
        "everything",
        "cavendish",
        "also",
        "hold",
        "body",
        "ubiquitous",
        "vacuum",
        "extension",
        "space",
        "extension",
        "nothing",
        "must",
        "extension",
        "matter",
        "every",
        "body",
        "infinitely",
        "divisible",
        "cavendish",
        "a",
        "cavendish",
        "b",
        "body",
        "nature",
        "every",
        "level",
        "division",
        "intelligent",
        "perceptive",
        "cavendish",
        "a",
        "cavendish",
        "b",
        "see",
        "one",
        "cavendish",
        "motivation",
        "accepting",
        "latter",
        "view",
        "make",
        "sense",
        "order",
        "encounter",
        "natural",
        "world",
        "cavendish",
        "aware",
        "writing",
        "tradition",
        "prospect",
        "thinking",
        "matter",
        "going",
        "taken",
        "seriously",
        "eye",
        "many",
        "contemporary",
        "predecessor",
        "matter",
        "unintelligent",
        "also",
        "inert",
        "utterly",
        "worthless",
        "writes",
        "perceive",
        "man",
        "great",
        "spleen",
        "selfmoving",
        "corporeal",
        "nature",
        "although",
        "part",
        "reason",
        "ambition",
        "would",
        "fain",
        "supreme",
        "creature",
        "towards",
        "divine",
        "nature",
        "would",
        "god",
        "argument",
        "could",
        "make",
        "such",
        "cavendish",
        "accept",
        "conception",
        "matter",
        "according",
        "matter",
        "lowgrade",
        "view",
        "mind",
        "corporeal",
        "view",
        "mind",
        "composed",
        "raggs",
        "shred",
        "purest",
        "simplest",
        "subtillest",
        "sic",
        "matter",
        "nature",
        "cavendish",
        "cavendish",
        "argue",
        "process",
        "traditionally",
        "identified",
        "material",
        "wondrous",
        "impressive",
        "process",
        "would",
        "identify",
        "material",
        "others",
        "would",
        "identify",
        "immaterial",
        "even",
        "see",
        "view",
        "sophistication",
        "matter",
        "also",
        "informs",
        "aspect",
        "thinking",
        "example",
        "metaphysics",
        "imagination",
        "according",
        "imaginings",
        "static",
        "picture",
        "living",
        "figure",
        "creative",
        "able",
        "take",
        "life",
        "also",
        "view",
        "superiority",
        "natural",
        "production",
        "human",
        "artifact",
        "lascano",
        "according",
        "cavendish",
        "latter",
        "composed",
        "body",
        "put",
        "together",
        "quickly",
        "history",
        "communication",
        "synchronization",
        "entity",
        "compose",
        "production",
        "nature",
        "cunning",
        "cavendish",
        "say",
        "idea",
        "material",
        "image",
        "natural",
        "production",
        "sophisticated",
        "artifact",
        "supposing",
        "conception",
        "matter",
        "according",
        "static",
        "inert",
        "dead",
        "view",
        "employ",
        "language",
        "tradition",
        "example",
        "matter",
        "image",
        "idea",
        "flesh",
        "term",
        "novel",
        "direction",
        "attempt",
        "create",
        "entirely",
        "new",
        "language",
        "given",
        "one",
        "would",
        "understant",
        "part",
        "retains",
        "existing",
        "terminology",
        "note",
        "respect",
        "misused",
        "abused",
        "cavendish",
        "corpus",
        "tour",
        "de",
        "force",
        "even",
        "cavendish",
        "recognized",
        "lifetime",
        "extent",
        "intellectual",
        "prowess",
        "wrote",
        "eight",
        "philosophical",
        "monograph",
        "crafted",
        "play",
        "poem",
        "fictional",
        "piece",
        "exhibit",
        "philosophical",
        "argument",
        "thought",
        "experiment",
        "well",
        "thinking",
        "important",
        "implication",
        "tentacle",
        "providing",
        "u",
        "insight",
        "place",
        "human",
        "being",
        "nature",
        "distinction",
        "social",
        "natural",
        "interdependence",
        "creature",
        "also",
        "made",
        "significant",
        "contribution",
        "philosophical",
        "topic",
        "like",
        "causation",
        "perception",
        "motion",
        "agency",
        "gender",
        "god",
        "free",
        "view",
        "argument",
        "might",
        "also",
        "interpreted",
        "bearing",
        "contemporary",
        "movement",
        "deep",
        "ecology",
        "environmental",
        "ethic",
        "see",
        "hold",
        "human",
        "being",
        "would",
        "benefit",
        "emulating",
        "behavior",
        "thinking",
        "nonhuman",
        "creature",
        "example",
        "case",
        "social",
        "organization",
        "however",
        "cavendish",
        "appear",
        "resource",
        "make",
        "normative",
        "claim",
        "impact",
        "nature",
        "admires",
        "nature",
        "list",
        "quality",
        "pertain",
        "body",
        "include",
        "size",
        "figure",
        "motion",
        "activity",
        "thought",
        "perception",
        "quality",
        "like",
        "goodness",
        "badness",
        "also",
        "especially",
        "concerned",
        "longterm",
        "viability",
        "natural",
        "world",
        "fine",
        "eternal",
        "entity",
        "going",
        "anywhere",
        "even",
        "happen",
        "impact",
        "way",
        "lead",
        "demise",
        "cavendish",
        "died",
        "early",
        "age"
    ]
}