{
    "main_text": "Occasional Causation\n5. Occasional Causation\n\nAn interesting wrinkle in Cavendish’s view of the orderly behavior of\nbodies is her insistence that when bodies interact they do not\ntransfer motion to each\n other.[28]\n Instead, bodies communicate with each other about how to coordinate\ntheir behavior, and each is then the source of its own motion. On the\nassumption that properties cannot literally slide or hop from one body\nto another, cases in which one body does take on the motion of another\nbody would be cases in which the second body also takes on the matter\nthat has that motion. But we do not observe a body to become more\nmassive when it is moved as a result of its contact with another body.\nAs Cavendish explains in her description of a hand that moves a\nbowl,\n\nI cannot think it probable, that any of the animate or self-moving\nmatter in the hand, quits the hand, and enters into the bowl; nor that\nthe animate matter, which is in the bowl, leaves the bowl and enters\ninto the hand. (Cavendish 1664, 445)\n\n\nCavendish adds that “if it did, the hand would in a short time\nbecome weak and useless, by losing so much\n substance….”[29]\n She instead proposes that when one body appears to move another, it\nis simply an occasion or prompt for the second body to move on its\nown. The second body moves in the right way in response to the first\nbody (and the other bodies in its vicinity), but only because all\nbodies are intelligent and perceptive and (for the most part)\nagreeable, and they communicate with each other about how to\n proceed.[30]\n A body B might appear to acquire new motion from a body A if body B\nat first was still, or a body B might appear to be stationary after a\nbody A “stops” it from moving, but Cavendish supposes that\nbodies that appear to be stationary are always quite active below the\nsurface:\n\nthough a particular motion doth not move in that same manner as it did\nbefore, nevertheless it is still there, and not onely there, but still\nmoving; onely it is not moving after the same manner as it did move\nheretofore, but has changed from such a kind of motion to another kind\nof motion, and being still moving it cannot be said to cease:\nWherefore what is commonly called cessation from motion, is onely a\nchange of some particular motion, and is a mistake of change for rest.\n(Cavendish 1664, 436)\n\n\nA given amount of motion is inseparably tied to the body that has it,\naccording to Cavendish, and so motion never transfers from a first\nbody to a second – unless of course the first body loses some of\nits matter, in which case there is a transfer of motion, but only\nbecause there is at the same time a transfer of matter. The motion\nthat is transferred is not transferred from the matter that has it;\ninstead, that matter and motion both transfer together. Cavendish\nsupposes that motion is never transferred on its own, but she also\nallows that a body can redirect motions that another body already has.\nThat is, a body never transfers any amount of motion to a second body,\nbut a body can (and often does) redirect the motions of a second body.\nBodies indeed often dominate other bodies and force their motions to\nrun counter to what they would otherwise be:\n\n…Nature’s Parts move themselves, and are not moved by any Agent.\nSecondly, Though Nature’s Parts are Self-moving, and Self-knowing, yet\nthey have not an infinite or uncontroulable Power; for, several Parts,\nand Parties, oppose, and oft-times obstruct each other; so that many\ntimes they are forced to move, and they may not when they would.\n(Cavendish 1668b, 105)\n\n\nthere is no particular creature, that hath an absolute power of\nself-moving; so that Creature which hath the advantage of strength,\nsubtilty, or policy, shape, or figure, and the like, may oppose and\nover-power another which is inferior to it, in all this; yet this\nhinderance and opposition doth not take away self-motion. (Cavendish\n1664, 96)\n\n\nA body never loses its motion, and motion is never transferred on its\nown from one body to another, but a body can redirect the motions that\na second body already has, and in a way that might give the appearance\nthat motion has been transferred. Cavendish will allow appearances to\ntell part of the story of a given body-body interaction, but she also\nmakes sure that any such story is informed by deeper metaphysical\nconsiderations like that strictly speaking a body and its motion are\ninseparable.\n\nA given body never loses or acquires motion, according to Cavendish.\nInstead, the motion of a body is always its own self-motion. If so, we\ncan draw a conclusion about the motions that occur in a sense organ\nwhen an object is perceived. The motions are self-motions. They are\nnot motions that are transfered from the object that is perceived;\nsuch a transfer is unintelligible. New motions are not transfered from\nthe object that is perceived (unless the sense organ gets bigger); nor\nare they impressed upon the sense organ by bodies that travel through\nthe air and stamp themselves on the\n organ.[31]\n Instead, the motions in the sense organ are self-motions. The sense\norgan patterns an image of the perceived body, and it does so via\nmotions that it possessed all along:\n\nBy prints I understand the figures of the objects which are patterned\nor copied out by the sensitive and rational corporeal figurative\nmotions; as for example, when the sensitive corporeal motions pattern\nout the figure of an exterior object, and the rational motions again\npattern out a figure made by the sensitive motions, those figures of\nthe objects that are patterned out, I name prints … Thus by\nprints I understand patterns, and by printing patterning. … [It\nis] not that the exterior object prints its figure upon the exterior\nsensitive organs, but that the sensitive motions in the organs pattern\nout the figure of the\n object.[32]\n\n\nFor Cavendish, both of the causal participants of a sensory perception\nare active, which is to say that the sense organ – usually\nregarded as passive – is\n active.[33]\n The body that is perceived is also a cause; it is what Cavendish\ncalls an occasional cause: “I say that some things may be\nOccasional causes of other things, but not the Prime or Principal\ncauses…” (Cavendish 1664, 79). Commentators have worried\nthat even if we allow Cavendish the view that bodies are active and\nvital and the source of their own motion, she has no way to account\nfor how it is that bodies communicate so successfully with each other\nif nothing is transmitted between them. Bodies seem to\n“suggest” (Detlefsen 2007, 168), or “induc[e]”\n(O’Neill 2001, xxx), or perhaps they transmit “a sort of signal\nthat triggers the self-motion” of the body that moves\n(Michaelian 2009, 47), but the question is how they do this. As\nDetlefsen writes,\n\nAlthough it is true that there is no transfer of motion between bodies\nin cases of interaction by occasional causation, there is still some\nsort of causal interaction [when the first body induces the second\nbody to act]…. How is this possible if nothing is physically\ntransferred? (Detlefsen 2007, 168)\n\n\nO’Neill points the way to an answer. First, she points out that even\nthough (for Cavendish) a body never transfers its motion to a second\nbody, it still serves as a partial cause of its movement (O’Neill\n2001, xxx–xxxi). Cavendish says,\n\nI do not say, that the motion of the hand does not contribute to the\nmotion of the ball; for though the ball has its own natural motion in\nitself … nevertheless the motion of the ball would not move by\nsuch an exterior local motion, did not the motion of the hand, or any\nother exterior moving body give it occasion to move that way;\nwherefore the motion of the hand may very well be said to be the cause\nof that exterior local motion of the ball, but not to be the same\nmotion by which the ball moves. (Cavendish 1664, 447–8)\n\n\nIt is clear how an occasional cause contributes to the motion of a\nsecond body in a case where the occasional cause “oppose[s] and\nover-power[s] another which is inferior to it.” The occasional\ncause “hinder[s]” the second body and\n“force[s]” it to move in ways that it otherwise would not.\nThe second body still moves by its own self-motion, for “this\nhinderance and opposition doth not take away self-motion.”\nMotion is never transfered from one body to another, and so the motion\nof a body – and even the motion of a body that is over-powered\n– is motion that the body has possessed all along. But the\noccasional cause still redirects the self-motion of the\nsecond body; it re-directs the self-motion of the second body, which\nis to say that it re-directs the motions that the second body already\nhad. Note that Cavendish uses the language of “occasional causes” (for\nexample at Cavendish 1664, 79), but her understanding of occasional\ncausation is not the same as that of 17th-Century contemporaries like\nMalebranche and Boyle. For Cavendish an occasional cause is something\nthat triggers or occasions motion that is already in (and is\ninseparable from) the affected body.\n\nCavendish then makes sense of cases that are more mundane. She\nconsiders for example of our sensory perception of distant objects\nlike the sun. As we would expect, she holds that there is an\noccasional cause that plays an active role with respect to the\nprompting of motion that is already in the eye, and she holds that the\neye plays an active role as well. She writes,\n\nNeither is the influence of the Stars performed beyond a certain\ndistance, that is, such a distance as is beyond sight or their natural\npower to work; for if their light comes to our Eyes, I know no reason\nagainst it, but their effects may come to our bodies. (Cavendish 1664,\n301–302)\n\n\nWe perceive a distant body because light travels from that body to our\nsense organ and does something to the sense organ. The light does not\nadd new motion to the sense organ; that is absurd. Instead, the light\nre-directs the bodies of the sense organ to form a pattern of the\ndistant body. In the very next sentence Cavendish offers the same\naccount of the causal process by which a creature acquires a disease:\nshe says that “as for infectious Diseases, they come by\ncorporeal imitation, as by touch, either of the infected air, drawn in\nby breath, or entring through the Pores of the Body, or of some things\nbrought from infected places…” (ibid.). For Cavendish,\noccasional causation occurs by contact when a body re-directs the\nself-motion of a second body. Bodies interact with other bodies by\ncontact, when they hinder each other and they re-direct (but never\ntransfer) motion. In the case of perception, the self-motions of the\nsense organ pattern an image of the distant body upon the arrival of\nlight (or some other medium). As we would expect, Cavendish does not\nhold that light travels all the way from the distant body; instead,\nthat light is patterned by air or light that is in the plenum of\nmatter that lies in-between object and perceiver, and in the end the\nsense organ patterns that air or light. She says that “as for\nair, it patterns out the light of the Sun, and the sensitive motions\nin the eyes of animals pattern out the light in the air”\n(Cavendish 1664, 83). She owns as a consequence that in the plenum\nthat is the material universe there is a lot of patterning that takes\nplace that we do not notice; there are objects that we and other\ncreatures pattern but that are below the threshold of awareness\n(Cavendish 1668a, 211). The same bit of light does not travel all the\nway from object to perceiver; nor does light pass through walls.\nInstead, patterning abounds, along the lines of Newton’s Cradle.\n",
    "section_title": "5. Occasional Causation",
    "entry_title": "Margaret Lucas Cavendish",
    "hierarchy_title": "Margaret Lucas Cavendish || Occasional Causation",
    "tokenized_text": [
        "occasional",
        "causation",
        "occasional",
        "causation",
        "interesting",
        "wrinkle",
        "cavendish",
        "view",
        "orderly",
        "behavior",
        "body",
        "insistence",
        "body",
        "interact",
        "transfer",
        "motion",
        "instead",
        "body",
        "communicate",
        "coordinate",
        "behavior",
        "source",
        "motion",
        "assumption",
        "property",
        "literally",
        "slide",
        "hop",
        "one",
        "body",
        "another",
        "case",
        "one",
        "body",
        "take",
        "motion",
        "another",
        "body",
        "would",
        "case",
        "second",
        "body",
        "also",
        "take",
        "matter",
        "motion",
        "observe",
        "body",
        "become",
        "massive",
        "moved",
        "result",
        "contact",
        "another",
        "body",
        "cavendish",
        "explains",
        "description",
        "hand",
        "move",
        "bowl",
        "think",
        "probable",
        "animate",
        "selfmoving",
        "matter",
        "hand",
        "quits",
        "hand",
        "enters",
        "bowl",
        "animate",
        "matter",
        "bowl",
        "leaf",
        "bowl",
        "enters",
        "hand",
        "cavendish",
        "cavendish",
        "add",
        "hand",
        "would",
        "short",
        "time",
        "become",
        "weak",
        "useless",
        "losing",
        "much",
        "substance",
        "instead",
        "proposes",
        "one",
        "body",
        "appears",
        "move",
        "another",
        "simply",
        "occasion",
        "prompt",
        "second",
        "body",
        "move",
        "second",
        "body",
        "move",
        "right",
        "way",
        "response",
        "first",
        "body",
        "body",
        "vicinity",
        "body",
        "intelligent",
        "perceptive",
        "part",
        "agreeable",
        "communicate",
        "proceed",
        "body",
        "b",
        "might",
        "appear",
        "acquire",
        "new",
        "motion",
        "body",
        "body",
        "b",
        "first",
        "still",
        "body",
        "b",
        "might",
        "appear",
        "stationary",
        "body",
        "stop",
        "moving",
        "cavendish",
        "supposes",
        "body",
        "appear",
        "stationary",
        "always",
        "quite",
        "active",
        "surface",
        "though",
        "particular",
        "motion",
        "doth",
        "move",
        "manner",
        "nevertheless",
        "still",
        "onely",
        "still",
        "moving",
        "onely",
        "moving",
        "manner",
        "move",
        "heretofore",
        "changed",
        "kind",
        "motion",
        "another",
        "kind",
        "motion",
        "still",
        "moving",
        "said",
        "cease",
        "wherefore",
        "commonly",
        "called",
        "cessation",
        "motion",
        "onely",
        "change",
        "particular",
        "motion",
        "mistake",
        "change",
        "rest",
        "cavendish",
        "given",
        "amount",
        "motion",
        "inseparably",
        "tied",
        "body",
        "according",
        "cavendish",
        "motion",
        "never",
        "transfer",
        "first",
        "body",
        "second",
        "unless",
        "course",
        "first",
        "body",
        "loses",
        "matter",
        "case",
        "transfer",
        "motion",
        "time",
        "transfer",
        "matter",
        "motion",
        "transferred",
        "transferred",
        "matter",
        "instead",
        "matter",
        "motion",
        "transfer",
        "together",
        "cavendish",
        "supposes",
        "motion",
        "never",
        "transferred",
        "also",
        "allows",
        "body",
        "redirect",
        "motion",
        "another",
        "body",
        "already",
        "body",
        "never",
        "transfer",
        "amount",
        "motion",
        "second",
        "body",
        "body",
        "often",
        "redirect",
        "motion",
        "second",
        "body",
        "body",
        "indeed",
        "often",
        "dominate",
        "body",
        "force",
        "motion",
        "run",
        "counter",
        "would",
        "otherwise",
        "nature",
        "part",
        "move",
        "moved",
        "agent",
        "secondly",
        "though",
        "nature",
        "part",
        "selfmoving",
        "selfknowing",
        "yet",
        "infinite",
        "uncontroulable",
        "power",
        "several",
        "part",
        "party",
        "oppose",
        "ofttimes",
        "obstruct",
        "many",
        "time",
        "forced",
        "move",
        "may",
        "would",
        "cavendish",
        "b",
        "particular",
        "creature",
        "hath",
        "absolute",
        "power",
        "selfmoving",
        "creature",
        "hath",
        "advantage",
        "strength",
        "subtilty",
        "policy",
        "shape",
        "figure",
        "like",
        "may",
        "oppose",
        "overpower",
        "another",
        "inferior",
        "yet",
        "hinderance",
        "opposition",
        "doth",
        "take",
        "away",
        "selfmotion",
        "cavendish",
        "body",
        "never",
        "loses",
        "motion",
        "motion",
        "never",
        "transferred",
        "one",
        "body",
        "another",
        "body",
        "redirect",
        "motion",
        "second",
        "body",
        "already",
        "way",
        "might",
        "give",
        "appearance",
        "motion",
        "transferred",
        "cavendish",
        "allow",
        "appearance",
        "tell",
        "part",
        "story",
        "given",
        "bodybody",
        "interaction",
        "also",
        "make",
        "sure",
        "story",
        "informed",
        "deeper",
        "metaphysical",
        "consideration",
        "like",
        "strictly",
        "speaking",
        "body",
        "motion",
        "inseparable",
        "given",
        "body",
        "never",
        "loses",
        "acquires",
        "motion",
        "according",
        "cavendish",
        "instead",
        "motion",
        "body",
        "always",
        "selfmotion",
        "draw",
        "conclusion",
        "motion",
        "occur",
        "sense",
        "organ",
        "object",
        "perceived",
        "motion",
        "selfmotions",
        "motion",
        "transfered",
        "object",
        "perceived",
        "transfer",
        "unintelligible",
        "new",
        "motion",
        "transfered",
        "object",
        "perceived",
        "unless",
        "sense",
        "organ",
        "get",
        "bigger",
        "impressed",
        "upon",
        "sense",
        "organ",
        "body",
        "travel",
        "air",
        "stamp",
        "organ",
        "instead",
        "motion",
        "sense",
        "organ",
        "selfmotions",
        "sense",
        "organ",
        "pattern",
        "image",
        "perceived",
        "body",
        "via",
        "motion",
        "possessed",
        "along",
        "print",
        "understand",
        "figure",
        "object",
        "patterned",
        "copied",
        "sensitive",
        "rational",
        "corporeal",
        "figurative",
        "motion",
        "example",
        "sensitive",
        "corporeal",
        "motion",
        "pattern",
        "figure",
        "exterior",
        "object",
        "rational",
        "motion",
        "pattern",
        "figure",
        "made",
        "sensitive",
        "motion",
        "figure",
        "object",
        "patterned",
        "name",
        "print",
        "thus",
        "print",
        "understand",
        "pattern",
        "printing",
        "patterning",
        "exterior",
        "object",
        "print",
        "figure",
        "upon",
        "exterior",
        "sensitive",
        "organ",
        "sensitive",
        "motion",
        "organ",
        "pattern",
        "figure",
        "object",
        "cavendish",
        "causal",
        "participant",
        "sensory",
        "perception",
        "active",
        "say",
        "sense",
        "organ",
        "usually",
        "regarded",
        "passive",
        "active",
        "body",
        "perceived",
        "also",
        "cause",
        "cavendish",
        "call",
        "occasional",
        "cause",
        "say",
        "thing",
        "may",
        "occasional",
        "cause",
        "thing",
        "prime",
        "principal",
        "causes",
        "cavendish",
        "commentator",
        "worried",
        "even",
        "allow",
        "cavendish",
        "view",
        "body",
        "active",
        "vital",
        "source",
        "motion",
        "way",
        "account",
        "body",
        "communicate",
        "successfully",
        "nothing",
        "transmitted",
        "body",
        "seem",
        "suggest",
        "detlefsen",
        "induc",
        "e",
        "neill",
        "xxx",
        "perhaps",
        "transmit",
        "sort",
        "signal",
        "trigger",
        "selfmotion",
        "body",
        "move",
        "michaelian",
        "question",
        "detlefsen",
        "writes",
        "although",
        "true",
        "transfer",
        "motion",
        "body",
        "case",
        "interaction",
        "occasional",
        "causation",
        "still",
        "sort",
        "causal",
        "interaction",
        "first",
        "body",
        "induces",
        "second",
        "body",
        "act",
        "possible",
        "nothing",
        "physically",
        "transferred",
        "detlefsen",
        "neill",
        "point",
        "way",
        "answer",
        "first",
        "point",
        "even",
        "though",
        "cavendish",
        "body",
        "never",
        "transfer",
        "motion",
        "second",
        "body",
        "still",
        "serf",
        "partial",
        "cause",
        "movement",
        "neill",
        "xxxxxxi",
        "cavendish",
        "say",
        "say",
        "motion",
        "hand",
        "contribute",
        "motion",
        "ball",
        "though",
        "ball",
        "natural",
        "motion",
        "nevertheless",
        "motion",
        "ball",
        "would",
        "move",
        "exterior",
        "local",
        "motion",
        "motion",
        "hand",
        "exterior",
        "moving",
        "body",
        "give",
        "occasion",
        "move",
        "way",
        "wherefore",
        "motion",
        "hand",
        "may",
        "well",
        "said",
        "cause",
        "exterior",
        "local",
        "motion",
        "ball",
        "motion",
        "ball",
        "move",
        "cavendish",
        "clear",
        "occasional",
        "cause",
        "contributes",
        "motion",
        "second",
        "body",
        "case",
        "occasional",
        "cause",
        "oppose",
        "overpower",
        "another",
        "inferior",
        "it",
        "occasional",
        "cause",
        "hinder",
        "second",
        "body",
        "force",
        "move",
        "way",
        "otherwise",
        "would",
        "second",
        "body",
        "still",
        "move",
        "selfmotion",
        "hinderance",
        "opposition",
        "doth",
        "take",
        "away",
        "selfmotion",
        "motion",
        "never",
        "transfered",
        "one",
        "body",
        "another",
        "motion",
        "body",
        "even",
        "motion",
        "body",
        "overpowered",
        "motion",
        "body",
        "possessed",
        "along",
        "occasional",
        "cause",
        "still",
        "redirects",
        "selfmotion",
        "second",
        "body",
        "redirects",
        "selfmotion",
        "second",
        "body",
        "say",
        "redirects",
        "motion",
        "second",
        "body",
        "already",
        "note",
        "cavendish",
        "us",
        "language",
        "occasional",
        "cause",
        "example",
        "cavendish",
        "understanding",
        "occasional",
        "causation",
        "thcentury",
        "contemporary",
        "like",
        "malebranche",
        "boyle",
        "cavendish",
        "occasional",
        "cause",
        "something",
        "trigger",
        "occasion",
        "motion",
        "already",
        "inseparable",
        "affected",
        "body",
        "cavendish",
        "make",
        "sense",
        "case",
        "mundane",
        "considers",
        "example",
        "sensory",
        "perception",
        "distant",
        "object",
        "like",
        "sun",
        "would",
        "expect",
        "hold",
        "occasional",
        "cause",
        "play",
        "active",
        "role",
        "respect",
        "prompting",
        "motion",
        "already",
        "eye",
        "hold",
        "eye",
        "play",
        "active",
        "role",
        "well",
        "writes",
        "neither",
        "influence",
        "star",
        "performed",
        "beyond",
        "certain",
        "distance",
        "distance",
        "beyond",
        "sight",
        "natural",
        "power",
        "work",
        "light",
        "come",
        "eye",
        "know",
        "reason",
        "effect",
        "may",
        "come",
        "body",
        "cavendish",
        "perceive",
        "distant",
        "body",
        "light",
        "travel",
        "body",
        "sense",
        "organ",
        "something",
        "sense",
        "organ",
        "light",
        "add",
        "new",
        "motion",
        "sense",
        "organ",
        "absurd",
        "instead",
        "light",
        "redirects",
        "body",
        "sense",
        "organ",
        "form",
        "pattern",
        "distant",
        "body",
        "next",
        "sentence",
        "cavendish",
        "offer",
        "account",
        "causal",
        "process",
        "creature",
        "acquires",
        "disease",
        "say",
        "infectious",
        "disease",
        "come",
        "corporeal",
        "imitation",
        "touch",
        "either",
        "infected",
        "air",
        "drawn",
        "breath",
        "entring",
        "pore",
        "body",
        "thing",
        "brought",
        "infected",
        "places",
        "ibid",
        "cavendish",
        "occasional",
        "causation",
        "occurs",
        "contact",
        "body",
        "redirects",
        "selfmotion",
        "second",
        "body",
        "body",
        "interact",
        "body",
        "contact",
        "hinder",
        "redirect",
        "never",
        "transfer",
        "motion",
        "case",
        "perception",
        "selfmotions",
        "sense",
        "organ",
        "pattern",
        "image",
        "distant",
        "body",
        "upon",
        "arrival",
        "light",
        "medium",
        "would",
        "expect",
        "cavendish",
        "hold",
        "light",
        "travel",
        "way",
        "distant",
        "body",
        "instead",
        "light",
        "patterned",
        "air",
        "light",
        "plenum",
        "matter",
        "lie",
        "inbetween",
        "object",
        "perceiver",
        "end",
        "sense",
        "organ",
        "pattern",
        "air",
        "light",
        "say",
        "air",
        "pattern",
        "light",
        "sun",
        "sensitive",
        "motion",
        "eye",
        "animal",
        "pattern",
        "light",
        "air",
        "cavendish",
        "owns",
        "consequence",
        "plenum",
        "material",
        "universe",
        "lot",
        "patterning",
        "take",
        "place",
        "notice",
        "object",
        "creature",
        "pattern",
        "threshold",
        "awareness",
        "cavendish",
        "a",
        "bit",
        "light",
        "travel",
        "way",
        "object",
        "perceiver",
        "light",
        "pas",
        "wall",
        "instead",
        "patterning",
        "abounds",
        "along",
        "line",
        "newton",
        "cradle"
    ]
}