{
    "main_text": "God\n6. God\n\nWe have seen that Cavendish holds that natural reason cannot perceive\nor have an idea of an immaterial being. She says in particular that\n“as for Immaterial, no mind can conceive that” (Cavendish\n1664, 69) and that “when we name God, we name an Unexpressible,\nand Incomprehensible Being” (Cavendish 1664, 315). One way to\nreconcile her view that we cannot have ideas of immaterials with her\nnumerous attempts to speak of God is to say that she is attempting to\nspeak in the language of her opponents. A problem, however, is that\nthere are passages in which she appears to be doing a lot more.\nFor example, she writes that,\n\n\nI Sent you word in my last, I would not meddle with writing any thing\nof the Divine Soul of Man, by reason it belongs to Faith and Religion,\nand not to Natural Philosophy; but since you desire my opinion\nconcerning the Immortality of the Divine Soul, I cannot but answer you\nplainly, that first I did wonder much you made me question of that,\nwhose truth, in my opinion, is so clear, as hardly any rational man\nwill make a doubt of it; for I think there is almost no Christian in\nthe world, but believes the Immortality of the Soul, no not Christians\nonely, but Mahometans and Jews: But I left to wonder at you, when I\nsaw Wise and Learned Men, and great Divines, take so much pains as to\nwrite whole Volumes, and bring so many arguments to prove the\nImmortality of the Soul, for this was a greater Miracle to me, then if\nNature had shewed me some of her secret and hidden effects, or if I\nhad seen an Immaterial Spirit. Certainly, Madam, it seems as\nstrange to me to prove the Immortality of the Soul, as to convert\nAtheists; for it is impossible, almost, that any Atheist should be\nfound in the World: For what Man would be so senceless as to deny a\nGod? Wherefore to prove either a God, or the Immortality of the Soul,\nis to make a man doubt of either: for as Physicians and Surgeons apply\nstrengthening Medicines onely to those parts of the body which they\nsuppose the weakest, so it is with proofs and arguments, those being\nfor the most part used in such subjects, the truth of which is most\nquestionable. (Cavendish 1664, 220)\n\n\nHere Cavendish is stating quite straightforwardly that we can have\nfaith in the existence of immaterials, and in particular in the\nexistence of God, but that immaterials are not within the province of\nnatural reason. If so, Cavendish is reflecting the view that our best\nand only interface with God is via faith; she is reflecting her\ncommitment to fideism.\n\nA problem, of course, is that it would seem that a person would need\nto have an idea of God in order to have faith that God exists.\nCavendish is clear that we can have an idea of the effects of\nGod’s omnipotence, but she does not think that natural reason can have\nan idea of an immaterial itself. We can have an idea that there is a\ncause of these effects, but not an idea of what the cause is, or what\nit is that makes that idea and idea of God as opposed to something\nelse. Cavendish might posit that we have supernatural and immaterial\nsouls and that these can have an idea of God, but the question again\nis how she would be entitled to make suppositions about immaterial\nsouls. One of her aims in circumscribing the limits of natural\nphilosophy is presumably to make room for faith, but there is a worry\nthat she has gone too far in holding that we cannot have ideas of\nimmaterials. As Descartes remarks,\n\n…[I]f someone says of himself that he does not have any idea of\nGod,… he is making the most impious confession he could make.\nHe is saying that he does not know God by natural reason, but also\nthat neither faith nor any other means could give him any knowledge of\nGod. For if one has no idea, i.e. no perception which corresponds to\nthe meaning of the word ‘God’, it is no use saying that\none believes that God exists. One might as well say that one\nbelieves that nothing exists, thus remaining in the abyss of impiety\nand the depths of ignorance. (Descartes 1641, 273)\n\n\nGod is not to be conceived or understood, according to Cavendish, but\n“is rather to be admired, adored and worshipped.” We do\nnot have any idea of Him, however, and so it is difficult to make\nsense of how our intentional states could ever point specifically in\nHis direction.\n\nCavendish appears to be committed to the view that the only things of\nwhich we can think or speak are material things that we can detect. In\nsome passages, she refers to God and His infinitude in order highlight\nthat God is beyond us and to highlight the limits of human\nunderstanding. In such passages, Cavendish might be speaking of God in\nways that are in tension with her view that we do not have ideas of\nimmaterials. An alternate explanation is that she might instead be\nattempting to rein in the ambitions of natural reason. She writes,\n\nShall or can we bind up Gods actions with our weak opinions and\nfoolish arguments? Truly, if God could not act more then [sic] Man is\nable to conceive, he were not a God of an infinite Power; but God is\nOmnipotent, and his actions are infinite, supernatural, and past\nfinding out; wherefore he is rather to be admired, adored and\nworshipped, then to be ungloriously discoursed of by vain and\nambitious men, whose foolish pride and presumption drowns their\nNatural Judgment and Reason…. (Cavendish 1664, 527)\n\n\nCavendish is clear in this passage that if a finite mind is able to\nsubsume a being under its necessarily limited ideas and categories,\nthen whatever that being is, it is not God. Our attempts to\ninvestigate the ways and nature of God are hopeless, and accordingly,\nwe should restrict our faculties to a subject matter to which they are\nappropriately\n fitted.[34]\n Even then, we should still be appropriately humble and fallibilistic.\nCavendish’s criticism of the scientist William Harvey is a case in\npoint:\n\nhe doth speak so presumptuously of Gods Actions, Designs, Decrees,\nLaws, Attributes, Power, and secret Counsels, and describes the\nmanner, how God created all things, and the mixture of the Elements to\nan hair, as if he had been Gods Counsellor and Assistant in the work\nof Creation; which whether it be not more impiety, then to say Matter\nis Infinite, I’le let others judg [sic]. Neither do I think this\nexpression to be against the holy Scripture; for though I speak as a\nnatural Philosopher, and am unwilling to cite the Scripture, which\nonely treats of things belonging to Faith, and not to Reason; yet I\nthink there is not any passage which plainly denies Matter to be\ninfinite, and Eternal, unless it be drawn by force to that\nsense…. [A]lso the Scripture says, That Gods ways are\nunsearchable, and past finding out. (Cavendish 1664, 462)\n\n\nHere Cavendish is also referencing her view that matter is eternal,\nwhich she thinks is an obvious consequence of the datum that it is\n“impossible, to wit, that something should be made or produced\nout of nothing” (Cavendish 1664, 53). Not wanting to ground her\nmetaphysics in ideas of God that we do not have, she does not want to\nventure that God created matter out of nothing, and the only remaining\noption if something cannot come from nothing is to suppose that it is\neternal. She wants to emphasize however that it is not heretical to\nsay that the matter out of which the earth and heavens are created has\nno beginning of existence itself, and so in the passage immediately\nabove she highlights that there are no passages in scripture that deny\nthat. Cavendish is not the most humble philosopher, but she is careful\nto exercise restraint when it comes to matters that our beyond our\nken. She is assuming that there is a difference between the domains\nthat our minds are capable of investigating and the domains that piety\nsuggests are not accessible to us. Infallibilism with respect to\neither domain is inappropriate, but it is especially so with respect\nto the\n second.[35]\n\nIn some passages Cavendish speaks of God to say that He is\ninconceivable and inexpressible. In other passages she speaks of God\nto say that our knowledge of His existence has to be via faith and not\nnatural reason. In other passages she speaks of God to highlight the\nways in which a finite mind should not expect to understand matters\nthat are beyond it. In other passages she speaks of God to offer\npositive evidence for her view that everything in nature is material.\nFor example, she says that it follows from the premise that God is\ngood and just that He would make sure that all of His creatures would\nbe able to worship Him, and so would make sure that all of His\ncreatures had knowledge and perception (Cavendish 1664, 518–9).\nShe also speaks of God’s creation of everything, including the\nintellectual and perceptual capacities of matter, as a way of making\nsense of the teleology that we find (and that given the features of\nthe creator we would expect to find) in\n nature.[36] If\n God creates everything, however, and matter is eternal, and then God\nand matter would appear to be co-eternal.\n\nFor all of its apparent problems, one of the reasons that it is\nimportant to remark upon Cavendish’s view on our inability to conceive\nof God is to highlight that even though she thinks that the organized\nbehavior of bodies is due to intelligence, she does not subscribe to\nany version of a theory of intelligent design. There is a difference\nbetween the thesis that the orderly behavior of bodies is due to the\nintelligence and perceptual capacities of the bodies themselves and\nthe thesis that it is due to the intelligence of a designer. Cavendish\nmight add that either thesis has to posit the existence of intelligent\nand perceptive matter. If God had created matter that was not equipped\nwith the resources to detect the matter around it and act in ways that\nare coordinated, chaos would ensue almost immediately. Cavendish\nis forced to admit that if matter is intelligent and\nperceptive, there is no further explanation as to why it is\nintelligent and perceptive, or at least not one that can be known by\nnatural reason. Intelligence and perceptive matter just is. It is\nsomething that has always existed (Cavendish 1664, 14, 462) and it has\nthe resources within itself to bring about all the things that we\nobserve it to bring about on a daily basis. She would side with Hume\non the question of whether or not it is more likely that the only\nbeings that exist with such resources are immaterial:\n\n…when it is asked, what cause produces order in the ideas of\nthe supreme Being, can any other reason be assigned by you,\nanthropomorphites, than that it is a rational faculty, and\nthat such is the nature of the Deity? But why a similar\nanswer will not be equally satisfactory in accounting for the order of\nthe world, without having recourse to any such intelligent Creator as\nyou insist on, may be difficult to determine. It is only to say, that\nsuch is the nature of material objects, and that they are all\noriginally possessed of a faculty of order and proportion.\n(Hume 1779, dialogue 4, p. 65)\n\n\nFor Cavendish, matter has a tremendous number of resources built into\nit. If it is eternal, then we can offer no account of its origin, but\nin this respect the competing thesis that God is the source of the\norder in the universe is on a par. The latter thesis has additional\nproblems, however: if God is wholly immaterial, then it is not clear\nhow He could produce matter, or how He would be able to interact with\nit once it was made (Cavendish 1668a, 199–200; Cavendish 1668b,\n241; Detlefsen 2009, 430); and if God’s supremacy is inversely\nproportional to our finite ability to conceive of Him, it is difficult\nto see how our confidence about His nature and operations could be\nanything more than arrogance. Cavendish thinks that the view that\nmatter has always existed and is the source of its own order is not\nonly a contender, but is really the only option.\n",
    "section_title": "6. God",
    "entry_title": "Margaret Lucas Cavendish",
    "hierarchy_title": "Margaret Lucas Cavendish || God",
    "tokenized_text": [
        "god",
        "god",
        "seen",
        "cavendish",
        "hold",
        "natural",
        "reason",
        "perceive",
        "idea",
        "immaterial",
        "say",
        "particular",
        "immaterial",
        "mind",
        "conceive",
        "cavendish",
        "name",
        "god",
        "name",
        "unexpressible",
        "incomprehensible",
        "cavendish",
        "one",
        "way",
        "reconcile",
        "view",
        "idea",
        "immaterials",
        "numerous",
        "attempt",
        "speak",
        "god",
        "say",
        "attempting",
        "speak",
        "language",
        "opponent",
        "problem",
        "however",
        "passage",
        "appears",
        "lot",
        "example",
        "writes",
        "sent",
        "word",
        "last",
        "would",
        "meddle",
        "writing",
        "thing",
        "divine",
        "soul",
        "man",
        "reason",
        "belongs",
        "faith",
        "religion",
        "natural",
        "philosophy",
        "since",
        "desire",
        "opinion",
        "concerning",
        "immortality",
        "divine",
        "soul",
        "answer",
        "plainly",
        "first",
        "wonder",
        "much",
        "made",
        "question",
        "whose",
        "truth",
        "opinion",
        "clear",
        "hardly",
        "rational",
        "man",
        "make",
        "doubt",
        "think",
        "almost",
        "christian",
        "world",
        "belief",
        "immortality",
        "soul",
        "christian",
        "onely",
        "mahometans",
        "jew",
        "left",
        "wonder",
        "saw",
        "wise",
        "learned",
        "men",
        "great",
        "divine",
        "take",
        "much",
        "pain",
        "write",
        "whole",
        "volume",
        "bring",
        "many",
        "argument",
        "prove",
        "immortality",
        "soul",
        "greater",
        "miracle",
        "nature",
        "shewed",
        "secret",
        "hidden",
        "effect",
        "seen",
        "immaterial",
        "spirit",
        "certainly",
        "madam",
        "seems",
        "strange",
        "prove",
        "immortality",
        "soul",
        "convert",
        "atheist",
        "impossible",
        "almost",
        "atheist",
        "found",
        "world",
        "man",
        "would",
        "senceless",
        "deny",
        "god",
        "wherefore",
        "prove",
        "either",
        "god",
        "immortality",
        "soul",
        "make",
        "man",
        "doubt",
        "either",
        "physician",
        "surgeon",
        "apply",
        "strengthening",
        "medicine",
        "onely",
        "part",
        "body",
        "suppose",
        "weakest",
        "proof",
        "argument",
        "part",
        "used",
        "subject",
        "truth",
        "questionable",
        "cavendish",
        "cavendish",
        "stating",
        "quite",
        "straightforwardly",
        "faith",
        "existence",
        "immaterials",
        "particular",
        "existence",
        "god",
        "immaterials",
        "within",
        "province",
        "natural",
        "reason",
        "cavendish",
        "reflecting",
        "view",
        "best",
        "interface",
        "god",
        "via",
        "faith",
        "reflecting",
        "commitment",
        "fideism",
        "problem",
        "course",
        "would",
        "seem",
        "person",
        "would",
        "need",
        "idea",
        "god",
        "order",
        "faith",
        "god",
        "exists",
        "cavendish",
        "clear",
        "idea",
        "effect",
        "god",
        "omnipotence",
        "think",
        "natural",
        "reason",
        "idea",
        "immaterial",
        "idea",
        "cause",
        "effect",
        "idea",
        "cause",
        "make",
        "idea",
        "idea",
        "god",
        "opposed",
        "something",
        "else",
        "cavendish",
        "might",
        "posit",
        "supernatural",
        "immaterial",
        "soul",
        "idea",
        "god",
        "question",
        "would",
        "entitled",
        "make",
        "supposition",
        "immaterial",
        "soul",
        "one",
        "aim",
        "circumscribing",
        "limit",
        "natural",
        "philosophy",
        "presumably",
        "make",
        "room",
        "faith",
        "worry",
        "gone",
        "far",
        "holding",
        "idea",
        "immaterials",
        "descartes",
        "remark",
        "f",
        "someone",
        "say",
        "idea",
        "god",
        "making",
        "impious",
        "confession",
        "could",
        "make",
        "saying",
        "know",
        "god",
        "natural",
        "reason",
        "also",
        "neither",
        "faith",
        "mean",
        "could",
        "give",
        "knowledge",
        "god",
        "one",
        "idea",
        "ie",
        "perception",
        "corresponds",
        "meaning",
        "word",
        "god",
        "use",
        "saying",
        "one",
        "belief",
        "god",
        "exists",
        "one",
        "might",
        "well",
        "say",
        "one",
        "belief",
        "nothing",
        "exists",
        "thus",
        "remaining",
        "abyss",
        "impiety",
        "depth",
        "ignorance",
        "descartes",
        "god",
        "conceived",
        "understood",
        "according",
        "cavendish",
        "rather",
        "admired",
        "adored",
        "worshipped",
        "idea",
        "however",
        "difficult",
        "make",
        "sense",
        "intentional",
        "state",
        "could",
        "ever",
        "point",
        "specifically",
        "direction",
        "cavendish",
        "appears",
        "committed",
        "view",
        "thing",
        "think",
        "speak",
        "material",
        "thing",
        "detect",
        "passage",
        "refers",
        "god",
        "infinitude",
        "order",
        "highlight",
        "god",
        "beyond",
        "u",
        "highlight",
        "limit",
        "human",
        "understanding",
        "passage",
        "cavendish",
        "might",
        "speaking",
        "god",
        "way",
        "tension",
        "view",
        "idea",
        "immaterials",
        "alternate",
        "explanation",
        "might",
        "instead",
        "attempting",
        "rein",
        "ambition",
        "natural",
        "reason",
        "writes",
        "shall",
        "bind",
        "god",
        "action",
        "weak",
        "opinion",
        "foolish",
        "argument",
        "truly",
        "god",
        "could",
        "act",
        "sic",
        "man",
        "able",
        "conceive",
        "god",
        "infinite",
        "power",
        "god",
        "omnipotent",
        "action",
        "infinite",
        "supernatural",
        "past",
        "finding",
        "wherefore",
        "rather",
        "admired",
        "adored",
        "worshipped",
        "ungloriously",
        "discoursed",
        "vain",
        "ambitious",
        "men",
        "whose",
        "foolish",
        "pride",
        "presumption",
        "drowns",
        "natural",
        "judgment",
        "reason",
        "cavendish",
        "cavendish",
        "clear",
        "passage",
        "finite",
        "mind",
        "able",
        "subsume",
        "necessarily",
        "limited",
        "idea",
        "category",
        "whatever",
        "god",
        "attempt",
        "investigate",
        "way",
        "nature",
        "god",
        "hopeless",
        "accordingly",
        "restrict",
        "faculty",
        "subject",
        "matter",
        "appropriately",
        "fitted",
        "even",
        "still",
        "appropriately",
        "humble",
        "fallibilistic",
        "cavendish",
        "criticism",
        "scientist",
        "william",
        "harvey",
        "case",
        "point",
        "doth",
        "speak",
        "presumptuously",
        "god",
        "action",
        "design",
        "decree",
        "law",
        "attribute",
        "power",
        "secret",
        "counsel",
        "describes",
        "manner",
        "god",
        "created",
        "thing",
        "mixture",
        "element",
        "hair",
        "god",
        "counsellor",
        "assistant",
        "work",
        "creation",
        "whether",
        "impiety",
        "say",
        "matter",
        "infinite",
        "le",
        "let",
        "others",
        "judg",
        "sic",
        "neither",
        "think",
        "expression",
        "holy",
        "scripture",
        "though",
        "speak",
        "natural",
        "philosopher",
        "unwilling",
        "cite",
        "scripture",
        "onely",
        "treat",
        "thing",
        "belonging",
        "faith",
        "reason",
        "yet",
        "think",
        "passage",
        "plainly",
        "denies",
        "matter",
        "infinite",
        "eternal",
        "unless",
        "drawn",
        "force",
        "sense",
        "lso",
        "scripture",
        "say",
        "god",
        "way",
        "unsearchable",
        "past",
        "finding",
        "cavendish",
        "cavendish",
        "also",
        "referencing",
        "view",
        "matter",
        "eternal",
        "think",
        "obvious",
        "consequence",
        "datum",
        "impossible",
        "wit",
        "something",
        "made",
        "produced",
        "nothing",
        "cavendish",
        "wanting",
        "ground",
        "metaphysics",
        "idea",
        "god",
        "want",
        "venture",
        "god",
        "created",
        "matter",
        "nothing",
        "remaining",
        "option",
        "something",
        "come",
        "nothing",
        "suppose",
        "eternal",
        "want",
        "emphasize",
        "however",
        "heretical",
        "say",
        "matter",
        "earth",
        "heaven",
        "created",
        "beginning",
        "existence",
        "passage",
        "immediately",
        "highlight",
        "passage",
        "scripture",
        "deny",
        "cavendish",
        "humble",
        "philosopher",
        "careful",
        "exercise",
        "restraint",
        "come",
        "matter",
        "beyond",
        "ken",
        "assuming",
        "difference",
        "domain",
        "mind",
        "capable",
        "investigating",
        "domain",
        "piety",
        "suggests",
        "accessible",
        "u",
        "infallibilism",
        "respect",
        "either",
        "domain",
        "inappropriate",
        "especially",
        "respect",
        "second",
        "passage",
        "cavendish",
        "speaks",
        "god",
        "say",
        "inconceivable",
        "inexpressible",
        "passage",
        "speaks",
        "god",
        "say",
        "knowledge",
        "existence",
        "via",
        "faith",
        "natural",
        "reason",
        "passage",
        "speaks",
        "god",
        "highlight",
        "way",
        "finite",
        "mind",
        "expect",
        "understand",
        "matter",
        "beyond",
        "passage",
        "speaks",
        "god",
        "offer",
        "positive",
        "evidence",
        "view",
        "everything",
        "nature",
        "material",
        "example",
        "say",
        "follows",
        "premise",
        "god",
        "good",
        "would",
        "make",
        "sure",
        "creature",
        "would",
        "able",
        "worship",
        "would",
        "make",
        "sure",
        "creature",
        "knowledge",
        "perception",
        "cavendish",
        "also",
        "speaks",
        "god",
        "creation",
        "everything",
        "including",
        "intellectual",
        "perceptual",
        "capacity",
        "matter",
        "way",
        "making",
        "sense",
        "teleology",
        "find",
        "given",
        "feature",
        "creator",
        "would",
        "expect",
        "find",
        "nature",
        "god",
        "creates",
        "everything",
        "however",
        "matter",
        "eternal",
        "god",
        "matter",
        "would",
        "appear",
        "coeternal",
        "apparent",
        "problem",
        "one",
        "reason",
        "important",
        "remark",
        "upon",
        "cavendish",
        "view",
        "inability",
        "conceive",
        "god",
        "highlight",
        "even",
        "though",
        "think",
        "organized",
        "behavior",
        "body",
        "due",
        "intelligence",
        "subscribe",
        "version",
        "theory",
        "intelligent",
        "design",
        "difference",
        "thesis",
        "orderly",
        "behavior",
        "body",
        "due",
        "intelligence",
        "perceptual",
        "capacity",
        "body",
        "thesis",
        "due",
        "intelligence",
        "designer",
        "cavendish",
        "might",
        "add",
        "either",
        "thesis",
        "posit",
        "existence",
        "intelligent",
        "perceptive",
        "matter",
        "god",
        "created",
        "matter",
        "equipped",
        "resource",
        "detect",
        "matter",
        "around",
        "act",
        "way",
        "coordinated",
        "chaos",
        "would",
        "ensue",
        "almost",
        "immediately",
        "cavendish",
        "forced",
        "admit",
        "matter",
        "intelligent",
        "perceptive",
        "explanation",
        "intelligent",
        "perceptive",
        "least",
        "one",
        "known",
        "natural",
        "reason",
        "intelligence",
        "perceptive",
        "matter",
        "something",
        "always",
        "existed",
        "cavendish",
        "resource",
        "within",
        "bring",
        "thing",
        "observe",
        "bring",
        "daily",
        "basis",
        "would",
        "side",
        "hume",
        "question",
        "whether",
        "likely",
        "being",
        "exist",
        "resource",
        "immaterial",
        "when",
        "asked",
        "cause",
        "produce",
        "order",
        "idea",
        "supreme",
        "reason",
        "assigned",
        "anthropomorphites",
        "rational",
        "faculty",
        "nature",
        "deity",
        "similar",
        "answer",
        "equally",
        "satisfactory",
        "accounting",
        "order",
        "world",
        "without",
        "recourse",
        "intelligent",
        "creator",
        "insist",
        "may",
        "difficult",
        "determine",
        "say",
        "nature",
        "material",
        "object",
        "originally",
        "possessed",
        "faculty",
        "order",
        "proportion",
        "hume",
        "dialogue",
        "p",
        "cavendish",
        "matter",
        "tremendous",
        "number",
        "resource",
        "built",
        "eternal",
        "offer",
        "account",
        "origin",
        "respect",
        "competing",
        "thesis",
        "god",
        "source",
        "order",
        "universe",
        "par",
        "latter",
        "thesis",
        "additional",
        "problem",
        "however",
        "god",
        "wholly",
        "immaterial",
        "clear",
        "could",
        "produce",
        "matter",
        "would",
        "able",
        "interact",
        "made",
        "cavendish",
        "a",
        "cavendish",
        "b",
        "detlefsen",
        "god",
        "supremacy",
        "inversely",
        "proportional",
        "finite",
        "ability",
        "conceive",
        "difficult",
        "see",
        "confidence",
        "nature",
        "operation",
        "could",
        "anything",
        "arrogance",
        "cavendish",
        "think",
        "view",
        "matter",
        "always",
        "existed",
        "source",
        "order",
        "contender",
        "really",
        "option"
    ]
}