{
    "main_text": "Principal Contributions || Natural Theology and Philosophy of Religion\n3.4 Natural Theology and Philosophy of Religion\n\nLike Aquinas, Maritain held that there was no conflict between true\nfaith and true reason, that religious belief was open to rational\ndiscussion, and that the existence of God and certain fundamental\nreligious beliefs could be philosophically demonstrated. (Maritain\nheld, however, that ‘Russellian mathematical logic’ was\n“inferior to traditional Aristotelian logic”, and that any\ndemonstration of religious belief needed to follow Aristotelian\nsyllogistic; Introduction to Logic, 1923 [1937a:\n222–232]; Kraal 2013: 357.) Religious belief, then, was not an\nattitude or a matter of private opinion—an option that could be\nembraced or not according to one’s private preferences; it was a\nmatter of ‘truth’. For Maritain, one must choose between\n“the true God or radical irrationality” (Introduction\nto Philosophy, 1920 [1944: 259]). \n\nMaritain held that philosophy was an ancilla theologiae\n(“handmaid of theology”), and that philosophy, under the\nrubric of metaphysical knowledge, allows for the demonstration of a\nnumber of basic religious beliefs. Like Aquinas, Maritain accepted the\nclassical foundationalist position that these beliefs could be\nestablished by rational deduction from self-evident principles and\nconstituted genuine knowledge. Specifically, he held that, by the use\nof natural reason, one can come to know certain truths about God, and\nthat the ‘five ways’ of Thomas Aquinas provided sure\nknowledge of God’s existence. But Maritain also argued that\nthere could be other ‘proofs’ of the existence of the\ndivine and, in Approches de Dieu (1953), he developed what he\ncalled a “sixth way”.\n\nThere is, Maritain writes, an intuition that is awakened in persons\nwhen they are engaged in thought—that is, that it seems\nimpossible that they, as thinking beings, should at some time have not\nbeen. As a thinking being, one seems to be free from the vicissitudes\nof time and space; there is no coming to be or ceasing to be—I\ncannot think what it is not to be. Nevertheless, we all know very well\nthat we were born—we came into existence. We are confronted,\nthen, with a contradiction—not a logical contradiction, but a\nlived contradiction. The only solution to this is that one has always\nexisted, but not through oneself, but within “a Being of\ntranscendent personality” and from whom “the self which is\nthinking now proceeded into temporal existence” (Approches\nde Dieu, in Oeuvres complètes, Vol. X, p. 64 [Engl. tr., pp. 71–72]). This being \n\n\nmust contain all things in itself in an eminent mode and be\nitself—in an absolutely transcendent way—being, thought\nand personality. This implies that the first existence is the infinite\nplenitude of being, separate by essence from all diversity of\nexistents. (ibid., p. 66 [Engl. tr., p. 74])\n\n\nMaritain also acknowledges the possibility of a natural,\npre-philosophical, but still rational knowledge of God (see\nApproches de Dieu, pp. 13–22).\nThis is, Maritain claims, a\n‘knowledge’ that is necessary to—and, in fact leads\nto—a philosophical demonstration of God’s existence. (In\nthis way, then, one can know that some religious beliefs are true,\neven without being able to demonstrate them.) Maritain’s\nargument, which resembles the Thomistic argument from contingent\nbeing, is that, in one’s intuition of being, one is aware,\nfirst, of a reality separate from oneself; second, of oneself as\nfinite and limited; and, third, of the necessity that there is\nsomething “completely free from nothingness and death”\n(ibid., p. 15 [Engl. tr., p. 19]).\nThis is concurrent with a “spontaneous reasoning” that\nfollows the same course to the conclusion that there is \n\n\nanother Whole […] another Being, transcendent and\nself-sufficient and unknown in itself and activating all beings\n[…] that is, self-subsisting Being, Being existing through\nitself. (ibid., p. 16 [Engl. tr., p. 20])\n\n\n\nThis knowledge of God, Maritain admits, is not demonstrative but is,\nnevertheless, “rich in certitude” (ibid., p.\n19 [Engl. tr., p. 23]) and is both presupposed\nby, and is the underlying force for, philosophical demonstrations of\nGod’s existence.\n\nThe difference between the pre-philosophical and the philosophical\nknowledge of God is that the latter is one which is based on a\n“scientific demonstration” (Approches de Dieu, p.\n19 [Engl. tr., p. 23])—on empirical\nfacts—and involving analogy, from which we have terms that can\nbe properly predicated of the divine. On the other hand,\npre-philosophical knowledge is “intuition”—an\napproach to knowledge, though not a “way”,\n(ibid., p. 20 [Engl. tr., p. 24]) a proof, or a\ndemonstration. This knowledge is based on a natural reasoning which\ncannot be expressed in words. Yet, it is important also to realize\nthat while Maritain allows that certain truths “are grasped by\nthe common sense before being the object of philosophical\nconcern” (ibid., p. 24 [Engl. tr., p. 30]),\nphilosophical proofs of the existence of God are not only\n“established and justified philosophically” at the level\nof philosophy itself, but are already “valid and\nefficacious” at the level of this “incohative and\nspontaneous” philosophy. (ibid., p.  24 [Engl. tr.,\np. 30]), and that what one arrives at by means of such an approach is\n(as it is in philosophical demonstrations) knowledge of the truth of a\nproposition.\n\nIt has been argued, however, that there are some difficulties with\nMaritain’s position here. For example, even if it is true that\npeople may ‘naturally’ affirm the proposition that there\nis a God, it is not obvious how they can claim that they know\nit. In other words, even if the proposition is true, it is not clear\nhow we can say that we know or believe it to be true. What Maritain\nseems to give us here is an explanation of how one arrives at a\ncertain proposition and of one’s certainty, but nothing more.\nBut, since the state of certainty of an individual is not the same as\nthe assertion that that person knows something to be true, it is not\nclear that the pre-philosophical approach provides one with an\nadequate basis to say that a religious belief is true, only that one\nis convinced of it. And, one might argue, parallel conclusions can be\ndrawn if one examines the other ways that Maritain suggests will lead\nto a putative knowledge of God.\n\n(Interestingly, Maritain was a critic of a number of arguments\nproposed in defence of religious belief. He argued that such defenses\nfail because they do not recognise that there are different types of\nknowledge, that these different types are hierarchically arranged, and\nthat the methods they employ are, by definition, unsuited to\ndemonstrate certain things. Thus, Maritain holds that while\n‘reason’, as “intelligence moving in a progressive\nway towards its term, the real”, can attain knowledge of God by\nmeans of demonstration, if we take ‘reason’ to be a purely\ndiscursive method—one which Maritain identifies with the\n“physical-mathematical sciences” and which he also calls\n“the ‘reason’ of rationalism”\n(Antimoderne, 1922: 64, my translation)—it\ncan know or say\nnothing at all about God. Because reason must be ordered to its\nobject, reason (in this second sense) can neither demonstrate nor even\nencounter revealed truths.)\n\nIn addition to the possibility of the demonstration of the existence\nof God and of the coherence of the divine attributes, Maritain allows\nthat there are a number of other ways in which one might come to know\nreligious beliefs to be true. Besides knowing God\n‘naturally’, there is a “non-conscious knowledge of\nGod” in the first act of human freedom (see Range of\nReason, 1948 [1952: 69–71]), “connatural\nknowledge”, “abstract intuition” (by which one knows\n“primary principles” such as the laws of identity and of\nnon-contradiction and the principle of causality), the “ways of\nthe practical intellect” (i.e., through moral or\naesthetic experience—though these do not provide a strict\ndemonstration; see Approches de Dieu, ch.\nIV) and, of course, divine revelation.\n\nFor Maritain, to say that one can attain, by reason, some knowledge of\nGod is not to say that everyone can do this. Moreover, Maritain also\nheld that it can be reasonable to believe, even in the absence of such\narguments or evidence, though what one believes must not contradict\nthe results of ‘true reason’. For example, Maritain argues\nthat, even if one holds that a belief is capable of a rational\ndemonstration, it does not follow that one must be able to provide it;\nthus, one’s knowledge of ‘revealed truths’ is\nreasonable, though Maritain (like Aquinas) would never claim that one\nmust be able to produce a philosophical demonstration of them.\nFurther, Maritain allows that theology can “reject as false any\nphilosophic affirmation which contradicts a theological truth”\n(Introduction to Philosophy, 1920 [1944: 126]).\n\nMaritain writes that there can be knowledge of the divine attributes.\nAs with all natural knowledge of the divine, this knowledge is\nbasically analogical, and it is often the result of a via\nnegativa. Thus, he insists that we know some things about God. We\ncan know that God is (quia est), though not what God is in\nhimself (quid est) (Degrees of Knowledge, Appendix\nIII, 1932 [1959: 423]). Moreover, against A.G. Sertillanges and\nEtienne Gilson, Maritain maintains that we can have affirmative\nknowledge about God—i.e., know in a more or less imperfect but,\nnevertheless, true way what God is. Besides, Maritain holds, knowledge\nthrough negation presupposes positive knowledge. (Mary Daly notes,\nhowever, that Maritain is not clear about the extent to which our\naffirmative knowledge of God is arrived at by means of philosophical\nargument [Daly 1966: 53.].) Nevertheless, Maritain acknowledges that\nthe knowledge of God that philosophy provides is incomplete and\nimperfect; the analogical knowledge that we have of God falls\nshort of a complete description of what God is.\n\nIt is not clear that Maritain avoids many of the concerns expressed by\ncritics of ‘analogical knowledge’. For example, if the\nterm ‘cause’ is used analogously when applied to God, then\nwhen one utters the proposition ‘God is the cause of the\nuniverse’ after examining Aquinas’s ‘second\nway’, it would seem that one has to be using this term in\nexactly the same sense as it has been used throughout the preceding\nargument. If it is not being used in exactly the same sense, then how\ncan one claim that Aquinas has demonstrated this conclusion?\nThe problem is not whether analogical predication is possible but,\nfirst, whether one can understand the analogical predicate and,\nsecond, whether one can employ such a predicate in a demonstration\nwithout committing the fallacy of equivocation.\n\nGiven Maritain’s account of faith and of suprarational\nknowledge, it would seem that he would see religious beliefs as\n‘trusts’ and, hence, as having more than a purely\ncognitive character. He would, no doubt, follow Aquinas who spoke of\nfaith as a ‘disposition’ or virtue (habitus). A\nhabitus is, of course, not merely the product of action, but\nitself is ordered to action. Thus, to say that religious beliefs are\npropositional in form is not to say that their function is only\ndescriptive. Nevertheless, Maritain’s account of religious\nbelief and its relation to argument and proof is not complete.\nMoreover, given that Maritain does employ\n‘foundationalism’ as a standard of sufficient evidence for\nclaiming that some propositions expressing religious belief are true,\nas noted above, there is some debate whether he can directly address\nthe challenges of ‘postmodern’ critics of foundationalist\nepistemology.\n",
    "section_title": "3.4 Natural Theology and Philosophy of Religion",
    "entry_title": "Jacques Maritain",
    "hierarchy_title": "Jacques Maritain || Principal Contributions || Natural Theology and Philosophy of Religion",
    "tokenized_text": [
        "principal",
        "contribution",
        "natural",
        "theology",
        "philosophy",
        "religion",
        "natural",
        "theology",
        "philosophy",
        "religion",
        "like",
        "aquinas",
        "maritain",
        "held",
        "conflict",
        "true",
        "faith",
        "true",
        "reason",
        "religious",
        "belief",
        "open",
        "rational",
        "discussion",
        "existence",
        "god",
        "certain",
        "fundamental",
        "religious",
        "belief",
        "could",
        "philosophically",
        "demonstrated",
        "maritain",
        "held",
        "however",
        "russellian",
        "mathematical",
        "logic",
        "inferior",
        "traditional",
        "aristotelian",
        "logic",
        "demonstration",
        "religious",
        "belief",
        "needed",
        "follow",
        "aristotelian",
        "syllogistic",
        "introduction",
        "logic",
        "a",
        "kraal",
        "religious",
        "belief",
        "attitude",
        "matter",
        "private",
        "opinionan",
        "option",
        "could",
        "embraced",
        "according",
        "one",
        "private",
        "preference",
        "matter",
        "truth",
        "maritain",
        "one",
        "must",
        "choose",
        "true",
        "god",
        "radical",
        "irrationality",
        "introduction",
        "philosophy",
        "maritain",
        "held",
        "philosophy",
        "ancilla",
        "theologiae",
        "handmaid",
        "theology",
        "philosophy",
        "rubric",
        "metaphysical",
        "knowledge",
        "allows",
        "demonstration",
        "number",
        "basic",
        "religious",
        "belief",
        "like",
        "aquinas",
        "maritain",
        "accepted",
        "classical",
        "foundationalist",
        "position",
        "belief",
        "could",
        "established",
        "rational",
        "deduction",
        "selfevident",
        "principle",
        "constituted",
        "genuine",
        "knowledge",
        "specifically",
        "held",
        "use",
        "natural",
        "reason",
        "one",
        "come",
        "know",
        "certain",
        "truth",
        "god",
        "five",
        "way",
        "thomas",
        "aquinas",
        "provided",
        "sure",
        "knowledge",
        "god",
        "existence",
        "maritain",
        "also",
        "argued",
        "could",
        "proof",
        "existence",
        "divine",
        "approches",
        "de",
        "dieu",
        "developed",
        "called",
        "sixth",
        "way",
        "maritain",
        "writes",
        "intuition",
        "awakened",
        "person",
        "engaged",
        "thoughtthat",
        "seems",
        "impossible",
        "thinking",
        "being",
        "time",
        "thinking",
        "one",
        "seems",
        "free",
        "vicissitude",
        "time",
        "space",
        "coming",
        "ceasing",
        "bei",
        "think",
        "nevertheless",
        "know",
        "well",
        "bornwe",
        "came",
        "existence",
        "confronted",
        "contradictionnot",
        "logical",
        "contradiction",
        "lived",
        "contradiction",
        "solution",
        "one",
        "always",
        "existed",
        "oneself",
        "within",
        "transcendent",
        "personality",
        "self",
        "thinking",
        "proceeded",
        "temporal",
        "existence",
        "approches",
        "de",
        "dieu",
        "oeuvre",
        "complètes",
        "vol",
        "x",
        "p",
        "engl",
        "tr",
        "pp",
        "must",
        "contain",
        "thing",
        "eminent",
        "mode",
        "itselfin",
        "absolutely",
        "transcendent",
        "waybeing",
        "thought",
        "personality",
        "implies",
        "first",
        "existence",
        "infinite",
        "plenitude",
        "separate",
        "essence",
        "diversity",
        "existents",
        "ibid",
        "p",
        "engl",
        "tr",
        "p",
        "maritain",
        "also",
        "acknowledges",
        "possibility",
        "natural",
        "prephilosophical",
        "still",
        "rational",
        "knowledge",
        "god",
        "see",
        "approches",
        "de",
        "dieu",
        "pp",
        "maritain",
        "claim",
        "knowledge",
        "necessary",
        "toand",
        "fact",
        "lead",
        "toa",
        "philosophical",
        "demonstration",
        "god",
        "existence",
        "way",
        "one",
        "know",
        "religious",
        "belief",
        "true",
        "even",
        "without",
        "able",
        "demonstrate",
        "maritain",
        "argument",
        "resembles",
        "thomistic",
        "argument",
        "contingent",
        "one",
        "intuition",
        "one",
        "aware",
        "first",
        "reality",
        "separate",
        "oneself",
        "second",
        "oneself",
        "finite",
        "limited",
        "third",
        "necessity",
        "something",
        "completely",
        "free",
        "nothingness",
        "death",
        "ibid",
        "p",
        "engl",
        "tr",
        "p",
        "concurrent",
        "spontaneous",
        "reasoning",
        "follows",
        "course",
        "conclusion",
        "another",
        "whole",
        "another",
        "transcendent",
        "selfsufficient",
        "unknown",
        "activating",
        "being",
        "selfsubsisting",
        "existing",
        "ibid",
        "p",
        "engl",
        "tr",
        "p",
        "knowledge",
        "god",
        "maritain",
        "admits",
        "demonstrative",
        "nevertheless",
        "rich",
        "certitude",
        "ibid",
        "p",
        "engl",
        "tr",
        "p",
        "presupposed",
        "underlying",
        "force",
        "philosophical",
        "demonstration",
        "god",
        "existence",
        "difference",
        "prephilosophical",
        "philosophical",
        "knowledge",
        "god",
        "latter",
        "one",
        "based",
        "scientific",
        "demonstration",
        "approches",
        "de",
        "dieu",
        "p",
        "engl",
        "tr",
        "p",
        "on",
        "empirical",
        "factsand",
        "involving",
        "analogy",
        "term",
        "properly",
        "predicated",
        "divine",
        "hand",
        "prephilosophical",
        "knowledge",
        "intuition",
        "an",
        "approach",
        "knowledge",
        "though",
        "way",
        "ibid",
        "p",
        "engl",
        "tr",
        "p",
        "proof",
        "demonstration",
        "knowledge",
        "based",
        "natural",
        "reasoning",
        "expressed",
        "word",
        "yet",
        "important",
        "also",
        "realize",
        "maritain",
        "allows",
        "certain",
        "truth",
        "grasped",
        "common",
        "sense",
        "object",
        "philosophical",
        "concern",
        "ibid",
        "p",
        "engl",
        "tr",
        "p",
        "philosophical",
        "proof",
        "existence",
        "god",
        "established",
        "justified",
        "philosophically",
        "level",
        "philosophy",
        "already",
        "valid",
        "efficacious",
        "level",
        "incohative",
        "spontaneous",
        "philosophy",
        "ibid",
        "p",
        "engl",
        "tr",
        "p",
        "one",
        "arrives",
        "mean",
        "approach",
        "philosophical",
        "demonstration",
        "knowledge",
        "truth",
        "proposition",
        "argued",
        "however",
        "difficulty",
        "maritain",
        "position",
        "example",
        "even",
        "true",
        "people",
        "may",
        "naturally",
        "affirm",
        "proposition",
        "god",
        "obvious",
        "claim",
        "know",
        "word",
        "even",
        "proposition",
        "true",
        "clear",
        "say",
        "know",
        "believe",
        "true",
        "maritain",
        "seems",
        "give",
        "u",
        "explanation",
        "one",
        "arrives",
        "certain",
        "proposition",
        "one",
        "certainty",
        "nothing",
        "since",
        "state",
        "certainty",
        "individual",
        "assertion",
        "person",
        "know",
        "something",
        "true",
        "clear",
        "prephilosophical",
        "approach",
        "provides",
        "one",
        "adequate",
        "basis",
        "say",
        "religious",
        "belief",
        "true",
        "one",
        "convinced",
        "one",
        "might",
        "argue",
        "parallel",
        "conclusion",
        "drawn",
        "one",
        "examines",
        "way",
        "maritain",
        "suggests",
        "lead",
        "putative",
        "knowledge",
        "god",
        "interestingly",
        "maritain",
        "critic",
        "number",
        "argument",
        "proposed",
        "defence",
        "religious",
        "belief",
        "argued",
        "defense",
        "fail",
        "recognise",
        "different",
        "type",
        "knowledge",
        "different",
        "type",
        "hierarchically",
        "arranged",
        "method",
        "employ",
        "definition",
        "unsuited",
        "demonstrate",
        "certain",
        "thing",
        "thus",
        "maritain",
        "hold",
        "reason",
        "intelligence",
        "moving",
        "progressive",
        "way",
        "towards",
        "term",
        "real",
        "attain",
        "knowledge",
        "god",
        "mean",
        "demonstration",
        "take",
        "reason",
        "purely",
        "discursive",
        "methodone",
        "maritain",
        "identifies",
        "physicalmathematical",
        "science",
        "also",
        "call",
        "reason",
        "rationalism",
        "antimoderne",
        "translation",
        "it",
        "know",
        "say",
        "nothing",
        "god",
        "reason",
        "must",
        "ordered",
        "object",
        "reason",
        "second",
        "sense",
        "neither",
        "demonstrate",
        "even",
        "encounter",
        "revealed",
        "truth",
        "addition",
        "possibility",
        "demonstration",
        "existence",
        "god",
        "coherence",
        "divine",
        "attribute",
        "maritain",
        "allows",
        "number",
        "way",
        "one",
        "might",
        "come",
        "know",
        "religious",
        "belief",
        "true",
        "besides",
        "knowing",
        "god",
        "naturally",
        "nonconscious",
        "knowledge",
        "god",
        "first",
        "act",
        "human",
        "freedom",
        "see",
        "range",
        "reason",
        "connatural",
        "knowledge",
        "abstract",
        "intuition",
        "one",
        "know",
        "primary",
        "principle",
        "law",
        "identity",
        "noncontradiction",
        "principle",
        "causality",
        "way",
        "practical",
        "intellect",
        "ie",
        "moral",
        "aesthetic",
        "experiencethough",
        "provide",
        "strict",
        "demonstration",
        "see",
        "approches",
        "de",
        "dieu",
        "ch",
        "iv",
        "course",
        "divine",
        "revelation",
        "maritain",
        "say",
        "one",
        "attain",
        "reason",
        "knowledge",
        "god",
        "say",
        "everyone",
        "moreover",
        "maritain",
        "also",
        "held",
        "reasonable",
        "believe",
        "even",
        "absence",
        "argument",
        "evidence",
        "though",
        "one",
        "belief",
        "must",
        "contradict",
        "result",
        "true",
        "reason",
        "example",
        "maritain",
        "argues",
        "even",
        "one",
        "hold",
        "belief",
        "capable",
        "rational",
        "demonstration",
        "follow",
        "one",
        "must",
        "able",
        "provide",
        "thus",
        "one",
        "knowledge",
        "revealed",
        "truth",
        "reasonable",
        "though",
        "maritain",
        "like",
        "aquinas",
        "would",
        "never",
        "claim",
        "one",
        "must",
        "able",
        "produce",
        "philosophical",
        "demonstration",
        "maritain",
        "allows",
        "theology",
        "reject",
        "false",
        "philosophic",
        "affirmation",
        "contradicts",
        "theological",
        "truth",
        "introduction",
        "philosophy",
        "maritain",
        "writes",
        "knowledge",
        "divine",
        "attribute",
        "natural",
        "knowledge",
        "divine",
        "knowledge",
        "basically",
        "analogical",
        "often",
        "result",
        "via",
        "negativa",
        "thus",
        "insists",
        "know",
        "thing",
        "god",
        "know",
        "god",
        "quia",
        "est",
        "though",
        "god",
        "quid",
        "est",
        "degree",
        "knowledge",
        "appendix",
        "iii",
        "moreover",
        "ag",
        "sertillanges",
        "etienne",
        "gilson",
        "maritain",
        "maintains",
        "affirmative",
        "knowledge",
        "godie",
        "know",
        "le",
        "imperfect",
        "nevertheless",
        "true",
        "way",
        "god",
        "besides",
        "maritain",
        "hold",
        "knowledge",
        "negation",
        "presupposes",
        "positive",
        "knowledge",
        "mary",
        "daly",
        "note",
        "however",
        "maritain",
        "clear",
        "extent",
        "affirmative",
        "knowledge",
        "god",
        "arrived",
        "mean",
        "philosophical",
        "argument",
        "daly",
        "nevertheless",
        "maritain",
        "acknowledges",
        "knowledge",
        "god",
        "philosophy",
        "provides",
        "incomplete",
        "imperfect",
        "analogical",
        "knowledge",
        "god",
        "fall",
        "short",
        "complete",
        "description",
        "god",
        "clear",
        "maritain",
        "avoids",
        "many",
        "concern",
        "expressed",
        "critic",
        "analogical",
        "knowledge",
        "example",
        "term",
        "cause",
        "used",
        "analogously",
        "applied",
        "god",
        "one",
        "utters",
        "proposition",
        "god",
        "cause",
        "universe",
        "examining",
        "aquinas",
        "second",
        "way",
        "would",
        "seem",
        "one",
        "using",
        "term",
        "exactly",
        "sense",
        "used",
        "throughout",
        "preceding",
        "argument",
        "used",
        "exactly",
        "sense",
        "one",
        "claim",
        "aquinas",
        "demonstrated",
        "conclusion",
        "problem",
        "whether",
        "analogical",
        "predication",
        "possible",
        "first",
        "whether",
        "one",
        "understand",
        "analogical",
        "predicate",
        "second",
        "whether",
        "one",
        "employ",
        "predicate",
        "demonstration",
        "without",
        "committing",
        "fallacy",
        "equivocation",
        "given",
        "maritain",
        "account",
        "faith",
        "suprarational",
        "knowledge",
        "would",
        "seem",
        "would",
        "see",
        "religious",
        "belief",
        "trust",
        "hence",
        "purely",
        "cognitive",
        "character",
        "would",
        "doubt",
        "follow",
        "aquinas",
        "spoke",
        "faith",
        "disposition",
        "virtue",
        "habitus",
        "habitus",
        "course",
        "merely",
        "product",
        "action",
        "ordered",
        "action",
        "thus",
        "say",
        "religious",
        "belief",
        "propositional",
        "form",
        "say",
        "function",
        "descriptive",
        "nevertheless",
        "maritain",
        "account",
        "religious",
        "belief",
        "relation",
        "argument",
        "proof",
        "complete",
        "moreover",
        "given",
        "maritain",
        "employ",
        "foundationalism",
        "standard",
        "sufficient",
        "evidence",
        "claiming",
        "proposition",
        "expressing",
        "religious",
        "belief",
        "true",
        "noted",
        "debate",
        "whether",
        "directly",
        "address",
        "challenge",
        "postmodern",
        "critic",
        "foundationalist",
        "epistemology"
    ]
}