{
    "main_text": "Principal Contributions || Epistemology\n3.2 Epistemology\n\nMaritain’s primary work in epistemology is Distinguer pour\nunir; ou, les degrés du savoir (1932, Distinguish to\nUnite: or, The Degrees of Knowledge), though some see\nMaritain’s 1936 essay, “Science et philosophie” (in\nQuatre essais sur l’esprit, 1939), in which Maritain\naddresses arguments of the Vienna Circle, as completing his account of\nknowledge (Malquori 2009). One also finds a number of important essays\non the topic in Raison et raisons, essais\ndétachés (1948, The Range of Reason).\nMaritain, again, largely follows the realist view of Thomas\nAquinas—though he was significantly influenced by John of St\nThomas (John Poinsot), St John of the Cross, and St Augustine, and the\nstructure of Les degrés du savoir is similar to the\nprocedure traced in the Itinerarium mentis in Deum [Journey of the Soul into God, 1259 [1938, 2002] of St Bonaventure.\n\nAgainst ‘modern philosophy’, Maritain insisted on the\npriority of metaphysics over epistemology—in fact, he held that\n“the critique of knowledge is part of metaphysics”\n(The Range of Reason, 1948 [1952: 25])—and also\nmaintained that the structure and method of the various sciences were\ndetermined by the nature of the object to be known.\n\nMaritain called his view “critical realism”, and argued\nparticularly against the then-dominant rationalist and empiricist\naccounts of knowledge. He maintained that, despite the differences\namong them, Kantianism, idealism, pragmatism, and positivism all\nreflected the influence of nominalism—that universal notions are\ncreations of the human mind and have no foundation in reality.\nMaritain’s critical realism holds that what the mind knows is\nidentical with what exists. To know a thing is for its\n‘essence’ to exist immaterially in the mind. This is not\nto say that the mind mirrors or copies that which it knows, but that,\nin virtue of the properties apprehended, it ‘becomes’ the\nthings it knows. Maritain held that our knowledge of reality was\nthrough the ‘concept’—the esse\nintentionale—which was immaterial and universal, though the\nconcept itself was something known only by reflection. Thus, when it\ncomes to knowledge of sensible objects, for example, the mind has both\na passive role (receiving sense impressions) and an active one\n(constructing knowledge from these impressions) (see Deely 1997, Munoz\n2012).\n\nMaritain’s epistemology sought to explain the nature of\nknowledge found not just in science and philosophy, but in religious\nfaith and mysticism, and one of his aims was to show the different\n‘kinds’ of knowledge and their relations to one another.\nHe argued that there were different ‘orders’ of knowledge\nand, within them, different ‘degrees’ determined by the\nnature of the object to be known and the ‘degree of\nabstraction’ involved.\n\nFirst, in the order of rational knowledge, one can speak of the\nknowledge of sensible nature (i.e., of the objects of experimental\nscience), which is different from the knowledge of mathematics or of\n‘physico-mathematical’ objects (which is limited because\nits objects do not have a direct relation to the actual), which is, in\nturn, distinct from the knowledge of trans-sensible or metaphysical\nnature.\n\nThese ‘degrees of knowledge’ are not, however, independent\nof one another, and they have in common the requirement that to know\nsomething is to know why it is \n\n\nthe mind is not satisfied when it merely attains a thing […],\nbut only when it grasps that upon which that datum is founded in being\nand intelligibility. (Degrees of Knowledge, 1932 [1959: 23])\n\n\n\nFor example, natural science, which is based on sense perception, aims\nat formulating laws which reflect certain features of the objects\nperceived. The scientist, then, is primarily concerned with looking\nfor regularities in nature, employing what Maritain calls an\n“empiriological” approach (see Degrees of\nKnowledge, 1932 [1959: 178–180]; Philosophy of\nNature, 1935 [1951: 49]). (An empiriological analysis is a\nnon-philosophical and, specifically, non-ontological approach to\nunderstanding natural beings that does not seek to know them “in\nterms of their type of being or reality”, but only “in\nterms of their empirical manifestations” (Carlson 2012: 37).\nSuch an analysis does not provide knowledge of the essence of natural\nbeings. Maritain offers mathematical physics as an illustration of\nthis approach.) The product of this method is what Maritain calls\n“perinoetical” knowledge.\n\nBut for natural science to achieve the status of a science, it\npresupposes the capacity of human beings to know things apart from\ntheir particular individuating characteristics (though not apart from\nthe existence of matter), i.e., natural philosophy. Natural philosophy\n‘gets behind’ phenomena in order to discover essential\nconnections and causes. Thus, from that which is presented in sense\nperception, the mind constructs an object (the essence) which is\nuniversal. (This is possible because, Maritain maintains, there are\nessences or natures of things.) This process of ‘thinking\nthrough’ to the nature of the thing is called by Maritain\ndianoetical knowledge. So, while natural science and natural\nphilosophy both focus on the physical, the natural\nphilosopher—unlike the scientist—is concerned with the\nessence of the object and its definition (or, at the very least, an\naccount of its various properties). This is knowledge at the level of\nthe first ‘degree of abstraction’.\n\nPhysico-mathematical objects (e.g., quantity, number, and extension)\nstand at a second ‘degree’ of abstraction. While they\ncannot exist without the existence of material things, once known,\nthey can be conceived of without any reference to such objects.\nFinally, metaphysical or speculative knowledge deals with objects\nexisting at a third degree of abstraction (i.e., independently of\nmatter), such as substance, quality, goodness, and the divine. Because\nof the nature of the objects of metaphysics, this latter kind of\nknowledge does not involve logical inference as much as reasoning by\nanalogy or what Maritain calls ananoetic knowledge. Such\nknowledge (e.g., of the divine) is not through any direct\napprehension, but indirectly, through creatures.\n\nThere is a hierarchy among these ‘degrees of knowledge’.\nThose objects which are highest in intelligibility, immateriality, and\npotential to be known are the objects of the highest degree of\nknowledge. Maritain writes, \n\n\n[t]he metaphysician considers an object of knowing of a specifically\nhigher nature and intelligibility, and from it he acquires a proper\nknowledge, a scientific knowledge, by means that absolutely transcend\nthose of the physicist or the mathematician. (Degrees of\nKnowledge, 1932 [1959: 37]) \n\n\nNevertheless, while there are different ‘orders’ and\n‘degrees’ of knowledge, one should not conclude that there\nare different ‘knowledges’.\n\nMaritain points out that philosophical demonstration is different from\nnatural scientific or mathematical demonstrations: \n\n\nphilosophy is concerned with an objectively distinct field of\nknowledge and constitutes a really autonomous discipline, possessing\nits own adequate means of explaining this field of knowledge.\n(Range of Reason, 1948 [1952: 5]) \n\n\nThus, Maritain writes, natural philosophy penetrates to the nature of\nits object. Metaphysics—which is also a kind of philosophic\nknowing—is concerned with purely intelligible being. Science,\nhowever, is at best ‘empiriological’—it does not\nlead us to being itself, but only to the observable and measurable.\nConsequently, to employ a method of scientific demonstration to\nestablish or to criticize claims about the object of metaphysical\nknowledge is, to use Ryle’s classic term, a category mistake. It\nis precisely because he holds that empiricist and rationalist\nepistemologies do this, that Maritain takes issue with them.\n\nJust as there is an order of rational knowledge with its\n‘degrees’, there is another order and degrees of\nsuprarational knowledge—of a higher wisdom—that is beyond\n‘natural knowledge’. These are, on the one hand,\n‘the science of revealed mysteries’ or ‘theological\nwisdom’ and, on the other, ‘mystical theology’.\nHere, Maritain’s debt to Augustine and John of the Cross is\nparticularly evident (see Barreiro 2008). According to Maritain, in\ntheological wisdom, the divine is known by drawing not just on reason\nbut on faith. (This is distinct from metaphysical knowledge which, so\nto speak, approaches the divine from the ‘outside’.)\nMystical knowledge stands one level higher still—where there is\nno mediation by concepts—and “consists in knowing\n[…] Deity as such—according to a mode that is\nsuprahuman and supernatural” (The Degrees of\nKnowledge, 1932 [1959: 253]). This is a knowledge by\nconnaturality, but also a knowledge that can be pursued through the\npractical discipline of ‘mystical contemplation’. In this\nway, human beings acquire a kind of knowledge that makes them more\nloving and more spiritual. (It is worth noting that, for Maritain,\nthis mysticism extended beyond the Christian tradition. Not only did\nhe refer to the example of Ramanuja, but he encouraged the future\nIndologist Olivier Lacombe to direct his “philosophical work\ntowards the study of Indian mysticism” [Lardinois 2017: 314].)\n\n\nThe development of the notion of ‘knowledge by\nconnaturality’ (or ‘connatural knowledge’ or\n‘knowledge by inclination’), latent in Aquinas (Summa\ntheologiae, II-II, q. 45, a 2), is one of Maritain’s major\ncontributions to epistemology. Maritain places this knowledge at the\nlevel of the preconscious intellect. It is “non-conceptual and\nnon-rational”, (Natural Law, 2001: 18); he describes it\nas \n\n\nobscure, unsystematic, vital knowledge, by means of instinct or\nsympathy, and in which the intellect, in order to make its judgments,\nconsults the inner leanings of the subject. (Man and the\nState, 1951: 91) \n\n\nNor is it, as much knowledge is, a knowledge of essences.\nNevertheless, it is still connected to “intellectual act”\nand is a genuine knowledge of reality. This kind of knowledge lies at\nthe basis, not only of mystical experience, but of artistic activity\nand morality; it provides a knowledge of God, of the first principles\nof morality, and a knowledge of one’s own subjectivity. \n\nA number of questions have been raised concerning Maritain’s\nepistemology, particularly concerning his characterization of\nphilosophical knowledge. Moreover, while Maritain claims that there is\na difference in method between the sciences and philosophy, some have\nargued that it is not clear what exactly that difference is (Vitoria\n2011). For example, Maritain would follow Aquinas in holding that\nmetaphysics uses demonstratio quia—demonstration from\neffects. But it would seem that science also sometimes uses such a\nmethod of demonstration. Thus, it is not clear what it is in the\nmethod (as distinct from the content of the premises) that\ndifferentiates a metaphysical proof (e.g., of God’s existence)\nfrom a scientific argument establishing the existence of a cause of a\nnatural object.\n\nSecond, Maritain holds that scientific knowledge is distinguished from\nphilosophical knowledge in terms of their different methods and\ndifferent objects. But if scientific knowledge and philosophical\nknowledge are, as it were, incommensurable, it is not clear how\nphilosophy can judge, or be corrective of, the sciences.\n\nSome Thomist scholars have been reluctant to adopt Maritain’s\ndevelopment of Aquinas’ notion of ‘knowledge by\nconnaturality’, preferring instead to speak of “knowledge\nrelative to inclination” (Dewan 2010). Yet others have argued\nthat this development is of far-reaching significance, as\nMaritain’s notion of the intuition of being led him, in the\nyears following the publication of The Degrees of Knowledge,\nto recognise a greater role to be played by “the unconscious and\npreconscious life of the mind” (The Range of Reason,\n1948 [1952: 80]; Arraj 2006). \n\nFinally, it would seem that the model of demonstration that Maritain\nemploys is foundationalist and, thus, has to answer to those\ncriticisms that modern anti-foundationalism draws attention\nto—e.g., that a foundationalist theory sets a standard for\nknowledge that is not only without justification, but is a standard\nthat it cannot itself satisfy. Some defences of Thomistic epistemology\n(e.g., Veatch 1990),\nhowever, suggest ways in which such a concern might be addressed.\n",
    "section_title": "3.2 Epistemology",
    "entry_title": "Jacques Maritain",
    "hierarchy_title": "Jacques Maritain || Principal Contributions || Epistemology",
    "tokenized_text": [
        "principal",
        "contribution",
        "epistemology",
        "epistemology",
        "maritain",
        "primary",
        "work",
        "epistemology",
        "distinguer",
        "pour",
        "unir",
        "ou",
        "le",
        "degrés",
        "du",
        "savoir",
        "distinguish",
        "unite",
        "degree",
        "knowledge",
        "though",
        "see",
        "maritain",
        "essay",
        "science",
        "et",
        "philosophie",
        "quatre",
        "essais",
        "sur",
        "l",
        "esprit",
        "maritain",
        "address",
        "argument",
        "vienna",
        "circle",
        "completing",
        "account",
        "knowledge",
        "malquori",
        "one",
        "also",
        "find",
        "number",
        "important",
        "essay",
        "topic",
        "raison",
        "et",
        "raisons",
        "essais",
        "détachés",
        "range",
        "reason",
        "maritain",
        "largely",
        "follows",
        "realist",
        "view",
        "thomas",
        "aquinasthough",
        "significantly",
        "influenced",
        "john",
        "st",
        "thomas",
        "john",
        "poinsot",
        "st",
        "john",
        "cross",
        "st",
        "augustine",
        "structure",
        "le",
        "degrés",
        "du",
        "savoir",
        "similar",
        "procedure",
        "traced",
        "itinerarium",
        "mentis",
        "deum",
        "journey",
        "soul",
        "god",
        "st",
        "bonaventure",
        "modern",
        "philosophy",
        "maritain",
        "insisted",
        "priority",
        "metaphysics",
        "epistemologyin",
        "fact",
        "held",
        "critique",
        "knowledge",
        "part",
        "metaphysics",
        "range",
        "reason",
        "and",
        "also",
        "maintained",
        "structure",
        "method",
        "various",
        "science",
        "determined",
        "nature",
        "object",
        "known",
        "maritain",
        "called",
        "view",
        "critical",
        "realism",
        "argued",
        "particularly",
        "thendominant",
        "rationalist",
        "empiricist",
        "account",
        "knowledge",
        "maintained",
        "despite",
        "difference",
        "among",
        "kantianism",
        "idealism",
        "pragmatism",
        "positivism",
        "reflected",
        "influence",
        "nominalismthat",
        "universal",
        "notion",
        "creation",
        "human",
        "mind",
        "foundation",
        "reality",
        "maritain",
        "critical",
        "realism",
        "hold",
        "mind",
        "know",
        "identical",
        "exists",
        "know",
        "thing",
        "essence",
        "exist",
        "immaterially",
        "mind",
        "say",
        "mind",
        "mirror",
        "copy",
        "know",
        "virtue",
        "property",
        "apprehended",
        "becomes",
        "thing",
        "know",
        "maritain",
        "held",
        "knowledge",
        "reality",
        "concept",
        "the",
        "esse",
        "intentionalewhich",
        "immaterial",
        "universal",
        "though",
        "concept",
        "something",
        "known",
        "reflection",
        "thus",
        "come",
        "knowledge",
        "sensible",
        "object",
        "example",
        "mind",
        "passive",
        "role",
        "receiving",
        "sense",
        "impression",
        "active",
        "one",
        "constructing",
        "knowledge",
        "impression",
        "see",
        "deely",
        "munoz",
        "maritain",
        "epistemology",
        "sought",
        "explain",
        "nature",
        "knowledge",
        "found",
        "science",
        "philosophy",
        "religious",
        "faith",
        "mysticism",
        "one",
        "aim",
        "show",
        "different",
        "kind",
        "knowledge",
        "relation",
        "one",
        "another",
        "argued",
        "different",
        "order",
        "knowledge",
        "within",
        "different",
        "degree",
        "determined",
        "nature",
        "object",
        "known",
        "degree",
        "abstraction",
        "involved",
        "first",
        "order",
        "rational",
        "knowledge",
        "one",
        "speak",
        "knowledge",
        "sensible",
        "nature",
        "ie",
        "object",
        "experimental",
        "science",
        "different",
        "knowledge",
        "mathematics",
        "physicomathematical",
        "object",
        "limited",
        "object",
        "direct",
        "relation",
        "actual",
        "turn",
        "distinct",
        "knowledge",
        "transsensible",
        "metaphysical",
        "nature",
        "degree",
        "knowledge",
        "however",
        "independent",
        "one",
        "another",
        "common",
        "requirement",
        "know",
        "something",
        "know",
        "mind",
        "satisfied",
        "merely",
        "attains",
        "thing",
        "grasp",
        "upon",
        "datum",
        "founded",
        "intelligibility",
        "degree",
        "knowledge",
        "example",
        "natural",
        "science",
        "based",
        "sense",
        "perception",
        "aim",
        "formulating",
        "law",
        "reflect",
        "certain",
        "feature",
        "object",
        "perceived",
        "scientist",
        "primarily",
        "concerned",
        "looking",
        "regularity",
        "nature",
        "employing",
        "maritain",
        "call",
        "empiriological",
        "approach",
        "see",
        "degree",
        "knowledge",
        "philosophy",
        "nature",
        "empiriological",
        "analysis",
        "nonphilosophical",
        "specifically",
        "nonontological",
        "approach",
        "understanding",
        "natural",
        "being",
        "seek",
        "know",
        "term",
        "type",
        "reality",
        "term",
        "empirical",
        "manifestation",
        "carlson",
        "analysis",
        "provide",
        "knowledge",
        "essence",
        "natural",
        "being",
        "maritain",
        "offer",
        "mathematical",
        "physic",
        "illustration",
        "approach",
        "product",
        "method",
        "maritain",
        "call",
        "perinoetical",
        "knowledge",
        "natural",
        "science",
        "achieve",
        "status",
        "science",
        "presupposes",
        "capacity",
        "human",
        "being",
        "know",
        "thing",
        "apart",
        "particular",
        "individuating",
        "characteristic",
        "though",
        "apart",
        "existence",
        "matter",
        "ie",
        "natural",
        "philosophy",
        "natural",
        "philosophy",
        "get",
        "behind",
        "phenomenon",
        "order",
        "discover",
        "essential",
        "connection",
        "cause",
        "thus",
        "presented",
        "sense",
        "perception",
        "mind",
        "construct",
        "object",
        "essence",
        "universal",
        "possible",
        "maritain",
        "maintains",
        "essence",
        "nature",
        "thing",
        "process",
        "thinking",
        "nature",
        "thing",
        "called",
        "maritain",
        "dianoetical",
        "knowledge",
        "natural",
        "science",
        "natural",
        "philosophy",
        "focus",
        "physical",
        "natural",
        "philosopherunlike",
        "scientistis",
        "concerned",
        "essence",
        "object",
        "definition",
        "least",
        "account",
        "various",
        "property",
        "knowledge",
        "level",
        "first",
        "degree",
        "abstraction",
        "physicomathematical",
        "object",
        "eg",
        "quantity",
        "number",
        "extension",
        "stand",
        "second",
        "degree",
        "abstraction",
        "exist",
        "without",
        "existence",
        "material",
        "thing",
        "known",
        "conceived",
        "without",
        "reference",
        "object",
        "finally",
        "metaphysical",
        "speculative",
        "knowledge",
        "deal",
        "object",
        "existing",
        "third",
        "degree",
        "abstraction",
        "ie",
        "independently",
        "matter",
        "substance",
        "quality",
        "goodness",
        "divine",
        "nature",
        "object",
        "metaphysics",
        "latter",
        "kind",
        "knowledge",
        "involve",
        "logical",
        "inference",
        "much",
        "reasoning",
        "analogy",
        "maritain",
        "call",
        "ananoetic",
        "knowledge",
        "knowledge",
        "eg",
        "divine",
        "direct",
        "apprehension",
        "indirectly",
        "creature",
        "hierarchy",
        "among",
        "degree",
        "knowledge",
        "object",
        "highest",
        "intelligibility",
        "immateriality",
        "potential",
        "known",
        "object",
        "highest",
        "degree",
        "knowledge",
        "maritain",
        "writes",
        "metaphysician",
        "considers",
        "object",
        "knowing",
        "specifically",
        "higher",
        "nature",
        "intelligibility",
        "acquires",
        "proper",
        "knowledge",
        "scientific",
        "knowledge",
        "mean",
        "absolutely",
        "transcend",
        "physicist",
        "mathematician",
        "degree",
        "knowledge",
        "nevertheless",
        "different",
        "order",
        "degree",
        "knowledge",
        "one",
        "conclude",
        "different",
        "knowledge",
        "maritain",
        "point",
        "philosophical",
        "demonstration",
        "different",
        "natural",
        "scientific",
        "mathematical",
        "demonstration",
        "philosophy",
        "concerned",
        "objectively",
        "distinct",
        "field",
        "knowledge",
        "constitutes",
        "really",
        "autonomous",
        "discipline",
        "possessing",
        "adequate",
        "mean",
        "explaining",
        "field",
        "knowledge",
        "range",
        "reason",
        "thus",
        "maritain",
        "writes",
        "natural",
        "philosophy",
        "penetrates",
        "nature",
        "object",
        "metaphysicswhich",
        "also",
        "kind",
        "philosophic",
        "knowingis",
        "concerned",
        "purely",
        "intelligible",
        "science",
        "however",
        "best",
        "empiriological",
        "it",
        "lead",
        "u",
        "observable",
        "measurable",
        "consequently",
        "employ",
        "method",
        "scientific",
        "demonstration",
        "establish",
        "criticize",
        "claim",
        "object",
        "metaphysical",
        "knowledge",
        "use",
        "ryle",
        "classic",
        "term",
        "category",
        "mistake",
        "precisely",
        "hold",
        "empiricist",
        "rationalist",
        "epistemology",
        "maritain",
        "take",
        "issue",
        "order",
        "rational",
        "knowledge",
        "degree",
        "another",
        "order",
        "degree",
        "suprarational",
        "knowledgeof",
        "higher",
        "wisdomthat",
        "beyond",
        "natural",
        "knowledge",
        "one",
        "hand",
        "science",
        "revealed",
        "mystery",
        "theological",
        "wisdom",
        "mystical",
        "theology",
        "maritain",
        "debt",
        "augustine",
        "john",
        "cross",
        "particularly",
        "evident",
        "see",
        "barreiro",
        "according",
        "maritain",
        "theological",
        "wisdom",
        "divine",
        "known",
        "drawing",
        "reason",
        "faith",
        "distinct",
        "metaphysical",
        "knowledge",
        "speak",
        "approach",
        "divine",
        "outside",
        "mystical",
        "knowledge",
        "stand",
        "one",
        "level",
        "higher",
        "stillwhere",
        "mediation",
        "conceptsand",
        "consists",
        "knowing",
        "deity",
        "suchaccording",
        "mode",
        "suprahuman",
        "supernatural",
        "degree",
        "knowledge",
        "knowledge",
        "connaturality",
        "also",
        "knowledge",
        "pursued",
        "practical",
        "discipline",
        "mystical",
        "contemplation",
        "way",
        "human",
        "being",
        "acquire",
        "kind",
        "knowledge",
        "make",
        "loving",
        "spiritual",
        "worth",
        "noting",
        "maritain",
        "mysticism",
        "extended",
        "beyond",
        "christian",
        "tradition",
        "refer",
        "example",
        "ramanuja",
        "encouraged",
        "future",
        "indologist",
        "olivier",
        "lacombe",
        "direct",
        "philosophical",
        "work",
        "towards",
        "study",
        "indian",
        "mysticism",
        "lardinois",
        "development",
        "notion",
        "knowledge",
        "connaturality",
        "connatural",
        "knowledge",
        "knowledge",
        "inclination",
        "latent",
        "aquinas",
        "summa",
        "theologiae",
        "iiii",
        "q",
        "one",
        "maritain",
        "major",
        "contribution",
        "epistemology",
        "maritain",
        "place",
        "knowledge",
        "level",
        "preconscious",
        "intellect",
        "nonconceptual",
        "nonrational",
        "natural",
        "law",
        "describes",
        "obscure",
        "unsystematic",
        "vital",
        "knowledge",
        "mean",
        "instinct",
        "sympathy",
        "intellect",
        "order",
        "make",
        "judgment",
        "consults",
        "inner",
        "leaning",
        "subject",
        "man",
        "state",
        "much",
        "knowledge",
        "knowledge",
        "essence",
        "nevertheless",
        "still",
        "connected",
        "intellectual",
        "act",
        "genuine",
        "knowledge",
        "reality",
        "kind",
        "knowledge",
        "lie",
        "basis",
        "mystical",
        "experience",
        "artistic",
        "activity",
        "morality",
        "provides",
        "knowledge",
        "god",
        "first",
        "principle",
        "morality",
        "knowledge",
        "one",
        "subjectivity",
        "number",
        "question",
        "raised",
        "concerning",
        "maritain",
        "epistemology",
        "particularly",
        "concerning",
        "characterization",
        "philosophical",
        "knowledge",
        "moreover",
        "maritain",
        "claim",
        "difference",
        "method",
        "science",
        "philosophy",
        "argued",
        "clear",
        "exactly",
        "difference",
        "vitoria",
        "example",
        "maritain",
        "would",
        "follow",
        "aquinas",
        "holding",
        "metaphysics",
        "us",
        "demonstratio",
        "quiademonstration",
        "effect",
        "would",
        "seem",
        "science",
        "also",
        "sometimes",
        "us",
        "method",
        "demonstration",
        "thus",
        "clear",
        "method",
        "distinct",
        "content",
        "premise",
        "differentiates",
        "metaphysical",
        "proof",
        "eg",
        "god",
        "existence",
        "scientific",
        "argument",
        "establishing",
        "existence",
        "cause",
        "natural",
        "object",
        "second",
        "maritain",
        "hold",
        "scientific",
        "knowledge",
        "distinguished",
        "philosophical",
        "knowledge",
        "term",
        "different",
        "method",
        "different",
        "object",
        "scientific",
        "knowledge",
        "philosophical",
        "knowledge",
        "incommensurable",
        "clear",
        "philosophy",
        "judge",
        "corrective",
        "science",
        "thomist",
        "scholar",
        "reluctant",
        "adopt",
        "maritain",
        "development",
        "aquinas",
        "notion",
        "knowledge",
        "connaturality",
        "preferring",
        "instead",
        "speak",
        "knowledge",
        "relative",
        "inclination",
        "dewan",
        "yet",
        "others",
        "argued",
        "development",
        "farreaching",
        "significance",
        "maritain",
        "notion",
        "intuition",
        "led",
        "year",
        "following",
        "publication",
        "degree",
        "knowledge",
        "recognise",
        "greater",
        "role",
        "played",
        "unconscious",
        "preconscious",
        "life",
        "mind",
        "range",
        "reason",
        "arraj",
        "finally",
        "would",
        "seem",
        "model",
        "demonstration",
        "maritain",
        "employ",
        "foundationalist",
        "thus",
        "answer",
        "criticism",
        "modern",
        "antifoundationalism",
        "draw",
        "attention",
        "toeg",
        "foundationalist",
        "theory",
        "set",
        "standard",
        "knowledge",
        "without",
        "justification",
        "standard",
        "satisfy",
        "defence",
        "thomistic",
        "epistemology",
        "eg",
        "veatch",
        "however",
        "suggest",
        "way",
        "concern",
        "might",
        "addressed"
    ]
}