{
    "main_text": "Arguments about markets || Justifications of markets\n3.1 Justifications of markets\n\nSen (1985) distinguishes two basic strategies for justifying markets:\nfrom antecedent rights or liberties on the one hand, or from\nconsequences on the other hand. Arguments about antecedent rights and\nliberties often go hand in hand, as the rights in question are said to\nprotect the liberties in question. In its paradigmatic form, this\nargument is based on a right to private property. It gives individuals\nthe right to do whatever they like with their property. This includes\nthe right to enter into exchange relationships with others.\nProhibiting such exchanges, or interfering with them in any other way,\ninfringes on these rights and thus, it is said, on a basic form of\nfreedom. The attractiveness of such justifications of markets lies in\ntheir a priori character and their intuitive plausibility. But they\nonly work if one can defend the a priori rights or liberties on which\nthey are based. Arguments of this kind are therefore often joined with\narguments about the naturalness of property rights as existing prior\nto the state. It is more plausible to hold that property rights must\nnot be compromised if one holds that they are a priori, than when they\nare understood as dependent on consent by society and enforcement\nthrough the state. The naturalness of property rights has often been\ndefended by connecting them to self-ownership and by basing them on\nthe mixing of one’s labor with material things and thereby\nappropriating them, along Lockean lines (Locke 1960 [1689]; see also\nNozick 1974; for the left-libertarian defense of private property\n(which combines it with very different positions with regard to\nequality and the role of the state) see e.g., Vallentyne/Steiner\n2000). But this view of property rights has been disputed. Many\nthinkers point out the crucial role of the state in providing and\nprotecting property rights and the right to free contract (see e.g.,\nMurphy/Nagel 2002). Also, many historians of ideas have pointed out\nthat the idea that liberty consists in the unhindered use of\none’s property (what MacGilvray (2011) calls “market\nfreedom”) is not the only way in which freedom can be\nunderstood, and has historically been understood (see for example\nPettit 2006 for a discussion of markets from the perspective of\nfreedom as non-domination, for a more emphatic endorsement of markets\nfrom a neo-republican perspective see Taylor 2013). In fact, the\nstrength of such a priori defenses of markets crucially depends on\nwhat “counts” as infringement of freedom: does one only\n“count” coercive rules by the state, or does one also\ncount the obstacles to pursuing one’s interests that one\nexperiences in a market society, which are often the result of\nnumerous decisions by anonymous individuals (cf. e.g., Cohen 1979;\nOlsaretti 2004, ch. 4–6; MacGilvray 2011, ch. 5). A strict\nsystem of private property rights can lead to situations of extreme\ninequality in which some members of a society are left to starve, so\nthat it becomes questionable in what sense they can be called free.\nThis presents defenders of markets on a priori grounds with a choice:\nthey either have to bite this bullet and accept extreme inequality and\npoverty as justified. Or they have to step back from their pure a\npriori position and admit that consequences can play a role in the\nconsideration of markets. Then, one can admit that markets may have to\nbe supplemented by other institutions, and their justification cannot\nbe unconditional any more (Sen 1985). Nevertheless, rights and\nliberties can continue to play an important role in pro-market\narguments, even while being embedded in a wider framework in which,\nfor example, a certain amount of taxation is also defended (for a\nrecent account, called “free market fairness”, which\nemphasizes the importance of economic liberties as basic rights but\nalso allows for some restriction for the sake of social justice, see\nTomasi 2012).\n\nMany justifications of markets, however, are based not on a priori\nrights or liberties, but rather on the consequences of\nmarkets. Several dimensions of these consequences can be\ndistinguished. A first, historically important, argument holds that\nmarkets make individuals more virtuous and sociable: they build on\ncalm, rational interests rather than violent passions. Markets\ntherefore make manners more peaceful and civilized (see Hirschman\n1977, who refers to Montesquieu and other 18th century\n thinkers).[3]\n Arguments about the character-building effect of markets are\nsometimes also raised today (cf. e.g., McCloskey 2006, for a critical\ndiscussion see Fumagalli 2020). Hirschman has conjectured that the\ncivilizing and moralizing forces of markets might just be sufficient\nto outbalance their self-undermining forces (1982); Bowles, in\ncontrast, has suggested that non-market elements of liberal\nsocieties might counteract potentially dangerous effects of\nmarkets.\n\nA second argument concerns the consequences of markets in the sense of\nthe distribution they bring about. It is sometimes held that markets,\nor more specifically labor markets, give people what they deserve\nbecause they reward individuals’ contributions to the social\nwhole. This makes desert rather than traditional hierarchies the\ndeterminant of social positions (e.g., Miller 2001, ch. VIII-IX;\nHonneth in Fraser/Honneth 2003, 137ff., Mankiw 2010; for\njustifications of profits along similar lines see e.g., Arnold 1987;\nNarveson 1995). Such arguments draw on the (luck egalitarian)\nintuition that differences in individuals’ incomes are justified\nas long as they are not undeserved, but reflect free choices (see\ne.g., Arneson 2008), for example the decision to work 50 rather than\n40 hours per week, or to take on a less pleasant job, which gives one\na ‘premium for being a steeplejack or an embalmer or working on\nthe night shift’ (Okun 1975, 72). It has been a matter of\ndebate, however, whether markets in fact reward choices in this way,\nor whether one’s socio-economic background, one’s\nparticipation in teams of workers (where individual contributions may\nbe impossible to separate), or simply luck play too great a role in\ndetermining one’s income. If so, then the “cult of\npersonal responsibility” would be misguided (Barry 2005, part\nIV; cf. also Olsaretti 2004, ch.1–3 for a discussion of the\narguments for markets from desert, which she ultimately rejects).\nInterestingly, even some defenders of free markets, such as von Hayek\nand Knight, have argued that the sense in which they can be called\njust only concerns the framework of rules within which they take\nplace, not the resulting distributing of income. They argue that what\nmarkets reward, namely the satisfaction of wants, has nothing to do\nwith moral values (1978, ch. IX; cf. also Knight 1923). One might\nargue that these rules can be more or less conducive to justice in the\nsense of desert, and that, ceteris paribus, they should be\nmade more conducive to it rather than less (e.g., Lamont 1997; Herzog\n2013, ch. V; see also Herzog 2017, chap. V). In that form, however,\nthe argument concerns not the justification of markets, but\nrather the question of how their framework should be designed, such\nthat they bring about results that reward\n desert.[4]\n\nThe most important argument for markets that builds on consequences,\nhowever, concerns their ability to deliver efficient outcomes and to\ncreate high levels of welfare. They spur economic growth, while not\nrelying on a central planning mechanism, but on the self-interest of\nindividuals. This is what the famous Smithian metaphor of the\n“invisible hand” (WN IV.II.9) is usually taken to stand\nfor. Under certain assumptions, such as stable preferences, the\nabsence of external effects on third parties, equal and open access to\ninformation, and the absence of one-sided bargaining power, market\noutcomes are Pareto efficient. This has been shown in the first\ntheorem of welfare economics (for the formal proof see e.g.,\nMas-Colell/Whinston/Green 1995, ch. 16). Pareto efficiency means that\nno individual’s position in terms of satisfaction of her\npreferences can be improved without reducing another\nindividual’s position, i.e. there is no waste caused by unused\npossibilities of bargaining. The strict mathematical conditions of the\nfirst theorem of welfare economics never hold in practice. But the\ngeneral equilibrium model embodies two arguments about markets that\nexplain why they can spur economic growth, and these can also be\napplied to real markets. The first can be called the\n“coordination argument” (cf. Roemer 2012): the price\nsystem can transmit complex information about people’s\npreferences in decentralized ways, which allows for the allocation of\ngoods and services to where they are most wanted. The emerging\nspontaneous order satisfies social needs in better ways than could be\nachieved by central planning (see notably von Hayek 1945). Market\nprices serve as an instrument for determining the opportunity costs of\ncertain uses of resources, which also allows for comparisons of the\ndifferent sets of resources individuals hold (see Dworkin 2000, ch. 1\nand 2). \n\nThe second argument is that markets fuel individuals’ energies\nbecause they give them incentives to find socially useful ways in\nwhich to use their talents. As Adam Smith’s famous (if often\nabused) quote goes: “It is not from the benevolence of the\nbutcher, the brewer, or the baker, that we expect our dinner, but from\ntheir regard to their own interest” (WN I.II.2). Smith’s\naim is not to give an account of human nature as fundamentally\negoistic. Rather, he points out that markets tap a source of\nmotivation that goes beyond the benevolence that people show within a\nsmall circle of family members and friends. Their self-interest\nconnects individuals to a much wider range of exchange partners, which\nallows for a greater division of labor and hence more efficient\nproduction. Defenders of markets also hold that they support\ninnovation because they give individuals the possibility of using new\ntechniques and new combinations of factors of production, and they\nprovide capital for entrepreneurs and inventors. This leads to a\ndynamic process of “creative destruction” that helps raise\nthe standard of living (Schumpeter 1942, who popularized this Marxist\nterm).\n\nThe arguments from efficiency and growth do not, as such, say anything\nabout the distribution of income and wealth that is achieved\nin a market economy. A situation can be Pareto efficient while at the\nsame time being extremely unequal (cf. e.g., Sen 1973). Sometimes one\nfinds additional pro-market arguments to the effect that the wealth\ncreated by markets automatically “trickles down” to the\npoorer layers of society. This can happen, for example, when the rich\nbuy goods or services the production of which creates employment for\nthe poor (as argued by Smith in 1976b [1759] IV.I.10], or when\ninnovations first made for luxury goods are later adopted in the mass\nmarket. It is not clear, however, under what conditions this happens.\nAs a matter of fact, market economies exist in egalitarian and less\negalitarian societies. Surrounding institutions play a major role in\ndetermining the degree of inequality that results from them. One can\nargue, however, that well-designed markets can contribute to making\nthe pie of a national economy larger than it would otherwise be, and\nthat the additional wealth can be redistributed through taxation or\nother measures. Then markets, in combination with other institutions,\ncan potentially be justified vis-à-vis non-market-institutions\nby their distributive effects, for example along the lines of\nRawls’ “difference principle”. According to this\nprinciple inequalities can be justified if they are “to the\ngreatest benefit of the least advantaged members of society”\n(1999, 5–6). If one chooses this justification for markets, the\ndesign of institutions and the degree to which income and wealth\nshould be redistributed depend not only on one’s normative\nposition, but also on one one’s assumption about which regime in\nfact makes the poorest members of society best-off. Such an\ninstrumental defense of markets can be found in many theories of what\nFreeman (e.g., 2011) calls the “high liberal” (in contrast\nto the “classical liberal”) tradition.\n",
    "section_title": "3.1 Justifications of markets",
    "entry_title": "Markets",
    "hierarchy_title": "Markets || Arguments about markets || Justifications of markets",
    "tokenized_text": [
        "argument",
        "market",
        "justification",
        "market",
        "justification",
        "market",
        "sen",
        "distinguishes",
        "two",
        "basic",
        "strategy",
        "justifying",
        "market",
        "antecedent",
        "right",
        "liberty",
        "one",
        "hand",
        "consequence",
        "hand",
        "argument",
        "antecedent",
        "right",
        "liberty",
        "often",
        "go",
        "hand",
        "hand",
        "right",
        "question",
        "said",
        "protect",
        "liberty",
        "question",
        "paradigmatic",
        "form",
        "argument",
        "based",
        "right",
        "private",
        "property",
        "give",
        "individual",
        "right",
        "whatever",
        "like",
        "property",
        "includes",
        "right",
        "enter",
        "exchange",
        "relationship",
        "others",
        "prohibiting",
        "exchange",
        "interfering",
        "way",
        "infringes",
        "right",
        "thus",
        "said",
        "basic",
        "form",
        "freedom",
        "attractiveness",
        "justification",
        "market",
        "lie",
        "priori",
        "character",
        "intuitive",
        "plausibility",
        "work",
        "one",
        "defend",
        "priori",
        "right",
        "liberty",
        "based",
        "argument",
        "kind",
        "therefore",
        "often",
        "joined",
        "argument",
        "naturalness",
        "property",
        "right",
        "existing",
        "prior",
        "state",
        "plausible",
        "hold",
        "property",
        "right",
        "must",
        "compromised",
        "one",
        "hold",
        "priori",
        "understood",
        "dependent",
        "consent",
        "society",
        "enforcement",
        "state",
        "naturalness",
        "property",
        "right",
        "often",
        "defended",
        "connecting",
        "selfownership",
        "basing",
        "mixing",
        "one",
        "labor",
        "material",
        "thing",
        "thereby",
        "appropriating",
        "along",
        "lockean",
        "line",
        "locke",
        "see",
        "also",
        "nozick",
        "leftlibertarian",
        "defense",
        "private",
        "property",
        "combine",
        "different",
        "position",
        "regard",
        "equality",
        "role",
        "state",
        "see",
        "eg",
        "vallentynesteiner",
        "view",
        "property",
        "right",
        "disputed",
        "many",
        "thinker",
        "point",
        "crucial",
        "role",
        "state",
        "providing",
        "protecting",
        "property",
        "right",
        "right",
        "free",
        "contract",
        "see",
        "eg",
        "murphynagel",
        "also",
        "many",
        "historian",
        "idea",
        "pointed",
        "idea",
        "liberty",
        "consists",
        "unhindered",
        "use",
        "one",
        "property",
        "macgilvray",
        "call",
        "market",
        "freedom",
        "way",
        "freedom",
        "understood",
        "historically",
        "understood",
        "see",
        "example",
        "pettit",
        "discussion",
        "market",
        "perspective",
        "freedom",
        "nondomination",
        "emphatic",
        "endorsement",
        "market",
        "neorepublican",
        "perspective",
        "see",
        "taylor",
        "fact",
        "strength",
        "priori",
        "defense",
        "market",
        "crucially",
        "depends",
        "count",
        "infringement",
        "freedom",
        "one",
        "count",
        "coercive",
        "rule",
        "state",
        "one",
        "also",
        "count",
        "obstacle",
        "pursuing",
        "one",
        "interest",
        "one",
        "experience",
        "market",
        "society",
        "often",
        "result",
        "numerous",
        "decision",
        "anonymous",
        "individual",
        "cf",
        "eg",
        "cohen",
        "olsaretti",
        "ch",
        "macgilvray",
        "ch",
        "strict",
        "system",
        "private",
        "property",
        "right",
        "lead",
        "situation",
        "extreme",
        "inequality",
        "member",
        "society",
        "left",
        "starve",
        "becomes",
        "questionable",
        "sense",
        "called",
        "free",
        "present",
        "defender",
        "market",
        "priori",
        "ground",
        "choice",
        "either",
        "bite",
        "bullet",
        "accept",
        "extreme",
        "inequality",
        "poverty",
        "justified",
        "step",
        "back",
        "pure",
        "priori",
        "position",
        "admit",
        "consequence",
        "play",
        "role",
        "consideration",
        "market",
        "one",
        "admit",
        "market",
        "may",
        "supplemented",
        "institution",
        "justification",
        "unconditional",
        "sen",
        "nevertheless",
        "right",
        "liberty",
        "continue",
        "play",
        "important",
        "role",
        "promarket",
        "argument",
        "even",
        "embedded",
        "wider",
        "framework",
        "example",
        "certain",
        "amount",
        "taxation",
        "also",
        "defended",
        "recent",
        "account",
        "called",
        "free",
        "market",
        "fairness",
        "emphasizes",
        "importance",
        "economic",
        "liberty",
        "basic",
        "right",
        "also",
        "allows",
        "restriction",
        "sake",
        "social",
        "justice",
        "see",
        "tomasi",
        "many",
        "justification",
        "market",
        "however",
        "based",
        "priori",
        "right",
        "liberty",
        "rather",
        "consequence",
        "market",
        "several",
        "dimension",
        "consequence",
        "distinguished",
        "first",
        "historically",
        "important",
        "argument",
        "hold",
        "market",
        "make",
        "individual",
        "virtuous",
        "sociable",
        "build",
        "calm",
        "rational",
        "interest",
        "rather",
        "violent",
        "passion",
        "market",
        "therefore",
        "make",
        "manner",
        "peaceful",
        "civilized",
        "see",
        "hirschman",
        "refers",
        "montesquieu",
        "th",
        "century",
        "thinker",
        "argument",
        "characterbuilding",
        "effect",
        "market",
        "sometimes",
        "also",
        "raised",
        "today",
        "cf",
        "eg",
        "mccloskey",
        "critical",
        "discussion",
        "see",
        "fumagalli",
        "hirschman",
        "conjectured",
        "civilizing",
        "moralizing",
        "force",
        "market",
        "might",
        "sufficient",
        "outbalance",
        "selfundermining",
        "force",
        "bowles",
        "contrast",
        "suggested",
        "nonmarket",
        "element",
        "liberal",
        "society",
        "might",
        "counteract",
        "potentially",
        "dangerous",
        "effect",
        "market",
        "second",
        "argument",
        "concern",
        "consequence",
        "market",
        "sense",
        "distribution",
        "bring",
        "sometimes",
        "held",
        "market",
        "specifically",
        "labor",
        "market",
        "give",
        "people",
        "deserve",
        "reward",
        "individual",
        "contribution",
        "social",
        "whole",
        "make",
        "desert",
        "rather",
        "traditional",
        "hierarchy",
        "determinant",
        "social",
        "position",
        "eg",
        "miller",
        "ch",
        "viiiix",
        "honneth",
        "fraserhonneth",
        "ff",
        "mankiw",
        "justification",
        "profit",
        "along",
        "similar",
        "line",
        "see",
        "eg",
        "arnold",
        "narveson",
        "argument",
        "draw",
        "luck",
        "egalitarian",
        "intuition",
        "difference",
        "individual",
        "income",
        "justified",
        "long",
        "undeserved",
        "reflect",
        "free",
        "choice",
        "see",
        "eg",
        "arneson",
        "example",
        "decision",
        "work",
        "rather",
        "hour",
        "per",
        "week",
        "take",
        "le",
        "pleasant",
        "job",
        "give",
        "one",
        "premium",
        "steeplejack",
        "embalmer",
        "working",
        "night",
        "shift",
        "okun",
        "matter",
        "debate",
        "however",
        "whether",
        "market",
        "fact",
        "reward",
        "choice",
        "way",
        "whether",
        "one",
        "socioeconomic",
        "background",
        "one",
        "participation",
        "team",
        "worker",
        "individual",
        "contribution",
        "may",
        "impossible",
        "separate",
        "simply",
        "luck",
        "play",
        "great",
        "role",
        "determining",
        "one",
        "income",
        "cult",
        "personal",
        "responsibility",
        "would",
        "misguided",
        "barry",
        "part",
        "iv",
        "cf",
        "also",
        "olsaretti",
        "ch",
        "discussion",
        "argument",
        "market",
        "desert",
        "ultimately",
        "reject",
        "interestingly",
        "even",
        "defender",
        "free",
        "market",
        "von",
        "hayek",
        "knight",
        "argued",
        "sense",
        "called",
        "concern",
        "framework",
        "rule",
        "within",
        "take",
        "place",
        "resulting",
        "distributing",
        "income",
        "argue",
        "market",
        "reward",
        "namely",
        "satisfaction",
        "want",
        "nothing",
        "moral",
        "value",
        "ch",
        "ix",
        "cf",
        "also",
        "knight",
        "one",
        "might",
        "argue",
        "rule",
        "le",
        "conducive",
        "justice",
        "sense",
        "desert",
        "ceteris",
        "paribus",
        "made",
        "conducive",
        "rather",
        "le",
        "eg",
        "lamont",
        "herzog",
        "ch",
        "v",
        "see",
        "also",
        "herzog",
        "chap",
        "v",
        "form",
        "however",
        "argument",
        "concern",
        "justification",
        "market",
        "rather",
        "question",
        "framework",
        "designed",
        "bring",
        "result",
        "reward",
        "desert",
        "important",
        "argument",
        "market",
        "build",
        "consequence",
        "however",
        "concern",
        "ability",
        "deliver",
        "efficient",
        "outcome",
        "create",
        "high",
        "level",
        "welfare",
        "spur",
        "economic",
        "growth",
        "relying",
        "central",
        "planning",
        "mechanism",
        "selfinterest",
        "individual",
        "famous",
        "smithian",
        "metaphor",
        "invisible",
        "hand",
        "wn",
        "ivii",
        "usually",
        "taken",
        "stand",
        "certain",
        "assumption",
        "stable",
        "preference",
        "absence",
        "external",
        "effect",
        "third",
        "party",
        "equal",
        "open",
        "access",
        "information",
        "absence",
        "onesided",
        "bargaining",
        "power",
        "market",
        "outcome",
        "pareto",
        "efficient",
        "shown",
        "first",
        "theorem",
        "welfare",
        "economics",
        "formal",
        "proof",
        "see",
        "eg",
        "mascolellwhinstongreen",
        "ch",
        "pareto",
        "efficiency",
        "mean",
        "individual",
        "position",
        "term",
        "satisfaction",
        "preference",
        "improved",
        "without",
        "reducing",
        "another",
        "individual",
        "position",
        "ie",
        "waste",
        "caused",
        "unused",
        "possibility",
        "bargaining",
        "strict",
        "mathematical",
        "condition",
        "first",
        "theorem",
        "welfare",
        "economics",
        "never",
        "hold",
        "practice",
        "general",
        "equilibrium",
        "model",
        "embodies",
        "two",
        "argument",
        "market",
        "explain",
        "spur",
        "economic",
        "growth",
        "also",
        "applied",
        "real",
        "market",
        "first",
        "called",
        "coordination",
        "argument",
        "cf",
        "roemer",
        "price",
        "system",
        "transmit",
        "complex",
        "information",
        "people",
        "preference",
        "decentralized",
        "way",
        "allows",
        "allocation",
        "good",
        "service",
        "wanted",
        "emerging",
        "spontaneous",
        "order",
        "satisfies",
        "social",
        "need",
        "better",
        "way",
        "could",
        "achieved",
        "central",
        "planning",
        "see",
        "notably",
        "von",
        "hayek",
        "market",
        "price",
        "serve",
        "instrument",
        "determining",
        "opportunity",
        "cost",
        "certain",
        "us",
        "resource",
        "also",
        "allows",
        "comparison",
        "different",
        "set",
        "resource",
        "individual",
        "hold",
        "see",
        "dworkin",
        "ch",
        "second",
        "argument",
        "market",
        "fuel",
        "individual",
        "energy",
        "give",
        "incentive",
        "find",
        "socially",
        "useful",
        "way",
        "use",
        "talent",
        "adam",
        "smith",
        "famous",
        "often",
        "abused",
        "quote",
        "go",
        "benevolence",
        "butcher",
        "brewer",
        "baker",
        "expect",
        "dinner",
        "regard",
        "interest",
        "wn",
        "iii",
        "smith",
        "aim",
        "give",
        "account",
        "human",
        "nature",
        "fundamentally",
        "egoistic",
        "rather",
        "point",
        "market",
        "tap",
        "source",
        "motivation",
        "go",
        "beyond",
        "benevolence",
        "people",
        "show",
        "within",
        "small",
        "circle",
        "family",
        "member",
        "friend",
        "selfinterest",
        "connects",
        "individual",
        "much",
        "wider",
        "range",
        "exchange",
        "partner",
        "allows",
        "greater",
        "division",
        "labor",
        "hence",
        "efficient",
        "production",
        "defender",
        "market",
        "also",
        "hold",
        "support",
        "innovation",
        "give",
        "individual",
        "possibility",
        "using",
        "new",
        "technique",
        "new",
        "combination",
        "factor",
        "production",
        "provide",
        "capital",
        "entrepreneur",
        "inventor",
        "lead",
        "dynamic",
        "process",
        "creative",
        "destruction",
        "help",
        "raise",
        "standard",
        "living",
        "schumpeter",
        "popularized",
        "marxist",
        "term",
        "argument",
        "efficiency",
        "growth",
        "say",
        "anything",
        "distribution",
        "income",
        "wealth",
        "achieved",
        "market",
        "economy",
        "situation",
        "pareto",
        "efficient",
        "time",
        "extremely",
        "unequal",
        "cf",
        "eg",
        "sen",
        "sometimes",
        "one",
        "find",
        "additional",
        "promarket",
        "argument",
        "effect",
        "wealth",
        "created",
        "market",
        "automatically",
        "trickle",
        "poorer",
        "layer",
        "society",
        "happen",
        "example",
        "rich",
        "buy",
        "good",
        "service",
        "production",
        "creates",
        "employment",
        "poor",
        "argued",
        "smith",
        "b",
        "ivi",
        "innovation",
        "first",
        "made",
        "luxury",
        "good",
        "later",
        "adopted",
        "mass",
        "market",
        "clear",
        "however",
        "condition",
        "happens",
        "matter",
        "fact",
        "market",
        "economy",
        "exist",
        "egalitarian",
        "le",
        "egalitarian",
        "society",
        "surrounding",
        "institution",
        "play",
        "major",
        "role",
        "determining",
        "degree",
        "inequality",
        "result",
        "one",
        "argue",
        "however",
        "welldesigned",
        "market",
        "contribute",
        "making",
        "pie",
        "national",
        "economy",
        "larger",
        "would",
        "otherwise",
        "additional",
        "wealth",
        "redistributed",
        "taxation",
        "measure",
        "market",
        "combination",
        "institution",
        "potentially",
        "justified",
        "visàvis",
        "nonmarketinstitutions",
        "distributive",
        "effect",
        "example",
        "along",
        "line",
        "rawls",
        "difference",
        "principle",
        "according",
        "principle",
        "inequality",
        "justified",
        "greatest",
        "benefit",
        "least",
        "advantaged",
        "member",
        "society",
        "one",
        "chooses",
        "justification",
        "market",
        "design",
        "institution",
        "degree",
        "income",
        "wealth",
        "redistributed",
        "depend",
        "one",
        "normative",
        "position",
        "also",
        "one",
        "one",
        "assumption",
        "regime",
        "fact",
        "make",
        "poorest",
        "member",
        "society",
        "bestoff",
        "instrumental",
        "defense",
        "market",
        "found",
        "many",
        "theory",
        "freeman",
        "eg",
        "call",
        "high",
        "liberal",
        "contrast",
        "classical",
        "liberal",
        "tradition"
    ]
}