{
    "main_text": "Arguments about markets || Criticisms of markets\n3.2 Criticisms of markets\n\nNumerous arguments have been brought forward against markets, either\nin order to reject them altogether or in order call for their\nlimitation. One of the main criticisms of relying on markets to\norganize economic life points to their unequal outcomes, and the\npoverty – understood in absolute or relative terms – they\ncan create. In the 19th century, this concerned in\nparticular those members of society who did not own the means of\nproduction and therefore had to sell their labor to earn an income.\nDuring the industrial revolution a large percentage of the laboring\nclasses turned into a proletariat that, in Marx’ and\nEngels’ famous words, had “nothing to lose but its\nchains” [Communist Manifesto, 1848]. The ability of\nmarkets to be a “tide that lifts all boats” (a phrase\nattributed to J.F. Kennedy) has thus been questioned at least since\nthe 19th century. Critics have called for a more equal\ndistribution of resources in society. Often, this criticism was\ncombined with the call for a complete overthrow of the capitalist\nsystem, which was seen as self-undermining because of the ever-greater\ndivisions it created; this debate has been revived by the publication\nof Piketty (2014) and the ensuing controversies about diverging\ntendencies in capitalist societies.\n\nTo this criticism defenders of markets can reply by questioning the\nvalue of equality of outcomes. What is more difficult for them to\nreject – because their own arguments often emphasize rights and\nliberties – is the charge that the inequalities created by\nunregulated markets can go so far as to seriously limit the\npossibility of making use of one’s rights and liberties (see\nalso Rawls 1971, sect. 32). In a society in which most goods and\nservices are distributed through markets, those who do not have the\nmeans for purchasing them can be said to be free only in a very\nrestricted sense. Even relative (in contrast to absolute) poverty can\nlead to various forms of social exclusion. A lot here depends on how\none understands the notions of freedom and coercion, but in some\nsituations it is plausible that a lack of resources subjects\nindividuals to coercion, not least because it is the enforcement of\nother persons’ property rights that hinders their\naccess to resources (Cohen 1995, Otsuka 2003, Waldron 1993, Widerquist\n2013). As Satz (2010, esp. ch. 4) argues, the vulnerability of agents\nwhose choice is limited by their dire situation, as well as the\n“weak agency” of individuals who are poorly informed and\ndepend on other people’s decision, can therefore be reasons for\nlimiting free markets. In the 19th century, the asymmetry\nin bargaining power between workers and capitalist was at the heart of\nthe debate, and it still plays an important role in many countries. In\naddition, individuals with low human capital, with psychological\nafflictions, or with a problematic legal status (e.g., illegal\nmigrants) are especially vulnerable in markets. The idea of markets as\nmechanisms of social coordination is based on a picture of all\nindividuals as sovereign, fully informed, and fully rational choosers.\nWherever this is not the case, markets can lead to the exploitation of\nvulnerable individuals by others. These arguments do not necessarily\nimply a complete rejection of markets, but they raise questions about\nthe wider institutional framework in which they are embedded. Possible\nremedies to these problems can either aim at regulating markets or at\ncomplementing them by institutions that put individuals on a more\nequal footing when they enter into exchange relationships (cf. 4.2\n below).[5]\n\nThe idea that markets have anything to do with “desert”\nhas also been criticized, especially from the perspective of Marxian\ntheories of exploitation. They hold that, to the contrary, laborers\nare systematically deprived of their rightful contribution, as their\nwages are lower than the value they create through their labour (e.g.,\nMarx, Capital, vol. I, ch. 7–8; for a discussion see\ne.g., Buchanan 1985, 87–95). As has also been pointed out, the\nidea of desert can easily serve as an ideological smokescreen for\nthose who are successful in markets (cf. e.g., Hayek 1978, 74f.).\nMarkets have been criticized for cementing inequality and social\ndivision, thus undermining equality of opportunity (cf., e.g., Barry\n2005, parts II-IV). This leads to the question whether other\ninstitutions, for example a system of public education, can help to\nmitigate these problems, so that a combined system could be\njustified.\n\nThe ability of markets to deliver efficient outcomes when the goods in\nquestion are private goods has seldom been questioned by their\ncritics. But even friends of markets admit that they do not lead to\nefficient outcomes in cases of \"market failure\", specifically when\nthere are external effects or public goods. External effects are\neffects on third parties that are not captured in property rights, for\nexample air pollution or CO2 emissions. Public goods are goods that\nare non-excludable (it is not possible to effectively exclude\nindividuals from their use) and non-rivalrous (the possibility of use\nby one individual does not reduce the possibility of others using it)\n(see Mas-Colell/Whinston/Green 1995, ch. 11). An example for a public\ngood is public security: if it is provided, individuals cannot be\nexcluded from it, and the fact that more individuals enjoy it does not\nreduce its value for others. Therefore, no individual has sufficient\neconomic incentives to provide it; it has to be provided by the state.\nCritics of markets often hold that situations that include external\neffects or public goods are much more widespread than defenders of\nmarkets admit, including not only environmental but also social\nproblems. With regard to externalities, economists often point to\nCoase’s famous theorem that holds that when there are no\ntransaction costs, problems of externalities can be overcome through\nbargaining, independent of the initial distribution of property rights\n(1960). In reality, however, transactions are often extremely\ndifficult and costly, especially when multiple agents with differing\ninterests are involved. This makes the applicability of this theorem\n– and hence the defense of market solutions in such cases\n– problematic. Another problematic case is that of\n“positional goods” (Hirsch 1976), i.e. goods the value of\nwhich depends on their relative position in comparison to what other\nhave. A case in point are expensive houses that people desire for the\nsake of their status rather than their intrinsic qualities: they want\nto have a house that has a certain size relative to the houses of\nothers. Positional goods are scarce by definition: only 10% of houses\ncan be in the top 10% of the market. Competition for them is thus a\nzero-sum game: it is a “rat race” in which everyone keeps\nthe same relative position if everyone moves up by the same amount.\nThis is why some theorists argue that the externalities caused by this\nkind of competition justifies regulatory measures (see e.g., Frank\n2005; for a discussion of positional goods from an egalitarian\nperspective see also Brighhouse & Swift 2006, for an account in\nterms of recognition theory see Claassen 2008).\n\nA broader question that can be raised in this context is the question\nof “efficiency of what?” (cf. also Satz 2010, 33f.). As\ncritics of markets point out, markets may be efficient in satisfying\npeople’s wants, but sometimes this may happen because they\nactually shift people’s preferences towards things that can\neasily (which often means: profitably) be provided in markets. These\nare not necessarily the preferences people would choose it they\nreflected about which preferences they would like to have (cf. e.g.,\nGeorge 2001, who uses the metaphor of “preference\npollution”). Economic models of markets usually take\nindividuals’ preferences as given, which hides a whole range of\nquestions that have been raised about markets in this respect: how do\nmarkets change individuals, their relation to one another, and their\nrelation to certain goods and values? Among Marxist theorists, the\nterm “alienation” is used to describe the phenomenon of\nindividuals being, or feeling, separated from things that should\nbelong together. For example, if workers have to sell their labor to\nthe owners of the means of production, they are said to be alienated\nfrom their work and its products, as well as from other human beings\nand the being of the human species, (Marx [1844], I; for a recent\naccount of the notion of alienation see Jaeggi 2014).\n\nWith regard to human relations, market societies have been accused of\nundermining community and solidarity, as markets are based on purely\ninstrumental, fast-changing relations, so that “all that is\nsolid melts into air” (Marx/Engels, Communist\nManifesto; for a contemporary account see e.g., Lane\n 1991).[6]\n The “creative destruction” and competition that take\nplace in markets may spur innovation, as their defenders hold, but\nthey also destroy established social ties and traditions (cf. Polanyi\n1944) and might undermine solidarity (Hussain 2021). This thought\nseems to play a role in the communitarian critique of the liberal view\nof human nature (e.g., MacIntyre 1984, cf. Bell 2012 for an overview).\nIn addition, the fact that markets build on self-interest has been\nsaid to make individuals more egoistic and materialistic. Such\narguments are the counterpart to the claim that markets make\nindividuals more social and moral, as held by their\ndefenders. An important aspect of this debate, which has also been\nexplored empirically, is the tendency of monetary incentives to\n“crowd out” the intrinsic motivation to act out of\naltruism or for the sake of the public good (cf. e.g., Titmus’\nfamous study on paid and unpaid blood donations (1971); Frey (e.g.,\n2007); see also Gneezy/Rustichini’s study on how a fine for\nlate-coming parents at a day-care center increased their numbers\nbecause it was seen as a price (2000)).\n\nThe strength of such arguments depends on whether individuals can and\ndo restrict their “market attitude” to the economic\nsphere, or whether this attitude comes to dominate society as a whole.\nFor example, can it be kept at a distance from private relationships,\nor do individuals develop a market attitude with regard to intimate\nrelationships as well, as sociologist Eva Illouz argues (e.g., 2012)?\nPressure on the private sphere not only comes from people’s\nconscious or unconscious transmission of certain ways of thinking, but\nalso from the increasing number (or at least the perceived increase)\nof monetary transactions that concern this sphere, for example in the\nform of paid child care or surrogate motherhood. This has led critics\nof markets to call for limitations of their sphere of influence in\norder not to “commodify” goods whose meaning is closely\ntied to values such as intimate relations, individual flourishing, or\nchild-parent relationships (cf. e.g., Radin 1996; Anderson 1993;\nSandel 2012; for a critical discussion see Satz 2010, 80ff.). As\nAnderson emphasizes, the larger question behind this issue is how a\nsociety can accommodate a plurality of goods that are valued in\ndifferent ways (1993, esp. ch. 1 and 3). A similar strand of arguments\nconcerns the question of whether markets push people towards the\nconsumption of material rather than immaterial goods (see e.g., the\npopular account by Fromm 1976). If this is the case, they not only\n“pollute” their preferences, but also contribute to the\noverconsumption of natural resources and a variety of ecological\nproblems (e.g., Wright 2011, 70; Hardin 1968).\n\nRelated arguments concern the question of whether citizens can stand\nin an equal respectful relationship to one another if certain goods,\ne.g., votes or body parts, are traded in markets (Sandel 2012, 10ff.\ncf. also Satz 2010, ch. 3; on the ethics of vote buying, see the\nrelevant section of the entry on\n voting,\n on body parts see Phillips\n 2013,[7]\n on legal representation see Wilmot-Smith 2019, Agmon 2021). For\nexample, it has been argued that some institutions, e.g., schools, are\nsuch that disagreements should be settled by “voice”\nrather than “exit” (in Hirschman’s 1970 distinction;\nfor the example of schools see e.g., Anderson 1993, 162f.). Also, many\npolitical theorists argue that the political sphere of a democracy\nshould be seen as different from markets in that what is at stake are\nnot individual interests, but the public good (cf. e.g., Radin 1996,\nch. 14, who draws on John Dewey’s understanding of democracy).\nWhat such theories have in common is that they see society as composed\nof different social spheres – and, as Walzer puts it,\n“[t]he morality of the bazaar belongs in the bazaar”,\nwhereas exchanges in other social spheres should be blocked (1983,\n109). In many such cases, a combination of arguments applies,\nconcerning not only the character of goods, but also the vulnerability\nof some market participants. As Brennan and Jaworski (2015, 2016) have\nrecently argued, arguments about commodification that are based\nexclusively on the symbolic dimension of trading certain\ngoods are not convincing because these symbolic dimensions are\nculturally contingent. But many cases of commodification are not\npurely symbolically harmful, they combine symbolic and other harms. On\nthe other hand, as Satz (2010, e.g., 9) reminds us, the best answer to\nproblematic markets is not always to ban them as this might lead to\nblack markets or other evasion mechanisms. The question of\nalternatives, e.g., regulated markets or markets complemented by other\ninstitutions, often depends on the institutional framework within\nwhich markets take places. This will be considered in section 4\nbelow.\n",
    "section_title": "3.2 Criticisms of markets",
    "entry_title": "Markets",
    "hierarchy_title": "Markets || Arguments about markets || Criticisms of markets",
    "tokenized_text": [
        "argument",
        "market",
        "criticism",
        "market",
        "criticism",
        "market",
        "numerous",
        "argument",
        "brought",
        "forward",
        "market",
        "either",
        "order",
        "reject",
        "altogether",
        "order",
        "call",
        "limitation",
        "one",
        "main",
        "criticism",
        "relying",
        "market",
        "organize",
        "economic",
        "life",
        "point",
        "unequal",
        "outcome",
        "poverty",
        "understood",
        "absolute",
        "relative",
        "term",
        "create",
        "th",
        "century",
        "concerned",
        "particular",
        "member",
        "society",
        "mean",
        "production",
        "therefore",
        "sell",
        "labor",
        "earn",
        "income",
        "industrial",
        "revolution",
        "large",
        "percentage",
        "laboring",
        "class",
        "turned",
        "proletariat",
        "marx",
        "engels",
        "famous",
        "word",
        "nothing",
        "lose",
        "chain",
        "communist",
        "manifesto",
        "ability",
        "market",
        "tide",
        "lift",
        "boat",
        "phrase",
        "attributed",
        "jf",
        "kennedy",
        "thus",
        "questioned",
        "least",
        "since",
        "th",
        "century",
        "critic",
        "called",
        "equal",
        "distribution",
        "resource",
        "society",
        "often",
        "criticism",
        "combined",
        "call",
        "complete",
        "overthrow",
        "capitalist",
        "system",
        "seen",
        "selfundermining",
        "evergreater",
        "division",
        "created",
        "debate",
        "revived",
        "publication",
        "piketty",
        "ensuing",
        "controversy",
        "diverging",
        "tendency",
        "capitalist",
        "society",
        "criticism",
        "defender",
        "market",
        "reply",
        "questioning",
        "value",
        "equality",
        "outcome",
        "difficult",
        "reject",
        "argument",
        "often",
        "emphasize",
        "right",
        "liberty",
        "charge",
        "inequality",
        "created",
        "unregulated",
        "market",
        "go",
        "far",
        "seriously",
        "limit",
        "possibility",
        "making",
        "use",
        "one",
        "right",
        "liberty",
        "see",
        "also",
        "rawls",
        "sect",
        "society",
        "good",
        "service",
        "distributed",
        "market",
        "mean",
        "purchasing",
        "said",
        "free",
        "restricted",
        "sense",
        "even",
        "relative",
        "contrast",
        "absolute",
        "poverty",
        "lead",
        "various",
        "form",
        "social",
        "exclusion",
        "lot",
        "depends",
        "one",
        "understands",
        "notion",
        "freedom",
        "coercion",
        "situation",
        "plausible",
        "lack",
        "resource",
        "subject",
        "individual",
        "coercion",
        "least",
        "enforcement",
        "person",
        "property",
        "right",
        "hinders",
        "access",
        "resource",
        "cohen",
        "otsuka",
        "waldron",
        "widerquist",
        "satz",
        "esp",
        "ch",
        "argues",
        "vulnerability",
        "agent",
        "whose",
        "choice",
        "limited",
        "dire",
        "situation",
        "well",
        "weak",
        "agency",
        "individual",
        "poorly",
        "informed",
        "depend",
        "people",
        "decision",
        "therefore",
        "reason",
        "limiting",
        "free",
        "market",
        "th",
        "century",
        "asymmetry",
        "bargaining",
        "power",
        "worker",
        "capitalist",
        "heart",
        "debate",
        "still",
        "play",
        "important",
        "role",
        "many",
        "country",
        "addition",
        "individual",
        "low",
        "human",
        "capital",
        "psychological",
        "affliction",
        "problematic",
        "legal",
        "status",
        "eg",
        "illegal",
        "migrant",
        "especially",
        "vulnerable",
        "market",
        "idea",
        "market",
        "mechanism",
        "social",
        "coordination",
        "based",
        "picture",
        "individual",
        "sovereign",
        "fully",
        "informed",
        "fully",
        "rational",
        "chooser",
        "wherever",
        "case",
        "market",
        "lead",
        "exploitation",
        "vulnerable",
        "individual",
        "others",
        "argument",
        "necessarily",
        "imply",
        "complete",
        "rejection",
        "market",
        "raise",
        "question",
        "wider",
        "institutional",
        "framework",
        "embedded",
        "possible",
        "remedy",
        "problem",
        "either",
        "aim",
        "regulating",
        "market",
        "complementing",
        "institution",
        "put",
        "individual",
        "equal",
        "footing",
        "enter",
        "exchange",
        "relationship",
        "cf",
        "idea",
        "market",
        "anything",
        "desert",
        "also",
        "criticized",
        "especially",
        "perspective",
        "marxian",
        "theory",
        "exploitation",
        "hold",
        "contrary",
        "laborer",
        "systematically",
        "deprived",
        "rightful",
        "contribution",
        "wage",
        "lower",
        "value",
        "create",
        "labour",
        "eg",
        "marx",
        "capital",
        "vol",
        "ch",
        "discussion",
        "see",
        "eg",
        "buchanan",
        "also",
        "pointed",
        "idea",
        "desert",
        "easily",
        "serve",
        "ideological",
        "smokescreen",
        "successful",
        "market",
        "cf",
        "eg",
        "hayek",
        "f",
        "market",
        "criticized",
        "cementing",
        "inequality",
        "social",
        "division",
        "thus",
        "undermining",
        "equality",
        "opportunity",
        "cf",
        "eg",
        "barry",
        "part",
        "iiiv",
        "lead",
        "question",
        "whether",
        "institution",
        "example",
        "system",
        "public",
        "education",
        "help",
        "mitigate",
        "problem",
        "combined",
        "system",
        "could",
        "justified",
        "ability",
        "market",
        "deliver",
        "efficient",
        "outcome",
        "good",
        "question",
        "private",
        "good",
        "seldom",
        "questioned",
        "critic",
        "even",
        "friend",
        "market",
        "admit",
        "lead",
        "efficient",
        "outcome",
        "case",
        "market",
        "failure",
        "specifically",
        "external",
        "effect",
        "public",
        "good",
        "external",
        "effect",
        "effect",
        "third",
        "party",
        "captured",
        "property",
        "right",
        "example",
        "air",
        "pollution",
        "co",
        "emission",
        "public",
        "good",
        "good",
        "nonexcludable",
        "possible",
        "effectively",
        "exclude",
        "individual",
        "use",
        "nonrivalrous",
        "possibility",
        "use",
        "one",
        "individual",
        "reduce",
        "possibility",
        "others",
        "using",
        "see",
        "mascolellwhinstongreen",
        "ch",
        "example",
        "public",
        "good",
        "public",
        "security",
        "provided",
        "individual",
        "excluded",
        "fact",
        "individual",
        "enjoy",
        "reduce",
        "value",
        "others",
        "therefore",
        "individual",
        "sufficient",
        "economic",
        "incentive",
        "provide",
        "provided",
        "state",
        "critic",
        "market",
        "often",
        "hold",
        "situation",
        "include",
        "external",
        "effect",
        "public",
        "good",
        "much",
        "widespread",
        "defender",
        "market",
        "admit",
        "including",
        "environmental",
        "also",
        "social",
        "problem",
        "regard",
        "externality",
        "economist",
        "often",
        "point",
        "coase",
        "famous",
        "theorem",
        "hold",
        "transaction",
        "cost",
        "problem",
        "externality",
        "overcome",
        "bargaining",
        "independent",
        "initial",
        "distribution",
        "property",
        "right",
        "reality",
        "however",
        "transaction",
        "often",
        "extremely",
        "difficult",
        "costly",
        "especially",
        "multiple",
        "agent",
        "differing",
        "interest",
        "involved",
        "make",
        "applicability",
        "theorem",
        "hence",
        "defense",
        "market",
        "solution",
        "case",
        "problematic",
        "another",
        "problematic",
        "case",
        "positional",
        "good",
        "hirsch",
        "ie",
        "good",
        "value",
        "depends",
        "relative",
        "position",
        "comparison",
        "case",
        "point",
        "expensive",
        "house",
        "people",
        "desire",
        "sake",
        "status",
        "rather",
        "intrinsic",
        "quality",
        "want",
        "house",
        "certain",
        "size",
        "relative",
        "house",
        "others",
        "positional",
        "good",
        "scarce",
        "definition",
        "house",
        "top",
        "market",
        "competition",
        "thus",
        "zerosum",
        "game",
        "rat",
        "race",
        "everyone",
        "keep",
        "relative",
        "position",
        "everyone",
        "move",
        "amount",
        "theorist",
        "argue",
        "externality",
        "caused",
        "kind",
        "competition",
        "justifies",
        "regulatory",
        "measure",
        "see",
        "eg",
        "frank",
        "discussion",
        "positional",
        "good",
        "egalitarian",
        "perspective",
        "see",
        "also",
        "brighhouse",
        "swift",
        "account",
        "term",
        "recognition",
        "theory",
        "see",
        "claassen",
        "broader",
        "question",
        "raised",
        "context",
        "question",
        "efficiency",
        "cf",
        "also",
        "satz",
        "f",
        "critic",
        "market",
        "point",
        "market",
        "may",
        "efficient",
        "satisfying",
        "people",
        "want",
        "sometimes",
        "may",
        "happen",
        "actually",
        "shift",
        "people",
        "preference",
        "towards",
        "thing",
        "easily",
        "often",
        "mean",
        "profitably",
        "provided",
        "market",
        "necessarily",
        "preference",
        "people",
        "would",
        "choose",
        "reflected",
        "preference",
        "would",
        "like",
        "cf",
        "eg",
        "george",
        "us",
        "metaphor",
        "preference",
        "pollution",
        "economic",
        "model",
        "market",
        "usually",
        "take",
        "individual",
        "preference",
        "given",
        "hide",
        "whole",
        "range",
        "question",
        "raised",
        "market",
        "respect",
        "market",
        "change",
        "individual",
        "relation",
        "one",
        "another",
        "relation",
        "certain",
        "good",
        "value",
        "among",
        "marxist",
        "theorist",
        "term",
        "alienation",
        "used",
        "describe",
        "phenomenon",
        "individual",
        "feeling",
        "separated",
        "thing",
        "belong",
        "together",
        "example",
        "worker",
        "sell",
        "labor",
        "owner",
        "mean",
        "production",
        "said",
        "alienated",
        "work",
        "product",
        "well",
        "human",
        "being",
        "human",
        "specie",
        "marx",
        "recent",
        "account",
        "notion",
        "alienation",
        "see",
        "jaeggi",
        "regard",
        "human",
        "relation",
        "market",
        "society",
        "accused",
        "undermining",
        "community",
        "solidarity",
        "market",
        "based",
        "purely",
        "instrumental",
        "fastchanging",
        "relation",
        "solid",
        "melt",
        "air",
        "marxengels",
        "communist",
        "manifesto",
        "contemporary",
        "account",
        "see",
        "eg",
        "lane",
        "creative",
        "destruction",
        "competition",
        "take",
        "place",
        "market",
        "may",
        "spur",
        "innovation",
        "defender",
        "hold",
        "also",
        "destroy",
        "established",
        "social",
        "tie",
        "tradition",
        "cf",
        "polanyi",
        "might",
        "undermine",
        "solidarity",
        "hussain",
        "thought",
        "seems",
        "play",
        "role",
        "communitarian",
        "critique",
        "liberal",
        "view",
        "human",
        "nature",
        "eg",
        "macintyre",
        "cf",
        "bell",
        "overview",
        "addition",
        "fact",
        "market",
        "build",
        "selfinterest",
        "said",
        "make",
        "individual",
        "egoistic",
        "materialistic",
        "argument",
        "counterpart",
        "claim",
        "market",
        "make",
        "individual",
        "social",
        "moral",
        "held",
        "defender",
        "important",
        "aspect",
        "debate",
        "also",
        "explored",
        "empirically",
        "tendency",
        "monetary",
        "incentive",
        "crowd",
        "intrinsic",
        "motivation",
        "act",
        "altruism",
        "sake",
        "public",
        "good",
        "cf",
        "eg",
        "titmus",
        "famous",
        "study",
        "paid",
        "unpaid",
        "blood",
        "donation",
        "frey",
        "eg",
        "see",
        "also",
        "gneezyrustichini",
        "study",
        "fine",
        "latecoming",
        "parent",
        "daycare",
        "center",
        "increased",
        "number",
        "seen",
        "price",
        "strength",
        "argument",
        "depends",
        "whether",
        "individual",
        "restrict",
        "market",
        "attitude",
        "economic",
        "sphere",
        "whether",
        "attitude",
        "come",
        "dominate",
        "society",
        "whole",
        "example",
        "kept",
        "distance",
        "private",
        "relationship",
        "individual",
        "develop",
        "market",
        "attitude",
        "regard",
        "intimate",
        "relationship",
        "well",
        "sociologist",
        "eva",
        "illouz",
        "argues",
        "eg",
        "pressure",
        "private",
        "sphere",
        "come",
        "people",
        "conscious",
        "unconscious",
        "transmission",
        "certain",
        "way",
        "thinking",
        "also",
        "increasing",
        "number",
        "least",
        "perceived",
        "increase",
        "monetary",
        "transaction",
        "concern",
        "sphere",
        "example",
        "form",
        "paid",
        "child",
        "care",
        "surrogate",
        "motherhood",
        "led",
        "critic",
        "market",
        "call",
        "limitation",
        "sphere",
        "influence",
        "order",
        "commodify",
        "good",
        "whose",
        "meaning",
        "closely",
        "tied",
        "value",
        "intimate",
        "relation",
        "individual",
        "flourishing",
        "childparent",
        "relationship",
        "cf",
        "eg",
        "radin",
        "anderson",
        "sandel",
        "critical",
        "discussion",
        "see",
        "satz",
        "ff",
        "anderson",
        "emphasizes",
        "larger",
        "question",
        "behind",
        "issue",
        "society",
        "accommodate",
        "plurality",
        "good",
        "valued",
        "different",
        "way",
        "esp",
        "ch",
        "similar",
        "strand",
        "argument",
        "concern",
        "question",
        "whether",
        "market",
        "push",
        "people",
        "towards",
        "consumption",
        "material",
        "rather",
        "immaterial",
        "good",
        "see",
        "eg",
        "popular",
        "account",
        "fromm",
        "case",
        "pollute",
        "preference",
        "also",
        "contribute",
        "overconsumption",
        "natural",
        "resource",
        "variety",
        "ecological",
        "problem",
        "eg",
        "wright",
        "hardin",
        "related",
        "argument",
        "concern",
        "question",
        "whether",
        "citizen",
        "stand",
        "equal",
        "respectful",
        "relationship",
        "one",
        "another",
        "certain",
        "good",
        "eg",
        "vote",
        "body",
        "part",
        "traded",
        "market",
        "sandel",
        "ff",
        "cf",
        "also",
        "satz",
        "ch",
        "ethic",
        "vote",
        "buying",
        "see",
        "relevant",
        "section",
        "entry",
        "voting",
        "body",
        "part",
        "see",
        "phillips",
        "legal",
        "representation",
        "see",
        "wilmotsmith",
        "agmon",
        "example",
        "argued",
        "institution",
        "eg",
        "school",
        "disagreement",
        "settled",
        "voice",
        "rather",
        "exit",
        "hirschman",
        "distinction",
        "example",
        "school",
        "see",
        "eg",
        "anderson",
        "f",
        "also",
        "many",
        "political",
        "theorist",
        "argue",
        "political",
        "sphere",
        "democracy",
        "seen",
        "different",
        "market",
        "stake",
        "individual",
        "interest",
        "public",
        "good",
        "cf",
        "eg",
        "radin",
        "ch",
        "draw",
        "john",
        "dewey",
        "understanding",
        "democracy",
        "theory",
        "common",
        "see",
        "society",
        "composed",
        "different",
        "social",
        "sphere",
        "walzer",
        "put",
        "morality",
        "bazaar",
        "belongs",
        "bazaar",
        "whereas",
        "exchange",
        "social",
        "sphere",
        "blocked",
        "many",
        "case",
        "combination",
        "argument",
        "applies",
        "concerning",
        "character",
        "good",
        "also",
        "vulnerability",
        "market",
        "participant",
        "brennan",
        "jaworski",
        "recently",
        "argued",
        "argument",
        "commodification",
        "based",
        "exclusively",
        "symbolic",
        "dimension",
        "trading",
        "certain",
        "good",
        "convincing",
        "symbolic",
        "dimension",
        "culturally",
        "contingent",
        "many",
        "case",
        "commodification",
        "purely",
        "symbolically",
        "harmful",
        "combine",
        "symbolic",
        "harm",
        "hand",
        "satz",
        "eg",
        "reminds",
        "u",
        "best",
        "answer",
        "problematic",
        "market",
        "always",
        "ban",
        "might",
        "lead",
        "black",
        "market",
        "evasion",
        "mechanism",
        "question",
        "alternative",
        "eg",
        "regulated",
        "market",
        "market",
        "complemented",
        "institution",
        "often",
        "depends",
        "institutional",
        "framework",
        "within",
        "market",
        "take",
        "place",
        "considered",
        "section"
    ]
}