{
    "main_text": "Marty as a Follower of Brentano\n1. Marty as a Follower of Brentano\n\nMarty’s career can be best viewed from the perspective of his\nrelationship to Brentano. Already in 1867, before Marty began to study\nat a university, he had written a prize winning essay “St.\nThomas’ Doctrine of Abstraction of Supersensory Ideas from\nSensory Images, with an Exposition and Critique of Other Theories of\nKnowledge”, in which he cited Brentano’s recently\npublished works on Aristotle (Brentano 1862 and Brentano 1867). He was\nso inspired by these works that he requested permission from his\nbishop to study in Würzburg, where Brentano, also at the time a\nCatholic priest, had just been appointed lecturer after triumphantly\nengaging in a formal disputation with a disciple of Schelling. One of\nthe theses that Brentano defended in this disputation was: “The\ntrue method of philosophy is none other than that of the natural\nsciences” (Brentano, [ed.] Kraus 1929, 147). In the autumn of\n1868 Marty began attending Brentano’s lectures in which this\nthesis was applied to various areas of philosophy. He and Carl Stumpf,\nwho had already been studying in Würzburg, became friends with\neach other and disciples of Brentano in the renewal of philosophy and\nreligion (Stumpf 1919, 88 ff.). In such a renewal all the speculative\nexcesses of German Idealism from earlier in the century had to be\npurged and replaced with rigor and clarity of thought, not to mention\na relentless adherence to the empirical source of knowledge.\n\nIn 1869 Marty became a teacher in a secondary school in his home town\nand received higher orders the next year, though he continued to stay\nin contact with Brentano. Marty was hardly aware, however, that\nBrentano was having misgivings about his Catholic faith, especially in\nthe light of the doctrine of infallibility that was declared in 1870.\nThough Brentano became a professor in Würzburg in 1872, he\nresigned from this position and left the church in the following year.\nBoth Stumpf and Marty were soon to follow him in abandoning their\npursuit of a profession as clergymen. This was not as damaging to\nStumpf, who had never been ordained, as it was to Marty. As a\nconsequence, he never married in order to avoid disappointing his\nfamily more than he already had done. His circumstances thus allowed\nhim little choice but to pursue an academic career, as he did by\nreceiving a doctorate in Göttingen with Rudolf Hermann Lotze as\nhis dissertation advisor (as Stumpf had also done). An expanded\nversion of the resulting work (Marty 1875) was subsequently published\nand he took a position at the newly established university in\nCzernowitz.\n\nBrentano in the meantime had become a professor in 1874 in Vienna,\nwhere he continued to develop his philosophical views in the same\nspirit as he did in Würzburg, with no other method but that of\nthe natural sciences. An important distinction that Brentano came to\nmake in his lectures in Vienna, however, was that between two branches\nof psychology (Brentano, [eds.] Baumgartner and Chisholm 1982). One of\nthese was descriptive psychology, also called descriptive\nphenomenology or psychognosy, and was concerned with analyzing\nconsciousness into its elements and specifying their modes of\ncombination. The other branch, genetic psychology, was to be concerned\nwith causal explanations of mental phenomena. Though Brentano\nmaintained that the latter branch required physiological\ninvestigations and also that physiology was not yet developed enough\nto deal with matters in genetic psychology, he thought that he had\nalready contributed to descriptive psychology in his Psychology\nfrom an Empirical Standpoint (Brentano 1874) and continued making\nfurther elaborations in this area through his lectures.\n\nAs Brentano characterized philosophy as including all the disciplines\nwhich involve descriptive psychology, Marty did the same as the rector\nof the University of Prague in his inaugural address in 1897 (Marty,\n[eds.] Eisenmeier et al., 69–93). On this view, philosophy\nencompasses at least three practical disciplines, namely logic\n(concerned with what judgments should be made), aesthetics (concerned\nwith what ideas or, as we shall say, presentations we should have),\nand ethics (concerned with what to love and what to hate). As regards\nthe theoretical branches of philosophy, Brentano and Marty considered\nthem to be descriptive psychology itself and also metaphysics. While\nit may seem unacceptable to characterize metaphysics as involving\npsychological concepts, Marty says:\n\nA closer consideration, however, yields the result that also\nmetaphysics and psychology, in spite of the difference of their\nsubject matters, closely belong together from a heuristic viewpoint\nand that the psychologist is the very one, more than any other\nresearcher, who appears to be suited to formulate and solve\nmetaphysical problems. Already with Kant, it is asked whether we have\nbesides analytic judgments also synthetic ones a priori, and\nwhether the latter are perhaps, like the former, everywhere necessary\nfor scientific progress. In contrast to leaving them empty and void\nupon leaving the phenomenal sphere, however, it is clear that only\npsychological investigation can decide this matter. It is a question\nwhose answer is a prerequisite for every ontological and cosmological\ninvestigation. Psychological experience and analysis is accordingly\nalso that which leads to the source and the true sense of the most\nimportant metaphysical concepts such as those of causality and of\nsubstance. And as regards that problem which occupied Aristotle,\nDescartes, and Leibniz so intensely, the question whether an analogue\nof the understanding and the tactical will forms the last hidden cause\nof all being and occurrence, it is obvious that this could not arise\non any other basis but a psychological one. The concepts of the\nunderstanding and the will are themselves taken from the domain of\nmind. What Aristotle says here is confirmed, that what is the first\nand earliest by nature is for our knowledge the last, for the area of\npsychology, in which the greatest complication and dependence obtains\nwith regard to its processes, is for us the starting point for the\ninvestigation of what is most simple and independent. (Marty, [eds.]\nEisenmeier et al. 1916, 79 f.)\n\n\nThus we see Marty defending the Brentanian conception of philosophy in\ngeneral and metaphysics in particular, with an appeal to Aristotle,\nwho was indeed Brentano’s life-long guide through the labyrinth\nof philosophy. Moreover, though Marty’s publications were mainly\nconcerned with applying Brentanian descriptive psychology to the study\nof language, he lectured on all the branches of philosophy, both\ntheoretical and practical, as well as history of philosophy. (See\nBokhove and Raynaud 1990, 247–250.) It will be seen further\nbelow that metaphysics was indeed a very important concern of his.\n\nAs regards some of the particulars of Brentano’s descriptive\npsychology, most important for understanding Marty’s philosophy\nof language are 1) Brentano’s thesis that mental phenomena (or\nacts of consciousness) are intentionally directed (as consciousness\nof an object), 2) his classification of mental phenomena into\nthree basic groups: presentations (Vorstellungen), judgments\n(Urteile), and phenomena of love (Liebe) and hate\n(Haß), as already indicated in the division of\npractical philosophy into three corresponding disciplines, 3) his\ncharacterization of all judgments as instances of acceptance or\nrejection which can be formulated in existential statements (“A\nexists”, “A does not exist”), and 4) his view that\nevery act of consciousness is inwardly perceived (innerlich\nwahrgenommen), though never inwardly observed (innerlich\nbeobachtet)in the sense of being an object of attention. In\naddition, 5) an important ontological position held by Brentano in his\nVienna period should be mentioned here, namely his distinction between\nreality and existence. While he held that existence corresponds to\ntruth in all cases, reality is limited to substances and everything\nthat pertains to substances (i.e. whatever belongs to the Aristotelian\ncategories). Accordingly anything that can be accepted in a true\njudgment can correctly be said to exist, including possibilities and\nimpossibilities, whereas not everything that exists in this sense is\nreal. During this time Brentano allowed for a host of\nirrealia, such as a lack, a possibility, an impossibility,\netc.\n\nAfter publishing his work on the perception of color (Marty 1879),\nMarty became a professor in Prague, where some of his students (such\nas Oskar Kraus, Alfred Kastil, Hugo Bergmann, and even for a brief\nperiod Franz Kafka) also came to be followers of Brentano. In the\nfollowing year Brentano had to resign as a professor in Vienna because\nhe got married. Since he had earlier received holy orders, including\nof course the vow of celibacy, his marriage was not acceptable in\nAustria, where there was no institution of civil marriage and\nCatholicism was dominant. Nevertheless, Brentano continued to lecture\nin Vienna until his full resignation in 1895. In the later nineteenth\ncentury and early in the twentieth century Brentano developed a\nphilosophical standpoint which Marty found objectionable. This was the\nview that only real things are conceivable and only real things can\nexist. Brentano therefore spent much of his philosophical effort\nduring his retirement analyzing away all the talk of\nirrealia, which he had accepted in his Vienna period. Marty,\nby contrast, retained the irrealia, though with certain\nrevisions in light of his correspondence with Brentano. Marty also\ncorresponded with other students of Brentano, such as Stumpf and\nEdmund Husserl (see Schuhmann [ed.] 1994, 69–96), and of course\nwith others in the wider philosophical and scientific community. Still\nthe fact remains that Brentano was the dominant philosopher in his\ncareer.\n\nMarty’s writings often contain very extensive polemics against\nhis opponents and those of Brentano. Sometimes these polemics resulted\nin bitter animosity, as in his interchange with Christoph Sigwart (see\ne.g. Marty 1884 and Sigwart 1889). Sometimes Marty’s criticisms\nwere received in good humor, as in the case of his very thorough-going\nand penetrating review of William James’ Principles of\nPsychology (Marty 1892b). Whatever effects Marty’s\npolemical style had on his contemporaries, the great misfortune from a\npresent-day standpoint is that his own positive views become\novershadowed by his criticisms of the views of others. With patience,\nhowever, it is possible to sift out from such criticisms his positive\nviews on a number of philosophical issues. The extent to which these\nviews are original cannot be fully assessed until Brentano’s\nliterary remains are more adequately edited and published. Many of the\nviews which were developed in his later work nonetheless diverged from\nBrentano’s earlier positions (as well as his own), but also from\nBrentano’s later positions.\n",
    "section_title": "1. Marty as a Follower of Brentano",
    "entry_title": "Anton Marty",
    "hierarchy_title": "Anton Marty || Marty as a Follower of Brentano",
    "tokenized_text": [
        "marty",
        "follower",
        "brentano",
        "marty",
        "follower",
        "brentano",
        "marty",
        "career",
        "best",
        "viewed",
        "perspective",
        "relationship",
        "brentano",
        "already",
        "marty",
        "began",
        "study",
        "university",
        "written",
        "prize",
        "winning",
        "essay",
        "st",
        "thomas",
        "doctrine",
        "abstraction",
        "supersensory",
        "idea",
        "sensory",
        "image",
        "exposition",
        "critique",
        "theory",
        "knowledge",
        "cited",
        "brentano",
        "recently",
        "published",
        "work",
        "aristotle",
        "brentano",
        "brentano",
        "inspired",
        "work",
        "requested",
        "permission",
        "bishop",
        "study",
        "würzburg",
        "brentano",
        "also",
        "time",
        "catholic",
        "priest",
        "appointed",
        "lecturer",
        "triumphantly",
        "engaging",
        "formal",
        "disputation",
        "disciple",
        "schelling",
        "one",
        "thesis",
        "brentano",
        "defended",
        "disputation",
        "true",
        "method",
        "philosophy",
        "none",
        "natural",
        "science",
        "brentano",
        "ed",
        "kraus",
        "autumn",
        "marty",
        "began",
        "attending",
        "brentano",
        "lecture",
        "thesis",
        "applied",
        "various",
        "area",
        "philosophy",
        "carl",
        "stumpf",
        "already",
        "studying",
        "würzburg",
        "became",
        "friend",
        "disciple",
        "brentano",
        "renewal",
        "philosophy",
        "religion",
        "stumpf",
        "ff",
        "renewal",
        "speculative",
        "excess",
        "german",
        "idealism",
        "earlier",
        "century",
        "purged",
        "replaced",
        "rigor",
        "clarity",
        "thought",
        "mention",
        "relentless",
        "adherence",
        "empirical",
        "source",
        "knowledge",
        "marty",
        "became",
        "teacher",
        "secondary",
        "school",
        "home",
        "town",
        "received",
        "higher",
        "order",
        "next",
        "year",
        "though",
        "continued",
        "stay",
        "contact",
        "brentano",
        "marty",
        "hardly",
        "aware",
        "however",
        "brentano",
        "misgiving",
        "catholic",
        "faith",
        "especially",
        "light",
        "doctrine",
        "infallibility",
        "declared",
        "though",
        "brentano",
        "became",
        "professor",
        "würzburg",
        "resigned",
        "position",
        "left",
        "church",
        "following",
        "year",
        "stumpf",
        "marty",
        "soon",
        "follow",
        "abandoning",
        "pursuit",
        "profession",
        "clergyman",
        "damaging",
        "stumpf",
        "never",
        "ordained",
        "marty",
        "consequence",
        "never",
        "married",
        "order",
        "avoid",
        "disappointing",
        "family",
        "already",
        "done",
        "circumstance",
        "thus",
        "allowed",
        "little",
        "choice",
        "pursue",
        "academic",
        "career",
        "receiving",
        "doctorate",
        "göttingen",
        "rudolf",
        "hermann",
        "lotze",
        "dissertation",
        "advisor",
        "stumpf",
        "also",
        "done",
        "expanded",
        "version",
        "resulting",
        "work",
        "marty",
        "subsequently",
        "published",
        "took",
        "position",
        "newly",
        "established",
        "university",
        "czernowitz",
        "brentano",
        "meantime",
        "become",
        "professor",
        "vienna",
        "continued",
        "develop",
        "philosophical",
        "view",
        "spirit",
        "würzburg",
        "method",
        "natural",
        "science",
        "important",
        "distinction",
        "brentano",
        "came",
        "make",
        "lecture",
        "vienna",
        "however",
        "two",
        "branch",
        "psychology",
        "brentano",
        "ed",
        "baumgartner",
        "chisholm",
        "one",
        "descriptive",
        "psychology",
        "also",
        "called",
        "descriptive",
        "phenomenology",
        "psychognosy",
        "concerned",
        "analyzing",
        "consciousness",
        "element",
        "specifying",
        "mode",
        "combination",
        "branch",
        "genetic",
        "psychology",
        "concerned",
        "causal",
        "explanation",
        "mental",
        "phenomenon",
        "though",
        "brentano",
        "maintained",
        "latter",
        "branch",
        "required",
        "physiological",
        "investigation",
        "also",
        "physiology",
        "yet",
        "developed",
        "enough",
        "deal",
        "matter",
        "genetic",
        "psychology",
        "thought",
        "already",
        "contributed",
        "descriptive",
        "psychology",
        "psychology",
        "empirical",
        "standpoint",
        "brentano",
        "continued",
        "making",
        "elaboration",
        "area",
        "lecture",
        "brentano",
        "characterized",
        "philosophy",
        "including",
        "discipline",
        "involve",
        "descriptive",
        "psychology",
        "marty",
        "rector",
        "university",
        "prague",
        "inaugural",
        "address",
        "marty",
        "ed",
        "eisenmeier",
        "et",
        "al",
        "view",
        "philosophy",
        "encompasses",
        "least",
        "three",
        "practical",
        "discipline",
        "namely",
        "logic",
        "concerned",
        "judgment",
        "made",
        "aesthetic",
        "concerned",
        "idea",
        "shall",
        "say",
        "presentation",
        "ethic",
        "concerned",
        "love",
        "hate",
        "regard",
        "theoretical",
        "branch",
        "philosophy",
        "brentano",
        "marty",
        "considered",
        "descriptive",
        "psychology",
        "also",
        "metaphysics",
        "may",
        "seem",
        "unacceptable",
        "characterize",
        "metaphysics",
        "involving",
        "psychological",
        "concept",
        "marty",
        "say",
        "closer",
        "consideration",
        "however",
        "yield",
        "result",
        "also",
        "metaphysics",
        "psychology",
        "spite",
        "difference",
        "subject",
        "matter",
        "closely",
        "belong",
        "together",
        "heuristic",
        "viewpoint",
        "psychologist",
        "one",
        "researcher",
        "appears",
        "suited",
        "formulate",
        "solve",
        "metaphysical",
        "problem",
        "already",
        "kant",
        "asked",
        "whether",
        "besides",
        "analytic",
        "judgment",
        "also",
        "synthetic",
        "one",
        "priori",
        "whether",
        "latter",
        "perhaps",
        "like",
        "former",
        "everywhere",
        "necessary",
        "scientific",
        "progress",
        "contrast",
        "leaving",
        "empty",
        "void",
        "upon",
        "leaving",
        "phenomenal",
        "sphere",
        "however",
        "clear",
        "psychological",
        "investigation",
        "decide",
        "matter",
        "question",
        "whose",
        "answer",
        "prerequisite",
        "every",
        "ontological",
        "cosmological",
        "investigation",
        "psychological",
        "experience",
        "analysis",
        "accordingly",
        "also",
        "lead",
        "source",
        "true",
        "sense",
        "important",
        "metaphysical",
        "concept",
        "causality",
        "substance",
        "regard",
        "problem",
        "occupied",
        "aristotle",
        "descartes",
        "leibniz",
        "intensely",
        "question",
        "whether",
        "analogue",
        "understanding",
        "tactical",
        "form",
        "last",
        "hidden",
        "cause",
        "occurrence",
        "obvious",
        "could",
        "arise",
        "basis",
        "psychological",
        "one",
        "concept",
        "understanding",
        "taken",
        "domain",
        "mind",
        "aristotle",
        "say",
        "confirmed",
        "first",
        "earliest",
        "nature",
        "knowledge",
        "last",
        "area",
        "psychology",
        "greatest",
        "complication",
        "dependence",
        "obtains",
        "regard",
        "process",
        "u",
        "starting",
        "point",
        "investigation",
        "simple",
        "independent",
        "marty",
        "ed",
        "eisenmeier",
        "et",
        "al",
        "f",
        "thus",
        "see",
        "marty",
        "defending",
        "brentanian",
        "conception",
        "philosophy",
        "general",
        "metaphysics",
        "particular",
        "appeal",
        "aristotle",
        "indeed",
        "brentano",
        "lifelong",
        "guide",
        "labyrinth",
        "philosophy",
        "moreover",
        "though",
        "marty",
        "publication",
        "mainly",
        "concerned",
        "applying",
        "brentanian",
        "descriptive",
        "psychology",
        "study",
        "language",
        "lectured",
        "branch",
        "philosophy",
        "theoretical",
        "practical",
        "well",
        "history",
        "philosophy",
        "see",
        "bokhove",
        "raynaud",
        "seen",
        "metaphysics",
        "indeed",
        "important",
        "concern",
        "regard",
        "particular",
        "brentano",
        "descriptive",
        "psychology",
        "important",
        "understanding",
        "marty",
        "philosophy",
        "language",
        "brentano",
        "thesis",
        "mental",
        "phenomenon",
        "act",
        "consciousness",
        "intentionally",
        "directed",
        "consciousness",
        "object",
        "classification",
        "mental",
        "phenomenon",
        "three",
        "basic",
        "group",
        "presentation",
        "vorstellungen",
        "judgment",
        "urteile",
        "phenomenon",
        "love",
        "liebe",
        "hate",
        "haß",
        "already",
        "indicated",
        "division",
        "practical",
        "philosophy",
        "three",
        "corresponding",
        "discipline",
        "characterization",
        "judgment",
        "instance",
        "acceptance",
        "rejection",
        "formulated",
        "existential",
        "statement",
        "exists",
        "exist",
        "view",
        "every",
        "act",
        "consciousness",
        "inwardly",
        "perceived",
        "innerlich",
        "wahrgenommen",
        "though",
        "never",
        "inwardly",
        "observed",
        "innerlich",
        "beobachtet",
        "sense",
        "object",
        "attention",
        "addition",
        "important",
        "ontological",
        "position",
        "held",
        "brentano",
        "vienna",
        "period",
        "mentioned",
        "namely",
        "distinction",
        "reality",
        "existence",
        "held",
        "existence",
        "corresponds",
        "truth",
        "case",
        "reality",
        "limited",
        "substance",
        "everything",
        "pertains",
        "substance",
        "ie",
        "whatever",
        "belongs",
        "aristotelian",
        "category",
        "accordingly",
        "anything",
        "accepted",
        "true",
        "judgment",
        "correctly",
        "said",
        "exist",
        "including",
        "possibility",
        "impossibility",
        "whereas",
        "everything",
        "exists",
        "sense",
        "real",
        "time",
        "brentano",
        "allowed",
        "host",
        "irrealia",
        "lack",
        "possibility",
        "impossibility",
        "etc",
        "publishing",
        "work",
        "perception",
        "color",
        "marty",
        "marty",
        "became",
        "professor",
        "prague",
        "student",
        "oskar",
        "kraus",
        "alfred",
        "kastil",
        "hugo",
        "bergmann",
        "even",
        "brief",
        "period",
        "franz",
        "kafka",
        "also",
        "came",
        "follower",
        "brentano",
        "following",
        "year",
        "brentano",
        "resign",
        "professor",
        "vienna",
        "got",
        "married",
        "since",
        "earlier",
        "received",
        "holy",
        "order",
        "including",
        "course",
        "vow",
        "celibacy",
        "marriage",
        "acceptable",
        "austria",
        "institution",
        "civil",
        "marriage",
        "catholicism",
        "dominant",
        "nevertheless",
        "brentano",
        "continued",
        "lecture",
        "vienna",
        "full",
        "resignation",
        "later",
        "nineteenth",
        "century",
        "early",
        "twentieth",
        "century",
        "brentano",
        "developed",
        "philosophical",
        "standpoint",
        "marty",
        "found",
        "objectionable",
        "view",
        "real",
        "thing",
        "conceivable",
        "real",
        "thing",
        "exist",
        "brentano",
        "therefore",
        "spent",
        "much",
        "philosophical",
        "effort",
        "retirement",
        "analyzing",
        "away",
        "talk",
        "irrealia",
        "accepted",
        "vienna",
        "period",
        "marty",
        "contrast",
        "retained",
        "irrealia",
        "though",
        "certain",
        "revision",
        "light",
        "correspondence",
        "brentano",
        "marty",
        "also",
        "corresponded",
        "student",
        "brentano",
        "stumpf",
        "edmund",
        "husserl",
        "see",
        "schuhmann",
        "ed",
        "course",
        "others",
        "wider",
        "philosophical",
        "scientific",
        "community",
        "still",
        "fact",
        "remains",
        "brentano",
        "dominant",
        "philosopher",
        "career",
        "marty",
        "writing",
        "often",
        "contain",
        "extensive",
        "polemic",
        "opponent",
        "brentano",
        "sometimes",
        "polemic",
        "resulted",
        "bitter",
        "animosity",
        "interchange",
        "christoph",
        "sigwart",
        "see",
        "eg",
        "marty",
        "sigwart",
        "sometimes",
        "marty",
        "criticism",
        "received",
        "good",
        "humor",
        "case",
        "thoroughgoing",
        "penetrating",
        "review",
        "william",
        "james",
        "principle",
        "psychology",
        "marty",
        "b",
        "whatever",
        "effect",
        "marty",
        "polemical",
        "style",
        "contemporary",
        "great",
        "misfortune",
        "presentday",
        "standpoint",
        "positive",
        "view",
        "become",
        "overshadowed",
        "criticism",
        "view",
        "others",
        "patience",
        "however",
        "possible",
        "sift",
        "criticism",
        "positive",
        "view",
        "number",
        "philosophical",
        "issue",
        "extent",
        "view",
        "original",
        "fully",
        "assessed",
        "brentano",
        "literary",
        "remains",
        "adequately",
        "edited",
        "published",
        "many",
        "view",
        "developed",
        "later",
        "work",
        "nonetheless",
        "diverged",
        "brentano",
        "earlier",
        "position",
        "well",
        "also",
        "brentano",
        "later",
        "position"
    ]
}