{
    "main_text": "Utopianism || Marx’s Utopophobia\n8.2 Marx’s Utopophobia\n\nThe remainder of this section will focus on Marx’s disapproval\nof the constructive endeavours of the utopians.\n\nIn trying to organise and understand Marx’s various criticisms\nof utopianism, it is helpful to distinguish between foundational and\nnon-foundational variants. (This distinction is intended to be\nexhaustive, in that all of his criticisms of utopianism will fall into\none of these two categories.) Non-foundational criticisms of\nutopian socialism are those which, if sound, would provide us with a\nreason to reject views which might be held by, or even be\ncharacteristic of, utopian socialists, but which are not constitutive\nof their utopianism. That is, they would give us a reason to abandon\nthe relevant beliefs, or to criticise those (including utopians) who\nheld them, but they would not give us cause to reject utopianism as\nsuch. In contrast, foundational criticisms of utopian\nsocialism are those which, if sound, would provide us with a reason to\nreject utopianism as such; that is, a reason to refrain from engaging\nin socialist design, a reason not to describe in relevant detail the\nsocialist society of the future. (Of course, that reason might not be\ndecisive, all things considered, but it would still count against\nutopianism per se.)\n\nMany of Marx’s best-known criticisms of utopian socialism are\nnon-foundational. For instance, in the Communist Manifesto,\nhe complains that utopian socialists hold a mistaken\n“ahistorical” view of social change. The utopians\npurportedly fail to understand that the achievement of socialism\ndepends on conditions which can only emerge at a certain stage of\nhistorical development. They might, for instance, recognise that there\nare strategic preconditions for socialism (for instance, the right\nblueprint and sufficient will to put it into practice), but\n(mistakenly on Marx’s account) imagine that those preconditions\ncould have appeared at any point in time. This complaint is\nnon-foundational in that one can accept that there are historical\nconditions for establishing a socialist society, and that the utopian\nsocialists fail to understand this, without thereby having a reason to\nabandon utopianism as such. A commitment to the necessity and\ndesirability of socialist design does not require one to hold an\n“ahistorical” view of social change.\n\nAssessing the soundness of non-foundational criticisms, and their\nrelevance to the utopian socialist tradition, is a complicated task\n(see Leopold 2018). However, even if sound and relevant, these\ncriticisms would provide no reason to abandon utopianism as\nsuch. Consequently, they are pursued no further here. Instead,\nthe focus is on the three main foundational arguments against\nutopianism that can be located in Marx’s writings; namely, that\nutopian plans and blueprints are necessarily undemocratic,\nimpossible, and redundant (see Leopold 2016).\n\nMarx’s first argument involves a normative claim that\nutopian plans and blueprints are undemocratic.\n(“Democracy” here connoting individual and collective\nself-determination, rather than political forms of governance.) The\nbasic argument runs: that it is undemocratic to limit the\nself-determination of individuals; that providing a plan or blueprint\nfor a socialist society limits the self-determination of individuals;\nand that therefore the provision of plans and blueprints for a\nsocialist society is undemocratic. If we add in the assumption that\nundemocratic means are undesirable; then we can conclude that it is\nundesirable to provide plans or blueprints of a future socialist\nsociety. One central reason for resisting this argument is that it is\nhard to identify a plausible account of the conditions for\nself-determination, according to which it is necessarily true that\nmerely providing a socialist plan or blueprint restricts\nself-determination. Indeed, one might heretically think that detailed\nplans and blueprints often tend to promote self-determination, helping\nindividuals think about where it is they want to go, and how they want\nto get there.\n\nMarx’s second argument rests on an epistemological\nclaim that that utopian plans and blueprints are impossible,\nbecause they require accurate knowledge of the future of a kind which\ncannot be had. The basic argument starts from the assumption that to\nbe of any use a blueprint must facilitate the construction of a future\nsocialist society. Moreover, to facilitate the construction of a\nfuture socialist society a blueprint must be completely accurate; and\nto be completely accurate a blueprint must predict all the relevant\ncircumstances of that future society. However, since it is not\npossible—given the complexity of the social world and the\nlimitations of human nature—to predict all the relevant\ncircumstances of that future society, we can conclude that socialist\nblueprints are of no use. One central reason for resisting this\nargument is that, whilst it is hard to deny that completely accurate\nplans are impossible (given the complexity of the world and the\nlimitations of human understanding), the claim that only completely\naccurate plans are useful seems doubtful. Plans are not simply\npredictions, and providing less than wholly accurate plans for\nourselves often forms part of the process whereby we help determine\nthe future for ourselves (insofar as that is possible).\n\nMarx’s third argument depends on an empirical claim\nthat utopian plans and blueprints are unnecessary, because\nsatisfactory solutions to social problems emerge automatically from\nthe unfolding of the historical process without themselves needing to\nbe designed. The basic argument runs as follows: that utopian\nblueprints describe the basic structure of the socialist society of\nthe future; and that such blueprints are necessary if and only if the\nbasic structure of future socialist society needs to be designed.\nHowever, given that the basic structure of the future socialist\nsociety develops automatically (without design assistance) within\ncapitalist society; and that the role of human agency in this\nunfolding historical process is to deliver (not design) that basic\nstructure, Marx concludes that utopian blueprints are redundant.\nReasons for resisting this argument include scepticism about both\nMarx’s reasoning and the empirical record. Marx is certain that\nhumankind does not need to design the basic structure of the future\nsocialist society, but it is not really made clear who or what does\nthat designing in its place. Moreover, the path of historical\ndevelopment since Marx’s day does not obviously confirm the\ncomplex empirical claim that the basic structure of socialist society\nis developing automatically within existing capitalism, needing only\nto be delivered (and not designed) by human agency.\n\nThis brief discussion suggests that there are cogent grounds for\ndoubting Marx’s claim that utopian plans and blueprints are\nnecessarily undemocratic, impossible, and redundant.\n\nFinally, recall that Marx is less enthusiastic about the second and\nsubsequent generations of utopians, than he is about the original\ntriumvirate. We might reasonably wonder about the rationale for\ngreater criticism of later utopians. It is important to recognise that\nit is not that second and subsequent generations make more or grosser\nerrors than the original triumvirate. (Indeed, Marx appears to think\nthat all these different generations largely held the same views, and\nmade the same mistakes). The relevant difference is rather that, by\ncomparison with their successors, this first generation were not to\nblame for those errors. In short, the rationale behind Marx’s\npreference for the first over the second and subsequent generations of\nutopian socialists is based on an understanding of historical\ndevelopment and an associated notion of culpability.\n\nMarx held that the intellectual formation of this first generation\ntook place in a historical context (the cusp of the eighteenth and\nnineteenth centuries) which was sufficiently developed to provoke\nsocialist criticism, but not sufficiently developed for that socialist\ncriticism to escape serious misunderstandings (Cohen 2000: 51). Since\nneither the material conditions of modern society, nor the historical\nagent capable of bringing socialism about, were sufficiently\ndeveloped, this first generation were bound to develop faulty accounts\nof the nature of, and transition to, socialism. However, that\ndefence—the historical unavoidability of error—is not\navailable to subsequent generations who, despite significantly changed\ncircumstances, hold fast to the original views of their intellectual\nforerunners. Marx maintains that more recent utopians, unlike the\noriginal triumvirate, really ought to know better.\n",
    "section_title": "8.2 Marx’s Utopophobia",
    "entry_title": "Karl Marx",
    "hierarchy_title": "Karl Marx || Utopianism || Marx’s Utopophobia",
    "tokenized_text": [
        "utopianism",
        "marx",
        "utopophobia",
        "marx",
        "utopophobia",
        "remainder",
        "section",
        "focus",
        "marx",
        "disapproval",
        "constructive",
        "endeavour",
        "utopian",
        "trying",
        "organise",
        "understand",
        "marx",
        "various",
        "criticism",
        "utopianism",
        "helpful",
        "distinguish",
        "foundational",
        "nonfoundational",
        "variant",
        "distinction",
        "intended",
        "exhaustive",
        "criticism",
        "utopianism",
        "fall",
        "one",
        "two",
        "category",
        "nonfoundational",
        "criticism",
        "utopian",
        "socialism",
        "sound",
        "would",
        "provide",
        "u",
        "reason",
        "reject",
        "view",
        "might",
        "held",
        "even",
        "characteristic",
        "utopian",
        "socialist",
        "constitutive",
        "utopianism",
        "would",
        "give",
        "u",
        "reason",
        "abandon",
        "relevant",
        "belief",
        "criticise",
        "including",
        "utopian",
        "held",
        "would",
        "give",
        "u",
        "cause",
        "reject",
        "utopianism",
        "contrast",
        "foundational",
        "criticism",
        "utopian",
        "socialism",
        "sound",
        "would",
        "provide",
        "u",
        "reason",
        "reject",
        "utopianism",
        "reason",
        "refrain",
        "engaging",
        "socialist",
        "design",
        "reason",
        "describe",
        "relevant",
        "detail",
        "socialist",
        "society",
        "future",
        "course",
        "reason",
        "might",
        "decisive",
        "thing",
        "considered",
        "would",
        "still",
        "count",
        "utopianism",
        "per",
        "se",
        "many",
        "marx",
        "bestknown",
        "criticism",
        "utopian",
        "socialism",
        "nonfoundational",
        "instance",
        "communist",
        "manifesto",
        "complains",
        "utopian",
        "socialist",
        "hold",
        "mistaken",
        "ahistorical",
        "view",
        "social",
        "change",
        "utopian",
        "purportedly",
        "fail",
        "understand",
        "achievement",
        "socialism",
        "depends",
        "condition",
        "emerge",
        "certain",
        "stage",
        "historical",
        "development",
        "might",
        "instance",
        "recognise",
        "strategic",
        "precondition",
        "socialism",
        "instance",
        "right",
        "blueprint",
        "sufficient",
        "put",
        "practice",
        "mistakenly",
        "marx",
        "account",
        "imagine",
        "precondition",
        "could",
        "appeared",
        "point",
        "time",
        "complaint",
        "nonfoundational",
        "one",
        "accept",
        "historical",
        "condition",
        "establishing",
        "socialist",
        "society",
        "utopian",
        "socialist",
        "fail",
        "understand",
        "without",
        "thereby",
        "reason",
        "abandon",
        "utopianism",
        "commitment",
        "necessity",
        "desirability",
        "socialist",
        "design",
        "require",
        "one",
        "hold",
        "ahistorical",
        "view",
        "social",
        "change",
        "assessing",
        "soundness",
        "nonfoundational",
        "criticism",
        "relevance",
        "utopian",
        "socialist",
        "tradition",
        "complicated",
        "task",
        "see",
        "leopold",
        "however",
        "even",
        "sound",
        "relevant",
        "criticism",
        "would",
        "provide",
        "reason",
        "abandon",
        "utopianism",
        "consequently",
        "pursued",
        "instead",
        "focus",
        "three",
        "main",
        "foundational",
        "argument",
        "utopianism",
        "located",
        "marx",
        "writing",
        "namely",
        "utopian",
        "plan",
        "blueprint",
        "necessarily",
        "undemocratic",
        "impossible",
        "redundant",
        "see",
        "leopold",
        "marx",
        "first",
        "argument",
        "involves",
        "normative",
        "claim",
        "utopian",
        "plan",
        "blueprint",
        "undemocratic",
        "democracy",
        "connoting",
        "individual",
        "collective",
        "selfdetermination",
        "rather",
        "political",
        "form",
        "governance",
        "basic",
        "argument",
        "run",
        "undemocratic",
        "limit",
        "selfdetermination",
        "individual",
        "providing",
        "plan",
        "blueprint",
        "socialist",
        "society",
        "limit",
        "selfdetermination",
        "individual",
        "therefore",
        "provision",
        "plan",
        "blueprint",
        "socialist",
        "society",
        "undemocratic",
        "add",
        "assumption",
        "undemocratic",
        "mean",
        "undesirable",
        "conclude",
        "undesirable",
        "provide",
        "plan",
        "blueprint",
        "future",
        "socialist",
        "society",
        "one",
        "central",
        "reason",
        "resisting",
        "argument",
        "hard",
        "identify",
        "plausible",
        "account",
        "condition",
        "selfdetermination",
        "according",
        "necessarily",
        "true",
        "merely",
        "providing",
        "socialist",
        "plan",
        "blueprint",
        "restricts",
        "selfdetermination",
        "indeed",
        "one",
        "might",
        "heretically",
        "think",
        "detailed",
        "plan",
        "blueprint",
        "often",
        "tend",
        "promote",
        "selfdetermination",
        "helping",
        "individual",
        "think",
        "want",
        "go",
        "want",
        "get",
        "marx",
        "second",
        "argument",
        "rest",
        "epistemological",
        "claim",
        "utopian",
        "plan",
        "blueprint",
        "impossible",
        "require",
        "accurate",
        "knowledge",
        "future",
        "kind",
        "basic",
        "argument",
        "start",
        "assumption",
        "use",
        "blueprint",
        "must",
        "facilitate",
        "construction",
        "future",
        "socialist",
        "society",
        "moreover",
        "facilitate",
        "construction",
        "future",
        "socialist",
        "society",
        "blueprint",
        "must",
        "completely",
        "accurate",
        "completely",
        "accurate",
        "blueprint",
        "must",
        "predict",
        "relevant",
        "circumstance",
        "future",
        "society",
        "however",
        "since",
        "possiblegiven",
        "complexity",
        "social",
        "world",
        "limitation",
        "human",
        "natureto",
        "predict",
        "relevant",
        "circumstance",
        "future",
        "society",
        "conclude",
        "socialist",
        "blueprint",
        "use",
        "one",
        "central",
        "reason",
        "resisting",
        "argument",
        "whilst",
        "hard",
        "deny",
        "completely",
        "accurate",
        "plan",
        "impossible",
        "given",
        "complexity",
        "world",
        "limitation",
        "human",
        "understanding",
        "claim",
        "completely",
        "accurate",
        "plan",
        "useful",
        "seems",
        "doubtful",
        "plan",
        "simply",
        "prediction",
        "providing",
        "le",
        "wholly",
        "accurate",
        "plan",
        "often",
        "form",
        "part",
        "process",
        "whereby",
        "help",
        "determine",
        "future",
        "insofar",
        "possible",
        "marx",
        "third",
        "argument",
        "depends",
        "empirical",
        "claim",
        "utopian",
        "plan",
        "blueprint",
        "unnecessary",
        "satisfactory",
        "solution",
        "social",
        "problem",
        "emerge",
        "automatically",
        "unfolding",
        "historical",
        "process",
        "without",
        "needing",
        "designed",
        "basic",
        "argument",
        "run",
        "follows",
        "utopian",
        "blueprint",
        "describe",
        "basic",
        "structure",
        "socialist",
        "society",
        "future",
        "blueprint",
        "necessary",
        "basic",
        "structure",
        "future",
        "socialist",
        "society",
        "need",
        "designed",
        "however",
        "given",
        "basic",
        "structure",
        "future",
        "socialist",
        "society",
        "develops",
        "automatically",
        "without",
        "design",
        "assistance",
        "within",
        "capitalist",
        "society",
        "role",
        "human",
        "agency",
        "unfolding",
        "historical",
        "process",
        "deliver",
        "design",
        "basic",
        "structure",
        "marx",
        "concludes",
        "utopian",
        "blueprint",
        "redundant",
        "reason",
        "resisting",
        "argument",
        "include",
        "scepticism",
        "marx",
        "reasoning",
        "empirical",
        "record",
        "marx",
        "certain",
        "humankind",
        "need",
        "design",
        "basic",
        "structure",
        "future",
        "socialist",
        "society",
        "really",
        "made",
        "clear",
        "designing",
        "place",
        "moreover",
        "path",
        "historical",
        "development",
        "since",
        "marx",
        "day",
        "obviously",
        "confirm",
        "complex",
        "empirical",
        "claim",
        "basic",
        "structure",
        "socialist",
        "society",
        "developing",
        "automatically",
        "within",
        "existing",
        "capitalism",
        "needing",
        "delivered",
        "designed",
        "human",
        "agency",
        "brief",
        "discussion",
        "suggests",
        "cogent",
        "ground",
        "doubting",
        "marx",
        "claim",
        "utopian",
        "plan",
        "blueprint",
        "necessarily",
        "undemocratic",
        "impossible",
        "redundant",
        "finally",
        "recall",
        "marx",
        "le",
        "enthusiastic",
        "second",
        "subsequent",
        "generation",
        "utopian",
        "original",
        "triumvirate",
        "might",
        "reasonably",
        "wonder",
        "rationale",
        "greater",
        "criticism",
        "later",
        "utopian",
        "important",
        "recognise",
        "second",
        "subsequent",
        "generation",
        "make",
        "grosser",
        "error",
        "original",
        "triumvirate",
        "indeed",
        "marx",
        "appears",
        "think",
        "different",
        "generation",
        "largely",
        "held",
        "view",
        "made",
        "mistake",
        "relevant",
        "difference",
        "rather",
        "comparison",
        "successor",
        "first",
        "generation",
        "blame",
        "error",
        "short",
        "rationale",
        "behind",
        "marx",
        "preference",
        "first",
        "second",
        "subsequent",
        "generation",
        "utopian",
        "socialist",
        "based",
        "understanding",
        "historical",
        "development",
        "associated",
        "notion",
        "culpability",
        "marx",
        "held",
        "intellectual",
        "formation",
        "first",
        "generation",
        "took",
        "place",
        "historical",
        "context",
        "cusp",
        "eighteenth",
        "nineteenth",
        "century",
        "sufficiently",
        "developed",
        "provoke",
        "socialist",
        "criticism",
        "sufficiently",
        "developed",
        "socialist",
        "criticism",
        "escape",
        "serious",
        "misunderstanding",
        "cohen",
        "since",
        "neither",
        "material",
        "condition",
        "modern",
        "society",
        "historical",
        "agent",
        "capable",
        "bringing",
        "socialism",
        "sufficiently",
        "developed",
        "first",
        "generation",
        "bound",
        "develop",
        "faulty",
        "account",
        "nature",
        "transition",
        "socialism",
        "however",
        "defencethe",
        "historical",
        "unavoidability",
        "erroris",
        "available",
        "subsequent",
        "generation",
        "despite",
        "significantly",
        "changed",
        "circumstance",
        "hold",
        "fast",
        "original",
        "view",
        "intellectual",
        "forerunner",
        "marx",
        "maintains",
        "recent",
        "utopian",
        "unlike",
        "original",
        "triumvirate",
        "really",
        "ought",
        "know",
        "better"
    ]
}