{
    "main_text": "Doctrine of Cause and Effect || Everything that begins to exist must have a cause\n2.1 Everything that begins to exist must have a cause\n\nShepherd’s account of causality is advertised as contrary to\nDavid Hume’s in point of metaphysics, psychology, and\nepistemology. Where Hume holds that common causal beliefs are due to\nrepetitious experience and acquired habits of imagination, she urges\nthey are caused and justified by perception and reasoning. Where Hume\nholds that abstract ideas are impossible, Shepherd insists that\nscience and philosophical analysis are impossible without abstraction.\nAgainst Hume, she argues that an uncaused change in the course of\nnature is impossible and produces a proof that everything that begins\nto exist must have a cause. According to her, the proof articulates a\nline of reasoning the human mind is disposed to use, implicitly or\nexplicitly, in forming causal beliefs, attaining knowledge of causal\nprinciples. and perceiving particular instances of them (e.g. EPEU\n[2020: 314–316; Fantl 2016: 88). Incipient notions of causal\npower and necessary connection arise as children form their earliest\nbeliefs about sensible objects (e.g. EPEU: [2020: 314–24]).\n\nIt would not be correct to say this begs the question against Hume.\nShe has several reasons for rejecting his views on the relation of\ncause and effect. Perhaps the two most fundamental are the\nimpoverishment of a theory of mind that limits what we can apprehend\nto sensory and reflective impressions and things that resemble them,\nand the assumption that our ability to separate the idea of a cause\nfrom that of an effect in imagination shows the ideas are separable in\nnature and experience (Bolton 2010: 244–6; 2019: 132–38;\nLandy 2020b). Her theory of causality and causal induction are\nexpounded in ERCE; her account of the cause and justification of\nbelief in the external world is developed in EPEU. This section is\nmainly concerned with the former.\n\nThe first metaphysical tenet is the causal principle: it is necessary\nthat a thing that begins to exist has a cause (hereafter\n“CP”). The argument for this begins with a clarification.\nThe notion of an effect is semantically tied to that of a cause. To\navoid this implication, Shepherd characterizes an effect as a thing\nthat begins to exist; so clearly stated, the question is whether\n“a thing that begins to exist owes its existence to a\ncause” (ERCE [2020: 34). She proposes a thought experiment.\nImagine an object different in nature from all objects we know except\nfor the capacity for its existence, that is, the ground of the\npossibility of its existing when it does not yet exist. Suppose the\nuniverse is an utter blank; nothing exists.With this understood, she\nargues, it is impossible for the thing to begin to exist. This is\nbecause its beginning to exist “cannot appear but as a capacity\nsome nature hath to alter the presupposed nonentity and to act for\nitself whilst it is not in being.” (ERCE [2020: 36). One way to\nunderstand the reductive argument is this: (a) the beginning of\nx must be an act; (b) the act must be the property of an\nobject which exists and has the capacity to actualize x; (c)\nx does not yet exist; (d) nothing exists (supposition); so\nx cannot begin to exist. This is valid but premises (a) and\n(b) seem to assume what the argument is supposed to prove (Bolton\n2017; Fantl (2016: 98) also finds the argument circular). However,\nRickless (forthcoming) is among those who object to this charge; he\nargues it is doubtful the pair of premises means the same thing as the\nconclusion. Arguably, though, Shepherd assumes it does. She assumes\nthat her idea of what is needed to begin x specifies a state\nof affairs that satisfies her (controversial) idea of a cause. Nothing\nshows that this is a fact about the world.\n\nJennifer Wilson (forthcoming) interprets the argument as an effort to\narticulate the metaphysical reasoning behind the intuition that\nnothing comes from nothing. Like Shepherd, she stresses that anything\nthat begins to exist must have a beginning: a transition from the\nnon-existence to the existence of the entity in view. Wilson notes\nthat this act, or event, need not be the property of an object, but\nthere must be one or more things that perform it. This is said to\nexplain the intuition because it is independently plausible,\nmetaphysically possible, and no worse off epistemically than the\nalternative, This is consistent with the interpretation just offered,\nbut focused on a different issue: the need to connect non-being and\nbeing in direct opposition to Hume’s principle of the\nseparability of all things that are different, by contrast with the\nmodal notions of metaphysical possibility and actuality,\n\nRickless (forthcoming) takes the main task of Shepherd’s\nargument to be refuting the opinion that a thing’s beginning is\nother than its not existing at one moment and existing at the next.\n(Hume asserts something like this but in terms of contraries\n“non-existent” and “existent” (T [2000:\n1.3.3.3])). Shepherd claims a thing begins only if there is something\nthat acts to begin it. Rickless suggests the strongest case that can\nbe made for this is illustrated by the fact that verbs such as\n“to walk”, “to sing”, and “to\ncampaign” signify acts or activities that begin only if a\nsubject starts to do them; e.g., a walk begins if an ambient being\nstarts to walk, and not otherwise. The generalization of this pattern\nis the implicit premise of the argument as Rickless interprets it, One\nmight object that an agent that single handedly begins to do an\nactivity is not a cause by Shepherd’s definition, so this\nargument may not prove anything she wants to hold. Rickless goes on to\nmake an important point about Shepherd’s argument: it treats\n“exists” as a predicate. This makes it vulnerable to\nHume’s doctrine that the idea of existence is the same as the\nidea of the object that exists; to think of an object is to think of\nit as existent (T [2000: 1.2.8.4]). So even though Shepherd’s\nargument, as Rickless understands it, is cogent, Hume has ground on\nwhich to resist it (as does Kant). This is true, but she has a case\nto make. Shepherd respects Hume’s preference for\n“non-existent” rather than “not in existence” (see ERCE [2000:\n37–8]). But she herself holds we have ideas of existence that\nare modally and temporally qualified and explicitly argues that we\nhave a general idea of existence (EPEU [2020: 82–6]).\n\nAll derivations of the argument for CP found in the texts have\npremises formulated in the terminology of the theory of cause and\neffect Shepherd promotes. Most of them refer to things that begin to\nexist as “qualities” of “objects.” According\nto Shepherd’s list of non-Humean definitions: a cause is\n“such an action of an object, as shall enable it, in conjunction\nwith another, to form a new nature, capable of exhibiting qualities\nvarying from those of either object in separation from the other. This\nis really to be a producer of new being” (ERCE [2000: 63]). An\neffect is defined as “the produced quality exhibited to the\nsenses, as the essential property of natures so conjoined.” An\nobject is defined as “a combined mass of qualities; the result\nof proportional unknown circumstances in nature, meeting with the\nhuman senses” (ERCE [2000: 64]). According to these definitions,\nwe can say a cause is part of a configuration comprising: first, the\nantecedent existence of two or more objects that taken together ground\nthe possibility of the existence of some quality Q when it does not\nyet exist; second, the two objects’ uniting and thereby forming\na new object that is the cause of newly existent Q; and third, the\nobject’s being perceived with Q as its essential property.\n\nA distinctive, perhaps unique, feature of Shepherd’s metaphysics\nis that the objects we believe to exist in the world are partly in us\n(mind dependent) and partly unknown, exterior to, and independent of\nminds and sensory organs. Objects, for her, are objects as we perceive\nthem; they are not fully formed unless perceived (see e.g. EPEU [2020:\n72–3, 93]). That is, sensible qualities such as figures and\ncolors are not external properties of mind independent objects (as\ne.g. Locke wants to say), nor sensations existing only in minds (as\nBerkeley maintains), but relations that span the mind and scarcely\nknown entities outside the mind. She faults Berkeley for holding that\nsensible objects are only ideas, not for holding that they are ideas\n(e.g. EPEU [2020; 195–213]). (Atherton1996 and Rickless 2018\ndisagree about whether Shepherd misunderstands Berkeley’s\nidealism.)\n\nIn regard to ontology, the preexisting entities that ground the\npossibility of the existence of so far non-existent qualities are\nregularly called “objects”, “natures”,\n“masses of qualities”, or “unknown circumstances in\nnature;” occasionally, they are designated by other terms (e.g.\n“substance” (ERCE [2000: 53; EPEU [2020: 388)). Also,\n“power” is synonymous with “efficient cause, or\nproductive principle;” it stands for “the property that\nlies in the secret nature of objects, when unobserved by the senses,\nand which determines the qualities that can be exhibited to them upon\nevery new conjunction” (ERCE [2000: 63–4]). Jeremy Fantl\n(2016) takes this to suggest an ontology in which objects are bundles\nof qualities, powers are basic (unreduced), and qualities are\nindividuated by the causal powers contributed by these qualities. If\nthis is right, it is natural to assume that objects are individuated\nby their causal powers or the qualities their powers determine (Fantl\nproposes the former). Shepherd does not use the term\n“individuate”, but relies on the notion of properties that are\nessential to individuals (see especially ERCE [2000; 48, 57, 63; EPEU\n[2020; 242, 243–3]). (Fields (forthcoming) argues that Shepherd\ndoes not have a bundle theory.)\n\nThe secondary literature has little to say about Shepherd’s\nessentialism but there are many indications that it is heavily\ninfluenced by a doctrine of Locke: “Essence may be taken for the\nvery being of anything, whereby it is what it is. And thus the real\ninternal, but generally in Substances, unknown Constitutions of\nThings, whereon their discoverable Qualities Depend, may be called\ntheir Essence” (E [1975: 3.3.15]); this motivates Locke’s\ndistinction between real and nominal essences of kinds). LoLordo\n(2200: 5–9) brings out Shepherd’s interest in downplaying\nLocke’s worry that the observable qualities of individual bodies\nfail to display divisions that might be regarded as delineating inner\nconstitutions; she also argues that Shepherd regards herself as the\ntrue heir of Locke’s legacy. Beyond that, however, her\nmetaphysical system seems to have been inspired, at least in part, by\nLocke’s notion of essence. Shepherd is convinced that the\npatterns of change we observe among sensible objects manifest what\nthey essentially are, namely causes that essentially produce the\neffects they do (e.g. ERCE [2000: 43–5, 47–9]). For\ninstance, “Fire … must of necessity burn as much as it\nmust be red, otherwise the red object were not fire” (ERCE\n[2000: 54]). It is true that some similar passages add that the stuff\nwould not be properly called “fire” but this is because it\nwould not be fire. Shepherd expresses the modal demand an essence\nmakes on an object by the term “obligation” and uses it to\ndefine what Hume calls “necessary connection” of cause and\neffect (ERCE [2000; 63]). This strongly suggests the necessity she\nascribes to causality is an expression of her essentialism.\n\nThe synchrony of cause and effect follows from the non-Humean\ndefinitions of cause, effect, object, and power. The union of two\nantecedently separate objects forms a new mass of qualities that\nincludes at least one quality that did not previously exist. The newly\nformed mass is the mass that includes the novel quality. The new\nobject does not exist until the union is complete. As Shepherd puts\nit, “[I]n their union, there exists those newly formed objects,\nor masses of qualities called Effects, … for in this union\nCause and Effect are synchronous, and they are but different words for\nthe same Essence” (ERCE [2000: 57]). As interpreted here, the\nnewly formed object and newly formed quality have synchronous\nexistence: one exists at a time if and only if the other does.\n\nDavid Landy (2020a) offers a different interpretation of the argument\nfor synchrony which he uses to construct a defense against\nHume’s contention that if causes and effects were\ncontemporaneous, then all objects would exist at the same time (see T\n[2000: 1.3.2.7]). On this reading, if a quality begins to exist, the\ntransition from two separate objects to one unified object passes\nthrough a “vanishingly short instant” in which the\nantecedents and their union overlap and “all three must exist\nsynchronically” (Landy 2020a: 4). This is problematic because\nsynchrony for a moment is too brief for the relation between an object\nand one of its essential qualities (compare Landy 2020a: 4, note 8).\nWe might also mention that if the separate antecedents and the unified\nobject literally existed at the same time, the union of antecedents\nwould be complete and incomplete at that time (see ERCE [2000:\n50]).\n",
    "section_title": "2.1 Everything that begins to exist must have a cause",
    "entry_title": "Mary Shepherd",
    "hierarchy_title": "Mary Shepherd || Doctrine of Cause and Effect || Everything that begins to exist must have a cause",
    "tokenized_text": [
        "doctrine",
        "cause",
        "effect",
        "everything",
        "begin",
        "exist",
        "must",
        "cause",
        "everything",
        "begin",
        "exist",
        "must",
        "cause",
        "shepherd",
        "account",
        "causality",
        "advertised",
        "contrary",
        "david",
        "hume",
        "point",
        "metaphysics",
        "psychology",
        "epistemology",
        "hume",
        "hold",
        "common",
        "causal",
        "belief",
        "due",
        "repetitious",
        "experience",
        "acquired",
        "habit",
        "imagination",
        "urge",
        "caused",
        "justified",
        "perception",
        "reasoning",
        "hume",
        "hold",
        "abstract",
        "idea",
        "impossible",
        "shepherd",
        "insists",
        "science",
        "philosophical",
        "analysis",
        "impossible",
        "without",
        "abstraction",
        "hume",
        "argues",
        "uncaused",
        "change",
        "course",
        "nature",
        "impossible",
        "produce",
        "proof",
        "everything",
        "begin",
        "exist",
        "must",
        "cause",
        "according",
        "proof",
        "articulates",
        "line",
        "reasoning",
        "human",
        "mind",
        "disposed",
        "use",
        "implicitly",
        "explicitly",
        "forming",
        "causal",
        "belief",
        "attaining",
        "knowledge",
        "causal",
        "principle",
        "perceiving",
        "particular",
        "instance",
        "eg",
        "epeu",
        "fantl",
        "incipient",
        "notion",
        "causal",
        "power",
        "necessary",
        "connection",
        "arise",
        "child",
        "form",
        "earliest",
        "belief",
        "sensible",
        "object",
        "eg",
        "epeu",
        "would",
        "correct",
        "say",
        "begs",
        "question",
        "hume",
        "several",
        "reason",
        "rejecting",
        "view",
        "relation",
        "cause",
        "effect",
        "perhaps",
        "two",
        "fundamental",
        "impoverishment",
        "theory",
        "mind",
        "limit",
        "apprehend",
        "sensory",
        "reflective",
        "impression",
        "thing",
        "resemble",
        "assumption",
        "ability",
        "separate",
        "idea",
        "cause",
        "effect",
        "imagination",
        "show",
        "idea",
        "separable",
        "nature",
        "experience",
        "bolton",
        "landy",
        "b",
        "theory",
        "causality",
        "causal",
        "induction",
        "expounded",
        "erce",
        "account",
        "cause",
        "justification",
        "belief",
        "external",
        "world",
        "developed",
        "epeu",
        "section",
        "mainly",
        "concerned",
        "former",
        "first",
        "metaphysical",
        "tenet",
        "causal",
        "principle",
        "necessary",
        "thing",
        "begin",
        "exist",
        "cause",
        "hereafter",
        "cp",
        "argument",
        "begin",
        "clarification",
        "notion",
        "effect",
        "semantically",
        "tied",
        "cause",
        "avoid",
        "implication",
        "shepherd",
        "characterizes",
        "effect",
        "thing",
        "begin",
        "exist",
        "clearly",
        "stated",
        "question",
        "whether",
        "thing",
        "begin",
        "exist",
        "owes",
        "existence",
        "cause",
        "erce",
        "proposes",
        "thought",
        "experiment",
        "imagine",
        "object",
        "different",
        "nature",
        "object",
        "know",
        "except",
        "capacity",
        "existence",
        "ground",
        "possibility",
        "existing",
        "yet",
        "exist",
        "suppose",
        "universe",
        "utter",
        "blank",
        "nothing",
        "existswith",
        "understood",
        "argues",
        "impossible",
        "thing",
        "begin",
        "exist",
        "beginning",
        "exist",
        "appear",
        "capacity",
        "nature",
        "hath",
        "alter",
        "presupposed",
        "nonentity",
        "act",
        "whilst",
        "being",
        "erce",
        "one",
        "way",
        "understand",
        "reductive",
        "argument",
        "beginning",
        "x",
        "must",
        "act",
        "b",
        "act",
        "must",
        "property",
        "object",
        "exists",
        "capacity",
        "actualize",
        "x",
        "c",
        "x",
        "yet",
        "exist",
        "nothing",
        "exists",
        "supposition",
        "x",
        "begin",
        "exist",
        "valid",
        "premise",
        "b",
        "seem",
        "assume",
        "argument",
        "supposed",
        "prove",
        "bolton",
        "fantl",
        "also",
        "find",
        "argument",
        "circular",
        "however",
        "rickless",
        "forthcoming",
        "among",
        "object",
        "charge",
        "argues",
        "doubtful",
        "pair",
        "premise",
        "mean",
        "thing",
        "conclusion",
        "arguably",
        "though",
        "shepherd",
        "assumes",
        "assumes",
        "idea",
        "needed",
        "begin",
        "x",
        "specifies",
        "state",
        "affair",
        "satisfies",
        "controversial",
        "idea",
        "cause",
        "nothing",
        "show",
        "fact",
        "world",
        "jennifer",
        "wilson",
        "forthcoming",
        "interprets",
        "argument",
        "effort",
        "articulate",
        "metaphysical",
        "reasoning",
        "behind",
        "intuition",
        "nothing",
        "come",
        "nothing",
        "like",
        "shepherd",
        "stress",
        "anything",
        "begin",
        "exist",
        "must",
        "beginning",
        "transition",
        "nonexistence",
        "existence",
        "entity",
        "view",
        "wilson",
        "note",
        "act",
        "event",
        "need",
        "property",
        "object",
        "must",
        "one",
        "thing",
        "perform",
        "said",
        "explain",
        "intuition",
        "independently",
        "plausible",
        "metaphysically",
        "possible",
        "worse",
        "epistemically",
        "alternative",
        "consistent",
        "interpretation",
        "offered",
        "focused",
        "different",
        "issue",
        "need",
        "connect",
        "nonbeing",
        "direct",
        "opposition",
        "hume",
        "principle",
        "separability",
        "thing",
        "different",
        "contrast",
        "modal",
        "notion",
        "metaphysical",
        "possibility",
        "actuality",
        "rickless",
        "forthcoming",
        "take",
        "main",
        "task",
        "shepherd",
        "argument",
        "refuting",
        "opinion",
        "thing",
        "beginning",
        "existing",
        "one",
        "moment",
        "existing",
        "next",
        "hume",
        "asserts",
        "something",
        "like",
        "term",
        "contrary",
        "nonexistent",
        "existent",
        "shepherd",
        "claim",
        "thing",
        "begin",
        "something",
        "act",
        "begin",
        "rickless",
        "suggests",
        "strongest",
        "case",
        "made",
        "illustrated",
        "fact",
        "verb",
        "walk",
        "sing",
        "campaign",
        "signify",
        "act",
        "activity",
        "begin",
        "subject",
        "start",
        "eg",
        "walk",
        "begin",
        "ambient",
        "start",
        "walk",
        "otherwise",
        "generalization",
        "pattern",
        "implicit",
        "premise",
        "argument",
        "rickless",
        "interprets",
        "one",
        "might",
        "object",
        "agent",
        "single",
        "handedly",
        "begin",
        "activity",
        "cause",
        "shepherd",
        "definition",
        "argument",
        "may",
        "prove",
        "anything",
        "want",
        "hold",
        "rickless",
        "go",
        "make",
        "important",
        "point",
        "shepherd",
        "argument",
        "treat",
        "exists",
        "predicate",
        "make",
        "vulnerable",
        "hume",
        "doctrine",
        "idea",
        "existence",
        "idea",
        "object",
        "exists",
        "think",
        "object",
        "think",
        "existent",
        "even",
        "though",
        "shepherd",
        "argument",
        "rickless",
        "understands",
        "cogent",
        "hume",
        "ground",
        "resist",
        "kant",
        "true",
        "case",
        "make",
        "shepherd",
        "respect",
        "hume",
        "preference",
        "nonexistent",
        "rather",
        "existence",
        "see",
        "erce",
        "hold",
        "idea",
        "existence",
        "modally",
        "temporally",
        "qualified",
        "explicitly",
        "argues",
        "general",
        "idea",
        "existence",
        "epeu",
        "derivation",
        "argument",
        "cp",
        "found",
        "text",
        "premise",
        "formulated",
        "terminology",
        "theory",
        "cause",
        "effect",
        "shepherd",
        "promotes",
        "refer",
        "thing",
        "begin",
        "exist",
        "quality",
        "objects",
        "according",
        "shepherd",
        "list",
        "nonhumean",
        "definition",
        "cause",
        "action",
        "object",
        "shall",
        "enable",
        "conjunction",
        "another",
        "form",
        "new",
        "nature",
        "capable",
        "exhibiting",
        "quality",
        "varying",
        "either",
        "object",
        "separation",
        "really",
        "producer",
        "new",
        "erce",
        "effect",
        "defined",
        "produced",
        "quality",
        "exhibited",
        "sens",
        "essential",
        "property",
        "nature",
        "conjoined",
        "object",
        "defined",
        "combined",
        "mass",
        "quality",
        "result",
        "proportional",
        "unknown",
        "circumstance",
        "nature",
        "meeting",
        "human",
        "sens",
        "erce",
        "according",
        "definition",
        "say",
        "cause",
        "part",
        "configuration",
        "comprising",
        "first",
        "antecedent",
        "existence",
        "two",
        "object",
        "taken",
        "together",
        "ground",
        "possibility",
        "existence",
        "quality",
        "q",
        "yet",
        "exist",
        "second",
        "two",
        "object",
        "uniting",
        "thereby",
        "forming",
        "new",
        "object",
        "cause",
        "newly",
        "existent",
        "q",
        "third",
        "object",
        "perceived",
        "q",
        "essential",
        "property",
        "distinctive",
        "perhaps",
        "unique",
        "feature",
        "shepherd",
        "metaphysics",
        "object",
        "believe",
        "exist",
        "world",
        "partly",
        "u",
        "mind",
        "dependent",
        "partly",
        "unknown",
        "exterior",
        "independent",
        "mind",
        "sensory",
        "organ",
        "object",
        "object",
        "perceive",
        "fully",
        "formed",
        "unless",
        "perceived",
        "see",
        "eg",
        "epeu",
        "sensible",
        "quality",
        "figure",
        "color",
        "external",
        "property",
        "mind",
        "independent",
        "object",
        "eg",
        "locke",
        "want",
        "say",
        "sensation",
        "existing",
        "mind",
        "berkeley",
        "maintains",
        "relation",
        "span",
        "mind",
        "scarcely",
        "known",
        "entity",
        "outside",
        "mind",
        "fault",
        "berkeley",
        "holding",
        "sensible",
        "object",
        "idea",
        "holding",
        "idea",
        "eg",
        "epeu",
        "atherton",
        "rickless",
        "disagree",
        "whether",
        "shepherd",
        "misunderstands",
        "berkeley",
        "idealism",
        "regard",
        "ontology",
        "preexisting",
        "entity",
        "ground",
        "possibility",
        "existence",
        "far",
        "nonexistent",
        "quality",
        "regularly",
        "called",
        "object",
        "nature",
        "mass",
        "quality",
        "unknown",
        "circumstance",
        "nature",
        "occasionally",
        "designated",
        "term",
        "eg",
        "substance",
        "erce",
        "epeu",
        "also",
        "power",
        "synonymous",
        "efficient",
        "cause",
        "productive",
        "principle",
        "stand",
        "property",
        "lie",
        "secret",
        "nature",
        "object",
        "unobserved",
        "sens",
        "determines",
        "quality",
        "exhibited",
        "upon",
        "every",
        "new",
        "conjunction",
        "erce",
        "jeremy",
        "fantl",
        "take",
        "suggest",
        "ontology",
        "object",
        "bundle",
        "quality",
        "power",
        "basic",
        "unreduced",
        "quality",
        "individuated",
        "causal",
        "power",
        "contributed",
        "quality",
        "right",
        "natural",
        "assume",
        "object",
        "individuated",
        "causal",
        "power",
        "quality",
        "power",
        "determine",
        "fantl",
        "proposes",
        "former",
        "shepherd",
        "use",
        "term",
        "individuate",
        "relies",
        "notion",
        "property",
        "essential",
        "individual",
        "see",
        "especially",
        "erce",
        "epeu",
        "field",
        "forthcoming",
        "argues",
        "shepherd",
        "bundle",
        "theory",
        "secondary",
        "literature",
        "little",
        "say",
        "shepherd",
        "essentialism",
        "many",
        "indication",
        "heavily",
        "influenced",
        "doctrine",
        "locke",
        "essence",
        "may",
        "taken",
        "anything",
        "whereby",
        "thus",
        "real",
        "internal",
        "generally",
        "substance",
        "unknown",
        "constitution",
        "thing",
        "whereon",
        "discoverable",
        "quality",
        "depend",
        "may",
        "called",
        "essence",
        "e",
        "motivates",
        "locke",
        "distinction",
        "real",
        "nominal",
        "essence",
        "kind",
        "lolordo",
        "brings",
        "shepherd",
        "interest",
        "downplaying",
        "locke",
        "worry",
        "observable",
        "quality",
        "individual",
        "body",
        "fail",
        "display",
        "division",
        "might",
        "regarded",
        "delineating",
        "inner",
        "constitution",
        "also",
        "argues",
        "shepherd",
        "regard",
        "true",
        "heir",
        "locke",
        "legacy",
        "beyond",
        "however",
        "metaphysical",
        "system",
        "seems",
        "inspired",
        "least",
        "part",
        "locke",
        "notion",
        "essence",
        "shepherd",
        "convinced",
        "pattern",
        "change",
        "observe",
        "among",
        "sensible",
        "object",
        "manifest",
        "essentially",
        "namely",
        "cause",
        "essentially",
        "produce",
        "effect",
        "eg",
        "erce",
        "instance",
        "fire",
        "must",
        "necessity",
        "burn",
        "much",
        "must",
        "red",
        "otherwise",
        "red",
        "object",
        "fire",
        "erce",
        "true",
        "similar",
        "passage",
        "add",
        "stuff",
        "would",
        "properly",
        "called",
        "fire",
        "would",
        "fire",
        "shepherd",
        "express",
        "modal",
        "demand",
        "essence",
        "make",
        "object",
        "term",
        "obligation",
        "us",
        "define",
        "hume",
        "call",
        "necessary",
        "connection",
        "cause",
        "effect",
        "erce",
        "strongly",
        "suggests",
        "necessity",
        "ascribes",
        "causality",
        "expression",
        "essentialism",
        "synchrony",
        "cause",
        "effect",
        "follows",
        "nonhumean",
        "definition",
        "cause",
        "effect",
        "object",
        "power",
        "union",
        "two",
        "antecedently",
        "separate",
        "object",
        "form",
        "new",
        "mass",
        "quality",
        "includes",
        "least",
        "one",
        "quality",
        "previously",
        "exist",
        "newly",
        "formed",
        "mass",
        "mass",
        "includes",
        "novel",
        "quality",
        "new",
        "object",
        "exist",
        "union",
        "complete",
        "shepherd",
        "put",
        "n",
        "union",
        "exists",
        "newly",
        "formed",
        "object",
        "mass",
        "quality",
        "called",
        "effect",
        "union",
        "cause",
        "effect",
        "synchronous",
        "different",
        "word",
        "essence",
        "erce",
        "interpreted",
        "newly",
        "formed",
        "object",
        "newly",
        "formed",
        "quality",
        "synchronous",
        "existence",
        "one",
        "exists",
        "time",
        "david",
        "landy",
        "a",
        "offer",
        "different",
        "interpretation",
        "argument",
        "synchrony",
        "us",
        "construct",
        "defense",
        "hume",
        "contention",
        "cause",
        "effect",
        "contemporaneous",
        "object",
        "would",
        "exist",
        "time",
        "see",
        "reading",
        "quality",
        "begin",
        "exist",
        "transition",
        "two",
        "separate",
        "object",
        "one",
        "unified",
        "object",
        "pass",
        "vanishingly",
        "short",
        "instant",
        "antecedent",
        "union",
        "overlap",
        "three",
        "must",
        "exist",
        "synchronically",
        "landy",
        "a",
        "problematic",
        "synchrony",
        "moment",
        "brief",
        "relation",
        "object",
        "one",
        "essential",
        "quality",
        "compare",
        "landy",
        "a",
        "note",
        "might",
        "also",
        "mention",
        "separate",
        "antecedent",
        "unified",
        "object",
        "literally",
        "existed",
        "time",
        "union",
        "antecedent",
        "would",
        "complete",
        "incomplete",
        "time",
        "see",
        "erce"
    ]
}