{
    "main_text": "Eliminativism\n4. Eliminativism\n\nThe simplest way of avoiding the puzzles of material constitution is\nto deny the existence of some of the objects that give rise to those\nproblems. For example, if one claims that there are no such things as\nstatues and lumps of clay, then there is no threat of having a statue\nand a lump of clay in the same place at the same time.\n\nThis kind of eliminativism is often associated with Peter Unger\n(1979), who (at one time) defended the thesis of mereological\nnihilism. Nihilism is the view that there are there are no\ncomposite objects (i.e., there are no objects with proper\nparts—only atoms exist). On this view, there are no statues,\nanimals or any other macroscopic object made up out of smaller parts.\nSince the nihilist denies the existence of statues in general, he will\ndeny the existence of the particular statue, David. Hence, he will\nreject the very first premise of the original argument for coincident\nobjects. He will also reject the second premise of that argument,\nsince he will deny the existence of the relevant lump. (Note that\nUnger’s use of ‘nihilism’ differs slightly from its\ncurrent meaning—see van Inwagen 1990, p. 73.)\n\nThe nihilist makes two main claims, both of which can be challenged.\nFirst, there is the negative thesis that there are no composite\nobjects and no statues in particular. The most common reaction to this\nclaim is an incredulous stare. For many, the existence of composite\nobjects is a Moorean fact, more certain than any premise that could be\nused to argue against it. The nihilist may reply that we can make\nsense of our statue-talk by paraphrasing it into claims about simples.\nFor example, instead of saying that there is a statue on the table, we\ncan say that there are some simples arranged “statuewise”\non top of some other simples arranged “tablewise”.\nSimilarly for other talk of statues, ships, and other composite\nobjects. (For more on this paraphrasing strategy, see van Inwagen\n1990, chapter 10. For worries, see O’Leary-Hawthorne and Michael\n1996, Uzquiano 2004b, and McGrath 2005.) This brings us to the\nnihilist’s positive thesis that there are material simples. This\nclaim can also be challenged. After all, it was once thought that\nchemical atoms were fundamental particles, until the discovery of\nprotons and neutrons. And it was thought that protons and neutrons\nwere mereological simples, until the discovery of quarks. One might\nthink it is possible for this process goes on without limit, in which\ncase our world would be gunky (i.e., it would have no simples\nas proper parts). The problem is that this possibility is inconsistent\nwith nihilism, which seems to imply that a material world must contain\nmaterial simples (Sider 1993, Zimmerman 1996, Schaffer 2003).\n\nA second version of eliminativism is associated with Peter van Inwagen\n(1990), who defends the view that living objects are the only\ncomposite objects. This view is closely related to nihilism, but has\none notable advantage—it allows for the existence of human\npersons. For example, in the case of Dion and Theon, van Inwagen will\nsay that Dion exists at the beginning of the story, since the activity\nof the relevant simples constitutes a life (the life of Dion). But van\nInwagen will deny that Theon exists, for the activity of the relevant\nsimples only constitutes a part of Dion’s life at that\ntime. Of course, the activity of those same simples constitutes a life\nafter Dion’s right foot is removed, at which point the simples\ncome to compose Dion. More generally, van Inwagen denies the existence\nof what he calls “arbitrary undetached parts”:\n\nThe Doctrine of Arbitrary Undetached Parts (DAUP): For every\nmaterial object m, time t, and regions\nr1 and r2, if m\noccupies r1 at t and\nr2 is a sub-region of r1, then\nthere is a part of m that occupies r2 at\nt. (cf. van Inwagen 1981, p. 123)\n\n\nLet m = Dion, t = a pre-operation time,\nr1 = the region occupied by Dion at t,\nand r2 = the region corresponding to all of Dion\nexcept for his right foot at t. If DAUP were correct, then\nTheon would exist, for it would just be the proper part of Dion that\noccupies r2 at t. Van Inwagen denies the\nexistence of Theon, so he rejects the general principle as well. (For\nmore on DAUP and material constitution, see van Inwagen 1981, Olson\n1995, and Parsons 2004.)\n\nVan Inwagen’s version of eliminativism is subject to the same\nobjections raised against nihilism, but it also faces problems of its\nown. Here is one worry. There are borderline cases where it is vague\nwhether or not the activity of some simples constitutes a life\n(consider, for example, the question of when, exactly, a person’s life\ncomes to an end). But, if it is vague whether the activity of some\nsimples constitutes a life then, according to van Inwagen, it is vague\nhow many objects exist. But it cannot be vague how many objects exist,\nsince cardinality claims can be made in a part of language where\nnothing is vague. Suppose, for example, that there are exactly\none-million simples and that it is vague whether or not the activity\nof those simples constitutes a life. Now consider the numerical\nsentence that asserts the existence of (at least) one-million and one\nobjects. (A numerical sentence is a first-order sentence\nasserting the existence of some objects. For example, the numerical\nsentence that there exist at least two objects is:\n∃x∃y(x ≠ y).) If\nvan Inwagen is correct, then it is indeterminate whether or not the\nrelevant numerical sentence is true, in which case one of the\nconstituent expressions—‘∃’,\n‘x’, ‘y’, ‘~’,\n‘=’—must be vague. Yet philosophers have claimed\nthat the terms of first-order logic do not admit of borderline cases.\n(For a more detailed presentation of this argument, see Lewis 1986,\npp. 212–213, Sider 2001, pp. 120–132, and section 2.2 of\nthe entry on\n ordinary objects.\n For potential replies, see Hirsch 2002b, Liebesman and Eklund 2007,\nand van Inwagen 1990, Chapter 13.)\n\nA third version of eliminativism is often associated with Roderick\nChisholm (1973), who defends the doctrine of mereological\nessentialism: for any x and y, if x is\na part of y then, necessarily, y exists only if\nx is a part of y. This doctrine is an\n“eliminativist” view insofar as it denies the existence of\nmereologically ductile objects. For example, in the Ship of Theseus\ncase it is natural to think that there is a ship which survives the\nreplacement of at least some of its parts. The essentialist’s\nresponse to the paradox is to deny this apparent truism. In the same\nway, the Debtor’s Paradox and the Puzzle of Deon and Theon only\narise on the assumption that human persons can gain and lose parts.\nThe essentialist solves these puzzles by rejecting this assumption.\nThe Puzzle of the Statue and the Clay remains problematic, however,\nfor that example involved a change in shape, rather than a change in\nparts. In order to respond to this puzzle, the essentialist must\nendorse an additional principle: for any xs and for any\ny, if the xs compose y then, necessarily,\nthe xs exist only if they compose y. This thesis\nsays that the whole is essential to the parts, so that whenever you\nhave the same parts, you have the same whole. The defender of this\nthesis will say that, in our earlier case, Lump exists on both Monday\nand Tuesday, for the same clay parts are there on both days. The same\nis true of David. The parts that compose David on Tuesday are present\non Monday, in which case the first premise of the earlier argument is\nfalse—David did exist on Monday. In that case, the\ndefender of mereological essentialist is free to identify David and\nLump and thereby avoid any commitment to coincident objects.\n\nViewed from one perspective, the essentialist’s picture can seem\nintuitive. When one rearranges the dining room furniture, one does not\nbring new furniture into existence—one simply brings existing\nfurniture into a new arrangement. In the same way, rearranging the\nmaterial contents of the universe does not bring new material objects\ninto existence—it simply puts existing objects into new\narrangements. Thus, when the artist sculpts the lump of clay she gives\nthat object a new form, but does not create a new object. Viewed from\nanother perspective, however, this picture seems completely absurd,\nfor it implies that if we annihilate a single particle of David, the\nentire statue will be destroyed. More frightening still, if we\nannihilate a single particle from your body, then you will no\nlonger exist. The mereological essentialist may reply that, if we were\nto annihilate a particle from David, there would still be a statue\nleft in its place—call it David*. David* would not be\nidentical to David, but it would be very similar. For\nexample, it would have roughly the same mass, the same shape, and the\nsame location. In Chisholm’s terminology, this would be a\n“statue-successor” of David, and the existence of this\nsuccessor gives us a loose sense in which “the statue”\nsurvives. Here is a second worry for the essentialist, focusing on the\nidea that the whole is essential to the parts. Imagine that the artist\nwho sculpted David becomes dissatisfied with her work and squashes the\nstatue while preserving all the bits of clay. If the whole is\nessential to the parts, then it would follow that David (the thing\nthat was previously composed of those parts) still exists. But this\nseems absurd—statues cannot survive being squashed. We get an\nequally absurd result in the opposite direction. David’s parts\nexisted prior to the sculpting, so David itself existed prior to the\nsculpting. But how can a statue exist before it is sculpted? The\neliminativist might reply that the thing which is (currently) a statue\nexisted prior to the sculpting, but it was not (then) a statue. In\nthis sense, at least, we can say that the statue did not exist prior\nto sculpting. Similarly, the thing which is (currently) a statue may\nsurvive being squashed, but it will not (then) be a statue. So, in\nthat sense, the statue will not survive the squashing. (For more\ndetails on this paraphrasing strategy, see Chisholm 1976, chapter\n3.)\n",
    "section_title": "4. Eliminativism",
    "entry_title": "Material Constitution",
    "hierarchy_title": "Material Constitution || Eliminativism",
    "tokenized_text": [
        "eliminativism",
        "eliminativism",
        "simplest",
        "way",
        "avoiding",
        "puzzle",
        "material",
        "constitution",
        "deny",
        "existence",
        "object",
        "give",
        "rise",
        "problem",
        "example",
        "one",
        "claim",
        "thing",
        "statue",
        "lump",
        "clay",
        "threat",
        "statue",
        "lump",
        "clay",
        "place",
        "time",
        "kind",
        "eliminativism",
        "often",
        "associated",
        "peter",
        "unger",
        "one",
        "time",
        "defended",
        "thesis",
        "mereological",
        "nihilism",
        "nihilism",
        "view",
        "composite",
        "object",
        "ie",
        "object",
        "proper",
        "partsonly",
        "atom",
        "exist",
        "view",
        "statue",
        "animal",
        "macroscopic",
        "object",
        "made",
        "smaller",
        "part",
        "since",
        "nihilist",
        "denies",
        "existence",
        "statue",
        "general",
        "deny",
        "existence",
        "particular",
        "statue",
        "david",
        "hence",
        "reject",
        "first",
        "premise",
        "original",
        "argument",
        "coincident",
        "object",
        "also",
        "reject",
        "second",
        "premise",
        "argument",
        "since",
        "deny",
        "existence",
        "relevant",
        "lump",
        "note",
        "unger",
        "use",
        "nihilism",
        "differs",
        "slightly",
        "current",
        "meaningsee",
        "van",
        "inwagen",
        "p",
        "nihilist",
        "make",
        "two",
        "main",
        "claim",
        "challenged",
        "first",
        "negative",
        "thesis",
        "composite",
        "object",
        "statue",
        "particular",
        "common",
        "reaction",
        "claim",
        "incredulous",
        "stare",
        "many",
        "existence",
        "composite",
        "object",
        "moorean",
        "fact",
        "certain",
        "premise",
        "could",
        "used",
        "argue",
        "nihilist",
        "may",
        "reply",
        "make",
        "sense",
        "statuetalk",
        "paraphrasing",
        "claim",
        "simple",
        "example",
        "instead",
        "saying",
        "statue",
        "table",
        "say",
        "simple",
        "arranged",
        "statuewise",
        "top",
        "simple",
        "arranged",
        "tablewise",
        "similarly",
        "talk",
        "statue",
        "ship",
        "composite",
        "object",
        "paraphrasing",
        "strategy",
        "see",
        "van",
        "inwagen",
        "chapter",
        "worry",
        "see",
        "learyhawthorne",
        "michael",
        "uzquiano",
        "b",
        "mcgrath",
        "brings",
        "u",
        "nihilist",
        "positive",
        "thesis",
        "material",
        "simple",
        "claim",
        "also",
        "challenged",
        "thought",
        "chemical",
        "atom",
        "fundamental",
        "particle",
        "discovery",
        "proton",
        "neutron",
        "thought",
        "proton",
        "neutron",
        "mereological",
        "simple",
        "discovery",
        "quark",
        "one",
        "might",
        "think",
        "possible",
        "process",
        "go",
        "without",
        "limit",
        "case",
        "world",
        "would",
        "gunky",
        "ie",
        "would",
        "simple",
        "proper",
        "part",
        "problem",
        "possibility",
        "inconsistent",
        "nihilism",
        "seems",
        "imply",
        "material",
        "world",
        "must",
        "contain",
        "material",
        "simple",
        "sider",
        "zimmerman",
        "schaffer",
        "second",
        "version",
        "eliminativism",
        "associated",
        "peter",
        "van",
        "inwagen",
        "defends",
        "view",
        "living",
        "object",
        "composite",
        "object",
        "view",
        "closely",
        "related",
        "nihilism",
        "one",
        "notable",
        "advantageit",
        "allows",
        "existence",
        "human",
        "person",
        "example",
        "case",
        "dion",
        "theon",
        "van",
        "inwagen",
        "say",
        "dion",
        "exists",
        "beginning",
        "story",
        "since",
        "activity",
        "relevant",
        "simple",
        "constitutes",
        "life",
        "life",
        "dion",
        "van",
        "inwagen",
        "deny",
        "theon",
        "exists",
        "activity",
        "relevant",
        "simple",
        "constitutes",
        "part",
        "dion",
        "life",
        "time",
        "course",
        "activity",
        "simple",
        "constitutes",
        "life",
        "dion",
        "right",
        "foot",
        "removed",
        "point",
        "simple",
        "come",
        "compose",
        "dion",
        "generally",
        "van",
        "inwagen",
        "denies",
        "existence",
        "call",
        "arbitrary",
        "undetached",
        "part",
        "doctrine",
        "arbitrary",
        "undetached",
        "part",
        "daup",
        "every",
        "material",
        "object",
        "time",
        "region",
        "r",
        "r",
        "occupies",
        "r",
        "r",
        "subregion",
        "r",
        "part",
        "occupies",
        "r",
        "t",
        "cf",
        "van",
        "inwagen",
        "p",
        "let",
        "dion",
        "preoperation",
        "time",
        "r",
        "region",
        "occupied",
        "dion",
        "r",
        "region",
        "corresponding",
        "dion",
        "except",
        "right",
        "foot",
        "t",
        "daup",
        "correct",
        "theon",
        "would",
        "exist",
        "would",
        "proper",
        "part",
        "dion",
        "occupies",
        "r",
        "t",
        "van",
        "inwagen",
        "denies",
        "existence",
        "theon",
        "reject",
        "general",
        "principle",
        "well",
        "daup",
        "material",
        "constitution",
        "see",
        "van",
        "inwagen",
        "olson",
        "parson",
        "van",
        "inwagen",
        "version",
        "eliminativism",
        "subject",
        "objection",
        "raised",
        "nihilism",
        "also",
        "face",
        "problem",
        "one",
        "worry",
        "borderline",
        "case",
        "vague",
        "whether",
        "activity",
        "simple",
        "constitutes",
        "life",
        "consider",
        "example",
        "question",
        "exactly",
        "person",
        "life",
        "come",
        "end",
        "vague",
        "whether",
        "activity",
        "simple",
        "constitutes",
        "life",
        "according",
        "van",
        "inwagen",
        "vague",
        "many",
        "object",
        "exist",
        "vague",
        "many",
        "object",
        "exist",
        "since",
        "cardinality",
        "claim",
        "made",
        "part",
        "language",
        "nothing",
        "vague",
        "suppose",
        "example",
        "exactly",
        "onemillion",
        "simple",
        "vague",
        "whether",
        "activity",
        "simple",
        "constitutes",
        "life",
        "consider",
        "numerical",
        "sentence",
        "asserts",
        "existence",
        "least",
        "onemillion",
        "one",
        "object",
        "numerical",
        "sentence",
        "firstorder",
        "sentence",
        "asserting",
        "existence",
        "object",
        "example",
        "numerical",
        "sentence",
        "exist",
        "least",
        "two",
        "object",
        "xy",
        "x",
        "van",
        "inwagen",
        "correct",
        "indeterminate",
        "whether",
        "relevant",
        "numerical",
        "sentence",
        "true",
        "case",
        "one",
        "constituent",
        "expressions",
        "x",
        "must",
        "vague",
        "yet",
        "philosopher",
        "claimed",
        "term",
        "firstorder",
        "logic",
        "admit",
        "borderline",
        "case",
        "detailed",
        "presentation",
        "argument",
        "see",
        "lewis",
        "pp",
        "sider",
        "pp",
        "section",
        "entry",
        "ordinary",
        "object",
        "potential",
        "reply",
        "see",
        "hirsch",
        "b",
        "liebesman",
        "eklund",
        "van",
        "inwagen",
        "chapter",
        "third",
        "version",
        "eliminativism",
        "often",
        "associated",
        "roderick",
        "chisholm",
        "defends",
        "doctrine",
        "mereological",
        "essentialism",
        "x",
        "x",
        "part",
        "necessarily",
        "exists",
        "x",
        "part",
        "y",
        "doctrine",
        "eliminativist",
        "view",
        "insofar",
        "denies",
        "existence",
        "mereologically",
        "ductile",
        "object",
        "example",
        "ship",
        "theseus",
        "case",
        "natural",
        "think",
        "ship",
        "survives",
        "replacement",
        "least",
        "part",
        "essentialist",
        "response",
        "paradox",
        "deny",
        "apparent",
        "truism",
        "way",
        "debtor",
        "paradox",
        "puzzle",
        "deon",
        "theon",
        "arise",
        "assumption",
        "human",
        "person",
        "gain",
        "lose",
        "part",
        "essentialist",
        "solves",
        "puzzle",
        "rejecting",
        "assumption",
        "puzzle",
        "statue",
        "clay",
        "remains",
        "problematic",
        "however",
        "example",
        "involved",
        "change",
        "shape",
        "rather",
        "change",
        "part",
        "order",
        "respond",
        "puzzle",
        "essentialist",
        "must",
        "endorse",
        "additional",
        "principle",
        "x",
        "x",
        "compose",
        "necessarily",
        "x",
        "exist",
        "compose",
        "y",
        "thesis",
        "say",
        "whole",
        "essential",
        "part",
        "whenever",
        "part",
        "whole",
        "defender",
        "thesis",
        "say",
        "earlier",
        "case",
        "lump",
        "exists",
        "monday",
        "tuesday",
        "clay",
        "part",
        "day",
        "true",
        "david",
        "part",
        "compose",
        "david",
        "tuesday",
        "present",
        "monday",
        "case",
        "first",
        "premise",
        "earlier",
        "argument",
        "falsedavid",
        "exist",
        "monday",
        "case",
        "defender",
        "mereological",
        "essentialist",
        "free",
        "identify",
        "david",
        "lump",
        "thereby",
        "avoid",
        "commitment",
        "coincident",
        "object",
        "viewed",
        "one",
        "perspective",
        "essentialist",
        "picture",
        "seem",
        "intuitive",
        "one",
        "rearranges",
        "dining",
        "room",
        "furniture",
        "one",
        "bring",
        "new",
        "furniture",
        "existenceone",
        "simply",
        "brings",
        "existing",
        "furniture",
        "new",
        "arrangement",
        "way",
        "rearranging",
        "material",
        "content",
        "universe",
        "bring",
        "new",
        "material",
        "object",
        "existenceit",
        "simply",
        "put",
        "existing",
        "object",
        "new",
        "arrangement",
        "thus",
        "artist",
        "sculpts",
        "lump",
        "clay",
        "give",
        "object",
        "new",
        "form",
        "create",
        "new",
        "object",
        "viewed",
        "another",
        "perspective",
        "however",
        "picture",
        "seems",
        "completely",
        "absurd",
        "implies",
        "annihilate",
        "single",
        "particle",
        "david",
        "entire",
        "statue",
        "destroyed",
        "frightening",
        "still",
        "annihilate",
        "single",
        "particle",
        "body",
        "longer",
        "exist",
        "mereological",
        "essentialist",
        "may",
        "reply",
        "annihilate",
        "particle",
        "david",
        "would",
        "still",
        "statue",
        "left",
        "placecall",
        "david",
        "david",
        "would",
        "identical",
        "david",
        "would",
        "similar",
        "example",
        "would",
        "roughly",
        "mass",
        "shape",
        "location",
        "chisholm",
        "terminology",
        "would",
        "statuesuccessor",
        "david",
        "existence",
        "successor",
        "give",
        "u",
        "loose",
        "sense",
        "statue",
        "survives",
        "second",
        "worry",
        "essentialist",
        "focusing",
        "idea",
        "whole",
        "essential",
        "part",
        "imagine",
        "artist",
        "sculpted",
        "david",
        "becomes",
        "dissatisfied",
        "work",
        "squash",
        "statue",
        "preserving",
        "bit",
        "clay",
        "whole",
        "essential",
        "part",
        "would",
        "follow",
        "david",
        "thing",
        "previously",
        "composed",
        "part",
        "still",
        "exists",
        "seems",
        "absurdstatues",
        "survive",
        "squashed",
        "get",
        "equally",
        "absurd",
        "result",
        "opposite",
        "direction",
        "david",
        "part",
        "existed",
        "prior",
        "sculpting",
        "david",
        "existed",
        "prior",
        "sculpting",
        "statue",
        "exist",
        "sculpted",
        "eliminativist",
        "might",
        "reply",
        "thing",
        "currently",
        "statue",
        "existed",
        "prior",
        "sculpting",
        "statue",
        "sense",
        "least",
        "say",
        "statue",
        "exist",
        "prior",
        "sculpting",
        "similarly",
        "thing",
        "currently",
        "statue",
        "may",
        "survive",
        "squashed",
        "statue",
        "sense",
        "statue",
        "survive",
        "squashing",
        "detail",
        "paraphrasing",
        "strategy",
        "see",
        "chisholm",
        "chapter"
    ]
}