{
    "main_text": "The Ego and Its Own || The Ancient and Modern Worlds\n2.2 The Ancient and Modern Worlds\n\nPart One of The Ego and Its Own is backward-looking and\nnegative. It is backward-looking in that it is concerned with the\nancient and modern worlds rather than with the future. And it is\nnegative in that its primary aim is to demonstrate the failure of\nmodernity to escape from the very religious modes of thought which it\nclaims to have outgrown. The bulk of Stirner’s genealogical\naccount is devoted to the modern epoch, and the ancient world is only\ndiscussed insofar as it contributes to the genesis of modernity. In\nboth cases, however, the majority of his examples are taken from the\ncultural and intellectual spheres. Cumulatively these examples are\nmeant, not only to undermine historical narratives which portray the\nmodern development of humankind as the progressive realisation of\nfreedom, but also to support an account of individuals in the modern\nworld as increasingly oppressed by the spiritual. For Stirner, the\nsubordination of the individual to spirit — in any of its guises\n— counts as a problematic form of religious servitude.\n\nStirner’s account of the historical development of modernity\nlargely revolves around a single event, the Reformation. He attempts\nto show that, from the perspective of the individual, the movement\nfrom Catholic to Protestant hegemony is not a liberating one, but\ninstead constitutes both an extension and intensification of the\ndomination of spirit. The Reformation extends, rather than contracts,\nthe sphere of religious control over the individual because it refuses\nto recognise the distinction between the spiritual and the sensuous.\nRather than preventing priests from marrying, for example,\nProtestantism makes marriage religious, thereby extending the sphere\nof the spiritual to include the sensuous. The Reformation also\nintensifies, rather than relaxes, the bond between individuals and\nreligion. The more inward faith of Protestantism, for example,\nestablishes a perpetual internal conflict between natural impulses and\nreligious conscience. In a typically vivid and combative metaphor,\nStirner describes this internal conflict in the individual — in\nwhich natural impulses battle with religious conscience — as\nanalogous to the struggle between the populace and the secret police\nin the contemporary body politic.\n\nStirner’s claim that the modern world reproduces, rather than\nabolishes, religious modes of thought provides the opportunity for a\nsustained attack on the writings of his left-Hegelian contemporaries.\nLudwig Feuerbach, in particular, is singled out for failing to\novercome the subordination of the individual to spirit.\n\nThe centrality of the critique of Feuerbach to Stirner’s project\nis clear from the form of The Ego and Its Own which embodies\na structural parody of Feuerbach’s best-known work. Where the\ntwo halves of Feuerbach’s Das Wesen des Christentums\nhad been entitled God and Man — with the first\nattacked and the second celebrated — the two corresponding parts\nof Stirner’s opus are named Man and I. More\nsubstantively, Stirner seeks to challenge the contemporary verdict of\nprogressives concerning Feuerbach’s achievement. Stirner\nmaintains that the contemporary celebration of Feuerbach for having\ncompleted the critique of religion, is not merely mistaken but nearer\nthe opposite of the truth. Far from undermining religion, the\nFeuerbachian problematic is said to reproduce and amplify its central\nfeatures.\n\nFor Feuerbach, the primary error of Christianity is that it takes\nhuman predicates and projects them into another world as if they\nconstitute an independent being. He sees religious belief as a\nnecessary step in the progress of humankind to self-understanding.\nMore precisely, it is through transformative criticism —\nrecovering the correct relation of subject and predicate from its\ninversion in Christianity — that we first come to understand\nwhat human nature is. Moreover, Feuerbach maintains that, once\nliberated from their otherworldly form, these essential human\ncharacteristics — and especially perhaps our love for others\n— would quickly come to form the basis of the unalienated social\nand political life of the future. This emancipatory ambition also\nhelps to clarify Feuerbach’s insistence that he should be seen\nas a friend, and not an enemy, of religion; in particular, he sought\nnot to destroy Christianity, but to liberate its content from\notherworldly forms. This claim is also at the heart of his distinctive\n— and perhaps idiosyncratic — denial that he was an\natheist. Feuerbach maintains that true atheism requires the rejection\nnot only of God as subject, but also of those predicates — love,\nwisdom, justice, and so on — traditionally associated with\ndivinity.\n\nStirner might be said to pick up this — perhaps idiosyncratic\n— characterisation of “true atheism” and run with\nit. Stirner maintains that religion, properly understood, is\ncharacterised by the subordination of the individual to\n“spirit” in any of its guises. Consequently, the rejection\nof God as a transcendental subject leaves the essential character and\nfailing of religion intact. Feuerbach’s perfectionist\nproblematic, Stirner remarks, might have altered “the\ntinsel” (the divine subject) but it leaves “the main\nthing” (the divine predicates) unchanged (56). (Page references\nin parenthesis are to the 1995 Cambridge edition of The Ego and\nIts Own cited in the Bibliography below.) The sacred is allowed\nto remain, if not as God, then as “Man with a capital\nM” in Byington’s inspired English rendering of\nStirner’s “Der Mensch”. In short, rather\nthan describing human nature as it is, Feuerbach is said to have\ndeified a prescriptive account of what being human involves. As a\nresult, the real kernel of religion, the positing of an “essence\nover me” (46), has been left intact. Indeed, Stirner suggests\nthat Feuerbach’s achievement was to have effected a\n“change of masters” (55) which actually made the tyranny\nof the divine over the individual even more complete. More complete\nbecause it extends and intensifies domination. It extends domination\nbecause this new deity is no longer the preserve of the faithful, but\ncan possess everyone, believers and unbelievers alike. And it\nintensifies domination because the scrutiny of our own conscience is\nmuch harder to evade than that of a transcendental subject that a\nflutters “over our heads as a dove” (86).\n\nStirner extends this critique to the work of all the left-Hegelians,\nincluding those with whom he had associated in Berlin. Individual\nleft-Hegelians disagree about the content of human nature. Thus for\n“political liberals” like Arnold Ruge human nature is\nidentified with citizenship, for “social liberals” like\nMoses Hess human nature is identified with labour, and for\n“humane liberals” like Bruno Bauer human nature is\nidentified with critical activity. However, notwithstanding those\ndifferences, all these left-hegelians reproduce the basic Feuerbachian\nerror: separating the individual from their human essence, and then\nsetting that essence above the individual as something to be striven\nfor. In contrast, Stirner maintains that because it has no universal\nor prescriptive content, human nature cannot ground any claim about\nhow we ought to live. His own intellectual project—which he\ndescribes as an attempt to rehabilitate the prosaic and mortal self,\nthe “un-man”(124) for whom the notion of a calling is\nalien—is intended as a radical break with the work of these\ncontemporaries.\n\nIt might seem obvious that Stirner subscribes to a resolutely\nanti-perfectionist position here. However, this reading has been\nchallenged. Stirner certainly rejects what might be called\n“essentialist perfectionism”; that is, those ethical\ntheories which value certain characteristics of the individual\nprecisely because they realise some aspect of human nature. However,\nhe himself continues to embrace a character ideal, a picture of a\nself-ruling individual whose perfection is valuable apart from any\nhappiness or pleasure that it might bring. The Stirnerian egoist must\nnot only avoid submission to external powers, but must also cultivate\na kind of emotional detachment towards their own thoughts and\nfeelings, ensuring that the latter do not subjugate the egoist, or\nmake the egoist an instrument of their own realisation. In short, the\nsuggestion here is that an “anti-essentialist\nperfectionism” survives in this ideal of character, in\nStirner’s celebration of the “un-man” and the egoist\n(Leopold 2019).\n",
    "section_title": "2.2 The Ancient and Modern Worlds",
    "entry_title": "Max Stirner",
    "hierarchy_title": "Max Stirner || The Ego and Its Own || The Ancient and Modern Worlds",
    "tokenized_text": [
        "ego",
        "ancient",
        "modern",
        "world",
        "ancient",
        "modern",
        "world",
        "part",
        "one",
        "ego",
        "backwardlooking",
        "negative",
        "backwardlooking",
        "concerned",
        "ancient",
        "modern",
        "world",
        "rather",
        "future",
        "negative",
        "primary",
        "aim",
        "demonstrate",
        "failure",
        "modernity",
        "escape",
        "religious",
        "mode",
        "thought",
        "claim",
        "outgrown",
        "bulk",
        "stirner",
        "genealogical",
        "account",
        "devoted",
        "modern",
        "epoch",
        "ancient",
        "world",
        "discussed",
        "insofar",
        "contributes",
        "genesis",
        "modernity",
        "case",
        "however",
        "majority",
        "example",
        "taken",
        "cultural",
        "intellectual",
        "sphere",
        "cumulatively",
        "example",
        "meant",
        "undermine",
        "historical",
        "narrative",
        "portray",
        "modern",
        "development",
        "humankind",
        "progressive",
        "realisation",
        "freedom",
        "also",
        "support",
        "account",
        "individual",
        "modern",
        "world",
        "increasingly",
        "oppressed",
        "spiritual",
        "stirner",
        "subordination",
        "individual",
        "spirit",
        "guise",
        "count",
        "problematic",
        "form",
        "religious",
        "servitude",
        "stirner",
        "account",
        "historical",
        "development",
        "modernity",
        "largely",
        "revolves",
        "around",
        "single",
        "event",
        "reformation",
        "attempt",
        "show",
        "perspective",
        "individual",
        "movement",
        "catholic",
        "protestant",
        "hegemony",
        "liberating",
        "one",
        "instead",
        "constitutes",
        "extension",
        "intensification",
        "domination",
        "spirit",
        "reformation",
        "extends",
        "rather",
        "contract",
        "sphere",
        "religious",
        "control",
        "individual",
        "refuse",
        "recognise",
        "distinction",
        "spiritual",
        "sensuous",
        "rather",
        "preventing",
        "priest",
        "marrying",
        "example",
        "protestantism",
        "make",
        "marriage",
        "religious",
        "thereby",
        "extending",
        "sphere",
        "spiritual",
        "include",
        "sensuous",
        "reformation",
        "also",
        "intensifies",
        "rather",
        "relaxes",
        "bond",
        "individual",
        "religion",
        "inward",
        "faith",
        "protestantism",
        "example",
        "establishes",
        "perpetual",
        "internal",
        "conflict",
        "natural",
        "impulse",
        "religious",
        "conscience",
        "typically",
        "vivid",
        "combative",
        "metaphor",
        "stirner",
        "describes",
        "internal",
        "conflict",
        "individual",
        "natural",
        "impulse",
        "battle",
        "religious",
        "conscience",
        "analogous",
        "struggle",
        "populace",
        "secret",
        "police",
        "contemporary",
        "body",
        "politic",
        "stirner",
        "claim",
        "modern",
        "world",
        "reproduces",
        "rather",
        "abolishes",
        "religious",
        "mode",
        "thought",
        "provides",
        "opportunity",
        "sustained",
        "attack",
        "writing",
        "lefthegelian",
        "contemporary",
        "ludwig",
        "feuerbach",
        "particular",
        "singled",
        "failing",
        "overcome",
        "subordination",
        "individual",
        "spirit",
        "centrality",
        "critique",
        "feuerbach",
        "stirner",
        "project",
        "clear",
        "form",
        "ego",
        "embodies",
        "structural",
        "parody",
        "feuerbach",
        "bestknown",
        "work",
        "two",
        "half",
        "feuerbach",
        "da",
        "wesen",
        "de",
        "christentums",
        "entitled",
        "god",
        "man",
        "first",
        "attacked",
        "second",
        "celebrated",
        "two",
        "corresponding",
        "part",
        "stirner",
        "opus",
        "named",
        "man",
        "i",
        "substantively",
        "stirner",
        "seek",
        "challenge",
        "contemporary",
        "verdict",
        "progressive",
        "concerning",
        "feuerbach",
        "achievement",
        "stirner",
        "maintains",
        "contemporary",
        "celebration",
        "feuerbach",
        "completed",
        "critique",
        "religion",
        "merely",
        "mistaken",
        "nearer",
        "opposite",
        "truth",
        "far",
        "undermining",
        "religion",
        "feuerbachian",
        "problematic",
        "said",
        "reproduce",
        "amplify",
        "central",
        "feature",
        "feuerbach",
        "primary",
        "error",
        "christianity",
        "take",
        "human",
        "predicate",
        "project",
        "another",
        "world",
        "constitute",
        "independent",
        "see",
        "religious",
        "belief",
        "necessary",
        "step",
        "progress",
        "humankind",
        "selfunderstanding",
        "precisely",
        "transformative",
        "criticism",
        "recovering",
        "correct",
        "relation",
        "subject",
        "predicate",
        "inversion",
        "christianity",
        "first",
        "come",
        "understand",
        "human",
        "nature",
        "moreover",
        "feuerbach",
        "maintains",
        "liberated",
        "otherworldly",
        "form",
        "essential",
        "human",
        "characteristic",
        "especially",
        "perhaps",
        "love",
        "others",
        "would",
        "quickly",
        "come",
        "form",
        "basis",
        "unalienated",
        "social",
        "political",
        "life",
        "future",
        "emancipatory",
        "ambition",
        "also",
        "help",
        "clarify",
        "feuerbach",
        "insistence",
        "seen",
        "friend",
        "enemy",
        "religion",
        "particular",
        "sought",
        "destroy",
        "christianity",
        "liberate",
        "content",
        "otherworldly",
        "form",
        "claim",
        "also",
        "heart",
        "distinctive",
        "perhaps",
        "idiosyncratic",
        "denial",
        "atheist",
        "feuerbach",
        "maintains",
        "true",
        "atheism",
        "requires",
        "rejection",
        "god",
        "subject",
        "also",
        "predicate",
        "love",
        "wisdom",
        "justice",
        "traditionally",
        "associated",
        "divinity",
        "stirner",
        "might",
        "said",
        "pick",
        "perhaps",
        "idiosyncratic",
        "characterisation",
        "true",
        "atheism",
        "run",
        "stirner",
        "maintains",
        "religion",
        "properly",
        "understood",
        "characterised",
        "subordination",
        "individual",
        "spirit",
        "guise",
        "consequently",
        "rejection",
        "god",
        "transcendental",
        "subject",
        "leaf",
        "essential",
        "character",
        "failing",
        "religion",
        "intact",
        "feuerbach",
        "perfectionist",
        "problematic",
        "stirner",
        "remark",
        "might",
        "altered",
        "tinsel",
        "divine",
        "subject",
        "leaf",
        "main",
        "thing",
        "divine",
        "predicate",
        "unchanged",
        "page",
        "reference",
        "parenthesis",
        "cambridge",
        "edition",
        "ego",
        "cited",
        "bibliography",
        "sacred",
        "allowed",
        "remain",
        "god",
        "man",
        "capital",
        "byington",
        "inspired",
        "english",
        "rendering",
        "stirner",
        "der",
        "mensch",
        "short",
        "rather",
        "describing",
        "human",
        "nature",
        "feuerbach",
        "said",
        "deified",
        "prescriptive",
        "account",
        "human",
        "involves",
        "result",
        "real",
        "kernel",
        "religion",
        "positing",
        "essence",
        "left",
        "intact",
        "indeed",
        "stirner",
        "suggests",
        "feuerbach",
        "achievement",
        "effected",
        "change",
        "master",
        "actually",
        "made",
        "tyranny",
        "divine",
        "individual",
        "even",
        "complete",
        "complete",
        "extends",
        "intensifies",
        "domination",
        "extends",
        "domination",
        "new",
        "deity",
        "longer",
        "preserve",
        "faithful",
        "posse",
        "everyone",
        "believer",
        "unbeliever",
        "alike",
        "intensifies",
        "domination",
        "scrutiny",
        "conscience",
        "much",
        "harder",
        "evade",
        "transcendental",
        "subject",
        "flutter",
        "head",
        "dove",
        "stirner",
        "extends",
        "critique",
        "work",
        "lefthegelians",
        "including",
        "associated",
        "berlin",
        "individual",
        "lefthegelians",
        "disagree",
        "content",
        "human",
        "nature",
        "thus",
        "political",
        "liberal",
        "like",
        "arnold",
        "ruge",
        "human",
        "nature",
        "identified",
        "citizenship",
        "social",
        "liberal",
        "like",
        "moses",
        "hess",
        "human",
        "nature",
        "identified",
        "labour",
        "humane",
        "liberal",
        "like",
        "bruno",
        "bauer",
        "human",
        "nature",
        "identified",
        "critical",
        "activity",
        "however",
        "notwithstanding",
        "difference",
        "lefthegelians",
        "reproduce",
        "basic",
        "feuerbachian",
        "error",
        "separating",
        "individual",
        "human",
        "essence",
        "setting",
        "essence",
        "individual",
        "something",
        "striven",
        "contrast",
        "stirner",
        "maintains",
        "universal",
        "prescriptive",
        "content",
        "human",
        "nature",
        "ground",
        "claim",
        "ought",
        "live",
        "intellectual",
        "projectwhich",
        "describes",
        "attempt",
        "rehabilitate",
        "prosaic",
        "mortal",
        "self",
        "unman",
        "notion",
        "calling",
        "alienis",
        "intended",
        "radical",
        "break",
        "work",
        "contemporary",
        "might",
        "seem",
        "obvious",
        "stirner",
        "subscribes",
        "resolutely",
        "antiperfectionist",
        "position",
        "however",
        "reading",
        "challenged",
        "stirner",
        "certainly",
        "reject",
        "might",
        "called",
        "essentialist",
        "perfectionism",
        "ethical",
        "theory",
        "value",
        "certain",
        "characteristic",
        "individual",
        "precisely",
        "realise",
        "aspect",
        "human",
        "nature",
        "however",
        "continues",
        "embrace",
        "character",
        "ideal",
        "picture",
        "selfruling",
        "individual",
        "whose",
        "perfection",
        "valuable",
        "apart",
        "happiness",
        "pleasure",
        "might",
        "bring",
        "stirnerian",
        "egoist",
        "must",
        "avoid",
        "submission",
        "external",
        "power",
        "must",
        "also",
        "cultivate",
        "kind",
        "emotional",
        "detachment",
        "towards",
        "thought",
        "feeling",
        "ensuring",
        "latter",
        "subjugate",
        "egoist",
        "make",
        "egoist",
        "instrument",
        "realisation",
        "short",
        "suggestion",
        "antiessentialist",
        "perfectionism",
        "survives",
        "ideal",
        "character",
        "stirner",
        "celebration",
        "unman",
        "egoist",
        "leopold"
    ]
}