{
    "main_text": "Sociality, Emergence, and The Philosophy of the Present\n5. Sociality, Emergence, and The Philosophy of the Present\n\nWe have seen that the “I” introduces novelty in actions\nand in the interactions between human beings. For Mead, novelty is not\na phenomenon that can be accounted for in terms of human ignorance, as\nit can for a determinist such as Spinoza. In the Spinozistic\nframework, even though everything in nature is determined, as finite\nmodes we must remain ignorant of the totality of causes. In principle,\nhowever, an infinite Mind could predict every event. Mead, following\nin the footsteps of Darwin, argues that novelty is in fact an aspect\nof the natural world, and that there are events that are not only\nunpredictable due to ignorance, but are in principle impossible to\npredict. In the latter category, for example, we find mutations that\nhelp to give rise to new species, as well as the creative responses of\nbaseball players, musicians, composers, dancers, scientists, etc.\n\nIn The Philosophy of the Present—a compilation based on\nthe Carus Lectures delivered in late 1930 in Berkeley—Mead\noutlines his thoughts on nature and time. Mead did not have the\nopportunity to develop his ideas into a book. (He passed away early in\n1931.) In spite of the fact that these lectures were hurriedly written\ndue to obligations that he had as chair of the University of\nChicago’s philosophy department, they contain ideas that\nilluminate his earlier work and indicate the direction of his thought.\nOn the first page of the lectures we are told that “reality\nexists in a present” and that we do not live in a Parmenidean\ncosmos (PP, 1). “For a Parmenidean reality does not exist.\nExistence involves non-existence: it does take place. The world is a\nworld of events” (PP, 1). Our world is one in which change is\nreal and not merely a subjective, perceptual, phenomenon.\n\nIt seems to me that the extreme mathematization of recent science in\nwhich the reality of motion is reduced to equations in which change\ndisappears in an identity, and in which space and time disappear in a\nfour dimensional continuum of indistinguishable events which is\nneither space nor time is a reflection of the treatment of time as\npassage without becoming. (PP, 19)\n\n\nThe universe doesn’t just spin its wheels and offer motion\nwithout real novelty. Part of the impetus behind The Philosophy of\nthe Present was to argue against an interpretation of space-time,\nsuch as Hermann Minkowski’s, which eliminates the truly novel or\nthe emergent. Emergence involves not only biological organisms, but\nmatter and energy; for example, there is a sense in which water can be\nspoken of as emerging from the combination of hydrogen and\n oxygen.[1]\n Nevertheless, biological examples appear best suited to Mead’s\napproach. It’s worth noting at this juncture that Mead had\nalways been keenly interested in science and the scientific method.\nHowever, as a pragmatist, the test of a scientific hypothesis for him\nis whether it can illuminate the world that is there. He\ncertainly was never a positivist.\n\nAs mentioned, Mead is a systemic thinker who speaks of taking the\nperspectives of others and of generalized others. These perspectives\nare not “subjective” for Mead. They are\n“objective” in the sense that they provide frames of\nreference and shared patterns of behavior for members of communities.\n(This is not to say that every human community has an equally viable\naccount of the natural world. This is in part why we have science for\nMead.) However, it is not only human perspectives that are objective\nfor Mead. While it is true that only human beings share perspectives\nin a manner that allows them to be (self) conscious about the\nperspectives of others, there is an objective reality to non-human\nperspectives. How can a non-human perspective be objective? In order\nto answer this question, a few general remarks about Mead’s\nnotion of “perspective” are in order. First, it is\nimportant to note that perspectives are not primarily visual for Mead.\nThey are ways of speaking about how organisms act and interact in\nenvironments. In the words of David Miller,\n\nAccording to Mead, every perspective is a consequence of an active,\nselecting organism, and no perspective can be built up out of visual\nexperiences alone or out of experiences of the so-called secondary\nqualities. A perspective arises out of a relation of an active,\nselective, percipient event and its environment. It determines the\norder of things in the environment that are selected, and it is in\nnature…. We make distinctions among objects in our environment,\nfinally, through, contact. (Miller 1973, 213)\n\n\nMead has been referred to as a tactile philosopher, as opposed to a\nvisual one, because of the importance of contact experience in his\nthought. Perspectives involve contact and interaction between\norganisms and their environments. For example, a fish living in a\ncertain pond can be thought of as inhabiting an ecosystem. The way in\nwhich it navigates the pond, finds food to eat, captures its food,\netc., can be spoken of as the fish’s perspective on the pond,\nand it is objective, that is, its interactions are not a matter of the\nsubjective perceptions of the fish. Its interactions in its\nenvironment shape and give form to its perspective, which is different\nfrom the snail’s perspective, although it lives in the same\nwaters. In other words, organisms stratify environments in different\nways as they seek to meet their needs (Miller 1973, 207–217).\nThe pond, in fact, is not one system but many systems in the sense\nthat its inhabitants engage in different, interlaced interactions, and\ntherefore have different objective perspectives. The fish, of course,\ndoes not comprehend its perspective or localized environment as a\nsystem, but this doesn’t make its perspective subjective. Human\nbeings, given our capacity to discuss systems in language, can\ndescribe the ecology of a pond (or better, the ecologies of a pond\ndepending on what organisms we are studying). We can describe, with\nvarying degrees of accuracy, what it is like to be a fish living in a\nparticular pond, as opposed to a snail. Through study we learn about\nthe perspectives of other creatures, although we cannot share them as\nwe can the perspectives of the language bearing members of our own\nspecies.\n\nFor Mead, as noted, systems are not static. This is especially evident\nin the biological world. New forms of life arise, and some of them are\ndue to the efforts of human beings, for example, the botanists who\ncreate hybrids. Mead argues that if a new form of life emerges from\nanother form, then there is a time when the new organism has not fully\ndeveloped, and therefore has not yet modified its environmental niche.\nIn this situation the older order, the old environment, has not\ndisappeared but neither has the new one been born. Mead refers to this\nstate of betwixt and between as sociality.\n\nWhen the new form has established its citizenship the botanist can\nexhibit the mutual adjustments that have taken place. The world has\nbecome a different world because of the advent, but to identify\nsociality with this result is to identify it with system merely. It is\nrather the stage betwixt and between the old system and the new one\nthat I am referring to. If emergence is a feature of reality this\nphase of adjustment, which comes between the ordered universe before\nthe emergent has arisen and that after it has come to terms with the\nnewcomer, must be a feature also of reality. (PP, 47)\n\n\nSociality is a key idea for Mead and it has implications for his\nsociology and social psychology. If we think of the “Me”\nas a system, then there are times when the “I” initiates\nnew responses that may or may not be integrated into an existing\n“Me.” But if they come to be integrated, then there is a\ntime betwixt and between the old and new “Me” system. What\nmakes this all the more interesting is that human beings have a\ncapacity for reflection. We can become aware of changes that are\ntaking place as we “stand” betwixt and between, which\nallows for the possibility of influencing the development of a future\nself. We can even set up conditions to promote changes that we believe\nmay transform us in certain ways. Or to put this in another light, new\nproblems are bound to arise in the world, and because of our capacity\nfor sociality, we can get some purchase on the courses of action\navailable to us as we reflect on the novel problems confronting us. Of\ncourse, because the problems are novel means that we do not have ready\nsolutions. However, the capacity to stand betwixt and between old and\n(possible) new orders, as we do between old and new social roles,\nprovides us with some opportunity for anticipating alternatives and\nintegrating new responses. As a matter of fact, Mead links moral\ndevelopment with our capacity for moving beyond old values, old\nselves, in order to integrate new values into our personalities when\nnew situations call for them.\n\nTo leave the field to the values represented by the old self is\nexactly what we term selfishness. The justification for the term is\nfound in the habitual character of conduct with reference to these\nvalues.…Where, however, the problem is objectively considered,\nalthough the conflict is a social one, it should not resolve itself\ninto a struggle between selves, but into such reconstruction of the\nsituation that different and enlarged and more adequate\npersonalities may emerge. (SS in SW, 148) [emphasis added]\n\n\nIt’s worth noting here that Mead did not develop an ethics, at\nleast not one that was systematically presented. But his position\nbears a kinship to theorists of moral sentiment, if we understand\n“the taking the perspectives of others” as a more\nsophisticated statement of sympathetic attachments. It is important to\nemphasize that for pragmatic reasons Mead does not think that the idea\nof compassion is sufficient for grounding an ethics. He argues for a\nnotion of obligation that is tied to transforming social conditions\nthat generate pain and\n suffering.[2]\n\nReturning to Mead’s notion of sociality, we can see that he is\nseeking to emphasize transitions and change between systems. This\nemphasis on change has repercussions for his view of the present,\nwhich is not to be understood as a knife-edge present. In human\nexperience, the present arises from a past and spreads into the\nfuture. In a manner reminiscent of James’s account of the stream\nof thought, Mead argues that the present entails duration (James 1890,\n237–283). It retains the receding past and anticipates the\nimminent future. Yet because reality ultimately exists in the present,\nMead argues that the historical past, insofar as it is capable of\nbeing experienced, is transformed by novel events. History is not\nwritten on an unchanging scroll. Novelty gives lie to this way of\nseeing the past. By virtue of its originality, the novel event, the\nemergent, can not be explained or understood in terms of prior\ninterpretations of the past. The past, which by definition can only\nexist in the present, changes to accommodate novel events.\n\nIt is idle, at least for the purposes of experience, to have recourse\nto a “real” past within which we are making constant\ndiscoveries; for that past must be set over against a present within\nwhich the emergent appears, and the past, which must then be looked at\nfrom the standpoint of the emergent, becomes a different past. The\nemergent when it appears is always found to follow from the past, but\nbefore it appears it does not, by definition, follow from the past.\n(PP, 2)\n\n",
    "section_title": "5. Sociality, Emergence, and The Philosophy of the Present",
    "entry_title": "George Herbert Mead",
    "hierarchy_title": "George Herbert Mead || Sociality, Emergence, and The Philosophy of the Present",
    "tokenized_text": [
        "sociality",
        "emergence",
        "philosophy",
        "present",
        "sociality",
        "emergence",
        "philosophy",
        "present",
        "seen",
        "introduces",
        "novelty",
        "action",
        "interaction",
        "human",
        "being",
        "mead",
        "novelty",
        "phenomenon",
        "accounted",
        "term",
        "human",
        "ignorance",
        "determinist",
        "spinoza",
        "spinozistic",
        "framework",
        "even",
        "though",
        "everything",
        "nature",
        "determined",
        "finite",
        "mode",
        "must",
        "remain",
        "ignorant",
        "totality",
        "cause",
        "principle",
        "however",
        "infinite",
        "mind",
        "could",
        "predict",
        "every",
        "event",
        "mead",
        "following",
        "footstep",
        "darwin",
        "argues",
        "novelty",
        "fact",
        "aspect",
        "natural",
        "world",
        "event",
        "unpredictable",
        "due",
        "ignorance",
        "principle",
        "impossible",
        "predict",
        "latter",
        "category",
        "example",
        "find",
        "mutation",
        "help",
        "give",
        "rise",
        "new",
        "specie",
        "well",
        "creative",
        "response",
        "baseball",
        "player",
        "musician",
        "composer",
        "dancer",
        "scientist",
        "etc",
        "philosophy",
        "presenta",
        "compilation",
        "based",
        "carus",
        "lecture",
        "delivered",
        "late",
        "berkeleymead",
        "outline",
        "thought",
        "nature",
        "time",
        "mead",
        "opportunity",
        "develop",
        "idea",
        "book",
        "passed",
        "away",
        "early",
        "spite",
        "fact",
        "lecture",
        "hurriedly",
        "written",
        "due",
        "obligation",
        "chair",
        "university",
        "chicago",
        "philosophy",
        "department",
        "contain",
        "idea",
        "illuminate",
        "earlier",
        "work",
        "indicate",
        "direction",
        "thought",
        "first",
        "page",
        "lecture",
        "told",
        "reality",
        "exists",
        "present",
        "live",
        "parmenidean",
        "cosmos",
        "pp",
        "parmenidean",
        "reality",
        "exist",
        "existence",
        "involves",
        "nonexistence",
        "take",
        "place",
        "world",
        "world",
        "event",
        "pp",
        "world",
        "one",
        "change",
        "real",
        "merely",
        "subjective",
        "perceptual",
        "phenomenon",
        "seems",
        "extreme",
        "mathematization",
        "recent",
        "science",
        "reality",
        "motion",
        "reduced",
        "equation",
        "change",
        "disappears",
        "identity",
        "space",
        "time",
        "disappear",
        "four",
        "dimensional",
        "continuum",
        "indistinguishable",
        "event",
        "neither",
        "space",
        "time",
        "reflection",
        "treatment",
        "time",
        "passage",
        "without",
        "becoming",
        "pp",
        "universe",
        "spin",
        "wheel",
        "offer",
        "motion",
        "without",
        "real",
        "novelty",
        "part",
        "impetus",
        "behind",
        "philosophy",
        "present",
        "argue",
        "interpretation",
        "spacetime",
        "hermann",
        "minkowski",
        "eliminates",
        "truly",
        "novel",
        "emergent",
        "emergence",
        "involves",
        "biological",
        "organism",
        "matter",
        "energy",
        "example",
        "sense",
        "water",
        "spoken",
        "emerging",
        "combination",
        "hydrogen",
        "oxygen",
        "nevertheless",
        "biological",
        "example",
        "appear",
        "best",
        "suited",
        "mead",
        "approach",
        "worth",
        "noting",
        "juncture",
        "mead",
        "always",
        "keenly",
        "interested",
        "science",
        "scientific",
        "method",
        "however",
        "pragmatist",
        "test",
        "scientific",
        "hypothesis",
        "whether",
        "illuminate",
        "world",
        "certainly",
        "never",
        "positivist",
        "mentioned",
        "mead",
        "systemic",
        "thinker",
        "speaks",
        "taking",
        "perspective",
        "others",
        "generalized",
        "others",
        "perspective",
        "subjective",
        "mead",
        "objective",
        "sense",
        "provide",
        "frame",
        "reference",
        "shared",
        "pattern",
        "behavior",
        "member",
        "community",
        "say",
        "every",
        "human",
        "community",
        "equally",
        "viable",
        "account",
        "natural",
        "world",
        "part",
        "science",
        "mead",
        "however",
        "human",
        "perspective",
        "objective",
        "mead",
        "true",
        "human",
        "being",
        "share",
        "perspective",
        "manner",
        "allows",
        "self",
        "conscious",
        "perspective",
        "others",
        "objective",
        "reality",
        "nonhuman",
        "perspective",
        "nonhuman",
        "perspective",
        "objective",
        "order",
        "answer",
        "question",
        "general",
        "remark",
        "mead",
        "notion",
        "perspective",
        "order",
        "first",
        "important",
        "note",
        "perspective",
        "primarily",
        "visual",
        "mead",
        "way",
        "speaking",
        "organism",
        "act",
        "interact",
        "environment",
        "word",
        "david",
        "miller",
        "according",
        "mead",
        "every",
        "perspective",
        "consequence",
        "active",
        "selecting",
        "organism",
        "perspective",
        "built",
        "visual",
        "experience",
        "alone",
        "experience",
        "socalled",
        "secondary",
        "quality",
        "perspective",
        "arises",
        "relation",
        "active",
        "selective",
        "percipient",
        "event",
        "environment",
        "determines",
        "order",
        "thing",
        "environment",
        "selected",
        "nature",
        "make",
        "distinction",
        "among",
        "object",
        "environment",
        "finally",
        "contact",
        "miller",
        "mead",
        "referred",
        "tactile",
        "philosopher",
        "opposed",
        "visual",
        "one",
        "importance",
        "contact",
        "experience",
        "thought",
        "perspective",
        "involve",
        "contact",
        "interaction",
        "organism",
        "environment",
        "example",
        "fish",
        "living",
        "certain",
        "pond",
        "thought",
        "inhabiting",
        "ecosystem",
        "way",
        "navigates",
        "pond",
        "find",
        "food",
        "eat",
        "capture",
        "food",
        "etc",
        "spoken",
        "fish",
        "perspective",
        "pond",
        "objective",
        "interaction",
        "matter",
        "subjective",
        "perception",
        "fish",
        "interaction",
        "environment",
        "shape",
        "give",
        "form",
        "perspective",
        "different",
        "snail",
        "perspective",
        "although",
        "life",
        "water",
        "word",
        "organism",
        "stratify",
        "environment",
        "different",
        "way",
        "seek",
        "meet",
        "need",
        "miller",
        "pond",
        "fact",
        "one",
        "system",
        "many",
        "system",
        "sense",
        "inhabitant",
        "engage",
        "different",
        "interlaced",
        "interaction",
        "therefore",
        "different",
        "objective",
        "perspective",
        "fish",
        "course",
        "comprehend",
        "perspective",
        "localized",
        "environment",
        "system",
        "make",
        "perspective",
        "subjective",
        "human",
        "being",
        "given",
        "capacity",
        "discus",
        "system",
        "language",
        "describe",
        "ecology",
        "pond",
        "better",
        "ecology",
        "pond",
        "depending",
        "organism",
        "studying",
        "describe",
        "varying",
        "degree",
        "accuracy",
        "like",
        "fish",
        "living",
        "particular",
        "pond",
        "opposed",
        "snail",
        "study",
        "learn",
        "perspective",
        "creature",
        "although",
        "share",
        "perspective",
        "language",
        "bearing",
        "member",
        "specie",
        "mead",
        "noted",
        "system",
        "static",
        "especially",
        "evident",
        "biological",
        "world",
        "new",
        "form",
        "life",
        "arise",
        "due",
        "effort",
        "human",
        "being",
        "example",
        "botanist",
        "create",
        "hybrid",
        "mead",
        "argues",
        "new",
        "form",
        "life",
        "emerges",
        "another",
        "form",
        "time",
        "new",
        "organism",
        "fully",
        "developed",
        "therefore",
        "yet",
        "modified",
        "environmental",
        "niche",
        "situation",
        "older",
        "order",
        "old",
        "environment",
        "disappeared",
        "neither",
        "new",
        "one",
        "born",
        "mead",
        "refers",
        "state",
        "betwixt",
        "sociality",
        "new",
        "form",
        "established",
        "citizenship",
        "botanist",
        "exhibit",
        "mutual",
        "adjustment",
        "taken",
        "place",
        "world",
        "become",
        "different",
        "world",
        "advent",
        "identify",
        "sociality",
        "result",
        "identify",
        "system",
        "merely",
        "rather",
        "stage",
        "betwixt",
        "old",
        "system",
        "new",
        "one",
        "referring",
        "emergence",
        "feature",
        "reality",
        "phase",
        "adjustment",
        "come",
        "ordered",
        "universe",
        "emergent",
        "arisen",
        "come",
        "term",
        "newcomer",
        "must",
        "feature",
        "also",
        "reality",
        "pp",
        "sociality",
        "key",
        "idea",
        "mead",
        "implication",
        "sociology",
        "social",
        "psychology",
        "think",
        "system",
        "time",
        "initiate",
        "new",
        "response",
        "may",
        "may",
        "integrated",
        "existing",
        "me",
        "come",
        "integrated",
        "time",
        "betwixt",
        "old",
        "new",
        "system",
        "make",
        "interesting",
        "human",
        "being",
        "capacity",
        "reflection",
        "become",
        "aware",
        "change",
        "taking",
        "place",
        "stand",
        "betwixt",
        "allows",
        "possibility",
        "influencing",
        "development",
        "future",
        "self",
        "even",
        "set",
        "condition",
        "promote",
        "change",
        "believe",
        "may",
        "transform",
        "u",
        "certain",
        "way",
        "put",
        "another",
        "light",
        "new",
        "problem",
        "bound",
        "arise",
        "world",
        "capacity",
        "sociality",
        "get",
        "purchase",
        "course",
        "action",
        "available",
        "u",
        "reflect",
        "novel",
        "problem",
        "confronting",
        "u",
        "course",
        "problem",
        "novel",
        "mean",
        "ready",
        "solution",
        "however",
        "capacity",
        "stand",
        "betwixt",
        "old",
        "possible",
        "new",
        "order",
        "old",
        "new",
        "social",
        "role",
        "provides",
        "u",
        "opportunity",
        "anticipating",
        "alternative",
        "integrating",
        "new",
        "response",
        "matter",
        "fact",
        "mead",
        "link",
        "moral",
        "development",
        "capacity",
        "moving",
        "beyond",
        "old",
        "value",
        "old",
        "self",
        "order",
        "integrate",
        "new",
        "value",
        "personality",
        "new",
        "situation",
        "call",
        "leave",
        "field",
        "value",
        "represented",
        "old",
        "self",
        "exactly",
        "term",
        "selfishness",
        "justification",
        "term",
        "found",
        "habitual",
        "character",
        "conduct",
        "reference",
        "valueswhere",
        "however",
        "problem",
        "objectively",
        "considered",
        "although",
        "conflict",
        "social",
        "one",
        "resolve",
        "struggle",
        "self",
        "reconstruction",
        "situation",
        "different",
        "enlarged",
        "adequate",
        "personality",
        "may",
        "emerge",
        "s",
        "sw",
        "emphasis",
        "added",
        "worth",
        "noting",
        "mead",
        "develop",
        "ethic",
        "least",
        "one",
        "systematically",
        "presented",
        "position",
        "bear",
        "kinship",
        "theorist",
        "moral",
        "sentiment",
        "understand",
        "taking",
        "perspective",
        "others",
        "sophisticated",
        "statement",
        "sympathetic",
        "attachment",
        "important",
        "emphasize",
        "pragmatic",
        "reason",
        "mead",
        "think",
        "idea",
        "compassion",
        "sufficient",
        "grounding",
        "ethic",
        "argues",
        "notion",
        "obligation",
        "tied",
        "transforming",
        "social",
        "condition",
        "generate",
        "pain",
        "suffering",
        "returning",
        "mead",
        "notion",
        "sociality",
        "see",
        "seeking",
        "emphasize",
        "transition",
        "change",
        "system",
        "emphasis",
        "change",
        "repercussion",
        "view",
        "present",
        "understood",
        "knifeedge",
        "present",
        "human",
        "experience",
        "present",
        "arises",
        "past",
        "spread",
        "future",
        "manner",
        "reminiscent",
        "james",
        "account",
        "stream",
        "thought",
        "mead",
        "argues",
        "present",
        "entail",
        "duration",
        "james",
        "retains",
        "receding",
        "past",
        "anticipates",
        "imminent",
        "future",
        "yet",
        "reality",
        "ultimately",
        "exists",
        "present",
        "mead",
        "argues",
        "historical",
        "past",
        "insofar",
        "capable",
        "experienced",
        "transformed",
        "novel",
        "event",
        "history",
        "written",
        "unchanging",
        "scroll",
        "novelty",
        "give",
        "lie",
        "way",
        "seeing",
        "past",
        "virtue",
        "originality",
        "novel",
        "event",
        "emergent",
        "explained",
        "understood",
        "term",
        "prior",
        "interpretation",
        "past",
        "past",
        "definition",
        "exist",
        "present",
        "change",
        "accommodate",
        "novel",
        "event",
        "idle",
        "least",
        "purpose",
        "experience",
        "recourse",
        "real",
        "past",
        "within",
        "making",
        "constant",
        "discovery",
        "past",
        "must",
        "set",
        "present",
        "within",
        "emergent",
        "appears",
        "past",
        "must",
        "looked",
        "standpoint",
        "emergent",
        "becomes",
        "different",
        "past",
        "emergent",
        "appears",
        "always",
        "found",
        "follow",
        "past",
        "appears",
        "definition",
        "follow",
        "past",
        "pp"
    ]
}