{
    "main_text": "Albert the Great, Bonaventure and Thomas Aquinas\n5. John Duns Scotus and Late Medieval Discussions\n\nJohn Duns Scotus regarded the taxonomies based on the notion of\narduousness as artificial and criticized the influential Avicennian\nidea that there are “intentions” in things which can be\ngrasped by an estimative power and then move the motive power. He\nargued that representations of a certain kind cause learned or\ninstinctual behavioral changes in some animals and others in others,\nthis being a matter of law-like fact. A sheep naturally flees from a\nwolf which it perceives, not its inner hostility recognized by the\ninner sense as in Avicenna; it even flees from a peaceful sheep which\nlooks like a wolf (Ordinatio I.3.1.1–2, p. 43–44;\nIII.15, 42–43, p. 495–496; III.34, 35–38, p.\n193–196; cf. Perler 2012). The influential part of\nScotus’s approach to emotions was his systematic discussion of\nthe Franciscan position of postulating the passions of the will, which\nappears in the discussion of the emotions of Christ. This was also\nwhere Scotus developed his theory of emotions. According to Scotus,\nwhen one is aware of the actuality of what was desired or its\ncontrary, “there follows a passion of the will, joy or distress,\nwhich is caused by the object present in this way”. These\npassions are not directly caused by free will (Ordinatio\nIII.15, 48, p. 498). Even though joy or distress are acts of the will\nin the sense of being actual states of the intellectual moving power,\nthey are passions in the sense of having an external efficient cause\nand not being free acts of the will. This corresponds to the\ntraditional view of emotions as passive reactions. \n\nScotus’s longer list of the factors which are sufficient to\ncause distress as a passion of the will involves the apprehension that\nwhat takes place is (1) what one actually wills against, (2) against\nthe natural inclination to happiness (affectio commodi) even\nthough no particular act of will is actual, (3) against sensory\ndesire, and (4) in accordance to what is reluctantly willed in\ncircumstances in which the opposite is preferred but cannot be\nachieved (velleitas). There are corresponding factors which\nare sufficient to cause pleasure, the other passion of the will\n(Ordinatio III.15, 60, p. 505). The intellectual soul is\nconsequently regarded as very emotional—its feelings are changed\nby the influence of actual volitions or nolitions as well as by the\ninclinations of the will and the sensory part of the soul. Since these\nstates considerably influence people’s activities as motivations\nor hindrances, moral education should give strength to the natural\ninclination to justice (affectio iustitiae) and good moral\nhabits. New habits of will change the condition for feeling pleasure\nand distress (cf. Boulnois 2003; Knuuttila 2012; Drummond 2012).\nScotus treated liking and dislike (complacentia and\ndisplicentia), the unpremeditated first orientations of the\nwill as analogous to sensory emotional reactions except that they were\nfree acts. These not yet efficacious acts could be directly\ncontrolled, as distinct from the passions of the will. John Buridan,\nwho otherwise followed Scotus’s analysis, stated that liking and\ndislike were not free acts and in this respect were similar to sensory\nemotions (Quaestiones super decem libros Ethicorum, X.2; Zupko 1995).\nBuridan’s revision increased the number of non-free emotional\nphenomena of the will, but the tendency to apply emotion terminology\nto the will took other forms as well. Ockham followed Scotus’s\nview of pleasure and distress as the passions of the will, though he\nrestricted their conditions to the first and fourth case in\nScotus’s list. But he also explained that “a passion is a\nform distinct from a cognition, which exists in the appetitive power\nas its subject and requires a cognition for its existence”\n(Quodlibet II.17, p. 186).\n\nIf this was a considered view, it made all occurrent volitions\npassions, whether free or not (see Hirvonen 2004; Perler 2017). Is\nOckham speaking about passions or “pseudopassions”? King\n(2012) and Miner (2009) use this term in discussing Aquinas’s\nremarks on volitions as dispassionate passions. Since Ockham often\nemployed Scotus’s account of pleasure and distress as the\npassions of the will, it is possible that his definition of passion\nwas somewhat sketchy and not meant to introduce a new semantics for\nthe term “passion” after all. However, Adam Wodeham, his\nyounger colleague and collaborator, argues that volitions and\nnolitions are evaluative cognitions to which all human passions can be\nreduced because of the unity of the soul. An occurrent volition or\nnolition has a cognition as a partial cause to which the evaluation\npertains. This cognitive account of emotions shows some similarities\nwith the Stoic theory, but there seems to be no historical connection\nto it (Lectura secunda, prol. q. 1, secs. 2, 5–6; d. 1,\nq. 5, secs. 4–5, 11; cf. Knuuttila 2004: 275–282; a\ndifferent interpretation in Pickavé 2012). \n\nMany theologians criticized the postulation of the real distinction\nbetween love and pleasure in beatific vision (fruitio) by\nScotus and Ockham, who argued for this position because love is a free\nact of the will, but pleasure is not. The opposite view was\nparticularly stressed by Peter Auriol who held that all intellectual\npleasures are free acts of the will and love and pleasure are\nindistinguishable in the fulfilment of beatific vision. Auriol was\nfollowed by Wodeham and Walter Chatton with respect to the fruition,\nbut not with finite objects. Scotus and Ockham offered various\nexamples for the distinction between the fulfilment of love and the\nexperience of pleasure, one of these being the successful action of\nthe evil angel without pleasure (see Kitanov 2014).\n\nWhen the notions of “liking” and “dislike”\nwere moved from the context of sensory experience to that of the will\nin Scotus, Ockham, and others, they continued to refer to subjectively\naccessible first-person matters. Their being free acts of a person\nprevented Scotus from calling them emotions (passions), but some\nothers such as Ockham and Peter Auriol did not stress this difference.\nIn fact, they were treated as some kind of quasi-emotions even in\nScotus. Because free will was the center of personality in voluntarist\ntheory, attending to its non-efficacious likings and dislike was an\naspect of morally relevant self-awareness; one should not merely\ncontrol the intentions to act but also non-efficacious likings and\ndislikes in general. These were directly voluntary and the passions of\nthe will were indirectly so; both had a motivational role in moral\nbehavior. (See the discussion of wrong pleasure in Ordinatio\nII.42 and the evaluation of the history of the text in Barnwell 2010;\nCross 2014).\n\nScotus and Ockham did not regard the occurrent love necessarily known\nto the subject, but they thought that it was known to those who willed\nto recognize it by a separate introspective act. Ockham writes that\nwhen someone loves an object, it is not required that this person\nknows that he or she loves it. However, when a person wills\none’s own act to be known, immediately this act of knowing\noccurs, namely one by which the act of loving is known. Some others\nsuch as Walter Chatton thought that an awareness of an intentional act\nwas embedded in the act. (See Brower-Toland 2012.)\n\nLate medieval philosophical compendia on emotions include Peter of\nAilly’s influential Tractatus de anima (c. 1380), which\neclectically employs the views of the anonymous thirteenth-century\ncompilation of the views of Albert the Great, Summa\nnaturalium, and Gregory of Rimini’s brief remarks on the\ntheories of Scotus, Ockham, Auriol, and Wodeham on the passions of the\nwill and the relationship between love and pleasure. Ailly’s\nwork was one of the sources for introductions used in psychology\nteaching at the universities such as the Erfurtian treatises by John\nof Lutrea and Bartholomeus Arnoldi of Usingen in the late fifteenth-\nand early sixteenth-centuries (Kärkkäinen, 2009). Usingen\napplied the Buridanian version of the psychology of \ncomplacentia and displicentia and regarded them as\nnon-accountable first movements (Saarinen 2011: 106–107). John\nGerson’s treatises on emotions included long lists of passions\nclassified under the eleven types of Aquinas’s taxonomy\n(Oeuvres IX, 1–25, 155–61).\n\nMedieval theories of emotions were also discussed in many influential\nsixteenth-century scholastic works such as Gabriel Biel’s\nCollectorium on Peter Lombard’s Sentences and\nthe commentaries on Aquinas’s Summa theologiae by\nCardinal Cajetan, Bartholomé de Medina, and Francisco\nSuárez, often comparing the theories of Scotus and Aquinas.\nJohn of la Rochelle’s taxonomy of emotions was also known\nthrough a paraphrase in Gregor Reisch’s popular early\nsixteenth-century encyclopedia Margarita philosophica\n(12.4–5). Among the most discussed medieval theories in early\nmodern thought were Aquinas’s taxonomy on emotions and\nScotus’s theory of the passions of the will, both commented on\nby Suárez (King 2002; Knuuttila 2012).\n",
    "section_title": "5. John Duns Scotus and Late Medieval Discussions",
    "entry_title": "Medieval Theories of the Emotions",
    "hierarchy_title": "Medieval Theories of the Emotions || Albert the Great, Bonaventure and Thomas Aquinas",
    "tokenized_text": [
        "albert",
        "great",
        "bonaventure",
        "thomas",
        "aquinas",
        "john",
        "dun",
        "scotus",
        "late",
        "medieval",
        "discussion",
        "john",
        "dun",
        "scotus",
        "regarded",
        "taxonomy",
        "based",
        "notion",
        "arduousness",
        "artificial",
        "criticized",
        "influential",
        "avicennian",
        "idea",
        "intention",
        "thing",
        "grasped",
        "estimative",
        "power",
        "move",
        "motive",
        "power",
        "argued",
        "representation",
        "certain",
        "kind",
        "cause",
        "learned",
        "instinctual",
        "behavioral",
        "change",
        "animal",
        "others",
        "others",
        "matter",
        "lawlike",
        "fact",
        "sheep",
        "naturally",
        "flees",
        "wolf",
        "perceives",
        "inner",
        "hostility",
        "recognized",
        "inner",
        "sense",
        "avicenna",
        "even",
        "flees",
        "peaceful",
        "sheep",
        "look",
        "like",
        "wolf",
        "ordinatio",
        "i",
        "p",
        "iii",
        "p",
        "iii",
        "p",
        "cf",
        "perler",
        "influential",
        "part",
        "scotus",
        "approach",
        "emotion",
        "systematic",
        "discussion",
        "franciscan",
        "position",
        "postulating",
        "passion",
        "appears",
        "discussion",
        "emotion",
        "christ",
        "also",
        "scotus",
        "developed",
        "theory",
        "emotion",
        "according",
        "scotus",
        "one",
        "aware",
        "actuality",
        "desired",
        "contrary",
        "follows",
        "passion",
        "joy",
        "distress",
        "caused",
        "object",
        "present",
        "way",
        "passion",
        "directly",
        "caused",
        "free",
        "ordinatio",
        "iii",
        "p",
        "even",
        "though",
        "joy",
        "distress",
        "act",
        "sense",
        "actual",
        "state",
        "intellectual",
        "moving",
        "power",
        "passion",
        "sense",
        "external",
        "efficient",
        "cause",
        "free",
        "act",
        "corresponds",
        "traditional",
        "view",
        "emotion",
        "passive",
        "reaction",
        "scotus",
        "longer",
        "list",
        "factor",
        "sufficient",
        "cause",
        "distress",
        "passion",
        "involves",
        "apprehension",
        "take",
        "place",
        "one",
        "actually",
        "will",
        "natural",
        "inclination",
        "happiness",
        "affectio",
        "commodi",
        "even",
        "though",
        "particular",
        "act",
        "actual",
        "sensory",
        "desire",
        "accordance",
        "reluctantly",
        "willed",
        "circumstance",
        "opposite",
        "preferred",
        "achieved",
        "velleitas",
        "corresponding",
        "factor",
        "sufficient",
        "cause",
        "pleasure",
        "passion",
        "ordinatio",
        "iii",
        "p",
        "intellectual",
        "soul",
        "consequently",
        "regarded",
        "emotionalits",
        "feeling",
        "changed",
        "influence",
        "actual",
        "volition",
        "nolitions",
        "well",
        "inclination",
        "sensory",
        "part",
        "soul",
        "since",
        "state",
        "considerably",
        "influence",
        "people",
        "activity",
        "motivation",
        "hindrance",
        "moral",
        "education",
        "give",
        "strength",
        "natural",
        "inclination",
        "justice",
        "affectio",
        "iustitiae",
        "good",
        "moral",
        "habit",
        "new",
        "habit",
        "change",
        "condition",
        "feeling",
        "pleasure",
        "distress",
        "cf",
        "boulnois",
        "knuuttila",
        "drummond",
        "scotus",
        "treated",
        "liking",
        "dislike",
        "complacentia",
        "displicentia",
        "unpremeditated",
        "first",
        "orientation",
        "analogous",
        "sensory",
        "emotional",
        "reaction",
        "except",
        "free",
        "act",
        "yet",
        "efficacious",
        "act",
        "could",
        "directly",
        "controlled",
        "distinct",
        "passion",
        "john",
        "buridan",
        "otherwise",
        "followed",
        "scotus",
        "analysis",
        "stated",
        "liking",
        "dislike",
        "free",
        "act",
        "respect",
        "similar",
        "sensory",
        "emotion",
        "quaestiones",
        "super",
        "decem",
        "libros",
        "ethicorum",
        "x",
        "zupko",
        "buridan",
        "revision",
        "increased",
        "number",
        "nonfree",
        "emotional",
        "phenomenon",
        "tendency",
        "apply",
        "emotion",
        "terminology",
        "took",
        "form",
        "well",
        "ockham",
        "followed",
        "scotus",
        "view",
        "pleasure",
        "distress",
        "passion",
        "though",
        "restricted",
        "condition",
        "first",
        "fourth",
        "case",
        "scotus",
        "list",
        "also",
        "explained",
        "passion",
        "form",
        "distinct",
        "cognition",
        "exists",
        "appetitive",
        "power",
        "subject",
        "requires",
        "cognition",
        "existence",
        "quodlibet",
        "ii",
        "p",
        "considered",
        "view",
        "made",
        "occurrent",
        "volition",
        "passion",
        "whether",
        "free",
        "see",
        "hirvonen",
        "perler",
        "ockham",
        "speaking",
        "passion",
        "pseudopassions",
        "king",
        "miner",
        "use",
        "term",
        "discussing",
        "aquinas",
        "remark",
        "volition",
        "dispassionate",
        "passion",
        "since",
        "ockham",
        "often",
        "employed",
        "scotus",
        "account",
        "pleasure",
        "distress",
        "passion",
        "possible",
        "definition",
        "passion",
        "somewhat",
        "sketchy",
        "meant",
        "introduce",
        "new",
        "semantics",
        "term",
        "passion",
        "however",
        "adam",
        "wodeham",
        "younger",
        "colleague",
        "collaborator",
        "argues",
        "volition",
        "nolitions",
        "evaluative",
        "cognition",
        "human",
        "passion",
        "reduced",
        "unity",
        "soul",
        "occurrent",
        "volition",
        "nolition",
        "cognition",
        "partial",
        "cause",
        "evaluation",
        "pertains",
        "cognitive",
        "account",
        "emotion",
        "show",
        "similarity",
        "stoic",
        "theory",
        "seems",
        "historical",
        "connection",
        "lectura",
        "secunda",
        "prol",
        "q",
        "sec",
        "d",
        "q",
        "sec",
        "cf",
        "knuuttila",
        "different",
        "interpretation",
        "pickavé",
        "many",
        "theologian",
        "criticized",
        "postulation",
        "real",
        "distinction",
        "love",
        "pleasure",
        "beatific",
        "vision",
        "fruitio",
        "scotus",
        "ockham",
        "argued",
        "position",
        "love",
        "free",
        "act",
        "pleasure",
        "opposite",
        "view",
        "particularly",
        "stressed",
        "peter",
        "auriol",
        "held",
        "intellectual",
        "pleasure",
        "free",
        "act",
        "love",
        "pleasure",
        "indistinguishable",
        "fulfilment",
        "beatific",
        "vision",
        "auriol",
        "followed",
        "wodeham",
        "walter",
        "chatton",
        "respect",
        "fruition",
        "finite",
        "object",
        "scotus",
        "ockham",
        "offered",
        "various",
        "example",
        "distinction",
        "fulfilment",
        "love",
        "experience",
        "pleasure",
        "one",
        "successful",
        "action",
        "evil",
        "angel",
        "without",
        "pleasure",
        "see",
        "kitanov",
        "notion",
        "liking",
        "dislike",
        "moved",
        "context",
        "sensory",
        "experience",
        "scotus",
        "ockham",
        "others",
        "continued",
        "refer",
        "subjectively",
        "accessible",
        "firstperson",
        "matter",
        "free",
        "act",
        "person",
        "prevented",
        "scotus",
        "calling",
        "emotion",
        "passion",
        "others",
        "ockham",
        "peter",
        "auriol",
        "stress",
        "difference",
        "fact",
        "treated",
        "kind",
        "quasiemotions",
        "even",
        "scotus",
        "free",
        "center",
        "personality",
        "voluntarist",
        "theory",
        "attending",
        "nonefficacious",
        "liking",
        "dislike",
        "aspect",
        "morally",
        "relevant",
        "selfawareness",
        "one",
        "merely",
        "control",
        "intention",
        "act",
        "also",
        "nonefficacious",
        "liking",
        "dislike",
        "general",
        "directly",
        "voluntary",
        "passion",
        "indirectly",
        "motivational",
        "role",
        "moral",
        "behavior",
        "see",
        "discussion",
        "wrong",
        "pleasure",
        "ordinatio",
        "ii",
        "evaluation",
        "history",
        "text",
        "barnwell",
        "cross",
        "scotus",
        "ockham",
        "regard",
        "occurrent",
        "love",
        "necessarily",
        "known",
        "subject",
        "thought",
        "known",
        "willed",
        "recognize",
        "separate",
        "introspective",
        "act",
        "ockham",
        "writes",
        "someone",
        "love",
        "object",
        "required",
        "person",
        "know",
        "love",
        "however",
        "person",
        "will",
        "one",
        "act",
        "known",
        "immediately",
        "act",
        "knowing",
        "occurs",
        "namely",
        "one",
        "act",
        "loving",
        "known",
        "others",
        "walter",
        "chatton",
        "thought",
        "awareness",
        "intentional",
        "act",
        "embedded",
        "act",
        "see",
        "browertoland",
        "late",
        "medieval",
        "philosophical",
        "compendia",
        "emotion",
        "include",
        "peter",
        "ailly",
        "influential",
        "tractatus",
        "de",
        "anima",
        "c",
        "eclectically",
        "employ",
        "view",
        "anonymous",
        "thirteenthcentury",
        "compilation",
        "view",
        "albert",
        "great",
        "summa",
        "naturalium",
        "gregory",
        "rimini",
        "brief",
        "remark",
        "theory",
        "scotus",
        "ockham",
        "auriol",
        "wodeham",
        "passion",
        "relationship",
        "love",
        "pleasure",
        "ailly",
        "work",
        "one",
        "source",
        "introduction",
        "used",
        "psychology",
        "teaching",
        "university",
        "erfurtian",
        "treatise",
        "john",
        "lutrea",
        "bartholomeus",
        "arnoldi",
        "usingen",
        "late",
        "fifteenth",
        "early",
        "sixteenthcenturies",
        "kärkkäinen",
        "usingen",
        "applied",
        "buridanian",
        "version",
        "psychology",
        "complacentia",
        "displicentia",
        "regarded",
        "nonaccountable",
        "first",
        "movement",
        "saarinen",
        "john",
        "gerson",
        "treatise",
        "emotion",
        "included",
        "long",
        "list",
        "passion",
        "classified",
        "eleven",
        "type",
        "aquinas",
        "taxonomy",
        "oeuvre",
        "ix",
        "medieval",
        "theory",
        "emotion",
        "also",
        "discussed",
        "many",
        "influential",
        "sixteenthcentury",
        "scholastic",
        "work",
        "gabriel",
        "biel",
        "collectorium",
        "peter",
        "lombard",
        "sentence",
        "commentary",
        "aquinas",
        "summa",
        "theologiae",
        "cardinal",
        "cajetan",
        "bartholomé",
        "de",
        "medina",
        "francisco",
        "suárez",
        "often",
        "comparing",
        "theory",
        "scotus",
        "aquinas",
        "john",
        "la",
        "rochelle",
        "taxonomy",
        "emotion",
        "also",
        "known",
        "paraphrase",
        "gregor",
        "reisch",
        "popular",
        "early",
        "sixteenthcentury",
        "encyclopedia",
        "margarita",
        "philosophica",
        "among",
        "discussed",
        "medieval",
        "theory",
        "early",
        "modern",
        "thought",
        "aquinas",
        "taxonomy",
        "emotion",
        "scotus",
        "theory",
        "passion",
        "commented",
        "suárez",
        "king",
        "knuuttila"
    ]
}