{
    "main_text": "Early Medieval Discussions\n2. Early Medieval Discussions\n\nWhile the works of Augustine, Cassian, and Gregory the Great were\namong the main sources of the discussion of emotions in early medieval\nliterature, new non-religious impulses were supplied by the Latin\ntranslations of some philosophical and medical works. One of these was\nthe translation of the Arabic medical encyclopedia of ‘Alī\nibn al-‘Abbās al-Mağūsī (in Latin Haly\nAbbas), which contained various remarks on the emotions based on\nGalen’s medical philosophy. The first partial translation by\nConstantine the African (c. 1080) was called the Pantegni and\nthe complete translation by Stephen of Antioch (1127) the Regalis\ndispositio. Elements of ancient medical and philosophical\ntheories of the emotions were also included in Nemesius of\nEmesa’s De natura hominis (17–21) from the late\nfourth century and John Damascene’s De fide orthodoxa\nfrom the eighth century, the latter being much influenced by\nNemesius’s work. These treatises were translated into Latin in\nthe eleventh and twelfth centuries. An important early medieval\npsychological source-book was the sixth book of Avicenna’s\nShifā’, translated into Latin in the middle of the\ntwelfth century by Gundisalvi and Avendauth. This translation was\ncalled Liber de Anima or Sextus de naturalibus.\nAvicenna’s work influenced the terminology of early commentaries\non Aristotle’s De anima, which became the principal\ntextbook of psychology in the middle of the thirteenth century;\nAristotle’s work was translated c. 1150 by James of\nVenice and 1267 by William of Moerbeke. \n\nDrawing from Aristotelian and Neoplatonic psychology, Avicenna\ndistinguishes between the functions of the soul by attaching them to\nspecial powers or faculties. The most relevant in this connection are\nsensory moving powers and internal senses: common sense, imagery\n(retention of sensations), estimation, memory, and imagination\n(separation and combination of sensory forms). Inner senses are\nnon-perceptual apprehensive powers of the sensory soul (De\nanima IV.1, 1–11; IV.3, 37–40). The moving power of\nthe sensory soul is divided into a commanding power and an executive\npower, the former of which is the center of emotions. The executive\nmoving power operates through the nervous system and the muscles. It\nis moved by the commanding moving power, the acts of which are\ntriggered by an occurrent evaluation of estimative power and\naccompanied by bodily affections as well as behavioral changes,\nprovided that the executive moving power is also actualized. If the\ncommanding act is strong enough, the executive power is necessarily\nactualized in animals, but not so in humans because they can prevent\nthe impulse of the executive moving power by their will. The will is\nthe moving power of the immaterial intellectual soul. Together with\npractical intellect, it should control the emotions (De anima\nI.5, 94; IV.4, 54–56, 59).\n\nThe sensory commanding faculty is divided into concupiscible and\nirascible parts. The reactions of the concupiscible power are desires\nfor things taken to be pleasurable, and the reactions of the irascible\npower are desires to defeat adversaries and repel harmful things\n(De anima I.5, 83; IV.4, 56–57). The objects of\nemotions are recognized as emotionally relevant by the estimative\npower. By this power, the sheep judges that the wolf is to be avoided,\n“even though the exterior sense has not previously perceived\nit”. Avicenna calls the representations of the estimative power\n“intentions”. The recognition of the intentions is often\ninstinctive in animals, but it is mostly conscious and\npre-intellectually conceptual in humans (De anima I.5, 86,\n89; IV.1, 7; IV.3. 37–39; see also Black 2000; Hasse 2000:\n130–141: Perler 2012). As an occurrent emotion involves acts of\nseparate faculties, there must be some kind of governing awareness\nthat combines these acts (De anima V.7, 158–159;\nKitāb al-najāt 2.6.15, trans. Rahman, 64–68);\ncf. Toivanen and Yrjönsuuri 2014: 441–442).\n\nAvicenna’s theory includes all elements of Aristotelian\ncompositional theory, but he uses the behavioral suggestion as the\ncentral factor. For this reason, he does not include pleasure or joy\namong the concupiscible or irascible emotions, regarding them as\naffective apprehensive acts. Somewhat strangely, he adds pain or\ndistress to the irascible motive acts such as fear and anger,\napparently thinking that they are moving acts and not merely\napprehensive (De anima IV.4, 57–59).\n\nWhile there are emotions common to humans and animals, the human\nestimative faculty also operates as a sensory reason, which qualifies its\nrecognizing emotional intentions. Hope and fear with respect to not\nyet actualized future things, shame at wrong action, and wonder at\nunusual things presuppose conceptualization that animals lack. It is\nalso human to express wonder by laughing and anxiety by weeping\n(De anima V.1, 69–76). Avicenna discusses emotions also\nin his Canon of Medicine, translated into Latin by Gerard of\nCremona in the twelfth century. His medical approach to the cardiac\nand spiritual affects shows similarities to that of the\nPantegni. See Knuuttila 2004.\n\nTwelfth-century Latin discussions about accountability were influenced\nby Augustine’s view that sins are acts of free consent. This\nseems to mean that spontaneous emotional reactions are not immediately\nguilty-making because they are not freely chosen (Expositio\nquarundam propositionum ex Epistola ad Romanos, 2066).\nAugustine’s position led to some controversies. Those who argued\nfor sinless first movements, such as Anselm of Canterbury, Peter of\nAbelard, William of Champeaux, or Aelred of Rievaulx, held that\nsomething is a sin only if it is a free choice or consent. The other\ninterpretation held by Anselm of Laon, Peter Lombard, and others was\nthat the first movements towards forbidden things are immediately\nvenial sins even when they are not free. They could be regarded as\nindirectly voluntary because of insufficient precaution (Knuuttila\n2004, Wu 2010).\n\nCentral terms in the influential Augustinian model of sins were\nsuggestion, temptation, first movement, pleasure, and consent.\nAugustine thought that a first movement was accompanied by reflexive\nawareness as soon as one could voluntarily stop it. Without this\nawareness, the soul could not react to first movements with a\nconscious withdrawal. The Augustinian model of inner control was\nrelatively simple and easily understood, which made it popular in\nmedieval and early modern theology of sin. The traditional monastic\nexercise of repelling evil thoughts by redirecting attention was also\nrepeated in philosophical treatises by Descartes and Leibniz. In fact,\nthis seems to be the only device for making oneself free from\noccurring temptations used in Western philosophical and theological\nliterature. (See Descartes, Les passions de\nl’âme, 487–488; Leibniz, Nouveaux Essais\nsur l’entendement humain, 187–189, 195–197.)\n\n\nIn his Ethics (1130s), Peter Abelard contrasted consent and\nwill, suggesting that if one consents to a goal, one also consents to\nthe necessary means, whereas one can will the goal without willing the\nnecessary means to it. Abelard’s terminological point concerning\nthe use of “will” as extended to rational and lower parts\nof the soul did not find many supporters. Most thinkers did not agree\nthat whatever is called “willed” is emotionally liked, but\ntook the “will” to behave like Abelard’s\n“consent”. Separating will and emotions, they argued that\nreluctantly chosen acts can be said to be willed (Knuuttila 2004).\n\nAelred of Rievaulx (1110–1167) and Hugh of St Victor\n(1096–1141) were two monastic authors who discussed\nAugustine’s psychology by attending to the spontaneous affect as\na subjectively felt present movement of the soul. In his book The\nMirror of Charity, Aelred extensively dealt with affect\n(affectus) as an element of love (amor). His\nexamples of affects are mainly attachments to other persons. Following\nAugustine’s remarks on first movements, Aelred explains that\naffects are spontaneous and non-voluntary sweet attractions that\nshould be controlled by the rational power of will (Mirror\n3.16.39). Affects can be characterized as early stages of desiderative\nemotions. The first movements are not sins, but the continuation of\nthe love initiated by affect is voluntarily controllable and\naccountable as in Augustine.\n\nUsing the Augustinian concept of free consent as the kernel of his\nview of a chosen love attitude, Aelred argues that this love may be\nbased on affect, reason, or both. Love arises from affect when the\nhigher part of the soul gives consent to affect, and it arises from\nreason when the will joins itself to a representation of reason; in\nthe third form of love, love, reason, and will are fused into one.\n“The first is pleasant but dangerous; the second is harsh but\nfruitful; the third having the advantages of the other is\nperfect” (Mirror 3.20, 48). He remarks that in loving\nwhat we ought to love, we love more intensely with the sweetness of\naffect than without it.\n\nHugh of St Victor regarded love as the basic emotion and defined it as\nthe pleasure of the heart that is directed to something because of\nsomething (On the Substance of Love 2.48–49). This\nemotion is an actual orientation of the soul to an object with a\nsubjectively felt pleasure. In the same place, Hugh dealt with love as\nthe first stage of the sequence of love, desire, and joy\n(49–51). He thinks that emotions are generated in the heart as\nvarious forms of the sensory moving affect, not the controlling\nintellectual will (De sacramentis 273C). The incipient\npleasant feeling of love about a reachable end, if not expelled,\nincreases in power, and leads to new emotional stages separated from\neach other by typical behavioral changes. It is desire when moving the\nsubject towards an end and joy when reaching the end (On the\nSubstance of Love 2.50–51). The beginnings of emotions are\nnot acts of free choice as their continuances are, but Hugh differed\nfrom Aelred in regarding involuntary sexual movements as venial sins\n(De sacramentis 315C–316A, 391B). \n\nIn their affective psychology, Aelred and Hugh regarded affect as\npleasantly (or unpleasantly) felt awareness of a movement of the lower\nsoul with a behavioral impulse. While this account could be understood\nas an external interpretation of any animal action, it was associated\nwith an Augustinian doctrine of spontaneous movements that should be\ncontrolled and guided by free will as soon as possible. This adds the\nintrospective knowledge of first movements to the analysis, making\naffects a matter of subjective awareness of inner changes, as in\nBernard of Clairvaux.\n",
    "section_title": "2. Early Medieval Discussions",
    "entry_title": "Medieval Theories of the Emotions",
    "hierarchy_title": "Medieval Theories of the Emotions || Early Medieval Discussions",
    "tokenized_text": [
        "early",
        "medieval",
        "discussion",
        "early",
        "medieval",
        "discussion",
        "work",
        "augustine",
        "cassian",
        "gregory",
        "great",
        "among",
        "main",
        "source",
        "discussion",
        "emotion",
        "early",
        "medieval",
        "literature",
        "new",
        "nonreligious",
        "impulse",
        "supplied",
        "latin",
        "translation",
        "philosophical",
        "medical",
        "work",
        "one",
        "translation",
        "arabic",
        "medical",
        "encyclopedia",
        "alī",
        "ibn",
        "al",
        "abbās",
        "almağūsī",
        "latin",
        "haly",
        "abbas",
        "contained",
        "various",
        "remark",
        "emotion",
        "based",
        "galen",
        "medical",
        "philosophy",
        "first",
        "partial",
        "translation",
        "constantine",
        "african",
        "c",
        "called",
        "pantegni",
        "complete",
        "translation",
        "stephen",
        "antioch",
        "regalis",
        "dispositio",
        "element",
        "ancient",
        "medical",
        "philosophical",
        "theory",
        "emotion",
        "also",
        "included",
        "nemesius",
        "emesa",
        "de",
        "natura",
        "hominis",
        "late",
        "fourth",
        "century",
        "john",
        "damascene",
        "de",
        "fide",
        "orthodoxa",
        "eighth",
        "century",
        "latter",
        "much",
        "influenced",
        "nemesius",
        "work",
        "treatise",
        "translated",
        "latin",
        "eleventh",
        "twelfth",
        "century",
        "important",
        "early",
        "medieval",
        "psychological",
        "sourcebook",
        "sixth",
        "book",
        "avicenna",
        "shifā",
        "translated",
        "latin",
        "middle",
        "twelfth",
        "century",
        "gundisalvi",
        "avendauth",
        "translation",
        "called",
        "liber",
        "de",
        "anima",
        "sextus",
        "de",
        "naturalibus",
        "avicenna",
        "work",
        "influenced",
        "terminology",
        "early",
        "commentary",
        "aristotle",
        "de",
        "anima",
        "became",
        "principal",
        "textbook",
        "psychology",
        "middle",
        "thirteenth",
        "century",
        "aristotle",
        "work",
        "translated",
        "c",
        "james",
        "venice",
        "william",
        "moerbeke",
        "drawing",
        "aristotelian",
        "neoplatonic",
        "psychology",
        "avicenna",
        "distinguishes",
        "function",
        "soul",
        "attaching",
        "special",
        "power",
        "faculty",
        "relevant",
        "connection",
        "sensory",
        "moving",
        "power",
        "internal",
        "sens",
        "common",
        "sense",
        "imagery",
        "retention",
        "sensation",
        "estimation",
        "memory",
        "imagination",
        "separation",
        "combination",
        "sensory",
        "form",
        "inner",
        "sens",
        "nonperceptual",
        "apprehensive",
        "power",
        "sensory",
        "soul",
        "de",
        "anima",
        "iv",
        "iv",
        "moving",
        "power",
        "sensory",
        "soul",
        "divided",
        "commanding",
        "power",
        "executive",
        "power",
        "former",
        "center",
        "emotion",
        "executive",
        "moving",
        "power",
        "operates",
        "nervous",
        "system",
        "muscle",
        "moved",
        "commanding",
        "moving",
        "power",
        "act",
        "triggered",
        "occurrent",
        "evaluation",
        "estimative",
        "power",
        "accompanied",
        "bodily",
        "affection",
        "well",
        "behavioral",
        "change",
        "provided",
        "executive",
        "moving",
        "power",
        "also",
        "actualized",
        "commanding",
        "act",
        "strong",
        "enough",
        "executive",
        "power",
        "necessarily",
        "actualized",
        "animal",
        "human",
        "prevent",
        "impulse",
        "executive",
        "moving",
        "power",
        "moving",
        "power",
        "immaterial",
        "intellectual",
        "soul",
        "together",
        "practical",
        "intellect",
        "control",
        "emotion",
        "de",
        "anima",
        "i",
        "iv",
        "sensory",
        "commanding",
        "faculty",
        "divided",
        "concupiscible",
        "irascible",
        "part",
        "reaction",
        "concupiscible",
        "power",
        "desire",
        "thing",
        "taken",
        "pleasurable",
        "reaction",
        "irascible",
        "power",
        "desire",
        "defeat",
        "adversary",
        "repel",
        "harmful",
        "thing",
        "de",
        "anima",
        "i",
        "iv",
        "object",
        "emotion",
        "recognized",
        "emotionally",
        "relevant",
        "estimative",
        "power",
        "power",
        "sheep",
        "judge",
        "wolf",
        "avoided",
        "even",
        "though",
        "exterior",
        "sense",
        "previously",
        "perceived",
        "avicenna",
        "call",
        "representation",
        "estimative",
        "power",
        "intention",
        "recognition",
        "intention",
        "often",
        "instinctive",
        "animal",
        "mostly",
        "conscious",
        "preintellectually",
        "conceptual",
        "human",
        "de",
        "anima",
        "i",
        "iv",
        "iv",
        "see",
        "also",
        "black",
        "hasse",
        "perler",
        "occurrent",
        "emotion",
        "involves",
        "act",
        "separate",
        "faculty",
        "must",
        "kind",
        "governing",
        "awareness",
        "combine",
        "act",
        "de",
        "anima",
        "v",
        "kitāb",
        "alnajāt",
        "trans",
        "rahman",
        "cf",
        "toivanen",
        "yrjönsuuri",
        "avicenna",
        "theory",
        "includes",
        "element",
        "aristotelian",
        "compositional",
        "theory",
        "us",
        "behavioral",
        "suggestion",
        "central",
        "factor",
        "reason",
        "include",
        "pleasure",
        "joy",
        "among",
        "concupiscible",
        "irascible",
        "emotion",
        "regarding",
        "affective",
        "apprehensive",
        "act",
        "somewhat",
        "strangely",
        "add",
        "pain",
        "distress",
        "irascible",
        "motive",
        "act",
        "fear",
        "anger",
        "apparently",
        "thinking",
        "moving",
        "act",
        "merely",
        "apprehensive",
        "de",
        "anima",
        "iv",
        "emotion",
        "common",
        "human",
        "animal",
        "human",
        "estimative",
        "faculty",
        "also",
        "operates",
        "sensory",
        "reason",
        "qualifies",
        "recognizing",
        "emotional",
        "intention",
        "hope",
        "fear",
        "respect",
        "yet",
        "actualized",
        "future",
        "thing",
        "shame",
        "wrong",
        "action",
        "wonder",
        "unusual",
        "thing",
        "presuppose",
        "conceptualization",
        "animal",
        "lack",
        "also",
        "human",
        "express",
        "wonder",
        "laughing",
        "anxiety",
        "weeping",
        "de",
        "anima",
        "v",
        "avicenna",
        "discus",
        "emotion",
        "also",
        "canon",
        "medicine",
        "translated",
        "latin",
        "gerard",
        "cremona",
        "twelfth",
        "century",
        "medical",
        "approach",
        "cardiac",
        "spiritual",
        "affect",
        "show",
        "similarity",
        "pantegni",
        "see",
        "knuuttila",
        "twelfthcentury",
        "latin",
        "discussion",
        "accountability",
        "influenced",
        "augustine",
        "view",
        "sin",
        "act",
        "free",
        "consent",
        "seems",
        "mean",
        "spontaneous",
        "emotional",
        "reaction",
        "immediately",
        "guiltymaking",
        "freely",
        "chosen",
        "expositio",
        "quarundam",
        "propositionum",
        "ex",
        "epistola",
        "ad",
        "romanos",
        "augustine",
        "position",
        "led",
        "controversy",
        "argued",
        "sinless",
        "first",
        "movement",
        "anselm",
        "canterbury",
        "peter",
        "abelard",
        "william",
        "champeaux",
        "aelred",
        "rievaulx",
        "held",
        "something",
        "sin",
        "free",
        "choice",
        "consent",
        "interpretation",
        "held",
        "anselm",
        "laon",
        "peter",
        "lombard",
        "others",
        "first",
        "movement",
        "towards",
        "forbidden",
        "thing",
        "immediately",
        "venial",
        "sin",
        "even",
        "free",
        "could",
        "regarded",
        "indirectly",
        "voluntary",
        "insufficient",
        "precaution",
        "knuuttila",
        "wu",
        "central",
        "term",
        "influential",
        "augustinian",
        "model",
        "sin",
        "suggestion",
        "temptation",
        "first",
        "movement",
        "pleasure",
        "consent",
        "augustine",
        "thought",
        "first",
        "movement",
        "accompanied",
        "reflexive",
        "awareness",
        "soon",
        "one",
        "could",
        "voluntarily",
        "stop",
        "without",
        "awareness",
        "soul",
        "could",
        "react",
        "first",
        "movement",
        "conscious",
        "withdrawal",
        "augustinian",
        "model",
        "inner",
        "control",
        "relatively",
        "simple",
        "easily",
        "understood",
        "made",
        "popular",
        "medieval",
        "early",
        "modern",
        "theology",
        "sin",
        "traditional",
        "monastic",
        "exercise",
        "repelling",
        "evil",
        "thought",
        "redirecting",
        "attention",
        "also",
        "repeated",
        "philosophical",
        "treatise",
        "descartes",
        "leibniz",
        "fact",
        "seems",
        "device",
        "making",
        "oneself",
        "free",
        "occurring",
        "temptation",
        "used",
        "western",
        "philosophical",
        "theological",
        "literature",
        "see",
        "descartes",
        "le",
        "passion",
        "de",
        "l",
        "âme",
        "leibniz",
        "nouveaux",
        "essais",
        "sur",
        "l",
        "entendement",
        "humain",
        "ethic",
        "s",
        "peter",
        "abelard",
        "contrasted",
        "consent",
        "suggesting",
        "one",
        "consent",
        "goal",
        "one",
        "also",
        "consent",
        "necessary",
        "mean",
        "whereas",
        "one",
        "goal",
        "without",
        "willing",
        "necessary",
        "mean",
        "abelard",
        "terminological",
        "point",
        "concerning",
        "use",
        "extended",
        "rational",
        "lower",
        "part",
        "soul",
        "find",
        "many",
        "supporter",
        "thinker",
        "agree",
        "whatever",
        "called",
        "willed",
        "emotionally",
        "liked",
        "took",
        "behave",
        "like",
        "abelard",
        "consent",
        "separating",
        "emotion",
        "argued",
        "reluctantly",
        "chosen",
        "act",
        "said",
        "willed",
        "knuuttila",
        "aelred",
        "rievaulx",
        "hugh",
        "st",
        "victor",
        "two",
        "monastic",
        "author",
        "discussed",
        "augustine",
        "psychology",
        "attending",
        "spontaneous",
        "affect",
        "subjectively",
        "felt",
        "present",
        "movement",
        "soul",
        "book",
        "mirror",
        "charity",
        "aelred",
        "extensively",
        "dealt",
        "affect",
        "affectus",
        "element",
        "love",
        "amor",
        "example",
        "affect",
        "mainly",
        "attachment",
        "person",
        "following",
        "augustine",
        "remark",
        "first",
        "movement",
        "aelred",
        "explains",
        "affect",
        "spontaneous",
        "nonvoluntary",
        "sweet",
        "attraction",
        "controlled",
        "rational",
        "power",
        "mirror",
        "affect",
        "characterized",
        "early",
        "stage",
        "desiderative",
        "emotion",
        "first",
        "movement",
        "sin",
        "continuation",
        "love",
        "initiated",
        "affect",
        "voluntarily",
        "controllable",
        "accountable",
        "augustine",
        "using",
        "augustinian",
        "concept",
        "free",
        "consent",
        "kernel",
        "view",
        "chosen",
        "love",
        "attitude",
        "aelred",
        "argues",
        "love",
        "may",
        "based",
        "affect",
        "reason",
        "love",
        "arises",
        "affect",
        "higher",
        "part",
        "soul",
        "give",
        "consent",
        "affect",
        "arises",
        "reason",
        "join",
        "representation",
        "reason",
        "third",
        "form",
        "love",
        "love",
        "reason",
        "fused",
        "one",
        "first",
        "pleasant",
        "dangerous",
        "second",
        "harsh",
        "fruitful",
        "third",
        "advantage",
        "perfect",
        "mirror",
        "remark",
        "loving",
        "ought",
        "love",
        "love",
        "intensely",
        "sweetness",
        "affect",
        "without",
        "hugh",
        "st",
        "victor",
        "regarded",
        "love",
        "basic",
        "emotion",
        "defined",
        "pleasure",
        "heart",
        "directed",
        "something",
        "something",
        "substance",
        "love",
        "emotion",
        "actual",
        "orientation",
        "soul",
        "object",
        "subjectively",
        "felt",
        "pleasure",
        "place",
        "hugh",
        "dealt",
        "love",
        "first",
        "stage",
        "sequence",
        "love",
        "desire",
        "joy",
        "think",
        "emotion",
        "generated",
        "heart",
        "various",
        "form",
        "sensory",
        "moving",
        "affect",
        "controlling",
        "intellectual",
        "de",
        "sacramentis",
        "c",
        "incipient",
        "pleasant",
        "feeling",
        "love",
        "reachable",
        "end",
        "expelled",
        "increase",
        "power",
        "lead",
        "new",
        "emotional",
        "stage",
        "separated",
        "typical",
        "behavioral",
        "change",
        "desire",
        "moving",
        "subject",
        "towards",
        "end",
        "joy",
        "reaching",
        "end",
        "substance",
        "love",
        "beginning",
        "emotion",
        "act",
        "free",
        "choice",
        "continuance",
        "hugh",
        "differed",
        "aelred",
        "regarding",
        "involuntary",
        "sexual",
        "movement",
        "venial",
        "sin",
        "de",
        "sacramentis",
        "ca",
        "b",
        "affective",
        "psychology",
        "aelred",
        "hugh",
        "regarded",
        "affect",
        "pleasantly",
        "unpleasantly",
        "felt",
        "awareness",
        "movement",
        "lower",
        "soul",
        "behavioral",
        "impulse",
        "account",
        "could",
        "understood",
        "external",
        "interpretation",
        "animal",
        "action",
        "associated",
        "augustinian",
        "doctrine",
        "spontaneous",
        "movement",
        "controlled",
        "guided",
        "free",
        "soon",
        "possible",
        "add",
        "introspective",
        "knowledge",
        "first",
        "movement",
        "analysis",
        "making",
        "affect",
        "matter",
        "subjective",
        "awareness",
        "inner",
        "change",
        "bernard",
        "clairvaux"
    ]
}