{
    "main_text": "How Are Collective Expert Judgments Made in Medicine?\n10. How Are Collective Expert Judgments Made in Medicine?\n\nOne way to help overcome expert bias is by making medical decisions\nnot dependent on individual expert judgments but instead have groups\nof experts coming to some form of aggregate judgment. The U.S.\nNational Institutes of Health, for instance, used to organize\nso-called consensus conferences designed to resolve scientific\ncontroversy. Panel members are chosen from clinicians, researchers,\nmethodologists and the general public. Federal employees are not\neligible, nor are researchers who have published on the subject at\nhand or have financial conflicts of interest (Solomon 2007). These\nexclusions are intended to contribute to controlling government\ninfluences as well as any biases due to financial or intellectual\ninterests.\n\nConsensus conferences and other mechanisms for reaching group\njudgments are clearly no panacea. Miriam Solomon (2015), for instance,\nargues that consensus conferences tend to “miss the window of\nepistemic opportunity” in that they often take place after the\nmedical community has already settled an issue. More important in the\npresent context is the observation that while these conferences\npossibly help to control some forms of partiality, they are\nineffective in reducing others and may be responsible for the\nintroduction of new biases. One concern is that panel members may read\nthe existing evidence selectively, for instance, because of weighing\nsalient studies or studies that are available to them more heavily.\nAnother is that phenomena such as groupthink (Janis 1982) and peer\npressure may influence results. In an NIH consensus conference panel\nmembers have to come to a verdict after only two days of hearings and\ndeliberations. Under these conditions it is certainly possible that\nmore outspoken panel members or those who perform well under extreme\npressure have a undue influence on results. Moreover, it is not clear\nthat excluding clinicians who have published on the issue at hand is\nalways such a good idea. After all, it is not implausible to maintain\nthat those scientists who actively work on a research topic are those\nwho best understand it and therefore can make the best informed\njudgments. For these and other reasons, Solomon (2007, 2015) explores\nthe consequences of judgment aggregation. In this process group\nmembers typically do not deliberate but instead cast their opinions\nwhich are then aggregated using some pre-determined procedure. The\nmajority rule would be a simple example of such a procedure.\n\nComing to a group judgment using a mechanical procedure such as\nmajority vote has a number of advantages. First, there are epistemic\nadvantages that can be illustrated by Condorcet’s Jury Theorem.\nThis theorem shows that if (a) the judgment concerns a proposition\nthat can either be true or false, (b) jury members have an independent\nprobability \\(>.5\\) that they get the judgment right, (c) the\nindividual judgments are aggregated using majority vote, then the\nlarger the jury, the more likely it is to reach the correct group\njudgment. Under these conditions, then, a committee of experts is\nlikely to make a better judgment than a single expert. Moreover, in\nthe absence of deliberation and pressure to come to a unanimous\nresults, and when voting is secret, the influence of groupthink, peer\npressure etc. is attenuated or eliminated.\n\nWhen conditions (a)–(c) do not hold, results are more ambiguous\nor even negative. When experts are not reliable, i.e., the individual\nprobability of getting the judgment right is \\(<.5\\), the larger\nthe group, the less likely is it to reach a correct group\njudgment and the optimal group size is a single expert. When the\noutcome can have more than two values, inconsistent results can\nobtain. This can easily be demonstrated with an example in which there\nare three possible outcomes and three experts. Suppose, for instance,\nthat a panel has to decide which of three treatments A,\nB and C is the most effective in treating some disease.\nThe individual panel members have the following individual\nrankings:\n\n\nExpert I: \\(A > B > C\\)\n\nExpert II: \\(B > C > A\\)\n\nExpert III: \\(C > A > B\\),\n\n\nwhere “>” means “more effective”. There is\nnow a majority that holds that A is more effective than\nB (I&III), a majority that holds that B is more effective\nthan C (I&II) and a majority that holds that C is\nmore effective than A (II&III). More generally, whenever\nthere are logical relations among the propositions to be decided (in\nthis case: \\(A > B\\) and \\(B > C\\) implies that \\(A > C\\)),\nthere are at least three panel members, and votes are aggregated by\nthe majority rule, inconsistencies can arise at the group level\n(Pettit 2001).\n\nThe majority rule is of course only one way to aggregate judgments.\nThe Delphi method (e.g., Dalkey and Helmer 1963; for an application to\nmedicine, see Jones and Hunter 1995) applies to cases where the task\nis to provide a numerical estimate of some variable of interest (say,\nthe risk difference a new treatment makes). Experts answer\nquestionnaires in several rounds. After each round, a facilitator\nprovides an anonymous summary of the experts’ estimates from the\nprevious round and the reasons given for their judgments. Experts are\nthus supposed to be encouraged to revise their earlier answers in\nlight of other experts’ estimates and justifications. During\nthis process the range of the estimate will often decrease, and it is\nhoped that the group will converge towards the correct answer. The\nprocess is stopped after a pre-determined stopping criterion such as\nnumber of rounds, achievement of consensus, stability of results, and\nan average of the estimates of the final round is used as result.\n\nSolomon (2011, 2015) raises a fundamental issue concerning group\njudgments that is entirely independent of the specific method used. She argues that we\ndo not often find group judgment methods to determine the truth of\nscientific hypotheses or estimates of variables in the natural\nsciences (though see Staley 2004). If there is uncertainty about, say, which of two alternative\nhypotheses is true or what value a natural constant has, scientists go\nout and test, experiment, measure. Controversies, in other words, are\nsettled on the basis of evidence, not (individual or group) opinion.\nShouldn’t we, with the advancement of evidence-based medicine,\nexpect the same to happen in medicine? Consequently, she recommends\nmore widespread use of mechanical techniques for amalgamating evidence\nsuch as meta-analysis in lieu of consensus conferences and the\nlike.\n\nThe frequency of NIH consensus conferences has indeed markedly\ndeclined in recent years (Solomon 2011, 2015). But this is\nof course no reason to maintain that group judgments are no longer\nneeded. Consensus conferences may be the wrong tool for the purposes\nof the NIH, or the NIH may have a mistaken view about the ability of\nevidence to settle disputes adequately. Indeed, there are at least two\nreasons to believe that group judgment procedures are here to\nstay.\n\nThe first reason is that, as we have seen above, medical decisions are\nalways in part decisions about normative matters. No treatment is\nentirely without side effects and so if judgments about efficacy are\nto be of practical guidance, they must include a weighing of benefit\n(alleviation of disease symptoms) against cost (suffering from side\neffects)—even if economic costs and benefits are not to\nbe taken into consideration. Second, government agencies such as the\nU.S. Food and Drug Administration (FDA) have to decide whether new\ntreatments should be licensed to be marketed. These decisions often\nhave significant consequences, and democracies tend to prefer to be\nable to hold someone accountable for making them. Drug approval\ntherefore cannot be determined on the basis of evidence according to\nsome mechanical algorithm.\n\nBiddle (2007) discusses epistemological and moral issues of drug\napproval in the context of a case study on Vioxx, an analgesic. Vioxx\nwas approved by the FDA in 1999 but five years later pulled from the\nmarket by its manufacturer Merck due to safety concerns. It is\nestimated that some 55,000 people died from taking the drug (Harris\n2005). Biddle observes that the FDA is not sufficiently independent of\nthe pharmaceutical industry to make unbiased decisions likely. Many of\nthe members of the FDA’s drug approval committees have financial\nconflicts of interests (often in the form of receiving benefits from\nthe pharmaceutical company whose drug is to be approved), and a large\nnumber of employees of the FDA are dependent on the “user\nfees” industry pays to help cover the cost of drug approval. To\nsolve these problems of conflicts of interests, Biddle proposes to\ninstitute an adversarial system in which two groups of advocates, a\ngroup of representatives of the manufacturer and a group of\nindependent scientists, would argue before a panel of judges over\nwhether a drug should be allowed on the market. The panel of judges in\nthis model also consists of independent FDA or university scientists.\nHe argues that the adversarial system would better acknowledge the\nfact that an increasing number of medical researchers have financial\nties to the pharmaceutical industry by treating them as advocates\nrather than disinterested experts. (See also Reiss and Wieten 2015, Reiss forthcoming-b.)\n",
    "section_title": "10. How Are Collective Expert Judgments Made in Medicine?",
    "entry_title": "Philosophy of Medicine",
    "hierarchy_title": "Philosophy of Medicine || How Are Collective Expert Judgments Made in Medicine?",
    "tokenized_text": [
        "collective",
        "expert",
        "judgment",
        "made",
        "medicine",
        "collective",
        "expert",
        "judgment",
        "made",
        "medicine",
        "one",
        "way",
        "help",
        "overcome",
        "expert",
        "bias",
        "making",
        "medical",
        "decision",
        "dependent",
        "individual",
        "expert",
        "judgment",
        "instead",
        "group",
        "expert",
        "coming",
        "form",
        "aggregate",
        "judgment",
        "us",
        "national",
        "institute",
        "health",
        "instance",
        "used",
        "organize",
        "socalled",
        "consensus",
        "conference",
        "designed",
        "resolve",
        "scientific",
        "controversy",
        "panel",
        "member",
        "chosen",
        "clinician",
        "researcher",
        "methodologists",
        "general",
        "public",
        "federal",
        "employee",
        "eligible",
        "researcher",
        "published",
        "subject",
        "hand",
        "financial",
        "conflict",
        "interest",
        "solomon",
        "exclusion",
        "intended",
        "contribute",
        "controlling",
        "government",
        "influence",
        "well",
        "bias",
        "due",
        "financial",
        "intellectual",
        "interest",
        "consensus",
        "conference",
        "mechanism",
        "reaching",
        "group",
        "judgment",
        "clearly",
        "panacea",
        "miriam",
        "solomon",
        "instance",
        "argues",
        "consensus",
        "conference",
        "tend",
        "miss",
        "window",
        "epistemic",
        "opportunity",
        "often",
        "take",
        "place",
        "medical",
        "community",
        "already",
        "settled",
        "issue",
        "important",
        "present",
        "context",
        "observation",
        "conference",
        "possibly",
        "help",
        "control",
        "form",
        "partiality",
        "ineffective",
        "reducing",
        "others",
        "may",
        "responsible",
        "introduction",
        "new",
        "bias",
        "one",
        "concern",
        "panel",
        "member",
        "may",
        "read",
        "existing",
        "evidence",
        "selectively",
        "instance",
        "weighing",
        "salient",
        "study",
        "study",
        "available",
        "heavily",
        "another",
        "phenomenon",
        "groupthink",
        "janis",
        "peer",
        "pressure",
        "may",
        "influence",
        "result",
        "nih",
        "consensus",
        "conference",
        "panel",
        "member",
        "come",
        "verdict",
        "two",
        "day",
        "hearing",
        "deliberation",
        "condition",
        "certainly",
        "possible",
        "outspoken",
        "panel",
        "member",
        "perform",
        "well",
        "extreme",
        "pressure",
        "undue",
        "influence",
        "result",
        "moreover",
        "clear",
        "excluding",
        "clinician",
        "published",
        "issue",
        "hand",
        "always",
        "good",
        "idea",
        "implausible",
        "maintain",
        "scientist",
        "actively",
        "work",
        "research",
        "topic",
        "best",
        "understand",
        "therefore",
        "make",
        "best",
        "informed",
        "judgment",
        "reason",
        "solomon",
        "explores",
        "consequence",
        "judgment",
        "aggregation",
        "process",
        "group",
        "member",
        "typically",
        "deliberate",
        "instead",
        "cast",
        "opinion",
        "aggregated",
        "using",
        "predetermined",
        "procedure",
        "majority",
        "rule",
        "would",
        "simple",
        "example",
        "procedure",
        "coming",
        "group",
        "judgment",
        "using",
        "mechanical",
        "procedure",
        "majority",
        "vote",
        "number",
        "advantage",
        "first",
        "epistemic",
        "advantage",
        "illustrated",
        "condorcet",
        "jury",
        "theorem",
        "theorem",
        "show",
        "judgment",
        "concern",
        "proposition",
        "either",
        "true",
        "false",
        "b",
        "jury",
        "member",
        "independent",
        "probability",
        "get",
        "judgment",
        "right",
        "c",
        "individual",
        "judgment",
        "aggregated",
        "using",
        "majority",
        "vote",
        "larger",
        "jury",
        "likely",
        "reach",
        "correct",
        "group",
        "judgment",
        "condition",
        "committee",
        "expert",
        "likely",
        "make",
        "better",
        "judgment",
        "single",
        "expert",
        "moreover",
        "absence",
        "deliberation",
        "pressure",
        "come",
        "unanimous",
        "result",
        "voting",
        "secret",
        "influence",
        "groupthink",
        "peer",
        "pressure",
        "etc",
        "attenuated",
        "eliminated",
        "condition",
        "c",
        "hold",
        "result",
        "ambiguous",
        "even",
        "negative",
        "expert",
        "reliable",
        "ie",
        "individual",
        "probability",
        "getting",
        "judgment",
        "right",
        "larger",
        "group",
        "le",
        "likely",
        "reach",
        "correct",
        "group",
        "judgment",
        "optimal",
        "group",
        "size",
        "single",
        "expert",
        "outcome",
        "two",
        "value",
        "inconsistent",
        "result",
        "obtain",
        "easily",
        "demonstrated",
        "example",
        "three",
        "possible",
        "outcome",
        "three",
        "expert",
        "suppose",
        "instance",
        "panel",
        "decide",
        "three",
        "treatment",
        "b",
        "c",
        "effective",
        "treating",
        "disease",
        "individual",
        "panel",
        "member",
        "following",
        "individual",
        "ranking",
        "expert",
        "b",
        "c",
        "expert",
        "ii",
        "b",
        "c",
        "a",
        "expert",
        "iii",
        "c",
        "b",
        "mean",
        "effective",
        "majority",
        "hold",
        "effective",
        "b",
        "iii",
        "majority",
        "hold",
        "b",
        "effective",
        "c",
        "ii",
        "majority",
        "hold",
        "c",
        "effective",
        "ii",
        "iii",
        "generally",
        "whenever",
        "logical",
        "relation",
        "among",
        "proposition",
        "decided",
        "case",
        "b",
        "b",
        "c",
        "implies",
        "c",
        "least",
        "three",
        "panel",
        "member",
        "vote",
        "aggregated",
        "majority",
        "rule",
        "inconsistency",
        "arise",
        "group",
        "level",
        "pettit",
        "majority",
        "rule",
        "course",
        "one",
        "way",
        "aggregate",
        "judgment",
        "delphi",
        "method",
        "eg",
        "dalkey",
        "helmer",
        "application",
        "medicine",
        "see",
        "jones",
        "hunter",
        "applies",
        "case",
        "task",
        "provide",
        "numerical",
        "estimate",
        "variable",
        "interest",
        "say",
        "risk",
        "difference",
        "new",
        "treatment",
        "make",
        "expert",
        "answer",
        "questionnaire",
        "several",
        "round",
        "round",
        "facilitator",
        "provides",
        "anonymous",
        "summary",
        "expert",
        "estimate",
        "previous",
        "round",
        "reason",
        "given",
        "judgment",
        "expert",
        "thus",
        "supposed",
        "encouraged",
        "revise",
        "earlier",
        "answer",
        "light",
        "expert",
        "estimate",
        "justification",
        "process",
        "range",
        "estimate",
        "often",
        "decrease",
        "hoped",
        "group",
        "converge",
        "towards",
        "correct",
        "answer",
        "process",
        "stopped",
        "predetermined",
        "stopping",
        "criterion",
        "number",
        "round",
        "achievement",
        "consensus",
        "stability",
        "result",
        "average",
        "estimate",
        "final",
        "round",
        "used",
        "result",
        "solomon",
        "raise",
        "fundamental",
        "issue",
        "concerning",
        "group",
        "judgment",
        "entirely",
        "independent",
        "specific",
        "method",
        "used",
        "argues",
        "often",
        "find",
        "group",
        "judgment",
        "method",
        "determine",
        "truth",
        "scientific",
        "hypothesis",
        "estimate",
        "variable",
        "natural",
        "science",
        "though",
        "see",
        "staley",
        "uncertainty",
        "say",
        "two",
        "alternative",
        "hypothesis",
        "true",
        "value",
        "natural",
        "constant",
        "scientist",
        "go",
        "test",
        "experiment",
        "measure",
        "controversy",
        "word",
        "settled",
        "basis",
        "evidence",
        "individual",
        "group",
        "opinion",
        "advancement",
        "evidencebased",
        "medicine",
        "expect",
        "happen",
        "medicine",
        "consequently",
        "recommends",
        "widespread",
        "use",
        "mechanical",
        "technique",
        "amalgamating",
        "evidence",
        "metaanalysis",
        "lieu",
        "consensus",
        "conference",
        "like",
        "frequency",
        "nih",
        "consensus",
        "conference",
        "indeed",
        "markedly",
        "declined",
        "recent",
        "year",
        "solomon",
        "course",
        "reason",
        "maintain",
        "group",
        "judgment",
        "longer",
        "needed",
        "consensus",
        "conference",
        "may",
        "wrong",
        "tool",
        "purpose",
        "nih",
        "nih",
        "may",
        "mistaken",
        "view",
        "ability",
        "evidence",
        "settle",
        "dispute",
        "adequately",
        "indeed",
        "least",
        "two",
        "reason",
        "believe",
        "group",
        "judgment",
        "procedure",
        "stay",
        "first",
        "reason",
        "seen",
        "medical",
        "decision",
        "always",
        "part",
        "decision",
        "normative",
        "matter",
        "treatment",
        "entirely",
        "without",
        "side",
        "effect",
        "judgment",
        "efficacy",
        "practical",
        "guidance",
        "must",
        "include",
        "weighing",
        "benefit",
        "alleviation",
        "disease",
        "symptom",
        "cost",
        "suffering",
        "side",
        "effect",
        "even",
        "economic",
        "cost",
        "benefit",
        "taken",
        "consideration",
        "second",
        "government",
        "agency",
        "us",
        "food",
        "drug",
        "administration",
        "fda",
        "decide",
        "whether",
        "new",
        "treatment",
        "licensed",
        "marketed",
        "decision",
        "often",
        "significant",
        "consequence",
        "democracy",
        "tend",
        "prefer",
        "able",
        "hold",
        "someone",
        "accountable",
        "making",
        "drug",
        "approval",
        "therefore",
        "determined",
        "basis",
        "evidence",
        "according",
        "mechanical",
        "algorithm",
        "biddle",
        "discus",
        "epistemological",
        "moral",
        "issue",
        "drug",
        "approval",
        "context",
        "case",
        "study",
        "vioxx",
        "analgesic",
        "vioxx",
        "approved",
        "fda",
        "five",
        "year",
        "later",
        "pulled",
        "market",
        "manufacturer",
        "merck",
        "due",
        "safety",
        "concern",
        "estimated",
        "people",
        "died",
        "taking",
        "drug",
        "harris",
        "biddle",
        "observes",
        "fda",
        "sufficiently",
        "independent",
        "pharmaceutical",
        "industry",
        "make",
        "unbiased",
        "decision",
        "likely",
        "many",
        "member",
        "fda",
        "drug",
        "approval",
        "committee",
        "financial",
        "conflict",
        "interest",
        "often",
        "form",
        "receiving",
        "benefit",
        "pharmaceutical",
        "company",
        "whose",
        "drug",
        "approved",
        "large",
        "number",
        "employee",
        "fda",
        "dependent",
        "user",
        "fee",
        "industry",
        "pay",
        "help",
        "cover",
        "cost",
        "drug",
        "approval",
        "solve",
        "problem",
        "conflict",
        "interest",
        "biddle",
        "proposes",
        "institute",
        "adversarial",
        "system",
        "two",
        "group",
        "advocate",
        "group",
        "representative",
        "manufacturer",
        "group",
        "independent",
        "scientist",
        "would",
        "argue",
        "panel",
        "judge",
        "whether",
        "drug",
        "allowed",
        "market",
        "panel",
        "judge",
        "model",
        "also",
        "consists",
        "independent",
        "fda",
        "university",
        "scientist",
        "argues",
        "adversarial",
        "system",
        "would",
        "better",
        "acknowledge",
        "fact",
        "increasing",
        "number",
        "medical",
        "researcher",
        "financial",
        "tie",
        "pharmaceutical",
        "industry",
        "treating",
        "advocate",
        "rather",
        "disinterested",
        "expert",
        "see",
        "also",
        "reiss",
        "wieten",
        "reiss",
        "forthcomingb"
    ]
}