{
    "main_text": "Common natures\n2. Common natures\n\nBuilding on insights gained through the thirteenth century, Scotus\ndistinguishes two closely related issues in individuation: explaining\nhow a particular is such that it cannot be instantiated (explaining\nits individuality, its “indivisibility in itself”), and\nexplaining how a particular is such that it is distinct from other\nparticulars (explaining its “division from others”; on\nthis see Park [1988]). The first of these is on the face of it the\nmore complex issue. For various historical reasons, medieval realists\ntend to suppose that common (shared) natures or essences are somehow\ndivided into their instantiations – as Scotus puts it,\ndivided into “subjective parts.” It is not easy to explain\nprecisely what this divisibility amounts to. Explaining both\ndivisibility and its opposite, Scotus states the problem of\nindividuation as follows:\n\nBecause there is among beings something indivisible into\nsubjective parts – that is, such that it is formally\nincompatible for it to be divided into several parts each of which is\nit – the question is not what it is by which such a\ndivision is formally incompatible with it (because it is formally\nincompatible by incompatibility), but rather what it is by which, as\nby a proximate and intrinsic foundation, this incompatibility is in\nit. Therefore, the sense of the questions on this topic [viz. of\nindividuation] is: What is it in [e.g.] this stone, by which as by a\nproximate foundation it is absolutely incompatible with the stone for\nit to be divided into several parts each of which is this stone,\nthe kind of division that is proper to a universal whole as divided\ninto its subjective parts? (Scotus, Ordinatio II, d. 3,\np. 1. q. 2, n. 48 (Scotus [OO], 7:412–413; Spade (1994), 69))\n\n\nI have italicized the relevant portions here. A common nature is\n“divided into several parts each of which is it.” As\nScotus sees it, individuality and numerical unity or singularity are\nco-extensive. As something that is divisible in the required way, it\nfollows that the nature is not of itself numerically one thing: it has\n“less-than-numerical” unity:\n\nIn the thing [viz. in extramental reality] the nature according to\n[its primary] entity has true real being outside the soul. And\naccording to that entity, it has a unity [viz. less than numerical\nunity] in proportion to it… . That unity is a proper attribute\nof the nature according to its primary entity. Consequently, the\nnature is intrinsically this neither from itself nor\naccording to its proper unity, which is necessarily included in the\nnature according to its primary entity. (Scotus, Ordinatio\nII, d. 3, p. 1, q. 1, n. 34 (Scotus [OO], 7:404–405; Spade (1994),\n64–65))\n\n\nThe basic thought is that a common nature cannot be numerically\nsingular – if it were, it would be a particular, and the\ndistinction between the common and the particular would simply break\ndown. But it must have some kind of unity, since it has some kind of\nbeing or reality. The result of the relevant kind of division is that\nin some sense the whole common nature is in each instantiation of it.\nBut the whole common nature is not to be understood to be identically\n(numerically) the same in each instantiation, as Scotus makes clear\nelsewhere, and as in any case we might expect, given the part-whole\nlanguage that Scotus uses in the passage just quoted. It seems as\nthough there are both intensional and extensional aspects to the\nnature: intensionally, it is fully in each instantiation, but\nextensionally the nature somehow becomes many on instantiation. (Not\njust: comes to exist in many things, unless this be construed to mean\nthat the nature becomes many when it comes to exist in many things.)\nAt least from an extensional point of view, there is more to humanity\nthan just what is found in me. Another way of thinking about the\nrelevant relation might be to think of natures as in some sense\n‘content,’ and each individual as the\n‘carrier’ of this content. The nature, as far as its\ncontent is concerned, is fully in each carrier of the content, but is\nmultiplied in its carriers (such that each carrier bears fully the\nsame content, and so the same content becomes many in its carriers,\njust as the content of a book is multiplied in its several\ncopies).\n\nWhy should we accept this sort of account of common natures? Scotus\ndefends it in the context of a rejection of a theory according to\nwhich the singularity of a nature requires no explanation other than\nthe nature itself. The theory is in principle capable of development\nin one of two different directions, and Scotus seems to regard it as a\nmatter of indifference which of these two directions his opponent has\nin mind. One direction is nominalist: there could be individual\nnatures (of the same kind), and each such nature be of itself\nparticular. The other is extreme realist: there could be indivisible\nPlatonic universals, and each such universal be of itself numerically\nsingular. As Scotus sees it, the only way to explain both\ninstantiability and commonality of kind is to posit the existence of\nentities (viz. natures) that are divisible. It is the divisibility of\nthe nature that allows its instantiability, and the unity of the\nnature that explains commonality of kind. Platonism lacks\ninstantiability, and nominalism lacks an explanation for commonality\nof kind. Scotus makes the crucial claim about natures as follows:\n\nAnything with a real, proper, and sufficient unity less than numerical\nis not of itself one by numerical unity – that is, it is not of\nitself a this. But the proper, real or sufficient unity of\nthe nature existing in this stone is less than numerical unity.\nTherefore [the nature existing in this stone is not of itself one by\nnumerical unity]. (Scotus, Ordinatio II, d. 2, p. 1, q. 1, n.\n8 (Scotus [OO], 7:395; Spade (1994), 59))\n\n\nHere the premises speak of Scotus’s “less than numerical\nunity,” the unity of something that is divisible into\nnumerically many subjective parts. Scotus provides a total of seven\narguments in favor of the minor premise – in favor, in other\nwords, of the position that there is something with\nless-than-numerical unity. Four of these appeal to Aristotelian\nauthority, and of these the third is most interesting:\n\nAccording to the Philosopher, Metaphysics V, the chapter on\nrelation [c. 15, 1021a9–12], the same, the similar\nand the equal are all based on the notion of one, so that even though\na similarity has for its foundation a thing in the genus of quality,\nnevertheless such a relation is not real unless it has a real\nfoundation and a real proximate basis for the founding. Therefore, the\nunity required in the foundation of the relation of similarity is a\nreal one. But it is not numerical unity, since nothing one and the\nsame is similar or equal to itself. (Scotus, Ordinatio II, d.\n3, p. 1, q. 1, n. 18 (Scotus [OO], 7:398; Spade (1994), 61))\n\n\nThe point is that relations of similarity between two particulars\ncannot be self-explanatory; they must have some explanation (some\n“real foundation”) in the things that are similar. This is\namongst other things an argument against resemblance nominalism. But\nit is also supposed to be an argument against the view that a common\nnature could be numerically identical in each instantiation. As Paul\nVincent Spade helpfully comments in loc. (ftnt. 8), “for\nmediaeval authors … a thing x is not (qualitatively)\nsimilar to itself … but just has a quality.”\nSimilarity between different instances of the same kind requires that\nthey have less-than-numerical unity.\n\nOf the arguments from reason (rather than from the authority of\nAristotle), one particularly focuses on a claim with which Ockham\nwill, a few years later, sharply disagree:\n\nIf every real unity is numerical unity, then every real diversity is\nnumerical diversity. The consequent is false. For every numerical\ndiversity, in so far as it is numerical, is equal. And so all things\nwould be equally distinct. In that case, it follows that the intellect\ncould not abstract something common from Socrates and Plato any more\nthan it could from Socrates and a line. Every universal would be a\npure figment of the intellect. (Scotus, Ordinatio II, d. 3,\np. 1, q. 1, n. 23 (Scotus [OO], 7:400–401; Spade (1994), 62))\n\n\nThe obvious claim here is supposed to be that not all real diversity\nis numerical, and Scotus supports it by arguing that, if the only way\nin which things differed were numerical, then all things would be\nequally distinct. But there are degrees of diversity: Socrates and\nPlato are not distinguished in species, for example. Unity and\ndiversity here are inter-definable contradictories, so it is not the\ncase that every real unity is numerical unity.\n\nThe reason that the common nature has some kind of entity is that the\nnature is supposed to be subject to the accidental modification of\nexisting as this or that particular, and it is not possible for the\nsubject of a real modification not itself to be real:\n\nAlthough it [viz. the nature] is never without some of these features\n[viz. being in extramental particulars or being thought of], yet it is\nnot any of them of itself, but is naturally prior to all of them.\n(Scotus, Ordinatio II, d. 3, p. 1, q. 1, n. 32 (Scotus [OO],\n7:403; Spade (1994), 63))\n\n\nSo in order to possess in itself this non-numerical unity, the nature\nmust have, in itself, some sort of being too, proportional to it (such\nthat the real entity of the nature is diminished in proportion to the\ndiminished real unity that it has). Scotus does not mean that the\nnature is some sort of universal ante rem; if there were no\ninstantiations, there would be no nature, but once there are\ninstantiations there is too some subject for instantiation (the\nnature), and this subject has some sort of being in itself. Indeed,\nthis subject is in some sense prior (but not temporally prior) to its\ninstantiations: while the identity of its instantiations depends on\nit, its identity does not depend on those of its instantiations. (It\nmakes no difference to the identity of human nature whether or not I\nexist, though the reality of human nature certainly requires that at\nleast one human being exist: see Scotus, Ordinatio II, d. 3,\np. 1, q. 1, n. 34 (Scotus [OO], 7:404; Spade (1994), 64).) As\ninstantiated, the nature receives the (accidental) modification of\nbeing numerically many in numerically many things.\n\nMuch of the account of common natures can be found in nuce in\nAquinas’s De ente et essentia. But Scotus’s account is\nusually thought to diverge from Aquinas’s in at least one crucial way.\nAccording to both Scotus and Aquinas – following some\nsuggestions in Avicenna – it is possible to consider a nature in\nitself, abstracting both from its existence as a universal concept and\nas the particulars into which it is divided. (Hence Avicenna’s famous\nslogan “equinity is just equinity”: Avicenna, Liber de\nscientia divina, V, c. 1 (Avicenna [LPP], 2:228–229).)\nAquinas is clear that this bare nature lacks numerical unity (see\nAquinas, De ente et essentia, c. 3 (Aquinas [DEE],\n24–25)), and it seems that it lacks any kind of entity too. So\nwhere Scotus ascribes to the nature a kind of entity, and unity short\nof numerical unity, Aquinas does neither. It is perhaps worth noting,\nin passing, that a plausible case can be made for tracing this\nmoderate sort of realism on the question of universals to the\nAristotelian tradition (specifically, Alexander of Aphrodisias: see\nTweedale [1993]). One might also argue, as his famous commentator\nCajetan did, that Aquinas would be willing to attribute some sort of\nunity and proportionally some sort of being to the absolutely\nconsidered nature. For Cajetan’s exposition of the issue, carefully\ndistinguishing Aquinas’s from Scotus’s position, and for useful\nreferences to both authors, see Cajetan [CBE], c. 4 (nn. 55–62),\npp. 134–155. Scotus, while clearly in this same tradition,\nevidently considers the sort of account found in Aquinas to be\ninsufficient, and thus is more clearly to be placed in the realist\ncamp than Aquinas on this question. Far from holding that the nature\nin itself lacks any kind of reality, Scotus holds that the primary\nreality of the nature belongs to the nature in itself.\n",
    "section_title": "2. Common natures",
    "entry_title": "Medieval Theories of Haecceity",
    "hierarchy_title": "Medieval Theories of Haecceity || Common natures",
    "tokenized_text": [
        "common",
        "nature",
        "common",
        "nature",
        "building",
        "insight",
        "gained",
        "thirteenth",
        "century",
        "scotus",
        "distinguishes",
        "two",
        "closely",
        "related",
        "issue",
        "individuation",
        "explaining",
        "particular",
        "instantiated",
        "explaining",
        "individuality",
        "indivisibility",
        "explaining",
        "particular",
        "distinct",
        "particular",
        "explaining",
        "division",
        "others",
        "see",
        "park",
        "first",
        "face",
        "complex",
        "issue",
        "various",
        "historical",
        "reason",
        "medieval",
        "realist",
        "tend",
        "suppose",
        "common",
        "shared",
        "nature",
        "essence",
        "somehow",
        "divided",
        "instantiation",
        "scotus",
        "put",
        "divided",
        "subjective",
        "parts",
        "easy",
        "explain",
        "precisely",
        "divisibility",
        "amount",
        "explaining",
        "divisibility",
        "opposite",
        "scotus",
        "state",
        "problem",
        "individuation",
        "follows",
        "among",
        "being",
        "something",
        "indivisible",
        "subjective",
        "part",
        "formally",
        "incompatible",
        "divided",
        "several",
        "part",
        "question",
        "division",
        "formally",
        "incompatible",
        "formally",
        "incompatible",
        "incompatibility",
        "rather",
        "proximate",
        "intrinsic",
        "foundation",
        "incompatibility",
        "therefore",
        "sense",
        "question",
        "topic",
        "viz",
        "individuation",
        "eg",
        "stone",
        "proximate",
        "foundation",
        "absolutely",
        "incompatible",
        "stone",
        "divided",
        "several",
        "part",
        "stone",
        "kind",
        "division",
        "proper",
        "universal",
        "whole",
        "divided",
        "subjective",
        "part",
        "scotus",
        "ordinatio",
        "ii",
        "d",
        "p",
        "q",
        "n",
        "scotus",
        "oo",
        "spade",
        "italicized",
        "relevant",
        "portion",
        "common",
        "nature",
        "divided",
        "several",
        "part",
        "it",
        "scotus",
        "see",
        "individuality",
        "numerical",
        "unity",
        "singularity",
        "coextensive",
        "something",
        "divisible",
        "required",
        "way",
        "follows",
        "nature",
        "numerically",
        "one",
        "thing",
        "lessthannumerical",
        "unity",
        "thing",
        "viz",
        "extramental",
        "reality",
        "nature",
        "according",
        "primary",
        "entity",
        "true",
        "real",
        "outside",
        "soul",
        "according",
        "entity",
        "unity",
        "viz",
        "le",
        "numerical",
        "unity",
        "proportion",
        "it",
        "unity",
        "proper",
        "attribute",
        "nature",
        "according",
        "primary",
        "entity",
        "consequently",
        "nature",
        "intrinsically",
        "neither",
        "according",
        "proper",
        "unity",
        "necessarily",
        "included",
        "nature",
        "according",
        "primary",
        "entity",
        "scotus",
        "ordinatio",
        "ii",
        "d",
        "p",
        "q",
        "n",
        "scotus",
        "oo",
        "spade",
        "basic",
        "thought",
        "common",
        "nature",
        "numerically",
        "singular",
        "would",
        "particular",
        "distinction",
        "common",
        "particular",
        "would",
        "simply",
        "break",
        "must",
        "kind",
        "unity",
        "since",
        "kind",
        "reality",
        "result",
        "relevant",
        "kind",
        "division",
        "sense",
        "whole",
        "common",
        "nature",
        "instantiation",
        "whole",
        "common",
        "nature",
        "understood",
        "identically",
        "numerically",
        "instantiation",
        "scotus",
        "make",
        "clear",
        "elsewhere",
        "case",
        "might",
        "expect",
        "given",
        "partwhole",
        "language",
        "scotus",
        "us",
        "passage",
        "quoted",
        "seems",
        "though",
        "intensional",
        "extensional",
        "aspect",
        "nature",
        "intensionally",
        "fully",
        "instantiation",
        "extensionally",
        "nature",
        "somehow",
        "becomes",
        "many",
        "instantiation",
        "come",
        "exist",
        "many",
        "thing",
        "unless",
        "construed",
        "mean",
        "nature",
        "becomes",
        "many",
        "come",
        "exist",
        "many",
        "thing",
        "least",
        "extensional",
        "point",
        "view",
        "humanity",
        "found",
        "another",
        "way",
        "thinking",
        "relevant",
        "relation",
        "might",
        "think",
        "nature",
        "sense",
        "content",
        "individual",
        "carrier",
        "content",
        "nature",
        "far",
        "content",
        "concerned",
        "fully",
        "carrier",
        "content",
        "multiplied",
        "carrier",
        "carrier",
        "bear",
        "fully",
        "content",
        "content",
        "becomes",
        "many",
        "carrier",
        "content",
        "book",
        "multiplied",
        "several",
        "copy",
        "accept",
        "sort",
        "account",
        "common",
        "nature",
        "scotus",
        "defends",
        "context",
        "rejection",
        "theory",
        "according",
        "singularity",
        "nature",
        "requires",
        "explanation",
        "nature",
        "theory",
        "principle",
        "capable",
        "development",
        "one",
        "two",
        "different",
        "direction",
        "scotus",
        "seems",
        "regard",
        "matter",
        "indifference",
        "two",
        "direction",
        "opponent",
        "mind",
        "one",
        "direction",
        "nominalist",
        "could",
        "individual",
        "nature",
        "kind",
        "nature",
        "particular",
        "extreme",
        "realist",
        "could",
        "indivisible",
        "platonic",
        "universal",
        "universal",
        "numerically",
        "singular",
        "scotus",
        "see",
        "way",
        "explain",
        "instantiability",
        "commonality",
        "kind",
        "posit",
        "existence",
        "entity",
        "viz",
        "nature",
        "divisible",
        "divisibility",
        "nature",
        "allows",
        "instantiability",
        "unity",
        "nature",
        "explains",
        "commonality",
        "kind",
        "platonism",
        "lack",
        "instantiability",
        "nominalism",
        "lack",
        "explanation",
        "commonality",
        "kind",
        "scotus",
        "make",
        "crucial",
        "claim",
        "nature",
        "follows",
        "anything",
        "real",
        "proper",
        "sufficient",
        "unity",
        "le",
        "numerical",
        "one",
        "numerical",
        "unity",
        "proper",
        "real",
        "sufficient",
        "unity",
        "nature",
        "existing",
        "stone",
        "le",
        "numerical",
        "unity",
        "therefore",
        "nature",
        "existing",
        "stone",
        "one",
        "numerical",
        "unity",
        "scotus",
        "ordinatio",
        "ii",
        "d",
        "p",
        "q",
        "n",
        "scotus",
        "oo",
        "spade",
        "premise",
        "speak",
        "scotus",
        "le",
        "numerical",
        "unity",
        "unity",
        "something",
        "divisible",
        "numerically",
        "many",
        "subjective",
        "part",
        "scotus",
        "provides",
        "total",
        "seven",
        "argument",
        "favor",
        "minor",
        "premise",
        "favor",
        "word",
        "position",
        "something",
        "lessthannumerical",
        "unity",
        "four",
        "appeal",
        "aristotelian",
        "authority",
        "third",
        "interesting",
        "according",
        "philosopher",
        "metaphysics",
        "v",
        "chapter",
        "relation",
        "c",
        "a",
        "similar",
        "equal",
        "based",
        "notion",
        "one",
        "even",
        "though",
        "similarity",
        "foundation",
        "thing",
        "genus",
        "quality",
        "nevertheless",
        "relation",
        "real",
        "unless",
        "real",
        "foundation",
        "real",
        "proximate",
        "basis",
        "founding",
        "therefore",
        "unity",
        "required",
        "foundation",
        "relation",
        "similarity",
        "real",
        "one",
        "numerical",
        "unity",
        "since",
        "nothing",
        "one",
        "similar",
        "equal",
        "scotus",
        "ordinatio",
        "ii",
        "d",
        "p",
        "q",
        "n",
        "scotus",
        "oo",
        "spade",
        "point",
        "relation",
        "similarity",
        "two",
        "particular",
        "selfexplanatory",
        "must",
        "explanation",
        "real",
        "foundation",
        "thing",
        "similar",
        "amongst",
        "thing",
        "argument",
        "resemblance",
        "nominalism",
        "also",
        "supposed",
        "argument",
        "view",
        "common",
        "nature",
        "could",
        "numerically",
        "identical",
        "instantiation",
        "paul",
        "vincent",
        "spade",
        "helpfully",
        "comment",
        "loc",
        "ftnt",
        "mediaeval",
        "author",
        "thing",
        "x",
        "qualitatively",
        "similar",
        "quality",
        "similarity",
        "different",
        "instance",
        "kind",
        "requires",
        "lessthannumerical",
        "unity",
        "argument",
        "reason",
        "rather",
        "authority",
        "aristotle",
        "one",
        "particularly",
        "focus",
        "claim",
        "ockham",
        "year",
        "later",
        "sharply",
        "disagree",
        "every",
        "real",
        "unity",
        "numerical",
        "unity",
        "every",
        "real",
        "diversity",
        "numerical",
        "diversity",
        "consequent",
        "false",
        "every",
        "numerical",
        "diversity",
        "far",
        "numerical",
        "equal",
        "thing",
        "would",
        "equally",
        "distinct",
        "case",
        "follows",
        "intellect",
        "could",
        "abstract",
        "something",
        "common",
        "socrates",
        "plato",
        "could",
        "socrates",
        "line",
        "every",
        "universal",
        "would",
        "pure",
        "figment",
        "intellect",
        "scotus",
        "ordinatio",
        "ii",
        "d",
        "p",
        "q",
        "n",
        "scotus",
        "oo",
        "spade",
        "obvious",
        "claim",
        "supposed",
        "real",
        "diversity",
        "numerical",
        "scotus",
        "support",
        "arguing",
        "way",
        "thing",
        "differed",
        "numerical",
        "thing",
        "would",
        "equally",
        "distinct",
        "degree",
        "diversity",
        "socrates",
        "plato",
        "distinguished",
        "specie",
        "example",
        "unity",
        "diversity",
        "interdefinable",
        "contradictory",
        "case",
        "every",
        "real",
        "unity",
        "numerical",
        "unity",
        "reason",
        "common",
        "nature",
        "kind",
        "entity",
        "nature",
        "supposed",
        "subject",
        "accidental",
        "modification",
        "existing",
        "particular",
        "possible",
        "subject",
        "real",
        "modification",
        "real",
        "although",
        "viz",
        "nature",
        "never",
        "without",
        "feature",
        "viz",
        "extramental",
        "particular",
        "thought",
        "yet",
        "naturally",
        "prior",
        "scotus",
        "ordinatio",
        "ii",
        "d",
        "p",
        "q",
        "n",
        "scotus",
        "oo",
        "spade",
        "order",
        "posse",
        "nonnumerical",
        "unity",
        "nature",
        "must",
        "sort",
        "proportional",
        "real",
        "entity",
        "nature",
        "diminished",
        "proportion",
        "diminished",
        "real",
        "unity",
        "scotus",
        "mean",
        "nature",
        "sort",
        "universal",
        "ante",
        "rem",
        "instantiation",
        "would",
        "nature",
        "instantiation",
        "subject",
        "instantiation",
        "nature",
        "subject",
        "sort",
        "indeed",
        "subject",
        "sense",
        "prior",
        "temporally",
        "prior",
        "instantiation",
        "identity",
        "instantiation",
        "depends",
        "identity",
        "depend",
        "instantiation",
        "make",
        "difference",
        "identity",
        "human",
        "nature",
        "whether",
        "exist",
        "though",
        "reality",
        "human",
        "nature",
        "certainly",
        "requires",
        "least",
        "one",
        "human",
        "exist",
        "see",
        "scotus",
        "ordinatio",
        "ii",
        "d",
        "p",
        "q",
        "n",
        "scotus",
        "oo",
        "spade",
        "instantiated",
        "nature",
        "receives",
        "accidental",
        "modification",
        "numerically",
        "many",
        "numerically",
        "many",
        "thing",
        "much",
        "account",
        "common",
        "nature",
        "found",
        "nuce",
        "aquinas",
        "de",
        "ente",
        "et",
        "essentia",
        "scotus",
        "account",
        "usually",
        "thought",
        "diverge",
        "aquinas",
        "least",
        "one",
        "crucial",
        "way",
        "according",
        "scotus",
        "aquinas",
        "following",
        "suggestion",
        "avicenna",
        "possible",
        "consider",
        "nature",
        "abstracting",
        "existence",
        "universal",
        "concept",
        "particular",
        "divided",
        "hence",
        "avicenna",
        "famous",
        "slogan",
        "equinity",
        "equinity",
        "avicenna",
        "liber",
        "de",
        "scientia",
        "divina",
        "v",
        "c",
        "avicenna",
        "lpp",
        "aquinas",
        "clear",
        "bare",
        "nature",
        "lack",
        "numerical",
        "unity",
        "see",
        "aquinas",
        "de",
        "ente",
        "et",
        "essentia",
        "c",
        "aquinas",
        "dee",
        "seems",
        "lack",
        "kind",
        "entity",
        "scotus",
        "ascribes",
        "nature",
        "kind",
        "entity",
        "unity",
        "short",
        "numerical",
        "unity",
        "aquinas",
        "neither",
        "perhaps",
        "worth",
        "noting",
        "passing",
        "plausible",
        "case",
        "made",
        "tracing",
        "moderate",
        "sort",
        "realism",
        "question",
        "universal",
        "aristotelian",
        "tradition",
        "specifically",
        "alexander",
        "aphrodisia",
        "see",
        "tweedale",
        "one",
        "might",
        "also",
        "argue",
        "famous",
        "commentator",
        "cajetan",
        "aquinas",
        "would",
        "willing",
        "attribute",
        "sort",
        "unity",
        "proportionally",
        "sort",
        "absolutely",
        "considered",
        "nature",
        "cajetan",
        "exposition",
        "issue",
        "carefully",
        "distinguishing",
        "aquinas",
        "scotus",
        "position",
        "useful",
        "reference",
        "author",
        "see",
        "cajetan",
        "cbe",
        "c",
        "nn",
        "pp",
        "scotus",
        "clearly",
        "tradition",
        "evidently",
        "considers",
        "sort",
        "account",
        "found",
        "aquinas",
        "insufficient",
        "thus",
        "clearly",
        "placed",
        "realist",
        "camp",
        "aquinas",
        "question",
        "far",
        "holding",
        "nature",
        "lack",
        "kind",
        "reality",
        "scotus",
        "hold",
        "primary",
        "reality",
        "nature",
        "belongs",
        "nature"
    ]
}