{
    "main_text": "Animal Models\n6. Animal Models\n\nNew therapies are often trialed using animal models before they are\ntested on humans in a randomized trial. Animal models also play\nimportant roles in establishing whether or not a substance is toxic\nfor humans. The International Agency for Research on Cancer (IARC),\nfor example, classifies substances with respect to the quality of the\nevidence for their carcinogenicity into five groups. Evidence from\nanimal models is referred to in the characterization of each group\n(IARC 2006). This raises questions about how such extrapolations from\nanimal models to humans work, and how reliable they are.\n\nAnimal models are widely used in biomedical research because\nexperimental interventions on animals are easier to conduct and\ncheaper than experiments on humans. Both kinds of experiments involve\nethical dilemmas, but animal experimentation is usually regarded as\nless problematic from an ethical point of view than experimentation\nwith humans. At any rate, the number of animals killed, maimed, or\nmade sick in biomedical research is much higher than the number of\nhumans adversely affected in this research.\n\nThere is a fundamental inferential problem in transferring what has\nbeen learned in any model (whether human, animal, or whatever) to some\ntarget population of interest has been described as the\n“experimenter’s circle” (Steel 2008). The problem is\nessentially this. What is true of a model can be presumed to be true\nof the target only to the extent that the model is similar to the\ntarget in relevant respects. The reason we experiment on models in the\nfirst place is, however, that the model differs in important respects\nfrom the target (if animals were just like humans, we would not find\nexperiments on the former to be ethically less problematic than\nexperiments on the latter). Extrapolation—the inference from\nmodel to target—is therefore only worthwhile to the extent that\nthere are significant limitations in our ability to study the target\ndirectly. If so, there can be no good grounds to decide whether a\nmodel is a good one for the target. To do so, we would have to\ninvestigate whether the target is relevantly similar to the model; but\nif we could do so, there would be no reason to study the model in the\nfirst place.\n\nThis inferential problem has led some commentators to maintain highly\nskeptical views concerning our ability to use animals as models for\nhumans in biomedical research. Hugh LaFollette and Niall Shanks argue\nthat animal models cannot be reliably used for extrapolation at all,\nbut at best only heuristically, as sources of hypotheses that have to\nbe tested on humans (LaFollette and Shanks 1997). They introduce two\nterms to make their argument: causal analogue model (CAM) and\nhypothetical analogue model (HAM). The former can be used to make\nreliable predictions about target populations of interest; the latter\nonly heuristically. The main premise in their argument that animal\nmodels in biomedical research are at best HAMs but not CAMs is that\nfor a model to be a CAM there cannot be causally relevant disanalogies\nbetween model and target—a condition which is rarely if ever met\nby animal models (again, this is why we study animals in the\nlaboratory in the first place).\n\nDaniel Steel (2008: ch. 5) argues that LaFollette and Shanks’\ncondition for reliable extrapolation is too stringent. Whether a claim\nabout a model can be extrapolated depends, he argues, also on the\nstrength of the claim to be exported. It is one thing, say, to reason\nfrom \n\nx% of the members of population p will show symptoms\nof poisoning after ingesting substance S \n\nto \n\nx% of the members of population \\(q \\ne p\\) will show\nsymptoms of poisoning after ingesting substance S, \n\nquite another to reason from the quantitative claim to a qualitative\nclaim such as “Substance S is poisonous for the members\nof q”.\n\nSteel’s own reconstruction of how extrapolation works in the\nbiomedical sciences is called comparative process tracing. He\nassumes that causes C (such as medical interventions or the\ningestion of toxic substances) bring about their effects E\n(such as the appearance of symptoms or improvements or deteriorations\nof symptoms) through a series of steps or stages. To trace a causal\nprocess means to investigate through what set of stages C\nbrings about E. Process tracing is comparative when the set\nof stages through which C brings about E in one\nspecies or population is compared to the set through which it does so\n(if it does so indeed) in another.\n\nComparative process tracing would be futile if, in order to know that\nC causes E in the target species or population, we\nwould have to compare all the stages of the process between\nmodel and target. This is because in order to do so, we would have to\nknow all stages of the process through which C causes\nE, but if we did, we would already know that C\ncauses E. This brings us back to the extrapolator’s\ncircle. Steel now argues that comparative process tracing avoids the\nextrapolator’s circle by demanding processes to be compared only\nat stages where they are likely to differ and assuming that\ndifferences between model and target matter only to stages that are\ndownstream from where they obtain. Thus, if we compare an intermediate\nstage of the process which obtains in the model with that stage in the\ntarget and find them to be relevantly similar, then the only\ndifferences that may still obtain will be downstream from this stage.\nWe therefore do not require knowledge of the entire process from\nC to E in the target, and the extrapolator’s\ncircle is successfully avoided.\n\nHow useful comparative process tracing is as a method for\nextrapolation for the biomedical sciences depends on how reliable the\nassumption that only downstream differences matter to extrapolation\nis, the reliability with which stages where there might be differences\nbetween model and target can be identified and the reliability of our\nmechanistic knowledge more generally. If, say, our reasons for\nsupposing that C causes E through a series of stages\nX, Y, Z in the model, or that X\nand Z are the stages where model and target are likely to\ndiffer, are not very strong, then the method does not get off the\nground. This is an issue that depends on the quality of the existing\nknowledge about a given case and cannot be addressed for the\nbiomedical sciences as a whole. There are certainly some examples of\nwell-established causal claims where it is known only that C\ncauses E but the details of the causal process are entirely\nbeyond our current grasp (Reiss forthcoming-a).\n\nAn alternative to comparative process tracing that has been\nproposed is extrapolation by knowledge of causal capacities.\nIf C has a causal capacity to bring about E, then\nC causes E in a somewhat stable or invariant manner.\nSpecifically, C will then continue to contribute to the\nproduction of E even when disturbing factors are present\n(Cartwright 1989). To establish that C has the causal\ncapacity to cause E therefore means to show that\nC’s causing E is independent of the background\nin which C and E occur to some extent. And\ntherefore, if C causes E in a model species or\npopulation and C has the causal capacity to bring about\nE, then there is some reason to believe that C\ncauses E also in the target species or population (for a\ndefense, see Cartwright 2011).\n\nThe usefulness of the method of extrapolation by causal capacities\ndepends, among other things, on the extent to which biomedical factors\ncan be characterized as having capacities. Many biomedical causes do\nindeed have some degree of stability. The sickle cell trait is 50%\nprotective against mild clinical malaria, 75% protective against\nadmission to the hospital for malaria, and almost 90% protective\nagainst severe or complicated malaria (Williams et al. 2005). These\nfigures suggest a reading along the lines of, \n\nin the presence of the sickle cell trait (a preventer of/disturbing\nfactor for malaria), infection with Plasmodium malaria\ncontinues to affect outcomes consistently. (Reiss 2015b: 19)\n\nBut there is a high degree of interaction with other factors as well.\nWhether or not a substance is toxic for an organism depends on minute\ndetails of its metabolic system, and unless the conditions are just\nright, the organism may not be affected by the substance at all. To\nwhat extent this method will be successful therefore similarly\ncase-dependent as comparative process tracing.\n\nAs we can see, there is no general answer to the question whether or not\nanimal studies are valuable from a purely epistemic (as opposed to\nethical, economic, or combined) view. Other authors have developed a\npractice-based taxonomy of animal modes to allow more accurate\nassessment of the epistemic merits and shortcomings, and predictive\ncapacities of specific modeling practices (Degeling and Johnson 2013).\nThere is much evidence that species differ enormously with respect to\ntheir susceptibility to have toxic reactions to substances. Thus,\nwhile it is very likely that for any one toxin, there is some species\nthat is predictive of the human response, it is often hard to tell\nwhich one is most appropriate for any particular toxin. A species that\npredicts the human response well for one substance may be a bad model\nfor another. However, some authors suggest that extrapolations \nfrom animal models have been made successfully in at least some cases (Steel 2008\ndiscusses the extrapolation of claims concerning the carcinogenicity\nof aflatoxin from Fisher rats to humans; see Reiss 2010a for a\ncritical appraisal and Steel 2013 for a response).\n",
    "section_title": "6. Animal Models",
    "entry_title": "Philosophy of Medicine",
    "hierarchy_title": "Philosophy of Medicine || Animal Models",
    "tokenized_text": [
        "animal",
        "model",
        "animal",
        "model",
        "new",
        "therapy",
        "often",
        "trialed",
        "using",
        "animal",
        "model",
        "tested",
        "human",
        "randomized",
        "trial",
        "animal",
        "model",
        "also",
        "play",
        "important",
        "role",
        "establishing",
        "whether",
        "substance",
        "toxic",
        "human",
        "international",
        "agency",
        "research",
        "cancer",
        "iarc",
        "example",
        "classifies",
        "substance",
        "respect",
        "quality",
        "evidence",
        "carcinogenicity",
        "five",
        "group",
        "evidence",
        "animal",
        "model",
        "referred",
        "characterization",
        "group",
        "iarc",
        "raise",
        "question",
        "extrapolation",
        "animal",
        "model",
        "human",
        "work",
        "reliable",
        "animal",
        "model",
        "widely",
        "used",
        "biomedical",
        "research",
        "experimental",
        "intervention",
        "animal",
        "easier",
        "conduct",
        "cheaper",
        "experiment",
        "human",
        "kind",
        "experiment",
        "involve",
        "ethical",
        "dilemma",
        "animal",
        "experimentation",
        "usually",
        "regarded",
        "le",
        "problematic",
        "ethical",
        "point",
        "view",
        "experimentation",
        "human",
        "rate",
        "number",
        "animal",
        "killed",
        "maimed",
        "made",
        "sick",
        "biomedical",
        "research",
        "much",
        "higher",
        "number",
        "human",
        "adversely",
        "affected",
        "research",
        "fundamental",
        "inferential",
        "problem",
        "transferring",
        "learned",
        "model",
        "whether",
        "human",
        "animal",
        "whatever",
        "target",
        "population",
        "interest",
        "described",
        "experimenter",
        "circle",
        "steel",
        "problem",
        "essentially",
        "true",
        "model",
        "presumed",
        "true",
        "target",
        "extent",
        "model",
        "similar",
        "target",
        "relevant",
        "respect",
        "reason",
        "experiment",
        "model",
        "first",
        "place",
        "however",
        "model",
        "differs",
        "important",
        "respect",
        "target",
        "animal",
        "like",
        "human",
        "would",
        "find",
        "experiment",
        "former",
        "ethically",
        "le",
        "problematic",
        "experiment",
        "latter",
        "extrapolationthe",
        "inference",
        "model",
        "targetis",
        "therefore",
        "worthwhile",
        "extent",
        "significant",
        "limitation",
        "ability",
        "study",
        "target",
        "directly",
        "good",
        "ground",
        "decide",
        "whether",
        "model",
        "good",
        "one",
        "target",
        "would",
        "investigate",
        "whether",
        "target",
        "relevantly",
        "similar",
        "model",
        "could",
        "would",
        "reason",
        "study",
        "model",
        "first",
        "place",
        "inferential",
        "problem",
        "led",
        "commentator",
        "maintain",
        "highly",
        "skeptical",
        "view",
        "concerning",
        "ability",
        "use",
        "animal",
        "model",
        "human",
        "biomedical",
        "research",
        "hugh",
        "lafollette",
        "niall",
        "shank",
        "argue",
        "animal",
        "model",
        "reliably",
        "used",
        "extrapolation",
        "best",
        "heuristically",
        "source",
        "hypothesis",
        "tested",
        "human",
        "lafollette",
        "shank",
        "introduce",
        "two",
        "term",
        "make",
        "argument",
        "causal",
        "analogue",
        "model",
        "cam",
        "hypothetical",
        "analogue",
        "model",
        "ham",
        "former",
        "used",
        "make",
        "reliable",
        "prediction",
        "target",
        "population",
        "interest",
        "latter",
        "heuristically",
        "main",
        "premise",
        "argument",
        "animal",
        "model",
        "biomedical",
        "research",
        "best",
        "ham",
        "cam",
        "model",
        "cam",
        "causally",
        "relevant",
        "disanalogies",
        "model",
        "targeta",
        "condition",
        "rarely",
        "ever",
        "met",
        "animal",
        "model",
        "study",
        "animal",
        "laboratory",
        "first",
        "place",
        "daniel",
        "steel",
        "ch",
        "argues",
        "lafollette",
        "shank",
        "condition",
        "reliable",
        "extrapolation",
        "stringent",
        "whether",
        "claim",
        "model",
        "extrapolated",
        "depends",
        "argues",
        "also",
        "strength",
        "claim",
        "exported",
        "one",
        "thing",
        "say",
        "reason",
        "x",
        "member",
        "population",
        "p",
        "show",
        "symptom",
        "poisoning",
        "ingesting",
        "substance",
        "x",
        "member",
        "population",
        "q",
        "ne",
        "p",
        "show",
        "symptom",
        "poisoning",
        "ingesting",
        "substance",
        "quite",
        "another",
        "reason",
        "quantitative",
        "claim",
        "qualitative",
        "claim",
        "substance",
        "poisonous",
        "member",
        "q",
        "steel",
        "reconstruction",
        "extrapolation",
        "work",
        "biomedical",
        "science",
        "called",
        "comparative",
        "process",
        "tracing",
        "assumes",
        "cause",
        "c",
        "medical",
        "intervention",
        "ingestion",
        "toxic",
        "substance",
        "bring",
        "effect",
        "e",
        "appearance",
        "symptom",
        "improvement",
        "deterioration",
        "symptom",
        "series",
        "step",
        "stage",
        "trace",
        "causal",
        "process",
        "mean",
        "investigate",
        "set",
        "stage",
        "c",
        "brings",
        "e",
        "process",
        "tracing",
        "comparative",
        "set",
        "stage",
        "c",
        "brings",
        "e",
        "one",
        "specie",
        "population",
        "compared",
        "set",
        "indeed",
        "another",
        "comparative",
        "process",
        "tracing",
        "would",
        "futile",
        "order",
        "know",
        "c",
        "cause",
        "e",
        "target",
        "specie",
        "population",
        "would",
        "compare",
        "stage",
        "process",
        "model",
        "target",
        "order",
        "would",
        "know",
        "stage",
        "process",
        "c",
        "cause",
        "e",
        "would",
        "already",
        "know",
        "c",
        "cause",
        "e",
        "brings",
        "u",
        "back",
        "extrapolator",
        "circle",
        "steel",
        "argues",
        "comparative",
        "process",
        "tracing",
        "avoids",
        "extrapolator",
        "circle",
        "demanding",
        "process",
        "compared",
        "stage",
        "likely",
        "differ",
        "assuming",
        "difference",
        "model",
        "target",
        "matter",
        "stage",
        "downstream",
        "obtain",
        "thus",
        "compare",
        "intermediate",
        "stage",
        "process",
        "obtains",
        "model",
        "stage",
        "target",
        "find",
        "relevantly",
        "similar",
        "difference",
        "may",
        "still",
        "obtain",
        "downstream",
        "stage",
        "therefore",
        "require",
        "knowledge",
        "entire",
        "process",
        "c",
        "e",
        "target",
        "extrapolator",
        "circle",
        "successfully",
        "avoided",
        "useful",
        "comparative",
        "process",
        "tracing",
        "method",
        "extrapolation",
        "biomedical",
        "science",
        "depends",
        "reliable",
        "assumption",
        "downstream",
        "difference",
        "matter",
        "extrapolation",
        "reliability",
        "stage",
        "might",
        "difference",
        "model",
        "target",
        "identified",
        "reliability",
        "mechanistic",
        "knowledge",
        "generally",
        "say",
        "reason",
        "supposing",
        "c",
        "cause",
        "e",
        "series",
        "stage",
        "x",
        "z",
        "model",
        "x",
        "z",
        "stage",
        "model",
        "target",
        "likely",
        "differ",
        "strong",
        "method",
        "get",
        "ground",
        "issue",
        "depends",
        "quality",
        "existing",
        "knowledge",
        "given",
        "case",
        "addressed",
        "biomedical",
        "science",
        "whole",
        "certainly",
        "example",
        "wellestablished",
        "causal",
        "claim",
        "known",
        "c",
        "cause",
        "e",
        "detail",
        "causal",
        "process",
        "entirely",
        "beyond",
        "current",
        "grasp",
        "reiss",
        "forthcominga",
        "alternative",
        "comparative",
        "process",
        "tracing",
        "proposed",
        "extrapolation",
        "knowledge",
        "causal",
        "capacity",
        "c",
        "causal",
        "capacity",
        "bring",
        "e",
        "c",
        "cause",
        "e",
        "somewhat",
        "stable",
        "invariant",
        "manner",
        "specifically",
        "c",
        "continue",
        "contribute",
        "production",
        "e",
        "even",
        "disturbing",
        "factor",
        "present",
        "cartwright",
        "establish",
        "c",
        "causal",
        "capacity",
        "cause",
        "e",
        "therefore",
        "mean",
        "show",
        "c",
        "causing",
        "e",
        "independent",
        "background",
        "c",
        "e",
        "occur",
        "extent",
        "therefore",
        "c",
        "cause",
        "e",
        "model",
        "specie",
        "population",
        "c",
        "causal",
        "capacity",
        "bring",
        "e",
        "reason",
        "believe",
        "c",
        "cause",
        "e",
        "also",
        "target",
        "specie",
        "population",
        "defense",
        "see",
        "cartwright",
        "usefulness",
        "method",
        "extrapolation",
        "causal",
        "capacity",
        "depends",
        "among",
        "thing",
        "extent",
        "biomedical",
        "factor",
        "characterized",
        "capacity",
        "many",
        "biomedical",
        "cause",
        "indeed",
        "degree",
        "stability",
        "sickle",
        "cell",
        "trait",
        "protective",
        "mild",
        "clinical",
        "malaria",
        "protective",
        "admission",
        "hospital",
        "malaria",
        "almost",
        "protective",
        "severe",
        "complicated",
        "malaria",
        "williams",
        "et",
        "al",
        "figure",
        "suggest",
        "reading",
        "along",
        "line",
        "presence",
        "sickle",
        "cell",
        "trait",
        "preventer",
        "ofdisturbing",
        "factor",
        "malaria",
        "infection",
        "plasmodium",
        "malaria",
        "continues",
        "affect",
        "outcome",
        "consistently",
        "reiss",
        "b",
        "high",
        "degree",
        "interaction",
        "factor",
        "well",
        "whether",
        "substance",
        "toxic",
        "organism",
        "depends",
        "minute",
        "detail",
        "metabolic",
        "system",
        "unless",
        "condition",
        "right",
        "organism",
        "may",
        "affected",
        "substance",
        "extent",
        "method",
        "successful",
        "therefore",
        "similarly",
        "casedependent",
        "comparative",
        "process",
        "tracing",
        "see",
        "general",
        "answer",
        "question",
        "whether",
        "animal",
        "study",
        "valuable",
        "purely",
        "epistemic",
        "opposed",
        "ethical",
        "economic",
        "combined",
        "view",
        "author",
        "developed",
        "practicebased",
        "taxonomy",
        "animal",
        "mode",
        "allow",
        "accurate",
        "assessment",
        "epistemic",
        "merit",
        "shortcoming",
        "predictive",
        "capacity",
        "specific",
        "modeling",
        "practice",
        "degeling",
        "johnson",
        "much",
        "evidence",
        "specie",
        "differ",
        "enormously",
        "respect",
        "susceptibility",
        "toxic",
        "reaction",
        "substance",
        "thus",
        "likely",
        "one",
        "toxin",
        "specie",
        "predictive",
        "human",
        "response",
        "often",
        "hard",
        "tell",
        "one",
        "appropriate",
        "particular",
        "toxin",
        "specie",
        "predicts",
        "human",
        "response",
        "well",
        "one",
        "substance",
        "may",
        "bad",
        "model",
        "another",
        "however",
        "author",
        "suggest",
        "extrapolation",
        "animal",
        "model",
        "made",
        "successfully",
        "least",
        "case",
        "steel",
        "discus",
        "extrapolation",
        "claim",
        "concerning",
        "carcinogenicity",
        "aflatoxin",
        "fisher",
        "rat",
        "human",
        "see",
        "reiss",
        "a",
        "critical",
        "appraisal",
        "steel",
        "response"
    ]
}