{
    "main_text": "Silver Age of Scholasticism || Francis Suárez (b. 1548, d. 1617)\n6.1 Francis Suárez (b. 1548, d. 1617)\n\n\nSuárez deals with categories in some detail in Disputation 39\nof the Metaphysical Disputations (henceforth DM), although he\nalso makes pertinent comments about them elsewhere (for example, in DE\nq. 75, a. 1, d. 47, s. 1, n. 4; 1861 vol. 21, p. 45a). In Metaphysical\nDisputation 39, he is primarily concerned with the division of\naccidents into nine highest genera, and the discussion of categories\nis incidental and indirect, rather than deliberate and\nexplicit. Nonetheless, it is clear that Suárez is concerned\nwith the ontological status of categories in this text.  Indeed, he\nexplicitly adopts a certain language in order to clarify and resolve\nthe issue.\n\n\nSeveral aspects of Suárez's doctrine reveal his overall\nposition. Three of these are particularly enlightening: First, the\ndistinction between supreme genera and categories; second, the\nrespective disciplines where these are studied; and third, the kind of\ndistinction that obtains between categories themselves.\n\n\nMedieval authors frequently use, interchangeably, the expressions\n‘supreme genus’ [generalissimum] and\n‘category’ (praedicamentum). The fact that these\nterms are interchanged indicates that those who use\nthem regard them as equivalent at least in certain contexts.\nSuárez is no exception; he often uses one term in place of the\nother. But there is a difference, for Suárez is aware of the\ndifference in terminology and explicitly distinguishes between the two\nexpressions. In a revealing passage, he tells us that “a category\nis nothing other than the appropriate disposition of genera\nand species from a supreme genus to individuals” (DM 39, 1; 1861,\n25:504b; our emphasis). This text makes clear that a category is not a\ngenus insofar as categories are dispositions of genera and\nspecies. Genera are not dispositions, whereas categories are. This\nmeans that, strictly speaking, categories cannot be supreme genera. In\nanother text Suárez is even more explicit:\n\n\n[A] category is nothing other than the appropriate\ndisposition and coordination of essential predicates, of\nwhich those which are predicated essentially of the individual are\nplaced above it, in a direct line, going up from the lower to the\nhigher; and this line, just as it does not begin but with the lowest,\nthat is the individual, does not end but in a highest genus …\n.” (DM 39, 2, 30; 1861, 25:518; our emphasis)\n\n\nHere, Suárez repeats that categories are dispositions, but he\nadds another important term, ‘coordination.’ A category is\nnot properly speaking a genus, but rather the coordination or, we might\nsay, the arrangement of genera according to a pattern of essential\ninclusion which goes from the lowest to the highest (see Ockham 1991,\nV, q. 21, for a precedent to this language). We take it that\nSuárez means to say that categories such as quality and\nquantity, for example, are not themselves genera, but ways in\nwhich genera are related. Quality tells us how color\nis related to red and blue on the one hand (i.e.,\nlower species), and to texture and knowledge (i.e.,\nother genera) on the other. Red and blue are both\ncolors, but different from rough (a kind of texture) and\nknowledge of grammar (a kind of knowledge). But all these are\nqualities and different from three-inches wide, which is\ninstead a quantity. Quality and quantity, then, do\nnot function like genera, for a genus is signified by any predicate\nthat expresses what a subject is (e.g., in the sentence, ‘Man is\nan animal,’ ‘animal’ is the genus of man), and\ncategories do not function in this way. Following Porphyry's\nexample, the highest or supreme (generalissimum) genus is\nsubstance.\n\n\nThis brings us to the discipline under which categories are studied.\nSuárez tells us that the division into nine highest\ngenera–he is speaking of accidental genera, although what he\nsays also applies mutatis mutandis to substance–is\nproposed not only by metaphysicians, but also by logicians in treatises\non categories. Consequently, in one way it properly belongs to first\nphilosophy, that is, metaphysics, rather than logic. The reason is\nthat, whereas the metaphysician studies the ten supreme genera in order\nto explain their natures and essences, the logician does not have this\naim in mind. Logic is directed toward the operations of the mind,\nrather than toward natures and essences, and its purpose is to\nestablish rational ways of thinking. Logic deals with the concepts of\nthe mind insofar as these concepts can be arranged in accordance with\ncertain rules (DM 39, 1; 1861, 25:504b).\n\n\nIn another way, however, the categories are also studied in logic,\nnot in metaphysics, because they are mental concepts, and logic is\nconcerned with the proper analysis of concepts to determine their form\nand with the proper arrangement of concepts to determine their\nrelations. But this is not the whole story, for Suárez also\nspeaks of the ten supreme genera, and the study of these belongs to\nmetaphysics. Moreover, there is also another important point, which is\nmade explicit in the following text:\n\n\nBecause mental concepts are about real things, and are founded on\nreal things, [the logician also] treats of real things, although not to\nexplain their essences and natures, but only in order to coordinate the\nconcepts in the mind; and in this sense he deals with the ten [supreme]\ngenera in order to establish the ten categories. (DM 39, 1; 1861,\n25:504b)\n\n\nThe logician treats of categories, which are ways in which concepts\nare appropriately arranged in the mind. However, because these concepts\nreflect the ways things are in reality, that is, the natures and\nessences of things in the world, the logician also deals, albeit only\nindirectly, with these natures and essences in order to be able to\nintroduce the proper order among them in the mind. The metaphysician,\non the other hand, deals directly with the ten supreme genera, not with\nways of arranging concepts in the mind, for the purpose of metaphysics\nis to determine the essences of things.\n\n\nSuárez makes an interesting aside in the discussion. He tells\nus that some authors mistakenly consider categories to be names, and\nonly names. This mistake arises because they look at categories only\nfrom the point of view of the logician, and the logician, qua logician,\nis not concerned with an ordering on the basis of the essences of\nthings but on the basis of the essences of names (DM 39, 1; 1861,\n25:505a).\n\n\nThe view that categories are concepts is supported further in his\ndiscussion of the distinction among categories. Suárez, like the\nother scholastics who precede him, holds that\ncategories are primarily diverse. This means that they share no common\nproperty or genus. Naturally, the question as to the source and nature\nof their diversity comes up, and Suárez discusses it in some\ndetail. For us, the important point is the nature of the distinction\namong categories themselves. Suárez rejects two opinions with\nrespect to this issue. According to one, a real distinction between the\nthings contained under a genus is necessary (DM 39, 2, 19; 1861, 25:\n515a). According to another opinion, the distinction between supreme\ngenera must be modal, actual, and ex natura rei, and must\nprecede in reality the operation of the mind (DM 39, 2, 20; 1861,\n25:515b).\n\n\nThe view Suárez proposes holds that categories are\ndistinguished according to “our way of conceiving, founded in\nreality. Some call this kind of distinction a distinction of reasoned\nreason, whereas others call it formal distinction” (DM 39, 2, 22;\n1861, 25:516b). The distinction of reasoned reason is, according to\nSuárez, a conceptual distinction. Conceptual distinctions come\nin two varieties: One is the distinction of reasoned reason and the\nother the distinction of reasoning reason. The second has no basis in\nreality but is purely a creation of the mind; it arises out of the\nintellect's activity of comparing, which makes possible its\ninfinite multiplication (DM 39, 2, 23; 1861, 25:517a). An example is\nthe distinction between Peter and himself in order to say that he is\nidentical to himself. The first, however, the distinction of reasoned\nreason, has a foundation in reality, even if the distinction itself is\nmerely conceptual. This is the kind of distinction that we make when we\nthink about God's attributes, for example. The foundation of this\ndistinction in the case of categories must be sufficient to allow\nrelations or modes of denomination of primary substance that are\nirreducible to one generic concept (DM 39, 2, 23; 1861, 25:517a).\n\n\nThis is obviously not enough to clarify the issue. The question\nremains: What is this foundation in reality which is the basis of the\ndenomination? It cannot be a category itself, for categories for\nSuárez are concepts and the product of conception and\nabstraction (DM 39, 2, 23; 1861, 25:517a). And it cannot be a reality\nwhich is exactly represented by the distinction, for then the\ndistinction would be real rather than conceptual. So what is it?\n\n\nThe point to consider is that a distinction of reasoned reason has\nsome basis in reality, even though the distinction itself is a concept\nin the mind, resulting from some comparison or of thinking about\nsomething. Now we can go back to categories and apply what we have\nlearned about the distinction of reasoned reason to them. Categories\nare ways in which humans conceive the world based on certain\ncomparisons that the mind carries out between other concepts, but these\nother concepts have reference in the world. An example would help, but\nthe one of God and His properties, which Suárez gives, is of no\ngreat use because of its uniqueness. Let us try to make up one that\nperhaps Suárez would accept.\n\n\nConsider the category quality. For Suárez,\nquality is a concept which the mind develops based on the\nmind's consideration of the relations between certain concepts,\nsuch as red, blue, grammatical, and so on,\non the one hand, and certain other concepts on the other, such as\nthree meters long, yesterday, woman, and so\non. In other words, quality tells us something about the first set of\nconcepts and their relations to other concepts. But the concepts\nbetween which relations are established have instances in reality,\noutside the mind, though not qua concepts. Red, as\nuniversal, is not to be found outside the mind. Nonetheless, there are\nred things in the world and each of them is an individual instance of\nthe universal red. This means that quality, in spite\nof being a concept based on the relation between concepts is\nnonetheless related, via those concepts, to the world outside the mind.\nAnd the same applies to the other concepts. So here we have the\nfoundation in reality of the category quality.\n",
    "section_title": "6.1 Francis Suárez (b. 1548, d. 1617)",
    "entry_title": "Medieval Theories of the Categories",
    "hierarchy_title": "Medieval Theories of the Categories || Silver Age of Scholasticism || Francis Suárez (b. 1548, d. 1617)",
    "tokenized_text": [
        "silver",
        "age",
        "scholasticism",
        "francis",
        "suárez",
        "b",
        "d",
        "francis",
        "suárez",
        "b",
        "d",
        "suárez",
        "deal",
        "category",
        "detail",
        "disputation",
        "metaphysical",
        "disputation",
        "henceforth",
        "dm",
        "although",
        "also",
        "make",
        "pertinent",
        "comment",
        "elsewhere",
        "example",
        "de",
        "q",
        "d",
        "s",
        "n",
        "vol",
        "p",
        "a",
        "metaphysical",
        "disputation",
        "primarily",
        "concerned",
        "division",
        "accident",
        "nine",
        "highest",
        "genus",
        "discussion",
        "category",
        "incidental",
        "indirect",
        "rather",
        "deliberate",
        "explicit",
        "nonetheless",
        "clear",
        "suárez",
        "concerned",
        "ontological",
        "status",
        "category",
        "text",
        "indeed",
        "explicitly",
        "adopts",
        "certain",
        "language",
        "order",
        "clarify",
        "resolve",
        "issue",
        "several",
        "aspect",
        "suárez",
        "s",
        "doctrine",
        "reveal",
        "overall",
        "position",
        "three",
        "particularly",
        "enlightening",
        "first",
        "distinction",
        "supreme",
        "genus",
        "category",
        "second",
        "respective",
        "discipline",
        "studied",
        "third",
        "kind",
        "distinction",
        "obtains",
        "category",
        "medieval",
        "author",
        "frequently",
        "use",
        "interchangeably",
        "expression",
        "supreme",
        "genus",
        "generalissimum",
        "category",
        "praedicamentum",
        "fact",
        "term",
        "interchanged",
        "indicates",
        "use",
        "regard",
        "equivalent",
        "least",
        "certain",
        "context",
        "suárez",
        "exception",
        "often",
        "us",
        "one",
        "term",
        "place",
        "difference",
        "suárez",
        "aware",
        "difference",
        "terminology",
        "explicitly",
        "distinguishes",
        "two",
        "expression",
        "revealing",
        "passage",
        "tell",
        "u",
        "category",
        "nothing",
        "appropriate",
        "disposition",
        "genus",
        "specie",
        "supreme",
        "genus",
        "individual",
        "dm",
        "b",
        "emphasis",
        "text",
        "make",
        "clear",
        "category",
        "genus",
        "insofar",
        "category",
        "disposition",
        "genus",
        "specie",
        "genus",
        "disposition",
        "whereas",
        "category",
        "mean",
        "strictly",
        "speaking",
        "category",
        "supreme",
        "genus",
        "another",
        "text",
        "suárez",
        "even",
        "explicit",
        "category",
        "nothing",
        "appropriate",
        "disposition",
        "coordination",
        "essential",
        "predicate",
        "predicated",
        "essentially",
        "individual",
        "placed",
        "direct",
        "line",
        "going",
        "lower",
        "higher",
        "line",
        "begin",
        "lowest",
        "individual",
        "end",
        "highest",
        "genus",
        "dm",
        "emphasis",
        "suárez",
        "repeat",
        "category",
        "disposition",
        "add",
        "another",
        "important",
        "term",
        "coordination",
        "category",
        "properly",
        "speaking",
        "genus",
        "rather",
        "coordination",
        "might",
        "say",
        "arrangement",
        "genus",
        "according",
        "pattern",
        "essential",
        "inclusion",
        "go",
        "lowest",
        "highest",
        "see",
        "ockham",
        "v",
        "q",
        "precedent",
        "language",
        "take",
        "suárez",
        "mean",
        "say",
        "category",
        "quality",
        "quantity",
        "example",
        "genus",
        "way",
        "genus",
        "related",
        "quality",
        "tell",
        "u",
        "color",
        "related",
        "red",
        "blue",
        "one",
        "hand",
        "ie",
        "lower",
        "specie",
        "texture",
        "knowledge",
        "ie",
        "genus",
        "red",
        "blue",
        "color",
        "different",
        "rough",
        "kind",
        "texture",
        "knowledge",
        "grammar",
        "kind",
        "knowledge",
        "quality",
        "different",
        "threeinches",
        "wide",
        "instead",
        "quantity",
        "quality",
        "quantity",
        "function",
        "like",
        "genus",
        "genus",
        "signified",
        "predicate",
        "express",
        "subject",
        "eg",
        "sentence",
        "man",
        "animal",
        "animal",
        "genus",
        "man",
        "category",
        "function",
        "way",
        "following",
        "porphyry",
        "s",
        "example",
        "highest",
        "supreme",
        "generalissimum",
        "genus",
        "substance",
        "brings",
        "u",
        "discipline",
        "category",
        "studied",
        "suárez",
        "tell",
        "u",
        "division",
        "nine",
        "highest",
        "generahe",
        "speaking",
        "accidental",
        "genus",
        "although",
        "say",
        "also",
        "applies",
        "mutatis",
        "mutandis",
        "substanceis",
        "proposed",
        "metaphysicians",
        "also",
        "logician",
        "treatise",
        "category",
        "consequently",
        "one",
        "way",
        "properly",
        "belongs",
        "first",
        "philosophy",
        "metaphysics",
        "rather",
        "logic",
        "reason",
        "whereas",
        "metaphysician",
        "study",
        "ten",
        "supreme",
        "genus",
        "order",
        "explain",
        "nature",
        "essence",
        "logician",
        "aim",
        "mind",
        "logic",
        "directed",
        "toward",
        "operation",
        "mind",
        "rather",
        "toward",
        "nature",
        "essence",
        "purpose",
        "establish",
        "rational",
        "way",
        "thinking",
        "logic",
        "deal",
        "concept",
        "mind",
        "insofar",
        "concept",
        "arranged",
        "accordance",
        "certain",
        "rule",
        "dm",
        "b",
        "another",
        "way",
        "however",
        "category",
        "also",
        "studied",
        "logic",
        "metaphysics",
        "mental",
        "concept",
        "logic",
        "concerned",
        "proper",
        "analysis",
        "concept",
        "determine",
        "form",
        "proper",
        "arrangement",
        "concept",
        "determine",
        "relation",
        "whole",
        "story",
        "suárez",
        "also",
        "speaks",
        "ten",
        "supreme",
        "genus",
        "study",
        "belongs",
        "metaphysics",
        "moreover",
        "also",
        "another",
        "important",
        "point",
        "made",
        "explicit",
        "following",
        "text",
        "mental",
        "concept",
        "real",
        "thing",
        "founded",
        "real",
        "thing",
        "logician",
        "also",
        "treat",
        "real",
        "thing",
        "although",
        "explain",
        "essence",
        "nature",
        "order",
        "coordinate",
        "concept",
        "mind",
        "sense",
        "deal",
        "ten",
        "supreme",
        "genus",
        "order",
        "establish",
        "ten",
        "category",
        "dm",
        "b",
        "logician",
        "treat",
        "category",
        "way",
        "concept",
        "appropriately",
        "arranged",
        "mind",
        "however",
        "concept",
        "reflect",
        "way",
        "thing",
        "reality",
        "nature",
        "essence",
        "thing",
        "world",
        "logician",
        "also",
        "deal",
        "albeit",
        "indirectly",
        "nature",
        "essence",
        "order",
        "able",
        "introduce",
        "proper",
        "order",
        "among",
        "mind",
        "metaphysician",
        "hand",
        "deal",
        "directly",
        "ten",
        "supreme",
        "genus",
        "way",
        "arranging",
        "concept",
        "mind",
        "purpose",
        "metaphysics",
        "determine",
        "essence",
        "thing",
        "suárez",
        "make",
        "interesting",
        "aside",
        "discussion",
        "tell",
        "u",
        "author",
        "mistakenly",
        "consider",
        "category",
        "name",
        "name",
        "mistake",
        "arises",
        "look",
        "category",
        "point",
        "view",
        "logician",
        "logician",
        "qua",
        "logician",
        "concerned",
        "ordering",
        "basis",
        "essence",
        "thing",
        "basis",
        "essence",
        "name",
        "dm",
        "a",
        "view",
        "category",
        "concept",
        "supported",
        "discussion",
        "distinction",
        "among",
        "category",
        "suárez",
        "like",
        "scholastic",
        "precede",
        "hold",
        "category",
        "primarily",
        "diverse",
        "mean",
        "share",
        "common",
        "property",
        "genus",
        "naturally",
        "question",
        "source",
        "nature",
        "diversity",
        "come",
        "suárez",
        "discus",
        "detail",
        "u",
        "important",
        "point",
        "nature",
        "distinction",
        "among",
        "category",
        "suárez",
        "reject",
        "two",
        "opinion",
        "respect",
        "issue",
        "according",
        "one",
        "real",
        "distinction",
        "thing",
        "contained",
        "genus",
        "necessary",
        "dm",
        "a",
        "according",
        "another",
        "opinion",
        "distinction",
        "supreme",
        "genus",
        "must",
        "modal",
        "actual",
        "ex",
        "natura",
        "rei",
        "must",
        "precede",
        "reality",
        "operation",
        "mind",
        "dm",
        "b",
        "view",
        "suárez",
        "proposes",
        "hold",
        "category",
        "distinguished",
        "according",
        "way",
        "conceiving",
        "founded",
        "reality",
        "call",
        "kind",
        "distinction",
        "distinction",
        "reasoned",
        "reason",
        "whereas",
        "others",
        "call",
        "formal",
        "distinction",
        "dm",
        "b",
        "distinction",
        "reasoned",
        "reason",
        "according",
        "suárez",
        "conceptual",
        "distinction",
        "conceptual",
        "distinction",
        "come",
        "two",
        "variety",
        "one",
        "distinction",
        "reasoned",
        "reason",
        "distinction",
        "reasoning",
        "reason",
        "second",
        "basis",
        "reality",
        "purely",
        "creation",
        "mind",
        "arises",
        "intellect",
        "s",
        "activity",
        "comparing",
        "make",
        "possible",
        "infinite",
        "multiplication",
        "dm",
        "a",
        "example",
        "distinction",
        "peter",
        "order",
        "say",
        "identical",
        "first",
        "however",
        "distinction",
        "reasoned",
        "reason",
        "foundation",
        "reality",
        "even",
        "distinction",
        "merely",
        "conceptual",
        "kind",
        "distinction",
        "make",
        "think",
        "god",
        "s",
        "attribute",
        "example",
        "foundation",
        "distinction",
        "case",
        "category",
        "must",
        "sufficient",
        "allow",
        "relation",
        "mode",
        "denomination",
        "primary",
        "substance",
        "irreducible",
        "one",
        "generic",
        "concept",
        "dm",
        "a",
        "obviously",
        "enough",
        "clarify",
        "issue",
        "question",
        "remains",
        "foundation",
        "reality",
        "basis",
        "denomination",
        "category",
        "category",
        "suárez",
        "concept",
        "product",
        "conception",
        "abstraction",
        "dm",
        "a",
        "reality",
        "exactly",
        "represented",
        "distinction",
        "distinction",
        "would",
        "real",
        "rather",
        "conceptual",
        "point",
        "consider",
        "distinction",
        "reasoned",
        "reason",
        "basis",
        "reality",
        "even",
        "though",
        "distinction",
        "concept",
        "mind",
        "resulting",
        "comparison",
        "thinking",
        "something",
        "go",
        "back",
        "category",
        "apply",
        "learned",
        "distinction",
        "reasoned",
        "reason",
        "category",
        "way",
        "human",
        "conceive",
        "world",
        "based",
        "certain",
        "comparison",
        "mind",
        "carry",
        "concept",
        "concept",
        "reference",
        "world",
        "example",
        "would",
        "help",
        "one",
        "god",
        "property",
        "suárez",
        "give",
        "great",
        "use",
        "uniqueness",
        "let",
        "u",
        "try",
        "make",
        "one",
        "perhaps",
        "suárez",
        "would",
        "accept",
        "consider",
        "category",
        "quality",
        "suárez",
        "quality",
        "concept",
        "mind",
        "develops",
        "based",
        "mind",
        "s",
        "consideration",
        "relation",
        "certain",
        "concept",
        "red",
        "blue",
        "grammatical",
        "one",
        "hand",
        "certain",
        "concept",
        "three",
        "meter",
        "long",
        "yesterday",
        "woman",
        "word",
        "quality",
        "tell",
        "u",
        "something",
        "first",
        "set",
        "concept",
        "relation",
        "concept",
        "concept",
        "relation",
        "established",
        "instance",
        "reality",
        "outside",
        "mind",
        "though",
        "qua",
        "concept",
        "red",
        "universal",
        "found",
        "outside",
        "mind",
        "nonetheless",
        "red",
        "thing",
        "world",
        "individual",
        "instance",
        "universal",
        "red",
        "mean",
        "quality",
        "spite",
        "concept",
        "based",
        "relation",
        "concept",
        "nonetheless",
        "related",
        "via",
        "concept",
        "world",
        "outside",
        "mind",
        "applies",
        "concept",
        "foundation",
        "reality",
        "category",
        "quality"
    ]
}