{
    "main_text": "Later medieval and early modern accounts of haecceities\n5. Rejecting haecceities\n\nSetting aside the complexities of a later thinker such as Fonseca, the\nyears immediately after Scotus saw something of a move towards a more\nnominalist view on the question of universals – the view (on the\nunderstanding of ‘nominalism’ relevant here) that\nuniversals are just concepts. Amongst opponents of Scotus, the most\ncommon strategy was to adopt the view that substances themselves are\nprimarily diverse, such that their distinction is not explained by any\nreal feature or property of them other than merely the substance\nitself. For example, according to Peter Auriol writing in the decade\nafter Scotus’ death,\n\nobjects are singular by themselves, and … this singularity is a\nbasic fact that needs no further explanation…. Maintaining that\nan object is singular or individual because it results from or is\nendowed with a proper principle of individuation which is itself\nsingular, amounts to nothing more than duplicating what should be\nexplained. (Nielsen [2003], 498)\n\n\nPrimitive distinction must occur somewhere – so why not make it\nat the level of the substance itself, rather than of some constituent\nof the substance? Rejection of Scotus’s view was not confined to such\nmanifest opponents of Scotus’s system. Amongst the earliest students\nof Scotus, various found his views on the haecceity and its formal\ndistinction from the nature unpalatable. William of Alnwick, the\nforemost of Scotus’s students working through the second decade of the\nfourteenth century, holds at least two different positions, neither\nthe same as Scotus’s. In an early disputed question on individuation,\nWilliam holds that natures are individual of themselves (Stella\n[1968], 363); later, in his Ordinatio on the\nSentences, William accepts something akin to Henry of Ghent’s\nposition that individuation is by a negation, though adding the\nclarification that this negation represents nevertheless a perfection\n– it is better not to have the positive feature of divisibility\n(Stella [1968], 630–631). The reason for the shift in view is an\napprehension that the fact that natures can be multiplied (i.e.\nexemplified many times) entails that a nature cannot be\nself-individuating (Stella [1968], 628). But William cannot see how\nthe added feature could be anything positive, since he does not see\nhow an individual could be anything, necessarily, other than its\nnature (Stella [1968], 631). In both works, William objects to\nScotus’s view that the common nature is somehow prior to its\ninstantiations, on the grounds that this priority entails that the\ncommon nature could exist without any of its instantiations (Stella\n[1968], 352, 625). This in effect amounts – in Scotist terms\n– to the claim that the nature is really distinct, not just\nformally distinct, from any of its instantiations. For Scotus, the\nmark of a formal distinction is inseparability: no individual is\nseparable from its nature, and there is thus no more than a formal\ndistinction in any individual between nature and haecceity. Ockham\nputs his finger on this misinterpretation on the part of Alnwick:\n\nOn this question there is one theory attributed by some people [viz.\nWilliam of Alnwick] to the Subtle Doctor [i.e. Scotus] …. This\nis the theory that the universal is a true being outside the soul,\nreally distinct from a contracting difference but really multiplied\nand varied by such a contracting difference. (Ockham,\nOrdinatio I, d. 2, q. 5, n. 6 (William of Ockham [OT], 2:154,\nll. 1–2, 3–7; Spade (1994), 149))\n\n\nAs Ockham rightly implies, this is not Scotus’s view. A position not\ndissimilar to William’s earlier, nominalist, view can be found in\nanother prominent early student of Scotus’s – Henry of Harclay\n(see Henninger [1994]; for Ockham’s rejection of the way in which\nHarclay develops his nominalist theory, see Ockham, Ordinatio\nI, d. 2, q. 7, nn. 11–12, 63–82 (William of Ockham [OT],\n2:227, l. 15–p. 228, l. 20, p. 241, l. 21–p. 248, l. 21;\nSpade (1994), 191–192, 200–204); see too Adams\n[1982]).\n\nOckham himself, writing 1321–1323, raises an array of arguments\nagainst Scotus’s position. Ockham was a thinker explicitly influenced\nby Scotus in all sorts of ways, while nevertheless rejecting the\nfundamental feature of Scotist metaphysics and semantics, namely\nrealism on the question of common natures. Without exception, the\narguments target one of the following two Scotist positions: the\ncommonality of the nature, and the formal distinction. As such, Ockham\ndoes not attack haecceities, though in so far as Scotus’s account of\nhaecceities requires both his distinctive account of the divisibility\nof a nature, and the formal distinction between nature and haecceity,\nOckham’s attacks will harm Scotus’s haecceities too. Ockham offers no\nfewer than four arguments against common natures with less than\nnumerical unity (Ockham, Ordinatio I, d. 2, q. 6, nn. 51, 62,\n78, 82 (William of Ockham [OT], 2:181, ll. 8–13, p. 184, ll.\n11–13, p. 189, ll. 10–14, p. 190, ll. 18–22; Spade\n(1994), 161, 163, 166, 167)). The key one is the second: humanity in\nSocrates and humanity in Plato are numerically distinct, and\nessentially so. So there is nothing in common between these\nhumanities. Ockham’s first and longest argument against Scotus takes\nissue with the formal distinction. Against the formal distinction of\nreally identical entities, Ockham persistently appeals to the\nindiscernibility of identicals, arguing that there is no kind of\nidentity mid-way between real identity and real distinction: see\nOckham, Ordinatio I, d. 2, q. 6, nn. 25–8, 83 (William\nof Ockham [OT], 2:173, l. 11–p. 174, l. 12, p. 190, l. 23–p.\n191, l. 4; Spade (1994), 118, 127)). As Marilyn Adams has pointed out,\nthis strategy seems to beg the question against Scotus (Adams [1982],\n420).\n\nOckham’s more parsimonious ontology is important in the attempt to\nunderstand the nature of the opposition to Scotus just outlined.\nOckham is sometimes presented as though his distinctive position on\nthe question of individuation is simply the result of his distinctive\nnominalist position on the question of universals. Thus Armand Maurer,\nin a generally very helpful account of Ockham’s position:\n\nThe problem of individuation, in the usual sense of the term, does not\narise in Ockham’s philosophy. The problem occurs when a philosopher\nmaintains that there are natures or essences in individuals, in some\nway common the individuals and yet diversified in them…. Given\nthe commonness of [e.g] animality, what makes the individual animal to\nbe the individual it is? (Maurer [1994], 373)\n\n\nThis is not quite right. For while Ockham does not need an account of\nindivisibility (since a tenet of Ockham’s nominalism on the question\nof universals is that nothing real is divisible into subjective\nparts), he certainly needs an account of the distinction of one\nsubstance from another, as Black’s reflections on the principle of the\nidentity of indiscernibles forcefully show. In fact, Ockham claims\nthat a substance is singular through itself (“se\nipso”: Ockham, Ordinatio I, d. 2, q. 6, n.\n105–107 (William of Ockham [OT], 2:196, ll. 2–12; Spade\n(1994), 171)). And it seems to me that this claim does indeed\nconstitute an attempt at a solution to the problem of distinction. For\nOckham is a nominalist about many more properties than Scotus is, as\nwell as being a nominalist on the question of universals. Thus, Ockham\nbelieves that the set of those predicates that involve no ontological\ncommitment (that is to say, predicates that do not signify anything\nextramental other than merely the substance itself) includes the\nAristotelian genus, specific difference, and proprium\n(necessary but non-defining property) (see e.g. Moody [1935], 97–106,\n145–51). Substances themselves are primarily diverse according\nto Ockham – their distinction from each other is not explained\nby anything other than their own self-identity, and ipso\nfacto not by any qualitative or relational feature of themselves.\nSelf-identity is not, however, a real feature of the substance in any\nsense distinct from itself or its nature. And this is the result not\nof Ockham’s nominalism on the question of universals, but of his\nnominalism on the question of inseparable properties. And much the\nsame seems true of the other opponents of Scotus mentioned above.\n\nOckham’s position thus turns out to be a variety of haecceitism (in a\nmore modern sense of the word). Maintaining that substances are\nprimarily diverse does not amount to having no theory of\nindividuation. Indeed, it presumably entails that their diversity is\nnot explained by, say, qualitative distinction. Thus, Ockham holds\nthat two things, each per se singular, can be\n“precisely similar” to each other (Ockham,\nOrdinatio I, d. 2, q. 6, n. 108 (William of Ockham [OT],\n2:196, l. 17; Spade (1994), 171)). And this seems to entail some form\nof haecceitism. The difference between this view and that of Scotus is\nthat the haecceity defended by Scotus is – in some minimal way\n– hypostatized. Some modern accounts of haecceities\nresemble Ockham’s view more than Scotus’s: the uniquely instantiable,\nnon-qualitative property of (say) being identical with Socrates\n– Socrates’s haecceity (in the modern terminology) – does\nnot carry the kind of ontological weight that Scotus wants to place on\nhaecceities as he understands them:\n\nIt may be controversial to speak of a ‘property’ of being\nidentical with me. I want the word ‘property’ to carry as\nlight a metaphysical load here as possible. ‘Thisness’ is\nintended to be a synonym or translation of the traditional term\n‘haecceity’ (in Latin, ‘haecceitas’),\nwhich so far as I know was invented by Duns Scotus. Like many medieval\nphilosophers, Scotus regarded properties as components of the things\nthat have them. He introduced haecceities (thisnesses), accordingly,\nas a special sort of metaphysical component of individuals. I am not\nproposing to revive this aspect of his conception of a haecceity,\nbecause I am not committed to regarding properties as components of\nindividuals. To deny that thisnesses are purely qualitative is not\nnecessarily to postulate “bare particulars,” substrata\nwithout qualities of their own, which would be what was left of the\nindividual when all its qualitative properties were subtracted.\nConversely, to hold that thisnesses are purely qualitative is not to\nimply that individuals are nothing but bundles of qualities, for\nqualities may not be components of individuals at all. We could\nprobably conduct our investigation, in somewhat different terms,\nwithout referring to thisnesses as properties. (Adams [1979],\n6–7)\n\n\nNote, of course, that Scotus’s account of the common nature also\nentails something stronger than Adams is proposing: indeed, it entails\nprecisely the sort of minimal hypostatization that Scotus advocates.\nAnd the reason for this, of course, is Scotus’s view that individual\nsubstances cannot themselves be primarily diverse – a fact that\nis explained by his claim that common natures have some sort of unity\nin their instantiations: the nature in Socrates is (non-numerically)\nthe same as the nature in Plato. Natures, for Scotus, cannot\nbe primarily diverse; substances must include more than natures. But\nindividual natures in Ockham’s view can indeed be primarily diverse,\nand this surely amounts to a form of haecceitism – nothing other\nthan an individual nature’s own self-identity explains its distinction\nfrom all other such natures. Maintaining that individual natures are\nprimarily diverse amounts not to having no theory of individuation,\nbut to accepting a form of haecceitism that, like Adams’s, does not\ninvolve ontological commitment to the existence of haecceities as\ndistinct real constituents of things. The result, as in Adams, is that\nthe identity of indiscernibles is false even in Scotus’s rather\ntrivial sense.\n",
    "section_title": "5. Rejecting haecceities",
    "entry_title": "Medieval Theories of Haecceity",
    "hierarchy_title": "Medieval Theories of Haecceity || Later medieval and early modern accounts of haecceities",
    "tokenized_text": [
        "later",
        "medieval",
        "early",
        "modern",
        "account",
        "haecceity",
        "rejecting",
        "haecceity",
        "setting",
        "aside",
        "complexity",
        "later",
        "thinker",
        "fonseca",
        "year",
        "immediately",
        "scotus",
        "saw",
        "something",
        "move",
        "towards",
        "nominalist",
        "view",
        "question",
        "universal",
        "view",
        "understanding",
        "nominalism",
        "relevant",
        "universal",
        "concept",
        "amongst",
        "opponent",
        "scotus",
        "common",
        "strategy",
        "adopt",
        "view",
        "substance",
        "primarily",
        "diverse",
        "distinction",
        "explained",
        "real",
        "feature",
        "property",
        "merely",
        "substance",
        "example",
        "according",
        "peter",
        "auriol",
        "writing",
        "decade",
        "scotus",
        "death",
        "object",
        "singular",
        "singularity",
        "basic",
        "fact",
        "need",
        "explanation",
        "maintaining",
        "object",
        "singular",
        "individual",
        "result",
        "endowed",
        "proper",
        "principle",
        "individuation",
        "singular",
        "amount",
        "nothing",
        "duplicating",
        "explained",
        "nielsen",
        "primitive",
        "distinction",
        "must",
        "occur",
        "somewhere",
        "make",
        "level",
        "substance",
        "rather",
        "constituent",
        "substance",
        "rejection",
        "scotus",
        "view",
        "confined",
        "manifest",
        "opponent",
        "scotus",
        "system",
        "amongst",
        "earliest",
        "student",
        "scotus",
        "various",
        "found",
        "view",
        "haecceity",
        "formal",
        "distinction",
        "nature",
        "unpalatable",
        "william",
        "alnwick",
        "foremost",
        "scotus",
        "student",
        "working",
        "second",
        "decade",
        "fourteenth",
        "century",
        "hold",
        "least",
        "two",
        "different",
        "position",
        "neither",
        "scotus",
        "early",
        "disputed",
        "question",
        "individuation",
        "william",
        "hold",
        "nature",
        "individual",
        "stella",
        "later",
        "ordinatio",
        "sentence",
        "william",
        "accepts",
        "something",
        "akin",
        "henry",
        "ghent",
        "position",
        "individuation",
        "negation",
        "though",
        "adding",
        "clarification",
        "negation",
        "represents",
        "nevertheless",
        "perfection",
        "better",
        "positive",
        "feature",
        "divisibility",
        "stella",
        "reason",
        "shift",
        "view",
        "apprehension",
        "fact",
        "nature",
        "multiplied",
        "ie",
        "exemplified",
        "many",
        "time",
        "entail",
        "nature",
        "selfindividuating",
        "stella",
        "william",
        "see",
        "added",
        "feature",
        "could",
        "anything",
        "positive",
        "since",
        "see",
        "individual",
        "could",
        "anything",
        "necessarily",
        "nature",
        "stella",
        "work",
        "william",
        "object",
        "scotus",
        "view",
        "common",
        "nature",
        "somehow",
        "prior",
        "instantiation",
        "ground",
        "priority",
        "entail",
        "common",
        "nature",
        "could",
        "exist",
        "without",
        "instantiation",
        "stella",
        "effect",
        "amount",
        "scotist",
        "term",
        "claim",
        "nature",
        "really",
        "distinct",
        "formally",
        "distinct",
        "instantiation",
        "scotus",
        "mark",
        "formal",
        "distinction",
        "inseparability",
        "individual",
        "separable",
        "nature",
        "thus",
        "formal",
        "distinction",
        "individual",
        "nature",
        "haecceity",
        "ockham",
        "put",
        "finger",
        "misinterpretation",
        "part",
        "alnwick",
        "question",
        "one",
        "theory",
        "attributed",
        "people",
        "viz",
        "william",
        "alnwick",
        "subtle",
        "doctor",
        "ie",
        "scotus",
        "theory",
        "universal",
        "true",
        "outside",
        "soul",
        "really",
        "distinct",
        "contracting",
        "difference",
        "really",
        "multiplied",
        "varied",
        "contracting",
        "difference",
        "ockham",
        "ordinatio",
        "d",
        "q",
        "n",
        "william",
        "ockham",
        "ot",
        "spade",
        "ockham",
        "rightly",
        "implies",
        "scotus",
        "view",
        "position",
        "dissimilar",
        "william",
        "earlier",
        "nominalist",
        "view",
        "found",
        "another",
        "prominent",
        "early",
        "student",
        "scotus",
        "henry",
        "harclay",
        "see",
        "henninger",
        "ockham",
        "rejection",
        "way",
        "harclay",
        "develops",
        "nominalist",
        "theory",
        "see",
        "ockham",
        "ordinatio",
        "d",
        "q",
        "nn",
        "william",
        "ockham",
        "ot",
        "l",
        "p",
        "l",
        "p",
        "l",
        "p",
        "l",
        "spade",
        "see",
        "adam",
        "ockham",
        "writing",
        "raise",
        "array",
        "argument",
        "scotus",
        "position",
        "ockham",
        "thinker",
        "explicitly",
        "influenced",
        "scotus",
        "sort",
        "way",
        "nevertheless",
        "rejecting",
        "fundamental",
        "feature",
        "scotist",
        "metaphysics",
        "semantics",
        "namely",
        "realism",
        "question",
        "common",
        "nature",
        "without",
        "exception",
        "argument",
        "target",
        "one",
        "following",
        "two",
        "scotist",
        "position",
        "commonality",
        "nature",
        "formal",
        "distinction",
        "ockham",
        "attack",
        "haecceity",
        "though",
        "far",
        "scotus",
        "account",
        "haecceity",
        "requires",
        "distinctive",
        "account",
        "divisibility",
        "nature",
        "formal",
        "distinction",
        "nature",
        "haecceity",
        "ockham",
        "attack",
        "harm",
        "scotus",
        "haecceity",
        "ockham",
        "offer",
        "fewer",
        "four",
        "argument",
        "common",
        "nature",
        "le",
        "numerical",
        "unity",
        "ockham",
        "ordinatio",
        "d",
        "q",
        "nn",
        "william",
        "ockham",
        "ot",
        "p",
        "p",
        "p",
        "spade",
        "key",
        "one",
        "second",
        "humanity",
        "socrates",
        "humanity",
        "plato",
        "numerically",
        "distinct",
        "essentially",
        "nothing",
        "common",
        "humanity",
        "ockham",
        "first",
        "longest",
        "argument",
        "scotus",
        "take",
        "issue",
        "formal",
        "distinction",
        "formal",
        "distinction",
        "really",
        "identical",
        "entity",
        "ockham",
        "persistently",
        "appeal",
        "indiscernibility",
        "identicals",
        "arguing",
        "kind",
        "identity",
        "midway",
        "real",
        "identity",
        "real",
        "distinction",
        "see",
        "ockham",
        "ordinatio",
        "d",
        "q",
        "nn",
        "william",
        "ockham",
        "ot",
        "l",
        "p",
        "l",
        "p",
        "l",
        "p",
        "l",
        "spade",
        "marilyn",
        "adam",
        "pointed",
        "strategy",
        "seems",
        "beg",
        "question",
        "scotus",
        "adam",
        "ockham",
        "parsimonious",
        "ontology",
        "important",
        "attempt",
        "understand",
        "nature",
        "opposition",
        "scotus",
        "outlined",
        "ockham",
        "sometimes",
        "presented",
        "though",
        "distinctive",
        "position",
        "question",
        "individuation",
        "simply",
        "result",
        "distinctive",
        "nominalist",
        "position",
        "question",
        "universal",
        "thus",
        "armand",
        "maurer",
        "generally",
        "helpful",
        "account",
        "ockham",
        "position",
        "problem",
        "individuation",
        "usual",
        "sense",
        "term",
        "arise",
        "ockham",
        "philosophy",
        "problem",
        "occurs",
        "philosopher",
        "maintains",
        "nature",
        "essence",
        "individual",
        "way",
        "common",
        "individual",
        "yet",
        "diversified",
        "them",
        "given",
        "commonness",
        "eg",
        "animality",
        "make",
        "individual",
        "animal",
        "individual",
        "maurer",
        "quite",
        "right",
        "ockham",
        "need",
        "account",
        "indivisibility",
        "since",
        "tenet",
        "ockham",
        "nominalism",
        "question",
        "universal",
        "nothing",
        "real",
        "divisible",
        "subjective",
        "part",
        "certainly",
        "need",
        "account",
        "distinction",
        "one",
        "substance",
        "another",
        "black",
        "reflection",
        "principle",
        "identity",
        "indiscernibles",
        "forcefully",
        "show",
        "fact",
        "ockham",
        "claim",
        "substance",
        "singular",
        "se",
        "ipso",
        "ockham",
        "ordinatio",
        "d",
        "q",
        "n",
        "william",
        "ockham",
        "ot",
        "spade",
        "seems",
        "claim",
        "indeed",
        "constitute",
        "attempt",
        "solution",
        "problem",
        "distinction",
        "ockham",
        "nominalist",
        "many",
        "property",
        "scotus",
        "well",
        "nominalist",
        "question",
        "universal",
        "thus",
        "ockham",
        "belief",
        "set",
        "predicate",
        "involve",
        "ontological",
        "commitment",
        "say",
        "predicate",
        "signify",
        "anything",
        "extramental",
        "merely",
        "substance",
        "includes",
        "aristotelian",
        "genus",
        "specific",
        "difference",
        "proprium",
        "necessary",
        "nondefining",
        "property",
        "see",
        "eg",
        "moody",
        "substance",
        "primarily",
        "diverse",
        "according",
        "ockham",
        "distinction",
        "explained",
        "anything",
        "selfidentity",
        "ipso",
        "facto",
        "qualitative",
        "relational",
        "feature",
        "selfidentity",
        "however",
        "real",
        "feature",
        "substance",
        "sense",
        "distinct",
        "nature",
        "result",
        "ockham",
        "nominalism",
        "question",
        "universal",
        "nominalism",
        "question",
        "inseparable",
        "property",
        "much",
        "seems",
        "true",
        "opponent",
        "scotus",
        "mentioned",
        "ockham",
        "position",
        "thus",
        "turn",
        "variety",
        "haecceitism",
        "modern",
        "sense",
        "word",
        "maintaining",
        "substance",
        "primarily",
        "diverse",
        "amount",
        "theory",
        "individuation",
        "indeed",
        "presumably",
        "entail",
        "diversity",
        "explained",
        "say",
        "qualitative",
        "distinction",
        "thus",
        "ockham",
        "hold",
        "two",
        "thing",
        "per",
        "se",
        "singular",
        "precisely",
        "similar",
        "ockham",
        "ordinatio",
        "d",
        "q",
        "n",
        "william",
        "ockham",
        "ot",
        "l",
        "spade",
        "seems",
        "entail",
        "form",
        "haecceitism",
        "difference",
        "view",
        "scotus",
        "haecceity",
        "defended",
        "scotus",
        "minimal",
        "way",
        "hypostatized",
        "modern",
        "account",
        "haecceity",
        "resemble",
        "ockham",
        "view",
        "scotus",
        "uniquely",
        "instantiable",
        "nonqualitative",
        "property",
        "say",
        "identical",
        "socrates",
        "socrates",
        "haecceity",
        "modern",
        "terminology",
        "carry",
        "kind",
        "ontological",
        "weight",
        "scotus",
        "want",
        "place",
        "haecceity",
        "understands",
        "may",
        "controversial",
        "speak",
        "property",
        "identical",
        "want",
        "word",
        "property",
        "carry",
        "light",
        "metaphysical",
        "load",
        "possible",
        "thisness",
        "intended",
        "synonym",
        "translation",
        "traditional",
        "term",
        "haecceity",
        "latin",
        "haecceitas",
        "far",
        "know",
        "invented",
        "dun",
        "scotus",
        "like",
        "many",
        "medieval",
        "philosopher",
        "scotus",
        "regarded",
        "property",
        "component",
        "thing",
        "introduced",
        "haecceity",
        "thisnesses",
        "accordingly",
        "special",
        "sort",
        "metaphysical",
        "component",
        "individual",
        "proposing",
        "revive",
        "aspect",
        "conception",
        "haecceity",
        "committed",
        "regarding",
        "property",
        "component",
        "individual",
        "deny",
        "thisnesses",
        "purely",
        "qualitative",
        "necessarily",
        "postulate",
        "bare",
        "particular",
        "substrata",
        "without",
        "quality",
        "would",
        "left",
        "individual",
        "qualitative",
        "property",
        "subtracted",
        "conversely",
        "hold",
        "thisnesses",
        "purely",
        "qualitative",
        "imply",
        "individual",
        "nothing",
        "bundle",
        "quality",
        "quality",
        "may",
        "component",
        "individual",
        "could",
        "probably",
        "conduct",
        "investigation",
        "somewhat",
        "different",
        "term",
        "without",
        "referring",
        "thisnesses",
        "property",
        "adam",
        "note",
        "course",
        "scotus",
        "account",
        "common",
        "nature",
        "also",
        "entail",
        "something",
        "stronger",
        "adam",
        "proposing",
        "indeed",
        "entail",
        "precisely",
        "sort",
        "minimal",
        "hypostatization",
        "scotus",
        "advocate",
        "reason",
        "course",
        "scotus",
        "view",
        "individual",
        "substance",
        "primarily",
        "diverse",
        "fact",
        "explained",
        "claim",
        "common",
        "nature",
        "sort",
        "unity",
        "instantiation",
        "nature",
        "socrates",
        "nonnumerically",
        "nature",
        "plato",
        "nature",
        "scotus",
        "primarily",
        "diverse",
        "substance",
        "must",
        "include",
        "nature",
        "individual",
        "nature",
        "ockham",
        "view",
        "indeed",
        "primarily",
        "diverse",
        "surely",
        "amount",
        "form",
        "haecceitism",
        "nothing",
        "individual",
        "nature",
        "selfidentity",
        "explains",
        "distinction",
        "nature",
        "maintaining",
        "individual",
        "nature",
        "primarily",
        "diverse",
        "amount",
        "theory",
        "individuation",
        "accepting",
        "form",
        "haecceitism",
        "like",
        "adam",
        "involve",
        "ontological",
        "commitment",
        "existence",
        "haecceity",
        "distinct",
        "real",
        "constituent",
        "thing",
        "result",
        "adam",
        "identity",
        "indiscernibles",
        "false",
        "even",
        "scotus",
        "rather",
        "trivial",
        "sense"
    ]
}