{
    "main_text": "The Early Commentators on the Prior Analytics\n5. The Early Commentators on the Prior Analytics\n\nThe first known commentary on the Prior Analytics in the\nLatin West is an anonymous work that has recently been edited (Thomsen\nThörnqvist 2015) but is not yet fully studied (see Thomsen\nThörnqvist 2010 and 2013 for more details). The author has been\ncalled Anonymous Aurelianensis III by Sten Ebbesen, who studied parts\nof the work (Ebbesen 1981). He dates it to c. 1160–80. The\ntheory of the assertoric syllogism was repeated and summarized in\nalmost all logic works from this time, but there are no other major\nLatin commentaries that we know of until the 1240’s when Robert\nKilwardby (d. 1279) wrote his Literal Commentary on the Books of\nthe Prior Analytics (In libros Priorum Analyticorum\nexpositio). \n\nBy the time Kilwardby wrote his commentary, however, a Latin\ntranslation of a commentary by Averroes on the Prior\nAnalytics was becoming known in the West. Averroes wrote three\nkinds of commentaries on Aristotle’s works, called\n‘minor’, ‘middle’, and ‘major’ or\n‘great’ based on their length and detail. In the 1220s and\n1230s, William of Luna translated Averroes’ middle commentary on\nPorphyry’s Isagoge as well as his middle commentaries\non Aristotle’s Categories, On Interpretation,\nand Prior Analytics. In addition to these, a major commentary\non the Posterior Analytics also became available. In the\nmiddle commentaries, Averroes does not go much beyond Aristotle,\nadhering closely to the letter of Aristotle’s text and deviating only\non occasion. Nevertheless, his commentaries played an indispensable\nrole throughout the later Middle Ages in the teaching and study of\nthese difficult texts.\n\nOne thing Averroes does do in these commentaries, however, is to build\na strong connection between logic and a realist metaphysics, which had\na clear influence on thirteenth-century logicians in the Latin West\n(Lagerlund 2000, 2008). In particular, Averroes’s treatment of modal\nsyllogistics is profoundly metaphysical. In his commentary on the\nPrior Analytics, he pursues a line of interpretation which is\nmore developed in the Quaesitum, a short treatise on mixed\nsyllogisms (see Uckelman and Lagerlund 2016). In the\nQuaesitum, Averroes focuses on modal syllogistics and\ndevelops an interpretation based on the metaphysical nature of the\nterms involved in different syllogisms. It has been claimed that this\nshort work is the final result of his inquiries into modal\nsyllogistics (Elamrani-Jamal 1995, p.74). The Quaesitum has\nbeen studied by scholars in detail insofar as it clearly influenced\nRobert Kilwardby (c. 1215–79) (Lagerlund 2000, 32–35; Thom 2003,\n81–91; Lagerlund 2008, 300–302). Although Kilwardby added nothing of\nsubstance to the theory of the assertoric syllogism, his\ninterpretation of modal syllogistic is quite remarkable. It was also\nvery influential in the thirteenth and early fourteenth centuries.\nAlbert the Great, Simon of Faversham, and Radulphus Brito — in\nother words, all of the major thirteenth-century commentators on the\nPrior Analytics — followed Kilwardby in their\ninterpretations.\n\nThroughout the commentary, Kilwardby assumes that Aristotle’s theory\nis correct and makes it his project to find the interpretation that\nshows this. He begins by considering a counterexample to the\naccidental conversion of necessity sentences:\n\n(5:1)\nEvery literate being is necessarily a human being.\n\n\nAccording to the conversion rules accepted by Kilwardby, (5:1) should\nconvert to:\n\n(5:2)\nSome human being is necessarily literate.\n\n\nBut (5:1) is obviously true whereas (5:2) is false.\n\nAs we have seen, this is a common issue for de re readings of\nthe modal sentences. Kilwardby assumes that Aristotle’s modal\nsyllogistic is a logic for divided (de re) sentences. He\nproceeds to give two separate solutions to this puzzle. The first is\nbased on a distinction between different readings of (5:1). Kilwardby\nexplains that the subject term of a sentence can stand for the subject\nof the inherence (the suppositum), or for the qualification\nthrough which the subject is specified (qualitas/forma). If\nthe term ‘white’ stands for its suppositum, it\nrefers to a thing that is white or to ‘that which is\nwhite’, but if it stands for the quality or form, it refers to\nthe whiteness inhering in that which is white, rather than to the\nthing in which it inheres. Kilwardby says that in (5:1),\n‘literate being’ stands for its suppositum, which\nexplains why (5:1) is true, whereas in (5:2) the term is taken\ndifferently as standing for the quality or form. According to\nKilwardby, the meaning of the original subject term is changed when it\nno longer stands for the suppositum (literate being), but for\nthe abstract quality of being literate, and it is this change that\nblocks the conversion. (5:2) is true if it is read as:\n\n(5:3)\nSomething that is a human being is necessarily that which is literate.\n\n\nKilwardby, however, preferred another solution to these difficulties\nfor the conversion rules of necessity sentences. The second solution\nis based on a distinction between sentences that are necessary per\nse and those that are necessary per accidens. He writes\n(I, fol. 7rb):\n\nWhen it is said: ‘Every literate being is necessarily a human\nbeing’, the subject is not something that can be said per\nse of the predicate, but since ‘literate being’ is\nnot separated from what belongs to a human being in itself, the\nsentence is conceded as necessary, though when a sentence is necessary\nin this way it is necessary per accidens. Therefore, when\nAristotle says that necessity sentences are convertible, he means only\nsentences necessary per se are convertible.\n\n\nThe idea is here that since ‘human being’ is not\npredicated per se of its subject ‘literate\nbeing’, the sentence (5:1) is not a per se necessity\nsentence and therefore not convertible. (5:1) is a necessity sentence,\nthough of the per accidens type, since it is necessarily true\nonly in the sense that being human and being literate are not\nseparable. Kilwardby implies that the relation between the subject and\npredicate terms must be of a special kind if a sentence is to be\ncalled necessary per se. In (5:1), ‘literate\nbeing’ and ‘human being’ do not have the close\nper se relation Kilwardby demands of a convertible\nsentence.\n\nKilwardby thinks that sentences per se should be understood\nfollowing An. Post. I.4–6, where Aristotle discusses\nfour different notions of per se (kath’ hauto)\npredication, though Kilwardby seems only to have the first two in mind\nwhen discussing per se necessity. Aristotle says that the\nfirst type of per se predication (per se primo modo)\noccurs when the definition of the subject includes the predicate. The\nsecond type of per se predication (per se secundo\nmodo) occurs when the definition of the predicate includes the\nsubject. The best characterization of the first type is the\ngenus/species relation, where the definition of a species includes its\ngenus. The second type is often characterized by a proprium\n(property), since a proprium is included in the definition of\na subject, as in ‘a human being is able to laugh’, where\nthe term ‘human being’ is included in the definition of\nthe predicate ‘able to laugh’. A sentence is per\nse necessary if it involves either of these two predications,\naccording to Kilwardby. Necessity per accidens belongs to all\nother necessity sentences, which lack this intrinsic relation between\nsubject and predicate.\n\nKilwardby also stresses that in a per se necessity sentence,\nthe subject must be ‘something belonging in itself to that\npredicate’ (‘per se aliquod ipsius\npredicati’), by which he seems to mean that the subject has\nthe predicate as an essential property, i.e., such that it has the\npredicate as a necessary property through itself and not through\nsomething else. A syllogistic necessity sentence is then understood as\na proposition expressing the essential properties of a thing in a\ngenus/species relationship. He seems to assume that in a per\nse necessity sentence, the subject term is not an accidental term\nbut an essential or necessary term, and that the subject is\nessentially (per se) linked to the predicate rather than\nmerely through the weaker relation of inseparability. Consequently, if\nthe subject term is necessary and the link is necessary, it follows\nthat the predicate term cannot be merely a contingent (accidental)\nterm. It must be necessary as well. The Aristotelian theory of\nnecessity syllogistic is thus limited to a special class of terms, all\nof which stand for substances. The same terminology is also used to\nexplain syllogistic for contingency sentences, which suggests that\nKilwardby was trying to develop a uniform and highly original\ninterpretation of the theory. A number of recent scholars have offered\nsimilar interpretations of Aristotle (see van Rijen 1989, Patterson\n1995, Thom 1996, and Nortmann 1996).\n\nWhen they interpreted Aristotle’s modal syllogistic, most medievals\nsaw the need to introduce a distinction between different kinds of\nassertoric sentences. In the mixed syllogism L–L (L represents a\nnecessity sentence), the assertoric minor premise cannot be any kind\nof assertoric sentence because then the terms could merely be\naccidentally connected. Kilwardby therefore introduced a distinction\nbetween absolutely (simpliciter) and as-of-now (ut\nnunc) assertoric sentences. The origins of this distinction can\nbe found in Aristotle (An. Pr. I.15, 34b7–18), but\nKilwardby of course uses his own per se/per accidens\nterminology to spell out the difference. An absolutely assertoric\nsentence involves a per se predication whereas an as-of-now\nassertoric sentence involves a per accidens predication. In\nthis way, he can guarantee that an essential connection between the\nterms in a valid L–L syllogisms is preserved through to the\nconclusion. This is not unproblematic (see Lagerlund 2000,\n39–42), though the distinction between different assertoric\nsentences needed somehow to be made and remained a problem throughout\nthe later Middle Ages.\n\nIn the end, Kilwardby did not arrive at just the moods accepted by\nAristotle. For example, he accepts –LL for the first figure,\nwhich is not accepted by Aristotle, and does not manage to get\n–CC and LCC for Disamis in the third figure. There are also some\nother moods he does not succeed in validating and others still he\ngrants but which are not accepted by Aristotle. But perhaps Kilwardby\ngets as close as one can possibly get to making Aristotle’s system\nconsistent. (See Knuuttila 1996, Lagerlund 2000, and Thom 2003 and\n2007.)\n",
    "section_title": "5. The Early Commentators on the Prior Analytics",
    "entry_title": "Medieval Theories of the Syllogism",
    "hierarchy_title": "Medieval Theories of the Syllogism || The Early Commentators on the Prior Analytics",
    "tokenized_text": [
        "early",
        "commentator",
        "prior",
        "analytics",
        "early",
        "commentator",
        "prior",
        "analytics",
        "first",
        "known",
        "commentary",
        "prior",
        "analytics",
        "latin",
        "west",
        "anonymous",
        "work",
        "recently",
        "edited",
        "thomsen",
        "thörnqvist",
        "yet",
        "fully",
        "studied",
        "see",
        "thomsen",
        "thörnqvist",
        "detail",
        "author",
        "called",
        "anonymous",
        "aurelianensis",
        "iii",
        "sten",
        "ebbesen",
        "studied",
        "part",
        "work",
        "ebbesen",
        "date",
        "c",
        "theory",
        "assertoric",
        "syllogism",
        "repeated",
        "summarized",
        "almost",
        "logic",
        "work",
        "time",
        "major",
        "latin",
        "commentary",
        "know",
        "robert",
        "kilwardby",
        "d",
        "wrote",
        "literal",
        "commentary",
        "book",
        "prior",
        "analytics",
        "libros",
        "priorum",
        "analyticorum",
        "expositio",
        "time",
        "kilwardby",
        "wrote",
        "commentary",
        "however",
        "latin",
        "translation",
        "commentary",
        "averroes",
        "prior",
        "analytics",
        "becoming",
        "known",
        "west",
        "averroes",
        "wrote",
        "three",
        "kind",
        "commentary",
        "aristotle",
        "work",
        "called",
        "minor",
        "middle",
        "major",
        "great",
        "based",
        "length",
        "detail",
        "s",
        "s",
        "william",
        "luna",
        "translated",
        "averroes",
        "middle",
        "commentary",
        "porphyry",
        "isagoge",
        "well",
        "middle",
        "commentary",
        "aristotle",
        "category",
        "interpretation",
        "prior",
        "analytics",
        "addition",
        "major",
        "commentary",
        "posterior",
        "analytics",
        "also",
        "became",
        "available",
        "middle",
        "commentary",
        "averroes",
        "go",
        "much",
        "beyond",
        "aristotle",
        "adhering",
        "closely",
        "letter",
        "aristotle",
        "text",
        "deviating",
        "occasion",
        "nevertheless",
        "commentary",
        "played",
        "indispensable",
        "role",
        "throughout",
        "later",
        "middle",
        "age",
        "teaching",
        "study",
        "difficult",
        "text",
        "one",
        "thing",
        "averroes",
        "commentary",
        "however",
        "build",
        "strong",
        "connection",
        "logic",
        "realist",
        "metaphysics",
        "clear",
        "influence",
        "thirteenthcentury",
        "logician",
        "latin",
        "west",
        "lagerlund",
        "particular",
        "averroes",
        "treatment",
        "modal",
        "syllogistics",
        "profoundly",
        "metaphysical",
        "commentary",
        "prior",
        "analytics",
        "pursues",
        "line",
        "interpretation",
        "developed",
        "quaesitum",
        "short",
        "treatise",
        "mixed",
        "syllogism",
        "see",
        "uckelman",
        "lagerlund",
        "quaesitum",
        "averroes",
        "focus",
        "modal",
        "syllogistics",
        "develops",
        "interpretation",
        "based",
        "metaphysical",
        "nature",
        "term",
        "involved",
        "different",
        "syllogism",
        "claimed",
        "short",
        "work",
        "final",
        "result",
        "inquiry",
        "modal",
        "syllogistics",
        "elamranijamal",
        "p",
        "quaesitum",
        "studied",
        "scholar",
        "detail",
        "insofar",
        "clearly",
        "influenced",
        "robert",
        "kilwardby",
        "c",
        "lagerlund",
        "thom",
        "lagerlund",
        "although",
        "kilwardby",
        "added",
        "nothing",
        "substance",
        "theory",
        "assertoric",
        "syllogism",
        "interpretation",
        "modal",
        "syllogistic",
        "quite",
        "remarkable",
        "also",
        "influential",
        "thirteenth",
        "early",
        "fourteenth",
        "century",
        "albert",
        "great",
        "simon",
        "faversham",
        "radulphus",
        "brito",
        "word",
        "major",
        "thirteenthcentury",
        "commentator",
        "prior",
        "analytics",
        "followed",
        "kilwardby",
        "interpretation",
        "throughout",
        "commentary",
        "kilwardby",
        "assumes",
        "aristotle",
        "theory",
        "correct",
        "make",
        "project",
        "find",
        "interpretation",
        "show",
        "begin",
        "considering",
        "counterexample",
        "accidental",
        "conversion",
        "necessity",
        "sentence",
        "every",
        "literate",
        "necessarily",
        "human",
        "according",
        "conversion",
        "rule",
        "accepted",
        "kilwardby",
        "convert",
        "human",
        "necessarily",
        "literate",
        "obviously",
        "true",
        "whereas",
        "false",
        "seen",
        "common",
        "issue",
        "de",
        "reading",
        "modal",
        "sentence",
        "kilwardby",
        "assumes",
        "aristotle",
        "modal",
        "syllogistic",
        "logic",
        "divided",
        "de",
        "sentence",
        "proceeds",
        "give",
        "two",
        "separate",
        "solution",
        "puzzle",
        "first",
        "based",
        "distinction",
        "different",
        "reading",
        "kilwardby",
        "explains",
        "subject",
        "term",
        "sentence",
        "stand",
        "subject",
        "inherence",
        "suppositum",
        "qualification",
        "subject",
        "specified",
        "qualitasforma",
        "term",
        "white",
        "stand",
        "suppositum",
        "refers",
        "thing",
        "white",
        "white",
        "stand",
        "quality",
        "form",
        "refers",
        "whiteness",
        "inhering",
        "white",
        "rather",
        "thing",
        "inheres",
        "kilwardby",
        "say",
        "literate",
        "stand",
        "suppositum",
        "explains",
        "true",
        "whereas",
        "term",
        "taken",
        "differently",
        "standing",
        "quality",
        "form",
        "according",
        "kilwardby",
        "meaning",
        "original",
        "subject",
        "term",
        "changed",
        "longer",
        "stand",
        "suppositum",
        "literate",
        "abstract",
        "quality",
        "literate",
        "change",
        "block",
        "conversion",
        "true",
        "read",
        "something",
        "human",
        "necessarily",
        "literate",
        "kilwardby",
        "however",
        "preferred",
        "another",
        "solution",
        "difficulty",
        "conversion",
        "rule",
        "necessity",
        "sentence",
        "second",
        "solution",
        "based",
        "distinction",
        "sentence",
        "necessary",
        "per",
        "se",
        "necessary",
        "per",
        "accidens",
        "writes",
        "fol",
        "rb",
        "said",
        "every",
        "literate",
        "necessarily",
        "human",
        "subject",
        "something",
        "said",
        "per",
        "se",
        "predicate",
        "since",
        "literate",
        "separated",
        "belongs",
        "human",
        "sentence",
        "conceded",
        "necessary",
        "though",
        "sentence",
        "necessary",
        "way",
        "necessary",
        "per",
        "accidens",
        "therefore",
        "aristotle",
        "say",
        "necessity",
        "sentence",
        "convertible",
        "mean",
        "sentence",
        "necessary",
        "per",
        "se",
        "convertible",
        "idea",
        "since",
        "human",
        "predicated",
        "per",
        "se",
        "subject",
        "literate",
        "sentence",
        "per",
        "se",
        "necessity",
        "sentence",
        "therefore",
        "convertible",
        "necessity",
        "sentence",
        "though",
        "per",
        "accidens",
        "type",
        "since",
        "necessarily",
        "true",
        "sense",
        "human",
        "literate",
        "separable",
        "kilwardby",
        "implies",
        "relation",
        "subject",
        "predicate",
        "term",
        "must",
        "special",
        "kind",
        "sentence",
        "called",
        "necessary",
        "per",
        "se",
        "literate",
        "human",
        "close",
        "per",
        "se",
        "relation",
        "kilwardby",
        "demand",
        "convertible",
        "sentence",
        "kilwardby",
        "think",
        "sentence",
        "per",
        "se",
        "understood",
        "following",
        "post",
        "i",
        "aristotle",
        "discus",
        "four",
        "different",
        "notion",
        "per",
        "se",
        "kath",
        "hauto",
        "predication",
        "though",
        "kilwardby",
        "seems",
        "first",
        "two",
        "mind",
        "discussing",
        "per",
        "se",
        "necessity",
        "aristotle",
        "say",
        "first",
        "type",
        "per",
        "se",
        "predication",
        "per",
        "se",
        "primo",
        "modo",
        "occurs",
        "definition",
        "subject",
        "includes",
        "predicate",
        "second",
        "type",
        "per",
        "se",
        "predication",
        "per",
        "se",
        "secundo",
        "modo",
        "occurs",
        "definition",
        "predicate",
        "includes",
        "subject",
        "best",
        "characterization",
        "first",
        "type",
        "genusspecies",
        "relation",
        "definition",
        "specie",
        "includes",
        "genus",
        "second",
        "type",
        "often",
        "characterized",
        "proprium",
        "property",
        "since",
        "proprium",
        "included",
        "definition",
        "subject",
        "human",
        "able",
        "laugh",
        "term",
        "human",
        "included",
        "definition",
        "predicate",
        "able",
        "laugh",
        "sentence",
        "per",
        "se",
        "necessary",
        "involves",
        "either",
        "two",
        "predication",
        "according",
        "kilwardby",
        "necessity",
        "per",
        "accidens",
        "belongs",
        "necessity",
        "sentence",
        "lack",
        "intrinsic",
        "relation",
        "subject",
        "predicate",
        "kilwardby",
        "also",
        "stress",
        "per",
        "se",
        "necessity",
        "sentence",
        "subject",
        "must",
        "something",
        "belonging",
        "predicate",
        "per",
        "se",
        "aliquod",
        "ipsius",
        "predicati",
        "seems",
        "mean",
        "subject",
        "predicate",
        "essential",
        "property",
        "ie",
        "predicate",
        "necessary",
        "property",
        "something",
        "else",
        "syllogistic",
        "necessity",
        "sentence",
        "understood",
        "proposition",
        "expressing",
        "essential",
        "property",
        "thing",
        "genusspecies",
        "relationship",
        "seems",
        "assume",
        "per",
        "se",
        "necessity",
        "sentence",
        "subject",
        "term",
        "accidental",
        "term",
        "essential",
        "necessary",
        "term",
        "subject",
        "essentially",
        "per",
        "se",
        "linked",
        "predicate",
        "rather",
        "merely",
        "weaker",
        "relation",
        "inseparability",
        "consequently",
        "subject",
        "term",
        "necessary",
        "link",
        "necessary",
        "follows",
        "predicate",
        "term",
        "merely",
        "contingent",
        "accidental",
        "term",
        "must",
        "necessary",
        "well",
        "aristotelian",
        "theory",
        "necessity",
        "syllogistic",
        "thus",
        "limited",
        "special",
        "class",
        "term",
        "stand",
        "substance",
        "terminology",
        "also",
        "used",
        "explain",
        "syllogistic",
        "contingency",
        "sentence",
        "suggests",
        "kilwardby",
        "trying",
        "develop",
        "uniform",
        "highly",
        "original",
        "interpretation",
        "theory",
        "number",
        "recent",
        "scholar",
        "offered",
        "similar",
        "interpretation",
        "aristotle",
        "see",
        "van",
        "rijen",
        "patterson",
        "thom",
        "nortmann",
        "interpreted",
        "aristotle",
        "modal",
        "syllogistic",
        "medievals",
        "saw",
        "need",
        "introduce",
        "distinction",
        "different",
        "kind",
        "assertoric",
        "sentence",
        "mixed",
        "syllogism",
        "ll",
        "l",
        "represents",
        "necessity",
        "sentence",
        "assertoric",
        "minor",
        "premise",
        "kind",
        "assertoric",
        "sentence",
        "term",
        "could",
        "merely",
        "accidentally",
        "connected",
        "kilwardby",
        "therefore",
        "introduced",
        "distinction",
        "absolutely",
        "simpliciter",
        "asofnow",
        "ut",
        "nunc",
        "assertoric",
        "sentence",
        "origin",
        "distinction",
        "found",
        "aristotle",
        "pr",
        "i",
        "b",
        "kilwardby",
        "course",
        "us",
        "per",
        "seper",
        "accidens",
        "terminology",
        "spell",
        "difference",
        "absolutely",
        "assertoric",
        "sentence",
        "involves",
        "per",
        "se",
        "predication",
        "whereas",
        "asofnow",
        "assertoric",
        "sentence",
        "involves",
        "per",
        "accidens",
        "predication",
        "way",
        "guarantee",
        "essential",
        "connection",
        "term",
        "valid",
        "ll",
        "syllogism",
        "preserved",
        "conclusion",
        "unproblematic",
        "see",
        "lagerlund",
        "though",
        "distinction",
        "different",
        "assertoric",
        "sentence",
        "needed",
        "somehow",
        "made",
        "remained",
        "problem",
        "throughout",
        "later",
        "middle",
        "age",
        "end",
        "kilwardby",
        "arrive",
        "mood",
        "accepted",
        "aristotle",
        "example",
        "accepts",
        "ll",
        "first",
        "figure",
        "accepted",
        "aristotle",
        "manage",
        "get",
        "cc",
        "lcc",
        "disamis",
        "third",
        "figure",
        "also",
        "mood",
        "succeed",
        "validating",
        "others",
        "still",
        "grant",
        "accepted",
        "aristotle",
        "perhaps",
        "kilwardby",
        "get",
        "close",
        "one",
        "possibly",
        "get",
        "making",
        "aristotle",
        "system",
        "consistent",
        "see",
        "knuuttila",
        "lagerlund",
        "thom"
    ]
}