{
    "main_text": "Mind and Object || The Manifoldness of Mind\n4.3 The Manifoldness of Mind\n\nAlthough Meinong is concerned with the subject matter Brentano called\nintentional inexistence of an object, he avoids using this\nterm or something like intentionality. Meinong is not\ncompletely sure whether “being directed to something, to an\nobject” is common to all experiences. But Meinong stresses the\npoint that experiences like representations, judgements, feelings and\ndesires are usually directed to an object (1904b, §1; 1899,\n§2: 185 [141]), and he interprets the intentionality of\nsuch mental occurrences in a relational rather than in an adverbial\nmanner (“I am sensing (something) red” instead of “I\nam sensing redly”). Agreeing with Twardowski, Meinong stresses\nthe point that among the objects that are presented to the subject,\nsome may not exist and some may not even be possible, for example the\nround square or the state of affairs (“objective”) that a\nbiangle exists.\n\nMeinong’s philosophical psychology is influenced by\nBrentano’s descriptive psychology, but Meinong modified it in\nseveral ways. There are at least four main modifications involving\nBrentano’s view of mental phenomena, especially Brentano’s\ntripartite classification of such phenomena into representations,\njudgements, and phenomena of love and hate (or emotions\n[Gemütsbewegungen]): (1) Meinong’s first deviation\nconsists in dividing up the class of emotions into the classes of\nfeelings [Gefühle] and of desires\n[Begehrungen]. (2) His second modification consists in\nintroducing the differentiation between serious\n[ernstartige] and fantasy [phantasieartige]\nexperiences (the latter include what he called\n“assumptions”). (3) He distinguishes between the\nact, the (psychological) content, and the\nobject of a mental phenomenon (see above 4.1). (4) He gives\nup Brentano’s thesis that we can be intentionally directed to\none and the same object in different ways, i.e., by different kinds of\nmental acts, and he argues in favor of proper, nonreal (ideal) objects\ncorresponding to judging, feeling, and desiring. (For further\ninvestigations regarding the affinities and divergences between both\nphilosophers, see Rollinger 2005 and Marek 2017.)\n4.3.1 Mental Elementary Experiences and Their Objects\n\nAs Meinong supposes that the different kinds of acts are coordinated\nwith the different kinds of presented objects [präsentierte\nGegenstände], his classification of mental elementary\nexperiences [psychische Elementarerlebnisse] allows a\ncategorization of all objects from an intentionalistic point of\nview:\n\n\n\n            Experience\n[Erlebnis] \n\nintellectual\nemotional \n\nRepresentation\n\n[Vorstellung]\n\nserious or fantasy\nThought\n\n[Gedanke]\n\nserious (= judgement [Urteil]) or\n\nfantasy (= assumption [Annahme])\nFeeling\n\n[Gefühl]\n\nserious or fantasy\nDesire\n\n[Begehren]\n\nserious or fantasy \n\nobject of representation\n\n[Vorstellungsgegenstand]:\n\n\nobjectum\n\n[Objekt]\nobject of thought\n\n[Denkgegenstand]:\n\n\nobjective\n\n[Objektiv]\nobject of feeling\n\n[Fühlgegenstand]:\n\n\ndignitative\n\n[Dignitativ]\nobject of desire\n\n[Begehrungsgegenstand]:\n\n\ndesiderative\n\n[Desiderativ] \n\nRed\nRed is a color\nThe attractiveness of red\nThe fruit should be red  \n\n\nA representation does not occur in isolation — it always comes\nto mind in the context of a further, more complex mental act that\nincludes this very representation as a psychological presupposition,\ni.e., representations are always embedded in propositional attitudes.\nWe do not just present the object red, we judge, for example,\nthat something is red, or that red is something (1910,\n§§38, 45; 1915, §33; 1917, §§1, 8). On the\nother hand, no mental act can take place without the occurrence of a\nrepresentation, and hence the objects of a mental act always include\nan objectum; no objective, for instance, can subsist without an\nobjectum (even though the objectum in question may be a beingless\nobject) (1910, §20: 135 [101]). The judgement that red\nis a color presupposes the representations of red and of color, for\nexample. The common linguistic expressions of represented objecta are\nnouns or adjectives. Objecta can be continuants but also occurrents,\nand they can be either real or\n ideal.[1]\n Objectives are always ideal, they are something like states of\naffairs or propositions and can be expressed (1) by an independent\nsentence like “Red is a color” if they are judged or\nassumed, and (2) by a “that”-clause (“that red is a\ncolor”) or a nominal phrase (“the colorfulness of\nred”) if they are judged about (1910, §10). That which is\njudged [geurteilt] is always an objective whereas that which\nis judged about [beurteilt] is often an objectum but can be\nan objective, a dignitative, and a desiderative as well. There is no\nobjective which is an objectum, although objectives may be the subject\nmatter of further objectives as, for example, in “Meinong\nbelieved that the round square is round”. Following his pupil\nRudolf Ameseder (1904: 54–5), Meinong stresses the point that\nobjectives can be characterized as those objects that not only can\nhave being but can also be being, whereas objecta\ncan have being but can never be being. This dictum is based on the\nlinguistic fact that the “that”-clauses “that\n(object) o is” and “that (object) o is\nF”, respectively, can frequently be replaced by the\nnominal (gerund) phrases “the being of o” and\n“the being F of o”, respectively (1910,\n§11: 61–2 [50–1]; 1915, §5: 27;\nMorscher & Simons 2001: 443–4).\n\nMeinong was not completely sure whether his classification of mental\nacts and its corresponding categorization of objects (taken\nintentionalistically) were complete (1917, §11). A candidate for\nanother category would be questions. Are questions reducible to\nsomething like a specific desire to know something, as Meinong thought\n(1910, §18), or are they ultimately irreducible? And do they have\nspecific objects of their own, which could be coined\n“quaesitives” or “rogatives” (cf. Kreibig\n1914)? One might think that another candidate would be drawing\nconclusions, because it is controversial whether inferences can be\nunderstood simply as complex judgements. Meinong did not consider this\npossibility; he just reduced inferences to particular (specially\n“motivated”) judgements about assumptions or about\njudgements (1910, §§27–32).\n4.3.2 Fantasy Experiences and Serious Experiences\n\nThe distinction between fantasy (imaginary) experiences and serious\nexperiences concerns the act component. This distinction is a\ngeneralization of Meinong’s division of thoughts into assumption\nand judgements, which he introduces in On Assumptions (1902).\nMeinong, considering assumptions as a subclass of thoughts, places\nthem “between representations and judgements”, as they\nare, like judgements, affirmative or negative; and like\nrepresentations, without belief (1910; §§1, 59). Judgements\nare directed to objectives and involve conviction, whereas\nassumptions do not involve conviction — they merely involve\nentertaining the objectives they are directed at (1910: 376\n[268]). Meinong realized that such an entertaining of\nobjectives without conviction plays a central role in our intellectual\nand emotional lives. Asking questions, denying, reasoning, desiring,\nplaying games, performing or producing artistic works would not be\npossible without assuming. In judging that A or B, for\nexample, one does not judge A and B, respectively\n— one only assumes them. Fantasy and serious cases can also be\nfound in the other kinds of experiences. As an illustration, if a\nrepresentation of red has a perceptual look because a red-quale is\ninvolved, it is of a serious character, and if the red-representation\nis merely reproductive, that is, a recollective or imaginative one, it\nis a fantasy experience and so only of an imaginary character.\nMeinong’s application of the fantasy/serious distinction to\nall kinds of mental acts (including the affective and\nconative dimension) may seem schematic and controversial, but also\nleads to remarkable insights into phenomena like art and into\nunderstanding the role of emotions in writing and reading fiction, as\nempathic experiences and reception of art provide us with paradigmatic\ncases of fantasy representations, fantasy thoughts, and —\nespecially — fantasy feelings. These are neither merely\nrepresentations of emotions nor serious emotions but something\nintermediate between representations and serious emotions. In general,\nfantasy experiences are not imagined experiences as they are not\nmerely representations of experiences. Adopting Mally’s\ndistinction between fantasy judgement and pure assumption\n[Unterscheidung von Phantasieurteil und reiner Annahme]\n(1912: 61–2, fn.) Meinong later even distinguishes between (1)\nserious-like and (2) shadowy fantasy experiences\n[ernstartige versus schattenhafte\nPhantasieerlebnisse]. A fantasy experience (e.g., an assumption)\ncan be understood either (1) as a pretense of experiencing seriously\n(e.g., of making a judgement) or (2) as a mere entertaining of the\nobject (e.g., an objective without a pretense of judging) (1917,\n§6: 47–53 [42–47]). Introducing the concept\nof shadowy fantasy experiences (or pure assumption, respectively)\nallows some forms of fantasy to be understood without resort to a\npretense theory.\n\nAssumptions do not imply conviction. Hence, no assumption can exhibit\nany evidential advantage over another assumption or can be challenged\non evidential grounds. From the standpoint of an evidential\nrequirement, one cannot believe everything, but one can assume\neverything, that is, one can assume any objective and one can\nrepresent any objectum. Meinong calls this insight the principle\nof unrestricted freedom of assumption [Prinzip der\nunbeschränkten Annahmefreiheit] (1910, §60) and\ncontrasts it with the principle of relatively constrained assumptions,\nwhich postulates a quite unmistakable logical constraint when one\nregards one or more assumptions as already given and then logically\nrelates further assumptions to them: “It is true that\nassumptions are without exception free, absolutely regarded; but for\nall that, they can be constrained relatively.” (1910, §60:\n346 [246–7]) Over the years, Meinong maintained that\nthere were limitations of his principle of unrestricted freedom of\nassumption. He speaks of such a limitation explicitly in connection\nwith the modal moment (1915, §37: 282; see below 5.4.3), and his\ndiscussion whether some defective objects fail outside-being and were\ntherefore no loyal objects can be interpreted as limiting this freedom\nprinciple. (Cf. 1917, §2; 1978: 377–8; see below\n5.3.1.)\n4.3.3 Production of Representations\n\nAssembling objects to a more complex object is an important activity\nof the mind, but it does not form a separate species of elementary\nexperiences beyond the four aforementioned types of mental acts.\nAccording to Meinong (1902, §2; 1910, §2) two or more\nrepresentations of objecta can be used to produce a new representation\nof a complex objectum. The objects of the more simple representations\ncan be seen as the foundation of the complex object, which is always\nan object of higher order, a superius, because it is founded\nby the founding objects (inferiora). (See below Section 5.5.)\nThe diversity of red and green has red and green,\nthe checkered pattern has squares of different colors, and a red\nsquare has red and square as its inferiora. In order\nto get a representation of objects of higher order, of a Gestalt, a\nmelody, for example, you have to have representations of the more\nelementary objects on which you build the complex representation. This\noperation of the mind is called “production of\nrepresentations” [“Vorstellungsproduktion”]\nbecause the mind is able to produce complex representations and not\nalready their corresponding complex objects. This conception became an\nimportant and fruitful, although controversial, notion in Gestalt\npsychology, as Meinong still acknowledges the primacy of the\nelementary representations. The underlying elements of objects of\nhigher order, for example, are not to be seen as “only\nabstractly distinguishable parts” which was assumed by the\nBerlin Gestalt school. (Cf. Smith 1994, Chapt. 8: 272.)\n",
    "section_title": "4.3 The Manifoldness of Mind",
    "entry_title": "Alexius Meinong",
    "hierarchy_title": "Alexius Meinong || Mind and Object || The Manifoldness of Mind",
    "tokenized_text": [
        "mind",
        "object",
        "manifoldness",
        "mind",
        "manifoldness",
        "mind",
        "although",
        "meinong",
        "concerned",
        "subject",
        "matter",
        "brentano",
        "called",
        "intentional",
        "inexistence",
        "object",
        "avoids",
        "using",
        "term",
        "something",
        "like",
        "intentionality",
        "meinong",
        "completely",
        "sure",
        "whether",
        "directed",
        "something",
        "object",
        "common",
        "experience",
        "meinong",
        "stress",
        "point",
        "experience",
        "like",
        "representation",
        "judgement",
        "feeling",
        "desire",
        "usually",
        "directed",
        "object",
        "b",
        "interprets",
        "intentionality",
        "mental",
        "occurrence",
        "relational",
        "rather",
        "adverbial",
        "manner",
        "sensing",
        "something",
        "red",
        "instead",
        "sensing",
        "redly",
        "agreeing",
        "twardowski",
        "meinong",
        "stress",
        "point",
        "among",
        "object",
        "presented",
        "subject",
        "may",
        "exist",
        "may",
        "even",
        "possible",
        "example",
        "round",
        "square",
        "state",
        "affair",
        "objective",
        "biangle",
        "exists",
        "meinong",
        "philosophical",
        "psychology",
        "influenced",
        "brentano",
        "descriptive",
        "psychology",
        "meinong",
        "modified",
        "several",
        "way",
        "least",
        "four",
        "main",
        "modification",
        "involving",
        "brentano",
        "view",
        "mental",
        "phenomenon",
        "especially",
        "brentano",
        "tripartite",
        "classification",
        "phenomenon",
        "representation",
        "judgement",
        "phenomenon",
        "love",
        "hate",
        "emotion",
        "gemütsbewegungen",
        "meinong",
        "first",
        "deviation",
        "consists",
        "dividing",
        "class",
        "emotion",
        "class",
        "feeling",
        "gefühle",
        "desire",
        "begehrungen",
        "second",
        "modification",
        "consists",
        "introducing",
        "differentiation",
        "serious",
        "ernstartige",
        "fantasy",
        "phantasieartige",
        "experience",
        "latter",
        "include",
        "called",
        "assumption",
        "distinguishes",
        "act",
        "psychological",
        "content",
        "object",
        "mental",
        "phenomenon",
        "see",
        "give",
        "brentano",
        "thesis",
        "intentionally",
        "directed",
        "one",
        "object",
        "different",
        "way",
        "ie",
        "different",
        "kind",
        "mental",
        "act",
        "argues",
        "favor",
        "proper",
        "nonreal",
        "ideal",
        "object",
        "corresponding",
        "judging",
        "feeling",
        "desiring",
        "investigation",
        "regarding",
        "affinity",
        "divergence",
        "philosopher",
        "see",
        "rollinger",
        "marek",
        "mental",
        "elementary",
        "experience",
        "object",
        "meinong",
        "supposes",
        "different",
        "kind",
        "act",
        "coordinated",
        "different",
        "kind",
        "presented",
        "object",
        "präsentierte",
        "gegenstände",
        "classification",
        "mental",
        "elementary",
        "experience",
        "psychische",
        "elementarerlebnisse",
        "allows",
        "categorization",
        "object",
        "intentionalistic",
        "point",
        "view",
        "experience",
        "erlebnis",
        "intellectual",
        "emotional",
        "representation",
        "vorstellung",
        "serious",
        "fantasy",
        "thought",
        "gedanke",
        "serious",
        "judgement",
        "urteil",
        "fantasy",
        "assumption",
        "annahme",
        "feeling",
        "gefühl",
        "serious",
        "fantasy",
        "desire",
        "begehren",
        "serious",
        "fantasy",
        "object",
        "representation",
        "vorstellungsgegenstand",
        "objectum",
        "objekt",
        "object",
        "thought",
        "denkgegenstand",
        "objective",
        "objektiv",
        "object",
        "feeling",
        "fühlgegenstand",
        "dignitative",
        "dignitativ",
        "object",
        "desire",
        "begehrungsgegenstand",
        "desiderative",
        "desiderativ",
        "red",
        "red",
        "color",
        "attractiveness",
        "red",
        "fruit",
        "red",
        "representation",
        "occur",
        "isolation",
        "always",
        "come",
        "mind",
        "context",
        "complex",
        "mental",
        "act",
        "includes",
        "representation",
        "psychological",
        "presupposition",
        "ie",
        "representation",
        "always",
        "embedded",
        "propositional",
        "attitude",
        "present",
        "object",
        "red",
        "judge",
        "example",
        "something",
        "red",
        "red",
        "something",
        "hand",
        "mental",
        "act",
        "take",
        "place",
        "without",
        "occurrence",
        "representation",
        "hence",
        "object",
        "mental",
        "act",
        "always",
        "include",
        "objectum",
        "objective",
        "instance",
        "subsist",
        "without",
        "objectum",
        "even",
        "though",
        "objectum",
        "question",
        "may",
        "beingless",
        "object",
        "judgement",
        "red",
        "color",
        "presupposes",
        "representation",
        "red",
        "color",
        "example",
        "common",
        "linguistic",
        "expression",
        "represented",
        "objecta",
        "noun",
        "adjective",
        "objecta",
        "continuant",
        "also",
        "occurrent",
        "either",
        "real",
        "ideal",
        "objective",
        "always",
        "ideal",
        "something",
        "like",
        "state",
        "affair",
        "proposition",
        "expressed",
        "independent",
        "sentence",
        "like",
        "red",
        "color",
        "judged",
        "assumed",
        "clause",
        "red",
        "color",
        "nominal",
        "phrase",
        "colorfulness",
        "red",
        "judged",
        "judged",
        "geurteilt",
        "always",
        "objective",
        "whereas",
        "judged",
        "beurteilt",
        "often",
        "objectum",
        "objective",
        "dignitative",
        "desiderative",
        "well",
        "objective",
        "objectum",
        "although",
        "objective",
        "may",
        "subject",
        "matter",
        "objective",
        "example",
        "meinong",
        "believed",
        "round",
        "square",
        "round",
        "following",
        "pupil",
        "rudolf",
        "ameseder",
        "meinong",
        "stress",
        "point",
        "objective",
        "characterized",
        "object",
        "also",
        "whereas",
        "objecta",
        "never",
        "dictum",
        "based",
        "linguistic",
        "fact",
        "clauses",
        "object",
        "object",
        "f",
        "respectively",
        "frequently",
        "replaced",
        "nominal",
        "gerund",
        "phrase",
        "f",
        "respectively",
        "morscher",
        "simon",
        "meinong",
        "completely",
        "sure",
        "whether",
        "classification",
        "mental",
        "act",
        "corresponding",
        "categorization",
        "object",
        "taken",
        "intentionalistically",
        "complete",
        "candidate",
        "another",
        "category",
        "would",
        "question",
        "question",
        "reducible",
        "something",
        "like",
        "specific",
        "desire",
        "know",
        "something",
        "meinong",
        "thought",
        "ultimately",
        "irreducible",
        "specific",
        "object",
        "could",
        "coined",
        "quaesitives",
        "rogatives",
        "cf",
        "kreibig",
        "one",
        "might",
        "think",
        "another",
        "candidate",
        "would",
        "drawing",
        "conclusion",
        "controversial",
        "whether",
        "inference",
        "understood",
        "simply",
        "complex",
        "judgement",
        "meinong",
        "consider",
        "possibility",
        "reduced",
        "inference",
        "particular",
        "specially",
        "motivated",
        "judgement",
        "assumption",
        "judgement",
        "fantasy",
        "experience",
        "serious",
        "experience",
        "distinction",
        "fantasy",
        "imaginary",
        "experience",
        "serious",
        "experience",
        "concern",
        "act",
        "component",
        "distinction",
        "generalization",
        "meinong",
        "division",
        "thought",
        "assumption",
        "judgement",
        "introduces",
        "assumption",
        "meinong",
        "considering",
        "assumption",
        "subclass",
        "thought",
        "place",
        "representation",
        "judgement",
        "like",
        "judgement",
        "affirmative",
        "negative",
        "like",
        "representation",
        "without",
        "belief",
        "judgement",
        "directed",
        "objective",
        "involve",
        "conviction",
        "whereas",
        "assumption",
        "involve",
        "conviction",
        "merely",
        "involve",
        "entertaining",
        "objective",
        "directed",
        "meinong",
        "realized",
        "entertaining",
        "objective",
        "without",
        "conviction",
        "play",
        "central",
        "role",
        "intellectual",
        "emotional",
        "life",
        "asking",
        "question",
        "denying",
        "reasoning",
        "desiring",
        "playing",
        "game",
        "performing",
        "producing",
        "artistic",
        "work",
        "would",
        "possible",
        "without",
        "assuming",
        "judging",
        "b",
        "example",
        "one",
        "judge",
        "b",
        "respectively",
        "one",
        "assumes",
        "fantasy",
        "serious",
        "case",
        "also",
        "found",
        "kind",
        "experience",
        "illustration",
        "representation",
        "red",
        "perceptual",
        "look",
        "redquale",
        "involved",
        "serious",
        "character",
        "redrepresentation",
        "merely",
        "reproductive",
        "recollective",
        "imaginative",
        "one",
        "fantasy",
        "experience",
        "imaginary",
        "character",
        "meinong",
        "application",
        "fantasyserious",
        "distinction",
        "kind",
        "mental",
        "act",
        "including",
        "affective",
        "conative",
        "dimension",
        "may",
        "seem",
        "schematic",
        "controversial",
        "also",
        "lead",
        "remarkable",
        "insight",
        "phenomenon",
        "like",
        "art",
        "understanding",
        "role",
        "emotion",
        "writing",
        "reading",
        "fiction",
        "empathic",
        "experience",
        "reception",
        "art",
        "provide",
        "u",
        "paradigmatic",
        "case",
        "fantasy",
        "representation",
        "fantasy",
        "thought",
        "especially",
        "fantasy",
        "feeling",
        "neither",
        "merely",
        "representation",
        "emotion",
        "serious",
        "emotion",
        "something",
        "intermediate",
        "representation",
        "serious",
        "emotion",
        "general",
        "fantasy",
        "experience",
        "imagined",
        "experience",
        "merely",
        "representation",
        "experience",
        "adopting",
        "mally",
        "distinction",
        "fantasy",
        "judgement",
        "pure",
        "assumption",
        "unterscheidung",
        "von",
        "phantasieurteil",
        "und",
        "reiner",
        "annahme",
        "fn",
        "meinong",
        "later",
        "even",
        "distinguishes",
        "seriouslike",
        "shadowy",
        "fantasy",
        "experience",
        "ernstartige",
        "versus",
        "schattenhafte",
        "phantasieerlebnisse",
        "fantasy",
        "experience",
        "eg",
        "assumption",
        "understood",
        "either",
        "pretense",
        "experiencing",
        "seriously",
        "eg",
        "making",
        "judgement",
        "mere",
        "entertaining",
        "object",
        "eg",
        "objective",
        "without",
        "pretense",
        "judging",
        "introducing",
        "concept",
        "shadowy",
        "fantasy",
        "experience",
        "pure",
        "assumption",
        "respectively",
        "allows",
        "form",
        "fantasy",
        "understood",
        "without",
        "resort",
        "pretense",
        "theory",
        "assumption",
        "imply",
        "conviction",
        "hence",
        "assumption",
        "exhibit",
        "evidential",
        "advantage",
        "another",
        "assumption",
        "challenged",
        "evidential",
        "ground",
        "standpoint",
        "evidential",
        "requirement",
        "one",
        "believe",
        "everything",
        "one",
        "assume",
        "everything",
        "one",
        "assume",
        "objective",
        "one",
        "represent",
        "objectum",
        "meinong",
        "call",
        "insight",
        "principle",
        "unrestricted",
        "freedom",
        "assumption",
        "prinzip",
        "der",
        "unbeschränkten",
        "annahmefreiheit",
        "contrast",
        "principle",
        "relatively",
        "constrained",
        "assumption",
        "postulate",
        "quite",
        "unmistakable",
        "logical",
        "constraint",
        "one",
        "regard",
        "one",
        "assumption",
        "already",
        "given",
        "logically",
        "relates",
        "assumption",
        "true",
        "assumption",
        "without",
        "exception",
        "free",
        "absolutely",
        "regarded",
        "constrained",
        "relatively",
        "year",
        "meinong",
        "maintained",
        "limitation",
        "principle",
        "unrestricted",
        "freedom",
        "assumption",
        "speaks",
        "limitation",
        "explicitly",
        "connection",
        "modal",
        "moment",
        "see",
        "discussion",
        "whether",
        "defective",
        "object",
        "fail",
        "outsidebeing",
        "therefore",
        "loyal",
        "object",
        "interpreted",
        "limiting",
        "freedom",
        "principle",
        "cf",
        "see",
        "production",
        "representation",
        "assembling",
        "object",
        "complex",
        "object",
        "important",
        "activity",
        "mind",
        "form",
        "separate",
        "specie",
        "elementary",
        "experience",
        "beyond",
        "four",
        "aforementioned",
        "type",
        "mental",
        "act",
        "according",
        "meinong",
        "two",
        "representation",
        "objecta",
        "used",
        "produce",
        "new",
        "representation",
        "complex",
        "objectum",
        "object",
        "simple",
        "representation",
        "seen",
        "foundation",
        "complex",
        "object",
        "always",
        "object",
        "higher",
        "order",
        "superius",
        "founded",
        "founding",
        "object",
        "inferiora",
        "see",
        "section",
        "diversity",
        "red",
        "green",
        "red",
        "green",
        "checkered",
        "pattern",
        "square",
        "different",
        "color",
        "red",
        "square",
        "red",
        "square",
        "inferiora",
        "order",
        "get",
        "representation",
        "object",
        "higher",
        "order",
        "gestalt",
        "melody",
        "example",
        "representation",
        "elementary",
        "object",
        "build",
        "complex",
        "representation",
        "operation",
        "mind",
        "called",
        "production",
        "representation",
        "vorstellungsproduktion",
        "mind",
        "able",
        "produce",
        "complex",
        "representation",
        "already",
        "corresponding",
        "complex",
        "object",
        "conception",
        "became",
        "important",
        "fruitful",
        "although",
        "controversial",
        "notion",
        "gestalt",
        "psychology",
        "meinong",
        "still",
        "acknowledges",
        "primacy",
        "elementary",
        "representation",
        "underlying",
        "element",
        "object",
        "higher",
        "order",
        "example",
        "seen",
        "abstractly",
        "distinguishable",
        "part",
        "assumed",
        "berlin",
        "gestalt",
        "school",
        "cf",
        "smith",
        "chapt"
    ]
}