{
    "main_text": "The Virtues and Their Cultivation\n2. The Virtues and Their Cultivation\n\nOne of Mencius’s most influential views was his list of four\ninnate ethical dispositions, which he treats as what Western ethicists\nwould call cardinal virtues: benevolence (rén),\nrighteousness (yì), wisdom (zhì), and\npropriety (lĭ). Each of the four virtues is associated\nwith a characteristic emotion or motivational attitude: “The\nfeeling of compassion is benevolence. The feeling of disdain is\nrighteousness. The feeling of respect is propriety. The feeling of\napproval and disapproval is wisdom” (Mengzi 6A6; Van\nNorden 2008, 149). Among these four, Mencius devotes the most\ndiscussion to benevolence and righteousness. Benevolence is manifested\nin the affection one has for his or her own kin, as well as compassion\nfor the suffering of other humans, and even concern for\nnon–human animals. However, according to Confucians, one should\nalways have greater concern for, and has greater obligations toward,\nrelatives, teachers, and friends than one does for strangers and\nanimals (7A45). Benevolence is not simply a matter of feeling a\ncertain way: it also has cognitive and behavioral aspects. A fully\nbenevolent person will be disposed to recognize the suffering of\nothers and to act appropriately. Thus, a genuinely benevolent ruler\nwill notice how his policies will affect his subjects, and will only\npursue policies consistent with their well being (1B5). Righteousness\nis a disposition to disdain or regard as shameful dishonorable\nbehavior or demeaning treatment. As is the case with benevolence,\nrighteousness has cognitive and behavioral aspects. Thus, a righteous\nperson would object to being addressed disrespectfully (7B31), and\nwould not engage in an illicit sexual relationship (3B3). A fully\nrighteous person would also recognize that it is just as shameful to\naccept a large bribe as it is to accept a small bribe (6A10), and so\nwould refuse to accept either.\n\nMencius suggests that wisdom and propriety are secondary in importance\nto benevolence and righteousness: “The core of benevolence is\nserving one’s parents. The core of righteousness is obeying\none’s elder brother. The core of wisdom is knowing these two and\nnot abandoning them. The core of ritual propriety is the adornment of\nthese two” (4A27; Van Norden 2008, 101). As the preceding\npassage suggests, wisdom involves an understanding of and commitment\nto the other virtues, especially benevolence and righteousness. Other\npassages indicate that a wise person has the ability to properly\nassess individuals and has skill at means–end deliberation\n(5A9). Mencian wisdom (somewhat like Aristotelian\nphronēsis) seems to be only partially constrained by\nrules. He notes that no sage would kill an innocent person, even if it\nmeant obtaining control of (and being able to benefit) the whole world\n(2A2). However, he also stresses that sages often act very differently\nfrom one another, but if they “had exchanged places, each would\nhave done as the other” (Mengzi 4B31; Van Norden 2008,\n114; cf. 4B29). The ultimate standard for any action is\n“timeliness” (5B1), which seems to mean performing the\nright action out of the appropriate motivation for this particular\nsituation.\n\nPropriety is manifested in respect (6A6) or deference (2A6) toward\nelders and legitimate authority figures, especially as manifested in\nceremonies and etiquette. The character for the virtue of propriety is\nidentical with the one for ritual, reflecting the close connection\nbetween this virtue and such practices. Mencius thinks that matters of\nritual place legitimate ethical demands on us, but he stresses that\nthey are not categorical, and can be overridden by more exigent\nobligations. For example, he notes that rescuing one’s\nsister–in–law if she were drowning would justify violation\nof the ritual prohibition on physical contact between unmarried men\nand women (4A17; cf. 5A2, 6B2). Knowing when to violate ritual is a\nmatter of wisdom.\n\nMencius discusses other virtues in addition to benevolence,\nrighteousness, wisdom, and propriety, but it seems that they are\nultimately manifestations of the preceding virtues. For example, in a\nnuanced account of courage, Mencius distinguishes between courage as\nexemplified in stereotypically daring behavior (assaulting anyone who\ninsults you), in fearlessness, and in a commitment to righteousness.\nMencius suggests that the last kind of courage is the highest form.\nCourage based on righteousness will lead to fearless opposition to\nwrongdoing, but also humble submission when one finds oneself in the\n wrong.[8]\n\n\nMencius holds that all humans have innate but incipient tendencies\ntoward benevolence, righteousness, wisdom, and propriety. Employing an\nagricultural metaphor, he refers to these tendencies as\n“sprouts” (2A6). The sprouts are manifested in cognitive\nand emotional reactions characteristic of the virtues. For example,\nall humans feel compassion for the suffering of other humans and\nanimals, at least on some occasions, and this is a manifestation of\nbenevolence. Similarly, every person has some things that he or she\nwould be ashamed to do, or some forms of treatment he or she would\ndisdain to accept, and these are expressions of righteousness.\nHowever, as Mencius’s carefully chosen sprout metaphor suggests,\nhumans are not born with fully formed virtuous dispositions. Our\nnascent virtues are sporadic and inconsistent in their manifestations.\nConsequently, a ruler who manifests genuine benevolence when he spares\nan ox being led to slaughter may nonetheless ignore the suffering of\nhis own subjects. Likewise, someone who would disdain to be addressed\ndisrespectfully may feel no compunction in acting against his\nconvictions in the face of a large bribe. In order to become genuinely\nvirtuous, a person must “extend” or “fill out”\nhis or her nascent virtuous inclinations. As Mencius puts it:\n“People all have things that they will not bear. To extend this\nreaction to that which they will bear is benevolence. People all have\nthings that they will not do. To extend this reaction to that which\nthey will do is righteousness. If people can fill out the heart that\ndoes not desire to harm others, their benevolence will be\ninexhaustible. If people can fill out the heart that will not\ntrespass, their righteousness will be inexhaustible”\n(Mengzi 7B31; Van Norden 2008, 192). One of the most\nintriguing issues in Mencius’s philosophy is the proper way to\nunderstand his claim that we must “extend” (tui, ji,\nda) or “fill out” (kuo, chong) our innate\nbut incipient virtuous reactions (1A7, 2A6, 7A15, 7B31).\n\nThe discussion of this issue has a long history, but was revived in\nWestern scholarship by Nivison\n (1980).[9]\n In a much–discussed example (1A7), Mencius draws a\nruler’s attention to the fact that he had shown compassion for\nan ox being led to slaughter by sparing it. Mencius then encourages\nthe king to “extend” his compassion to his own subjects,\nwho suffer due to the ruler’s wars of conquest and exorbitant\ntaxation. The basic structure of Mencian extension is clear from this\nexample. There is a paradigm case, C1, in which an\nindividual’s sprout of compassion is manifested in cognition,\nemotion, and behavior. (In 1A7, C1 is the ox being led to\nslaughter. The king perceives that the ox is suffering, feels\ncompassion for its suffering, and acts to spare it.) There is also a\ncase that is relevantly similar to the paradigm case, C2,\nbut in which the individual does not currently have the same\ncognitive, emotional, and behavioral reactions. (In 1A7, C2\nis the king’s subjects. Although his subjects suffer, the king\nignores their suffering, has no compassion for it, and does not act to\nalleviate it. The relevant similarity between C1 and\nC2 in the case of 1A7 is suggested by the fact that the\nking describes the ox as having a “frightened appearance, like\nan innocent going to the execution ground.”) Extension is the\nmental process by which one comes to recognize the ethically relevant\nsimilarity of C1 to C2, have the same emotional\nreaction to C2 as to C1, and behave the same\ntoward C2 as to C1. (Were the king to extend\nfrom the ox to his subjects, he would notice their suffering, feel\ncompassion for them, and change his current military and civil\npolicies. Later in 1A7, Mencius provides concrete advice about which\npolicies to enact.) Nivison’s work raises the issue of how the\ncognitive, motivational, and behavioral aspects of Mencian extension\nare related. What is the connection between the king\nperceiving the logical similarity of the suffering of the ox\nto the suffering of his own people and the king actually being\nmotivated to act to help his\n people?[10]\n\nMencius suggests that, for most people, there are three prerequisites\nfor extension: an environment that meets people’s basic physical\nneeds, ethical education, and individual effort. (1) Only a handful of\npeople, Mencius argues, have the strength of character to “have\na constant heart” in the face of physical deprivation. Most\npeople will resort to crime in the face of hunger and fear:\n“When they thereupon sink into crime, to go and punish the\npeople is to trap them. When there are benevolent persons in positions\nof authority, how is it possible for them to trap the people?”\n(1A7; Van Norden 2008, 14) Consequently, Mencius stresses that it is\nthe obligation of government to ensure that the people are\nwell–fed and free from the fear of violence. (2) Nonetheless,\nthe satisfaction of physical needs is insufficient to ensure the\nvirtue of the common people. Socialization is also necessary:\n“The Way of the people is this: if they are full of food, have\nwarm clothes, and live in comfort but are without instruction, then\nthey come close to being animals” (3A4; Van Norden 2008, 71).\nThis socialization includes learning the rituals (the etiquette and\nceremony of social interactions) as well as instruction in the\nfundamental “human roles”: “between father and\nchildren there is affection; between ruler and ministers there is\nrighteousness; between husband and wife there is distinction; between\nelder and younger there is precedence; and between friends there is\nfaithfulness” (ibid.). (3) The first two factors are necessary\nand sufficient to ensure that most people will not become bestial.\nHowever, achieving the level of a “sage” or\n“worthy” requires considerable individual effort. Mencius\nillustrates this with an example of learning the board game of\ngo:\n\nNow, go is an insignificant craft. But if one does not focus\none’s heart and apply one’s intention, then one\nwon’t get it. ‘Go Qiu’ was the best at\ngo throughout the world. Suppose you told Go Qiu to\nteach two people go, and one focuses his heart and applies\nhis intention to it, listening only to Go Qiu. The other,\nalthough he listens to him, with his whole heart thinks about hunting\nswans, reflecting [sī] only upon drawing his bow to\nshoot them. Although he learns together with the other person, he will\nnot be as good as he. Will this be because his intelligence is not as\ngreat? I answer that it is not. (6A9; Van Norden 2008, 153)\n\n\nMencius refers to the mental activity required for full extension as\n“reflection (sī).” Whether someone engages\nin reflection is ultimately dependent upon the individual’s\ncommitment to doing so (see 6A6 and 6A15, discussed in Section 3\nbelow). However, classic texts and teachers can assist by inducing or\nguiding these activities. Thus, Mencius is trying to induce reflection\nin the king in 1A7 by directing the king’s attention to the\nsimilarities between the ox he felt compassion for and his own\nsubjects. Mencius similarly tries to induce reflection in a government\nofficial who asks whether it is permissible to reduce the crushing tax\nburden on the peasants slightly this year, and wait until next year to\nlower it to a reasonable level. Mencius replies, “Suppose there\nis a person who every day appropriates one of his neighbor’s\nchickens. Someone tells him, ‘This is not the Way of a\ngentleman.’ He says, ‘May I reduce it to appropriating one\nchicken every month and wait until next year to stop?’ If one\nknows that it is not righteous, then one should quickly stop”\n(3B8; Van Norden 2008, 83). Mencius also guides reflection through\nphilosophical dialogue (7A40, literally, “question and\nanswer”). This is illustrated in discussions with his disciples\nWan Zhang (5A1–9) and Gongsun Chou (2A1–2). Stories from\nclassic Confucian texts (particularly the Odes and\nDocuments) are often a stimulus for these discussions,\nhelping to illustrate the role such works play in Mencian ethical\neducation.\n\nOne aspect of reflection is particularly salient: it is insufficient\nfor successful extension that one merely recognize, in an abstract or\ntheoretical manner, the similarity between two situations. One must\ncome to be motivated and to act in relevantly similar ways. Because of\nthe preceding requirement, an intense topic of discussion among later\nConfucians influenced by Mencius is the relationship between knowledge\nand action. For example, Wang Yangming (1472–1529) famously\nargued for the “unity of knowing and acting,” as the most\nplausible interpretation of Mencius’s view: “There never\nhave been people who know but do not act. Those who ‘know’\nbut do not act simply do not yet know” (Tiwald and Van Norden\n2014, 267). From a Western perspective, one of the noteworthy aspects\nof Mencius’s view of extension is that he regards emotions as a\ncrucial part of ethical perception and evaluation. Although it would\nbe anachronistic to saddle him with any specific contemporary account\nof the emotions, it seems clear that his underlying view is close to\nwhat Western psychologists and philosopher call an “appraisal\ntheory” of emotions, according to which emotions are\nmotivational states closely connected to evaluations of situations (de\nSousa 2014, Section 4).\n",
    "section_title": "2. The Virtues and Their Cultivation",
    "entry_title": "Mencius",
    "hierarchy_title": "Mencius || The Virtues and Their Cultivation",
    "tokenized_text": [
        "virtue",
        "cultivation",
        "virtue",
        "cultivation",
        "one",
        "mencius",
        "influential",
        "view",
        "list",
        "four",
        "innate",
        "ethical",
        "disposition",
        "treat",
        "western",
        "ethicist",
        "would",
        "call",
        "cardinal",
        "virtue",
        "benevolence",
        "rén",
        "righteousness",
        "yì",
        "wisdom",
        "zhì",
        "propriety",
        "lĭ",
        "four",
        "virtue",
        "associated",
        "characteristic",
        "emotion",
        "motivational",
        "attitude",
        "feeling",
        "compassion",
        "benevolence",
        "feeling",
        "disdain",
        "righteousness",
        "feeling",
        "respect",
        "propriety",
        "feeling",
        "approval",
        "disapproval",
        "wisdom",
        "mengzi",
        "a",
        "van",
        "norden",
        "among",
        "four",
        "mencius",
        "devotes",
        "discussion",
        "benevolence",
        "righteousness",
        "benevolence",
        "manifested",
        "affection",
        "one",
        "kin",
        "well",
        "compassion",
        "suffering",
        "human",
        "even",
        "concern",
        "nonhuman",
        "animal",
        "however",
        "according",
        "confucian",
        "one",
        "always",
        "greater",
        "concern",
        "greater",
        "obligation",
        "toward",
        "relative",
        "teacher",
        "friend",
        "one",
        "stranger",
        "animal",
        "a",
        "benevolence",
        "simply",
        "matter",
        "feeling",
        "certain",
        "way",
        "also",
        "cognitive",
        "behavioral",
        "aspect",
        "fully",
        "benevolent",
        "person",
        "disposed",
        "recognize",
        "suffering",
        "others",
        "act",
        "appropriately",
        "thus",
        "genuinely",
        "benevolent",
        "ruler",
        "notice",
        "policy",
        "affect",
        "subject",
        "pursue",
        "policy",
        "consistent",
        "well",
        "b",
        "righteousness",
        "disposition",
        "disdain",
        "regard",
        "shameful",
        "dishonorable",
        "behavior",
        "demeaning",
        "treatment",
        "case",
        "benevolence",
        "righteousness",
        "cognitive",
        "behavioral",
        "aspect",
        "thus",
        "righteous",
        "person",
        "would",
        "object",
        "addressed",
        "disrespectfully",
        "b",
        "would",
        "engage",
        "illicit",
        "sexual",
        "relationship",
        "b",
        "fully",
        "righteous",
        "person",
        "would",
        "also",
        "recognize",
        "shameful",
        "accept",
        "large",
        "bribe",
        "accept",
        "small",
        "bribe",
        "a",
        "would",
        "refuse",
        "accept",
        "either",
        "mencius",
        "suggests",
        "wisdom",
        "propriety",
        "secondary",
        "importance",
        "benevolence",
        "righteousness",
        "core",
        "benevolence",
        "serving",
        "one",
        "parent",
        "core",
        "righteousness",
        "obeying",
        "one",
        "elder",
        "brother",
        "core",
        "wisdom",
        "knowing",
        "two",
        "abandoning",
        "core",
        "ritual",
        "propriety",
        "adornment",
        "two",
        "a",
        "van",
        "norden",
        "preceding",
        "passage",
        "suggests",
        "wisdom",
        "involves",
        "understanding",
        "commitment",
        "virtue",
        "especially",
        "benevolence",
        "righteousness",
        "passage",
        "indicate",
        "wise",
        "person",
        "ability",
        "properly",
        "ass",
        "individual",
        "skill",
        "meansend",
        "deliberation",
        "a",
        "mencian",
        "wisdom",
        "somewhat",
        "like",
        "aristotelian",
        "phronēsis",
        "seems",
        "partially",
        "constrained",
        "rule",
        "note",
        "sage",
        "would",
        "kill",
        "innocent",
        "person",
        "even",
        "meant",
        "obtaining",
        "control",
        "able",
        "benefit",
        "whole",
        "world",
        "a",
        "however",
        "also",
        "stress",
        "sage",
        "often",
        "act",
        "differently",
        "one",
        "another",
        "exchanged",
        "place",
        "would",
        "done",
        "mengzi",
        "b",
        "van",
        "norden",
        "cf",
        "b",
        "ultimate",
        "standard",
        "action",
        "timeliness",
        "b",
        "seems",
        "mean",
        "performing",
        "right",
        "action",
        "appropriate",
        "motivation",
        "particular",
        "situation",
        "propriety",
        "manifested",
        "respect",
        "a",
        "deference",
        "a",
        "toward",
        "elder",
        "legitimate",
        "authority",
        "figure",
        "especially",
        "manifested",
        "ceremony",
        "etiquette",
        "character",
        "virtue",
        "propriety",
        "identical",
        "one",
        "ritual",
        "reflecting",
        "close",
        "connection",
        "virtue",
        "practice",
        "mencius",
        "think",
        "matter",
        "ritual",
        "place",
        "legitimate",
        "ethical",
        "demand",
        "u",
        "stress",
        "categorical",
        "overridden",
        "exigent",
        "obligation",
        "example",
        "note",
        "rescuing",
        "one",
        "sisterinlaw",
        "drowning",
        "would",
        "justify",
        "violation",
        "ritual",
        "prohibition",
        "physical",
        "contact",
        "unmarried",
        "men",
        "woman",
        "a",
        "cf",
        "a",
        "b",
        "knowing",
        "violate",
        "ritual",
        "matter",
        "wisdom",
        "mencius",
        "discus",
        "virtue",
        "addition",
        "benevolence",
        "righteousness",
        "wisdom",
        "propriety",
        "seems",
        "ultimately",
        "manifestation",
        "preceding",
        "virtue",
        "example",
        "nuanced",
        "account",
        "courage",
        "mencius",
        "distinguishes",
        "courage",
        "exemplified",
        "stereotypically",
        "daring",
        "behavior",
        "assaulting",
        "anyone",
        "insult",
        "fearlessness",
        "commitment",
        "righteousness",
        "mencius",
        "suggests",
        "last",
        "kind",
        "courage",
        "highest",
        "form",
        "courage",
        "based",
        "righteousness",
        "lead",
        "fearless",
        "opposition",
        "wrongdoing",
        "also",
        "humble",
        "submission",
        "one",
        "find",
        "oneself",
        "wrong",
        "mencius",
        "hold",
        "human",
        "innate",
        "incipient",
        "tendency",
        "toward",
        "benevolence",
        "righteousness",
        "wisdom",
        "propriety",
        "employing",
        "agricultural",
        "metaphor",
        "refers",
        "tendency",
        "sprout",
        "a",
        "sprout",
        "manifested",
        "cognitive",
        "emotional",
        "reaction",
        "characteristic",
        "virtue",
        "example",
        "human",
        "feel",
        "compassion",
        "suffering",
        "human",
        "animal",
        "least",
        "occasion",
        "manifestation",
        "benevolence",
        "similarly",
        "every",
        "person",
        "thing",
        "would",
        "ashamed",
        "form",
        "treatment",
        "would",
        "disdain",
        "accept",
        "expression",
        "righteousness",
        "however",
        "mencius",
        "carefully",
        "chosen",
        "sprout",
        "metaphor",
        "suggests",
        "human",
        "born",
        "fully",
        "formed",
        "virtuous",
        "disposition",
        "nascent",
        "virtue",
        "sporadic",
        "inconsistent",
        "manifestation",
        "consequently",
        "ruler",
        "manifest",
        "genuine",
        "benevolence",
        "spare",
        "ox",
        "led",
        "slaughter",
        "may",
        "nonetheless",
        "ignore",
        "suffering",
        "subject",
        "likewise",
        "someone",
        "would",
        "disdain",
        "addressed",
        "disrespectfully",
        "may",
        "feel",
        "compunction",
        "acting",
        "conviction",
        "face",
        "large",
        "bribe",
        "order",
        "become",
        "genuinely",
        "virtuous",
        "person",
        "must",
        "extend",
        "fill",
        "nascent",
        "virtuous",
        "inclination",
        "mencius",
        "put",
        "people",
        "thing",
        "bear",
        "extend",
        "reaction",
        "bear",
        "benevolence",
        "people",
        "thing",
        "extend",
        "reaction",
        "righteousness",
        "people",
        "fill",
        "heart",
        "desire",
        "harm",
        "others",
        "benevolence",
        "inexhaustible",
        "people",
        "fill",
        "heart",
        "trespass",
        "righteousness",
        "inexhaustible",
        "mengzi",
        "b",
        "van",
        "norden",
        "one",
        "intriguing",
        "issue",
        "mencius",
        "philosophy",
        "proper",
        "way",
        "understand",
        "claim",
        "must",
        "extend",
        "tui",
        "ji",
        "da",
        "fill",
        "kuo",
        "chong",
        "innate",
        "incipient",
        "virtuous",
        "reaction",
        "a",
        "a",
        "a",
        "b",
        "discussion",
        "issue",
        "long",
        "history",
        "revived",
        "western",
        "scholarship",
        "nivison",
        "muchdiscussed",
        "example",
        "a",
        "mencius",
        "draw",
        "ruler",
        "attention",
        "fact",
        "shown",
        "compassion",
        "ox",
        "led",
        "slaughter",
        "sparing",
        "mencius",
        "encourages",
        "king",
        "extend",
        "compassion",
        "subject",
        "suffer",
        "due",
        "ruler",
        "war",
        "conquest",
        "exorbitant",
        "taxation",
        "basic",
        "structure",
        "mencian",
        "extension",
        "clear",
        "example",
        "paradigm",
        "case",
        "c",
        "individual",
        "sprout",
        "compassion",
        "manifested",
        "cognition",
        "emotion",
        "behavior",
        "a",
        "c",
        "ox",
        "led",
        "slaughter",
        "king",
        "perceives",
        "ox",
        "suffering",
        "feel",
        "compassion",
        "suffering",
        "act",
        "spare",
        "also",
        "case",
        "relevantly",
        "similar",
        "paradigm",
        "case",
        "c",
        "individual",
        "currently",
        "cognitive",
        "emotional",
        "behavioral",
        "reaction",
        "a",
        "c",
        "king",
        "subject",
        "although",
        "subject",
        "suffer",
        "king",
        "ignores",
        "suffering",
        "compassion",
        "act",
        "alleviate",
        "relevant",
        "similarity",
        "c",
        "c",
        "case",
        "a",
        "suggested",
        "fact",
        "king",
        "describes",
        "ox",
        "frightened",
        "appearance",
        "like",
        "innocent",
        "going",
        "execution",
        "ground",
        "extension",
        "mental",
        "process",
        "one",
        "come",
        "recognize",
        "ethically",
        "relevant",
        "similarity",
        "c",
        "c",
        "emotional",
        "reaction",
        "c",
        "c",
        "behave",
        "toward",
        "c",
        "c",
        "king",
        "extend",
        "ox",
        "subject",
        "would",
        "notice",
        "suffering",
        "feel",
        "compassion",
        "change",
        "current",
        "military",
        "civil",
        "policy",
        "later",
        "a",
        "mencius",
        "provides",
        "concrete",
        "advice",
        "policy",
        "enact",
        "nivison",
        "work",
        "raise",
        "issue",
        "cognitive",
        "motivational",
        "behavioral",
        "aspect",
        "mencian",
        "extension",
        "related",
        "connection",
        "king",
        "perceiving",
        "logical",
        "similarity",
        "suffering",
        "ox",
        "suffering",
        "people",
        "king",
        "actually",
        "motivated",
        "act",
        "help",
        "people",
        "mencius",
        "suggests",
        "people",
        "three",
        "prerequisite",
        "extension",
        "environment",
        "meet",
        "people",
        "basic",
        "physical",
        "need",
        "ethical",
        "education",
        "individual",
        "effort",
        "handful",
        "people",
        "mencius",
        "argues",
        "strength",
        "character",
        "constant",
        "heart",
        "face",
        "physical",
        "deprivation",
        "people",
        "resort",
        "crime",
        "face",
        "hunger",
        "fear",
        "thereupon",
        "sink",
        "crime",
        "go",
        "punish",
        "people",
        "trap",
        "benevolent",
        "person",
        "position",
        "authority",
        "possible",
        "trap",
        "people",
        "a",
        "van",
        "norden",
        "consequently",
        "mencius",
        "stress",
        "obligation",
        "government",
        "ensure",
        "people",
        "wellfed",
        "free",
        "fear",
        "violence",
        "nonetheless",
        "satisfaction",
        "physical",
        "need",
        "insufficient",
        "ensure",
        "virtue",
        "common",
        "people",
        "socialization",
        "also",
        "necessary",
        "way",
        "people",
        "full",
        "food",
        "warm",
        "clothes",
        "live",
        "comfort",
        "without",
        "instruction",
        "come",
        "close",
        "animal",
        "a",
        "van",
        "norden",
        "socialization",
        "includes",
        "learning",
        "ritual",
        "etiquette",
        "ceremony",
        "social",
        "interaction",
        "well",
        "instruction",
        "fundamental",
        "human",
        "role",
        "father",
        "child",
        "affection",
        "ruler",
        "minister",
        "righteousness",
        "husband",
        "wife",
        "distinction",
        "elder",
        "younger",
        "precedence",
        "friend",
        "faithfulness",
        "ibid",
        "first",
        "two",
        "factor",
        "necessary",
        "sufficient",
        "ensure",
        "people",
        "become",
        "bestial",
        "however",
        "achieving",
        "level",
        "sage",
        "worthy",
        "requires",
        "considerable",
        "individual",
        "effort",
        "mencius",
        "illustrates",
        "example",
        "learning",
        "board",
        "game",
        "go",
        "go",
        "insignificant",
        "craft",
        "one",
        "focus",
        "one",
        "heart",
        "apply",
        "one",
        "intention",
        "one",
        "get",
        "go",
        "qiu",
        "best",
        "go",
        "throughout",
        "world",
        "suppose",
        "told",
        "go",
        "qiu",
        "teach",
        "two",
        "people",
        "go",
        "one",
        "focus",
        "heart",
        "applies",
        "intention",
        "listening",
        "go",
        "qiu",
        "although",
        "listens",
        "whole",
        "heart",
        "think",
        "hunting",
        "swan",
        "reflecting",
        "sī",
        "upon",
        "drawing",
        "bow",
        "shoot",
        "although",
        "learns",
        "together",
        "person",
        "good",
        "intelligence",
        "great",
        "answer",
        "a",
        "van",
        "norden",
        "mencius",
        "refers",
        "mental",
        "activity",
        "required",
        "full",
        "extension",
        "reflection",
        "sī",
        "whether",
        "someone",
        "engages",
        "reflection",
        "ultimately",
        "dependent",
        "upon",
        "individual",
        "commitment",
        "see",
        "a",
        "a",
        "discussed",
        "section",
        "however",
        "classic",
        "text",
        "teacher",
        "assist",
        "inducing",
        "guiding",
        "activity",
        "thus",
        "mencius",
        "trying",
        "induce",
        "reflection",
        "king",
        "a",
        "directing",
        "king",
        "attention",
        "similarity",
        "ox",
        "felt",
        "compassion",
        "subject",
        "mencius",
        "similarly",
        "try",
        "induce",
        "reflection",
        "government",
        "official",
        "asks",
        "whether",
        "permissible",
        "reduce",
        "crushing",
        "tax",
        "burden",
        "peasant",
        "slightly",
        "year",
        "wait",
        "next",
        "year",
        "lower",
        "reasonable",
        "level",
        "mencius",
        "reply",
        "suppose",
        "person",
        "every",
        "day",
        "appropriates",
        "one",
        "neighbor",
        "chicken",
        "someone",
        "tell",
        "way",
        "gentleman",
        "say",
        "may",
        "reduce",
        "appropriating",
        "one",
        "chicken",
        "every",
        "month",
        "wait",
        "next",
        "year",
        "stop",
        "one",
        "know",
        "righteous",
        "one",
        "quickly",
        "stop",
        "b",
        "van",
        "norden",
        "mencius",
        "also",
        "guide",
        "reflection",
        "philosophical",
        "dialogue",
        "a",
        "literally",
        "question",
        "answer",
        "illustrated",
        "discussion",
        "disciple",
        "wan",
        "zhang",
        "a",
        "gongsun",
        "chou",
        "a",
        "story",
        "classic",
        "confucian",
        "text",
        "particularly",
        "ode",
        "document",
        "often",
        "stimulus",
        "discussion",
        "helping",
        "illustrate",
        "role",
        "work",
        "play",
        "mencian",
        "ethical",
        "education",
        "one",
        "aspect",
        "reflection",
        "particularly",
        "salient",
        "insufficient",
        "successful",
        "extension",
        "one",
        "merely",
        "recognize",
        "abstract",
        "theoretical",
        "manner",
        "similarity",
        "two",
        "situation",
        "one",
        "must",
        "come",
        "motivated",
        "act",
        "relevantly",
        "similar",
        "way",
        "preceding",
        "requirement",
        "intense",
        "topic",
        "discussion",
        "among",
        "later",
        "confucian",
        "influenced",
        "mencius",
        "relationship",
        "knowledge",
        "action",
        "example",
        "wang",
        "yangming",
        "famously",
        "argued",
        "unity",
        "knowing",
        "acting",
        "plausible",
        "interpretation",
        "mencius",
        "view",
        "never",
        "people",
        "know",
        "act",
        "know",
        "act",
        "simply",
        "yet",
        "know",
        "tiwald",
        "van",
        "norden",
        "western",
        "perspective",
        "one",
        "noteworthy",
        "aspect",
        "mencius",
        "view",
        "extension",
        "regard",
        "emotion",
        "crucial",
        "part",
        "ethical",
        "perception",
        "evaluation",
        "although",
        "would",
        "anachronistic",
        "saddle",
        "specific",
        "contemporary",
        "account",
        "emotion",
        "seems",
        "clear",
        "underlying",
        "view",
        "close",
        "western",
        "psychologist",
        "philosopher",
        "call",
        "appraisal",
        "theory",
        "emotion",
        "according",
        "emotion",
        "motivational",
        "state",
        "closely",
        "connected",
        "evaluation",
        "situation",
        "de",
        "sousa",
        "section"
    ]
}