{
    "main_text": "The Goodness of Human Nature\n3. The Goodness of Human Nature\n\nMencius is perhaps best–known for his claim that “[human]\nnature is good” (xìng shàn). As A.C.\nGraham (1967) demonstrated in a classic essay, Mencius and his\ncontemporaries regarded the nature of X as the characteristics that X\nwill develop if given a healthy environment for the kind of thing X\nis. A characteristic, C, can be part of the nature of X even if there\nexists an X such that X does not have C. For example, language use is\npart of the nature of a human being, but there are cases of humans\nwho, due to neurological damage or simply failure to be exposed to\nlanguage prior to the onset of adolescence, fail to develop a capacity\nfor language use. It is even possible for C to be part of the nature\nof X if most instances of X do not have C. For example, it is\nthe nature of an orange tree to bear fruit, but the majority of orange\nseeds do not even germinate, much less grow to maturity. Consequently,\nan important aspect of Mencius’s claim that human nature is good\nis that humans have a tendency to become good if raised in an\nenvironment that is healthy for them. This thesis runs the danger of\nbecoming viciously circular: we might characterize goodness as the\nresult of growing up in a healthy environment, and a healthy\nenvironment as one that results in humans being\n good.[11]\n However, Mencius’s claims about human nature, virtues, ethical\ncultivation, and political philosophy are nodes in a complex web of\nbeliefs that appeals to our intuitions (e.g., it is normal for humans\nto show compassion for the suffering of others) as well as empirical\nclaims (e.g., humans are less likely to manifest compassion when\nsubject to physical deprivation). Mencius’s views might be\nmistaken, but they cannot be casually dismissed as naively circular;\nrather, they must be evaluated as a complex and subtle account of\nethics and philosophical psychology.\n\nProbably the two most important passages for understanding\nMencius’s view of human nature are 6A6 and 6A15. In the former,\nMencius’s disciple Gongsun Chou asks him to explain how his\nposition differs from those who say that “human nature is\nneither good nor not good,” those who claim that “human\nnature can become good, and it can become not good,” and those\nwho state that “there are natures that are good, and there are\nnatures that are not good.” Mencius replies, \n\nAs for what they are inherently [qíng], they can\nbecome\n good.[12]\n This is what I mean by calling their natures [xìng]\ngood. As for their becoming not good, this is not the fault of their\npotential. Humans all have the feeling [xīn] of\ncompassion. Humans all have the feeling of disdain. Humans all have\nthe feeling of respect. Humans all have the feeling of approval and\ndisapproval. The feeling of compassion is benevolence. The feeling of\ndisdain is righteousness. The feeling of respect is propriety. The\nfeeling of approval and disapproval is wisdom. Benevolence,\nrighteousness, propriety, and wisdom are not welded to us externally.\nWe inherently have them. It is simply that we do not reflect upon\n[sī] them. (Van Norden 2008, 149)\n\n\nHuman nature is good, on this view, because becoming a good person is\nthe result of developing our innate tendencies toward benevolence,\nrighteousness, wisdom, and propriety. These tendencies are manifested\nin distinctively moral emotions, correlated with the virtues. Each\nhuman “inherently” has a heart with the capacity for these\nemotions. They will manifest themselves, at least sporadically, in\neach human. If we “reflect upon” these manifestations, we\ncan develop our innate capacities into fully formed virtues.\n\nIf the human capacity for goodness is rooted in our nature,\nisn’t our capacity for evil equally grounded in our nature?\nMencius addresses the problem of human wrongdoing in 6A15, when his\ndisciple Gongduzi asks, “We are the same in being humans. Yet\nsome become great humans and some become petty humans. Why?”\nMencius replies, “those who follow their greater part become\ngreat humans. Those who follow their petty part become petty\nhumans.” Gongduzi persists, “We are the same in being\nhumans. Why is it that some follow their greater part and some follow\ntheir petty part?” Mencius replies,\n\nIt is not the function of the ears and eyes to reflect, and they are\nmisled by things. Things interact with things and lead them along. But\nthe function of the heart is to reflect [si]. If it reflects,\nthen it will get it. If it does not reflect, then it will not get it.\nThis is what Heaven has given us. If one first takes one’s stand\non what is greater, then what is lesser will not be able to snatch it\naway. This is how to become a great person. (6A15; Van Norden 2008,\n156)\n\n\nIn modern Western philosophy, we primarily think of “ears and\neyes” as organs of sensory perception, whose characteristic\nerrors are cognitive (e.g. Descartes’ example of a square tower\nthat appears round from far away). However, in ancient Chinese\nthought, eyes, ears, and the other sensory organs are primarily\nassociated with sensual desires (e.g., lovely sights, beautiful music,\nfine foods, etc.). Physical desires are never treated as intrinsically\nproblematic. However, they can “mislead” by leading us to\nfocus on them to the exclusion of a more inclusive comprehension that\nincludes our ethical\n motivations.[13]\n Thus, according to the account Mencius sketches in 6A15, our sensual\ndesires can lead us to wrongdoing if we pursue them without also\nengaging our ethical motivations. This is an especially acute danger\nbecause our sensory desires always respond automatically and\neffortlessly to their appropriate objects, while our moral motivations\nare more selective. Mencius suggests the mechanical responsiveness of\nour sense organs by describing them as simply “things”:\n“Things interact with things and lead them along.” In\ncontrast, the full development of our ethical motivations requires\nthat our heart engage in “reflection”: “If it\nreflects, then it will get it. If it does not reflect, then it will\nnot get it.” The heart “gets it” in that it engages\nthe appropriate ethical\n motivations.[14]\n\n\nMencius provides a concrete illustration of moral failure and how to\novercome it in a dialogue with a ruler who confesses, “I have a\nweakness. I am fond of wealth.” Mencius explains that a great\nruler of ancient times was similarly fond of wealth, but he ensured\nthat “those who stayed at home had loaded granaries, and those\nwho marched had full provisions…. If Your Majesty is fond of\nwealth but treats the commoners the same, what difficulty is there in\nbecoming [a great] King?” The ruler continues to temporize:\n“I have a weakness. I am fond of sex.” Mencius cites the\nexample of an ancient ruler who was also fond of sex. However, he made\nsure (by not wasting male lives in needless warfare, or collecting an\nunusually large harem) that “there were no bitter women in\nprivate, or any unmarried men in public. If Your Majesty is fond of\nsex but treats the commoners the same, what difficulty is there in\nbecoming [a great] King?” (1B5; translation slightly modified\nfrom Van Norden 2008, 23–24) The ruler’s desires for\nwealth and sex are not problematic in themselves, but he has been\npursuing them in a manner that ignores benevolence, which would direct\nhim to share his joys with others.\n\nThe preceding discussion suggests that Kwong–loi Shun’s\nsummary is correct: in stating that human nature is good,\n“Mencius was saying that human beings have a constitution\ncomprising certain emotional predispositions that already point in the\ndirection of goodness and by virtue of which people are capable of\nbecoming good…. One’s becoming bad is not the fault of\none’s constitution, but a matter of one’s injuring or not\nfully developing the constitution in the appropriate direction”\n(Shun 1997, 219–20). \n\nThe statement that “[human] nature is good [xìng\nshàn]” is often misquoted as “[human] nature\nis fundamentally good [xìng bĕn\nshàn].” The latter phrase actually derives from a\ngloss on Mencius’s view popularized by the seminal commentator\nZhu Xi (1130–1200). Zhu Xi held that Mencius was simply\nexplicating what was implicit in the sayings of Confucius. Confucius\nstated that “natures are close to one another, but become far\nfrom one another by practice” (Analects 17.2). In order\nto explain why Confucius described human natures as merely\n“close to” one another, while Mencius referred to them as\nidentically “good,” Zhu Xi argued that Mencius was\nreferring to the ultimate, underlying human nature in itself, whereas\nConfucius was referring to human nature as manifested in concrete\n embodiments.[15]\n Zhu Xi’s view became orthodoxy, and was even written into the\nopening lines of the Three Character Classic, a primer for\nlearning to read Chinese that was memorized by schoolchildren for\ncenturies:\n\nAt its beginning,\n\nhuman nature is fundamentally good.\n\nHuman natures are close to one another,\n\nbut become far from one another by practice.\n\nIt is only when there is not education,\n\nthat their natures\n deviate.[16]\n\n\nWhile ingenious, this interpretation of Mencius is unmotivated without\nthe assumption that the Analects and Mengzi must be\nexpressing the same view. \n\nThe term “nature” occurs in only 17 passages in the\nMengzi (3A1, 4B26, 6A1–4, 6A6, 6A8, 6B15, 7A1, 7A21,\n7A30, 7A38, 7B24, 7B33), and the specific phrase “[human] nature\nis good” only occurs in two of these (3A1, 6A6). However, there\nis some plausibility to Zhu Xi’s suggestion that the latter\nclaim is operative in many passages where it is not mentioned\nexplicitly, because of how intimately it is connected with other\naspects of Mencius’s view (Tiwald and Van Norden 2014, 213).\nThis will become clearer as we consider Mencius’s critiques of\nother philosophers in his era.\n",
    "section_title": "3. The Goodness of Human Nature",
    "entry_title": "Mencius",
    "hierarchy_title": "Mencius || The Goodness of Human Nature",
    "tokenized_text": [
        "goodness",
        "human",
        "nature",
        "goodness",
        "human",
        "nature",
        "mencius",
        "perhaps",
        "bestknown",
        "claim",
        "human",
        "nature",
        "good",
        "xìng",
        "shàn",
        "ac",
        "graham",
        "demonstrated",
        "classic",
        "essay",
        "mencius",
        "contemporary",
        "regarded",
        "nature",
        "x",
        "characteristic",
        "x",
        "develop",
        "given",
        "healthy",
        "environment",
        "kind",
        "thing",
        "x",
        "characteristic",
        "c",
        "part",
        "nature",
        "x",
        "even",
        "exists",
        "x",
        "x",
        "c",
        "example",
        "language",
        "use",
        "part",
        "nature",
        "human",
        "case",
        "human",
        "due",
        "neurological",
        "damage",
        "simply",
        "failure",
        "exposed",
        "language",
        "prior",
        "onset",
        "adolescence",
        "fail",
        "develop",
        "capacity",
        "language",
        "use",
        "even",
        "possible",
        "c",
        "part",
        "nature",
        "x",
        "instance",
        "x",
        "c",
        "example",
        "nature",
        "orange",
        "tree",
        "bear",
        "fruit",
        "majority",
        "orange",
        "seed",
        "even",
        "germinate",
        "much",
        "le",
        "grow",
        "maturity",
        "consequently",
        "important",
        "aspect",
        "mencius",
        "claim",
        "human",
        "nature",
        "good",
        "human",
        "tendency",
        "become",
        "good",
        "raised",
        "environment",
        "healthy",
        "thesis",
        "run",
        "danger",
        "becoming",
        "viciously",
        "circular",
        "might",
        "characterize",
        "goodness",
        "result",
        "growing",
        "healthy",
        "environment",
        "healthy",
        "environment",
        "one",
        "result",
        "human",
        "good",
        "however",
        "mencius",
        "claim",
        "human",
        "nature",
        "virtue",
        "ethical",
        "cultivation",
        "political",
        "philosophy",
        "node",
        "complex",
        "web",
        "belief",
        "appeal",
        "intuition",
        "eg",
        "normal",
        "human",
        "show",
        "compassion",
        "suffering",
        "others",
        "well",
        "empirical",
        "claim",
        "eg",
        "human",
        "le",
        "likely",
        "manifest",
        "compassion",
        "subject",
        "physical",
        "deprivation",
        "mencius",
        "view",
        "might",
        "mistaken",
        "casually",
        "dismissed",
        "naively",
        "circular",
        "rather",
        "must",
        "evaluated",
        "complex",
        "subtle",
        "account",
        "ethic",
        "philosophical",
        "psychology",
        "probably",
        "two",
        "important",
        "passage",
        "understanding",
        "mencius",
        "view",
        "human",
        "nature",
        "a",
        "a",
        "former",
        "mencius",
        "disciple",
        "gongsun",
        "chou",
        "asks",
        "explain",
        "position",
        "differs",
        "say",
        "human",
        "nature",
        "neither",
        "good",
        "good",
        "claim",
        "human",
        "nature",
        "become",
        "good",
        "become",
        "good",
        "state",
        "nature",
        "good",
        "nature",
        "good",
        "mencius",
        "reply",
        "inherently",
        "qíng",
        "become",
        "good",
        "mean",
        "calling",
        "nature",
        "xìng",
        "good",
        "becoming",
        "good",
        "fault",
        "potential",
        "human",
        "feeling",
        "xīn",
        "compassion",
        "human",
        "feeling",
        "disdain",
        "human",
        "feeling",
        "respect",
        "human",
        "feeling",
        "approval",
        "disapproval",
        "feeling",
        "compassion",
        "benevolence",
        "feeling",
        "disdain",
        "righteousness",
        "feeling",
        "respect",
        "propriety",
        "feeling",
        "approval",
        "disapproval",
        "wisdom",
        "benevolence",
        "righteousness",
        "propriety",
        "wisdom",
        "welded",
        "u",
        "externally",
        "inherently",
        "simply",
        "reflect",
        "upon",
        "sī",
        "van",
        "norden",
        "human",
        "nature",
        "good",
        "view",
        "becoming",
        "good",
        "person",
        "result",
        "developing",
        "innate",
        "tendency",
        "toward",
        "benevolence",
        "righteousness",
        "wisdom",
        "propriety",
        "tendency",
        "manifested",
        "distinctively",
        "moral",
        "emotion",
        "correlated",
        "virtue",
        "human",
        "inherently",
        "heart",
        "capacity",
        "emotion",
        "manifest",
        "least",
        "sporadically",
        "human",
        "reflect",
        "upon",
        "manifestation",
        "develop",
        "innate",
        "capacity",
        "fully",
        "formed",
        "virtue",
        "human",
        "capacity",
        "goodness",
        "rooted",
        "nature",
        "capacity",
        "evil",
        "equally",
        "grounded",
        "nature",
        "mencius",
        "address",
        "problem",
        "human",
        "wrongdoing",
        "a",
        "disciple",
        "gongduzi",
        "asks",
        "human",
        "yet",
        "become",
        "great",
        "human",
        "become",
        "petty",
        "human",
        "mencius",
        "reply",
        "follow",
        "greater",
        "part",
        "become",
        "great",
        "human",
        "follow",
        "petty",
        "part",
        "become",
        "petty",
        "humans",
        "gongduzi",
        "persists",
        "human",
        "follow",
        "greater",
        "part",
        "follow",
        "petty",
        "part",
        "mencius",
        "reply",
        "function",
        "ear",
        "eye",
        "reflect",
        "misled",
        "thing",
        "thing",
        "interact",
        "thing",
        "lead",
        "along",
        "function",
        "heart",
        "reflect",
        "si",
        "reflects",
        "get",
        "reflect",
        "get",
        "heaven",
        "given",
        "u",
        "one",
        "first",
        "take",
        "one",
        "stand",
        "greater",
        "lesser",
        "able",
        "snatch",
        "away",
        "become",
        "great",
        "person",
        "a",
        "van",
        "norden",
        "modern",
        "western",
        "philosophy",
        "primarily",
        "think",
        "ear",
        "eye",
        "organ",
        "sensory",
        "perception",
        "whose",
        "characteristic",
        "error",
        "cognitive",
        "eg",
        "descartes",
        "example",
        "square",
        "tower",
        "appears",
        "round",
        "far",
        "away",
        "however",
        "ancient",
        "chinese",
        "thought",
        "eye",
        "ear",
        "sensory",
        "organ",
        "primarily",
        "associated",
        "sensual",
        "desire",
        "eg",
        "lovely",
        "sight",
        "beautiful",
        "music",
        "fine",
        "food",
        "etc",
        "physical",
        "desire",
        "never",
        "treated",
        "intrinsically",
        "problematic",
        "however",
        "mislead",
        "leading",
        "u",
        "focus",
        "exclusion",
        "inclusive",
        "comprehension",
        "includes",
        "ethical",
        "motivation",
        "thus",
        "according",
        "account",
        "mencius",
        "sketch",
        "a",
        "sensual",
        "desire",
        "lead",
        "u",
        "wrongdoing",
        "pursue",
        "without",
        "also",
        "engaging",
        "ethical",
        "motivation",
        "especially",
        "acute",
        "danger",
        "sensory",
        "desire",
        "always",
        "respond",
        "automatically",
        "effortlessly",
        "appropriate",
        "object",
        "moral",
        "motivation",
        "selective",
        "mencius",
        "suggests",
        "mechanical",
        "responsiveness",
        "sense",
        "organ",
        "describing",
        "simply",
        "thing",
        "thing",
        "interact",
        "thing",
        "lead",
        "along",
        "contrast",
        "full",
        "development",
        "ethical",
        "motivation",
        "requires",
        "heart",
        "engage",
        "reflection",
        "reflects",
        "get",
        "reflect",
        "get",
        "it",
        "heart",
        "get",
        "engages",
        "appropriate",
        "ethical",
        "motivation",
        "mencius",
        "provides",
        "concrete",
        "illustration",
        "moral",
        "failure",
        "overcome",
        "dialogue",
        "ruler",
        "confesses",
        "weakness",
        "fond",
        "wealth",
        "mencius",
        "explains",
        "great",
        "ruler",
        "ancient",
        "time",
        "similarly",
        "fond",
        "wealth",
        "ensured",
        "stayed",
        "home",
        "loaded",
        "granary",
        "marched",
        "full",
        "provisions",
        "majesty",
        "fond",
        "wealth",
        "treat",
        "commoner",
        "difficulty",
        "becoming",
        "great",
        "king",
        "ruler",
        "continues",
        "temporize",
        "weakness",
        "fond",
        "sex",
        "mencius",
        "cite",
        "example",
        "ancient",
        "ruler",
        "also",
        "fond",
        "sex",
        "however",
        "made",
        "sure",
        "wasting",
        "male",
        "life",
        "needle",
        "warfare",
        "collecting",
        "unusually",
        "large",
        "harem",
        "bitter",
        "woman",
        "private",
        "unmarried",
        "men",
        "public",
        "majesty",
        "fond",
        "sex",
        "treat",
        "commoner",
        "difficulty",
        "becoming",
        "great",
        "king",
        "b",
        "translation",
        "slightly",
        "modified",
        "van",
        "norden",
        "ruler",
        "desire",
        "wealth",
        "sex",
        "problematic",
        "pursuing",
        "manner",
        "ignores",
        "benevolence",
        "would",
        "direct",
        "share",
        "joy",
        "others",
        "preceding",
        "discussion",
        "suggests",
        "kwongloi",
        "shun",
        "summary",
        "correct",
        "stating",
        "human",
        "nature",
        "good",
        "mencius",
        "saying",
        "human",
        "being",
        "constitution",
        "comprising",
        "certain",
        "emotional",
        "predisposition",
        "already",
        "point",
        "direction",
        "goodness",
        "virtue",
        "people",
        "capable",
        "becoming",
        "good",
        "one",
        "becoming",
        "bad",
        "fault",
        "one",
        "constitution",
        "matter",
        "one",
        "injuring",
        "fully",
        "developing",
        "constitution",
        "appropriate",
        "direction",
        "shun",
        "statement",
        "human",
        "nature",
        "good",
        "xìng",
        "shàn",
        "often",
        "misquoted",
        "human",
        "nature",
        "fundamentally",
        "good",
        "xìng",
        "bĕn",
        "shàn",
        "latter",
        "phrase",
        "actually",
        "derives",
        "gloss",
        "mencius",
        "view",
        "popularized",
        "seminal",
        "commentator",
        "zhu",
        "xi",
        "zhu",
        "xi",
        "held",
        "mencius",
        "simply",
        "explicating",
        "implicit",
        "saying",
        "confucius",
        "confucius",
        "stated",
        "nature",
        "close",
        "one",
        "another",
        "become",
        "far",
        "one",
        "another",
        "practice",
        "analects",
        "order",
        "explain",
        "confucius",
        "described",
        "human",
        "nature",
        "merely",
        "close",
        "one",
        "another",
        "mencius",
        "referred",
        "identically",
        "good",
        "zhu",
        "xi",
        "argued",
        "mencius",
        "referring",
        "ultimate",
        "underlying",
        "human",
        "nature",
        "whereas",
        "confucius",
        "referring",
        "human",
        "nature",
        "manifested",
        "concrete",
        "embodiment",
        "zhu",
        "xi",
        "view",
        "became",
        "orthodoxy",
        "even",
        "written",
        "opening",
        "line",
        "three",
        "character",
        "classic",
        "primer",
        "learning",
        "read",
        "chinese",
        "memorized",
        "schoolchildren",
        "century",
        "beginning",
        "human",
        "nature",
        "fundamentally",
        "good",
        "human",
        "nature",
        "close",
        "one",
        "another",
        "become",
        "far",
        "one",
        "another",
        "practice",
        "education",
        "nature",
        "deviate",
        "ingenious",
        "interpretation",
        "mencius",
        "unmotivated",
        "without",
        "assumption",
        "analects",
        "mengzi",
        "must",
        "expressing",
        "view",
        "term",
        "nature",
        "occurs",
        "passage",
        "mengzi",
        "a",
        "b",
        "a",
        "a",
        "a",
        "b",
        "a",
        "a",
        "a",
        "a",
        "b",
        "b",
        "specific",
        "phrase",
        "human",
        "nature",
        "good",
        "occurs",
        "two",
        "a",
        "a",
        "however",
        "plausibility",
        "zhu",
        "xi",
        "suggestion",
        "latter",
        "claim",
        "operative",
        "many",
        "passage",
        "mentioned",
        "explicitly",
        "intimately",
        "connected",
        "aspect",
        "mencius",
        "view",
        "tiwald",
        "van",
        "norden",
        "become",
        "clearer",
        "consider",
        "mencius",
        "critique",
        "philosopher",
        "era"
    ]
}