{
    "main_text": "Language\n9. Controversy with Jacobi over Lessing’s alleged pantheism\n\nMendelssohn enjoyed, as noted at the outset, a lifelong friendship\nwith G. E. Lessing. In addition to their work as co-editors, Lessing\nanonymously published Mendelssohn’s earliest works and\ncollaborated with him on the piece: Pope, a Metaphysician!\nThrough his popular plays, his influential work as a dramaturg, and\nhis stormy public debates with orthodox Lutheran clergy, Lessing was a\nparticularly daunting and engaging spokesman for the German\nEnlightenment, making him all the more dangerous to its opponents. His\nfinal work, Nathan the Wiseman, fittingly portrays a Jewish\nsage (presumably modeled on Mendelssohn) who makes a poignant plea for\ntolerance by arguing that the differences among religions are\nessentially matters of history and not reason. Along with Mendelssohn,\nLessing embraced the idea of a purely rational religion and would\nendorse Mendelssohn’s declaration: “My religion recognizes\nno obligation to resolve doubt other than through rational means; and\nit commands no mere faith in eternal truths” (Gesammelte\nSchriften, Volume 3/2, p. 205). To pietists of the day, such\ndeclarations were scandalous subterfuges of an Enlightenment project\nof assimilating religion to natural reason. Mention has already been\nmade of Lavater’s attempt to draw Mendelssohn into religious\ndebate. While Mendelssohn skillfully avoided that confrontation, he\nfound himself reluctantly unable to remain silent when, after\nLessing’s death, F. H. Jacobi contended that Lessing embraced\nSpinoza’s pantheism and thus exemplified the\nEnlightenment’s supposedly inevitable descent into\nirreligion.\n\nFollowing private correspondence with Jacobi on the issue and an\nextended period when Jacobi (in personal straits at the time) did not\nrespond to his objections, Mendelssohn attempted to set the record\nstraight about Lessing’s Spinozism in Morning Hours.\nLearning of Mendelssohn’s plans incensed Jacobi who expected to\nbe consulted first and who accordingly responded by publishing,\nwithout Mendelssohn’s consent, their correspondence —\nOn the Teaching of Spinoza in Letters to Mr. Moses\nMendelssohn — a month before the publication of Morning\nHours. Distressed on personal as well as intellectual levels by\nthe controversy over his departed friend’s pantheism,\nMendelssohn countered with a hastily composed piece, To the\nFriends of Lessing: an Appendix to Mr. Jacobi’s Correspondence\non the Teaching of Spinoza. According to legend, so anxious was\nMendelssohn to get the manuscript to the publisher that, forgetting\nhis overcoat on a bitterly cold New Year’s eve, he delivered the\nmanuscript on foot to the publisher. That night he came down with a\ncold from which he died four days later, prompting his friends to\ncharge Jacobi with responsibility for Mendelssohn’s death.\n\nThe sensationalist character of the controversy should not obscure the\nsubstance and importance of Mendelssohn’s debate with Jacobi.\nJacobi had contended that Spinozism is the only consistent position\nfor a metaphysics based upon reason alone and that the only solution\nto this metaphysics so detrimental to religion and morality is a leap\nof faith, that salto mortale that poor Lessing famously\nrefused to make. Mendelssohn counters Jacobi’s first contention\nby attempting to demonstrate the metaphysical inconsistency of\nSpinozism. He takes aim at Jacobi’s second contention by\ndemonstrating how the “purified Spinozism” or\n“refined pantheism” embraced by Lessing is, in the end,\nonly nominally different from theism and thus a threat neither to\nreligion nor to morality.\n\nMendelssohn’s criticisms of Spinoza are discussed below but\nfirst the complexity of his relationship to Spinoza should be noted.\nIn his first publication, Dialogues (1761) he argued that\nmany of Spinoza’s views were compatible with “true\nphilosophy and religion.” In Mendelssohn’s mind, Leibniz\nmay have given that “true philosophy” its sharpest\nformulation but in all likelihood by deriving its central idea of a\npreestablished harmony from Spinoza. Moreover, as Mendelssohn puts it,\nSpinoza does not so much deny the distinctiveness of the actual world\nas construe it as it is in the mind of God before the creation,\nexisting only as a part of God (Philosophical Writings,\n102ff, 108ff). A quarter of a century later, Mendelssohn recapitulates\nthe latter argument as the key to understanding a\n“purified” or “refined” Spinozism that\nLessing, at least in the realm of philosophical debate, would not have\ndismissed out of hand.\n\nNevertheless, as noted above, part of his response to Jacobi consists\nin demonstrating the shortcomings of Spinoza’s philosophy. As\nmight be expected, he criticizes Spinoza’s idea that there is\nonly one, infinite, and necessary substance. The idea is arbitrary,\nMendelssohn contends, since one can legitimately distinguish between\nwhat is independent or self-standing (das Selbständige)\nand what obtains or persists for itself (das\nFürsichbestehende). “Instead of proving that\neverything obtaining for itself is only one, he [Spinoza] establishes\nin the end only that everything independent is one. Instead of\ndemonstrating that the entire aggregate of everything finite\nconstitutes a single self-standing substance, he merely shows that\nthis aggregate must depend upon the sole infinite substance”\n(Gesammelte Schriften, 3/2, p. 107).\n\nOn a “deeper level,” as Mendelssohn puts it, he also takes\nissue with Spinoza for failing to account for what Mendelssohn deems\nthe “formal” aspects of both corporeal and spiritual\nworlds. Thus, Spinoza’s conception of extension in terms of\nimpenetrability may explain “the essence of matter,” but\nit leaves unexplained, Mendelssohn contends, the particular\norganization and movement of bodies. What is unclear to Mendelssohn is\nhow parts can be in motion if the whole upon which they completely\ndepend (Spinoza’s substance) is not in motion. Similarly, he\nwants to know how, on the basis of Spinoza’s account of the\nsupposedly underlying attribute of extension, those parts come to have\nthe particular form and organization of motions and forces that they\nhave, that is to say, as organic, self-regulating entities.\n“Where can the origin of this [motion and form] be found?”\nhe asks. “Not in the whole, since the whole has no movement. The\nsum [Sämmtliche] of all bodies, untied into a single\nsubstance, cannot change place and has neither organization nor\nfigure…. Whence the form in the parts, if the whole provides no\nsource for this?” (Gesammelte Schriften, 3/2, p.\n108).\n\nJust as Spinoza explains the matter but not the form of the physical\nworld, so, too, Mendelssohn charges, he gives an account of the matter\nbut not the form of the spiritual world. In this connection it is\nhelpful to recall Mendelssohn’s differentiation of knowing,\napproving, and desiring from one another. Truth and falsity,\ncorresponding to knowing, provide the matter of the spiritual world.\nWhile they may, as Spinoza maintains, have their origin in thought as\nthe attribute of a single, infinite substance, categories\ncorresponding not to knowledge but to approving or desiring must have\nsome other source. Thus, according to Mendelssohn, Spinoza leaves\nunexplained “the difference between good and evil, desirable and\nundesirable, pleasure and pain” (Gesammelte Schriften,\nIII/2, p. 109).\n\nYet, while some of these criticisms of Spinoza may be compelling, they\ndo not, Mendelssohn recognizes, carry the day for a refined Spinozist\nor pantheist. Spinoza’s inability to explain how movement and\nvalues derive from the attributes of the one, infinite substance does\nnot, by itself, establish the theist explanation in\nMendelssohn’s view. Accordingly, in Morning Hours he\ncasts Lessing as the spokesperson for a refined pantheism — a\nmove that figures prominently in this contribution to the\nPantheismusstreit. Lessing is portrayed as someone who, while\nagreeing with Mendelssohn’s theist position, has a knack for\ngiving every reasonable argument its full due. In this context Lessing\npresents a pantheism that characterizes the one and only substance,\nnot only as a source of motion and desire, but also as capable of\nrepresenting every possibility to itself and approving that\npossibility that constitutes “the best and most perfect series\nof things” (Morning Hours, p. 84/Gesammelte\nSchriften 3/2, p. 115). In other words, refined pantheism\nincludes every aspect of the entire metaphysical system of theism but\ncasts it solely as the object of divine intellect. As a result, a\nrefined Spinozist might wonder how different the positions are since\nthe theist purports to explain these seemingly recalcitrant phenomena\nmerely by appealing to the divine will. A refined pantheist might\naccept the difference between the world (thought) and God (thinker) at\na certain level, but insist that, in the end, the difference is on a\nmerely abstract level since thinking and thought can only be\ndistinguished as long as one is not actually thinking. After all,\n“who is to tell us that we ourselves and the world surrounding\nus have something more to them than the thoughts of God and\nmodifications of his original power?” (Morning Hours,\np. 84 (translation slightly altered)/Gesammelte Schriften,\n3/2, p. 116). To pretend to show that there is something that can be\npredicated of things outside God that cannot be predicated of the\ndivine thoughts of those things is to deny divine omniscience.\n\nBut, without further qualifications, this pantheist line of reasoning\nis faulty, Mendelssohn submits, for at least three reasons. In the\nfirst place, it abolishes a distinction presupposed by any truthful\nstatement, i.e., the distinction between original and copy. Secondly,\nthere are indefeasible marks that distinguish a finite\nself-consciousness (as an object and original) from the divine\nrepresentation (copy) of it. “Consciousness of myself, combined\nwith complete ignorance of everything that does not fall within my\nsphere of thinking, is the most telling proof of my substantiality\noutside God, of my original existence” (Morning Hours,\np. 85 (translation slightly altered)/Gesammelte Schriften,\n3/2, p. 118). Finally, the pantheist confuses divine knowledge with\ndivine approval. God knows perfectly well my shortcomings without\napproving them and requiring their existence. Moreover, that they are\nthinkable hardly explains their existence since the opposite of them\nis just as thinkable. The problem for the pantheist, Mendelssohn\nsubmits, is explaining their existence, i.e., explaining what\nprivileges some divine thoughts over others.\n\nFor the theist, by contrast, there is a ready solution to the problem.\n“The thoughts of God that come to reality to the exclusion of\nthe rest will have this prerogative by virtue of their relative\ngoodness and purposiveness, insofar, namely, as they correspond thus\nand not otherwise, here and now, to the idea of the perfect and\nbest” (Morning Hours, p. 89/Gesammelte\nSchriften 3/2, p. 122).\n\nStill, the difference between the theist and a refined pantheist is by\nno means this simple, Mendelssohn is quick to add. To be sure, Spinoza\nconceived intellect and will as one and the same. Nevertheless, at\nleast as Lessing understood him, Spinoza also differentiated\nacquaintance with what is true from acquaintance with what is good and\nidentified knowledge of the good with the “will” insofar\nas through it one thought does have a prerogative over another.\nPantheism, so refined, secures religion and morality no less than\ntheism does, such that, assuming as much, Mendelssohn is led to ask:\n“in what way now does the system defended by my friend [Lessing]\ndiffer from ours?” (Morning Hours, p. 89/Gesammelte\nSchriften, 3/2, p. 123). Seen in this light, the difference\nbetween theism and refined pantheism turns in the end on a speculative\nsubtlety without practical consequences, namely, on different\ninterpretations of the metaphor of divine light. Mendelssohn\naccordingly concludes that, like many another dispute in metaphysics\nand epistemology, the dispute between refined pantheists and\ntraditional theists is purely verbal.\n\n",
    "section_title": "9. Controversy with Jacobi over Lessing’s alleged pantheism",
    "entry_title": "Moses Mendelssohn",
    "hierarchy_title": "Moses Mendelssohn || Language",
    "tokenized_text": [
        "language",
        "controversy",
        "jacobi",
        "lessing",
        "alleged",
        "pantheism",
        "mendelssohn",
        "enjoyed",
        "noted",
        "outset",
        "lifelong",
        "friendship",
        "g",
        "e",
        "lessing",
        "addition",
        "work",
        "coeditors",
        "lessing",
        "anonymously",
        "published",
        "mendelssohn",
        "earliest",
        "work",
        "collaborated",
        "piece",
        "pope",
        "metaphysician",
        "popular",
        "play",
        "influential",
        "work",
        "dramaturg",
        "stormy",
        "public",
        "debate",
        "orthodox",
        "lutheran",
        "clergy",
        "lessing",
        "particularly",
        "daunting",
        "engaging",
        "spokesman",
        "german",
        "enlightenment",
        "making",
        "dangerous",
        "opponent",
        "final",
        "work",
        "nathan",
        "wiseman",
        "fittingly",
        "portrays",
        "jewish",
        "sage",
        "presumably",
        "modeled",
        "mendelssohn",
        "make",
        "poignant",
        "plea",
        "tolerance",
        "arguing",
        "difference",
        "among",
        "religion",
        "essentially",
        "matter",
        "history",
        "reason",
        "along",
        "mendelssohn",
        "lessing",
        "embraced",
        "idea",
        "purely",
        "rational",
        "religion",
        "would",
        "endorse",
        "mendelssohn",
        "declaration",
        "religion",
        "recognizes",
        "obligation",
        "resolve",
        "doubt",
        "rational",
        "mean",
        "command",
        "mere",
        "faith",
        "eternal",
        "truth",
        "gesammelte",
        "schriften",
        "volume",
        "p",
        "pietists",
        "day",
        "declaration",
        "scandalous",
        "subterfuge",
        "enlightenment",
        "project",
        "assimilating",
        "religion",
        "natural",
        "reason",
        "mention",
        "already",
        "made",
        "lavater",
        "attempt",
        "draw",
        "mendelssohn",
        "religious",
        "debate",
        "mendelssohn",
        "skillfully",
        "avoided",
        "confrontation",
        "found",
        "reluctantly",
        "unable",
        "remain",
        "silent",
        "lessing",
        "death",
        "f",
        "h",
        "jacobi",
        "contended",
        "lessing",
        "embraced",
        "spinoza",
        "pantheism",
        "thus",
        "exemplified",
        "enlightenment",
        "supposedly",
        "inevitable",
        "descent",
        "irreligion",
        "following",
        "private",
        "correspondence",
        "jacobi",
        "issue",
        "extended",
        "period",
        "jacobi",
        "personal",
        "strait",
        "time",
        "respond",
        "objection",
        "mendelssohn",
        "attempted",
        "set",
        "record",
        "straight",
        "lessing",
        "spinozism",
        "morning",
        "hour",
        "learning",
        "mendelssohn",
        "plan",
        "incensed",
        "jacobi",
        "expected",
        "consulted",
        "first",
        "accordingly",
        "responded",
        "publishing",
        "without",
        "mendelssohn",
        "consent",
        "correspondence",
        "teaching",
        "spinoza",
        "letter",
        "mr",
        "moses",
        "mendelssohn",
        "month",
        "publication",
        "morning",
        "hour",
        "distressed",
        "personal",
        "well",
        "intellectual",
        "level",
        "controversy",
        "departed",
        "friend",
        "pantheism",
        "mendelssohn",
        "countered",
        "hastily",
        "composed",
        "piece",
        "friend",
        "lessing",
        "appendix",
        "mr",
        "jacobi",
        "correspondence",
        "teaching",
        "spinoza",
        "according",
        "legend",
        "anxious",
        "mendelssohn",
        "get",
        "manuscript",
        "publisher",
        "forgetting",
        "overcoat",
        "bitterly",
        "cold",
        "new",
        "year",
        "eve",
        "delivered",
        "manuscript",
        "foot",
        "publisher",
        "night",
        "came",
        "cold",
        "died",
        "four",
        "day",
        "later",
        "prompting",
        "friend",
        "charge",
        "jacobi",
        "responsibility",
        "mendelssohn",
        "death",
        "sensationalist",
        "character",
        "controversy",
        "obscure",
        "substance",
        "importance",
        "mendelssohn",
        "debate",
        "jacobi",
        "jacobi",
        "contended",
        "spinozism",
        "consistent",
        "position",
        "metaphysics",
        "based",
        "upon",
        "reason",
        "alone",
        "solution",
        "metaphysics",
        "detrimental",
        "religion",
        "morality",
        "leap",
        "faith",
        "salto",
        "mortale",
        "poor",
        "lessing",
        "famously",
        "refused",
        "make",
        "mendelssohn",
        "counter",
        "jacobi",
        "first",
        "contention",
        "attempting",
        "demonstrate",
        "metaphysical",
        "inconsistency",
        "spinozism",
        "take",
        "aim",
        "jacobi",
        "second",
        "contention",
        "demonstrating",
        "purified",
        "spinozism",
        "refined",
        "pantheism",
        "embraced",
        "lessing",
        "end",
        "nominally",
        "different",
        "theism",
        "thus",
        "threat",
        "neither",
        "religion",
        "morality",
        "mendelssohn",
        "criticism",
        "spinoza",
        "discussed",
        "first",
        "complexity",
        "relationship",
        "spinoza",
        "noted",
        "first",
        "publication",
        "dialogue",
        "argued",
        "many",
        "spinoza",
        "view",
        "compatible",
        "true",
        "philosophy",
        "religion",
        "mendelssohn",
        "mind",
        "leibniz",
        "may",
        "given",
        "true",
        "philosophy",
        "sharpest",
        "formulation",
        "likelihood",
        "deriving",
        "central",
        "idea",
        "preestablished",
        "harmony",
        "spinoza",
        "moreover",
        "mendelssohn",
        "put",
        "spinoza",
        "much",
        "deny",
        "distinctiveness",
        "actual",
        "world",
        "construe",
        "mind",
        "god",
        "creation",
        "existing",
        "part",
        "god",
        "philosophical",
        "writing",
        "ff",
        "ff",
        "quarter",
        "century",
        "later",
        "mendelssohn",
        "recapitulates",
        "latter",
        "argument",
        "key",
        "understanding",
        "purified",
        "refined",
        "spinozism",
        "lessing",
        "least",
        "realm",
        "philosophical",
        "debate",
        "would",
        "dismissed",
        "hand",
        "nevertheless",
        "noted",
        "part",
        "response",
        "jacobi",
        "consists",
        "demonstrating",
        "shortcoming",
        "spinoza",
        "philosophy",
        "might",
        "expected",
        "criticizes",
        "spinoza",
        "idea",
        "one",
        "infinite",
        "necessary",
        "substance",
        "idea",
        "arbitrary",
        "mendelssohn",
        "contends",
        "since",
        "one",
        "legitimately",
        "distinguish",
        "independent",
        "selfstanding",
        "da",
        "selbständige",
        "obtains",
        "persists",
        "da",
        "fürsichbestehende",
        "instead",
        "proving",
        "everything",
        "obtaining",
        "one",
        "spinoza",
        "establishes",
        "end",
        "everything",
        "independent",
        "one",
        "instead",
        "demonstrating",
        "entire",
        "aggregate",
        "everything",
        "finite",
        "constitutes",
        "single",
        "selfstanding",
        "substance",
        "merely",
        "show",
        "aggregate",
        "must",
        "depend",
        "upon",
        "sole",
        "infinite",
        "substance",
        "gesammelte",
        "schriften",
        "p",
        "deeper",
        "level",
        "mendelssohn",
        "put",
        "also",
        "take",
        "issue",
        "spinoza",
        "failing",
        "account",
        "mendelssohn",
        "deems",
        "formal",
        "aspect",
        "corporeal",
        "spiritual",
        "world",
        "thus",
        "spinoza",
        "conception",
        "extension",
        "term",
        "impenetrability",
        "may",
        "explain",
        "essence",
        "matter",
        "leaf",
        "unexplained",
        "mendelssohn",
        "contends",
        "particular",
        "organization",
        "movement",
        "body",
        "unclear",
        "mendelssohn",
        "part",
        "motion",
        "whole",
        "upon",
        "completely",
        "depend",
        "spinoza",
        "substance",
        "motion",
        "similarly",
        "want",
        "know",
        "basis",
        "spinoza",
        "account",
        "supposedly",
        "underlying",
        "attribute",
        "extension",
        "part",
        "come",
        "particular",
        "form",
        "organization",
        "motion",
        "force",
        "say",
        "organic",
        "selfregulating",
        "entity",
        "origin",
        "motion",
        "form",
        "found",
        "asks",
        "whole",
        "since",
        "whole",
        "movement",
        "sum",
        "sämmtliche",
        "body",
        "untied",
        "single",
        "substance",
        "change",
        "place",
        "neither",
        "organization",
        "figure",
        "whence",
        "form",
        "part",
        "whole",
        "provides",
        "source",
        "gesammelte",
        "schriften",
        "p",
        "spinoza",
        "explains",
        "matter",
        "form",
        "physical",
        "world",
        "mendelssohn",
        "charge",
        "give",
        "account",
        "matter",
        "form",
        "spiritual",
        "world",
        "connection",
        "helpful",
        "recall",
        "mendelssohn",
        "differentiation",
        "knowing",
        "approving",
        "desiring",
        "one",
        "another",
        "truth",
        "falsity",
        "corresponding",
        "knowing",
        "provide",
        "matter",
        "spiritual",
        "world",
        "may",
        "spinoza",
        "maintains",
        "origin",
        "thought",
        "attribute",
        "single",
        "infinite",
        "substance",
        "category",
        "corresponding",
        "knowledge",
        "approving",
        "desiring",
        "must",
        "source",
        "thus",
        "according",
        "mendelssohn",
        "spinoza",
        "leaf",
        "unexplained",
        "difference",
        "good",
        "evil",
        "desirable",
        "undesirable",
        "pleasure",
        "pain",
        "gesammelte",
        "schriften",
        "iii",
        "p",
        "yet",
        "criticism",
        "spinoza",
        "may",
        "compelling",
        "mendelssohn",
        "recognizes",
        "carry",
        "day",
        "refined",
        "spinozist",
        "pantheist",
        "spinoza",
        "inability",
        "explain",
        "movement",
        "value",
        "derive",
        "attribute",
        "one",
        "infinite",
        "substance",
        "establish",
        "theist",
        "explanation",
        "mendelssohn",
        "view",
        "accordingly",
        "morning",
        "hour",
        "cast",
        "lessing",
        "spokesperson",
        "refined",
        "pantheism",
        "move",
        "figure",
        "prominently",
        "contribution",
        "pantheismusstreit",
        "lessing",
        "portrayed",
        "someone",
        "agreeing",
        "mendelssohn",
        "theist",
        "position",
        "knack",
        "giving",
        "every",
        "reasonable",
        "argument",
        "full",
        "due",
        "context",
        "lessing",
        "present",
        "pantheism",
        "characterizes",
        "one",
        "substance",
        "source",
        "motion",
        "desire",
        "also",
        "capable",
        "representing",
        "every",
        "possibility",
        "approving",
        "possibility",
        "constitutes",
        "best",
        "perfect",
        "series",
        "thing",
        "morning",
        "hour",
        "p",
        "gesammelte",
        "schriften",
        "p",
        "word",
        "refined",
        "pantheism",
        "includes",
        "every",
        "aspect",
        "entire",
        "metaphysical",
        "system",
        "theism",
        "cast",
        "solely",
        "object",
        "divine",
        "intellect",
        "result",
        "refined",
        "spinozist",
        "might",
        "wonder",
        "different",
        "position",
        "since",
        "theist",
        "purport",
        "explain",
        "seemingly",
        "recalcitrant",
        "phenomenon",
        "merely",
        "appealing",
        "divine",
        "refined",
        "pantheist",
        "might",
        "accept",
        "difference",
        "world",
        "thought",
        "god",
        "thinker",
        "certain",
        "level",
        "insist",
        "end",
        "difference",
        "merely",
        "abstract",
        "level",
        "since",
        "thinking",
        "thought",
        "distinguished",
        "long",
        "one",
        "actually",
        "thinking",
        "tell",
        "u",
        "world",
        "surrounding",
        "u",
        "something",
        "thought",
        "god",
        "modification",
        "original",
        "power",
        "morning",
        "hour",
        "p",
        "translation",
        "slightly",
        "altered",
        "gesammelte",
        "schriften",
        "p",
        "pretend",
        "show",
        "something",
        "predicated",
        "thing",
        "outside",
        "god",
        "predicated",
        "divine",
        "thought",
        "thing",
        "deny",
        "divine",
        "omniscience",
        "without",
        "qualification",
        "pantheist",
        "line",
        "reasoning",
        "faulty",
        "mendelssohn",
        "submits",
        "least",
        "three",
        "reason",
        "first",
        "place",
        "abolishes",
        "distinction",
        "presupposed",
        "truthful",
        "statement",
        "ie",
        "distinction",
        "original",
        "copy",
        "secondly",
        "indefeasible",
        "mark",
        "distinguish",
        "finite",
        "selfconsciousness",
        "object",
        "original",
        "divine",
        "representation",
        "copy",
        "consciousness",
        "combined",
        "complete",
        "ignorance",
        "everything",
        "fall",
        "within",
        "sphere",
        "thinking",
        "telling",
        "proof",
        "substantiality",
        "outside",
        "god",
        "original",
        "existence",
        "morning",
        "hour",
        "p",
        "translation",
        "slightly",
        "altered",
        "gesammelte",
        "schriften",
        "p",
        "finally",
        "pantheist",
        "confuses",
        "divine",
        "knowledge",
        "divine",
        "approval",
        "god",
        "know",
        "perfectly",
        "well",
        "shortcoming",
        "without",
        "approving",
        "requiring",
        "existence",
        "moreover",
        "thinkable",
        "hardly",
        "explains",
        "existence",
        "since",
        "opposite",
        "thinkable",
        "problem",
        "pantheist",
        "mendelssohn",
        "submits",
        "explaining",
        "existence",
        "ie",
        "explaining",
        "privilege",
        "divine",
        "thought",
        "others",
        "theist",
        "contrast",
        "ready",
        "solution",
        "problem",
        "thought",
        "god",
        "come",
        "reality",
        "exclusion",
        "rest",
        "prerogative",
        "virtue",
        "relative",
        "goodness",
        "purposiveness",
        "insofar",
        "namely",
        "correspond",
        "thus",
        "otherwise",
        "idea",
        "perfect",
        "best",
        "morning",
        "hour",
        "p",
        "gesammelte",
        "schriften",
        "p",
        "still",
        "difference",
        "theist",
        "refined",
        "pantheist",
        "mean",
        "simple",
        "mendelssohn",
        "quick",
        "add",
        "sure",
        "spinoza",
        "conceived",
        "intellect",
        "one",
        "nevertheless",
        "least",
        "lessing",
        "understood",
        "spinoza",
        "also",
        "differentiated",
        "acquaintance",
        "true",
        "acquaintance",
        "good",
        "identified",
        "knowledge",
        "good",
        "insofar",
        "one",
        "thought",
        "prerogative",
        "another",
        "pantheism",
        "refined",
        "secures",
        "religion",
        "morality",
        "le",
        "theism",
        "assuming",
        "much",
        "mendelssohn",
        "led",
        "ask",
        "way",
        "system",
        "defended",
        "friend",
        "lessing",
        "differ",
        "morning",
        "hour",
        "p",
        "gesammelte",
        "schriften",
        "p",
        "seen",
        "light",
        "difference",
        "theism",
        "refined",
        "pantheism",
        "turn",
        "end",
        "speculative",
        "subtlety",
        "without",
        "practical",
        "consequence",
        "namely",
        "different",
        "interpretation",
        "metaphor",
        "divine",
        "light",
        "mendelssohn",
        "accordingly",
        "concludes",
        "like",
        "many",
        "another",
        "dispute",
        "metaphysics",
        "epistemology",
        "dispute",
        "refined",
        "pantheist",
        "traditional",
        "theist",
        "purely",
        "verbal"
    ]
}