{
    "main_text": "Core Principles || Parthood as a Partial Ordering\n2.1 Parthood as a Partial Ordering\n\nThe usual starting point is this: regardless of how one feels about\nmatters of ontology, if ‘part’ stands for the general\nrelation exemplified by (1)–(8) above, and perhaps also\n(12)–(15), then it stands for a partial ordering—a\nreflexive, transitive, antisymmetric relation:\n\n\n(16)\nEverything is part of itself. \n\n(17)\nAny part of any part of a thing is itself part of that\nthing. \n\n(18)\nTwo distinct things cannot be part of each other. \n\n\nAs it turns out, most theories put forward in the literature accept\n(16)–(18). Some misgivings are nonetheless worth mentioning that\nmay, and occasionally have been, raised against these principles.\n\nConcerning reflexivity (16), two sorts of worry may be distinguished.\nThe first is that many legitimate senses of ‘part’ just\nfly in the face of saying that a whole is part of itself. For\ninstance, Rescher (1955) famously objected to Leonard and Goodman's\ntheory on these grounds, citing the biologists' use of\n‘part’ for the functional subunits of an organism as a\ncase in point: no organism is a functional subunit of itself. This is\na legitimate worry, but it appears to be of little import. Taking\nreflexivity (and antisymmetry) as constitutive of the meaning of\n‘part’ simply amounts to regarding identity as a limit\n(improper) case of parthood. A stronger relation, whereby nothing\ncounts as part of itself, can obviously be defined in terms of the\nweaker one, hence there is no loss of generality (see Section 2.2\nbelow). Vice versa, one could frame a mereological theory by taking\nproper parthood as a primitive instead. As already Lejewski (1957)\nnoted, this is merely a question of choosing a suitable primitive, so\nnothing substantive follows from it. (Of course, if one thinks that\nthere are or might be objects that are not self-identical,\nfor instance because of the loss of individuality in the quantum\nrealm, or for whatever other reasons, then such objects would not be\npart of themselves either, yielding genuine counterexamples to (16).\nHere, however, we stick to a notion of identity that obeys traditional\nwisdom, which is to say a notion whereby identity is an equivalence\nrelation subject to Leibniz's law.) The second sort of worry is more\nserious, for it constitutes a genuine challenge to the idea that (16)\nexpresses a principle that is somehow constitutive of the meaning of\n‘part’, as opposed to a substantive metaphysical thesis\nabout parthood. Following Kearns (2011), consider for instance a\nscenario in which an enduring wall, W, is shrunk down to the size of a\nbrick and eventually brought back in time so as to be used to build\n(along with other bricks) the original W. Or suppose wall W is\nbilocated to my left and my right, and I shrink it to the size of a\nbrick on the left and then use it to replace a brick from W on the\nright. In such cases, one might think that W is part of itself in a\nsense in which ordinary walls are not, hence that either parthood is\nnot reflexive or proper parthood is not irreflexive. For another\nexample (also by Kearns), if shapes are construed as abstract\nuniversals, then self-similar shapes such as fractals may very well be\nsaid to contain themselves as parts in a sense in which other shapes\ndo not. Whether such scenarios are indeed possible is by itself a\ncontroversial issue, as it depends on a number of background\nmetaphysical questions concerning persistence through time, location\nin space, and the nature of shapes. But precisely insofar as the\nscenarios are not obviously impossible, the generality and\nmetaphysical neutrality of (16) may be questioned. (Note that those\nscenarios also provide reasons to question the generality of many\nother claims that underlie the way we ordinarily talk, such as the\nclaim that nothing can be larger than itself, or\nnext to itself, or qualitatively different from\nitself. Such claims might be even more entrenched in common sense than\nthe claim that proper parthood is irreflexive, and parthood reflexive;\nyet this is hardly a reason to hang on to them at every cost. It\nsimply shows that our ordinary talk does not take into account\nsituations that are—admittedly—extraordinary.)\n\nSimilar considerations apply to the transitivity principle, (17). On\nthe one hand, several authors have observed that many legitimate\nsenses of ‘part’ are non-transitive, fostering the study\nof mereologies in which (17) may fail (Pietruszczak 2014). Examples\nwould include: (i) a biological subunit of a cell is not a part of the\norgan(ism) of which that cell is a part; (ii) a handle can be part of\na door and the door of a house, though a handle is never part of a\nhouse; (iii) my fingers are part of me and I am part of the team, yet\nmy fingers are not part of the team. (See again Rescher 1955 along\nwith Cruse 1979 and Winston et al. 1987, respectively; for\nother examples see Iris et al. 1988, Moltmann 1997, Hossack\n2000, Johnston 2002, 2005, Johansson 2004, 2006, and Fiorini et\nal. 2014). Arguably, however, such misgivings stem again from the\nambiguity of the English word ‘part’. What counts as a\nbiological subunit of a cell may not count as a subunit, i.e., a\ndistinguished part of the organ, but that is not to say that\nit is not part of the organ at all. Similarly, if there is a sense of\n‘part’ in which a handle is not part of the house to which\nit belongs, or my fingers not part of my team, it is a restricted\nsense: the handle is not a functional part of the house,\nthough it is a functional part of the door and the door a functional\npart of the house; my fingers are not directly part of the\nteam, though they are directly part of me and I am directly part of\nthe team. (Concerning this last case, Uzquiano 2004: 136–137,\nSchmitt 2003: 34, and Effingham 2010b: 255 actually read (iii) as a\nreductio of the very idea that the group-membership relation\nis a genuine case of parthood, as mentioned above ad (11).)\nIt is obvious that if the interpretation of ‘part’ is\nnarrowed by additional conditions, e.g., by requiring that parts make\na functional or direct contribution to the whole, then transitivity\nmay fail. In general, if x is a φ-part of y and\ny is a φ-part of z, x need not be a\nφ-part of z: the predicate modifier ‘φ’\nmay not distribute over parthood. But that shows the non-transitivity\nof ‘φ-part’, not of ‘part’, and within a\nsufficiently general framework this can easily be expressed with the\nhelp of explicit predicate modifiers (Varzi 2006a; Vieu 2006; Garbacz\n2007). On the other hand, there is again a genuine worry that,\nregardless of any ambiguity concerning the intended interpretation of\n‘part’, (17) expresses a substantive metaphysical thesis\nand cannot, therefore, be taken for granted. For example, it turns out\nthat time-travel and multi-location scenarios such as those mentioned\nin relation to (16) may also result in violations of the transitivity\nof both parthood (Effingham 2010a) and proper parthood (Gilmore 2009;\nKleinschmidt 2011). And the same could be said of cases that involve\nno such exotica. For instance, Gilmore (2014) brings\nattention to the popular theory of structured propositions originated\nwith Russell (1903). Already Frege (1976: 79) pointed out that if the\nconstituents of a proposition are construed mereologically as (proper)\nparts, then we have a problem: assuming that Mount Etna is literally\npart of the proposition that Etna is higher than Vesuvius, each\nindividual piece of solidified lava that is part of Etna would also be\npart of that proposition, which is absurd. The worse for Russell's\ntheory of structured propositions, said Frege. The worse, one could\nreply, for the transitivity of parthood (short of claiming that the\nargument involves yet another equivocation on ‘part\nof’).\n\nConcerning the antisymmetry postulate (18), the picture is even more\ncomplex. For one thing, some authors maintain that the relationship\nbetween an object and the stuff it is made of provides a perfectly\nordinary counterexample of the antisymmetry of parthood: according to\nThomson (1998), for example, a statue and the clay that constitutes it\nare part of each other, yet distinct. This is not a popular view: as\nalready mentioned, most contemporary authors would either deny that\nmaterial constitution is a relation of parthood or else treat it as\nimproper parthood, i.e., identity, which is trivially\nantisymmetric (and symmetric). Moreover, those who regard constitution\nas a genuine case of proper parthood tend to follow Aristotle's\nhylomorphic conception and deny that the relation also holds in the\nopposite direction: the clay is part of the statue but not vice versa\n(see e.g. Haslanger 1994, Koslicki 2008). Still, insofar as Thomson's\nview is a legitimate option, it represents a challenge to the putative\ngenerality of (18). Second, one may wonder about the possibility of\nunordinary cases of symmetric parthood relationships. Sanford\n(1993: 222) refers to Borges's Aleph as a case in point: “I saw\nthe earth in the Aleph and in the earth the Aleph once more and the\nearth in the Aleph …”. In this case, a plausible reply is\nsimply that fiction delivers no guidance to conceptual investigations:\nconceivability may well be a guide to possibility, but literary\nfantasy is by itself no evidence of conceivability (van Inwagen 1993:\n229). Perhaps the same could be said of Fazang's Jeweled Net of Indra,\nin which each jewel has every other jewel as part (Jones 2012).\nHowever, other cases seem harder to dismiss. Surely the Scholastics\nwere not merely engaging in literary fiction when arguing that each\nperson of the Trinity is a proper part of God, and yet also identical\nwith God (see e.g. Abelard, Theologia christiana, bk. III).\nAnd arguably time travel is at least conceivable, in which case again\n(18) could fail: if time-traveling wall W ends up being one of the\nbricks that compose (say) its own bottom half, H, then we have a\nconceivable scenario in which W is part of H and H is part of W while\nW ≠ H (Kleinschmidt 2011). Third, it may be argued that\nantisymmetry is also at odds with theories that have been found\nacceptable on quite independent grounds. Consider again the theory of\nstructured propositions. If A is the proposition that the\nuniverse exists—where the universe is something of which\neverything is part—and if A is true, then on such a\ntheory the universe would be a proper part of A; and since\nA would in turn be a proper part of U, antisymmetry would be\nforfeit (Tillman and Fowler 2012). Likewise, if A is the\nproposition that B is true, and B the proposition\nthat A is contingent, then again A and B\nwould be part of each other even though A ≠ B\n(Cotnoir 2013b). Finally, and more generally, it may be observed that\nthe possibility of mereological loops is to be taken seriously for the\nsame sort of reasons that led to the development of non-well-founded\nset theory, i.e., set theory tolerating cases of self-membership and,\nmore generally, of membership circularities (Aczel 1988; Barwise and\nMoss 1996). This is especially significant in view of the possibility\nof reformulating set theory itself in mereological terms—a\npossibility that is extensively worked out in the works of Bunt (1985)\nand especially Lewis (1991, 1993b) (see also Burgess 2015 and Hamkins\nand Kikuchi forthcoming). For all these reasons, the antisymmetry\npostulate (18) can hardly be regarded as constitutive of the basic\nmeaning of ‘part’, and some authors have begun to engage\nin the systematic study of “non-well-founded mereologies”\nin which (18) may fail (Cotnoir 2010; Cotnoir and Bacon 2012; Obojska\n2013). \n\nIn the following we aim at a critical survey of mereology as\nstandardly understood, so we shall mainly confine ourselves to\ntheories that do in fact accept the antisymmetry postulate along with\nboth reflexivity and transitivity. However, the above considerations\nshould not be dismissed. On the contrary, they are crucially relevant\nin assessing the scope of mereology and the degree to which its\nstandard formulations and extensions betray intuitions that may be\nfound too narrow, false, or otherwise problematic. Indeed, they are\ncrucially relevant also in assessing the ideal desideratum mentioned\nat the beginning of this section—the desideratum of a neat\ndemarcation between core principles that are simply meant to fix the\nintended meaning of ‘part’ and principles that reflect\nmore substantive theses concerning the parthood relation. Classical\nmereology takes the former to include the threefold claim that\n‘part’ stands for a reflexive, transitive and\nantisymmetric relation, but this is not to say that “anyone who\nseriously disagrees with them had failed to understand the word”\n(Simons 1987: 11), just as departure from the basic principles of\nclassical logic need not amount to a “change of subject”\n(Quine 1970: 81). And just as the existence of widespread and\ndiversified disagreement concerning the laws of logic may lead one to\nconclude that “for all we know, the only inference left in the\nintersection of (unrestricted) all logics might be the\nidentity inference: From A to infer\nA” (Beall and Restall 2006: 92), so one might take the\nabove considerations and the corresponding development of\nnon-classical mereologies to indicate that there may be “no\nreason to assume that any useful core mereology […] functions\nas a common basis for all plausible metaphysical theories”\n(Donnelly 2011: 246).\n",
    "section_title": "2.1 Parthood as a Partial Ordering",
    "entry_title": "Mereology",
    "hierarchy_title": "Mereology || Core Principles || Parthood as a Partial Ordering",
    "tokenized_text": [
        "core",
        "principle",
        "parthood",
        "partial",
        "ordering",
        "parthood",
        "partial",
        "ordering",
        "usual",
        "starting",
        "point",
        "regardless",
        "one",
        "feel",
        "matter",
        "ontology",
        "part",
        "stand",
        "general",
        "relation",
        "exemplified",
        "perhaps",
        "also",
        "stand",
        "partial",
        "orderinga",
        "reflexive",
        "transitive",
        "antisymmetric",
        "relation",
        "everything",
        "part",
        "part",
        "part",
        "thing",
        "part",
        "thing",
        "two",
        "distinct",
        "thing",
        "part",
        "turn",
        "theory",
        "put",
        "forward",
        "literature",
        "accept",
        "misgiving",
        "nonetheless",
        "worth",
        "mentioning",
        "may",
        "occasionally",
        "raised",
        "principle",
        "concerning",
        "reflexivity",
        "two",
        "sort",
        "worry",
        "may",
        "distinguished",
        "first",
        "many",
        "legitimate",
        "sens",
        "part",
        "fly",
        "face",
        "saying",
        "whole",
        "part",
        "instance",
        "rescher",
        "famously",
        "objected",
        "leonard",
        "goodman",
        "s",
        "theory",
        "ground",
        "citing",
        "biologist",
        "use",
        "part",
        "functional",
        "subunit",
        "organism",
        "case",
        "point",
        "organism",
        "functional",
        "subunit",
        "legitimate",
        "worry",
        "appears",
        "little",
        "import",
        "taking",
        "reflexivity",
        "antisymmetry",
        "constitutive",
        "meaning",
        "part",
        "simply",
        "amount",
        "regarding",
        "identity",
        "limit",
        "improper",
        "case",
        "parthood",
        "stronger",
        "relation",
        "whereby",
        "nothing",
        "count",
        "part",
        "obviously",
        "defined",
        "term",
        "weaker",
        "one",
        "hence",
        "loss",
        "generality",
        "see",
        "section",
        "vice",
        "versa",
        "one",
        "could",
        "frame",
        "mereological",
        "theory",
        "taking",
        "proper",
        "parthood",
        "primitive",
        "instead",
        "already",
        "lejewski",
        "noted",
        "merely",
        "question",
        "choosing",
        "suitable",
        "primitive",
        "nothing",
        "substantive",
        "follows",
        "course",
        "one",
        "think",
        "might",
        "object",
        "selfidentical",
        "instance",
        "loss",
        "individuality",
        "quantum",
        "realm",
        "whatever",
        "reason",
        "object",
        "would",
        "part",
        "either",
        "yielding",
        "genuine",
        "counterexample",
        "however",
        "stick",
        "notion",
        "identity",
        "obeys",
        "traditional",
        "wisdom",
        "say",
        "notion",
        "whereby",
        "identity",
        "equivalence",
        "relation",
        "subject",
        "leibniz",
        "s",
        "law",
        "second",
        "sort",
        "worry",
        "serious",
        "constitutes",
        "genuine",
        "challenge",
        "idea",
        "express",
        "principle",
        "somehow",
        "constitutive",
        "meaning",
        "part",
        "opposed",
        "substantive",
        "metaphysical",
        "thesis",
        "parthood",
        "following",
        "kearns",
        "consider",
        "instance",
        "scenario",
        "enduring",
        "wall",
        "w",
        "shrunk",
        "size",
        "brick",
        "eventually",
        "brought",
        "back",
        "time",
        "used",
        "build",
        "along",
        "brick",
        "original",
        "w",
        "suppose",
        "wall",
        "w",
        "bilocated",
        "left",
        "right",
        "shrink",
        "size",
        "brick",
        "left",
        "use",
        "replace",
        "brick",
        "w",
        "right",
        "case",
        "one",
        "might",
        "think",
        "w",
        "part",
        "sense",
        "ordinary",
        "wall",
        "hence",
        "either",
        "parthood",
        "reflexive",
        "proper",
        "parthood",
        "irreflexive",
        "another",
        "example",
        "also",
        "kearns",
        "shape",
        "construed",
        "abstract",
        "universal",
        "selfsimilar",
        "shape",
        "fractal",
        "may",
        "well",
        "said",
        "contain",
        "part",
        "sense",
        "shape",
        "whether",
        "scenario",
        "indeed",
        "possible",
        "controversial",
        "issue",
        "depends",
        "number",
        "background",
        "metaphysical",
        "question",
        "concerning",
        "persistence",
        "time",
        "location",
        "space",
        "nature",
        "shape",
        "precisely",
        "insofar",
        "scenario",
        "obviously",
        "impossible",
        "generality",
        "metaphysical",
        "neutrality",
        "may",
        "questioned",
        "note",
        "scenario",
        "also",
        "provide",
        "reason",
        "question",
        "generality",
        "many",
        "claim",
        "underlie",
        "way",
        "ordinarily",
        "talk",
        "claim",
        "nothing",
        "larger",
        "next",
        "qualitatively",
        "different",
        "claim",
        "might",
        "even",
        "entrenched",
        "common",
        "sense",
        "claim",
        "proper",
        "parthood",
        "irreflexive",
        "parthood",
        "reflexive",
        "yet",
        "hardly",
        "reason",
        "hang",
        "every",
        "cost",
        "simply",
        "show",
        "ordinary",
        "talk",
        "take",
        "account",
        "situation",
        "areadmittedlyextraordinary",
        "similar",
        "consideration",
        "apply",
        "transitivity",
        "principle",
        "one",
        "hand",
        "several",
        "author",
        "observed",
        "many",
        "legitimate",
        "sens",
        "part",
        "nontransitive",
        "fostering",
        "study",
        "mereologies",
        "may",
        "fail",
        "pietruszczak",
        "example",
        "would",
        "include",
        "biological",
        "subunit",
        "cell",
        "part",
        "organ",
        "ism",
        "cell",
        "part",
        "ii",
        "handle",
        "part",
        "door",
        "door",
        "house",
        "though",
        "handle",
        "never",
        "part",
        "house",
        "iii",
        "finger",
        "part",
        "part",
        "team",
        "yet",
        "finger",
        "part",
        "team",
        "see",
        "rescher",
        "along",
        "cruse",
        "winston",
        "et",
        "al",
        "respectively",
        "example",
        "see",
        "iris",
        "et",
        "al",
        "moltmann",
        "hossack",
        "johnston",
        "johansson",
        "fiorini",
        "et",
        "al",
        "arguably",
        "however",
        "misgiving",
        "stem",
        "ambiguity",
        "english",
        "word",
        "part",
        "count",
        "biological",
        "subunit",
        "cell",
        "may",
        "count",
        "subunit",
        "ie",
        "distinguished",
        "part",
        "organ",
        "say",
        "part",
        "organ",
        "similarly",
        "sense",
        "part",
        "handle",
        "part",
        "house",
        "belongs",
        "finger",
        "part",
        "team",
        "restricted",
        "sense",
        "handle",
        "functional",
        "part",
        "house",
        "though",
        "functional",
        "part",
        "door",
        "door",
        "functional",
        "part",
        "house",
        "finger",
        "directly",
        "part",
        "team",
        "though",
        "directly",
        "part",
        "directly",
        "part",
        "team",
        "concerning",
        "last",
        "case",
        "uzquiano",
        "schmitt",
        "effingham",
        "b",
        "actually",
        "read",
        "iii",
        "reductio",
        "idea",
        "groupmembership",
        "relation",
        "genuine",
        "case",
        "parthood",
        "mentioned",
        "ad",
        "obvious",
        "interpretation",
        "part",
        "narrowed",
        "additional",
        "condition",
        "eg",
        "requiring",
        "part",
        "make",
        "functional",
        "direct",
        "contribution",
        "whole",
        "transitivity",
        "may",
        "fail",
        "general",
        "x",
        "φpart",
        "φpart",
        "z",
        "x",
        "need",
        "φpart",
        "z",
        "predicate",
        "modifier",
        "φ",
        "may",
        "distribute",
        "parthood",
        "show",
        "nontransitivity",
        "φpart",
        "part",
        "within",
        "sufficiently",
        "general",
        "framework",
        "easily",
        "expressed",
        "help",
        "explicit",
        "predicate",
        "modifier",
        "varzi",
        "a",
        "vieu",
        "garbacz",
        "hand",
        "genuine",
        "worry",
        "regardless",
        "ambiguity",
        "concerning",
        "intended",
        "interpretation",
        "part",
        "express",
        "substantive",
        "metaphysical",
        "thesis",
        "therefore",
        "taken",
        "granted",
        "example",
        "turn",
        "timetravel",
        "multilocation",
        "scenario",
        "mentioned",
        "relation",
        "may",
        "also",
        "result",
        "violation",
        "transitivity",
        "parthood",
        "effingham",
        "a",
        "proper",
        "parthood",
        "gilmore",
        "kleinschmidt",
        "could",
        "said",
        "case",
        "involve",
        "exotica",
        "instance",
        "gilmore",
        "brings",
        "attention",
        "popular",
        "theory",
        "structured",
        "proposition",
        "originated",
        "russell",
        "already",
        "frege",
        "pointed",
        "constituent",
        "proposition",
        "construed",
        "mereologically",
        "proper",
        "part",
        "problem",
        "assuming",
        "mount",
        "etna",
        "literally",
        "part",
        "proposition",
        "etna",
        "higher",
        "vesuvius",
        "individual",
        "piece",
        "solidified",
        "lava",
        "part",
        "etna",
        "would",
        "also",
        "part",
        "proposition",
        "absurd",
        "worse",
        "russell",
        "s",
        "theory",
        "structured",
        "proposition",
        "said",
        "frege",
        "worse",
        "one",
        "could",
        "reply",
        "transitivity",
        "parthood",
        "short",
        "claiming",
        "argument",
        "involves",
        "yet",
        "another",
        "equivocation",
        "part",
        "concerning",
        "antisymmetry",
        "postulate",
        "picture",
        "even",
        "complex",
        "one",
        "thing",
        "author",
        "maintain",
        "relationship",
        "object",
        "stuff",
        "made",
        "provides",
        "perfectly",
        "ordinary",
        "counterexample",
        "antisymmetry",
        "parthood",
        "according",
        "thomson",
        "example",
        "statue",
        "clay",
        "constitutes",
        "part",
        "yet",
        "distinct",
        "popular",
        "view",
        "already",
        "mentioned",
        "contemporary",
        "author",
        "would",
        "either",
        "deny",
        "material",
        "constitution",
        "relation",
        "parthood",
        "else",
        "treat",
        "improper",
        "parthood",
        "ie",
        "identity",
        "trivially",
        "antisymmetric",
        "symmetric",
        "moreover",
        "regard",
        "constitution",
        "genuine",
        "case",
        "proper",
        "parthood",
        "tend",
        "follow",
        "aristotle",
        "s",
        "hylomorphic",
        "conception",
        "deny",
        "relation",
        "also",
        "hold",
        "opposite",
        "direction",
        "clay",
        "part",
        "statue",
        "vice",
        "versa",
        "see",
        "eg",
        "haslanger",
        "koslicki",
        "still",
        "insofar",
        "thomson",
        "s",
        "view",
        "legitimate",
        "option",
        "represents",
        "challenge",
        "putative",
        "generality",
        "second",
        "one",
        "may",
        "wonder",
        "possibility",
        "unordinary",
        "case",
        "symmetric",
        "parthood",
        "relationship",
        "sanford",
        "refers",
        "borges",
        "s",
        "aleph",
        "case",
        "point",
        "saw",
        "earth",
        "aleph",
        "earth",
        "aleph",
        "earth",
        "aleph",
        "case",
        "plausible",
        "reply",
        "simply",
        "fiction",
        "delivers",
        "guidance",
        "conceptual",
        "investigation",
        "conceivability",
        "may",
        "well",
        "guide",
        "possibility",
        "literary",
        "fantasy",
        "evidence",
        "conceivability",
        "van",
        "inwagen",
        "perhaps",
        "could",
        "said",
        "fazang",
        "s",
        "jeweled",
        "net",
        "indra",
        "jewel",
        "every",
        "jewel",
        "part",
        "jones",
        "however",
        "case",
        "seem",
        "harder",
        "dismiss",
        "surely",
        "scholastic",
        "merely",
        "engaging",
        "literary",
        "fiction",
        "arguing",
        "person",
        "trinity",
        "proper",
        "part",
        "god",
        "yet",
        "also",
        "identical",
        "god",
        "see",
        "eg",
        "abelard",
        "theologia",
        "christiana",
        "bk",
        "iii",
        "arguably",
        "time",
        "travel",
        "least",
        "conceivable",
        "case",
        "could",
        "fail",
        "timetraveling",
        "wall",
        "w",
        "end",
        "one",
        "brick",
        "compose",
        "say",
        "bottom",
        "half",
        "h",
        "conceivable",
        "scenario",
        "w",
        "part",
        "h",
        "h",
        "part",
        "w",
        "w",
        "h",
        "kleinschmidt",
        "third",
        "may",
        "argued",
        "antisymmetry",
        "also",
        "odds",
        "theory",
        "found",
        "acceptable",
        "quite",
        "independent",
        "ground",
        "consider",
        "theory",
        "structured",
        "proposition",
        "proposition",
        "universe",
        "existswhere",
        "universe",
        "something",
        "everything",
        "partand",
        "true",
        "theory",
        "universe",
        "would",
        "proper",
        "part",
        "since",
        "would",
        "turn",
        "proper",
        "part",
        "u",
        "antisymmetry",
        "would",
        "forfeit",
        "tillman",
        "fowler",
        "likewise",
        "proposition",
        "b",
        "true",
        "b",
        "proposition",
        "contingent",
        "b",
        "would",
        "part",
        "even",
        "though",
        "b",
        "cotnoir",
        "b",
        "finally",
        "generally",
        "may",
        "observed",
        "possibility",
        "mereological",
        "loop",
        "taken",
        "seriously",
        "sort",
        "reason",
        "led",
        "development",
        "nonwellfounded",
        "set",
        "theory",
        "ie",
        "set",
        "theory",
        "tolerating",
        "case",
        "selfmembership",
        "generally",
        "membership",
        "circularity",
        "aczel",
        "barwise",
        "moss",
        "especially",
        "significant",
        "view",
        "possibility",
        "reformulating",
        "set",
        "theory",
        "mereological",
        "termsa",
        "possibility",
        "extensively",
        "worked",
        "work",
        "bunt",
        "especially",
        "lewis",
        "b",
        "see",
        "also",
        "burgess",
        "hamkins",
        "kikuchi",
        "forthcoming",
        "reason",
        "antisymmetry",
        "postulate",
        "hardly",
        "regarded",
        "constitutive",
        "basic",
        "meaning",
        "part",
        "author",
        "begun",
        "engage",
        "systematic",
        "study",
        "nonwellfounded",
        "mereologies",
        "may",
        "fail",
        "cotnoir",
        "cotnoir",
        "bacon",
        "obojska",
        "following",
        "aim",
        "critical",
        "survey",
        "mereology",
        "standardly",
        "understood",
        "shall",
        "mainly",
        "confine",
        "theory",
        "fact",
        "accept",
        "antisymmetry",
        "postulate",
        "along",
        "reflexivity",
        "transitivity",
        "however",
        "consideration",
        "dismissed",
        "contrary",
        "crucially",
        "relevant",
        "assessing",
        "scope",
        "mereology",
        "degree",
        "standard",
        "formulation",
        "extension",
        "betray",
        "intuition",
        "may",
        "found",
        "narrow",
        "false",
        "otherwise",
        "problematic",
        "indeed",
        "crucially",
        "relevant",
        "also",
        "assessing",
        "ideal",
        "desideratum",
        "mentioned",
        "beginning",
        "sectionthe",
        "desideratum",
        "neat",
        "demarcation",
        "core",
        "principle",
        "simply",
        "meant",
        "fix",
        "intended",
        "meaning",
        "part",
        "principle",
        "reflect",
        "substantive",
        "thesis",
        "concerning",
        "parthood",
        "relation",
        "classical",
        "mereology",
        "take",
        "former",
        "include",
        "threefold",
        "claim",
        "part",
        "stand",
        "reflexive",
        "transitive",
        "antisymmetric",
        "relation",
        "say",
        "anyone",
        "seriously",
        "disagrees",
        "failed",
        "understand",
        "word",
        "simon",
        "departure",
        "basic",
        "principle",
        "classical",
        "logic",
        "need",
        "amount",
        "change",
        "subject",
        "quine",
        "existence",
        "widespread",
        "diversified",
        "disagreement",
        "concerning",
        "law",
        "logic",
        "may",
        "lead",
        "one",
        "conclude",
        "know",
        "inference",
        "left",
        "intersection",
        "unrestricted",
        "logic",
        "might",
        "identity",
        "inference",
        "infer",
        "beall",
        "restall",
        "one",
        "might",
        "take",
        "consideration",
        "corresponding",
        "development",
        "nonclassical",
        "mereologies",
        "indicate",
        "may",
        "reason",
        "assume",
        "useful",
        "core",
        "mereology",
        "function",
        "common",
        "basis",
        "plausible",
        "metaphysical",
        "theory",
        "donnelly"
    ]
}