{
    "main_text": "The Visible and the Invisible\n6. The Visible and the Invisible\n\nThe manuscript and working notes published posthumously as The\nVisible and the Invisible (1964 V&I), extracted from a larger\nwork underway at the time of Merleau-Ponty’s death, is\nconsidered by many to be the best presentation of his later ontology.\nThe main text, drafted in 1959 and 1960, is contemporaneous with\n“Eye and Mind” and the Preface to Signs,\nMerleau-Ponty’s final collection of essays. The first three\nchapters progressively develop an account of “philosophical\ninterrogation” in critical dialogue with scientism, the\nphilosophies of reflection (Descartes and Kant), Sartrean negation,\nand the intuitionisms of Bergson and Husserl. These are followed by a\nstand-alone chapter, “The Intertwining—The Chiasm”,\npresenting Merleau-Ponty’s ontology of flesh. The published\nvolume also includes a brief abandoned section of the text as an\nappendix and more than a hundred pages of selected working notes\ncomposed between 1959 and\n 1961.[8]\n\nMerleau-Ponty frames the investigation with a description of\n“perceptual faith”, our shared pre-reflective conviction\nthat perception presents us with the world as it actually is, even\nthough this perception is mediated, for each of us, by our bodily\nsenses. This apparent paradox creates no difficulties in our everyday\nlives, but it becomes incomprehensible when thematized by\nreflection:\n\n\nThe “natural” man holds on to both ends of the chain,\nthinks at the same time that his perception enters into the\nthings and that it is formed this side of his body. Yet coexist as the\ntwo convictions do without difficulty in the exercise of life, once\nreduced to theses and to propositions they destroy one another and\nleave us in confusion. (V&I: 23–24/8)\n\n\nFor Merleau-Ponty, this “unjustifiable certitude of a sensible\nworld” is the starting point for developing an alternative\naccount of perception, the world, intersubjective relations, and\nultimately being as such. Neither the natural sciences nor psychology\nprovide an adequate clarification of this perceptual faith, since they\nrely on it without acknowledgment even as their theoretical\nconstructions rule out its possibility. Philosophies of reflection,\nexemplified by Descartes and Kant, also fail in their account of\nperception, since they reduce the perceived world to an idea, equate\nthe subject with thought, and undermine any understanding of\nintersubjectivity or a world shared in common (V&I: 62/39,\n67/43).\n\nSartre’s dialectic of being (in-itself) and nothingness\n(for-itself) makes progress over philosophies of reflection insofar as\nit recognizes the ecceity of the world, with which the subject engages\nnot as one being alongside others but rather as a nothingness, that\nis, as a determinate negation of a concrete situation that can\nco-exist alongside other determinate negations. Even so, for Sartre,\npure nothingness and pure being remain mutually exclusive,\nambivalently identical in their perfect opposition, which brings any\nmovement of their dialectic to a halt. The “philosophy of\nnegation” is therefore shown to be a totalizing or\n“high-altitude” thought that remains abstract, missing the\ntrue opening onto the world made possible by the fact that nothingness\nis “sunken into being” (V&I:\n121–122/88–89). This “bad” dialectic must\ntherefore give way to a “hyperdialectic” that remains\nself-critical about its own tendency to reify into fixed and opposed\ntheses (V&I: 129/94).\n\nThe philosophy of intuition takes two forms: the Wesenschau\nof Husserl, which converts lived experience into ideal essences before\na pure spectator, and Bergsonian intuition, which seeks to coincide\nwith its object by experiencing it from within. Against the first,\nMerleau-Ponty argues that the world’s givenness is more\nprimordial than the ideal essence; the essence is a variant of the\nreal, not its condition of possibility. Essences are not ultimately\ndetachable from the sensible but are its “invisible” or\nits latent structure of differentiation. Against a return to the\nimmediacy of coincidence or a nostalgia for the pre-reflective,\nMerleau-Ponty holds that there is no self-identical presence to\nrejoin; the “immediate” essentially involves distance and\nnon-coincidence. Consequently, truth must be redefined as “a\nprivative non-coinciding, a coinciding from afar, a divergence, and\nsomething like a ‘good error’” (V&I:\n166/124–25).\n\nIn the final chapter, “The Intertwining—The Chiasm”,\nMerleau-Ponty turns directly to the positive project of describing his\nontology of “flesh”. Intertwining [entrelacs]\nhere translates Husserl’s Verflechtung, entanglement or\ninterweaving, like the woof and warp of a fabric. Chiasm has two\nsenses in French and English that are both relevant to\nMerleau-Ponty’s project: a physiological sense that refers to\nanatomical or genetic structures with a crossed arrangement (such as\nthe optic nerves), and a literary sense referring to figures of speech\nthat repeat structures in reverse order (AB:BA). For Merleau-Ponty,\nthe chiasm is a structure of mediation that combines the\nunity-in-difference of its physiological sense with the reversal and\ncircularity of its literary usage (see Toadvine 2012; Saint Aubert\n2005). A paradigmatic example of chiasmic structure is the\nbody’s doubling into sensible and sentient aspects during\nself-touch. Elaborating on Husserl’s descriptions of this\nphenomenon, Merleau-Ponty emphasizes three consequences: First, the\nbody as sensible-sentient is an “exemplar sensible” that\ndemonstrates the kinship or ontological continuity between subject and\nobject among sensible things in general. Second, this relationship is\nreversible, like “obverse and reverse” or “two\nsegments of one sole circular course” (V&I: 182/138). Third,\nthe sentient and sensible never strictly coincide but are always\nseparated by a gap or divergence [écart] that defers\ntheir unity.\n\nChiasm is therefore a crisscrossing or a bi-directional becoming or\nexchange between the body and things that justifies speaking of a\n“flesh” of things, a kinship between the sensing body and\nsensed things that makes their communication possible. Flesh in this\nsense is a “general thing” between the individual and the\nidea that does not correspond to any traditional philosophical\nconcept, but is closest to the notion of an “element” in\nthe classical sense (V&I: 184/139). Merleau-Ponty denies that this\nis a subjective or anthropocentric projection:\n\n\ncarnal being, as a being of depths, of several leaves or several\nfaces, a being in latency, and a presentation of a certain absence, is\na prototype of Being, of which our body, the sensible sentient, is a\nvery remarkable variant, but whose constitutive paradox already lies\nin every visible. (V&I: 179/136)\n\n\nThe generality of flesh embraces an intercorporeity, an anonymous\nsensibility shared out among distinct bodies: just as my two hands\ncommunicate across the lateral synergy of my body, I can touch the\nsensibility of another: “The handshake too is reversible”\n(V&I: 187/142).\n\nSensible flesh—what Merleau-Ponty calls the\n“visible”—is not all there is to flesh, since flesh\nalso “sublimates” itself into an “invisible”\ndimension: the “rarified” or “glorified” flesh\nof ideas. Taking as his example the “little phrase” from\nVinteuil’s sonata (in Swann’s Way), Merleau-Ponty\ndescribes literature, music, and the passions as “the\nexploration of an invisible and the disclosure of a universe of\nideas”, although in such cases these ideas “cannot be\ndetached from the sensible appearance and be erected into a second\npositivity” (V&I: 196/149). Creative language necessarily\ncarries its meaning in a similarly embodied fashion, while the\nsediments of such expression result in language as a system of\nformalized relations. What we treat as “pure ideas” are\nnothing more than a certain divergence and ongoing process of\ndifferentiation, now occurring within language rather than sensible\nthings. Ultimately we find a relation of reversibility within language\nlike that holding within sensibility: just as, in order to see, my\nbody must be part of the visible and capable of being seen, so, by\nspeaking, I make myself one who can be spoken to (allocutary) and one\nwho can be spoken about (delocutary). While all of the possibilities\nof language are already outlined or promised within the sensible\nworld, reciprocally the sensible world itself is unavoidably inscribed\nwith language.\n\nThis final chapter of The Visible and the Invisible\nillustrates chiasmic mediation across a range of relations, including\nsentient and sensed, touch and vision, body and world, self and other,\nfact and essence, perception and language. There is not one chiasm but\nrather various chiasmic structures at different levels. As Renaud\nBarbaras notes,\n\n\nIt is necessary … to picture the universe as intuited by\nMerleau-Ponty as a proliferation of chiasms that integrate themselves\naccording to different levels of generality. (1991, 352/2004, 307)\n\n\nThe ultimate ontological chiasm, that between the sensible and the\nintelligible, is matched by an ultimate epistemological chiasm, that\nof philosophy itself. As Merleau-Ponty writes in a working note from\nNovember 1960,\n\n\nthe idea of chiasm, that is: every relation with being is\nsimultaneously a taking and a being held, the hold is held, it is\ninscribed and inscribed in the same being that it takes hold of.\nStarting from there, elaborate an idea of philosophy… . It is\nthe simultaneous experience of the holding and the held in all orders.\n(V&I: 319/266; see also Saint Aubert 2005: 162–64)\n\n",
    "section_title": "6. The Visible and the Invisible",
    "entry_title": "Maurice Merleau-Ponty",
    "hierarchy_title": "Maurice Merleau-Ponty || The Visible and the Invisible",
    "tokenized_text": [
        "visible",
        "invisible",
        "visible",
        "invisible",
        "manuscript",
        "working",
        "note",
        "published",
        "posthumously",
        "visible",
        "invisible",
        "v",
        "extracted",
        "larger",
        "work",
        "underway",
        "time",
        "merleauponty",
        "death",
        "considered",
        "many",
        "best",
        "presentation",
        "later",
        "ontology",
        "main",
        "text",
        "drafted",
        "contemporaneous",
        "eye",
        "mind",
        "preface",
        "sign",
        "merleauponty",
        "final",
        "collection",
        "essay",
        "first",
        "three",
        "chapter",
        "progressively",
        "develop",
        "account",
        "philosophical",
        "interrogation",
        "critical",
        "dialogue",
        "scientism",
        "philosophy",
        "reflection",
        "descartes",
        "kant",
        "sartrean",
        "negation",
        "intuitionism",
        "bergson",
        "husserl",
        "followed",
        "standalone",
        "chapter",
        "intertwiningthe",
        "chiasm",
        "presenting",
        "merleauponty",
        "ontology",
        "flesh",
        "published",
        "volume",
        "also",
        "includes",
        "brief",
        "abandoned",
        "section",
        "text",
        "appendix",
        "hundred",
        "page",
        "selected",
        "working",
        "note",
        "composed",
        "merleauponty",
        "frame",
        "investigation",
        "description",
        "perceptual",
        "faith",
        "shared",
        "prereflective",
        "conviction",
        "perception",
        "present",
        "u",
        "world",
        "actually",
        "even",
        "though",
        "perception",
        "mediated",
        "u",
        "bodily",
        "sens",
        "apparent",
        "paradox",
        "creates",
        "difficulty",
        "everyday",
        "life",
        "becomes",
        "incomprehensible",
        "thematized",
        "reflection",
        "natural",
        "man",
        "hold",
        "end",
        "chain",
        "think",
        "time",
        "perception",
        "enters",
        "thing",
        "formed",
        "side",
        "body",
        "yet",
        "coexist",
        "two",
        "conviction",
        "without",
        "difficulty",
        "exercise",
        "life",
        "reduced",
        "thesis",
        "proposition",
        "destroy",
        "one",
        "another",
        "leave",
        "u",
        "confusion",
        "v",
        "merleauponty",
        "unjustifiable",
        "certitude",
        "sensible",
        "world",
        "starting",
        "point",
        "developing",
        "alternative",
        "account",
        "perception",
        "world",
        "intersubjective",
        "relation",
        "ultimately",
        "neither",
        "natural",
        "science",
        "psychology",
        "provide",
        "adequate",
        "clarification",
        "perceptual",
        "faith",
        "since",
        "rely",
        "without",
        "acknowledgment",
        "even",
        "theoretical",
        "construction",
        "rule",
        "possibility",
        "philosophy",
        "reflection",
        "exemplified",
        "descartes",
        "kant",
        "also",
        "fail",
        "account",
        "perception",
        "since",
        "reduce",
        "perceived",
        "world",
        "idea",
        "equate",
        "subject",
        "thought",
        "undermine",
        "understanding",
        "intersubjectivity",
        "world",
        "shared",
        "common",
        "v",
        "sartre",
        "dialectic",
        "initself",
        "nothingness",
        "foritself",
        "make",
        "progress",
        "philosophy",
        "reflection",
        "insofar",
        "recognizes",
        "ecceity",
        "world",
        "subject",
        "engages",
        "one",
        "alongside",
        "others",
        "rather",
        "nothingness",
        "determinate",
        "negation",
        "concrete",
        "situation",
        "coexist",
        "alongside",
        "determinate",
        "negation",
        "even",
        "sartre",
        "pure",
        "nothingness",
        "pure",
        "remain",
        "mutually",
        "exclusive",
        "ambivalently",
        "identical",
        "perfect",
        "opposition",
        "brings",
        "movement",
        "dialectic",
        "halt",
        "philosophy",
        "negation",
        "therefore",
        "shown",
        "totalizing",
        "highaltitude",
        "thought",
        "remains",
        "abstract",
        "missing",
        "true",
        "opening",
        "onto",
        "world",
        "made",
        "possible",
        "fact",
        "nothingness",
        "sunken",
        "v",
        "bad",
        "dialectic",
        "must",
        "therefore",
        "give",
        "way",
        "hyperdialectic",
        "remains",
        "selfcritical",
        "tendency",
        "reify",
        "fixed",
        "opposed",
        "thesis",
        "v",
        "philosophy",
        "intuition",
        "take",
        "two",
        "form",
        "wesenschau",
        "husserl",
        "convert",
        "lived",
        "experience",
        "ideal",
        "essence",
        "pure",
        "spectator",
        "bergsonian",
        "intuition",
        "seek",
        "coincide",
        "object",
        "experiencing",
        "within",
        "first",
        "merleauponty",
        "argues",
        "world",
        "givenness",
        "primordial",
        "ideal",
        "essence",
        "essence",
        "variant",
        "real",
        "condition",
        "possibility",
        "essence",
        "ultimately",
        "detachable",
        "sensible",
        "invisible",
        "latent",
        "structure",
        "differentiation",
        "return",
        "immediacy",
        "coincidence",
        "nostalgia",
        "prereflective",
        "merleauponty",
        "hold",
        "selfidentical",
        "presence",
        "rejoin",
        "immediate",
        "essentially",
        "involves",
        "distance",
        "noncoincidence",
        "consequently",
        "truth",
        "must",
        "redefined",
        "privative",
        "noncoinciding",
        "coinciding",
        "afar",
        "divergence",
        "something",
        "like",
        "good",
        "error",
        "v",
        "final",
        "chapter",
        "intertwiningthe",
        "chiasm",
        "merleauponty",
        "turn",
        "directly",
        "positive",
        "project",
        "describing",
        "ontology",
        "flesh",
        "intertwining",
        "entrelacs",
        "translates",
        "husserl",
        "verflechtung",
        "entanglement",
        "interweaving",
        "like",
        "woof",
        "warp",
        "fabric",
        "chiasm",
        "two",
        "sens",
        "french",
        "english",
        "relevant",
        "merleauponty",
        "project",
        "physiological",
        "sense",
        "refers",
        "anatomical",
        "genetic",
        "structure",
        "crossed",
        "arrangement",
        "optic",
        "nerve",
        "literary",
        "sense",
        "referring",
        "figure",
        "speech",
        "repeat",
        "structure",
        "reverse",
        "order",
        "ab",
        "ba",
        "merleauponty",
        "chiasm",
        "structure",
        "mediation",
        "combine",
        "unityindifference",
        "physiological",
        "sense",
        "reversal",
        "circularity",
        "literary",
        "usage",
        "see",
        "toadvine",
        "saint",
        "aubert",
        "paradigmatic",
        "example",
        "chiasmic",
        "structure",
        "body",
        "doubling",
        "sensible",
        "sentient",
        "aspect",
        "selftouch",
        "elaborating",
        "husserl",
        "description",
        "phenomenon",
        "merleauponty",
        "emphasizes",
        "three",
        "consequence",
        "first",
        "body",
        "sensiblesentient",
        "exemplar",
        "sensible",
        "demonstrates",
        "kinship",
        "ontological",
        "continuity",
        "subject",
        "object",
        "among",
        "sensible",
        "thing",
        "general",
        "second",
        "relationship",
        "reversible",
        "like",
        "obverse",
        "reverse",
        "two",
        "segment",
        "one",
        "sole",
        "circular",
        "course",
        "v",
        "third",
        "sentient",
        "sensible",
        "never",
        "strictly",
        "coincide",
        "always",
        "separated",
        "gap",
        "divergence",
        "écart",
        "defers",
        "unity",
        "chiasm",
        "therefore",
        "crisscrossing",
        "bidirectional",
        "becoming",
        "exchange",
        "body",
        "thing",
        "justifies",
        "speaking",
        "flesh",
        "thing",
        "kinship",
        "sensing",
        "body",
        "sensed",
        "thing",
        "make",
        "communication",
        "possible",
        "flesh",
        "sense",
        "general",
        "thing",
        "individual",
        "idea",
        "correspond",
        "traditional",
        "philosophical",
        "concept",
        "closest",
        "notion",
        "element",
        "classical",
        "sense",
        "v",
        "merleauponty",
        "denies",
        "subjective",
        "anthropocentric",
        "projection",
        "carnal",
        "depth",
        "several",
        "leaf",
        "several",
        "face",
        "latency",
        "presentation",
        "certain",
        "absence",
        "prototype",
        "body",
        "sensible",
        "sentient",
        "remarkable",
        "variant",
        "whose",
        "constitutive",
        "paradox",
        "already",
        "lie",
        "every",
        "visible",
        "v",
        "generality",
        "flesh",
        "embrace",
        "intercorporeity",
        "anonymous",
        "sensibility",
        "shared",
        "among",
        "distinct",
        "body",
        "two",
        "hand",
        "communicate",
        "across",
        "lateral",
        "synergy",
        "body",
        "touch",
        "sensibility",
        "another",
        "handshake",
        "reversible",
        "v",
        "sensible",
        "fleshwhat",
        "merleauponty",
        "call",
        "visible",
        "is",
        "flesh",
        "since",
        "flesh",
        "also",
        "sublimate",
        "invisible",
        "dimension",
        "rarified",
        "glorified",
        "flesh",
        "idea",
        "taking",
        "example",
        "little",
        "phrase",
        "vinteuil",
        "sonata",
        "swann",
        "way",
        "merleauponty",
        "describes",
        "literature",
        "music",
        "passion",
        "exploration",
        "invisible",
        "disclosure",
        "universe",
        "idea",
        "although",
        "case",
        "idea",
        "detached",
        "sensible",
        "appearance",
        "erected",
        "second",
        "positivity",
        "v",
        "creative",
        "language",
        "necessarily",
        "carry",
        "meaning",
        "similarly",
        "embodied",
        "fashion",
        "sediment",
        "expression",
        "result",
        "language",
        "system",
        "formalized",
        "relation",
        "treat",
        "pure",
        "idea",
        "nothing",
        "certain",
        "divergence",
        "ongoing",
        "process",
        "differentiation",
        "occurring",
        "within",
        "language",
        "rather",
        "sensible",
        "thing",
        "ultimately",
        "find",
        "relation",
        "reversibility",
        "within",
        "language",
        "like",
        "holding",
        "within",
        "sensibility",
        "order",
        "see",
        "body",
        "must",
        "part",
        "visible",
        "capable",
        "seen",
        "speaking",
        "make",
        "one",
        "spoken",
        "allocutary",
        "one",
        "spoken",
        "delocutary",
        "possibility",
        "language",
        "already",
        "outlined",
        "promised",
        "within",
        "sensible",
        "world",
        "reciprocally",
        "sensible",
        "world",
        "unavoidably",
        "inscribed",
        "language",
        "final",
        "chapter",
        "visible",
        "invisible",
        "illustrates",
        "chiasmic",
        "mediation",
        "across",
        "range",
        "relation",
        "including",
        "sentient",
        "sensed",
        "touch",
        "vision",
        "body",
        "world",
        "self",
        "fact",
        "essence",
        "perception",
        "language",
        "one",
        "chiasm",
        "rather",
        "various",
        "chiasmic",
        "structure",
        "different",
        "level",
        "renaud",
        "barbaras",
        "note",
        "necessary",
        "picture",
        "universe",
        "intuited",
        "merleauponty",
        "proliferation",
        "chiasm",
        "integrate",
        "according",
        "different",
        "level",
        "generality",
        "ultimate",
        "ontological",
        "chiasm",
        "sensible",
        "intelligible",
        "matched",
        "ultimate",
        "epistemological",
        "chiasm",
        "philosophy",
        "merleauponty",
        "writes",
        "working",
        "note",
        "november",
        "idea",
        "chiasm",
        "every",
        "relation",
        "simultaneously",
        "taking",
        "held",
        "hold",
        "held",
        "inscribed",
        "inscribed",
        "take",
        "hold",
        "starting",
        "elaborate",
        "idea",
        "philosophy",
        "simultaneous",
        "experience",
        "holding",
        "held",
        "order",
        "v",
        "see",
        "also",
        "saint",
        "aubert"
    ]
}