{
    "main_text": "Life and Works\n1. Life and Works\n\nMerleau-Ponty was born in Rochefort-sur-Mer, in the province of\nCharente-Maritime, on March 14,\n 1908.[1]\n After the death in 1913 of his father, a colonial artillery captain\nand a knight of the Legion of Honor, he moved with his family to\nParis. He would later describe his childhood as incomparably happy,\nand he remained very close to his mother until her death in 1953.\nMerleau-Ponty pursued secondary studies at the Parisian lycees\nJanson-de-Sailly and Louis-le-Grand, completing his first course in\nphilosophy at Janson-de-Sailly with Gustave Rodrigues in\n1923–24. He won the school’s “Award for Outstanding\nAchievement” in philosophy that year and would later trace his\ncommitment to the vocation of philosophy to this first course. He was\nalso awarded “First Prize in Philosophy” at Louis-le-Grand\nin 1924–25. He attended the École Normale\nSupérieure from 1926 to 1930, where he befriended Simone de\nBeauvoir and Claude\n Lévi-Straus.[2]\n Some evidence suggests that, during these years, Merleau-Ponty\nauthored a novel, Nord. Récit de l’arctique,\nunder the pseudonym Jacques Heller (Alloa 2013b). His professors at\nENS included Léon Brunschvicg and Émile Bréhier,\nthe latter supervising his research on Plotinus for the Diplôme\nd’études supérieures in 1929. Bréhier would\ncontinue to supervise Merleau-Ponty’s research through the\ncompletion of his two doctoral dissertations in 1945. During his\nstudent years, Merleau-Ponty attended Husserl’s 1929 Sorbonne\nlectures and Georges Gurvitch’s 1928–1930 courses on\nGerman philosophy. He received the agrégation in\nphilosophy in 1930, ranking in second place.\n\nAfter a year of mandatory military service, Merleau-Ponty taught at\nthe lycee in Beauvais from 1931 to 1933, pursued a year of research on\nperception funded by a subvention from the Caisse nationale des\nsciences (the precursor of today’s Centre national de la\nrecherche scientifique) in 1933–34, and taught at the lycee in\nChartres in 1934–35. From 1935 to 1940, he was a tutor\n(agégé-répétiteur) at the\nÉcole Normale Supérieure, where his primary duty was to\nprepare students for the agrégation. During this\nperiod, he attended Alexandre Kojève’s lectures on Hegel\nand Aron Gurwitsch’s lectures on Gestalt psychology. His first\npublications also appeared during these years, as a series of review\nessays on Max Scheler’s Ressentiment (1935), Gabriel\nMarcel’s Being and Having (1936), and Sartre’s\nImagination\n (1936).[3]\n In 1938, he completed his thèse\ncomplémentaire, originally titled Conscience et\ncomportement [Consciousness and Behavior] and published\nin 1942 as La structure du comportement [The Structure of\nBehavior, SC]. He was the first outside visitor to the newly\nestablished Husserl Archives in Louvain, Belgium, in April 1939, where\nhe met Eugen Fink and consulted Husserl’s unpublished\nmanuscripts, including Ideen II and later sections of Die\nKrisis.\n\nWith the outbreak of World War Two, Merleau-Ponty served for a year as\nlieutenant in the 5th Infantry Regiment and 59th\nLight Infantry Division, until he was wounded in battle in June 1940,\ndays before the signing of the armistice between France and Germany.\nHe was awarded the Croix de guerre, recognizing bravery in\ncombat. After several months of convalescence, he returned to teaching\nat the Lycée Carnot in Paris, where he remained from 1940 until\n1944. In November 1940, he married Suzanne Jolibois, and their\ndaughter Marianne was born in June 1941. In the winter of\n1940–41, Merleau-Ponty renewed his acquaintance with Jean-Paul\nSartre, whom he had met as a student at the École Normale,\nthrough their involvement in the resistance group Socialisme et\nLiberté. The group published around ten issues of an\nunderground review until the arrest of two members in early 1942 led\nto its dissolution. After the conclusion of the war, in 1945,\nMerleau-Ponty would collaborate with Sartre and Beauvoir to found\nLes Temps Modernes, a journal devoted to\n“littérature engagée”, for which he served\nas political editor until 1952.\n\nAt the end of the 1943–44 school year, Merleau-Ponty completed\nhis main thesis, Phénoménologie de la\nperception [Phenomenology of Perception, PP], and in\n1944–45 he taught at the Lycée Condorcet in Paris,\nreplacing Sartre during the latter’s leave from this position.\nMerleau-Ponty defended his two dissertations in July 1945, fulfilling\nthe requirements for the Docteur ès lettres, which was\nawarded “with distinction”. In October 1945, Les Temps\nModernes published its inaugural issue; Merleau-Ponty was a\nfounding member of the journal’s governing board, managed its\ndaily affairs, and penned many of its editorials that were signed\nsimply “T.M.”, even though he refused to allow his name to\nbe printed on the cover alongside Sartre’s as the review’s\nDirector. That fall, Merleau-Ponty was appointed to the post of\nMaître de conférences in Psychology at the\nUniversity of Lyon, where he was promoted to the rank of Professor in\nthe Chair of Psychology in 1948. From 1947 to 1949, he also taught\nsupplementary courses at the École Normale Supérieure,\nwhere his students included the young Michel Foucault. Student notes\n(taken by Jean Deprun) from Merleau-Ponty’s 1947–48 course\non “The Union of the Soul and the Body in Malebranche, Biran,\nand Bergson”—a course that he taught at both Lyon and\nE.N.S. to prepare students for the agrégation and\nwhich was attended by Foucault—were published in 1968\n(1997b/2001). Merleau-Ponty’s notes for several other courses\ntaught at Lyon—“Freedom, especially in Leibniz,”\n“Hegel’s Aesthetics,” and “Problems of the\nPhilosophy of History,” were published in 2022 (2022a,\n2022b).\n\nIn 1946 and 1947, Merleau-Ponty gave a number of lectures on French\nexistentialism in Belgium and Scandinavia (2022a), and in 1947 he\nparticipated regularly in the Collège philosophique, an\nassociation formed by Jean Wahl to provide an open venue for\nintellectual exchange without the academic formality of the Sorbonne,\nand frequented by many leading Parisian thinkers. Merleau-Ponty\npublished his first book of political philosophy in 1947,\nHumanisme et terreur, essai sur le problème communiste\n[Humanism and Terror: An Essay on the Communist Problem,\n1969, HT], in which he responded to the developing opposition between\nliberal democracies and communism by cautioning a\n“wait-and-see” attitude toward Marxism. A collection of\nessays concerning the arts, philosophy, and politics, Sens et\nnon-sense [Sense and Non-Sense, 1996b/1964], appeared in\n1948. In the fall of 1948, Merleau-Ponty delivered a series of seven\nweekly lectures on French national radio that were subsequently\npublished as Causeries 1948 (2002/2004).\n\nMerleau-Ponty declined an invitation to join the Department of\nPhilosophy at the University of Chicago as a Visiting Professor in\n1948–49, but instead received a leave from Lyon for the year to\npresent a series of lectures in Mexico and New York in early 1949\n(2022b). Later in 1949, Merleau-Ponty was appointed Professor of Child\nPsychology and Pedagogy at the University of Paris 1\nPanthéon-Sorbonne, and in this position lectured widely on\nchild development, psychoanalysis, phenomenology, Gestalt psychology,\nand anthropology. His eight courses from the Sorbonne are known from\ncompiled student notes reviewed by him and published in the\nSorbonne’s Bulletin de psychologie (1988/2010).\nMerleau-Ponty held this position for three years until his election,\nin 1952, to the Chair of Philosophy at the Collège de France,\nthe most prestigious post for a philosopher in France, which he would\nhold until his death in 1961. At forty-four, Merleau-Ponty was the\nyoungest person ever elected to this position, but his appointment was\nnot without controversy. Rather than following the typical procedure\nof ratifying the vote of the General Assembly of Professors, who had\nselected Merleau-Ponty as their lead candidate, the\nAcadémie des sciences morales et politiques made the\nunprecedented decision to remove his name from the list of candidates;\nthe Académie’s decision was subsequently\noverturned by the Minister of Education himself, who allowed the\nfaculty vote in favor of Merleau-Ponty to stand. Merleau-Ponty’s\nJanuary 1953 inaugural lecture at the Collège de France was\npublished under the title Éloge de la Philosophie\n[In Praise of Philosophy, 1953/1963]. Many of his courses\nfrom the Collège de France have subsequently been published,\nbased either on student notes or Merleau-Ponty’s own lecture\nnotes (1964b, 1968/1970, 1995/2003, 1996a/2022, 1998/2002, 2003/2010,\n2011/2020, 2013, 2020).\n\nIn the face of growing political disagreements with Sartre set in\nmotion by the Korean War, Merleau-Ponty resigned his role as political\neditor of Les Temps Modernes in December of 1952 and withdrew\nfrom the editorial board altogether in 1953. His critique of\nSartre’s politics became public in 1955 with Les Aventures\nde la dialectique [Adventures of the Dialectic, 1973\nAdD], in which Merleau-Ponty distanced himself from revolutionary\nMarxism and sharply criticized Sartre for\n“ultrabolshevism”. Beauvoir’s equally biting\nrebuttal, “Merleau-Ponty and Pseudo-Sartreanism”,\npublished the same year in Les Temps Modernes, accuses\nMerleau-Ponty of willfully misrepresenting Sartre’s position,\nopening a rift between the three former friends that would never\nentirely heal. Merleau-Ponty’s intellectual circle during his\nyears at the Collège de France included Lévi-Straus and\nJacques Lacan, and for several years he was a regular contributor to\nthe popular weekly magazine L’Express. In October and\nNovember 1955, on a commission from Alliance\nfrançaise, Merleau-Ponty visited several African\ncountries, including Tunisia, French Equatorial Africa, the Belgian\nCongo, and Kenya, where he delivered a series of lectures on the\nconcept of race, colonialism, and development. In 1956, he published\nLes Philosophes célèbres [Famous\nPhilosophers], a large edited volume of original introductions to\nkey historical and contemporary thinkers (beginning, interestingly,\nwith philosophers from India and China) whose contributors included\nGilles Deleuze, Gilbert Ryle, Alfred Schutz, and Jean Starobinski. In\nApril 1957, Merleau-Ponty declined to accept induction into\nFrance’s Order of the Legion of Honor, presumably in protest\nover the inhumane actions of the Fourth Republic, including the use of\ntorture, during the Battle of Algiers. In October and November of\n1957, as his second commission from Alliance\nfrançaise, he lectured in Madagascar, Reunion Island, and\nMauritius, citing as a primary motivation for accepting the commission\nhis desire to see first-hand the effects of reforms in French policies\ngoverning overseas territories. The last book Merleau-Ponty published\nduring his lifetime, Signes [Signs, 1960/1964],\nappearing in 1960, collecting essays on art, language, the history of\nphilosophy, and politics that spanned more than a decade. His last\npublished essay, “L’Œil et l’esprit”\n[“Eye and Mind”, 1964a OEE] addressing the ontological\nimplications of painting, appeared in the 1961 inaugural issue of\nArt de France. Merleau-Ponty died of a heart attack in Paris\non May 3rd, 1961, at the age of 53, with Descartes’\nOptics open on his desk.\n\nMerleau-Ponty’s friend and former student Claude Lefort\npublished two of his teacher’s unfinished manuscripts\nposthumously: La prose du monde [The Prose of the\nWorld, 1969/1973], an exploration of literature and expression\ndrafted in 1950–51 and apparently abandoned; and Le visible\net l’invisible [The Visible and the Invisible,\n1968 V&I], a manuscript and numerous working notes from\n1959–1961 that present elements of Merleau-Ponty’s mature\nontology. The latter manuscript was apparently part of a larger\nproject, Être et Monde [Being and World], for\nwhich two additional unpublished sections were substantially drafted\nin 1957–1958: La Nature ou le monde du silence\n[Nature or the World of Silence] and Introduction\nà l’ontologie [Introduction to Ontology]\n(Saint Aubert 2013:\n 28).[4]\n These manuscripts, along with many of Merleau-Ponty’s other\nunpublished notes and papers, were donated to the Bibliothèque\nNationale de France by Suzanne Merleau-Ponty in 1992 and are available\nfor consultation by\n scholars.[5]\n Several volumes of previously unpublished lectures, working notes,\ninterview transcriptions, letters, and other archival materials have\nalso been published posthumously (2016, 2018, 2022a, 2022b,\n2022c).\n",
    "section_title": "1. Life and Works",
    "entry_title": "Maurice Merleau-Ponty",
    "hierarchy_title": "Maurice Merleau-Ponty || Life and Works",
    "tokenized_text": [
        "life",
        "work",
        "life",
        "work",
        "merleauponty",
        "born",
        "rochefortsurmer",
        "province",
        "charentemaritime",
        "march",
        "death",
        "father",
        "colonial",
        "artillery",
        "captain",
        "knight",
        "legion",
        "honor",
        "moved",
        "family",
        "paris",
        "would",
        "later",
        "describe",
        "childhood",
        "incomparably",
        "happy",
        "remained",
        "close",
        "mother",
        "death",
        "merleauponty",
        "pursued",
        "secondary",
        "study",
        "parisian",
        "lycee",
        "jansondesailly",
        "louislegrand",
        "completing",
        "first",
        "course",
        "philosophy",
        "jansondesailly",
        "gustave",
        "rodrigues",
        "school",
        "award",
        "outstanding",
        "achievement",
        "philosophy",
        "year",
        "would",
        "later",
        "trace",
        "commitment",
        "vocation",
        "philosophy",
        "first",
        "course",
        "also",
        "awarded",
        "first",
        "prize",
        "philosophy",
        "louislegrand",
        "attended",
        "école",
        "normale",
        "supérieure",
        "befriended",
        "simone",
        "de",
        "beauvoir",
        "claude",
        "lévistraus",
        "evidence",
        "suggests",
        "year",
        "merleauponty",
        "authored",
        "novel",
        "nord",
        "récit",
        "de",
        "l",
        "arctique",
        "pseudonym",
        "jacques",
        "heller",
        "alloa",
        "b",
        "professor",
        "en",
        "included",
        "léon",
        "brunschvicg",
        "émile",
        "bréhier",
        "latter",
        "supervising",
        "research",
        "plotinus",
        "diplôme",
        "études",
        "supérieures",
        "bréhier",
        "would",
        "continue",
        "supervise",
        "merleauponty",
        "research",
        "completion",
        "two",
        "doctoral",
        "dissertation",
        "student",
        "year",
        "merleauponty",
        "attended",
        "husserl",
        "sorbonne",
        "lecture",
        "george",
        "gurvitch",
        "course",
        "german",
        "philosophy",
        "received",
        "agrégation",
        "philosophy",
        "ranking",
        "second",
        "place",
        "year",
        "mandatory",
        "military",
        "service",
        "merleauponty",
        "taught",
        "lycee",
        "beauvais",
        "pursued",
        "year",
        "research",
        "perception",
        "funded",
        "subvention",
        "caisse",
        "nationale",
        "de",
        "science",
        "precursor",
        "today",
        "centre",
        "national",
        "de",
        "la",
        "recherche",
        "scientifique",
        "taught",
        "lycee",
        "chartres",
        "tutor",
        "agégérépétiteur",
        "école",
        "normale",
        "supérieure",
        "primary",
        "duty",
        "prepare",
        "student",
        "agrégation",
        "period",
        "attended",
        "alexandre",
        "kojève",
        "lecture",
        "hegel",
        "aron",
        "gurwitsch",
        "lecture",
        "gestalt",
        "psychology",
        "first",
        "publication",
        "also",
        "appeared",
        "year",
        "series",
        "review",
        "essay",
        "max",
        "scheler",
        "ressentiment",
        "gabriel",
        "marcel",
        "sartre",
        "imagination",
        "completed",
        "thèse",
        "complémentaire",
        "originally",
        "titled",
        "conscience",
        "et",
        "comportement",
        "consciousness",
        "behavior",
        "published",
        "la",
        "structure",
        "du",
        "comportement",
        "structure",
        "behavior",
        "sc",
        "first",
        "outside",
        "visitor",
        "newly",
        "established",
        "husserl",
        "archive",
        "louvain",
        "belgium",
        "april",
        "met",
        "eugen",
        "fink",
        "consulted",
        "husserl",
        "unpublished",
        "manuscript",
        "including",
        "ideen",
        "ii",
        "later",
        "section",
        "die",
        "krisis",
        "outbreak",
        "world",
        "war",
        "two",
        "merleauponty",
        "served",
        "year",
        "lieutenant",
        "th",
        "infantry",
        "regiment",
        "th",
        "light",
        "infantry",
        "division",
        "wounded",
        "battle",
        "june",
        "day",
        "signing",
        "armistice",
        "france",
        "germany",
        "awarded",
        "croix",
        "de",
        "guerre",
        "recognizing",
        "bravery",
        "combat",
        "several",
        "month",
        "convalescence",
        "returned",
        "teaching",
        "lycée",
        "carnot",
        "paris",
        "remained",
        "november",
        "married",
        "suzanne",
        "jolibois",
        "daughter",
        "marianne",
        "born",
        "june",
        "winter",
        "merleauponty",
        "renewed",
        "acquaintance",
        "jeanpaul",
        "sartre",
        "met",
        "student",
        "école",
        "normale",
        "involvement",
        "resistance",
        "group",
        "socialisme",
        "et",
        "liberté",
        "group",
        "published",
        "around",
        "ten",
        "issue",
        "underground",
        "review",
        "arrest",
        "two",
        "member",
        "early",
        "led",
        "dissolution",
        "conclusion",
        "war",
        "merleauponty",
        "would",
        "collaborate",
        "sartre",
        "beauvoir",
        "found",
        "le",
        "temp",
        "modernes",
        "journal",
        "devoted",
        "littérature",
        "engagée",
        "served",
        "political",
        "editor",
        "end",
        "school",
        "year",
        "merleauponty",
        "completed",
        "main",
        "thesis",
        "phénoménologie",
        "de",
        "la",
        "perception",
        "phenomenology",
        "perception",
        "pp",
        "taught",
        "lycée",
        "condorcet",
        "paris",
        "replacing",
        "sartre",
        "latter",
        "leave",
        "position",
        "merleauponty",
        "defended",
        "two",
        "dissertation",
        "july",
        "fulfilling",
        "requirement",
        "docteur",
        "ès",
        "lettres",
        "awarded",
        "distinction",
        "october",
        "le",
        "temp",
        "modernes",
        "published",
        "inaugural",
        "issue",
        "merleauponty",
        "founding",
        "member",
        "journal",
        "governing",
        "board",
        "managed",
        "daily",
        "affair",
        "penned",
        "many",
        "editorial",
        "signed",
        "simply",
        "tm",
        "even",
        "though",
        "refused",
        "allow",
        "name",
        "printed",
        "cover",
        "alongside",
        "sartre",
        "review",
        "director",
        "fall",
        "merleauponty",
        "appointed",
        "post",
        "maître",
        "de",
        "conférences",
        "psychology",
        "university",
        "lyon",
        "promoted",
        "rank",
        "professor",
        "chair",
        "psychology",
        "also",
        "taught",
        "supplementary",
        "course",
        "école",
        "normale",
        "supérieure",
        "student",
        "included",
        "young",
        "michel",
        "foucault",
        "student",
        "note",
        "taken",
        "jean",
        "deprun",
        "merleauponty",
        "course",
        "union",
        "soul",
        "body",
        "malebranche",
        "biran",
        "bergson",
        "a",
        "course",
        "taught",
        "lyon",
        "ens",
        "prepare",
        "student",
        "agrégation",
        "attended",
        "foucaultwere",
        "published",
        "b",
        "merleauponty",
        "note",
        "several",
        "course",
        "taught",
        "lyon",
        "freedom",
        "especially",
        "leibniz",
        "hegel",
        "aesthetic",
        "problem",
        "philosophy",
        "history",
        "published",
        "a",
        "b",
        "merleauponty",
        "gave",
        "number",
        "lecture",
        "french",
        "existentialism",
        "belgium",
        "scandinavia",
        "a",
        "participated",
        "regularly",
        "collège",
        "philosophique",
        "association",
        "formed",
        "jean",
        "wahl",
        "provide",
        "open",
        "venue",
        "intellectual",
        "exchange",
        "without",
        "academic",
        "formality",
        "sorbonne",
        "frequented",
        "many",
        "leading",
        "parisian",
        "thinker",
        "merleauponty",
        "published",
        "first",
        "book",
        "political",
        "philosophy",
        "humanisme",
        "et",
        "terreur",
        "essai",
        "sur",
        "le",
        "problème",
        "communiste",
        "humanism",
        "terror",
        "essay",
        "communist",
        "problem",
        "ht",
        "responded",
        "developing",
        "opposition",
        "liberal",
        "democracy",
        "communism",
        "cautioning",
        "waitandsee",
        "attitude",
        "toward",
        "marxism",
        "collection",
        "essay",
        "concerning",
        "art",
        "philosophy",
        "politics",
        "sen",
        "et",
        "nonsense",
        "sense",
        "nonsense",
        "b",
        "appeared",
        "fall",
        "merleauponty",
        "delivered",
        "series",
        "seven",
        "weekly",
        "lecture",
        "french",
        "national",
        "radio",
        "subsequently",
        "published",
        "causerie",
        "merleauponty",
        "declined",
        "invitation",
        "join",
        "department",
        "philosophy",
        "university",
        "chicago",
        "visiting",
        "professor",
        "instead",
        "received",
        "leave",
        "lyon",
        "year",
        "present",
        "series",
        "lecture",
        "mexico",
        "new",
        "york",
        "early",
        "b",
        "later",
        "merleauponty",
        "appointed",
        "professor",
        "child",
        "psychology",
        "pedagogy",
        "university",
        "paris",
        "panthéonsorbonne",
        "position",
        "lectured",
        "widely",
        "child",
        "development",
        "psychoanalysis",
        "phenomenology",
        "gestalt",
        "psychology",
        "anthropology",
        "eight",
        "course",
        "sorbonne",
        "known",
        "compiled",
        "student",
        "note",
        "reviewed",
        "published",
        "sorbonne",
        "bulletin",
        "de",
        "psychologie",
        "merleauponty",
        "held",
        "position",
        "three",
        "year",
        "election",
        "chair",
        "philosophy",
        "collège",
        "de",
        "france",
        "prestigious",
        "post",
        "philosopher",
        "france",
        "would",
        "hold",
        "death",
        "fortyfour",
        "merleauponty",
        "youngest",
        "person",
        "ever",
        "elected",
        "position",
        "appointment",
        "without",
        "controversy",
        "rather",
        "following",
        "typical",
        "procedure",
        "ratifying",
        "vote",
        "general",
        "assembly",
        "professor",
        "selected",
        "merleauponty",
        "lead",
        "candidate",
        "académie",
        "de",
        "science",
        "morale",
        "et",
        "politiques",
        "made",
        "unprecedented",
        "decision",
        "remove",
        "name",
        "list",
        "candidate",
        "académie",
        "decision",
        "subsequently",
        "overturned",
        "minister",
        "education",
        "allowed",
        "faculty",
        "vote",
        "favor",
        "merleauponty",
        "stand",
        "merleauponty",
        "january",
        "inaugural",
        "lecture",
        "collège",
        "de",
        "france",
        "published",
        "title",
        "éloge",
        "de",
        "la",
        "philosophie",
        "praise",
        "philosophy",
        "many",
        "course",
        "collège",
        "de",
        "france",
        "subsequently",
        "published",
        "based",
        "either",
        "student",
        "note",
        "merleauponty",
        "lecture",
        "note",
        "b",
        "a",
        "face",
        "growing",
        "political",
        "disagreement",
        "sartre",
        "set",
        "motion",
        "korean",
        "war",
        "merleauponty",
        "resigned",
        "role",
        "political",
        "editor",
        "le",
        "temp",
        "modernes",
        "december",
        "withdrew",
        "editorial",
        "board",
        "altogether",
        "critique",
        "sartre",
        "politics",
        "became",
        "public",
        "le",
        "aventures",
        "de",
        "la",
        "dialectique",
        "adventure",
        "dialectic",
        "add",
        "merleauponty",
        "distanced",
        "revolutionary",
        "marxism",
        "sharply",
        "criticized",
        "sartre",
        "ultrabolshevism",
        "beauvoir",
        "equally",
        "biting",
        "rebuttal",
        "merleauponty",
        "pseudosartreanism",
        "published",
        "year",
        "le",
        "temp",
        "modernes",
        "accuses",
        "merleauponty",
        "willfully",
        "misrepresenting",
        "sartre",
        "position",
        "opening",
        "rift",
        "three",
        "former",
        "friend",
        "would",
        "never",
        "entirely",
        "heal",
        "merleauponty",
        "intellectual",
        "circle",
        "year",
        "collège",
        "de",
        "france",
        "included",
        "lévistraus",
        "jacques",
        "lacan",
        "several",
        "year",
        "regular",
        "contributor",
        "popular",
        "weekly",
        "magazine",
        "l",
        "express",
        "october",
        "november",
        "commission",
        "alliance",
        "française",
        "merleauponty",
        "visited",
        "several",
        "african",
        "country",
        "including",
        "tunisia",
        "french",
        "equatorial",
        "africa",
        "belgian",
        "congo",
        "kenya",
        "delivered",
        "series",
        "lecture",
        "concept",
        "race",
        "colonialism",
        "development",
        "published",
        "le",
        "philosophes",
        "célèbres",
        "famous",
        "philosopher",
        "large",
        "edited",
        "volume",
        "original",
        "introduction",
        "key",
        "historical",
        "contemporary",
        "thinker",
        "beginning",
        "interestingly",
        "philosopher",
        "india",
        "china",
        "whose",
        "contributor",
        "included",
        "gilles",
        "deleuze",
        "gilbert",
        "ryle",
        "alfred",
        "schutz",
        "jean",
        "starobinski",
        "april",
        "merleauponty",
        "declined",
        "accept",
        "induction",
        "france",
        "order",
        "legion",
        "honor",
        "presumably",
        "protest",
        "inhumane",
        "action",
        "fourth",
        "republic",
        "including",
        "use",
        "torture",
        "battle",
        "algiers",
        "october",
        "november",
        "second",
        "commission",
        "alliance",
        "française",
        "lectured",
        "madagascar",
        "reunion",
        "island",
        "mauritius",
        "citing",
        "primary",
        "motivation",
        "accepting",
        "commission",
        "desire",
        "see",
        "firsthand",
        "effect",
        "reform",
        "french",
        "policy",
        "governing",
        "overseas",
        "territory",
        "last",
        "book",
        "merleauponty",
        "published",
        "lifetime",
        "signes",
        "sign",
        "appearing",
        "collecting",
        "essay",
        "art",
        "language",
        "history",
        "philosophy",
        "politics",
        "spanned",
        "decade",
        "last",
        "published",
        "essay",
        "l",
        "œil",
        "et",
        "l",
        "esprit",
        "eye",
        "mind",
        "a",
        "oee",
        "addressing",
        "ontological",
        "implication",
        "painting",
        "appeared",
        "inaugural",
        "issue",
        "art",
        "de",
        "france",
        "merleauponty",
        "died",
        "heart",
        "attack",
        "paris",
        "may",
        "rd",
        "age",
        "descartes",
        "optic",
        "open",
        "desk",
        "merleauponty",
        "friend",
        "former",
        "student",
        "claude",
        "lefort",
        "published",
        "two",
        "teacher",
        "unfinished",
        "manuscript",
        "posthumously",
        "la",
        "prose",
        "du",
        "monde",
        "prose",
        "world",
        "exploration",
        "literature",
        "expression",
        "drafted",
        "apparently",
        "abandoned",
        "le",
        "visible",
        "et",
        "l",
        "invisible",
        "visible",
        "invisible",
        "v",
        "manuscript",
        "numerous",
        "working",
        "note",
        "present",
        "element",
        "merleauponty",
        "mature",
        "ontology",
        "latter",
        "manuscript",
        "apparently",
        "part",
        "larger",
        "project",
        "être",
        "et",
        "monde",
        "world",
        "two",
        "additional",
        "unpublished",
        "section",
        "substantially",
        "drafted",
        "la",
        "nature",
        "ou",
        "le",
        "monde",
        "du",
        "silence",
        "nature",
        "world",
        "silence",
        "introduction",
        "à",
        "l",
        "ontologie",
        "introduction",
        "ontology",
        "saint",
        "aubert",
        "manuscript",
        "along",
        "many",
        "merleauponty",
        "unpublished",
        "note",
        "paper",
        "donated",
        "bibliothèque",
        "nationale",
        "de",
        "france",
        "suzanne",
        "merleauponty",
        "available",
        "consultation",
        "scholar",
        "several",
        "volume",
        "previously",
        "unpublished",
        "lecture",
        "working",
        "note",
        "interview",
        "transcription",
        "letter",
        "archival",
        "material",
        "also",
        "published",
        "posthumously",
        "a",
        "b",
        "c"
    ]
}