{
    "main_text": "Life and Works\n1. Life and Works\n\nMarin Mersenne was born on 8 September 1588 near Oizé in the\nFrench region of Haut-Maine (nowadays the Sarthe). He came from a\nfamily of merchants and small landowners. After studying at the\ncollege du Mans, he was sent in 1604 to the newly created Jesuit\ncollege of La Flèche, where he received the established Jesuit\neducation, coupling humanist—Ciceronian—and Aristotelian\ntraditions (Dear 1988). He may have met there the young René\nDescartes, who entered La Flèche in 1606, although it is\nunlikely that their friendship started then, as Descartes was 8 years\nhis junior. When he left the college, Mersenne completed his training\nin theology, Greek and Hebrew in Paris at the Collège Royal and\nat the Sorbonne where he was instructed by the Thomist theologians\nFrançois Ysambert and Philippe de Gamache (see Coste 1648;\nArmogathe 1994). Attracted to the strict rule of the Minims, a\nFranciscan order recently introduced into France, he took the habits\nin 1611, and after periods of novitiate and teaching in Meaux, Paris\nand Never, was recalled to Paris in 1619 at the new house on the Place\nRoyale (the present Place des Vosges) where he remained permanently,\napart from a few trips to the French provinces, to the Netherlands in\n1630, and to Italy from 1644 to 1645.\n\nFrom the years 1620 onward, Mersenne deployed overflowing intellectual\nactivity. Through the mediation of Claude Fabbri de Pereisc whom he\nhad met in 1616, he was introduced to the Parisian intellectual elite,\nand later to Pierre Gassendi with whom he remained close friends. In\nParis, he associated with the mathematician Claude Mydorge, and,\nperhaps through him, renewed acquaintance with Descartes. Mersenne\ncalled on Descartes’s mathematical expertise on questions of\noptics. His questions led Descartes to his first formulation of the\nlaw of refraction, which he was to publish later in his 1637\n“Dioptrics”. Mersenne was among those attending the famous\nmeeting of 1628, at the residence of the apostolic nuncio, where\nDescartes, having revealed his project of founding the sciences on a\nnew method, had been encouraged to do so by the highest religious\nauthorities. After Descartes left for Holland, Mersenne remained in\nclose contact with him through correspondence. He was privy to most of\nDescartes’s secret addresses, which made him the man one has to\nsee in order to get access to the French exile, to send him letters or\nquestions. Only four letters from Mersenne to Descartes are extant,\nbut 146 letters from Descartes—about a quarter of his known\ncorrespondence—testify to the intensity and continuity of the\nexchange. Mersenne endlessly provided Descartes with books, fresh\ninformation, and editorial services, requesting in exchange answers to\nqueries of all sorts. Acting as mediator in Descartes’s\ncontroversies, with Fermat, Roberval, Beaugrand, Morin, or\nVoëtius, he sometimes caused quarrels himself, through his\nindiscretions, such as the one which made Descartes definitively fall\nout with his erstwhile mentor Isaac Beeckman. Mersenne also acted as\nintermediary for the edition of the Meditationes de prima\nphilosophiae, and was instrumental in the gathering of the six\nsets of objections that were added to the text with Descartes’s\nresponses, including those of Hobbes and Gassendi. He contributed\nhimself to the objectiones, penning the second set (“gathered by\nthe R. P. Mersenne from the mouth of various theologians and\nphilosophers”, AT IX-1: 96; Buccolini 2019) and perhaps parts of\nthe sixth.\n\nMersenne’s dealings with Descartes were only a small part of the\nnetwork of intellectual communication that he built up throughout his\ncareer. He was largely responsible for introducing Galileo into\nFrance, offering in 1630—without receiving an answer—to\npublish his future work on the Two Chief Systems of the\nWorld. In 1634, he published Les Méchaniques de\nGalilée, a free translation of a manuscript on mechanics\nby the Florentine scholar, completed with ideas borrowed from\nGuidobaldo and Stevin, and with original comments of his own, and, in\n1639, the Nouvelles pensées de Galilée, a\ntranslation or adaptation of certain parts of the Discorsi a due\nnuove scienze, published in Italy one year earlier. Mersenne was\nalso in regular contact with English scholars. He translated into\nFrench the De Veritate of Herbert of Cherbury (although the\nbook had been placed in the Index, i.e., the list of prohibited books\npublished by the Catholic Church); in good terms with Hobbes (Baldin\n2020), he published one of his optical treatises, and\nSorbière’s French translation of the De Cive. He\ncorresponded with Kenelm Digby and Lord Cavendish and others.\n\nIn Paris, a small scientific circle of mathematicians and physicists\ngradually formed around Mersenne. From 1633 or so, meetings were\norganized on Thursdays at the houses of one or another of his friends\nor protectors. This “Academia Parisiensis”, as it came to\nbe called, brought together men such as Étienne Pascal,\nMydorge, Hardy, Roberval, Fermat. It was later to welcome the young\nBlaise Pascal, and Jacques Le Pailleur who was to become the\ngroup’s leader when Mersenne died in 1648. Discussions were\nmostly “mathematical” (MC V: 209). Mersenne used to submit\nproblems of his own invention to his friends, and some were often\nremarkably stimulating and the origin of important discoveries such as\nthe “roulette” problem, solved by Roberval in 1634; and\nthen more indirectly by Fermat and Descartes. Mersenne himself\nundertook to establish a first list of what will eventually be called\nthe “Mersenne primes”, prime numbers that can be written\nin the form 2n − 1 (for some integer n),\nwhose properties and determination are still topical questions in\ncontemporary mathematics. Mersenne envisaged his meeting group, and\nhis own net of correspondents, as the prototype for a larger\ninstitution that would bring scholars together in a pacified Europe,\nforeshadowing the foundation of the later Académie des sciences\nin 1666, or the Royal Society in England (MC V: 301–302, and\nGoldstein 2013)\n\nIn 1623 and 1625, Mersenne published three massive philosophical\nworks. The Questiones celeberrimae in Genesim (which covers\nalmost 1900 folio columns), a commentary on the six first chapters of\nthe book of Genesis, larded with long scientific and philosophical\ndigressions, was intended as an apology of Christian religion against\nall forms of “atheism”. It contains attacks on various\nPlatonist, cabbalistic and hermetic authors such as Bernardino\nTelesio, Pietro Pomponazzi, Giordano Bruno, Jacques Gaffarel, or the\nEnglish hermetic author, Robert Fludd. The tone is virulent, sometimes\noffensive, and the book attracted several outraged answers. Fludd in\nparticular reacted in his Sophia cum moria certamen (1629)\nwhich itself drew a long reply from Gassendi, writing upon\nMersenne’s request (Gassendi 1630). The same inspiration governs\nL’Impiété des Déistes, published\nin French the next year. It is a point-by-point refutation of the 106\nQuatrains du Déiste or Anti-Bigot, a long\nanonymous poem denouncing Christian revelation, bigoted superstition\nand belief in a personal God. Mersenne’s response, written as a\ndialogue between a deist and a theologian, leads to the conversion of\nthe deist, to whom the existence, justice and mercy of the Christian\nGod are demonstrated. Dedicated to Richelieu, and perhaps written on\ncommand, the book may be seen as taking part in a larger campaign\norchestrated by the French state and the catholic church, at a time\nthat witnessed Vanini’s execution in Toulouse, the trial of\nTheophile de Viau, and a strengthening of repressive measures against\nanti-Aristotelian philosophical novelties. La Vérité\ndes sciences (1625) is a dialogue between an alchemist, a skeptic\nand a Christian philosopher, the latter opposing both the\nover-confidence of the first and the excessive doubts of the second.\nThe second, third and fourth parts of the book, dealing with\narithmetic and geometry, is an 800-page compilation of ancient and\nrecent achievements in the mathematical sciences, intended to show\nthat there are regions of human knowledge immune from doubt, and which\ndo not contradict Christian wisdom.\n\nBy the end of the 1620s, Mersenne’s former animosity towards the\nanti-aristotelians authors withered, giving way to a more lenient if\nnot tolerant approach. Galileo whom he had listed among the dangerous\nones in 1623 is now the object of great praise. Mersenne seemed much\nless concerned with the proliferation of atheists and heretics, and he\nexpressed regrets about the offensive tone of his previous works\n(Letter to Rivet 12 nov. 1639, MC X: 599). His travel to Holland in\n1630 put him in contact with Protestant scholars, such as André\nRivet and the Socinian Ruarus, who became regular correspondents.\nMersenne who used to vilify the heretics, was now taken to task for\nhis sympathies with the enemy, and he was sometimes dubbed the\n“Huguenot monk”. In any case the staunch defense of\northodoxy of the first works is nowhere to be found in\nMersenne’s next publications, which, from 1634 onward, are\nalmost entirely devoted to the promotion of the mathematical sciences,\nbroadly conceived. It has been a question among biographers and\ncommentators whether these changes reflect a conversion to a new\nagenda or a new philosophical outlook. Robert Lenoble (1943: 38)\nconsiders that until 1634, Mersenne was still looking for a better\nphilosophy of nature and held provisionally to Aristotelianism,\n“whereas at that date he discovered what he had sought for many\nyears, namely Mechanism”. Sylvie Taussig (2009b) considers that\nMersenne went through a serious crisis, both moral and intellectual,\nat the end of the 1620s, and that under the influence of Peiresc and\nGassendi he came to adopt a more skeptical outlook on philosophical\nand religious matters. Without denying Mersenne’s change of tone\nand accent, Garber (2004) and Dear (1988) tend to underplay the extent\nand meaning of Mersenne’s “conversion” to the new\nphilosophy, considering that his agenda of promoting mixed mathematics\nwas to him still compatible with a traditional philosophical\noutlook—“the learning of the schools”, that Dear\ndescribed as conjoining Christianized Aristotelianism, Renaissance\nhumanism and a skeptical or probabilistic approach to philosophical\nmatters. We shall come back to these issues in due course.\n\nThe five treatises published in a row in 1634 are representative of\nthe kind of intellectual productions Mersenne would henceforth offer.\nTwo of them (Questions inouyes, and Questions\nthéologiques…) are eclectic lists of\n“curious” questions, intended for entertainment\n(récréation) as well as for instruction of the\nlearned: can one walk on water without miracle? How many grain of\nsands can be contained in the sphere of the earth ? From where does\nthe satisfaction come when one believes one has found a new\ndemonstration or truth? In these questions metaphysical, apologetic\nand even theological considerations are (in spite of the title of the\nsecond treatise) barely present. The Questions harmoniques\nand the Préludes to the harmonie universelle prepare\nthe way for the publication of Mersenne’s great achievement on\nmusical theory, The Harmonie Universelle (1636–7),\nwhere he offers what is still considered a major contribution to the\nscientific understanding of “consonance” and acoustics.\nFinally the Mechaniques de Galilée illustrate\nMersenne’s constant interest in physico-mathematical questions\nof Galilean type, that is Archimedean mechanics stricto sensu, dealing\nwith basic machines, such as the lever, the wheel, the pulley, but\nalso the sciences of motion, free fall, ballistics, pneumatics,\nhydrostatics, and optics. Mersenne pursued these interests in the\n1640s, when he started to make his own campaigns of experiments in\norder to verify Galilean numerical data on free fall and on the\nvelocity of a cannon ball, especially during his journey to Italy\n(1644–1645) where he met Torricelli. These researches resulted\nin the publication of his Cogitate physico-mathematica (1644)\nand his Novarum observum physico-matheaticarum (1647), which\nincludes in its first part a treatise by Roberval on the system of the\nworld. A book on optics was to be published after Mersenne’s\ndeath (L’Optique et la catoptrique, 1651).\n",
    "section_title": "1. Life and Works",
    "entry_title": "Marin Mersenne",
    "hierarchy_title": "Marin Mersenne || Life and Works",
    "tokenized_text": [
        "life",
        "work",
        "life",
        "work",
        "marin",
        "mersenne",
        "born",
        "september",
        "near",
        "oizé",
        "french",
        "region",
        "hautmaine",
        "nowadays",
        "sarthe",
        "came",
        "family",
        "merchant",
        "small",
        "landowner",
        "studying",
        "college",
        "du",
        "man",
        "sent",
        "newly",
        "created",
        "jesuit",
        "college",
        "la",
        "flèche",
        "received",
        "established",
        "jesuit",
        "education",
        "coupling",
        "humanistciceronianand",
        "aristotelian",
        "tradition",
        "dear",
        "may",
        "met",
        "young",
        "rené",
        "descartes",
        "entered",
        "la",
        "flèche",
        "although",
        "unlikely",
        "friendship",
        "started",
        "descartes",
        "year",
        "junior",
        "left",
        "college",
        "mersenne",
        "completed",
        "training",
        "theology",
        "greek",
        "hebrew",
        "paris",
        "collège",
        "royal",
        "sorbonne",
        "instructed",
        "thomist",
        "theologian",
        "françois",
        "ysambert",
        "philippe",
        "de",
        "gamache",
        "see",
        "coste",
        "armogathe",
        "attracted",
        "strict",
        "rule",
        "minim",
        "franciscan",
        "order",
        "recently",
        "introduced",
        "france",
        "took",
        "habit",
        "period",
        "novitiate",
        "teaching",
        "meaux",
        "paris",
        "never",
        "recalled",
        "paris",
        "new",
        "house",
        "place",
        "royale",
        "present",
        "place",
        "de",
        "vosges",
        "remained",
        "permanently",
        "apart",
        "trip",
        "french",
        "province",
        "netherlands",
        "italy",
        "year",
        "onward",
        "mersenne",
        "deployed",
        "overflowing",
        "intellectual",
        "activity",
        "mediation",
        "claude",
        "fabbri",
        "de",
        "pereisc",
        "met",
        "introduced",
        "parisian",
        "intellectual",
        "elite",
        "later",
        "pierre",
        "gassendi",
        "remained",
        "close",
        "friend",
        "paris",
        "associated",
        "mathematician",
        "claude",
        "mydorge",
        "perhaps",
        "renewed",
        "acquaintance",
        "descartes",
        "mersenne",
        "called",
        "descartes",
        "mathematical",
        "expertise",
        "question",
        "optic",
        "question",
        "led",
        "descartes",
        "first",
        "formulation",
        "law",
        "refraction",
        "publish",
        "later",
        "dioptrics",
        "mersenne",
        "among",
        "attending",
        "famous",
        "meeting",
        "residence",
        "apostolic",
        "nuncio",
        "descartes",
        "revealed",
        "project",
        "founding",
        "science",
        "new",
        "method",
        "encouraged",
        "highest",
        "religious",
        "authority",
        "descartes",
        "left",
        "holland",
        "mersenne",
        "remained",
        "close",
        "contact",
        "correspondence",
        "privy",
        "descartes",
        "secret",
        "address",
        "made",
        "man",
        "one",
        "see",
        "order",
        "get",
        "access",
        "french",
        "exile",
        "send",
        "letter",
        "question",
        "four",
        "letter",
        "mersenne",
        "descartes",
        "extant",
        "letter",
        "descartesabout",
        "quarter",
        "known",
        "correspondencetestify",
        "intensity",
        "continuity",
        "exchange",
        "mersenne",
        "endlessly",
        "provided",
        "descartes",
        "book",
        "fresh",
        "information",
        "editorial",
        "service",
        "requesting",
        "exchange",
        "answer",
        "query",
        "sort",
        "acting",
        "mediator",
        "descartes",
        "controversy",
        "fermat",
        "roberval",
        "beaugrand",
        "morin",
        "voëtius",
        "sometimes",
        "caused",
        "quarrel",
        "indiscretion",
        "one",
        "made",
        "descartes",
        "definitively",
        "fall",
        "erstwhile",
        "mentor",
        "isaac",
        "beeckman",
        "mersenne",
        "also",
        "acted",
        "intermediary",
        "edition",
        "meditationes",
        "de",
        "prima",
        "philosophiae",
        "instrumental",
        "gathering",
        "six",
        "set",
        "objection",
        "added",
        "text",
        "descartes",
        "response",
        "including",
        "hobbes",
        "gassendi",
        "contributed",
        "objectiones",
        "penning",
        "second",
        "set",
        "gathered",
        "r",
        "p",
        "mersenne",
        "mouth",
        "various",
        "theologian",
        "philosopher",
        "ix",
        "buccolini",
        "perhaps",
        "part",
        "sixth",
        "mersenne",
        "dealing",
        "descartes",
        "small",
        "part",
        "network",
        "intellectual",
        "communication",
        "built",
        "throughout",
        "career",
        "largely",
        "responsible",
        "introducing",
        "galileo",
        "france",
        "offering",
        "without",
        "receiving",
        "answerto",
        "publish",
        "future",
        "work",
        "two",
        "chief",
        "system",
        "world",
        "published",
        "le",
        "méchaniques",
        "de",
        "galilée",
        "free",
        "translation",
        "manuscript",
        "mechanic",
        "florentine",
        "scholar",
        "completed",
        "idea",
        "borrowed",
        "guidobaldo",
        "stevin",
        "original",
        "comment",
        "nouvelles",
        "pensées",
        "de",
        "galilée",
        "translation",
        "adaptation",
        "certain",
        "part",
        "discorsi",
        "due",
        "nuove",
        "scienze",
        "published",
        "italy",
        "one",
        "year",
        "earlier",
        "mersenne",
        "also",
        "regular",
        "contact",
        "english",
        "scholar",
        "translated",
        "french",
        "de",
        "veritate",
        "herbert",
        "cherbury",
        "although",
        "book",
        "placed",
        "index",
        "ie",
        "list",
        "prohibited",
        "book",
        "published",
        "catholic",
        "church",
        "good",
        "term",
        "hobbes",
        "baldin",
        "published",
        "one",
        "optical",
        "treatise",
        "sorbière",
        "french",
        "translation",
        "de",
        "cive",
        "corresponded",
        "kenelm",
        "digby",
        "lord",
        "cavendish",
        "others",
        "paris",
        "small",
        "scientific",
        "circle",
        "mathematician",
        "physicist",
        "gradually",
        "formed",
        "around",
        "mersenne",
        "meeting",
        "organized",
        "thursday",
        "house",
        "one",
        "another",
        "friend",
        "protector",
        "academia",
        "parisiensis",
        "came",
        "called",
        "brought",
        "together",
        "men",
        "étienne",
        "pascal",
        "mydorge",
        "hardy",
        "roberval",
        "fermat",
        "later",
        "welcome",
        "young",
        "blaise",
        "pascal",
        "jacques",
        "le",
        "pailleur",
        "become",
        "group",
        "leader",
        "mersenne",
        "died",
        "discussion",
        "mostly",
        "mathematical",
        "mc",
        "v",
        "mersenne",
        "used",
        "submit",
        "problem",
        "invention",
        "friend",
        "often",
        "remarkably",
        "stimulating",
        "origin",
        "important",
        "discovery",
        "roulette",
        "problem",
        "solved",
        "roberval",
        "indirectly",
        "fermat",
        "descartes",
        "mersenne",
        "undertook",
        "establish",
        "first",
        "list",
        "eventually",
        "called",
        "mersenne",
        "prime",
        "prime",
        "number",
        "written",
        "form",
        "n",
        "integer",
        "n",
        "whose",
        "property",
        "determination",
        "still",
        "topical",
        "question",
        "contemporary",
        "mathematics",
        "mersenne",
        "envisaged",
        "meeting",
        "group",
        "net",
        "correspondent",
        "prototype",
        "larger",
        "institution",
        "would",
        "bring",
        "scholar",
        "together",
        "pacified",
        "europe",
        "foreshadowing",
        "foundation",
        "later",
        "académie",
        "de",
        "science",
        "royal",
        "society",
        "england",
        "mc",
        "v",
        "goldstein",
        "mersenne",
        "published",
        "three",
        "massive",
        "philosophical",
        "work",
        "questiones",
        "celeberrimae",
        "genesim",
        "cover",
        "almost",
        "folio",
        "column",
        "commentary",
        "six",
        "first",
        "chapter",
        "book",
        "genesis",
        "larded",
        "long",
        "scientific",
        "philosophical",
        "digression",
        "intended",
        "apology",
        "christian",
        "religion",
        "form",
        "atheism",
        "contains",
        "attack",
        "various",
        "platonist",
        "cabbalistic",
        "hermetic",
        "author",
        "bernardino",
        "telesio",
        "pietro",
        "pomponazzi",
        "giordano",
        "bruno",
        "jacques",
        "gaffarel",
        "english",
        "hermetic",
        "author",
        "robert",
        "fludd",
        "tone",
        "virulent",
        "sometimes",
        "offensive",
        "book",
        "attracted",
        "several",
        "outraged",
        "answer",
        "fludd",
        "particular",
        "reacted",
        "sophia",
        "cum",
        "moria",
        "certamen",
        "drew",
        "long",
        "reply",
        "gassendi",
        "writing",
        "upon",
        "mersenne",
        "request",
        "gassendi",
        "inspiration",
        "governs",
        "l",
        "impiété",
        "de",
        "déistes",
        "published",
        "french",
        "next",
        "year",
        "pointbypoint",
        "refutation",
        "quatrain",
        "du",
        "déiste",
        "antibigot",
        "long",
        "anonymous",
        "poem",
        "denouncing",
        "christian",
        "revelation",
        "bigoted",
        "superstition",
        "belief",
        "personal",
        "god",
        "mersenne",
        "response",
        "written",
        "dialogue",
        "deist",
        "theologian",
        "lead",
        "conversion",
        "deist",
        "existence",
        "justice",
        "mercy",
        "christian",
        "god",
        "demonstrated",
        "dedicated",
        "richelieu",
        "perhaps",
        "written",
        "command",
        "book",
        "may",
        "seen",
        "taking",
        "part",
        "larger",
        "campaign",
        "orchestrated",
        "french",
        "state",
        "catholic",
        "church",
        "time",
        "witnessed",
        "vanini",
        "execution",
        "toulouse",
        "trial",
        "theophile",
        "de",
        "viau",
        "strengthening",
        "repressive",
        "measure",
        "antiaristotelian",
        "philosophical",
        "novelty",
        "la",
        "vérité",
        "de",
        "science",
        "dialogue",
        "alchemist",
        "skeptic",
        "christian",
        "philosopher",
        "latter",
        "opposing",
        "overconfidence",
        "first",
        "excessive",
        "doubt",
        "second",
        "second",
        "third",
        "fourth",
        "part",
        "book",
        "dealing",
        "arithmetic",
        "geometry",
        "page",
        "compilation",
        "ancient",
        "recent",
        "achievement",
        "mathematical",
        "science",
        "intended",
        "show",
        "region",
        "human",
        "knowledge",
        "immune",
        "doubt",
        "contradict",
        "christian",
        "wisdom",
        "end",
        "s",
        "mersenne",
        "former",
        "animosity",
        "towards",
        "antiaristotelians",
        "author",
        "withered",
        "giving",
        "way",
        "lenient",
        "tolerant",
        "approach",
        "galileo",
        "listed",
        "among",
        "dangerous",
        "one",
        "object",
        "great",
        "praise",
        "mersenne",
        "seemed",
        "much",
        "le",
        "concerned",
        "proliferation",
        "atheist",
        "heretic",
        "expressed",
        "regret",
        "offensive",
        "tone",
        "previous",
        "work",
        "letter",
        "rivet",
        "nov",
        "mc",
        "x",
        "travel",
        "holland",
        "put",
        "contact",
        "protestant",
        "scholar",
        "andré",
        "rivet",
        "socinian",
        "ruarus",
        "became",
        "regular",
        "correspondent",
        "mersenne",
        "used",
        "vilify",
        "heretic",
        "taken",
        "task",
        "sympathy",
        "enemy",
        "sometimes",
        "dubbed",
        "huguenot",
        "monk",
        "case",
        "staunch",
        "defense",
        "orthodoxy",
        "first",
        "work",
        "nowhere",
        "found",
        "mersenne",
        "next",
        "publication",
        "onward",
        "almost",
        "entirely",
        "devoted",
        "promotion",
        "mathematical",
        "science",
        "broadly",
        "conceived",
        "question",
        "among",
        "biographer",
        "commentator",
        "whether",
        "change",
        "reflect",
        "conversion",
        "new",
        "agenda",
        "new",
        "philosophical",
        "outlook",
        "robert",
        "lenoble",
        "considers",
        "mersenne",
        "still",
        "looking",
        "better",
        "philosophy",
        "nature",
        "held",
        "provisionally",
        "aristotelianism",
        "whereas",
        "date",
        "discovered",
        "sought",
        "many",
        "year",
        "namely",
        "mechanism",
        "sylvie",
        "taussig",
        "b",
        "considers",
        "mersenne",
        "went",
        "serious",
        "crisis",
        "moral",
        "intellectual",
        "end",
        "s",
        "influence",
        "peiresc",
        "gassendi",
        "came",
        "adopt",
        "skeptical",
        "outlook",
        "philosophical",
        "religious",
        "matter",
        "without",
        "denying",
        "mersenne",
        "change",
        "tone",
        "accent",
        "garber",
        "dear",
        "tend",
        "underplay",
        "extent",
        "meaning",
        "mersenne",
        "conversion",
        "new",
        "philosophy",
        "considering",
        "agenda",
        "promoting",
        "mixed",
        "mathematics",
        "still",
        "compatible",
        "traditional",
        "philosophical",
        "outlook",
        "learning",
        "school",
        "dear",
        "described",
        "conjoining",
        "christianized",
        "aristotelianism",
        "renaissance",
        "humanism",
        "skeptical",
        "probabilistic",
        "approach",
        "philosophical",
        "matter",
        "shall",
        "come",
        "back",
        "issue",
        "due",
        "course",
        "five",
        "treatise",
        "published",
        "row",
        "representative",
        "kind",
        "intellectual",
        "production",
        "mersenne",
        "would",
        "henceforth",
        "offer",
        "two",
        "question",
        "inouyes",
        "question",
        "théologiques",
        "eclectic",
        "list",
        "curious",
        "question",
        "intended",
        "entertainment",
        "récréation",
        "well",
        "instruction",
        "learned",
        "one",
        "walk",
        "water",
        "without",
        "miracle",
        "many",
        "grain",
        "sand",
        "contained",
        "sphere",
        "earth",
        "satisfaction",
        "come",
        "one",
        "belief",
        "one",
        "found",
        "new",
        "demonstration",
        "truth",
        "question",
        "metaphysical",
        "apologetic",
        "even",
        "theological",
        "consideration",
        "spite",
        "title",
        "second",
        "treatise",
        "barely",
        "present",
        "question",
        "harmoniques",
        "préludes",
        "harmonie",
        "universelle",
        "prepare",
        "way",
        "publication",
        "mersenne",
        "great",
        "achievement",
        "musical",
        "theory",
        "harmonie",
        "universelle",
        "offer",
        "still",
        "considered",
        "major",
        "contribution",
        "scientific",
        "understanding",
        "consonance",
        "acoustic",
        "finally",
        "mechaniques",
        "de",
        "galilée",
        "illustrate",
        "mersenne",
        "constant",
        "interest",
        "physicomathematical",
        "question",
        "galilean",
        "type",
        "archimedean",
        "mechanic",
        "stricto",
        "sensu",
        "dealing",
        "basic",
        "machine",
        "lever",
        "wheel",
        "pulley",
        "also",
        "science",
        "motion",
        "free",
        "fall",
        "ballistics",
        "pneumatics",
        "hydrostatics",
        "optic",
        "mersenne",
        "pursued",
        "interest",
        "s",
        "started",
        "make",
        "campaign",
        "experiment",
        "order",
        "verify",
        "galilean",
        "numerical",
        "data",
        "free",
        "fall",
        "velocity",
        "cannon",
        "ball",
        "especially",
        "journey",
        "italy",
        "met",
        "torricelli",
        "research",
        "resulted",
        "publication",
        "cogitate",
        "physicomathematica",
        "novarum",
        "observum",
        "physicomatheaticarum",
        "includes",
        "first",
        "part",
        "treatise",
        "roberval",
        "system",
        "world",
        "book",
        "optic",
        "published",
        "mersenne",
        "death",
        "l",
        "optique",
        "et",
        "la",
        "catoptrique"
    ]
}