{
    "main_text": "The Problems of Metaphysics: the “New” Metaphysics || Space and Time\n3.2 Space and Time\n\nLong before the theory of relativity represented space and time as\naspects of or abstractions from a single entity, spacetime,\nphilosophers saw space and time as intimately related. (A glance\nthrough any dictionary of quotations suggests that the philosophical\npairing of space and time reflects a natural, pre-philosophical\ntendency: “Had we but world enough, and time …”;\n“Dwellers all in time and space”.) Kant, for example,\ntreated space and time in his Transcendental Aesthetic as\nthings that should be explained by a single, unified theory. And his\ntheory of space and time, revolutionary though it may have been in\nother respects, was in this respect typical of philosophical accounts\nof space and time. Whatever the source of the conviction that space\nand time are two members of a “species” (and the only two\nmembers of that species), they certainly raise similar philosophical\nquestions. It can be asked whether space extends infinitely in every\ndirection, and it can be asked whether time extends infinitely in\neither of the two temporal “directions”. Just as one can\nask whether, if space is finite, it has an “end” (whether\nit is bounded or unbounded), one may ask of time whether, if it is\nfinite, it had a beginning or will have an end or whether it might\nhave neither, but rather be “circular” (be finite but\nunbounded). As one can ask whether there could be two extended objects\nthat were not spatially related to each other, one can ask whether\nthere could be two events that were not temporally related to each\nother. One can ask whether space is (a) a real thing—a\nsubstance—a thing that exists independently of its inhabitants,\nor (b) a mere system of relations among those inhabitants. One can ask\nthe same question about time, and also about modality. (See Wallace\n(2019) for an elucidation of temporal/ modal analogies.)\n\nBut there are also questions about time that have no spatial\nanalogues—or at least no obvious and uncontroversial analogues.\nThere are, for example, questions about the grounds of various\nasymmetries between the past and the future—why is our knowledge\nof the past better than our knowledge of the future?; why do we regard\nan unpleasant event that is about to happen differently from the way\nwe regard an unpleasant event that has recently happened?; why does\ncausation seem to have a privileged temporal direction? There do not\nseem to be objective asymmetries like this in space.\n\nThere is also the question of temporal passage—the question\nwhether the apparent “movement” of time (or the apparent\nmovement of ourselves and the objects of our experience through or in\ntime) is a real feature of the world or some sort of illusion. In one\nway of thinking about time, there is a privileged temporal direction\nmarking the difference between the past, present, and future.\nA-theorists hold that time is fundamentally structured in terms of a\npast/present/future distinction. Times change from past to present to\nfuture, giving rise to passage. (The name ‘A-theorist’\ndescends from J.M.E. McTaggart’s (1908) name for the sequence\npast/present/future which he called the ‘A-series’.)\nWithin the A-theory, we might further ask whether the past and future\nhave the “same sort of reality” as the present. Presentist\nA-theorists, like Prior 1998, deny that the past or future have any\nconcrete reality. Presentists typically think of the past and future\nas, at best, akin to abstract possible worlds—they are the way\nthe world was or will be, just as possible worlds are ways the actual\nworld could be. Other A-theorists, like Sullivan (2012), hold that the\npresent is metaphysically privileged but deny that there is any\nontological difference between the past, present, and future. More\ngenerally, A-theorists often incorporate strategies from modal\nmetaphysics into their theories about the relation of the past and the\nfuture to the present.\n\nAccording to B-theories of time, the only fundamental distinction we\nshould draw is that some events and times are earlier or later\nrelative to others. (These relations are called\n‘B-relations’, a term also derived from McTaggart).\nAccording to the B-theorists, there is no objective passage of time,\nor at least not in the sense of time passing from future to present\nand from present to past. B-theorists typically maintain that all past\nand future times are real in the same sense in which the present time\nis real—the present is in no sense metaphysically\nprivileged.\n\nIt is also true, and less often remarked on, that space raises\nphilosophical questions that have no temporal analogues—or at\nleast no obvious and uncontroversial analogues. Why, for example, does\nspace have three dimensions and not four or seven? On the face of it,\ntime is essentially one-dimensional and space is not essentially\nthree-dimensional. It also seems that the metaphysical problems about\nspace that have no temporal analogues depend on the fact that space,\nunlike time, has more than one dimension. For example, consider the\nproblem of incongruent counterparts: those who think space is a mere\nsystem of relations struggled to explain our intuition that we could\ndistinguish a world containing only a left hand from a world\ncontaining only a right hand. So it seems there is an intuitive\norientation to objects in space itself. It is less clear whether the\nproblems about time that have no spatial analogues are connected with\nthe one-dimensionality of time.\n\nFinally, one can raise questions about whether space and time are real\nat all—and, if they are real, to what extent (so to speak) they\nare real. Might it be that space and time are not constituents of\nreality as God perceives reality but nevertheless “well-founded\nphenomena” (as Leibniz held)? Was Kant right when he denied\nspatial and temporal features to “things as they are in\nthemselves”?—and right to contend that space and time are\n“forms of our intuition”? Or was McTaggart’s\nposition the right one: that space and time are wholly unreal?\n\nIf these problems about space and time belong to metaphysics only in\nthe post-Medieval sense, they are nevertheless closely related to\nquestions about first causes and universals. First causes are\ngenerally thought by those who believe in them to be eternal and\nnon-local. God, for example—both the impersonal God of Aristotle\nand the personal God of Medieval Christian, Jewish, and Muslim\nphilosophy—is generally said to be eternal, and the personal God\nis said to be omnipresent. To say that God is eternal is to say either\nthat he is everlasting or that he is somehow outside time. And this\nraises the metaphysical question of whether it is possible for there\nto be a being—not a universal or an abstract object of some\nother sort, but an active substance—that is everlasting or\nnon-temporal. An omnipresent being is a being that does not occupy any\nregion of space (not even the whole of it, as the luminiferous ether\nof nineteenth-century physics would if it existed), and whose causal\ninfluence is nevertheless equally present in every region of space\n(unlike universals, to which the concept of causality does not apply).\nThe doctrine of divine omnipresence raises the metaphysical question\nwhether it is possible for there to be a being with this feature.\nAnte res universals are said by some of their proponents\n(precisely those who deny that universals are constituents of\nparticulars) to have no relations to space and time but\n“vicarious” ones: the ante res universal\n“whiteness” may be said to be present where each white\nparticular is, but only in a way analogous to the way in which the\nnumber two is present where each pair of spatial things is. But it is\ndoubtful whether this is a position that is possible for a\nmetaphysician who says that a white thing is a bundle composed of\nwhiteness and various other universals. Those who believe in the\nexistence of in rebus universals are fond of saying, or have\nbeen in recent years, that these universals (‘immanent\nuniversals’ is a currently popular name for them) are\n“multiply located”—“wholly present” at\neach place at which the things that fall under them are present. And\nby this they certainly do not mean that whiteness is present in many\ndifferent regions of space only vicariously, only as a number might be\nsaid to be present wherever there are things in that number, only in\nvirtue of bearing the non-spatial relation “being had by”\nto a multitude of particulars each of which is present in a single\nregion of space. All theories of universals, therefore, raise\nquestions about how things in various ontological categories are\nrelated to space. And all these questions have temporal analogues.\n",
    "section_title": "3.2 Space and Time",
    "entry_title": "Metaphysics",
    "hierarchy_title": "Metaphysics || The Problems of Metaphysics: the “New” Metaphysics || Space and Time",
    "tokenized_text": [
        "problem",
        "metaphysics",
        "new",
        "metaphysics",
        "space",
        "time",
        "space",
        "time",
        "long",
        "theory",
        "relativity",
        "represented",
        "space",
        "time",
        "aspect",
        "abstraction",
        "single",
        "entity",
        "spacetime",
        "philosopher",
        "saw",
        "space",
        "time",
        "intimately",
        "related",
        "glance",
        "dictionary",
        "quotation",
        "suggests",
        "philosophical",
        "pairing",
        "space",
        "time",
        "reflects",
        "natural",
        "prephilosophical",
        "tendency",
        "world",
        "enough",
        "time",
        "dweller",
        "time",
        "space",
        "kant",
        "example",
        "treated",
        "space",
        "time",
        "transcendental",
        "aesthetic",
        "thing",
        "explained",
        "single",
        "unified",
        "theory",
        "theory",
        "space",
        "time",
        "revolutionary",
        "though",
        "may",
        "respect",
        "respect",
        "typical",
        "philosophical",
        "account",
        "space",
        "time",
        "whatever",
        "source",
        "conviction",
        "space",
        "time",
        "two",
        "member",
        "specie",
        "two",
        "member",
        "specie",
        "certainly",
        "raise",
        "similar",
        "philosophical",
        "question",
        "asked",
        "whether",
        "space",
        "extends",
        "infinitely",
        "every",
        "direction",
        "asked",
        "whether",
        "time",
        "extends",
        "infinitely",
        "either",
        "two",
        "temporal",
        "direction",
        "one",
        "ask",
        "whether",
        "space",
        "finite",
        "end",
        "whether",
        "bounded",
        "unbounded",
        "one",
        "may",
        "ask",
        "time",
        "whether",
        "finite",
        "beginning",
        "end",
        "whether",
        "might",
        "neither",
        "rather",
        "circular",
        "finite",
        "unbounded",
        "one",
        "ask",
        "whether",
        "could",
        "two",
        "extended",
        "object",
        "spatially",
        "related",
        "one",
        "ask",
        "whether",
        "could",
        "two",
        "event",
        "temporally",
        "related",
        "one",
        "ask",
        "whether",
        "space",
        "real",
        "thinga",
        "substancea",
        "thing",
        "exists",
        "independently",
        "inhabitant",
        "b",
        "mere",
        "system",
        "relation",
        "among",
        "inhabitant",
        "one",
        "ask",
        "question",
        "time",
        "also",
        "modality",
        "see",
        "wallace",
        "elucidation",
        "temporal",
        "modal",
        "analogy",
        "also",
        "question",
        "time",
        "spatial",
        "analoguesor",
        "least",
        "obvious",
        "uncontroversial",
        "analogue",
        "example",
        "question",
        "ground",
        "various",
        "asymmetry",
        "past",
        "futurewhy",
        "knowledge",
        "past",
        "better",
        "knowledge",
        "future",
        "regard",
        "unpleasant",
        "event",
        "happen",
        "differently",
        "way",
        "regard",
        "unpleasant",
        "event",
        "recently",
        "happened",
        "causation",
        "seem",
        "privileged",
        "temporal",
        "direction",
        "seem",
        "objective",
        "asymmetry",
        "like",
        "space",
        "also",
        "question",
        "temporal",
        "passagethe",
        "question",
        "whether",
        "apparent",
        "movement",
        "time",
        "apparent",
        "movement",
        "object",
        "experience",
        "time",
        "real",
        "feature",
        "world",
        "sort",
        "illusion",
        "one",
        "way",
        "thinking",
        "time",
        "privileged",
        "temporal",
        "direction",
        "marking",
        "difference",
        "past",
        "present",
        "future",
        "atheorists",
        "hold",
        "time",
        "fundamentally",
        "structured",
        "term",
        "pastpresentfuture",
        "distinction",
        "time",
        "change",
        "past",
        "present",
        "future",
        "giving",
        "rise",
        "passage",
        "name",
        "atheorist",
        "descends",
        "jme",
        "mctaggart",
        "name",
        "sequence",
        "pastpresentfuture",
        "called",
        "aseries",
        "within",
        "atheory",
        "might",
        "ask",
        "whether",
        "past",
        "future",
        "sort",
        "reality",
        "present",
        "presentist",
        "atheorists",
        "like",
        "prior",
        "deny",
        "past",
        "future",
        "concrete",
        "reality",
        "presentist",
        "typically",
        "think",
        "past",
        "future",
        "best",
        "akin",
        "abstract",
        "possible",
        "worldsthey",
        "way",
        "world",
        "possible",
        "world",
        "way",
        "actual",
        "world",
        "could",
        "atheorists",
        "like",
        "sullivan",
        "hold",
        "present",
        "metaphysically",
        "privileged",
        "deny",
        "ontological",
        "difference",
        "past",
        "present",
        "future",
        "generally",
        "atheorists",
        "often",
        "incorporate",
        "strategy",
        "modal",
        "metaphysics",
        "theory",
        "relation",
        "past",
        "future",
        "present",
        "according",
        "btheories",
        "time",
        "fundamental",
        "distinction",
        "draw",
        "event",
        "time",
        "earlier",
        "later",
        "relative",
        "others",
        "relation",
        "called",
        "brelations",
        "term",
        "also",
        "derived",
        "mctaggart",
        "according",
        "btheorists",
        "objective",
        "passage",
        "time",
        "least",
        "sense",
        "time",
        "passing",
        "future",
        "present",
        "present",
        "past",
        "btheorists",
        "typically",
        "maintain",
        "past",
        "future",
        "time",
        "real",
        "sense",
        "present",
        "time",
        "realthe",
        "present",
        "sense",
        "metaphysically",
        "privileged",
        "also",
        "true",
        "le",
        "often",
        "remarked",
        "space",
        "raise",
        "philosophical",
        "question",
        "temporal",
        "analoguesor",
        "least",
        "obvious",
        "uncontroversial",
        "analogue",
        "example",
        "space",
        "three",
        "dimension",
        "four",
        "seven",
        "face",
        "time",
        "essentially",
        "onedimensional",
        "space",
        "essentially",
        "threedimensional",
        "also",
        "seems",
        "metaphysical",
        "problem",
        "space",
        "temporal",
        "analogue",
        "depend",
        "fact",
        "space",
        "unlike",
        "time",
        "one",
        "dimension",
        "example",
        "consider",
        "problem",
        "incongruent",
        "counterpart",
        "think",
        "space",
        "mere",
        "system",
        "relation",
        "struggled",
        "explain",
        "intuition",
        "could",
        "distinguish",
        "world",
        "containing",
        "left",
        "hand",
        "world",
        "containing",
        "right",
        "hand",
        "seems",
        "intuitive",
        "orientation",
        "object",
        "space",
        "le",
        "clear",
        "whether",
        "problem",
        "time",
        "spatial",
        "analogue",
        "connected",
        "onedimensionality",
        "time",
        "finally",
        "one",
        "raise",
        "question",
        "whether",
        "space",
        "time",
        "real",
        "alland",
        "real",
        "extent",
        "speak",
        "real",
        "might",
        "space",
        "time",
        "constituent",
        "reality",
        "god",
        "perceives",
        "reality",
        "nevertheless",
        "wellfounded",
        "phenomenon",
        "leibniz",
        "held",
        "kant",
        "right",
        "denied",
        "spatial",
        "temporal",
        "feature",
        "thing",
        "and",
        "right",
        "contend",
        "space",
        "time",
        "form",
        "intuition",
        "mctaggart",
        "position",
        "right",
        "one",
        "space",
        "time",
        "wholly",
        "unreal",
        "problem",
        "space",
        "time",
        "belong",
        "metaphysics",
        "postmedieval",
        "sense",
        "nevertheless",
        "closely",
        "related",
        "question",
        "first",
        "cause",
        "universal",
        "first",
        "cause",
        "generally",
        "thought",
        "believe",
        "eternal",
        "nonlocal",
        "god",
        "exampleboth",
        "impersonal",
        "god",
        "aristotle",
        "personal",
        "god",
        "medieval",
        "christian",
        "jewish",
        "muslim",
        "philosophyis",
        "generally",
        "said",
        "eternal",
        "personal",
        "god",
        "said",
        "omnipresent",
        "say",
        "god",
        "eternal",
        "say",
        "either",
        "everlasting",
        "somehow",
        "outside",
        "time",
        "raise",
        "metaphysical",
        "question",
        "whether",
        "possible",
        "beingnot",
        "universal",
        "abstract",
        "object",
        "sort",
        "active",
        "substancethat",
        "everlasting",
        "nontemporal",
        "omnipresent",
        "occupy",
        "region",
        "space",
        "even",
        "whole",
        "luminiferous",
        "ether",
        "nineteenthcentury",
        "physic",
        "would",
        "existed",
        "whose",
        "causal",
        "influence",
        "nevertheless",
        "equally",
        "present",
        "every",
        "region",
        "space",
        "unlike",
        "universal",
        "concept",
        "causality",
        "apply",
        "doctrine",
        "divine",
        "omnipresence",
        "raise",
        "metaphysical",
        "question",
        "whether",
        "possible",
        "feature",
        "ante",
        "re",
        "universal",
        "said",
        "proponent",
        "precisely",
        "deny",
        "universal",
        "constituent",
        "particular",
        "relation",
        "space",
        "time",
        "vicarious",
        "one",
        "ante",
        "re",
        "universal",
        "whiteness",
        "may",
        "said",
        "present",
        "white",
        "particular",
        "way",
        "analogous",
        "way",
        "number",
        "two",
        "present",
        "pair",
        "spatial",
        "thing",
        "doubtful",
        "whether",
        "position",
        "possible",
        "metaphysician",
        "say",
        "white",
        "thing",
        "bundle",
        "composed",
        "whiteness",
        "various",
        "universal",
        "believe",
        "existence",
        "rebus",
        "universal",
        "fond",
        "saying",
        "recent",
        "year",
        "universal",
        "immanent",
        "universal",
        "currently",
        "popular",
        "name",
        "multiply",
        "located",
        "wholly",
        "present",
        "place",
        "thing",
        "fall",
        "present",
        "certainly",
        "mean",
        "whiteness",
        "present",
        "many",
        "different",
        "region",
        "space",
        "vicariously",
        "number",
        "might",
        "said",
        "present",
        "wherever",
        "thing",
        "number",
        "virtue",
        "bearing",
        "nonspatial",
        "relation",
        "multitude",
        "particular",
        "present",
        "single",
        "region",
        "space",
        "theory",
        "universal",
        "therefore",
        "raise",
        "question",
        "thing",
        "various",
        "ontological",
        "category",
        "related",
        "space",
        "question",
        "temporal",
        "analogue"
    ]
}