{
    "main_text": "Models of metaphysical explanation || Metaphysical explanation as quasi-causal explanation\n6.1 Metaphysical explanation as quasi-causal explanation\n\nThat metaphysical explanation is like causal explanation is a\nview with quite a few proponents today (though see Taylor 2018 for\nsome problem cases for this view). Mostly those who think it is, also\nthink that all or most metaphysical explanations track or are\ngrounding relations (see\n §3\n above). According to these philosophers, more precisely, metaphysical\nexplanation is like causal explanation because grounding is like\ncausation (Fine 2012; Schaffer 2016, 2017; A. Wilson 2018). In what\nsense grounding is like causation varies among proponents of this\nview. According to Schaffer, grounding and causation, although similar\n(because both species of the kind directed determination\nrelation), are distinct. According to Wilson, grounding and what\nhe calls “nomic causation” are both kinds of causation\n(although of a rather different sort than ordinary causation; see\n §2).\n On both accounts, metaphysical and causal explanation are alike\nbecause grounding and causation resemble each other. One might however\nthink that metaphysical explanation is like causal explanation simply\nbecause the relations those explanations track play the same\nrole vis-a-vis explanation. Fine (2012: 40) may be said to give\nexpression to something like this view when he states that:\n“Ground, if you like, stands to philosophy as cause stands to\nscience”. Holding this view is compatible with the relations\nthose explanations pick out being in all other respects different from\none another.\n\nIf grounding is, or is like, causation, what follows concerning our\nunderstanding of the nature of metaphysical explanation? That\ndepends. One suggestion is that, if grounding is (like) causation, how\nwe understand the nature of causation (and grounding) somehow directly\ntranslates into an account of the nature of causal (and metaphysical)\nexplanation. Some accounts of the nature of causation seem a better\nfit than others for this type of “translation”. If, for\ninstance, causation is understood along counterfactual or\ninterventionist lines, causation and causal explanation (and, is the\nidea, by analogy, grounding and metaphysical explanation) seem\nespecially closely related (see the entry on\n causation: and manipulability\n and the entry on\n counterfactual theories of causation).\n On this type of account, a causal explanation amounts to laying bare\nsystematic patterns of counterfactual dependence. In interventionist\nlanguage:\n\n\n[T]he common element in many forms of explanation, both causal and\nnon-causal, is that they must answer what-if-things-had-been-different\nquestions. (Woodward 2003: 221)\n\n\nSchaffer (2016) proposes we model grounding “in the image of\ncausation” along counterfactual lines (see A. Wilson 2018, who\noffers a similar model). More precisely, he suggests we understand\ngrounding via so-called structural equation models. These are\nmodels which can be characterized using a structure (introduced by\nHalpern 2000) featuring a set of exogenous (independent) variables, a\nset of endogenous (dependent) variables, a set of (incompatible)\nvalues representing contrasts (such that there is a function mapping\nevery variable to an at least two-membered set of values), a set of\nstructural equations (telling us how each endogenous variable is to be\nevaluated on the basis of the values of other variables), and some\nassignment of values to each exogenous variable. Schaffer thinks this\nformalism is excellent for modeling directed dependency relations\ngenerally, and so is equally fitting for modeling both causal and\nmetaphysical dependencies. All that needs adjusting when we move from\ncausation to grounding is some of our background understanding of\nsurrounding notions.\n\nSchaffer is a separatist (see\n §3).\n Causal and metaphysical explanation are in other words distinct from\nthe relations (causation and grounding, respectively) they track, and\nit is important not to think that everything that is true about the\nexplanation side of things must be true of the relation side of things\n(and vice versa). Schaffer does draw one rather\nsubstantive conclusion from the analogy between causation and\ngrounding, however: that there is no distinctive notion of\nmetaphysical (as opposed to causal) explanation. There is\njust explanation (simpliciter) and explanation can be backed by\ncausation, grounding or whatever other relations are apt to back\nexplanation (which, on his view, is the same as being apt to be\nmodeled using structural equations). Similarly, A. Wilson (2018)\nthinks that a “major theoretical benefit” of regarding\ngrounding as metaphysical causation is that this accounts, in a\nstraightforward way, for the explanatory nature of grounding claims:\ngrounding explanations are a type of causal explanation, and they work\nby identifying metaphysical causes. The result is a unified theory of\nexplanation, at least of explanations that work by tracking some\nworldly relation (see\n §4),\n according to which all explanation is causal explanation.\n\nAgainst the account, a couple of things can and have been said. First,\njust as there are important analogies between grounding and causation\n(of the ordinary, run-of-the mill sort:\n §1),\n there are disanalogies as well. This is accepted by both\nfriends and foes of the view. The question then is whether those\ndifferences are serious enough to undermine the work the analogy does\nin the account (proponents of the account, not surprisingly\ndon’t think so; for some who do: see, e.g., Bernstein 2016,\nJanssen 2018, and Roski 2021; see Ylikoski 2013 for a related view).\nAnother argument (due to Janssen 2018) against understanding\ngrounding, and hence metaphysical explanation, in terms of structural\nequation models points to the representational status of models\ngenerally. Deciding whether or not a causal model includes the right\nvariables (both in number and kind) to be able to represent the causal\nstructure of interest sometimes involves reference to what is\nconsidered the theory that best captures the actual features of\nparticular (local) causal processes or mechanisms. These are typically\ntheories for which we have a posteriori evidence. Yet in the\ncase of grounding, these sorts of “evidence” for\nmodel-aptness are not available. In fact, it is not even enough for\nthe grounding theorist to include all possible scenarios, it\nseems the grounding theorist must countenance\ncounterpossibles as well. That this is so, is admitted and\ndefended in A. Wilson (2018). For those who think this is\nunacceptable, however, this is a serious problem with the account.\n\nAnother way of exploiting the analogy between grounding and causation\nis by modeling metaphysical explanation on so-called\ncausal-mechanistic explanation via modeling grounding on causation,\nmechanistically understood (see the entry on\n mechanism in science).\n Something along these lines is suggested in Trogdon (2018). On this\nview:\n\n\nsome metaphysical explanations are representations of grounding\nrelations as being instances of grounding mechanisms. (Trogdon 2018:\n1296)\n\n\nThe explanandum of a grounding-mechanical explanation is the obtaining\nof a grounded fact, and just as we can causally explain a phenomenon\nby providing a model of the inner workings of the mechanism that\nproduces it (see Machamer et al. 2000), we can metaphysically explain\nwhy a grounded fact obtains by providing a model of how grounding\nfacts and facts they ground are connected. We explain why a\ngrounded fact obtains by revealing the metaphysical determination\nrelations—examples, provided by Trogdon, include set formation,\nthe determinate-determinable relation, functional realization,\nconstitution and mereological realization—that hold between the\nconstituents of the relevant facts. In other words: we explain\nwhy a fact obtains via accounting for how it is\n(mechanistically) grounded.\n\nCan all metaphysical explanations be understood in\nquasi-causal terms? Those who want to argue that they can have their\nwork cut out for them. They first need to explain how explanations\nlike our (3) and (4) can be modeled in this way. Perhaps more\nsurprisingly, some argue that this sort of account might not even work\nas an account of all types of metaphysical explanation involving\ngrounding. It is generally thought that a conjunctive fact is grounded\nin its conjuncts. Yet, unless we think of conjunction-introduction as\na (mechanistic) determination relation—something Trogdon\ncautions strongly against (and others: see, e.g., Wilsch\n2015)—this is grounding in the absence of a grounding\nmechanism.\n\nIf it follows that conceptual or logical metaphysical explanations\nwork in a different way than other types of (grounding) metaphysical\nexplanation, then the unification gained by modeling metaphysical as\ncausal explanation is arguably contradicted by the\ndisunification of metaphysical explanations of the\ngrounding-kind. If you think this is a problem, there are a couple of\ndifferent options available: you may, first, claim that, although\ncases of “bare” grounding are bare in the sense that they\ndo not involve any grounding-mechanisms, they are not bare in\nthe sense that they involve no mechanism whatsoever. They do,\nonly the mechanisms they involve are not grounding\nmechanisms, but rather conceptual or logical\nmechanisms: mechanisms involving the conceptual and/or logical\nanalogue of the grounding determination relations. Another option is\nto try to redraw the boundaries for what counts as a\nmetaphysical explanation and argue that cases of bare\ngrounding do not back metaphysical but rather other types\nof—conceptual or logical—explanation (e.g., Kovacs 2017;\nMcSweeney 2020). This frees the proponent of the mechanistic view from\nhaving to introduce different kinds of mechanisms but does not really\nsolve the problem of disunification. Alternatively, the proponent of\nthe mechanistic view could argue that, while there is metaphysical\nexplanation in cases of bare grounding, those are cases where\ngrounding doesn’t play an essential role in the explanation\n(grounding doesn’t back metaphysical explanation). The result\nwould be an account of metaphysical explanation able to provide us\nwith a unified account only of such explanations which\nessentially involve grounding. In view of the fact that many\nbelieve that conceptual and logical explanation, for example, need to\nbe separately accounted for anyway, this should perhaps be\nacceptable.\n\nThus, even if there is this interesting sense in which we can unify\nquasi-casual metaphysical explanations and causal scientific\nexplanations, it is not clear whether all metaphysical explanation are\nof this form, since at least on first glance there seem to be\nexceptions—sometimes major exceptions—that fail to be\ncovered by this model. Whether this is considered a problem or not\nwill depend on whether or not one thinks there is a special value in\nmonism with respect to one’s account of metaphysical\nexplanation, and to what extent one takes putative examples that do\nnot fit the mold are genuine.\n",
    "section_title": "6.1 Metaphysical explanation as quasi-causal explanation",
    "entry_title": "Metaphysical Explanation",
    "hierarchy_title": "Metaphysical Explanation || Models of metaphysical explanation || Metaphysical explanation as quasi-causal explanation",
    "tokenized_text": [
        "model",
        "metaphysical",
        "explanation",
        "metaphysical",
        "explanation",
        "quasicausal",
        "explanation",
        "metaphysical",
        "explanation",
        "quasicausal",
        "explanation",
        "metaphysical",
        "explanation",
        "like",
        "causal",
        "explanation",
        "view",
        "quite",
        "proponent",
        "today",
        "though",
        "see",
        "taylor",
        "problem",
        "case",
        "view",
        "mostly",
        "think",
        "also",
        "think",
        "metaphysical",
        "explanation",
        "track",
        "grounding",
        "relation",
        "see",
        "according",
        "philosopher",
        "precisely",
        "metaphysical",
        "explanation",
        "like",
        "causal",
        "explanation",
        "grounding",
        "like",
        "causation",
        "fine",
        "schaffer",
        "a",
        "wilson",
        "sense",
        "grounding",
        "like",
        "causation",
        "varies",
        "among",
        "proponent",
        "view",
        "according",
        "schaffer",
        "grounding",
        "causation",
        "although",
        "similar",
        "specie",
        "kind",
        "directed",
        "determination",
        "relation",
        "distinct",
        "according",
        "wilson",
        "grounding",
        "call",
        "nomic",
        "causation",
        "kind",
        "causation",
        "although",
        "rather",
        "different",
        "sort",
        "ordinary",
        "causation",
        "see",
        "account",
        "metaphysical",
        "causal",
        "explanation",
        "alike",
        "grounding",
        "causation",
        "resemble",
        "one",
        "might",
        "however",
        "think",
        "metaphysical",
        "explanation",
        "like",
        "causal",
        "explanation",
        "simply",
        "relation",
        "explanation",
        "track",
        "play",
        "role",
        "visavis",
        "explanation",
        "fine",
        "may",
        "said",
        "give",
        "expression",
        "something",
        "like",
        "view",
        "state",
        "ground",
        "like",
        "stand",
        "philosophy",
        "cause",
        "stand",
        "science",
        "holding",
        "view",
        "compatible",
        "relation",
        "explanation",
        "pick",
        "respect",
        "different",
        "one",
        "another",
        "grounding",
        "like",
        "causation",
        "follows",
        "concerning",
        "understanding",
        "nature",
        "metaphysical",
        "explanation",
        "depends",
        "one",
        "suggestion",
        "grounding",
        "like",
        "causation",
        "understand",
        "nature",
        "causation",
        "grounding",
        "somehow",
        "directly",
        "translates",
        "account",
        "nature",
        "causal",
        "metaphysical",
        "explanation",
        "account",
        "nature",
        "causation",
        "seem",
        "better",
        "fit",
        "others",
        "type",
        "translation",
        "instance",
        "causation",
        "understood",
        "along",
        "counterfactual",
        "interventionist",
        "line",
        "causation",
        "causal",
        "explanation",
        "idea",
        "analogy",
        "grounding",
        "metaphysical",
        "explanation",
        "seem",
        "especially",
        "closely",
        "related",
        "see",
        "entry",
        "causation",
        "manipulability",
        "entry",
        "counterfactual",
        "theory",
        "causation",
        "type",
        "account",
        "causal",
        "explanation",
        "amount",
        "laying",
        "bare",
        "systematic",
        "pattern",
        "counterfactual",
        "dependence",
        "interventionist",
        "language",
        "common",
        "element",
        "many",
        "form",
        "explanation",
        "causal",
        "noncausal",
        "must",
        "answer",
        "whatifthingshadbeendifferent",
        "question",
        "woodward",
        "schaffer",
        "proposes",
        "model",
        "grounding",
        "image",
        "causation",
        "along",
        "counterfactual",
        "line",
        "see",
        "a",
        "wilson",
        "offer",
        "similar",
        "model",
        "precisely",
        "suggests",
        "understand",
        "grounding",
        "via",
        "socalled",
        "structural",
        "equation",
        "model",
        "model",
        "characterized",
        "using",
        "structure",
        "introduced",
        "halpern",
        "featuring",
        "set",
        "exogenous",
        "independent",
        "variable",
        "set",
        "endogenous",
        "dependent",
        "variable",
        "set",
        "incompatible",
        "value",
        "representing",
        "contrast",
        "function",
        "mapping",
        "every",
        "variable",
        "least",
        "twomembered",
        "set",
        "value",
        "set",
        "structural",
        "equation",
        "telling",
        "u",
        "endogenous",
        "variable",
        "evaluated",
        "basis",
        "value",
        "variable",
        "assignment",
        "value",
        "exogenous",
        "variable",
        "schaffer",
        "think",
        "formalism",
        "excellent",
        "modeling",
        "directed",
        "dependency",
        "relation",
        "generally",
        "equally",
        "fitting",
        "modeling",
        "causal",
        "metaphysical",
        "dependency",
        "need",
        "adjusting",
        "move",
        "causation",
        "grounding",
        "background",
        "understanding",
        "surrounding",
        "notion",
        "schaffer",
        "separatist",
        "see",
        "causal",
        "metaphysical",
        "explanation",
        "word",
        "distinct",
        "relation",
        "causation",
        "grounding",
        "respectively",
        "track",
        "important",
        "think",
        "everything",
        "true",
        "explanation",
        "side",
        "thing",
        "must",
        "true",
        "relation",
        "side",
        "thing",
        "vice",
        "versa",
        "schaffer",
        "draw",
        "one",
        "rather",
        "substantive",
        "conclusion",
        "analogy",
        "causation",
        "grounding",
        "however",
        "distinctive",
        "notion",
        "metaphysical",
        "opposed",
        "causal",
        "explanation",
        "explanation",
        "simpliciter",
        "explanation",
        "backed",
        "causation",
        "grounding",
        "whatever",
        "relation",
        "apt",
        "back",
        "explanation",
        "view",
        "apt",
        "modeled",
        "using",
        "structural",
        "equation",
        "similarly",
        "a",
        "wilson",
        "think",
        "major",
        "theoretical",
        "benefit",
        "regarding",
        "grounding",
        "metaphysical",
        "causation",
        "account",
        "straightforward",
        "way",
        "explanatory",
        "nature",
        "grounding",
        "claim",
        "grounding",
        "explanation",
        "type",
        "causal",
        "explanation",
        "work",
        "identifying",
        "metaphysical",
        "cause",
        "result",
        "unified",
        "theory",
        "explanation",
        "least",
        "explanation",
        "work",
        "tracking",
        "worldly",
        "relation",
        "see",
        "according",
        "explanation",
        "causal",
        "explanation",
        "account",
        "couple",
        "thing",
        "said",
        "first",
        "important",
        "analogy",
        "grounding",
        "causation",
        "ordinary",
        "runofthe",
        "mill",
        "sort",
        "disanalogies",
        "well",
        "accepted",
        "friend",
        "foe",
        "view",
        "question",
        "whether",
        "difference",
        "serious",
        "enough",
        "undermine",
        "work",
        "analogy",
        "account",
        "proponent",
        "account",
        "surprisingly",
        "think",
        "see",
        "eg",
        "bernstein",
        "janssen",
        "roski",
        "see",
        "ylikoski",
        "related",
        "view",
        "another",
        "argument",
        "due",
        "janssen",
        "understanding",
        "grounding",
        "hence",
        "metaphysical",
        "explanation",
        "term",
        "structural",
        "equation",
        "model",
        "point",
        "representational",
        "status",
        "model",
        "generally",
        "deciding",
        "whether",
        "causal",
        "model",
        "includes",
        "right",
        "variable",
        "number",
        "kind",
        "able",
        "represent",
        "causal",
        "structure",
        "interest",
        "sometimes",
        "involves",
        "reference",
        "considered",
        "theory",
        "best",
        "capture",
        "actual",
        "feature",
        "particular",
        "local",
        "causal",
        "process",
        "mechanism",
        "typically",
        "theory",
        "posteriori",
        "evidence",
        "yet",
        "case",
        "grounding",
        "sort",
        "evidence",
        "modelaptness",
        "available",
        "fact",
        "even",
        "enough",
        "grounding",
        "theorist",
        "include",
        "possible",
        "scenario",
        "seems",
        "grounding",
        "theorist",
        "must",
        "countenance",
        "counterpossibles",
        "well",
        "admitted",
        "defended",
        "a",
        "wilson",
        "think",
        "unacceptable",
        "however",
        "serious",
        "problem",
        "account",
        "another",
        "way",
        "exploiting",
        "analogy",
        "grounding",
        "causation",
        "modeling",
        "metaphysical",
        "explanation",
        "socalled",
        "causalmechanistic",
        "explanation",
        "via",
        "modeling",
        "grounding",
        "causation",
        "mechanistically",
        "understood",
        "see",
        "entry",
        "mechanism",
        "science",
        "something",
        "along",
        "line",
        "suggested",
        "trogdon",
        "view",
        "metaphysical",
        "explanation",
        "representation",
        "grounding",
        "relation",
        "instance",
        "grounding",
        "mechanism",
        "trogdon",
        "explanandum",
        "groundingmechanical",
        "explanation",
        "obtaining",
        "grounded",
        "fact",
        "causally",
        "explain",
        "phenomenon",
        "providing",
        "model",
        "inner",
        "working",
        "mechanism",
        "produce",
        "see",
        "machamer",
        "et",
        "al",
        "metaphysically",
        "explain",
        "grounded",
        "fact",
        "obtains",
        "providing",
        "model",
        "grounding",
        "fact",
        "fact",
        "ground",
        "connected",
        "explain",
        "grounded",
        "fact",
        "obtains",
        "revealing",
        "metaphysical",
        "determination",
        "relationsexamples",
        "provided",
        "trogdon",
        "include",
        "set",
        "formation",
        "determinatedeterminable",
        "relation",
        "functional",
        "realization",
        "constitution",
        "mereological",
        "realizationthat",
        "hold",
        "constituent",
        "relevant",
        "fact",
        "word",
        "explain",
        "fact",
        "obtains",
        "via",
        "accounting",
        "mechanistically",
        "grounded",
        "metaphysical",
        "explanation",
        "understood",
        "quasicausal",
        "term",
        "want",
        "argue",
        "work",
        "cut",
        "first",
        "need",
        "explain",
        "explanation",
        "like",
        "modeled",
        "way",
        "perhaps",
        "surprisingly",
        "argue",
        "sort",
        "account",
        "might",
        "even",
        "work",
        "account",
        "type",
        "metaphysical",
        "explanation",
        "involving",
        "grounding",
        "generally",
        "thought",
        "conjunctive",
        "fact",
        "grounded",
        "conjuncts",
        "yet",
        "unless",
        "think",
        "conjunctionintroduction",
        "mechanistic",
        "determination",
        "relationsomething",
        "trogdon",
        "caution",
        "strongly",
        "others",
        "see",
        "eg",
        "wilsch",
        "this",
        "grounding",
        "absence",
        "grounding",
        "mechanism",
        "follows",
        "conceptual",
        "logical",
        "metaphysical",
        "explanation",
        "work",
        "different",
        "way",
        "type",
        "grounding",
        "metaphysical",
        "explanation",
        "unification",
        "gained",
        "modeling",
        "metaphysical",
        "causal",
        "explanation",
        "arguably",
        "contradicted",
        "disunification",
        "metaphysical",
        "explanation",
        "groundingkind",
        "think",
        "problem",
        "couple",
        "different",
        "option",
        "available",
        "may",
        "first",
        "claim",
        "although",
        "case",
        "bare",
        "grounding",
        "bare",
        "sense",
        "involve",
        "groundingmechanisms",
        "bare",
        "sense",
        "involve",
        "mechanism",
        "whatsoever",
        "mechanism",
        "involve",
        "grounding",
        "mechanism",
        "rather",
        "conceptual",
        "logical",
        "mechanism",
        "mechanism",
        "involving",
        "conceptual",
        "andor",
        "logical",
        "analogue",
        "grounding",
        "determination",
        "relation",
        "another",
        "option",
        "try",
        "redraw",
        "boundary",
        "count",
        "metaphysical",
        "explanation",
        "argue",
        "case",
        "bare",
        "grounding",
        "back",
        "metaphysical",
        "rather",
        "type",
        "ofconceptual",
        "logicalexplanation",
        "eg",
        "kovacs",
        "mcsweeney",
        "free",
        "proponent",
        "mechanistic",
        "view",
        "introduce",
        "different",
        "kind",
        "mechanism",
        "really",
        "solve",
        "problem",
        "disunification",
        "alternatively",
        "proponent",
        "mechanistic",
        "view",
        "could",
        "argue",
        "metaphysical",
        "explanation",
        "case",
        "bare",
        "grounding",
        "case",
        "grounding",
        "play",
        "essential",
        "role",
        "explanation",
        "grounding",
        "back",
        "metaphysical",
        "explanation",
        "result",
        "would",
        "account",
        "metaphysical",
        "explanation",
        "able",
        "provide",
        "u",
        "unified",
        "account",
        "explanation",
        "essentially",
        "involve",
        "grounding",
        "view",
        "fact",
        "many",
        "believe",
        "conceptual",
        "logical",
        "explanation",
        "example",
        "need",
        "separately",
        "accounted",
        "anyway",
        "perhaps",
        "acceptable",
        "thus",
        "even",
        "interesting",
        "sense",
        "unify",
        "quasicasual",
        "metaphysical",
        "explanation",
        "causal",
        "scientific",
        "explanation",
        "clear",
        "whether",
        "metaphysical",
        "explanation",
        "form",
        "since",
        "least",
        "first",
        "glance",
        "seem",
        "exceptionssometimes",
        "major",
        "exceptionsthat",
        "fail",
        "covered",
        "model",
        "whether",
        "considered",
        "problem",
        "depend",
        "whether",
        "one",
        "think",
        "special",
        "value",
        "monism",
        "respect",
        "one",
        "account",
        "metaphysical",
        "explanation",
        "extent",
        "one",
        "take",
        "putative",
        "example",
        "fit",
        "mold",
        "genuine"
    ]
}