{
    "main_text": "Moral Epistemology\n5. Moral Epistemology\n\nAnyone mounting such a defense needs to offer some account of how it\nis we might successfully justify one set of moral judgments as over\nagainst others. When we turn to morality, what counts as good grounds\nfor holding one view rather than another? What sort of evidence might\nbe available? If Hume and Moore are right, no evidence that appeals\nsolely to non-evaluative considerations will be sufficient (unless we\npresuppose some principle of inference that connects non-moral\npremises to moral conclusions). But if we need to rely on evaluative\npremises or principles in order to infer substantive moral conclusions\nfrom non-moral premises (e.g., non-moral premises regarding the impact\nof a course of action on pleasure or on the satisfaction of human\ninterests), the question immediately arises, “How might we\njustify these evaluative premises or principles?”\n\nOne answer often offered is that, at a suitably abstract level, there\nare premises or principles that everyone in fact accepts. Perhaps\n‘Murder is wrong’, or ‘pain is bad’, or\n‘everyone should be treated equally’, are candidates. But\nclearly such claims hardly do much work since questions immediately\narise about which killings constitute murder and about how different\npains should be compared and about which way of treating people counts\nas treating them equally in the relevant way. No moral claim that is\nplausibly offered as actually accepted by all, or nearly all, people\ncan possibly be substantive enough to help settle on one set of moral\njudgments rather than another as better justified.\n\nOne might, in light of this, offer a more substantive principle, not\nas one that people actually all accept, but as one that they are all,\nin fact, committed to (though they may not realize it). This strategy\noffers the prospect of identifying a principle rich enough in content\nto serve as the justifying ground for other moral judgments. Yet it\nrequires showing how the principle(s) identified work to justify the\nmore specific judgments they are meant to support. Moreover, one who\ntakes this approach needs also to justify the claim that people are\nactually committed to the principle in the first place. And this\nraises the suspicion that claiming there are certain principles to\nwhich everyone is committed simply relocates the original challenge,\nwithout actually meeting it.\n\nIn any case, even if there are suitably substantive principles to\nwhich people are committed, and this can be shown, and even if there\nis a way to establish as well that the principles in question would\n(if right) actually justify more specific moral judgments, one might\nunderstandably worry about the status of the resulting structure. Why\nnot think of it as a castle in the sky, a structure with no\nappropriate foundation? After all, the fact that we happen to accept,\nor are committed to accepting, some principle, seems a long way from\nshowing that the principle is true or right.\n\nOur moral judgments (about particular cases as well as about general\nprinciples) seem to float disconcertingly free from our normal sources\nof evidence concerning the nature of the world. We cannot see, touch,\ntaste, or smell value or rightness or virtue, even as we can see,\ntouch, taste, or smell some of the things that have value or that are\nright or that manifest virtue. So how do we learn about value and\nrightness and virtue themselves? What grounds do we have for thinking\nour various moral judgments link up appropriately with what they are\njudgments of?\n\nOf course, moral judgments are not the only judgments that face such a\nchallenge. Many mathematical, modal, and religious judgments face a\nsimilar challenge. They all apparently concern matters that are not\ndirectly available to the senses and that are, in various ways,\nmysterious. That establishes some companions in guilt, but also\nprovides the hope that reasonable accounts of how we might learn (or\nnot) about numbers, possibility and necessity, and God, might provide\ninsight into the evidence (if any) we are able to secure concerning\nmorality.\n\nOne approach is to argue, as Kant (1785) does, that the relevant moral\ncommitments, although neither immediately obvious nor universally\nacknowledged, can be known a\n priori.[13]\n On his account, the concept of a rational agent contains within it\nthe resources to ground the unconditional demands, on such agents,\nthat they (i) act always either to take the necessary means to their\nends or abandon (or adjust) those ends and (ii) act always to treat\nthemselves and others as ends and never solely as means. The first, on\nKant’s account, structures practical rationality generally, the\nsecond structures morality specifically. Both are, as Kant sees it,\ninescapable demands on rational agents.\n\nIt is worth emphasizing that positive theories of moral epistemology\nare inevitably bound up with accounts of the nature of moral judgment\nand their metaphysical presuppositions and commitments. On some\naccounts, there is nothing to know, so there is no need for a theory\nof moral knowledge. On others, a proper understanding of moral\njudgments will reveal that justifying them is of a piece with\njustifying other judgments for which we have, or hope to have, a\nplausible epistemology, so the epistemology of morality will be\ncontinuous with epistemological theories of other domains (see McGrath\n2020). On still other accounts, moral judgments are such that only a\nsui generis epistemology would make sense of our capacity to\nacquire moral knowledge. No matter which of these options one takes,\nepistemological skepticism looms as a threat. And in the first case,\nwhere there is by implication nothing to know, it does not merely\nloom, it arrives inevitably. Even if one succeeds in developing a\npositive theory of moral epistemology in light of which moral\nknowledge might be possible, the substantive challenge of showing that\nknowledge has actually been secured remains formidable.\n\nMoreover, the deep and apparently irresolvable moral disagreements,\neven among those who in other respects regard each other as peers,\ncalls into question the idea that people are even justified in holding\nthe views they do. After all, if someone equally informed, smart,\nconcerned, and sensitive know that they arrive at different moral\nconclusions, how can either regard themselves as justified in their\nopinion. On what grounds? Thanks to what evidence? (See the entry on\n disagreement.)\n\nOne way to respond to this worry is to maintain that apparent peers\nactually are not peers either because they lack relevant evidence, or\nthey suffer from distorting evidence, or they fail, at least when it\ncomes to moral matters, to give the proper weight to their evidence in\ntheir reasoning. Taking this line commits one to some view or other of\nwhat evidence is the relevant evidence and what is involved in giving\nit the proper weight in moral reasoning. Not surprisingly, there is a\nhuge variety of views on these matters concerning, for instance,\nwhether one’s moral judgments are justified only if they have\ntheir foundation in, say, distinctive set of moral intuitions (see\nMoore 1903; Ross 1930; Huemer 2005); or only if one’s moral\njudgments cohere properly with one another, with one’s\nprinciples connecting and supporting one’s more particular moral\njudgments (see Rawls 1971; Daniels 1979; Sayre-McCord 1996); or only\nif they can be grounded in an inescapable aspect of rational agency\n(Korsgaard 1996).)\n\nAny moral epistemology is likely to inherit virtually all the\ncomplexity that comes with epistemology in general, including not just\nthe challenge of disagreement among peers, and the debate between\nfoundationalists and coherentists about justification, but worries\nabout our access to the relevant truths (if such there be), and the\npersistent looming threat of skepticism (see Enoch 2011;\nSinnott-Armstrong 2006). When that is added to the apparently\ndistinctive nature of moral thought, the challenges are daunting. (See\nthe entries on\n moral epistemology\n and\n moral skepticism.)\n\nAt the same time, much of morality seems clearly a matter of knowing\nhow—how to respond to the need of others, how to\nrespond to threats, how to carry oneself in various\nsituations—and not primarily (if at all) a matter of knowing\nthat something is the case. No doubt, focusing on knowing\nhow, rather than knowing that, does not address skepticism concerning\nthe claims we might make as to which know-how is morally significant.\nBut paying attention to the degree to which people count as moral (or\nimmoral) not because of what they say or believe, but because of how\nthey act, is important to appreciating both the nature of morality and\nwhat all a plausible account of moral knowledge must encompass.\n",
    "section_title": "5. Moral Epistemology",
    "entry_title": "Metaethics",
    "hierarchy_title": "Metaethics || Moral Epistemology",
    "tokenized_text": [
        "moral",
        "epistemology",
        "moral",
        "epistemology",
        "anyone",
        "mounting",
        "defense",
        "need",
        "offer",
        "account",
        "might",
        "successfully",
        "justify",
        "one",
        "set",
        "moral",
        "judgment",
        "others",
        "turn",
        "morality",
        "count",
        "good",
        "ground",
        "holding",
        "one",
        "view",
        "rather",
        "another",
        "sort",
        "evidence",
        "might",
        "available",
        "hume",
        "moore",
        "right",
        "evidence",
        "appeal",
        "solely",
        "nonevaluative",
        "consideration",
        "sufficient",
        "unless",
        "presuppose",
        "principle",
        "inference",
        "connects",
        "nonmoral",
        "premise",
        "moral",
        "conclusion",
        "need",
        "rely",
        "evaluative",
        "premise",
        "principle",
        "order",
        "infer",
        "substantive",
        "moral",
        "conclusion",
        "nonmoral",
        "premise",
        "eg",
        "nonmoral",
        "premise",
        "regarding",
        "impact",
        "course",
        "action",
        "pleasure",
        "satisfaction",
        "human",
        "interest",
        "question",
        "immediately",
        "arises",
        "might",
        "justify",
        "evaluative",
        "premise",
        "principle",
        "one",
        "answer",
        "often",
        "offered",
        "suitably",
        "abstract",
        "level",
        "premise",
        "principle",
        "everyone",
        "fact",
        "accepts",
        "perhaps",
        "murder",
        "wrong",
        "pain",
        "bad",
        "everyone",
        "treated",
        "equally",
        "candidate",
        "clearly",
        "claim",
        "hardly",
        "much",
        "work",
        "since",
        "question",
        "immediately",
        "arise",
        "killing",
        "constitute",
        "murder",
        "different",
        "pain",
        "compared",
        "way",
        "treating",
        "people",
        "count",
        "treating",
        "equally",
        "relevant",
        "way",
        "moral",
        "claim",
        "plausibly",
        "offered",
        "actually",
        "accepted",
        "nearly",
        "people",
        "possibly",
        "substantive",
        "enough",
        "help",
        "settle",
        "one",
        "set",
        "moral",
        "judgment",
        "rather",
        "another",
        "better",
        "justified",
        "one",
        "might",
        "light",
        "offer",
        "substantive",
        "principle",
        "one",
        "people",
        "actually",
        "accept",
        "one",
        "fact",
        "committed",
        "though",
        "may",
        "realize",
        "strategy",
        "offer",
        "prospect",
        "identifying",
        "principle",
        "rich",
        "enough",
        "content",
        "serve",
        "justifying",
        "ground",
        "moral",
        "judgment",
        "yet",
        "requires",
        "showing",
        "principle",
        "identified",
        "work",
        "justify",
        "specific",
        "judgment",
        "meant",
        "support",
        "moreover",
        "one",
        "take",
        "approach",
        "need",
        "also",
        "justify",
        "claim",
        "people",
        "actually",
        "committed",
        "principle",
        "first",
        "place",
        "raise",
        "suspicion",
        "claiming",
        "certain",
        "principle",
        "everyone",
        "committed",
        "simply",
        "relocates",
        "original",
        "challenge",
        "without",
        "actually",
        "meeting",
        "case",
        "even",
        "suitably",
        "substantive",
        "principle",
        "people",
        "committed",
        "shown",
        "even",
        "way",
        "establish",
        "well",
        "principle",
        "question",
        "would",
        "right",
        "actually",
        "justify",
        "specific",
        "moral",
        "judgment",
        "one",
        "might",
        "understandably",
        "worry",
        "status",
        "resulting",
        "structure",
        "think",
        "castle",
        "sky",
        "structure",
        "appropriate",
        "foundation",
        "fact",
        "happen",
        "accept",
        "committed",
        "accepting",
        "principle",
        "seems",
        "long",
        "way",
        "showing",
        "principle",
        "true",
        "right",
        "moral",
        "judgment",
        "particular",
        "case",
        "well",
        "general",
        "principle",
        "seem",
        "float",
        "disconcertingly",
        "free",
        "normal",
        "source",
        "evidence",
        "concerning",
        "nature",
        "world",
        "see",
        "touch",
        "taste",
        "smell",
        "value",
        "rightness",
        "virtue",
        "even",
        "see",
        "touch",
        "taste",
        "smell",
        "thing",
        "value",
        "right",
        "manifest",
        "virtue",
        "learn",
        "value",
        "rightness",
        "virtue",
        "ground",
        "thinking",
        "various",
        "moral",
        "judgment",
        "link",
        "appropriately",
        "judgment",
        "course",
        "moral",
        "judgment",
        "judgment",
        "face",
        "challenge",
        "many",
        "mathematical",
        "modal",
        "religious",
        "judgment",
        "face",
        "similar",
        "challenge",
        "apparently",
        "concern",
        "matter",
        "directly",
        "available",
        "sens",
        "various",
        "way",
        "mysterious",
        "establishes",
        "companion",
        "guilt",
        "also",
        "provides",
        "hope",
        "reasonable",
        "account",
        "might",
        "learn",
        "number",
        "possibility",
        "necessity",
        "god",
        "might",
        "provide",
        "insight",
        "evidence",
        "able",
        "secure",
        "concerning",
        "morality",
        "one",
        "approach",
        "argue",
        "kant",
        "relevant",
        "moral",
        "commitment",
        "although",
        "neither",
        "immediately",
        "obvious",
        "universally",
        "acknowledged",
        "known",
        "priori",
        "account",
        "concept",
        "rational",
        "agent",
        "contains",
        "within",
        "resource",
        "ground",
        "unconditional",
        "demand",
        "agent",
        "act",
        "always",
        "either",
        "take",
        "necessary",
        "mean",
        "end",
        "abandon",
        "adjust",
        "end",
        "ii",
        "act",
        "always",
        "treat",
        "others",
        "end",
        "never",
        "solely",
        "mean",
        "first",
        "kant",
        "account",
        "structure",
        "practical",
        "rationality",
        "generally",
        "second",
        "structure",
        "morality",
        "specifically",
        "kant",
        "see",
        "inescapable",
        "demand",
        "rational",
        "agent",
        "worth",
        "emphasizing",
        "positive",
        "theory",
        "moral",
        "epistemology",
        "inevitably",
        "bound",
        "account",
        "nature",
        "moral",
        "judgment",
        "metaphysical",
        "presupposition",
        "commitment",
        "account",
        "nothing",
        "know",
        "need",
        "theory",
        "moral",
        "knowledge",
        "others",
        "proper",
        "understanding",
        "moral",
        "judgment",
        "reveal",
        "justifying",
        "piece",
        "justifying",
        "judgment",
        "hope",
        "plausible",
        "epistemology",
        "epistemology",
        "morality",
        "continuous",
        "epistemological",
        "theory",
        "domain",
        "see",
        "mcgrath",
        "still",
        "account",
        "moral",
        "judgment",
        "sui",
        "generis",
        "epistemology",
        "would",
        "make",
        "sense",
        "capacity",
        "acquire",
        "moral",
        "knowledge",
        "matter",
        "option",
        "one",
        "take",
        "epistemological",
        "skepticism",
        "loom",
        "threat",
        "first",
        "case",
        "implication",
        "nothing",
        "know",
        "merely",
        "loom",
        "arrives",
        "inevitably",
        "even",
        "one",
        "succeeds",
        "developing",
        "positive",
        "theory",
        "moral",
        "epistemology",
        "light",
        "moral",
        "knowledge",
        "might",
        "possible",
        "substantive",
        "challenge",
        "showing",
        "knowledge",
        "actually",
        "secured",
        "remains",
        "formidable",
        "moreover",
        "deep",
        "apparently",
        "irresolvable",
        "moral",
        "disagreement",
        "even",
        "among",
        "respect",
        "regard",
        "peer",
        "call",
        "question",
        "idea",
        "people",
        "even",
        "justified",
        "holding",
        "view",
        "someone",
        "equally",
        "informed",
        "smart",
        "concerned",
        "sensitive",
        "know",
        "arrive",
        "different",
        "moral",
        "conclusion",
        "either",
        "regard",
        "justified",
        "opinion",
        "ground",
        "thanks",
        "evidence",
        "see",
        "entry",
        "disagreement",
        "one",
        "way",
        "respond",
        "worry",
        "maintain",
        "apparent",
        "peer",
        "actually",
        "peer",
        "either",
        "lack",
        "relevant",
        "evidence",
        "suffer",
        "distorting",
        "evidence",
        "fail",
        "least",
        "come",
        "moral",
        "matter",
        "give",
        "proper",
        "weight",
        "evidence",
        "reasoning",
        "taking",
        "line",
        "commits",
        "one",
        "view",
        "evidence",
        "relevant",
        "evidence",
        "involved",
        "giving",
        "proper",
        "weight",
        "moral",
        "reasoning",
        "surprisingly",
        "huge",
        "variety",
        "view",
        "matter",
        "concerning",
        "instance",
        "whether",
        "one",
        "moral",
        "judgment",
        "justified",
        "foundation",
        "say",
        "distinctive",
        "set",
        "moral",
        "intuition",
        "see",
        "moore",
        "ross",
        "huemer",
        "one",
        "moral",
        "judgment",
        "cohere",
        "properly",
        "one",
        "another",
        "one",
        "principle",
        "connecting",
        "supporting",
        "one",
        "particular",
        "moral",
        "judgment",
        "see",
        "rawls",
        "daniel",
        "sayremccord",
        "grounded",
        "inescapable",
        "aspect",
        "rational",
        "agency",
        "korsgaard",
        "moral",
        "epistemology",
        "likely",
        "inherit",
        "virtually",
        "complexity",
        "come",
        "epistemology",
        "general",
        "including",
        "challenge",
        "disagreement",
        "among",
        "peer",
        "debate",
        "foundationalists",
        "coherentists",
        "justification",
        "worry",
        "access",
        "relevant",
        "truth",
        "persistent",
        "looming",
        "threat",
        "skepticism",
        "see",
        "enoch",
        "sinnottarmstrong",
        "added",
        "apparently",
        "distinctive",
        "nature",
        "moral",
        "thought",
        "challenge",
        "daunting",
        "see",
        "entry",
        "moral",
        "epistemology",
        "moral",
        "skepticism",
        "time",
        "much",
        "morality",
        "seems",
        "clearly",
        "matter",
        "knowing",
        "howhow",
        "respond",
        "need",
        "others",
        "respond",
        "threat",
        "carry",
        "oneself",
        "various",
        "situationsand",
        "primarily",
        "matter",
        "knowing",
        "something",
        "case",
        "doubt",
        "focusing",
        "knowing",
        "rather",
        "knowing",
        "address",
        "skepticism",
        "concerning",
        "claim",
        "might",
        "make",
        "knowhow",
        "morally",
        "significant",
        "paying",
        "attention",
        "degree",
        "people",
        "count",
        "moral",
        "immoral",
        "say",
        "believe",
        "act",
        "important",
        "appreciating",
        "nature",
        "morality",
        "plausible",
        "account",
        "moral",
        "knowledge",
        "must",
        "encompass"
    ]
}