{
    "main_text": "Mill’s Utilitarianism || Happiness and Higher Pleasures\n2.2 Happiness and Higher Pleasures\n\nMill also disagrees with the Radicals about the nature of happiness.\nThough he never abandons the utilitarian tradition of the Radicals,\nMill modifies their assumptions about happiness. He explains his\ncommitment to utilitarianism early in Chapter II of\nUtilitarianism.\n\n\nThe creed which accepts as the foundations of morals\n“utility” or the “greatest happiness\nprinciple” holds that actions are right in proportion as they\ntend to promote happiness; wrong as they tend to produce the reverse\nof happiness. By happiness is intended pleasure and the absence of\npain; by unhappiness, pain and the privation of pleasure. (II 2; also\nsee II 1)\n\n\nThis famous passage is sometimes called the Proportionality Doctrine.\nIt sounds like Bentham. The first sentence appears to endorse\nutilitarianism, while the second sentence appears to endorse a\nhedonistic conception of utilitarianism.\n\nHedonism implies that the mental state of pleasure is the only thing\nhaving intrinsic value (and the mental state of pain is the\nonly intrinsic evil). All other things have only extrinsic\nvalue; they have value just insofar as they bring about, mediately or\ndirectly, intrinsic value (or disvalue). It follows that actions,\nactivities, etc. can have only extrinsic value, and it would seem that\ntheir value should depend entirely upon the quantity of\npleasure that they produce, where quantity is a function of the number\nof pleasures, their intensity, and their duration. This would mean\nthat one kind of activity or pursuit is intrinsically no better than\nanother. If we correctly value one more than another, it must be\nbecause the first produces more numerous, intense, or durable\npleasures than the other.\n\nMill worries that some will reject hedonism as a theory of value or\nhappiness fit only for swine (II 3). In particular, he worries that\nopponents will assume that utilitarianism favors sensual or voluptuary\npursuits (e.g., push-pin) over higher or nobler pursuits (e.g.,\npoetry). Mill attempts to reassure readers that the utilitarian can\nand will defend the superiority of higher pleasures.\n\nHe begins by noting, with fairly obvious reference to Bentham, that\nthe hedonist can defend higher pursuits as extrinsically superior on\nthe ground that they produce more pleasure (II 4). While Mill thinks\nthat the Benthamite can defend the extrinsic superiority of higher\npleasure, he is not content with this defense of their superiority.\nMill insists that the greater value of intellectual pleasures can and\nshould be put on a more secure footing (II 4). He explains these\nhigher pleasures and links them with the preferences of a\ncompetent judge, in the following manner.\n\n\nIf I am asked what I mean by difference of quality in pleasures, or\nwhat makes one pleasure more valuable than another, merely as a\npleasure, except its being greater in amount, there is but one\npossible answer. If one of the two is, by those who are competently\nacquainted with both, placed so far above the other that they prefer\nit, even though knowing it to be attended with a greater amount of\ndiscontent, and would not resign it for any quantity of the other\npleasure which their nature is capable of, we are justified in\nascribing to the preferred enjoyment a superiority in quality so far\noutweighing quantity as to render it, in comparison, of small account.\n(II 5)\n\n\nIndeed, Mill seems to claim here not just that higher pleasures are\nintrinsically more valuable than lower ones but that they are\ndiscontinuously better (II 6).\n\nThis certainly goes beyond Bentham’s quantitative hedonism. In\nfact, it is not even clear that Mill’s higher pleasures doctrine\nis consistent with hedonism. Mill’s position here is hard to pin\ndown, in part because he uses the term ‘pleasure’\nsometimes to refer to (a) a certain kind of mental state or sensation\nand at other times to refer to (b) non-mental items, such as actions,\nactivities, and pursuits that do or can cause pleasurable mental\nstates (consider the way in which someone might say that surfing was\nher greatest pleasure). We might call (a)-type pleasures\nsubjective pleasures and (b)-type pleasures\nobjective pleasures. What’s unclear is whether\nMill’s higher pleasures are subjective pleasures or objective\npleasures. His discussion concerns activities that employ our higher\nfaculties. What’s unclear is whether higher pleasures refer to\nmental states or sensations caused by higher activities or the\nactivities themselves.\n\nIt might seem clear that we should interpret higher pleasures as\nsubjective pleasures. After all, Mill has just told us that he is a\nhedonist about happiness. The Radicals may not have always been clear\nabout the kind of mental state or sensation they take pleasure to be,\nbut it seems clear that they conceive of it as some kind of mental\nstate or sensation. Some, like Bentham, appear to conceive of pleasure\nas a sensation with a distinctive kind of qualitative feel. Others,\nperhaps despairing of finding qualia common to all disparate kinds of\npleasures, tend to understand pleasures functionally, as mental states\nor sensations the subject, whose states these are, prefers and is\ndisposed to prolong. James Mill held something like this functional\nconception of pleasure (An Analysis of the Phenomena of the Human\nMind II, p. 184). Pleasures, understood functionally, could have\nvery different qualitative feels and yet still be pleasures. Insofar\nas Mill does discuss subjective pleasures, he is not clear which, if\neither, of these conceptions of pleasure he favors. Nonetheless, it\nmay seem natural to assume that as a hedonist he conceives of\npleasures as subjective pleasures. According to this interpretation,\nMill is focusing on pleasurable sensations and then distinguishing\nhigher and lower pleasures by references to their causes. Higher\npleasures are pleasures caused by the exercise of our higher\nfaculties, whereas lower pleasures are pleasures caused by the\nexercise of our lower capacities. But this interpretation of the\nhigher pleasures doctrine is problematic.\n\nOne concern is raised by Henry Sidgwick (Outlines 247).\nHedonism is committed to the idea that one pleasure is better than\nanother because it is more pleasurable. But this sounds like a\nquantitative relation. If higher pleasures are better than lower\npleasures, but not because they involve a greater quantity of\npleasure, how can this be squared with hedonism? One answer is that\nMill thinks that there are two factors affecting the magnitude of a\npleasure: its quantity, as determined by its intensity and duration,\nand its quality or kind. On this proposal, one pleasure can be greater\nthan another independently of its quantity by virtue of its quality\n(Sturgeon 2010).\n\nWe can distinguish among pleasures between those that are caused by\nthe exercise of our higher faculties and those that are caused by the\nexercise of our lower faculties. But why should this difference itself\naffect the pleasurableness of the state in question? If Mill holds a\npreference or functional conception of pleasure, according to which\npleasures are mental states that the subject prefers and other things\nbeing equal would prolong, then perhaps he could claim that pleasures\ncategorically preferred by competent judges are more pleasurable\npleasures. However, he says that competent judges have this preference\nfor the higher pleasure, “even though knowing it to be attended\nwith a greater amount of discontent” (U II 5). This\nsuggests that higher pleasures may not be more pleasurable even for\ncompetent judges, and in any case it’s not clear that we could\ninfer what was more pleasurable for someone who was not a competent\njudge from what was more pleasurable for someone who was. So,\neven if we can distinguish higher and lower pleasures, according to\ntheir causes, it remains unclear how the hedonist is to explain how\nhigher pleasures are inherently more pleasurable.\n\nA related concern is how this interpretation of the higher pleasures\ndoctrine makes sense of Mill’s contrast between happiness and\ncontentment or satisfaction. After explaining higher pleasures in\nterms of the categorical preferences of competent judges and insisting\nthat competent judges would not trade any amount of lower pleasures\nfor higher pleasures, he claims that this preference sacrifices\ncontentment or satisfaction, but not happiness (II 6). Mill does not\nsay that the preference of competent judges is for one kind of\ncontentment over another or that Socrates has more contentment than\nthe pig or fool by virtue of enjoying a different kind of contentment.\nInstead, he contrasts happiness and contentment and implies that\nSocrates is happier than the fool, even if less contented.\n\nAnother problem for this reading of the higher pleasures doctrine is\nthat Mill frequently understands higher pleasures as objective\npleasures. First, we have independent evidence that Mill sometimes\nuses the word “pleasure” to refer to objective pleasures.\nFor instance, in the second part of the “proof” of the\nprinciple of utility in Chapter IV Mill counts music, virtue, and\nhealth as pleasures (IV 5). These seem to be objective pleasures.\nElsewhere in his discussion of higher pleasures in Chapter II, Mill\nequates a person’s pleasures with his “indulgences”\n(II 7) and with his “mode of existence” (II 8). Here too\nhe seems to be discussing objective pleasures. When Mill introduces\nhigher pleasures (II 4) he is clearly discussing, among other things,\nintellectual pursuits and activities. He claims to be arguing that\nwhat the quantitative hedonist finds extrinsically more valuable is\nalso intrinsically more valuable (II 4, 7). But what the quantitative\nhedonist defends as extrinsically more valuable are complex activities\nand pursuits, such as writing or reading poetry, not mental states.\nBecause Mill claims that these very same things are intrinsically, and\nnot just extrinsically, more valuable, his higher pleasures would\nappear to be intellectual activities and pursuits, rather than mental\nstates. Finally, in paragraphs 4–8 Mill links the preferences of\ncompetent judges and the greater value of the objects of their\npreferences. But among the things Mill thinks competent judges would\nprefer are activities and pursuits.\n\n\nNow it is an unquestionable fact that those who are equally acquainted\nwith and equally capable of appreciating and enjoying both do give a\nmost marked preference to the manner of existence which\nemploys their higher faculties. (II 6; emphasis added)\n\n\nHere Mill is identifying the higher pleasures with activities and\npursuits that exercise our higher capacities.\n\nInsofar as Mill’s higher pleasures doctrine concerns objective\npleasures, it appears anti-hedonistic for two reasons. First, he\nclaims that the intellectual pursuits have value out of proportion to\nthe amount of contentment or pleasure (the mental state) that they\nproduce. This would contradict the traditional hedonist claim that the\nextrinsic value of an activity is proportional to its pleasurableness.\nSecond, Mill claims that these activities are intrinsically more\nvaluable than the lower pursuits (II 7). But the traditional hedonist\nclaims that the mental state of pleasure is the one and only intrinsic\ngood; activities can have only extrinsic value, and no activity can be\nintrinsically more valuable than another.\n\nWhichever way we read Mill’s higher pleasures doctrine, it is\nhard to square that doctrine with hedonism, as traditionally\nformulated. This apparent inconsistency was noted by many of\nMill’s subsequent critics, including Sidgwick (Methods\n93n, 94, 121), F.H. Bradley (Ethical Studies 116–20),\nT.H. Green (Prolegomena to Ethics §§162–63),\nand G.E. Moore (Principia Ethica 71–72, 77–81).\nGreen’s discussion is especially instructive. He focuses on\nMill’s explanation of the preferences of competent judges for\nmodes of existence that employ their higher faculties. Mill explains\nthe fact that competent judges prefer activities that exercise their\nrational capacities by appeal to their sense of dignity.\n\n\nWe may give what explanation we please of this unwillingness [on the\npart of a competent judge ever to sink into what he feels to be a\nlower grade of existence] …but its most appropriate appellation\nis a sense of dignity, which all human beings possess in one form or\nother, and in some, though by no means in exact, proportion to their\nhigher faculties …. (U II 6)\n\n\nGreen thinks that the dignity passage undermines hedonism\n(Prolegomena §§164–66, 171). In claiming that\nit is the dignity of a life in which the higher capacities are\nexercised and the competent judge’s sense of her own dignity\nthat explains her preference for those activities, Mill implies that\nher preferences reflect judgments about the value that these\nactivities have independently of their being the object of desire or\nthe source of pleasure. We take pleasure in these activities because\nthey are valuable; they are not valuable, because they are\npleasurable.\n\nTo see Green’s point, think of competent judges as demi-gods. In\nthe dignity passage, Mill is making the same sort of point that\nSocrates does in discussing Euthyphro’s definition of piety as\nwhat all the gods love (Euthyphro 9c–11b). Socrates\nthought the gods’ attitudes would be principled, not arbitrary.\nBut this meant that their love presupposed, rather than explained,\npiety and justice. Similarly, Mill thinks that the preferences of\ncompetent judges are not arbitrary, but principled, reflecting a sense\nof the value of the higher capacities. But this would make his\ndoctrine of higher pleasures fundamentally anti-hedonistic, insofar it\nexplains the superiority of higher activities, not in terms of the\npleasure they produce, but rather in terms of the dignity or value of\nthe kind of life characterized by the exercise of higher capacities.\nAnd it is sensitivity to the dignity of such a life that explains the\ncategorical preference that competent judges supposedly have for\nhigher activities.\n",
    "section_title": "2.2 Happiness and Higher Pleasures",
    "entry_title": "Mill’s Moral and Political Philosophy",
    "hierarchy_title": "Mill’s Moral and Political Philosophy || Mill’s Utilitarianism || Happiness and Higher Pleasures",
    "tokenized_text": [
        "mill",
        "utilitarianism",
        "happiness",
        "higher",
        "pleasure",
        "happiness",
        "higher",
        "pleasure",
        "mill",
        "also",
        "disagrees",
        "radical",
        "nature",
        "happiness",
        "though",
        "never",
        "abandon",
        "utilitarian",
        "tradition",
        "radical",
        "mill",
        "modifies",
        "assumption",
        "happiness",
        "explains",
        "commitment",
        "utilitarianism",
        "early",
        "chapter",
        "ii",
        "utilitarianism",
        "creed",
        "accepts",
        "foundation",
        "moral",
        "utility",
        "greatest",
        "happiness",
        "principle",
        "hold",
        "action",
        "right",
        "proportion",
        "tend",
        "promote",
        "happiness",
        "wrong",
        "tend",
        "produce",
        "reverse",
        "happiness",
        "happiness",
        "intended",
        "pleasure",
        "absence",
        "pain",
        "unhappiness",
        "pain",
        "privation",
        "pleasure",
        "ii",
        "also",
        "see",
        "ii",
        "famous",
        "passage",
        "sometimes",
        "called",
        "proportionality",
        "doctrine",
        "sound",
        "like",
        "bentham",
        "first",
        "sentence",
        "appears",
        "endorse",
        "utilitarianism",
        "second",
        "sentence",
        "appears",
        "endorse",
        "hedonistic",
        "conception",
        "utilitarianism",
        "hedonism",
        "implies",
        "mental",
        "state",
        "pleasure",
        "thing",
        "intrinsic",
        "value",
        "mental",
        "state",
        "pain",
        "intrinsic",
        "evil",
        "thing",
        "extrinsic",
        "value",
        "value",
        "insofar",
        "bring",
        "mediately",
        "directly",
        "intrinsic",
        "value",
        "disvalue",
        "follows",
        "action",
        "activity",
        "etc",
        "extrinsic",
        "value",
        "would",
        "seem",
        "value",
        "depend",
        "entirely",
        "upon",
        "quantity",
        "pleasure",
        "produce",
        "quantity",
        "function",
        "number",
        "pleasure",
        "intensity",
        "duration",
        "would",
        "mean",
        "one",
        "kind",
        "activity",
        "pursuit",
        "intrinsically",
        "better",
        "another",
        "correctly",
        "value",
        "one",
        "another",
        "must",
        "first",
        "produce",
        "numerous",
        "intense",
        "durable",
        "pleasure",
        "mill",
        "worry",
        "reject",
        "hedonism",
        "theory",
        "value",
        "happiness",
        "fit",
        "swine",
        "ii",
        "particular",
        "worry",
        "opponent",
        "assume",
        "utilitarianism",
        "favor",
        "sensual",
        "voluptuary",
        "pursuit",
        "eg",
        "pushpin",
        "higher",
        "nobler",
        "pursuit",
        "eg",
        "poetry",
        "mill",
        "attempt",
        "reassure",
        "reader",
        "utilitarian",
        "defend",
        "superiority",
        "higher",
        "pleasure",
        "begin",
        "noting",
        "fairly",
        "obvious",
        "reference",
        "bentham",
        "hedonist",
        "defend",
        "higher",
        "pursuit",
        "extrinsically",
        "superior",
        "ground",
        "produce",
        "pleasure",
        "ii",
        "mill",
        "think",
        "benthamite",
        "defend",
        "extrinsic",
        "superiority",
        "higher",
        "pleasure",
        "content",
        "defense",
        "superiority",
        "mill",
        "insists",
        "greater",
        "value",
        "intellectual",
        "pleasure",
        "put",
        "secure",
        "footing",
        "ii",
        "explains",
        "higher",
        "pleasure",
        "link",
        "preference",
        "competent",
        "judge",
        "following",
        "manner",
        "asked",
        "mean",
        "difference",
        "quality",
        "pleasure",
        "make",
        "one",
        "pleasure",
        "valuable",
        "another",
        "merely",
        "pleasure",
        "except",
        "greater",
        "amount",
        "one",
        "possible",
        "answer",
        "one",
        "two",
        "competently",
        "acquainted",
        "placed",
        "far",
        "prefer",
        "even",
        "though",
        "knowing",
        "attended",
        "greater",
        "amount",
        "discontent",
        "would",
        "resign",
        "quantity",
        "pleasure",
        "nature",
        "capable",
        "justified",
        "ascribing",
        "preferred",
        "enjoyment",
        "superiority",
        "quality",
        "far",
        "outweighing",
        "quantity",
        "render",
        "comparison",
        "small",
        "account",
        "ii",
        "indeed",
        "mill",
        "seems",
        "claim",
        "higher",
        "pleasure",
        "intrinsically",
        "valuable",
        "lower",
        "one",
        "discontinuously",
        "better",
        "ii",
        "certainly",
        "go",
        "beyond",
        "bentham",
        "quantitative",
        "hedonism",
        "fact",
        "even",
        "clear",
        "mill",
        "higher",
        "pleasure",
        "doctrine",
        "consistent",
        "hedonism",
        "mill",
        "position",
        "hard",
        "pin",
        "part",
        "us",
        "term",
        "pleasure",
        "sometimes",
        "refer",
        "certain",
        "kind",
        "mental",
        "state",
        "sensation",
        "time",
        "refer",
        "b",
        "nonmental",
        "item",
        "action",
        "activity",
        "pursuit",
        "cause",
        "pleasurable",
        "mental",
        "state",
        "consider",
        "way",
        "someone",
        "might",
        "say",
        "surfing",
        "greatest",
        "pleasure",
        "might",
        "call",
        "type",
        "pleasure",
        "subjective",
        "pleasure",
        "b",
        "type",
        "pleasure",
        "objective",
        "pleasure",
        "unclear",
        "whether",
        "mill",
        "higher",
        "pleasure",
        "subjective",
        "pleasure",
        "objective",
        "pleasure",
        "discussion",
        "concern",
        "activity",
        "employ",
        "higher",
        "faculty",
        "unclear",
        "whether",
        "higher",
        "pleasure",
        "refer",
        "mental",
        "state",
        "sensation",
        "caused",
        "higher",
        "activity",
        "activity",
        "might",
        "seem",
        "clear",
        "interpret",
        "higher",
        "pleasure",
        "subjective",
        "pleasure",
        "mill",
        "told",
        "u",
        "hedonist",
        "happiness",
        "radical",
        "may",
        "always",
        "clear",
        "kind",
        "mental",
        "state",
        "sensation",
        "take",
        "pleasure",
        "seems",
        "clear",
        "conceive",
        "kind",
        "mental",
        "state",
        "sensation",
        "like",
        "bentham",
        "appear",
        "conceive",
        "pleasure",
        "sensation",
        "distinctive",
        "kind",
        "qualitative",
        "feel",
        "others",
        "perhaps",
        "despairing",
        "finding",
        "qualia",
        "common",
        "disparate",
        "kind",
        "pleasure",
        "tend",
        "understand",
        "pleasure",
        "functionally",
        "mental",
        "state",
        "sensation",
        "subject",
        "whose",
        "state",
        "prefers",
        "disposed",
        "prolong",
        "james",
        "mill",
        "held",
        "something",
        "like",
        "functional",
        "conception",
        "pleasure",
        "analysis",
        "phenomenon",
        "human",
        "mind",
        "ii",
        "p",
        "pleasure",
        "understood",
        "functionally",
        "could",
        "different",
        "qualitative",
        "feel",
        "yet",
        "still",
        "pleasure",
        "insofar",
        "mill",
        "discus",
        "subjective",
        "pleasure",
        "clear",
        "either",
        "conception",
        "pleasure",
        "favor",
        "nonetheless",
        "may",
        "seem",
        "natural",
        "assume",
        "hedonist",
        "conceives",
        "pleasure",
        "subjective",
        "pleasure",
        "according",
        "interpretation",
        "mill",
        "focusing",
        "pleasurable",
        "sensation",
        "distinguishing",
        "higher",
        "lower",
        "pleasure",
        "reference",
        "cause",
        "higher",
        "pleasure",
        "pleasure",
        "caused",
        "exercise",
        "higher",
        "faculty",
        "whereas",
        "lower",
        "pleasure",
        "pleasure",
        "caused",
        "exercise",
        "lower",
        "capacity",
        "interpretation",
        "higher",
        "pleasure",
        "doctrine",
        "problematic",
        "one",
        "concern",
        "raised",
        "henry",
        "sidgwick",
        "outline",
        "hedonism",
        "committed",
        "idea",
        "one",
        "pleasure",
        "better",
        "another",
        "pleasurable",
        "sound",
        "like",
        "quantitative",
        "relation",
        "higher",
        "pleasure",
        "better",
        "lower",
        "pleasure",
        "involve",
        "greater",
        "quantity",
        "pleasure",
        "squared",
        "hedonism",
        "one",
        "answer",
        "mill",
        "think",
        "two",
        "factor",
        "affecting",
        "magnitude",
        "pleasure",
        "quantity",
        "determined",
        "intensity",
        "duration",
        "quality",
        "kind",
        "proposal",
        "one",
        "pleasure",
        "greater",
        "another",
        "independently",
        "quantity",
        "virtue",
        "quality",
        "sturgeon",
        "distinguish",
        "among",
        "pleasure",
        "caused",
        "exercise",
        "higher",
        "faculty",
        "caused",
        "exercise",
        "lower",
        "faculty",
        "difference",
        "affect",
        "pleasurableness",
        "state",
        "question",
        "mill",
        "hold",
        "preference",
        "functional",
        "conception",
        "pleasure",
        "according",
        "pleasure",
        "mental",
        "state",
        "subject",
        "prefers",
        "thing",
        "equal",
        "would",
        "prolong",
        "perhaps",
        "could",
        "claim",
        "pleasure",
        "categorically",
        "preferred",
        "competent",
        "judge",
        "pleasurable",
        "pleasure",
        "however",
        "say",
        "competent",
        "judge",
        "preference",
        "higher",
        "pleasure",
        "even",
        "though",
        "knowing",
        "attended",
        "greater",
        "amount",
        "discontent",
        "u",
        "ii",
        "suggests",
        "higher",
        "pleasure",
        "may",
        "pleasurable",
        "even",
        "competent",
        "judge",
        "case",
        "clear",
        "could",
        "infer",
        "pleasurable",
        "someone",
        "competent",
        "judge",
        "pleasurable",
        "someone",
        "even",
        "distinguish",
        "higher",
        "lower",
        "pleasure",
        "according",
        "cause",
        "remains",
        "unclear",
        "hedonist",
        "explain",
        "higher",
        "pleasure",
        "inherently",
        "pleasurable",
        "related",
        "concern",
        "interpretation",
        "higher",
        "pleasure",
        "doctrine",
        "make",
        "sense",
        "mill",
        "contrast",
        "happiness",
        "contentment",
        "satisfaction",
        "explaining",
        "higher",
        "pleasure",
        "term",
        "categorical",
        "preference",
        "competent",
        "judge",
        "insisting",
        "competent",
        "judge",
        "would",
        "trade",
        "amount",
        "lower",
        "pleasure",
        "higher",
        "pleasure",
        "claim",
        "preference",
        "sacrifice",
        "contentment",
        "satisfaction",
        "happiness",
        "ii",
        "mill",
        "say",
        "preference",
        "competent",
        "judge",
        "one",
        "kind",
        "contentment",
        "another",
        "socrates",
        "contentment",
        "pig",
        "fool",
        "virtue",
        "enjoying",
        "different",
        "kind",
        "contentment",
        "instead",
        "contrast",
        "happiness",
        "contentment",
        "implies",
        "socrates",
        "happier",
        "fool",
        "even",
        "le",
        "contented",
        "another",
        "problem",
        "reading",
        "higher",
        "pleasure",
        "doctrine",
        "mill",
        "frequently",
        "understands",
        "higher",
        "pleasure",
        "objective",
        "pleasure",
        "first",
        "independent",
        "evidence",
        "mill",
        "sometimes",
        "us",
        "word",
        "pleasure",
        "refer",
        "objective",
        "pleasure",
        "instance",
        "second",
        "part",
        "proof",
        "principle",
        "utility",
        "chapter",
        "iv",
        "mill",
        "count",
        "music",
        "virtue",
        "health",
        "pleasure",
        "iv",
        "seem",
        "objective",
        "pleasure",
        "elsewhere",
        "discussion",
        "higher",
        "pleasure",
        "chapter",
        "ii",
        "mill",
        "equates",
        "person",
        "pleasure",
        "indulgence",
        "ii",
        "mode",
        "existence",
        "ii",
        "seems",
        "discussing",
        "objective",
        "pleasure",
        "mill",
        "introduces",
        "higher",
        "pleasure",
        "ii",
        "clearly",
        "discussing",
        "among",
        "thing",
        "intellectual",
        "pursuit",
        "activity",
        "claim",
        "arguing",
        "quantitative",
        "hedonist",
        "find",
        "extrinsically",
        "valuable",
        "also",
        "intrinsically",
        "valuable",
        "ii",
        "quantitative",
        "hedonist",
        "defends",
        "extrinsically",
        "valuable",
        "complex",
        "activity",
        "pursuit",
        "writing",
        "reading",
        "poetry",
        "mental",
        "state",
        "mill",
        "claim",
        "thing",
        "intrinsically",
        "extrinsically",
        "valuable",
        "higher",
        "pleasure",
        "would",
        "appear",
        "intellectual",
        "activity",
        "pursuit",
        "rather",
        "mental",
        "state",
        "finally",
        "paragraph",
        "mill",
        "link",
        "preference",
        "competent",
        "judge",
        "greater",
        "value",
        "object",
        "preference",
        "among",
        "thing",
        "mill",
        "think",
        "competent",
        "judge",
        "would",
        "prefer",
        "activity",
        "pursuit",
        "unquestionable",
        "fact",
        "equally",
        "acquainted",
        "equally",
        "capable",
        "appreciating",
        "enjoying",
        "give",
        "marked",
        "preference",
        "manner",
        "existence",
        "employ",
        "higher",
        "faculty",
        "ii",
        "emphasis",
        "added",
        "mill",
        "identifying",
        "higher",
        "pleasure",
        "activity",
        "pursuit",
        "exercise",
        "higher",
        "capacity",
        "insofar",
        "mill",
        "higher",
        "pleasure",
        "doctrine",
        "concern",
        "objective",
        "pleasure",
        "appears",
        "antihedonistic",
        "two",
        "reason",
        "first",
        "claim",
        "intellectual",
        "pursuit",
        "value",
        "proportion",
        "amount",
        "contentment",
        "pleasure",
        "mental",
        "state",
        "produce",
        "would",
        "contradict",
        "traditional",
        "hedonist",
        "claim",
        "extrinsic",
        "value",
        "activity",
        "proportional",
        "pleasurableness",
        "second",
        "mill",
        "claim",
        "activity",
        "intrinsically",
        "valuable",
        "lower",
        "pursuit",
        "ii",
        "traditional",
        "hedonist",
        "claim",
        "mental",
        "state",
        "pleasure",
        "one",
        "intrinsic",
        "good",
        "activity",
        "extrinsic",
        "value",
        "activity",
        "intrinsically",
        "valuable",
        "another",
        "whichever",
        "way",
        "read",
        "mill",
        "higher",
        "pleasure",
        "doctrine",
        "hard",
        "square",
        "doctrine",
        "hedonism",
        "traditionally",
        "formulated",
        "apparent",
        "inconsistency",
        "noted",
        "many",
        "mill",
        "subsequent",
        "critic",
        "including",
        "sidgwick",
        "method",
        "n",
        "fh",
        "bradley",
        "ethical",
        "study",
        "th",
        "green",
        "prolegomenon",
        "ethic",
        "ge",
        "moore",
        "principia",
        "ethica",
        "green",
        "discussion",
        "especially",
        "instructive",
        "focus",
        "mill",
        "explanation",
        "preference",
        "competent",
        "judge",
        "mode",
        "existence",
        "employ",
        "higher",
        "faculty",
        "mill",
        "explains",
        "fact",
        "competent",
        "judge",
        "prefer",
        "activity",
        "exercise",
        "rational",
        "capacity",
        "appeal",
        "sense",
        "dignity",
        "may",
        "give",
        "explanation",
        "please",
        "unwillingness",
        "part",
        "competent",
        "judge",
        "ever",
        "sink",
        "feel",
        "lower",
        "grade",
        "existence",
        "but",
        "appropriate",
        "appellation",
        "sense",
        "dignity",
        "human",
        "being",
        "posse",
        "one",
        "form",
        "though",
        "mean",
        "exact",
        "proportion",
        "higher",
        "faculty",
        "u",
        "ii",
        "green",
        "think",
        "dignity",
        "passage",
        "undermines",
        "hedonism",
        "prolegomenon",
        "claiming",
        "dignity",
        "life",
        "higher",
        "capacity",
        "exercised",
        "competent",
        "judge",
        "sense",
        "dignity",
        "explains",
        "preference",
        "activity",
        "mill",
        "implies",
        "preference",
        "reflect",
        "judgment",
        "value",
        "activity",
        "independently",
        "object",
        "desire",
        "source",
        "pleasure",
        "take",
        "pleasure",
        "activity",
        "valuable",
        "valuable",
        "pleasurable",
        "see",
        "green",
        "point",
        "think",
        "competent",
        "judge",
        "demigods",
        "dignity",
        "passage",
        "mill",
        "making",
        "sort",
        "point",
        "socrates",
        "discussing",
        "euthyphro",
        "definition",
        "piety",
        "god",
        "love",
        "euthyphro",
        "cb",
        "socrates",
        "thought",
        "god",
        "attitude",
        "would",
        "principled",
        "arbitrary",
        "meant",
        "love",
        "presupposed",
        "rather",
        "explained",
        "piety",
        "justice",
        "similarly",
        "mill",
        "think",
        "preference",
        "competent",
        "judge",
        "arbitrary",
        "principled",
        "reflecting",
        "sense",
        "value",
        "higher",
        "capacity",
        "would",
        "make",
        "doctrine",
        "higher",
        "pleasure",
        "fundamentally",
        "antihedonistic",
        "insofar",
        "explains",
        "superiority",
        "higher",
        "activity",
        "term",
        "pleasure",
        "produce",
        "rather",
        "term",
        "dignity",
        "value",
        "kind",
        "life",
        "characterized",
        "exercise",
        "higher",
        "capacity",
        "sensitivity",
        "dignity",
        "life",
        "explains",
        "categorical",
        "preference",
        "competent",
        "judge",
        "supposedly",
        "higher",
        "activity"
    ]
}