{
    "main_text": "Mind and Metaphysics || Idealism\n6.4 Idealism \n\n\nThe Yogācāra school, which is associated with the works of\nthe half-brothers Asaṅga and Vasubandhu, its founders and\nprincipal exponents, is often identified by later Buddhist\ndoxographers as the Mind-only or Cognition-only School\n(Cittamātra or\nVijñaptimātra), on account of its internalist \nepistemology. In texts such as Vasubandhu's Twenty Verses: A \nDemonstration on Existence of Consciousness Only \n(Viṃśatikā \nVijñaptimātratāsiddhi; hereafter VVS) and \nDignāga's Investigation of the Cognitive Support \n(Ālambanaparīkṣā; and its \nVṛtti; hereafter APV) we are presented with a \nmetaphysical picture of cognitive awareness or consciousness as the \nonly ultimately existing reality. \n\n\nIn the Twenty Verses, Vasubandhu offers an elaborate defense\nof idealism. His arguments may be summarized as follows: Because\nnon-existing entities can be consciously apprehended, consciousness\nmust have ontological priority (VVS I, 1). The typical realist\nobjection to an assertion of this sort concerns the causal function of\nperception: indeed, if mental content can be said to consciously arise\nwithout any reference to external objects, then why does it arise at a\nspecific time and place and not everywhere and at any given moment?\n(VVS ad 2) In his response, Vasubandhu appeals to the dream\nargument: objects in a dream appear as having determined\nspatio-temporal coordinates without there being any correspondence to\nexternal realities. As he explains, dream objects arise in dependence\nupon the transformation of residual impressions\n(vāsanās), stock examples of which include the\nphenomenon of nocturnal emission of semen (VVS\nad 3–4). Similarly, to the objection that cognition \nmust have a basis (āyatana) for its arising, Vasubandhu\nresponds by appealing to the theory of seeds in the mental stream: \nthe physical object and the cognitive faculty which together provide \nthe basis for the arising of a particular type of cognitive awareness\nare now seen as an object-oriented cognitive aspect and its internal \nrepresentation. It only seems as though a patch of color and the \nvisual system which processes it are the basis for color qualia. In \nreality, claims Vasubandhu, it is the residual traces (viz., the \ntransforming seeds) in the mental stream that take the form of \ntangible object and tactile sense (VVS ad 9).\n\n\nA stronger objection, however, pertains to certain aspects of \ndoctrine: if consciousness has the capacity to appear as bearing the \ncharacteristics of material objects, then what purpose do canonical \nteachings about the material bases for the arising of consciousness \nserve? The answer to the second objection is twofold: first, \nVasubandhu appeals to the hermeneutical strategies of Buddhist \nschools such as Madhyamaka and Yogācāra, which distinguish \nbetween direct and indirect meaning (thus interpreting earlier \nteachings as having only an implied meaning (neyārtha),\nwhich is only made explicit (nītārtha) in the \nlatter texts of the Mahāyāna, and in particular of the \nYogācāra tradition); second, Vasubandhu, relies on the dual\naspect theory of cognition with its internalist perspective (which \nregards the appearance of objectual aspects in cognition as the \nresult of residual traces stemming from the receptacle consciousness)\n(see VVS ad 10).\n\n\nHowever, Vasubandhu's most compelling proof for idealism appeals to \nthe method of mereological reduction: wholes, being merely \ncollections of minimal parts, do not actually exist as perceived. But\nwholes, which are extended objects, must necessarily be made of \nparts, the ultimate building blocks of which are the atoms. And since\natoms, conceived as partless point-instant are ultimately \ninsubstantial, the realist argument for the existence of material \nobjects as conglomerates of parts must be false (VVS ad \n11–14; for detailed discussion of some of these arguments, see \nKapstein 1988; Tola & Dragonetti 2004, 98–110; Gold 2006).\n\n\nVasubandhu's refutation of the reality (and causal efficacy) of \nexternal objects as spatio-temporal entities raises some \nimportant mereological issues and has a number of consequences for \nperception:\n\nFor an external entity to be an object of cognition it must (i)\neither be a whole (avayavin) made of parts but be more than\nits parts put together, (ii) or be a non-combined set of contiguous\natoms, (iii) or be a combined set of cohesive atoms.\nVasubandhu rejects both wholes and combined sets (whether cohesive\nor merely contiguous). Wholes are rejected by appealing to the\nBuddhist reductionist principle which says that only the component\nparts of an entity are real (aggregated wholes, on this view, are\nnot).\nThe rejection of combined sets rests on the refutation of\nVaibhāṣika atomism. For the Vaibhāṣika, who are\nrealists, atoms are both indivisible and also capable of aggregation\n(specifically, in sets of seven atoms, with one at the center, and the\nother six arranged so as to correspond to the six cardinal points)\n(see AKBh ad I, 43).\nIn his refutation of atomism, Vasubandhu explains that for\ncombinations of atoms to form partite aggregated entities, the atoms\nwould have to be contiguous, and as contiguous atoms would be\nconfounded with one another. Two or more atoms in contact would appear\nto have parts, which is by definition impossible (since atoms are\npartless entities) (see AKBh ad I, 43). Thus, connection\namong atoms implies loss of indivisibility, and since atoms by\ndefinition cannot have (connection enabling) parts, so too aggregated\nwholes must lack connection among their constitutive parts (it is\nassumed that the connecting relation is transitive).\nFor Vasubandhu, thus, an ontology of impartite atoms cannot\nexplain connection. In other words, the reduction of compounded\nentities to their component parts, and of those parts to their own\npars, is not logically supported by atomism. Thus, Vasubandhu\nconcludes (VVS ad 11) that admitting the existence of\npartless entities as the ultimate building blocks of reality would\nmake it in effect impossible to explain the specific natures of\naggregated phenomena. Consequently, only partite entities\nexist.\nOther objections to atomism include the argument from mutual\nobstruction: lacking parts, an atom could obstruct other atoms from\nimpinging on it, leading to the unwarranted conclusion that all atoms\ncould occupy the same region of space. \nThus, neither composite entities made of indivisible parts, nor\nthe indivisible parts themselves can provide a basis for cognitive\nawareness. Physical objects (the collection of mid-size dry goods that\npopulate the realist's ontology) cannot exist as perceived and must\ntherefore be a product of conceptual elaboration\n(vikalpa, kalpanā).\nSince atoms either alone or combined cannot provide a basis for\ncognitive awareness, the perception of aggregated entities must be the\nproduct of imagination (parikalpa).\nThe division of perception into direct (nirvikalpa, a\nbare awareness without any discrimination) and indirect\n(savikalpa, what we ordinarily call a percept, involving some\nlevel of cognitive determination of the object), helps clarify\nVasubandhu's argument: at the level of bare awareness there is no\nperception of composite entities; at the level of discriminating\nawareness perception reveals a world of objects as wholes with\nspecific properties. Indirect perception, arises at a moment when the\nexternal cause that occasioned the perceptual experience is not longer\npresent. \nSo by invoking the momentary nature of phenomena, and the two-tier\nprocess of perception, Vasubandhu is able to demonstrate that the\ndeterminate objects of awareness in fact lack an external cognitive\nsupport.\n\n\n\nIn his Investigation of the Cognitive Support Dignāga\ntakes up, as the title suggests, one of the specific issue debated by\nVasubandhu in his Twenty Verses: what exactly should count as\nan object of cognition? Dignāga's definition of the cognitive\nsupport invokes the principle of the concomitance of cause and effect\n(kāryakāraṇabhāva). Thus, for an object\nto count as a support (ālambana) for cognitive awareness\nit must (i) produce a cognition, and (ii) that cognition must take the\nform of the object (see APV ad Iad). In large measure\nDignāga follows Vasubandhu's line of argumentation in his\nrefutation of the realistic atomism of the Vaibhāṣikas (and\nof the Nyāya-Vaiśeṣika tradition). His innovations\nconsist mainly in appealing to the principle of the coexistence of\ncause and effect and to the Yogācāra theory of mental\naspects. As proof that internal aspects, which provide a basis for\ncognition, arise simultaneously with cognition itself, Dignāga\ncites the principle of the concomitance of cause and effect\n(kāryakāraṇabhāva): although the causal\nrelation is understood sequentially, by virtue of the necessary\ndependence of cause and effect, whenever a cause is present its effect\nmust also be present. The theory of cognitive aspects serves to\nfurther demonstrate that it is the appearance of an internally\ncognizable aspect that is the actual cognitive support. Because\ncognitions which arise taking the form of an apparently external\nobject are the determining factor for the arsing of subsequent\ncognitions, the external object (say, a visible entity) and the sense\nfaculty (visual sense) are merely projective aspects of this initial\naspectual cognition (APV ad VII b). \n\n\nThus, Dignāga effectively argues that cognition arises bearing \ntwo aspects: that of the object and that of the cognition itself, \nsuch that cognition and cognized object are not different: they are \nboth manifestations of cognitive awareness itself.\n\n\nWhether the Yogācāra ontology of mind is idealist or can be\ninterpreted as a type of phenomenalism depends of course on how one \ninterprets one of its key technical concepts: the \nvijñapti-mātra (lit. ‘cognition only’\nor ‘nothing but cognition.’). May (1971) and Schmithausen\n(1973) are among the strongest proponents of the idealist\ninterpretation. Schmithausen in particular claims that the idealist\nformulation arose not out of purely theoretical or doctrinal concerns,\nbut rather as a generalization based on the insights derived from\nmeditative practice. In an innovative metaphilosophical essay on\nWestern idealism as seen through Yogācāra eyes, Garfield\n(1998) argues that idealism is a contrastive ontology, in which mind\nand mental constituents are assigned a fundamental reality that is\ndenied to external objects. Thus, while Berkeley, Kant, Hegel,\nSchopenhauer, and Bradley may hold different views on the nature of\nmind, they all presumably agree on its ontological primacy. Likewise,\nclaims Garfield, regardless of how Yogācārins like\nVasubandhu conceive of the mind, to the extent that they ascribe to it\nany sort of ontological primacy over external objects, they are\nidealists in this contrastive ontological sense.\n\n\nWayman (1965) is perhaps the first scholar to have challenged the\nidealist interpretation of the Yogācāra notion\nof vijñapti-mātra routinely advanced by both\nhistorical opponents, such as the Mādhyamikas and orthodox\nBrahmanical philosophers, as well as by early generations of Buddhist\nscholars. His argument is that Yogācārins like Vasubandhu do\nnot really deny the reality of external objects; rather, they simply\ncontent that cognitive activity can arise even in the absence of an\nexternal object. Wayman's critique (reprised in Wayman 1996) has set\nthe platform for an entire generation of scholars who have argued\nagainst the idealist interpretation of Yogācāra ontology\n(see Kochumutton 1982; Kalupahana 1987; Powers 1996; Lusthaus 2002;\nDunne 2004). \n\n\nThere is no general consensus at present on how best to\nrepresent the metaphysical position of the Yogācāras:\nproposals vary from realistic pluralism, to pragmatism, neutral\nmonism, epistemic idealism, to a realist phenomenology on the model of\nHusserl and Merleau-Ponty.  Alternative interpretations present the\nYogācāra school as a system\noutlining a “therapeutic course of action (ācāra)\nrooted in meditation (yoga)” (Anacker 1984, 194) or as providing\nan account of the “unconscious structuring of experience”\n(Waldron 2002; 2003: xi).\n",
    "section_title": "6.4 Idealism",
    "entry_title": "Mind in Indian Buddhist Philosophy",
    "hierarchy_title": "Mind in Indian Buddhist Philosophy || Mind and Metaphysics || Idealism",
    "tokenized_text": [
        "mind",
        "metaphysics",
        "idealism",
        "idealism",
        "yogācāra",
        "school",
        "associated",
        "work",
        "halfbrother",
        "asaṅga",
        "vasubandhu",
        "founder",
        "principal",
        "exponent",
        "often",
        "identified",
        "later",
        "buddhist",
        "doxographers",
        "mindonly",
        "cognitiononly",
        "school",
        "cittamātra",
        "vijñaptimātra",
        "account",
        "internalist",
        "epistemology",
        "text",
        "vasubandhu",
        "s",
        "twenty",
        "verse",
        "demonstration",
        "existence",
        "consciousness",
        "viṃśatikā",
        "vijñaptimātratāsiddhi",
        "hereafter",
        "vvs",
        "dignāga",
        "s",
        "investigation",
        "cognitive",
        "support",
        "ālambanaparīkṣā",
        "vṛtti",
        "hereafter",
        "apv",
        "presented",
        "metaphysical",
        "picture",
        "cognitive",
        "awareness",
        "consciousness",
        "ultimately",
        "existing",
        "reality",
        "twenty",
        "verse",
        "vasubandhu",
        "offer",
        "elaborate",
        "defense",
        "idealism",
        "argument",
        "may",
        "summarized",
        "follows",
        "nonexisting",
        "entity",
        "consciously",
        "apprehended",
        "consciousness",
        "must",
        "ontological",
        "priority",
        "vvs",
        "typical",
        "realist",
        "objection",
        "assertion",
        "sort",
        "concern",
        "causal",
        "function",
        "perception",
        "indeed",
        "mental",
        "content",
        "said",
        "consciously",
        "arise",
        "without",
        "reference",
        "external",
        "object",
        "arise",
        "specific",
        "time",
        "place",
        "everywhere",
        "given",
        "moment",
        "vvs",
        "ad",
        "response",
        "vasubandhu",
        "appeal",
        "dream",
        "argument",
        "object",
        "dream",
        "appear",
        "determined",
        "spatiotemporal",
        "coordinate",
        "without",
        "correspondence",
        "external",
        "reality",
        "explains",
        "dream",
        "object",
        "arise",
        "dependence",
        "upon",
        "transformation",
        "residual",
        "impression",
        "vāsanās",
        "stock",
        "example",
        "include",
        "phenomenon",
        "nocturnal",
        "emission",
        "semen",
        "vvs",
        "ad",
        "similarly",
        "objection",
        "cognition",
        "must",
        "basis",
        "āyatana",
        "arising",
        "vasubandhu",
        "responds",
        "appealing",
        "theory",
        "seed",
        "mental",
        "stream",
        "physical",
        "object",
        "cognitive",
        "faculty",
        "together",
        "provide",
        "basis",
        "arising",
        "particular",
        "type",
        "cognitive",
        "awareness",
        "seen",
        "objectoriented",
        "cognitive",
        "aspect",
        "internal",
        "representation",
        "seems",
        "though",
        "patch",
        "color",
        "visual",
        "system",
        "process",
        "basis",
        "color",
        "qualia",
        "reality",
        "claim",
        "vasubandhu",
        "residual",
        "trace",
        "viz",
        "transforming",
        "seed",
        "mental",
        "stream",
        "take",
        "form",
        "tangible",
        "object",
        "tactile",
        "sense",
        "vvs",
        "ad",
        "stronger",
        "objection",
        "however",
        "pertains",
        "certain",
        "aspect",
        "doctrine",
        "consciousness",
        "capacity",
        "appear",
        "bearing",
        "characteristic",
        "material",
        "object",
        "purpose",
        "canonical",
        "teaching",
        "material",
        "base",
        "arising",
        "consciousness",
        "serve",
        "answer",
        "second",
        "objection",
        "twofold",
        "first",
        "vasubandhu",
        "appeal",
        "hermeneutical",
        "strategy",
        "buddhist",
        "school",
        "madhyamaka",
        "yogācāra",
        "distinguish",
        "direct",
        "indirect",
        "meaning",
        "thus",
        "interpreting",
        "earlier",
        "teaching",
        "implied",
        "meaning",
        "neyārtha",
        "made",
        "explicit",
        "nītārtha",
        "latter",
        "text",
        "mahāyāna",
        "particular",
        "yogācāra",
        "tradition",
        "second",
        "vasubandhu",
        "relies",
        "dual",
        "aspect",
        "theory",
        "cognition",
        "internalist",
        "perspective",
        "regard",
        "appearance",
        "objectual",
        "aspect",
        "cognition",
        "result",
        "residual",
        "trace",
        "stemming",
        "receptacle",
        "consciousness",
        "see",
        "vvs",
        "ad",
        "however",
        "vasubandhu",
        "s",
        "compelling",
        "proof",
        "idealism",
        "appeal",
        "method",
        "mereological",
        "reduction",
        "whole",
        "merely",
        "collection",
        "minimal",
        "part",
        "actually",
        "exist",
        "perceived",
        "whole",
        "extended",
        "object",
        "must",
        "necessarily",
        "made",
        "part",
        "ultimate",
        "building",
        "block",
        "atom",
        "since",
        "atom",
        "conceived",
        "partless",
        "pointinstant",
        "ultimately",
        "insubstantial",
        "realist",
        "argument",
        "existence",
        "material",
        "object",
        "conglomerate",
        "part",
        "must",
        "false",
        "vvs",
        "ad",
        "detailed",
        "discussion",
        "argument",
        "see",
        "kapstein",
        "tola",
        "dragonetti",
        "gold",
        "vasubandhu",
        "s",
        "refutation",
        "reality",
        "causal",
        "efficacy",
        "external",
        "object",
        "spatiotemporal",
        "entity",
        "raise",
        "important",
        "mereological",
        "issue",
        "number",
        "consequence",
        "perception",
        "external",
        "entity",
        "object",
        "cognition",
        "must",
        "either",
        "whole",
        "avayavin",
        "made",
        "part",
        "part",
        "put",
        "together",
        "ii",
        "noncombined",
        "set",
        "contiguous",
        "atom",
        "iii",
        "combined",
        "set",
        "cohesive",
        "atom",
        "vasubandhu",
        "reject",
        "whole",
        "combined",
        "set",
        "whether",
        "cohesive",
        "merely",
        "contiguous",
        "whole",
        "rejected",
        "appealing",
        "buddhist",
        "reductionist",
        "principle",
        "say",
        "component",
        "part",
        "entity",
        "real",
        "aggregated",
        "whole",
        "view",
        "rejection",
        "combined",
        "set",
        "rest",
        "refutation",
        "vaibhāṣika",
        "atomism",
        "vaibhāṣika",
        "realist",
        "atom",
        "indivisible",
        "also",
        "capable",
        "aggregation",
        "specifically",
        "set",
        "seven",
        "atom",
        "one",
        "center",
        "six",
        "arranged",
        "correspond",
        "six",
        "cardinal",
        "point",
        "see",
        "akbh",
        "ad",
        "refutation",
        "atomism",
        "vasubandhu",
        "explains",
        "combination",
        "atom",
        "form",
        "partite",
        "aggregated",
        "entity",
        "atom",
        "would",
        "contiguous",
        "contiguous",
        "atom",
        "would",
        "confounded",
        "one",
        "another",
        "two",
        "atom",
        "contact",
        "would",
        "appear",
        "part",
        "definition",
        "impossible",
        "since",
        "atom",
        "partless",
        "entity",
        "see",
        "akbh",
        "ad",
        "thus",
        "connection",
        "among",
        "atom",
        "implies",
        "loss",
        "indivisibility",
        "since",
        "atom",
        "definition",
        "connection",
        "enabling",
        "part",
        "aggregated",
        "whole",
        "must",
        "lack",
        "connection",
        "among",
        "constitutive",
        "part",
        "assumed",
        "connecting",
        "relation",
        "transitive",
        "vasubandhu",
        "thus",
        "ontology",
        "impartite",
        "atom",
        "explain",
        "connection",
        "word",
        "reduction",
        "compounded",
        "entity",
        "component",
        "part",
        "part",
        "par",
        "logically",
        "supported",
        "atomism",
        "thus",
        "vasubandhu",
        "concludes",
        "vvs",
        "ad",
        "admitting",
        "existence",
        "partless",
        "entity",
        "ultimate",
        "building",
        "block",
        "reality",
        "would",
        "make",
        "effect",
        "impossible",
        "explain",
        "specific",
        "nature",
        "aggregated",
        "phenomenon",
        "consequently",
        "partite",
        "entity",
        "exist",
        "objection",
        "atomism",
        "include",
        "argument",
        "mutual",
        "obstruction",
        "lacking",
        "part",
        "atom",
        "could",
        "obstruct",
        "atom",
        "impinging",
        "leading",
        "unwarranted",
        "conclusion",
        "atom",
        "could",
        "occupy",
        "region",
        "space",
        "thus",
        "neither",
        "composite",
        "entity",
        "made",
        "indivisible",
        "part",
        "indivisible",
        "part",
        "provide",
        "basis",
        "cognitive",
        "awareness",
        "physical",
        "object",
        "collection",
        "midsize",
        "dry",
        "good",
        "populate",
        "realist",
        "s",
        "ontology",
        "exist",
        "perceived",
        "must",
        "therefore",
        "product",
        "conceptual",
        "elaboration",
        "vikalpa",
        "kalpanā",
        "since",
        "atom",
        "either",
        "alone",
        "combined",
        "provide",
        "basis",
        "cognitive",
        "awareness",
        "perception",
        "aggregated",
        "entity",
        "must",
        "product",
        "imagination",
        "parikalpa",
        "division",
        "perception",
        "direct",
        "nirvikalpa",
        "bare",
        "awareness",
        "without",
        "discrimination",
        "indirect",
        "savikalpa",
        "ordinarily",
        "call",
        "percept",
        "involving",
        "level",
        "cognitive",
        "determination",
        "object",
        "help",
        "clarify",
        "vasubandhu",
        "s",
        "argument",
        "level",
        "bare",
        "awareness",
        "perception",
        "composite",
        "entity",
        "level",
        "discriminating",
        "awareness",
        "perception",
        "reveals",
        "world",
        "object",
        "whole",
        "specific",
        "property",
        "indirect",
        "perception",
        "arises",
        "moment",
        "external",
        "cause",
        "occasioned",
        "perceptual",
        "experience",
        "longer",
        "present",
        "invoking",
        "momentary",
        "nature",
        "phenomenon",
        "twotier",
        "process",
        "perception",
        "vasubandhu",
        "able",
        "demonstrate",
        "determinate",
        "object",
        "awareness",
        "fact",
        "lack",
        "external",
        "cognitive",
        "support",
        "investigation",
        "cognitive",
        "support",
        "dignāga",
        "take",
        "title",
        "suggests",
        "one",
        "specific",
        "issue",
        "debated",
        "vasubandhu",
        "twenty",
        "verse",
        "exactly",
        "count",
        "object",
        "cognition",
        "dignāga",
        "s",
        "definition",
        "cognitive",
        "support",
        "invokes",
        "principle",
        "concomitance",
        "cause",
        "effect",
        "kāryakāraṇabhāva",
        "thus",
        "object",
        "count",
        "support",
        "ālambana",
        "cognitive",
        "awareness",
        "must",
        "produce",
        "cognition",
        "ii",
        "cognition",
        "must",
        "take",
        "form",
        "object",
        "see",
        "apv",
        "ad",
        "iad",
        "large",
        "measure",
        "dignāga",
        "follows",
        "vasubandhu",
        "s",
        "line",
        "argumentation",
        "refutation",
        "realistic",
        "atomism",
        "vaibhāṣikas",
        "nyāyavaiśeṣika",
        "tradition",
        "innovation",
        "consist",
        "mainly",
        "appealing",
        "principle",
        "coexistence",
        "cause",
        "effect",
        "yogācāra",
        "theory",
        "mental",
        "aspect",
        "proof",
        "internal",
        "aspect",
        "provide",
        "basis",
        "cognition",
        "arise",
        "simultaneously",
        "cognition",
        "dignāga",
        "cite",
        "principle",
        "concomitance",
        "cause",
        "effect",
        "kāryakāraṇabhāva",
        "although",
        "causal",
        "relation",
        "understood",
        "sequentially",
        "virtue",
        "necessary",
        "dependence",
        "cause",
        "effect",
        "whenever",
        "cause",
        "present",
        "effect",
        "must",
        "also",
        "present",
        "theory",
        "cognitive",
        "aspect",
        "serf",
        "demonstrate",
        "appearance",
        "internally",
        "cognizable",
        "aspect",
        "actual",
        "cognitive",
        "support",
        "cognition",
        "arise",
        "taking",
        "form",
        "apparently",
        "external",
        "object",
        "determining",
        "factor",
        "arsing",
        "subsequent",
        "cognition",
        "external",
        "object",
        "say",
        "visible",
        "entity",
        "sense",
        "faculty",
        "visual",
        "sense",
        "merely",
        "projective",
        "aspect",
        "initial",
        "aspectual",
        "cognition",
        "apv",
        "ad",
        "vii",
        "b",
        "thus",
        "dignāga",
        "effectively",
        "argues",
        "cognition",
        "arises",
        "bearing",
        "two",
        "aspect",
        "object",
        "cognition",
        "cognition",
        "cognized",
        "object",
        "different",
        "manifestation",
        "cognitive",
        "awareness",
        "whether",
        "yogācāra",
        "ontology",
        "mind",
        "idealist",
        "interpreted",
        "type",
        "phenomenalism",
        "depends",
        "course",
        "one",
        "interprets",
        "one",
        "key",
        "technical",
        "concept",
        "vijñaptimātra",
        "lit",
        "cognition",
        "nothing",
        "cognition",
        "may",
        "schmithausen",
        "among",
        "strongest",
        "proponent",
        "idealist",
        "interpretation",
        "schmithausen",
        "particular",
        "claim",
        "idealist",
        "formulation",
        "arose",
        "purely",
        "theoretical",
        "doctrinal",
        "concern",
        "rather",
        "generalization",
        "based",
        "insight",
        "derived",
        "meditative",
        "practice",
        "innovative",
        "metaphilosophical",
        "essay",
        "western",
        "idealism",
        "seen",
        "yogācāra",
        "eye",
        "garfield",
        "argues",
        "idealism",
        "contrastive",
        "ontology",
        "mind",
        "mental",
        "constituent",
        "assigned",
        "fundamental",
        "reality",
        "denied",
        "external",
        "object",
        "thus",
        "berkeley",
        "kant",
        "hegel",
        "schopenhauer",
        "bradley",
        "may",
        "hold",
        "different",
        "view",
        "nature",
        "mind",
        "presumably",
        "agree",
        "ontological",
        "primacy",
        "likewise",
        "claim",
        "garfield",
        "regardless",
        "yogācārins",
        "like",
        "vasubandhu",
        "conceive",
        "mind",
        "extent",
        "ascribe",
        "sort",
        "ontological",
        "primacy",
        "external",
        "object",
        "idealist",
        "contrastive",
        "ontological",
        "sense",
        "wayman",
        "perhaps",
        "first",
        "scholar",
        "challenged",
        "idealist",
        "interpretation",
        "yogācāra",
        "notion",
        "vijñaptimātra",
        "routinely",
        "advanced",
        "historical",
        "opponent",
        "mādhyamikas",
        "orthodox",
        "brahmanical",
        "philosopher",
        "well",
        "early",
        "generation",
        "buddhist",
        "scholar",
        "argument",
        "yogācārins",
        "like",
        "vasubandhu",
        "really",
        "deny",
        "reality",
        "external",
        "object",
        "rather",
        "simply",
        "content",
        "cognitive",
        "activity",
        "arise",
        "even",
        "absence",
        "external",
        "object",
        "wayman",
        "s",
        "critique",
        "reprised",
        "wayman",
        "set",
        "platform",
        "entire",
        "generation",
        "scholar",
        "argued",
        "idealist",
        "interpretation",
        "yogācāra",
        "ontology",
        "see",
        "kochumutton",
        "kalupahana",
        "power",
        "lusthaus",
        "dunne",
        "general",
        "consensus",
        "present",
        "best",
        "represent",
        "metaphysical",
        "position",
        "yogācāras",
        "proposal",
        "vary",
        "realistic",
        "pluralism",
        "pragmatism",
        "neutral",
        "monism",
        "epistemic",
        "idealism",
        "realist",
        "phenomenology",
        "model",
        "husserl",
        "merleauponty",
        "alternative",
        "interpretation",
        "present",
        "yogācāra",
        "school",
        "system",
        "outlining",
        "therapeutic",
        "course",
        "action",
        "ācāra",
        "rooted",
        "meditation",
        "yoga",
        "anacker",
        "providing",
        "account",
        "unconscious",
        "structuring",
        "experience",
        "waldron",
        "xi"
    ]
}