{
    "main_text": "Modalities in Thirteenth-Century Logical Treatises\n4. Fourteenth-Century Discussions\n\nJohn Duns Scotus’s theory of simultaneous alternatives was an\nexposition of the intensional theory of modality, some elements of\nwhich were put forward in the twelfth century. In criticizing Henry of\nGhent’s theory of theological modalities, Scotus sketched a\nmodel of ‘divine psychology’ in which certain relations\nbetween theological, metaphysical, and modal theoretical notions are\ndefined. Scotus deviated from the metaphysical tradition in which\npossibilities were founded in divine being. According to him, when God\nas an omniscient being knows all possibilities, he does not know them\nby turning first to his essence. Possibilities can be known in\nthemselves (Ord. I.35, 32). In fact they would be what they\nare even if there were no God. Scotus states that if it is assumed\nthat, per impossibile, neither God nor the world exists and\nthe proposition ‘The world is possible’ then existed, this\nproposition would be true. The actual world is possible as it is, and\nthis possibility and the possibilities of unrealized things are\nprimary metaphysical facts which are not dependent on anything else\n(Ord. I.7.1, 27; Lect. I.7, 32, I.39.1–5, 49).\nThe commentators are divided on whether Scotus speaks here about\npossibilities as such (Knuuttila 1996) or about the independence of\nformal possibilities, but not of concrete possibilities, which are\ndependent on God (Normore 2003; Hoffmann 2009).\n\nScotus calls the propositional elements of the modal domain\n‘logical possibilities’. These express things and states\nof affairs to which it is not repugnant to be. Possibilities as such\nhave no kind of existence of their own nor are they causally\nsufficient for the existence of anything, but they form the\nprecondition for everything that is or can be. God’s omniscience\ninvolves an actually infinite number of intelligibles (De primo\nprincipio IV.9, 68–69); as an object of divine knowledge, they\nreceive an intelligible or objective being. As an object of divine\nomnipotence, they receive an intentional possible being. Some of these\nare included in God’s providential plan of creation and will\nreceive an actual being. The description of how things could be at a\ncertain moment consists of compossible possibilities. Though\npossibilities necessarily are what they are, the actualization of\nnon-necessary possibilities is contingent. Since all finite things are\ncontingently actual, their alternatives are possible with respect to\nthe same time, though these are not compossible with what is actual.\nImpossibilities are incompossibilities between possibilities\n(Ord. I.35, 32, 49–51, I.38, 10, I.43, 14;\nLect. I.39.1–5, 62–65).\n\nIn criticizing extensional modal theories, Scotus redefined a\ncontingent event as follows: ‘I do not call something contingent\nbecause it is not always or necessarily the case, but because its\nopposite could be actual at the very moment when it occurs’\n(Ord. I.2.1.1–2, 86). This is a denial of the\ntraditional thesis of the necessity of the present and the temporal\nfrequency characterization of contingency. In Scotus’s modal\nsemantics, the meaning of the notion of contingency is spelt out by\nconsidering simultaneous alternatives. What is actual is contingently\nso if, instead of being actual, it could be not actual. This\nconception of simultaneous contingent alternatives is part of an\nargument that the first cause does not act necessarily. According to\nScotus, the eternal creative act of divine will is free only if it\ncould be other than it is in a real sense (Lect.\nI.39.1–5, 58). For Scotus’s modal theory, see also\nHonnefelder 1990; Vos et al. 1994; King 2001; Hoffmann 2002; the\nthesis of Scotus’s innovativeness is criticized in Pasnau\n2020.\n\nScotus’s approach to modalities brought new themes into\nphilosophical discussion. One of these was the idea of possibility as\na non-existent precondition of all being and thinking. Some of his\nfollowers and critics argued that if there were no God, there would\nnot be any kind of modality (see Hoffmann 2002, Coombs 2004; for\nBradwardine’s criticism, see Frost 2014). Scotus’s views\nwere known in the seventeenth century through the works of\nSuárez and some Scotist authors (Honnefelder 1990). In his\ndiscussion of eternal truths, Descartes criticized the classical view\nof the ontological foundation of modality as well as the Scotist\ntheory of modality and conceivability. (There are different\ninterpretations of Descartes’s view of the foundations of\nmodality and how it is related to late medieval discussions; see\nAlanen 1990; Normore 1991, 2006.)\n\nAnother influential idea was the distinction between logical and\nnatural necessities and possibilities. In Scotus’s theory,\nlogically necessary attributes and relations are attached to things in\nall those sets of compossibilities in which they occur. Against this\nbackground one could ask which of the natural invariances treated as\nnecessities in earlier natural philosophy were necessary in this\nstrong sense of necessity, and which of them were merely empirical\ngeneralizations without being logically necessary. (For a discussion\nof logical and natural necessities in the fourteenth century, see\nKnuuttila 1993, 155–160, 2001a.) Buridan distinguished between\nlogical and natural necessities in his classification of four grades\nof necessity (Dialectica 8.6.3). He used a non-extensional\nmetaphysical notion of possibility sencundum imaginationen in\nhis questions on Aristotle’s Physics (Sylla 2001), but\na frequency interpretation in his questions on Aristotle’s\nOn generation and corruption I.4 (57). This was the main\nmodal conception in the Averroist Aristotle commentaries by John of\nJandun (see, for example, his questions on Metaphysics, IX.5\n114va-b; questions on On the Heavens I.34, 21vb) and remained\na popular option until the Renaissance times (Knebel 2003). \n\nOne important branch of medieval logic developed in treatises called\nDe obligationibus dealt, roughly speaking, with how an\nincreasing set of true and false propositions might remain coherent in\na disputation. According to thirteenth-century rules, a false present\ntense statement could be accepted as a starting point only if it was\ntaken to refer to a moment of time different from the actual one.\nScotus deleted this rule, based on the Aristotelian axiom of the\nnecessity of the present, and later theories accepted the Scotist\nrevision. In this new form, obligations logic could be regarded as a\ntheory of how to analyze possible states of affairs and their mutual\nrelationships. These discussions influenced the philosophical theory\nof counterfactual conditionals (Yrjönsuuri 1994, 2001; Gelber\n2004; Dutilh Novaes 2007).\n\nIn dealing with counterfactual hypotheses of indirect proofs mentioned\nabove, Averroes and Thomas Aquinas made use of the idea of abstract\npossibilities which did not imply the idea of alternative domains. The\npossibilities of a thing can be dealt with at various levels which\ncorrespond to Porphyrian predicables. Something which is possible for\na thing as a member of a genus can be impossible for it as a member of\na species. The same holds of it as a member of a species and an\nindividuated thing. Thus humans can fly because there are other\nanimals which can fly. These abstract possibilities are impossible in\nthe sense that they cannot be actualized. Buridan heavily criticized\nthis approach from the point of view of his modal theory. He argued\nthat if a counterfactual state of affairs is possible, it can be\ncoherently imagined as actual. If something cannot be treated in this\nway, calling it possible is based on conceptual confusion. (See\nKnuuttila and Kukkonen 2011.) While Scotus, Buridan and many others\nunderstood the basic level of possibility in terms of semantic\nconsistency, Ockham wanted to preserve the link to the notion of power\nin his modal considerations, thinking that necessity is actuality plus\nimmutability, the past and the present are necessary, and Scotus was\nwrong in assuming that things could be different from how they are at\nthe very moment of their actuality (Normore 2016). \n\nInfluenced by the new ideas about logical modality, William of Ockham\n(Summa logicae), John Buridan (Tractatus de\nconsequentiis, Summulae de Dialectica) and some other\nfourteenth-century authors could formulate the principles of modal\nlogic much more completely and satisfactorily than did their\npredecessors. Questions of modal logic were discussed separately with\nrespect to modal propositions de dicto and de re;\nmodal propositions de re were further divided into two groups\ndepending on whether the subject terms refer to actual or possible\nbeings. It was thought that logicians should also analyze the\nrelationships between these readings and, furthermore, the\nconsequences having various types of modal sentences as their parts.\nOckham, Buridan and their followers largely dropped thirteenth-century\nessentialist assumptions from modal syllogistic. They regarded the\nAristotelian version as a fragmentary theory in which the distinctions\nbetween different types of fine structures were not explicated and,\nconsequently, did not try to reconstruct Aristotle’s modal\nsyllogistic as a consistent whole by one unifying analysis of modal\npropositions; they believed, like some modern commentators, that such\nreconstruction was not possible. (For fourteenth-century modal logic,\nsee King 1985; Lagerlund 2000; Thom 2003; Knuuttila 2008,\n551–567; Read 2021.)\n\nAccording to Hughes (1989), one could supply a Kripke-style possible\nworlds semantics to Buridan’s modal system. This is done in\nJohnston 2015. In discussing the conception of simultaneous\nalternativeness in fourteenth-century logic, many historians have used\nthe terminology of possible worlds semantics without the metaphysical\nand formal details of the modern theory (Yrjönsuuri 1994,\n167–174; Dutilh Novaes 2007, 90–91; Read 2021. Ockham and Buridan\nstate that the truth of ‘A white thing can be black’\ndemands the truth of ‘This can be black’ and that\n‘This can be black’ and ‘‘This is black’\nis possible’ mean the same. Compound (de dicto) and\ndivided (de re) readings do not differ at this level, but are\nseparated in dealing with universal and particular propositions. While\nOckham did not discuss unrestricted divided necessity propositions,\nBuridan took the subject terms of all quantified divided modal\npropositions as standing for possible beings if they are not\nrestricted. The truth of these propositions demands the truth of all\nor some relevant singular propositions of the type just mentioned; the\ndemonstrative pronoun is then taken to refer to the possible beings\neven though they may not exist. Buridan could have said that the\npossible truth of ‘This is X’ means that it is true in a\npossible state of affairs in which the possible being referred to by\n‘this’ occurs and that the necessary truth of ‘This\nis X’ means that it is true in all possible states of affairs in\nwhich the possible being referred to by ‘this’ occurs\n(Hughes 1989). For Buridan’s modal logic, see also Read’s\nintroduction to Treatise on Consequences (2015); Johnston\n2021. \n The new modal logic was among the most remarkable achievements of\nmedieval logic. Buridan’s modal logic was dominant in late\nmedieval times, being more systematic than that of Ockham because of\nits symmetric treatment of possibility and necessity. It was embraced\nby Marsilius of Inghen, Albert of Saxony, Jodocus Trutfetter and\nothers (Lagerlund 2000, 184–227; for the later influence of\nmedieval modal theories, see also Coombs 2003; Knebel 2003; Roncaglia\n1996, 2003; Schmutz 2006). The rise of the new modal logic was\naccompanied by elaborated theories of epistemic logic (Boh 1993) and\ndeontic logic (Knuuttila and Hallamaa 1995).\n",
    "section_title": "4. Fourteenth-Century Discussions",
    "entry_title": "Medieval Theories of Modality",
    "hierarchy_title": "Medieval Theories of Modality || Modalities in Thirteenth-Century Logical Treatises",
    "tokenized_text": [
        "modality",
        "thirteenthcentury",
        "logical",
        "treatise",
        "fourteenthcentury",
        "discussion",
        "john",
        "dun",
        "scotus",
        "theory",
        "simultaneous",
        "alternative",
        "exposition",
        "intensional",
        "theory",
        "modality",
        "element",
        "put",
        "forward",
        "twelfth",
        "century",
        "criticizing",
        "henry",
        "ghent",
        "theory",
        "theological",
        "modality",
        "scotus",
        "sketched",
        "model",
        "divine",
        "psychology",
        "certain",
        "relation",
        "theological",
        "metaphysical",
        "modal",
        "theoretical",
        "notion",
        "defined",
        "scotus",
        "deviated",
        "metaphysical",
        "tradition",
        "possibility",
        "founded",
        "divine",
        "according",
        "god",
        "omniscient",
        "know",
        "possibility",
        "know",
        "turning",
        "first",
        "essence",
        "possibility",
        "known",
        "ord",
        "i",
        "fact",
        "would",
        "even",
        "god",
        "scotus",
        "state",
        "assumed",
        "per",
        "impossibile",
        "neither",
        "god",
        "world",
        "exists",
        "proposition",
        "world",
        "possible",
        "existed",
        "proposition",
        "would",
        "true",
        "actual",
        "world",
        "possible",
        "possibility",
        "possibility",
        "unrealized",
        "thing",
        "primary",
        "metaphysical",
        "fact",
        "dependent",
        "anything",
        "else",
        "ord",
        "i",
        "lect",
        "i",
        "i",
        "commentator",
        "divided",
        "whether",
        "scotus",
        "speaks",
        "possibility",
        "knuuttila",
        "independence",
        "formal",
        "possibility",
        "concrete",
        "possibility",
        "dependent",
        "god",
        "normore",
        "hoffmann",
        "scotus",
        "call",
        "propositional",
        "element",
        "modal",
        "domain",
        "logical",
        "possibility",
        "express",
        "thing",
        "state",
        "affair",
        "repugnant",
        "possibility",
        "kind",
        "existence",
        "causally",
        "sufficient",
        "existence",
        "anything",
        "form",
        "precondition",
        "everything",
        "god",
        "omniscience",
        "involves",
        "actually",
        "infinite",
        "number",
        "intelligibles",
        "de",
        "primo",
        "principio",
        "iv",
        "object",
        "divine",
        "knowledge",
        "receive",
        "intelligible",
        "objective",
        "object",
        "divine",
        "omnipotence",
        "receive",
        "intentional",
        "possible",
        "included",
        "god",
        "providential",
        "plan",
        "creation",
        "receive",
        "actual",
        "description",
        "thing",
        "could",
        "certain",
        "moment",
        "consists",
        "compossible",
        "possibility",
        "though",
        "possibility",
        "necessarily",
        "actualization",
        "nonnecessary",
        "possibility",
        "contingent",
        "since",
        "finite",
        "thing",
        "contingently",
        "actual",
        "alternative",
        "possible",
        "respect",
        "time",
        "though",
        "compossible",
        "actual",
        "impossibility",
        "incompossibilities",
        "possibility",
        "ord",
        "i",
        "i",
        "i",
        "lect",
        "i",
        "criticizing",
        "extensional",
        "modal",
        "theory",
        "scotus",
        "redefined",
        "contingent",
        "event",
        "follows",
        "call",
        "something",
        "contingent",
        "always",
        "necessarily",
        "case",
        "opposite",
        "could",
        "actual",
        "moment",
        "occurs",
        "ord",
        "i",
        "denial",
        "traditional",
        "thesis",
        "necessity",
        "present",
        "temporal",
        "frequency",
        "characterization",
        "contingency",
        "scotus",
        "modal",
        "semantics",
        "meaning",
        "notion",
        "contingency",
        "spelt",
        "considering",
        "simultaneous",
        "alternative",
        "actual",
        "contingently",
        "instead",
        "actual",
        "could",
        "actual",
        "conception",
        "simultaneous",
        "contingent",
        "alternative",
        "part",
        "argument",
        "first",
        "cause",
        "act",
        "necessarily",
        "according",
        "scotus",
        "eternal",
        "creative",
        "act",
        "divine",
        "free",
        "could",
        "real",
        "sense",
        "lect",
        "i",
        "scotus",
        "modal",
        "theory",
        "see",
        "also",
        "honnefelder",
        "vos",
        "et",
        "al",
        "king",
        "hoffmann",
        "thesis",
        "scotus",
        "innovativeness",
        "criticized",
        "pasnau",
        "scotus",
        "approach",
        "modality",
        "brought",
        "new",
        "theme",
        "philosophical",
        "discussion",
        "one",
        "idea",
        "possibility",
        "nonexistent",
        "precondition",
        "thinking",
        "follower",
        "critic",
        "argued",
        "god",
        "would",
        "kind",
        "modality",
        "see",
        "hoffmann",
        "coombs",
        "bradwardine",
        "criticism",
        "see",
        "frost",
        "scotus",
        "view",
        "known",
        "seventeenth",
        "century",
        "work",
        "suárez",
        "scotist",
        "author",
        "honnefelder",
        "discussion",
        "eternal",
        "truth",
        "descartes",
        "criticized",
        "classical",
        "view",
        "ontological",
        "foundation",
        "modality",
        "well",
        "scotist",
        "theory",
        "modality",
        "conceivability",
        "different",
        "interpretation",
        "descartes",
        "view",
        "foundation",
        "modality",
        "related",
        "late",
        "medieval",
        "discussion",
        "see",
        "alanen",
        "normore",
        "another",
        "influential",
        "idea",
        "distinction",
        "logical",
        "natural",
        "necessity",
        "possibility",
        "scotus",
        "theory",
        "logically",
        "necessary",
        "attribute",
        "relation",
        "attached",
        "thing",
        "set",
        "compossibilities",
        "occur",
        "background",
        "one",
        "could",
        "ask",
        "natural",
        "invariance",
        "treated",
        "necessity",
        "earlier",
        "natural",
        "philosophy",
        "necessary",
        "strong",
        "sense",
        "necessity",
        "merely",
        "empirical",
        "generalization",
        "without",
        "logically",
        "necessary",
        "discussion",
        "logical",
        "natural",
        "necessity",
        "fourteenth",
        "century",
        "see",
        "knuuttila",
        "a",
        "buridan",
        "distinguished",
        "logical",
        "natural",
        "necessity",
        "classification",
        "four",
        "grade",
        "necessity",
        "dialectica",
        "used",
        "nonextensional",
        "metaphysical",
        "notion",
        "possibility",
        "sencundum",
        "imaginationen",
        "question",
        "aristotle",
        "physic",
        "sylla",
        "frequency",
        "interpretation",
        "question",
        "aristotle",
        "generation",
        "corruption",
        "i",
        "main",
        "modal",
        "conception",
        "averroist",
        "aristotle",
        "commentary",
        "john",
        "jandun",
        "see",
        "example",
        "question",
        "metaphysics",
        "ix",
        "vab",
        "question",
        "heaven",
        "i",
        "vb",
        "remained",
        "popular",
        "option",
        "renaissance",
        "time",
        "knebel",
        "one",
        "important",
        "branch",
        "medieval",
        "logic",
        "developed",
        "treatise",
        "called",
        "de",
        "obligationibus",
        "dealt",
        "roughly",
        "speaking",
        "increasing",
        "set",
        "true",
        "false",
        "proposition",
        "might",
        "remain",
        "coherent",
        "disputation",
        "according",
        "thirteenthcentury",
        "rule",
        "false",
        "present",
        "tense",
        "statement",
        "could",
        "accepted",
        "starting",
        "point",
        "taken",
        "refer",
        "moment",
        "time",
        "different",
        "actual",
        "one",
        "scotus",
        "deleted",
        "rule",
        "based",
        "aristotelian",
        "axiom",
        "necessity",
        "present",
        "later",
        "theory",
        "accepted",
        "scotist",
        "revision",
        "new",
        "form",
        "obligation",
        "logic",
        "could",
        "regarded",
        "theory",
        "analyze",
        "possible",
        "state",
        "affair",
        "mutual",
        "relationship",
        "discussion",
        "influenced",
        "philosophical",
        "theory",
        "counterfactual",
        "conditionals",
        "yrjönsuuri",
        "gelber",
        "dutilh",
        "novaes",
        "dealing",
        "counterfactual",
        "hypothesis",
        "indirect",
        "proof",
        "mentioned",
        "averroes",
        "thomas",
        "aquinas",
        "made",
        "use",
        "idea",
        "abstract",
        "possibility",
        "imply",
        "idea",
        "alternative",
        "domain",
        "possibility",
        "thing",
        "dealt",
        "various",
        "level",
        "correspond",
        "porphyrian",
        "predicables",
        "something",
        "possible",
        "thing",
        "member",
        "genus",
        "impossible",
        "member",
        "specie",
        "hold",
        "member",
        "specie",
        "individuated",
        "thing",
        "thus",
        "human",
        "fly",
        "animal",
        "fly",
        "abstract",
        "possibility",
        "impossible",
        "sense",
        "actualized",
        "buridan",
        "heavily",
        "criticized",
        "approach",
        "point",
        "view",
        "modal",
        "theory",
        "argued",
        "counterfactual",
        "state",
        "affair",
        "possible",
        "coherently",
        "imagined",
        "actual",
        "something",
        "treated",
        "way",
        "calling",
        "possible",
        "based",
        "conceptual",
        "confusion",
        "see",
        "knuuttila",
        "kukkonen",
        "scotus",
        "buridan",
        "many",
        "others",
        "understood",
        "basic",
        "level",
        "possibility",
        "term",
        "semantic",
        "consistency",
        "ockham",
        "wanted",
        "preserve",
        "link",
        "notion",
        "power",
        "modal",
        "consideration",
        "thinking",
        "necessity",
        "actuality",
        "plus",
        "immutability",
        "past",
        "present",
        "necessary",
        "scotus",
        "wrong",
        "assuming",
        "thing",
        "could",
        "different",
        "moment",
        "actuality",
        "normore",
        "influenced",
        "new",
        "idea",
        "logical",
        "modality",
        "william",
        "ockham",
        "summa",
        "logicae",
        "john",
        "buridan",
        "tractatus",
        "de",
        "consequentiis",
        "summulae",
        "de",
        "dialectica",
        "fourteenthcentury",
        "author",
        "could",
        "formulate",
        "principle",
        "modal",
        "logic",
        "much",
        "completely",
        "satisfactorily",
        "predecessor",
        "question",
        "modal",
        "logic",
        "discussed",
        "separately",
        "respect",
        "modal",
        "proposition",
        "de",
        "dicto",
        "de",
        "modal",
        "proposition",
        "de",
        "divided",
        "two",
        "group",
        "depending",
        "whether",
        "subject",
        "term",
        "refer",
        "actual",
        "possible",
        "being",
        "thought",
        "logician",
        "also",
        "analyze",
        "relationship",
        "reading",
        "furthermore",
        "consequence",
        "various",
        "type",
        "modal",
        "sentence",
        "part",
        "ockham",
        "buridan",
        "follower",
        "largely",
        "dropped",
        "thirteenthcentury",
        "essentialist",
        "assumption",
        "modal",
        "syllogistic",
        "regarded",
        "aristotelian",
        "version",
        "fragmentary",
        "theory",
        "distinction",
        "different",
        "type",
        "fine",
        "structure",
        "explicated",
        "consequently",
        "try",
        "reconstruct",
        "aristotle",
        "modal",
        "syllogistic",
        "consistent",
        "whole",
        "one",
        "unifying",
        "analysis",
        "modal",
        "proposition",
        "believed",
        "like",
        "modern",
        "commentator",
        "reconstruction",
        "possible",
        "fourteenthcentury",
        "modal",
        "logic",
        "see",
        "king",
        "lagerlund",
        "thom",
        "knuuttila",
        "read",
        "according",
        "hughes",
        "one",
        "could",
        "supply",
        "kripkestyle",
        "possible",
        "world",
        "semantics",
        "buridan",
        "modal",
        "system",
        "done",
        "johnston",
        "discussing",
        "conception",
        "simultaneous",
        "alternativeness",
        "fourteenthcentury",
        "logic",
        "many",
        "historian",
        "used",
        "terminology",
        "possible",
        "world",
        "semantics",
        "without",
        "metaphysical",
        "formal",
        "detail",
        "modern",
        "theory",
        "yrjönsuuri",
        "dutilh",
        "novaes",
        "read",
        "ockham",
        "buridan",
        "state",
        "truth",
        "white",
        "thing",
        "black",
        "demand",
        "truth",
        "black",
        "black",
        "black",
        "possible",
        "mean",
        "compound",
        "de",
        "dicto",
        "divided",
        "de",
        "reading",
        "differ",
        "level",
        "separated",
        "dealing",
        "universal",
        "particular",
        "proposition",
        "ockham",
        "discus",
        "unrestricted",
        "divided",
        "necessity",
        "proposition",
        "buridan",
        "took",
        "subject",
        "term",
        "quantified",
        "divided",
        "modal",
        "proposition",
        "standing",
        "possible",
        "being",
        "restricted",
        "truth",
        "proposition",
        "demand",
        "truth",
        "relevant",
        "singular",
        "proposition",
        "type",
        "mentioned",
        "demonstrative",
        "pronoun",
        "taken",
        "refer",
        "possible",
        "being",
        "even",
        "though",
        "may",
        "exist",
        "buridan",
        "could",
        "said",
        "possible",
        "truth",
        "x",
        "mean",
        "true",
        "possible",
        "state",
        "affair",
        "possible",
        "referred",
        "occurs",
        "necessary",
        "truth",
        "x",
        "mean",
        "true",
        "possible",
        "state",
        "affair",
        "possible",
        "referred",
        "occurs",
        "hughes",
        "buridan",
        "modal",
        "logic",
        "see",
        "also",
        "read",
        "introduction",
        "treatise",
        "consequence",
        "johnston",
        "new",
        "modal",
        "logic",
        "among",
        "remarkable",
        "achievement",
        "medieval",
        "logic",
        "buridan",
        "modal",
        "logic",
        "dominant",
        "late",
        "medieval",
        "time",
        "systematic",
        "ockham",
        "symmetric",
        "treatment",
        "possibility",
        "necessity",
        "embraced",
        "marsilius",
        "inghen",
        "albert",
        "saxony",
        "jodocus",
        "trutfetter",
        "others",
        "lagerlund",
        "later",
        "influence",
        "medieval",
        "modal",
        "theory",
        "see",
        "also",
        "coombs",
        "knebel",
        "roncaglia",
        "schmutz",
        "rise",
        "new",
        "modal",
        "logic",
        "accompanied",
        "elaborated",
        "theory",
        "epistemic",
        "logic",
        "boh",
        "deontic",
        "logic",
        "knuuttila",
        "hallamaa"
    ]
}