{
    "main_text": "Models and Theory || Models as independent from theories\n4.2 Models as independent from theories\n\nIn both the syntactic and the semantic view of theories models are\nseen as subordinate to theory and as playing no role outside the\ncontext of a theory. This vision of models has been challenged in a\nnumber of ways, with authors pointing out that models enjoy various\ndegrees of freedom from theory and function autonomously in many\ncontexts. Independence can take many forms, and large parts of the\nliterature on models are concerned with investigating various forms of\nindependence.\n\nModels as completely independent of theory. The most radical\ndeparture from a theory-centered analysis of models is the realization\nthat there are models that are completely independent from any theory.\nAn example of such a model is the Lotka–Volterra model. The model\ndescribes the interaction of two populations: a population of\npredators and one of prey animals (Weisberg 2013). The model was\nconstructed using only relatively commonsensical assumptions about\npredators and prey and the mathematics of differential equations.\nThere was no appeal to a theory of predator–prey interactions or a\ntheory of population growth, and the model is independent of theories\nabout its subject matter. If a model is constructed in a domain where\nno theory is available, then the model is sometimes referred to as a\n“substitute model” (Groenewold 1961), because the model\nsubstitutes a theory.\n\nModels as a means to explore theory. Models can also be used\nto explore theories (Morgan and Morrison 1999). An obvious way in\nwhich this can happen is when a model is a logical model of a theory\n(see\n Section 4.1).\n A logical model is a set of objects and properties that make a formal\nsentence true, and so one can see in the model how the axioms of the\ntheory play out in a particular setting and what kinds of behavior\nthey dictate. But not all models that are used to explore theories are\nlogical models, and models can represent features of theories in other\nways. As an example, consider chaos theory. The equations of\nnon-linear systems, such as those describing the three-body\nproblem, have solutions that are too complex to study with\npaper-and-pencil methods, and even computer simulations are limited in\nvarious ways. Abstract considerations about the qualitative behavior\nof solutions show that there is a mechanism that has been dubbed\n“stretching and folding” (see the entry\n Chaos).\n To obtain an idea of the complexity of the dynamics exhibiting\nstretching and folding, Smale proposed to study a simple model of the\nflow—now known as the “horseshoe map” (Tabor 1989)—which\nprovides important insights into the nature of stretching and folding.\nOther examples of models of that kind are the Kac ring model that is\nused to study equilibrium properties of systems in statistical\nmechanics (Lavis 2008)\nand Norton’s dome in Newtonian mechanics (Norton 2003).\n\nModels as complements of theories. A theory may be\nincompletely specified in the sense that it only imposes certain\ngeneral constraints but remains silent about the details of concrete\nsituations, which are provided by a model (Redhead 1980). A special\ncase of this situation is when a qualitative theory is known and the\nmodel introduces quantitative measures (Apostel 1961). Redhead’s\nexample of a theory that is underdetermined in this way is axiomatic\nquantum field theory, which only imposes certain general constraints\non quantum fields but does not provide an account of particular\nfields. Harré (2004) notes that models can complement theories by providing\nmechanisms for processes that are left unspecified in the theory even\nthough they are responsible for bringing about the observed\nphenomena.\n\nTheories may be too complicated to handle. In such cases a model can\ncomplement a theory by providing a simplified version of the\ntheoretical scenario that allows for a solution. Quantum\nchromodynamics, for instance, cannot easily be used to investigate the\nphysics of an atomic nucleus even though it is the relevant\nfundamental theory. To get around this difficulty, physicists\nconstruct tractable phenomenological models (such as the MIT bag\nmodel) which effectively describe the relevant degrees of freedom of\nthe system under consideration (Hartmann 1999, 2001). The advantage of\nthese models is that they yield results where theories remain silent.\nTheir drawback is that it is often not clear how to understand the\nrelationship between the model and the theory, as the two are, strictly\nspeaking, contradictory.\n\nModels as preliminary theories. The notion of a model as a\nsubstitute for a theory is closely related to the notion of a\ndevelopmental model. This term was coined by Leplin (1980),\nwho pointed out how useful models were in the development of early\nquantum theory, and it is now used as an umbrella notion covering\ncases in which models are some sort of a preliminary exercise to\ntheory.\n\nAlso closely related is the notion of a probing model (or\n“study model”). Models of this kind do not perform a\nrepresentational function and are not expected to instruct us about\nanything beyond the model itself. The purpose of these models is to\ntest new theoretical tools that are used later on to build\nrepresentational models. In field theory, for instance, the so-called\nφ4-model was studied extensively, not because it was\nbelieved to represent anything real, but because it served several\nheuristic functions: the simplicity of the φ4-model\nallowed physicists to “get a feeling” for what quantum\nfield theories are like and to extract some general features that this\nsimple model shared with more complicated ones. Physicists could study\ncomplicated techniques such as renormalization in a simple setting,\nand it was possible to get acquainted with important\nmechanisms—in this case symmetry-breaking—that could later\nbe used in different contexts (Hartmann 1995). This is true not only\nfor physics. As Wimsatt (1987, 2007) points out, a false model in\ngenetics can perform many useful functions, among them the following:\nthe false model can help answering questions about more realistic\nmodels, provide an arena for answering questions about properties of\nmore complex models, “factor out” phenomena that would not\notherwise be seen, serve as a limiting case of a more general model\n(or two false models may define the extremes of a continuum of cases\non which the real case is supposed to lie), or lead to the\nidentification of relevant variables and the estimation of their\nvalues.\n\nInterpretative models. Cartwright (1983, 1999) argues that\nmodels do not only aid the application of theories that are somehow\nincomplete; she claims that models are also involved whenever\na theory with an overarching mathematical structure is applied. The\nmain theories in physics—classical mechanics, electrodynamics,\nquantum mechanics, and so on—fall into this category. Theories of\nthat kind are formulated in terms of abstract concepts that need to be\nconcretized for the theory to provide a description of the target\nsystem, and concretizing the relevant concepts, idealized objects and\nprocesses are introduced. For instance, when applying classical\nmechanics, the abstract concept of force has to be replaced with a\nconcrete force such as gravity. To obtain tractable equations, this\nprocedure has to be applied to a simplified scenario, for instance\nthat of two perfectly spherical and homogeneous planets in otherwise\nempty space, rather than to reality in its full complexity. The result\nis an interpretative model, which grounds the application of\nmathematical theories to real-world targets. Such models are\nindependent from theory in that the theory does not determine their\nform, and yet they are necessary for the application of the theory to\na concrete problem.\n\nModels as mediators. The relation between models and theories\ncan be complicated and disorderly. The contributors to a programmatic\ncollection of essays edited by Morgan and Morrison (1999) rally around\nthe idea that models are instruments that mediate between theories and\nthe world. Models are “autonomous agents” in that they are\nindependent from both theories and their target systems, and it is\nthis independence that allows them to mediate between the two.\nTheories do not provide us with algorithms for the construction of a\nmodel; they are not “vending machines” into which one can\ninsert a problem and a model pops out (Cartwright 1999). The\nconstruction of a model often requires detailed knowledge about\nmaterials, approximation schemes, and the setup, and these are not\nprovided by the corresponding theory. Furthermore, the inner workings\nof a model are often driven by a number of different theories working\ncooperatively. In contemporary climate modeling, for instance,\nelements of different theories—among them fluid dynamics,\nthermodynamics, electromagnetism—are put to work cooperatively.\nWhat delivers the results is not the stringent application of one\ntheory, but the voices of different theories when put to use in chorus\nwith each other in one model.\n\nIn complex cases like the study of a laser system or the global\nclimate, models and theories can get so entangled that it becomes\nunclear where a line between the two should be drawn: where does the\nmodel end and the theory begin? This is not only a problem for\nphilosophical analysis; it also arises in scientific practice.\nBailer-Jones (2002) interviewed a group of physicists about their\nunderstanding of models and their relation to theories, and reports\nwidely diverging views: (i) there is no substantive difference between\nmodel and theory; (ii) models become theories when their\ndegree of confirmation increases; (iii) models contain simplifications\nand omissions, while theories are accurate and complete; (iv) theories\nare more general than models, and modeling is about applying general\ntheories to specific cases. The first suggestion seems to be too\nradical to do justice to many aspects of practice, where a distinction\nbetween models and theories is clearly made. The second view is in\nline with common parlance, where the terms “model” and\n“theory” are sometimes used to express someone’s\nattitude towards a particular hypothesis. The phrase “it’s\njust a model” indicates that the hypothesis at stake is asserted\nonly tentatively or is even known to be false, while something is\nawarded the label “theory” if it has acquired some degree\nof general acceptance. However, this use of “model” is\ndifferent from the uses we have seen in\n Sections 1 to 3\n and is therefore of no use if we aim to understand the relation\nbetween scientific models and theories (and, incidentally, one can\nequally dismiss speculative claims as being “just a\ntheory”). The third proposal is correct in associating models\nwith idealizations and simplifications, but it overshoots by\nrestricting this to models; in fact, also theories can contain\nidealizations and simplifications. The fourth view seems closely\naligned with interpretative models and the idea that models are\nmediators, but being more general is a gradual notion and hence does\nnot provide a clear-cut criterion to distinguish between theories and\nmodels.\n",
    "section_title": "4.2 Models as independent from theories",
    "entry_title": "Models in Science",
    "hierarchy_title": "Models in Science || Models and Theory || Models as independent from theories",
    "tokenized_text": [
        "model",
        "theory",
        "model",
        "independent",
        "theory",
        "model",
        "independent",
        "theory",
        "syntactic",
        "semantic",
        "view",
        "theory",
        "model",
        "seen",
        "subordinate",
        "theory",
        "playing",
        "role",
        "outside",
        "context",
        "theory",
        "vision",
        "model",
        "challenged",
        "number",
        "way",
        "author",
        "pointing",
        "model",
        "enjoy",
        "various",
        "degree",
        "freedom",
        "theory",
        "function",
        "autonomously",
        "many",
        "context",
        "independence",
        "take",
        "many",
        "form",
        "large",
        "part",
        "literature",
        "model",
        "concerned",
        "investigating",
        "various",
        "form",
        "independence",
        "model",
        "completely",
        "independent",
        "theory",
        "radical",
        "departure",
        "theorycentered",
        "analysis",
        "model",
        "realization",
        "model",
        "completely",
        "independent",
        "theory",
        "example",
        "model",
        "lotkavolterra",
        "model",
        "model",
        "describes",
        "interaction",
        "two",
        "population",
        "population",
        "predator",
        "one",
        "prey",
        "animal",
        "weisberg",
        "model",
        "constructed",
        "using",
        "relatively",
        "commonsensical",
        "assumption",
        "predator",
        "prey",
        "mathematics",
        "differential",
        "equation",
        "appeal",
        "theory",
        "predatorprey",
        "interaction",
        "theory",
        "population",
        "growth",
        "model",
        "independent",
        "theory",
        "subject",
        "matter",
        "model",
        "constructed",
        "domain",
        "theory",
        "available",
        "model",
        "sometimes",
        "referred",
        "substitute",
        "model",
        "groenewold",
        "model",
        "substitute",
        "theory",
        "model",
        "mean",
        "explore",
        "theory",
        "model",
        "also",
        "used",
        "explore",
        "theory",
        "morgan",
        "morrison",
        "obvious",
        "way",
        "happen",
        "model",
        "logical",
        "model",
        "theory",
        "see",
        "section",
        "logical",
        "model",
        "set",
        "object",
        "property",
        "make",
        "formal",
        "sentence",
        "true",
        "one",
        "see",
        "model",
        "axiom",
        "theory",
        "play",
        "particular",
        "setting",
        "kind",
        "behavior",
        "dictate",
        "model",
        "used",
        "explore",
        "theory",
        "logical",
        "model",
        "model",
        "represent",
        "feature",
        "theory",
        "way",
        "example",
        "consider",
        "chaos",
        "theory",
        "equation",
        "nonlinear",
        "system",
        "describing",
        "threebody",
        "problem",
        "solution",
        "complex",
        "study",
        "paperandpencil",
        "method",
        "even",
        "computer",
        "simulation",
        "limited",
        "various",
        "way",
        "abstract",
        "consideration",
        "qualitative",
        "behavior",
        "solution",
        "show",
        "mechanism",
        "dubbed",
        "stretching",
        "folding",
        "see",
        "entry",
        "chaos",
        "obtain",
        "idea",
        "complexity",
        "dynamic",
        "exhibiting",
        "stretching",
        "folding",
        "smale",
        "proposed",
        "study",
        "simple",
        "model",
        "flownow",
        "known",
        "horseshoe",
        "map",
        "tabor",
        "which",
        "provides",
        "important",
        "insight",
        "nature",
        "stretching",
        "folding",
        "example",
        "model",
        "kind",
        "kac",
        "ring",
        "model",
        "used",
        "study",
        "equilibrium",
        "property",
        "system",
        "statistical",
        "mechanic",
        "lavis",
        "norton",
        "dome",
        "newtonian",
        "mechanic",
        "norton",
        "model",
        "complement",
        "theory",
        "theory",
        "may",
        "incompletely",
        "specified",
        "sense",
        "imposes",
        "certain",
        "general",
        "constraint",
        "remains",
        "silent",
        "detail",
        "concrete",
        "situation",
        "provided",
        "model",
        "redhead",
        "special",
        "case",
        "situation",
        "qualitative",
        "theory",
        "known",
        "model",
        "introduces",
        "quantitative",
        "measure",
        "apostel",
        "redhead",
        "example",
        "theory",
        "underdetermined",
        "way",
        "axiomatic",
        "quantum",
        "field",
        "theory",
        "imposes",
        "certain",
        "general",
        "constraint",
        "quantum",
        "field",
        "provide",
        "account",
        "particular",
        "field",
        "harré",
        "note",
        "model",
        "complement",
        "theory",
        "providing",
        "mechanism",
        "process",
        "left",
        "unspecified",
        "theory",
        "even",
        "though",
        "responsible",
        "bringing",
        "observed",
        "phenomenon",
        "theory",
        "may",
        "complicated",
        "handle",
        "case",
        "model",
        "complement",
        "theory",
        "providing",
        "simplified",
        "version",
        "theoretical",
        "scenario",
        "allows",
        "solution",
        "quantum",
        "chromodynamics",
        "instance",
        "easily",
        "used",
        "investigate",
        "physic",
        "atomic",
        "nucleus",
        "even",
        "though",
        "relevant",
        "fundamental",
        "theory",
        "get",
        "around",
        "difficulty",
        "physicist",
        "construct",
        "tractable",
        "phenomenological",
        "model",
        "mit",
        "bag",
        "model",
        "effectively",
        "describe",
        "relevant",
        "degree",
        "freedom",
        "system",
        "consideration",
        "hartmann",
        "advantage",
        "model",
        "yield",
        "result",
        "theory",
        "remain",
        "silent",
        "drawback",
        "often",
        "clear",
        "understand",
        "relationship",
        "model",
        "theory",
        "two",
        "strictly",
        "speaking",
        "contradictory",
        "model",
        "preliminary",
        "theory",
        "notion",
        "model",
        "substitute",
        "theory",
        "closely",
        "related",
        "notion",
        "developmental",
        "model",
        "term",
        "coined",
        "leplin",
        "pointed",
        "useful",
        "model",
        "development",
        "early",
        "quantum",
        "theory",
        "used",
        "umbrella",
        "notion",
        "covering",
        "case",
        "model",
        "sort",
        "preliminary",
        "exercise",
        "theory",
        "also",
        "closely",
        "related",
        "notion",
        "probing",
        "model",
        "study",
        "model",
        "model",
        "kind",
        "perform",
        "representational",
        "function",
        "expected",
        "instruct",
        "u",
        "anything",
        "beyond",
        "model",
        "purpose",
        "model",
        "test",
        "new",
        "theoretical",
        "tool",
        "used",
        "later",
        "build",
        "representational",
        "model",
        "field",
        "theory",
        "instance",
        "socalled",
        "φmodel",
        "studied",
        "extensively",
        "believed",
        "represent",
        "anything",
        "real",
        "served",
        "several",
        "heuristic",
        "function",
        "simplicity",
        "φmodel",
        "allowed",
        "physicist",
        "get",
        "feeling",
        "quantum",
        "field",
        "theory",
        "like",
        "extract",
        "general",
        "feature",
        "simple",
        "model",
        "shared",
        "complicated",
        "one",
        "physicist",
        "could",
        "study",
        "complicated",
        "technique",
        "renormalization",
        "simple",
        "setting",
        "possible",
        "get",
        "acquainted",
        "important",
        "mechanismsin",
        "case",
        "symmetrybreakingthat",
        "could",
        "later",
        "used",
        "different",
        "context",
        "hartmann",
        "true",
        "physic",
        "wimsatt",
        "point",
        "false",
        "model",
        "genetics",
        "perform",
        "many",
        "useful",
        "function",
        "among",
        "following",
        "false",
        "model",
        "help",
        "answering",
        "question",
        "realistic",
        "model",
        "provide",
        "arena",
        "answering",
        "question",
        "property",
        "complex",
        "model",
        "factor",
        "phenomenon",
        "would",
        "otherwise",
        "seen",
        "serve",
        "limiting",
        "case",
        "general",
        "model",
        "two",
        "false",
        "model",
        "may",
        "define",
        "extreme",
        "continuum",
        "case",
        "real",
        "case",
        "supposed",
        "lie",
        "lead",
        "identification",
        "relevant",
        "variable",
        "estimation",
        "value",
        "interpretative",
        "model",
        "cartwright",
        "argues",
        "model",
        "aid",
        "application",
        "theory",
        "somehow",
        "incomplete",
        "claim",
        "model",
        "also",
        "involved",
        "whenever",
        "theory",
        "overarching",
        "mathematical",
        "structure",
        "applied",
        "main",
        "theory",
        "physicsclassical",
        "mechanic",
        "electrodynamics",
        "quantum",
        "mechanic",
        "onfall",
        "category",
        "theory",
        "kind",
        "formulated",
        "term",
        "abstract",
        "concept",
        "need",
        "concretized",
        "theory",
        "provide",
        "description",
        "target",
        "system",
        "concretizing",
        "relevant",
        "concept",
        "idealized",
        "object",
        "process",
        "introduced",
        "instance",
        "applying",
        "classical",
        "mechanic",
        "abstract",
        "concept",
        "force",
        "replaced",
        "concrete",
        "force",
        "gravity",
        "obtain",
        "tractable",
        "equation",
        "procedure",
        "applied",
        "simplified",
        "scenario",
        "instance",
        "two",
        "perfectly",
        "spherical",
        "homogeneous",
        "planet",
        "otherwise",
        "empty",
        "space",
        "rather",
        "reality",
        "full",
        "complexity",
        "result",
        "interpretative",
        "model",
        "ground",
        "application",
        "mathematical",
        "theory",
        "realworld",
        "target",
        "model",
        "independent",
        "theory",
        "theory",
        "determine",
        "form",
        "yet",
        "necessary",
        "application",
        "theory",
        "concrete",
        "problem",
        "model",
        "mediator",
        "relation",
        "model",
        "theory",
        "complicated",
        "disorderly",
        "contributor",
        "programmatic",
        "collection",
        "essay",
        "edited",
        "morgan",
        "morrison",
        "rally",
        "around",
        "idea",
        "model",
        "instrument",
        "mediate",
        "theory",
        "world",
        "model",
        "autonomous",
        "agent",
        "independent",
        "theory",
        "target",
        "system",
        "independence",
        "allows",
        "mediate",
        "two",
        "theory",
        "provide",
        "u",
        "algorithm",
        "construction",
        "model",
        "vending",
        "machine",
        "one",
        "insert",
        "problem",
        "model",
        "pop",
        "cartwright",
        "construction",
        "model",
        "often",
        "requires",
        "detailed",
        "knowledge",
        "material",
        "approximation",
        "scheme",
        "setup",
        "provided",
        "corresponding",
        "theory",
        "furthermore",
        "inner",
        "working",
        "model",
        "often",
        "driven",
        "number",
        "different",
        "theory",
        "working",
        "cooperatively",
        "contemporary",
        "climate",
        "modeling",
        "instance",
        "element",
        "different",
        "theoriesamong",
        "fluid",
        "dynamic",
        "thermodynamics",
        "electromagnetismare",
        "put",
        "work",
        "cooperatively",
        "delivers",
        "result",
        "stringent",
        "application",
        "one",
        "theory",
        "voice",
        "different",
        "theory",
        "put",
        "use",
        "chorus",
        "one",
        "model",
        "complex",
        "case",
        "like",
        "study",
        "laser",
        "system",
        "global",
        "climate",
        "model",
        "theory",
        "get",
        "entangled",
        "becomes",
        "unclear",
        "line",
        "two",
        "drawn",
        "model",
        "end",
        "theory",
        "begin",
        "problem",
        "philosophical",
        "analysis",
        "also",
        "arises",
        "scientific",
        "practice",
        "bailerjones",
        "interviewed",
        "group",
        "physicist",
        "understanding",
        "model",
        "relation",
        "theory",
        "report",
        "widely",
        "diverging",
        "view",
        "substantive",
        "difference",
        "model",
        "theory",
        "ii",
        "model",
        "become",
        "theory",
        "degree",
        "confirmation",
        "increase",
        "iii",
        "model",
        "contain",
        "simplification",
        "omission",
        "theory",
        "accurate",
        "complete",
        "iv",
        "theory",
        "general",
        "model",
        "modeling",
        "applying",
        "general",
        "theory",
        "specific",
        "case",
        "first",
        "suggestion",
        "seems",
        "radical",
        "justice",
        "many",
        "aspect",
        "practice",
        "distinction",
        "model",
        "theory",
        "clearly",
        "made",
        "second",
        "view",
        "line",
        "common",
        "parlance",
        "term",
        "model",
        "theory",
        "sometimes",
        "used",
        "express",
        "someone",
        "attitude",
        "towards",
        "particular",
        "hypothesis",
        "phrase",
        "model",
        "indicates",
        "hypothesis",
        "stake",
        "asserted",
        "tentatively",
        "even",
        "known",
        "false",
        "something",
        "awarded",
        "label",
        "theory",
        "acquired",
        "degree",
        "general",
        "acceptance",
        "however",
        "use",
        "model",
        "different",
        "us",
        "seen",
        "section",
        "therefore",
        "use",
        "aim",
        "understand",
        "relation",
        "scientific",
        "model",
        "theory",
        "incidentally",
        "one",
        "equally",
        "dismiss",
        "speculative",
        "claim",
        "theory",
        "third",
        "proposal",
        "correct",
        "associating",
        "model",
        "idealization",
        "simplification",
        "overshoot",
        "restricting",
        "model",
        "fact",
        "also",
        "theory",
        "contain",
        "idealization",
        "simplification",
        "fourth",
        "view",
        "seems",
        "closely",
        "aligned",
        "interpretative",
        "model",
        "idea",
        "model",
        "mediator",
        "general",
        "gradual",
        "notion",
        "hence",
        "provide",
        "clearcut",
        "criterion",
        "distinguish",
        "theory",
        "model"
    ]
}