{
    "main_text": "What is a mental module?\n1. What is a mental module?\n\nIn his classic introduction to modularity, Fodor (1983) lists nine\nfeatures that collectively characterize the type of system that\ninterests him. In original order of presentation, they are: \n\nDomain specificity\nMandatory operation\nLimited central accessibility\nFast processing\nInformational encapsulation\n‘Shallow’ outputs\nFixed neural architecture\nCharacteristic and specific breakdown patterns\nCharacteristic ontogenetic pace and sequencing\n\n\nA cognitive system counts as modular in Fodor’s sense if it is\nmodular “to some interesting extent,” meaning that it has\nmost of these features to an appreciable degree (Fodor, 1983, p. 37).\nThis is a weighted most, since some marks of modularity are more\nimportant than others. Information encapsulation, for example, is more\nor less essential for modularity, as well as explanatorily prior to\nseveral of the other features on the list (Fodor, 1983, 2000). \n\nEach of the items on the list calls for explication. To streamline the\nexposition, we will cluster most of the features thematically and\nexamine them on a cluster-by-cluster basis, along the lines of Prinz\n(2006).\n\nEncapsulation and inaccessibility. Informational\nencapsulation and limited central accessibility are two sides of the\nsame coin. Both features pertain to the character of information flow\nacross computational mechanisms, albeit in opposite directions.\nEncapsulation involves restriction on the flow of information into a\nmechanism, whereas inaccessibility involves restriction on the flow of\ninformation out of it.\n\nA cognitive system is informationally encapsulated to the extent that\nin the course of processing a given set of inputs it cannot access\ninformation stored elsewhere; all it has to go on is the information\ncontained in those inputs plus whatever information might be stored\nwithin the system itself, for example, in a proprietary database. In\nthe case of language, for example:\n\nA parser for [a language] L contains a grammar of L.\nWhat it does when it does its thing is, it infers from certain\nacoustic properties of a token to a characterization of certain of the\ndistal causes of the token (e.g., to the speaker’s intention\nthat the utterance should be a token of a certain linguistic type).\nPremises of this inference can include whatever information about the\nacoustics of the token the mechanisms of sensory transduction provide,\nwhatever information about the linguistic types in L the\ninternally represented grammar provides, and nothing else.\n(Fodor, 1984, pp. 245–246; italics in original)\n\n\nSimilarly, in the case of perception—understood as a kind of\nnon-demonstrative (i.e., defeasible, or non-monotonic) inference from\nsensory ‘premises’ to perceptual\n‘conclusions’—the claim that perceptual systems are\ninformationally encapsulated is equivalent to the claim that\n“the data that can bear on the confirmation of perceptual\nhypotheses includes, in the general case, considerably less than the\norganism may know” (Fodor, 1983, p. 69). The classic\nillustration of this property comes from the study of visual\nillusions, which tend to persist even after the viewer is explicitly\ninformed about the character of the stimulus. In the Müller-Lyer\nillusion, for example, the two lines continue to look as if they were\nof unequal length even after one has convinced oneself otherwise,\ne.g., by measuring them with a ruler (see Figure 1, below). \n\n\nFigure 1. The Müller-Lyer illusion.\n\n\nInformational encapsulation is related to what Pylyshyn (1984, 1999)\ncalls cognitive impenetrability. But the two properties are not the\nsame; instead, they are related as genus to species. Cognitive\nimpenetrability is a matter of encapsulation relative to information\nstored in central memory, paradigmatically in the form of beliefs and\nutilities. But a system could be encapsulated in this respect without\nbeing encapsulated across the board. For example, auditory speech\nperception might be encapsulated relative to beliefs and utilities but\nunencapsulated relative to vision, as suggested by the McGurk effect\n(see below, §2.1). Likewise, a system could be unencapsulated\nrelative to beliefs and utilities yet encapsulated relative to\nperception; it’s plausible that central systems have this\ncharacter, insofar as their operations are sensitive only to\npost-perceptual, propositionally encoded information. Strictly\nspeaking, then, cognitive impenetrability is a specific type of\ninformational encapsulation, albeit a type with special architectural\nsignificance. Lacking this feature means failing the encapsulation\ntest, the litmus test of modularity. But systems with this feature\nmight still fail the test, due to information seepage of a different\n(i.e., non-central) sort.\n\nThe flip side of informational encapsulation is inaccessibility to\ncentral monitoring. A system is inaccessible in this sense if the\nintermediate-level representations that it computes prior to producing\nits output are inaccessible to consciousness, and hence unavailable\nfor explicit report. In effect, centrally inaccessible systems are\nthose whose internal processing is opaque to introspection. Though the\noutputs of such systems may be phenomenologically salient, their\nprecursor states are not. Speech comprehension, for example, likely\ninvolves the successive elaboration of myriad representations (of\nvarious types: phonological, lexical, syntactic, etc.) of the\nstimulus, but of these only the final product—the representation\nof the meaning of what was said—is consciously available.\n\nMandatoriness, speed, and superficiality. In addition to\nbeing informationally encapsulated and centrally inaccessible, modular\nsystems and processes are “fast, cheap, and out of\ncontrol” (to borrow a phrase by roboticist Rodney Brooks). These\nfeatures form a natural trio, as we’ll see.\n\nThe operation of a cognitive system is mandatory just in case it is\nautomatic, that is, not under conscious control (Bargh &\nChartrand, 1999). This means that, like it or not, the system’s\noperations are switched on by presentation of the relevant stimuli and\nthose operations run to completion. For example, native speakers of\nEnglish cannot hear the sounds of English being spoken as mere noise:\nif they hear those sounds at all, they hear them as English. Likewise,\nit’s impossible to see a 3D array of objects in space as 2D\npatches of color, however hard one may try.\n\nSpeed is arguably the mark of modularity that requires least in the\nway of explication. But speed is relative, so the best way to proceed\nhere is by way of examples. Speech shadowing is generally considered\nto be very fast, with typical lag times on the order of about 250 ms.\nSince the syllabic rate of normal speech is about 4 syllables per\nsecond, this suggests that shadowers are processing the stimulus in\nsyllabus-length bits—probably the smallest bits that can be\nidentified in the speech stream, given that “only at the level\nof the syllable do we begin to find stretches of wave form whose\nacoustic properties are at all reliably related to their linguistic\nvalues” (Fodor, 1983, p. 62). Similarly impressive results are\navailable for vision: in a rapid serial visual presentation task\n(matching picture to description), subjects were 70% accurate at 125\nms. exposure per picture and 96% accurate at 167 ms. (Fodor, 1983, p.\n63). In general, a cognitive process counts as fast in Fodor’s\nbook if it takes place in a half second or less.\n\nA further feature of modular systems is that their outputs are\nrelatively ‘shallow’. Exactly what this means is unclear.\nBut the depth of an output seems to be a function of at least two\nproperties: first, how much computation is required to produce it\n(i.e., shallow means computationally cheap); second, how constrained\nor specific its informational content is (i.e., shallow means\ninformationally general) (Fodor, 1983, p. 87). These two properties\nare correlated, in that outputs with more specific content tend to be\nmore costly for a system to compute, and vice versa. Some writers have\ninterpreted shallowness to require non-conceptual character (e.g.,\nCarruthers, 2006, p. 4). But this conflicts with Fodor’s own\ngloss on the term, in which he suggests that the output of a plausibly\nmodular system such as visual object recognition might be encoded at\nthe level of ‘basic-level’ concepts, like DOG and CHAIR\n(Rosch et al., 1976). What’s ruled out here is not concepts\nper se, then, but highly theoretical concepts like PROTON,\nwhich are too informationally specific and too computationally\nexpensive to meet the shallowness criterion.\n\nAll three of the features just discussed—mandatoriness, speed,\nand shallowness—are associated with, and to some extent\nexplicable in terms of, informational encapsulation. In each case,\nless is more, informationally speaking. Mandatoriness flows from the\ninsensitivity of the system to the organism’s utilities, which\nis one dimension of cognitive impenetrability. Speed depends upon the\nefficiency of processing, which positively correlates with\nencapsulation in so far as encapsulation tends to reduce the\nsystem’s informational load. Shallowness is a similar story:\nshallow outputs are computationally cheap, and computational expense\nis negatively correlated with encapsulation. In short, the more\ninformationally encapsulated a system is, the more likely it is to be\nfast, cheap, and out of control.\n\nDissociability and localizability. To say that a system is\nfunctionally dissociable is to say that it can be selectively\nimpaired, that is, damaged or disabled with little or no effect on the\noperation of other systems. As the neuropsychological record\nindicates, selective impairments of this sort have frequently been\nobserved as a consequence of circumscribed brain lesions. Standard\nexamples from the study of vision include prosopagnosia (impaired face\nrecognition), achromatopsia (total color blindness), and akinetopsia\n(motion blindness); examples from the study of language include\nagrammatism (loss of complex syntax), jargon aphasia (loss of complex\nsemantics), alexia (loss of object words), and dyslexia (impaired\nreading and writing). Each of these disorders have been found in\notherwise cognitively normal individuals, suggesting that the lost\ncapacities are subserved by functionally dissociable mechanisms.\n\nFunctional dissociability is associated with neural localizability in\na strong sense. A system is strongly localized just in case it is (a)\nimplemented in neural circuitry that is both relatively circumscribed\nin extent (though not necessarily in contiguous areas) and (b)\ndedicated to the realization of that system alone. Localization in\nthis sense goes beyond mere implementation in local neural circuitry,\nsince a given bit of circuitry could subserve more than one cognitive\nfunction (Anderson, 2010). Proposed candidates for strong localization\ninclude systems for color vision (V4), motion detection (MT), face\nrecognition (fusiform gyrus), and spatial scene recognition\n(parahippocampal gyrus).\n\nDomain specificity. A system is domain specific to the extent\nthat it has a restricted subject matter, that is, the class of objects\nand properties that it processes information about is circumscribed in\na relatively narrow way. As Fodor (1983) puts it, “domain\nspecificity has to do with the range of questions for which a device\nprovides answers (the range of inputs for which it computes\nanalyses)” (p. 103): the narrower the range of inputs a system\ncan compute, the narrower the range of problems the system can\nsolve—and the narrower the range of such problems, the more\ndomain specific the device. Alternatively, the degree of a\nsystem’s domain specificity can be understood as a function of\nthe range of inputs that turn the system on, where the size of that\nrange determines the informational reach of the system (Carruthers,\n2006; Samuels, 2000).\n\nDomains (and by extension, modules) are typically more fine-grained\nthan sensory modalities like vision and audition. This seems clear\nfrom Fodor’s list of plausibly domain-specific mechanisms, which\nincludes systems for color perception, visual shape analysis, sentence\nparsing, and face and voice recognition (Fodor, 1983, p.\n47)—none of which correspond to perceptual or linguistic\nfaculties in an intuitive sense. It also seems plausible, however,\nthat the traditional sense modalities (vision, audition, olfaction,\netc.), and the language faculty as a whole, are sufficiently domain\nspecific to count as displaying this particular mark of modularity\n(McCauley & Henrich, 2006).\n\nInnateness. The final feature of modular systems on\nFodor’s roster is innateness, understood as the property of\n“develop[ing] according to specific, endogenously determined\npatterns under the impact of environmental releasers” (Fodor,\n1983, p. 100). On this view, modular systems come on-line chiefly as\nthe result of a brute-causal process like triggering, rather than an\nintentional-causal process like learning. (For more on this\ndistinction, see Cowie, 1999; for an alternative analysis of\ninnateness, based on the notion of canalization, see Ariew, 1999.) The\nmost familiar example here is language, the acquisition of which\noccurs in all normal individuals in all cultures on more or less the\nsame schedule: single words at 12 months, telegraphic speech at 18\nmonths, complex grammar at 24 months, and so on (Stromswold, 1999).\nOther candidates include visual object perception (Spelke, 1994) and\nlow-level mindreading (Scholl & Leslie, 1999).\n",
    "section_title": "1. What is a mental module?",
    "entry_title": "Modularity of Mind",
    "hierarchy_title": "Modularity of Mind || What is a mental module?",
    "tokenized_text": [
        "mental",
        "module",
        "mental",
        "module",
        "classic",
        "introduction",
        "modularity",
        "fodor",
        "list",
        "nine",
        "feature",
        "collectively",
        "characterize",
        "type",
        "system",
        "interest",
        "original",
        "order",
        "presentation",
        "domain",
        "specificity",
        "mandatory",
        "operation",
        "limited",
        "central",
        "accessibility",
        "fast",
        "processing",
        "informational",
        "encapsulation",
        "shallow",
        "output",
        "fixed",
        "neural",
        "architecture",
        "characteristic",
        "specific",
        "breakdown",
        "pattern",
        "characteristic",
        "ontogenetic",
        "pace",
        "sequencing",
        "cognitive",
        "system",
        "count",
        "modular",
        "fodor",
        "sense",
        "modular",
        "interesting",
        "extent",
        "meaning",
        "feature",
        "appreciable",
        "degree",
        "fodor",
        "p",
        "weighted",
        "since",
        "mark",
        "modularity",
        "important",
        "others",
        "information",
        "encapsulation",
        "example",
        "le",
        "essential",
        "modularity",
        "well",
        "explanatorily",
        "prior",
        "several",
        "feature",
        "list",
        "fodor",
        "item",
        "list",
        "call",
        "explication",
        "streamline",
        "exposition",
        "cluster",
        "feature",
        "thematically",
        "examine",
        "clusterbycluster",
        "basis",
        "along",
        "line",
        "prinz",
        "encapsulation",
        "inaccessibility",
        "informational",
        "encapsulation",
        "limited",
        "central",
        "accessibility",
        "two",
        "side",
        "coin",
        "feature",
        "pertain",
        "character",
        "information",
        "flow",
        "across",
        "computational",
        "mechanism",
        "albeit",
        "opposite",
        "direction",
        "encapsulation",
        "involves",
        "restriction",
        "flow",
        "information",
        "mechanism",
        "whereas",
        "inaccessibility",
        "involves",
        "restriction",
        "flow",
        "information",
        "cognitive",
        "system",
        "informationally",
        "encapsulated",
        "extent",
        "course",
        "processing",
        "given",
        "set",
        "input",
        "access",
        "information",
        "stored",
        "elsewhere",
        "go",
        "information",
        "contained",
        "input",
        "plus",
        "whatever",
        "information",
        "might",
        "stored",
        "within",
        "system",
        "example",
        "proprietary",
        "database",
        "case",
        "language",
        "example",
        "parser",
        "language",
        "l",
        "contains",
        "grammar",
        "l",
        "thing",
        "infers",
        "certain",
        "acoustic",
        "property",
        "token",
        "characterization",
        "certain",
        "distal",
        "cause",
        "token",
        "eg",
        "speaker",
        "intention",
        "utterance",
        "token",
        "certain",
        "linguistic",
        "type",
        "premise",
        "inference",
        "include",
        "whatever",
        "information",
        "acoustic",
        "token",
        "mechanism",
        "sensory",
        "transduction",
        "provide",
        "whatever",
        "information",
        "linguistic",
        "type",
        "l",
        "internally",
        "represented",
        "grammar",
        "provides",
        "nothing",
        "else",
        "fodor",
        "pp",
        "italic",
        "original",
        "similarly",
        "case",
        "perceptionunderstood",
        "kind",
        "nondemonstrative",
        "ie",
        "defeasible",
        "nonmonotonic",
        "inference",
        "sensory",
        "premise",
        "perceptual",
        "conclusion",
        "the",
        "claim",
        "perceptual",
        "system",
        "informationally",
        "encapsulated",
        "equivalent",
        "claim",
        "data",
        "bear",
        "confirmation",
        "perceptual",
        "hypothesis",
        "includes",
        "general",
        "case",
        "considerably",
        "le",
        "organism",
        "may",
        "know",
        "fodor",
        "p",
        "classic",
        "illustration",
        "property",
        "come",
        "study",
        "visual",
        "illusion",
        "tend",
        "persist",
        "even",
        "viewer",
        "explicitly",
        "informed",
        "character",
        "stimulus",
        "müllerlyer",
        "illusion",
        "example",
        "two",
        "line",
        "continue",
        "look",
        "unequal",
        "length",
        "even",
        "one",
        "convinced",
        "oneself",
        "otherwise",
        "eg",
        "measuring",
        "ruler",
        "see",
        "figure",
        "figure",
        "müllerlyer",
        "illusion",
        "informational",
        "encapsulation",
        "related",
        "pylyshyn",
        "call",
        "cognitive",
        "impenetrability",
        "two",
        "property",
        "instead",
        "related",
        "genus",
        "specie",
        "cognitive",
        "impenetrability",
        "matter",
        "encapsulation",
        "relative",
        "information",
        "stored",
        "central",
        "memory",
        "paradigmatically",
        "form",
        "belief",
        "utility",
        "system",
        "could",
        "encapsulated",
        "respect",
        "without",
        "encapsulated",
        "across",
        "board",
        "example",
        "auditory",
        "speech",
        "perception",
        "might",
        "encapsulated",
        "relative",
        "belief",
        "utility",
        "unencapsulated",
        "relative",
        "vision",
        "suggested",
        "mcgurk",
        "effect",
        "see",
        "likewise",
        "system",
        "could",
        "unencapsulated",
        "relative",
        "belief",
        "utility",
        "yet",
        "encapsulated",
        "relative",
        "perception",
        "plausible",
        "central",
        "system",
        "character",
        "insofar",
        "operation",
        "sensitive",
        "postperceptual",
        "propositionally",
        "encoded",
        "information",
        "strictly",
        "speaking",
        "cognitive",
        "impenetrability",
        "specific",
        "type",
        "informational",
        "encapsulation",
        "albeit",
        "type",
        "special",
        "architectural",
        "significance",
        "lacking",
        "feature",
        "mean",
        "failing",
        "encapsulation",
        "test",
        "litmus",
        "test",
        "modularity",
        "system",
        "feature",
        "might",
        "still",
        "fail",
        "test",
        "due",
        "information",
        "seepage",
        "different",
        "ie",
        "noncentral",
        "sort",
        "flip",
        "side",
        "informational",
        "encapsulation",
        "inaccessibility",
        "central",
        "monitoring",
        "system",
        "inaccessible",
        "sense",
        "intermediatelevel",
        "representation",
        "computes",
        "prior",
        "producing",
        "output",
        "inaccessible",
        "consciousness",
        "hence",
        "unavailable",
        "explicit",
        "report",
        "effect",
        "centrally",
        "inaccessible",
        "system",
        "whose",
        "internal",
        "processing",
        "opaque",
        "introspection",
        "though",
        "output",
        "system",
        "may",
        "phenomenologically",
        "salient",
        "precursor",
        "state",
        "speech",
        "comprehension",
        "example",
        "likely",
        "involves",
        "successive",
        "elaboration",
        "myriad",
        "representation",
        "various",
        "type",
        "phonological",
        "lexical",
        "syntactic",
        "etc",
        "stimulus",
        "final",
        "productthe",
        "representation",
        "meaning",
        "saidis",
        "consciously",
        "available",
        "mandatoriness",
        "speed",
        "superficiality",
        "addition",
        "informationally",
        "encapsulated",
        "centrally",
        "inaccessible",
        "modular",
        "system",
        "process",
        "fast",
        "cheap",
        "control",
        "borrow",
        "phrase",
        "roboticist",
        "rodney",
        "brook",
        "feature",
        "form",
        "natural",
        "trio",
        "see",
        "operation",
        "cognitive",
        "system",
        "mandatory",
        "case",
        "automatic",
        "conscious",
        "control",
        "bargh",
        "chartrand",
        "mean",
        "like",
        "system",
        "operation",
        "switched",
        "presentation",
        "relevant",
        "stimulus",
        "operation",
        "run",
        "completion",
        "example",
        "native",
        "speaker",
        "english",
        "hear",
        "sound",
        "english",
        "spoken",
        "mere",
        "noise",
        "hear",
        "sound",
        "hear",
        "english",
        "likewise",
        "impossible",
        "see",
        "d",
        "array",
        "object",
        "space",
        "d",
        "patch",
        "color",
        "however",
        "hard",
        "one",
        "may",
        "try",
        "speed",
        "arguably",
        "mark",
        "modularity",
        "requires",
        "least",
        "way",
        "explication",
        "speed",
        "relative",
        "best",
        "way",
        "proceed",
        "way",
        "example",
        "speech",
        "shadowing",
        "generally",
        "considered",
        "fast",
        "typical",
        "lag",
        "time",
        "order",
        "ms",
        "since",
        "syllabic",
        "rate",
        "normal",
        "speech",
        "syllable",
        "per",
        "second",
        "suggests",
        "shadower",
        "processing",
        "stimulus",
        "syllabuslength",
        "bitsprobably",
        "smallest",
        "bit",
        "identified",
        "speech",
        "stream",
        "given",
        "level",
        "syllable",
        "begin",
        "find",
        "stretch",
        "wave",
        "form",
        "whose",
        "acoustic",
        "property",
        "reliably",
        "related",
        "linguistic",
        "value",
        "fodor",
        "p",
        "similarly",
        "impressive",
        "result",
        "available",
        "vision",
        "rapid",
        "serial",
        "visual",
        "presentation",
        "task",
        "matching",
        "picture",
        "description",
        "subject",
        "accurate",
        "ms",
        "exposure",
        "per",
        "picture",
        "accurate",
        "ms",
        "fodor",
        "p",
        "general",
        "cognitive",
        "process",
        "count",
        "fast",
        "fodor",
        "book",
        "take",
        "place",
        "half",
        "second",
        "le",
        "feature",
        "modular",
        "system",
        "output",
        "relatively",
        "shallow",
        "exactly",
        "mean",
        "unclear",
        "depth",
        "output",
        "seems",
        "function",
        "least",
        "two",
        "property",
        "first",
        "much",
        "computation",
        "required",
        "produce",
        "ie",
        "shallow",
        "mean",
        "computationally",
        "cheap",
        "second",
        "constrained",
        "specific",
        "informational",
        "content",
        "ie",
        "shallow",
        "mean",
        "informationally",
        "general",
        "fodor",
        "p",
        "two",
        "property",
        "correlated",
        "output",
        "specific",
        "content",
        "tend",
        "costly",
        "system",
        "compute",
        "vice",
        "versa",
        "writer",
        "interpreted",
        "shallowness",
        "require",
        "nonconceptual",
        "character",
        "eg",
        "carruthers",
        "p",
        "conflict",
        "fodor",
        "gloss",
        "term",
        "suggests",
        "output",
        "plausibly",
        "modular",
        "system",
        "visual",
        "object",
        "recognition",
        "might",
        "encoded",
        "level",
        "basiclevel",
        "concept",
        "like",
        "dog",
        "chair",
        "rosch",
        "et",
        "al",
        "ruled",
        "concept",
        "per",
        "se",
        "highly",
        "theoretical",
        "concept",
        "like",
        "proton",
        "informationally",
        "specific",
        "computationally",
        "expensive",
        "meet",
        "shallowness",
        "criterion",
        "three",
        "feature",
        "discussedmandatoriness",
        "speed",
        "shallownessare",
        "associated",
        "extent",
        "explicable",
        "term",
        "informational",
        "encapsulation",
        "case",
        "le",
        "informationally",
        "speaking",
        "mandatoriness",
        "flow",
        "insensitivity",
        "system",
        "organism",
        "utility",
        "one",
        "dimension",
        "cognitive",
        "impenetrability",
        "speed",
        "depends",
        "upon",
        "efficiency",
        "processing",
        "positively",
        "correlate",
        "encapsulation",
        "far",
        "encapsulation",
        "tends",
        "reduce",
        "system",
        "informational",
        "load",
        "shallowness",
        "similar",
        "story",
        "shallow",
        "output",
        "computationally",
        "cheap",
        "computational",
        "expense",
        "negatively",
        "correlated",
        "encapsulation",
        "short",
        "informationally",
        "encapsulated",
        "system",
        "likely",
        "fast",
        "cheap",
        "control",
        "dissociability",
        "localizability",
        "say",
        "system",
        "functionally",
        "dissociable",
        "say",
        "selectively",
        "impaired",
        "damaged",
        "disabled",
        "little",
        "effect",
        "operation",
        "system",
        "neuropsychological",
        "record",
        "indicates",
        "selective",
        "impairment",
        "sort",
        "frequently",
        "observed",
        "consequence",
        "circumscribed",
        "brain",
        "lesion",
        "standard",
        "example",
        "study",
        "vision",
        "include",
        "prosopagnosia",
        "impaired",
        "face",
        "recognition",
        "achromatopsia",
        "total",
        "color",
        "blindness",
        "akinetopsia",
        "motion",
        "blindness",
        "example",
        "study",
        "language",
        "include",
        "agrammatism",
        "loss",
        "complex",
        "syntax",
        "jargon",
        "aphasia",
        "loss",
        "complex",
        "semantics",
        "alexia",
        "loss",
        "object",
        "word",
        "dyslexia",
        "impaired",
        "reading",
        "writing",
        "disorder",
        "found",
        "otherwise",
        "cognitively",
        "normal",
        "individual",
        "suggesting",
        "lost",
        "capacity",
        "subserved",
        "functionally",
        "dissociable",
        "mechanism",
        "functional",
        "dissociability",
        "associated",
        "neural",
        "localizability",
        "strong",
        "sense",
        "system",
        "strongly",
        "localized",
        "case",
        "implemented",
        "neural",
        "circuitry",
        "relatively",
        "circumscribed",
        "extent",
        "though",
        "necessarily",
        "contiguous",
        "area",
        "b",
        "dedicated",
        "realization",
        "system",
        "alone",
        "localization",
        "sense",
        "go",
        "beyond",
        "mere",
        "implementation",
        "local",
        "neural",
        "circuitry",
        "since",
        "given",
        "bit",
        "circuitry",
        "could",
        "subserve",
        "one",
        "cognitive",
        "function",
        "anderson",
        "proposed",
        "candidate",
        "strong",
        "localization",
        "include",
        "system",
        "color",
        "vision",
        "v",
        "motion",
        "detection",
        "mt",
        "face",
        "recognition",
        "fusiform",
        "gyrus",
        "spatial",
        "scene",
        "recognition",
        "parahippocampal",
        "gyrus",
        "domain",
        "specificity",
        "system",
        "domain",
        "specific",
        "extent",
        "restricted",
        "subject",
        "matter",
        "class",
        "object",
        "property",
        "process",
        "information",
        "circumscribed",
        "relatively",
        "narrow",
        "way",
        "fodor",
        "put",
        "domain",
        "specificity",
        "range",
        "question",
        "device",
        "provides",
        "answer",
        "range",
        "input",
        "computes",
        "analysis",
        "p",
        "narrower",
        "range",
        "input",
        "system",
        "compute",
        "narrower",
        "range",
        "problem",
        "system",
        "solveand",
        "narrower",
        "range",
        "problem",
        "domain",
        "specific",
        "device",
        "alternatively",
        "degree",
        "system",
        "domain",
        "specificity",
        "understood",
        "function",
        "range",
        "input",
        "turn",
        "system",
        "size",
        "range",
        "determines",
        "informational",
        "reach",
        "system",
        "carruthers",
        "samuel",
        "domain",
        "extension",
        "module",
        "typically",
        "finegrained",
        "sensory",
        "modality",
        "like",
        "vision",
        "audition",
        "seems",
        "clear",
        "fodor",
        "list",
        "plausibly",
        "domainspecific",
        "mechanism",
        "includes",
        "system",
        "color",
        "perception",
        "visual",
        "shape",
        "analysis",
        "sentence",
        "parsing",
        "face",
        "voice",
        "recognition",
        "fodor",
        "p",
        "none",
        "correspond",
        "perceptual",
        "linguistic",
        "faculty",
        "intuitive",
        "sense",
        "also",
        "seems",
        "plausible",
        "however",
        "traditional",
        "sense",
        "modality",
        "vision",
        "audition",
        "olfaction",
        "etc",
        "language",
        "faculty",
        "whole",
        "sufficiently",
        "domain",
        "specific",
        "count",
        "displaying",
        "particular",
        "mark",
        "modularity",
        "mccauley",
        "henrich",
        "innateness",
        "final",
        "feature",
        "modular",
        "system",
        "fodor",
        "roster",
        "innateness",
        "understood",
        "property",
        "develop",
        "ing",
        "according",
        "specific",
        "endogenously",
        "determined",
        "pattern",
        "impact",
        "environmental",
        "releasers",
        "fodor",
        "p",
        "view",
        "modular",
        "system",
        "come",
        "online",
        "chiefly",
        "result",
        "brutecausal",
        "process",
        "like",
        "triggering",
        "rather",
        "intentionalcausal",
        "process",
        "like",
        "learning",
        "distinction",
        "see",
        "cowie",
        "alternative",
        "analysis",
        "innateness",
        "based",
        "notion",
        "canalization",
        "see",
        "ariew",
        "familiar",
        "example",
        "language",
        "acquisition",
        "occurs",
        "normal",
        "individual",
        "culture",
        "le",
        "schedule",
        "single",
        "word",
        "month",
        "telegraphic",
        "speech",
        "month",
        "complex",
        "grammar",
        "month",
        "stromswold",
        "candidate",
        "include",
        "visual",
        "object",
        "perception",
        "spelke",
        "lowlevel",
        "mindreading",
        "scholl",
        "leslie"
    ]
}