{
    "main_text": "Political Philosophy || Finance, Money, and Domestic Justice\n5.2 Finance, Money, and Domestic Justice\n\nWhen it comes to domestic social justice, the central question\nrelating to the finance system concerns the ways in which the\nrealization of justice can be helped or hindered by how the financial\nsystem is organized.\n\nA first question here, already touched upon in the discussion about\nmicrofinance above\n (section 4.3.2),\n concerns the status of citizens as participants in financial markets.\nShould they all have a right to certain financial services such as a\nbank account or certain forms of loans, because credit should be seen\nas a primary good in capitalist economies (see, e.g., Hudon 2009,\nSorell 2015, Meyer 2018)? More broadly, how does the pattern of access\nto credit affect the distribution of freedom and unfreedom within\nsociety? (see Dietsch 2021; Preiss 2021). These are not only issues\nfor very poor countries, but also for richer countries with high\neconomic inequality, where it becomes a question of domestic justice.\nIn some countries all residents have the right to open a basic bank\naccount (see bank accounts in the EU in\n Other Internet Resources).\n For others this is not the case. It has been argued that not having\naccess to basic financial services creates an unfairness, because it\ndrives poorer individuals into a cash economy in which they are more\nvulnerable to exploitative lenders, and in which it is more difficult\nto build up savings (e.g., Baradaran 2015). Hence, it has been\nsuggested either to regulate banking services for individuals more\nstrictly (e.g., Herzog 2017a), to consider various forms of household\ndebt relief (Persad 2018), or to offer a public banking service, e.g.,\nrun by the postal office, which offers basic services at affordable\ncosts (Baradaran 2015).\n\nSecondly, financialization may also have more direct effects on\nsocio-economic inequality. Those with managerial positions within the\nfinancial sector are disproportionately represented among the very top\nend of the income distribution, and so the growth of inequality can in\npart be explained by the growth in the financial sector itself\n(Piketty 2014). There may also be an effect on social norms, whereby\nthe “hypermeritocratic” norms of the financial sector have\nplayed a part in increasing social tolerance for inequality in society\nmore broadly (Piketty 2014: 265, 2020; see also O’Neill 2017,\n2021). As Dietsch et al. point out, the process of increasing\nfinancialization within the economies of the advanced industrial\nsocieties has been encouraged by the actions of central banks over\nrecent decades, and so the issue of financialization also connects\nclosely to questions regarding the justice and legitimacy of central\nbanks and monetary policy (Dietsch, Claveau, & Fontan 2016, 2018;\nsee also Jacobs & King 2016).\n\nThirdly, many debates about the relation between distributive justice\nand the financial system revolve around the market for mortgages,\nbecause for many individuals, a house is the single largest item for\nwhich they need to take out a loan, and their mortgage their main\npoint of interaction with the financial system. This means that the\nquestion of who has access to mortgage loans and at what price can\nhave a major impact on the overall distribution of income and wealth.\nIn addition, it has an impact on how financial risks are distributed\nin society. Highly indebted individuals are more vulnerable when it\ncomes to ups and downs either in their personal lives (e.g., illness,\nloss of job, divorce) or in the economy as a whole (e.g., economic\nslumps) (Mian & Sufi 2014). The danger here is that existing\ninequalities—which many theories of justice would describe as\nunjust—are reinforced even further (Herzog 2017a).\n\nHere, however, a question about the institutional division of labor\narises: which goals of distributive justice should be achieved within\nmarkets—and specifically, within financial markets—and\nwhich ones by other means, for example through taxation and\nredistribution? The latter has been the standard approach used by many\nwelfare systems: the idea being to let markets run their course, and\nthen to achieve the desired patterns of distribution by taxation and\nredistribution. If one remains within that paradigm, questions arise\nabout whether the financial sector should be taxed more highly. In\ncontrast, the approach of “pre-distribution” (Hacker 2011;\nO’Neill & Williamson 2012; O’Neill 202), or what\nDietsch calls “process redistribution” (2010), is to\ndesign the rules of the economic game such that they contribute to\nbringing about the distributive pattern that is seen as just. This\ncould, for example, mean regulating banking services and credit\nmarkets in ways that reduce inequality, for example by imposing\nregulations on payday lenders and banks, so that poor individuals are\nprotected from falling into a spiral of ever higher debt. A more\nradical view could be to see the financial problems faced by such\nindividuals as being caused by more general structural injustices the\nsolution of which does not necessarily require interventions with the\nfinancial industry, but rather more general redistributive (or\npredistributive) policies.\n\nMoney creation: Another alternative theoretical\napproach is to integrate distributive concerns into monetary\npolicy, i.e., when it comes to the creation of money. So far, central\nbanks have focused on the stability of currencies and, in some cases,\nlevels of employment. This technical focus, together with the risk\nthat politicians might abuse monetary policy to try to boost the\neconomy before elections, have been used in arguments for putting the\ncontrol of the money supply into the hands of technical experts,\nremoving monetary policy from democratic politics. But after the\nfinancial crisis of 2008, many central banks have used unconventional\nmeasures, such as “quantitative easing”, which had\nstrongly regressive effects, favoring the owners of stocks or of\nlanded property (Fontan et al. 2016, Dietsch 2017); they did not take\ninto account other societal goals, e.g., the financing of green\nenergy, either. This raises new questions of justice: are such\nmeasures justified if their declared aim is to move the economy out of\na slump, which presumably also helps disadvantaged individuals\n(Haldane 2014)? Would other measures, for instance “helicopter\nmoney” that is distributed to all citizens, have been a better\nalternative? And if such measures are used, is it still appropriate to\nthink of central banks as institutions in which nothing but technical\nexpertise is required, or should there be some form of accountability\nto society? (Fontan, Claveau, & Dietsch 2016; Dietsch 2017; Riles\n2018; see also Tucker 2018; van ’t Klooster 2020; James &\nHockett 2020, Downey\n 2021).[2]\n\nWe have already discussed the general issue of the ontological status\nof money\n (section 1.1\n above). But there are also significant questions in political\nphilosophy regarding the question of where, and by what sorts of\ninstitutions, should the money supply be controlled. One complicating\nfactor here is the extensive disagreement about the institutional\nbasis of money creation, as described above. One strand of the credit\ntheory of money emphasizes that in today’s world, money creation\nis a process in which commercial banks play a significant role. These\nbanks in effect create new money when they make new loans to\nindividual or business customers (see McLeay, Radia, & Thomas\n2014; see also Palley 1996; Ryan-Collins et al. 2012; Werner 2014a,b).\nJames Tobin refers to commercial bank-created money, in an evocative\nif now dated image as “fountain pen money”, that is, money\ncreated with the swish of the bank manager’s fountain pen (Tobin\n1963).\n\nHowever, the relationship between private commercial banks and the\ncentral bank is a complicated one, such that we might best think of\nmoney creation as a matter involving a kind of hybrid public-private\npartnership. Hockett and Omarova refer to this relationship as\nconstituting a “finance franchise”, with private banks\nbeing granted on a “franchise” basis the money-creating\npowers of the sovereign monetary authority, while van ’t\nKlooster describes this relation between the public and private as\nconstituting a “hybrid monetary constitution” (Hockett\n& Omarova 2017; van ’t Klooster 2017; see also Bell 2001).\nIn this hybrid public-private monetary system, it is true that private\ncommercial banks create money, but they nevertheless do so in a way\nthat involves being regulated and subject to the authority of the\ncentral bank within each monetary jurisdiction, with that central bank\nalso acting as “lender of last resort” (Bagehot 1873) when\ninter-bank lending dries\n up.[3]\n\nWhen the curious public-private nature of money creation is brought\ninto focus, it is not surprising that there should exist views\nadvocating a shift away from this hybrid monetary constitution, either\nin the direction of a fully public option, or a fully private system\nof money creation.\n\nAdvocates of fully public banking envisage a system in which private\nbanks are stripped of their authority to create new money, and where\ninstead the money supply is directly controlled either by the\ngovernment or by some other state agency; for example by the central\nbank lending directly to firms and households. Such a position can be\ndefended on a number of normative grounds: that a public option would\nallow for greater financial stability, that a fully public system of\nmoney creation would allow a smoother transmission of democratic\ndecisions regarding economic governance; or simply because of the\nconsequences of such a system with regards to socioeconomic inequality\nand environmental sustainability (see Jackson & Dyson 2012; Wolf\n2014a,b; Lainà 2015; Dyson, Hodgson, & van Lerven 2016a,b;\nIngham, Coutts, & Konzelmann 2016; Dow 2016; Wodruff 2019;\nvan’t Klooster 2019, Mellor 2019, Dietsch 2021; for commentary\nand criticism see Goodhart & Jensen 2015; Fontana & Sawyer\n2016, Larue et al. 2020).\n\nIn stark contrast, a number of libertarian authors have defended the\nview that the central bank should have no role in money creation, with\nthe money supply being entirely a matter for private suppliers (and\nwith the consumers of money able to choose between different rival\nsuppliers), under a system of “free banking” (e.g., Simons\n1936; Friedman 1962; von Hayek 1978; Selgin 1988). Advocacy of private\nmoney creation has received a more recent stimulus with the rise of\nBitcoin and other crypto-currencies, with some of Bitcoin’s\nadvocates drawing on similar libertarian arguments to those offered by\nHayek and Selgin (see Golumbia 2016, Robison 2022). One can also\nmention the “alternative currencies” movement here which\ndefends private money creation on entirely different grounds, most\noften by appeal to the value of community (see Larue 2022, Larue et\nal. 2022).\n",
    "section_title": "5.2 Finance, Money, and Domestic Justice",
    "entry_title": "Philosophy of Money and Finance",
    "hierarchy_title": "Philosophy of Money and Finance || Political Philosophy || Finance, Money, and Domestic Justice",
    "tokenized_text": [
        "political",
        "philosophy",
        "finance",
        "money",
        "domestic",
        "justice",
        "finance",
        "money",
        "domestic",
        "justice",
        "come",
        "domestic",
        "social",
        "justice",
        "central",
        "question",
        "relating",
        "finance",
        "system",
        "concern",
        "way",
        "realization",
        "justice",
        "helped",
        "hindered",
        "financial",
        "system",
        "organized",
        "first",
        "question",
        "already",
        "touched",
        "upon",
        "discussion",
        "microfinance",
        "section",
        "concern",
        "status",
        "citizen",
        "participant",
        "financial",
        "market",
        "right",
        "certain",
        "financial",
        "service",
        "bank",
        "account",
        "certain",
        "form",
        "loan",
        "credit",
        "seen",
        "primary",
        "good",
        "capitalist",
        "economy",
        "see",
        "eg",
        "hudon",
        "sorell",
        "meyer",
        "broadly",
        "pattern",
        "access",
        "credit",
        "affect",
        "distribution",
        "freedom",
        "unfreedom",
        "within",
        "society",
        "see",
        "dietsch",
        "preiss",
        "issue",
        "poor",
        "country",
        "also",
        "richer",
        "country",
        "high",
        "economic",
        "inequality",
        "becomes",
        "question",
        "domestic",
        "justice",
        "country",
        "resident",
        "right",
        "open",
        "basic",
        "bank",
        "account",
        "see",
        "bank",
        "account",
        "eu",
        "internet",
        "resource",
        "others",
        "case",
        "argued",
        "access",
        "basic",
        "financial",
        "service",
        "creates",
        "unfairness",
        "drive",
        "poorer",
        "individual",
        "cash",
        "economy",
        "vulnerable",
        "exploitative",
        "lender",
        "difficult",
        "build",
        "saving",
        "eg",
        "baradaran",
        "hence",
        "suggested",
        "either",
        "regulate",
        "banking",
        "service",
        "individual",
        "strictly",
        "eg",
        "herzog",
        "a",
        "consider",
        "various",
        "form",
        "household",
        "debt",
        "relief",
        "persad",
        "offer",
        "public",
        "banking",
        "service",
        "eg",
        "run",
        "postal",
        "office",
        "offer",
        "basic",
        "service",
        "affordable",
        "cost",
        "baradaran",
        "secondly",
        "financialization",
        "may",
        "also",
        "direct",
        "effect",
        "socioeconomic",
        "inequality",
        "managerial",
        "position",
        "within",
        "financial",
        "sector",
        "disproportionately",
        "represented",
        "among",
        "top",
        "end",
        "income",
        "distribution",
        "growth",
        "inequality",
        "part",
        "explained",
        "growth",
        "financial",
        "sector",
        "piketty",
        "may",
        "also",
        "effect",
        "social",
        "norm",
        "whereby",
        "hypermeritocratic",
        "norm",
        "financial",
        "sector",
        "played",
        "part",
        "increasing",
        "social",
        "tolerance",
        "inequality",
        "society",
        "broadly",
        "piketty",
        "see",
        "also",
        "neill",
        "dietsch",
        "et",
        "al",
        "point",
        "process",
        "increasing",
        "financialization",
        "within",
        "economy",
        "advanced",
        "industrial",
        "society",
        "encouraged",
        "action",
        "central",
        "bank",
        "recent",
        "decade",
        "issue",
        "financialization",
        "also",
        "connects",
        "closely",
        "question",
        "regarding",
        "justice",
        "legitimacy",
        "central",
        "bank",
        "monetary",
        "policy",
        "dietsch",
        "claveau",
        "fontan",
        "see",
        "also",
        "jacob",
        "king",
        "thirdly",
        "many",
        "debate",
        "relation",
        "distributive",
        "justice",
        "financial",
        "system",
        "revolve",
        "around",
        "market",
        "mortgage",
        "many",
        "individual",
        "house",
        "single",
        "largest",
        "item",
        "need",
        "take",
        "loan",
        "mortgage",
        "main",
        "point",
        "interaction",
        "financial",
        "system",
        "mean",
        "question",
        "access",
        "mortgage",
        "loan",
        "price",
        "major",
        "impact",
        "overall",
        "distribution",
        "income",
        "wealth",
        "addition",
        "impact",
        "financial",
        "risk",
        "distributed",
        "society",
        "highly",
        "indebted",
        "individual",
        "vulnerable",
        "come",
        "ups",
        "down",
        "either",
        "personal",
        "life",
        "eg",
        "illness",
        "loss",
        "job",
        "divorce",
        "economy",
        "whole",
        "eg",
        "economic",
        "slump",
        "mian",
        "sufi",
        "danger",
        "existing",
        "inequalitieswhich",
        "many",
        "theory",
        "justice",
        "would",
        "describe",
        "unjustare",
        "reinforced",
        "even",
        "herzog",
        "a",
        "however",
        "question",
        "institutional",
        "division",
        "labor",
        "arises",
        "goal",
        "distributive",
        "justice",
        "achieved",
        "within",
        "marketsand",
        "specifically",
        "within",
        "financial",
        "marketsand",
        "one",
        "mean",
        "example",
        "taxation",
        "redistribution",
        "latter",
        "standard",
        "approach",
        "used",
        "many",
        "welfare",
        "system",
        "idea",
        "let",
        "market",
        "run",
        "course",
        "achieve",
        "desired",
        "pattern",
        "distribution",
        "taxation",
        "redistribution",
        "one",
        "remains",
        "within",
        "paradigm",
        "question",
        "arise",
        "whether",
        "financial",
        "sector",
        "taxed",
        "highly",
        "contrast",
        "approach",
        "predistribution",
        "hacker",
        "neill",
        "williamson",
        "neill",
        "dietsch",
        "call",
        "process",
        "redistribution",
        "design",
        "rule",
        "economic",
        "game",
        "contribute",
        "bringing",
        "distributive",
        "pattern",
        "seen",
        "could",
        "example",
        "mean",
        "regulating",
        "banking",
        "service",
        "credit",
        "market",
        "way",
        "reduce",
        "inequality",
        "example",
        "imposing",
        "regulation",
        "payday",
        "lender",
        "bank",
        "poor",
        "individual",
        "protected",
        "falling",
        "spiral",
        "ever",
        "higher",
        "debt",
        "radical",
        "view",
        "could",
        "see",
        "financial",
        "problem",
        "faced",
        "individual",
        "caused",
        "general",
        "structural",
        "injustice",
        "solution",
        "necessarily",
        "require",
        "intervention",
        "financial",
        "industry",
        "rather",
        "general",
        "redistributive",
        "predistributive",
        "policy",
        "money",
        "creation",
        "another",
        "alternative",
        "theoretical",
        "approach",
        "integrate",
        "distributive",
        "concern",
        "monetary",
        "policy",
        "ie",
        "come",
        "creation",
        "money",
        "far",
        "central",
        "bank",
        "focused",
        "stability",
        "currency",
        "case",
        "level",
        "employment",
        "technical",
        "focus",
        "together",
        "risk",
        "politician",
        "might",
        "abuse",
        "monetary",
        "policy",
        "try",
        "boost",
        "economy",
        "election",
        "used",
        "argument",
        "putting",
        "control",
        "money",
        "supply",
        "hand",
        "technical",
        "expert",
        "removing",
        "monetary",
        "policy",
        "democratic",
        "politics",
        "financial",
        "crisis",
        "many",
        "central",
        "bank",
        "used",
        "unconventional",
        "measure",
        "quantitative",
        "easing",
        "strongly",
        "regressive",
        "effect",
        "favoring",
        "owner",
        "stock",
        "landed",
        "property",
        "fontan",
        "et",
        "al",
        "dietsch",
        "take",
        "account",
        "societal",
        "goal",
        "eg",
        "financing",
        "green",
        "energy",
        "either",
        "raise",
        "new",
        "question",
        "justice",
        "measure",
        "justified",
        "declared",
        "aim",
        "move",
        "economy",
        "slump",
        "presumably",
        "also",
        "help",
        "disadvantaged",
        "individual",
        "haldane",
        "would",
        "measure",
        "instance",
        "helicopter",
        "money",
        "distributed",
        "citizen",
        "better",
        "alternative",
        "measure",
        "used",
        "still",
        "appropriate",
        "think",
        "central",
        "bank",
        "institution",
        "nothing",
        "technical",
        "expertise",
        "required",
        "form",
        "accountability",
        "society",
        "fontan",
        "claveau",
        "dietsch",
        "dietsch",
        "riles",
        "see",
        "also",
        "tucker",
        "van",
        "klooster",
        "james",
        "hockett",
        "downey",
        "already",
        "discussed",
        "general",
        "issue",
        "ontological",
        "status",
        "money",
        "section",
        "also",
        "significant",
        "question",
        "political",
        "philosophy",
        "regarding",
        "question",
        "sort",
        "institution",
        "money",
        "supply",
        "controlled",
        "one",
        "complicating",
        "factor",
        "extensive",
        "disagreement",
        "institutional",
        "basis",
        "money",
        "creation",
        "described",
        "one",
        "strand",
        "credit",
        "theory",
        "money",
        "emphasizes",
        "today",
        "world",
        "money",
        "creation",
        "process",
        "commercial",
        "bank",
        "play",
        "significant",
        "role",
        "bank",
        "effect",
        "create",
        "new",
        "money",
        "make",
        "new",
        "loan",
        "individual",
        "business",
        "customer",
        "see",
        "mcleay",
        "radia",
        "thomas",
        "see",
        "also",
        "palley",
        "ryancollins",
        "et",
        "al",
        "werner",
        "a",
        "b",
        "james",
        "tobin",
        "refers",
        "commercial",
        "bankcreated",
        "money",
        "evocative",
        "dated",
        "image",
        "fountain",
        "pen",
        "money",
        "money",
        "created",
        "swish",
        "bank",
        "manager",
        "fountain",
        "pen",
        "tobin",
        "however",
        "relationship",
        "private",
        "commercial",
        "bank",
        "central",
        "bank",
        "complicated",
        "one",
        "might",
        "best",
        "think",
        "money",
        "creation",
        "matter",
        "involving",
        "kind",
        "hybrid",
        "publicprivate",
        "partnership",
        "hockett",
        "omarova",
        "refer",
        "relationship",
        "constituting",
        "finance",
        "franchise",
        "private",
        "bank",
        "granted",
        "franchise",
        "basis",
        "moneycreating",
        "power",
        "sovereign",
        "monetary",
        "authority",
        "van",
        "klooster",
        "describes",
        "relation",
        "public",
        "private",
        "constituting",
        "hybrid",
        "monetary",
        "constitution",
        "hockett",
        "omarova",
        "van",
        "klooster",
        "see",
        "also",
        "bell",
        "hybrid",
        "publicprivate",
        "monetary",
        "system",
        "true",
        "private",
        "commercial",
        "bank",
        "create",
        "money",
        "nevertheless",
        "way",
        "involves",
        "regulated",
        "subject",
        "authority",
        "central",
        "bank",
        "within",
        "monetary",
        "jurisdiction",
        "central",
        "bank",
        "also",
        "acting",
        "lender",
        "last",
        "resort",
        "bagehot",
        "interbank",
        "lending",
        "dry",
        "curious",
        "publicprivate",
        "nature",
        "money",
        "creation",
        "brought",
        "focus",
        "surprising",
        "exist",
        "view",
        "advocating",
        "shift",
        "away",
        "hybrid",
        "monetary",
        "constitution",
        "either",
        "direction",
        "fully",
        "public",
        "option",
        "fully",
        "private",
        "system",
        "money",
        "creation",
        "advocate",
        "fully",
        "public",
        "banking",
        "envisage",
        "system",
        "private",
        "bank",
        "stripped",
        "authority",
        "create",
        "new",
        "money",
        "instead",
        "money",
        "supply",
        "directly",
        "controlled",
        "either",
        "government",
        "state",
        "agency",
        "example",
        "central",
        "bank",
        "lending",
        "directly",
        "firm",
        "household",
        "position",
        "defended",
        "number",
        "normative",
        "ground",
        "public",
        "option",
        "would",
        "allow",
        "greater",
        "financial",
        "stability",
        "fully",
        "public",
        "system",
        "money",
        "creation",
        "would",
        "allow",
        "smoother",
        "transmission",
        "democratic",
        "decision",
        "regarding",
        "economic",
        "governance",
        "simply",
        "consequence",
        "system",
        "regard",
        "socioeconomic",
        "inequality",
        "environmental",
        "sustainability",
        "see",
        "jackson",
        "dyson",
        "wolf",
        "a",
        "b",
        "lainà",
        "dyson",
        "hodgson",
        "van",
        "lerven",
        "a",
        "b",
        "ingham",
        "coutts",
        "konzelmann",
        "dow",
        "wodruff",
        "van",
        "klooster",
        "mellor",
        "dietsch",
        "commentary",
        "criticism",
        "see",
        "goodhart",
        "jensen",
        "fontana",
        "sawyer",
        "larue",
        "et",
        "al",
        "stark",
        "contrast",
        "number",
        "libertarian",
        "author",
        "defended",
        "view",
        "central",
        "bank",
        "role",
        "money",
        "creation",
        "money",
        "supply",
        "entirely",
        "matter",
        "private",
        "supplier",
        "consumer",
        "money",
        "able",
        "choose",
        "different",
        "rival",
        "supplier",
        "system",
        "free",
        "banking",
        "eg",
        "simon",
        "friedman",
        "von",
        "hayek",
        "selgin",
        "advocacy",
        "private",
        "money",
        "creation",
        "received",
        "recent",
        "stimulus",
        "rise",
        "bitcoin",
        "cryptocurrencies",
        "bitcoin",
        "advocate",
        "drawing",
        "similar",
        "libertarian",
        "argument",
        "offered",
        "hayek",
        "selgin",
        "see",
        "golumbia",
        "robison",
        "one",
        "also",
        "mention",
        "alternative",
        "currency",
        "movement",
        "defends",
        "private",
        "money",
        "creation",
        "entirely",
        "different",
        "ground",
        "often",
        "appeal",
        "value",
        "community",
        "see",
        "larue",
        "larue",
        "et",
        "al"
    ]
}