{
    "main_text": "An Argument from God’s Perfection\n3. An Argument from God’s Perfection\n\n\nJohn of Damascus argued that because God is perfect, he is\nnecessarily unique. The only way in which one god could be\ndistinguished from another would be by coming “short of\nperfection in goodness, or power, or wisdom, or time, or place,”\nbut in that case “he would not be God” (John of Damascus,\n173). Aquinas offers a similar argument: If there were several gods,\nthere would be several perfect beings but “if none of these\nperfect beings lacks some perfection,” and if none of them has\n“any admixture of imperfection …., nothing will be given\nin which to distinguish the perfect beings from one another”\n(Aquinas, 158).\n\n\nArguments like this make two assumptions. The first is that\nproperties can be exhaustively divided into three classes. The first\nclass is the class of imperfections, that is, limitations (my inability\nto run a two minute mile, for instance) or privations (for example,\nblindness or sin—properties that imply defects, some deviation\nfrom the standards appropriate for evaluating beings of the kind in\nquestion). The second is the class of mixed perfections, that is,\ngood-making properties that entail some limitation (for example, being\nhuman or being corporeal) or privation (repentance, for instance). The\nthird class is that of pure perfections—perfections that entail\nno limitation or privation (for example, being, goodness, love,\nknowledge, power, unity, or independence). The second assumption is\nthat God possesses all and only pure perfections. With these\nassumptions in place, the argument works. Two gods couldn’t be\ndistinguished by a difference in their pure perfections since both gods\nhave all of them. And they couldn’t be distinguished by a difference in\ntheir other properties because they haven’t any.\n\n\nUnfortunately, both assumptions seem false. For God appears to\npossess some properties which are neither imperfections, mixed\nperfections, nor pure perfections. If he does, then some properties\nbelong to none of our three classes, and not all of God’s properties\nare pure perfections.\n\n\nThe property of being the ultimate cause of my existence appears to\nbe an example. The property isn’t a (pure) perfection but, rather, a\ncontingent expression of a (pure) perfection, namely, the\nexercise of creative power. (God is perhaps better or more splendid for\nexercising creative power, but he is not better or more splendid for\nhaving created me.) But neither is it a limitation or\nprivation (though it is not, of course, a full or\ncomplete expression of the relevant divine perfection). Nor\ndoes it appear to be a mixed perfection. God’s instantiating a possible\nworld containing me precludes his instantiating possible worlds which\nlack this interesting feature but entails no inherent limitation or\ndefect in his creative abilities. At least one real property, then, is\nneither an imperfection, mixed perfection, or pure perfection; and at\nleast one of God’s real properties isn’t a pure perfection. Both of the\nassumptions on which the argument is based are thus false.\n\n\nThe argument from divine perfection, like the argument from God’s\nsimplicity, fails because God appears to possess some of his real\nproperties contingently. Yet the question remains, could two\ngods be distinguished on the basis of a difference in their contingent\nproperties? It is doubtful that the contingent properties we have\ndiscussed will serve our purpose. “Knowing that Jones\nexists” would (in a world containing Jones) be a property of any\nomniscient being existing in that world. And “Creates\nSmith” would (in a world containing Smith) be a property of any\ncreator of that world. Perhaps all of God’s real but contingent\nproperties are expressions of his perfect knowledge, goodness, and\ncreative power. And perhaps it is impossible for two gods to exhibit\ndifferent expressions of this in the same possible world: In any\npossible world, w, two omniscient beings would know the same things;\nbeing supremely good their appreciations and valuations of the things\nin w would presumably be identical; and each would be the creative\nground of everything else that exists in w. If all of God’s real but\ncontingent properties are expressions of his pure perfections and if,\nfor any possible world, two gods couldn’t exhibit different expressions\nof those perfections in that world, then no possible world contains two\ngods.\n\n\nFurthermore, if there are individual essences, two individuals,\nx and y, couldn’t differ only in their\ncontingent properties. (I is an individual essence of\nx if and only if x has I in every possible\nworld in which it exists and, for any individual, y, and any\npossible world, w, if y has I in w,\ny in w is identical with x.) For suppose\nthey did. Then their essential properties would be the same. A\nbeing’s individual essence is an essential property of it, however.\nHence, if x and y had the same essential properties,\nthey would also have to have the same individual essence. But, in that\ncase, x and y wouldn’t be two individuals\ncontrary to our supposition. And if no two beings can differ\nonly with respect to their contingent properties, two gods can’t\neither. (For a sophisticated version of an argument of this type see\nZagzebski 1989.)\n\n\nCould two gods be distinguished by a difference in their\nessential properties, however? (The doctrine of simplicity may\nentail that they can’t but—as noted above—the doctrine\nof simplicity is controversial.) Each god would obviously have to have\nall the properties essential to divinity (omniscience, omnipotence,\nperfect goodness, and the like). But could they be differentiated by\nessential properties peculiar to each? Could, in other words, the first\ngod have an essential property which the second god lacks, or vice\nversa? Zagzebski (1989) thinks that it can’t. Human beings are\ndistinguished in virtue of their having different individual essences,\nand human rational beings and angelic rational beings are distinguished\nin virtue of their possessing the properties essential to humanity and\nto angelhood, respectively. But no individual human (way of being\nhuman) exhausts the fullness of humanity (the many ways of being\nhuman), and neither humanity nor angelhood exhaust the fullness of\nrationality (the many different ways of being rational). Being divine,\non the other hand, entails being “wholly” or\n“perfectly” divine, that is, being everything a divine\nbeing could possibly be. So “two divine beings” could not\ndiffer “in an essential property” in the way in which\nindividual human beings, or human beings and angelic beings, can.\n(Zagzebski 1989, 10–11)\n\n\nIs this argument entirely compelling, though? Arguably, it is\nimpossible for any individual to exemplify all the possible ways of\nbeing human or all of the possible ways of being rational. So why\nassume that it is possible for a being to exemplify all the possible\nways of being divine? Why think, in other words, that there aren’t\ndifferent and mutually exclusive ways of exemplifying\ndivinity—being Allah as depicted in the Quran, for example, or\nbeing the triune God of Christianity, or the Vishnu of the Shri\nVaishnavas? (For more on some of these possibilities see section 7\nbelow.) Or again, suppose that the relevant differentiating property\nis having a certain emotional or mental temper—Yahweh’s as\ndepicted in the Hebrew Bible, say, or Krishna’s as depicted in the\nBhagavata Purana. Suppose further that neither of these emotional or\nmental tempers is better or more worshipful than the other. Isn’t it\nan open question, at least, whether either of these emotional or\nmental tempers is essential to\ndivinity although they may be essential to being\nYahweh or being Krishna, respectively? If they aren’t, then it is by no\nmeans clear that any being can exhaust the fullness of\ndivinity.\n\n\nWhile the arguments we have discussed in the last two sections are\nimpressive, they hinge on claims that would not be accepted by all\ntheists—that God is simple, for example, or that there are real\nindividual essences, or that any wholly or perfectly divine being\nexhausts the fullness of divinity. By contrast, the three arguments\nthat we will examine next are firmly rooted in attributes which almost\nall theists ascribe to God—his universal sovereignty,\nomnipotence, and demand for total devotion—and are thus more\ncompelling.\n",
    "section_title": "3. An Argument from God’s Perfection",
    "entry_title": "Monotheism",
    "hierarchy_title": "Monotheism || An Argument from God’s Perfection",
    "tokenized_text": [
        "argument",
        "god",
        "perfection",
        "argument",
        "god",
        "perfection",
        "john",
        "damascus",
        "argued",
        "god",
        "perfect",
        "necessarily",
        "unique",
        "way",
        "one",
        "god",
        "could",
        "distinguished",
        "another",
        "would",
        "coming",
        "short",
        "perfection",
        "goodness",
        "power",
        "wisdom",
        "time",
        "place",
        "case",
        "would",
        "god",
        "john",
        "damascus",
        "aquinas",
        "offer",
        "similar",
        "argument",
        "several",
        "god",
        "would",
        "several",
        "perfect",
        "being",
        "none",
        "perfect",
        "being",
        "lack",
        "perfection",
        "none",
        "admixture",
        "imperfection",
        "nothing",
        "given",
        "distinguish",
        "perfect",
        "being",
        "one",
        "another",
        "aquinas",
        "argument",
        "like",
        "make",
        "two",
        "assumption",
        "first",
        "property",
        "exhaustively",
        "divided",
        "three",
        "class",
        "first",
        "class",
        "class",
        "imperfection",
        "limitation",
        "inability",
        "run",
        "two",
        "minute",
        "mile",
        "instance",
        "privation",
        "example",
        "blindness",
        "sinproperties",
        "imply",
        "defect",
        "deviation",
        "standard",
        "appropriate",
        "evaluating",
        "being",
        "kind",
        "question",
        "second",
        "class",
        "mixed",
        "perfection",
        "goodmaking",
        "property",
        "entail",
        "limitation",
        "example",
        "human",
        "corporeal",
        "privation",
        "repentance",
        "instance",
        "third",
        "class",
        "pure",
        "perfectionsperfections",
        "entail",
        "limitation",
        "privation",
        "example",
        "goodness",
        "love",
        "knowledge",
        "power",
        "unity",
        "independence",
        "second",
        "assumption",
        "god",
        "posse",
        "pure",
        "perfection",
        "assumption",
        "place",
        "argument",
        "work",
        "two",
        "god",
        "distinguished",
        "difference",
        "pure",
        "perfection",
        "since",
        "god",
        "distinguished",
        "difference",
        "property",
        "unfortunately",
        "assumption",
        "seem",
        "false",
        "god",
        "appears",
        "posse",
        "property",
        "neither",
        "imperfection",
        "mixed",
        "perfection",
        "pure",
        "perfection",
        "property",
        "belong",
        "none",
        "three",
        "class",
        "god",
        "property",
        "pure",
        "perfection",
        "property",
        "ultimate",
        "cause",
        "existence",
        "appears",
        "example",
        "property",
        "pure",
        "perfection",
        "rather",
        "contingent",
        "expression",
        "pure",
        "perfection",
        "namely",
        "exercise",
        "creative",
        "power",
        "god",
        "perhaps",
        "better",
        "splendid",
        "exercising",
        "creative",
        "power",
        "better",
        "splendid",
        "created",
        "neither",
        "limitation",
        "privation",
        "though",
        "course",
        "full",
        "complete",
        "expression",
        "relevant",
        "divine",
        "perfection",
        "appear",
        "mixed",
        "perfection",
        "god",
        "instantiating",
        "possible",
        "world",
        "containing",
        "precludes",
        "instantiating",
        "possible",
        "world",
        "lack",
        "interesting",
        "feature",
        "entail",
        "inherent",
        "limitation",
        "defect",
        "creative",
        "ability",
        "least",
        "one",
        "real",
        "property",
        "neither",
        "imperfection",
        "mixed",
        "perfection",
        "pure",
        "perfection",
        "least",
        "one",
        "god",
        "real",
        "property",
        "pure",
        "perfection",
        "assumption",
        "argument",
        "based",
        "thus",
        "false",
        "argument",
        "divine",
        "perfection",
        "like",
        "argument",
        "god",
        "simplicity",
        "fails",
        "god",
        "appears",
        "posse",
        "real",
        "property",
        "contingently",
        "yet",
        "question",
        "remains",
        "could",
        "two",
        "god",
        "distinguished",
        "basis",
        "difference",
        "contingent",
        "property",
        "doubtful",
        "contingent",
        "property",
        "discussed",
        "serve",
        "purpose",
        "knowing",
        "jones",
        "exists",
        "would",
        "world",
        "containing",
        "jones",
        "property",
        "omniscient",
        "existing",
        "world",
        "creates",
        "smith",
        "would",
        "world",
        "containing",
        "smith",
        "property",
        "creator",
        "world",
        "perhaps",
        "god",
        "real",
        "contingent",
        "property",
        "expression",
        "perfect",
        "knowledge",
        "goodness",
        "creative",
        "power",
        "perhaps",
        "impossible",
        "two",
        "god",
        "exhibit",
        "different",
        "expression",
        "possible",
        "world",
        "possible",
        "world",
        "w",
        "two",
        "omniscient",
        "being",
        "would",
        "know",
        "thing",
        "supremely",
        "good",
        "appreciation",
        "valuation",
        "thing",
        "w",
        "would",
        "presumably",
        "identical",
        "would",
        "creative",
        "ground",
        "everything",
        "else",
        "exists",
        "w",
        "god",
        "real",
        "contingent",
        "property",
        "expression",
        "pure",
        "perfection",
        "possible",
        "world",
        "two",
        "god",
        "exhibit",
        "different",
        "expression",
        "perfection",
        "world",
        "possible",
        "world",
        "contains",
        "two",
        "god",
        "furthermore",
        "individual",
        "essence",
        "two",
        "individual",
        "x",
        "differ",
        "contingent",
        "property",
        "individual",
        "essence",
        "x",
        "x",
        "every",
        "possible",
        "world",
        "exists",
        "individual",
        "possible",
        "world",
        "w",
        "w",
        "w",
        "identical",
        "x",
        "suppose",
        "essential",
        "property",
        "would",
        "individual",
        "essence",
        "essential",
        "property",
        "however",
        "hence",
        "x",
        "essential",
        "property",
        "would",
        "also",
        "individual",
        "essence",
        "case",
        "x",
        "two",
        "individual",
        "contrary",
        "supposition",
        "two",
        "being",
        "differ",
        "respect",
        "contingent",
        "property",
        "two",
        "god",
        "either",
        "sophisticated",
        "version",
        "argument",
        "type",
        "see",
        "zagzebski",
        "could",
        "two",
        "god",
        "distinguished",
        "difference",
        "essential",
        "property",
        "however",
        "doctrine",
        "simplicity",
        "may",
        "entail",
        "butas",
        "noted",
        "abovethe",
        "doctrine",
        "simplicity",
        "controversial",
        "god",
        "would",
        "obviously",
        "property",
        "essential",
        "divinity",
        "omniscience",
        "omnipotence",
        "perfect",
        "goodness",
        "like",
        "could",
        "differentiated",
        "essential",
        "property",
        "peculiar",
        "could",
        "word",
        "first",
        "god",
        "essential",
        "property",
        "second",
        "god",
        "lack",
        "vice",
        "versa",
        "zagzebski",
        "think",
        "human",
        "being",
        "distinguished",
        "virtue",
        "different",
        "individual",
        "essence",
        "human",
        "rational",
        "being",
        "angelic",
        "rational",
        "being",
        "distinguished",
        "virtue",
        "possessing",
        "property",
        "essential",
        "humanity",
        "angelhood",
        "respectively",
        "individual",
        "human",
        "way",
        "human",
        "exhaust",
        "fullness",
        "humanity",
        "many",
        "way",
        "human",
        "neither",
        "humanity",
        "angelhood",
        "exhaust",
        "fullness",
        "rationality",
        "many",
        "different",
        "way",
        "rational",
        "divine",
        "hand",
        "entail",
        "wholly",
        "perfectly",
        "divine",
        "everything",
        "divine",
        "could",
        "possibly",
        "two",
        "divine",
        "being",
        "could",
        "differ",
        "essential",
        "property",
        "way",
        "individual",
        "human",
        "being",
        "human",
        "being",
        "angelic",
        "being",
        "zagzebski",
        "argument",
        "entirely",
        "compelling",
        "though",
        "arguably",
        "impossible",
        "individual",
        "exemplify",
        "possible",
        "way",
        "human",
        "possible",
        "way",
        "rational",
        "assume",
        "possible",
        "exemplify",
        "possible",
        "way",
        "divine",
        "think",
        "word",
        "different",
        "mutually",
        "exclusive",
        "way",
        "exemplifying",
        "divinitybeing",
        "allah",
        "depicted",
        "quran",
        "example",
        "triune",
        "god",
        "christianity",
        "vishnu",
        "shri",
        "vaishnava",
        "possibility",
        "see",
        "section",
        "suppose",
        "relevant",
        "differentiating",
        "property",
        "certain",
        "emotional",
        "mental",
        "temperyahweh",
        "depicted",
        "hebrew",
        "bible",
        "say",
        "krishna",
        "depicted",
        "bhagavata",
        "purana",
        "suppose",
        "neither",
        "emotional",
        "mental",
        "temper",
        "better",
        "worshipful",
        "open",
        "question",
        "least",
        "whether",
        "either",
        "emotional",
        "mental",
        "temper",
        "essential",
        "divinity",
        "although",
        "may",
        "essential",
        "yahweh",
        "krishna",
        "respectively",
        "mean",
        "clear",
        "exhaust",
        "fullness",
        "divinity",
        "argument",
        "discussed",
        "last",
        "two",
        "section",
        "impressive",
        "hinge",
        "claim",
        "would",
        "accepted",
        "theiststhat",
        "god",
        "simple",
        "example",
        "real",
        "individual",
        "essence",
        "wholly",
        "perfectly",
        "divine",
        "exhaust",
        "fullness",
        "divinity",
        "contrast",
        "three",
        "argument",
        "examine",
        "next",
        "firmly",
        "rooted",
        "attribute",
        "almost",
        "theist",
        "ascribe",
        "godhis",
        "universal",
        "sovereignty",
        "omnipotence",
        "demand",
        "total",
        "devotionand",
        "thus",
        "compelling"
    ]
}