{
    "main_text": "A Philosophy of Free Judgment\n3. A Philosophy of Free Judgment\n\n   Montaigne rejects the theoretical or speculative way of\nphilosophizing that prevailed under the Scholastics ever since the\nMiddle Ages. According to him, science does not exist, but only a\ngeneral belief in science. Petrarch had already criticized the\nScholastics for worshiping Aristotle as their God. Siding with the\nhumanists, Montaigne develops a sharp criticism of science\n“à la mode des\n Geométriens”,[7]\n the mos geometricus deemed to be the most rigorous.  It is\nmerely “a practice and business of\n science”,[8]\n he says, which is restricted to the University and essentially\ncarried out between masters and their disciples. The main problem of\nthis kind of science is that it makes us spend our time justifying as\nrational the beliefs we inherit, instead of calling into question\ntheir foundations; it makes us label fashionable opinions as truth,\ninstead of gauging their strength. Whereas science should be a free\ninquiry, it consists only in gibberish discussions on how we should\nread Aristotle or\n Galen.[9]\n Critical judgment is systematically silenced.  Montaigne demands a\nthought process that would not be tied down by any doctrinaire\nprinciple, a thought process that would lead to free enquiry. \n\n    If we trace back the birth of modern science, we find that\nMontaigne as a philosopher was ahead of his time. In 1543, Copernicus\nput the earth in motion, depriving man of his cosmological\ncentrality. Yet he nevertheless changed little in the medieval\nconception of the world as a sphere. The Copernican world became an\n“open” world only with Thomas Digges (1576) although his\nsky was still situated in space, inhabited by gods and\n angels.[10]\n One has to wait for Giordano Bruno to find the first representative\nof the modern conception of an infinite universe (1584). But whether\nBruno is a modern mind remains controversial (the planets are still\nanimals, etc). Montaigne, on the contrary, is entirely free from the\nmedieval conception of the spheres. He owes his cosmological freedom\nto his deep interest in ancient philosophers, to Lucretius in\nparticular. In the longest chapter of the Essays, the\n“Apologie de Raymond Sebond”, Montaigne conjures up many\nopinions, regarding the nature of the cosmos, or the nature of the\nsoul. He weighs the Epicureans’ opinion that several worlds exist,\nagainst that of the unicity of the world put forth by both Aristotle\nand Aquinas. He comes out in favor of the former, without ranking his\nown evaluation as a truth. \nAs a humanist, Montaigne conceived of philosophy as morals. In the\nchapter “On the education of\n children”,[11]\n education is identified with philosophy, this being understood as the\nformation of judgment and manners in everyday life: “for\nphilosophy, which, as the molder of judgment and conduct, will be his\nprincipal lesson, has the privilege of being everywhere at\n home”.[12]\n Philosophy, which consists essentially in the use of judgment,\nis significant to the very ordinary, varied and\n “undulating”[13]\n process of life. In fact, under the guise of innocuous anecdotes,\nMontaigne achieved the humanist revolution in philosophy.  He moved\nfrom a conception of philosophy conceived of as theoretical science,\nto a philosophy conceived of as the practice of free\njudgment. Lamenting that “philosophy, even with people of\nunderstanding, should be an empty and fantastic name, a thing of no\nuse and no\n value”,[14]\n he asserted that philosophy should be the most cheerful activity. He\npractised philosophy by setting his judgment to trial, in order to\nbecome aware of its weaknesses, but also to get to know its\nstrength. “Every movement reveals\n us”,[15]\n but our judgments do so the best. At the beginning of the past\ncentury, one of Montaigne’s greatest commentators, Pierre Villey,\ndeveloped the idea that Montaigne truly became himself through\nwriting. This idea remains more or less true, in spite of its obvious\nlink with late romanticist psychology. The Essays remain an\nexceptional historical testimony of the progress of privacy and\nindividualism, a blossoming of subjectivity, an attainment of personal\nmaturity that will be copied, but maybe never matched since. It\nseems that Montaigne, who dedicated himself to freedom of the mind and\npeacefulness of the soul, did not have any other aim through writing than\ncultivating and educating himself. Since philosophy had failed to\ndetermine a secure path towards happiness, he committed each individual\nto do\n so in his own way.[16]\n\n\n  Montaigne wants to escape the stifling of thought by knowledge, a\nwide-spread phenomenon which he called\n “pedantism”,[17]\n an idea that he may have gleaned from the tarnishing of professors by\nthe Commedia dell’arte. He praises one of the most\nfamous professors of the day, Adrianus Turnebus, for having combined \nrobust judgment with massive erudition. We have to moderate\nour thirst for knowledge, just as we do our appetite for\npleasure. Siding here with Callicles against Plato, Montaigne asserts\nthat a gentleman should not dedicate himself entirely to\n philosophy.[18]\n Practised with restraint, it proves useful, whereas in excess it leads\nto eccentricity and\n insociability.[19]\n Reflecting on the education of the children of the aristocracy\n(chapter I, 26, is dedicated to the countess Diane de Foix, who was\nthen pregnant), Montaigne departs significantly from a traditional\nhumanist education, the very one he himself received. Instead of\nfocusing on the ways and means of making the teaching of Latin more\neffective, as pedagogues in the wake of Erasmus usually did, Montaigne\nstresses the need for action and playful activities. The child will\nconform early to social and political customs, but without\nservility. The use of judgment in every circumstance, as a warrant for\npractical intelligence and personal freedom, has to remain at the core\nof education. He transfers the major responsibility of education from\nthe school to everyday life: “Wonderful brilliance may be gained\nfor human judgment by getting to know\n men”.[20]\n The priority given to the formation of judgment and character\nstrongly opposes the craving for a powerful memory during his time. He\nreserves for himself the freedom to pick up bits of knowledge here and\nthere, displaying the “nonchalance” or unconcern intellectually, much in\nthe same way that Castiglione’s courtier would use\nsprezzatura in social relationships. Although Montaigne\npresents this nonchalance as essential to his nature, his position is\nnot innocent: it allows him to take on the voice now of a Stoic, and\nthen of a Sceptic, now of an Epicurean and then of a\nChristian. Although his views are never fully original, they always\nbear his unmistakable mark. Montaigne’s thought, which is often rated\nas modern in so many aspects, remains deeply rooted in the classical\ntradition. Montaigne navigates easily through heaps of classical\nknowledge, proposing remarkable literary and philosophical innovations\nalong the way. \n\n   Montaigne begins his project to know man by noticing that the same\nhuman behavior can have opposite effects, or that even opposite conducts\ncan have the same effects: “by diverse means we arrive at the\nsame\n end”.[21]\n Human life cannot be turned into an object of rational theory. Human\nconduct does not obey universal rules, but a great diversity of rules,\namong which the most accurate still fall short of the intended mark.\n“Human reason is a tincture infused in about equal strength in\nall our opinions and ways, whatever their form: infinite in substance,\ninfinite in\n diversity”[22]\n says the chapter on custom. By focusing on anecdotal experience,\nMontaigne comes thus to write “the masterpiece of modern moral\nscience”, according to the great commentator Hugo Friedrich.  He\ngives up the moral ambition of telling how men should live, in order\nto arrive at a non-prejudiced mind for knowing man as he\nis. “Others form man, I tell of\n him”.[23]\n Man is ever since “without a definition”, as philosopher Marcel Conche\n commented.[24]\n In the chapter “Apologie de Raimond Sebond”, Montaigne\ndraws from classical and Renaissance knowledge in order to remind us\nthat, in some parts of the world, we find men that bear little\nresemblance to us. Our experience of man and things should not be\nperceived as limited by our present standards of judgment. It is \na sort of madness when we settle limits for the possible and the\n impossible.[25]\n\nPhilosophy has failed to secure man a determined idea of his place\nin the world, or of his nature. Metaphysical or psychological\nopinions, indeed far too numerous, come as a burden more than as a\nhelp. Montaigne pursues his quest for knowledge through experience;\nthe meaning of concepts is not set down by means of a definition, it\nis related to common language or to historical examples. One of the\nessential elements of experience is the ability to reflect on one’s\nactions and thoughts. Montaigne is engaging in a case-by-case\ngnôti seauton, “know thyself”: although truth\nin general is not truly an appropriate object for human faculties, we\ncan reflect on our experience. What counts is not the fact that we\neventually know the truth or not, but rather the way in which we seek\n it. “The question is not who will hit the\nring, but who will make the best runs at\n it.”[26] \nThe aim is to properly\nexercise our judgment. \n\n  Montaigne’s thinking baffles our most common categories. The vision\nof an ever-changing world that he developed threatens the being of\nall things.  “We have no communication with\n being”.[27]\n We wrongly take that which appears for that which is, and we indulge\nin a dogmatic, deceptive language that is cut off from an\never-changing reality. We ought to be more careful with our use of\nlanguage.  Montaigne would prefer that children be taught other ways\nof speaking, more appropriate to the nature of human inquiry, such as\n“What does that mean ?”, “I do not understand\nit”, “This might be”, “Is it\n true?”[28]\n Montaigne himself is fond of “these formulas that soften the\nboldness of our propositions”: “perhaps”, “to\nsome extent”, “they say”, “I\n think”,[29]\n and the like. Criticism on theory and dogmatism permeates for example\nhis reflexion on politics. Because social order is too complicated to\nbe mastered by individual reason, he deems conservatism as the wisest\n stance.[30]\n This policy is grounded on the general evaluation that change is\nusually more damaging than the conservation of social\ninstitutions. Nevertheless, there may be certain circumstances that\nadvocate change as a better solution, as history sometimes\nshowed. Reason being then unable to decide a priori,\njudgment must come into play and alternate its views to find the best option. \n",
    "section_title": "3. A Philosophy of Free Judgment",
    "entry_title": "Michel de Montaigne",
    "hierarchy_title": "Michel de Montaigne || A Philosophy of Free Judgment",
    "tokenized_text": [
        "philosophy",
        "free",
        "judgment",
        "philosophy",
        "free",
        "judgment",
        "montaigne",
        "reject",
        "theoretical",
        "speculative",
        "way",
        "philosophizing",
        "prevailed",
        "scholastic",
        "ever",
        "since",
        "middle",
        "age",
        "according",
        "science",
        "exist",
        "general",
        "belief",
        "science",
        "petrarch",
        "already",
        "criticized",
        "scholastic",
        "worshiping",
        "aristotle",
        "god",
        "siding",
        "humanist",
        "montaigne",
        "develops",
        "sharp",
        "criticism",
        "science",
        "à",
        "la",
        "mode",
        "de",
        "geométriens",
        "mo",
        "geometricus",
        "deemed",
        "rigorous",
        "merely",
        "practice",
        "business",
        "science",
        "say",
        "restricted",
        "university",
        "essentially",
        "carried",
        "master",
        "disciple",
        "main",
        "problem",
        "kind",
        "science",
        "make",
        "u",
        "spend",
        "time",
        "justifying",
        "rational",
        "belief",
        "inherit",
        "instead",
        "calling",
        "question",
        "foundation",
        "make",
        "u",
        "label",
        "fashionable",
        "opinion",
        "truth",
        "instead",
        "gauging",
        "strength",
        "whereas",
        "science",
        "free",
        "inquiry",
        "consists",
        "gibberish",
        "discussion",
        "read",
        "aristotle",
        "galen",
        "critical",
        "judgment",
        "systematically",
        "silenced",
        "montaigne",
        "demand",
        "thought",
        "process",
        "would",
        "tied",
        "doctrinaire",
        "principle",
        "thought",
        "process",
        "would",
        "lead",
        "free",
        "enquiry",
        "trace",
        "back",
        "birth",
        "modern",
        "science",
        "find",
        "montaigne",
        "philosopher",
        "ahead",
        "time",
        "copernicus",
        "put",
        "earth",
        "motion",
        "depriving",
        "man",
        "cosmological",
        "centrality",
        "yet",
        "nevertheless",
        "changed",
        "little",
        "medieval",
        "conception",
        "world",
        "sphere",
        "copernican",
        "world",
        "became",
        "open",
        "world",
        "thomas",
        "digges",
        "although",
        "sky",
        "still",
        "situated",
        "space",
        "inhabited",
        "god",
        "angel",
        "one",
        "wait",
        "giordano",
        "bruno",
        "find",
        "first",
        "representative",
        "modern",
        "conception",
        "infinite",
        "universe",
        "whether",
        "bruno",
        "modern",
        "mind",
        "remains",
        "controversial",
        "planet",
        "still",
        "animal",
        "etc",
        "montaigne",
        "contrary",
        "entirely",
        "free",
        "medieval",
        "conception",
        "sphere",
        "owes",
        "cosmological",
        "freedom",
        "deep",
        "interest",
        "ancient",
        "philosopher",
        "lucretius",
        "particular",
        "longest",
        "chapter",
        "essay",
        "apologie",
        "de",
        "raymond",
        "sebond",
        "montaigne",
        "conjures",
        "many",
        "opinion",
        "regarding",
        "nature",
        "cosmos",
        "nature",
        "soul",
        "weighs",
        "epicurean",
        "opinion",
        "several",
        "world",
        "exist",
        "unicity",
        "world",
        "put",
        "forth",
        "aristotle",
        "aquinas",
        "come",
        "favor",
        "former",
        "without",
        "ranking",
        "evaluation",
        "truth",
        "humanist",
        "montaigne",
        "conceived",
        "philosophy",
        "moral",
        "chapter",
        "education",
        "child",
        "education",
        "identified",
        "philosophy",
        "understood",
        "formation",
        "judgment",
        "manner",
        "everyday",
        "life",
        "philosophy",
        "molder",
        "judgment",
        "conduct",
        "principal",
        "lesson",
        "privilege",
        "everywhere",
        "home",
        "philosophy",
        "consists",
        "essentially",
        "use",
        "judgment",
        "significant",
        "ordinary",
        "varied",
        "undulating",
        "process",
        "life",
        "fact",
        "guise",
        "innocuous",
        "anecdote",
        "montaigne",
        "achieved",
        "humanist",
        "revolution",
        "philosophy",
        "moved",
        "conception",
        "philosophy",
        "conceived",
        "theoretical",
        "science",
        "philosophy",
        "conceived",
        "practice",
        "free",
        "judgment",
        "lamenting",
        "philosophy",
        "even",
        "people",
        "understanding",
        "empty",
        "fantastic",
        "name",
        "thing",
        "use",
        "value",
        "asserted",
        "philosophy",
        "cheerful",
        "activity",
        "practised",
        "philosophy",
        "setting",
        "judgment",
        "trial",
        "order",
        "become",
        "aware",
        "weakness",
        "also",
        "get",
        "know",
        "strength",
        "every",
        "movement",
        "reveals",
        "u",
        "judgment",
        "best",
        "beginning",
        "past",
        "century",
        "one",
        "montaigne",
        "greatest",
        "commentator",
        "pierre",
        "villey",
        "developed",
        "idea",
        "montaigne",
        "truly",
        "became",
        "writing",
        "idea",
        "remains",
        "le",
        "true",
        "spite",
        "obvious",
        "link",
        "late",
        "romanticist",
        "psychology",
        "essay",
        "remain",
        "exceptional",
        "historical",
        "testimony",
        "progress",
        "privacy",
        "individualism",
        "blossoming",
        "subjectivity",
        "attainment",
        "personal",
        "maturity",
        "copied",
        "maybe",
        "never",
        "matched",
        "since",
        "seems",
        "montaigne",
        "dedicated",
        "freedom",
        "mind",
        "peacefulness",
        "soul",
        "aim",
        "writing",
        "cultivating",
        "educating",
        "since",
        "philosophy",
        "failed",
        "determine",
        "secure",
        "path",
        "towards",
        "happiness",
        "committed",
        "individual",
        "way",
        "montaigne",
        "want",
        "escape",
        "stifling",
        "thought",
        "knowledge",
        "widespread",
        "phenomenon",
        "called",
        "pedantism",
        "idea",
        "may",
        "gleaned",
        "tarnishing",
        "professor",
        "commedia",
        "dell",
        "arte",
        "praise",
        "one",
        "famous",
        "professor",
        "day",
        "adrianus",
        "turnebus",
        "combined",
        "robust",
        "judgment",
        "massive",
        "erudition",
        "moderate",
        "thirst",
        "knowledge",
        "appetite",
        "pleasure",
        "siding",
        "callicles",
        "plato",
        "montaigne",
        "asserts",
        "gentleman",
        "dedicate",
        "entirely",
        "philosophy",
        "practised",
        "restraint",
        "prof",
        "useful",
        "whereas",
        "excess",
        "lead",
        "eccentricity",
        "insociability",
        "reflecting",
        "education",
        "child",
        "aristocracy",
        "chapter",
        "dedicated",
        "countess",
        "diane",
        "de",
        "foix",
        "pregnant",
        "montaigne",
        "departs",
        "significantly",
        "traditional",
        "humanist",
        "education",
        "one",
        "received",
        "instead",
        "focusing",
        "way",
        "mean",
        "making",
        "teaching",
        "latin",
        "effective",
        "pedagogue",
        "wake",
        "erasmus",
        "usually",
        "montaigne",
        "stress",
        "need",
        "action",
        "playful",
        "activity",
        "child",
        "conform",
        "early",
        "social",
        "political",
        "custom",
        "without",
        "servility",
        "use",
        "judgment",
        "every",
        "circumstance",
        "warrant",
        "practical",
        "intelligence",
        "personal",
        "freedom",
        "remain",
        "core",
        "education",
        "transfer",
        "major",
        "responsibility",
        "education",
        "school",
        "everyday",
        "life",
        "wonderful",
        "brilliance",
        "may",
        "gained",
        "human",
        "judgment",
        "getting",
        "know",
        "men",
        "priority",
        "given",
        "formation",
        "judgment",
        "character",
        "strongly",
        "opposes",
        "craving",
        "powerful",
        "memory",
        "time",
        "reserve",
        "freedom",
        "pick",
        "bit",
        "knowledge",
        "displaying",
        "nonchalance",
        "unconcern",
        "intellectually",
        "much",
        "way",
        "castiglione",
        "courtier",
        "would",
        "use",
        "sprezzatura",
        "social",
        "relationship",
        "although",
        "montaigne",
        "present",
        "nonchalance",
        "essential",
        "nature",
        "position",
        "innocent",
        "allows",
        "take",
        "voice",
        "stoic",
        "sceptic",
        "epicurean",
        "christian",
        "although",
        "view",
        "never",
        "fully",
        "original",
        "always",
        "bear",
        "unmistakable",
        "mark",
        "montaigne",
        "thought",
        "often",
        "rated",
        "modern",
        "many",
        "aspect",
        "remains",
        "deeply",
        "rooted",
        "classical",
        "tradition",
        "montaigne",
        "navigates",
        "easily",
        "heap",
        "classical",
        "knowledge",
        "proposing",
        "remarkable",
        "literary",
        "philosophical",
        "innovation",
        "along",
        "way",
        "montaigne",
        "begin",
        "project",
        "know",
        "man",
        "noticing",
        "human",
        "behavior",
        "opposite",
        "effect",
        "even",
        "opposite",
        "conduct",
        "effect",
        "diverse",
        "mean",
        "arrive",
        "end",
        "human",
        "life",
        "turned",
        "object",
        "rational",
        "theory",
        "human",
        "conduct",
        "obey",
        "universal",
        "rule",
        "great",
        "diversity",
        "rule",
        "among",
        "accurate",
        "still",
        "fall",
        "short",
        "intended",
        "mark",
        "human",
        "reason",
        "tincture",
        "infused",
        "equal",
        "strength",
        "opinion",
        "way",
        "whatever",
        "form",
        "infinite",
        "substance",
        "infinite",
        "diversity",
        "say",
        "chapter",
        "custom",
        "focusing",
        "anecdotal",
        "experience",
        "montaigne",
        "come",
        "thus",
        "write",
        "masterpiece",
        "modern",
        "moral",
        "science",
        "according",
        "great",
        "commentator",
        "hugo",
        "friedrich",
        "give",
        "moral",
        "ambition",
        "telling",
        "men",
        "live",
        "order",
        "arrive",
        "nonprejudiced",
        "mind",
        "knowing",
        "man",
        "others",
        "form",
        "man",
        "tell",
        "man",
        "ever",
        "since",
        "without",
        "definition",
        "philosopher",
        "marcel",
        "conche",
        "commented",
        "chapter",
        "apologie",
        "de",
        "raimond",
        "sebond",
        "montaigne",
        "draw",
        "classical",
        "renaissance",
        "knowledge",
        "order",
        "remind",
        "u",
        "part",
        "world",
        "find",
        "men",
        "bear",
        "little",
        "resemblance",
        "u",
        "experience",
        "man",
        "thing",
        "perceived",
        "limited",
        "present",
        "standard",
        "judgment",
        "sort",
        "madness",
        "settle",
        "limit",
        "possible",
        "impossible",
        "philosophy",
        "failed",
        "secure",
        "man",
        "determined",
        "idea",
        "place",
        "world",
        "nature",
        "metaphysical",
        "psychological",
        "opinion",
        "indeed",
        "far",
        "numerous",
        "come",
        "burden",
        "help",
        "montaigne",
        "pursues",
        "quest",
        "knowledge",
        "experience",
        "meaning",
        "concept",
        "set",
        "mean",
        "definition",
        "related",
        "common",
        "language",
        "historical",
        "example",
        "one",
        "essential",
        "element",
        "experience",
        "ability",
        "reflect",
        "one",
        "action",
        "thought",
        "montaigne",
        "engaging",
        "casebycase",
        "gnôti",
        "seauton",
        "know",
        "thyself",
        "although",
        "truth",
        "general",
        "truly",
        "appropriate",
        "object",
        "human",
        "faculty",
        "reflect",
        "experience",
        "count",
        "fact",
        "eventually",
        "know",
        "truth",
        "rather",
        "way",
        "seek",
        "question",
        "hit",
        "ring",
        "make",
        "best",
        "run",
        "it",
        "aim",
        "properly",
        "exercise",
        "judgment",
        "montaigne",
        "thinking",
        "baffle",
        "common",
        "category",
        "vision",
        "everchanging",
        "world",
        "developed",
        "threatens",
        "thing",
        "communication",
        "wrongly",
        "take",
        "appears",
        "indulge",
        "dogmatic",
        "deceptive",
        "language",
        "cut",
        "everchanging",
        "reality",
        "ought",
        "careful",
        "use",
        "language",
        "montaigne",
        "would",
        "prefer",
        "child",
        "taught",
        "way",
        "speaking",
        "appropriate",
        "nature",
        "human",
        "inquiry",
        "mean",
        "understand",
        "might",
        "true",
        "montaigne",
        "fond",
        "formula",
        "soften",
        "boldness",
        "proposition",
        "perhaps",
        "extent",
        "say",
        "think",
        "like",
        "criticism",
        "theory",
        "dogmatism",
        "permeates",
        "example",
        "reflexion",
        "politics",
        "social",
        "order",
        "complicated",
        "mastered",
        "individual",
        "reason",
        "deems",
        "conservatism",
        "wisest",
        "stance",
        "policy",
        "grounded",
        "general",
        "evaluation",
        "change",
        "usually",
        "damaging",
        "conservation",
        "social",
        "institution",
        "nevertheless",
        "may",
        "certain",
        "circumstance",
        "advocate",
        "change",
        "better",
        "solution",
        "history",
        "sometimes",
        "showed",
        "reason",
        "unable",
        "decide",
        "priori",
        "judgment",
        "must",
        "come",
        "play",
        "alternate",
        "view",
        "find",
        "best",
        "option"
    ]
}