{
    "main_text": "The Refutation of Idealism\n2. The Refutation of Idealism\n\n\nMoore was first drawn to philosophy through contact with McTaggart\nand under McTaggart's influence he fell briefly under the spell of\nBritish idealism, especially the work of F. H. Bradley. Thus when in\n1897 he made his first attempt to win a Prize Fellowship at Trinity he\nsubmitted a dissertation on ‘The Metaphysical Basis of\nEthics’ in which he acknowledges his indebtedness to Bradley and\npresents an idealist ethical theory. One element of this theory is what\nhe calls ‘the fallacy involved in all empirical definitions of\nthe good’, which is immediately recognisable as a precursor of\nhis famous claim in Principia Ethica that there is a fallacy,\nthe ‘naturalistic fallacy’, in all naturalistic definitions\nof goodness. This point indicates that although, as we shall see below,\nMoore quickly came to reject the idealist philosophy of Bradley and\nMcTaggart, he held that their criticisms of empiricism, as represented\nby J. S. Mill's philosophy, were sound and he carried this hostility to\nempiricism forward into his mature philosophy. In this respect,\ntherefore, his early idealist enthusiasm had an enduring impact on his\nthought.\n\n\nA substantial part of this early dissertation is devoted to a\ncritical discussion of Kant's moral philosophy, and it is striking that\nalthough in his general approach and conclusions Moore endorses the\nkind of idealism advanced by Bradley, he is already critical of Kant's\nconception of practical reason. He argues that Kant's use of this\nconception blurs the distinction between ‘the psychological\nfaculty of making judgments and inferences’ and that which is\n‘true and objective’. This distinction, Moore maintains,\n‘cannot be either done away or bridged over’. Hence, he\nargues, Kant's conception of morality as founded on a priori\nprinciples of practical reason is untenable. It is easy to see how this\nline of thought could be extended to a general criticism of Kant's\nconception of the a priori; and it is precisely this\ngeneralisation that Moore undertakes in his successful 1898\ndissertation. At the same time he comes to see that his previous\nenthusiasm for Bradley's idealism was not well founded (though it still\ntakes him a little time to accept that the arguments of Bradley and\nMcTaggart against the reality of time are flawed). So it is in this\n1898 dissertation that Moore turns decisively against idealist\nphilosophy, both in its Kantian and Bradleian forms.\n\n\nThere are several aspects to this. As I have indicated, he rejects\nKant's conception of the a priori as a muddled form of\nsubjectivism or psychologism. The following passage from Principia\nEthica (1903) is indicative of his polemic which can be found in\nmany of his writings of this period:\nThat ‘to be true’ means  to be\nthought in a certain way is, therefore, certainly false. Yet this\nassertion plays the most central part in Kant's ‘Copernical\nRevolution’ of philosophy, and renders worthless the whole mass\nof modern literature, to which that revolution has given rise, and\nwhich is called Epistemology. (Principia Ethica\n183)\n\n\nThe distinction Moore is drawing on here between thought on the one\nhand and what is objective or real on the other is one that runs\nthrough his critique of idealism. An important early context in which\nhe elaborates it is his discussion of meaning in his famous paper\n‘The Nature of Judgement’ (1899), which comes largely from\nhis 1898 Dissertation. Moore begins here by attributing to Bradley a\nquasi-empiricist view of meaning as abstracted from the total content\nof judgement. This is a mistake, but what is important is what follows:\nas against this view Moore holds that meanings, which he calls\n‘concepts’, are entirely non-psychological. They come\ntogether in propositions, which are the ‘objects’ of\nthoughts and, as such, are to be sharply distinguished from any mental\ncontents or representations. Indeed true propositions do not represent\nor correspond to a fact or real state of affairs; instead they just are\nfacts. He put this point very clearly in a short entry written a year\nlater on ‘Truth’:\nit seems plain that a truth differs in no respect from the\nreality to which it was supposed merely to correspond: e.g. the truth\nthat I exist differs in no respect from the corresponding reality\n— my existence. So far, indeed, from truth being defined by\nreference to reality, reality can only be defined by reference to\ntruth. (‘Truth’ 21)\n\n\nAs Moore came to see ten years later, this radical metaphysics of\ntrue propositions is too simple. But in the present context what is\nstriking about it is the way in which by itself it hovers between\nidealism and realism. If propositions are thought of as contents of\njudgment, then to hold that reality just comprises true propositions is\nto take an idealist stance. What makes the position realist in Moore's\nhands is his uncompromising realism concerning propositions and\nconcepts: although they are possible objects of thought, Moore writes,\n‘that is no definition of them’; for ‘it is\nindifferent to their nature whether anybody thinks them or not’\n(‘The Nature of Judgment’ 4)\n\n\nMoore's most famous criticisms of idealism are contained in his\npaper ‘The Refutation of Idealism’ (1903). The basic theme\nof this paper is the extension to sense-experience of the strong\ndistinction between the mind and its objects which we have encountered\nin connection with meaning. Moore concentrates here on the case of a\n‘sensation of blue’ and maintains that this experience is a\nkind of ‘diaphanous’ consciousness or awareness of blue,\nwhich is not a ‘content’ of experience at all, but\nsomething real whose existence is not dependent on experience. His\nargument here is in part phenomenological: ‘when we try to\nintrospect the sensation of blue, all we can see is the blue’\n(41); but he also argues that to suppose otherwise, that the\n‘blue’ is merely a content of the experience is to suppose\nthat it is a quality of the experience, so that the experience is blue\nin much the way in which a blue bead is blue, which he takes to be\nabsurd. Not surprisingly Moore's critics were not happy with this\ncomparison, but it was not until the formulation of the\n‘adverbial’ theory of experience by Ducasse in the 1940's,\naccording to which someone who has a sensation of blue is someone who\n‘senses bluely’, that there was a reasonably robust\nresponse to Moore's criticism. What is, nonetheless, odd about Moore's\npaper is that he makes no attempt to address the famous ‘argument\nfrom illusion’. Moore concludes that ‘“blue” is\nas much an object, and as little a mere content, of my experience, when\nI experience it, as the most exalted and independent real thing of\nwhich I am ever aware’ (42). As he was soon to realise, more\nneeds to be said to handle cases in which something which is not in\nfact blue looks blue.\n\n\nThe final aspect of Moore's critical response to idealism concerns\nhis rejection of the monism which was characteristic of British\nidealism. This is the holistic thesis that ordinary things are\nessentially inter-related in such an intimate way that they constitute\ntogether an ‘organic unity’ which is, in a sense, the only\nthing that ‘really’ exists, since it is the only thing\nwhose existence is not dependent on the existence of anything else.\nThis thesis is especially characteristic of Bradley's idealism,\naccording to which the Absolute is the one real thing. In his early\nwritings and in Principia Ethica Moore engages in a good deal\nof polemical criticism of this thesis, but it is hard to find any\narguments against it, as opposed to a robust affirmation of a realist\npluralism. Rather later, however, in his paper ‘External and\nInternal Relations’ (written in 1919) Moore focused on the\nidealist conception of internal relations which lies at the heart of\nthe monist thesis. Moore's argument against the thesis that all\nrelations are internal starts from the claim that the burden of proof\nlies on its supporters since it conflicts with our common sense\nconviction that things are not essentially inter-related in such a way\nthat a change to one thing in one respect necessitates changes to\neverything else. Moore then argues that the best reason one could have\nfor the thesis involves a logical fallacy; he shows how the thesis that\nall relations are internal might be plausibly, but fallaciously,\ninferred from Leibniz’ Law, the uncontentious principle that things\nwhich differ in their relations must differ in their identity.\nSimplifying a bit, and using Moore's concept of entailment (see below),\nhis argument runs as follows:\n\nLeibniz’ Law states that \n\nxRy entails (z = x →\nzRy),\n\n\nwhere ‘→’ is the truth-functional conditional\nSince entailment is a necessary connection, one might infer \n\nxRy → Necessarily (z = x →\nzRy)\n\nFrom (2) one can immediately infer \n\nxRy → Necessarily (x = x →\nxRy)\n\nSince x = x is itself a necessary truth, one can now infer\n\nxRy → Necessarily (xRy)\n\n\nwhich expresses the thesis that all relations are internal.\n\n\n\nSo, on the face of it, this thesis has here been inferred from\nLeibniz’ Law. Moore observes, however, that the step from (1) to (2) is\ninvalid; it confuses the necessity of a connection with the necessity\nof the consequent. In ordinary language this distinction is not clearly\nmarked, although it is easy to draw it with a suitable formal\nlanguage.\n\n\nMoore's argument here is a sophisticated piece of informal modal\nlogic; but whether it really gets to the heart of the motivation for\nBradley's Absolute idealism can be doubted. My own view is that\nBradley's dialectic rests on a different thesis about the inadequacy of\nthought as a representation of reality, and thus that one has to dig\nrather deeper into Bradley's idealist metaphysics both to extract the\ngrounds for his monism and to exhibit what is wrong with it.\n",
    "section_title": "2. The Refutation of Idealism",
    "entry_title": "George Edward Moore",
    "hierarchy_title": "George Edward Moore || The Refutation of Idealism",
    "tokenized_text": [
        "refutation",
        "idealism",
        "refutation",
        "idealism",
        "moore",
        "first",
        "drawn",
        "philosophy",
        "contact",
        "mctaggart",
        "mctaggart",
        "s",
        "influence",
        "fell",
        "briefly",
        "spell",
        "british",
        "idealism",
        "especially",
        "work",
        "f",
        "h",
        "bradley",
        "thus",
        "made",
        "first",
        "attempt",
        "win",
        "prize",
        "fellowship",
        "trinity",
        "submitted",
        "dissertation",
        "metaphysical",
        "basis",
        "ethic",
        "acknowledges",
        "indebtedness",
        "bradley",
        "present",
        "idealist",
        "ethical",
        "theory",
        "one",
        "element",
        "theory",
        "call",
        "fallacy",
        "involved",
        "empirical",
        "definition",
        "good",
        "immediately",
        "recognisable",
        "precursor",
        "famous",
        "claim",
        "principia",
        "ethica",
        "fallacy",
        "naturalistic",
        "fallacy",
        "naturalistic",
        "definition",
        "goodness",
        "point",
        "indicates",
        "although",
        "shall",
        "see",
        "moore",
        "quickly",
        "came",
        "reject",
        "idealist",
        "philosophy",
        "bradley",
        "mctaggart",
        "held",
        "criticism",
        "empiricism",
        "represented",
        "j",
        "s",
        "mill",
        "s",
        "philosophy",
        "sound",
        "carried",
        "hostility",
        "empiricism",
        "forward",
        "mature",
        "philosophy",
        "respect",
        "therefore",
        "early",
        "idealist",
        "enthusiasm",
        "enduring",
        "impact",
        "thought",
        "substantial",
        "part",
        "early",
        "dissertation",
        "devoted",
        "critical",
        "discussion",
        "kant",
        "s",
        "moral",
        "philosophy",
        "striking",
        "although",
        "general",
        "approach",
        "conclusion",
        "moore",
        "endorses",
        "kind",
        "idealism",
        "advanced",
        "bradley",
        "already",
        "critical",
        "kant",
        "s",
        "conception",
        "practical",
        "reason",
        "argues",
        "kant",
        "s",
        "use",
        "conception",
        "blur",
        "distinction",
        "psychological",
        "faculty",
        "making",
        "judgment",
        "inference",
        "true",
        "objective",
        "distinction",
        "moore",
        "maintains",
        "either",
        "done",
        "away",
        "bridged",
        "hence",
        "argues",
        "kant",
        "s",
        "conception",
        "morality",
        "founded",
        "priori",
        "principle",
        "practical",
        "reason",
        "untenable",
        "easy",
        "see",
        "line",
        "thought",
        "could",
        "extended",
        "general",
        "criticism",
        "kant",
        "s",
        "conception",
        "priori",
        "precisely",
        "generalisation",
        "moore",
        "undertakes",
        "successful",
        "dissertation",
        "time",
        "come",
        "see",
        "previous",
        "enthusiasm",
        "bradley",
        "s",
        "idealism",
        "well",
        "founded",
        "though",
        "still",
        "take",
        "little",
        "time",
        "accept",
        "argument",
        "bradley",
        "mctaggart",
        "reality",
        "time",
        "flawed",
        "dissertation",
        "moore",
        "turn",
        "decisively",
        "idealist",
        "philosophy",
        "kantian",
        "bradleian",
        "form",
        "several",
        "aspect",
        "indicated",
        "reject",
        "kant",
        "s",
        "conception",
        "priori",
        "muddled",
        "form",
        "subjectivism",
        "psychologism",
        "following",
        "passage",
        "principia",
        "ethica",
        "indicative",
        "polemic",
        "found",
        "many",
        "writing",
        "period",
        "true",
        "mean",
        "thought",
        "certain",
        "way",
        "therefore",
        "certainly",
        "false",
        "yet",
        "assertion",
        "play",
        "central",
        "part",
        "kant",
        "s",
        "copernical",
        "revolution",
        "philosophy",
        "render",
        "worthless",
        "whole",
        "mass",
        "modern",
        "literature",
        "revolution",
        "given",
        "rise",
        "called",
        "epistemology",
        "principia",
        "ethica",
        "distinction",
        "moore",
        "drawing",
        "thought",
        "one",
        "hand",
        "objective",
        "real",
        "one",
        "run",
        "critique",
        "idealism",
        "important",
        "early",
        "context",
        "elaborates",
        "discussion",
        "meaning",
        "famous",
        "paper",
        "nature",
        "judgement",
        "come",
        "largely",
        "dissertation",
        "moore",
        "begin",
        "attributing",
        "bradley",
        "quasiempiricist",
        "view",
        "meaning",
        "abstracted",
        "total",
        "content",
        "judgement",
        "mistake",
        "important",
        "follows",
        "view",
        "moore",
        "hold",
        "meaning",
        "call",
        "concept",
        "entirely",
        "nonpsychological",
        "come",
        "together",
        "proposition",
        "object",
        "thought",
        "sharply",
        "distinguished",
        "mental",
        "content",
        "representation",
        "indeed",
        "true",
        "proposition",
        "represent",
        "correspond",
        "fact",
        "real",
        "state",
        "affair",
        "instead",
        "fact",
        "put",
        "point",
        "clearly",
        "short",
        "entry",
        "written",
        "year",
        "later",
        "truth",
        "seems",
        "plain",
        "truth",
        "differs",
        "respect",
        "reality",
        "supposed",
        "merely",
        "correspond",
        "eg",
        "truth",
        "exist",
        "differs",
        "respect",
        "corresponding",
        "reality",
        "existence",
        "far",
        "indeed",
        "truth",
        "defined",
        "reference",
        "reality",
        "reality",
        "defined",
        "reference",
        "truth",
        "truth",
        "moore",
        "came",
        "see",
        "ten",
        "year",
        "later",
        "radical",
        "metaphysics",
        "true",
        "proposition",
        "simple",
        "present",
        "context",
        "striking",
        "way",
        "hovers",
        "idealism",
        "realism",
        "proposition",
        "thought",
        "content",
        "judgment",
        "hold",
        "reality",
        "comprises",
        "true",
        "proposition",
        "take",
        "idealist",
        "stance",
        "make",
        "position",
        "realist",
        "moore",
        "s",
        "hand",
        "uncompromising",
        "realism",
        "concerning",
        "proposition",
        "concept",
        "although",
        "possible",
        "object",
        "thought",
        "moore",
        "writes",
        "definition",
        "indifferent",
        "nature",
        "whether",
        "anybody",
        "think",
        "nature",
        "judgment",
        "moore",
        "s",
        "famous",
        "criticism",
        "idealism",
        "contained",
        "paper",
        "refutation",
        "idealism",
        "basic",
        "theme",
        "paper",
        "extension",
        "senseexperience",
        "strong",
        "distinction",
        "mind",
        "object",
        "encountered",
        "connection",
        "meaning",
        "moore",
        "concentrate",
        "case",
        "sensation",
        "blue",
        "maintains",
        "experience",
        "kind",
        "diaphanous",
        "consciousness",
        "awareness",
        "blue",
        "content",
        "experience",
        "something",
        "real",
        "whose",
        "existence",
        "dependent",
        "experience",
        "argument",
        "part",
        "phenomenological",
        "try",
        "introspect",
        "sensation",
        "blue",
        "see",
        "blue",
        "also",
        "argues",
        "suppose",
        "otherwise",
        "blue",
        "merely",
        "content",
        "experience",
        "suppose",
        "quality",
        "experience",
        "experience",
        "blue",
        "much",
        "way",
        "blue",
        "bead",
        "blue",
        "take",
        "absurd",
        "surprisingly",
        "moore",
        "s",
        "critic",
        "happy",
        "comparison",
        "formulation",
        "adverbial",
        "theory",
        "experience",
        "ducasse",
        "s",
        "according",
        "someone",
        "sensation",
        "blue",
        "someone",
        "sens",
        "bluely",
        "reasonably",
        "robust",
        "response",
        "moore",
        "s",
        "criticism",
        "nonetheless",
        "odd",
        "moore",
        "s",
        "paper",
        "make",
        "attempt",
        "address",
        "famous",
        "argument",
        "illusion",
        "moore",
        "concludes",
        "blue",
        "much",
        "object",
        "little",
        "mere",
        "content",
        "experience",
        "experience",
        "exalted",
        "independent",
        "real",
        "thing",
        "ever",
        "aware",
        "soon",
        "realise",
        "need",
        "said",
        "handle",
        "case",
        "something",
        "fact",
        "blue",
        "look",
        "blue",
        "final",
        "aspect",
        "moore",
        "s",
        "critical",
        "response",
        "idealism",
        "concern",
        "rejection",
        "monism",
        "characteristic",
        "british",
        "idealism",
        "holistic",
        "thesis",
        "ordinary",
        "thing",
        "essentially",
        "interrelated",
        "intimate",
        "way",
        "constitute",
        "together",
        "organic",
        "unity",
        "sense",
        "thing",
        "really",
        "exists",
        "since",
        "thing",
        "whose",
        "existence",
        "dependent",
        "existence",
        "anything",
        "else",
        "thesis",
        "especially",
        "characteristic",
        "bradley",
        "s",
        "idealism",
        "according",
        "absolute",
        "one",
        "real",
        "thing",
        "early",
        "writing",
        "principia",
        "ethica",
        "moore",
        "engages",
        "good",
        "deal",
        "polemical",
        "criticism",
        "thesis",
        "hard",
        "find",
        "argument",
        "opposed",
        "robust",
        "affirmation",
        "realist",
        "pluralism",
        "rather",
        "later",
        "however",
        "paper",
        "external",
        "internal",
        "relation",
        "written",
        "moore",
        "focused",
        "idealist",
        "conception",
        "internal",
        "relation",
        "lie",
        "heart",
        "monist",
        "thesis",
        "moore",
        "s",
        "argument",
        "thesis",
        "relation",
        "internal",
        "start",
        "claim",
        "burden",
        "proof",
        "lie",
        "supporter",
        "since",
        "conflict",
        "common",
        "sense",
        "conviction",
        "thing",
        "essentially",
        "interrelated",
        "way",
        "change",
        "one",
        "thing",
        "one",
        "respect",
        "necessitates",
        "change",
        "everything",
        "else",
        "moore",
        "argues",
        "best",
        "reason",
        "one",
        "could",
        "thesis",
        "involves",
        "logical",
        "fallacy",
        "show",
        "thesis",
        "relation",
        "internal",
        "might",
        "plausibly",
        "fallaciously",
        "inferred",
        "leibniz",
        "law",
        "uncontentious",
        "principle",
        "thing",
        "differ",
        "relation",
        "must",
        "differ",
        "identity",
        "simplifying",
        "bit",
        "using",
        "moore",
        "s",
        "concept",
        "entailment",
        "see",
        "argument",
        "run",
        "follows",
        "leibniz",
        "law",
        "state",
        "xry",
        "entail",
        "z",
        "x",
        "zry",
        "truthfunctional",
        "conditional",
        "since",
        "entailment",
        "necessary",
        "connection",
        "one",
        "might",
        "infer",
        "xry",
        "necessarily",
        "z",
        "x",
        "zry",
        "one",
        "immediately",
        "infer",
        "xry",
        "necessarily",
        "x",
        "x",
        "xry",
        "since",
        "x",
        "x",
        "necessary",
        "truth",
        "one",
        "infer",
        "xry",
        "necessarily",
        "xry",
        "express",
        "thesis",
        "relation",
        "internal",
        "face",
        "thesis",
        "inferred",
        "leibniz",
        "law",
        "moore",
        "observes",
        "however",
        "step",
        "invalid",
        "confuses",
        "necessity",
        "connection",
        "necessity",
        "consequent",
        "ordinary",
        "language",
        "distinction",
        "clearly",
        "marked",
        "although",
        "easy",
        "draw",
        "suitable",
        "formal",
        "language",
        "moore",
        "s",
        "argument",
        "sophisticated",
        "piece",
        "informal",
        "modal",
        "logic",
        "whether",
        "really",
        "get",
        "heart",
        "motivation",
        "bradley",
        "s",
        "absolute",
        "idealism",
        "doubted",
        "view",
        "bradley",
        "s",
        "dialectic",
        "rest",
        "different",
        "thesis",
        "inadequacy",
        "thought",
        "representation",
        "reality",
        "thus",
        "one",
        "dig",
        "rather",
        "deeper",
        "bradley",
        "s",
        "idealist",
        "metaphysics",
        "extract",
        "ground",
        "monism",
        "exhibit",
        "wrong"
    ]
}