{
    "main_text": "Metaethical Innovations\n2. Metaethical Innovations\n\nThe main elements of Moore’s non-naturalism – moral\nrealism and the autonomy of ethics – had been defended earlier\nby Sidgwick and others and were reasonably well known when Moore\nwrote. This is reflected in the initial reviews of Principia\nEthica, many of which questioned its claims to metaethical\noriginality (see Welchman 1989). But Moore did add two metaethical\ninnovations. One was his view that the fundamental moral concept is\n“good” (plus its contrary “bad”), which he\nexpressed by saying that goodness is simple and unanalyzable, even in\nmoral terms. This had not been Sidgwick’s view. For him the\ncentral moral concept was “ought,” and he defined good in\nterms of ought, more specifically, as what one ought to desire (1907:\n112). Principia Ethica took the exactly opposite view,\ndefining ought in terms of good, so “one ought to do\nx” literally means “x will produce the\nmost good possible” (1903: 25, 146–48/1993: 76–77,\n196–98). But Moore was quickly persuaded by Bertrand Russell\nthat this view is vulnerable to his own open-question argument, since\nin saying “one ought to do what will produce the most\ngood” we do not mean “what will produce the most good will\nproduce the most good” (Russell 1904: 330). In later work such\nas Ethics he therefore held that ought is a distinct moral\nproperty from good (1912: 173, 180–81/1947: 107–08,\n112–13/1965: 73, 76–77; also 1942: 558–59), and in\nan uncompleted Preface to a planned second edition of Principia\nEthica he allowed that it would not affect the essence of his\nnon-naturalism if good were defined in moral terms, say, as what one\nought to desire (1993: 5, 14–15). But he continued to prefer the\nview that good is a simple concept, not definable in deontic terms\n(1942: 574–77), and there was vigorous debate on this topic in\nthis general period, with Brentano, Broad, and A.C. Ewing defending\nreductive analyses similar to Sidgwick’s while Ross preferred a\nnon-reductive view like Moore’s. On the Moorean view judgements\nabout the goodness of states of affairs are not shorthand for\njudgements about how we ought or have reason to respond to those\nstates; they are independent judgements that explain, synthetically\nbut as following “from the very nature” of goodness, why\nwe ought so to respond.\n\nMoore’s second innovation was his view that the intrinsic value\nof a state of affairs can depend only on its intrinsic properties,\nones it has apart from any relations to other states. Earlier writers\nhad distinguished between goodness as an end, which they also called\nintrinsic or ultimate goodness, and goodness as a means, and had said\nthe former cannot rest just on a state’s causally producing\ngoods external to itself. But they seemed to allow that goodness as an\nend can depend on other relational properties; thus they talked as if\na belief’s being true, which is necessary for its being\nknowledge, can increase its value, while a pleasure’s being that\nof a bad person can make it worse. Moore did not explicitly state his\nmore restrictive view that intrinsic goodness can depend only on\nintrinsic properties until “The Conception of Intrinsic\nValue” of 1922, but it nonetheless guided Principia\nEthica at two points. One was the book’s specific\nformulation of its principle of organic unities, discussed below. The\nother was its testing for a state’s intrinsic value by the\n“method of isolation,” which involves asking whether a\nuniverse containing only that state and no other would be good (1903:\n91, 93, 95, 187–88, 208/1993: 142, 145, 147, 236–37, 256);\nthe point of this method is precisely to insulate judgements of\nintrinsic value from facts about a state’s external relations by\nensuring that there are none such. Moore’s strict view was\nshared by some later writers such as Ross (1930: 75), while others\nargued that a better theory of value results if intrinsic goodness is\nallowed to depend on some relational properties (e.g. Ewing 1947:\n114). But Moore was the first to raise this issue clearly.\n\nThese two innovations, though not trivial, do not affect the core of a\nnon-naturalist metaethics. Some critics, however, charge that Moore\ndid change that view fundamentally, and for the worse. They say\nSidgwick’s non-naturalism was comparatively modest, holding only\nthat there are truths about what people ought or have reason to do\nthat we can know by reflection. Moore, the objection runs,\nsupplemented this modest view with an extravagant metaphysics of\nnon-natural properties inhabiting a dubious supersensible realm and a\nmysterious faculty of intuition that acquaints us with them. These\nadditions opened non-naturalism to entirely avoidable objections and\nled, regrettably, to its widespread rejection by later philosophers\n(e.g. Mackie 1976: 323; Shaver 2000: 263–65; Phillips 2011:\n29–30).\n\nThese charges are, however, hard to sustain. Principia Ethica\nactually downplayed the metaphysical side of its non-naturalism,\nsaying that goodness has “being” but does not\n“exist”, as numbers, too, have being but do not exist; in\nparticular, goodness does not exist in any “supersensible\nreality,” because there is no such reality (1903: 110–12,\n123–25/1993: 161–63, 174–76). What exactly Moore\nmeant by these claims is unclear, but it’s at least possible to\nread them as suggesting a non-metaphysical moral realism like those\ndefended more recently by Nagel (1986), Scanlon (1998, 2014), and\nParfit (2011, vol. 2: 464–87 ). Nor did his explicit talk of\nproperties mark a significant departure from Sidgwick. This is partly\nbecause he did not clearly distinguish concepts and properties, and\npartly because if Sidgwick thought people ought to pursue pleasure, he\nwould surely have to grant that pleasure has the property of being\nsomething people ought to pursue. The question is how ontologically\nrobust Moore’s talk of a property of goodness was, and given his\ndenial that such goodness exists the answer is uncertain. The\ndistinction between more and less metaphysical forms of non-naturalism\nis not one he clearly addressed.\n\nMoore was similarly modest in his moral epistemology, saying several\ntimes, as Sidgwick also had, that by calling our knowledge of basic\nmoral truths “intuitive” he meant only that it is not\nderived by inference from other knowledge; he likewise denied that\nmoral intuition is infallible, saying that in whatever way we can\ncognize a true proposition, we can cognize a false one (1903: viii.\nx/1993: 34, 36). He did sometimes make bald assertions of\nself-evidence, as in his claim in Principia Ethica that it is\n“obvious” that the chief intrinsic goods are aesthetic\nappreciation and personal love (1903: 188/1993: 237) or in\nEthics that it is “self-evident” that what is\nright is always what most promotes the good (1912: 1809–81/1947:\n112–13/1965: 76–77), and some critics have found this\nbaldness troubling. But the contrast with earlier non-naturalists such\nas Sidgwick should again not be overdrawn. Sidgwick arguably, too,\ngave most weight to intuitions about abstract moral principles (1907:\n379–84), including one close to that which Moore cited in\nEthics, and appealed to more concrete judgements only in\nad hominem arguments against opponents. And Moore often\nargued in more complex ways. In Principia Ethica he defended\nhis claim that beauty on its own is good by appealing to intuitions\nabout a specific beautiful world, containing mountains, rivers, and\nsunsets (1903: 83–85/1993: 135–36), and criticized the\nview that only pleasure is good by arguing that it conflicts with\nseveral concrete things we believe, such as that there are bad\npleasures (1903: 95/1993:146–47) and that a life of intensely\npleasurable but illusory experiences would not be best (1903:\n197–98/1993: 246–47; compare 1912: 52–53,\n237–39/1947: 34, 146–47/1965: 22, 102). Moore likewise\ninsisted that before we make judgements of self-evidence we must make\nsure that the propositions we are considering are clear (1903:\nviii/1993: 34); failure to do so, he argued, explains many of the\nexisting disagreements about ethics. And he took note of common\nopinions to the extent of trying to explain away contrary views when\nhe found them. Overall his approach to establishing moral truths was\nclose to Sidgwick’s, appealing to intuitive judgements that can\nbe made at different levels of generality and that must be brought\ninto a coherent whole, though with the primary emphasis on abstract\njudgements. This is not to say his non-naturalism was beyond\nobjection. Any such view holds that there are truths independent of\nnatural and logical ones and knowable by some non-empirical means, and\nmany find this pair of claims problematic. But Moore’s version\nof the view was arguably no more objectionable than others. If\nSidgwick’s non-naturalism did not involve a problematic\nmetaphysics and epistemology, neither did Moore’s; if\nMoore’s was hopelessly extravagant, so was a supposedly more\nmodest one like Sidgwick’s.\n\nA final important feature of Moore’s metaethics was its\nreductionism about normative concepts. Like Sidgwick, the Moore of\nPrincipia Ethica held that there is just one basic normative\nconcept, though he thought it was good rather than ought; like Ross,\nthe later Moore held that there are just two. But this conceptual\nreductionism, which was common throughout the period from Sidgwick to\nRoss, Broad, and Ewing, contrasts with the plurality of concepts\nrecognized in much present-day ethics. First, Moore and his\ncontemporaries took as basic only the “thin” concepts good\nand ought rather than “thick” moral concepts such as\ncourage and generosity; the latter, they held, combined a thin concept\nwith some more or less determinate descriptive content. They were also\nreductive about the thin concepts. They did not distinguish between\nmoral oughts and prudential or rational ones, holding that there is\nonly the single, moral ought; this is why for them egoism was a view\nabout morality, not a challenge to it from outside the moral realm.\nNor did they recognize different types of value. For them goodness was\na property only of states of affairs and not, as some Kantians hold,\nof persons and other objects. They likewise did not accept the late\n20th-century idea that there is a distinct concept of\n“well-being,” or of what is “good for” a\nperson; instead, they often defined a person’s good as what is\nsimply good and located in his life (e.g. Sidgwick 1907: 112; Moore\n1903: 98–99/1993: 150–51). Nor did they distinguish\nbetween moral and non-moral goodness, holding that the former is just\nordinary goodness when possessed by certain objects, such as traits of\ncharacter (e.g. Ross 1930: 155). The result was that all normative\njudgements can be expressed using at most the two concepts\n“good” and “ought,” which are therefore the\nonly ones one needed. To some this conclusion will mean that Moore and\nhis contemporaries ignored important conceptual distinctions; to\nothers it will mean they avoided pointless conceptual debates. But it\ndid free them to discuss substantive questions about what is in fact\ngood and right. On this topic Moore’s views, though not entirely\nnovel, were again both striking and strikingly stated.\n",
    "section_title": "2. Metaethical Innovations",
    "entry_title": "Moore’s Moral Philosophy",
    "hierarchy_title": "Moore’s Moral Philosophy || Metaethical Innovations",
    "tokenized_text": [
        "metaethical",
        "innovation",
        "metaethical",
        "innovation",
        "main",
        "element",
        "moore",
        "nonnaturalism",
        "moral",
        "realism",
        "autonomy",
        "ethic",
        "defended",
        "earlier",
        "sidgwick",
        "others",
        "reasonably",
        "well",
        "known",
        "moore",
        "wrote",
        "reflected",
        "initial",
        "review",
        "principia",
        "ethica",
        "many",
        "questioned",
        "claim",
        "metaethical",
        "originality",
        "see",
        "welchman",
        "moore",
        "add",
        "two",
        "metaethical",
        "innovation",
        "one",
        "view",
        "fundamental",
        "moral",
        "concept",
        "good",
        "plus",
        "contrary",
        "bad",
        "expressed",
        "saying",
        "goodness",
        "simple",
        "unanalyzable",
        "even",
        "moral",
        "term",
        "sidgwick",
        "view",
        "central",
        "moral",
        "concept",
        "ought",
        "defined",
        "good",
        "term",
        "ought",
        "specifically",
        "one",
        "ought",
        "desire",
        "principia",
        "ethica",
        "took",
        "exactly",
        "opposite",
        "view",
        "defining",
        "ought",
        "term",
        "good",
        "one",
        "ought",
        "x",
        "literally",
        "mean",
        "x",
        "produce",
        "good",
        "possible",
        "moore",
        "quickly",
        "persuaded",
        "bertrand",
        "russell",
        "view",
        "vulnerable",
        "openquestion",
        "argument",
        "since",
        "saying",
        "one",
        "ought",
        "produce",
        "good",
        "mean",
        "produce",
        "good",
        "produce",
        "good",
        "russell",
        "later",
        "work",
        "ethic",
        "therefore",
        "held",
        "ought",
        "distinct",
        "moral",
        "property",
        "good",
        "also",
        "uncompleted",
        "preface",
        "planned",
        "second",
        "edition",
        "principia",
        "ethica",
        "allowed",
        "would",
        "affect",
        "essence",
        "nonnaturalism",
        "good",
        "defined",
        "moral",
        "term",
        "say",
        "one",
        "ought",
        "desire",
        "continued",
        "prefer",
        "view",
        "good",
        "simple",
        "concept",
        "definable",
        "deontic",
        "term",
        "vigorous",
        "debate",
        "topic",
        "general",
        "period",
        "brentano",
        "broad",
        "ac",
        "ewing",
        "defending",
        "reductive",
        "analysis",
        "similar",
        "sidgwick",
        "ross",
        "preferred",
        "nonreductive",
        "view",
        "like",
        "moore",
        "moorean",
        "view",
        "judgement",
        "goodness",
        "state",
        "affair",
        "shorthand",
        "judgement",
        "ought",
        "reason",
        "respond",
        "state",
        "independent",
        "judgement",
        "explain",
        "synthetically",
        "following",
        "nature",
        "goodness",
        "ought",
        "respond",
        "moore",
        "second",
        "innovation",
        "view",
        "intrinsic",
        "value",
        "state",
        "affair",
        "depend",
        "intrinsic",
        "property",
        "one",
        "apart",
        "relation",
        "state",
        "earlier",
        "writer",
        "distinguished",
        "goodness",
        "end",
        "also",
        "called",
        "intrinsic",
        "ultimate",
        "goodness",
        "goodness",
        "mean",
        "said",
        "former",
        "rest",
        "state",
        "causally",
        "producing",
        "good",
        "external",
        "seemed",
        "allow",
        "goodness",
        "end",
        "depend",
        "relational",
        "property",
        "thus",
        "talked",
        "belief",
        "true",
        "necessary",
        "knowledge",
        "increase",
        "value",
        "pleasure",
        "bad",
        "person",
        "make",
        "worse",
        "moore",
        "explicitly",
        "state",
        "restrictive",
        "view",
        "intrinsic",
        "goodness",
        "depend",
        "intrinsic",
        "property",
        "conception",
        "intrinsic",
        "value",
        "nonetheless",
        "guided",
        "principia",
        "ethica",
        "two",
        "point",
        "one",
        "book",
        "specific",
        "formulation",
        "principle",
        "organic",
        "unity",
        "discussed",
        "testing",
        "state",
        "intrinsic",
        "value",
        "method",
        "isolation",
        "involves",
        "asking",
        "whether",
        "universe",
        "containing",
        "state",
        "would",
        "good",
        "point",
        "method",
        "precisely",
        "insulate",
        "judgement",
        "intrinsic",
        "value",
        "fact",
        "state",
        "external",
        "relation",
        "ensuring",
        "none",
        "moore",
        "strict",
        "view",
        "shared",
        "later",
        "writer",
        "ross",
        "others",
        "argued",
        "better",
        "theory",
        "value",
        "result",
        "intrinsic",
        "goodness",
        "allowed",
        "depend",
        "relational",
        "property",
        "eg",
        "ewing",
        "moore",
        "first",
        "raise",
        "issue",
        "clearly",
        "two",
        "innovation",
        "though",
        "trivial",
        "affect",
        "core",
        "nonnaturalist",
        "metaethics",
        "critic",
        "however",
        "charge",
        "moore",
        "change",
        "view",
        "fundamentally",
        "worse",
        "say",
        "sidgwick",
        "nonnaturalism",
        "comparatively",
        "modest",
        "holding",
        "truth",
        "people",
        "ought",
        "reason",
        "know",
        "reflection",
        "moore",
        "objection",
        "run",
        "supplemented",
        "modest",
        "view",
        "extravagant",
        "metaphysics",
        "nonnatural",
        "property",
        "inhabiting",
        "dubious",
        "supersensible",
        "realm",
        "mysterious",
        "faculty",
        "intuition",
        "acquaints",
        "u",
        "addition",
        "opened",
        "nonnaturalism",
        "entirely",
        "avoidable",
        "objection",
        "led",
        "regrettably",
        "widespread",
        "rejection",
        "later",
        "philosopher",
        "eg",
        "mackie",
        "shaver",
        "phillips",
        "charge",
        "however",
        "hard",
        "sustain",
        "principia",
        "ethica",
        "actually",
        "downplayed",
        "metaphysical",
        "side",
        "nonnaturalism",
        "saying",
        "goodness",
        "exist",
        "number",
        "exist",
        "particular",
        "goodness",
        "exist",
        "supersensible",
        "reality",
        "reality",
        "exactly",
        "moore",
        "meant",
        "claim",
        "unclear",
        "least",
        "possible",
        "read",
        "suggesting",
        "nonmetaphysical",
        "moral",
        "realism",
        "like",
        "defended",
        "recently",
        "nagel",
        "scanlon",
        "parfit",
        "vol",
        "explicit",
        "talk",
        "property",
        "mark",
        "significant",
        "departure",
        "sidgwick",
        "partly",
        "clearly",
        "distinguish",
        "concept",
        "property",
        "partly",
        "sidgwick",
        "thought",
        "people",
        "ought",
        "pursue",
        "pleasure",
        "would",
        "surely",
        "grant",
        "pleasure",
        "property",
        "something",
        "people",
        "ought",
        "pursue",
        "question",
        "ontologically",
        "robust",
        "moore",
        "talk",
        "property",
        "goodness",
        "given",
        "denial",
        "goodness",
        "exists",
        "answer",
        "uncertain",
        "distinction",
        "le",
        "metaphysical",
        "form",
        "nonnaturalism",
        "one",
        "clearly",
        "addressed",
        "moore",
        "similarly",
        "modest",
        "moral",
        "epistemology",
        "saying",
        "several",
        "time",
        "sidgwick",
        "also",
        "calling",
        "knowledge",
        "basic",
        "moral",
        "truth",
        "intuitive",
        "meant",
        "derived",
        "inference",
        "knowledge",
        "likewise",
        "denied",
        "moral",
        "intuition",
        "infallible",
        "saying",
        "whatever",
        "way",
        "cognize",
        "true",
        "proposition",
        "cognize",
        "false",
        "one",
        "viii",
        "x",
        "sometimes",
        "make",
        "bald",
        "assertion",
        "selfevidence",
        "claim",
        "principia",
        "ethica",
        "obvious",
        "chief",
        "intrinsic",
        "good",
        "aesthetic",
        "appreciation",
        "personal",
        "love",
        "ethic",
        "selfevident",
        "right",
        "always",
        "promotes",
        "good",
        "critic",
        "found",
        "baldness",
        "troubling",
        "contrast",
        "earlier",
        "nonnaturalists",
        "sidgwick",
        "overdrawn",
        "sidgwick",
        "arguably",
        "gave",
        "weight",
        "intuition",
        "abstract",
        "moral",
        "principle",
        "including",
        "one",
        "close",
        "moore",
        "cited",
        "ethic",
        "appealed",
        "concrete",
        "judgement",
        "ad",
        "hominem",
        "argument",
        "opponent",
        "moore",
        "often",
        "argued",
        "complex",
        "way",
        "principia",
        "ethica",
        "defended",
        "claim",
        "beauty",
        "good",
        "appealing",
        "intuition",
        "specific",
        "beautiful",
        "world",
        "containing",
        "mountain",
        "river",
        "sunset",
        "criticized",
        "view",
        "pleasure",
        "good",
        "arguing",
        "conflict",
        "several",
        "concrete",
        "thing",
        "believe",
        "bad",
        "pleasure",
        "life",
        "intensely",
        "pleasurable",
        "illusory",
        "experience",
        "would",
        "best",
        "compare",
        "moore",
        "likewise",
        "insisted",
        "make",
        "judgement",
        "selfevidence",
        "must",
        "make",
        "sure",
        "proposition",
        "considering",
        "clear",
        "viii",
        "failure",
        "argued",
        "explains",
        "many",
        "existing",
        "disagreement",
        "ethic",
        "took",
        "note",
        "common",
        "opinion",
        "extent",
        "trying",
        "explain",
        "away",
        "contrary",
        "view",
        "found",
        "overall",
        "approach",
        "establishing",
        "moral",
        "truth",
        "close",
        "sidgwick",
        "appealing",
        "intuitive",
        "judgement",
        "made",
        "different",
        "level",
        "generality",
        "must",
        "brought",
        "coherent",
        "whole",
        "though",
        "primary",
        "emphasis",
        "abstract",
        "judgement",
        "say",
        "nonnaturalism",
        "beyond",
        "objection",
        "view",
        "hold",
        "truth",
        "independent",
        "natural",
        "logical",
        "one",
        "knowable",
        "nonempirical",
        "mean",
        "many",
        "find",
        "pair",
        "claim",
        "problematic",
        "moore",
        "version",
        "view",
        "arguably",
        "objectionable",
        "others",
        "sidgwick",
        "nonnaturalism",
        "involve",
        "problematic",
        "metaphysics",
        "epistemology",
        "neither",
        "moore",
        "moore",
        "hopelessly",
        "extravagant",
        "supposedly",
        "modest",
        "one",
        "like",
        "sidgwick",
        "final",
        "important",
        "feature",
        "moore",
        "metaethics",
        "reductionism",
        "normative",
        "concept",
        "like",
        "sidgwick",
        "moore",
        "principia",
        "ethica",
        "held",
        "one",
        "basic",
        "normative",
        "concept",
        "though",
        "thought",
        "good",
        "rather",
        "ought",
        "like",
        "ross",
        "later",
        "moore",
        "held",
        "two",
        "conceptual",
        "reductionism",
        "common",
        "throughout",
        "period",
        "sidgwick",
        "ross",
        "broad",
        "ewing",
        "contrast",
        "plurality",
        "concept",
        "recognized",
        "much",
        "presentday",
        "ethic",
        "first",
        "moore",
        "contemporary",
        "took",
        "basic",
        "thin",
        "concept",
        "good",
        "ought",
        "rather",
        "thick",
        "moral",
        "concept",
        "courage",
        "generosity",
        "latter",
        "held",
        "combined",
        "thin",
        "concept",
        "le",
        "determinate",
        "descriptive",
        "content",
        "also",
        "reductive",
        "thin",
        "concept",
        "distinguish",
        "moral",
        "oughts",
        "prudential",
        "rational",
        "one",
        "holding",
        "single",
        "moral",
        "ought",
        "egoism",
        "view",
        "morality",
        "challenge",
        "outside",
        "moral",
        "realm",
        "recognize",
        "different",
        "type",
        "value",
        "goodness",
        "property",
        "state",
        "affair",
        "kantians",
        "hold",
        "person",
        "object",
        "likewise",
        "accept",
        "late",
        "thcentury",
        "idea",
        "distinct",
        "concept",
        "wellbeing",
        "good",
        "person",
        "instead",
        "often",
        "defined",
        "person",
        "good",
        "simply",
        "good",
        "located",
        "life",
        "eg",
        "sidgwick",
        "moore",
        "distinguish",
        "moral",
        "nonmoral",
        "goodness",
        "holding",
        "former",
        "ordinary",
        "goodness",
        "possessed",
        "certain",
        "object",
        "trait",
        "character",
        "eg",
        "ross",
        "result",
        "normative",
        "judgement",
        "expressed",
        "using",
        "two",
        "concept",
        "good",
        "ought",
        "therefore",
        "one",
        "one",
        "needed",
        "conclusion",
        "mean",
        "moore",
        "contemporary",
        "ignored",
        "important",
        "conceptual",
        "distinction",
        "others",
        "mean",
        "avoided",
        "pointless",
        "conceptual",
        "debate",
        "free",
        "discus",
        "substantive",
        "question",
        "fact",
        "good",
        "right",
        "topic",
        "moore",
        "view",
        "though",
        "entirely",
        "novel",
        "striking",
        "strikingly",
        "stated"
    ]
}