{
    "main_text": "Generating the Problem of Moral Luck and Kinds of Luck\n1. Generating the Problem of Moral Luck and Kinds of Luck\n\nThe idea that morality is immune from luck finds inspiration in\nKant:\n\nA good will is not good because of what it effects or accomplishes,\nbecause of its fitness to attain some proposed end, but only because\nof its volition, that is, it is good in itself… Even if, by a\nspecial disfavor of fortune or by the niggardly provision of a step\nmotherly nature, this will should wholly lack the capacity to carry\nout its purpose—if with its greatest efforts it should yet\nachieve nothing and only the good will were left (not, of course, as a\nmere wish but as the summoning of all means insofar as they are in our\ncontrol)—then, like a jewel, it would still shine by itself, as\nsomething that has its full worth in itself. Usefulness or\nfruitlessness can neither add anything to this worth nor take anything\naway from it (Kant 1784 [1998], 4:394).\n\n\nThomas Nagel approvingly cites this passage in the opening of his 1979\narticle, “Moral Luck.” Nagel’s article began as a\nreply to Williams’ paper of the same name, and the two articles\ntogether articulated in a new and powerful way a challenge for anyone\nwishing to defend the Kantian idea that an important aspect of\nmorality is immune from luck, or independent of what is outside of our\ncontrol.\n\nTo see exactly how the challenge arises, let us begin with the Control\nPrinciple:\n\n(CP) We are morally assessable only to the extent that what we are\nassessed for depends on factors under our control.\n\n\nIt is intuitively compelling, as is the following corollary of it:\n\n(CP-Corollary) Two people ought not to be morally assessed differently\nif the only other differences between them are due to factors beyond\ntheir control.\n\n\nNot only are the Control Principle and its corollary plausible in\nthemselves, they also seem to find support in our reactions to\nparticular cases. For example, if we find out that a woman who has\njust stepped on your toes was simply pushed, then our temptation to\nblame her is likely to evaporate. It seems that the reason for this is\nour unwillingness to hold someone responsible for what is not in her\ncontrol. Similarly, if two drivers have taken all precautions, and are\nabiding by all the rules of the road, and in one case, a dog runs in\nfront of the car and is killed, and not in the other, then, given that\nthe dog’s running out was not something over which either driver\nhad control, it seems that we are reluctant to blame one driver more\nthan the other. Although we might expect different reactions from the\ntwo drivers, it does not seem that one is deserving of a worse moral\nassessment than the other.\n\nAt the same time, it seems that there are countless cases in which the\nobjects of our moral assessments do depend on factors beyond\nagents’ control. Even though “moral luck” seems to\nbe an oxymoron, everyday judgments suggest that there is a phenomenon\nof moral luck after all. As Nagel defines it, “Where a\nsignificant aspect of what someone does depends on factors beyond his\ncontrol, yet we continue to treat him in that respect as an object of\nmoral judgment, it can be called moral luck” (Nagel 1979, 59).\nTo bring out the conflict with the Control Principle even more\nstarkly, we will understand moral luck as follows:\n\n(ML) moral luck occurs when an agent can be correctly treated\nas an object of moral judgment, despite the fact that a significant\naspect of what he is assessed for depends on factors beyond his\ncontrol.\n\n\nIt is important to note that not all recent discussions of moral luck\nhave accepted this characterization of moral luck. Some recent work\nhas instead taken moral luck to be a species of a larger genus of\nluck, of which there are other species, as well, such as epistemic\nluck, or offered a conceptual analysis of a very general everyday\nconcept of luck. Such an approach does not build in the idea that luck\nis opposed to control. (See Pritchard 2006, and Coffman (2015), who\nargues in favor of a particular unified analysis of luck for agency\nand epistemology, but also recognizes that there are other notions of\nluck in play in some debates.) Considering moral luck alongside other\nphenomena that go under the label “luck” might be fruitful\nin some ways, but in order to engage in the debate as found in Kant\nand Nagel and many others, moral luck must be understood as in\ncontrast to control.\n\nWe certainly seem to be committed to the existence of moral luck. For\nexample, we seem to blame those who have murdered more than we blame\nthose who have merely attempted murder, even if the reason for the\nlack of success in the second case is that the intended victim\nunexpectedly tripped and fell to the floor just as the bullet arrived\nat head-height. Since whether the intended victim tripped or not is\nnot something in control of either would-be murderer, we appear to\nviolate the Control Principle and its corollary.\n\nIt might be tempting to respond at this point that what people are\nreally responsible for are their intentions or their\n“willings,” and that we are thus wrong to offer different\nmoral assessments in this pair of cases. Adam Smith (1790/1976), for\nexample, advocates this position, writing that\n\nTo the intention or affection of the heart, therefore, to the\npropriety and impropriety, to the beneficence or hurtfulness of the\ndesign, all praise or blame, all approbation or disapprobation, of any\nkind, which can justly be bestowed upon any action, must ultimately\nbelong. (II.iii.intro.3.)\n\n\nThis is a tempting response, and others have followed Smith in\ndefending something like it (e.g., Khoury 2019). But it faces\ndifficulties of its own. First, as we will see, the would-be murderers\noffer only one of many cases in which our intuitive moral judgment\nappears to depend on “results” beyond one’s\nintentions, as Smith himself noted (II.iii.intro.5). And even more\nimportantly, luck can affect even our “willings” and other\ninternal states (Feinberg 1970, 34–38). As Nagel develops the\npoint, there are other types of luck that affect not only our actions\nbut also every intention we form and every exertion of our wills.\nFurther, once these kinds of luck are recognized, we will see that not\none of the factors on which agents’ actions depend is immune to\nluck.\n\nNagel identifies four kinds of luck in all: resultant, circumstantial,\nconstitutive, and causal.\n\n\nResultant Luck. Resultant luck is luck in the way\nthings turn out. Examples include the pair of would-be murderers just\nmentioned as well as the pair of innocent drivers described above. In\nboth cases, each member of the pair has exactly the same intentions,\nhas made the same plans, and so on, but things turn out very\ndifferently and so both are subject to resultant luck. If in either\ncase, we can correctly offer different moral assessments for each\nmember of the pair, then we have a case of resultant moral\nluck. Williams offers a case of “decision under\nuncertainty”: a somewhat fictionalized Gauguin, who chooses a\nlife of painting in Tahiti over a life with his family, not knowing\nwhether he will be a great painter. In one scenario, he goes on to\nbecome a great painter, and in another, he fails. According to\nWilliams, we will judge Gauguin differently depending on the outcome.\nCases of negligence provide another important kind of resultant luck.\nImagine that two otherwise conscientious people have forgotten to have\ntheir brakes checked recently and experience brake failure, but only\none of whom finds a child in the path of his car. If in any of these\ncases we correctly offer differential moral assessments, then again we\nhave cases of resultant moral luck.\n\nCircumstantial luck. Circumstantial luck is luck in\nthe circumstances in which one finds oneself. For example, consider\nNazi collaborators in 1930s Germany who are condemned for committing\nmorally atrocious acts, even though their very presence in Nazi\nGermany was due to factors beyond their control (Nagel 1979). Had\nthose very people been transferred by the companies for which they\nworked to Argentina in 1929, perhaps they would have led exemplary\nlives. If we correctly morally assess the Nazi collaborators\ndifferently from their imaginary counterparts in Argentina, then we\nhave a case of circumstantial moral luck.\n\nConstitutive luck. Constitutive luck is luck in who\none is, or in the traits and dispositions that one has. Since our\ngenes, care-givers, peers, and other environmental influences all\ncontribute to making us who we are (and since we have no control over\nthese) it seems that who we are is at least largely a matter of luck.\nSince how we act is partly a function of who we are, the existence of\nconstitutive luck entails that what actions we perform depends on\nluck, too. For example, if we correctly blame someone for being\ncowardly or self-righteous or selfish, when his being so depends on\nfactors beyond his control, then we have a case of constitutive moral\nluck. Further, if a person acts on one of these very character traits\nover which he lacks control by, say, running away instead of helping\nto save his child, and we correctly blame him for so acting, then we\nalso have a case of constitutive moral luck. Thus, since both actions\nand agents are objects of moral assessment, constitutive moral luck\nundermines the Control Principle when it comes to the assessment of\nboth actions and agents.\n\nCausal luck. Finally, there is causal luck, or luck\nin “how one is determined by antecedent circumstances”\n(Nagel 1979, 60). Nagel points out that the appearance of causal moral\nluck is essentially the classic problem of free will. The problem of\nfree will to which Nagel refers arises because it seems that our\nactions—and even the “stripped-down acts of the\nwill”—are consequences of what is not in our control. If\nthis is so, then neither our actions nor our willing are free. And\nsince freedom is often thought to be necessary for moral\nresponsibility, we cannot be morally responsible even for our\nwillings. Sometimes the problem is thought to arise only if\ndeterminism is true, but this is not the case. Even if it turns out\nthat determinism is false, but events are still caused by prior events\naccording to probabilistic laws, the way that one is caused to act by\nantecedent circumstances would seem to be equally outside of\none’s control (e.g., Pereboom 2002, 41–54, Watson 1982,\n9). Finally, it is worth noting that some have viewed the inclusion of\nthe category of causal luck as redundant, since what it covers is\ncompletely captured by the combination of constitutive and\ncircumstantial luck (Latus 2001).\n\n\nUpon reflection, it seems that we morally assess people differently\nfor what they do (or who they are) when their actions and personal\nqualities depend on luck of all kinds. And it is not only in unusual\ncases like that of would-be murderers that people are subject to the\nvarious types of luck. For example, whether any of our intentions are\nrealized in action or not depends on some factors outside of our\ncontrol. Thus, if resultant luck undermines our assessments of moral\nresponsibility, as the Control Principle suggests, then many of our\neveryday judgments ought to be abandoned. Still, applying the Control\nPrinciple to resultant luck continues to leave open the possibility\nthat we are correctly assessed for things like our intentions, just\nnot for the results of our intentions. But consideration of the other\nsorts of luck leads to more and more global skepticism about moral\nassessment. For example, circumstantial luck affects even our\nintentions, so it seems that we cannot be assessed in virtue of our\nintentions. Once again, though, we might still be able to retain the\nidea that we are morally assessable for something, even if only for\nwhat we would have intended in various situations. But\nreflection on constitutive luck and causal luck can make it seem as\nthough we cannot be properly assessed for anything we do. For if who\nwe are and therefore what we would have done are themselves subject to\nluck, then according to the Control Principle, we cannot be properly\nassessed even for those things. What is left as an object of\nassessment? As Nagel puts it, “[t]he area of genuine agency, and\ntherefore of legitimate moral judgment, seems to shrink under this\nscrutiny to an extensionless point” (1979, 66.) He goes on,\n\nI believe that in a sense the problem has no solution, because\nsomething in the idea of agency is incompatible with actions being\nevents, or people being things. But as the external determinants of\nwhat someone has done are gradually exposed, in their effect on\nconsequences, character, and choice itself, it becomes gradually clear\nthat actions are events and people things. Eventually nothing remains\nwhich can be ascribed to the responsible self, and we are left with\nnothing but a portion of the larger sequence of events, which can be\ndeplored or celebrated, but not blamed or praised (1979, 68).\n\n\nIf this is right, then we could not simply revise our everyday moral\njudgments in accordance with a more diligent application of the\nControl Principle; at best, if we adhere to the Control Principle, we\nshould refrain from making any moral judgments. Not everyone shares\nthis skepticism, and there is naturally a wide variety of responses to\nthe challenge of how to reconcile our adherence to the Control\nPrinciple with our everyday judgments that commit us to the existence\nof moral luck. At stake are not only our seemingly ubiquitous\npractices of moral praise and blame, but also the resolution of other\ncentral debates in ethics, philosophy of law, and political\nphilosophy.\n",
    "section_title": "1. Generating the Problem of Moral Luck and Kinds of Luck",
    "entry_title": "Moral Luck",
    "hierarchy_title": "Moral Luck || Generating the Problem of Moral Luck and Kinds of Luck",
    "tokenized_text": [
        "generating",
        "problem",
        "moral",
        "luck",
        "kind",
        "luck",
        "generating",
        "problem",
        "moral",
        "luck",
        "kind",
        "luck",
        "idea",
        "morality",
        "immune",
        "luck",
        "find",
        "inspiration",
        "kant",
        "good",
        "good",
        "effect",
        "accomplishes",
        "fitness",
        "attain",
        "proposed",
        "end",
        "volition",
        "good",
        "itself",
        "even",
        "special",
        "disfavor",
        "fortune",
        "niggardly",
        "provision",
        "step",
        "motherly",
        "nature",
        "wholly",
        "lack",
        "capacity",
        "carry",
        "purposeif",
        "greatest",
        "effort",
        "yet",
        "achieve",
        "nothing",
        "good",
        "left",
        "course",
        "mere",
        "wish",
        "summoning",
        "mean",
        "insofar",
        "control",
        "then",
        "like",
        "jewel",
        "would",
        "still",
        "shine",
        "something",
        "full",
        "worth",
        "usefulness",
        "fruitlessness",
        "neither",
        "add",
        "anything",
        "worth",
        "take",
        "anything",
        "away",
        "kant",
        "thomas",
        "nagel",
        "approvingly",
        "cite",
        "passage",
        "opening",
        "article",
        "moral",
        "luck",
        "nagel",
        "article",
        "began",
        "reply",
        "williams",
        "paper",
        "name",
        "two",
        "article",
        "together",
        "articulated",
        "new",
        "powerful",
        "way",
        "challenge",
        "anyone",
        "wishing",
        "defend",
        "kantian",
        "idea",
        "important",
        "aspect",
        "morality",
        "immune",
        "luck",
        "independent",
        "outside",
        "control",
        "see",
        "exactly",
        "challenge",
        "arises",
        "let",
        "u",
        "begin",
        "control",
        "principle",
        "cp",
        "morally",
        "assessable",
        "extent",
        "assessed",
        "depends",
        "factor",
        "control",
        "intuitively",
        "compelling",
        "following",
        "corollary",
        "cpcorollary",
        "two",
        "people",
        "ought",
        "morally",
        "assessed",
        "differently",
        "difference",
        "due",
        "factor",
        "beyond",
        "control",
        "control",
        "principle",
        "corollary",
        "plausible",
        "also",
        "seem",
        "find",
        "support",
        "reaction",
        "particular",
        "case",
        "example",
        "find",
        "woman",
        "stepped",
        "toe",
        "simply",
        "pushed",
        "temptation",
        "blame",
        "likely",
        "evaporate",
        "seems",
        "reason",
        "unwillingness",
        "hold",
        "someone",
        "responsible",
        "control",
        "similarly",
        "two",
        "driver",
        "taken",
        "precaution",
        "abiding",
        "rule",
        "road",
        "one",
        "case",
        "dog",
        "run",
        "front",
        "car",
        "killed",
        "given",
        "dog",
        "running",
        "something",
        "either",
        "driver",
        "control",
        "seems",
        "reluctant",
        "blame",
        "one",
        "driver",
        "although",
        "might",
        "expect",
        "different",
        "reaction",
        "two",
        "driver",
        "seem",
        "one",
        "deserving",
        "worse",
        "moral",
        "assessment",
        "time",
        "seems",
        "countless",
        "case",
        "object",
        "moral",
        "assessment",
        "depend",
        "factor",
        "beyond",
        "agent",
        "control",
        "even",
        "though",
        "moral",
        "luck",
        "seems",
        "oxymoron",
        "everyday",
        "judgment",
        "suggest",
        "phenomenon",
        "moral",
        "luck",
        "nagel",
        "defines",
        "significant",
        "aspect",
        "someone",
        "depends",
        "factor",
        "beyond",
        "control",
        "yet",
        "continue",
        "treat",
        "respect",
        "object",
        "moral",
        "judgment",
        "called",
        "moral",
        "luck",
        "nagel",
        "bring",
        "conflict",
        "control",
        "principle",
        "even",
        "starkly",
        "understand",
        "moral",
        "luck",
        "follows",
        "ml",
        "moral",
        "luck",
        "occurs",
        "agent",
        "correctly",
        "treated",
        "object",
        "moral",
        "judgment",
        "despite",
        "fact",
        "significant",
        "aspect",
        "assessed",
        "depends",
        "factor",
        "beyond",
        "control",
        "important",
        "note",
        "recent",
        "discussion",
        "moral",
        "luck",
        "accepted",
        "characterization",
        "moral",
        "luck",
        "recent",
        "work",
        "instead",
        "taken",
        "moral",
        "luck",
        "specie",
        "larger",
        "genus",
        "luck",
        "specie",
        "well",
        "epistemic",
        "luck",
        "offered",
        "conceptual",
        "analysis",
        "general",
        "everyday",
        "concept",
        "luck",
        "approach",
        "build",
        "idea",
        "luck",
        "opposed",
        "control",
        "see",
        "pritchard",
        "coffman",
        "argues",
        "favor",
        "particular",
        "unified",
        "analysis",
        "luck",
        "agency",
        "epistemology",
        "also",
        "recognizes",
        "notion",
        "luck",
        "play",
        "debate",
        "considering",
        "moral",
        "luck",
        "alongside",
        "phenomenon",
        "go",
        "label",
        "luck",
        "might",
        "fruitful",
        "way",
        "order",
        "engage",
        "debate",
        "found",
        "kant",
        "nagel",
        "many",
        "others",
        "moral",
        "luck",
        "must",
        "understood",
        "contrast",
        "control",
        "certainly",
        "seem",
        "committed",
        "existence",
        "moral",
        "luck",
        "example",
        "seem",
        "blame",
        "murdered",
        "blame",
        "merely",
        "attempted",
        "murder",
        "even",
        "reason",
        "lack",
        "success",
        "second",
        "case",
        "intended",
        "victim",
        "unexpectedly",
        "tripped",
        "fell",
        "floor",
        "bullet",
        "arrived",
        "headheight",
        "since",
        "whether",
        "intended",
        "victim",
        "tripped",
        "something",
        "control",
        "either",
        "wouldbe",
        "murderer",
        "appear",
        "violate",
        "control",
        "principle",
        "corollary",
        "might",
        "tempting",
        "respond",
        "point",
        "people",
        "really",
        "responsible",
        "intention",
        "willing",
        "thus",
        "wrong",
        "offer",
        "different",
        "moral",
        "assessment",
        "pair",
        "case",
        "adam",
        "smith",
        "example",
        "advocate",
        "position",
        "writing",
        "intention",
        "affection",
        "heart",
        "therefore",
        "propriety",
        "impropriety",
        "beneficence",
        "hurtfulness",
        "design",
        "praise",
        "blame",
        "approbation",
        "disapprobation",
        "kind",
        "justly",
        "bestowed",
        "upon",
        "action",
        "must",
        "ultimately",
        "belong",
        "iiiiiintro",
        "tempting",
        "response",
        "others",
        "followed",
        "smith",
        "defending",
        "something",
        "like",
        "eg",
        "khoury",
        "face",
        "difficulty",
        "first",
        "see",
        "wouldbe",
        "murderer",
        "offer",
        "one",
        "many",
        "case",
        "intuitive",
        "moral",
        "judgment",
        "appears",
        "depend",
        "result",
        "beyond",
        "one",
        "intention",
        "smith",
        "noted",
        "iiiiiintro",
        "even",
        "importantly",
        "luck",
        "affect",
        "even",
        "willing",
        "internal",
        "state",
        "feinberg",
        "nagel",
        "develops",
        "point",
        "type",
        "luck",
        "affect",
        "action",
        "also",
        "every",
        "intention",
        "form",
        "every",
        "exertion",
        "will",
        "kind",
        "luck",
        "recognized",
        "see",
        "one",
        "factor",
        "agent",
        "action",
        "depend",
        "immune",
        "luck",
        "nagel",
        "identifies",
        "four",
        "kind",
        "luck",
        "resultant",
        "circumstantial",
        "constitutive",
        "causal",
        "resultant",
        "luck",
        "resultant",
        "luck",
        "luck",
        "way",
        "thing",
        "turn",
        "example",
        "include",
        "pair",
        "wouldbe",
        "murderer",
        "mentioned",
        "well",
        "pair",
        "innocent",
        "driver",
        "described",
        "case",
        "member",
        "pair",
        "exactly",
        "intention",
        "made",
        "plan",
        "thing",
        "turn",
        "differently",
        "subject",
        "resultant",
        "luck",
        "either",
        "case",
        "correctly",
        "offer",
        "different",
        "moral",
        "assessment",
        "member",
        "pair",
        "case",
        "resultant",
        "moral",
        "luck",
        "williams",
        "offer",
        "case",
        "decision",
        "uncertainty",
        "somewhat",
        "fictionalized",
        "gauguin",
        "chooses",
        "life",
        "painting",
        "tahiti",
        "life",
        "family",
        "knowing",
        "whether",
        "great",
        "painter",
        "one",
        "scenario",
        "go",
        "become",
        "great",
        "painter",
        "another",
        "fails",
        "according",
        "williams",
        "judge",
        "gauguin",
        "differently",
        "depending",
        "outcome",
        "case",
        "negligence",
        "provide",
        "another",
        "important",
        "kind",
        "resultant",
        "luck",
        "imagine",
        "two",
        "otherwise",
        "conscientious",
        "people",
        "forgotten",
        "brake",
        "checked",
        "recently",
        "experience",
        "brake",
        "failure",
        "one",
        "find",
        "child",
        "path",
        "car",
        "case",
        "correctly",
        "offer",
        "differential",
        "moral",
        "assessment",
        "case",
        "resultant",
        "moral",
        "luck",
        "circumstantial",
        "luck",
        "circumstantial",
        "luck",
        "luck",
        "circumstance",
        "one",
        "find",
        "oneself",
        "example",
        "consider",
        "nazi",
        "collaborator",
        "s",
        "germany",
        "condemned",
        "committing",
        "morally",
        "atrocious",
        "act",
        "even",
        "though",
        "presence",
        "nazi",
        "germany",
        "due",
        "factor",
        "beyond",
        "control",
        "nagel",
        "people",
        "transferred",
        "company",
        "worked",
        "argentina",
        "perhaps",
        "would",
        "led",
        "exemplary",
        "life",
        "correctly",
        "morally",
        "ass",
        "nazi",
        "collaborator",
        "differently",
        "imaginary",
        "counterpart",
        "argentina",
        "case",
        "circumstantial",
        "moral",
        "luck",
        "constitutive",
        "luck",
        "constitutive",
        "luck",
        "luck",
        "one",
        "trait",
        "disposition",
        "one",
        "since",
        "gene",
        "caregivers",
        "peer",
        "environmental",
        "influence",
        "contribute",
        "making",
        "u",
        "since",
        "control",
        "seems",
        "least",
        "largely",
        "matter",
        "luck",
        "since",
        "act",
        "partly",
        "function",
        "existence",
        "constitutive",
        "luck",
        "entail",
        "action",
        "perform",
        "depends",
        "luck",
        "example",
        "correctly",
        "blame",
        "someone",
        "cowardly",
        "selfrighteous",
        "selfish",
        "depends",
        "factor",
        "beyond",
        "control",
        "case",
        "constitutive",
        "moral",
        "luck",
        "person",
        "act",
        "one",
        "character",
        "trait",
        "lack",
        "control",
        "say",
        "running",
        "away",
        "instead",
        "helping",
        "save",
        "child",
        "correctly",
        "blame",
        "acting",
        "also",
        "case",
        "constitutive",
        "moral",
        "luck",
        "thus",
        "since",
        "action",
        "agent",
        "object",
        "moral",
        "assessment",
        "constitutive",
        "moral",
        "luck",
        "undermines",
        "control",
        "principle",
        "come",
        "assessment",
        "action",
        "agent",
        "causal",
        "luck",
        "finally",
        "causal",
        "luck",
        "luck",
        "one",
        "determined",
        "antecedent",
        "circumstance",
        "nagel",
        "nagel",
        "point",
        "appearance",
        "causal",
        "moral",
        "luck",
        "essentially",
        "classic",
        "problem",
        "free",
        "problem",
        "free",
        "nagel",
        "refers",
        "arises",
        "seems",
        "actionsand",
        "even",
        "strippeddown",
        "act",
        "are",
        "consequence",
        "control",
        "neither",
        "action",
        "willing",
        "free",
        "since",
        "freedom",
        "often",
        "thought",
        "necessary",
        "moral",
        "responsibility",
        "morally",
        "responsible",
        "even",
        "willing",
        "sometimes",
        "problem",
        "thought",
        "arise",
        "determinism",
        "true",
        "case",
        "even",
        "turn",
        "determinism",
        "false",
        "event",
        "still",
        "caused",
        "prior",
        "event",
        "according",
        "probabilistic",
        "law",
        "way",
        "one",
        "caused",
        "act",
        "antecedent",
        "circumstance",
        "would",
        "seem",
        "equally",
        "outside",
        "one",
        "control",
        "eg",
        "pereboom",
        "watson",
        "finally",
        "worth",
        "noting",
        "viewed",
        "inclusion",
        "category",
        "causal",
        "luck",
        "redundant",
        "since",
        "cover",
        "completely",
        "captured",
        "combination",
        "constitutive",
        "circumstantial",
        "luck",
        "latus",
        "upon",
        "reflection",
        "seems",
        "morally",
        "ass",
        "people",
        "differently",
        "action",
        "personal",
        "quality",
        "depend",
        "luck",
        "kind",
        "unusual",
        "case",
        "like",
        "wouldbe",
        "murderer",
        "people",
        "subject",
        "various",
        "type",
        "luck",
        "example",
        "whether",
        "intention",
        "realized",
        "action",
        "depends",
        "factor",
        "outside",
        "control",
        "thus",
        "resultant",
        "luck",
        "undermines",
        "assessment",
        "moral",
        "responsibility",
        "control",
        "principle",
        "suggests",
        "many",
        "everyday",
        "judgment",
        "ought",
        "abandoned",
        "still",
        "applying",
        "control",
        "principle",
        "resultant",
        "luck",
        "continues",
        "leave",
        "open",
        "possibility",
        "correctly",
        "assessed",
        "thing",
        "like",
        "intention",
        "result",
        "intention",
        "consideration",
        "sort",
        "luck",
        "lead",
        "global",
        "skepticism",
        "moral",
        "assessment",
        "example",
        "circumstantial",
        "luck",
        "affect",
        "even",
        "intention",
        "seems",
        "assessed",
        "virtue",
        "intention",
        "though",
        "might",
        "still",
        "able",
        "retain",
        "idea",
        "morally",
        "assessable",
        "something",
        "even",
        "would",
        "intended",
        "various",
        "situation",
        "reflection",
        "constitutive",
        "luck",
        "causal",
        "luck",
        "make",
        "seem",
        "though",
        "properly",
        "assessed",
        "anything",
        "therefore",
        "would",
        "done",
        "subject",
        "luck",
        "according",
        "control",
        "principle",
        "properly",
        "assessed",
        "even",
        "thing",
        "left",
        "object",
        "assessment",
        "nagel",
        "put",
        "area",
        "genuine",
        "agency",
        "therefore",
        "legitimate",
        "moral",
        "judgment",
        "seems",
        "shrink",
        "scrutiny",
        "extensionless",
        "point",
        "go",
        "believe",
        "sense",
        "problem",
        "solution",
        "something",
        "idea",
        "agency",
        "incompatible",
        "action",
        "event",
        "people",
        "thing",
        "external",
        "determinant",
        "someone",
        "done",
        "gradually",
        "exposed",
        "effect",
        "consequence",
        "character",
        "choice",
        "becomes",
        "gradually",
        "clear",
        "action",
        "event",
        "people",
        "thing",
        "eventually",
        "nothing",
        "remains",
        "ascribed",
        "responsible",
        "self",
        "left",
        "nothing",
        "portion",
        "larger",
        "sequence",
        "event",
        "deplored",
        "celebrated",
        "blamed",
        "praised",
        "right",
        "could",
        "simply",
        "revise",
        "everyday",
        "moral",
        "judgment",
        "accordance",
        "diligent",
        "application",
        "control",
        "principle",
        "best",
        "adhere",
        "control",
        "principle",
        "refrain",
        "making",
        "moral",
        "judgment",
        "everyone",
        "share",
        "skepticism",
        "naturally",
        "wide",
        "variety",
        "response",
        "challenge",
        "reconcile",
        "adherence",
        "control",
        "principle",
        "everyday",
        "judgment",
        "commit",
        "u",
        "existence",
        "moral",
        "luck",
        "stake",
        "seemingly",
        "ubiquitous",
        "practice",
        "moral",
        "praise",
        "blame",
        "also",
        "resolution",
        "central",
        "debate",
        "ethic",
        "philosophy",
        "law",
        "political",
        "philosophy"
    ]
}