{
    "main_text": "Experimental Philosophy\n3. Experimental Philosophy\n\nExperimental philosophy is an approach to philosophy that explicitly\ndraws on experimental knowledge established by the sciences to address\nphilosophical questions (see the entry on\n experimental moral philosophy).\n There are three significant ways in which experimental philosophy has\nplayed an important role in discussions of moral relativism. These\nconcern the extent to which there is moral disagreement or moral\ndiversity among people (that is, DMR), the extent to which\nfolk morality is committed to an objectivist or relativist\nunderstanding of moral judgments (that is, the views of ordinary\npeople concerning MMR), and the extent to which acceptance of\nmoral relativism affects moral attitudes such as tolerance (that is,\nways in which views concerning MMR causally influence whether\nor not people have tolerant attitudes).\n\nThe first of these has a long history in discussions of moral\nrelativism and in fact may be considered one of the earliest instances\nof experimental moral philosophy. As was seen in\n section 1,\n for more than a century the work of anthropologists and other social\nscientists has contributed to the development of thought about moral\nrelativism, both by purporting to provide empirical evidence for\nextensive cross-cultural disagreement and diversity about morality,\nand by proposing the notion that moral codes are true only relative to\na culture as the best explanation of this. That is, these scientists\nhave provided empirical grounds for accepting DMR, and they\nhave suggested that some form of MMR is a reasonable\ninference from this data (though these positions were not always\nclearly distinguished). More importantly, the work cited in\n section 1\n by Brandt (1954) and Ladd (1957), involving both empirical\ninvestigations into the moral values of Native Americans and\nphilosophical reflection on the significance of these investigations\nvis-à-vis moral relativism, are significant examples of moral\nphilosophers engaging in empirical inquiry in support of philosophical\naims. Their empirical work did not immediately inspire other other\nphilosophers to engage in similar research. Experimental philosophy in\nthis sense—experiments or other empirical investigations conducted by\nphilosophers—did not become prominent until nearly a half-century\nlater. Nowadays philosophers do sometimes conduct experiments to\ninvestigate the extent of moral disagreement (for example, see the\nstudy of Western and East Asian values cited in Doris and Plakias\n2008). What has been much more common in recent decades has been the\ncitation by philosophers of empirical studies by anthropologists to\nestablish facts about moral disagreement or diversity (for example,\nsee Prinz 2007, Velleman 2015, and Wong 1984 and 2006). There has been\na renewed interest in ethics by some anthropologists in the last few\nyears (see Klenk 2019 and Laidlaw 2017), but this has not yet\nattracted much attention by philosophers. There is more about these\nissues in\n section 4.\n\nThe second concern, the extent to which ordinary people accept some\nform of moral objectivism or some form of MMR (or some other\nnon-objectivist position), has been the subject of considerable\nexperimental research in recent years. This research has sometimes\nbeen conducted by psychologists (or other scientists), sometimes by\nphilosophers, and increasingly sometimes by both working together (for\noverviews of this literature, see Pölzler and Wright 2019 and\nSarkissian 2016). In the past, philosophers with a variety of\nmeta-ethical commitments have sometimes claimed that in everyday moral\npractices people implicitly suppose that moral objectivism in some\nsense is correct (for example, see Blackburn 1984: 180 and Jackson\n1998: 137). By contrast, on occasion some philosophers have maintained\nthat ordinary people sometimes have attitudes that conflict with\nobjectivism. For instance, Wong has argued that in some moral\ndisagreements people grant that the person with the conflicting moral\njudgment is reasonable in accepting the judgment to the extent that\nthese people are unsure if their own position is uniquely right—what\nhe calls “moral ambivalence” (see Wong 2006: ch. 1). So\nwho are correct, philosophers who claim that ordinary people accept a\nform of objectivism (folk moral objectivism) or philosophers who think\nthat ordinary people at least sometimes accept something closer to\nMMR (folk moral relativism)?\n\nRecent empirical research suggests that both positions may have some\nmerit: the meta-ethical views of ordinary people are rather complex. A\ncommon method for measuring whether people are objectivists or\nrelativists about a moral statement is to present them with a\ndisagreement between two parties concerning the statement and to\nask them if at most only one party could be correct. A response that\nonly one could be correct indicates commitment to objectivism, while a\nresponse that more than one could be correct suggests commitment to\nrelativism (or some non-objectivist position). Several studies\nemploying this and related methodologies have provided evidence\nthat, while many people are objectivists about morality, a significant\nnumber are not objectivists (for example, see Nichols 2004). Moreover,\nsome studies have shown interesting correlations with these\ndifferences. For instance, being in a competitive rather than\ncooperative interaction and belief in a punishing God correlate\nwith more objectivist intuitions (see Fisher et al. 2017 and\nSarkissian and Phelan 2019) while openness to experience and to\nalternative possibilities are more common among those with\nnon-objectivist intuitions (see Feltz and Cokely 2008 and Goodwin and\nDarley 2010). In addition, some studies purport to show that there may\nbe causal relationships as well as correlations. For example, the\ndesire to punish generates objectivist intuitions (see Rose and\nNichols Forthcoming).\n\nOther studies have shown different kinds of complexity. People are\nmore likely to be objectivists about some moral issues (such as\nrobbery) than they are about other moral issues (such as abortion).\nThese differences also have correlations that might be partly\nexplanatory: regarding an issue as objective correlates with strength\nof belief and perception of consensus on the issue (see Goodwin and\nDarley 2008 and 2010; cf. Ayars and Nichols 2020). Moreover, people\nare more likely to be objectivists about some issues than others even\nwhen they are allowed to determine for themselves which issues count\nas moral issues (see Wright et al. 2013).\n\nFinally, it is more more probable that people give objectivist\nresponses when they think that the parties to a moral disagreement\nshare the same culture than when they think that the disagreeing\nparties belong to a very different culture. This might suggest that\nmany of those who give objectivist responses are tacitly assuming a\nkind of objectivity on the assumption that the disagreeing parties\nhave a common moral framework, but not in circumstances in which there\nare different moral frameworks (see Sarkissian et al. 2011).\n\nIn short, empirical work about folk meta-ethical outlooks suggests\nthat there is considerable diversity in the extent to which, and the\ncircumstances under which, people express moral objectivist views or\nmoral non-objectivist views such as MMR. This might be taken\nto indicate that some people are objectivists and some are not. But it\nmight also be taken to show that some people are “meta-ethical\npluralists”: they are objectivists about some moral issues, but\nthey are relativists about other moral issues (see Pölzler\n2017, Wright 2018, and Wright, Grandjean and McWhite 2013).\nThat is, perhaps some people implicitly deny the common assumption\namong philosophers that all moral beliefs should be given the same\nmeta-ethical analysis.\n\nVarious questions may be raised about the value and significance of\nthis experimental work. In recent years an important issue in\npsychology has been the extent to which experimental results can be\nreplicated. It has been argued that the replication rate in\nexperimental philosophy is comparatively high (see Cova et al.\n2018) and some studies of people’s acceptance of moral\nobjectivity have been replicated (for example, see Wright 2018).\nAnother issue is whether the samples of these studies are sufficiently\ndiverse to be indicative of the meta-ethical commitments of all human\nbeings. Once again, there have been concerns that psychology studies\nhave been unrepresentative (for example, because they rely too heavily\non undergraduate students in the United States). However, at\nleast some studies pertaining to moral objectivity have included a\nmore diverse group of subjects (for example, Beebe et al. 2015\nand Sarkissian et al. 2011). A different question is to what\nextent these studies actually measure acceptance of moral objectivism\nor  moral relativism. Many studies focus on moral objectivism and\nthese may leave unclear people’s views about a position such as\nMMR (Since there are a variety of positions that reject objectivism).\nHowever, some studies have focused on moral relativism specifically\n(for example, Sarkissian et al. 2011).\n\nIn any case, some philosophers may wonder about the philosophical\nrelevance of this experimental research. One response is that it could\naffect criteria of success in meta-ethics. For example, it is\nsometimes suggested that most people are moral objectivists rather\nthan moral relativists, and that a meta-ethical position such as moral\nrealism gains credibility because it is in accord with folk morality\nso understood (see Smith 1991). The studies just cited and others\nappear to challenge the factual premise of this meta-ethical criterion\n(see Sarkissian 2017), and it has been argued that the best\ninterpretation of the empirical data is that many people accept a form\nof relativism (see Beebe Forthcoming). Another response is that some\nof the complexity revealed in these studies might lead philosophers to\nconsider more seriously the philosophical viability of a pluralist or\nmixed meta-ethical position according to which, for instance, moral\nobjectivism is correct in some respects, but MMR is correct\nin other respects (in this connection, see Gill 2008 and\nSinnott-Armstrong 2009). There is more on this issue in\n section 7.\n In any case, there is increasing recognition of the importance of\ninterpreting the significance of the experimental evidence for\nmeta-ethics with care (see Bush and Moss 2020, Hopster 2019\nand Pölzler and Wright 2020).\n\nThe final area in which experimental philosophy has contributed to\ndiscussions of moral relativism pertains to the relationship between\nrelativism and moral attitudes such as tolerance. It is sometimes\nclaimed that some forms of moral relativism provide a reason for\ntolerance (see\n section 8).\n But are moral relativists more likely to be tolerant than moral\nobjectivists? Some recent psychological studies suggest that the\nanswer may be “yes.” There is some correlation between\naccepting moral relativism and being\nmore tolerant (Collier-Spruel et al. 2019), and there\nis some correlation between regarding a moral issue as objective\nand being less tolerant (Wright et al. 2008 and 2014),\nthough it is also clear that other factors are relevant to whether\nbehavior is tolerant or intolerant.\n\nInsofar as these studies suggest that there is some correlation\nbetween acceptance of moral relativism and tolerance, this might be\nregarded as an unsurprising result for those who have argued that\nmoral relativism provides a rational basis for tolerance. Of course, a\npsychological relationship does not show that there is a logical\nrelationship. But some support might be derived from the fact that\npeople are behaving in what, for this position, is a rational way. In\naddition, it has been claimed that an advantage of moral relativism is\nthat, even though it does not provide a reason for tolerance,\nacceptance of it makes people more tolerant (see Prinz 2007: 208).\nThese studies would provide support for this empirical claim.\n",
    "section_title": "3. Experimental Philosophy",
    "entry_title": "Moral Relativism",
    "hierarchy_title": "Moral Relativism || Experimental Philosophy",
    "tokenized_text": [
        "experimental",
        "philosophy",
        "experimental",
        "philosophy",
        "experimental",
        "philosophy",
        "approach",
        "philosophy",
        "explicitly",
        "draw",
        "experimental",
        "knowledge",
        "established",
        "science",
        "address",
        "philosophical",
        "question",
        "see",
        "entry",
        "experimental",
        "moral",
        "philosophy",
        "three",
        "significant",
        "way",
        "experimental",
        "philosophy",
        "played",
        "important",
        "role",
        "discussion",
        "moral",
        "relativism",
        "concern",
        "extent",
        "moral",
        "disagreement",
        "moral",
        "diversity",
        "among",
        "people",
        "dmr",
        "extent",
        "folk",
        "morality",
        "committed",
        "objectivist",
        "relativist",
        "understanding",
        "moral",
        "judgment",
        "view",
        "ordinary",
        "people",
        "concerning",
        "mmr",
        "extent",
        "acceptance",
        "moral",
        "relativism",
        "affect",
        "moral",
        "attitude",
        "tolerance",
        "way",
        "view",
        "concerning",
        "mmr",
        "causally",
        "influence",
        "whether",
        "people",
        "tolerant",
        "attitude",
        "first",
        "long",
        "history",
        "discussion",
        "moral",
        "relativism",
        "fact",
        "may",
        "considered",
        "one",
        "earliest",
        "instance",
        "experimental",
        "moral",
        "philosophy",
        "seen",
        "section",
        "century",
        "work",
        "anthropologist",
        "social",
        "scientist",
        "contributed",
        "development",
        "thought",
        "moral",
        "relativism",
        "purporting",
        "provide",
        "empirical",
        "evidence",
        "extensive",
        "crosscultural",
        "disagreement",
        "diversity",
        "morality",
        "proposing",
        "notion",
        "moral",
        "code",
        "true",
        "relative",
        "culture",
        "best",
        "explanation",
        "scientist",
        "provided",
        "empirical",
        "ground",
        "accepting",
        "dmr",
        "suggested",
        "form",
        "mmr",
        "reasonable",
        "inference",
        "data",
        "though",
        "position",
        "always",
        "clearly",
        "distinguished",
        "importantly",
        "work",
        "cited",
        "section",
        "brandt",
        "ladd",
        "involving",
        "empirical",
        "investigation",
        "moral",
        "value",
        "native",
        "american",
        "philosophical",
        "reflection",
        "significance",
        "investigation",
        "visàvis",
        "moral",
        "relativism",
        "significant",
        "example",
        "moral",
        "philosopher",
        "engaging",
        "empirical",
        "inquiry",
        "support",
        "philosophical",
        "aim",
        "empirical",
        "work",
        "immediately",
        "inspire",
        "philosopher",
        "engage",
        "similar",
        "research",
        "experimental",
        "philosophy",
        "senseexperiments",
        "empirical",
        "investigation",
        "conducted",
        "philosophersdid",
        "become",
        "prominent",
        "nearly",
        "halfcentury",
        "later",
        "nowadays",
        "philosopher",
        "sometimes",
        "conduct",
        "experiment",
        "investigate",
        "extent",
        "moral",
        "disagreement",
        "example",
        "see",
        "study",
        "western",
        "east",
        "asian",
        "value",
        "cited",
        "doris",
        "plakias",
        "much",
        "common",
        "recent",
        "decade",
        "citation",
        "philosopher",
        "empirical",
        "study",
        "anthropologist",
        "establish",
        "fact",
        "moral",
        "disagreement",
        "diversity",
        "example",
        "see",
        "prinz",
        "velleman",
        "wong",
        "renewed",
        "interest",
        "ethic",
        "anthropologist",
        "last",
        "year",
        "see",
        "klenk",
        "laidlaw",
        "yet",
        "attracted",
        "much",
        "attention",
        "philosopher",
        "issue",
        "section",
        "second",
        "concern",
        "extent",
        "ordinary",
        "people",
        "accept",
        "form",
        "moral",
        "objectivism",
        "form",
        "mmr",
        "nonobjectivist",
        "position",
        "subject",
        "considerable",
        "experimental",
        "research",
        "recent",
        "year",
        "research",
        "sometimes",
        "conducted",
        "psychologist",
        "scientist",
        "sometimes",
        "philosopher",
        "increasingly",
        "sometimes",
        "working",
        "together",
        "overview",
        "literature",
        "see",
        "pölzler",
        "wright",
        "sarkissian",
        "past",
        "philosopher",
        "variety",
        "metaethical",
        "commitment",
        "sometimes",
        "claimed",
        "everyday",
        "moral",
        "practice",
        "people",
        "implicitly",
        "suppose",
        "moral",
        "objectivism",
        "sense",
        "correct",
        "example",
        "see",
        "blackburn",
        "jackson",
        "contrast",
        "occasion",
        "philosopher",
        "maintained",
        "ordinary",
        "people",
        "sometimes",
        "attitude",
        "conflict",
        "objectivism",
        "instance",
        "wong",
        "argued",
        "moral",
        "disagreement",
        "people",
        "grant",
        "person",
        "conflicting",
        "moral",
        "judgment",
        "reasonable",
        "accepting",
        "judgment",
        "extent",
        "people",
        "unsure",
        "position",
        "uniquely",
        "rightwhat",
        "call",
        "moral",
        "ambivalence",
        "see",
        "wong",
        "ch",
        "correct",
        "philosopher",
        "claim",
        "ordinary",
        "people",
        "accept",
        "form",
        "objectivism",
        "folk",
        "moral",
        "objectivism",
        "philosopher",
        "think",
        "ordinary",
        "people",
        "least",
        "sometimes",
        "accept",
        "something",
        "closer",
        "mmr",
        "folk",
        "moral",
        "relativism",
        "recent",
        "empirical",
        "research",
        "suggests",
        "position",
        "may",
        "merit",
        "metaethical",
        "view",
        "ordinary",
        "people",
        "rather",
        "complex",
        "common",
        "method",
        "measuring",
        "whether",
        "people",
        "objectivists",
        "relativists",
        "moral",
        "statement",
        "present",
        "disagreement",
        "two",
        "party",
        "concerning",
        "statement",
        "ask",
        "one",
        "party",
        "could",
        "correct",
        "response",
        "one",
        "could",
        "correct",
        "indicates",
        "commitment",
        "objectivism",
        "response",
        "one",
        "could",
        "correct",
        "suggests",
        "commitment",
        "relativism",
        "nonobjectivist",
        "position",
        "several",
        "study",
        "employing",
        "related",
        "methodology",
        "provided",
        "evidence",
        "many",
        "people",
        "objectivists",
        "morality",
        "significant",
        "number",
        "objectivists",
        "example",
        "see",
        "nichols",
        "moreover",
        "study",
        "shown",
        "interesting",
        "correlation",
        "difference",
        "instance",
        "competitive",
        "rather",
        "cooperative",
        "interaction",
        "belief",
        "punishing",
        "god",
        "correlate",
        "objectivist",
        "intuition",
        "see",
        "fisher",
        "et",
        "al",
        "sarkissian",
        "phelan",
        "openness",
        "experience",
        "alternative",
        "possibility",
        "common",
        "among",
        "nonobjectivist",
        "intuition",
        "see",
        "feltz",
        "cokely",
        "goodwin",
        "darley",
        "addition",
        "study",
        "purport",
        "show",
        "may",
        "causal",
        "relationship",
        "well",
        "correlation",
        "example",
        "desire",
        "punish",
        "generates",
        "objectivist",
        "intuition",
        "see",
        "rose",
        "nichols",
        "forthcoming",
        "study",
        "shown",
        "different",
        "kind",
        "complexity",
        "people",
        "likely",
        "objectivists",
        "moral",
        "issue",
        "robbery",
        "moral",
        "issue",
        "abortion",
        "difference",
        "also",
        "correlation",
        "might",
        "partly",
        "explanatory",
        "regarding",
        "issue",
        "objective",
        "correlate",
        "strength",
        "belief",
        "perception",
        "consensus",
        "issue",
        "see",
        "goodwin",
        "darley",
        "cf",
        "ayars",
        "nichols",
        "moreover",
        "people",
        "likely",
        "objectivists",
        "issue",
        "others",
        "even",
        "allowed",
        "determine",
        "issue",
        "count",
        "moral",
        "issue",
        "see",
        "wright",
        "et",
        "al",
        "finally",
        "probable",
        "people",
        "give",
        "objectivist",
        "response",
        "think",
        "party",
        "moral",
        "disagreement",
        "share",
        "culture",
        "think",
        "disagreeing",
        "party",
        "belong",
        "different",
        "culture",
        "might",
        "suggest",
        "many",
        "give",
        "objectivist",
        "response",
        "tacitly",
        "assuming",
        "kind",
        "objectivity",
        "assumption",
        "disagreeing",
        "party",
        "common",
        "moral",
        "framework",
        "circumstance",
        "different",
        "moral",
        "framework",
        "see",
        "sarkissian",
        "et",
        "al",
        "short",
        "empirical",
        "work",
        "folk",
        "metaethical",
        "outlook",
        "suggests",
        "considerable",
        "diversity",
        "extent",
        "circumstance",
        "people",
        "express",
        "moral",
        "objectivist",
        "view",
        "moral",
        "nonobjectivist",
        "view",
        "mmr",
        "might",
        "taken",
        "indicate",
        "people",
        "objectivists",
        "might",
        "also",
        "taken",
        "show",
        "people",
        "metaethical",
        "pluralist",
        "objectivists",
        "moral",
        "issue",
        "relativists",
        "moral",
        "issue",
        "see",
        "pölzler",
        "wright",
        "wright",
        "grandjean",
        "mcwhite",
        "perhaps",
        "people",
        "implicitly",
        "deny",
        "common",
        "assumption",
        "among",
        "philosopher",
        "moral",
        "belief",
        "given",
        "metaethical",
        "analysis",
        "various",
        "question",
        "may",
        "raised",
        "value",
        "significance",
        "experimental",
        "work",
        "recent",
        "year",
        "important",
        "issue",
        "psychology",
        "extent",
        "experimental",
        "result",
        "replicated",
        "argued",
        "replication",
        "rate",
        "experimental",
        "philosophy",
        "comparatively",
        "high",
        "see",
        "cova",
        "et",
        "al",
        "study",
        "people",
        "acceptance",
        "moral",
        "objectivity",
        "replicated",
        "example",
        "see",
        "wright",
        "another",
        "issue",
        "whether",
        "sample",
        "study",
        "sufficiently",
        "diverse",
        "indicative",
        "metaethical",
        "commitment",
        "human",
        "being",
        "concern",
        "psychology",
        "study",
        "unrepresentative",
        "example",
        "rely",
        "heavily",
        "undergraduate",
        "student",
        "united",
        "state",
        "however",
        "least",
        "study",
        "pertaining",
        "moral",
        "objectivity",
        "included",
        "diverse",
        "group",
        "subject",
        "example",
        "beebe",
        "et",
        "al",
        "sarkissian",
        "et",
        "al",
        "different",
        "question",
        "extent",
        "study",
        "actually",
        "measure",
        "acceptance",
        "moral",
        "objectivism",
        "moral",
        "relativism",
        "many",
        "study",
        "focus",
        "moral",
        "objectivism",
        "may",
        "leave",
        "unclear",
        "people",
        "view",
        "position",
        "mmr",
        "since",
        "variety",
        "position",
        "reject",
        "objectivism",
        "however",
        "study",
        "focused",
        "moral",
        "relativism",
        "specifically",
        "example",
        "sarkissian",
        "et",
        "al",
        "case",
        "philosopher",
        "may",
        "wonder",
        "philosophical",
        "relevance",
        "experimental",
        "research",
        "one",
        "response",
        "could",
        "affect",
        "criterion",
        "success",
        "metaethics",
        "example",
        "sometimes",
        "suggested",
        "people",
        "moral",
        "objectivists",
        "rather",
        "moral",
        "relativists",
        "metaethical",
        "position",
        "moral",
        "realism",
        "gain",
        "credibility",
        "accord",
        "folk",
        "morality",
        "understood",
        "see",
        "smith",
        "study",
        "cited",
        "others",
        "appear",
        "challenge",
        "factual",
        "premise",
        "metaethical",
        "criterion",
        "see",
        "sarkissian",
        "argued",
        "best",
        "interpretation",
        "empirical",
        "data",
        "many",
        "people",
        "accept",
        "form",
        "relativism",
        "see",
        "beebe",
        "forthcoming",
        "another",
        "response",
        "complexity",
        "revealed",
        "study",
        "might",
        "lead",
        "philosopher",
        "consider",
        "seriously",
        "philosophical",
        "viability",
        "pluralist",
        "mixed",
        "metaethical",
        "position",
        "according",
        "instance",
        "moral",
        "objectivism",
        "correct",
        "respect",
        "mmr",
        "correct",
        "respect",
        "connection",
        "see",
        "gill",
        "sinnottarmstrong",
        "issue",
        "section",
        "case",
        "increasing",
        "recognition",
        "importance",
        "interpreting",
        "significance",
        "experimental",
        "evidence",
        "metaethics",
        "care",
        "see",
        "bush",
        "moss",
        "hopster",
        "pölzler",
        "wright",
        "final",
        "area",
        "experimental",
        "philosophy",
        "contributed",
        "discussion",
        "moral",
        "relativism",
        "pertains",
        "relationship",
        "relativism",
        "moral",
        "attitude",
        "tolerance",
        "sometimes",
        "claimed",
        "form",
        "moral",
        "relativism",
        "provide",
        "reason",
        "tolerance",
        "see",
        "section",
        "moral",
        "relativists",
        "likely",
        "tolerant",
        "moral",
        "objectivists",
        "recent",
        "psychological",
        "study",
        "suggest",
        "answer",
        "may",
        "yes",
        "correlation",
        "accepting",
        "moral",
        "relativism",
        "tolerant",
        "collierspruel",
        "et",
        "al",
        "correlation",
        "regarding",
        "moral",
        "issue",
        "objective",
        "le",
        "tolerant",
        "wright",
        "et",
        "al",
        "though",
        "also",
        "clear",
        "factor",
        "relevant",
        "whether",
        "behavior",
        "tolerant",
        "intolerant",
        "insofar",
        "study",
        "suggest",
        "correlation",
        "acceptance",
        "moral",
        "relativism",
        "tolerance",
        "might",
        "regarded",
        "unsurprising",
        "result",
        "argued",
        "moral",
        "relativism",
        "provides",
        "rational",
        "basis",
        "tolerance",
        "course",
        "psychological",
        "relationship",
        "show",
        "logical",
        "relationship",
        "support",
        "might",
        "derived",
        "fact",
        "people",
        "behaving",
        "position",
        "rational",
        "way",
        "addition",
        "claimed",
        "advantage",
        "moral",
        "relativism",
        "even",
        "though",
        "provide",
        "reason",
        "tolerance",
        "acceptance",
        "make",
        "people",
        "tolerant",
        "see",
        "prinz",
        "study",
        "would",
        "provide",
        "support",
        "empirical",
        "claim"
    ]
}