{
    "main_text": "Evolutionary Biology and Normative Ethics: Prescriptive Evolutionary Ethics, Corrective Evolutionary Ethics, and the Question of Moral Progress || Biology and the Autonomy of Ethics\n3.2 Biology and the Autonomy of Ethics\n\nEven philosophers sympathetic to\n ethical naturalism\n (the view that moral facts are themselves natural facts of some sort)\nhave typically been wary of attempts to derive conclusions about\nmorality in the normative sense from facts about evolutionary\nhistory. This is especially so when they are clear (unlike Spencer)\nabout the principles governing Darwinian evolution through natural\nselection. From the fact that a certain trait is an adaptation, which\nevolved through natural selection by virtue of its positive feedback\neffects on germ-line replication of the alleles that generate the\ntrait, nothing at all seems to follow about whether it is morally good\nor right, or something we ought to embrace and foster. Certain\ndispositions may be present in us for good evolutionary reasons\nwithout any implication that these traits benefit us, or are moral\nvirtues or produce behaviors that are morally right.\n\nA brief survey of some of the traits that are likely biological\nadaptations in a number of species—such as a tendency to kill\n‘step-children’ or to philander—ought to convince us\nthat even if similar tendencies are likewise adaptations in human\nbeings, present in us for similar evolutionary reasons, this would be\nno argument at all that we ought to engage in such behaviors.\nClearly the burden would be on the prescriptive evolutionary ethicist\nto explain why a trait’s having been good at propagating the\nalleles coding for it tens or hundreds of thousands of years ago\nshould be thought to have anything at all with the rational or\nmoral justification of our embracing it. And the\nprospects for meeting this burden have never seemed strong: it is hard\nto see how such evolutionary facts can possibly have normative\nauthority or force for a rational agent (McDowell 1995).\nRegardless of why one has a given trait, the question for a rational\nagent is always: is it right for me to exercise it, or should I\ninstead renounce and resist it as far as I am able? (Korsgaard\n 2006).[9]\n\nThis suggests that ethics, like mathematics, is an autonomous\nsubject in the sense that it has its own “internal standards of\njustification and criticism”, such that its conclusions cannot\nbe justified by other forms of inquiry such as evolutionary biology\n(Nagel 1979, 142; McDowell 1995 and 1997a,b). Normative ethical\nconclusions are justified through first-order ethical reflection and\nargument, just as mathematical propositions are justified through\nmathematical reasoning, rather than through learning more about our\nevolutionary past or about what is happening in our brains when we\nengage in these forms of reasoning (Rachels, 1990). It would seem to\nbe as much of a mistake to try to answer ethical questions by\nexamining fMRI scans or studying our evolutionary history as it would\nbe to try to solve mathematical problems by such means (except,\nperhaps, insofar as evolutionary theory may shed light on some\npresent, morally relevant empirical facts, as discussed below).\n\nStill, some have argued that empirical psychological studies (and\nrelated evolutionary hypotheses—see section 4.2) can have\nnormative ethical implications. In particular, it has recently been\nargued that scientific evidence supports consequentialist\nethical theories over deontological ones (Greene 2003, 2008, Singer\n2005). Consider a famous pair of hypothetical cases much discussed by\nmoral philosophers (Thomson 1985):\n\n\nTrolley: a runaway trolley is heading toward five people on\nthe track ahead, who cannot get out of the way; it cannot be stopped,\nbut there is a switch you could flip that would divert it onto a side\ntrack containing only one person;\n\nBridge: a runaway trolley is heading toward five people on\nthe track ahead, who cannot get out of the way; you are standing on a\nbridge over the track, and if you shove the very large person next to\nyou off the bridge and in front of the trolley, the crushing of his\nbody will stop the trolley before it reaches the five.\n\n\nMost people respond to these cases by saying that Trolley is\npermissible while Bridge is not. But what explains this difference in\nmoral response? Many philosophers have argued for deontological\nconstraints prohibiting murdering some to save others, as in Bridge;\nthey regard the case of diverting a public threat toward lesser harm,\nas in Trolley, as an exception, and offer principled reasons for doing\nso, thus justifying our treating the two cases differently (e.g.,\nThomson 1985). Greene (2008, 42–44) dismisses such normative\nexplanations as unconvincing and takes a very different tack,\nhighlighting another difference between Trolley and Bridge: whereas\nthe harm done in Bridge (shoving a man to his death) is “up\nclose and personal”, the harm done in Trolley (by flipping a\nswitch) is not. This difference corresponds to a difference in the\nstrength of emotional response, the response to “personal”\nharm being much stronger; and this in turn corresponds to a difference\nin the brain regions most active when the cases are contemplated:\nBridge tends to activate areas associated with social/emotional\nprocessing (the posterior cingulate cortex, the medial prefrontal\ncortex, and the amygdala) while Trolley produces activity in areas\nassociated with higher cognition (the dorsolateral prefrontal cortex\nand the inferior parietal lobe).\n\nGreene takes this to support the hypothesis that what accounts for\npeople’s different moral responses to Trolley and Bridge (and\ncountless other cases) is simply the difference in emotional response,\nwhich in turn ties in to evolutionary explanations. Given the need in\nour evolutionary past for mechanisms to restrain interpersonal\nviolence within cooperating groups, “it should come as no\nsurprise if we have innate responses to personal violence that are\npowerful but rather primitive,” predating the evolution of\ncomplex reasoning and now competing with our more reasoned responses\n(Greene 2008, 43). Deontological intuitions, such as our condemnation\nof the violence in Bridge, thus represent evolved “alarm-like\nemotional responses” which are subsequently\nrationalized rather than resulting from moral reasoning (see\nthe discussion of Haidt in section 2.5); by contrast, our responses to\nmore abstract harm such as Trolley reflect complex cognitive\nprocesses, as do consequentialist responses generally, including cases\nwhere people overcome their initial negative emotional responses (in\ncases like Bridge) and decide that the right thing to do is whatever\nproduces the best overall consequences.\n\nGreene’s claim, then, is that this casts doubt on deontological\nethical theory: far from giving us good reasons to refrain from\ncertain utility maximizing acts, it merely gives expression to\nemotional relics of our evolutionary history. A rational morality will\nmove beyond such alarm-like emotions and take us, through genuine\nreasoning, in the direction of consequentialism.\n\nAs with Haidt’s claims about moral judgment (section 2.5), there\nare many philosophical questions to raise about such appeals to\nexperimental data to draw philosophically loaded conclusions (Appiah\n2008, Berker 2009, Dancy 2014, Railton 2014, FitzPatrick 2018). It is\nhardly surprising, after all, that people have strong emotional\nreactions to blatant rights violations such as shoving an innocent\nperson off a bridge in front of a trolley to be crushed for the\ngreater good. Such emotions would equally be expected on deontological\nmodels. Nor does the speed with which we make negative moral judgments\nin such cases show that the judgments are merely emotion-driven: even\nif there is not explicit reasoning going on in each case, the\nemotion-laden intuitive responses may be informed by background moral\nreflection and formation (Pizarro and Bloom 2003, Dancy 2014, Railton\n2014). Philosophers who are less skeptical of the normative\nexplanations for our judgments will find it plausible that such\nreflection has made us intuitively sensitive to morally relevant\ndistinctions—such as the distinction between doing something to\na public threat to direct it toward least harm vs. assaulting an\ninnocent person and using his harm to bring about less overall harm;\nthat sensitivity then shows up in our intuitive moral judgments, which\nare no less justified just because they provoke strong emotions.\n\nIndeed, philosophers who believe there are good reasons for\ndistinguishing morally between Trolley and Bridge are unlikely to be\nconvinced by the above debunking explanation, for the following\nreason. Suppose we vary Bridge to equalize the cases for the factor\nGreene emphasizes: instead of having to shove the man off the bridge,\nall you have to do in Bridge Lever is flip a switch, and the switch\nwill activate a lever that knocks the bystander off the bridge in\nfront of the trolley. These cases are now equalized to be\n“impersonal”: neither now involves violence that is\n“up close and personal”. But does this variation change\nour moral response? If it does not, and we find Bridge Lever again\nobjectionable (just like Bridge) while allowing for Trolley, then\nGreene’s proposed explanation would not work: we would need a\ndifferent explanation for this pair of cases, such as the\nreason-giving explanation deontological philosophers would give. Even\nwith regard to the original pair of cases, while Greene may be right\nthat evolved dispositions against personal violence play some\nrole in explaining our reactions, this needn’t be the whole\nexplanation. It may be that this is another case of\noverdetermination (see section 2.4).\n",
    "section_title": "3.2 Biology and the Autonomy of Ethics",
    "entry_title": "Morality and Evolutionary Biology",
    "hierarchy_title": "Morality and Evolutionary Biology || Evolutionary Biology and Normative Ethics: Prescriptive Evolutionary Ethics, Corrective Evolutionary Ethics, and the Question of Moral Progress || Biology and the Autonomy of Ethics",
    "tokenized_text": [
        "evolutionary",
        "biology",
        "normative",
        "ethic",
        "prescriptive",
        "evolutionary",
        "ethic",
        "corrective",
        "evolutionary",
        "ethic",
        "question",
        "moral",
        "progress",
        "biology",
        "autonomy",
        "ethic",
        "biology",
        "autonomy",
        "ethic",
        "even",
        "philosopher",
        "sympathetic",
        "ethical",
        "naturalism",
        "view",
        "moral",
        "fact",
        "natural",
        "fact",
        "sort",
        "typically",
        "wary",
        "attempt",
        "derive",
        "conclusion",
        "morality",
        "normative",
        "sense",
        "fact",
        "evolutionary",
        "history",
        "especially",
        "clear",
        "unlike",
        "spencer",
        "principle",
        "governing",
        "darwinian",
        "evolution",
        "natural",
        "selection",
        "fact",
        "certain",
        "trait",
        "adaptation",
        "evolved",
        "natural",
        "selection",
        "virtue",
        "positive",
        "feedback",
        "effect",
        "germline",
        "replication",
        "allele",
        "generate",
        "trait",
        "nothing",
        "seems",
        "follow",
        "whether",
        "morally",
        "good",
        "right",
        "something",
        "ought",
        "embrace",
        "foster",
        "certain",
        "disposition",
        "may",
        "present",
        "u",
        "good",
        "evolutionary",
        "reason",
        "without",
        "implication",
        "trait",
        "benefit",
        "u",
        "moral",
        "virtue",
        "produce",
        "behavior",
        "morally",
        "right",
        "brief",
        "survey",
        "trait",
        "likely",
        "biological",
        "adaptation",
        "number",
        "speciessuch",
        "tendency",
        "kill",
        "stepchildren",
        "philanderought",
        "convince",
        "u",
        "even",
        "similar",
        "tendency",
        "likewise",
        "adaptation",
        "human",
        "being",
        "present",
        "u",
        "similar",
        "evolutionary",
        "reason",
        "would",
        "argument",
        "ought",
        "engage",
        "behavior",
        "clearly",
        "burden",
        "would",
        "prescriptive",
        "evolutionary",
        "ethicist",
        "explain",
        "trait",
        "good",
        "propagating",
        "allele",
        "coding",
        "ten",
        "hundred",
        "thousand",
        "year",
        "ago",
        "thought",
        "anything",
        "rational",
        "moral",
        "justification",
        "embracing",
        "prospect",
        "meeting",
        "burden",
        "never",
        "seemed",
        "strong",
        "hard",
        "see",
        "evolutionary",
        "fact",
        "possibly",
        "normative",
        "authority",
        "force",
        "rational",
        "agent",
        "mcdowell",
        "regardless",
        "one",
        "given",
        "trait",
        "question",
        "rational",
        "agent",
        "always",
        "right",
        "exercise",
        "instead",
        "renounce",
        "resist",
        "far",
        "able",
        "korsgaard",
        "suggests",
        "ethic",
        "like",
        "mathematics",
        "autonomous",
        "subject",
        "sense",
        "internal",
        "standard",
        "justification",
        "criticism",
        "conclusion",
        "justified",
        "form",
        "inquiry",
        "evolutionary",
        "biology",
        "nagel",
        "mcdowell",
        "a",
        "b",
        "normative",
        "ethical",
        "conclusion",
        "justified",
        "firstorder",
        "ethical",
        "reflection",
        "argument",
        "mathematical",
        "proposition",
        "justified",
        "mathematical",
        "reasoning",
        "rather",
        "learning",
        "evolutionary",
        "past",
        "happening",
        "brain",
        "engage",
        "form",
        "reasoning",
        "rachel",
        "would",
        "seem",
        "much",
        "mistake",
        "try",
        "answer",
        "ethical",
        "question",
        "examining",
        "fmri",
        "scan",
        "studying",
        "evolutionary",
        "history",
        "would",
        "try",
        "solve",
        "mathematical",
        "problem",
        "mean",
        "except",
        "perhaps",
        "insofar",
        "evolutionary",
        "theory",
        "may",
        "shed",
        "light",
        "present",
        "morally",
        "relevant",
        "empirical",
        "fact",
        "discussed",
        "still",
        "argued",
        "empirical",
        "psychological",
        "study",
        "related",
        "evolutionary",
        "hypothesessee",
        "section",
        "normative",
        "ethical",
        "implication",
        "particular",
        "recently",
        "argued",
        "scientific",
        "evidence",
        "support",
        "consequentialist",
        "ethical",
        "theory",
        "deontological",
        "one",
        "greene",
        "singer",
        "consider",
        "famous",
        "pair",
        "hypothetical",
        "case",
        "much",
        "discussed",
        "moral",
        "philosopher",
        "thomson",
        "trolley",
        "runaway",
        "trolley",
        "heading",
        "toward",
        "five",
        "people",
        "track",
        "ahead",
        "get",
        "way",
        "stopped",
        "switch",
        "could",
        "flip",
        "would",
        "divert",
        "onto",
        "side",
        "track",
        "containing",
        "one",
        "person",
        "bridge",
        "runaway",
        "trolley",
        "heading",
        "toward",
        "five",
        "people",
        "track",
        "ahead",
        "get",
        "way",
        "standing",
        "bridge",
        "track",
        "shove",
        "large",
        "person",
        "next",
        "bridge",
        "front",
        "trolley",
        "crushing",
        "body",
        "stop",
        "trolley",
        "reach",
        "five",
        "people",
        "respond",
        "case",
        "saying",
        "trolley",
        "permissible",
        "bridge",
        "explains",
        "difference",
        "moral",
        "response",
        "many",
        "philosopher",
        "argued",
        "deontological",
        "constraint",
        "prohibiting",
        "murdering",
        "save",
        "others",
        "bridge",
        "regard",
        "case",
        "diverting",
        "public",
        "threat",
        "toward",
        "lesser",
        "harm",
        "trolley",
        "exception",
        "offer",
        "principled",
        "reason",
        "thus",
        "justifying",
        "treating",
        "two",
        "case",
        "differently",
        "eg",
        "thomson",
        "greene",
        "dismisses",
        "normative",
        "explanation",
        "unconvincing",
        "take",
        "different",
        "tack",
        "highlighting",
        "another",
        "difference",
        "trolley",
        "bridge",
        "whereas",
        "harm",
        "done",
        "bridge",
        "shoving",
        "man",
        "death",
        "close",
        "personal",
        "harm",
        "done",
        "trolley",
        "flipping",
        "switch",
        "difference",
        "corresponds",
        "difference",
        "strength",
        "emotional",
        "response",
        "response",
        "personal",
        "harm",
        "much",
        "stronger",
        "turn",
        "corresponds",
        "difference",
        "brain",
        "region",
        "active",
        "case",
        "contemplated",
        "bridge",
        "tends",
        "activate",
        "area",
        "associated",
        "socialemotional",
        "processing",
        "posterior",
        "cingulate",
        "cortex",
        "medial",
        "prefrontal",
        "cortex",
        "amygdala",
        "trolley",
        "produce",
        "activity",
        "area",
        "associated",
        "higher",
        "cognition",
        "dorsolateral",
        "prefrontal",
        "cortex",
        "inferior",
        "parietal",
        "lobe",
        "greene",
        "take",
        "support",
        "hypothesis",
        "account",
        "people",
        "different",
        "moral",
        "response",
        "trolley",
        "bridge",
        "countless",
        "case",
        "simply",
        "difference",
        "emotional",
        "response",
        "turn",
        "tie",
        "evolutionary",
        "explanation",
        "given",
        "need",
        "evolutionary",
        "past",
        "mechanism",
        "restrain",
        "interpersonal",
        "violence",
        "within",
        "cooperating",
        "group",
        "come",
        "surprise",
        "innate",
        "response",
        "personal",
        "violence",
        "powerful",
        "rather",
        "primitive",
        "predating",
        "evolution",
        "complex",
        "reasoning",
        "competing",
        "reasoned",
        "response",
        "greene",
        "deontological",
        "intuition",
        "condemnation",
        "violence",
        "bridge",
        "thus",
        "represent",
        "evolved",
        "alarmlike",
        "emotional",
        "response",
        "subsequently",
        "rationalized",
        "rather",
        "resulting",
        "moral",
        "reasoning",
        "see",
        "discussion",
        "haidt",
        "section",
        "contrast",
        "response",
        "abstract",
        "harm",
        "trolley",
        "reflect",
        "complex",
        "cognitive",
        "process",
        "consequentialist",
        "response",
        "generally",
        "including",
        "case",
        "people",
        "overcome",
        "initial",
        "negative",
        "emotional",
        "response",
        "case",
        "like",
        "bridge",
        "decide",
        "right",
        "thing",
        "whatever",
        "produce",
        "best",
        "overall",
        "consequence",
        "greene",
        "claim",
        "cast",
        "doubt",
        "deontological",
        "ethical",
        "theory",
        "far",
        "giving",
        "u",
        "good",
        "reason",
        "refrain",
        "certain",
        "utility",
        "maximizing",
        "act",
        "merely",
        "give",
        "expression",
        "emotional",
        "relic",
        "evolutionary",
        "history",
        "rational",
        "morality",
        "move",
        "beyond",
        "alarmlike",
        "emotion",
        "take",
        "u",
        "genuine",
        "reasoning",
        "direction",
        "consequentialism",
        "haidt",
        "claim",
        "moral",
        "judgment",
        "section",
        "many",
        "philosophical",
        "question",
        "raise",
        "appeal",
        "experimental",
        "data",
        "draw",
        "philosophically",
        "loaded",
        "conclusion",
        "appiah",
        "berker",
        "dancy",
        "railton",
        "fitzpatrick",
        "hardly",
        "surprising",
        "people",
        "strong",
        "emotional",
        "reaction",
        "blatant",
        "right",
        "violation",
        "shoving",
        "innocent",
        "person",
        "bridge",
        "front",
        "trolley",
        "crushed",
        "greater",
        "good",
        "emotion",
        "would",
        "equally",
        "expected",
        "deontological",
        "model",
        "speed",
        "make",
        "negative",
        "moral",
        "judgment",
        "case",
        "show",
        "judgment",
        "merely",
        "emotiondriven",
        "even",
        "explicit",
        "reasoning",
        "going",
        "case",
        "emotionladen",
        "intuitive",
        "response",
        "may",
        "informed",
        "background",
        "moral",
        "reflection",
        "formation",
        "pizarro",
        "bloom",
        "dancy",
        "railton",
        "philosopher",
        "le",
        "skeptical",
        "normative",
        "explanation",
        "judgment",
        "find",
        "plausible",
        "reflection",
        "made",
        "u",
        "intuitively",
        "sensitive",
        "morally",
        "relevant",
        "distinctionssuch",
        "distinction",
        "something",
        "public",
        "threat",
        "direct",
        "toward",
        "least",
        "harm",
        "vs",
        "assaulting",
        "innocent",
        "person",
        "using",
        "harm",
        "bring",
        "le",
        "overall",
        "harm",
        "sensitivity",
        "show",
        "intuitive",
        "moral",
        "judgment",
        "le",
        "justified",
        "provoke",
        "strong",
        "emotion",
        "indeed",
        "philosopher",
        "believe",
        "good",
        "reason",
        "distinguishing",
        "morally",
        "trolley",
        "bridge",
        "unlikely",
        "convinced",
        "debunking",
        "explanation",
        "following",
        "reason",
        "suppose",
        "vary",
        "bridge",
        "equalize",
        "case",
        "factor",
        "greene",
        "emphasizes",
        "instead",
        "shove",
        "man",
        "bridge",
        "bridge",
        "lever",
        "flip",
        "switch",
        "switch",
        "activate",
        "lever",
        "knock",
        "bystander",
        "bridge",
        "front",
        "trolley",
        "case",
        "equalized",
        "impersonal",
        "neither",
        "involves",
        "violence",
        "close",
        "personal",
        "variation",
        "change",
        "moral",
        "response",
        "find",
        "bridge",
        "lever",
        "objectionable",
        "like",
        "bridge",
        "allowing",
        "trolley",
        "greene",
        "proposed",
        "explanation",
        "would",
        "work",
        "would",
        "need",
        "different",
        "explanation",
        "pair",
        "case",
        "reasongiving",
        "explanation",
        "deontological",
        "philosopher",
        "would",
        "give",
        "even",
        "regard",
        "original",
        "pair",
        "case",
        "greene",
        "may",
        "right",
        "evolved",
        "disposition",
        "personal",
        "violence",
        "play",
        "role",
        "explaining",
        "reaction",
        "whole",
        "explanation",
        "may",
        "another",
        "case",
        "overdetermination",
        "see",
        "section"
    ]
}