{
    "main_text": "Descriptive Moral Relativism\n4. Descriptive Moral Relativism\n\nMost discussions of moral relativism begin with, and are rooted\nin, DMR. Though this is not sufficient to establish\nMMR, the most common rationales for MMR would be\nundermined if DMR (or some descriptive thesis about\nsignificant moral disagreement or diversity) were incorrect. Moreover,\nif DMR were generally rejected, it is likely that\nMMR would have few proponents. Hence, it is important to\nconsider whether or not DMR is correct. Defenders of\nDMR usually take it to be well-established by cultural\nanthropology and other empirically-based disciplines, and many believe\nit is obvious to anyone with an elementary understanding of the\nhistory and cultures of the world. Examples of moral practices that\nappear sharply at odds with moral outlooks common in the United States\nare not hard to come by: polygamy, arranged marriages, suicide as a\nrequirement of honor or widowhood, severe punishments for blasphemy or\nadultery, female circumcision or genital mutilation (as it is\nvariously called), and so on (for a review of some of the literature,\nsee Prinz 2007: 187–95). At a more general level, Wong (1984) has\nargued that at least two different approaches to morality may be found\nin the world: a virtue-centered morality that emphasizes the good of\nthe community, and a rights-centered morality that stresses the value\nof individual freedom.\n\nThough it is obvious that there are some moral disagreements, it is\nanother matter to say that these disagreements are deep and\nwidespread, and that they are much more significant than whatever\nagreements there may be. Philosophers have raised two kinds of\nobjection to this contention: a priori arguments that\nDMR could not be true, and a posteriori arguments\nthat DMR is probably not true or at least has not been\nestablished to be true.\n\nA priori objections maintain that we can know DMR is\nfalse on the basis of philosophical considerations, without recourse\nto empirical evidence. One argument, expressed in general form by\nDonald Davidson (1984a), states that disagreement presupposes\nconsiderable agreement (see the entry on\n Donald Davidson).  \nAccording to Davidson, a methodological constraint on the translation\nof the language of another society is that we must think they agree\nwith us on most matters. For example, suppose we believed there were\nnumerous disagreements between us and another society about trees. As\nthe disagreements piled up, we reasonably would begin to think we had\nmistranslated a word in the language of the other society as\n‘tree’: It is more likely that (what we take to be) their\nfalse beliefs about trees are really beliefs about something else. By\ngeneralization, it follows that there could not be extensive\ndisagreements about trees between our society and the other one. Of\ncourse, there could be some disagreements. But these disagreements\nwould presuppose substantial agreements in other respects. Davidson\n(1984b [2004a] and 1995 [2004b]) and others (for example, Cooper 1978\nand Myers 2004) have claimed that this argument applies to moral\nconcepts. If they are right, then there cannot be extensive\ndisagreements about morality, and the agreements are more significant\nthan the disagreements. DMR cannot be true.\n\nDavidson’s argument is controversial. One response is that, even\nif it were compelling in some cases, it would not have force with\nrespect to moral concepts. ‘Tree’ is an ordinary,\ndescriptive concept based on direct observation. In view of this,\nmistranslation seems more likely than substantial disagreement. But\nwhat about concepts concerning what is amusing, interesting, or\nexciting? These have to do with human reactions to the world, and it\nmay be said that our knowledge of human nature suggests that some\nreactions vary widely. A claim that there is much disagreement about\nwhat people find amusing—about what makes them laugh—does\nnot immediately generate the suspicion of mistranslation. If moral\nconcepts were more similar to ‘amusing’ than to\n‘tree’, as some believe, then the Davidsonian argument\nmight not undermine DMR even if it were convincing in other\ncases. Davidson, however, believed the argument applies across the\nboard, to evaluations as well as empirical beliefs. Another response\nto his argument is to claim that, even if it does apply to\nevaluations, it would only apply to very basic ones and would leave\nroom for substantial disagreements beyond these (if this were the\ncase, then Davidson would have established only what I call a mixed\nposition in\n section 7).\n For some critical responses to the Davidsonian critique of\nrelativism, see Gowans 2004: 144–6, Prinz 2007: 195–9 and\nRovane 2013: 247–62.\n\nAnother a priori objection to DMR was suggested by\nPhilippa Foot (1978a and 1978b) in a response to emotivism. Just as\nthere are shared criteria of ‘rude’ such that not just\nanything could be considered rude, she argued, there are shared\ncriteria of moral concepts such that not just anything could be a\nmoral virtue or obligation. For example, there are substantial\nconstraints on what could be considered courage. Hence, there are\nsignificant limits to the extent of moral disagreements.\n\nOne response to this argument, interpreted as an objection to\nDMR, is that it faces a dilemma. On the one hand, if\n‘courage’ is understood broadly, in terms of confronting a\ndifficulty to achieve some perceived good, then it is likely that most\neveryone values courage. However, this leaves room for very different\nconceptions of courage. Both warriors and pacifists may value it, but\nthey may regard very different kinds of actions as courageous. This\nputs less pressure on DMR, a point Foot later conceded to\nsome extent (see\n section 7)).\n On the other hand, if courage is defined narrowly, for example, as\nthe virtue of a warrior who faces the threat of death in battle (as\nsuggested by Aristotle), then there may be little disagreement about\nthe scope of the concept, but considerable disagreement about whether\ncourage so-defined should be valued (pacifists would say no). A\nproponent of DMR might say that this is also a significant\nmoral disagreement. Against this, it may be said that our\nunderstanding of human nature and culture shows that everyone values\ncourage understood within some fairly significant limits. This is a\nmore empirical point, in line with the objections in the last\nparagraph of this section.\n\nSome versions of the a priori approach emphasize the\nconstraints imposed by “thinner” moral concepts such as\ngoodness, rightness, or morality itself (for example, see Garcia\n1988). Once again, a defender of DMR might say that, if these\nconcepts have enough content to preclude significant disagreement in\ntheir application, then it is likely that many societies do not apply\nthem at all—a form of moral disagreement in itself. Another\nresponse would be to argue, following R.M. Hare (1981), that a formal\nanalysis, for example in terms of a kind of prescriptivity, is\nplausible with respect to some thinner moral concepts, and that this\nis consistent with significant moral disagreements. However, the a\npriori critics question the adequacy of any such analysis. Much\nof this debate concerns the acceptability of formal versus material\ndefinitions of morality (see the entry on the\n definition of morality).\n\nThe second approach to rejecting DMR focuses on the\ninterpretation of the empirical evidence that purportedly supports\nthis thesis. Some objections point to obstacles that face any attempt\nto understand human cultures empirically. For example, it may be said\nthat the supposed evidence is incomplete or inaccurate because the\nobservers are biased. In support of this, it may be claimed that\nanthropologists often have had preconceptions rooted in disciplinary\nparadigms or political ideologies that have led them to misrepresent\nor misinterpret the empirical data. Or it may be said that even the\nmost objective observers would have difficulty accurately\nunderstanding a society’s actual moral values on account of\nphenomena such as self-deception and weakness of will. These concerns\npoint to substantial issues in the methodology of the social sciences.\nHowever, even if they were valid, they would only cast doubt on\nwhether DMR had been established: They would not necessarily\ngive us reason to think it is false. Of course, this would be an\nimportant objection to someone who claims DMR is established\nor relies on DMR to argue for MMR.\n\nAnother objection, more directly pertinent to DMR, is that\nanthropologists have tacitly and mistakenly assumed that cultures are\nrather discrete, homogenous, and static entities—rather like the\nshapes in a Piet Mondrian painting or a checkerboard. In fact,\naccording to this contention, cultures typically are rather\nheterogeneous and complex internally, with many dissenting voices.\nMoreover, they often interact and sometimes influence one another, and\nthey may change over time. From this perspective, the world of\ncultures is closer to an animated Jackson Pollock painting than to the\nunambiguous configuration suggested by the first image. If these\ncontentions were correct, then it would be more difficult to know the\nmoral values of different cultures and hence to know whether or not\nDMR is true. As before, this would not show that it is false\n(in fact, the point about heterogeneity might point the other way).\nHowever, we will see later that these contentions also pose challenges\nto MMR.\n\nOther critics try to establish that the empirical evidence cited in\nsupport of DMR does not really show that there are\nsignificant moral disagreements, and is consistent with considerable\nmoral agreement. A prominent contention is that purported moral\ndisagreements may result from applying a general moral value (about\nwhich there is no disagreement) in different circumstances or in the\nsame circumstances where there is a factual disagreement about what\nthese circumstances are. Either way, there is no real moral\ndisagreement in these cases. For example, everyone might agree on the\nimportance of promoting human welfare (and even on the nature of human\nwelfare). But this may be promoted differently in different, or\ndifferently understood, circumstances. Another contention is that\nmoral disagreements may be explained by religious disagreements: It is\nonly because specific religious assumptions are made (for instance,\nabout the soul) that there are moral disagreements. Once again, the\napparent moral disagreement is really a disagreement of a different\nkind—here, about the nature of the soul. There is no genuine\nmoral disagreement. Of course, these possibilities would have to be\nestablished as the best explanation of the disagreements in question\nto constitute an objection to DMR.\n\nFinally, some objections maintain that proponents of DMR fail\nto recognize that there is significant empirical evidence for\nconsiderable moral agreement across different societies (see\nSauer 2019). Several kinds of agreement have been proposed. For\nexample, the role-reversal test implied by the Golden Rule (“Do\nunto others as you would have them do unto you”) has been\nprominent beyond Western traditions: A version of it is also endorsed\nin The Analects of Confucius, some traditional Buddhist\ntexts, and elsewhere (see Wattles 1996). Another form of this claim\nmaintains that basic moral prohibitions against lying, stealing,\nadultery, killing human beings, etc. are found across many different\nand otherwise diverse societies. Yet another contention is that the\ninternational human rights movement indicates substantial moral\nagreement (see Donnelly 2013: ch. 4). On the basis of evidence of this\nkind, some such as Sissela Bok (1995) and Michael Walzer (1994) have\nproposed that there is a universal minimal morality, whatever other\nmoral differences there may be. In a similar vein, Hans Küng\n(1996) and others have maintained that there is a common “global\nethic” across the world’s major religious traditions\nregarding respect for human life, distributive justice, truthfulness,\nand the moral equality of men and women. These contentions, which have\nreceived increased support in recent years, must be subjected to the\nsame critical scrutiny as those put forward in support of\nDMR. However, if they were correct, they would cast doubt on\nDMR. In the final analysis, there may be significant\nagreements as well as disagreements in people’s moral values. If\nthis were the case, it would complicate the empirical background of\nthe metaethical debate, and it might suggest the need for more nuanced\nalternatives than the standard positions.\n",
    "section_title": "4. Descriptive Moral Relativism",
    "entry_title": "Moral Relativism",
    "hierarchy_title": "Moral Relativism || Descriptive Moral Relativism",
    "tokenized_text": [
        "descriptive",
        "moral",
        "relativism",
        "descriptive",
        "moral",
        "relativism",
        "discussion",
        "moral",
        "relativism",
        "begin",
        "rooted",
        "dmr",
        "though",
        "sufficient",
        "establish",
        "mmr",
        "common",
        "rationale",
        "mmr",
        "would",
        "undermined",
        "dmr",
        "descriptive",
        "thesis",
        "significant",
        "moral",
        "disagreement",
        "diversity",
        "incorrect",
        "moreover",
        "dmr",
        "generally",
        "rejected",
        "likely",
        "mmr",
        "would",
        "proponent",
        "hence",
        "important",
        "consider",
        "whether",
        "dmr",
        "correct",
        "defender",
        "dmr",
        "usually",
        "take",
        "wellestablished",
        "cultural",
        "anthropology",
        "empiricallybased",
        "discipline",
        "many",
        "believe",
        "obvious",
        "anyone",
        "elementary",
        "understanding",
        "history",
        "culture",
        "world",
        "example",
        "moral",
        "practice",
        "appear",
        "sharply",
        "odds",
        "moral",
        "outlook",
        "common",
        "united",
        "state",
        "hard",
        "come",
        "polygamy",
        "arranged",
        "marriage",
        "suicide",
        "requirement",
        "honor",
        "widowhood",
        "severe",
        "punishment",
        "blasphemy",
        "adultery",
        "female",
        "circumcision",
        "genital",
        "mutilation",
        "variously",
        "called",
        "review",
        "literature",
        "see",
        "prinz",
        "general",
        "level",
        "wong",
        "argued",
        "least",
        "two",
        "different",
        "approach",
        "morality",
        "may",
        "found",
        "world",
        "virtuecentered",
        "morality",
        "emphasizes",
        "good",
        "community",
        "rightscentered",
        "morality",
        "stress",
        "value",
        "individual",
        "freedom",
        "though",
        "obvious",
        "moral",
        "disagreement",
        "another",
        "matter",
        "say",
        "disagreement",
        "deep",
        "widespread",
        "much",
        "significant",
        "whatever",
        "agreement",
        "may",
        "philosopher",
        "raised",
        "two",
        "kind",
        "objection",
        "contention",
        "priori",
        "argument",
        "dmr",
        "could",
        "true",
        "posteriori",
        "argument",
        "dmr",
        "probably",
        "true",
        "least",
        "established",
        "true",
        "priori",
        "objection",
        "maintain",
        "know",
        "dmr",
        "false",
        "basis",
        "philosophical",
        "consideration",
        "without",
        "recourse",
        "empirical",
        "evidence",
        "one",
        "argument",
        "expressed",
        "general",
        "form",
        "donald",
        "davidson",
        "a",
        "state",
        "disagreement",
        "presupposes",
        "considerable",
        "agreement",
        "see",
        "entry",
        "donald",
        "davidson",
        "according",
        "davidson",
        "methodological",
        "constraint",
        "translation",
        "language",
        "another",
        "society",
        "must",
        "think",
        "agree",
        "u",
        "matter",
        "example",
        "suppose",
        "believed",
        "numerous",
        "disagreement",
        "u",
        "another",
        "society",
        "tree",
        "disagreement",
        "piled",
        "reasonably",
        "would",
        "begin",
        "think",
        "mistranslated",
        "word",
        "language",
        "society",
        "tree",
        "likely",
        "take",
        "false",
        "belief",
        "tree",
        "really",
        "belief",
        "something",
        "else",
        "generalization",
        "follows",
        "could",
        "extensive",
        "disagreement",
        "tree",
        "society",
        "one",
        "course",
        "could",
        "disagreement",
        "disagreement",
        "would",
        "presuppose",
        "substantial",
        "agreement",
        "respect",
        "davidson",
        "b",
        "a",
        "b",
        "others",
        "example",
        "cooper",
        "myers",
        "claimed",
        "argument",
        "applies",
        "moral",
        "concept",
        "right",
        "extensive",
        "disagreement",
        "morality",
        "agreement",
        "significant",
        "disagreement",
        "dmr",
        "true",
        "davidson",
        "argument",
        "controversial",
        "one",
        "response",
        "even",
        "compelling",
        "case",
        "would",
        "force",
        "respect",
        "moral",
        "concept",
        "tree",
        "ordinary",
        "descriptive",
        "concept",
        "based",
        "direct",
        "observation",
        "view",
        "mistranslation",
        "seems",
        "likely",
        "substantial",
        "disagreement",
        "concept",
        "concerning",
        "amusing",
        "interesting",
        "exciting",
        "human",
        "reaction",
        "world",
        "may",
        "said",
        "knowledge",
        "human",
        "nature",
        "suggests",
        "reaction",
        "vary",
        "widely",
        "claim",
        "much",
        "disagreement",
        "people",
        "find",
        "amusingabout",
        "make",
        "laughdoes",
        "immediately",
        "generate",
        "suspicion",
        "mistranslation",
        "moral",
        "concept",
        "similar",
        "amusing",
        "tree",
        "believe",
        "davidsonian",
        "argument",
        "might",
        "undermine",
        "dmr",
        "even",
        "convincing",
        "case",
        "davidson",
        "however",
        "believed",
        "argument",
        "applies",
        "across",
        "board",
        "evaluation",
        "well",
        "empirical",
        "belief",
        "another",
        "response",
        "argument",
        "claim",
        "even",
        "apply",
        "evaluation",
        "would",
        "apply",
        "basic",
        "one",
        "would",
        "leave",
        "room",
        "substantial",
        "disagreement",
        "beyond",
        "case",
        "davidson",
        "would",
        "established",
        "call",
        "mixed",
        "position",
        "section",
        "critical",
        "response",
        "davidsonian",
        "critique",
        "relativism",
        "see",
        "gowans",
        "prinz",
        "rovane",
        "another",
        "priori",
        "objection",
        "dmr",
        "suggested",
        "philippa",
        "foot",
        "a",
        "b",
        "response",
        "emotivism",
        "shared",
        "criterion",
        "rude",
        "anything",
        "could",
        "considered",
        "rude",
        "argued",
        "shared",
        "criterion",
        "moral",
        "concept",
        "anything",
        "could",
        "moral",
        "virtue",
        "obligation",
        "example",
        "substantial",
        "constraint",
        "could",
        "considered",
        "courage",
        "hence",
        "significant",
        "limit",
        "extent",
        "moral",
        "disagreement",
        "one",
        "response",
        "argument",
        "interpreted",
        "objection",
        "dmr",
        "face",
        "dilemma",
        "one",
        "hand",
        "courage",
        "understood",
        "broadly",
        "term",
        "confronting",
        "difficulty",
        "achieve",
        "perceived",
        "good",
        "likely",
        "everyone",
        "value",
        "courage",
        "however",
        "leaf",
        "room",
        "different",
        "conception",
        "courage",
        "warrior",
        "pacifist",
        "may",
        "value",
        "may",
        "regard",
        "different",
        "kind",
        "action",
        "courageous",
        "put",
        "le",
        "pressure",
        "dmr",
        "point",
        "foot",
        "later",
        "conceded",
        "extent",
        "see",
        "section",
        "hand",
        "courage",
        "defined",
        "narrowly",
        "example",
        "virtue",
        "warrior",
        "face",
        "threat",
        "death",
        "battle",
        "suggested",
        "aristotle",
        "may",
        "little",
        "disagreement",
        "scope",
        "concept",
        "considerable",
        "disagreement",
        "whether",
        "courage",
        "sodefined",
        "valued",
        "pacifist",
        "would",
        "say",
        "proponent",
        "dmr",
        "might",
        "say",
        "also",
        "significant",
        "moral",
        "disagreement",
        "may",
        "said",
        "understanding",
        "human",
        "nature",
        "culture",
        "show",
        "everyone",
        "value",
        "courage",
        "understood",
        "within",
        "fairly",
        "significant",
        "limit",
        "empirical",
        "point",
        "line",
        "objection",
        "last",
        "paragraph",
        "section",
        "version",
        "priori",
        "approach",
        "emphasize",
        "constraint",
        "imposed",
        "thinner",
        "moral",
        "concept",
        "goodness",
        "rightness",
        "morality",
        "example",
        "see",
        "garcia",
        "defender",
        "dmr",
        "might",
        "say",
        "concept",
        "enough",
        "content",
        "preclude",
        "significant",
        "disagreement",
        "application",
        "likely",
        "many",
        "society",
        "apply",
        "alla",
        "form",
        "moral",
        "disagreement",
        "another",
        "response",
        "would",
        "argue",
        "following",
        "rm",
        "hare",
        "formal",
        "analysis",
        "example",
        "term",
        "kind",
        "prescriptivity",
        "plausible",
        "respect",
        "thinner",
        "moral",
        "concept",
        "consistent",
        "significant",
        "moral",
        "disagreement",
        "however",
        "priori",
        "critic",
        "question",
        "adequacy",
        "analysis",
        "much",
        "debate",
        "concern",
        "acceptability",
        "formal",
        "versus",
        "material",
        "definition",
        "morality",
        "see",
        "entry",
        "definition",
        "morality",
        "second",
        "approach",
        "rejecting",
        "dmr",
        "focus",
        "interpretation",
        "empirical",
        "evidence",
        "purportedly",
        "support",
        "thesis",
        "objection",
        "point",
        "obstacle",
        "face",
        "attempt",
        "understand",
        "human",
        "culture",
        "empirically",
        "example",
        "may",
        "said",
        "supposed",
        "evidence",
        "incomplete",
        "inaccurate",
        "observer",
        "biased",
        "support",
        "may",
        "claimed",
        "anthropologist",
        "often",
        "preconception",
        "rooted",
        "disciplinary",
        "paradigm",
        "political",
        "ideology",
        "led",
        "misrepresent",
        "misinterpret",
        "empirical",
        "data",
        "may",
        "said",
        "even",
        "objective",
        "observer",
        "would",
        "difficulty",
        "accurately",
        "understanding",
        "society",
        "actual",
        "moral",
        "value",
        "account",
        "phenomenon",
        "selfdeception",
        "weakness",
        "concern",
        "point",
        "substantial",
        "issue",
        "methodology",
        "social",
        "science",
        "however",
        "even",
        "valid",
        "would",
        "cast",
        "doubt",
        "whether",
        "dmr",
        "established",
        "would",
        "necessarily",
        "give",
        "u",
        "reason",
        "think",
        "false",
        "course",
        "would",
        "important",
        "objection",
        "someone",
        "claim",
        "dmr",
        "established",
        "relies",
        "dmr",
        "argue",
        "mmr",
        "another",
        "objection",
        "directly",
        "pertinent",
        "dmr",
        "anthropologist",
        "tacitly",
        "mistakenly",
        "assumed",
        "culture",
        "rather",
        "discrete",
        "homogenous",
        "static",
        "entitiesrather",
        "like",
        "shape",
        "piet",
        "mondrian",
        "painting",
        "checkerboard",
        "fact",
        "according",
        "contention",
        "culture",
        "typically",
        "rather",
        "heterogeneous",
        "complex",
        "internally",
        "many",
        "dissenting",
        "voice",
        "moreover",
        "often",
        "interact",
        "sometimes",
        "influence",
        "one",
        "another",
        "may",
        "change",
        "time",
        "perspective",
        "world",
        "culture",
        "closer",
        "animated",
        "jackson",
        "pollock",
        "painting",
        "unambiguous",
        "configuration",
        "suggested",
        "first",
        "image",
        "contention",
        "correct",
        "would",
        "difficult",
        "know",
        "moral",
        "value",
        "different",
        "culture",
        "hence",
        "know",
        "whether",
        "dmr",
        "true",
        "would",
        "show",
        "false",
        "fact",
        "point",
        "heterogeneity",
        "might",
        "point",
        "way",
        "however",
        "see",
        "later",
        "contention",
        "also",
        "pose",
        "challenge",
        "mmr",
        "critic",
        "try",
        "establish",
        "empirical",
        "evidence",
        "cited",
        "support",
        "dmr",
        "really",
        "show",
        "significant",
        "moral",
        "disagreement",
        "consistent",
        "considerable",
        "moral",
        "agreement",
        "prominent",
        "contention",
        "purported",
        "moral",
        "disagreement",
        "may",
        "result",
        "applying",
        "general",
        "moral",
        "value",
        "disagreement",
        "different",
        "circumstance",
        "circumstance",
        "factual",
        "disagreement",
        "circumstance",
        "either",
        "way",
        "real",
        "moral",
        "disagreement",
        "case",
        "example",
        "everyone",
        "might",
        "agree",
        "importance",
        "promoting",
        "human",
        "welfare",
        "even",
        "nature",
        "human",
        "welfare",
        "may",
        "promoted",
        "differently",
        "different",
        "differently",
        "understood",
        "circumstance",
        "another",
        "contention",
        "moral",
        "disagreement",
        "may",
        "explained",
        "religious",
        "disagreement",
        "specific",
        "religious",
        "assumption",
        "made",
        "instance",
        "soul",
        "moral",
        "disagreement",
        "apparent",
        "moral",
        "disagreement",
        "really",
        "disagreement",
        "different",
        "kindhere",
        "nature",
        "soul",
        "genuine",
        "moral",
        "disagreement",
        "course",
        "possibility",
        "would",
        "established",
        "best",
        "explanation",
        "disagreement",
        "question",
        "constitute",
        "objection",
        "dmr",
        "finally",
        "objection",
        "maintain",
        "proponent",
        "dmr",
        "fail",
        "recognize",
        "significant",
        "empirical",
        "evidence",
        "considerable",
        "moral",
        "agreement",
        "across",
        "different",
        "society",
        "see",
        "sauer",
        "several",
        "kind",
        "agreement",
        "proposed",
        "example",
        "rolereversal",
        "test",
        "implied",
        "golden",
        "rule",
        "unto",
        "others",
        "would",
        "unto",
        "prominent",
        "beyond",
        "western",
        "tradition",
        "version",
        "also",
        "endorsed",
        "analects",
        "confucius",
        "traditional",
        "buddhist",
        "text",
        "elsewhere",
        "see",
        "wattle",
        "another",
        "form",
        "claim",
        "maintains",
        "basic",
        "moral",
        "prohibition",
        "lying",
        "stealing",
        "adultery",
        "killing",
        "human",
        "being",
        "etc",
        "found",
        "across",
        "many",
        "different",
        "otherwise",
        "diverse",
        "society",
        "yet",
        "another",
        "contention",
        "international",
        "human",
        "right",
        "movement",
        "indicates",
        "substantial",
        "moral",
        "agreement",
        "see",
        "donnelly",
        "ch",
        "basis",
        "evidence",
        "kind",
        "sissela",
        "bok",
        "michael",
        "walzer",
        "proposed",
        "universal",
        "minimal",
        "morality",
        "whatever",
        "moral",
        "difference",
        "may",
        "similar",
        "vein",
        "han",
        "küng",
        "others",
        "maintained",
        "common",
        "global",
        "ethic",
        "across",
        "world",
        "major",
        "religious",
        "tradition",
        "regarding",
        "respect",
        "human",
        "life",
        "distributive",
        "justice",
        "truthfulness",
        "moral",
        "equality",
        "men",
        "woman",
        "contention",
        "received",
        "increased",
        "support",
        "recent",
        "year",
        "must",
        "subjected",
        "critical",
        "scrutiny",
        "put",
        "forward",
        "support",
        "dmr",
        "however",
        "correct",
        "would",
        "cast",
        "doubt",
        "dmr",
        "final",
        "analysis",
        "may",
        "significant",
        "agreement",
        "well",
        "disagreement",
        "people",
        "moral",
        "value",
        "case",
        "would",
        "complicate",
        "empirical",
        "background",
        "metaethical",
        "debate",
        "might",
        "suggest",
        "need",
        "nuanced",
        "alternative",
        "standard",
        "position"
    ]
}