{
    "main_text": "Who Bears the Burden of Proof?\n2. Who Bears the Burden of Proof?\n\nIt is widely assumed that moral realism enjoys some sort of\npresumption in its favor that the anti-realist has to work to\novercome. Jonathan Dancy writes that “we take moral value to be\npart of the fabric of the world; … and we should take it in the\nabsence of contrary considerations that actions and agents do have the\nsorts of moral properties we experience in them” (1986: 172). In\na similar vein, David McNaughton claims “The realist’s\ncontention is that he has only to rebut the arguments designed to\npersuade us that moral realism is philosophically untenable in order\nto have made out his case” (1988: 40–41). David Brink\nconcurs: “We begin as (tacit) cognitivists and realists about\nethics.… Moral Realism should be our metaethical starting\npoint, and we should give it up only if it does involve unacceptable\nmetaphysical and epistemological commitments” (1989:\n23–24).\n\nIt may be questioned, however, whether moral realism really does enjoy\nintuitive support, and also questioned whether, if it does, this\nshould burden the anti-realist with extra labor.\n\nOn the first matter, it may be argued that some of the distinctions\ndrawn in distinguishing moral realism from anti-realism are too\nfine-grained or abstruse for “the folk” to have any\ndeterminate opinion. It is, for example, radically unclear to what\nextent common sense embraces the objectivity of moral facts.\nThere have been some empirical investigations ostensibly examining the\nextent to which ordinary people endorse moral objectivism (e.g.,\nGoodwin & Darley 2008; Uttich et al. 2014), but, upon examination,\nmany of these studies seem in fact to examine the extent to which\nordinary people endorse moral absolutism. (See Hopster 2019.)\nAnd if even professional researchers struggle to grasp the concept of\nmoral objectivity, it is difficult to maintain confidently that\n“the folk” have a firm and determinate intuition on the\nsubject. Furthermore, even if empirical investigation of collective\nopinion were to locate strong intuitions in favor of a\nmind-independent morality, there may be other equally robust\nintuitions in favor of morality being mind-dependent. (For\nexample, the fact that we seem unwilling to defer to experts when\nforming moral views appears to count against realism; see McGrath\n2011. Similarly, the fact that we do not expect a person necessarily\nto accept others’ reasons for their moral views seems to reveal\nanti-realist tendencies; see Foot 1958 for discussion.) Given the\ndifficulties in deciding and articulating just what kind of\nobjectivity is relevant to the moral realism/anti-realism division,\nand given the range and potential subtlety of options, it might be\nthought rash to claim that common sense has a firm opinion one way or\nthe other on this subject.\n\nOn the second matter: even if we were to identify a widespread\nunivocal intuition in favor of moral realism, it remains unclear to\nwhat extent we should adopt a methodology that rewards moral realism\nwith a dialectical advantage when it comes to metaethics. By\ncomparison, we do not think that physicists should endeavor to come up\nwith intuitive theories. (There is, for example, a widespread\nerroneous intuition that a fast-moving ball exiting a curved tube will\ncontinue to travel on a curving trajectory (McCloskey et al. 1980).\nThe fact that Newtonian physics predicts that the ball will in fact\ncontinue on a straight trajectory is surely in no sense a mark against\nthe theory.) Moreover, it is important to distinguish between any such\npro-realist intuitions ex ante and ex post. Once\nsomeone has accepted considerations and arguments in favor of moral\nanti-realism, then any counter-intuitiveness that this conclusion\nhas—ex ante—may be considered irrelevant. One noteworthy\ntype of strategy here is the “debunking argument,” which\nseeks to undermine moral intuitions by showing that they are the\nproduct of processes that we have no grounds for thinking are reliable\nindicators of truth. (See Street 2006; O’Neill 2015; Joyce 2013,\n2016.) To the extent that the anti-realist can provide a plausible\nexplanation for why humans would tend to think of morality as\nobjective, even if it is not objective, then any counter-intuitiveness\nin the anti-realist’s failure to accommodate objectivity can no\nlonger be raised as an ongoing consideration against moral\nanti-realism.\n\nA theory’s clashing with common sense is not the only way in\nwhich it can face a burden of proof. Of two theories, A and B, if A\nexplains a range of observable phenomena more readily than B, then\nproponents of B will have to undertake extra labor of squaring their\ntheory with the available evidence—and this may be the case even\nif B strikes people as the more intuitive theory. For example, perhaps\nNewtonian physics is more intuitive than Einsteinian, but there is\nobservable data—e.g., the results of the famous solar eclipse\nexperiments of 1919—that the latter theory is much better\nequipped to explain.\n\nWhat is it, then, that metaethical theories are expected to explain?\nThe range of phenomena is ill-defined and open-ended, but is typically\ntaken to include such things as the manifest features of moral\nlanguage, the importance of morality in our lives, moral practices and\ninstitutions, the way moral considerations engage motivation, the\ncharacter of moral disagreement, and the acquisition of moral\nattitudes.\n\nConsider the first of these explananda: moral language. Here it seems\nreasonable to claim that the noncognitivist shoulders a burden of\nproof. Moral predicates appear to function linguistically like any\nother predicate: Just as the sentence “The cat is brown”\nmay be used as an antecedent of a conditional, as a premise of an\nargument, as the basis of a question (“Is the cat\nbrown?”), have its predicate nominalized (“Brownness is\nhad by the cat”), be embedded in a propositional attitude claim\n(“Mary believes that the cat is brown”), and have the\ntruth predicate applied to it (“‘The cat is brown’\nis true”)—so too can all these things be done, without\nobvious incoherence, with a moral sentence like “Stealing is\nmorally wrong.” This is entirely as the cognitivist would\npredict. By contrast, for a noncognitivist who maintains (as Ayer did)\nthat this moral judgment amounts to nothing more than\n“Stealing!” uttered in a special disapproval-expressing\ntone, all of this linguistic evidence represents a major (and perhaps\ninsurmountable) challenge.\n\nOther explananda, on the other hand, may reveal that it is the moral\nrealist who has the extra explaining to do. If moral properties are\ntaken to have an essential normativity—in terms of, say, placing\npractical demands upon us—then the realist faces the challenge\nof explaining how any such thing could exist objectively. The\nmoral non-objectivist, by contrast, sees moral normativity as\nsomething that we create—that practical demands arise from our\ndesires, emotions, values, judgments, practices, or institutions. Thus\nthe task of providing a moral ontology that accommodates normativity\nseems a much easier one for the non-objectivist than for the moral\nrealist. (The noncognitivist and the error theorist would seem to have\nan even easier time, since for them there is no moral ontology at\nall.)\n\nThere remains a great deal of dispute concerning what the phenomena\nare that a metaethical theory should be expected to explain; and even\nwhen some such phenomenon is roughly agreed upon, there is often\nsignificant disagreement over its exact nature. For example, pretty\nmuch everyone agrees that any decent metaethical theory should be able\nto explain the close connection between moral judgment and\nmotivation—but it is a live question whether that connection\nshould be construed as a necessary one, or whether a reliably\ncontingent connection will suffice. (See Svavardóttir 2006;\nRosati 2021.) Even when such disputes can be settled, there remains\nplenty of room for arguing over the importance of the explanandum in\nquestion (relative to other explananda), and for arguing whether a\ngiven theory does indeed adequately explain the phenomenon.\n\nIn short, attempts to establish the burden of proof are as slippery\nand indecisive in the debate between the moral realist and the moral\nanti-realist as they tend to be generally in philosophy. The matter is\ncomplicated by the fact that there are two kinds of burden-of-proof\ncase that can be pressed, and here they tend to pull against each\nother. On the one hand, it is widely assumed that common sense favors\nthe moral realist. On the other hand, moral realists face a cluster of\nexplanatory challenges concerning the nature of moral facts (how they\nrelate to non-moral facts, how we have access to them, why they have\npractical importance)—challenges that seem much more tractable\nfor the moral non-objectivist and often simply don’t arise for\neither the noncognitivist or the error theorist. This tension between\nwhat is considered to be the intuitive position and what is\nconsidered to be the empirically, metaphysically, and\nepistemologically defensible position, motivates and animates\nmuch of the debate between the moral realist and moral\nanti-realist.\n",
    "section_title": "2. Who Bears the Burden of Proof?",
    "entry_title": "Moral Anti-Realism",
    "hierarchy_title": "Moral Anti-Realism || Who Bears the Burden of Proof?",
    "tokenized_text": [
        "bear",
        "burden",
        "proof",
        "bear",
        "burden",
        "proof",
        "widely",
        "assumed",
        "moral",
        "realism",
        "enjoys",
        "sort",
        "presumption",
        "favor",
        "antirealist",
        "work",
        "overcome",
        "jonathan",
        "dancy",
        "writes",
        "take",
        "moral",
        "value",
        "part",
        "fabric",
        "world",
        "take",
        "absence",
        "contrary",
        "consideration",
        "action",
        "agent",
        "sort",
        "moral",
        "property",
        "experience",
        "similar",
        "vein",
        "david",
        "mcnaughton",
        "claim",
        "realist",
        "contention",
        "rebut",
        "argument",
        "designed",
        "persuade",
        "u",
        "moral",
        "realism",
        "philosophically",
        "untenable",
        "order",
        "made",
        "case",
        "david",
        "brink",
        "concurs",
        "begin",
        "tacit",
        "cognitivists",
        "realist",
        "ethics",
        "moral",
        "realism",
        "metaethical",
        "starting",
        "point",
        "give",
        "involve",
        "unacceptable",
        "metaphysical",
        "epistemological",
        "commitment",
        "may",
        "questioned",
        "however",
        "whether",
        "moral",
        "realism",
        "really",
        "enjoy",
        "intuitive",
        "support",
        "also",
        "questioned",
        "whether",
        "burden",
        "antirealist",
        "extra",
        "labor",
        "first",
        "matter",
        "may",
        "argued",
        "distinction",
        "drawn",
        "distinguishing",
        "moral",
        "realism",
        "antirealism",
        "finegrained",
        "abstruse",
        "folk",
        "determinate",
        "opinion",
        "example",
        "radically",
        "unclear",
        "extent",
        "common",
        "sense",
        "embrace",
        "objectivity",
        "moral",
        "fact",
        "empirical",
        "investigation",
        "ostensibly",
        "examining",
        "extent",
        "ordinary",
        "people",
        "endorse",
        "moral",
        "objectivism",
        "eg",
        "goodwin",
        "darley",
        "uttich",
        "et",
        "al",
        "upon",
        "examination",
        "many",
        "study",
        "seem",
        "fact",
        "examine",
        "extent",
        "ordinary",
        "people",
        "endorse",
        "moral",
        "absolutism",
        "see",
        "hopster",
        "even",
        "professional",
        "researcher",
        "struggle",
        "grasp",
        "concept",
        "moral",
        "objectivity",
        "difficult",
        "maintain",
        "confidently",
        "folk",
        "firm",
        "determinate",
        "intuition",
        "subject",
        "furthermore",
        "even",
        "empirical",
        "investigation",
        "collective",
        "opinion",
        "locate",
        "strong",
        "intuition",
        "favor",
        "mindindependent",
        "morality",
        "may",
        "equally",
        "robust",
        "intuition",
        "favor",
        "morality",
        "minddependent",
        "example",
        "fact",
        "seem",
        "unwilling",
        "defer",
        "expert",
        "forming",
        "moral",
        "view",
        "appears",
        "count",
        "realism",
        "see",
        "mcgrath",
        "similarly",
        "fact",
        "expect",
        "person",
        "necessarily",
        "accept",
        "others",
        "reason",
        "moral",
        "view",
        "seems",
        "reveal",
        "antirealist",
        "tendency",
        "see",
        "foot",
        "discussion",
        "given",
        "difficulty",
        "deciding",
        "articulating",
        "kind",
        "objectivity",
        "relevant",
        "moral",
        "realismantirealism",
        "division",
        "given",
        "range",
        "potential",
        "subtlety",
        "option",
        "might",
        "thought",
        "rash",
        "claim",
        "common",
        "sense",
        "firm",
        "opinion",
        "one",
        "way",
        "subject",
        "second",
        "matter",
        "even",
        "identify",
        "widespread",
        "univocal",
        "intuition",
        "favor",
        "moral",
        "realism",
        "remains",
        "unclear",
        "extent",
        "adopt",
        "methodology",
        "reward",
        "moral",
        "realism",
        "dialectical",
        "advantage",
        "come",
        "metaethics",
        "comparison",
        "think",
        "physicist",
        "endeavor",
        "come",
        "intuitive",
        "theory",
        "example",
        "widespread",
        "erroneous",
        "intuition",
        "fastmoving",
        "ball",
        "exiting",
        "curved",
        "tube",
        "continue",
        "travel",
        "curving",
        "trajectory",
        "mccloskey",
        "et",
        "al",
        "fact",
        "newtonian",
        "physic",
        "predicts",
        "ball",
        "fact",
        "continue",
        "straight",
        "trajectory",
        "surely",
        "sense",
        "mark",
        "theory",
        "moreover",
        "important",
        "distinguish",
        "prorealist",
        "intuition",
        "ex",
        "ante",
        "ex",
        "post",
        "someone",
        "accepted",
        "consideration",
        "argument",
        "favor",
        "moral",
        "antirealism",
        "counterintuitiveness",
        "conclusion",
        "hasex",
        "antemay",
        "considered",
        "irrelevant",
        "one",
        "noteworthy",
        "type",
        "strategy",
        "debunking",
        "argument",
        "seek",
        "undermine",
        "moral",
        "intuition",
        "showing",
        "product",
        "process",
        "ground",
        "thinking",
        "reliable",
        "indicator",
        "truth",
        "see",
        "street",
        "neill",
        "joyce",
        "extent",
        "antirealist",
        "provide",
        "plausible",
        "explanation",
        "human",
        "would",
        "tend",
        "think",
        "morality",
        "objective",
        "even",
        "objective",
        "counterintuitiveness",
        "antirealist",
        "failure",
        "accommodate",
        "objectivity",
        "longer",
        "raised",
        "ongoing",
        "consideration",
        "moral",
        "antirealism",
        "theory",
        "clashing",
        "common",
        "sense",
        "way",
        "face",
        "burden",
        "proof",
        "two",
        "theory",
        "b",
        "explains",
        "range",
        "observable",
        "phenomenon",
        "readily",
        "b",
        "proponent",
        "b",
        "undertake",
        "extra",
        "labor",
        "squaring",
        "theory",
        "available",
        "evidenceand",
        "may",
        "case",
        "even",
        "b",
        "strike",
        "people",
        "intuitive",
        "theory",
        "example",
        "perhaps",
        "newtonian",
        "physic",
        "intuitive",
        "einsteinian",
        "observable",
        "dataeg",
        "result",
        "famous",
        "solar",
        "eclipse",
        "experiment",
        "that",
        "latter",
        "theory",
        "much",
        "better",
        "equipped",
        "explain",
        "metaethical",
        "theory",
        "expected",
        "explain",
        "range",
        "phenomenon",
        "illdefined",
        "openended",
        "typically",
        "taken",
        "include",
        "thing",
        "manifest",
        "feature",
        "moral",
        "language",
        "importance",
        "morality",
        "life",
        "moral",
        "practice",
        "institution",
        "way",
        "moral",
        "consideration",
        "engage",
        "motivation",
        "character",
        "moral",
        "disagreement",
        "acquisition",
        "moral",
        "attitude",
        "consider",
        "first",
        "explananda",
        "moral",
        "language",
        "seems",
        "reasonable",
        "claim",
        "noncognitivist",
        "shoulder",
        "burden",
        "proof",
        "moral",
        "predicate",
        "appear",
        "function",
        "linguistically",
        "like",
        "predicate",
        "sentence",
        "cat",
        "brown",
        "may",
        "used",
        "antecedent",
        "conditional",
        "premise",
        "argument",
        "basis",
        "question",
        "cat",
        "brown",
        "predicate",
        "nominalized",
        "brownness",
        "cat",
        "embedded",
        "propositional",
        "attitude",
        "claim",
        "mary",
        "belief",
        "cat",
        "brown",
        "truth",
        "predicate",
        "applied",
        "cat",
        "brown",
        "true",
        "so",
        "thing",
        "done",
        "without",
        "obvious",
        "incoherence",
        "moral",
        "sentence",
        "like",
        "stealing",
        "morally",
        "wrong",
        "entirely",
        "cognitivist",
        "would",
        "predict",
        "contrast",
        "noncognitivist",
        "maintains",
        "ayer",
        "moral",
        "judgment",
        "amount",
        "nothing",
        "stealing",
        "uttered",
        "special",
        "disapprovalexpressing",
        "tone",
        "linguistic",
        "evidence",
        "represents",
        "major",
        "perhaps",
        "insurmountable",
        "challenge",
        "explananda",
        "hand",
        "may",
        "reveal",
        "moral",
        "realist",
        "extra",
        "explaining",
        "moral",
        "property",
        "taken",
        "essential",
        "normativityin",
        "term",
        "say",
        "placing",
        "practical",
        "demand",
        "upon",
        "usthen",
        "realist",
        "face",
        "challenge",
        "explaining",
        "thing",
        "could",
        "exist",
        "objectively",
        "moral",
        "nonobjectivist",
        "contrast",
        "see",
        "moral",
        "normativity",
        "something",
        "createthat",
        "practical",
        "demand",
        "arise",
        "desire",
        "emotion",
        "value",
        "judgment",
        "practice",
        "institution",
        "thus",
        "task",
        "providing",
        "moral",
        "ontology",
        "accommodates",
        "normativity",
        "seems",
        "much",
        "easier",
        "one",
        "nonobjectivist",
        "moral",
        "realist",
        "noncognitivist",
        "error",
        "theorist",
        "would",
        "seem",
        "even",
        "easier",
        "time",
        "since",
        "moral",
        "ontology",
        "remains",
        "great",
        "deal",
        "dispute",
        "concerning",
        "phenomenon",
        "metaethical",
        "theory",
        "expected",
        "explain",
        "even",
        "phenomenon",
        "roughly",
        "agreed",
        "upon",
        "often",
        "significant",
        "disagreement",
        "exact",
        "nature",
        "example",
        "pretty",
        "much",
        "everyone",
        "agrees",
        "decent",
        "metaethical",
        "theory",
        "able",
        "explain",
        "close",
        "connection",
        "moral",
        "judgment",
        "motivationbut",
        "live",
        "question",
        "whether",
        "connection",
        "construed",
        "necessary",
        "one",
        "whether",
        "reliably",
        "contingent",
        "connection",
        "suffice",
        "see",
        "svavardóttir",
        "rosati",
        "even",
        "dispute",
        "settled",
        "remains",
        "plenty",
        "room",
        "arguing",
        "importance",
        "explanandum",
        "question",
        "relative",
        "explananda",
        "arguing",
        "whether",
        "given",
        "theory",
        "indeed",
        "adequately",
        "explain",
        "phenomenon",
        "short",
        "attempt",
        "establish",
        "burden",
        "proof",
        "slippery",
        "indecisive",
        "debate",
        "moral",
        "realist",
        "moral",
        "antirealist",
        "tend",
        "generally",
        "philosophy",
        "matter",
        "complicated",
        "fact",
        "two",
        "kind",
        "burdenofproof",
        "case",
        "pressed",
        "tend",
        "pull",
        "one",
        "hand",
        "widely",
        "assumed",
        "common",
        "sense",
        "favor",
        "moral",
        "realist",
        "hand",
        "moral",
        "realist",
        "face",
        "cluster",
        "explanatory",
        "challenge",
        "concerning",
        "nature",
        "moral",
        "fact",
        "relate",
        "nonmoral",
        "fact",
        "access",
        "practical",
        "importance",
        "challenges",
        "seem",
        "much",
        "tractable",
        "moral",
        "nonobjectivist",
        "often",
        "simply",
        "arise",
        "either",
        "noncognitivist",
        "error",
        "theorist",
        "tension",
        "considered",
        "intuitive",
        "position",
        "considered",
        "empirically",
        "metaphysically",
        "epistemologically",
        "defensible",
        "position",
        "motivates",
        "animates",
        "much",
        "debate",
        "moral",
        "realist",
        "moral",
        "antirealist"
    ]
}