{
    "main_text": "What the Particularist Does Not Believe\n2. What the Particularist Does Not Believe\n\n\nIt is standard, at least in cultures informed by the Christian\ntradition, to think of the moral person as the person of principle.\nThis person is the person who has learnt, or developed for herself, a\nsufficient range of sound moral principles (of either type), and who\nhas sufficient skill at applying these principles to cases as they\ncrop up. There is no need to underestimate the sort of skill that\nwould be required for this; the matter is certainly far from\nmechanical. One needs judgement both to discern whether a principle\napplies at all and, if it does, what exactly it requires of\none. Nonetheless, however difficult it may be, moral judgement is\nconceived here as the application of principles to cases.\n\n\nIf moral judgement is a rational enterprise, it must be subject to\nconstraints of consistency. What is demanded of us when we are\nrequired to be consistent in our moral judgements? The answer is that\nwe are required to apply our principles consistently, that is, to\napply the same principle to similar cases. It is inconsistent to apply\nthe principle ‘don’t lie’ to cases involving one’s friends\nand not to those that involve strangers. If you want to behave in that\nsort of way, your principle is going to have to be ‘don’t lie to\nyour friends’. What this tells us, of course, is that consistency is\nnot the only requirement.  Our moral principles are supposed to be\nimpartial, and it is not obvious that the principle ‘don’t lie\nto your friends’meets this condition. But at least\nsomeone who takes it as his principle can tell the truth to his\nfriends and lie to strangers without inconsistency.\n\n\nWhy do we think of the moral person as the person of principle, and\nwhy do we think of moral judgement as subject to this sort of\nconsistency constraint? (As we will see later, there are other forms\nthat the consistency constraint could have taken.) The answer, I\nthink, is that we suppose that without moral principles there could be\nno such thing as the difference between right and wrong. Rightness and\nwrongness are peculiar properties, and the only way that an action can\nget them is by being related to a principle in one way or another. So\nunless there are principles saying which sorts of actions are right\nand which wrong, none would be right and none wrong. If this were so,\nit would hardly be surprising that the good moral judge would be the\nperson capable of following in her mind the way in which actions get\nto be right or wrong, which requires knowing the relevant principles\nand seeing that they have this effect here and that effect there. And\nit would be hardly surprising that consistency in judgement would\namount to no more than applying similar principles to similar\ncases.\n\n\nA rather different argument appeals not so much to a metaphysical need\nfor principles as to an epistemological need. If there is a\ndistinction between right and wrong actions, how are we to detect it?\nThere must be a detectable difference between the properties of the\nright ones and the properties of the wrong ones. Now if an action is\nwrong, it is wrong because of certain other features it has—the\nnon-moral features that make it wrong. Those non-moral features will\nbe detectable in the ordinary way, whatever that is. Good moral\njudges, having detected them, can somehow work out whether they make\nthe action right or wrong. But if this ability is not a matter of\nmagic, it must rest on an at least implicit knowledge of regularities\nconnecting the non-moral features of actions and their moral\nproperties. Moral principles specify such regularities. So if moral\njudgement is to be even possible, there must be a set of principles\nconnecting moral properties to non-moral properties, contrary to what\nthe particularist claims.\n\n\nIf this is our picture of the individual trying to decide what she\nought to do, how are we likely to conceive of the way to resolve\ndisagreements between two individuals? Of course there are the facts\nof the matter to be sorted out between them. Then presumably they have\nto try to agree at least on which principles are to be taken as\nrelevant (that is, to agree on the principles, and to agree that they\nare the relevant ones in the present case). Finally, they have to\nagree on the course of action that those principles recommend in the\nsituation that faces them. This would be, as we might put it, a full\nresolution of any initial disagreement. Otherwise we are looking for a\ncompromise of one form or another. It is possible, for instance, for a\ndisagreement on the principles not to make any practical difference as\nthings turn out, so that it can be left to be sorted out another\nday.\n\n\nOverall, then, we are offered a way in which moral reasons work, and\nan account of the perfectly moral agent whose decision processes fit\nthe way the reasons work, that is, fit the way in which an action can\nget to be right or wrong. But the way moral reasons work is probably\nvery different from the way that other reasons work. Other reasons are\nnot principle-driven. Morality is special, since without principles it\nis impossible. (Remember that the two arguments given above for the\nneed for principles appealed to the special nature of\nrightness and wrongness, or of moral properties in general.)\n",
    "section_title": "2. What the Particularist Does Not Believe",
    "entry_title": "Moral Particularism",
    "hierarchy_title": "Moral Particularism || What the Particularist Does Not Believe",
    "tokenized_text": [
        "particularist",
        "believe",
        "particularist",
        "believe",
        "standard",
        "least",
        "culture",
        "informed",
        "christian",
        "tradition",
        "think",
        "moral",
        "person",
        "person",
        "principle",
        "person",
        "person",
        "learnt",
        "developed",
        "sufficient",
        "range",
        "sound",
        "moral",
        "principle",
        "either",
        "type",
        "sufficient",
        "skill",
        "applying",
        "principle",
        "case",
        "crop",
        "need",
        "underestimate",
        "sort",
        "skill",
        "would",
        "required",
        "matter",
        "certainly",
        "far",
        "mechanical",
        "one",
        "need",
        "judgement",
        "discern",
        "whether",
        "principle",
        "applies",
        "exactly",
        "requires",
        "one",
        "nonetheless",
        "however",
        "difficult",
        "may",
        "moral",
        "judgement",
        "conceived",
        "application",
        "principle",
        "case",
        "moral",
        "judgement",
        "rational",
        "enterprise",
        "must",
        "subject",
        "constraint",
        "consistency",
        "demanded",
        "u",
        "required",
        "consistent",
        "moral",
        "judgement",
        "answer",
        "required",
        "apply",
        "principle",
        "consistently",
        "apply",
        "principle",
        "similar",
        "case",
        "inconsistent",
        "apply",
        "principle",
        "lie",
        "case",
        "involving",
        "one",
        "friend",
        "involve",
        "stranger",
        "want",
        "behave",
        "sort",
        "way",
        "principle",
        "going",
        "lie",
        "friend",
        "tell",
        "u",
        "course",
        "consistency",
        "requirement",
        "moral",
        "principle",
        "supposed",
        "impartial",
        "obvious",
        "principle",
        "lie",
        "friend",
        "meet",
        "condition",
        "least",
        "someone",
        "take",
        "principle",
        "tell",
        "truth",
        "friend",
        "lie",
        "stranger",
        "without",
        "inconsistency",
        "think",
        "moral",
        "person",
        "person",
        "principle",
        "think",
        "moral",
        "judgement",
        "subject",
        "sort",
        "consistency",
        "constraint",
        "see",
        "later",
        "form",
        "consistency",
        "constraint",
        "could",
        "taken",
        "answer",
        "think",
        "suppose",
        "without",
        "moral",
        "principle",
        "could",
        "thing",
        "difference",
        "right",
        "wrong",
        "rightness",
        "wrongness",
        "peculiar",
        "property",
        "way",
        "action",
        "get",
        "related",
        "principle",
        "one",
        "way",
        "another",
        "unless",
        "principle",
        "saying",
        "sort",
        "action",
        "right",
        "wrong",
        "none",
        "would",
        "right",
        "none",
        "wrong",
        "would",
        "hardly",
        "surprising",
        "good",
        "moral",
        "judge",
        "would",
        "person",
        "capable",
        "following",
        "mind",
        "way",
        "action",
        "get",
        "right",
        "wrong",
        "requires",
        "knowing",
        "relevant",
        "principle",
        "seeing",
        "effect",
        "effect",
        "would",
        "hardly",
        "surprising",
        "consistency",
        "judgement",
        "would",
        "amount",
        "applying",
        "similar",
        "principle",
        "similar",
        "case",
        "rather",
        "different",
        "argument",
        "appeal",
        "much",
        "metaphysical",
        "need",
        "principle",
        "epistemological",
        "need",
        "distinction",
        "right",
        "wrong",
        "action",
        "detect",
        "must",
        "detectable",
        "difference",
        "property",
        "right",
        "one",
        "property",
        "wrong",
        "one",
        "action",
        "wrong",
        "wrong",
        "certain",
        "feature",
        "hasthe",
        "nonmoral",
        "feature",
        "make",
        "wrong",
        "nonmoral",
        "feature",
        "detectable",
        "ordinary",
        "way",
        "whatever",
        "good",
        "moral",
        "judge",
        "detected",
        "somehow",
        "work",
        "whether",
        "make",
        "action",
        "right",
        "wrong",
        "ability",
        "matter",
        "magic",
        "must",
        "rest",
        "least",
        "implicit",
        "knowledge",
        "regularity",
        "connecting",
        "nonmoral",
        "feature",
        "action",
        "moral",
        "property",
        "moral",
        "principle",
        "specify",
        "regularity",
        "moral",
        "judgement",
        "even",
        "possible",
        "must",
        "set",
        "principle",
        "connecting",
        "moral",
        "property",
        "nonmoral",
        "property",
        "contrary",
        "particularist",
        "claim",
        "picture",
        "individual",
        "trying",
        "decide",
        "ought",
        "likely",
        "conceive",
        "way",
        "resolve",
        "disagreement",
        "two",
        "individual",
        "course",
        "fact",
        "matter",
        "sorted",
        "presumably",
        "try",
        "agree",
        "least",
        "principle",
        "taken",
        "relevant",
        "agree",
        "principle",
        "agree",
        "relevant",
        "one",
        "present",
        "case",
        "finally",
        "agree",
        "course",
        "action",
        "principle",
        "recommend",
        "situation",
        "face",
        "would",
        "might",
        "put",
        "full",
        "resolution",
        "initial",
        "disagreement",
        "otherwise",
        "looking",
        "compromise",
        "one",
        "form",
        "another",
        "possible",
        "instance",
        "disagreement",
        "principle",
        "make",
        "practical",
        "difference",
        "thing",
        "turn",
        "left",
        "sorted",
        "another",
        "day",
        "overall",
        "offered",
        "way",
        "moral",
        "reason",
        "work",
        "account",
        "perfectly",
        "moral",
        "agent",
        "whose",
        "decision",
        "process",
        "fit",
        "way",
        "reason",
        "work",
        "fit",
        "way",
        "action",
        "get",
        "right",
        "wrong",
        "way",
        "moral",
        "reason",
        "work",
        "probably",
        "different",
        "way",
        "reason",
        "work",
        "reason",
        "principledriven",
        "morality",
        "special",
        "since",
        "without",
        "principle",
        "impossible",
        "remember",
        "two",
        "argument",
        "given",
        "need",
        "principle",
        "appealed",
        "special",
        "nature",
        "rightness",
        "wrongness",
        "moral",
        "property",
        "general"
    ]
}