{
    "main_text": "Descriptive Evolutionary Ethics: Explaining Morality in the Empirical Sense || Biological and Psychological Altruism\n2.2 Biological and Psychological Altruism\n\nMany discussions of morality and evolutionary biology focus largely on\nthe issue of altruistic feeling and behavior. This can be\nconfusing because in addition to psychological altruism there\nis also biological altruism, which is found in many species.\n(See Kitcher 2011, part I, for a comprehensive discussion.)\nPsychological altruism involves caring about others’ welfare\nand deliberately benefiting them for their own sake,\nwith no restriction on the type of benefit involved. By contrast,\nbiological altruism has nothing essentially to do with intentions or\nmotives, and it pertains only to ‘benefits’ to others that\nincrease their reproductive fitness (boosting their genetic\ncontribution to future generations).\n\nThough psychological altruism is different from biological altruism,\nthere are a variety of possible explanations of the evolution of\npsychological altruism that appeal to the same factors that explain\nthe origins of biological altruism, namely:\n\nKin selection or ‘inclusive fitness’ theory\n(Hamilton 1964);\nSelection pressures leading to teamwork, reciprocal\naltruism (Trivers 1971; Maynard Smith 1982; Axelrod 1984) and\nindirect reciprocity (Alexander 1987; Joyce 2006); and\nGroup selection (Sober and Wilson 1998).\n\n\nIt would take us too far afield to survey all these biological\naccounts in detail, the background for which is already treated in the\nentry for\n biological altruism;\n there are also many excellent and accessible summaries of such\naccounts and their application to psychological altruism (e.g., Joyce\n2006, ch. 1). We will settle here for one detailed illustration of one\nway in which biological altruism can be given an evolutionary\nexplanation, followed by a sketch of the ways in which this and other\nevolutionary mechanisms might likewise explain the emergence of\npsychological altruism—keeping in mind that this is all\njust one part of explaining morality proper, to which we\nreturn in the next sub-section.\n\nThe very idea that biological altruism can come about through natural\nselection may initially seem puzzling. One way of characterizing\nnatural selection, after all, is in terms of “selfish\ngenes”: natural selection occurs when a variant of a gene (an\nallele) at a given locus tends to cause a modification of a bodily or\nbehavioral trait (a phenotypic trait) in a way that, in the overall\nenvironment, tends to cause that variant of the gene to increase its\nrelative frequency in the next generation; this then increases the\nrepresentation of the associated trait modification as well. Typically\nthis happens when the phenotypic modification is one that causes the\norganism to have greater reproductive success: if, in the overall\ncontext, allele A causes its carrier to have a trait T that causes the\norganism to have more offspring than other organisms in the population\nwho carry rival allele A* and display alternative trait T*, then A\nwill be inherited and carried by more organisms in succeeding\ngenerations; and that means that T will likewise be displayed by more\norganisms (Dawkins, 1989). But how do we get from “selfish\ngenes” increasing their representation in the gene pool, via\nimproving the reproductive success of their carriers, to such things\nas cooperation and biological altruism? It turns out there are many\nways.\n\nTo take one dramatic example, consider social insect colonies, and in\nparticular, the Hymenoptera (bees, ants and wasps). In these colonies\nwe find such an extreme degree of cooperation—division of labor\n(queen, workers, soldiers, etc.), food-sharing, information\nsharing—that it is tempting to view the entire colony as a\nsingle functioning organism. Indeed, in the case of stinging worker\nhoney bees, there is not only cooperative labor but also, when\nnecessary, the ultimate sacrifice in defense of the hive (at least\nwhere the invader is a mammal, stinging of which proves fatal to the\nbee as the barbed sting is torn out upon being deposited in the\nvictim). How can such striking cooperation and self-sacrifice be\nexplained in evolutionary terms?\n\nOne important fact to notice is that the colony is one large family:\ntypically, the workers are sisters—daughters of the queen.\nReturn to the idea of “selfish genes” described above:\nwhat ultimately increases an allele’s representation in the gene\npool is its having some phenotypic effect that causes copies of that\nallele to be in more organisms in succeeding generations. That\nnormally happens when the phenotypic effect causes the organism to\nhave greater reproductive success, but it can equally happen if it\ncauses the organism’s close kin to have greater reproductive\nsuccess: for close kin are likely to carry copies of that same allele,\nwhich means that greater reproductive success for kin likewise\npropagates copies of the allele. So while an allele that causes an\norganism to engage in sex more often may thereby spread, so might an\nallele that causes an organism to help a sibling to reproduce (as by\naiding survival); either way, that allele will be helping to propagate\ncopies of itself in the next generation, which in turn means that the\nhelping behavior it causes will likewise spread over time (Dawkins\n1989, 171–77).\n\nThis mechanism of “kin selection” can explain how worker\nbees evolved such apparently ‘selfless’ traits, focused on\naiding the queen’s survival and reproduction. In fact, the\nsituation is even more interesting and extreme: workers have evolved\nto serve the queen’s reproduction at the complete expense of their\nown, as they are sterile. This extreme biological altruism,\nhowever, may be explained by the same principles, with the addition of\nthe fact that due to a genetic peculiarity of the Hymenoptera (their\nhaplodiploidy), sisters are more closely related to each\nother genetically than they would be to their own\n offspring.[4]\n This means that natural selection will actually favor worker traits\nthat help their mother reproduce (thus making more sisters,\nwho are especially likely to carry copies of the gene for that same\ntrait, making it spread), over traits in workers aimed at personal\nreproduction. This could explain how worker sterility evolved, as\ntraits focused on helping the queen took precedence over personal\nreproduction, and it explains how even suicidal behavior could have\nbeen selected for as propagating the genes that cause it (Dawkins\n1989, 174–75). (It is worth noting, however, that the theory of\nkin selection and inclusive fitness is highly complex and has received\nrenewed critical scrutiny in recent years. For a recent special\ncollection of articles on the topic see\n Royal Society Open Science on Inclusive Fitness).\n\nThis is only one example of one way in which biological altruism can\nevolve: there are others, which are not restricted to kin and are\nexplained using game-theoretic or group dynamic models (again, see the\nentry on\n biological altruism\n for details). The crucial point is just that any kind of\ngenetically-based trait can evolve if it happens to have the right\nkind of feedback effect on the genes that influence it. This brings\nus, then, to the sort of trait we are more interested in: a\ndisposition for psychological altruism, as defined above.\n\nAgain, while it may initially seem puzzling that evolution should give\nrise to psychological altruism, rather than merely to selfishness,\nthere is nothing paradoxical about it: a genetically-based disposition\nfor psychological altruism will evolve just in case such a trait, in\nthe relevant circumstances, promotes the propagation of the genes that\nbring it about (and does so more effectively than alternative traits\nproduced by rival alleles). And this can again happen in various\nways.\n\nThe basic idea is that psychological altruistic dispositions can\nevolve as proximate mechanisms or “modules” for\npromoting the biological advantages relevant to the forms of selection\nlisted above. In some cases, these adaptive psychological mechanisms\nwill involve specifically targeted or conditional altruistic\nmotivations, involving capacities for discrimination to focus benefits\non kin or on reciprocators. In other cases, the selection pressures\nwill give rise to less discriminating altruistic sentiments and\ntendencies as the simplest and most cost-effective mechanisms for\npromoting adaptive cooperative behaviors in a given environment. If\nour hominin ancestors tended to live in circumstances where the\nopportunities for ‘wasting’ altruism in\nnon-fitness-enhancing ways (e.g., on ‘outsiders’) were\nsufficiently few and far between, then a simple, undiscriminating\n(though limited) sense of concern and altruism may have promoted\nfitness at far less cost than more discriminating forms, evolving more\nreadily. One advantage of this hypothesis is that it might help\nexplain some sorts of concern and altruism that are otherwise hard to\nmake sense of in evolutionary terms.\n\nFor example, suppose you receive a letter from UNICEF soliciting\ncontributions for health and nutrition programs for children in\nDarfur, and you are moved to send a check. This is not merely\nselective altruism toward kin or likely reciprocators, but altruism\ntoward strangers who are in no position to reciprocate, and it might\ntherefore seem puzzling from a purely biological point of view: such\n‘indiscriminate altruism’ isn’t biologically adaptive\nin the way more selective altruism might be; your helping children in\nDarfur isn’t helping to propagate your own genes, so it may seem\nmysterious how such a trait could have evolved through natural\nselection. But a trait that is not presently adaptive may once have\nbeen. In the environment in which our hominin ancestors lived, where\nthere was little positive contact with outsiders, even relatively\nindiscriminate altruism would tend to benefit kin or potential\nreciprocators, and so might have been a simple adaptive mechanism on\nthe whole.\n\nIf so, then your presently non-adaptive altruistic behavior in our\ncurrent global environment could in principle be an expression of an\nevolved, indiscriminate altruistic tendency—an adaptation that\nis largely no longer adaptive, and so would amount to a kind of\n‘misfiring’ of formerly adaptive instincts (Dawkins 2006,\n220–21; Kitcher 2006b). It would be in this way on a par with\nour taste for fatty foods—originally evolved for its adaptive\neffects though it is no longer beneficial in today’s fast food\neconomy—though in the case of altruism the\n‘misfiring’ has happier results. Of course, it’s also\npossible (as discussed in section 2.4) that your altruistic tendency\nisn’t itself an adaptation at all, but is instead rooted in values\nthat you’ve developed, through moral reflection in your cultural\ncontext, independently of specific evolutionary influences. Or it may\nbe some combination of the two.\n\nThis area of inquiry remains largely speculative, since it is one\nthing to develop models for how psychological altruism could in\nprinciple evolve, and quite another to show convincingly that a given\nform of natural selection has in fact played the relevant role in\nactual human evolutionary history. There may be doubts, for example,\nwhether there was sufficient pair-wise engagement in iterated\nprisoner’s dilemma games to explain the evolution of reciprocal\naltruism according to some of the most familiar game-theoretic models\n(Kitcher 2006a,b). In any case, it is time to return to the issue of\nmoral judgment, which is crucial to the explanation of\nmorality proper, and goes beyond mere altruistic feeling and\nbehavior. The following sub-section describes one leading\nhypothesis.\n",
    "section_title": "2.2 Biological and Psychological Altruism",
    "entry_title": "Morality and Evolutionary Biology",
    "hierarchy_title": "Morality and Evolutionary Biology || Descriptive Evolutionary Ethics: Explaining Morality in the Empirical Sense || Biological and Psychological Altruism",
    "tokenized_text": [
        "descriptive",
        "evolutionary",
        "ethic",
        "explaining",
        "morality",
        "empirical",
        "sense",
        "biological",
        "psychological",
        "altruism",
        "biological",
        "psychological",
        "altruism",
        "many",
        "discussion",
        "morality",
        "evolutionary",
        "biology",
        "focus",
        "largely",
        "issue",
        "altruistic",
        "feeling",
        "behavior",
        "confusing",
        "addition",
        "psychological",
        "altruism",
        "also",
        "biological",
        "altruism",
        "found",
        "many",
        "specie",
        "see",
        "kitcher",
        "part",
        "comprehensive",
        "discussion",
        "psychological",
        "altruism",
        "involves",
        "caring",
        "others",
        "welfare",
        "deliberately",
        "benefiting",
        "sake",
        "restriction",
        "type",
        "benefit",
        "involved",
        "contrast",
        "biological",
        "altruism",
        "nothing",
        "essentially",
        "intention",
        "motif",
        "pertains",
        "benefit",
        "others",
        "increase",
        "reproductive",
        "fitness",
        "boosting",
        "genetic",
        "contribution",
        "future",
        "generation",
        "though",
        "psychological",
        "altruism",
        "different",
        "biological",
        "altruism",
        "variety",
        "possible",
        "explanation",
        "evolution",
        "psychological",
        "altruism",
        "appeal",
        "factor",
        "explain",
        "origin",
        "biological",
        "altruism",
        "namely",
        "kin",
        "selection",
        "inclusive",
        "fitness",
        "theory",
        "hamilton",
        "selection",
        "pressure",
        "leading",
        "teamwork",
        "reciprocal",
        "altruism",
        "trivers",
        "maynard",
        "smith",
        "axelrod",
        "indirect",
        "reciprocity",
        "alexander",
        "joyce",
        "group",
        "selection",
        "sober",
        "wilson",
        "would",
        "take",
        "u",
        "far",
        "afield",
        "survey",
        "biological",
        "account",
        "detail",
        "background",
        "already",
        "treated",
        "entry",
        "biological",
        "altruism",
        "also",
        "many",
        "excellent",
        "accessible",
        "summary",
        "account",
        "application",
        "psychological",
        "altruism",
        "eg",
        "joyce",
        "ch",
        "settle",
        "one",
        "detailed",
        "illustration",
        "one",
        "way",
        "biological",
        "altruism",
        "given",
        "evolutionary",
        "explanation",
        "followed",
        "sketch",
        "way",
        "evolutionary",
        "mechanism",
        "might",
        "likewise",
        "explain",
        "emergence",
        "psychological",
        "altruismkeeping",
        "mind",
        "one",
        "part",
        "explaining",
        "morality",
        "proper",
        "return",
        "next",
        "subsection",
        "idea",
        "biological",
        "altruism",
        "come",
        "natural",
        "selection",
        "may",
        "initially",
        "seem",
        "puzzling",
        "one",
        "way",
        "characterizing",
        "natural",
        "selection",
        "term",
        "selfish",
        "gene",
        "natural",
        "selection",
        "occurs",
        "variant",
        "gene",
        "allele",
        "given",
        "locus",
        "tends",
        "cause",
        "modification",
        "bodily",
        "behavioral",
        "trait",
        "phenotypic",
        "trait",
        "way",
        "overall",
        "environment",
        "tends",
        "cause",
        "variant",
        "gene",
        "increase",
        "relative",
        "frequency",
        "next",
        "generation",
        "increase",
        "representation",
        "associated",
        "trait",
        "modification",
        "well",
        "typically",
        "happens",
        "phenotypic",
        "modification",
        "one",
        "cause",
        "organism",
        "greater",
        "reproductive",
        "success",
        "overall",
        "context",
        "allele",
        "cause",
        "carrier",
        "trait",
        "cause",
        "organism",
        "offspring",
        "organism",
        "population",
        "carry",
        "rival",
        "allele",
        "display",
        "alternative",
        "trait",
        "inherited",
        "carried",
        "organism",
        "succeeding",
        "generation",
        "mean",
        "likewise",
        "displayed",
        "organism",
        "dawkins",
        "get",
        "selfish",
        "gene",
        "increasing",
        "representation",
        "gene",
        "pool",
        "via",
        "improving",
        "reproductive",
        "success",
        "carrier",
        "thing",
        "cooperation",
        "biological",
        "altruism",
        "turn",
        "many",
        "way",
        "take",
        "one",
        "dramatic",
        "example",
        "consider",
        "social",
        "insect",
        "colony",
        "particular",
        "hymenoptera",
        "bee",
        "ant",
        "wasp",
        "colony",
        "find",
        "extreme",
        "degree",
        "cooperationdivision",
        "labor",
        "queen",
        "worker",
        "soldier",
        "etc",
        "foodsharing",
        "information",
        "sharingthat",
        "tempting",
        "view",
        "entire",
        "colony",
        "single",
        "functioning",
        "organism",
        "indeed",
        "case",
        "stinging",
        "worker",
        "honey",
        "bee",
        "cooperative",
        "labor",
        "also",
        "necessary",
        "ultimate",
        "sacrifice",
        "defense",
        "hive",
        "least",
        "invader",
        "mammal",
        "stinging",
        "prof",
        "fatal",
        "bee",
        "barbed",
        "sting",
        "torn",
        "upon",
        "deposited",
        "victim",
        "striking",
        "cooperation",
        "selfsacrifice",
        "explained",
        "evolutionary",
        "term",
        "one",
        "important",
        "fact",
        "notice",
        "colony",
        "one",
        "large",
        "family",
        "typically",
        "worker",
        "sistersdaughters",
        "queen",
        "return",
        "idea",
        "selfish",
        "gene",
        "described",
        "ultimately",
        "increase",
        "allele",
        "representation",
        "gene",
        "pool",
        "phenotypic",
        "effect",
        "cause",
        "copy",
        "allele",
        "organism",
        "succeeding",
        "generation",
        "normally",
        "happens",
        "phenotypic",
        "effect",
        "cause",
        "organism",
        "greater",
        "reproductive",
        "success",
        "equally",
        "happen",
        "cause",
        "organism",
        "close",
        "kin",
        "greater",
        "reproductive",
        "success",
        "close",
        "kin",
        "likely",
        "carry",
        "copy",
        "allele",
        "mean",
        "greater",
        "reproductive",
        "success",
        "kin",
        "likewise",
        "propagates",
        "copy",
        "allele",
        "allele",
        "cause",
        "organism",
        "engage",
        "sex",
        "often",
        "may",
        "thereby",
        "spread",
        "might",
        "allele",
        "cause",
        "organism",
        "help",
        "sibling",
        "reproduce",
        "aiding",
        "survival",
        "either",
        "way",
        "allele",
        "helping",
        "propagate",
        "copy",
        "next",
        "generation",
        "turn",
        "mean",
        "helping",
        "behavior",
        "cause",
        "likewise",
        "spread",
        "time",
        "dawkins",
        "mechanism",
        "kin",
        "selection",
        "explain",
        "worker",
        "bee",
        "evolved",
        "apparently",
        "selfless",
        "trait",
        "focused",
        "aiding",
        "queen",
        "survival",
        "reproduction",
        "fact",
        "situation",
        "even",
        "interesting",
        "extreme",
        "worker",
        "evolved",
        "serve",
        "queen",
        "reproduction",
        "complete",
        "expense",
        "sterile",
        "extreme",
        "biological",
        "altruism",
        "however",
        "may",
        "explained",
        "principle",
        "addition",
        "fact",
        "due",
        "genetic",
        "peculiarity",
        "hymenoptera",
        "haplodiploidy",
        "sister",
        "closely",
        "related",
        "genetically",
        "would",
        "offspring",
        "mean",
        "natural",
        "selection",
        "actually",
        "favor",
        "worker",
        "trait",
        "help",
        "mother",
        "reproduce",
        "thus",
        "making",
        "sister",
        "especially",
        "likely",
        "carry",
        "copy",
        "gene",
        "trait",
        "making",
        "spread",
        "trait",
        "worker",
        "aimed",
        "personal",
        "reproduction",
        "could",
        "explain",
        "worker",
        "sterility",
        "evolved",
        "trait",
        "focused",
        "helping",
        "queen",
        "took",
        "precedence",
        "personal",
        "reproduction",
        "explains",
        "even",
        "suicidal",
        "behavior",
        "could",
        "selected",
        "propagating",
        "gene",
        "cause",
        "dawkins",
        "worth",
        "noting",
        "however",
        "theory",
        "kin",
        "selection",
        "inclusive",
        "fitness",
        "highly",
        "complex",
        "received",
        "renewed",
        "critical",
        "scrutiny",
        "recent",
        "year",
        "recent",
        "special",
        "collection",
        "article",
        "topic",
        "see",
        "royal",
        "society",
        "open",
        "science",
        "inclusive",
        "fitness",
        "one",
        "example",
        "one",
        "way",
        "biological",
        "altruism",
        "evolve",
        "others",
        "restricted",
        "kin",
        "explained",
        "using",
        "gametheoretic",
        "group",
        "dynamic",
        "model",
        "see",
        "entry",
        "biological",
        "altruism",
        "detail",
        "crucial",
        "point",
        "kind",
        "geneticallybased",
        "trait",
        "evolve",
        "happens",
        "right",
        "kind",
        "feedback",
        "effect",
        "gene",
        "influence",
        "brings",
        "u",
        "sort",
        "trait",
        "interested",
        "disposition",
        "psychological",
        "altruism",
        "defined",
        "may",
        "initially",
        "seem",
        "puzzling",
        "evolution",
        "give",
        "rise",
        "psychological",
        "altruism",
        "rather",
        "merely",
        "selfishness",
        "nothing",
        "paradoxical",
        "geneticallybased",
        "disposition",
        "psychological",
        "altruism",
        "evolve",
        "case",
        "trait",
        "relevant",
        "circumstance",
        "promotes",
        "propagation",
        "gene",
        "bring",
        "effectively",
        "alternative",
        "trait",
        "produced",
        "rival",
        "allele",
        "happen",
        "various",
        "way",
        "basic",
        "idea",
        "psychological",
        "altruistic",
        "disposition",
        "evolve",
        "proximate",
        "mechanism",
        "module",
        "promoting",
        "biological",
        "advantage",
        "relevant",
        "form",
        "selection",
        "listed",
        "case",
        "adaptive",
        "psychological",
        "mechanism",
        "involve",
        "specifically",
        "targeted",
        "conditional",
        "altruistic",
        "motivation",
        "involving",
        "capacity",
        "discrimination",
        "focus",
        "benefit",
        "kin",
        "reciprocators",
        "case",
        "selection",
        "pressure",
        "give",
        "rise",
        "le",
        "discriminating",
        "altruistic",
        "sentiment",
        "tendency",
        "simplest",
        "costeffective",
        "mechanism",
        "promoting",
        "adaptive",
        "cooperative",
        "behavior",
        "given",
        "environment",
        "hominin",
        "ancestor",
        "tended",
        "live",
        "circumstance",
        "opportunity",
        "wasting",
        "altruism",
        "nonfitnessenhancing",
        "way",
        "eg",
        "outsider",
        "sufficiently",
        "far",
        "simple",
        "undiscriminating",
        "though",
        "limited",
        "sense",
        "concern",
        "altruism",
        "may",
        "promoted",
        "fitness",
        "far",
        "le",
        "cost",
        "discriminating",
        "form",
        "evolving",
        "readily",
        "one",
        "advantage",
        "hypothesis",
        "might",
        "help",
        "explain",
        "sort",
        "concern",
        "altruism",
        "otherwise",
        "hard",
        "make",
        "sense",
        "evolutionary",
        "term",
        "example",
        "suppose",
        "receive",
        "letter",
        "unicef",
        "soliciting",
        "contribution",
        "health",
        "nutrition",
        "program",
        "child",
        "darfur",
        "moved",
        "send",
        "check",
        "merely",
        "selective",
        "altruism",
        "toward",
        "kin",
        "likely",
        "reciprocators",
        "altruism",
        "toward",
        "stranger",
        "position",
        "reciprocate",
        "might",
        "therefore",
        "seem",
        "puzzling",
        "purely",
        "biological",
        "point",
        "view",
        "indiscriminate",
        "altruism",
        "biologically",
        "adaptive",
        "way",
        "selective",
        "altruism",
        "might",
        "helping",
        "child",
        "darfur",
        "helping",
        "propagate",
        "gene",
        "may",
        "seem",
        "mysterious",
        "trait",
        "could",
        "evolved",
        "natural",
        "selection",
        "trait",
        "presently",
        "adaptive",
        "may",
        "environment",
        "hominin",
        "ancestor",
        "lived",
        "little",
        "positive",
        "contact",
        "outsider",
        "even",
        "relatively",
        "indiscriminate",
        "altruism",
        "would",
        "tend",
        "benefit",
        "kin",
        "potential",
        "reciprocators",
        "might",
        "simple",
        "adaptive",
        "mechanism",
        "whole",
        "presently",
        "nonadaptive",
        "altruistic",
        "behavior",
        "current",
        "global",
        "environment",
        "could",
        "principle",
        "expression",
        "evolved",
        "indiscriminate",
        "altruistic",
        "tendencyan",
        "adaptation",
        "largely",
        "longer",
        "adaptive",
        "would",
        "amount",
        "kind",
        "misfiring",
        "formerly",
        "adaptive",
        "instinct",
        "dawkins",
        "kitcher",
        "b",
        "would",
        "way",
        "par",
        "taste",
        "fatty",
        "foodsoriginally",
        "evolved",
        "adaptive",
        "effect",
        "though",
        "longer",
        "beneficial",
        "today",
        "fast",
        "food",
        "economythough",
        "case",
        "altruism",
        "misfiring",
        "happier",
        "result",
        "course",
        "also",
        "possible",
        "discussed",
        "section",
        "altruistic",
        "tendency",
        "adaptation",
        "instead",
        "rooted",
        "value",
        "developed",
        "moral",
        "reflection",
        "cultural",
        "context",
        "independently",
        "specific",
        "evolutionary",
        "influence",
        "may",
        "combination",
        "two",
        "area",
        "inquiry",
        "remains",
        "largely",
        "speculative",
        "since",
        "one",
        "thing",
        "develop",
        "model",
        "psychological",
        "altruism",
        "could",
        "principle",
        "evolve",
        "quite",
        "another",
        "show",
        "convincingly",
        "given",
        "form",
        "natural",
        "selection",
        "fact",
        "played",
        "relevant",
        "role",
        "actual",
        "human",
        "evolutionary",
        "history",
        "may",
        "doubt",
        "example",
        "whether",
        "sufficient",
        "pairwise",
        "engagement",
        "iterated",
        "prisoner",
        "dilemma",
        "game",
        "explain",
        "evolution",
        "reciprocal",
        "altruism",
        "according",
        "familiar",
        "gametheoretic",
        "model",
        "kitcher",
        "a",
        "b",
        "case",
        "time",
        "return",
        "issue",
        "moral",
        "judgment",
        "crucial",
        "explanation",
        "morality",
        "proper",
        "go",
        "beyond",
        "mere",
        "altruistic",
        "feeling",
        "behavior",
        "following",
        "subsection",
        "describes",
        "one",
        "leading",
        "hypothesis"
    ]
}