{
    "main_text": "Moral Motivation and the Nature of Moral Properties\n2. Moral Motivation and the Nature of Moral Properties\n\nWhen we judge that an action is right or wrong or that a state of\naffairs is good or bad, we seem to represent the world as being a\ncertain way. We seem to express a moral belief, attributing a\nparticular moral property or normative characteristic to the action or\nstate of affairs. Taking the apparent representational form of moral\njudgments as our lead, we might try to explain moral motivation by\nappealing to the nature of the properties that figure in our\nmoral judgments. Perhaps we are reliably motivated by our moral\njudgments, at least when those judgments are roughly correct, because\nmoral properties like rightness and goodness\nthemselves motivate us, when we apprehend them.\n\nJ.L. Mackie (1977) famously criticizes this picture of moral\nproperties in his extended argument against the objectivity of ethics.\nMackie claims to find something like it in the work of a number of\nhistorical figures, including Kant and Sidgwick, but his clearest\npresentation of the picture comes in his remarks about Plato. Mackie\nwrites: “In Plato’s theory the Forms, and in particular\nthe Form of the Good, are eternal, extra-mental, realities. They are a\nvery central structural element in the fabric of the world. But it is\nheld also that just knowing them or ‘seeing’ them will not\nmerely tell men what to do but will ensure that they do it, overruling\nany contrary inclinations. The philosopher-kings in the\nRepublic can, Plato thinks, be trusted with unchecked power\nbecause their education will have given them knowledge of the Forms.\nBeing acquainted with the Forms of the Good and Justice and Beauty and\nthe rest they will, by this knowledge alone, without any further\nmotivation, be impelled to pursue and promote these ideals”\n(Mackie 1977, 23–24).\n\nCertain features of Plato’s picture of moral motivation—or\nat least Mackie’s characterization of it—merit attention.\nFirst, as Mackie construes Plato’s view, moral motivation\nsprings directly and entirely from grasping the presence of the moral\nproperties themselves. Apprehension of these properties move an agent\nto act, and to do so unaided by any additional source of motivation;\ntheir motivational power depends on no desire or disposition of the\nindividual herself. Second, apprehension of moral properties not only\nmotivates on its own: it provides overriding motivation. Once\nan agent does apprehends them, their motivating power overcomes any\nopposing desires or inclinations.\n\nIn maintaining, as he does, that Plato’s theory of the Forms\ndepicts what objective values would have to be like, Mackie, in\neffect, subscribes to (and attributes to Plato) a view called\nexistence internalism. According to existence internalism, a\nnecessary connection exists between having a certain normative status\nand\n motivation.[1]\n A state of affairs couldn’t be good, for example,\nunless apprehension of it was capable of motivating, though it need\nnot motivate overridingly. If an individual apprehends something and\nfails to be moved, then ceteris paribus, it isn’t good.\nAs Mackie describes Plato’s view, objective values provide\noverriding motivation, and so the view reflects a particularly strong\nform of existence internalism. According to that form of existence\ninternalism, a state of affairs wouldn’t be good or valuable\nunless apprehension of it would provide overriding motivation. The\ninternalist character of Mackie’s Platonic picture curiously\naligns it with contemporary views that similarly accept forms of\nexistence internalism, while holding that the capacity for motivation\nin fact depends on a preexisting desire. Consider a view about reasons\nassociated most prominently with Bernard Williams (1981). According to\nwhat is called internalism about reasons or reasons\ninternalism, necessarily, if an individual has a reason to do an\naction, he must be able to be motivated to do that action. On\nWilliams’ view, in order to be motivated, an individual must\nhave some motivating attitude in her current “motivational\nset.” Roughly speaking, then, if a consideration does not\nmotivate a person given her current desires or motivational set, it\ncannot be a reason for her to act. Both the views of Williams and of\nMackie’s Plato posit a necessary connection between normative\nstatus and motivation, but the former view makes normative status\ndepend, in a way the latter view would flatly reject, on an\nindividual’s subjective motives. \n\nMackie’s discussion provides a first illustration of how\naccounts of moral motivation have been deployed to defend or rebut\nbroader positions in metaethics. According to Mackie, the motivating\npower of objective values, if there were such values, would have to be\njust as Plato depicted it. “Plato’s Forms give a dramatic\npicture of what objective values would have to be. The Form of the\nGood is such that knowledge of it provides the knower with both a\ndirection and an overriding motive; something’s being good both\ntells the person who knows this to pursue it and makes him pursue it.\nAn objective good would be sought by anyone who was acquainted with\nit, not because of any contingent fact that this person, or every\nperson, is so constituted that he desires this end, but just because\nthe end has to-be-pursuedness somehow built into it” (Mackie\n1977, 40). Mackie contends that the moral sentences we utter when we\nmake moral judgments in fact express propositions about just such\n“objectively prescriptive” properties; as a result, our\nmoral judgments can be true or false. So moral\ncognitivism—the view that moral judgments and beliefs, and\nthe sentences that express them, can be true or false—provides\nthe correct account of moral semantics, of what our moral judgments\nmean. Given that our moral discourse is cognitivist, it would\nseem to presume the correctness of moral realism, the view,\nroughly, that moral judgments and beliefs are truth evaluable, and\nsome of them are literally\n true.[2]\n But moral discourse suffers from what is called “presupposition\nfailure,” according to Mackie: moral discourse presupposes\nobjectively prescriptive properties, but there aren’t any; such\nproperties would have to be “queer entities” unlike\nanything else in the world. Talk about morality is, Mackie evidently\nthinks, rather like talk about unicorns. Our “unicorn\ntalk” expresses propositions (at least assuming it follows\nmedieval legend) about horse-like creatures, tamable only by virgins,\nwhose spiral horns possess magical powers. But there are no such\ncreatures, and so our unicorn talk is systematically in error, though\nfew of us any longer succumb to the error. In denying the existence of\nmoral properties, Mackie rejects moral realism, combining a\ncognitivist moral semantics with an error theory. According\nto the error theory, “although most people in making moral\njudgments implicitly claim…to be pointing to something\nobjectively prescriptive, these claims are all false” (Mackie\n1977,\n 35).[3]\n\nAlthough contemporary philosophers have been divided with respect to\nMackie’s moral skepticism, they have mostly agreed in rejecting\nhis extremely strong claims about what moral motivation, and the\nobjective moral properties that figure in our moral judgments, would\nhave to be like. They have uniformly rejected the suggestion that a\ngrasp of morality’s requirements would produce overriding\nmotivation to act accordingly. And most have rejected efforts to\nexplain moral motivation by appealing to a motivating power emanating\nfrom moral properties and the acts and states of affairs that\ninstantiate them. One partial exception to this last claim may be\nworth noting. Christine Korsgaard (1996) has endorsed the idea of\nsomething like objectively prescriptive entities, though these\nentities are not, in her view, moral properties. Korsgaard shares\nMackie’s skepticism about objective values of the sort he\ndescribes as figuring in the moral realist views of philosophers like\nPlato. Nevertheless, she observes, Mackie is wrong and the realist is\nright with respect to whether any extant entities can meet the dual\ncriteria of providing the agent who knows of them with “both a\ndirection and a motive.” It is, she insists, “the most\nfamiliar fact of human life that the world contains entities that can\ntell us what to do and make us do it. They are people, and the others\nanimals” (Korsgaard 1996, 166). Most philosophers, even those\nsympathetic to Kant’s moral philosophy and to Korsgaard’s\nbrand of Kantianism, find the idea that people (and non-human animals)\nhave value and can in that regard “tell us what to do” and\n“make us do it” rather elusive. But Korsgaard’s\nclaims are part of a large, extremely rich picture of ethics that\ncannot be explored here, and a fair assessment of her claims would\nrequire attention to this larger picture. The important point, for\npresent purposes, is that at least some philosophers, Korsgaard, and\nperhaps others drawn to ideas deriving from Kant’s moral\nphilosophy, retain some attraction to the idea that moral motivation\nand normativity find their source in inherently normative or\n“objectively prescriptive” entities.\n\nWhether or not there are any properties or entities with anything like\nthe powers Mackie describes, it is a mistake to suppose that moral\nrealists and objectivists must be committed to their existence. No\nrealist or objectivist need think that moral properties, or facts\nabout their instantiation, will, when apprehended, be sufficient to\nmotivate all persons regardless of their circumstances, including\ntheir cognitive and motivational makeup. And realists certainly need\nnot take the view that Mackie ascribes to Plato, that seeing objective\nvalues will ensure that one acts, “overruling any contrary\ninclination” (Mackie 1977,23). An individual might grasp a moral\nfact, for example, but suffer from temporary irrationality or weakness\nof will; she might be free of such temporary defects but possess a\nmore indelible motivational makeup that impedes or defeats the\nmotivating power of moral facts. Any plausible account of moral\nmotivation will, and must, acknowledge these sources of motivational\nfailure; and any plausible analysis of moral properties must allow for\nthem. Even those realists or objectivists who maintain that all\nrational and motivationally unimpaired persons will\nbe moved by moral facts need not think they will be\noverridingly indefeasibly motivated. As already noted,\nregardless of their views with respect to broader metaethical\nquestions, contemporary philosophers do not take any position on the\nprecise strength of moral motivation—with the qualification\n(alluded to earlier) that they reject, apparently universally, the\nidea that moral motivation is ordinarily overriding.\n",
    "section_title": "2. Moral Motivation and the Nature of Moral Properties",
    "entry_title": "Moral Motivation",
    "hierarchy_title": "Moral Motivation || Moral Motivation and the Nature of Moral Properties",
    "tokenized_text": [
        "moral",
        "motivation",
        "nature",
        "moral",
        "property",
        "moral",
        "motivation",
        "nature",
        "moral",
        "property",
        "judge",
        "action",
        "right",
        "wrong",
        "state",
        "affair",
        "good",
        "bad",
        "seem",
        "represent",
        "world",
        "certain",
        "way",
        "seem",
        "express",
        "moral",
        "belief",
        "attributing",
        "particular",
        "moral",
        "property",
        "normative",
        "characteristic",
        "action",
        "state",
        "affair",
        "taking",
        "apparent",
        "representational",
        "form",
        "moral",
        "judgment",
        "lead",
        "might",
        "try",
        "explain",
        "moral",
        "motivation",
        "appealing",
        "nature",
        "property",
        "figure",
        "moral",
        "judgment",
        "perhaps",
        "reliably",
        "motivated",
        "moral",
        "judgment",
        "least",
        "judgment",
        "roughly",
        "correct",
        "moral",
        "property",
        "like",
        "rightness",
        "goodness",
        "motivate",
        "u",
        "apprehend",
        "jl",
        "mackie",
        "famously",
        "criticizes",
        "picture",
        "moral",
        "property",
        "extended",
        "argument",
        "objectivity",
        "ethic",
        "mackie",
        "claim",
        "find",
        "something",
        "like",
        "work",
        "number",
        "historical",
        "figure",
        "including",
        "kant",
        "sidgwick",
        "clearest",
        "presentation",
        "picture",
        "come",
        "remark",
        "plato",
        "mackie",
        "writes",
        "plato",
        "theory",
        "form",
        "particular",
        "form",
        "good",
        "eternal",
        "extramental",
        "reality",
        "central",
        "structural",
        "element",
        "fabric",
        "world",
        "held",
        "also",
        "knowing",
        "seeing",
        "merely",
        "tell",
        "men",
        "ensure",
        "overruling",
        "contrary",
        "inclination",
        "philosopherkings",
        "republic",
        "plato",
        "think",
        "trusted",
        "unchecked",
        "power",
        "education",
        "given",
        "knowledge",
        "form",
        "acquainted",
        "form",
        "good",
        "justice",
        "beauty",
        "rest",
        "knowledge",
        "alone",
        "without",
        "motivation",
        "impelled",
        "pursue",
        "promote",
        "ideal",
        "mackie",
        "certain",
        "feature",
        "plato",
        "picture",
        "moral",
        "motivationor",
        "least",
        "mackie",
        "characterization",
        "itmerit",
        "attention",
        "first",
        "mackie",
        "construes",
        "plato",
        "view",
        "moral",
        "motivation",
        "spring",
        "directly",
        "entirely",
        "grasping",
        "presence",
        "moral",
        "property",
        "apprehension",
        "property",
        "move",
        "agent",
        "act",
        "unaided",
        "additional",
        "source",
        "motivation",
        "motivational",
        "power",
        "depends",
        "desire",
        "disposition",
        "individual",
        "second",
        "apprehension",
        "moral",
        "property",
        "motivates",
        "provides",
        "overriding",
        "motivation",
        "agent",
        "apprehends",
        "motivating",
        "power",
        "overcomes",
        "opposing",
        "desire",
        "inclination",
        "maintaining",
        "plato",
        "theory",
        "form",
        "depicts",
        "objective",
        "value",
        "would",
        "like",
        "mackie",
        "effect",
        "subscribes",
        "attribute",
        "plato",
        "view",
        "called",
        "existence",
        "internalism",
        "according",
        "existence",
        "internalism",
        "necessary",
        "connection",
        "exists",
        "certain",
        "normative",
        "status",
        "motivation",
        "state",
        "affair",
        "good",
        "example",
        "unless",
        "apprehension",
        "capable",
        "motivating",
        "though",
        "need",
        "motivate",
        "overridingly",
        "individual",
        "apprehends",
        "something",
        "fails",
        "moved",
        "ceteris",
        "paribus",
        "good",
        "mackie",
        "describes",
        "plato",
        "view",
        "objective",
        "value",
        "provide",
        "overriding",
        "motivation",
        "view",
        "reflects",
        "particularly",
        "strong",
        "form",
        "existence",
        "internalism",
        "according",
        "form",
        "existence",
        "internalism",
        "state",
        "affair",
        "good",
        "valuable",
        "unless",
        "apprehension",
        "would",
        "provide",
        "overriding",
        "motivation",
        "internalist",
        "character",
        "mackie",
        "platonic",
        "picture",
        "curiously",
        "aligns",
        "contemporary",
        "view",
        "similarly",
        "accept",
        "form",
        "existence",
        "internalism",
        "holding",
        "capacity",
        "motivation",
        "fact",
        "depends",
        "preexisting",
        "desire",
        "consider",
        "view",
        "reason",
        "associated",
        "prominently",
        "bernard",
        "williams",
        "according",
        "called",
        "internalism",
        "reason",
        "reason",
        "internalism",
        "necessarily",
        "individual",
        "reason",
        "action",
        "must",
        "able",
        "motivated",
        "action",
        "williams",
        "view",
        "order",
        "motivated",
        "individual",
        "must",
        "motivating",
        "attitude",
        "current",
        "motivational",
        "set",
        "roughly",
        "speaking",
        "consideration",
        "motivate",
        "person",
        "given",
        "current",
        "desire",
        "motivational",
        "set",
        "reason",
        "act",
        "view",
        "williams",
        "mackie",
        "plato",
        "posit",
        "necessary",
        "connection",
        "normative",
        "status",
        "motivation",
        "former",
        "view",
        "make",
        "normative",
        "status",
        "depend",
        "way",
        "latter",
        "view",
        "would",
        "flatly",
        "reject",
        "individual",
        "subjective",
        "motif",
        "mackie",
        "discussion",
        "provides",
        "first",
        "illustration",
        "account",
        "moral",
        "motivation",
        "deployed",
        "defend",
        "rebut",
        "broader",
        "position",
        "metaethics",
        "according",
        "mackie",
        "motivating",
        "power",
        "objective",
        "value",
        "value",
        "would",
        "plato",
        "depicted",
        "plato",
        "form",
        "give",
        "dramatic",
        "picture",
        "objective",
        "value",
        "would",
        "form",
        "good",
        "knowledge",
        "provides",
        "knower",
        "direction",
        "overriding",
        "motive",
        "something",
        "good",
        "tell",
        "person",
        "know",
        "pursue",
        "make",
        "pursue",
        "objective",
        "good",
        "would",
        "sought",
        "anyone",
        "acquainted",
        "contingent",
        "fact",
        "person",
        "every",
        "person",
        "constituted",
        "desire",
        "end",
        "end",
        "tobepursuedness",
        "somehow",
        "built",
        "mackie",
        "mackie",
        "contends",
        "moral",
        "sentence",
        "utter",
        "make",
        "moral",
        "judgment",
        "fact",
        "express",
        "proposition",
        "objectively",
        "prescriptive",
        "property",
        "result",
        "moral",
        "judgment",
        "true",
        "false",
        "moral",
        "cognitivismthe",
        "view",
        "moral",
        "judgment",
        "belief",
        "sentence",
        "express",
        "true",
        "falseprovides",
        "correct",
        "account",
        "moral",
        "semantics",
        "moral",
        "judgment",
        "mean",
        "given",
        "moral",
        "discourse",
        "cognitivist",
        "would",
        "seem",
        "presume",
        "correctness",
        "moral",
        "realism",
        "view",
        "roughly",
        "moral",
        "judgment",
        "belief",
        "truth",
        "evaluable",
        "literally",
        "true",
        "moral",
        "discourse",
        "suffers",
        "called",
        "presupposition",
        "failure",
        "according",
        "mackie",
        "moral",
        "discourse",
        "presupposes",
        "objectively",
        "prescriptive",
        "property",
        "property",
        "would",
        "queer",
        "entity",
        "unlike",
        "anything",
        "else",
        "world",
        "talk",
        "morality",
        "mackie",
        "evidently",
        "think",
        "rather",
        "like",
        "talk",
        "unicorn",
        "unicorn",
        "talk",
        "express",
        "proposition",
        "least",
        "assuming",
        "follows",
        "medieval",
        "legend",
        "horselike",
        "creature",
        "tamable",
        "virgin",
        "whose",
        "spiral",
        "horn",
        "posse",
        "magical",
        "power",
        "creature",
        "unicorn",
        "talk",
        "systematically",
        "error",
        "though",
        "u",
        "longer",
        "succumb",
        "error",
        "denying",
        "existence",
        "moral",
        "property",
        "mackie",
        "reject",
        "moral",
        "realism",
        "combining",
        "cognitivist",
        "moral",
        "semantics",
        "error",
        "theory",
        "according",
        "error",
        "theory",
        "although",
        "people",
        "making",
        "moral",
        "judgment",
        "implicitly",
        "claimto",
        "pointing",
        "something",
        "objectively",
        "prescriptive",
        "claim",
        "false",
        "mackie",
        "although",
        "contemporary",
        "philosopher",
        "divided",
        "respect",
        "mackie",
        "moral",
        "skepticism",
        "mostly",
        "agreed",
        "rejecting",
        "extremely",
        "strong",
        "claim",
        "moral",
        "motivation",
        "objective",
        "moral",
        "property",
        "figure",
        "moral",
        "judgment",
        "would",
        "like",
        "uniformly",
        "rejected",
        "suggestion",
        "grasp",
        "morality",
        "requirement",
        "would",
        "produce",
        "overriding",
        "motivation",
        "act",
        "accordingly",
        "rejected",
        "effort",
        "explain",
        "moral",
        "motivation",
        "appealing",
        "motivating",
        "power",
        "emanating",
        "moral",
        "property",
        "act",
        "state",
        "affair",
        "instantiate",
        "one",
        "partial",
        "exception",
        "last",
        "claim",
        "may",
        "worth",
        "noting",
        "christine",
        "korsgaard",
        "endorsed",
        "idea",
        "something",
        "like",
        "objectively",
        "prescriptive",
        "entity",
        "though",
        "entity",
        "view",
        "moral",
        "property",
        "korsgaard",
        "share",
        "mackie",
        "skepticism",
        "objective",
        "value",
        "sort",
        "describes",
        "figuring",
        "moral",
        "realist",
        "view",
        "philosopher",
        "like",
        "plato",
        "nevertheless",
        "observes",
        "mackie",
        "wrong",
        "realist",
        "right",
        "respect",
        "whether",
        "extant",
        "entity",
        "meet",
        "dual",
        "criterion",
        "providing",
        "agent",
        "know",
        "direction",
        "motive",
        "insists",
        "familiar",
        "fact",
        "human",
        "life",
        "world",
        "contains",
        "entity",
        "tell",
        "u",
        "make",
        "u",
        "people",
        "others",
        "animal",
        "korsgaard",
        "philosopher",
        "even",
        "sympathetic",
        "kant",
        "moral",
        "philosophy",
        "korsgaard",
        "brand",
        "kantianism",
        "find",
        "idea",
        "people",
        "nonhuman",
        "animal",
        "value",
        "regard",
        "tell",
        "u",
        "make",
        "u",
        "rather",
        "elusive",
        "korsgaard",
        "claim",
        "part",
        "large",
        "extremely",
        "rich",
        "picture",
        "ethic",
        "explored",
        "fair",
        "assessment",
        "claim",
        "would",
        "require",
        "attention",
        "larger",
        "picture",
        "important",
        "point",
        "present",
        "purpose",
        "least",
        "philosopher",
        "korsgaard",
        "perhaps",
        "others",
        "drawn",
        "idea",
        "deriving",
        "kant",
        "moral",
        "philosophy",
        "retain",
        "attraction",
        "idea",
        "moral",
        "motivation",
        "normativity",
        "find",
        "source",
        "inherently",
        "normative",
        "objectively",
        "prescriptive",
        "entity",
        "whether",
        "property",
        "entity",
        "anything",
        "like",
        "power",
        "mackie",
        "describes",
        "mistake",
        "suppose",
        "moral",
        "realist",
        "objectivists",
        "must",
        "committed",
        "existence",
        "realist",
        "objectivist",
        "need",
        "think",
        "moral",
        "property",
        "fact",
        "instantiation",
        "apprehended",
        "sufficient",
        "motivate",
        "person",
        "regardless",
        "circumstance",
        "including",
        "cognitive",
        "motivational",
        "makeup",
        "realist",
        "certainly",
        "need",
        "take",
        "view",
        "mackie",
        "ascribes",
        "plato",
        "seeing",
        "objective",
        "value",
        "ensure",
        "one",
        "act",
        "overruling",
        "contrary",
        "inclination",
        "mackie",
        "individual",
        "might",
        "grasp",
        "moral",
        "fact",
        "example",
        "suffer",
        "temporary",
        "irrationality",
        "weakness",
        "might",
        "free",
        "temporary",
        "defect",
        "posse",
        "indelible",
        "motivational",
        "makeup",
        "impedes",
        "defeat",
        "motivating",
        "power",
        "moral",
        "fact",
        "plausible",
        "account",
        "moral",
        "motivation",
        "must",
        "acknowledge",
        "source",
        "motivational",
        "failure",
        "plausible",
        "analysis",
        "moral",
        "property",
        "must",
        "allow",
        "even",
        "realist",
        "objectivists",
        "maintain",
        "rational",
        "motivationally",
        "unimpaired",
        "person",
        "moved",
        "moral",
        "fact",
        "need",
        "think",
        "overridingly",
        "indefeasibly",
        "motivated",
        "already",
        "noted",
        "regardless",
        "view",
        "respect",
        "broader",
        "metaethical",
        "question",
        "contemporary",
        "philosopher",
        "take",
        "position",
        "precise",
        "strength",
        "moral",
        "motivationwith",
        "qualification",
        "alluded",
        "earlier",
        "reject",
        "apparently",
        "universally",
        "idea",
        "moral",
        "motivation",
        "ordinarily",
        "overriding"
    ]
}