{
    "main_text": "Moral Particularism and Justification || Abstinence\n5.1 Abstinence\n\nJonathan Dancy accepts versions of both the first and second thesis,\nand he accepts the second thesis in part because he accepts the first.\nDancy holds that there are two types of principles: absolute\nand contributory. An absolute moral principle specifies a\nsufficient condition for the instantiation of a moral property, while\na contributory moral principle specifies that a feature has an\nintrinsic moral valence (see entry on\n Dancy’s moral particularism).\n Dancy holds that neither sort of true principle exists, and thus\nneither sort of principle can properly play a role in moral\ndeliberation—after all, using false moral principles could lead\nus to act correctly for the wrong reasons, or to act incorrectly\n(Dancy 2005: 3).\n\nMoreover, Dancy holds that neither sort of principle is necessary for\nresponsible moral deliberation. In this respect, Dancy’s view is\nsimilar to Moore’s, albeit only on the level of particular moral\nfacts. According to Dancy, morally sensitive people can intuit the\nmorally relevant features in a context, thereby intuiting the moral\nreasons in that context, and reliably come to a correct moral\nconclusion about how they ought to act, even without the use of a\nprinciple that specifies how to weigh one’s reasons. (In this\nlatter respect, Dancy’s view is also similar to Ross’s.)\nIn some cases, Dancy has suggested that we can understand this\ndeliberative process by looking to connectionist machines or Roschian\nprototype theory (Dancy 1999).\n\nParticularists rarely put their account of moral knowledge in terms of\njustification. But when particularists do put their view in terms of\njustification (see below) they claim that the justification involved\nis a priori. The thought seems to be this: if one can issue a\nmoral verdict in a particular case on the basis of the moral reasons\none is presented with in that case, then one must know what those\nreasons are, as well as how to weigh them to reach a verdict. But,\naccording to particularists, there are no principles one can use to\nknow those things; thus, one must see—through the exercise of\nintuition—what one’s reasons are and how to weigh them\nagainst each other. That is, one must intuit propositions such as\nR is a reason to φ in this case and In this\ncase, on balance, the reasons support φ-ing. Particularists\nseem committed to a version of the modified standard view of a\npriori justification. There is a distinct experience of rational\n“seeing”” in virtue of which one is a\npriori justified in believing these propositions regarding a\nparticular case. If the propositions one is thereby justified in\nbelieving are self-evident, it seems that they are self-evident only\nin the attenuated sense that it is possible to have rational insight\ninto their truth, and hence possible to be justified in believing\nthem, solely on the basis of understanding them and thinking about\nthem. It is also worth taking note that the moral propositions\nparticularists hold that we are a priori justified in\nbelieving are relative to a particular context: what one can come to\nsee is that something is a reason to φ for a particular agent in a\nparticular situation or that the balance of reasons support φ-ing\nfor this particular agent in this particular situation.\n\nThe role of past experience in present moral deliberation complicates\nthe particularist’s claim that moral beliefs are justified a\npriori. On the one hand, particularists claim that past\nexperience plays an important role in deliberation, even for the\nmorally mature agent—for instance, one often judges that\nR is a reason in the present context because R was a\nreason in a relevantly similar context in the past (see the entry on\n Dancy’s moral particularism).\n But on the other hand, the belief one arrives at through this kind of\nreflection on past experience is nevertheless a priori,\naccording to particularists. How can we make sense of the conjunction\nof these two claims?\n\nPerhaps we can try to answer this question by looking at what\nabstinence particularists—Dancy in particular—have to say\nabout Kant. Dancy writes that particularists agree with Kant that\nmoral judgments are synthetic a priori. According to Dancy,\nKant inferred from this that moral judgments must also be necessary\nand universal (2007); but particularists reject this inference, and\nhold that moral judgments are synthetic a priori and yet are\ncontingent and particular. Dancy writes,\n\n\nDoes it follow from this [that moral facts are contingent and not\nuniversal] that they [moral facts] are not knowable a priori?\nI don’t think so. After all, even when all the empirical\ninformation—that is, the information that we think of as\nordinarily available to the senses—is in, we still have to\ndetermine which aspects of the present situation, as revealed to us in\nexperience, count which way as reasons. That decision seems to take us\nbeyond anything that the senses can inform us about…. Even if\nwe have the benefit of previous experience [that in the past, the fact\nthat I was dealing with someone in distress was a reason to go\ngently]…, the most we can get out of that is the recognition\nthat her distress is probably a reason. Now this sort of\nknowledge would only be a posteriori if the evidence on which\nit is based is a posteriori. And that just returns us to the\nprimary question here: in a case where we don’t have the benefit\nof previous experience, is the “process” by which we come\nto recognize that her distress is a reason, one that can be thought of\nas taking us from a posteriori knowledge (that she is in\ndistress) to another a posteriori knowledge (that her\ndistress is a reason to go gently)? And the answer seems to me to be\nno. If our decision that it is a reason is capable of counting as\nknowledge, then, it seems that it will have to be a priori\nknowledge that is at issue, since we only have two choices—a\npriori and a posteriori—and the latter is ruled\nout. (Dancy 2007) \n\n\nDancy appears to endorse this argument:\n\n If I come to know/justifiably believe a moral\nproposition, then I’m either relying on past moral experience or\nI’m not.\n If I’m not relying on past moral\nexperience, then my conclusion is not known/justified a\nposteriori.\n An item of knowledge/a justified belief is either\nknown/justified a priori or a posteriori.\n Thus, if I’m not relying on past moral\nexperience, then my conclusion is known/justified a priori.\n(2, 3)\n If I’m relying on past experience and the past\nconclusions I’m relying on are known/justified a\npriori, then my present conclusion is known/justified a\npriori.\n Thus, if I’m relying on past moral experience,\nthen my conclusion is known/justified a priori. (4, 5)\n Thus, if I come to know/justifiably believe a moral\nproposition, my knowledge/justification is a priori. (1, 4,\n6)\n\n\nThe contentious premises in this argument are premises\n 5\n and\n 2.\n One might offer the following sort of counterexample to\n premise 5.\n Let’s say that in the past, I’ve added together many\npairs of even numbers; and in each of those cases, I’ve\nknown/justifiably believed (a priori) that the sum of the two\nnumbers was also even. Then someone asks me: is it always the case\nthat the sum of two even numbers is itself even? Assume that, for\nwhatever reason, I’m genuinely uncertain of the answer—I\ndon’t see the answer intuitively, or perhaps I doubt my more\ngeneral mathematical intuitions. Nevertheless, I realize that in the\npast, whenever I’ve added two even numbers the sum has itself\nbeen even. Thus, I inductively infer that the hypothesis is correct:\nthe sum of two even numbers is always itself even.\n\nThis example seems like a paradigm case of one coming to\nknow/justifiably believe an a priori proposition a\nposteriori. So, with the distinction between an a priori\nproposition—a proposition amenable to a priori\njustification—and a priori justification/knowledge in\nplace, one might be tempted to reject\n premise 5.\n\nMoreover, more support is needed for\n premise 2.\n Many paradigm cases of a posteriori justification do not\nrely on past experience. Take, for example, your belief that the\ntraffic light is red. Past experience, in this case, only provides you\nwith the relevant concepts needed to understand the proposition\nthe traffic light is red. What justifies your belief is the\ncurrent experience of the traffic light’s being red—and\nsurely this yields a posteriori justification! Perhaps Dancy\ncould say something like this: if I infer a moral claim from an\nempirical matter of fact (as when I infer that the fact that I’m\ndealing with someone in distress is a reason to go gently on the basis\nof my experience of her distress), then I’m going beyond my\nempirical experience in a way that’s different from when I infer\nthat the traffic light is red on the basis of my empirical experience.\nBut Dancy would need to say more about this distinction to explain why\nthe former is an example of a priori justification and the\nlatter an example of a posteriori justification. (For further\narguments against the particularist’s claim that it’s\npossible to have a priori knowledge of particular, contingent moral\nfacts, see McKeever and Ridge 2006, especially chapter 7.)\n\nNevertheless, Dancy’s take on Kant, in spite of his\nargument’s weaknesses, gives us some insight into how Dancy must\nsee the role of experience in a priori justification. Dancy\nmust think that when I infer on the basis of my current experience of\na particular situation that R is a reason to φ, my\ninference is different from the kinds of inferences that yield a\nposteriori justification, and for this reason particularism is\ncompatible with moral knowledge being a priori.\n",
    "section_title": "5.1 Abstinence",
    "entry_title": "A Priorism in Moral Epistemology",
    "hierarchy_title": "A Priorism in Moral Epistemology || Moral Particularism and Justification || Abstinence",
    "tokenized_text": [
        "moral",
        "particularism",
        "justification",
        "abstinence",
        "abstinence",
        "jonathan",
        "dancy",
        "accepts",
        "version",
        "first",
        "second",
        "thesis",
        "accepts",
        "second",
        "thesis",
        "part",
        "accepts",
        "first",
        "dancy",
        "hold",
        "two",
        "type",
        "principle",
        "absolute",
        "contributory",
        "absolute",
        "moral",
        "principle",
        "specifies",
        "sufficient",
        "condition",
        "instantiation",
        "moral",
        "property",
        "contributory",
        "moral",
        "principle",
        "specifies",
        "feature",
        "intrinsic",
        "moral",
        "valence",
        "see",
        "entry",
        "dancy",
        "moral",
        "particularism",
        "dancy",
        "hold",
        "neither",
        "sort",
        "true",
        "principle",
        "exists",
        "thus",
        "neither",
        "sort",
        "principle",
        "properly",
        "play",
        "role",
        "moral",
        "deliberationafter",
        "using",
        "false",
        "moral",
        "principle",
        "could",
        "lead",
        "u",
        "act",
        "correctly",
        "wrong",
        "reason",
        "act",
        "incorrectly",
        "dancy",
        "moreover",
        "dancy",
        "hold",
        "neither",
        "sort",
        "principle",
        "necessary",
        "responsible",
        "moral",
        "deliberation",
        "respect",
        "dancy",
        "view",
        "similar",
        "moore",
        "albeit",
        "level",
        "particular",
        "moral",
        "fact",
        "according",
        "dancy",
        "morally",
        "sensitive",
        "people",
        "intuit",
        "morally",
        "relevant",
        "feature",
        "context",
        "thereby",
        "intuiting",
        "moral",
        "reason",
        "context",
        "reliably",
        "come",
        "correct",
        "moral",
        "conclusion",
        "ought",
        "act",
        "even",
        "without",
        "use",
        "principle",
        "specifies",
        "weigh",
        "one",
        "reason",
        "latter",
        "respect",
        "dancy",
        "view",
        "also",
        "similar",
        "ross",
        "case",
        "dancy",
        "suggested",
        "understand",
        "deliberative",
        "process",
        "looking",
        "connectionist",
        "machine",
        "roschian",
        "prototype",
        "theory",
        "dancy",
        "particularists",
        "rarely",
        "put",
        "account",
        "moral",
        "knowledge",
        "term",
        "justification",
        "particularists",
        "put",
        "view",
        "term",
        "justification",
        "see",
        "claim",
        "justification",
        "involved",
        "priori",
        "thought",
        "seems",
        "one",
        "issue",
        "moral",
        "verdict",
        "particular",
        "case",
        "basis",
        "moral",
        "reason",
        "one",
        "presented",
        "case",
        "one",
        "must",
        "know",
        "reason",
        "well",
        "weigh",
        "reach",
        "verdict",
        "according",
        "particularists",
        "principle",
        "one",
        "use",
        "know",
        "thing",
        "thus",
        "one",
        "must",
        "seethrough",
        "exercise",
        "intuitionwhat",
        "one",
        "reason",
        "weigh",
        "one",
        "must",
        "intuit",
        "proposition",
        "r",
        "reason",
        "φ",
        "case",
        "case",
        "balance",
        "reason",
        "support",
        "φing",
        "particularists",
        "seem",
        "committed",
        "version",
        "modified",
        "standard",
        "view",
        "priori",
        "justification",
        "distinct",
        "experience",
        "rational",
        "seeing",
        "virtue",
        "one",
        "priori",
        "justified",
        "believing",
        "proposition",
        "regarding",
        "particular",
        "case",
        "proposition",
        "one",
        "thereby",
        "justified",
        "believing",
        "selfevident",
        "seems",
        "selfevident",
        "attenuated",
        "sense",
        "possible",
        "rational",
        "insight",
        "truth",
        "hence",
        "possible",
        "justified",
        "believing",
        "solely",
        "basis",
        "understanding",
        "thinking",
        "also",
        "worth",
        "taking",
        "note",
        "moral",
        "proposition",
        "particularists",
        "hold",
        "priori",
        "justified",
        "believing",
        "relative",
        "particular",
        "context",
        "one",
        "come",
        "see",
        "something",
        "reason",
        "φ",
        "particular",
        "agent",
        "particular",
        "situation",
        "balance",
        "reason",
        "support",
        "φing",
        "particular",
        "agent",
        "particular",
        "situation",
        "role",
        "past",
        "experience",
        "present",
        "moral",
        "deliberation",
        "complicates",
        "particularist",
        "claim",
        "moral",
        "belief",
        "justified",
        "priori",
        "one",
        "hand",
        "particularists",
        "claim",
        "past",
        "experience",
        "play",
        "important",
        "role",
        "deliberation",
        "even",
        "morally",
        "mature",
        "agentfor",
        "instance",
        "one",
        "often",
        "judge",
        "r",
        "reason",
        "present",
        "context",
        "r",
        "reason",
        "relevantly",
        "similar",
        "context",
        "past",
        "see",
        "entry",
        "dancy",
        "moral",
        "particularism",
        "hand",
        "belief",
        "one",
        "arrives",
        "kind",
        "reflection",
        "past",
        "experience",
        "nevertheless",
        "priori",
        "according",
        "particularists",
        "make",
        "sense",
        "conjunction",
        "two",
        "claim",
        "perhaps",
        "try",
        "answer",
        "question",
        "looking",
        "abstinence",
        "particularistsdancy",
        "particularhave",
        "say",
        "kant",
        "dancy",
        "writes",
        "particularists",
        "agree",
        "kant",
        "moral",
        "judgment",
        "synthetic",
        "priori",
        "according",
        "dancy",
        "kant",
        "inferred",
        "moral",
        "judgment",
        "must",
        "also",
        "necessary",
        "universal",
        "particularists",
        "reject",
        "inference",
        "hold",
        "moral",
        "judgment",
        "synthetic",
        "priori",
        "yet",
        "contingent",
        "particular",
        "dancy",
        "writes",
        "follow",
        "moral",
        "fact",
        "contingent",
        "universal",
        "moral",
        "fact",
        "knowable",
        "priori",
        "think",
        "even",
        "empirical",
        "informationthat",
        "information",
        "think",
        "ordinarily",
        "available",
        "sensesis",
        "still",
        "determine",
        "aspect",
        "present",
        "situation",
        "revealed",
        "u",
        "experience",
        "count",
        "way",
        "reason",
        "decision",
        "seems",
        "take",
        "u",
        "beyond",
        "anything",
        "sens",
        "inform",
        "u",
        "about",
        "even",
        "benefit",
        "previous",
        "experience",
        "past",
        "fact",
        "dealing",
        "someone",
        "distress",
        "reason",
        "go",
        "gently",
        "get",
        "recognition",
        "distress",
        "probably",
        "reason",
        "sort",
        "knowledge",
        "would",
        "posteriori",
        "evidence",
        "based",
        "posteriori",
        "return",
        "u",
        "primary",
        "question",
        "case",
        "benefit",
        "previous",
        "experience",
        "process",
        "come",
        "recognize",
        "distress",
        "reason",
        "one",
        "thought",
        "taking",
        "u",
        "posteriori",
        "knowledge",
        "distress",
        "another",
        "posteriori",
        "knowledge",
        "distress",
        "reason",
        "go",
        "gently",
        "answer",
        "seems",
        "decision",
        "reason",
        "capable",
        "counting",
        "knowledge",
        "seems",
        "priori",
        "knowledge",
        "issue",
        "since",
        "two",
        "choicesa",
        "priori",
        "posterioriand",
        "latter",
        "ruled",
        "dancy",
        "dancy",
        "appears",
        "endorse",
        "argument",
        "come",
        "knowjustifiably",
        "believe",
        "moral",
        "proposition",
        "either",
        "relying",
        "past",
        "moral",
        "experience",
        "relying",
        "past",
        "moral",
        "experience",
        "conclusion",
        "knownjustified",
        "posteriori",
        "item",
        "knowledgea",
        "justified",
        "belief",
        "either",
        "knownjustified",
        "priori",
        "posteriori",
        "thus",
        "relying",
        "past",
        "moral",
        "experience",
        "conclusion",
        "knownjustified",
        "priori",
        "relying",
        "past",
        "experience",
        "past",
        "conclusion",
        "relying",
        "knownjustified",
        "priori",
        "present",
        "conclusion",
        "knownjustified",
        "priori",
        "thus",
        "relying",
        "past",
        "moral",
        "experience",
        "conclusion",
        "knownjustified",
        "priori",
        "thus",
        "come",
        "knowjustifiably",
        "believe",
        "moral",
        "proposition",
        "knowledgejustification",
        "priori",
        "contentious",
        "premise",
        "argument",
        "premise",
        "one",
        "might",
        "offer",
        "following",
        "sort",
        "counterexample",
        "premise",
        "let",
        "say",
        "past",
        "added",
        "together",
        "many",
        "pair",
        "even",
        "number",
        "case",
        "knownjustifiably",
        "believed",
        "priori",
        "sum",
        "two",
        "number",
        "also",
        "even",
        "someone",
        "asks",
        "always",
        "case",
        "sum",
        "two",
        "even",
        "number",
        "even",
        "assume",
        "whatever",
        "reason",
        "genuinely",
        "uncertain",
        "answeri",
        "see",
        "answer",
        "intuitively",
        "perhaps",
        "doubt",
        "general",
        "mathematical",
        "intuition",
        "nevertheless",
        "realize",
        "past",
        "whenever",
        "added",
        "two",
        "even",
        "number",
        "sum",
        "even",
        "thus",
        "inductively",
        "infer",
        "hypothesis",
        "correct",
        "sum",
        "two",
        "even",
        "number",
        "always",
        "even",
        "example",
        "seems",
        "like",
        "paradigm",
        "case",
        "one",
        "coming",
        "knowjustifiably",
        "believe",
        "priori",
        "proposition",
        "posteriori",
        "distinction",
        "priori",
        "propositiona",
        "proposition",
        "amenable",
        "priori",
        "justificationand",
        "priori",
        "justificationknowledge",
        "place",
        "one",
        "might",
        "tempted",
        "reject",
        "premise",
        "moreover",
        "support",
        "needed",
        "premise",
        "many",
        "paradigm",
        "case",
        "posteriori",
        "justification",
        "rely",
        "past",
        "experience",
        "take",
        "example",
        "belief",
        "traffic",
        "light",
        "red",
        "past",
        "experience",
        "case",
        "provides",
        "relevant",
        "concept",
        "needed",
        "understand",
        "proposition",
        "traffic",
        "light",
        "red",
        "justifies",
        "belief",
        "current",
        "experience",
        "traffic",
        "light",
        "redand",
        "surely",
        "yield",
        "posteriori",
        "justification",
        "perhaps",
        "dancy",
        "could",
        "say",
        "something",
        "like",
        "infer",
        "moral",
        "claim",
        "empirical",
        "matter",
        "fact",
        "infer",
        "fact",
        "dealing",
        "someone",
        "distress",
        "reason",
        "go",
        "gently",
        "basis",
        "experience",
        "distress",
        "going",
        "beyond",
        "empirical",
        "experience",
        "way",
        "different",
        "infer",
        "traffic",
        "light",
        "red",
        "basis",
        "empirical",
        "experience",
        "dancy",
        "would",
        "need",
        "say",
        "distinction",
        "explain",
        "former",
        "example",
        "priori",
        "justification",
        "latter",
        "example",
        "posteriori",
        "justification",
        "argument",
        "particularist",
        "claim",
        "possible",
        "priori",
        "knowledge",
        "particular",
        "contingent",
        "moral",
        "fact",
        "see",
        "mckeever",
        "ridge",
        "especially",
        "chapter",
        "nevertheless",
        "dancy",
        "take",
        "kant",
        "spite",
        "argument",
        "weakness",
        "give",
        "u",
        "insight",
        "dancy",
        "must",
        "see",
        "role",
        "experience",
        "priori",
        "justification",
        "dancy",
        "must",
        "think",
        "infer",
        "basis",
        "current",
        "experience",
        "particular",
        "situation",
        "r",
        "reason",
        "φ",
        "inference",
        "different",
        "kind",
        "inference",
        "yield",
        "posteriori",
        "justification",
        "reason",
        "particularism",
        "compatible",
        "moral",
        "knowledge",
        "priori"
    ]
}