{
    "main_text": "Evolutionary: Biological Explanations of Why Morals Evolved || The Debunking Argument from the Irrationality of Moral Emotions\n4.3 The Debunking Argument from the Irrationality of Moral Emotions\n\n\nThe third line of thinking that puts the evolution of morals at\nloggerheads with moral knowledge arises from recent developments in\nmoral psychology and neurobiology. In the past decade several\nprominent psychologists have applied the emerging dual process model\nof the brain to design experiments to reveal how we process moral\njudgments (Greene 2008, 2010 (Other Internet Resources), 2013; Haidt\n2001; Cushman et al. 2006). One type of thinking (system 1)\nis fast, unconscious, automatic, intuitive, and guided by\nemotions. The other (system 2) is slow, conscious, deliberate,\nreflective, and devoid of emotion. Though there remains considerable\ncontroversy about the details (Berker 2009; Greene 2010 (Other\nInternet Resources), 2013), various experiments, including fMRI brain\nstudies, suggest that deontological moral judgment, where one assesses\nthe moral acceptability of actions apart from their consequences, is\nguided solely by system 1 thinking while consequentialist moral\njudgment engages system 2. Since processing in the latter case is\nunemotional, entailing reasoned comparison of possible consequences,\nonly consequentialist thought is properly associated with the rational\nmoral appraisal of actions. Notably, the latter thinking is regarded\nas less primitive from an evolutionary standpoint. By contrast, system\n1 thinking, being tied to intuitive emotional judgments, represents an\nadaptation that was once useful but has by now largely lost its point\ngiven the challenges of life in modern technological society (Greene\n2008, 2010 (Other Internet Resources), 2013; but see\nGigerenzer 2008 and Railton 2014 for a contrary perspective on\nintuitive moral judgments). These claims, when taken together, form\nthe basis of a psychological/evolutionary argument to debunk\ndeontological moral thinking as unreliable and irrational.\n\n\nThe story taken just this far, whatever its merits, appears to allow\nthe possibility of moral knowledge grounded in consequentialist\nreasoning. All the data used to draw negative conclusions about\ndeontological moral thought, however, can be interpreted to support a\nbroader debunking argument, since consequentialist thinking requires\nnot only reasoned calculation of the probable effects of alternative\nactions, but also judgment about whether these effects are good or bad\n(Kahane 2011, pp. 119–20). In the latter respect, system 1 would play\nan essential role. If system 1 contaminates the rationality of\ndeontological judgments, given its emotional and primitive\nevolutionary nature, the possibility of consequentialist moral\nknowledge would be undermined in the same way. Though one might reply\nthat moral beliefs formed by thinking about the consequences of\nactions arise in part from reasoning, the core part of the belief,\nconcerning whether the consequences are on the whole good or bad, is\nnot itself rational but emotional (following the logic of the\nargument) and hence cannot qualify as rationally justified, as it\nwould need to be in order to qualify as moral knowledge. In effect,\nthe possibility of moral knowledge is foreclosed no matter what kind\nof moral belief is in question. (See Kahane 2011, for a careful\nelaboration and evaluation of the ensuring global normative\nskepticism.)\n\n\nThough the question of whether the data support a dual process theory\nof brain activity and whether moral thinking divides up in the way\ndescribed is hotly debated, a larger and equally serious problem\nconcerns the assumed opposition between emotional and rational\nthinking. Many experimental studies of practical reasoning yield the\nopposite conclusion, namely, that emotional processing of information\nplays an essential role in prudential reasoning (de Sousa 1987;\nDamasio 1994; Woodward and Allman 2007; Bloom 2013; Railton\n2014). Emotional processing is especially important when the relevant\nvariables are too many and too complex to process entirely through\nconscious reasoning, so that rational thinking and rational behavior\ndepend on the emotional capacity to feel one’s way through practical\nproblems. There is no principled reason why the same would not be true\nin complex practical deliberation about moral issues (Allman and\nWoodward 2008). Research in this regard has only begun, but even now\nit is questionable to assume without argument that the reason-emotion\ndichotomy presupposed in the third type of debunking argument is\ntrustworthy enough to rule out moral knowledge, even if all moral\njudgments have the emotional basis claimed.\n\n\nRecent developments regarding moral consistency reasoning underline\nthe role of emotion in moral reasoning (Campbell and Kumar 2012,\n2013; Kumar and Campbell 2012, 2016; Campbell 2014, 2017 see also Wong 2002 on\nanalogical moral reasoning). Return to Singer’s example of a man\nseeing a toddler about to drown in a shallow pond and knowing that the\nonly cost of saving her life would be ruining his new suit. One can be\nexpected to have feelings of strong disapproval toward anyone who did\nnot try to save a child in any similar situation. Suppose, however,\nthere is another situation, say one in which someone’s life is at\nstake and that person can be saved at no more cost than losing a new\nsuit, say by giving funds for famine relief. If one does not feel as\nbefore about this new situation, then there should be a moral\ndifference between them to explain the difference in emotional\nresponse, or else one is being morally inconsistent in one’s moral\nemotions. Moreover, this kind of moral inconsistency is morally\nculpable, revealing one not to be fully morally trustworthy as a moral\nagent. Singer argues, in fact, that one’s response to the opportunity\nto provide funds for famine relief (at least equivalent to the cost of\na new suit) ought to be the same as in the pond case, since (he\nclaims) there is no morally relevant difference. (He considers various\ncandidates for difference but argues that thinking they are morally\nrelevant results in further inconsistencies depending on the\ncandidate.) When there are no relevant moral differences between two\nsituations and the moral import of one’s response to them is\ndifferent, both responses cannot be morally justified. Though Singer’s\nfocus is on whether one’s moral obligation is the same, the logic of\nhis argument would be the same whether the inconsistency is between\nmoral beliefs or moral emotions. In general we are expected to be\nmorally consistent in our moral beliefs and in our moral emotions.\n\n\nSometimes moral beliefs and moral emotions can diverge, yet it can be\nrational to trust the moral emotion rather than the moral belief. In\nSection 3 we discussed the hybrid conception of moral judgment that\nallows for this kind of separation of belief and emotion. One of the\nexamples was that of a woman who feels strong moral resentment at\nhaving been passed over for promotion in favour of someone whose\nperformance was inferior to hers. It is possible that she doesn’t\nbelieve that she has been wronged, perhaps because she believes the\nman performed better and her feelings are not trustworthy. Suppose\nthat her resentment persists, despite her efforts to ignore it. Must\nher moral emotion then be irrational? Imagine that she feels\nresentment because in fact she can recognize no morally relevant\ndifference between her case and that of the other that would explain\nwhy she wasn’t promoted. Even if she does not at first consciously\nthink about it in this way, her resentment can arise because her\nemotions have been attuned to respond to other cases where a promotion\nhas been granted unfairly and where in retrospect there is no doubt in\nanyone’s mind (like the pond case) what would have been the right\nthing to do. In short, her moral emotion may be rationally grounded,\nif there exists no morally relevant difference between her situation\nand one in which the morally right response is not in doubt from\nanyone’s perspective but is contrary to the decision made in her\ncase.\n\n\nThe idea that emotion may enter unconsciously into good reasoning and\nyield a moral emotion that has a better rational basis than a person’s\nconsciously held beliefs may seem surprising. However, there is a\ngrowing literature in cognitive science over the past decade that\nsupports the cognitive sophistication of our affective system that\noperates largely unconsciously in practical decision-making. For an\nilluminating review of these developments that links insights of\nAristotle and Kant to the unconscious cognitive work done by our\nevolved system of “affective attunement”, see Railton 2014. The lesson\nis not that belief and emotion do not generally cohere in moral\njudgment, but that emotion is itself cognitively complex and can make\nits own independent and rationally based contribution to moral\njudgment.\n",
    "section_title": "4.3 The Debunking Argument from the Irrationality of Moral Emotions",
    "entry_title": "Moral Epistemology",
    "hierarchy_title": "Moral Epistemology || Evolutionary: Biological Explanations of Why Morals Evolved || The Debunking Argument from the Irrationality of Moral Emotions",
    "tokenized_text": [
        "evolutionary",
        "biological",
        "explanation",
        "moral",
        "evolved",
        "debunking",
        "argument",
        "irrationality",
        "moral",
        "emotion",
        "debunking",
        "argument",
        "irrationality",
        "moral",
        "emotion",
        "third",
        "line",
        "thinking",
        "put",
        "evolution",
        "moral",
        "loggerhead",
        "moral",
        "knowledge",
        "arises",
        "recent",
        "development",
        "moral",
        "psychology",
        "neurobiology",
        "past",
        "decade",
        "several",
        "prominent",
        "psychologist",
        "applied",
        "emerging",
        "dual",
        "process",
        "model",
        "brain",
        "design",
        "experiment",
        "reveal",
        "process",
        "moral",
        "judgment",
        "greene",
        "internet",
        "resource",
        "haidt",
        "cushman",
        "et",
        "al",
        "one",
        "type",
        "thinking",
        "system",
        "fast",
        "unconscious",
        "automatic",
        "intuitive",
        "guided",
        "emotion",
        "system",
        "slow",
        "conscious",
        "deliberate",
        "reflective",
        "devoid",
        "emotion",
        "though",
        "remains",
        "considerable",
        "controversy",
        "detail",
        "berker",
        "greene",
        "internet",
        "resource",
        "various",
        "experiment",
        "including",
        "fmri",
        "brain",
        "study",
        "suggest",
        "deontological",
        "moral",
        "judgment",
        "one",
        "ass",
        "moral",
        "acceptability",
        "action",
        "apart",
        "consequence",
        "guided",
        "solely",
        "system",
        "thinking",
        "consequentialist",
        "moral",
        "judgment",
        "engages",
        "system",
        "since",
        "processing",
        "latter",
        "case",
        "unemotional",
        "entailing",
        "reasoned",
        "comparison",
        "possible",
        "consequence",
        "consequentialist",
        "thought",
        "properly",
        "associated",
        "rational",
        "moral",
        "appraisal",
        "action",
        "notably",
        "latter",
        "thinking",
        "regarded",
        "le",
        "primitive",
        "evolutionary",
        "standpoint",
        "contrast",
        "system",
        "thinking",
        "tied",
        "intuitive",
        "emotional",
        "judgment",
        "represents",
        "adaptation",
        "useful",
        "largely",
        "lost",
        "point",
        "given",
        "challenge",
        "life",
        "modern",
        "technological",
        "society",
        "greene",
        "internet",
        "resource",
        "see",
        "gigerenzer",
        "railton",
        "contrary",
        "perspective",
        "intuitive",
        "moral",
        "judgment",
        "claim",
        "taken",
        "together",
        "form",
        "basis",
        "psychologicalevolutionary",
        "argument",
        "debunk",
        "deontological",
        "moral",
        "thinking",
        "unreliable",
        "irrational",
        "story",
        "taken",
        "far",
        "whatever",
        "merit",
        "appears",
        "allow",
        "possibility",
        "moral",
        "knowledge",
        "grounded",
        "consequentialist",
        "reasoning",
        "data",
        "used",
        "draw",
        "negative",
        "conclusion",
        "deontological",
        "moral",
        "thought",
        "however",
        "interpreted",
        "support",
        "broader",
        "debunking",
        "argument",
        "since",
        "consequentialist",
        "thinking",
        "requires",
        "reasoned",
        "calculation",
        "probable",
        "effect",
        "alternative",
        "action",
        "also",
        "judgment",
        "whether",
        "effect",
        "good",
        "bad",
        "kahane",
        "pp",
        "latter",
        "respect",
        "system",
        "would",
        "play",
        "essential",
        "role",
        "system",
        "contaminates",
        "rationality",
        "deontological",
        "judgment",
        "given",
        "emotional",
        "primitive",
        "evolutionary",
        "nature",
        "possibility",
        "consequentialist",
        "moral",
        "knowledge",
        "would",
        "undermined",
        "way",
        "though",
        "one",
        "might",
        "reply",
        "moral",
        "belief",
        "formed",
        "thinking",
        "consequence",
        "action",
        "arise",
        "part",
        "reasoning",
        "core",
        "part",
        "belief",
        "concerning",
        "whether",
        "consequence",
        "whole",
        "good",
        "bad",
        "rational",
        "emotional",
        "following",
        "logic",
        "argument",
        "hence",
        "qualify",
        "rationally",
        "justified",
        "would",
        "need",
        "order",
        "qualify",
        "moral",
        "knowledge",
        "effect",
        "possibility",
        "moral",
        "knowledge",
        "foreclosed",
        "matter",
        "kind",
        "moral",
        "belief",
        "question",
        "see",
        "kahane",
        "careful",
        "elaboration",
        "evaluation",
        "ensuring",
        "global",
        "normative",
        "skepticism",
        "though",
        "question",
        "whether",
        "data",
        "support",
        "dual",
        "process",
        "theory",
        "brain",
        "activity",
        "whether",
        "moral",
        "thinking",
        "divide",
        "way",
        "described",
        "hotly",
        "debated",
        "larger",
        "equally",
        "serious",
        "problem",
        "concern",
        "assumed",
        "opposition",
        "emotional",
        "rational",
        "thinking",
        "many",
        "experimental",
        "study",
        "practical",
        "reasoning",
        "yield",
        "opposite",
        "conclusion",
        "namely",
        "emotional",
        "processing",
        "information",
        "play",
        "essential",
        "role",
        "prudential",
        "reasoning",
        "de",
        "sousa",
        "damasio",
        "woodward",
        "allman",
        "bloom",
        "railton",
        "emotional",
        "processing",
        "especially",
        "important",
        "relevant",
        "variable",
        "many",
        "complex",
        "process",
        "entirely",
        "conscious",
        "reasoning",
        "rational",
        "thinking",
        "rational",
        "behavior",
        "depend",
        "emotional",
        "capacity",
        "feel",
        "one",
        "way",
        "practical",
        "problem",
        "principled",
        "reason",
        "would",
        "true",
        "complex",
        "practical",
        "deliberation",
        "moral",
        "issue",
        "allman",
        "woodward",
        "research",
        "regard",
        "begun",
        "even",
        "questionable",
        "assume",
        "without",
        "argument",
        "reasonemotion",
        "dichotomy",
        "presupposed",
        "third",
        "type",
        "debunking",
        "argument",
        "trustworthy",
        "enough",
        "rule",
        "moral",
        "knowledge",
        "even",
        "moral",
        "judgment",
        "emotional",
        "basis",
        "claimed",
        "recent",
        "development",
        "regarding",
        "moral",
        "consistency",
        "reasoning",
        "underline",
        "role",
        "emotion",
        "moral",
        "reasoning",
        "campbell",
        "kumar",
        "kumar",
        "campbell",
        "campbell",
        "see",
        "also",
        "wong",
        "analogical",
        "moral",
        "reasoning",
        "return",
        "singer",
        "example",
        "man",
        "seeing",
        "toddler",
        "drown",
        "shallow",
        "pond",
        "knowing",
        "cost",
        "saving",
        "life",
        "would",
        "ruining",
        "new",
        "suit",
        "one",
        "expected",
        "feeling",
        "strong",
        "disapproval",
        "toward",
        "anyone",
        "try",
        "save",
        "child",
        "similar",
        "situation",
        "suppose",
        "however",
        "another",
        "situation",
        "say",
        "one",
        "someone",
        "life",
        "stake",
        "person",
        "saved",
        "cost",
        "losing",
        "new",
        "suit",
        "say",
        "giving",
        "fund",
        "famine",
        "relief",
        "one",
        "feel",
        "new",
        "situation",
        "moral",
        "difference",
        "explain",
        "difference",
        "emotional",
        "response",
        "else",
        "one",
        "morally",
        "inconsistent",
        "one",
        "moral",
        "emotion",
        "moreover",
        "kind",
        "moral",
        "inconsistency",
        "morally",
        "culpable",
        "revealing",
        "one",
        "fully",
        "morally",
        "trustworthy",
        "moral",
        "agent",
        "singer",
        "argues",
        "fact",
        "one",
        "response",
        "opportunity",
        "provide",
        "fund",
        "famine",
        "relief",
        "least",
        "equivalent",
        "cost",
        "new",
        "suit",
        "ought",
        "pond",
        "case",
        "since",
        "claim",
        "morally",
        "relevant",
        "difference",
        "considers",
        "various",
        "candidate",
        "difference",
        "argues",
        "thinking",
        "morally",
        "relevant",
        "result",
        "inconsistency",
        "depending",
        "candidate",
        "relevant",
        "moral",
        "difference",
        "two",
        "situation",
        "moral",
        "import",
        "one",
        "response",
        "different",
        "response",
        "morally",
        "justified",
        "though",
        "singer",
        "focus",
        "whether",
        "one",
        "moral",
        "obligation",
        "logic",
        "argument",
        "would",
        "whether",
        "inconsistency",
        "moral",
        "belief",
        "moral",
        "emotion",
        "general",
        "expected",
        "morally",
        "consistent",
        "moral",
        "belief",
        "moral",
        "emotion",
        "sometimes",
        "moral",
        "belief",
        "moral",
        "emotion",
        "diverge",
        "yet",
        "rational",
        "trust",
        "moral",
        "emotion",
        "rather",
        "moral",
        "belief",
        "section",
        "discussed",
        "hybrid",
        "conception",
        "moral",
        "judgment",
        "allows",
        "kind",
        "separation",
        "belief",
        "emotion",
        "one",
        "example",
        "woman",
        "feel",
        "strong",
        "moral",
        "resentment",
        "passed",
        "promotion",
        "favour",
        "someone",
        "whose",
        "performance",
        "inferior",
        "possible",
        "believe",
        "wronged",
        "perhaps",
        "belief",
        "man",
        "performed",
        "better",
        "feeling",
        "trustworthy",
        "suppose",
        "resentment",
        "persists",
        "despite",
        "effort",
        "ignore",
        "must",
        "moral",
        "emotion",
        "irrational",
        "imagine",
        "feel",
        "resentment",
        "fact",
        "recognize",
        "morally",
        "relevant",
        "difference",
        "case",
        "would",
        "explain",
        "promoted",
        "even",
        "first",
        "consciously",
        "think",
        "way",
        "resentment",
        "arise",
        "emotion",
        "attuned",
        "respond",
        "case",
        "promotion",
        "granted",
        "unfairly",
        "retrospect",
        "doubt",
        "anyone",
        "mind",
        "like",
        "pond",
        "case",
        "would",
        "right",
        "thing",
        "short",
        "moral",
        "emotion",
        "may",
        "rationally",
        "grounded",
        "exists",
        "morally",
        "relevant",
        "difference",
        "situation",
        "one",
        "morally",
        "right",
        "response",
        "doubt",
        "anyone",
        "perspective",
        "contrary",
        "decision",
        "made",
        "case",
        "idea",
        "emotion",
        "may",
        "enter",
        "unconsciously",
        "good",
        "reasoning",
        "yield",
        "moral",
        "emotion",
        "better",
        "rational",
        "basis",
        "person",
        "consciously",
        "held",
        "belief",
        "may",
        "seem",
        "surprising",
        "however",
        "growing",
        "literature",
        "cognitive",
        "science",
        "past",
        "decade",
        "support",
        "cognitive",
        "sophistication",
        "affective",
        "system",
        "operates",
        "largely",
        "unconsciously",
        "practical",
        "decisionmaking",
        "illuminating",
        "review",
        "development",
        "link",
        "insight",
        "aristotle",
        "kant",
        "unconscious",
        "cognitive",
        "work",
        "done",
        "evolved",
        "system",
        "affective",
        "attunement",
        "see",
        "railton",
        "lesson",
        "belief",
        "emotion",
        "generally",
        "cohere",
        "moral",
        "judgment",
        "emotion",
        "cognitively",
        "complex",
        "make",
        "independent",
        "rationally",
        "based",
        "contribution",
        "moral",
        "judgment"
    ]
}