{
    "main_text": "\n\nThe topic of this entry is not—at least directly—moral\ntheory; rather, it is the definition of morality. Moral\ntheories are large and complex things; definitions are not. The\nquestion of the definition of morality is the question of identifying\nthe target of moral theorizing. Identifying this target\nenables us to see different moral theories as attempting to capture\nthe very same thing. And it enables psychologists, anthropologists,\nevolutionary biologists, and other more empirically-oriented theorists\nto design their experiments or formulate their hypotheses without\nprejudicing matters too much in terms of the specific content a code,\njudgment, or norm must have in order to count as distinctively\nmoral.\n\nThere does not seem to be much reason to think that a single\ndefinition of morality will be applicable to all moral discussions.\nOne reason for this is that “morality” seems to be used in\ntwo distinct broad senses: a descriptive sense and a normative sense.\nMore particularly, the term “morality” can be used\neither\n\ndescriptively to refer to certain codes of conduct put forward by\na society or a group (such as a religion), or accepted by an\nindividual for her own behavior, or\nnormatively to refer to a code of conduct that, given specified\nconditions, would be put forward by all rational people.\n\n\nWhich of these two senses of “morality” a moral\nphilosopher is using plays a crucial, although sometimes\nunacknowledged, role in the development of an ethical theory. If one\nuses “morality” in its descriptive sense, and therefore\nuses it to refer to codes of conduct actually put forward by distinct\ngroups or societies, one will almost certainly deny that there is a\nuniversal morality that applies to all human beings. The descriptive\nuse of “morality” is the one used by anthropologists when\nthey report on the morality of the societies that they study.\nRecently, some comparative and evolutionary psychologists (Haidt 2006;\nHauser 2006; De Waal 1996) have taken morality, or a close\nanticipation of it, to be present among groups of non-human animals:\nprimarily, but not exclusively, other primates.\n\nAccepting that there are two uses or senses of\n“morality”—a descriptive sense and a normative\nsense—does not commit one to holding that the “distinction\nbetween descriptions and norms—between what is and what ought to\nbe—is obvious and unbridgeable”, as some have held that it\ndoes (Churchland 2011: 185). To see this, note that it is obvious that\nthere is a descriptive sense of morality. That is, it is obvious that\none can sensibly describe the moralities of various groups without\nmaking any normative claims. And it should be equally obvious that\nthat one might hold that a certain code of conduct would be put\nforward by all rational people under certain conditions without having\nany particular views about the nature of the is/ought gap or the\npossibility of crossing it.\n\nAny definition of “morality” in the descriptive sense will\nneed to specify which of the codes put forward by a society\nor group count as moral. Even in small homogeneous societies that have\nno written language, distinctions are sometimes made between morality,\netiquette, law, and religion. And in larger and more complex societies\nthese distinctions are often sharply marked. So “morality”\ncannot be taken to refer to every code of conduct put forward by a\nsociety.\n\nIn the normative sense, “morality” refers to a code of\nconduct that would be accepted by anyone who meets certain\nintellectual and volitional conditions, almost always including the\ncondition of being rational. That a person meets these conditions is\ntypically expressed by saying that the person counts as a moral\nagent. However, merely showing that a certain code would be\naccepted by any moral agent is not enough to show that the code is the\nmoral code. It might well be that all moral agents would also accept a\ncode of prudence or rationality, but this would not by itself show\nthat prudence was part of morality. So something else must be added;\nfor example, that the code can be understood to involve a certain kind\nof impartiality, or that it can be understood as having the function\nof making it possible for people to live together in groups.\n\nAs we’ve just seen, not all codes that are put forward by\nsocieties or groups are moral codes in the descriptive sense of\nmorality, and not all codes that would be accepted by all moral\nagents are moral codes in the normative sense of morality. So any\ndefinition of morality—in either sense—will require\nfurther criteria. Still, each of these two very brief descriptions of\ncodes might be regarded as offering some features of morality that\nwould be included in any adequate definition. In that way they might\nbe taken to be offering some definitional features of\nmorality, in each of its two senses. When one has specified enough\ndefinitional features to allow one to classify all the relevant moral\ntheories as theories of a common subject, one might then be taken to\nhave given a definition of morality. This is the sense of\n“definition” at work in this entry.\n\nExplicit attempts, by philosophers, to define morality are hard to\nfind, at least since the beginning of the twentieth century. One\npossible explanation for this is the combined effect of early\npositivistic worries about the metaphysical status of normative\nproperties, followed (or augmented) by Wittgensteinian worries about\ndefinitions of any significant terms whatsoever. Whatever the\nexplanation, when definitions have been offered, they have tended to\nbe directed at the notion of moral judgment (Hare 1952, 1981) rather\nthan at morality itself. However, to the degree that these definitions\nof moral judgment are adequate, they might, without much effort, be\nconverted into definitions of morality in the descriptive sense. For\nexample, a particular person’s morality might be regarded as the\ncontent of the basic moral judgments that person is prepared to\naccept.\n\nOne might use a detailed definition of moral judgment to define\nmorality in a descriptive sense in another way—other than simply\nas the content of a person’s moral judgments, or the content of\nthe moral judgments that prevail in a certain society or group. In\nparticular, the very features of a judgment that make it qualify as a\nmoral judgment might be transposed from a psychological key to\nsomething more abstract. Here is one simplified example. Suppose that\na negative judgment of an action only counts as a negative moral\njudgment if it involves the idea that there is a prima facie case for\npunishing that action. In that case, a definition of morality in the\ndescriptive sense will include a corresponding idea: that the\nprohibitions of morality, taken in the descriptive sense, are those\nthat are backed by the threat of punishment. Of course, if one goes\nthis route, other conditions will need to be included, to\ndifferentiate morality from criminal law.\n\nWhat counts as definitional of morality, in either sense of\n“morality”, is controversial. Moreover, the line between\nwhat is part of a definition, in the sense at issue, and what is part\nof a moral theory, is not entirely sharp. For example, some might\nregard it as definitional of morality, in the normative sense, that it\ngoverns only interpersonal interactions. Others, however, might take\nthis to be a substantive theoretical claim. Some might take it as\ndefinitional of “morality” in its descriptive sense that\nit be a code of conduct that a person or group takes to be most\nimportant. But others might say that attention to religion casts doubt\non this idea.\n\n“Morality”, when used in a descriptive sense, has an\nimportant feature that “morality” in the normative sense\ndoes not have: a feature that stems from its relational nature. This\nfeature is the following: that if one is not a member of the relevant\nsociety or group, or is not the relevant individual, then accepting a\ncertain account of the content of a morality, in the descriptive\nsense, has no implications for how one thinks one should behave. On\nthe other hand, if one accepts a moral theory’s account of moral\nagents, and of the conditions under which all moral agents would\nendorse a code of conduct as a moral code, then one accepts that moral\ntheory’s normative definition of “morality”.\nAccepting an account of “morality” in the normative sense\ncommits one to regarding some behavior as immoral, perhaps even\nbehavior that one is tempted to perform. Because accepting an account\nof “morality” in the normative sense involves this\ncommitment, it is not surprising that philosophers seriously disagree\nabout which account to accept.\n",
    "section_title": "Preamble",
    "entry_title": "The Definition of Morality",
    "hierarchy_title": "The Definition of Morality || Preamble",
    "tokenized_text": [
        "topic",
        "entry",
        "notat",
        "least",
        "directlymoral",
        "theory",
        "rather",
        "definition",
        "morality",
        "moral",
        "theory",
        "large",
        "complex",
        "thing",
        "definition",
        "question",
        "definition",
        "morality",
        "question",
        "identifying",
        "target",
        "moral",
        "theorizing",
        "identifying",
        "target",
        "enables",
        "u",
        "see",
        "different",
        "moral",
        "theory",
        "attempting",
        "capture",
        "thing",
        "enables",
        "psychologist",
        "anthropologist",
        "evolutionary",
        "biologist",
        "empiricallyoriented",
        "theorist",
        "design",
        "experiment",
        "formulate",
        "hypothesis",
        "without",
        "prejudicing",
        "matter",
        "much",
        "term",
        "specific",
        "content",
        "code",
        "judgment",
        "norm",
        "must",
        "order",
        "count",
        "distinctively",
        "moral",
        "seem",
        "much",
        "reason",
        "think",
        "single",
        "definition",
        "morality",
        "applicable",
        "moral",
        "discussion",
        "one",
        "reason",
        "morality",
        "seems",
        "used",
        "two",
        "distinct",
        "broad",
        "sens",
        "descriptive",
        "sense",
        "normative",
        "sense",
        "particularly",
        "term",
        "morality",
        "used",
        "either",
        "descriptively",
        "refer",
        "certain",
        "code",
        "conduct",
        "put",
        "forward",
        "society",
        "group",
        "religion",
        "accepted",
        "individual",
        "behavior",
        "normatively",
        "refer",
        "code",
        "conduct",
        "given",
        "specified",
        "condition",
        "would",
        "put",
        "forward",
        "rational",
        "people",
        "two",
        "sens",
        "morality",
        "moral",
        "philosopher",
        "using",
        "play",
        "crucial",
        "although",
        "sometimes",
        "unacknowledged",
        "role",
        "development",
        "ethical",
        "theory",
        "one",
        "us",
        "morality",
        "descriptive",
        "sense",
        "therefore",
        "us",
        "refer",
        "code",
        "conduct",
        "actually",
        "put",
        "forward",
        "distinct",
        "group",
        "society",
        "one",
        "almost",
        "certainly",
        "deny",
        "universal",
        "morality",
        "applies",
        "human",
        "being",
        "descriptive",
        "use",
        "morality",
        "one",
        "used",
        "anthropologist",
        "report",
        "morality",
        "society",
        "study",
        "recently",
        "comparative",
        "evolutionary",
        "psychologist",
        "haidt",
        "hauser",
        "de",
        "waal",
        "taken",
        "morality",
        "close",
        "anticipation",
        "present",
        "among",
        "group",
        "nonhuman",
        "animal",
        "primarily",
        "exclusively",
        "primate",
        "accepting",
        "two",
        "us",
        "sens",
        "morality",
        "a",
        "descriptive",
        "sense",
        "normative",
        "sensedoes",
        "commit",
        "one",
        "holding",
        "distinction",
        "description",
        "normsbetween",
        "ought",
        "beis",
        "obvious",
        "unbridgeable",
        "held",
        "churchland",
        "see",
        "note",
        "obvious",
        "descriptive",
        "sense",
        "morality",
        "obvious",
        "one",
        "sensibly",
        "describe",
        "morality",
        "various",
        "group",
        "without",
        "making",
        "normative",
        "claim",
        "equally",
        "obvious",
        "one",
        "might",
        "hold",
        "certain",
        "code",
        "conduct",
        "would",
        "put",
        "forward",
        "rational",
        "people",
        "certain",
        "condition",
        "without",
        "particular",
        "view",
        "nature",
        "isought",
        "gap",
        "possibility",
        "crossing",
        "definition",
        "morality",
        "descriptive",
        "sense",
        "need",
        "specify",
        "code",
        "put",
        "forward",
        "society",
        "group",
        "count",
        "moral",
        "even",
        "small",
        "homogeneous",
        "society",
        "written",
        "language",
        "distinction",
        "sometimes",
        "made",
        "morality",
        "etiquette",
        "law",
        "religion",
        "larger",
        "complex",
        "society",
        "distinction",
        "often",
        "sharply",
        "marked",
        "morality",
        "taken",
        "refer",
        "every",
        "code",
        "conduct",
        "put",
        "forward",
        "society",
        "normative",
        "sense",
        "morality",
        "refers",
        "code",
        "conduct",
        "would",
        "accepted",
        "anyone",
        "meet",
        "certain",
        "intellectual",
        "volitional",
        "condition",
        "almost",
        "always",
        "including",
        "condition",
        "rational",
        "person",
        "meet",
        "condition",
        "typically",
        "expressed",
        "saying",
        "person",
        "count",
        "moral",
        "agent",
        "however",
        "merely",
        "showing",
        "certain",
        "code",
        "would",
        "accepted",
        "moral",
        "agent",
        "enough",
        "show",
        "code",
        "moral",
        "code",
        "might",
        "well",
        "moral",
        "agent",
        "would",
        "also",
        "accept",
        "code",
        "prudence",
        "rationality",
        "would",
        "show",
        "prudence",
        "part",
        "morality",
        "something",
        "else",
        "must",
        "added",
        "example",
        "code",
        "understood",
        "involve",
        "certain",
        "kind",
        "impartiality",
        "understood",
        "function",
        "making",
        "possible",
        "people",
        "live",
        "together",
        "group",
        "seen",
        "code",
        "put",
        "forward",
        "society",
        "group",
        "moral",
        "code",
        "descriptive",
        "sense",
        "morality",
        "code",
        "would",
        "accepted",
        "moral",
        "agent",
        "moral",
        "code",
        "normative",
        "sense",
        "morality",
        "definition",
        "moralityin",
        "either",
        "sensewill",
        "require",
        "criterion",
        "still",
        "two",
        "brief",
        "description",
        "code",
        "might",
        "regarded",
        "offering",
        "feature",
        "morality",
        "would",
        "included",
        "adequate",
        "definition",
        "way",
        "might",
        "taken",
        "offering",
        "definitional",
        "feature",
        "morality",
        "two",
        "sens",
        "one",
        "specified",
        "enough",
        "definitional",
        "feature",
        "allow",
        "one",
        "classify",
        "relevant",
        "moral",
        "theory",
        "theory",
        "common",
        "subject",
        "one",
        "might",
        "taken",
        "given",
        "definition",
        "morality",
        "sense",
        "definition",
        "work",
        "entry",
        "explicit",
        "attempt",
        "philosopher",
        "define",
        "morality",
        "hard",
        "find",
        "least",
        "since",
        "beginning",
        "twentieth",
        "century",
        "one",
        "possible",
        "explanation",
        "combined",
        "effect",
        "early",
        "positivistic",
        "worry",
        "metaphysical",
        "status",
        "normative",
        "property",
        "followed",
        "augmented",
        "wittgensteinian",
        "worry",
        "definition",
        "significant",
        "term",
        "whatsoever",
        "whatever",
        "explanation",
        "definition",
        "offered",
        "tended",
        "directed",
        "notion",
        "moral",
        "judgment",
        "hare",
        "rather",
        "morality",
        "however",
        "degree",
        "definition",
        "moral",
        "judgment",
        "adequate",
        "might",
        "without",
        "much",
        "effort",
        "converted",
        "definition",
        "morality",
        "descriptive",
        "sense",
        "example",
        "particular",
        "person",
        "morality",
        "might",
        "regarded",
        "content",
        "basic",
        "moral",
        "judgment",
        "person",
        "prepared",
        "accept",
        "one",
        "might",
        "use",
        "detailed",
        "definition",
        "moral",
        "judgment",
        "define",
        "morality",
        "descriptive",
        "sense",
        "another",
        "wayother",
        "simply",
        "content",
        "person",
        "moral",
        "judgment",
        "content",
        "moral",
        "judgment",
        "prevail",
        "certain",
        "society",
        "group",
        "particular",
        "feature",
        "judgment",
        "make",
        "qualify",
        "moral",
        "judgment",
        "might",
        "transposed",
        "psychological",
        "key",
        "something",
        "abstract",
        "one",
        "simplified",
        "example",
        "suppose",
        "negative",
        "judgment",
        "action",
        "count",
        "negative",
        "moral",
        "judgment",
        "involves",
        "idea",
        "prima",
        "facie",
        "case",
        "punishing",
        "action",
        "case",
        "definition",
        "morality",
        "descriptive",
        "sense",
        "include",
        "corresponding",
        "idea",
        "prohibition",
        "morality",
        "taken",
        "descriptive",
        "sense",
        "backed",
        "threat",
        "punishment",
        "course",
        "one",
        "go",
        "route",
        "condition",
        "need",
        "included",
        "differentiate",
        "morality",
        "criminal",
        "law",
        "count",
        "definitional",
        "morality",
        "either",
        "sense",
        "morality",
        "controversial",
        "moreover",
        "line",
        "part",
        "definition",
        "sense",
        "issue",
        "part",
        "moral",
        "theory",
        "entirely",
        "sharp",
        "example",
        "might",
        "regard",
        "definitional",
        "morality",
        "normative",
        "sense",
        "governs",
        "interpersonal",
        "interaction",
        "others",
        "however",
        "might",
        "take",
        "substantive",
        "theoretical",
        "claim",
        "might",
        "take",
        "definitional",
        "morality",
        "descriptive",
        "sense",
        "code",
        "conduct",
        "person",
        "group",
        "take",
        "important",
        "others",
        "might",
        "say",
        "attention",
        "religion",
        "cast",
        "doubt",
        "idea",
        "morality",
        "used",
        "descriptive",
        "sense",
        "important",
        "feature",
        "morality",
        "normative",
        "sense",
        "feature",
        "stem",
        "relational",
        "nature",
        "feature",
        "following",
        "one",
        "member",
        "relevant",
        "society",
        "group",
        "relevant",
        "individual",
        "accepting",
        "certain",
        "account",
        "content",
        "morality",
        "descriptive",
        "sense",
        "implication",
        "one",
        "think",
        "one",
        "behave",
        "hand",
        "one",
        "accepts",
        "moral",
        "theory",
        "account",
        "moral",
        "agent",
        "condition",
        "moral",
        "agent",
        "would",
        "endorse",
        "code",
        "conduct",
        "moral",
        "code",
        "one",
        "accepts",
        "moral",
        "theory",
        "normative",
        "definition",
        "morality",
        "accepting",
        "account",
        "morality",
        "normative",
        "sense",
        "commits",
        "one",
        "regarding",
        "behavior",
        "immoral",
        "perhaps",
        "even",
        "behavior",
        "one",
        "tempted",
        "perform",
        "accepting",
        "account",
        "morality",
        "normative",
        "sense",
        "involves",
        "commitment",
        "surprising",
        "philosopher",
        "seriously",
        "disagree",
        "account",
        "accept"
    ]
}