{
    "main_text": "A Priori Justification and Early 20th Century Non-Naturalism || The Naturalistic Fallacy and Intuitionism\n3.1 The Naturalistic Fallacy and Intuitionism\n\nG.E. Moore reacted against views that provided naturalistic\ndefinitions of moral concepts, especially that of goodness\n(see entries on\n naturalism,\n and\n moral naturalism).\n One might question whether his targets actually held the view he\ncriticized, but let’s set such worries aside and assume that as\nthe 19th-century drew to a close, philosophical ethics was\ndominated by hedonists who defined “good” in terms of\npleasure, evolutionary ethicists who defined “good” as the\nmost evolved, utilitarians who defined “right” as what\nproduces the most utility, and other naturalists. According to such\nviews, fundamental moral principles are analytic, and hence knowable\na priori. Since the fundamental principles defined moral\nconcepts in natural terms, one can infer whether some specific thing\nis good or action right from the principle conjoined with appropriate\npropositions about the natural properties of the thing or action, the\nlatter being knowable empirically. For example, one could infer that\nlistening to music is good from the analysis of “good” as\nconducive to pleasure and the fact that listening to music is often\npleasant. In presenting Moore’s response to such naturalistic\ndefinitions, we will focus on the position he took in Principia\nEthica (1903 [2003]) (although his views changed significantly\nover time).\n\nAccording Moore, all naturalistic analytic definitions of\n“good” fail, committing what he called “the\nnaturalistic fallacy”. To show all naturalistic analyses of\ngoodness fail, Moore presented the “open-question\nargument”. The basic idea is that if a definition of\n“good” is correct, a morally competent person could not\nsensibly question whether something satisfying the definition is good.\nConsider a definable term: a triangle is a closed plane figure with\nthree angles. No person who understands the term can sensibly ask,\n“X is a triangle, but is X three-angled?”\nThe question is closed; an open question is one it\nmakes sense to ask. Moore claimed that for any naturalistic definition\nN of “good”, the question “X is\nN, but is it good?” is open. For example, suppose someone\nanalyzes “good” as conducive to pleasure. If the analysis\nwere correct, the question “X is conducive to pleasure,\nbut is it good?” should be closed. But the question is open; it\nis perfectly reasonable. One might, e.g., think of\nschadenfreude—pleasure at another’s\nmisfortune—and wonder whether such pleasure is good. Hence,\nMoore would conclude, the analysis fails. Moore held that the argument\ncan be repeated for any proposed naturalistic analysis of\n“good”, so “good” cannot be analyzed in\nnatural terms. He concluded that goodness is non-natural (see entry on\n moral non-naturalism).\n Moore went further, holding that “good” was unanalyzable,\nand that the property of goodness was simple and irreducible. These\nclaims about goodness do not follow from the failure of all\nnaturalistic analyses of “good”, since it might\nbe possible to give a non-natural definition of\n“good”, e.g., as what God approves. However, although he\ndoes not seem to have recognized it, at least in Principia\nEthica, the open question argument seems to work against nearly\nany definition of “good” just as it works against natural\n definitions.[4]\n (For more on the open question argument and objections to it, see the\nentry on\n Moore’s Moral Philosophy.)\n\nBecause of his views regarding moral concepts and properties, Moore\nconcluded that the fundamental moral principles are self-evident and\nthat moral knowledge can come only from moral “intuition”.\nSuperficially, his view seems to comport well with the standard\nconception of a priori knowledge. But consider how he\nexplains his position, quoted here at some length:\n\n\n[T]he fundamental principles of Ethics must be self-evident. But I am\nanxious that this expression should not be misunderstood. The\nexpression “self-evident” means properly that the\nproposition so called is evident or true, by itself alone;\nthat it is not an inference from some proposition other than\nitself. The expression does not mean that the proposition is\ntrue, because it is evident to you or me or all mankind, because in\nother words it appears to us to be true. That a proposition appears to\nbe true can never be a valid argument that true it really is. By\nsaying that a proposition is self-evident, we mean emphatically that\nits appearing so to us, is not the reason why it is true: for\nwe mean that it has absolutely no reason. It would not be a\nself-evident proposition, if we could say of it: I cannot think\notherwise and therefore it is true. For then its evidence or proof\nwould not lie in itself, but in something else, namely our conviction\nof it. That it appears true to us may indeed be the cause of\nour asserting it, or the reason why we think and say that it is true:\nbut a reason in this sense is something utterly different from a\nlogical reason, or reason why something is true. Moreover, it is\nobviously not a reason of the same thing. The evidence of a\nproposition to us is only a reason for our holding it to be\ntrue; whereas a logical reason, or reason in the sense in which\nself-evident propositions have no reason, is a reason why the\nproposition itself must be true, not why we hold it so to be.\nAgain, that a proposition is evident to us may not only be the\nreason why we do think or affirm it, it may even be a reason\nwhy we ought to think it or affirm it. But a reason, in this sense\ntoo, is not a logical reason for the truth of the proposition, though\nit is a logical reason for the rightness of holding the\nproposition…. When, therefore, I talk of Intuitionistic\nHedonism, I must not be understood to imply that my denial that\n“Pleasure is the only good” is based on my\nIntuition of its falsehood. My Intuition of its falsehood is indeed\nmy reason for holding and declaring it untrue; it is\nindeed the only valid reason for so doing. But that is just because\nthere is no logical reason for it; because there is no proper\nevidence or reason of its falsehood except for itself alone. It is\nuntrue, because it is untrue, and there is no other reason: but I\ndeclare it untrue, because its untruth is evident to me, and\nI hold that that is a sufficient reason for my assertion. We must not\ntherefore look on Intuition, as if it were an alternative to\nreasoning. Nothing whatever can take the place of reasons for\nthe truth of any proposition: intuition can only furnish a reason for\nholding any proposition to be true: this however it must do\nwhen any proposition is self-evident, when, in fact, there are no\nreasons which prove its truth. (1903 [2003]: 143–144)\n\n\nNote first that Moore’s conception of self-evidence is of\npropositions whose truth does not depend on anything else; these would\nbe propositions that express a sort of brute fact. Nothing obviously\nfollows about the epistemic status of such propositions or about\nbeliefs in such propositions. In this respect, Moore’s\nconception of self-evidence differs from the standard conception.\nSecond, given his conception of self-evidence, Moore chooses an odd\nexample of a self-evident proposition. For that pleasure is not the\nonly good seems to follow from various propositions regarding\nwhat things are good, propositions that Moore accepted—and that\nare apparently self-evident—e.g., that appreciation of beauty is\ngood.\n\nFinally, to interpret Moore as holding that we are a priori\njustified in accepting fundamental moral principles, one must adopt\nthe modified standard view. And his position nicely illustrates the\nproblem that forces the modification of the standard view. Moore held\nthat what justifies one in believing a fundamental moral principle is\nthat the principle is self-evident and that it appears to be true,\ni.e., that one has an intuition of it. But this intuition, as an\nappearance of truth, is clearly a kind of experience, so it seems that\none’s justification for an intuitive belief in a fundamental\nmoral principle will not be independent of experience. Hence, to\nregard this justification as a priori, one must make an\nexception for this specific kind of experience. While Moore famously\ndenied hedonism, this was because he denied that pleasure is the only\ngood. He accepted that pleasure is good, and this proposition nicely\nillustrates the tension inherent in the modified standard view of\na priori justification, and indeed the standard view, as well\nas Moore’s a priori moral epistemology. Presumably one\nmust experience pleasure to acquire the concept of pleasure. But then\nhow exactly is it that one is justified in believing that pleasure is\ngood? Is it that once one has the concepts of pleasure and goodness,\none believes that pleasure is good simply on the basis of\nunderstanding this proposition? Or is it that once one understands\nthis proposition, one has a rational intuition of its truth? Or is it\ninstead that when one experiences pleasure one also experiences its\ngoodness? If something like the latter, the justification for our\nbelief that pleasure is good seems more empirical than a\npriori.\n\nContrasting Moore’s view with Kant’s might be helpful.\nKant viewed moral knowledge as fundamentally a priori in the\nsense that moral knowledge must be the result of careful reasoning\n(first transcendental, then deductive); one could discover through\nreason the fundamental moral principle, and then deduce from that\nprinciple more specific moral duties. Moore, on the other hand,\nexplicitly rules out reasoning to fundamental moral principles; since\nthese principles are self-evident, Moore denies that there are,\nproperly speaking, any reasons for them. Thus, we find in Moore a\ndistinctively intuitionist account of a priori knowledge, as\nopposed to Kant’s rationalist account. Moore’s account is\nintuitionistic because the reason why we believe, and ought to\nbelieve, fundamental moral principles is that they are self-evident\npropositions that appear true to us.\n\nMoore did not hold that all moral knowledge is intuitive. In the\nPrincipia he maintained that the utilitarian principle was\nanalytic, hence, knowledge of this principle would not require a\nspecial intuition. But he later acknowledged that one cannot define\n“right”, because the open question argument can be used\nagainst definitions of “right”, including the utilitarian\ndefinition. (“This action produces the most good consequences,\nbut is it right?” is an open question. Corresponding open\nquestions count against efforts to define “ought”, e.g.,\n“This action produces the most good consequences, but ought I do\nit?”) So Moore was driven to hold that the utilitarian principle\nwas synthetic, and known a priori via intuition (Moore 1912).\nHowever, since Moore held that one ought to do what produces\nthe most good, one would have to engage in empirical investigation of\nthe consequences of various types of action to determine what one is\nobligated to do. So on Moore’s view, one would not simply intuit\nthat one ought to keep promises or ought not to kill.\n\nA more interesting reason why Moore did not hold that all moral\nknowledge results from direct intuition was that he denied that\nintuition is infallible. On his view, it can appear to one that a\nfalse moral proposition is self-evidently\n true.[5]\n Thus, according to Moore, it is possible for the moral propositions\none intuits to conflict. One resolves any conflicts among the moral\nprinciples one intuits—e.g., regarding which sorts of things are\ngood—by considerations of coherence, with some intuitions\nregarding what is and is not good being rejected precisely because of\ntheir conflicts with other intuitions. So while a priori\nintuition plays a large role for Moore, he did not hold that one\nattains moral knowledge exclusively by carefully focusing one’s\nattention on various moral propositions and then simply intuiting\nwhether or not they are true.\n",
    "section_title": "3.1 The Naturalistic Fallacy and Intuitionism",
    "entry_title": "A Priorism in Moral Epistemology",
    "hierarchy_title": "A Priorism in Moral Epistemology || A Priori Justification and Early 20th Century Non-Naturalism || The Naturalistic Fallacy and Intuitionism",
    "tokenized_text": [
        "priori",
        "justification",
        "early",
        "th",
        "century",
        "nonnaturalism",
        "naturalistic",
        "fallacy",
        "intuitionism",
        "naturalistic",
        "fallacy",
        "intuitionism",
        "ge",
        "moore",
        "reacted",
        "view",
        "provided",
        "naturalistic",
        "definition",
        "moral",
        "concept",
        "especially",
        "goodness",
        "see",
        "entry",
        "naturalism",
        "moral",
        "naturalism",
        "one",
        "might",
        "question",
        "whether",
        "target",
        "actually",
        "held",
        "view",
        "criticized",
        "let",
        "set",
        "worry",
        "aside",
        "assume",
        "thcentury",
        "drew",
        "close",
        "philosophical",
        "ethic",
        "dominated",
        "hedonist",
        "defined",
        "good",
        "term",
        "pleasure",
        "evolutionary",
        "ethicist",
        "defined",
        "good",
        "evolved",
        "utilitarian",
        "defined",
        "right",
        "produce",
        "utility",
        "naturalist",
        "according",
        "view",
        "fundamental",
        "moral",
        "principle",
        "analytic",
        "hence",
        "knowable",
        "priori",
        "since",
        "fundamental",
        "principle",
        "defined",
        "moral",
        "concept",
        "natural",
        "term",
        "one",
        "infer",
        "whether",
        "specific",
        "thing",
        "good",
        "action",
        "right",
        "principle",
        "conjoined",
        "appropriate",
        "proposition",
        "natural",
        "property",
        "thing",
        "action",
        "latter",
        "knowable",
        "empirically",
        "example",
        "one",
        "could",
        "infer",
        "listening",
        "music",
        "good",
        "analysis",
        "good",
        "conducive",
        "pleasure",
        "fact",
        "listening",
        "music",
        "often",
        "pleasant",
        "presenting",
        "moore",
        "response",
        "naturalistic",
        "definition",
        "focus",
        "position",
        "took",
        "principia",
        "ethica",
        "although",
        "view",
        "changed",
        "significantly",
        "time",
        "according",
        "moore",
        "naturalistic",
        "analytic",
        "definition",
        "good",
        "fail",
        "committing",
        "called",
        "naturalistic",
        "fallacy",
        "show",
        "naturalistic",
        "analysis",
        "goodness",
        "fail",
        "moore",
        "presented",
        "openquestion",
        "argument",
        "basic",
        "idea",
        "definition",
        "good",
        "correct",
        "morally",
        "competent",
        "person",
        "could",
        "sensibly",
        "question",
        "whether",
        "something",
        "satisfying",
        "definition",
        "good",
        "consider",
        "definable",
        "term",
        "triangle",
        "closed",
        "plane",
        "figure",
        "three",
        "angle",
        "person",
        "understands",
        "term",
        "sensibly",
        "ask",
        "x",
        "triangle",
        "x",
        "threeangled",
        "question",
        "closed",
        "open",
        "question",
        "one",
        "make",
        "sense",
        "ask",
        "moore",
        "claimed",
        "naturalistic",
        "definition",
        "n",
        "good",
        "question",
        "x",
        "n",
        "good",
        "open",
        "example",
        "suppose",
        "someone",
        "analyzes",
        "good",
        "conducive",
        "pleasure",
        "analysis",
        "correct",
        "question",
        "x",
        "conducive",
        "pleasure",
        "good",
        "closed",
        "question",
        "open",
        "perfectly",
        "reasonable",
        "one",
        "might",
        "eg",
        "think",
        "schadenfreudepleasure",
        "another",
        "misfortuneand",
        "wonder",
        "whether",
        "pleasure",
        "good",
        "hence",
        "moore",
        "would",
        "conclude",
        "analysis",
        "fails",
        "moore",
        "held",
        "argument",
        "repeated",
        "proposed",
        "naturalistic",
        "analysis",
        "good",
        "good",
        "analyzed",
        "natural",
        "term",
        "concluded",
        "goodness",
        "nonnatural",
        "see",
        "entry",
        "moral",
        "nonnaturalism",
        "moore",
        "went",
        "holding",
        "good",
        "unanalyzable",
        "property",
        "goodness",
        "simple",
        "irreducible",
        "claim",
        "goodness",
        "follow",
        "failure",
        "naturalistic",
        "analysis",
        "good",
        "since",
        "might",
        "possible",
        "give",
        "nonnatural",
        "definition",
        "good",
        "eg",
        "god",
        "approves",
        "however",
        "although",
        "seem",
        "recognized",
        "least",
        "principia",
        "ethica",
        "open",
        "question",
        "argument",
        "seems",
        "work",
        "nearly",
        "definition",
        "good",
        "work",
        "natural",
        "definition",
        "open",
        "question",
        "argument",
        "objection",
        "see",
        "entry",
        "moore",
        "moral",
        "philosophy",
        "view",
        "regarding",
        "moral",
        "concept",
        "property",
        "moore",
        "concluded",
        "fundamental",
        "moral",
        "principle",
        "selfevident",
        "moral",
        "knowledge",
        "come",
        "moral",
        "intuition",
        "superficially",
        "view",
        "seems",
        "comport",
        "well",
        "standard",
        "conception",
        "priori",
        "knowledge",
        "consider",
        "explains",
        "position",
        "quoted",
        "length",
        "fundamental",
        "principle",
        "ethic",
        "must",
        "selfevident",
        "anxious",
        "expression",
        "misunderstood",
        "expression",
        "selfevident",
        "mean",
        "properly",
        "proposition",
        "called",
        "evident",
        "true",
        "alone",
        "inference",
        "proposition",
        "expression",
        "mean",
        "proposition",
        "true",
        "evident",
        "mankind",
        "word",
        "appears",
        "u",
        "true",
        "proposition",
        "appears",
        "true",
        "never",
        "valid",
        "argument",
        "true",
        "really",
        "saying",
        "proposition",
        "selfevident",
        "mean",
        "emphatically",
        "appearing",
        "u",
        "reason",
        "true",
        "mean",
        "absolutely",
        "reason",
        "would",
        "selfevident",
        "proposition",
        "could",
        "say",
        "think",
        "otherwise",
        "therefore",
        "true",
        "evidence",
        "proof",
        "would",
        "lie",
        "something",
        "else",
        "namely",
        "conviction",
        "appears",
        "true",
        "u",
        "may",
        "indeed",
        "cause",
        "asserting",
        "reason",
        "think",
        "say",
        "true",
        "reason",
        "sense",
        "something",
        "utterly",
        "different",
        "logical",
        "reason",
        "reason",
        "something",
        "true",
        "moreover",
        "obviously",
        "reason",
        "thing",
        "evidence",
        "proposition",
        "u",
        "reason",
        "holding",
        "true",
        "whereas",
        "logical",
        "reason",
        "reason",
        "sense",
        "selfevident",
        "proposition",
        "reason",
        "reason",
        "proposition",
        "must",
        "true",
        "hold",
        "proposition",
        "evident",
        "u",
        "may",
        "reason",
        "think",
        "affirm",
        "may",
        "even",
        "reason",
        "ought",
        "think",
        "affirm",
        "reason",
        "sense",
        "logical",
        "reason",
        "truth",
        "proposition",
        "though",
        "logical",
        "reason",
        "rightness",
        "holding",
        "proposition",
        "therefore",
        "talk",
        "intuitionistic",
        "hedonism",
        "must",
        "understood",
        "imply",
        "denial",
        "pleasure",
        "good",
        "based",
        "intuition",
        "falsehood",
        "intuition",
        "falsehood",
        "indeed",
        "reason",
        "holding",
        "declaring",
        "untrue",
        "indeed",
        "valid",
        "reason",
        "logical",
        "reason",
        "proper",
        "evidence",
        "reason",
        "falsehood",
        "except",
        "alone",
        "untrue",
        "untrue",
        "reason",
        "declare",
        "untrue",
        "untruth",
        "evident",
        "hold",
        "sufficient",
        "reason",
        "assertion",
        "must",
        "therefore",
        "look",
        "intuition",
        "alternative",
        "reasoning",
        "nothing",
        "whatever",
        "take",
        "place",
        "reason",
        "truth",
        "proposition",
        "intuition",
        "furnish",
        "reason",
        "holding",
        "proposition",
        "true",
        "however",
        "must",
        "proposition",
        "selfevident",
        "fact",
        "reason",
        "prove",
        "truth",
        "note",
        "first",
        "moore",
        "conception",
        "selfevidence",
        "proposition",
        "whose",
        "truth",
        "depend",
        "anything",
        "else",
        "would",
        "proposition",
        "express",
        "sort",
        "brute",
        "fact",
        "nothing",
        "obviously",
        "follows",
        "epistemic",
        "status",
        "proposition",
        "belief",
        "proposition",
        "respect",
        "moore",
        "conception",
        "selfevidence",
        "differs",
        "standard",
        "conception",
        "second",
        "given",
        "conception",
        "selfevidence",
        "moore",
        "chooses",
        "odd",
        "example",
        "selfevident",
        "proposition",
        "pleasure",
        "good",
        "seems",
        "follow",
        "various",
        "proposition",
        "regarding",
        "thing",
        "good",
        "proposition",
        "moore",
        "acceptedand",
        "apparently",
        "selfevidenteg",
        "appreciation",
        "beauty",
        "good",
        "finally",
        "interpret",
        "moore",
        "holding",
        "priori",
        "justified",
        "accepting",
        "fundamental",
        "moral",
        "principle",
        "one",
        "must",
        "adopt",
        "modified",
        "standard",
        "view",
        "position",
        "nicely",
        "illustrates",
        "problem",
        "force",
        "modification",
        "standard",
        "view",
        "moore",
        "held",
        "justifies",
        "one",
        "believing",
        "fundamental",
        "moral",
        "principle",
        "principle",
        "selfevident",
        "appears",
        "true",
        "ie",
        "one",
        "intuition",
        "intuition",
        "appearance",
        "truth",
        "clearly",
        "kind",
        "experience",
        "seems",
        "one",
        "justification",
        "intuitive",
        "belief",
        "fundamental",
        "moral",
        "principle",
        "independent",
        "experience",
        "hence",
        "regard",
        "justification",
        "priori",
        "one",
        "must",
        "make",
        "exception",
        "specific",
        "kind",
        "experience",
        "moore",
        "famously",
        "denied",
        "hedonism",
        "denied",
        "pleasure",
        "good",
        "accepted",
        "pleasure",
        "good",
        "proposition",
        "nicely",
        "illustrates",
        "tension",
        "inherent",
        "modified",
        "standard",
        "view",
        "priori",
        "justification",
        "indeed",
        "standard",
        "view",
        "well",
        "moore",
        "priori",
        "moral",
        "epistemology",
        "presumably",
        "one",
        "must",
        "experience",
        "pleasure",
        "acquire",
        "concept",
        "pleasure",
        "exactly",
        "one",
        "justified",
        "believing",
        "pleasure",
        "good",
        "one",
        "concept",
        "pleasure",
        "goodness",
        "one",
        "belief",
        "pleasure",
        "good",
        "simply",
        "basis",
        "understanding",
        "proposition",
        "one",
        "understands",
        "proposition",
        "one",
        "rational",
        "intuition",
        "truth",
        "instead",
        "one",
        "experience",
        "pleasure",
        "one",
        "also",
        "experience",
        "goodness",
        "something",
        "like",
        "latter",
        "justification",
        "belief",
        "pleasure",
        "good",
        "seems",
        "empirical",
        "priori",
        "contrasting",
        "moore",
        "view",
        "kant",
        "might",
        "helpful",
        "kant",
        "viewed",
        "moral",
        "knowledge",
        "fundamentally",
        "priori",
        "sense",
        "moral",
        "knowledge",
        "must",
        "result",
        "careful",
        "reasoning",
        "first",
        "transcendental",
        "deductive",
        "one",
        "could",
        "discover",
        "reason",
        "fundamental",
        "moral",
        "principle",
        "deduce",
        "principle",
        "specific",
        "moral",
        "duty",
        "moore",
        "hand",
        "explicitly",
        "rule",
        "reasoning",
        "fundamental",
        "moral",
        "principle",
        "since",
        "principle",
        "selfevident",
        "moore",
        "denies",
        "properly",
        "speaking",
        "reason",
        "thus",
        "find",
        "moore",
        "distinctively",
        "intuitionist",
        "account",
        "priori",
        "knowledge",
        "opposed",
        "kant",
        "rationalist",
        "account",
        "moore",
        "account",
        "intuitionistic",
        "reason",
        "believe",
        "ought",
        "believe",
        "fundamental",
        "moral",
        "principle",
        "selfevident",
        "proposition",
        "appear",
        "true",
        "u",
        "moore",
        "hold",
        "moral",
        "knowledge",
        "intuitive",
        "principia",
        "maintained",
        "utilitarian",
        "principle",
        "analytic",
        "hence",
        "knowledge",
        "principle",
        "would",
        "require",
        "special",
        "intuition",
        "later",
        "acknowledged",
        "one",
        "define",
        "right",
        "open",
        "question",
        "argument",
        "used",
        "definition",
        "right",
        "including",
        "utilitarian",
        "definition",
        "action",
        "produce",
        "good",
        "consequence",
        "right",
        "open",
        "question",
        "corresponding",
        "open",
        "question",
        "count",
        "effort",
        "define",
        "ought",
        "eg",
        "action",
        "produce",
        "good",
        "consequence",
        "ought",
        "moore",
        "driven",
        "hold",
        "utilitarian",
        "principle",
        "synthetic",
        "known",
        "priori",
        "via",
        "intuition",
        "moore",
        "however",
        "since",
        "moore",
        "held",
        "one",
        "ought",
        "produce",
        "good",
        "one",
        "would",
        "engage",
        "empirical",
        "investigation",
        "consequence",
        "various",
        "type",
        "action",
        "determine",
        "one",
        "obligated",
        "moore",
        "view",
        "one",
        "would",
        "simply",
        "intuit",
        "one",
        "ought",
        "keep",
        "promise",
        "ought",
        "kill",
        "interesting",
        "reason",
        "moore",
        "hold",
        "moral",
        "knowledge",
        "result",
        "direct",
        "intuition",
        "denied",
        "intuition",
        "infallible",
        "view",
        "appear",
        "one",
        "false",
        "moral",
        "proposition",
        "selfevidently",
        "true",
        "thus",
        "according",
        "moore",
        "possible",
        "moral",
        "proposition",
        "one",
        "intuits",
        "conflict",
        "one",
        "resolve",
        "conflict",
        "among",
        "moral",
        "principle",
        "one",
        "intuitseg",
        "regarding",
        "sort",
        "thing",
        "goodby",
        "consideration",
        "coherence",
        "intuition",
        "regarding",
        "good",
        "rejected",
        "precisely",
        "conflict",
        "intuition",
        "priori",
        "intuition",
        "play",
        "large",
        "role",
        "moore",
        "hold",
        "one",
        "attains",
        "moral",
        "knowledge",
        "exclusively",
        "carefully",
        "focusing",
        "one",
        "attention",
        "various",
        "moral",
        "proposition",
        "simply",
        "intuiting",
        "whether",
        "true"
    ]
}