{
    "main_text": "Evolutionary Metaethics || Selective Evolutionary Debunking Arguments\n4.2 Selective Evolutionary Debunking Arguments\n\nBefore leaving the topic of evolutionary debunking arguments, it\nshould be noted that in addition to the general arguments considered\nabove, which are aimed at debunking morality (or in Street’s case,\ndebunking a realist construal of morality) as a whole, there\nare also evolutionary debunking arguments meant instead just to target\na selected range of moral beliefs as epistemically suspect.\nSuch selective debunking arguments may be deployed by moral realists\nwho reject general debunking arguments in this domain but nonetheless\nwish to use similar tactics to discredit certain kinds of moral belief\nas part of advancing their own normative ethical project.\nThey might argue, for example, that while the deontological beliefs\nheld by their opponents can be successfully debunked by appeal to\nevolutionary considerations, their own utilitarian ethical beliefs are\nimmune from such debunking, stemming from autonomous rational\nreflection rather than from evolved psychological modules shaped by\nthe distorting influences of natural selection.\n\nThis is the strategy adopted by Katarzyna de Lazari-Radek and Peter\nSinger (2014) in an effort to support Sidgwick’s principle of\nUniversal Benevolence, i.e., impartial utilitarianism. That principle\nis inconsistent not only with moral egoism but with any moral\nstance that incorporates limited forms of partiality (such as special\nduties to family and friends even when not utility-maximizing, or\nconstraints against taking certain means\nwhen promoting utility, or moral permissions to favor\noneself or loved ones to some degree over strangers). So in order to\ndiscredit such competing moral views, they claim that one can tell\ndebunking evolutionary stories to ‘explain away’ these\nnon-utilitarian moral beliefs as unreliable products of distorting\nevolutionary influences: people believe such things only because\nnatural selection shaped human moral psychology in the direction of\nselfishness and at best parochial altruism, for Darwinian reasons\nhaving nothing to do with moral truth. Then, in effect, they treat the\npossibility of telling such debunking evolutionary stories as\nsufficient to undermine epistemic justification for the targeted moral\nbeliefs. At the same time, however, they maintain that their own\nfavored ethical beliefs, involving strict impartiality, are\ninvulnerable to any similar treatment, so that we can remain confident\nin the rationality of utilitarian morality.\n\nThere are reasons to doubt whether this sort of theoretically\nambitious but selective evolutionary debunking strategy is a viable or\nstable one (Kahane 2011 and 2014, Rini 2016, FitzPatrick 2017a).\nA natural worry is that if such debunking arguments really worked\nagainst opponents of utilitarianism in the manner suggested, then\nsimilar arguments could equally be deployed against\nutilitarianism if we play by the same rules. The selective\ndebunking arguments used by de Lazari-Radek and Singer give a great\ndeal of negative epistemic weight to the mere existence of possible\ndebunking explanations which, if true, would clearly pose a\nproblem for the targeted beliefs (even though it remains a wide open\nquestion whether such explanatory stories are in fact true). That is,\nthey give great weight to the mere ability to tell a plausible\ndebunking story according to which non-utilitarian moral beliefs\nwould turn out to be problematically rooted in ‘contaminated\nstarting points’ (psychological dispositions resulting from\nmorally blind evolutionary forces) that have merely been refined over\ntime by culturally conditioned causal influences operating equally\nblindly to moral truths. This raises problems for them, however,\nbecause one can easiliy enough come up with similar debunking stories\nabout utilitarian beliefs, according to which they would\nequally turn out to be problematically shaped by morally-blind\nevolutionary forces that contaminated the starting points.\n\nHere is just one way such a story could go (FitzPatrick 2017a). Recall\nthe possibility discussed in sub-sections 2.2 and 2.3, that in early\nancestral environments involving mostly small in-group interactions,\nwhere there were relatively few opportunities for ‘wasting’\naltruistic tendencies on outsiders, natural selection gave rise to\nsome fairly indiscriminate dispositions involving sympathy\nand altruism. (Or again, recall the adaptive plasticity model from\nBuchanan and Powell 2018, discussed in section 3.4, which posits\nenvironmentally sensitive inclusivist tendencies as part of evolved\nhuman psychology.) As long as such indiscriminate altruism contributed\nmore to fitness in that environment than it detracted from it through\noccasional ‘misfirings’ of such sentiments and behaviors\ndirected at non-cooperators, it could very well have evolved as a\nsimple fitness-enhancing mechanism (Kitcher 2006b). Someone who wishes\nto debunk impartial utilitarianism might then tell a story according\nto which the utilitarian’s impartial sympathy and concern is\nnothing but an extension of this evolved psychological trait, whereby\nit is systematically ‘misfiring’ (from a biological point of\nview) in our current environment. More precisely, the story would be\nthat current utilitarian beliefs represent a cultural refinement of\nsuch evolved tendencies via an application of reasoning, such\nas the consistency reasoning utilitarians employ in arguing for an\n“expanding circle” of moral concern and an increasingly\nimpartial altruism. The debunker will claim that however rational such\ninferential steps may be in themselves, they are still just operating\non certain moral starting points that are ‘contaminated’\nby evolutionary influence: namely, deeply ingrained moral intuitions\nabout the intrinsic badness of suffering wherever it occurs,\nor the goodness of pleasure, which trace back to evolved psychological\ndispositions to recoil at suffering and injury, and to feel sympathy\nfor others. Basic utilitarian moral intuitions, no less than\nnon-utilitarian intuitions, may ultimately be nothing but illusions\nfoisted on us by our evolutionary history, rooted in contaminated\nstarting points (Ruse 2006). In both cases, proponents of the moral\nviews in question have moved well beyond the original evolved\ndispositions, through culturally-developed reasoning that has refined\nthem in various ways. But if this doesn’t save non-utilitarian\nmoral beliefs given the debunking story about the contaminated\nstarting points, then it won’t save utilitarian moral beliefs\neither.\n\nNow de Lazari-Radek and Singer might reasonably wish to counter such\ndebunking attacks by claiming that even if there are such evolutionary\ninfluences at the root of their intuitions about the badness of\nsuffering or the propriety of impartial altruism, the reflection and\nreasoning that has taken place over centuries of sophisticated moral\ninquiry has not merely provided for more consistent applications of\nevolutionarily contaminated dispositions: it has instead amounted to\nthe intellectual discovery of good reasons to believe the\ncontents of utilitarian moral claims to be true. This\nphilosophical possibility certainly remains on the table and\nhasn’t been shown not to obtain simply because an aspiring\ndebunker can tell a debunking story according to which it doesn’t.\nAnd such a reply would indeed be a plausible response to the debunker,\nmaking precisely the point emphasized earlier in section 4.1, in\nresponding to general debunking arguments. The problem, however, is\nthat if they are entitled to make this response to the debunker on\nbehalf of utilitarian moral beliefs, then so are their opponents on\nbehalf of non-utilitarian moral beliefs: what’s good for the\nutilitarian goose is good for the non-utilitarian gander.\n\nIn other words, to escape evolutionary debunking themselves, it seems\nthat de Lazari-Radek and Singer will have to allow that the mere\nexistence of a possible evolutionary debunking explanation for a set\nof moral beliefs does not undermine epistemic justification for them.\nIt matters whether or not that story is actually the correct\nexplanatory story, including its claim that the beliefs in question\nare exhaustively accounted for simply in terms of the\nmorally-blind, extraneous causes in question, rather than partly\nthrough rational grasp of good reasons for believing their contents to\nbe true; and merely being able to tell a debunking story does not\nestablish such a strong claim. Once this is recognized,\nhowever, the same principle applies to just the sorts of\ndebunking arguments they have deployed against non-utilitarians, who\ncan thus avoid them in the same way.\n\nOne or more of the debunking stories could, of course, still turn out\nto be true, and they do need to be taken seriously as\npossibilities. The critical points raised here are just,\nfirst, that it is unclear whether debunking arguments really have\ncompelling force against those who haven’t already\nindependently rejected the positions being targeted (showing them that\ntheir beliefs are really bunk); and second, that it may be\nhazardous for those who reject general evolutionary debunking\narguments in ethics to attempt to use similar arguments selectively\nagainst competing normative ethical views. Such potential\nexplanations could, however, still play a supporting role within a\nbroader set of moral arguments, contributing a possible theory of\nerror helping to explain why some people may believe certain moral\nclaims or theories even though they are false.\n",
    "section_title": "4.2 Selective Evolutionary Debunking Arguments",
    "entry_title": "Morality and Evolutionary Biology",
    "hierarchy_title": "Morality and Evolutionary Biology || Evolutionary Metaethics || Selective Evolutionary Debunking Arguments",
    "tokenized_text": [
        "evolutionary",
        "metaethics",
        "selective",
        "evolutionary",
        "debunking",
        "argument",
        "selective",
        "evolutionary",
        "debunking",
        "argument",
        "leaving",
        "topic",
        "evolutionary",
        "debunking",
        "argument",
        "noted",
        "addition",
        "general",
        "argument",
        "considered",
        "aimed",
        "debunking",
        "morality",
        "street",
        "case",
        "debunking",
        "realist",
        "construal",
        "morality",
        "whole",
        "also",
        "evolutionary",
        "debunking",
        "argument",
        "meant",
        "instead",
        "target",
        "selected",
        "range",
        "moral",
        "belief",
        "epistemically",
        "suspect",
        "selective",
        "debunking",
        "argument",
        "may",
        "deployed",
        "moral",
        "realist",
        "reject",
        "general",
        "debunking",
        "argument",
        "domain",
        "nonetheless",
        "wish",
        "use",
        "similar",
        "tactic",
        "discredit",
        "certain",
        "kind",
        "moral",
        "belief",
        "part",
        "advancing",
        "normative",
        "ethical",
        "project",
        "might",
        "argue",
        "example",
        "deontological",
        "belief",
        "held",
        "opponent",
        "successfully",
        "debunked",
        "appeal",
        "evolutionary",
        "consideration",
        "utilitarian",
        "ethical",
        "belief",
        "immune",
        "debunking",
        "stemming",
        "autonomous",
        "rational",
        "reflection",
        "rather",
        "evolved",
        "psychological",
        "module",
        "shaped",
        "distorting",
        "influence",
        "natural",
        "selection",
        "strategy",
        "adopted",
        "katarzyna",
        "de",
        "lazariradek",
        "peter",
        "singer",
        "effort",
        "support",
        "sidgwick",
        "principle",
        "universal",
        "benevolence",
        "ie",
        "impartial",
        "utilitarianism",
        "principle",
        "inconsistent",
        "moral",
        "egoism",
        "moral",
        "stance",
        "incorporates",
        "limited",
        "form",
        "partiality",
        "special",
        "duty",
        "family",
        "friend",
        "even",
        "utilitymaximizing",
        "constraint",
        "taking",
        "certain",
        "mean",
        "promoting",
        "utility",
        "moral",
        "permission",
        "favor",
        "oneself",
        "loved",
        "one",
        "degree",
        "stranger",
        "order",
        "discredit",
        "competing",
        "moral",
        "view",
        "claim",
        "one",
        "tell",
        "debunking",
        "evolutionary",
        "story",
        "explain",
        "away",
        "nonutilitarian",
        "moral",
        "belief",
        "unreliable",
        "product",
        "distorting",
        "evolutionary",
        "influence",
        "people",
        "believe",
        "thing",
        "natural",
        "selection",
        "shaped",
        "human",
        "moral",
        "psychology",
        "direction",
        "selfishness",
        "best",
        "parochial",
        "altruism",
        "darwinian",
        "reason",
        "nothing",
        "moral",
        "truth",
        "effect",
        "treat",
        "possibility",
        "telling",
        "debunking",
        "evolutionary",
        "story",
        "sufficient",
        "undermine",
        "epistemic",
        "justification",
        "targeted",
        "moral",
        "belief",
        "time",
        "however",
        "maintain",
        "favored",
        "ethical",
        "belief",
        "involving",
        "strict",
        "impartiality",
        "invulnerable",
        "similar",
        "treatment",
        "remain",
        "confident",
        "rationality",
        "utilitarian",
        "morality",
        "reason",
        "doubt",
        "whether",
        "sort",
        "theoretically",
        "ambitious",
        "selective",
        "evolutionary",
        "debunking",
        "strategy",
        "viable",
        "stable",
        "one",
        "kahane",
        "rini",
        "fitzpatrick",
        "a",
        "natural",
        "worry",
        "debunking",
        "argument",
        "really",
        "worked",
        "opponent",
        "utilitarianism",
        "manner",
        "suggested",
        "similar",
        "argument",
        "could",
        "equally",
        "deployed",
        "utilitarianism",
        "play",
        "rule",
        "selective",
        "debunking",
        "argument",
        "used",
        "de",
        "lazariradek",
        "singer",
        "give",
        "great",
        "deal",
        "negative",
        "epistemic",
        "weight",
        "mere",
        "existence",
        "possible",
        "debunking",
        "explanation",
        "true",
        "would",
        "clearly",
        "pose",
        "problem",
        "targeted",
        "belief",
        "even",
        "though",
        "remains",
        "wide",
        "open",
        "question",
        "whether",
        "explanatory",
        "story",
        "fact",
        "true",
        "give",
        "great",
        "weight",
        "mere",
        "ability",
        "tell",
        "plausible",
        "debunking",
        "story",
        "according",
        "nonutilitarian",
        "moral",
        "belief",
        "would",
        "turn",
        "problematically",
        "rooted",
        "contaminated",
        "starting",
        "point",
        "psychological",
        "disposition",
        "resulting",
        "morally",
        "blind",
        "evolutionary",
        "force",
        "merely",
        "refined",
        "time",
        "culturally",
        "conditioned",
        "causal",
        "influence",
        "operating",
        "equally",
        "blindly",
        "moral",
        "truth",
        "raise",
        "problem",
        "however",
        "one",
        "easiliy",
        "enough",
        "come",
        "similar",
        "debunking",
        "story",
        "utilitarian",
        "belief",
        "according",
        "would",
        "equally",
        "turn",
        "problematically",
        "shaped",
        "morallyblind",
        "evolutionary",
        "force",
        "contaminated",
        "starting",
        "point",
        "one",
        "way",
        "story",
        "could",
        "go",
        "fitzpatrick",
        "a",
        "recall",
        "possibility",
        "discussed",
        "subsections",
        "early",
        "ancestral",
        "environment",
        "involving",
        "mostly",
        "small",
        "ingroup",
        "interaction",
        "relatively",
        "opportunity",
        "wasting",
        "altruistic",
        "tendency",
        "outsider",
        "natural",
        "selection",
        "gave",
        "rise",
        "fairly",
        "indiscriminate",
        "disposition",
        "involving",
        "sympathy",
        "altruism",
        "recall",
        "adaptive",
        "plasticity",
        "model",
        "buchanan",
        "powell",
        "discussed",
        "section",
        "posit",
        "environmentally",
        "sensitive",
        "inclusivist",
        "tendency",
        "part",
        "evolved",
        "human",
        "psychology",
        "long",
        "indiscriminate",
        "altruism",
        "contributed",
        "fitness",
        "environment",
        "detracted",
        "occasional",
        "misfirings",
        "sentiment",
        "behavior",
        "directed",
        "noncooperators",
        "could",
        "well",
        "evolved",
        "simple",
        "fitnessenhancing",
        "mechanism",
        "kitcher",
        "b",
        "someone",
        "wish",
        "debunk",
        "impartial",
        "utilitarianism",
        "might",
        "tell",
        "story",
        "according",
        "utilitarian",
        "impartial",
        "sympathy",
        "concern",
        "nothing",
        "extension",
        "evolved",
        "psychological",
        "trait",
        "whereby",
        "systematically",
        "misfiring",
        "biological",
        "point",
        "view",
        "current",
        "environment",
        "precisely",
        "story",
        "would",
        "current",
        "utilitarian",
        "belief",
        "represent",
        "cultural",
        "refinement",
        "evolved",
        "tendency",
        "via",
        "application",
        "reasoning",
        "consistency",
        "reasoning",
        "utilitarian",
        "employ",
        "arguing",
        "expanding",
        "circle",
        "moral",
        "concern",
        "increasingly",
        "impartial",
        "altruism",
        "debunker",
        "claim",
        "however",
        "rational",
        "inferential",
        "step",
        "may",
        "still",
        "operating",
        "certain",
        "moral",
        "starting",
        "point",
        "contaminated",
        "evolutionary",
        "influence",
        "namely",
        "deeply",
        "ingrained",
        "moral",
        "intuition",
        "intrinsic",
        "badness",
        "suffering",
        "wherever",
        "occurs",
        "goodness",
        "pleasure",
        "trace",
        "back",
        "evolved",
        "psychological",
        "disposition",
        "recoil",
        "suffering",
        "injury",
        "feel",
        "sympathy",
        "others",
        "basic",
        "utilitarian",
        "moral",
        "intuition",
        "le",
        "nonutilitarian",
        "intuition",
        "may",
        "ultimately",
        "nothing",
        "illusion",
        "foisted",
        "u",
        "evolutionary",
        "history",
        "rooted",
        "contaminated",
        "starting",
        "point",
        "ruse",
        "case",
        "proponent",
        "moral",
        "view",
        "question",
        "moved",
        "well",
        "beyond",
        "original",
        "evolved",
        "disposition",
        "culturallydeveloped",
        "reasoning",
        "refined",
        "various",
        "way",
        "save",
        "nonutilitarian",
        "moral",
        "belief",
        "given",
        "debunking",
        "story",
        "contaminated",
        "starting",
        "point",
        "save",
        "utilitarian",
        "moral",
        "belief",
        "either",
        "de",
        "lazariradek",
        "singer",
        "might",
        "reasonably",
        "wish",
        "counter",
        "debunking",
        "attack",
        "claiming",
        "even",
        "evolutionary",
        "influence",
        "root",
        "intuition",
        "badness",
        "suffering",
        "propriety",
        "impartial",
        "altruism",
        "reflection",
        "reasoning",
        "taken",
        "place",
        "century",
        "sophisticated",
        "moral",
        "inquiry",
        "merely",
        "provided",
        "consistent",
        "application",
        "evolutionarily",
        "contaminated",
        "disposition",
        "instead",
        "amounted",
        "intellectual",
        "discovery",
        "good",
        "reason",
        "believe",
        "content",
        "utilitarian",
        "moral",
        "claim",
        "true",
        "philosophical",
        "possibility",
        "certainly",
        "remains",
        "table",
        "shown",
        "obtain",
        "simply",
        "aspiring",
        "debunker",
        "tell",
        "debunking",
        "story",
        "according",
        "reply",
        "would",
        "indeed",
        "plausible",
        "response",
        "debunker",
        "making",
        "precisely",
        "point",
        "emphasized",
        "earlier",
        "section",
        "responding",
        "general",
        "debunking",
        "argument",
        "problem",
        "however",
        "entitled",
        "make",
        "response",
        "debunker",
        "behalf",
        "utilitarian",
        "moral",
        "belief",
        "opponent",
        "behalf",
        "nonutilitarian",
        "moral",
        "belief",
        "good",
        "utilitarian",
        "goose",
        "good",
        "nonutilitarian",
        "gander",
        "word",
        "escape",
        "evolutionary",
        "debunking",
        "seems",
        "de",
        "lazariradek",
        "singer",
        "allow",
        "mere",
        "existence",
        "possible",
        "evolutionary",
        "debunking",
        "explanation",
        "set",
        "moral",
        "belief",
        "undermine",
        "epistemic",
        "justification",
        "matter",
        "whether",
        "story",
        "actually",
        "correct",
        "explanatory",
        "story",
        "including",
        "claim",
        "belief",
        "question",
        "exhaustively",
        "accounted",
        "simply",
        "term",
        "morallyblind",
        "extraneous",
        "cause",
        "question",
        "rather",
        "partly",
        "rational",
        "grasp",
        "good",
        "reason",
        "believing",
        "content",
        "true",
        "merely",
        "able",
        "tell",
        "debunking",
        "story",
        "establish",
        "strong",
        "claim",
        "recognized",
        "however",
        "principle",
        "applies",
        "sort",
        "debunking",
        "argument",
        "deployed",
        "nonutilitarians",
        "thus",
        "avoid",
        "way",
        "one",
        "debunking",
        "story",
        "could",
        "course",
        "still",
        "turn",
        "true",
        "need",
        "taken",
        "seriously",
        "possibility",
        "critical",
        "point",
        "raised",
        "first",
        "unclear",
        "whether",
        "debunking",
        "argument",
        "really",
        "compelling",
        "force",
        "already",
        "independently",
        "rejected",
        "position",
        "targeted",
        "showing",
        "belief",
        "really",
        "bunk",
        "second",
        "may",
        "hazardous",
        "reject",
        "general",
        "evolutionary",
        "debunking",
        "argument",
        "ethic",
        "attempt",
        "use",
        "similar",
        "argument",
        "selectively",
        "competing",
        "normative",
        "ethical",
        "view",
        "potential",
        "explanation",
        "could",
        "however",
        "still",
        "play",
        "supporting",
        "role",
        "within",
        "broader",
        "set",
        "moral",
        "argument",
        "contributing",
        "possible",
        "theory",
        "error",
        "helping",
        "explain",
        "people",
        "may",
        "believe",
        "certain",
        "moral",
        "claim",
        "theory",
        "even",
        "though",
        "false"
    ]
}