{
    "main_text": "Problems for Contributory Principles\n5. Problems for Contributory Principles\n\n\nThe best form of generalism, therefore, probably tries to do the whole\nthing in terms of contributory principles—principles that\nspecify considerations that always count as contributory reasons. In\nthis picture it is quite possible for there to be reasons on both\nsides. The classic example of such a theory is W. D. Ross’s theory of\nPrima Facie Duties (Ross 1930, ch. 2). This is just an attempt to\nput into good theoretical order our untutored intuitions that there\nare many different sorts of things that can make a difference to how\nwe should act. There is a principle that says ‘Be just’,\nbut this does not mean that all just actions are in fact right; it\nonly means that the justness of an action counts in its favour, or\nthat an action is the better for being just. Sadly, an action can be\njust but still wrong for other reasons. This means that it can\nsometimes be morally required of us that we act unjustly. If it is,\nthere will be features of the situation that require it of us; perhaps\nwe owe an enormous debt of gratitude, or perhaps by this unjust action\nwe can save Holland from flooding.\n\n\nThe generalist who takes this line supposes, qua generalist,\nthat a feature that makes a difference in one case will make the same\nsort of difference in every case, and that there will be a\ncontributory principle specifying its regular contribution. This is\nwhat particularism is concerned to rebut. Particularists applaud\nRoss’s insistence that there can be many features of the situation\neach of which makes some difference to how one should act; they merely\nwant to say that the matter is not regular in the way that Ross, as a\ngeneralist, supposes. They have three points to make, then. The first\ninvolves producing counter-examples to suggested regular contributors.\nRoss supposes, for instance, in accordance with long tradition, that\nthe fact that one has promised to do something is always some\nreason to do it. A counter-example to this claim would be a case\nwhere, for peculiar reasons no doubt, the fact that one has promised\nto do something is either no reason to do it or even a reason not to\ndo it.  Suppose, for instance, that I have promised not to keep my\nnext three promises; what then? Again, does one always have at least\nsome reason to tell the truth? A little bit of ingenuity enables one\nto come up with a case in which the fact that this is true is a reason\nnot to say it. And so on.\n\n\nThe second prong of the particularist attack is to ask why we should\nsuppose that a feature that counts in favour in one case must count\nthe same way wherever it appears. To this question, I think, no real\nanswer has been produced. Generalists tend to point out that if one\nclaims that a feature counts in favour here and against there, one has\nsomething to explain. But the particularist is happy to admit this. It\nis true that if a feature counts in favour in one case and against in\nanother broadly similar case, there must be an explanation of how this\ncan be. That explanation will presumably be given by pointing to other\ndifferences between the cases. In the second case, perhaps, something\nthat is required for the feature to count in favour is in fact absent,\nthough it was present in the first case. Such explanations must be\navailable, and they can be found. None of this does anything to\nrestore a generalist conception of how reasons function.\n\n\nThe third prong of attack on contributory generalism involves asking\nfor an appropriate epistemology. How are we to tell, from what we can\ndiscern case by case, that this feature will function in the same way\nwherever else it appears? Ross, our paradigm generalist, holds that we\nstart with the recognition that this feature counts in favour here,\nbut that we can immediately tell (by a process which he calls\n‘intuitive induction’) that it must count in favour\neverywhere. The question is how this is supposed to work. What is it\nthat is discernible in one case and tells us that what we have here\nmust repeat in all other cases? (Ross rightly does not suppose that we\nlearn our moral principles by ordinary induction.) The standard, and\nprobably the only, answer to this question is wrong. This answer\namounts to an account of what it is to make a difference in a\nparticular case—what it is to be relevant here. That account\nunderstands a feature as relevant here if and only if, in any case\nwhere it is the only relevant feature, it would decide the\nissue. Now if this account of particular relevance were\ndefensible, we would indeed have some reason to suppose that what is\nrelevant here would be relevant in any other situation. For on each\nfurther situation it will still be true that if it were the only\nrelevant feature, it would decide the issue. So relevance is indeed\ngeneral relevance, on this showing. And this gives the generalist the\nepistemology he needs, for it is now easy to see how, in discerning\nthat this feature matters here, we immediately see that it would make\nthe same difference on every occurrence. For it is true of it on each\noccurrence that if it were the only relevant feature, it would decide\nthe issue.\n\n\nSadly, the account of relevance that this all depends on is not\ndefensible. It is, after all, true of any feature whatever that if it\nwere the only relevant feature, it would decide the issue. The word\n‘relevant’ appears within this formulation, and it cannot\nbe removed.  For if we said merely that if this feature were the\nonly feature, it would decide the issue, we would have said\nsomething that is probably both false and, worse, incoherent. It would\nbe incoherent because the idea that a feature could be present alone,\nwithout any other features whatever, is surely nonsense. The idea that\nan action could be merely kind, say, without having any other\nfeatures at all, makes no sense at all. Further, there may be some\nfeatures that can only be relevant if some other feature is also\nrelevant—features that (in terms of reasons) only give us\nreasons if some other feature is giving us reasons as well. For\ninstance, in the Prisoner’s Dilemma one prisoner only has reasons if\nthe other one does. If this can occur, any ‘isolation\ntest’ for reasons must miss some reasons out. Finally, trying to\nisolate the contribution of a feature by asking how things would have\nbeen if no other feature had made any contribution is, when one comes\nto think of it, a rather peculiar enterprise. It is uncomfortably like\ntrying to determine the contribution made by one football player to\nhis team’s success today by asking how things would have been if there\nhad been no other players on the field. So the notion of relevance\nthat is required as a basis for generalist epistemology is\nunacceptable.\n",
    "section_title": "5. Problems for Contributory Principles",
    "entry_title": "Moral Particularism",
    "hierarchy_title": "Moral Particularism || Problems for Contributory Principles",
    "tokenized_text": [
        "problem",
        "contributory",
        "principle",
        "problem",
        "contributory",
        "principle",
        "best",
        "form",
        "generalism",
        "therefore",
        "probably",
        "try",
        "whole",
        "thing",
        "term",
        "contributory",
        "principlesprinciples",
        "specify",
        "consideration",
        "always",
        "count",
        "contributory",
        "reason",
        "picture",
        "quite",
        "possible",
        "reason",
        "side",
        "classic",
        "example",
        "theory",
        "w",
        "d",
        "ross",
        "theory",
        "prima",
        "facie",
        "duty",
        "ross",
        "ch",
        "attempt",
        "put",
        "good",
        "theoretical",
        "order",
        "untutored",
        "intuition",
        "many",
        "different",
        "sort",
        "thing",
        "make",
        "difference",
        "act",
        "principle",
        "say",
        "mean",
        "action",
        "fact",
        "right",
        "mean",
        "justness",
        "action",
        "count",
        "favour",
        "action",
        "better",
        "sadly",
        "action",
        "still",
        "wrong",
        "reason",
        "mean",
        "sometimes",
        "morally",
        "required",
        "u",
        "act",
        "unjustly",
        "feature",
        "situation",
        "require",
        "u",
        "perhaps",
        "owe",
        "enormous",
        "debt",
        "gratitude",
        "perhaps",
        "unjust",
        "action",
        "save",
        "holland",
        "flooding",
        "generalist",
        "take",
        "line",
        "supposes",
        "qua",
        "generalist",
        "feature",
        "make",
        "difference",
        "one",
        "case",
        "make",
        "sort",
        "difference",
        "every",
        "case",
        "contributory",
        "principle",
        "specifying",
        "regular",
        "contribution",
        "particularism",
        "concerned",
        "rebut",
        "particularists",
        "applaud",
        "ross",
        "insistence",
        "many",
        "feature",
        "situation",
        "make",
        "difference",
        "one",
        "act",
        "merely",
        "want",
        "say",
        "matter",
        "regular",
        "way",
        "ross",
        "generalist",
        "supposes",
        "three",
        "point",
        "make",
        "first",
        "involves",
        "producing",
        "counterexamples",
        "suggested",
        "regular",
        "contributor",
        "ross",
        "supposes",
        "instance",
        "accordance",
        "long",
        "tradition",
        "fact",
        "one",
        "promised",
        "something",
        "always",
        "reason",
        "counterexample",
        "claim",
        "would",
        "case",
        "peculiar",
        "reason",
        "doubt",
        "fact",
        "one",
        "promised",
        "something",
        "either",
        "reason",
        "even",
        "reason",
        "suppose",
        "instance",
        "promised",
        "keep",
        "next",
        "three",
        "promise",
        "one",
        "always",
        "least",
        "reason",
        "tell",
        "truth",
        "little",
        "bit",
        "ingenuity",
        "enables",
        "one",
        "come",
        "case",
        "fact",
        "true",
        "reason",
        "say",
        "second",
        "prong",
        "particularist",
        "attack",
        "ask",
        "suppose",
        "feature",
        "count",
        "favour",
        "one",
        "case",
        "must",
        "count",
        "way",
        "wherever",
        "appears",
        "question",
        "think",
        "real",
        "answer",
        "produced",
        "generalist",
        "tend",
        "point",
        "one",
        "claim",
        "feature",
        "count",
        "favour",
        "one",
        "something",
        "explain",
        "particularist",
        "happy",
        "admit",
        "true",
        "feature",
        "count",
        "favour",
        "one",
        "case",
        "another",
        "broadly",
        "similar",
        "case",
        "must",
        "explanation",
        "explanation",
        "presumably",
        "given",
        "pointing",
        "difference",
        "case",
        "second",
        "case",
        "perhaps",
        "something",
        "required",
        "feature",
        "count",
        "favour",
        "fact",
        "absent",
        "though",
        "present",
        "first",
        "case",
        "explanation",
        "must",
        "available",
        "found",
        "none",
        "anything",
        "restore",
        "generalist",
        "conception",
        "reason",
        "function",
        "third",
        "prong",
        "attack",
        "contributory",
        "generalism",
        "involves",
        "asking",
        "appropriate",
        "epistemology",
        "tell",
        "discern",
        "case",
        "case",
        "feature",
        "function",
        "way",
        "wherever",
        "else",
        "appears",
        "ross",
        "paradigm",
        "generalist",
        "hold",
        "start",
        "recognition",
        "feature",
        "count",
        "favour",
        "immediately",
        "tell",
        "process",
        "call",
        "intuitive",
        "induction",
        "must",
        "count",
        "favour",
        "everywhere",
        "question",
        "supposed",
        "work",
        "discernible",
        "one",
        "case",
        "tell",
        "u",
        "must",
        "repeat",
        "case",
        "ross",
        "rightly",
        "suppose",
        "learn",
        "moral",
        "principle",
        "ordinary",
        "induction",
        "standard",
        "probably",
        "answer",
        "question",
        "wrong",
        "answer",
        "amount",
        "account",
        "make",
        "difference",
        "particular",
        "casewhat",
        "relevant",
        "account",
        "understands",
        "feature",
        "relevant",
        "case",
        "relevant",
        "feature",
        "would",
        "decide",
        "issue",
        "account",
        "particular",
        "relevance",
        "defensible",
        "would",
        "indeed",
        "reason",
        "suppose",
        "relevant",
        "would",
        "relevant",
        "situation",
        "situation",
        "still",
        "true",
        "relevant",
        "feature",
        "would",
        "decide",
        "issue",
        "relevance",
        "indeed",
        "general",
        "relevance",
        "showing",
        "give",
        "generalist",
        "epistemology",
        "need",
        "easy",
        "see",
        "discerning",
        "feature",
        "matter",
        "immediately",
        "see",
        "would",
        "make",
        "difference",
        "every",
        "occurrence",
        "true",
        "occurrence",
        "relevant",
        "feature",
        "would",
        "decide",
        "issue",
        "sadly",
        "account",
        "relevance",
        "depends",
        "defensible",
        "true",
        "feature",
        "whatever",
        "relevant",
        "feature",
        "would",
        "decide",
        "issue",
        "word",
        "relevant",
        "appears",
        "within",
        "formulation",
        "removed",
        "said",
        "merely",
        "feature",
        "feature",
        "would",
        "decide",
        "issue",
        "would",
        "said",
        "something",
        "probably",
        "false",
        "worse",
        "incoherent",
        "would",
        "incoherent",
        "idea",
        "feature",
        "could",
        "present",
        "alone",
        "without",
        "feature",
        "whatever",
        "surely",
        "nonsense",
        "idea",
        "action",
        "could",
        "merely",
        "kind",
        "say",
        "without",
        "feature",
        "make",
        "sense",
        "may",
        "feature",
        "relevant",
        "feature",
        "also",
        "relevantfeatures",
        "term",
        "reason",
        "give",
        "u",
        "reason",
        "feature",
        "giving",
        "u",
        "reason",
        "well",
        "instance",
        "prisoner",
        "dilemma",
        "one",
        "prisoner",
        "reason",
        "one",
        "occur",
        "isolation",
        "test",
        "reason",
        "must",
        "miss",
        "reason",
        "finally",
        "trying",
        "isolate",
        "contribution",
        "feature",
        "asking",
        "thing",
        "would",
        "feature",
        "made",
        "contribution",
        "one",
        "come",
        "think",
        "rather",
        "peculiar",
        "enterprise",
        "uncomfortably",
        "like",
        "trying",
        "determine",
        "contribution",
        "made",
        "one",
        "football",
        "player",
        "team",
        "success",
        "today",
        "asking",
        "thing",
        "would",
        "player",
        "field",
        "notion",
        "relevance",
        "required",
        "basis",
        "generalist",
        "epistemology",
        "unacceptable"
    ]
}