{
    "main_text": "Music and the Emotions || Emotions in the Music\n3.1 Emotions in the Music\n\nPieces of music, and performances of them, are standardly said to be\nhappy, sad, and so on. Music’s emotional expressiveness is a\nphilosophical problem since the paradigm expressers of emotions are\npsychological agents, who have emotions to express. Neither pieces of\nmusic, nor performances of them, are psychological agents, thus it is\npuzzling that such things could be said to express emotions.\n\nOne radical way to solve the puzzle is to deny that music is\nemotionally expressive. A major burden of such eliminativism is\nto explain away the widespread tendency to describe music in emotional\nterms. This has been attempted by arguing that such descriptions are\nshorthand or metaphor for purely sonic features (Urmson 1973), basic\ndynamic features (Hanslick 1854), purely musical features (Sharpe\n1982), or aesthetic properties (Zangwill 2007). There are many\nproblems with such views. For one thing, they seem committed to some\nsort of scheme for reduction of expressive predicates to other terms,\nsuch as sonic or musical ones, and such a scheme is difficult to\nimagine (Budd 1985a: 31–6). For another, anyone not drawn to\nthis theory is likely to reject the claim that the paraphrase captures\nall that is of interest and value about the passage described,\nprecisely because it omits the expressive predicates (Davies 1994:\n153–4).\n\nConventionalism is the view that music’s expressiveness\nis a matter of the conventional association of certain musical\nelements, such as slow tempi, with certain emotional states, such as\nsadness. Such conventions must play a role in some cases of\nexpression—for instance, cases of particular musical instruments\n(e.g., the snare drum) being associated with particular situations\n(e.g., war) and thus emotions (e.g., foreboding). But such conventions\nseem unlikely to account for all musical expressiveness, since much of\nthat expressiveness seems less arbitrary than conventionalism would\nsuggest. It seems implausible, for instance, that the convention for\nfuneral dirges might just as easily have that they should be\nquick-paced and in major keys. Even in cases like the snare drum, it\nseems possible that the instrument was chosen for the battlefield in\npart because of the expressive character of its sonic profile.\n\nThe cliché that music is “the language of the\nemotions” is often considered as a possible starting point for a\ntheory of musical expressiveness. The idea combines the attractive\nsimplicity of conventionalism with the formalist notion that\nmusic’s order is to be understood in terms of syntax. (See\nLerdahl & Jackendoff 1983 for a theory along the latter lines.)\nHowever, although Deryck Cooke (1959) and Leonard Meyer (1956) are\noften cited as proponents, it is not clear that anyone holds a\nfull-blown version of the theory. The central problem is the great\ndisparities between language and music, in terms of the ways in which\neach is both syntactic and semantic (Jackendoff 2011). A serious\nsubsidiary problem is that even if music were about the\nemotions in the way that language can be, that would not account for\nmusic’s expressiveness. The sentence “I am\nsad” is about the emotions, but it is not expressive of\nsadness in the way a sad face is, though you could use either to\nexpress your sadness. Most people agree that music’s relation to\nemotion is more like that of a sad face than that of a sentence. (This\nlast criticism is also applicable to Susanne Langer’s theory\n(1953) that music is about the emotions in a symbolic yet\nnon-linguistic way.)\n\nWe now turn to theories that attempt to connect the notion of\nmusic’s expressiveness to actual felt emotions. One obvious way\nto do so is to argue that pieces of music or performances of them are\nexpressions of such emotions—those of the composer or performer.\nThere are two major problems with this “expression\ntheory.” The first is that neither composers nor performers\noften experience the emotions their music is expressive of as it is\nproduced. Nor does it seem unlikely that a composer could create, or a\nperformer perform, a piece expressive of an emotion that she had never\nexperienced. This is not to deny that a composer could write a piece\nexpressive of her emotional state, but for the expression theory to be\nan account of musical expressiveness, at least all central cases of\nexpressiveness must follow this model, which is not the case.\nMoreover, if a composer is to express her sadness, say, by writing a\nsad piece, she must pen the right kind of piece. In other words, if\nshe is a bad composer she might fail to express her emotion. This\nbrings us to the second major problem for the expression theory. If a\ncomposer can fail to express her emotions in a piece, then the music\nshe writes is expressive independent of the emotion she is\nexperiencing. Thus music’s expressiveness cannot be explained in\nterms of direct expression.\n\nThose usually cited as classic expression theorists include Tolstoy\n(1898), Dewey (1934), and Collingwood (1938). (A classic critique is\nTormey 1971: 97–127.) These theorists have been defended in\nrecent discussions, however, from accusations that they hold the\nsimple view outlined above (Ridley 2003, Robinson 2005: 229–57).\nJenefer Robinson has attempted to revive the expression theory, though\nshe defends it as an interesting and valuable use of\nmusic’s expressiveness, rather than an account of expressiveness\nitself (2005: 229–347; 2011).\n\nA second way to link music’s expressiveness with actual felt\nemotions is through the audience. According to arousalism, the\nexpressiveness of a passage of music amounts to its tendency to arouse\nthat emotion in a competent listener. Arousalism faces several\nobjections. First, some competent listeners seem emotionally unmoved\nby music (or are at least not moved to the specific emotions expressed\nby it). But perhaps the arousalist can simply restrict the class of\nlistener to which his theory appeals to those who are so moved.\nSecond, some emotions, such as fear, require a particular kind of\nintentional object (something threatening), yet there is no such\nobject at hand when we hear fearful music. Thus it seems implausible\nto claim the music’s fearfulness resides in its arousal of fear\nin us. But perhaps the arousalist can broaden the class of aroused\nemotions to include appropriate responses to the expressed\nemotion, such as pity. Third, in many cases it seems that listeners\nrespond emotionally to the expressiveness of the music. It is not\nclear that the arousalist can handle such cases non-circularly. (A\nsophisticated defense of the arousal theory is to be found in\nMatravers 1998: 145–224, though see the second thoughts in\nMatravers 2011. For an extended critique, see S. Davies 1994:\n104–200.)\n\nDespite the problems of the arousal theory as the whole story of\nmusical expressiveness, there is a growing consensus, thanks largely\nto the work of Jenefer Robinson (1994, 2005), that our lower-level,\nless cognitive responses to music must play some role in the emotional\nexpressiveness we attribute to it. However, this role is likely to be\na causal one, rather than part of an analysis of what it is for music\nto be emotionally expressive.\n\nSeveral theorists have defended accounts of musical expressiveness\nknown variously as resemblance, contour, or\nappearance theories (e.g., Kivy 1989, though see Kivy 2002:\n31–48 for recent qualms; Budd 1995: 133–54; S. Davies\n1994: 221–67). The central idea is that music’s\nexpressiveness consists in the resemblance between its dynamic\ncharacter and that of various typical aspects of people experiencing\nemotions. The aspects appealed to include the phenomenology of the\nexperience of the emotion, the emotion’s facial expression, the\ncontour of vocal expression or bodily behavior of a person\nexperiencing the emotion. Stephen Davies argues that such theories\nhold music to be expressive in a literal albeit secondary sense of the\nterm. We say that a piece of music is sad in the same sense in which\nwe say that a weeping willow is sad (S. Davies 2006: 183). Such uses\nare no more metaphorical than a claim that a chair has arms.\n\nJerrold Levinson agrees that there is an important resemblance between\nthe contour of music expressive of an emotion and the contour of\ntypical behavioral expressions of that emotion. He objects, however,\nthat such an account cannot be the whole, or even the most fundamental\npart of the story (Levinson 1996a, 2006b). He drives in a wedge\nprecisely at the point where an appeal is made to the resemblance\nbetween the music and typical behavioral expressions. He asks what the\nmanner and extent of the resemblance between the two must be,\nprecisely, in order for the music to count as expressive of some\nemotion. After all, everything resembles everything else in all sorts\nof ways, and so one could point out many resemblances between a\nfuneral march and an expression of joy, or for that matter a cup of\ncoffee and sadness. The resemblance theorist must give some account of\nwhy the funeral march, and not the cup of coffee, is expressive of\nsadness and not joy. Levinson claims that the obvious answer here is\nthat the funeral march is “readily hearable as” an\nexpression of sadness. If this is correct, then the resemblance the\nmusic bears to emotional behavior is logically secondary—a cause\nor ground of its expressiveness. The expressiveness itself resides in\nthe music’s disposition to elicit the imaginative response in us\nof hearing the music as a literal expression of emotion. As a logical\nconsequence, the imaginative experience prompted must include some\nagent whose expression the music literally is.\n\nIn reply to this kind of objection, Stephen Davies has emphasized the\nrole of the listener’s response in resemblance theories. Such\nresponses have always been appealed to by such theories, as evidenced\nby Malcolm Budd’s talk of “hearing as” (1995:\n135–7), and Peter Kivy’s discussion of our tendency to\n“animate” that which we perceive (1980: 57–9). But\nDavies now makes the appeal quite explicit and central, devoting as\nmuch space to explication of the response-dependent nature of\nexpressiveness as to the role of resemblance (2006). For Davies, the\nresponse of the competent listener upon which the expressiveness of\nthe music depends is one of an experience of resemblance\nrather than imagined expression (2006: 181–2). Matteo Ravasio\n(2019b) argues that this leads to further problems.\n\nSince Davies’s theory posits at base a contour-recognition\nexperience while Levinson’s posits an imaginative experience of\nexpression, the link between literal expression and musical\nexpressiveness looks closer in Levinson’s theory than in\nDavies’s. An empirical consequence seems to be that\nDavies’s theory will predict weaker emotional responses to music\nthan Levinson’s. Whether or not this is an advantage or\ndisadvantage of the theory depends on the empirical facts about how we\nrespond emotionally to music.\n",
    "section_title": "3.1 Emotions in the Music",
    "entry_title": "The Philosophy of Music",
    "hierarchy_title": "The Philosophy of Music || Music and the Emotions || Emotions in the Music",
    "tokenized_text": [
        "music",
        "emotion",
        "emotion",
        "music",
        "emotion",
        "music",
        "piece",
        "music",
        "performance",
        "standardly",
        "said",
        "happy",
        "sad",
        "music",
        "emotional",
        "expressiveness",
        "philosophical",
        "problem",
        "since",
        "paradigm",
        "expressers",
        "emotion",
        "psychological",
        "agent",
        "emotion",
        "express",
        "neither",
        "piece",
        "music",
        "performance",
        "psychological",
        "agent",
        "thus",
        "puzzling",
        "thing",
        "could",
        "said",
        "express",
        "emotion",
        "one",
        "radical",
        "way",
        "solve",
        "puzzle",
        "deny",
        "music",
        "emotionally",
        "expressive",
        "major",
        "burden",
        "eliminativism",
        "explain",
        "away",
        "widespread",
        "tendency",
        "describe",
        "music",
        "emotional",
        "term",
        "attempted",
        "arguing",
        "description",
        "shorthand",
        "metaphor",
        "purely",
        "sonic",
        "feature",
        "urmson",
        "basic",
        "dynamic",
        "feature",
        "hanslick",
        "purely",
        "musical",
        "feature",
        "sharpe",
        "aesthetic",
        "property",
        "zangwill",
        "many",
        "problem",
        "view",
        "one",
        "thing",
        "seem",
        "committed",
        "sort",
        "scheme",
        "reduction",
        "expressive",
        "predicate",
        "term",
        "sonic",
        "musical",
        "one",
        "scheme",
        "difficult",
        "imagine",
        "budd",
        "a",
        "another",
        "anyone",
        "drawn",
        "theory",
        "likely",
        "reject",
        "claim",
        "paraphrase",
        "capture",
        "interest",
        "value",
        "passage",
        "described",
        "precisely",
        "omits",
        "expressive",
        "predicate",
        "davy",
        "conventionalism",
        "view",
        "music",
        "expressiveness",
        "matter",
        "conventional",
        "association",
        "certain",
        "musical",
        "element",
        "slow",
        "tempo",
        "certain",
        "emotional",
        "state",
        "sadness",
        "convention",
        "must",
        "play",
        "role",
        "case",
        "expressionfor",
        "instance",
        "case",
        "particular",
        "musical",
        "instrument",
        "eg",
        "snare",
        "drum",
        "associated",
        "particular",
        "situation",
        "eg",
        "war",
        "thus",
        "emotion",
        "eg",
        "foreboding",
        "convention",
        "seem",
        "unlikely",
        "account",
        "musical",
        "expressiveness",
        "since",
        "much",
        "expressiveness",
        "seems",
        "le",
        "arbitrary",
        "conventionalism",
        "would",
        "suggest",
        "seems",
        "implausible",
        "instance",
        "convention",
        "funeral",
        "dirge",
        "might",
        "easily",
        "quickpaced",
        "major",
        "key",
        "even",
        "case",
        "like",
        "snare",
        "drum",
        "seems",
        "possible",
        "instrument",
        "chosen",
        "battlefield",
        "part",
        "expressive",
        "character",
        "sonic",
        "profile",
        "cliché",
        "music",
        "language",
        "emotion",
        "often",
        "considered",
        "possible",
        "starting",
        "point",
        "theory",
        "musical",
        "expressiveness",
        "idea",
        "combine",
        "attractive",
        "simplicity",
        "conventionalism",
        "formalist",
        "notion",
        "music",
        "order",
        "understood",
        "term",
        "syntax",
        "see",
        "lerdahl",
        "jackendoff",
        "theory",
        "along",
        "latter",
        "line",
        "however",
        "although",
        "deryck",
        "cooke",
        "leonard",
        "meyer",
        "often",
        "cited",
        "proponent",
        "clear",
        "anyone",
        "hold",
        "fullblown",
        "version",
        "theory",
        "central",
        "problem",
        "great",
        "disparity",
        "language",
        "music",
        "term",
        "way",
        "syntactic",
        "semantic",
        "jackendoff",
        "serious",
        "subsidiary",
        "problem",
        "even",
        "music",
        "emotion",
        "way",
        "language",
        "would",
        "account",
        "music",
        "expressiveness",
        "sentence",
        "sad",
        "emotion",
        "expressive",
        "sadness",
        "way",
        "sad",
        "face",
        "though",
        "could",
        "use",
        "either",
        "express",
        "sadness",
        "people",
        "agree",
        "music",
        "relation",
        "emotion",
        "like",
        "sad",
        "face",
        "sentence",
        "last",
        "criticism",
        "also",
        "applicable",
        "susanne",
        "langer",
        "theory",
        "music",
        "emotion",
        "symbolic",
        "yet",
        "nonlinguistic",
        "way",
        "turn",
        "theory",
        "attempt",
        "connect",
        "notion",
        "music",
        "expressiveness",
        "actual",
        "felt",
        "emotion",
        "one",
        "obvious",
        "way",
        "argue",
        "piece",
        "music",
        "performance",
        "expression",
        "emotionsthose",
        "composer",
        "performer",
        "two",
        "major",
        "problem",
        "expression",
        "theory",
        "first",
        "neither",
        "composer",
        "performer",
        "often",
        "experience",
        "emotion",
        "music",
        "expressive",
        "produced",
        "seem",
        "unlikely",
        "composer",
        "could",
        "create",
        "performer",
        "perform",
        "piece",
        "expressive",
        "emotion",
        "never",
        "experienced",
        "deny",
        "composer",
        "could",
        "write",
        "piece",
        "expressive",
        "emotional",
        "state",
        "expression",
        "theory",
        "account",
        "musical",
        "expressiveness",
        "least",
        "central",
        "case",
        "expressiveness",
        "must",
        "follow",
        "model",
        "case",
        "moreover",
        "composer",
        "express",
        "sadness",
        "say",
        "writing",
        "sad",
        "piece",
        "must",
        "pen",
        "right",
        "kind",
        "piece",
        "word",
        "bad",
        "composer",
        "might",
        "fail",
        "express",
        "emotion",
        "brings",
        "u",
        "second",
        "major",
        "problem",
        "expression",
        "theory",
        "composer",
        "fail",
        "express",
        "emotion",
        "piece",
        "music",
        "writes",
        "expressive",
        "independent",
        "emotion",
        "experiencing",
        "thus",
        "music",
        "expressiveness",
        "explained",
        "term",
        "direct",
        "expression",
        "usually",
        "cited",
        "classic",
        "expression",
        "theorist",
        "include",
        "tolstoy",
        "dewey",
        "collingwood",
        "classic",
        "critique",
        "tormey",
        "theorist",
        "defended",
        "recent",
        "discussion",
        "however",
        "accusation",
        "hold",
        "simple",
        "view",
        "outlined",
        "ridley",
        "robinson",
        "jenefer",
        "robinson",
        "attempted",
        "revive",
        "expression",
        "theory",
        "though",
        "defends",
        "interesting",
        "valuable",
        "use",
        "music",
        "expressiveness",
        "rather",
        "account",
        "expressiveness",
        "second",
        "way",
        "link",
        "music",
        "expressiveness",
        "actual",
        "felt",
        "emotion",
        "audience",
        "according",
        "arousalism",
        "expressiveness",
        "passage",
        "music",
        "amount",
        "tendency",
        "arouse",
        "emotion",
        "competent",
        "listener",
        "arousalism",
        "face",
        "several",
        "objection",
        "first",
        "competent",
        "listener",
        "seem",
        "emotionally",
        "unmoved",
        "music",
        "least",
        "moved",
        "specific",
        "emotion",
        "expressed",
        "perhaps",
        "arousalist",
        "simply",
        "restrict",
        "class",
        "listener",
        "theory",
        "appeal",
        "moved",
        "second",
        "emotion",
        "fear",
        "require",
        "particular",
        "kind",
        "intentional",
        "object",
        "something",
        "threatening",
        "yet",
        "object",
        "hand",
        "hear",
        "fearful",
        "music",
        "thus",
        "seems",
        "implausible",
        "claim",
        "music",
        "fearfulness",
        "resides",
        "arousal",
        "fear",
        "u",
        "perhaps",
        "arousalist",
        "broaden",
        "class",
        "aroused",
        "emotion",
        "include",
        "appropriate",
        "response",
        "expressed",
        "emotion",
        "pity",
        "third",
        "many",
        "case",
        "seems",
        "listener",
        "respond",
        "emotionally",
        "expressiveness",
        "music",
        "clear",
        "arousalist",
        "handle",
        "case",
        "noncircularly",
        "sophisticated",
        "defense",
        "arousal",
        "theory",
        "found",
        "matravers",
        "though",
        "see",
        "second",
        "thought",
        "matravers",
        "extended",
        "critique",
        "see",
        "s",
        "davy",
        "despite",
        "problem",
        "arousal",
        "theory",
        "whole",
        "story",
        "musical",
        "expressiveness",
        "growing",
        "consensus",
        "thanks",
        "largely",
        "work",
        "jenefer",
        "robinson",
        "lowerlevel",
        "le",
        "cognitive",
        "response",
        "music",
        "must",
        "play",
        "role",
        "emotional",
        "expressiveness",
        "attribute",
        "however",
        "role",
        "likely",
        "causal",
        "one",
        "rather",
        "part",
        "analysis",
        "music",
        "emotionally",
        "expressive",
        "several",
        "theorist",
        "defended",
        "account",
        "musical",
        "expressiveness",
        "known",
        "variously",
        "resemblance",
        "contour",
        "appearance",
        "theory",
        "eg",
        "kivy",
        "though",
        "see",
        "kivy",
        "recent",
        "qualm",
        "budd",
        "s",
        "davy",
        "central",
        "idea",
        "music",
        "expressiveness",
        "consists",
        "resemblance",
        "dynamic",
        "character",
        "various",
        "typical",
        "aspect",
        "people",
        "experiencing",
        "emotion",
        "aspect",
        "appealed",
        "include",
        "phenomenology",
        "experience",
        "emotion",
        "emotion",
        "facial",
        "expression",
        "contour",
        "vocal",
        "expression",
        "bodily",
        "behavior",
        "person",
        "experiencing",
        "emotion",
        "stephen",
        "davy",
        "argues",
        "theory",
        "hold",
        "music",
        "expressive",
        "literal",
        "albeit",
        "secondary",
        "sense",
        "term",
        "say",
        "piece",
        "music",
        "sad",
        "sense",
        "say",
        "weeping",
        "willow",
        "sad",
        "s",
        "davy",
        "us",
        "metaphorical",
        "claim",
        "chair",
        "arm",
        "jerrold",
        "levinson",
        "agrees",
        "important",
        "resemblance",
        "contour",
        "music",
        "expressive",
        "emotion",
        "contour",
        "typical",
        "behavioral",
        "expression",
        "emotion",
        "object",
        "however",
        "account",
        "whole",
        "even",
        "fundamental",
        "part",
        "story",
        "levinson",
        "a",
        "b",
        "drive",
        "wedge",
        "precisely",
        "point",
        "appeal",
        "made",
        "resemblance",
        "music",
        "typical",
        "behavioral",
        "expression",
        "asks",
        "manner",
        "extent",
        "resemblance",
        "two",
        "must",
        "precisely",
        "order",
        "music",
        "count",
        "expressive",
        "emotion",
        "everything",
        "resembles",
        "everything",
        "else",
        "sort",
        "way",
        "one",
        "could",
        "point",
        "many",
        "resemblance",
        "funeral",
        "march",
        "expression",
        "joy",
        "matter",
        "cup",
        "coffee",
        "sadness",
        "resemblance",
        "theorist",
        "must",
        "give",
        "account",
        "funeral",
        "march",
        "cup",
        "coffee",
        "expressive",
        "sadness",
        "joy",
        "levinson",
        "claim",
        "obvious",
        "answer",
        "funeral",
        "march",
        "readily",
        "hearable",
        "expression",
        "sadness",
        "correct",
        "resemblance",
        "music",
        "bear",
        "emotional",
        "behavior",
        "logically",
        "secondarya",
        "cause",
        "ground",
        "expressiveness",
        "expressiveness",
        "resides",
        "music",
        "disposition",
        "elicit",
        "imaginative",
        "response",
        "u",
        "hearing",
        "music",
        "literal",
        "expression",
        "emotion",
        "logical",
        "consequence",
        "imaginative",
        "experience",
        "prompted",
        "must",
        "include",
        "agent",
        "whose",
        "expression",
        "music",
        "literally",
        "reply",
        "kind",
        "objection",
        "stephen",
        "davy",
        "emphasized",
        "role",
        "listener",
        "response",
        "resemblance",
        "theory",
        "response",
        "always",
        "appealed",
        "theory",
        "evidenced",
        "malcolm",
        "budd",
        "talk",
        "hearing",
        "peter",
        "kivy",
        "discussion",
        "tendency",
        "animate",
        "perceive",
        "davy",
        "make",
        "appeal",
        "quite",
        "explicit",
        "central",
        "devoting",
        "much",
        "space",
        "explication",
        "responsedependent",
        "nature",
        "expressiveness",
        "role",
        "resemblance",
        "davy",
        "response",
        "competent",
        "listener",
        "upon",
        "expressiveness",
        "music",
        "depends",
        "one",
        "experience",
        "resemblance",
        "rather",
        "imagined",
        "expression",
        "matteo",
        "ravasio",
        "b",
        "argues",
        "lead",
        "problem",
        "since",
        "davy",
        "theory",
        "posit",
        "base",
        "contourrecognition",
        "experience",
        "levinson",
        "posit",
        "imaginative",
        "experience",
        "expression",
        "link",
        "literal",
        "expression",
        "musical",
        "expressiveness",
        "look",
        "closer",
        "levinson",
        "theory",
        "davy",
        "empirical",
        "consequence",
        "seems",
        "davy",
        "theory",
        "predict",
        "weaker",
        "emotional",
        "response",
        "music",
        "levinson",
        "whether",
        "advantage",
        "disadvantage",
        "theory",
        "depends",
        "empirical",
        "fact",
        "respond",
        "emotionally",
        "music"
    ]
}