{
    "main_text": "Transcendental method in the philosophy of science\n2. Transcendental method in the philosophy of science\n\nIt is a commonplace of nineteenth-century German intellectual history\nthat with the collapse of post-Kantian Idealism, philosophy ceded its\nclaim of scientificity to the positive\n sciences.[12]\n The special sciences made rapid and startling progress, continually\nadding to the store of human knowledge. Philosophy, meanwhile, seemed\nto have lost its way, and many thinkers pinned their hopes for a\nrehabilitation of philosophy on a return to Kant. The Marburg School\nin particular interpreted this to mean that philosophy should orient\nitself with respect to the sciences, rather than strive—as\nGerman Idealism had—to forge a scientific system of its own,\nindependent from the results of the positive sciences: only in this\nattenuated sense would philosophy be “scientific”. For all\nthat, Natorp by no means conceived philosophy as a humble handmaiden.\nOn the contrary, its task is to discover and establish the highest\nprinciple(s) of rational understanding, and thereby the principles not\nonly of the sciences, but also of ethics and aesthetics, in short, of\nall the domains of human culture (cf. Cohen 1902: 443). It must\nhowever take science as its primary object of inquiry because science\nrepresents the paradigm of knowing (Erkenntnis). Only a\ncritique of science can therefore elucidate rationality or, as the\nMarburgers call it, the “logic” of thinking, for it is\nonly in science that we can most reliably witness thinking at work,\nsuccessfully achieving knowledge. Thus the question of the\n“concept of science” becomes “the chief question of\nlogic and the foundational question of philosophy” (Cohen 1902:\n445). The Marburgers identify the unifying principle of science and\nethics in\n particular[13]\n as the concept of law (Gesetz), and, as Cohen puts it,\n“it is the business of logic to determine the meaning of law, or\nrather, the meanings of law” (Cohen 1902: 445).\n\nNatorp and Cohen find general affirmation of this train of thought in\nKant’s project of seeking the conditions of possibility of the\n“fact” of mathematical natural science (cf. Kant\nProlegomena). However, the similarities end there, for by\nrejecting or modifying several basic aspects of Kant’s\nphilosophy, they also end up with a radically transformed conception\nof the nature of scientific experience and the meaning of knowledge.\nThe first of their modifications stems from an anti-psychologistic\ncritique of Kant himself, namely of what they see as a confusion in\nthe first Critique between the task of a transcendental\ngrounding of the sciences and that of a transcendental logic of human\ncognition (Stolzenberg 1995: 25. But compare Holzhey 1984: 137). The\nformer is in their view the genuine critical enterprise, for it\npromises to reveal the autonomous sources of objective knowledge,\nwhereas the latter threatens to trace science back to psychological,\nand therefore contingent, subjective (albeit a priori)\n wellsprings.[14]\n Second, they deny any scientific role to intuition as conceived by\nKant, either pure or empirical. Partly this is a result of their\nanti-psychologism, which forbids them from grounding the objectivity\nof science in the subjective faculties of cognition; but it is also\nbecause they see, with Kant, the essence of thinking in its activity\nand spontaneity, whereas intuition (at least as defined by Kant) is\npassive and receptive (cf., e.g., Kant, Kritik der reinen\nVernunft (KrV), A68/B93). Hence, intuition thus\nconceived threatens to introduce a heteronomous, and therefore\nrationally unacceptable, factor into science. Finally, the Marburgers\nfollow their German Idealist predecessors in dismissing all talk of\nthings in themselves, conceived as things existing independently of\nknowledge. We can see how these three important modifications of\nKant’s philosophy stem from the same basic concern with rational\nautonomy. For reason to be autonomous, its activity must be\nspontaneous; but this spontaneity cannot be conceived of\npsychologically, because human cognition as a matter of fact has a\npassive, and therefore heteronomous, intuitive element, namely\nsensibility. Furthermore, things in themselves can play no explanatory\nrole here because they are ex hypothesi alien to reason.\n\nThese modifications have two radical consequences for Kantian\ndoctrine, consequences that characterize the Marburgers’ own\ntheory of science and cognition. The first is a new conception of\nscience; the second is a new conception of the categories (see\n Section 4).\n It might seem that science, as the achievement of an autonomous\nrationality, must fail to be objectively true of the world, if\nreason’s autonomy implies that it can have no intuitive,\nreceptive link to the world via sensibility. How in general could the\nrationally constructed system be related to experience or constrained\nby it? How in particular could physics, the science of motion in space\nand time, be possible if the pure forms of intuition, space and time,\nwere banished from science (cf. Friedman 2000: 26, ff.)?\n\nIf Natorp often seems to embrace the troubling thesis that science is\nnot of the phenomenal world, this is because he holds, first, that the\nmeaning of “phenomenon” is problematic; and second, that\nthe aspect of science relevant to philosophy has nothing to\ndo with its relation to a phenomenal realm. In this he follows\nCohen’s dictum:\n\n\nNot the stars in the heavens are the objects which [the\ntranscendental] method teaches us to contemplate in order to know\nthem; rather, it is the astronomical calculations, those facts of\nscientific reality which are the “actuality” that needs to\nbe explained…. What is the foundation of the reality which is\ngiven in such facts? What are the conditions of that certainty from\nwhich visible actuality takes its reality? The laws are the facts, and\n[hence] the objects [of our investigation]; not the star-things.\n(Cohen 1877: 27,\n f.)[15]\n\n\n\nThe point is that the scientific or epistemic value of, say,\nastronomy, is not to be found in what is given and observable by the\nsenses, but rather in the mathematical exactness of its equations.\nThese alone constitute and underwrite the truth-value of\nastronomy’s propositions, and they are solely the achievements\nof reason’s activity. As noted above, the essential\ncharacteristic of science lies in its objectivity, and that\nobjectivity is rooted in its lawfulness. It is this formal feature of\nobjectivity that constitutes the philosophical interest in science,\nnot the material content of a particular science’s theorems; in\nother words, the philosophical question is: “How is this\nlawfulness possible?” This question is distinct from the\npsychological question, “What are the psychological laws that\nmake it possible for me (as a psychophysical being) to observe a\nstar?” or the astronomical question, “What are the laws\ngoverning the ’being’ of this star in its states and\nproperties?”\n\nHence, it is not so much the case that science on the\nMarburgers’ conception loses all traction on the phenomenal or\n“actual” world, as that they are asking an entirely\ndifferent question. While for Kant himself such traction is the only\nwarrant that we are cognizing a genuine object, for Natorp the nexus\nof science and apparent reality is irrelevant to the spontaneous,\nlegislating factor of science that is the activity of reason alone and\ntherefore of paramount interest to philosophy. How such essentially\nsubjective application of categories to sensible phenomena in fact\nhappens is a problem of psychology, not philosophy, to investigate.\nThus we must be very careful in interpreting the Marburg talk of\n“scientific experience”: it is not experience in general\nor psychological (subjective) experience (Erlebnis), but\nscientific (objective) experience (Erfahrung) which is the\n“fact” whose transcendental sources philosophy is to seek\n(cf. Natorp 1910c: 13). Yet we must not in turn take this\nscientific “experience” to mean “experience cleansed\nby experiment” (to paraphrase\n Helmholtz[16]\n ): experiment by definition obviously remains empirical. Rather, by\n“scientific experience” Natorp just means the\n“legislative” act of categorial “Grundlegung”,\nof\n “hypothesis”.[17]\n\n\nBy the end of the nineteenth century, it was obvious to any informed\nobserver of science that its categorial structures were in fact\nhypothetical and dynamic: the fact of scientific experience could no\nlonger be taken as the essentially complete edifice of Newtonian\nphysics, as Kant had done. In Natorp’s rewording of Kant,\nscience is not a factum at all, but a fieri, i.e.,\nnot an accomplished deed, but an ongoing doing (cf. Natorp 1910c: 14).\nHence, what makes science scientific—i.e., productive of genuine\nknowledge—cannot possibly be founded on a set of fixed\n(physical) principles, analogous to mathematical axioms, the certainty\nof which permanently grounds its theorems. Instead, the Marburgers\nargue, the essence of science can only reside in its method,\ni.e., in the regular and regulated manner of its progress. And since\nthis scientificity is equivalent to objectivity or lawfulness,\ntranscendental critique must determine the relation of lawfulness to\nmethod.\n",
    "section_title": "2. Transcendental method in the philosophy of science",
    "entry_title": "Paul Natorp",
    "hierarchy_title": "Paul Natorp || Transcendental method in the philosophy of science",
    "tokenized_text": [
        "transcendental",
        "method",
        "philosophy",
        "science",
        "transcendental",
        "method",
        "philosophy",
        "science",
        "commonplace",
        "nineteenthcentury",
        "german",
        "intellectual",
        "history",
        "collapse",
        "postkantian",
        "idealism",
        "philosophy",
        "ceded",
        "claim",
        "scientificity",
        "positive",
        "science",
        "special",
        "science",
        "made",
        "rapid",
        "startling",
        "progress",
        "continually",
        "adding",
        "store",
        "human",
        "knowledge",
        "philosophy",
        "meanwhile",
        "seemed",
        "lost",
        "way",
        "many",
        "thinker",
        "pinned",
        "hope",
        "rehabilitation",
        "philosophy",
        "return",
        "kant",
        "marburg",
        "school",
        "particular",
        "interpreted",
        "mean",
        "philosophy",
        "orient",
        "respect",
        "science",
        "rather",
        "striveas",
        "german",
        "idealism",
        "hadto",
        "forge",
        "scientific",
        "system",
        "independent",
        "result",
        "positive",
        "science",
        "attenuated",
        "sense",
        "would",
        "philosophy",
        "scientific",
        "natorp",
        "mean",
        "conceived",
        "philosophy",
        "humble",
        "handmaiden",
        "contrary",
        "task",
        "discover",
        "establish",
        "highest",
        "principle",
        "rational",
        "understanding",
        "thereby",
        "principle",
        "science",
        "also",
        "ethic",
        "aesthetic",
        "short",
        "domain",
        "human",
        "culture",
        "cf",
        "cohen",
        "must",
        "however",
        "take",
        "science",
        "primary",
        "object",
        "inquiry",
        "science",
        "represents",
        "paradigm",
        "knowing",
        "erkenntnis",
        "critique",
        "science",
        "therefore",
        "elucidate",
        "rationality",
        "marburgers",
        "call",
        "logic",
        "thinking",
        "science",
        "reliably",
        "witness",
        "thinking",
        "work",
        "successfully",
        "achieving",
        "knowledge",
        "thus",
        "question",
        "concept",
        "science",
        "becomes",
        "chief",
        "question",
        "logic",
        "foundational",
        "question",
        "philosophy",
        "cohen",
        "marburgers",
        "identify",
        "unifying",
        "principle",
        "science",
        "ethic",
        "particular",
        "concept",
        "law",
        "gesetz",
        "cohen",
        "put",
        "business",
        "logic",
        "determine",
        "meaning",
        "law",
        "rather",
        "meaning",
        "law",
        "cohen",
        "natorp",
        "cohen",
        "find",
        "general",
        "affirmation",
        "train",
        "thought",
        "kant",
        "project",
        "seeking",
        "condition",
        "possibility",
        "fact",
        "mathematical",
        "natural",
        "science",
        "cf",
        "kant",
        "prolegomenon",
        "however",
        "similarity",
        "end",
        "rejecting",
        "modifying",
        "several",
        "basic",
        "aspect",
        "kant",
        "philosophy",
        "also",
        "end",
        "radically",
        "transformed",
        "conception",
        "nature",
        "scientific",
        "experience",
        "meaning",
        "knowledge",
        "first",
        "modification",
        "stem",
        "antipsychologistic",
        "critique",
        "kant",
        "namely",
        "see",
        "confusion",
        "first",
        "critique",
        "task",
        "transcendental",
        "grounding",
        "science",
        "transcendental",
        "logic",
        "human",
        "cognition",
        "stolzenberg",
        "compare",
        "holzhey",
        "former",
        "view",
        "genuine",
        "critical",
        "enterprise",
        "promise",
        "reveal",
        "autonomous",
        "source",
        "objective",
        "knowledge",
        "whereas",
        "latter",
        "threatens",
        "trace",
        "science",
        "back",
        "psychological",
        "therefore",
        "contingent",
        "subjective",
        "albeit",
        "priori",
        "wellspring",
        "second",
        "deny",
        "scientific",
        "role",
        "intuition",
        "conceived",
        "kant",
        "either",
        "pure",
        "empirical",
        "partly",
        "result",
        "antipsychologism",
        "forbids",
        "grounding",
        "objectivity",
        "science",
        "subjective",
        "faculty",
        "cognition",
        "also",
        "see",
        "kant",
        "essence",
        "thinking",
        "activity",
        "spontaneity",
        "whereas",
        "intuition",
        "least",
        "defined",
        "kant",
        "passive",
        "receptive",
        "cf",
        "eg",
        "kant",
        "kritik",
        "der",
        "reinen",
        "vernunft",
        "krv",
        "ab",
        "hence",
        "intuition",
        "thus",
        "conceived",
        "threatens",
        "introduce",
        "heteronomous",
        "therefore",
        "rationally",
        "unacceptable",
        "factor",
        "science",
        "finally",
        "marburgers",
        "follow",
        "german",
        "idealist",
        "predecessor",
        "dismissing",
        "talk",
        "thing",
        "conceived",
        "thing",
        "existing",
        "independently",
        "knowledge",
        "see",
        "three",
        "important",
        "modification",
        "kant",
        "philosophy",
        "stem",
        "basic",
        "concern",
        "rational",
        "autonomy",
        "reason",
        "autonomous",
        "activity",
        "must",
        "spontaneous",
        "spontaneity",
        "conceived",
        "psychologically",
        "human",
        "cognition",
        "matter",
        "fact",
        "passive",
        "therefore",
        "heteronomous",
        "intuitive",
        "element",
        "namely",
        "sensibility",
        "furthermore",
        "thing",
        "play",
        "explanatory",
        "role",
        "ex",
        "hypothesi",
        "alien",
        "reason",
        "modification",
        "two",
        "radical",
        "consequence",
        "kantian",
        "doctrine",
        "consequence",
        "characterize",
        "marburgers",
        "theory",
        "science",
        "cognition",
        "first",
        "new",
        "conception",
        "science",
        "second",
        "new",
        "conception",
        "category",
        "see",
        "section",
        "might",
        "seem",
        "science",
        "achievement",
        "autonomous",
        "rationality",
        "must",
        "fail",
        "objectively",
        "true",
        "world",
        "reason",
        "autonomy",
        "implies",
        "intuitive",
        "receptive",
        "link",
        "world",
        "via",
        "sensibility",
        "general",
        "could",
        "rationally",
        "constructed",
        "system",
        "related",
        "experience",
        "constrained",
        "particular",
        "could",
        "physic",
        "science",
        "motion",
        "space",
        "time",
        "possible",
        "pure",
        "form",
        "intuition",
        "space",
        "time",
        "banished",
        "science",
        "cf",
        "friedman",
        "ff",
        "natorp",
        "often",
        "seems",
        "embrace",
        "troubling",
        "thesis",
        "science",
        "phenomenal",
        "world",
        "hold",
        "first",
        "meaning",
        "phenomenon",
        "problematic",
        "second",
        "aspect",
        "science",
        "relevant",
        "philosophy",
        "nothing",
        "relation",
        "phenomenal",
        "realm",
        "follows",
        "cohen",
        "dictum",
        "star",
        "heaven",
        "object",
        "transcendental",
        "method",
        "teach",
        "u",
        "contemplate",
        "order",
        "know",
        "rather",
        "astronomical",
        "calculation",
        "fact",
        "scientific",
        "reality",
        "actuality",
        "need",
        "explained",
        "foundation",
        "reality",
        "given",
        "fact",
        "condition",
        "certainty",
        "visible",
        "actuality",
        "take",
        "reality",
        "law",
        "fact",
        "hence",
        "object",
        "investigation",
        "starthings",
        "cohen",
        "f",
        "point",
        "scientific",
        "epistemic",
        "value",
        "say",
        "astronomy",
        "found",
        "given",
        "observable",
        "sens",
        "rather",
        "mathematical",
        "exactness",
        "equation",
        "alone",
        "constitute",
        "underwrite",
        "truthvalue",
        "astronomy",
        "proposition",
        "solely",
        "achievement",
        "reason",
        "activity",
        "noted",
        "essential",
        "characteristic",
        "science",
        "lie",
        "objectivity",
        "objectivity",
        "rooted",
        "lawfulness",
        "formal",
        "feature",
        "objectivity",
        "constitutes",
        "philosophical",
        "interest",
        "science",
        "material",
        "content",
        "particular",
        "science",
        "theorem",
        "word",
        "philosophical",
        "question",
        "lawfulness",
        "possible",
        "question",
        "distinct",
        "psychological",
        "question",
        "psychological",
        "law",
        "make",
        "possible",
        "psychophysical",
        "observe",
        "star",
        "astronomical",
        "question",
        "law",
        "governing",
        "star",
        "state",
        "property",
        "hence",
        "much",
        "case",
        "science",
        "marburgers",
        "conception",
        "loses",
        "traction",
        "phenomenal",
        "actual",
        "world",
        "asking",
        "entirely",
        "different",
        "question",
        "kant",
        "traction",
        "warrant",
        "cognizing",
        "genuine",
        "object",
        "natorp",
        "nexus",
        "science",
        "apparent",
        "reality",
        "irrelevant",
        "spontaneous",
        "legislating",
        "factor",
        "science",
        "activity",
        "reason",
        "alone",
        "therefore",
        "paramount",
        "interest",
        "philosophy",
        "essentially",
        "subjective",
        "application",
        "category",
        "sensible",
        "phenomenon",
        "fact",
        "happens",
        "problem",
        "psychology",
        "philosophy",
        "investigate",
        "thus",
        "must",
        "careful",
        "interpreting",
        "marburg",
        "talk",
        "scientific",
        "experience",
        "experience",
        "general",
        "psychological",
        "subjective",
        "experience",
        "erlebnis",
        "scientific",
        "objective",
        "experience",
        "erfahrung",
        "fact",
        "whose",
        "transcendental",
        "source",
        "philosophy",
        "seek",
        "cf",
        "natorp",
        "c",
        "yet",
        "must",
        "turn",
        "take",
        "scientific",
        "experience",
        "mean",
        "experience",
        "cleansed",
        "experiment",
        "paraphrase",
        "helmholtz",
        "experiment",
        "definition",
        "obviously",
        "remains",
        "empirical",
        "rather",
        "scientific",
        "experience",
        "natorp",
        "mean",
        "legislative",
        "act",
        "categorial",
        "grundlegung",
        "hypothesis",
        "end",
        "nineteenth",
        "century",
        "obvious",
        "informed",
        "observer",
        "science",
        "categorial",
        "structure",
        "fact",
        "hypothetical",
        "dynamic",
        "fact",
        "scientific",
        "experience",
        "could",
        "longer",
        "taken",
        "essentially",
        "complete",
        "edifice",
        "newtonian",
        "physic",
        "kant",
        "done",
        "natorp",
        "rewording",
        "kant",
        "science",
        "factum",
        "fieri",
        "ie",
        "accomplished",
        "deed",
        "ongoing",
        "cf",
        "natorp",
        "c",
        "hence",
        "make",
        "science",
        "scientificie",
        "productive",
        "genuine",
        "knowledge",
        "possibly",
        "founded",
        "set",
        "fixed",
        "physical",
        "principle",
        "analogous",
        "mathematical",
        "axiom",
        "certainty",
        "permanently",
        "ground",
        "theorem",
        "instead",
        "marburgers",
        "argue",
        "essence",
        "science",
        "reside",
        "method",
        "ie",
        "regular",
        "regulated",
        "manner",
        "progress",
        "since",
        "scientificity",
        "equivalent",
        "objectivity",
        "lawfulness",
        "transcendental",
        "critique",
        "must",
        "determine",
        "relation",
        "lawfulness",
        "method"
    ]
}