{
    "main_text": "Naturalness and other notions || Modality\n4.4 Modality\n4.4.1 Completeness\n\nLewis took it as axiomatic that “truth is supervenient on\nbeing”, and explained this slogan—borrowed from Bigelow\n (1988)—as\n follows:\n\n\nIf two possible worlds are discernible in any way at all, it must be\nbecause they differ in what things there are in them, or in how those\nthings are. And \"how things are\" is fully given by the fundamental,\nperfectly natural, properties and relations that those things\ninstantiate.\n\n\nSpelling this out, we get: \n\nTSB\n\nFor any possible worlds \\(w\\) and \\(w'\\), if \\(w\\) and \\(w'\\) agree as\nregards what things there are, and for any \\(n\\), any perfectly\nnatural \\(n\\)-ary property \\(R\\), and any \\(n\\) objects\n\\(x_1,\\ldots,x_n\\) that exist at \\(w\\) and \\(w'\\), the proposition\nthat \\(R(x_1,\\ldots,x_n)\\) is true at \\(w\\) if and only if it is true\nat \\(w'\\), then exactly the same propositions are true at \\(w\\) and\n \\(w'\\).[30]\n\n\nWe can get across the same idea without mentioning possible worlds:\n\n\nNecessarily, every true proposition is metaphysically necessitated by\nsome collection of true propositions each of which is either (a) the\nproposition that \\(R(x_1,\\ldots ,x_n)\\) or \\(¬R(x_1,\\ldots\n,x_n)\\), for some perfectly natural \\(R\\) and objects \\(x_1,\\ldots\n,x_n\\) are any objects; (b) the proposition that \\(\\exists y(y=x)\\),\nfor some object \\(x\\), or (c) the proposition that every object is one\nof \\(xx\\), where \\(xx\\) are all the objects there\n are.[31]\n\n\nTSB\n follows from\n Qualitative Supervenience\n (see\n §4.3)\n together with a less controversial principle we might dub\n‘Truth Supervenes on the Qualitative’, derived from\n TSB\n by replacing ‘perfectly natural’ with\n‘qualitative’. It is thus unsurprising that putative\ncounterexamples to\n Qualitative Supervenience\n extend to\n TSB.\n For example, if one took being left-handed to be a\nqualitative property that need not be preserved by bijections that\npreserve perfectly natural properties, one might plausibly think that\nworlds could agree on which objects there are and which perfectly\nnatural properties they instantiate without agreeing on which ones are\nleft-handed. Similarly, if one posits higher-order perfectly natural\nproperties which do not supervene on the first-order ones, one should\nhave doubts about\n TSB,\n assuming one interprets\n TSB’s\n talk of “objects” in a way that does not include objects.\nHowever in that case one might hold on to a variant of\n TSB\n that gives the same status to all propositions \\(R(X_1,\\ldots,X_n)\\)\nwhere \\(R\\) is perfectly natural (of whatever type) and\n\\(X_1,\\ldots,X_n\\) are of the right types to be arguments to \\(R\\).\n\n\nTSB\n can be understood as an attempt to pin down the inchoate thought that\nthe description of the world in terms of perfectly natural properties\nis “complete” or “exhaustive”. Sider\n (2011)\n argues that\n TSB\n fails to capture the intuitive idea of completeness, primarily on the\ngrounds that ‘it imposes no meaningful requirement of\ncompleteness for necessary truths’.\n §4.10\n and\n §4.11\n below will consider some different strategies for capturing the\nthought, which are plausibly taken to be stronger than\n TSB.\n Sider’s own preference is to cash out the thought in a\nmetalinguistic way, as the thesis that “every sentence that\ncontains expressions that do not carve at the joints has a\nmetaphysical semantics”. Unfortunately there is no space to\nexplain the novel conception of “metaphysical semantics”\nSider is appealing to; however it is worth mentioning that Sider does\nnot take his thesis about metaphysical semantics to imply\n TSB.\n4.4.2 Independence\n\nAccording to Lewis\n (1986b:\n 60), “there are only just enough [perfectly natural properties]\nto characterise things completely and without redundancy”. This\nremark suggests that the perfectly natural properties constitute a\nminimal supervenience base for all truths: if \\(R\\) is a\nperfectly natural property, the result of replacing ‘perfectly\nnatural property’ with ‘perfectly natural property distinct\nfrom \\(R\\)’ in\n TSB\n and/or\n Qualitative Supervenience\n is\n false.[32]\n Of course one way for this to be true would be for\n TSB/Qualitative Supervenience\n to already be false. But there is an idea in the vicinity that is\nlogically independent of\n TSB\n and\n Qualitative Supervenience,\n namely that no perfectly natural property supervenes on all the\nrest. If we take the relevant sense of ‘supervene’ to\nbe the one in play in\n Qualitative Supervenience,\n this amounts to: \n\nMinimality\n\nFor each perfectly natural \\(n\\)-ary property \\(R\\), there are\npossible worlds \\(w\\) and \\(w'\\), objects \\(x_1,\\ldots,x_n\\) existing\nat \\(w\\), and a bijection \\(f\\) from objects existing at \\(w\\) to\nobjects existing at \\(w'\\) such that \\(R(x_1,\\ldots,x_n)\\) at \\(w\\),\nnot \\(R(f(x_1),\\ldots,f(x_n))\\) at \\(w'\\), and for every perfectly\nnatural \\(m\\)-ary property \\(S\\) distinct from \\(R\\) and objects\n\\(y_1,\\ldots,y_m\\) existing at \\(w\\), \\(S(y_1,\\ldots,y_m)\\) at \\(w\\)\nif and only if \\(S(f(y_1),\\ldots,f(y_m))\\) at \\(w'\\).\n\nIf we take the relevant sense of ‘supervene’ to be the one\nin play in\n TSB,\n we get something a bit stronger, where the worlds \\(w\\) and \\(w'\\)\nare required to be ones at which the same objects exist and the\nfunction \\(f\\) is required to map every object to itself. \n\nMinimality\n entails that if a binary relation \\(R\\) is perfectly natural, its\nconverse—being an \\(x\\) and \\(y\\) such that\n\\(R(y,x)\\)—is not also perfectly natural. This seems oddly\narbitrary: it is tempting to think that, instead, converse relations\nare always equally natural. One could avoid this objection by\nweakening\n Minimality,\n replacing ‘distinct from \\(R\\)’ with ‘distinct from\n\\(R\\) and its converse’, or more generally ‘distinct from\nall of the permutations of \\(R\\)’. More ambitiously,\none could develop a theory of “neutral” relations (Fine\n 2000),\n understood as entities for which distinctions like the one between a\nrelation and its converse does not arise, and treat ‘perfectly\nnatural’ as a predicate of neutral relations.\n\nMinimality\n also implies that the negation of a perfectly natural\nproperty is never perfectly natural. This does not so obviously raise\nworries about arbitrariness. Nevertheless, the relation between a\nrelation and its negation is structurally quite similar to the\nrelation between a relation and its converse—both seem to\ninvolve a kind of “interdefinability”—so there are\nsome attractions to saying that the negation of a perfectly natural\nproperty is always perfectly natural, and more generally that the\nnegation of any property is equal to it in naturalness. This has been\nsuggested by Plate\n (2016)\n and Dorr\n (2016).[33]\n\n\nA different kind of putative counterexample to\n Minimality\n involves perfectly natural properties which are “rigid”\nin the sense that whatever instantiates or fails to instantiate them\ndoes so necessarily. If\n TSB\n is true and \\(F\\) is rigid,\n TSB\n remains true when ‘perfectly natural property’ is\nreplaced by ‘perfectly natural property distinct from\n\\(F\\)’. For example, if one held that every electron is\nnecessarily an electron (if it exists) and that every non-electron is\nnecessarily not an electron (if it exists), minimality would rule out\nclaiming that being an electron is perfectly natural. Eddon\n (2013)\n argues that certain rigid relations among properties are\nperfectly natural, and thus make trouble for minimality: one of her\nexamples is the three-place being the sum of relation that\nholds, for example, between the determinate mass properties being\nexactly 5kg in mass, being exactly 7kg in mass, and\nbeing exactly 12kg in mass.\n\nFinally, some have argued against\n Minimality\n on the grounds that certain “higher-level” properties are\nperfectly natural, despite supervening on perfectly natural\n“lower-level” properties. For example, Bennett\n (2017)\n argues that the property of being a “schmoton”—a\ncertain kind of complex particle—might be perfectly natural,\ndespite supervening on other perfectly natural properties: her\nargument is based on a list of criteria she takes to be jointly\nsufficient for perfect naturalness, including “figuring in\nfundamental laws” and being such that any two of one’s\ninstances are\n duplicates.[34]\n\n\nMinimality\n allows for a wide variety of interesting modal connections within the\nclass of perfectly natural properties, so long as they do not take the\nspecific form of a supervenience claim. Many authors have been\nattracted towards much more sweeping claims of modal independence,\noften inspired by the Humean slogan “no necessary connections\nbetween distinct existences”. Lewis\n (1986b)\n defends a “principle of recombination” (see the entry on\n possible worlds),\n which entails, for example, that any two possibly-instantiated\nconjunctions of perfectly natural properties are possibly instantiated\nin the same world. Depending on how the principle is precisified, it\nmay also entail that for any two possibly-instantiated conjunctions of\nperfectly natural monadic properties \\(F\\) and \\(G\\) and any perfectly\nnatural binary relation \\(R\\) it is possible that an instance of \\(F\\)\nbears \\(R\\) to an instance of\n \\(G\\).[35]\n Some particularly far-reaching claims of this sort go by the name of\n“combinatorialism”: the idea is that all logically\npossible patterns in which any properties might be distributed are\npossibly instantiated by any given perfectly natural\n properties.[36]\n For example, since it is logically possible for there to be a monadic\nproperty with exactly seven instances and a binary relation that holds\nbetween any two of those instances, each perfectly natural property\n\\(F\\) and perfectly natural binary relation \\(R\\) are such that it is\nmetaphysically possible for \\(F\\) to have exactly seven instances and\n\\(R\\) to hold between any two of\n them.[37]\n\n\nIf some kind of combinatorialism is true, it could be a powerful tool\nfor figuring out whether properties are perfectly natural, since many\ncollections of properties that might otherwise seem good candidates to\nbe perfectly natural seem to be involved in the kinds of necessary\nconnections which, according to combinatorialism, never obtain among\nperfectly natural properties. The worry for those who want to use\narguments like this to eliminate certain candidate collections of\nperfectly natural properties is that all the otherwise\nacceptable candidate collections might turn out to involved in such\napparent necessary connections. If so we will face a choice between\ngiving up combinatorialism and rejecting the relevant prima facie\nmodal judgments. To illustrate the difficulties, we can return to the\nexample of mass. Insofar as one takes physics as a guide to the\nperfectly natural, there is pressure to think that some perfectly\nnatural properties have to do with mass. There are a great many\npossible candidates, including:\n\n Maximally specific monadic mass properties of objects, like\nhaving a mass of 3.12\n grams[38]\n Less specific monadic mass properties of objects, like having\na mass between 3.12 and 4.03 grams, or just having mass\n(Wilson\n 2012)\n Binary relations between objects and real numbers, like being\nthe mass in grams of or being the mass in kilograms\nof\n More-than-two place relations between objects and numbers, like\nthe “mass ratio” relation, \\(x\\) is \\(n\\) times as\nmassive as \\(y\\) \n Binary relations among objects, like being the same mass\nas, being greater in mass than, being 3.12 times as\nmassive as, or being between 3.12 and 4.03 times as massive\nas. \n More-than-two place relations among objects, like \\(z\\) is as\nmassive as \\(x\\) and \\(y\\) put together, \\(z\\) is\nintermediate between \\(x\\) and \\(y\\) in mass, or \\(w\\) and\n\\(z\\) stand in the same mass-ratio as \\(x\\) and \\(y\\) \n Relations among properties, like F is a maximally specific\nmass property that is the sum of maximally specific mass properties G\nand H (see Mundy\n 1987,\n Eddon\n 2013).\n Relations linking mass to other scales, like the mass of\n\\(x\\) equals the distance between \\(y\\) and \\(z\\) in units where the\nspeed of light and Newton’s gravitational constant are both\n 1.[39]\n\n\n\nWithin each of the candidate families, one can formulate certain laws\nthat might plausibly be claimed to be metaphysically necessary. For\nexample, it is tempting to suppose that it would be metaphysically\n(rather than merely nomically) impossible for an object to be both one\ngram in mass and two grams in mass, or for one object to be both equal\nin mass to another and twice as massive as it. But if we combine all\nthese judgments with combinatorialism, we will have to deny that any\nof the families we have considered consists entirely of perfectly\nnatural\n properties.[40]\n This is not out of the question: one can imagine many ways in which\nmass-theoretic properties might supervene on perfectly natural\nproperties we do not yet have words for, in a manner consistent with\nthe relevant modal judgments. However, precisely because there are so\nmany ways this might be achieved, this response threatens to lead to a\nsort of scepticism about our ability to know what the perfectly\nnatural properties are, or how the properties we have words for\nsupervene on them. Combinatorialists thus have reason to be open to\nthe idea that some of the relevant laws might turn out, surprisingly,\nto be metaphysically contingent (though they may still be nomologcally\nnecessary). \n",
    "section_title": "4.4 Modality",
    "entry_title": "Natural Properties",
    "hierarchy_title": "Natural Properties || Naturalness and other notions || Modality",
    "tokenized_text": [
        "naturalness",
        "notion",
        "modality",
        "modality",
        "completeness",
        "lewis",
        "took",
        "axiomatic",
        "truth",
        "supervenient",
        "explained",
        "sloganborrowed",
        "bigelow",
        "as",
        "follows",
        "two",
        "possible",
        "world",
        "discernible",
        "way",
        "must",
        "differ",
        "thing",
        "thing",
        "thing",
        "fully",
        "given",
        "fundamental",
        "perfectly",
        "natural",
        "property",
        "relation",
        "thing",
        "instantiate",
        "spelling",
        "get",
        "tsb",
        "possible",
        "world",
        "w",
        "w",
        "w",
        "w",
        "agree",
        "regard",
        "thing",
        "n",
        "perfectly",
        "natural",
        "n",
        "ary",
        "property",
        "r",
        "n",
        "object",
        "x_",
        "ldots",
        "x_n",
        "exist",
        "w",
        "w",
        "proposition",
        "r",
        "x_",
        "ldots",
        "x_n",
        "true",
        "w",
        "true",
        "w",
        "exactly",
        "proposition",
        "true",
        "w",
        "w",
        "get",
        "across",
        "idea",
        "without",
        "mentioning",
        "possible",
        "world",
        "necessarily",
        "every",
        "true",
        "proposition",
        "metaphysically",
        "necessitated",
        "collection",
        "true",
        "proposition",
        "either",
        "proposition",
        "r",
        "x_",
        "ldots",
        "x_n",
        "r",
        "x_",
        "ldots",
        "x_n",
        "perfectly",
        "natural",
        "r",
        "object",
        "x_",
        "ldots",
        "x_n",
        "object",
        "b",
        "proposition",
        "exists",
        "yx",
        "object",
        "x",
        "c",
        "proposition",
        "every",
        "object",
        "one",
        "xx",
        "xx",
        "object",
        "tsb",
        "follows",
        "qualitative",
        "supervenience",
        "see",
        "together",
        "le",
        "controversial",
        "principle",
        "might",
        "dub",
        "truth",
        "supervenes",
        "qualitative",
        "derived",
        "tsb",
        "replacing",
        "perfectly",
        "natural",
        "qualitative",
        "thus",
        "unsurprising",
        "putative",
        "counterexample",
        "qualitative",
        "supervenience",
        "extend",
        "tsb",
        "example",
        "one",
        "took",
        "lefthanded",
        "qualitative",
        "property",
        "need",
        "preserved",
        "bijections",
        "preserve",
        "perfectly",
        "natural",
        "property",
        "one",
        "might",
        "plausibly",
        "think",
        "world",
        "could",
        "agree",
        "object",
        "perfectly",
        "natural",
        "property",
        "instantiate",
        "without",
        "agreeing",
        "one",
        "lefthanded",
        "similarly",
        "one",
        "posit",
        "higherorder",
        "perfectly",
        "natural",
        "property",
        "supervene",
        "firstorder",
        "one",
        "one",
        "doubt",
        "tsb",
        "assuming",
        "one",
        "interprets",
        "tsb",
        "talk",
        "object",
        "way",
        "include",
        "object",
        "however",
        "case",
        "one",
        "might",
        "hold",
        "variant",
        "tsb",
        "give",
        "status",
        "proposition",
        "r",
        "x_",
        "ldots",
        "x_n",
        "r",
        "perfectly",
        "natural",
        "whatever",
        "type",
        "x_",
        "ldots",
        "x_n",
        "right",
        "type",
        "argument",
        "r",
        "tsb",
        "understood",
        "attempt",
        "pin",
        "inchoate",
        "thought",
        "description",
        "world",
        "term",
        "perfectly",
        "natural",
        "property",
        "complete",
        "exhaustive",
        "sider",
        "argues",
        "tsb",
        "fails",
        "capture",
        "intuitive",
        "idea",
        "completeness",
        "primarily",
        "ground",
        "imposes",
        "meaningful",
        "requirement",
        "completeness",
        "necessary",
        "truth",
        "consider",
        "different",
        "strategy",
        "capturing",
        "thought",
        "plausibly",
        "taken",
        "stronger",
        "tsb",
        "sider",
        "preference",
        "cash",
        "thought",
        "metalinguistic",
        "way",
        "thesis",
        "every",
        "sentence",
        "contains",
        "expression",
        "carve",
        "joint",
        "metaphysical",
        "semantics",
        "unfortunately",
        "space",
        "explain",
        "novel",
        "conception",
        "metaphysical",
        "semantics",
        "sider",
        "appealing",
        "however",
        "worth",
        "mentioning",
        "sider",
        "take",
        "thesis",
        "metaphysical",
        "semantics",
        "imply",
        "tsb",
        "independence",
        "according",
        "lewis",
        "b",
        "enough",
        "perfectly",
        "natural",
        "property",
        "characterise",
        "thing",
        "completely",
        "without",
        "redundancy",
        "remark",
        "suggests",
        "perfectly",
        "natural",
        "property",
        "constitute",
        "minimal",
        "supervenience",
        "base",
        "truth",
        "r",
        "perfectly",
        "natural",
        "property",
        "result",
        "replacing",
        "perfectly",
        "natural",
        "property",
        "perfectly",
        "natural",
        "property",
        "distinct",
        "r",
        "tsb",
        "andor",
        "qualitative",
        "supervenience",
        "false",
        "course",
        "one",
        "way",
        "true",
        "would",
        "tsbqualitative",
        "supervenience",
        "already",
        "false",
        "idea",
        "vicinity",
        "logically",
        "independent",
        "tsb",
        "qualitative",
        "supervenience",
        "namely",
        "perfectly",
        "natural",
        "property",
        "supervenes",
        "rest",
        "take",
        "relevant",
        "sense",
        "supervene",
        "one",
        "play",
        "qualitative",
        "supervenience",
        "amount",
        "minimality",
        "perfectly",
        "natural",
        "n",
        "ary",
        "property",
        "r",
        "possible",
        "world",
        "w",
        "w",
        "object",
        "x_",
        "ldots",
        "x_n",
        "existing",
        "w",
        "bijection",
        "f",
        "object",
        "existing",
        "w",
        "object",
        "existing",
        "w",
        "r",
        "x_",
        "ldots",
        "x_n",
        "w",
        "r",
        "f",
        "x_",
        "ldots",
        "f",
        "x_n",
        "w",
        "every",
        "perfectly",
        "natural",
        "m",
        "ary",
        "property",
        "s",
        "distinct",
        "r",
        "object",
        "y_",
        "ldots",
        "y_m",
        "existing",
        "w",
        "y_",
        "ldots",
        "y_m",
        "w",
        "f",
        "y_",
        "ldots",
        "f",
        "y_m",
        "w",
        "take",
        "relevant",
        "sense",
        "supervene",
        "one",
        "play",
        "tsb",
        "get",
        "something",
        "bit",
        "stronger",
        "world",
        "w",
        "w",
        "required",
        "one",
        "object",
        "exist",
        "function",
        "f",
        "required",
        "map",
        "every",
        "object",
        "minimality",
        "entail",
        "binary",
        "relation",
        "r",
        "perfectly",
        "natural",
        "conversebeing",
        "x",
        "y",
        "r",
        "x",
        "is",
        "also",
        "perfectly",
        "natural",
        "seems",
        "oddly",
        "arbitrary",
        "tempting",
        "think",
        "instead",
        "converse",
        "relation",
        "always",
        "equally",
        "natural",
        "one",
        "could",
        "avoid",
        "objection",
        "weakening",
        "minimality",
        "replacing",
        "distinct",
        "r",
        "distinct",
        "r",
        "converse",
        "generally",
        "distinct",
        "permutation",
        "r",
        "ambitiously",
        "one",
        "could",
        "develop",
        "theory",
        "neutral",
        "relation",
        "fine",
        "understood",
        "entity",
        "distinction",
        "like",
        "one",
        "relation",
        "converse",
        "arise",
        "treat",
        "perfectly",
        "natural",
        "predicate",
        "neutral",
        "relation",
        "minimality",
        "also",
        "implies",
        "negation",
        "perfectly",
        "natural",
        "property",
        "never",
        "perfectly",
        "natural",
        "obviously",
        "raise",
        "worry",
        "arbitrariness",
        "nevertheless",
        "relation",
        "relation",
        "negation",
        "structurally",
        "quite",
        "similar",
        "relation",
        "relation",
        "converseboth",
        "seem",
        "involve",
        "kind",
        "interdefinability",
        "so",
        "attraction",
        "saying",
        "negation",
        "perfectly",
        "natural",
        "property",
        "always",
        "perfectly",
        "natural",
        "generally",
        "negation",
        "property",
        "equal",
        "naturalness",
        "suggested",
        "plate",
        "dorr",
        "different",
        "kind",
        "putative",
        "counterexample",
        "minimality",
        "involves",
        "perfectly",
        "natural",
        "property",
        "rigid",
        "sense",
        "whatever",
        "instantiates",
        "fails",
        "instantiate",
        "necessarily",
        "tsb",
        "true",
        "f",
        "rigid",
        "tsb",
        "remains",
        "true",
        "perfectly",
        "natural",
        "property",
        "replaced",
        "perfectly",
        "natural",
        "property",
        "distinct",
        "f",
        "example",
        "one",
        "held",
        "every",
        "electron",
        "necessarily",
        "electron",
        "exists",
        "every",
        "nonelectron",
        "necessarily",
        "electron",
        "exists",
        "minimality",
        "would",
        "rule",
        "claiming",
        "electron",
        "perfectly",
        "natural",
        "eddon",
        "argues",
        "certain",
        "rigid",
        "relation",
        "among",
        "property",
        "perfectly",
        "natural",
        "thus",
        "make",
        "trouble",
        "minimality",
        "one",
        "example",
        "threeplace",
        "sum",
        "relation",
        "hold",
        "example",
        "determinate",
        "mass",
        "property",
        "exactly",
        "kg",
        "mass",
        "exactly",
        "kg",
        "mass",
        "exactly",
        "kg",
        "mass",
        "finally",
        "argued",
        "minimality",
        "ground",
        "certain",
        "higherlevel",
        "property",
        "perfectly",
        "natural",
        "despite",
        "supervening",
        "perfectly",
        "natural",
        "lowerlevel",
        "property",
        "example",
        "bennett",
        "argues",
        "property",
        "schmoton",
        "a",
        "certain",
        "kind",
        "complex",
        "particlemight",
        "perfectly",
        "natural",
        "despite",
        "supervening",
        "perfectly",
        "natural",
        "property",
        "argument",
        "based",
        "list",
        "criterion",
        "take",
        "jointly",
        "sufficient",
        "perfect",
        "naturalness",
        "including",
        "figuring",
        "fundamental",
        "law",
        "two",
        "one",
        "instance",
        "duplicate",
        "minimality",
        "allows",
        "wide",
        "variety",
        "interesting",
        "modal",
        "connection",
        "within",
        "class",
        "perfectly",
        "natural",
        "property",
        "long",
        "take",
        "specific",
        "form",
        "supervenience",
        "claim",
        "many",
        "author",
        "attracted",
        "towards",
        "much",
        "sweeping",
        "claim",
        "modal",
        "independence",
        "often",
        "inspired",
        "humean",
        "slogan",
        "necessary",
        "connection",
        "distinct",
        "existence",
        "lewis",
        "b",
        "defends",
        "principle",
        "recombination",
        "see",
        "entry",
        "possible",
        "world",
        "entail",
        "example",
        "two",
        "possiblyinstantiated",
        "conjunction",
        "perfectly",
        "natural",
        "property",
        "possibly",
        "instantiated",
        "world",
        "depending",
        "principle",
        "precisified",
        "may",
        "also",
        "entail",
        "two",
        "possiblyinstantiated",
        "conjunction",
        "perfectly",
        "natural",
        "monadic",
        "property",
        "f",
        "g",
        "perfectly",
        "natural",
        "binary",
        "relation",
        "r",
        "possible",
        "instance",
        "f",
        "bear",
        "r",
        "instance",
        "g",
        "particularly",
        "farreaching",
        "claim",
        "sort",
        "go",
        "name",
        "combinatorialism",
        "idea",
        "logically",
        "possible",
        "pattern",
        "property",
        "might",
        "distributed",
        "possibly",
        "instantiated",
        "given",
        "perfectly",
        "natural",
        "property",
        "example",
        "since",
        "logically",
        "possible",
        "monadic",
        "property",
        "exactly",
        "seven",
        "instance",
        "binary",
        "relation",
        "hold",
        "two",
        "instance",
        "perfectly",
        "natural",
        "property",
        "f",
        "perfectly",
        "natural",
        "binary",
        "relation",
        "r",
        "metaphysically",
        "possible",
        "f",
        "exactly",
        "seven",
        "instance",
        "r",
        "hold",
        "two",
        "kind",
        "combinatorialism",
        "true",
        "could",
        "powerful",
        "tool",
        "figuring",
        "whether",
        "property",
        "perfectly",
        "natural",
        "since",
        "many",
        "collection",
        "property",
        "might",
        "otherwise",
        "seem",
        "good",
        "candidate",
        "perfectly",
        "natural",
        "seem",
        "involved",
        "kind",
        "necessary",
        "connection",
        "according",
        "combinatorialism",
        "never",
        "obtain",
        "among",
        "perfectly",
        "natural",
        "property",
        "worry",
        "want",
        "use",
        "argument",
        "like",
        "eliminate",
        "certain",
        "candidate",
        "collection",
        "perfectly",
        "natural",
        "property",
        "otherwise",
        "acceptable",
        "candidate",
        "collection",
        "might",
        "turn",
        "involved",
        "apparent",
        "necessary",
        "connection",
        "face",
        "choice",
        "giving",
        "combinatorialism",
        "rejecting",
        "relevant",
        "prima",
        "facie",
        "modal",
        "judgment",
        "illustrate",
        "difficulty",
        "return",
        "example",
        "mass",
        "insofar",
        "one",
        "take",
        "physic",
        "guide",
        "perfectly",
        "natural",
        "pressure",
        "think",
        "perfectly",
        "natural",
        "property",
        "mass",
        "great",
        "many",
        "possible",
        "candidate",
        "including",
        "maximally",
        "specific",
        "monadic",
        "mass",
        "property",
        "object",
        "like",
        "mass",
        "gram",
        "le",
        "specific",
        "monadic",
        "mass",
        "property",
        "object",
        "like",
        "mass",
        "gram",
        "mass",
        "wilson",
        "binary",
        "relation",
        "object",
        "real",
        "number",
        "like",
        "mass",
        "gram",
        "mass",
        "kilogram",
        "morethantwo",
        "place",
        "relation",
        "object",
        "number",
        "like",
        "mass",
        "ratio",
        "relation",
        "x",
        "n",
        "time",
        "massive",
        "y",
        "binary",
        "relation",
        "among",
        "object",
        "like",
        "mass",
        "greater",
        "mass",
        "time",
        "massive",
        "time",
        "massive",
        "morethantwo",
        "place",
        "relation",
        "among",
        "object",
        "like",
        "z",
        "massive",
        "x",
        "y",
        "put",
        "together",
        "z",
        "intermediate",
        "x",
        "y",
        "mass",
        "w",
        "z",
        "stand",
        "massratio",
        "x",
        "y",
        "relation",
        "among",
        "property",
        "like",
        "f",
        "maximally",
        "specific",
        "mass",
        "property",
        "sum",
        "maximally",
        "specific",
        "mass",
        "property",
        "g",
        "h",
        "see",
        "mundy",
        "eddon",
        "relation",
        "linking",
        "mass",
        "scale",
        "like",
        "mass",
        "x",
        "equal",
        "distance",
        "y",
        "z",
        "unit",
        "speed",
        "light",
        "newton",
        "gravitational",
        "constant",
        "within",
        "candidate",
        "family",
        "one",
        "formulate",
        "certain",
        "law",
        "might",
        "plausibly",
        "claimed",
        "metaphysically",
        "necessary",
        "example",
        "tempting",
        "suppose",
        "would",
        "metaphysically",
        "rather",
        "merely",
        "nomically",
        "impossible",
        "object",
        "one",
        "gram",
        "mass",
        "two",
        "gram",
        "mass",
        "one",
        "object",
        "equal",
        "mass",
        "another",
        "twice",
        "massive",
        "combine",
        "judgment",
        "combinatorialism",
        "deny",
        "family",
        "considered",
        "consists",
        "entirely",
        "perfectly",
        "natural",
        "property",
        "question",
        "one",
        "imagine",
        "many",
        "way",
        "masstheoretic",
        "property",
        "might",
        "supervene",
        "perfectly",
        "natural",
        "property",
        "yet",
        "word",
        "manner",
        "consistent",
        "relevant",
        "modal",
        "judgment",
        "however",
        "precisely",
        "many",
        "way",
        "might",
        "achieved",
        "response",
        "threatens",
        "lead",
        "sort",
        "scepticism",
        "ability",
        "know",
        "perfectly",
        "natural",
        "property",
        "property",
        "word",
        "supervene",
        "combinatorialists",
        "thus",
        "reason",
        "open",
        "idea",
        "relevant",
        "law",
        "might",
        "turn",
        "surprisingly",
        "metaphysically",
        "contingent",
        "though",
        "may",
        "still",
        "nomologcally",
        "necessary"
    ]
}