{
    "main_text": "Neo-Aristotelian Naturalism\n5. Neo-Aristotelian Naturalism\n\nAristotelianism has had adherents since… well, since Aristotle.\nEven in the dark times of the mid-20th century, when naturalism was in\ndisrepute, post-Moore, Aristotelians like Elizabeth Anscombe kept the\nflame alive (Anscombe 1958). Neo-Aristotelianism has both ethical and\nmetaethical commitments. We’ll primarily be looking at the\nmetaethical aspects of neo-Aristotelian naturalism, but first-order\nethics will make an appearance as well.\n\nWe can characterize Aristotelian naturalism by four major ideas. The\nfirst is that there is no one property of goodness. The goodness of a\ngood toaster is different from the goodness of a good movie, which is\ndifferent from the goodness of a good time to dance, which is\ndifferent from the goodness of a good person. To be a good thing is to\nbe a good thing of its kind. The second is that this fact is mirrored\nin our language. The semantics for goodness is attributive rather than\npredicative (more on this shortly). The third is that the most\nfundamental ethical concept is the concept of a good person. Good\nactions are the actions a good person will do, good things are the\nthings that good people will desire or pursue, and good practical\nreasoning is reasoning in the way that good people reason. And the\nfourth is that the standards that make something good are derivable\nfrom the nature of the kind of thing it is. So what makes someone a\ngood person is derivable from the kind of thing a human person is.\nThis implies that morality is derivable from biology – although\nthis biological conception of human goodness is quite controversial,\neven among Aristotelians.\n\nLet’s start by looking what Aristotelians say about the\nsemantics of ‘good.’ Contemporary Aristotelians follow\nPeter Geach (1956) in distinguishing between two different kinds of\nadjective: attributive and predicative. The difference between the two\ncomes from whether they validate the following inference pattern:\n\nX is an F G.\nX is an H.\nTherefore, X is an F H.\n\n\nIf F is a predicative adjective, that inference will be\nvalid. If F is an attributive adjective, then it won’t.\nTo make this concrete, consider the following instances of this\nschema:\n\nJerry is a brown mouse.\nJerry is an animal.\nTherefore, Jerry is a brown animal.\n\n\n4–6 is valid. If Jerry is a brown mouse, then he’s a brown\nanimal. Therefore, ‘brown’ is a predicative adjective.\nPredicative adjectives refer to the same property in all contexts.\nCompare this to:\n\nJerry is a large mouse.\nJerry is an animal.\nTherefore, Jerry is a large animal.\n\n\n7–9 is not valid. A large mouse is still a very small animal.\nTherefore, ‘large’ is an attributive adjective. The\nmeaning of an attributive adjective in any given context is determined\nby the noun that it is modifying. “Large mouse” means\n(something like) “Large for a mouse.”\n\nWith this in mind, consider the following argument:\n\nFrank is a good tennis player.\nFrank is a husband and father.\nFrank is a good husband and father.\n\n\nThis is clearly invalid. Frank might have a powerful serve and a\nwicked backhand, yet neglect his family. This indicates that\n‘good’ is attributive (although see Szabó 2001).\n‘Good’ does not refer to the same property of goodness in\nall contexts. Instead, ‘good K’ means something like\n‘good-for-a-K.’\n\nJudith Jarvis Thomson has influentially expanded on Geach’s\nbasic idea. According to Thomson, there is a property of being a good\nK only if K is a goodness-fixing kind (Thomson 2008,\n21). For instance, “knife” is a goodness-fixing kind;\nthus, there is the property of being a good knife. Goodness need not\nalways be understood in terms of goodness-fixing kinds. Things can be\ngood in other respects, such as “good for use in making\ncheesecake” or “good for Alfred” (Thomson 1997,\n278). Thomson calls things that are good in this way\n“good-modified.” There is no such thing as “a good\nsmudge,” full stop, because “smudge” is not a\ngoodness-fixing kind in the way “knife” is. But there\nmight be a smudge that is good for using in a Rorschach test, because\n“being used in a Rorschach test” is a way that smudges can\nbe good-modified (Thomson 2008, 21–22).\n\nThomson holds that it makes no sense to ask whether an act is good or\nnot, because “act”, like “smudge”, is not a\ngoodness-fixing kind. Accordingly, acts can only be good-modified;\nthey can be good in some respect – e.g., a moral respect. Acts\nare morally good when they spring from an agent’s morally\nvirtuous traits. A moral virtue is any trait such that an individual\nof a kind K is as morally good as a K can be only if it has that trait\n(and it’s possible for to either have or lack that trait)\n(Thomson 2008, 79).\n\nSo what makes a person as good as a person can be? The fourth major\nAristotelian idea is that the standards of goodness for a thing are\ndetermined by the kind of thing it is. But how can a thing’s\nkind determine the standards for that thing? The traditional\nanswer, from Aristotle, says that kinds of things have a particular\nform, or shape. The form of hammers is just their hammer-shape. The\nform of a thing determines its function: the function of a hammer is\nto hammer because hammers are shaped in a way that makes them good for\nhammering. And function thus determines the telos (purpose or\nend) of the thing: hammers are for hammering, and a good hammer is one\nthat hammers well. All of this can be understood in unmysterious,\nnaturalistic terms. We can apply this same model to human beings. The\nform of a human determines what the specific human function is. And a\ngood person is, therefore, someone who performs that function well by\nsatisfying the characteristic ends of human life. \n\nThe most influential account of human ends comes from Rosalind\nHursthouse. Hursthouse says that human life is characterized by four\nends: survival, reproduction, characteristic enjoyment and freedom\nfrom pain, and the good functioning of the group. Survival and\nreproduction are common to all living things, including plants. But\nthe manner in which these ends should be pursued are characteristic of\nthe species. Penguins have one characteristic way of reproducing and\nlions have another (Hursthouse 1999, Ch 9). The characteristically\nhuman way of pursuing these four human ends is by the use of\nrationality. Humans alone among the animals act not from mere\ninstinct, but from a rational capacity of deliberation and choice. So\ngood, “flourishing” humans are those who pursue the four\nends in accordance with reason. Like many other neo-Aristotelians,\nHursthouse uses the word “flourishing” as an English\ntranslation of Aristotle’s eudaimonia, since it nicely\ncaptures the analogy with other kinds of living organism that is\ncentral to Aristotelian naturalism. But ‘flourishing’\nmight not be the best word, since it may misleadingly imply an\nuntroubled life (Foot 2001, Ch 6).\n\nA common objection at this point is that the notion of an end or\ntelos, while central to Aristotle’s conception of\nbiology, is much more controversial in a Darwinian biological paradigm\n(Millum 2006; compare Moosavi 2022a). This is particularly true if we\nare talking about the telos of an organism as a whole; many\nphilosophers of biology will still be happy to say that the purpose of\nthe heart is to pump blood, but it’s not clear that it makes\nsense to talk about the purpose of a human being. For this reason,\nmany neo-Aristotelians prefer to avoid (or at least de-emphasize) the\nidea of a human telos and instead talk in terms of what\nMichael Thompson has called “Aristotelian categoricals”\n(Thompson 2008, Ch 4). These are claims like like “Oak trees\nhave deep, sturdy roots” or “Humans have 32 teeth.”\nAristotelian categoricals are not necessarily true of all, or even\nmost, members of a species; most humans have less than 32 teeth\n(Anscombe 1958). Rather, they describe something important about the\nnature, or the characteristic form of life, of different\nkinds of living things (McDowell 1998). They say what\n“should” be the case for a member of a species, or what\nwill be true of an organism insofar as it is flourishing. In this way,\nAristotelian categoricals are both descriptive biological claims but\nalso, in a way, evaluative.\n\nAristotelian categoricals allow us to evaluate organisms in a\nstraightforwardly naturalistic way. An oak tree with deep, sturdy\nroots is (at least in this respect) flourishing, while one without\ndeep, sturdy roots is defective. Similarly, then, a good person is\nflourishing insofar as they participate in characteristically human\nways of life, and bad people are defective in the same sense that an\noak without deep, sturdy roots is defective. “A bad tree.”\nThe only difference is that humans and oak trees participate in very\ndifferent ways of life. The aptness of the comparison is better\nillustrated by looking at other social animals, like wolves. Wolves\nhunt in packs; that is their characteristic way of life. A wolf that\nhunts in a pack flourishes, while a wolf that hunts by itself is\ndefective. A good life for a wolf is partly a matter of cooperating\nwith others of its kind to achieve further ends which are constitutive\nof a flourishing life (Foot 2001, 16). So, too, with humans. The\ncharacteristic ways of life for any given thing are what we might call\nthe virtues of that thing; deep, sturdy roots are virtues in an oak.\nThe distinctively human virtues are the virtues that are particular to\nhuman life, which is a social life governed by rational deliberation.\nAnd those are just the traditional virtues of moral philosophy:\ncourage, humility, generosity, and so on (Foot 2001, Ch 5). Humans\nwith those virtues are, in that respect, flourishing. Those that lack\nthe virtues are defective.\n\nLet’s turn to some objections. First, consider the\nAristotelian’s claim that goodness is an attributive adjective.\nIt’s quite plausible that goodness functions like an attributive\nadjective sometimes: a good tennis player might be a bad father. But\nthere might also be a predicative use of the word ‘good.’\nFor instance, consider the idea of a “good state of\naffairs.” It is hard to give the ‘good’ in\n“good state of affairs” an attributive reading: states of\naffairs aren’t what Thomson calls a good-fixing kind. Thomson\nargues that this means that it’s incoherent to say that there\ncould be such a thing as a good state of affairs; she takes this to be\na strong challenge to consequentialism (Thomson 2008, 62). But if the\nnotion of a good state of affairs is intelligible, perhaps\n“good” sometimes serves as a predicative adjective that\nrefers to a property of (moral) goodness (Sturgeon 2010).\n\nSecond, whether we evaluate human organisms in terms of a\ntelos or a characteristic form of life, it’s not clear\nhow these kinds of evaluations are relevant to ethics. Even if there\nis a characteristic way of human life, why should we live that way\nourselves? What is normative about “natural\ngoodness” (Prinz 2009)? Living a characteristic human life might\nbe a very bad way to live. There are some characteristic ways of human\nlife that seem to be quite bad: for example, destroying the\nenvironment, fighting ideological wars, and having a sense of altruism\nthat is limited to a relatively small circle of family and friends.\nNeo-Aristotelians seem to assume a rather rosy picture of human nature\nthat’s hard to square with a serious study of history or\nsociology (Williams 1972; Millgram 2009).\n\nNeo-Aristotelians typically answer this worry by appealing to the role\nof reason (Hacker-Wright 2009; Lott 2012; Jordan 2020). The supreme\nhuman virtue that characterizes a flourishing human life is\nphronesis, the virtue of being able to reason well about how\nto act (Hursthouse 1999, Ch 4). So fighting ideological wars is not\ncharacteristic of human life because it’s not reasonable to\nfight ideological wars; that’s not how a good person, one with\nphronesis, would act. This way of operationalizing\nAristotelianism throws out the idea that discerning natural goodness\nis a matter of applied biology (Hursthouse 1999, 178–191). The\ncharacteristic form of human life is defined ethically, not\nbiologically (Nussbaum 1995).\n\nOne might well worry that this abandons the naturalistic character of\nAristotelianism. Aristotelians typically reply that to be a good\nperson is just to be a certain sort of human organism with certain\nmental characteristics (which amounts to having a brain that is\nfunctionally organized in a certain way). So (recalling our\ndistinctions from Section 1), while neo-Aristotelians accept Property\nNaturalism and most accept Fact Naturalism, many end up rejecting\nMethodological Naturalism (Hursthouse 1999, Ch 10; Moosavi 2022b). But\nJohn McDowell has argued that the human virtues are\n“natural” only insofar as they relate to the\n“nature” of human beings, and human nature is not a\nsubject for scientific investigation (McDowell 1998). Micah Lott has\nargued that neo-Aristotelians should give up on pretensions to\nnaturalism (Lott 2020).\n\nThree further problems linger. First, appealing to practical reason to\nsolve the problem of normativity seems to undermine the core\nAristotelian idea that we can define a good person in terms of what is\ndistinctive of human life. Kant argued that Aristotle was wrong to\nground ethics in the form of a human life, since what matters for\nethics is the form of pure practical reason. Contemporary\nAristotelianism seems to concede this point to Kant (Woodcock 2018;\nbut see Jordan 2020 or McKracken 2021). Second, neo-Aristotelianism\nlooks circular. One of the main ideas of Aristotelianism is that the\ngoodness of a good person is the fundamental moral concept, but if we\ndefine a good person in ethical terms, we’ve gone in a circle.\nBrown (2016) responds that a good person is defined in teleological\nrather than ethical terms, but this just raises the question of how we\ndefine teleology. Biological definitions seem inadequate, but\nnormative definitions make the account circular once again. Third,\neven if the circularity concerns can be answered, we might worry that\na larger epistemological problem remains. How can we identify virtuous\nagents? Abandoning Methodological Naturalism might create more\nproblems than it solves (but see Jordan 2016).\n",
    "section_title": "5. Neo-Aristotelian Naturalism",
    "entry_title": "Moral Naturalism",
    "hierarchy_title": "Moral Naturalism || Neo-Aristotelian Naturalism",
    "tokenized_text": [
        "neoaristotelian",
        "naturalism",
        "neoaristotelian",
        "naturalism",
        "aristotelianism",
        "adherent",
        "since",
        "well",
        "since",
        "aristotle",
        "even",
        "dark",
        "time",
        "midth",
        "century",
        "naturalism",
        "disrepute",
        "postmoore",
        "aristotelian",
        "like",
        "elizabeth",
        "anscombe",
        "kept",
        "flame",
        "alive",
        "anscombe",
        "neoaristotelianism",
        "ethical",
        "metaethical",
        "commitment",
        "primarily",
        "looking",
        "metaethical",
        "aspect",
        "neoaristotelian",
        "naturalism",
        "firstorder",
        "ethic",
        "make",
        "appearance",
        "well",
        "characterize",
        "aristotelian",
        "naturalism",
        "four",
        "major",
        "idea",
        "first",
        "one",
        "property",
        "goodness",
        "goodness",
        "good",
        "toaster",
        "different",
        "goodness",
        "good",
        "movie",
        "different",
        "goodness",
        "good",
        "time",
        "dance",
        "different",
        "goodness",
        "good",
        "person",
        "good",
        "thing",
        "good",
        "thing",
        "kind",
        "second",
        "fact",
        "mirrored",
        "language",
        "semantics",
        "goodness",
        "attributive",
        "rather",
        "predicative",
        "shortly",
        "third",
        "fundamental",
        "ethical",
        "concept",
        "concept",
        "good",
        "person",
        "good",
        "action",
        "action",
        "good",
        "person",
        "good",
        "thing",
        "thing",
        "good",
        "people",
        "desire",
        "pursue",
        "good",
        "practical",
        "reasoning",
        "reasoning",
        "way",
        "good",
        "people",
        "reason",
        "fourth",
        "standard",
        "make",
        "something",
        "good",
        "derivable",
        "nature",
        "kind",
        "thing",
        "make",
        "someone",
        "good",
        "person",
        "derivable",
        "kind",
        "thing",
        "human",
        "person",
        "implies",
        "morality",
        "derivable",
        "biology",
        "although",
        "biological",
        "conception",
        "human",
        "goodness",
        "quite",
        "controversial",
        "even",
        "among",
        "aristotelian",
        "let",
        "start",
        "looking",
        "aristotelian",
        "say",
        "semantics",
        "good",
        "contemporary",
        "aristotelian",
        "follow",
        "peter",
        "geach",
        "distinguishing",
        "two",
        "different",
        "kind",
        "adjective",
        "attributive",
        "predicative",
        "difference",
        "two",
        "come",
        "whether",
        "validate",
        "following",
        "inference",
        "pattern",
        "x",
        "f",
        "g",
        "x",
        "h",
        "therefore",
        "x",
        "f",
        "h",
        "f",
        "predicative",
        "adjective",
        "inference",
        "valid",
        "f",
        "attributive",
        "adjective",
        "make",
        "concrete",
        "consider",
        "following",
        "instance",
        "schema",
        "jerry",
        "brown",
        "mouse",
        "jerry",
        "animal",
        "therefore",
        "jerry",
        "brown",
        "animal",
        "valid",
        "jerry",
        "brown",
        "mouse",
        "brown",
        "animal",
        "therefore",
        "brown",
        "predicative",
        "adjective",
        "predicative",
        "adjective",
        "refer",
        "property",
        "context",
        "compare",
        "jerry",
        "large",
        "mouse",
        "jerry",
        "animal",
        "therefore",
        "jerry",
        "large",
        "animal",
        "valid",
        "large",
        "mouse",
        "still",
        "small",
        "animal",
        "therefore",
        "large",
        "attributive",
        "adjective",
        "meaning",
        "attributive",
        "adjective",
        "given",
        "context",
        "determined",
        "noun",
        "modifying",
        "large",
        "mouse",
        "mean",
        "something",
        "like",
        "large",
        "mouse",
        "mind",
        "consider",
        "following",
        "argument",
        "frank",
        "good",
        "tennis",
        "player",
        "frank",
        "husband",
        "father",
        "frank",
        "good",
        "husband",
        "father",
        "clearly",
        "invalid",
        "frank",
        "might",
        "powerful",
        "serve",
        "wicked",
        "backhand",
        "yet",
        "neglect",
        "family",
        "indicates",
        "good",
        "attributive",
        "although",
        "see",
        "szabó",
        "good",
        "refer",
        "property",
        "goodness",
        "context",
        "instead",
        "good",
        "k",
        "mean",
        "something",
        "like",
        "goodforak",
        "judith",
        "jarvis",
        "thomson",
        "influentially",
        "expanded",
        "geach",
        "basic",
        "idea",
        "according",
        "thomson",
        "property",
        "good",
        "k",
        "k",
        "goodnessfixing",
        "kind",
        "thomson",
        "instance",
        "knife",
        "goodnessfixing",
        "kind",
        "thus",
        "property",
        "good",
        "knife",
        "goodness",
        "need",
        "always",
        "understood",
        "term",
        "goodnessfixing",
        "kind",
        "thing",
        "good",
        "respect",
        "good",
        "use",
        "making",
        "cheesecake",
        "good",
        "alfred",
        "thomson",
        "thomson",
        "call",
        "thing",
        "good",
        "way",
        "goodmodified",
        "thing",
        "good",
        "smudge",
        "full",
        "stop",
        "smudge",
        "goodnessfixing",
        "kind",
        "way",
        "knife",
        "might",
        "smudge",
        "good",
        "using",
        "rorschach",
        "test",
        "used",
        "rorschach",
        "test",
        "way",
        "smudge",
        "goodmodified",
        "thomson",
        "thomson",
        "hold",
        "make",
        "sense",
        "ask",
        "whether",
        "act",
        "good",
        "act",
        "like",
        "smudge",
        "goodnessfixing",
        "kind",
        "accordingly",
        "act",
        "goodmodified",
        "good",
        "respect",
        "eg",
        "moral",
        "respect",
        "act",
        "morally",
        "good",
        "spring",
        "agent",
        "morally",
        "virtuous",
        "trait",
        "moral",
        "virtue",
        "trait",
        "individual",
        "kind",
        "k",
        "morally",
        "good",
        "k",
        "trait",
        "possible",
        "either",
        "lack",
        "trait",
        "thomson",
        "make",
        "person",
        "good",
        "person",
        "fourth",
        "major",
        "aristotelian",
        "idea",
        "standard",
        "goodness",
        "thing",
        "determined",
        "kind",
        "thing",
        "thing",
        "kind",
        "determine",
        "standard",
        "thing",
        "traditional",
        "answer",
        "aristotle",
        "say",
        "kind",
        "thing",
        "particular",
        "form",
        "shape",
        "form",
        "hammer",
        "hammershape",
        "form",
        "thing",
        "determines",
        "function",
        "function",
        "hammer",
        "hammer",
        "hammer",
        "shaped",
        "way",
        "make",
        "good",
        "hammering",
        "function",
        "thus",
        "determines",
        "telos",
        "purpose",
        "end",
        "thing",
        "hammer",
        "hammering",
        "good",
        "hammer",
        "one",
        "hammer",
        "well",
        "understood",
        "unmysterious",
        "naturalistic",
        "term",
        "apply",
        "model",
        "human",
        "being",
        "form",
        "human",
        "determines",
        "specific",
        "human",
        "function",
        "good",
        "person",
        "therefore",
        "someone",
        "performs",
        "function",
        "well",
        "satisfying",
        "characteristic",
        "end",
        "human",
        "life",
        "influential",
        "account",
        "human",
        "end",
        "come",
        "rosalind",
        "hursthouse",
        "hursthouse",
        "say",
        "human",
        "life",
        "characterized",
        "four",
        "end",
        "survival",
        "reproduction",
        "characteristic",
        "enjoyment",
        "freedom",
        "pain",
        "good",
        "functioning",
        "group",
        "survival",
        "reproduction",
        "common",
        "living",
        "thing",
        "including",
        "plant",
        "manner",
        "end",
        "pursued",
        "characteristic",
        "specie",
        "penguin",
        "one",
        "characteristic",
        "way",
        "reproducing",
        "lion",
        "another",
        "hursthouse",
        "ch",
        "characteristically",
        "human",
        "way",
        "pursuing",
        "four",
        "human",
        "end",
        "use",
        "rationality",
        "human",
        "alone",
        "among",
        "animal",
        "act",
        "mere",
        "instinct",
        "rational",
        "capacity",
        "deliberation",
        "choice",
        "good",
        "flourishing",
        "human",
        "pursue",
        "four",
        "end",
        "accordance",
        "reason",
        "like",
        "many",
        "neoaristotelians",
        "hursthouse",
        "us",
        "word",
        "flourishing",
        "english",
        "translation",
        "aristotle",
        "eudaimonia",
        "since",
        "nicely",
        "capture",
        "analogy",
        "kind",
        "living",
        "organism",
        "central",
        "aristotelian",
        "naturalism",
        "flourishing",
        "might",
        "best",
        "word",
        "since",
        "may",
        "misleadingly",
        "imply",
        "untroubled",
        "life",
        "foot",
        "ch",
        "common",
        "objection",
        "point",
        "notion",
        "end",
        "telos",
        "central",
        "aristotle",
        "conception",
        "biology",
        "much",
        "controversial",
        "darwinian",
        "biological",
        "paradigm",
        "millum",
        "compare",
        "moosavi",
        "a",
        "particularly",
        "true",
        "talking",
        "telos",
        "organism",
        "whole",
        "many",
        "philosopher",
        "biology",
        "still",
        "happy",
        "say",
        "purpose",
        "heart",
        "pump",
        "blood",
        "clear",
        "make",
        "sense",
        "talk",
        "purpose",
        "human",
        "reason",
        "many",
        "neoaristotelians",
        "prefer",
        "avoid",
        "least",
        "deemphasize",
        "idea",
        "human",
        "telos",
        "instead",
        "talk",
        "term",
        "michael",
        "thompson",
        "called",
        "aristotelian",
        "categoricals",
        "thompson",
        "ch",
        "claim",
        "like",
        "like",
        "oak",
        "tree",
        "deep",
        "sturdy",
        "root",
        "human",
        "teeth",
        "aristotelian",
        "categoricals",
        "necessarily",
        "true",
        "even",
        "member",
        "specie",
        "human",
        "le",
        "teeth",
        "anscombe",
        "rather",
        "describe",
        "something",
        "important",
        "nature",
        "characteristic",
        "form",
        "life",
        "different",
        "kind",
        "living",
        "thing",
        "mcdowell",
        "say",
        "case",
        "member",
        "specie",
        "true",
        "organism",
        "insofar",
        "flourishing",
        "way",
        "aristotelian",
        "categoricals",
        "descriptive",
        "biological",
        "claim",
        "also",
        "way",
        "evaluative",
        "aristotelian",
        "categoricals",
        "allow",
        "u",
        "evaluate",
        "organism",
        "straightforwardly",
        "naturalistic",
        "way",
        "oak",
        "tree",
        "deep",
        "sturdy",
        "root",
        "least",
        "respect",
        "flourishing",
        "one",
        "without",
        "deep",
        "sturdy",
        "root",
        "defective",
        "similarly",
        "good",
        "person",
        "flourishing",
        "insofar",
        "participate",
        "characteristically",
        "human",
        "way",
        "life",
        "bad",
        "people",
        "defective",
        "sense",
        "oak",
        "without",
        "deep",
        "sturdy",
        "root",
        "defective",
        "bad",
        "tree",
        "difference",
        "human",
        "oak",
        "tree",
        "participate",
        "different",
        "way",
        "life",
        "aptness",
        "comparison",
        "better",
        "illustrated",
        "looking",
        "social",
        "animal",
        "like",
        "wolf",
        "wolf",
        "hunt",
        "pack",
        "characteristic",
        "way",
        "life",
        "wolf",
        "hunt",
        "pack",
        "flourish",
        "wolf",
        "hunt",
        "defective",
        "good",
        "life",
        "wolf",
        "partly",
        "matter",
        "cooperating",
        "others",
        "kind",
        "achieve",
        "end",
        "constitutive",
        "flourishing",
        "life",
        "foot",
        "human",
        "characteristic",
        "way",
        "life",
        "given",
        "thing",
        "might",
        "call",
        "virtue",
        "thing",
        "deep",
        "sturdy",
        "root",
        "virtue",
        "oak",
        "distinctively",
        "human",
        "virtue",
        "virtue",
        "particular",
        "human",
        "life",
        "social",
        "life",
        "governed",
        "rational",
        "deliberation",
        "traditional",
        "virtue",
        "moral",
        "philosophy",
        "courage",
        "humility",
        "generosity",
        "foot",
        "ch",
        "human",
        "virtue",
        "respect",
        "flourishing",
        "lack",
        "virtue",
        "defective",
        "let",
        "turn",
        "objection",
        "first",
        "consider",
        "aristotelian",
        "claim",
        "goodness",
        "attributive",
        "adjective",
        "quite",
        "plausible",
        "goodness",
        "function",
        "like",
        "attributive",
        "adjective",
        "sometimes",
        "good",
        "tennis",
        "player",
        "might",
        "bad",
        "father",
        "might",
        "also",
        "predicative",
        "use",
        "word",
        "good",
        "instance",
        "consider",
        "idea",
        "good",
        "state",
        "affairs",
        "hard",
        "give",
        "good",
        "good",
        "state",
        "affair",
        "attributive",
        "reading",
        "state",
        "affair",
        "thomson",
        "call",
        "goodfixing",
        "kind",
        "thomson",
        "argues",
        "mean",
        "incoherent",
        "say",
        "could",
        "thing",
        "good",
        "state",
        "affair",
        "take",
        "strong",
        "challenge",
        "consequentialism",
        "thomson",
        "notion",
        "good",
        "state",
        "affair",
        "intelligible",
        "perhaps",
        "good",
        "sometimes",
        "serf",
        "predicative",
        "adjective",
        "refers",
        "property",
        "moral",
        "goodness",
        "sturgeon",
        "second",
        "whether",
        "evaluate",
        "human",
        "organism",
        "term",
        "telos",
        "characteristic",
        "form",
        "life",
        "clear",
        "kind",
        "evaluation",
        "relevant",
        "ethic",
        "even",
        "characteristic",
        "way",
        "human",
        "life",
        "live",
        "way",
        "normative",
        "natural",
        "goodness",
        "prinz",
        "living",
        "characteristic",
        "human",
        "life",
        "might",
        "bad",
        "way",
        "live",
        "characteristic",
        "way",
        "human",
        "life",
        "seem",
        "quite",
        "bad",
        "example",
        "destroying",
        "environment",
        "fighting",
        "ideological",
        "war",
        "sense",
        "altruism",
        "limited",
        "relatively",
        "small",
        "circle",
        "family",
        "friend",
        "neoaristotelians",
        "seem",
        "assume",
        "rather",
        "rosy",
        "picture",
        "human",
        "nature",
        "hard",
        "square",
        "serious",
        "study",
        "history",
        "sociology",
        "williams",
        "millgram",
        "neoaristotelians",
        "typically",
        "answer",
        "worry",
        "appealing",
        "role",
        "reason",
        "hackerwright",
        "lott",
        "jordan",
        "supreme",
        "human",
        "virtue",
        "characterizes",
        "flourishing",
        "human",
        "life",
        "phronesis",
        "virtue",
        "able",
        "reason",
        "well",
        "act",
        "hursthouse",
        "ch",
        "fighting",
        "ideological",
        "war",
        "characteristic",
        "human",
        "life",
        "reasonable",
        "fight",
        "ideological",
        "war",
        "good",
        "person",
        "one",
        "phronesis",
        "would",
        "act",
        "way",
        "operationalizing",
        "aristotelianism",
        "throw",
        "idea",
        "discerning",
        "natural",
        "goodness",
        "matter",
        "applied",
        "biology",
        "hursthouse",
        "characteristic",
        "form",
        "human",
        "life",
        "defined",
        "ethically",
        "biologically",
        "nussbaum",
        "one",
        "might",
        "well",
        "worry",
        "abandon",
        "naturalistic",
        "character",
        "aristotelianism",
        "aristotelian",
        "typically",
        "reply",
        "good",
        "person",
        "certain",
        "sort",
        "human",
        "organism",
        "certain",
        "mental",
        "characteristic",
        "amount",
        "brain",
        "functionally",
        "organized",
        "certain",
        "way",
        "recalling",
        "distinction",
        "section",
        "neoaristotelians",
        "accept",
        "property",
        "naturalism",
        "accept",
        "fact",
        "naturalism",
        "many",
        "end",
        "rejecting",
        "methodological",
        "naturalism",
        "hursthouse",
        "ch",
        "moosavi",
        "b",
        "john",
        "mcdowell",
        "argued",
        "human",
        "virtue",
        "natural",
        "insofar",
        "relate",
        "nature",
        "human",
        "being",
        "human",
        "nature",
        "subject",
        "scientific",
        "investigation",
        "mcdowell",
        "micah",
        "lott",
        "argued",
        "neoaristotelians",
        "give",
        "pretension",
        "naturalism",
        "lott",
        "three",
        "problem",
        "linger",
        "first",
        "appealing",
        "practical",
        "reason",
        "solve",
        "problem",
        "normativity",
        "seems",
        "undermine",
        "core",
        "aristotelian",
        "idea",
        "define",
        "good",
        "person",
        "term",
        "distinctive",
        "human",
        "life",
        "kant",
        "argued",
        "aristotle",
        "wrong",
        "ground",
        "ethic",
        "form",
        "human",
        "life",
        "since",
        "matter",
        "ethic",
        "form",
        "pure",
        "practical",
        "reason",
        "contemporary",
        "aristotelianism",
        "seems",
        "concede",
        "point",
        "kant",
        "woodcock",
        "see",
        "jordan",
        "mckracken",
        "second",
        "neoaristotelianism",
        "look",
        "circular",
        "one",
        "main",
        "idea",
        "aristotelianism",
        "goodness",
        "good",
        "person",
        "fundamental",
        "moral",
        "concept",
        "define",
        "good",
        "person",
        "ethical",
        "term",
        "gone",
        "circle",
        "brown",
        "responds",
        "good",
        "person",
        "defined",
        "teleological",
        "rather",
        "ethical",
        "term",
        "raise",
        "question",
        "define",
        "teleology",
        "biological",
        "definition",
        "seem",
        "inadequate",
        "normative",
        "definition",
        "make",
        "account",
        "circular",
        "third",
        "even",
        "circularity",
        "concern",
        "answered",
        "might",
        "worry",
        "larger",
        "epistemological",
        "problem",
        "remains",
        "identify",
        "virtuous",
        "agent",
        "abandoning",
        "methodological",
        "naturalism",
        "might",
        "create",
        "problem",
        "solves",
        "see",
        "jordan"
    ]
}