{
    "main_text": "Can general theories of law be value-free? moral-value-free?\n5. Can general theories of law be value-free? moral-value-free?\n\n\nDescriptions of the valuations made by particular persons or societies\ncan of course be value-free. Doubtless the historian, detective or\nother observer thinks there is some value in making the investigation\nand resultant description, but that valuation in no way need enter\ninto the description. Still less need the description either approve\nor disapprove of the valuations which it reports.  But the situation\nis different if one’s aspiration is to offer a general\naccount of human practices or institutions, such as law,\nfriendship, constitutions, and so forth. Here one confronts the\nnecessity of selecting and prioritizing not merely the investigation\nitself but rather some one set of concepts (and corresponding terms)\nfrom among (or over and above) the range of terms and concepts already\nemployed in the self-understanding of the individuals and groups under\n(or available for) study.\n\n\nWhere the subject-matter of the projected descriptive general\naccount is some practice or institution devised by (more or less\nadequate exercises of) reason, and addressed to the rational\ndeliberations of individuals and groups, there will normally be no\ngood reason not to prioritise those forms of the practice or\ninstitution which are more rational, more reasonable, more responsive\nto reasons, than other forms of the “same” or analogous\npractices and institutions. The standard for assessing reasonableness\nfor this theoretical purpose is, in the last analysis, the set of\ncriteria of reasonableness that the descriptive theorist would use in\ndealing with similar practical issues in his or her own life.\n\n\nThis necessity of value-laden selection of concepts and terms for use\nin a general theory of social realities such as law is evidenced in\nthe work of Max Weber, prophet of “value-free” social\nscience. His account, for example, of forms of domination\n(Herrschaft) identifies three pure, central, characteristic\ntypes (Idealtypen): charismatic, traditional, and rational\n(bureaucratic, legal). But the accounts of the first two types are\nalmost entirely in terms of how they differ from the rational type,\nwhose rationality is self-evident to Weber and his readers on the\nbasis of their own knowledge of human goods (basic aspects of human\nwellbeing) and related practical truths. See Finnis 1985,\n170–72. Natural law theory, as one sees it practiced already in\nAristotle’s Ethics and Politics, makes these\nvaluations by the theorist overt and explicit (not hidden and\nembarrassed), and subjects them to rational scrutiny and debate.\n\n\nRaz, Dickson, and others accept that some such valuation is necessary,\nbut deny that it is moral: Dickson 2001. But once one begins to deal\nin reasons, can anything other than good reasons count?  If moral\nreason is nothing more than practical reason at full stretch, fully\ncritical and adequate as reason, moral reasons will have a decisive\nplace in concept-formation in social science including descriptive\ngeneral theory of law. And this will not have the effect feared by\nHart, viz. of leaving the study of wicked laws or institutions to some\nother discipline: Hart 1961, 205; 1994, 209. On the contrary, they are\na subject of lively attention in such a theory, precisely because of\ntheir opposition to legal systems of a (substantively and\nprocedurally) morally good kind. Aristotle’s Politics, though\nnot methodologically flawless overall, is a primary witness to this\nsort of clear-eyed acknowledgment and depiction of unreasonable social\nforms, practices and institutions within a descriptive theory oriented\nby the moral judgments of the theorist.\n\n                 \nStill, descriptive social theory is only a subordinate aspect of\nnatural law theories of law. Their primary focus is typically on\nidentifying the conditions under which law is justified, both in the\nsense in which law can and should be preferable to anarchy or tyranny\nor even benevolent “rule of men,” and in the sense in\nwhich this or that legal principle, institution or rule can be judged\nto be preferable to alternative reasons or purported reasons for\naction. As Green 2003 says:\n\n\nEvaluative argument is, of course, central to the philosophy of law\nmore generally. No legal philosopher can be only a legal\npositivist. A complete theory of law requires also an account of what\nkinds of things could possibly count as merits of law (must law be\nefficient or elegant as well as just?); of what role law should play\nin adjudication (should valid law always be applied?); of what claim\nlaw has on our obedience (is there a duty to obey?); and also of the\npivotal questions of what laws we should have and whether we should\nhave law at all. Legal positivism does not aspire to answer these\nquestions, though its claim that the existence and content of law\ndepends only on social facts does give them shape.\n\n\nMight it not be better to say: no legal philosopher need, or should,\nbe a legal positivist?  For law’s dependence upon social facts is\nfully acknowledged, and also accounted for, in natural law theories of\nlaw. And this is not a “concession” by natural law\ntheorists, for their main positions were clearly articulated by\nAquinas, many centuries before legal positivism emerged with its\nchallenge to (what it took to be) natural law theory.  Positivist\ncritiques of natural law theory, when they do not rest upon scepticism\nabout the possibility of moral judgment, a scepticism implicitly\ndisavowed in the above passage, rest on misunderstanding of passages\nfrom the works of natural law theorists. On such misunderstandings,\nsee Finnis 1980, 23–55; Soper 1992.\n\n\nAgain: How could such fundamental questions as “Should we have\nlaw at all?” be “given shape” by the positivist\nthesis that law’s existence and content depends only on social facts?\nDoes not Green’s claim invert the reasonable order of inquiry and\nreflection?  Basic human needs and circumstances powerfully suggest to\npeople in virtually all times and places that they should make and\nuphold some norms of the kind we call law, norms which will depend\ndirectly and for the most part on social facts such as custom,\nauthoritative rule-making, and adjudication. Legal philosophy retraces\nand clarifies, critically, that elemental practical reasoning,\nsomewhat as Hart did in Hart 1961, where he constructs a\ndescriptive-explanatory account of law (i.e., refines his and our\nconcept or understanding of law) by explaining how rules differ from\nhabits, how powers have different functions and social value from\nobligations and so are not aptly reducible to obligations (and so also why power-conferring rules are distinct from duty-imposing rules), and how\n“primary” rules for outlawing gross violence, theft and\nfraud need, by reason of their lack of certainty in content\nand application and their immobility, to be supplemented by\n“secondary” rules of recognition, adjudication and change,\nthe remedial supplementation that shifts a society into the domain and\nrule of law and legal system. May not those elements in Hart’s book be\ntaken as an instance of natural law legal theory done in a primarily\ndescriptive (rather than primarily justificatory) mode, and with\nincomplete scrutiny of the resources of practical reason, resources\nbeing drawn upon by the whole explanatory general description of law?\nDoes not Hart’s description, despite its incompleteness, work as well\nas it does precisely because it disinters some elementary\njustifications conceived and put to use by the people whose\nactivities provide the material for the descriptions?  Does he not\nshare the deep methodology of Aristotle and the natural law tradition\n(Finnis 2003) in making his identification of what law is (of\n“the concept of law”) depend upon his account of\nwhy law is a reasonable response to common human needs?\n\nAgain, the question perhaps most central to a general theory of law,\nnamely whether law can have a nature, and if so whether it is to be\nunderstood on the model of artefacts, or alternatively by study of concepts\n(“conceptual analysis”), seems to tackled with most\nexplicitness and attention to different and related kinds of\nsubject-matter by theorists working in the philosophical tradition\nthat is or concerns the topic of this entry: Murphy 2015; Finnis\n2020.\n\nNone of this is to say that a sound legal theory of the kind explained\nin this entry need be called “natural law theory.” Like\nall philosophy, it should be done by considering propositions, not\nlabels.\n",
    "section_title": "5. Can general theories of law be value-free? moral-value-free?",
    "entry_title": "Natural Law Theories",
    "hierarchy_title": "Natural Law Theories || Can general theories of law be value-free? moral-value-free?",
    "tokenized_text": [
        "general",
        "theory",
        "law",
        "valuefree",
        "moralvaluefree",
        "general",
        "theory",
        "law",
        "valuefree",
        "moralvaluefree",
        "description",
        "valuation",
        "made",
        "particular",
        "person",
        "society",
        "course",
        "valuefree",
        "doubtless",
        "historian",
        "detective",
        "observer",
        "think",
        "value",
        "making",
        "investigation",
        "resultant",
        "description",
        "valuation",
        "way",
        "need",
        "enter",
        "description",
        "still",
        "le",
        "need",
        "description",
        "either",
        "approve",
        "disapprove",
        "valuation",
        "report",
        "situation",
        "different",
        "one",
        "aspiration",
        "offer",
        "general",
        "account",
        "human",
        "practice",
        "institution",
        "law",
        "friendship",
        "constitution",
        "forth",
        "one",
        "confronts",
        "necessity",
        "selecting",
        "prioritizing",
        "merely",
        "investigation",
        "rather",
        "one",
        "set",
        "concept",
        "corresponding",
        "term",
        "among",
        "range",
        "term",
        "concept",
        "already",
        "employed",
        "selfunderstanding",
        "individual",
        "group",
        "available",
        "study",
        "subjectmatter",
        "projected",
        "descriptive",
        "general",
        "account",
        "practice",
        "institution",
        "devised",
        "le",
        "adequate",
        "exercise",
        "reason",
        "addressed",
        "rational",
        "deliberation",
        "individual",
        "group",
        "normally",
        "good",
        "reason",
        "prioritise",
        "form",
        "practice",
        "institution",
        "rational",
        "reasonable",
        "responsive",
        "reason",
        "form",
        "analogous",
        "practice",
        "institution",
        "standard",
        "assessing",
        "reasonableness",
        "theoretical",
        "purpose",
        "last",
        "analysis",
        "set",
        "criterion",
        "reasonableness",
        "descriptive",
        "theorist",
        "would",
        "use",
        "dealing",
        "similar",
        "practical",
        "issue",
        "life",
        "necessity",
        "valueladen",
        "selection",
        "concept",
        "term",
        "use",
        "general",
        "theory",
        "social",
        "reality",
        "law",
        "evidenced",
        "work",
        "max",
        "weber",
        "prophet",
        "valuefree",
        "social",
        "science",
        "account",
        "example",
        "form",
        "domination",
        "herrschaft",
        "identifies",
        "three",
        "pure",
        "central",
        "characteristic",
        "type",
        "idealtypen",
        "charismatic",
        "traditional",
        "rational",
        "bureaucratic",
        "legal",
        "account",
        "first",
        "two",
        "type",
        "almost",
        "entirely",
        "term",
        "differ",
        "rational",
        "type",
        "whose",
        "rationality",
        "selfevident",
        "weber",
        "reader",
        "basis",
        "knowledge",
        "human",
        "good",
        "basic",
        "aspect",
        "human",
        "wellbeing",
        "related",
        "practical",
        "truth",
        "see",
        "finnis",
        "natural",
        "law",
        "theory",
        "one",
        "see",
        "practiced",
        "already",
        "aristotle",
        "ethic",
        "politics",
        "make",
        "valuation",
        "theorist",
        "overt",
        "explicit",
        "hidden",
        "embarrassed",
        "subject",
        "rational",
        "scrutiny",
        "debate",
        "raz",
        "dickson",
        "others",
        "accept",
        "valuation",
        "necessary",
        "deny",
        "moral",
        "dickson",
        "one",
        "begin",
        "deal",
        "reason",
        "anything",
        "good",
        "reason",
        "count",
        "moral",
        "reason",
        "nothing",
        "practical",
        "reason",
        "full",
        "stretch",
        "fully",
        "critical",
        "adequate",
        "reason",
        "moral",
        "reason",
        "decisive",
        "place",
        "conceptformation",
        "social",
        "science",
        "including",
        "descriptive",
        "general",
        "theory",
        "law",
        "effect",
        "feared",
        "hart",
        "viz",
        "leaving",
        "study",
        "wicked",
        "law",
        "institution",
        "discipline",
        "hart",
        "contrary",
        "subject",
        "lively",
        "attention",
        "theory",
        "precisely",
        "opposition",
        "legal",
        "system",
        "substantively",
        "procedurally",
        "morally",
        "good",
        "kind",
        "aristotle",
        "politics",
        "though",
        "methodologically",
        "flawless",
        "overall",
        "primary",
        "witness",
        "sort",
        "cleareyed",
        "acknowledgment",
        "depiction",
        "unreasonable",
        "social",
        "form",
        "practice",
        "institution",
        "within",
        "descriptive",
        "theory",
        "oriented",
        "moral",
        "judgment",
        "theorist",
        "still",
        "descriptive",
        "social",
        "theory",
        "subordinate",
        "aspect",
        "natural",
        "law",
        "theory",
        "law",
        "primary",
        "focus",
        "typically",
        "identifying",
        "condition",
        "law",
        "justified",
        "sense",
        "law",
        "preferable",
        "anarchy",
        "tyranny",
        "even",
        "benevolent",
        "rule",
        "men",
        "sense",
        "legal",
        "principle",
        "institution",
        "rule",
        "judged",
        "preferable",
        "alternative",
        "reason",
        "purported",
        "reason",
        "action",
        "green",
        "say",
        "evaluative",
        "argument",
        "course",
        "central",
        "philosophy",
        "law",
        "generally",
        "legal",
        "philosopher",
        "legal",
        "positivist",
        "complete",
        "theory",
        "law",
        "requires",
        "also",
        "account",
        "kind",
        "thing",
        "could",
        "possibly",
        "count",
        "merit",
        "law",
        "must",
        "law",
        "efficient",
        "elegant",
        "well",
        "role",
        "law",
        "play",
        "adjudication",
        "valid",
        "law",
        "always",
        "applied",
        "claim",
        "law",
        "obedience",
        "duty",
        "obey",
        "also",
        "pivotal",
        "question",
        "law",
        "whether",
        "law",
        "legal",
        "positivism",
        "aspire",
        "answer",
        "question",
        "though",
        "claim",
        "existence",
        "content",
        "law",
        "depends",
        "social",
        "fact",
        "give",
        "shape",
        "might",
        "better",
        "say",
        "legal",
        "philosopher",
        "need",
        "legal",
        "positivist",
        "law",
        "dependence",
        "upon",
        "social",
        "fact",
        "fully",
        "acknowledged",
        "also",
        "accounted",
        "natural",
        "law",
        "theory",
        "law",
        "concession",
        "natural",
        "law",
        "theorist",
        "main",
        "position",
        "clearly",
        "articulated",
        "aquinas",
        "many",
        "century",
        "legal",
        "positivism",
        "emerged",
        "challenge",
        "took",
        "natural",
        "law",
        "theory",
        "positivist",
        "critique",
        "natural",
        "law",
        "theory",
        "rest",
        "upon",
        "scepticism",
        "possibility",
        "moral",
        "judgment",
        "scepticism",
        "implicitly",
        "disavowed",
        "passage",
        "rest",
        "misunderstanding",
        "passage",
        "work",
        "natural",
        "law",
        "theorist",
        "misunderstanding",
        "see",
        "finnis",
        "soper",
        "could",
        "fundamental",
        "question",
        "law",
        "given",
        "shape",
        "positivist",
        "thesis",
        "law",
        "existence",
        "content",
        "depends",
        "social",
        "fact",
        "green",
        "claim",
        "invert",
        "reasonable",
        "order",
        "inquiry",
        "reflection",
        "basic",
        "human",
        "need",
        "circumstance",
        "powerfully",
        "suggest",
        "people",
        "virtually",
        "time",
        "place",
        "make",
        "uphold",
        "norm",
        "kind",
        "call",
        "law",
        "norm",
        "depend",
        "directly",
        "part",
        "social",
        "fact",
        "custom",
        "authoritative",
        "rulemaking",
        "adjudication",
        "legal",
        "philosophy",
        "retraces",
        "clarifies",
        "critically",
        "elemental",
        "practical",
        "reasoning",
        "somewhat",
        "hart",
        "hart",
        "construct",
        "descriptiveexplanatory",
        "account",
        "law",
        "ie",
        "refines",
        "concept",
        "understanding",
        "law",
        "explaining",
        "rule",
        "differ",
        "habit",
        "power",
        "different",
        "function",
        "social",
        "value",
        "obligation",
        "aptly",
        "reducible",
        "obligation",
        "also",
        "powerconferring",
        "rule",
        "distinct",
        "dutyimposing",
        "rule",
        "primary",
        "rule",
        "outlawing",
        "gross",
        "violence",
        "theft",
        "fraud",
        "need",
        "reason",
        "lack",
        "certainty",
        "content",
        "application",
        "immobility",
        "supplemented",
        "secondary",
        "rule",
        "recognition",
        "adjudication",
        "change",
        "remedial",
        "supplementation",
        "shift",
        "society",
        "domain",
        "rule",
        "law",
        "legal",
        "system",
        "may",
        "element",
        "hart",
        "book",
        "taken",
        "instance",
        "natural",
        "law",
        "legal",
        "theory",
        "done",
        "primarily",
        "descriptive",
        "rather",
        "primarily",
        "justificatory",
        "mode",
        "incomplete",
        "scrutiny",
        "resource",
        "practical",
        "reason",
        "resource",
        "drawn",
        "upon",
        "whole",
        "explanatory",
        "general",
        "description",
        "law",
        "hart",
        "description",
        "despite",
        "incompleteness",
        "work",
        "well",
        "precisely",
        "disinters",
        "elementary",
        "justification",
        "conceived",
        "put",
        "use",
        "people",
        "whose",
        "activity",
        "provide",
        "material",
        "description",
        "share",
        "deep",
        "methodology",
        "aristotle",
        "natural",
        "law",
        "tradition",
        "finnis",
        "making",
        "identification",
        "law",
        "concept",
        "law",
        "depend",
        "upon",
        "account",
        "law",
        "reasonable",
        "response",
        "common",
        "human",
        "need",
        "question",
        "perhaps",
        "central",
        "general",
        "theory",
        "law",
        "namely",
        "whether",
        "law",
        "nature",
        "whether",
        "understood",
        "model",
        "artefact",
        "alternatively",
        "study",
        "concept",
        "conceptual",
        "analysis",
        "seems",
        "tackled",
        "explicitness",
        "attention",
        "different",
        "related",
        "kind",
        "subjectmatter",
        "theorist",
        "working",
        "philosophical",
        "tradition",
        "concern",
        "topic",
        "entry",
        "murphy",
        "finnis",
        "none",
        "say",
        "sound",
        "legal",
        "theory",
        "kind",
        "explained",
        "entry",
        "need",
        "called",
        "natural",
        "law",
        "theory",
        "like",
        "philosophy",
        "done",
        "considering",
        "proposition",
        "label"
    ]
}