{
    "main_text": "What is Moral Naturalism?\n1. What is Moral Naturalism?\n\nMoral naturalism is the view that moral facts are stance-independent,\nnatural facts. It can also be characterized as the view that moral\nproperties are stance-independent, natural properties.\n\nFact Naturalism: Moral facts are natural facts.\n\nProperty Naturalism: Moral properties are natural\nproperties.\n\nThese two views are subtly different because there are different kinds\nof moral facts. Particular facts are instantiations of some property;\nparticular moral facts are instantiations of some moral property;\nparticular natural facts are instantiations of some natural property.\nSo Fact Naturalism entails Property Naturalism: if all moral facts are\nnatural, then all particular moral facts are instantiations of natural\nmoral properties. But not all moral facts are particular facts.\nGeneral moral facts, like the fact that genocide is wrong, consist in\neither patterns of instantiations of moral properties or underlying\nlawlike moral principles which explain those patterns of\ninstantiations. Underlying moral principles do not consist in\ninstantiations of moral properties; it is possible that genocide is\nwrong but never committed, in which case there would be no\ninstantiation of a moral property of wrongness to correspond to the\nprinciple that genocide is wrong. So while Property Naturalism entails\nthat all particular moral facts are natural facts, Property\nNaturalism does not entail Fact Naturalism because it’s possible\nthat moral principles are non-natural. For ease of\nexposition, I’ll mostly ignore this complication in what\nfollows, and treat Fact Naturalism and Property Naturalism as\ninterchangeable while focusing on Fact Naturalism as the stronger\nthesis. But moral principles will cause trouble at a few points.\n\nA fact is stance-independent just in case it doesn’t depend on\nthe beliefs or attitudes of any agent. Moral realism is the view that\nmoral principles are stance-independent; this is a more precise way of\ncapturing the common idea that, for a realist, morality is a matter of\nfact rather than a matter of opinion. But what does it mean for a fact\n(or property) to be natural? The usual answer is that natural\nfacts/properties are the kinds of facts/properties that scientific\nmethods tell us about (see, e.g., Shafer-Landau 2003, Chapter 3; Smith\n1994, 17; Copp 2007, 27–28). To say that moral facts are natural\nfacts, then, is to say that moral facts are part of the naturalistic\npicture of the world that is revealed by empirical science.\n\nMoral naturalism is opposed to moral supernaturalism, which holds that\nmoral facts are a kind of supernatural (typically, divine) facts. It\nis also opposed to moral non-naturalism, which holds that moral facts\nare neither natural nor supernatural, but are rather their own, third\nkind of thing. And as a version of moral realism, moral naturalism is\nopposed to all varieties of anti-realist views in metaethics,\nincluding constructivism, relativism, expressivism, and error theory.\nWhile anti-realists are usually naturalists in the sense that they\nwant to account for morality in naturalistic terms, anti-realists hold\nthat stance-independent moral facts can’t be reconciled with a\nnaturalistic worldview. Moral naturalists hold that they can be.\n\nFor the naturalist, moral facts are the kinds of facts that can be\ninvestigated by (broadly) scientific methods. But what kinds of facts\ncan be investigated by scientific methods? There is much less\nagreement on how to answer this further question. One common view is\nthat facts can be empirically investigated just in case they are\ncapable of entering into causal explanations of our experiences, and\nthereby be investigated through those experiences (e.g., Bedke 2009;\nEnoch 2010; Lutz 2020). And while most (perhaps all) moral naturalists\nwould say that moral facts can feature in causal explanations, this\nmay not be a good characterization of natural facts, since\nsupernatural facts could, perhaps, also feature in causal explanations\n(Sturgeon 2009; McPherson 2015). We could try to solve this problem\nwith brute force, by defining a natural fact as any fact that features\nin causal explanations that is not a supernatural fact. But this is ad\nhoc; and now we need to characterize supernatural facts. We might also\nworry about what it means for a fact to feature in a causal\nexplanation, which is itself a vexed and controversial issue. Perhaps\nit is best, then, to just leave it at “natural facts are facts\nthat are known scientifically.”\n\nBut even this minimal characterization faces difficulties. For one\nthing, it is extremely controversial which methods count as\n“scientific.” The “demarcation problem” of\ndistinguishing science from non-science (or\n“pseudoscience”) is a perennial puzzle in the philosophy\nof science, with many philosophers doubting that there is any general\nway of characterizing scientific methodology (Feyerabend 1975). A\nsecond problem is that this is a methodological or epistemological\ncharacterization of the natural; rather say what kinds of facts moral\nfacts are, moral naturalism would be a view about how moral\nfacts are known. This is, in fact, how some characterize\nmoral naturalism and non-naturalism. In Moral Realism: A\nDefense, Russ Shafer-Landau affirms a number of metaphysical\ntheses that are commonly associated with moral naturalism, most\nnotably saying that moral facts are entirely constituted by more\nfundamental natural facts (Shafer-Landau 2003, 74–8). Yet he\nstill calls himself a non-naturalist, because he thinks that we have\nmoral knowledge by intuition and reflective equilibrium rather than by\nscientific methods (Shafer-Landau 2003, 56–58ff). Some critics\nhave argued that Shafer-Landau is actually a naturalist in virtue of\nhis metaphysical commitments (Bedke 2012, fn 1). But if a\nmethodological characterization of the natural is best, then\nShafer-Landau has labeled his view correctly.\n\nSo far, we have characterized moral naturalism in terms of four\nclaims:\n\nMoral Realism: There are stance-independent moral\nfacts.\n\nFact Naturalism: Moral facts are natural facts.\n\nProperty Naturalism: Moral properties are natural\nproperties.\n\nMethodological Naturalism: We know about moral claims\nin the same way that we know about claims in the natural sciences.\n\nBut moral naturalism is sometimes associated with a fifth,\nlinguistic claim, about the nature of moral language. That\nclaim is:\n\nAnalytic Naturalism: Our moral claims are\nsynonymous with certain (highly complex) claims in the\nnatural sciences.\n\nIt might be tempting to say that moral naturalism is the conjunction\nof these five claims, but there is a strong tension between\nMethodological Naturalism and Analytic Naturalism. If Analytic\nNaturalism is true, then it should be possible to analyze moral claims\nand show what claims in the natural sciences they are synonymous with.\nBut if this is possible, then substantive moral principles are\nknowable not via scientific methods but via a priori conceptual\nanalysis. Analytic Naturalism therefore seems to entail that\nMethodological Naturalism is false, and vice versa. Naturalists who\naccept Analytic Naturalism are called, appropriately enough, analytic\nnaturalists. Naturalists who reject Analytic Naturalism are synthetic\nnaturalists.\n\nThis distinction between analytic naturalism and synthetic naturalism\ncreates further trouble for our ability to characterize moral\nnaturalism. If moral naturalism is the view that moral facts are known\nby empirical methods, then analytic naturalism is not a version of\nnaturalism at all (Flanagan, Sarkissian, and Wong 2016). Yet many\nwould resist the suggestion that analytic naturalists aren’t\nnaturalists, since the term “moral naturalism” was coined\nto refer to analytic naturalism; synthetic naturalism is a relatively\nrecent entrant to the metaethical scene.\n\nPerhaps we can resolve this conflict by recalling the difference\nbetween particular moral facts and moral principles. Analytic\nnaturalists agree with synthetic naturalists that we should be able to\ninvestigate particular moral facts empirically. An analytic naturalist\nwho held that ‘good’ was synonymous with\n‘pleasurable’ (e.g.) would agree that whether or not a\nparticular action instantiates goodness/pleasure is the sort of thing\nwe can investigate empirically. And synthetic naturalists agree with\nanalytic naturalists that certain claims about the relations between\nour moral concepts, like “if it is morally required to help\nothers, then it is not morally forbidden to help others,” can be\nanalytic and knowable a priori (although see Howard and Laskowski\n2021). What is primarily at issue in the debate between analytic and\nsynthetic naturalists is the status of claims about moral principles.\nAnalytic naturalists hold that these claims are analytic; synthetic\nnaturalists hold that they are not. So if we define moral naturalism\nin terms of Property Naturalism and remain neutral on Fact Naturalism,\nthis sidesteps the question of the nature of moral principles; perhaps\nthis can mend the rift between analytic and synthetic naturalists. But\nquestions about the nature of moral principles seem awfully to the\nmetaphysics of morality, so perhaps we don’t want to sidestep\nthem. And Property Naturalism doesn’t help answer the earlier\nworries we had about how to characterize moral naturalism: What\nproperties are the kinds of properties that can be investigated by\nscientific methods, and what methods for investigating those\nproperties are the scientific ones?\n\nOne more characterization of moral naturalism is worth mentioning. It\nis increasingly popular to think that appeals to the notion of\n“grounding” can help clear up what is at stake in a\nvariety of metaphysical debates, and so some believe that we can\nexplain naturalism in terms of grounding:\n\nGrounded Naturalism: All moral facts are fully\ngrounded in non-normative facts (Rosen 2017a).\n\nBut it’s not clear if this draws the line between naturalism and\nnon-naturalism in the right place. One problem is that it’s\ncontroversial what the relationship between “natural\nfacts” and “non-normative facts” is (see Section 4.2\nbelow). Another problem is that “grounding” is itself a\nhighly contested notion. “Grounding” refers to some sort\nof asymmetric determination relation which is supposed to be\n“almost maximally intimate” (Rosen 2017a, 157). It is\n“almost” maximally intimate because the maximally intimate\nrelation is identity, but grounding is not identity; unlike identity,\ngrounding is asymmetric. Non-naturalists would reject the idea that\nmoral facts are identical to non-normative facts. But grounding is\nnot identity; so why can’t non-naturalists say\nthat the relationship between the moral and the non-normative is\nalmost maximally intimate? Some self-described\nnon-naturalists say that moral facts are entirely grounded in\nnon-normative facts (Moore 1942; Bader 2017; compare Leary ms –\nsee Other Internet Resources). What’s wrong with that? What does\nit mean for a relation to be “almost” maximally intimate\nin the first place?\n\nSometimes philosophers clarify the notion of grounding by saying that\nthe grounded facts are “nothing over and above” the\ngrounding facts (Rosen 2017a, 157). But putting things this way\nthreatens to show too much. If moral facts are “nothing over and\nabove” the non-normative facts, then moral facts would\napparently have to be non-normative facts; normativity seems to count\nas something “over and above” non-normativity. But many\nmoral naturalists say that moral facts are normative (again, see\nSection 4.2). Perhaps it is coherent to say that the normative is\n“nothing over and above” the non-normative; many good\nphilosophers speak this way and we shouldn’t write them off as\nconfused. But “nothing over and above” is no more clear\nthan “almost maximally intimate.” So we lack a clear\npicture of what grounding consists in, and it’s consequently\nunclear why non-naturalists can’t say that moral facts are fully\ngrounded in non-normative facts but naturalists can.\n\nWe could say that naturalism is the view that moral facts are grounded\nin natural facts rather than in non-normative facts\n(Chilovi and Wodak 2022). It’s (arguably) clearer why this is\nthe sort of thing that naturalists would want to say and\nnon-naturalists wouldn’t, but this formulation doesn’t\nhelp us understand what natural facts are in the first place.\n\nAll moral naturalists will agree with the claim that morality is\nnatural. But there’s depressingly little agreement on how to\nunderstand the “naturalness” of morality. It’s all a\nbit of a muddle.\n",
    "section_title": "1. What is Moral Naturalism?",
    "entry_title": "Moral Naturalism",
    "hierarchy_title": "Moral Naturalism || What is Moral Naturalism?",
    "tokenized_text": [
        "moral",
        "naturalism",
        "moral",
        "naturalism",
        "moral",
        "naturalism",
        "view",
        "moral",
        "fact",
        "stanceindependent",
        "natural",
        "fact",
        "also",
        "characterized",
        "view",
        "moral",
        "property",
        "stanceindependent",
        "natural",
        "property",
        "fact",
        "naturalism",
        "moral",
        "fact",
        "natural",
        "fact",
        "property",
        "naturalism",
        "moral",
        "property",
        "natural",
        "property",
        "two",
        "view",
        "subtly",
        "different",
        "different",
        "kind",
        "moral",
        "fact",
        "particular",
        "fact",
        "instantiation",
        "property",
        "particular",
        "moral",
        "fact",
        "instantiation",
        "moral",
        "property",
        "particular",
        "natural",
        "fact",
        "instantiation",
        "natural",
        "property",
        "fact",
        "naturalism",
        "entail",
        "property",
        "naturalism",
        "moral",
        "fact",
        "natural",
        "particular",
        "moral",
        "fact",
        "instantiation",
        "natural",
        "moral",
        "property",
        "moral",
        "fact",
        "particular",
        "fact",
        "general",
        "moral",
        "fact",
        "like",
        "fact",
        "genocide",
        "wrong",
        "consist",
        "either",
        "pattern",
        "instantiation",
        "moral",
        "property",
        "underlying",
        "lawlike",
        "moral",
        "principle",
        "explain",
        "pattern",
        "instantiation",
        "underlying",
        "moral",
        "principle",
        "consist",
        "instantiation",
        "moral",
        "property",
        "possible",
        "genocide",
        "wrong",
        "never",
        "committed",
        "case",
        "would",
        "instantiation",
        "moral",
        "property",
        "wrongness",
        "correspond",
        "principle",
        "genocide",
        "wrong",
        "property",
        "naturalism",
        "entail",
        "particular",
        "moral",
        "fact",
        "natural",
        "fact",
        "property",
        "naturalism",
        "entail",
        "fact",
        "naturalism",
        "possible",
        "moral",
        "principle",
        "nonnatural",
        "ease",
        "exposition",
        "mostly",
        "ignore",
        "complication",
        "follows",
        "treat",
        "fact",
        "naturalism",
        "property",
        "naturalism",
        "interchangeable",
        "focusing",
        "fact",
        "naturalism",
        "stronger",
        "thesis",
        "moral",
        "principle",
        "cause",
        "trouble",
        "point",
        "fact",
        "stanceindependent",
        "case",
        "depend",
        "belief",
        "attitude",
        "agent",
        "moral",
        "realism",
        "view",
        "moral",
        "principle",
        "stanceindependent",
        "precise",
        "way",
        "capturing",
        "common",
        "idea",
        "realist",
        "morality",
        "matter",
        "fact",
        "rather",
        "matter",
        "opinion",
        "mean",
        "fact",
        "property",
        "natural",
        "usual",
        "answer",
        "natural",
        "factsproperties",
        "kind",
        "factsproperties",
        "scientific",
        "method",
        "tell",
        "u",
        "see",
        "eg",
        "shaferlandau",
        "chapter",
        "smith",
        "copp",
        "say",
        "moral",
        "fact",
        "natural",
        "fact",
        "say",
        "moral",
        "fact",
        "part",
        "naturalistic",
        "picture",
        "world",
        "revealed",
        "empirical",
        "science",
        "moral",
        "naturalism",
        "opposed",
        "moral",
        "supernaturalism",
        "hold",
        "moral",
        "fact",
        "kind",
        "supernatural",
        "typically",
        "divine",
        "fact",
        "also",
        "opposed",
        "moral",
        "nonnaturalism",
        "hold",
        "moral",
        "fact",
        "neither",
        "natural",
        "supernatural",
        "rather",
        "third",
        "kind",
        "thing",
        "version",
        "moral",
        "realism",
        "moral",
        "naturalism",
        "opposed",
        "variety",
        "antirealist",
        "view",
        "metaethics",
        "including",
        "constructivism",
        "relativism",
        "expressivism",
        "error",
        "theory",
        "antirealists",
        "usually",
        "naturalist",
        "sense",
        "want",
        "account",
        "morality",
        "naturalistic",
        "term",
        "antirealists",
        "hold",
        "stanceindependent",
        "moral",
        "fact",
        "reconciled",
        "naturalistic",
        "worldview",
        "moral",
        "naturalist",
        "hold",
        "naturalist",
        "moral",
        "fact",
        "kind",
        "fact",
        "investigated",
        "broadly",
        "scientific",
        "method",
        "kind",
        "fact",
        "investigated",
        "scientific",
        "method",
        "much",
        "le",
        "agreement",
        "answer",
        "question",
        "one",
        "common",
        "view",
        "fact",
        "empirically",
        "investigated",
        "case",
        "capable",
        "entering",
        "causal",
        "explanation",
        "experience",
        "thereby",
        "investigated",
        "experience",
        "eg",
        "bedke",
        "enoch",
        "lutz",
        "perhaps",
        "moral",
        "naturalist",
        "would",
        "say",
        "moral",
        "fact",
        "feature",
        "causal",
        "explanation",
        "may",
        "good",
        "characterization",
        "natural",
        "fact",
        "since",
        "supernatural",
        "fact",
        "could",
        "perhaps",
        "also",
        "feature",
        "causal",
        "explanation",
        "sturgeon",
        "mcpherson",
        "could",
        "try",
        "solve",
        "problem",
        "brute",
        "force",
        "defining",
        "natural",
        "fact",
        "fact",
        "feature",
        "causal",
        "explanation",
        "supernatural",
        "fact",
        "ad",
        "hoc",
        "need",
        "characterize",
        "supernatural",
        "fact",
        "might",
        "also",
        "worry",
        "mean",
        "fact",
        "feature",
        "causal",
        "explanation",
        "vexed",
        "controversial",
        "issue",
        "perhaps",
        "best",
        "leave",
        "natural",
        "fact",
        "fact",
        "known",
        "scientifically",
        "even",
        "minimal",
        "characterization",
        "face",
        "difficulty",
        "one",
        "thing",
        "extremely",
        "controversial",
        "method",
        "count",
        "scientific",
        "demarcation",
        "problem",
        "distinguishing",
        "science",
        "nonscience",
        "pseudoscience",
        "perennial",
        "puzzle",
        "philosophy",
        "science",
        "many",
        "philosopher",
        "doubting",
        "general",
        "way",
        "characterizing",
        "scientific",
        "methodology",
        "feyerabend",
        "second",
        "problem",
        "methodological",
        "epistemological",
        "characterization",
        "natural",
        "rather",
        "say",
        "kind",
        "fact",
        "moral",
        "fact",
        "moral",
        "naturalism",
        "would",
        "view",
        "moral",
        "fact",
        "known",
        "fact",
        "characterize",
        "moral",
        "naturalism",
        "nonnaturalism",
        "moral",
        "realism",
        "defense",
        "rus",
        "shaferlandau",
        "affirms",
        "number",
        "metaphysical",
        "thesis",
        "commonly",
        "associated",
        "moral",
        "naturalism",
        "notably",
        "saying",
        "moral",
        "fact",
        "entirely",
        "constituted",
        "fundamental",
        "natural",
        "fact",
        "shaferlandau",
        "yet",
        "still",
        "call",
        "nonnaturalist",
        "think",
        "moral",
        "knowledge",
        "intuition",
        "reflective",
        "equilibrium",
        "rather",
        "scientific",
        "method",
        "shaferlandau",
        "ff",
        "critic",
        "argued",
        "shaferlandau",
        "actually",
        "naturalist",
        "virtue",
        "metaphysical",
        "commitment",
        "bedke",
        "fn",
        "methodological",
        "characterization",
        "natural",
        "best",
        "shaferlandau",
        "labeled",
        "view",
        "correctly",
        "far",
        "characterized",
        "moral",
        "naturalism",
        "term",
        "four",
        "claim",
        "moral",
        "realism",
        "stanceindependent",
        "moral",
        "fact",
        "fact",
        "naturalism",
        "moral",
        "fact",
        "natural",
        "fact",
        "property",
        "naturalism",
        "moral",
        "property",
        "natural",
        "property",
        "methodological",
        "naturalism",
        "know",
        "moral",
        "claim",
        "way",
        "know",
        "claim",
        "natural",
        "science",
        "moral",
        "naturalism",
        "sometimes",
        "associated",
        "fifth",
        "linguistic",
        "claim",
        "nature",
        "moral",
        "language",
        "claim",
        "analytic",
        "naturalism",
        "moral",
        "claim",
        "synonymous",
        "certain",
        "highly",
        "complex",
        "claim",
        "natural",
        "science",
        "might",
        "tempting",
        "say",
        "moral",
        "naturalism",
        "conjunction",
        "five",
        "claim",
        "strong",
        "tension",
        "methodological",
        "naturalism",
        "analytic",
        "naturalism",
        "analytic",
        "naturalism",
        "true",
        "possible",
        "analyze",
        "moral",
        "claim",
        "show",
        "claim",
        "natural",
        "science",
        "synonymous",
        "possible",
        "substantive",
        "moral",
        "principle",
        "knowable",
        "via",
        "scientific",
        "method",
        "via",
        "priori",
        "conceptual",
        "analysis",
        "analytic",
        "naturalism",
        "therefore",
        "seems",
        "entail",
        "methodological",
        "naturalism",
        "false",
        "vice",
        "versa",
        "naturalist",
        "accept",
        "analytic",
        "naturalism",
        "called",
        "appropriately",
        "enough",
        "analytic",
        "naturalist",
        "naturalist",
        "reject",
        "analytic",
        "naturalism",
        "synthetic",
        "naturalist",
        "distinction",
        "analytic",
        "naturalism",
        "synthetic",
        "naturalism",
        "creates",
        "trouble",
        "ability",
        "characterize",
        "moral",
        "naturalism",
        "moral",
        "naturalism",
        "view",
        "moral",
        "fact",
        "known",
        "empirical",
        "method",
        "analytic",
        "naturalism",
        "version",
        "naturalism",
        "flanagan",
        "sarkissian",
        "wong",
        "yet",
        "many",
        "would",
        "resist",
        "suggestion",
        "analytic",
        "naturalist",
        "naturalist",
        "since",
        "term",
        "moral",
        "naturalism",
        "coined",
        "refer",
        "analytic",
        "naturalism",
        "synthetic",
        "naturalism",
        "relatively",
        "recent",
        "entrant",
        "metaethical",
        "scene",
        "perhaps",
        "resolve",
        "conflict",
        "recalling",
        "difference",
        "particular",
        "moral",
        "fact",
        "moral",
        "principle",
        "analytic",
        "naturalist",
        "agree",
        "synthetic",
        "naturalist",
        "able",
        "investigate",
        "particular",
        "moral",
        "fact",
        "empirically",
        "analytic",
        "naturalist",
        "held",
        "good",
        "synonymous",
        "pleasurable",
        "eg",
        "would",
        "agree",
        "whether",
        "particular",
        "action",
        "instantiates",
        "goodnesspleasure",
        "sort",
        "thing",
        "investigate",
        "empirically",
        "synthetic",
        "naturalist",
        "agree",
        "analytic",
        "naturalist",
        "certain",
        "claim",
        "relation",
        "moral",
        "concept",
        "like",
        "morally",
        "required",
        "help",
        "others",
        "morally",
        "forbidden",
        "help",
        "others",
        "analytic",
        "knowable",
        "priori",
        "although",
        "see",
        "howard",
        "laskowski",
        "primarily",
        "issue",
        "debate",
        "analytic",
        "synthetic",
        "naturalist",
        "status",
        "claim",
        "moral",
        "principle",
        "analytic",
        "naturalist",
        "hold",
        "claim",
        "analytic",
        "synthetic",
        "naturalist",
        "hold",
        "define",
        "moral",
        "naturalism",
        "term",
        "property",
        "naturalism",
        "remain",
        "neutral",
        "fact",
        "naturalism",
        "sidestep",
        "question",
        "nature",
        "moral",
        "principle",
        "perhaps",
        "mend",
        "rift",
        "analytic",
        "synthetic",
        "naturalist",
        "question",
        "nature",
        "moral",
        "principle",
        "seem",
        "awfully",
        "metaphysics",
        "morality",
        "perhaps",
        "want",
        "sidestep",
        "property",
        "naturalism",
        "help",
        "answer",
        "earlier",
        "worry",
        "characterize",
        "moral",
        "naturalism",
        "property",
        "kind",
        "property",
        "investigated",
        "scientific",
        "method",
        "method",
        "investigating",
        "property",
        "scientific",
        "one",
        "one",
        "characterization",
        "moral",
        "naturalism",
        "worth",
        "mentioning",
        "increasingly",
        "popular",
        "think",
        "appeal",
        "notion",
        "grounding",
        "help",
        "clear",
        "stake",
        "variety",
        "metaphysical",
        "debate",
        "believe",
        "explain",
        "naturalism",
        "term",
        "grounding",
        "grounded",
        "naturalism",
        "moral",
        "fact",
        "fully",
        "grounded",
        "nonnormative",
        "fact",
        "rosen",
        "a",
        "clear",
        "draw",
        "line",
        "naturalism",
        "nonnaturalism",
        "right",
        "place",
        "one",
        "problem",
        "controversial",
        "relationship",
        "natural",
        "fact",
        "nonnormative",
        "fact",
        "see",
        "section",
        "another",
        "problem",
        "grounding",
        "highly",
        "contested",
        "notion",
        "grounding",
        "refers",
        "sort",
        "asymmetric",
        "determination",
        "relation",
        "supposed",
        "almost",
        "maximally",
        "intimate",
        "rosen",
        "a",
        "almost",
        "maximally",
        "intimate",
        "maximally",
        "intimate",
        "relation",
        "identity",
        "grounding",
        "identity",
        "unlike",
        "identity",
        "grounding",
        "asymmetric",
        "nonnaturalists",
        "would",
        "reject",
        "idea",
        "moral",
        "fact",
        "identical",
        "nonnormative",
        "fact",
        "grounding",
        "identity",
        "nonnaturalists",
        "say",
        "relationship",
        "moral",
        "nonnormative",
        "almost",
        "maximally",
        "intimate",
        "selfdescribed",
        "nonnaturalists",
        "say",
        "moral",
        "fact",
        "entirely",
        "grounded",
        "nonnormative",
        "fact",
        "moore",
        "bader",
        "compare",
        "leary",
        "m",
        "see",
        "internet",
        "resource",
        "wrong",
        "mean",
        "relation",
        "almost",
        "maximally",
        "intimate",
        "first",
        "place",
        "sometimes",
        "philosopher",
        "clarify",
        "notion",
        "grounding",
        "saying",
        "grounded",
        "fact",
        "nothing",
        "grounding",
        "fact",
        "rosen",
        "a",
        "putting",
        "thing",
        "way",
        "threatens",
        "show",
        "much",
        "moral",
        "fact",
        "nothing",
        "nonnormative",
        "fact",
        "moral",
        "fact",
        "would",
        "apparently",
        "nonnormative",
        "fact",
        "normativity",
        "seems",
        "count",
        "something",
        "nonnormativity",
        "many",
        "moral",
        "naturalist",
        "say",
        "moral",
        "fact",
        "normative",
        "see",
        "section",
        "perhaps",
        "coherent",
        "say",
        "normative",
        "nothing",
        "nonnormative",
        "many",
        "good",
        "philosopher",
        "speak",
        "way",
        "write",
        "confused",
        "nothing",
        "clear",
        "almost",
        "maximally",
        "intimate",
        "lack",
        "clear",
        "picture",
        "grounding",
        "consists",
        "consequently",
        "unclear",
        "nonnaturalists",
        "say",
        "moral",
        "fact",
        "fully",
        "grounded",
        "nonnormative",
        "fact",
        "naturalist",
        "could",
        "say",
        "naturalism",
        "view",
        "moral",
        "fact",
        "grounded",
        "natural",
        "fact",
        "rather",
        "nonnormative",
        "fact",
        "chilovi",
        "wodak",
        "arguably",
        "clearer",
        "sort",
        "thing",
        "naturalist",
        "would",
        "want",
        "say",
        "nonnaturalists",
        "formulation",
        "help",
        "u",
        "understand",
        "natural",
        "fact",
        "first",
        "place",
        "moral",
        "naturalist",
        "agree",
        "claim",
        "morality",
        "natural",
        "depressingly",
        "little",
        "agreement",
        "understand",
        "naturalness",
        "morality",
        "bit",
        "muddle"
    ]
}