{
    "main_text": "The Metaphysics of Natural Kinds || Essentialism\n1.3 Essentialism\n\nDo natural kinds have essences? When discussing kinds and essences we\nneed to distinguish two quite different claims. The first claim is\nthat the kind a particular belongs to is essential to that particular:\nif a belongs to kind K, then it is an essential\nproperty of a that it belongs to K. The second claim\nis that the kinds themselves have essential properties: for each kind\nK there is some property Φ of the kind such that it is\nessential to K that Φ(K). What is the logical\nrelation between these two claims? The first claim may be strictly\nconsistent with the denial of the second, but it may be difficult to\nmotivate the first without having reason to accept the second. Would\none think that some object’s nature requires it to belong to\nkind K without thinking that there is some distinctive (essential)\nproperty characteristic of all Ks?\n\nThe second claim, essentialism about kinds, does not obviously imply\nthe first, individual essentialism. To see this, consider the\nfollowing two cases that would seem to show that the latter does not\nimply the former (Bird 2018). The first case is chemical/physical. A\nnucleus of neptunium-239 may undergo beta decay, in which one of its\nneutrons emits an electron leaving a proton. As a consequence the\nnucleus now has one more proton and so is a nucleus of neptunium no\nlonger but is now a nucleus of plutonium. This description is\nconsistent with the claim that it is essential to neptunium that\nnuclei of neptunium atoms have 93 protons whereas it is essential to\nplutonium that its nuclei have 94 protons. But one may also claim, as\nthe description implicitly suggests, that one and the same nucleus\npersists through this transformation. If that is so, then a particular\nhas retained its identity while undergoing a change of kind. That kind\nessentialism does not entail essentialism of kind membership is also\ndemonstrated by a second, biological, example. According to\nMayr’s biological species concept, a species is a reproductively\nisolated breeding population. Thus a new species can be created by the\nadvent of reproductive isolation, which will typically split existing\npopulations (Matthen 2009). And so the existing organisms in at least\none (and arguably both) of the newly isolated (sub-)populations will\nbelong to a new species. And if species are natural kinds, this is an\nexample of particulars changing their kinds. But this account of\nspecies is consistent with the view that species have essences\n(LaPorte 1997, 2004, 11–12). (As a matter of fact, most\nessentialists accept that an object’s kind is essential to it.\nThe point being advanced here is that this claim does not follow\nimmediately from the claim that kinds have essences.)\n1.3.1 Arguments for Essentialism\n\nIt has been widely held that essentialism, and natural kind\nessentialism in particular, is a consequence of the semantic arguments\nconcerning reference put forward by Kripke (1980) and Putnam (1975a).\nThese arguments support semantic externalism, the view that the\nreference of a speaker’s term can depend on facts external to\nthe speaker herself (e.g. facts concerning prior uses of the term).\nHowever, Salmon (1979, 1982) has argued persuasively that only trivial\nessentialism can be inferred from such arguments; stronger\nessentialist theses are derived only on the basis of unstated\nessentialist premises. For example, consider the following argument,\nreconstructed by Donnellan and discussed in Salmon (1982,\n161–75):\n\n\n\n\nP1:\nIt is necessarily the case that: something is a sample of water\nif and only if it is a sample of dthat (the same substance that this\nis a sample of). \n\nP2:\nThis [the liquid sample] has the chemical structure\nH2O. \n\nP3:\nBeing a sample of the same substance as something consists in\nhaving the same chemical structure. \n\n \nTherefore \n\nC:\nIt is necessarily the case that: every sample of water has the\nchemical structure H2O.  \n\n\n(Salmon 1982, 166)\n\n\nP3, however, is not free of non-trivial essentialist import. According\nto Salmon, deriving essentialism via the theory of reference is\nquestion-begging. Nonetheless, the fact that essentialist conclusions\nseem so plausible may be taken as evidence that there exist strong\nessentialist intuitions, and the arguments from Kripke and Putnam can\nbe framed in non-semantic terms and thereby motivate essentialism\ndirectly—indeed many of Kripke’s arguments are not framed\nin semantic terms at all.\n\nSeveral of Kripke’s exemplary cases concern theoretical\nidentities; these are typically identities of the form C =\nT, expressed using a common name for a kind,\n‘C’, and a technical identification of the kind,\n‘T’, typically thereby telling us what that kind\nis. Examples: light is a stream of photons; water is\nH2O; lightning is an electrical discharge; gold is the\nelement with atomic number 79. This might give the impression that\nKripkean essentialism is just a matter of the necessity of identity.\nHowever, in several of his discussions Kripke does provide separate,\nindependent arguments on the one hand for the (necessary) necessity of\nbeing T for being C and on the other hand for the\n(necessary) sufficiency of being T for being C. In\ngeneral, where K is a kind and P is some property,\narguments for □∀x(Kx→Px)\ncan be decoupled from arguments for\n□∀x(Px→Kx).\n\nFor example, in his discussion of gold, Kripke argues that something\nthat is superficially like gold in appearance but lacks the property\nof having atomic number 79, would not be gold. This establishes that,\nof necessity, having atomic number 79 is necessary for being gold, but\ndoes not show that possession of this property is sufficient for being\ngold. Similarly, argues Kripke, if we were to discover a population of\nanimals with the appearance of tigers but which turn out to be\nreptiles, we would deny that such creatures are tigers. Being\nmammalian is necessarily a necessary condition of being a tiger, but\nof course not a sufficient condition\n\nPutnam’s (1975a) Twin Earth thought experiment, in a\nnon-semantic guise, leads to a similar conclusion. We imagine there is\na planet, ‘Twin Earth’, exactly like Earth in all readily\nobservable respects. Every person and thing on Earth has a twin\nequivalent on Twin Earth. However, there is no H2O on Twin\nEarth. Instead, there is a liquid that shares the manifest properties\nof water (e.g., its being colourless, tasteless, odourless, good for\ndrinking, etc.). This liquid is composed not of H2O\nmolecules but of very different molecules to which we assign the\nmade-up formula ‘XYZ’. Despite its superficially\nwater-like properties, intuitively XYZ is not water. What prevents XYZ\nfrom being water is the fact that XYZ is microstructurally different\nfrom H2O. If intuition is reliable in this respect, then\n(i) possessing water’s superficial properties is not sufficient\nto make something a sample of water, and (ii) being composed of\nmolecules of H2O is necessary for something’s being a\nsample of water. (For more on Putnam’s Twin Earth thought\nexperiment, see Section 4.2.3.)\n\nIt is natural to use the expression ‘the essence of\n…’, which implies sufficiency as well as necessity:\npossession of the essence of K suffices for membership of\nK, as well as being necessary for it. According to the\nforegoing, not all the arguments of Kripke and Putnam establish what\nthe essence of some kind is, rather they establish only what\nwe may call a partial essence, conditions that are necessary\nbut not sufficient. This is clear in some other of Kripke’s\narguments. Thus it is only a partial essence that someone originates\nwith the gamete (sperm and egg) from which they in fact originate,\nsince they might have a monozygotic (identical) twin who has the same\norigin. A further question is whether there is a full essence\n(the essence) for everything that has a partial essence.\n\nThe fact that such arguments show only that F is an\nessential property of K means that they are invulnerable to\ncomplaints that not everything with F is K. For\nexample it is sometimes complained that water cannot be essentially\nH2O for the following reasons (a) water is a liquid,\nwhereas a substance comprised of H2O can exist as a solid\nor a gas; (b) a single H2O molecule is not a sample of\nwater because it does not have the properties we can ascribe to\nsamples of water (such as a temperature); (c) water is not simply\nH2O but is a polymer-like substance held together by\nhydrogen bonds. These observations are consistent with the claim of\nPutnam’s argument that necessarily all water is composed of\nH2O molecules.\n\nThe arguments so far considered show that the superficial properties\nassociated with a kind are, in those cases, not sufficient for kind\nmembership, and so some further property (often a microstructural\nproperty) is a necessary condition. Kripke also provides arguments\nthat show that many of the superficial properties typically associated\nwith a kind are not even necessary. Kripke examines Kant’s claim\nthat it is a priori that gold is a yellow metal (Kripke 1980,\n118). Let us imagine that the yellow appearance of what we have always\ntaken to be samples of gold is just an optical illusion. Intuitively,\nwe would conclude that we had previously erred in thinking that gold\nis yellow—we would not conclude that there is no gold.\nLikewise, one might ask whether animal species are characterized\n(necessarily) by superficially available qualities, for example,\nwhether a tiger is, by definition, a large carnivorous quadrupedal\nfeline, tawny yellow in colour with blackish transverse stripes and a\nwhite belly (Kripke 1980, 119–121). Again, we may consider that\nthese features of the individual animals we have held to be tigers are\nin fact illusory; that those individuals and others of the same\nspecies are, for example, three–legged but that an optical\nillusion made us think otherwise. This suggests that satisfying a set\nof readily observable ‘superficial’ properties is not\nnecessary for membership of the tiger kind.\n\nThe foregoing arguments from Kripke lead to the conclusion that the\nrelevant kinds are not characterized of necessity by the readily\nobservable properties of their instances. They do not show what does\ncharacterize those kinds. Kripke takes the view that, in most cases,\nit is certain microstructural properties that determine the\nnature of these natural kinds, as evident in his endorsement of the\nidentities: ‘water is H2O’; ‘gold is the\nelement with atomic number 79’, ‘light is a stream of\nphotons’. Such essential properties of kinds are features,\ntherefore, that may be unknown even to competent users of a relevant\nkind concept. Consequently, these are essences that, when known at\nall, are known a posteriori.\n\nWhile the arguments just considered suggest a microstructural essence\nfor the chemical and physical kinds considered, they do not have the\nconsequence that every natural kind must have a microstructural\nessence. Kripke regards material individuals as having historical\nessences. In the light of cladism in biology, one may regard\nbiological taxa as having historical essences also, and this is\nconsistent with the general picture given to us by Kripke and Putnam,\neven if they themselves once thought that biological kinds had\nmicrostructural essences (McGinn 1976; Kornblith 1993, 111; LaPorte\n2004, 64). Cladism is the most commonly accepted system of biological\nclassification that groups organisms according to their shared\nphylogenetic ancestry. Cladism has replaced the Linnean hierarchical\nsystem of biological classification where organisms were grouped\naccording to their shared morphological characteristics (see Section\n2.1 below).\n\nKripke does not distinguish ‘essential property’ from\n‘necessary property’. Fine (1994) notes that the claim\nthat P is a necessary property of X is not the same as the\nclaim that P is an essential property of X: the latter implies the\nformer but the former does not imply the latter. The arguments for\nessentialism discussed above do not note this distinction and move\nquickly from claims about necessity to claims about essence: having\nshown that necessarily anything that is gold is made up of an element\nwith atomic number 79, Kripke concludes that having atomic number 79\nis an essential property of the kind gold. Fine’s point may not\nbe an insuperable obstacle to establishing essentialism via the\narguments of Kripke and Putnam. For it may be held, as Fine holds,\nthat essences concern the nature or identity of things. One may then\nargue that the arguments of Kripke, Putnam, and others do appeal to\nintuitions concerning the nature and/or identity of natural kinds, and\nso the inferences to essentialism from claims about necessity are\nlegitimate in these cases.\n\nThe Kripke–Putnam arguments for essentialism are, in effect,\ndirect appeals to intuition. For Ellis and Lowe, the dialectical basis\nfor essentialism is that essentialism is a core part of what they each\ntake to be the optimal metaphysical system. Ellis (2001, 145–50)\nregards his essentialist metaphysics as supported by his argument that\nit yields a stronger argument for scientific realism. In particular,\nfor Ellis the essences of natural kinds explain the laws of nature:\nlaws are grounded in the world’s natural kind structure, which\nincludes not only natural kinds of thing but also natural kinds of\nprocess and event. Above it was mentioned that for Lowe (2006, 144)\nlaws concern natural kinds; by contrast, for Ellis laws are grounded\nin essential facts about kinds. As a consequence, the laws of nature\nare metaphysically necessary. This has the advantage of explaining\nwhat natural necessity is (it is just metaphysical necessity), but at\nthe cost of denying the intuitive contingency of laws. Lowe, on the\nother hand, holds that laws can be grounded in the contingent\npossession of properties by kinds, and so need not be metaphysically\nnecessary. In conclusion we note that some anti-essentialists\nargue that there is no non-question begging way of motivating the\nappeal to essences. Hugh Mellor (1977, 309) argues that the existence\nof essences in essentialist accounts of natural kinds is simply a\ngratuitous assumption. Others use examples from the empirical sciences\nsuch as biology to argue that essentialism is too limited to capture\nthe kinds we find in the special sciences (Dupré 1981, 1993).\nIn particular, essentialist accounts of kinds seem to construe them as\nimmutable or static, whereas examples from the natural sciences\ninclude mutable and dynamic kinds, as we see in Section 2.1 below.\n\n",
    "section_title": "1.3 Essentialism",
    "entry_title": "Natural Kinds",
    "hierarchy_title": "Natural Kinds || The Metaphysics of Natural Kinds || Essentialism",
    "tokenized_text": [
        "metaphysics",
        "natural",
        "kind",
        "essentialism",
        "essentialism",
        "natural",
        "kind",
        "essence",
        "discussing",
        "kind",
        "essence",
        "need",
        "distinguish",
        "two",
        "quite",
        "different",
        "claim",
        "first",
        "claim",
        "kind",
        "particular",
        "belongs",
        "essential",
        "particular",
        "belongs",
        "kind",
        "k",
        "essential",
        "property",
        "belongs",
        "k",
        "second",
        "claim",
        "kind",
        "essential",
        "property",
        "kind",
        "k",
        "property",
        "φ",
        "kind",
        "essential",
        "k",
        "φ",
        "k",
        "logical",
        "relation",
        "two",
        "claim",
        "first",
        "claim",
        "may",
        "strictly",
        "consistent",
        "denial",
        "second",
        "may",
        "difficult",
        "motivate",
        "first",
        "without",
        "reason",
        "accept",
        "second",
        "would",
        "one",
        "think",
        "object",
        "nature",
        "requires",
        "belong",
        "kind",
        "k",
        "without",
        "thinking",
        "distinctive",
        "essential",
        "property",
        "characteristic",
        "k",
        "second",
        "claim",
        "essentialism",
        "kind",
        "obviously",
        "imply",
        "first",
        "individual",
        "essentialism",
        "see",
        "consider",
        "following",
        "two",
        "case",
        "would",
        "seem",
        "show",
        "latter",
        "imply",
        "former",
        "bird",
        "first",
        "case",
        "chemicalphysical",
        "nucleus",
        "neptunium",
        "may",
        "undergo",
        "beta",
        "decay",
        "one",
        "neutron",
        "emits",
        "electron",
        "leaving",
        "proton",
        "consequence",
        "nucleus",
        "one",
        "proton",
        "nucleus",
        "neptunium",
        "longer",
        "nucleus",
        "plutonium",
        "description",
        "consistent",
        "claim",
        "essential",
        "neptunium",
        "nucleus",
        "neptunium",
        "atom",
        "proton",
        "whereas",
        "essential",
        "plutonium",
        "nucleus",
        "proton",
        "one",
        "may",
        "also",
        "claim",
        "description",
        "implicitly",
        "suggests",
        "one",
        "nucleus",
        "persists",
        "transformation",
        "particular",
        "retained",
        "identity",
        "undergoing",
        "change",
        "kind",
        "kind",
        "essentialism",
        "entail",
        "essentialism",
        "kind",
        "membership",
        "also",
        "demonstrated",
        "second",
        "biological",
        "example",
        "according",
        "mayr",
        "biological",
        "specie",
        "concept",
        "specie",
        "reproductively",
        "isolated",
        "breeding",
        "population",
        "thus",
        "new",
        "specie",
        "created",
        "advent",
        "reproductive",
        "isolation",
        "typically",
        "split",
        "existing",
        "population",
        "matthen",
        "existing",
        "organism",
        "least",
        "one",
        "arguably",
        "newly",
        "isolated",
        "sub",
        "population",
        "belong",
        "new",
        "specie",
        "specie",
        "natural",
        "kind",
        "example",
        "particular",
        "changing",
        "kind",
        "account",
        "specie",
        "consistent",
        "view",
        "specie",
        "essence",
        "laporte",
        "matter",
        "fact",
        "essentialists",
        "accept",
        "object",
        "kind",
        "essential",
        "point",
        "advanced",
        "claim",
        "follow",
        "immediately",
        "claim",
        "kind",
        "essence",
        "argument",
        "essentialism",
        "widely",
        "held",
        "essentialism",
        "natural",
        "kind",
        "essentialism",
        "particular",
        "consequence",
        "semantic",
        "argument",
        "concerning",
        "reference",
        "put",
        "forward",
        "kripke",
        "putnam",
        "a",
        "argument",
        "support",
        "semantic",
        "externalism",
        "view",
        "reference",
        "speaker",
        "term",
        "depend",
        "fact",
        "external",
        "speaker",
        "eg",
        "fact",
        "concerning",
        "prior",
        "us",
        "term",
        "however",
        "salmon",
        "argued",
        "persuasively",
        "trivial",
        "essentialism",
        "inferred",
        "argument",
        "stronger",
        "essentialist",
        "thesis",
        "derived",
        "basis",
        "unstated",
        "essentialist",
        "premise",
        "example",
        "consider",
        "following",
        "argument",
        "reconstructed",
        "donnellan",
        "discussed",
        "salmon",
        "p",
        "necessarily",
        "case",
        "something",
        "sample",
        "water",
        "sample",
        "dthat",
        "substance",
        "sample",
        "p",
        "liquid",
        "sample",
        "chemical",
        "structure",
        "ho",
        "p",
        "sample",
        "substance",
        "something",
        "consists",
        "chemical",
        "structure",
        "therefore",
        "c",
        "necessarily",
        "case",
        "every",
        "sample",
        "water",
        "chemical",
        "structure",
        "ho",
        "salmon",
        "p",
        "however",
        "free",
        "nontrivial",
        "essentialist",
        "import",
        "according",
        "salmon",
        "deriving",
        "essentialism",
        "via",
        "theory",
        "reference",
        "questionbegging",
        "nonetheless",
        "fact",
        "essentialist",
        "conclusion",
        "seem",
        "plausible",
        "may",
        "taken",
        "evidence",
        "exist",
        "strong",
        "essentialist",
        "intuition",
        "argument",
        "kripke",
        "putnam",
        "framed",
        "nonsemantic",
        "term",
        "thereby",
        "motivate",
        "essentialism",
        "directlyindeed",
        "many",
        "kripke",
        "argument",
        "framed",
        "semantic",
        "term",
        "several",
        "kripke",
        "exemplary",
        "case",
        "concern",
        "theoretical",
        "identity",
        "typically",
        "identity",
        "form",
        "c",
        "expressed",
        "using",
        "common",
        "name",
        "kind",
        "c",
        "technical",
        "identification",
        "kind",
        "typically",
        "thereby",
        "telling",
        "u",
        "kind",
        "example",
        "light",
        "stream",
        "photon",
        "water",
        "ho",
        "lightning",
        "electrical",
        "discharge",
        "gold",
        "element",
        "atomic",
        "number",
        "might",
        "give",
        "impression",
        "kripkean",
        "essentialism",
        "matter",
        "necessity",
        "identity",
        "however",
        "several",
        "discussion",
        "kripke",
        "provide",
        "separate",
        "independent",
        "argument",
        "one",
        "hand",
        "necessary",
        "necessity",
        "c",
        "hand",
        "necessary",
        "sufficiency",
        "c",
        "general",
        "k",
        "kind",
        "p",
        "property",
        "argument",
        "x",
        "kxpx",
        "decoupled",
        "argument",
        "x",
        "pxkx",
        "example",
        "discussion",
        "gold",
        "kripke",
        "argues",
        "something",
        "superficially",
        "like",
        "gold",
        "appearance",
        "lack",
        "property",
        "atomic",
        "number",
        "would",
        "gold",
        "establishes",
        "necessity",
        "atomic",
        "number",
        "necessary",
        "gold",
        "show",
        "possession",
        "property",
        "sufficient",
        "gold",
        "similarly",
        "argues",
        "kripke",
        "discover",
        "population",
        "animal",
        "appearance",
        "tiger",
        "turn",
        "reptile",
        "would",
        "deny",
        "creature",
        "tiger",
        "mammalian",
        "necessarily",
        "necessary",
        "condition",
        "tiger",
        "course",
        "sufficient",
        "condition",
        "putnam",
        "a",
        "twin",
        "earth",
        "thought",
        "experiment",
        "nonsemantic",
        "guise",
        "lead",
        "similar",
        "conclusion",
        "imagine",
        "planet",
        "twin",
        "earth",
        "exactly",
        "like",
        "earth",
        "readily",
        "observable",
        "respect",
        "every",
        "person",
        "thing",
        "earth",
        "twin",
        "equivalent",
        "twin",
        "earth",
        "however",
        "ho",
        "twin",
        "earth",
        "instead",
        "liquid",
        "share",
        "manifest",
        "property",
        "water",
        "eg",
        "colourless",
        "tasteless",
        "odourless",
        "good",
        "drinking",
        "etc",
        "liquid",
        "composed",
        "ho",
        "molecule",
        "different",
        "molecule",
        "assign",
        "madeup",
        "formula",
        "xyz",
        "despite",
        "superficially",
        "waterlike",
        "property",
        "intuitively",
        "xyz",
        "water",
        "prevents",
        "xyz",
        "water",
        "fact",
        "xyz",
        "microstructurally",
        "different",
        "ho",
        "intuition",
        "reliable",
        "respect",
        "possessing",
        "water",
        "superficial",
        "property",
        "sufficient",
        "make",
        "something",
        "sample",
        "water",
        "ii",
        "composed",
        "molecule",
        "ho",
        "necessary",
        "something",
        "sample",
        "water",
        "putnam",
        "twin",
        "earth",
        "thought",
        "experiment",
        "see",
        "section",
        "natural",
        "use",
        "expression",
        "essence",
        "implies",
        "sufficiency",
        "well",
        "necessity",
        "possession",
        "essence",
        "k",
        "suffices",
        "membership",
        "k",
        "well",
        "necessary",
        "according",
        "foregoing",
        "argument",
        "kripke",
        "putnam",
        "establish",
        "essence",
        "kind",
        "rather",
        "establish",
        "may",
        "call",
        "partial",
        "essence",
        "condition",
        "necessary",
        "sufficient",
        "clear",
        "kripke",
        "argument",
        "thus",
        "partial",
        "essence",
        "someone",
        "originates",
        "gamete",
        "sperm",
        "egg",
        "fact",
        "originate",
        "since",
        "might",
        "monozygotic",
        "identical",
        "twin",
        "origin",
        "question",
        "whether",
        "full",
        "essence",
        "essence",
        "everything",
        "partial",
        "essence",
        "fact",
        "argument",
        "show",
        "f",
        "essential",
        "property",
        "k",
        "mean",
        "invulnerable",
        "complaint",
        "everything",
        "f",
        "k",
        "example",
        "sometimes",
        "complained",
        "water",
        "essentially",
        "ho",
        "following",
        "reason",
        "water",
        "liquid",
        "whereas",
        "substance",
        "comprised",
        "ho",
        "exist",
        "solid",
        "gas",
        "b",
        "single",
        "ho",
        "molecule",
        "sample",
        "water",
        "property",
        "ascribe",
        "sample",
        "water",
        "temperature",
        "c",
        "water",
        "simply",
        "ho",
        "polymerlike",
        "substance",
        "held",
        "together",
        "hydrogen",
        "bond",
        "observation",
        "consistent",
        "claim",
        "putnam",
        "argument",
        "necessarily",
        "water",
        "composed",
        "ho",
        "molecule",
        "argument",
        "far",
        "considered",
        "show",
        "superficial",
        "property",
        "associated",
        "kind",
        "case",
        "sufficient",
        "kind",
        "membership",
        "property",
        "often",
        "microstructural",
        "property",
        "necessary",
        "condition",
        "kripke",
        "also",
        "provides",
        "argument",
        "show",
        "many",
        "superficial",
        "property",
        "typically",
        "associated",
        "kind",
        "even",
        "necessary",
        "kripke",
        "examines",
        "kant",
        "claim",
        "priori",
        "gold",
        "yellow",
        "metal",
        "kripke",
        "let",
        "u",
        "imagine",
        "yellow",
        "appearance",
        "always",
        "taken",
        "sample",
        "gold",
        "optical",
        "illusion",
        "intuitively",
        "would",
        "conclude",
        "previously",
        "erred",
        "thinking",
        "gold",
        "yellowwe",
        "would",
        "conclude",
        "gold",
        "likewise",
        "one",
        "might",
        "ask",
        "whether",
        "animal",
        "specie",
        "characterized",
        "necessarily",
        "superficially",
        "available",
        "quality",
        "example",
        "whether",
        "tiger",
        "definition",
        "large",
        "carnivorous",
        "quadrupedal",
        "feline",
        "tawny",
        "yellow",
        "colour",
        "blackish",
        "transverse",
        "stripe",
        "white",
        "belly",
        "kripke",
        "may",
        "consider",
        "feature",
        "individual",
        "animal",
        "held",
        "tiger",
        "fact",
        "illusory",
        "individual",
        "others",
        "specie",
        "example",
        "threelegged",
        "optical",
        "illusion",
        "made",
        "u",
        "think",
        "otherwise",
        "suggests",
        "satisfying",
        "set",
        "readily",
        "observable",
        "superficial",
        "property",
        "necessary",
        "membership",
        "tiger",
        "kind",
        "foregoing",
        "argument",
        "kripke",
        "lead",
        "conclusion",
        "relevant",
        "kind",
        "characterized",
        "necessity",
        "readily",
        "observable",
        "property",
        "instance",
        "show",
        "characterize",
        "kind",
        "kripke",
        "take",
        "view",
        "case",
        "certain",
        "microstructural",
        "property",
        "determine",
        "nature",
        "natural",
        "kind",
        "evident",
        "endorsement",
        "identity",
        "water",
        "ho",
        "gold",
        "element",
        "atomic",
        "number",
        "light",
        "stream",
        "photon",
        "essential",
        "property",
        "kind",
        "feature",
        "therefore",
        "may",
        "unknown",
        "even",
        "competent",
        "user",
        "relevant",
        "kind",
        "concept",
        "consequently",
        "essence",
        "known",
        "known",
        "posteriori",
        "argument",
        "considered",
        "suggest",
        "microstructural",
        "essence",
        "chemical",
        "physical",
        "kind",
        "considered",
        "consequence",
        "every",
        "natural",
        "kind",
        "must",
        "microstructural",
        "essence",
        "kripke",
        "regard",
        "material",
        "individual",
        "historical",
        "essence",
        "light",
        "cladism",
        "biology",
        "one",
        "may",
        "regard",
        "biological",
        "taxon",
        "historical",
        "essence",
        "also",
        "consistent",
        "general",
        "picture",
        "given",
        "u",
        "kripke",
        "putnam",
        "even",
        "thought",
        "biological",
        "kind",
        "microstructural",
        "essence",
        "mcginn",
        "kornblith",
        "laporte",
        "cladism",
        "commonly",
        "accepted",
        "system",
        "biological",
        "classification",
        "group",
        "organism",
        "according",
        "shared",
        "phylogenetic",
        "ancestry",
        "cladism",
        "replaced",
        "linnean",
        "hierarchical",
        "system",
        "biological",
        "classification",
        "organism",
        "grouped",
        "according",
        "shared",
        "morphological",
        "characteristic",
        "see",
        "section",
        "kripke",
        "distinguish",
        "essential",
        "property",
        "necessary",
        "property",
        "fine",
        "note",
        "claim",
        "p",
        "necessary",
        "property",
        "x",
        "claim",
        "p",
        "essential",
        "property",
        "x",
        "latter",
        "implies",
        "former",
        "former",
        "imply",
        "latter",
        "argument",
        "essentialism",
        "discussed",
        "note",
        "distinction",
        "move",
        "quickly",
        "claim",
        "necessity",
        "claim",
        "essence",
        "shown",
        "necessarily",
        "anything",
        "gold",
        "made",
        "element",
        "atomic",
        "number",
        "kripke",
        "concludes",
        "atomic",
        "number",
        "essential",
        "property",
        "kind",
        "gold",
        "fine",
        "point",
        "may",
        "insuperable",
        "obstacle",
        "establishing",
        "essentialism",
        "via",
        "argument",
        "kripke",
        "putnam",
        "may",
        "held",
        "fine",
        "hold",
        "essence",
        "concern",
        "nature",
        "identity",
        "thing",
        "one",
        "may",
        "argue",
        "argument",
        "kripke",
        "putnam",
        "others",
        "appeal",
        "intuition",
        "concerning",
        "nature",
        "andor",
        "identity",
        "natural",
        "kind",
        "inference",
        "essentialism",
        "claim",
        "necessity",
        "legitimate",
        "case",
        "kripkeputnam",
        "argument",
        "essentialism",
        "effect",
        "direct",
        "appeal",
        "intuition",
        "elli",
        "lowe",
        "dialectical",
        "basis",
        "essentialism",
        "essentialism",
        "core",
        "part",
        "take",
        "optimal",
        "metaphysical",
        "system",
        "elli",
        "regard",
        "essentialist",
        "metaphysics",
        "supported",
        "argument",
        "yield",
        "stronger",
        "argument",
        "scientific",
        "realism",
        "particular",
        "elli",
        "essence",
        "natural",
        "kind",
        "explain",
        "law",
        "nature",
        "law",
        "grounded",
        "world",
        "natural",
        "kind",
        "structure",
        "includes",
        "natural",
        "kind",
        "thing",
        "also",
        "natural",
        "kind",
        "process",
        "event",
        "mentioned",
        "lowe",
        "law",
        "concern",
        "natural",
        "kind",
        "contrast",
        "elli",
        "law",
        "grounded",
        "essential",
        "fact",
        "kind",
        "consequence",
        "law",
        "nature",
        "metaphysically",
        "necessary",
        "advantage",
        "explaining",
        "natural",
        "necessity",
        "metaphysical",
        "necessity",
        "cost",
        "denying",
        "intuitive",
        "contingency",
        "law",
        "lowe",
        "hand",
        "hold",
        "law",
        "grounded",
        "contingent",
        "possession",
        "property",
        "kind",
        "need",
        "metaphysically",
        "necessary",
        "conclusion",
        "note",
        "antiessentialists",
        "argue",
        "nonquestion",
        "begging",
        "way",
        "motivating",
        "appeal",
        "essence",
        "hugh",
        "mellor",
        "argues",
        "existence",
        "essence",
        "essentialist",
        "account",
        "natural",
        "kind",
        "simply",
        "gratuitous",
        "assumption",
        "others",
        "use",
        "example",
        "empirical",
        "science",
        "biology",
        "argue",
        "essentialism",
        "limited",
        "capture",
        "kind",
        "find",
        "special",
        "science",
        "dupré",
        "particular",
        "essentialist",
        "account",
        "kind",
        "seem",
        "construe",
        "immutable",
        "static",
        "whereas",
        "example",
        "natural",
        "science",
        "include",
        "mutable",
        "dynamic",
        "kind",
        "see",
        "section"
    ]
}