{
    "main_text": "Theoretical Options for Natural Law Theorists || The catalog of basic goods\n2.4 From the good to the right\n\nSuppose that we were to have in hand satisfactory accounts of natural\ngoodness and our knowledge of it, along with a rationally defensible\naccount of the basic goods that are the fundamental reasons for\naction. All that we would have so far is the natural law\ntheorist’s account of what we might call minimally rational\naction — action that seeks to realize some good. What we would\nnot have yet is a full account of right action. For we are frequently\nin situations in which there are various different courses of action\nthat we might pursue, each of which promises to realize some good; are\nthere no guidelines to which we might appeal in order to show some of\nthese choices superior to others?  After all, some of even the\nmost obviously morally wrong actions can be seen to promise some good\n— a robber might kill in order to get the money he needs to\npursue genuine goods — and the natural law theorist wants to be\nable to say why these obviously morally wrong actions are morally\nwrong. As we have seen, the paradigmatic natural law view holds that\nthere are some general rules of right that govern our pursuit of the\nvarious goods, and that these rules of right exclude those actions\nthat are in some way defective responses to the various basic\ngoods. How, though, are we to determine what counts as a defective\nresponse to the goods?\n\nThere are at least three possibilities. One might appeal to a master\nrule of right that can be used to generate further rules; call this\nthe master rule approach. One might appeal to a\nmethodological principle by which particular rules can be generated;\ncall this the method approach. Or one might appeal to some\nstandard for distinguishing correct and incorrect moral rules that is\nnot understandable as a method; call this (for reasons we shall see\nshortly) the virtue approach.\n\nOn the master rule approach, the task of the natural law theorist is\nto identify some master rule which bears on the basic goods and,\nperhaps in conjunction with further factual premises, is able to\nproduce a stock of general rules about what sorts of responses to the\nbasic goods are or are not reasonable. While it is far from clear\nwhether there was a single way that Aquinas proceeded in establishing\nmoral norms from the primary precepts of the natural law in the\nSumma Theologiae, John Finnis has argued (Finnis 1998, p.\n126) that Aquinas employed this master rule approach: on his view,\nAquinas held that this master rule is the rule of universal love, that\none should love one’s neighbor as oneself. This rule bids us to\nrespond to the good lovingly wherever it can be realized, and from it\nwe can see that certain ways of responding to the good are ruled out\nas essentially unloving. Grisez clearly employs this approach: he\nwrites that the first principle of morality is that “In\nvoluntarily acting for human goods and avoiding what is opposed to\nthem, one ought to choose and otherwise will those and only those\npossibilities whose willing is compatible with a will toward integral\nhuman fulfillment” (Grisez 1983, p. 184). This first principle,\nGrisez says, contains implicitly within it various “modes of\nresponsibility” from which particular moral rules can be\nderived.\n\nThe central difficulty with this employment of the master rule\napproach is that of explaining how we are to grasp this first\nprinciple of morality as correct. What is the relationship between our\nknowledge of the basic goods and our knowledge of the master\nrule?  When Grisez defends his master rule, he writes that its\nstatus is due to a certain function that a first principle of morality\nmust perform:  “It must provide the basis for guiding\nchoices toward overall human fulfillment. As a single principle, it\nwill give unity and direction to a morally good life. At the same\ntime, it must not exclude ways of living which might contribute to a\ncomplete human community” (Grisez 1983, p. 184). But this\npresupposes an awful lot: why should we assume in advance that a\nproper response to the basic goods must be one that is oriented toward\na “complete human community”?\n\nOn the method approach, by contrast, there is no need for a master\nprinciple that will serve as the basis for deriving some particular\nmoral rules. The idea here is the natural law theorist needs not a\nmaster rule but a test for distinguishing correct moral rules from\nincorrect ones. We know from our earlier consideration of the\nparadigmatic natural law view that the test for distinguishing correct\nmoral rules from incorrect ones must be something like the following:\nif a moral rule rules out certain choices as defective that are in\nfact defective, and rules out no choices as defective that are not in\nfact defective, then it is a correct moral rule. What would\ndistinguish different employments of the method approach is their\naccounts of what features of a choice we appeal to in order to\ndetermine whether it is defective. The knowledge that we have to go on\nhere is our knowledge of the basic goods. If a certain choice\npresupposes something false about the basic goods, then it responds\ndefectively to them. So a moral rule can be justified by showing that\nit rules out only choices that presuppose something false about the\nbasic goods.\n\nThis is very abstract. Here is an example of an employment of this\napproach. While Finnis now affirms Grisez’s master rule\napproach, in his 1980 work he defends various principles of practical\nreasonableness without adverting to a master rule. He argues, for\nexample, that it is always wrong to intend the destruction of an\ninstance of a basic good (Finnis 1980, pp. 118–123). (So, no\nlying, for lying is an intentional attack on knowledge; no murder, for\nmurder is an intentional attack on life, and so forth.)  Why is\nit always wrong to do so?  It would be unreasonable simply to try\nto destroy an instance of a basic good, for no further purpose: for\nthat would treat an instance of a basic good as something that it is\nnot — that is, as valueless. And it would be wrong to destroy an\ninstance of a basic good for the sake of bringing about some other\ninstance of a basic good: for that would make sense only if the good\nbrought about were more valuable than the good destroyed, but on\nFinnis’s view all distinct instances of basic goods are\nincommensurable — none is of more, less, or equal value with any\nother. So the rule forbidding intentional destruction of an instance\nof a basic good is justified because it rules out only choices that\npresuppose something false about the nature of the basic goods. (For a\nworking out of the method approach, see Murphy 2001, ch. 5.)\n\nThe method approach presupposes less of substance about morality than\nthe master rule approach presupposes. But it requires us to draw upon\nan interesting and rich knowledge of the features of the basic goods.\nWhether this information is available is a matter for debate. But the\nmethod approach has the advantage of firmly rooting natural law\narguments for moral principles in the goods the pursuit of which those\nmoral principles are supposed to regulate.\n\nNeither the master rule nor the method approach implies that the\nnatural law theorist must hold that all right action can be captured\nin general rules. The natural law view is only that there are some\nsuch rules. It is consistent with the natural law position that there\nare a number of choice situations in which there is a right answer,\nyet in which that right answer is not dictated by any natural law rule\nor set of rules, but rather is grasped only by a virtuous, practically\nwise person. It is, however, open to the natural law theorist to use\nthis appeal to the judgment of the practically wise person more\nwidely, holding that the general rules concerning the appropriate\nresponse to the goods cannot be properly determined by any master rule\nor philosophical method, but can be determined only by appeal to the\ninsight of the person of practical wisdom. If it really is wrong in\nall cases to tell lies, as Aquinas and Grisez and Finnis have argued,\nour grasp of this moral truth is dependent on our possessing, or our\nbeing able to recognize the possessor of, practical wisdom. If such a\nperson never tells lies, because she or he just sees that to tell lies\nwould be to respond defectively to the good, then that lying is always\nwrong is a rule of the natural law.\n\nIt may be true that by the virtue approach we can learn of some\ngeneral rules of the natural law. What is more interesting is whether\na defender of the virtue approach would be right to dismiss the claims\nof the master rule or method approaches. (For, after all, one might be\nable to learn that lying is wrong either through moral\nargument or through the perceptive insight of practical wisdom.) \nAnd it does not seem that the defender of the master rule or method\napproach should be particularly concerned to discredit the virtue\napproach. For if defenders of the master rule or method approach\nrecognize the existence of a capacity of judgment like practical\nwisdom, then it would be strange to allow that it can be correctly\nexercised on a number of particular occasions while denying that we\nmight learn of general rules from observing patterns of its exercise\non various occasions.\n\nOne challenge to these various natural law attempts to explain the\nright in terms of the good denies that the natural law theorist can\nprovide adequate explanations of the range of norms of right conduct\nfor which moral theories ought to be able to provide explanations.\nThat is, one might allow for the sake of argument the natural law\ntheorist’s identification of some range of human goods, while\ndenying that he or she can identify, and justify in natural law terms,\nadequately concrete modes of appropriate response to those goods. This\nchallenge cannot be profitably addressed here; what would be required\nwould be a close examination of the merits of particular natural law\nexplanations of particular moral norms (a task taken up in, for\nexample, Grisez 1993). One might also look to recent attempts to apply\nthe natural law view to pressing contemporary moral problems —\nthose of research ethics (Tollefsen 2008), economic justice (Chartier\n2009), environmental ethics (Davison 2009), business ethics (Gonzalez\n2015), the ethics of suicide and euthanasia (Paterson 2015), and\npopulation ethics (Delaney 2016), for example — as tests of the\nfruitfulness of that position.\n\nA more radical critique of the paradigmatic natural law account of the\nconnection between the good and the right calls into question the very\nidea that one can get principles of moral rightness merely from what\nconstitutes a defective response to the good. According to this\ncritique, while it is true that one might be able to come up with some\nnotion of unreasonableness by appeal to the notion of what is\ndefective response to the human goods, the notion of moral rightness\nbelongs to a family of concepts distinct from that to which the notion\nof reasonableness belongs. On this view, moral rightness belongs to\nthe obligation family, and the concept of obligation is\nirreducibly social: one is under an obligation only if one is\nsubject to some sort of demand in the context of a social relationship\n(see, for an example of this view from a theological voluntarist\nperspective, Adams 1999, pp. 238–241; see, for an example of\nthis view with a Kantian twist, Darwall 2006). It is part of the logic\nof obligation that when one is under an obligation, that condition has\nresulted from a demand imposed on him or her by some other party. So,\naccording to this line of criticism, the paradigmatic natural law view\nis unable to show that the natural law is intrinsically morally\nauthoritative: the precepts of the natural law can be rules that all\nof us human beings are obligated to obey, that it would be\nwrong for us to disobey, and that we would be guilty\nfor flouting only if these precepts are imposed upon us by an\nauthoritative being — perhaps a being like God.\n\nThe intrinsic moral authority of the natural law has been a matter of\ndebate since Aquinas: it was a central issue dividing Aquinas’s\nview from those of Scotus, Ockham, and Suarez. It continues to be an\nissue between natural law theorists like Grisez (1983) and Finnis\n(1980) on one hand and theological voluntarists like Adams (1999) and\nHare (2001) on the other. Natural law theorists have several options:\nthey can argue against any meaningful distinction between morality and\nthe reasonable more generally (Foot 2000, pp. 66–80); or they\ncan embrace the distinction, but hold that on the clearest conception\nof the moral that we possess, the natural law account of\nreasonableness in action adequately satisfies that conception (Murphy\n2001, pp. 222–227); or they can hold that the notion of\n‘morally right’ is so muddled that it should be\njettisoned, leaving in its stead the notion of the reasonable (cf.\nAnscombe 1958). It is at present far from clear which of these avenues\nof response the natural law theorist has most reason to embrace.\n",
    "section_title": "2.4 From the good to the right",
    "entry_title": "The Natural Law Tradition in Ethics",
    "hierarchy_title": "The Natural Law Tradition in Ethics || Theoretical Options for Natural Law Theorists || The catalog of basic goods",
    "tokenized_text": [
        "theoretical",
        "option",
        "natural",
        "law",
        "theorist",
        "catalog",
        "basic",
        "good",
        "good",
        "right",
        "suppose",
        "hand",
        "satisfactory",
        "account",
        "natural",
        "goodness",
        "knowledge",
        "along",
        "rationally",
        "defensible",
        "account",
        "basic",
        "good",
        "fundamental",
        "reason",
        "action",
        "would",
        "far",
        "natural",
        "law",
        "theorist",
        "account",
        "might",
        "call",
        "minimally",
        "rational",
        "action",
        "action",
        "seek",
        "realize",
        "good",
        "would",
        "yet",
        "full",
        "account",
        "right",
        "action",
        "frequently",
        "situation",
        "various",
        "different",
        "course",
        "action",
        "might",
        "pursue",
        "promise",
        "realize",
        "good",
        "guideline",
        "might",
        "appeal",
        "order",
        "show",
        "choice",
        "superior",
        "others",
        "even",
        "obviously",
        "morally",
        "wrong",
        "action",
        "seen",
        "promise",
        "good",
        "robber",
        "might",
        "kill",
        "order",
        "get",
        "money",
        "need",
        "pursue",
        "genuine",
        "good",
        "natural",
        "law",
        "theorist",
        "want",
        "able",
        "say",
        "obviously",
        "morally",
        "wrong",
        "action",
        "morally",
        "wrong",
        "seen",
        "paradigmatic",
        "natural",
        "law",
        "view",
        "hold",
        "general",
        "rule",
        "right",
        "govern",
        "pursuit",
        "various",
        "good",
        "rule",
        "right",
        "exclude",
        "action",
        "way",
        "defective",
        "response",
        "various",
        "basic",
        "good",
        "though",
        "determine",
        "count",
        "defective",
        "response",
        "good",
        "least",
        "three",
        "possibility",
        "one",
        "might",
        "appeal",
        "master",
        "rule",
        "right",
        "used",
        "generate",
        "rule",
        "call",
        "master",
        "rule",
        "approach",
        "one",
        "might",
        "appeal",
        "methodological",
        "principle",
        "particular",
        "rule",
        "generated",
        "call",
        "method",
        "approach",
        "one",
        "might",
        "appeal",
        "standard",
        "distinguishing",
        "correct",
        "incorrect",
        "moral",
        "rule",
        "understandable",
        "method",
        "call",
        "reason",
        "shall",
        "see",
        "shortly",
        "virtue",
        "approach",
        "master",
        "rule",
        "approach",
        "task",
        "natural",
        "law",
        "theorist",
        "identify",
        "master",
        "rule",
        "bear",
        "basic",
        "good",
        "perhaps",
        "conjunction",
        "factual",
        "premise",
        "able",
        "produce",
        "stock",
        "general",
        "rule",
        "sort",
        "response",
        "basic",
        "good",
        "reasonable",
        "far",
        "clear",
        "whether",
        "single",
        "way",
        "aquinas",
        "proceeded",
        "establishing",
        "moral",
        "norm",
        "primary",
        "precept",
        "natural",
        "law",
        "summa",
        "theologiae",
        "john",
        "finnis",
        "argued",
        "finnis",
        "p",
        "aquinas",
        "employed",
        "master",
        "rule",
        "approach",
        "view",
        "aquinas",
        "held",
        "master",
        "rule",
        "rule",
        "universal",
        "love",
        "one",
        "love",
        "one",
        "neighbor",
        "oneself",
        "rule",
        "bid",
        "u",
        "respond",
        "good",
        "lovingly",
        "wherever",
        "realized",
        "see",
        "certain",
        "way",
        "responding",
        "good",
        "ruled",
        "essentially",
        "unloving",
        "grisez",
        "clearly",
        "employ",
        "approach",
        "writes",
        "first",
        "principle",
        "morality",
        "voluntarily",
        "acting",
        "human",
        "good",
        "avoiding",
        "opposed",
        "one",
        "ought",
        "choose",
        "otherwise",
        "possibility",
        "whose",
        "willing",
        "compatible",
        "toward",
        "integral",
        "human",
        "fulfillment",
        "grisez",
        "p",
        "first",
        "principle",
        "grisez",
        "say",
        "contains",
        "implicitly",
        "within",
        "various",
        "mode",
        "responsibility",
        "particular",
        "moral",
        "rule",
        "derived",
        "central",
        "difficulty",
        "employment",
        "master",
        "rule",
        "approach",
        "explaining",
        "grasp",
        "first",
        "principle",
        "morality",
        "correct",
        "relationship",
        "knowledge",
        "basic",
        "good",
        "knowledge",
        "master",
        "rule",
        "grisez",
        "defends",
        "master",
        "rule",
        "writes",
        "status",
        "due",
        "certain",
        "function",
        "first",
        "principle",
        "morality",
        "must",
        "perform",
        "must",
        "provide",
        "basis",
        "guiding",
        "choice",
        "toward",
        "overall",
        "human",
        "fulfillment",
        "single",
        "principle",
        "give",
        "unity",
        "direction",
        "morally",
        "good",
        "life",
        "time",
        "must",
        "exclude",
        "way",
        "living",
        "might",
        "contribute",
        "complete",
        "human",
        "community",
        "grisez",
        "p",
        "presupposes",
        "awful",
        "lot",
        "assume",
        "advance",
        "proper",
        "response",
        "basic",
        "good",
        "must",
        "one",
        "oriented",
        "toward",
        "complete",
        "human",
        "community",
        "method",
        "approach",
        "contrast",
        "need",
        "master",
        "principle",
        "serve",
        "basis",
        "deriving",
        "particular",
        "moral",
        "rule",
        "idea",
        "natural",
        "law",
        "theorist",
        "need",
        "master",
        "rule",
        "test",
        "distinguishing",
        "correct",
        "moral",
        "rule",
        "incorrect",
        "one",
        "know",
        "earlier",
        "consideration",
        "paradigmatic",
        "natural",
        "law",
        "view",
        "test",
        "distinguishing",
        "correct",
        "moral",
        "rule",
        "incorrect",
        "one",
        "must",
        "something",
        "like",
        "following",
        "moral",
        "rule",
        "rule",
        "certain",
        "choice",
        "defective",
        "fact",
        "defective",
        "rule",
        "choice",
        "defective",
        "fact",
        "defective",
        "correct",
        "moral",
        "rule",
        "would",
        "distinguish",
        "different",
        "employment",
        "method",
        "approach",
        "account",
        "feature",
        "choice",
        "appeal",
        "order",
        "determine",
        "whether",
        "defective",
        "knowledge",
        "go",
        "knowledge",
        "basic",
        "good",
        "certain",
        "choice",
        "presupposes",
        "something",
        "false",
        "basic",
        "good",
        "responds",
        "defectively",
        "moral",
        "rule",
        "justified",
        "showing",
        "rule",
        "choice",
        "presuppose",
        "something",
        "false",
        "basic",
        "good",
        "abstract",
        "example",
        "employment",
        "approach",
        "finnis",
        "affirms",
        "grisez",
        "master",
        "rule",
        "approach",
        "work",
        "defends",
        "various",
        "principle",
        "practical",
        "reasonableness",
        "without",
        "adverting",
        "master",
        "rule",
        "argues",
        "example",
        "always",
        "wrong",
        "intend",
        "destruction",
        "instance",
        "basic",
        "good",
        "finnis",
        "pp",
        "lying",
        "lying",
        "intentional",
        "attack",
        "knowledge",
        "murder",
        "murder",
        "intentional",
        "attack",
        "life",
        "forth",
        "always",
        "wrong",
        "would",
        "unreasonable",
        "simply",
        "try",
        "destroy",
        "instance",
        "basic",
        "good",
        "purpose",
        "would",
        "treat",
        "instance",
        "basic",
        "good",
        "something",
        "valueless",
        "would",
        "wrong",
        "destroy",
        "instance",
        "basic",
        "good",
        "sake",
        "bringing",
        "instance",
        "basic",
        "good",
        "would",
        "make",
        "sense",
        "good",
        "brought",
        "valuable",
        "good",
        "destroyed",
        "finnis",
        "view",
        "distinct",
        "instance",
        "basic",
        "good",
        "incommensurable",
        "none",
        "le",
        "equal",
        "value",
        "rule",
        "forbidding",
        "intentional",
        "destruction",
        "instance",
        "basic",
        "good",
        "justified",
        "rule",
        "choice",
        "presuppose",
        "something",
        "false",
        "nature",
        "basic",
        "good",
        "working",
        "method",
        "approach",
        "see",
        "murphy",
        "ch",
        "method",
        "approach",
        "presupposes",
        "le",
        "substance",
        "morality",
        "master",
        "rule",
        "approach",
        "presupposes",
        "requires",
        "u",
        "draw",
        "upon",
        "interesting",
        "rich",
        "knowledge",
        "feature",
        "basic",
        "good",
        "whether",
        "information",
        "available",
        "matter",
        "debate",
        "method",
        "approach",
        "advantage",
        "firmly",
        "rooting",
        "natural",
        "law",
        "argument",
        "moral",
        "principle",
        "good",
        "pursuit",
        "moral",
        "principle",
        "supposed",
        "regulate",
        "neither",
        "master",
        "rule",
        "method",
        "approach",
        "implies",
        "natural",
        "law",
        "theorist",
        "must",
        "hold",
        "right",
        "action",
        "captured",
        "general",
        "rule",
        "natural",
        "law",
        "view",
        "rule",
        "consistent",
        "natural",
        "law",
        "position",
        "number",
        "choice",
        "situation",
        "right",
        "answer",
        "yet",
        "right",
        "answer",
        "dictated",
        "natural",
        "law",
        "rule",
        "set",
        "rule",
        "rather",
        "grasped",
        "virtuous",
        "practically",
        "wise",
        "person",
        "however",
        "open",
        "natural",
        "law",
        "theorist",
        "use",
        "appeal",
        "judgment",
        "practically",
        "wise",
        "person",
        "widely",
        "holding",
        "general",
        "rule",
        "concerning",
        "appropriate",
        "response",
        "good",
        "properly",
        "determined",
        "master",
        "rule",
        "philosophical",
        "method",
        "determined",
        "appeal",
        "insight",
        "person",
        "practical",
        "wisdom",
        "really",
        "wrong",
        "case",
        "tell",
        "lie",
        "aquinas",
        "grisez",
        "finnis",
        "argued",
        "grasp",
        "moral",
        "truth",
        "dependent",
        "possessing",
        "able",
        "recognize",
        "possessor",
        "practical",
        "wisdom",
        "person",
        "never",
        "tell",
        "lie",
        "see",
        "tell",
        "lie",
        "would",
        "respond",
        "defectively",
        "good",
        "lying",
        "always",
        "wrong",
        "rule",
        "natural",
        "law",
        "may",
        "true",
        "virtue",
        "approach",
        "learn",
        "general",
        "rule",
        "natural",
        "law",
        "interesting",
        "whether",
        "defender",
        "virtue",
        "approach",
        "would",
        "right",
        "dismiss",
        "claim",
        "master",
        "rule",
        "method",
        "approach",
        "one",
        "might",
        "able",
        "learn",
        "lying",
        "wrong",
        "either",
        "moral",
        "argument",
        "perceptive",
        "insight",
        "practical",
        "wisdom",
        "seem",
        "defender",
        "master",
        "rule",
        "method",
        "approach",
        "particularly",
        "concerned",
        "discredit",
        "virtue",
        "approach",
        "defender",
        "master",
        "rule",
        "method",
        "approach",
        "recognize",
        "existence",
        "capacity",
        "judgment",
        "like",
        "practical",
        "wisdom",
        "would",
        "strange",
        "allow",
        "correctly",
        "exercised",
        "number",
        "particular",
        "occasion",
        "denying",
        "might",
        "learn",
        "general",
        "rule",
        "observing",
        "pattern",
        "exercise",
        "various",
        "occasion",
        "one",
        "challenge",
        "various",
        "natural",
        "law",
        "attempt",
        "explain",
        "right",
        "term",
        "good",
        "denies",
        "natural",
        "law",
        "theorist",
        "provide",
        "adequate",
        "explanation",
        "range",
        "norm",
        "right",
        "conduct",
        "moral",
        "theory",
        "ought",
        "able",
        "provide",
        "explanation",
        "one",
        "might",
        "allow",
        "sake",
        "argument",
        "natural",
        "law",
        "theorist",
        "identification",
        "range",
        "human",
        "good",
        "denying",
        "identify",
        "justify",
        "natural",
        "law",
        "term",
        "adequately",
        "concrete",
        "mode",
        "appropriate",
        "response",
        "good",
        "challenge",
        "profitably",
        "addressed",
        "would",
        "required",
        "would",
        "close",
        "examination",
        "merit",
        "particular",
        "natural",
        "law",
        "explanation",
        "particular",
        "moral",
        "norm",
        "task",
        "taken",
        "example",
        "grisez",
        "one",
        "might",
        "also",
        "look",
        "recent",
        "attempt",
        "apply",
        "natural",
        "law",
        "view",
        "pressing",
        "contemporary",
        "moral",
        "problem",
        "research",
        "ethic",
        "tollefsen",
        "economic",
        "justice",
        "chartier",
        "environmental",
        "ethic",
        "davison",
        "business",
        "ethic",
        "gonzalez",
        "ethic",
        "suicide",
        "euthanasia",
        "paterson",
        "population",
        "ethic",
        "delaney",
        "example",
        "test",
        "fruitfulness",
        "position",
        "radical",
        "critique",
        "paradigmatic",
        "natural",
        "law",
        "account",
        "connection",
        "good",
        "right",
        "call",
        "question",
        "idea",
        "one",
        "get",
        "principle",
        "moral",
        "rightness",
        "merely",
        "constitutes",
        "defective",
        "response",
        "good",
        "according",
        "critique",
        "true",
        "one",
        "might",
        "able",
        "come",
        "notion",
        "unreasonableness",
        "appeal",
        "notion",
        "defective",
        "response",
        "human",
        "good",
        "notion",
        "moral",
        "rightness",
        "belongs",
        "family",
        "concept",
        "distinct",
        "notion",
        "reasonableness",
        "belongs",
        "view",
        "moral",
        "rightness",
        "belongs",
        "obligation",
        "family",
        "concept",
        "obligation",
        "irreducibly",
        "social",
        "one",
        "obligation",
        "one",
        "subject",
        "sort",
        "demand",
        "context",
        "social",
        "relationship",
        "see",
        "example",
        "view",
        "theological",
        "voluntarist",
        "perspective",
        "adam",
        "pp",
        "see",
        "example",
        "view",
        "kantian",
        "twist",
        "darwall",
        "part",
        "logic",
        "obligation",
        "one",
        "obligation",
        "condition",
        "resulted",
        "demand",
        "imposed",
        "party",
        "according",
        "line",
        "criticism",
        "paradigmatic",
        "natural",
        "law",
        "view",
        "unable",
        "show",
        "natural",
        "law",
        "intrinsically",
        "morally",
        "authoritative",
        "precept",
        "natural",
        "law",
        "rule",
        "u",
        "human",
        "being",
        "obligated",
        "obey",
        "would",
        "wrong",
        "u",
        "disobey",
        "would",
        "guilty",
        "flouting",
        "precept",
        "imposed",
        "upon",
        "u",
        "authoritative",
        "perhaps",
        "like",
        "god",
        "intrinsic",
        "moral",
        "authority",
        "natural",
        "law",
        "matter",
        "debate",
        "since",
        "aquinas",
        "central",
        "issue",
        "dividing",
        "aquinas",
        "view",
        "scotus",
        "ockham",
        "suarez",
        "continues",
        "issue",
        "natural",
        "law",
        "theorist",
        "like",
        "grisez",
        "finnis",
        "one",
        "hand",
        "theological",
        "voluntarists",
        "like",
        "adam",
        "hare",
        "natural",
        "law",
        "theorist",
        "several",
        "option",
        "argue",
        "meaningful",
        "distinction",
        "morality",
        "reasonable",
        "generally",
        "foot",
        "pp",
        "embrace",
        "distinction",
        "hold",
        "clearest",
        "conception",
        "moral",
        "posse",
        "natural",
        "law",
        "account",
        "reasonableness",
        "action",
        "adequately",
        "satisfies",
        "conception",
        "murphy",
        "pp",
        "hold",
        "notion",
        "morally",
        "right",
        "muddled",
        "jettisoned",
        "leaving",
        "stead",
        "notion",
        "reasonable",
        "cf",
        "anscombe",
        "present",
        "far",
        "clear",
        "avenue",
        "response",
        "natural",
        "law",
        "theorist",
        "reason",
        "embrace"
    ]
}