{
    "main_text": "Natural Kinds in the Special Sciences || Natural Kinds and Psychology\n2.3 Natural Kinds and Psychology\n\nDo the different sorts of mental state form natural kinds? We\ncertainly think that our minds make a difference to what happens in\nthe physical world and we think that we act because we have\ncertain beliefs, desires, hopes, fears etc. The distinctive\nexplanatory roles performed by these different states in folk\npsychology certainly suggest that these beliefs, desires, hopes and\nfears constitute distinct mental natural kinds. Note that in\nconsidering natural kinds in chemistry, biology, and physics we have\nthought of kinds principally as kinds of thing (kinds of stuff,\norganism, particle, etc.) whereas we are now considering the\npossibility of certain kinds of state. (Ellis (2001, 2002) is\nclear that he does not limit natural kinds to kinds of thing, but\nincludes kinds of state and process also.) A Cartesian dualist holds\nthat mental states are distinct from any physical state of the\nsubject, as they are states of an immaterial thinking substance. The\nproblem for dualism however is in finding the ground of the difference\nbetween fearing, believing, hoping etc. i.e. what difference is there\nto the immaterial substance when a subject is in different mental\nstates? In principle this problem could be avoided by the dualist if\nmental kinds are regarded as immaterial substances (Shoemaker\n2003).\n\nThere are many ways to understand mental natural kinds, and theories\nhave been proposed by eliminativists, identity theorists,\nfunctionalists and many others. We will treat each of these in turn.\nPhysicalists hold that the differences in mental kinds relate somehow\nto differences in states of the subject’s brain, or, more\ngenerally, the subject’s body. At one extreme, the (type)\nidentity theory of mind holds that types of mental state are identical\nwith types of brain state. If so, we may expect the kinds of\npsychology to be identical with the kinds of neuroscience.\n\nThe identity theory faces the problem of multiple\nrealizability—the idea that it is possible for physically\ndiverse creatures to be in the same kind of mental state. It is\npossible, for example, that Martian neurophysiology might be entirely\ndifferent from that of humans while Martians nonetheless have the same\nkinds of mental state as humans have; if a Martian’s body is\ninjured, it writhes, groans, and avoids the causes of such\ninjuries—the Martian is in pain (Lewis 1980). Indeed it is\npossible that cognitive scientists might design a machine that is\ncapable of higher-level thought (implemented on, for example, a\nsilicon architecture). It is even possible that the same mental kinds\nbe realized by distinct neurophysiological systems in one and the same\norganism over time. Consequently, it is at least an open empirical\npossibility that mental kinds may correspond to a widely disjunctive\nand heterogeneous set of neurophysiological kinds, and hence that\nthere is no one-to-one correlation between them.\n\nEliminativism argues that the prima facie failure to\nstraightforwardly reduce mental kinds to neurophysiological kinds\nought to lead to the elimination of mental kinds altogether\n(Churchland 1981, 1988). This is to claim that there are no mental\nnatural kinds. On this view, the mental kinds in folk psychology are\ncomparable to the kinds delineated by discredited folk theories from\nthe past e.g., the humours in medieval medicine. The underlying\nprinciple of medieval medicine was the balancing of so-called four\nhumours. According to the theory, illness was caused by an imbalance\nof these four humours. From the point of view of modern medicine this\ntheory is radically false and so the only option is to eliminate the\nhumours as putative natural kinds. Analogously, mental kinds ought to\nbe eliminated in favour of those kinds uncovered by recent research in\nneuroscience. Eliminativists agree that human beings have invented a\nvery successful methodology for describing their mental lives. This\nmethodology is folk psychology, a common sense theory of how mental\nstates are causally related to human action. However, folk psychology,\nthey argue, is merely a heuristic device invented by human beings in\norder to make the explanation of behaviour easier. The posits of the\ntheory are not real natural kinds. Once a better explanation of human\nbehaviour in terms of neurophysiological kinds is available, then\nmental kinds will be eliminated.\n\nFunctionalists argue that the irreducibilty of mental kinds is\nnevertheless compatible with a token-token identity theory (Fodor\n1974, 1997). Mental kinds are not type-identical with\nneurophysiological kinds (i.e. there is not one type of\nneurophysiological correlate for each type of mental state, so we\ncannot make general identity statements such as “pain =\nC-fibres firing”). A Martian and I, both in a state of\nfear at a time t, may be in different physiological states.\nNevertheless, my token instance of the kind fear at time t\nwill be identical with the token physical state in my brain at that\ntime. Likewise, the token instance of the Martian’s fear at time\nt1 is identical with his token physical state.\n\nIt has been argued by Kim (1992, 1993) that multiply realized mental\nkinds of the latter kind can in principle be locally reduced to their\nrealizing states. Mental kinds are analogous to mineral kinds such as\njade, which can be locally reduced to nephrite or jadeite depending on\nthe sample. Importantly, a sample that does not consist of either\nnephrite or jadeite is simply not jade. Nevertheless, there is an\nimportant disanalogy between mental kinds and locally reduced kinds\nlike jade. If you want a sample of jade, then it must be composed of\neither jadeite or nephrite. In other words, if J (jade) is\nrealized by the disjunction P (Jadeite) or Q\n(Nephrite), then it is metaphysically necessary that the properties a\nthing has qua J are either properties it has\nqua P or properties it has qua Q.\nSo, something with all the other qualitative properties of jade in\nanother possible world, but which lacked the essential properties\n(i.e. of jadeite or nephrite) would simply not be an instance of\njade.\n\nIn contrast, for the functionalist (Fodor 1997) mental kinds are\ndefined by their functional roles, rather than by the essential\nproperties of the neurophysiological kinds that realize them. It does\nnot matter which physical kind does the realizing, be it silicon\nchips, neurons, C-fibres or whatever. Rather, what matters is\nthat the psychological state (e.g., pain) plays a certain functional\nrole. The whole point of multiple realizability is that it is easy to\nimagine some possible world where a token mental kind is realized by\nsilicon chips, C-fibres firing, or whatever. So, a mental\nkind is not essentially realized by a certain neurophysiological kind;\nrather it plays the same functional role independently of what\nunderlying kind is realizing it. This appears to violate Criterion 1\nfor natural kinds (in Section 1.1.1), that members of a natural kind\nshould have some natural properties in common.\n\nThe functional role of mental kinds is explained by some\nfunctionalists in terms of the modularity of the mind (Fodor 1983).\nThis is the claim that the mind has different innate modules which\nplay a certain functional role. These modules are domain-specific,\noperating only on certain kinds of inputs. So, for example, there will\nbe distinct modules for mental tasks like mind-reading, speaker\nrecognition and facial recognition. The functional role associated\nwith mental kinds might for example be given an evolutionary account\nin terms of adapted modules (Cosmides and Tooby 1992). On this view,\nmental kinds in folk psychology are successful for the purposes of the\nexplanation of human behaviour because they refer to the functional\nmodules of the mind. Such views may motivate emergentism. One\ninterpretation of the emergentist account of mind is that there are\nemergent mental kinds that have no straightforward correlation with\nthe kinds identified by neuroscience. Nor are mental kinds and\nneurophysiological kinds either identical to or subkinds of one\nanother; consequently emergentism is in conflict with the (contested)\ntaxonomic hierarchy criterion (Criterion 5). (See the entry on\n emergent properties.)\n\nThe type-identity theory, if true, might seem to motivate essentialism\nabout psychological kinds, by analogy with other theoretical\nidentities (see Section 1.3.1 and Section 4.3). Kripke (1980),\nhowever, denies that his arguments concerning other theoretical\nidentities apply here. Let us say that (slow) pain for us humans is\ncorrelated with the firing of C-fibres. If this were a\ngenuine theoretical identity, then in all possible worlds, when\nsomeone undergoes C-fibre firing, then they are in a state of\npain. But it seems plausible that there could be worlds where\nC-fibre stimulation is not accompanied by any painful\nsensation. If there are such worlds, then the theoretical identity\nimplies that such a world is one where people can be in pain without\nhaving any painful sensation; indeed the pain might yield a pleasant\nsensation. Kripke regards this as counterintuitive. The concept of\npain is necessarily tied to the phenomenal nature of the pain\nsensation, whereas the concept of gold is not tied to the colour\nyellow. Consequently, there is no identity between pain and\nC-fibre firing (nor any other physical state); likewise there\nis no physical essence to pain. A posteriori natural kind\nessentialism fails in this case.\n\nRecently, there has been some discussion of whether mental concepts\nare themselves natural kinds. The claim that concepts form a natural\nkind has been accepted by philosophers of psychology and cognitive\npsychologists alike (Margolis, 1994, 1995; Fodor, 1998, 2008). Recent\nliterature has argued against that assumption (Griffiths 1997; Machery\n2005, 2009; Piccinini and Scott 2006). Griffiths 1997 has argued that\nindividual and familiar concepts such as emotion do not correspond to\ngenuine natural kinds, and should therefore be eliminated from\nscientific vocabulary. Machery’s (2009, Ch. 3) heterogeneity\nhypothesis claims furthermore that the class of concepts do not\ndelineate a homogeneous class; the kind ‘concept’. Rather,\nthey divide into several distinct kinds that actually have little in\ncommon. Thus, it is a mistake to assume that there are many general\nproperties of concepts, and that a theory of concepts should attempt\nto describe these. In general, then the notion of concept is not part\nof an adequate taxonomy of our mental representation.\n",
    "section_title": "2.3 Natural Kinds and Psychology",
    "entry_title": "Natural Kinds",
    "hierarchy_title": "Natural Kinds || Natural Kinds in the Special Sciences || Natural Kinds and Psychology",
    "tokenized_text": [
        "natural",
        "kind",
        "special",
        "science",
        "natural",
        "kind",
        "psychology",
        "natural",
        "kind",
        "psychology",
        "different",
        "sort",
        "mental",
        "state",
        "form",
        "natural",
        "kind",
        "certainly",
        "think",
        "mind",
        "make",
        "difference",
        "happens",
        "physical",
        "world",
        "think",
        "act",
        "certain",
        "belief",
        "desire",
        "hope",
        "fear",
        "etc",
        "distinctive",
        "explanatory",
        "role",
        "performed",
        "different",
        "state",
        "folk",
        "psychology",
        "certainly",
        "suggest",
        "belief",
        "desire",
        "hope",
        "fear",
        "constitute",
        "distinct",
        "mental",
        "natural",
        "kind",
        "note",
        "considering",
        "natural",
        "kind",
        "chemistry",
        "biology",
        "physic",
        "thought",
        "kind",
        "principally",
        "kind",
        "thing",
        "kind",
        "stuff",
        "organism",
        "particle",
        "etc",
        "whereas",
        "considering",
        "possibility",
        "certain",
        "kind",
        "state",
        "elli",
        "clear",
        "limit",
        "natural",
        "kind",
        "kind",
        "thing",
        "includes",
        "kind",
        "state",
        "process",
        "also",
        "cartesian",
        "dualist",
        "hold",
        "mental",
        "state",
        "distinct",
        "physical",
        "state",
        "subject",
        "state",
        "immaterial",
        "thinking",
        "substance",
        "problem",
        "dualism",
        "however",
        "finding",
        "ground",
        "difference",
        "fearing",
        "believing",
        "hoping",
        "etc",
        "ie",
        "difference",
        "immaterial",
        "substance",
        "subject",
        "different",
        "mental",
        "state",
        "principle",
        "problem",
        "could",
        "avoided",
        "dualist",
        "mental",
        "kind",
        "regarded",
        "immaterial",
        "substance",
        "shoemaker",
        "many",
        "way",
        "understand",
        "mental",
        "natural",
        "kind",
        "theory",
        "proposed",
        "eliminativists",
        "identity",
        "theorist",
        "functionalist",
        "many",
        "others",
        "treat",
        "turn",
        "physicalists",
        "hold",
        "difference",
        "mental",
        "kind",
        "relate",
        "somehow",
        "difference",
        "state",
        "subject",
        "brain",
        "generally",
        "subject",
        "body",
        "one",
        "extreme",
        "type",
        "identity",
        "theory",
        "mind",
        "hold",
        "type",
        "mental",
        "state",
        "identical",
        "type",
        "brain",
        "state",
        "may",
        "expect",
        "kind",
        "psychology",
        "identical",
        "kind",
        "neuroscience",
        "identity",
        "theory",
        "face",
        "problem",
        "multiple",
        "realizabilitythe",
        "idea",
        "possible",
        "physically",
        "diverse",
        "creature",
        "kind",
        "mental",
        "state",
        "possible",
        "example",
        "martian",
        "neurophysiology",
        "might",
        "entirely",
        "different",
        "human",
        "martian",
        "nonetheless",
        "kind",
        "mental",
        "state",
        "human",
        "martian",
        "body",
        "injured",
        "writhes",
        "groan",
        "avoids",
        "cause",
        "injuriesthe",
        "martian",
        "pain",
        "lewis",
        "indeed",
        "possible",
        "cognitive",
        "scientist",
        "might",
        "design",
        "machine",
        "capable",
        "higherlevel",
        "thought",
        "implemented",
        "example",
        "silicon",
        "architecture",
        "even",
        "possible",
        "mental",
        "kind",
        "realized",
        "distinct",
        "neurophysiological",
        "system",
        "one",
        "organism",
        "time",
        "consequently",
        "least",
        "open",
        "empirical",
        "possibility",
        "mental",
        "kind",
        "may",
        "correspond",
        "widely",
        "disjunctive",
        "heterogeneous",
        "set",
        "neurophysiological",
        "kind",
        "hence",
        "onetoone",
        "correlation",
        "eliminativism",
        "argues",
        "prima",
        "facie",
        "failure",
        "straightforwardly",
        "reduce",
        "mental",
        "kind",
        "neurophysiological",
        "kind",
        "ought",
        "lead",
        "elimination",
        "mental",
        "kind",
        "altogether",
        "churchland",
        "claim",
        "mental",
        "natural",
        "kind",
        "view",
        "mental",
        "kind",
        "folk",
        "psychology",
        "comparable",
        "kind",
        "delineated",
        "discredited",
        "folk",
        "theory",
        "past",
        "eg",
        "humour",
        "medieval",
        "medicine",
        "underlying",
        "principle",
        "medieval",
        "medicine",
        "balancing",
        "socalled",
        "four",
        "humour",
        "according",
        "theory",
        "illness",
        "caused",
        "imbalance",
        "four",
        "humour",
        "point",
        "view",
        "modern",
        "medicine",
        "theory",
        "radically",
        "false",
        "option",
        "eliminate",
        "humour",
        "putative",
        "natural",
        "kind",
        "analogously",
        "mental",
        "kind",
        "ought",
        "eliminated",
        "favour",
        "kind",
        "uncovered",
        "recent",
        "research",
        "neuroscience",
        "eliminativists",
        "agree",
        "human",
        "being",
        "invented",
        "successful",
        "methodology",
        "describing",
        "mental",
        "life",
        "methodology",
        "folk",
        "psychology",
        "common",
        "sense",
        "theory",
        "mental",
        "state",
        "causally",
        "related",
        "human",
        "action",
        "however",
        "folk",
        "psychology",
        "argue",
        "merely",
        "heuristic",
        "device",
        "invented",
        "human",
        "being",
        "order",
        "make",
        "explanation",
        "behaviour",
        "easier",
        "posit",
        "theory",
        "real",
        "natural",
        "kind",
        "better",
        "explanation",
        "human",
        "behaviour",
        "term",
        "neurophysiological",
        "kind",
        "available",
        "mental",
        "kind",
        "eliminated",
        "functionalist",
        "argue",
        "irreducibilty",
        "mental",
        "kind",
        "nevertheless",
        "compatible",
        "tokentoken",
        "identity",
        "theory",
        "fodor",
        "mental",
        "kind",
        "typeidentical",
        "neurophysiological",
        "kind",
        "ie",
        "one",
        "type",
        "neurophysiological",
        "correlate",
        "type",
        "mental",
        "state",
        "make",
        "general",
        "identity",
        "statement",
        "pain",
        "cfibres",
        "firing",
        "martian",
        "state",
        "fear",
        "time",
        "may",
        "different",
        "physiological",
        "state",
        "nevertheless",
        "token",
        "instance",
        "kind",
        "fear",
        "time",
        "identical",
        "token",
        "physical",
        "state",
        "brain",
        "time",
        "likewise",
        "token",
        "instance",
        "martian",
        "fear",
        "time",
        "t",
        "identical",
        "token",
        "physical",
        "state",
        "argued",
        "kim",
        "multiply",
        "realized",
        "mental",
        "kind",
        "latter",
        "kind",
        "principle",
        "locally",
        "reduced",
        "realizing",
        "state",
        "mental",
        "kind",
        "analogous",
        "mineral",
        "kind",
        "jade",
        "locally",
        "reduced",
        "nephrite",
        "jadeite",
        "depending",
        "sample",
        "importantly",
        "sample",
        "consist",
        "either",
        "nephrite",
        "jadeite",
        "simply",
        "jade",
        "nevertheless",
        "important",
        "disanalogy",
        "mental",
        "kind",
        "locally",
        "reduced",
        "kind",
        "like",
        "jade",
        "want",
        "sample",
        "jade",
        "must",
        "composed",
        "either",
        "jadeite",
        "nephrite",
        "word",
        "j",
        "jade",
        "realized",
        "disjunction",
        "p",
        "jadeite",
        "q",
        "nephrite",
        "metaphysically",
        "necessary",
        "property",
        "thing",
        "qua",
        "j",
        "either",
        "property",
        "qua",
        "p",
        "property",
        "qua",
        "q",
        "something",
        "qualitative",
        "property",
        "jade",
        "another",
        "possible",
        "world",
        "lacked",
        "essential",
        "property",
        "ie",
        "jadeite",
        "nephrite",
        "would",
        "simply",
        "instance",
        "jade",
        "contrast",
        "functionalist",
        "fodor",
        "mental",
        "kind",
        "defined",
        "functional",
        "role",
        "rather",
        "essential",
        "property",
        "neurophysiological",
        "kind",
        "realize",
        "matter",
        "physical",
        "kind",
        "realizing",
        "silicon",
        "chip",
        "neuron",
        "cfibres",
        "whatever",
        "rather",
        "matter",
        "psychological",
        "state",
        "eg",
        "pain",
        "play",
        "certain",
        "functional",
        "role",
        "whole",
        "point",
        "multiple",
        "realizability",
        "easy",
        "imagine",
        "possible",
        "world",
        "token",
        "mental",
        "kind",
        "realized",
        "silicon",
        "chip",
        "cfibres",
        "firing",
        "whatever",
        "mental",
        "kind",
        "essentially",
        "realized",
        "certain",
        "neurophysiological",
        "kind",
        "rather",
        "play",
        "functional",
        "role",
        "independently",
        "underlying",
        "kind",
        "realizing",
        "appears",
        "violate",
        "criterion",
        "natural",
        "kind",
        "section",
        "member",
        "natural",
        "kind",
        "natural",
        "property",
        "common",
        "functional",
        "role",
        "mental",
        "kind",
        "explained",
        "functionalist",
        "term",
        "modularity",
        "mind",
        "fodor",
        "claim",
        "mind",
        "different",
        "innate",
        "module",
        "play",
        "certain",
        "functional",
        "role",
        "module",
        "domainspecific",
        "operating",
        "certain",
        "kind",
        "input",
        "example",
        "distinct",
        "module",
        "mental",
        "task",
        "like",
        "mindreading",
        "speaker",
        "recognition",
        "facial",
        "recognition",
        "functional",
        "role",
        "associated",
        "mental",
        "kind",
        "might",
        "example",
        "given",
        "evolutionary",
        "account",
        "term",
        "adapted",
        "module",
        "cosmides",
        "tooby",
        "view",
        "mental",
        "kind",
        "folk",
        "psychology",
        "successful",
        "purpose",
        "explanation",
        "human",
        "behaviour",
        "refer",
        "functional",
        "module",
        "mind",
        "view",
        "may",
        "motivate",
        "emergentism",
        "one",
        "interpretation",
        "emergentist",
        "account",
        "mind",
        "emergent",
        "mental",
        "kind",
        "straightforward",
        "correlation",
        "kind",
        "identified",
        "neuroscience",
        "mental",
        "kind",
        "neurophysiological",
        "kind",
        "either",
        "identical",
        "subkinds",
        "one",
        "another",
        "consequently",
        "emergentism",
        "conflict",
        "contested",
        "taxonomic",
        "hierarchy",
        "criterion",
        "criterion",
        "see",
        "entry",
        "emergent",
        "property",
        "typeidentity",
        "theory",
        "true",
        "might",
        "seem",
        "motivate",
        "essentialism",
        "psychological",
        "kind",
        "analogy",
        "theoretical",
        "identity",
        "see",
        "section",
        "section",
        "kripke",
        "however",
        "denies",
        "argument",
        "concerning",
        "theoretical",
        "identity",
        "apply",
        "let",
        "u",
        "say",
        "slow",
        "pain",
        "u",
        "human",
        "correlated",
        "firing",
        "cfibres",
        "genuine",
        "theoretical",
        "identity",
        "possible",
        "world",
        "someone",
        "undergoes",
        "cfibre",
        "firing",
        "state",
        "pain",
        "seems",
        "plausible",
        "could",
        "world",
        "cfibre",
        "stimulation",
        "accompanied",
        "painful",
        "sensation",
        "world",
        "theoretical",
        "identity",
        "implies",
        "world",
        "one",
        "people",
        "pain",
        "without",
        "painful",
        "sensation",
        "indeed",
        "pain",
        "might",
        "yield",
        "pleasant",
        "sensation",
        "kripke",
        "regard",
        "counterintuitive",
        "concept",
        "pain",
        "necessarily",
        "tied",
        "phenomenal",
        "nature",
        "pain",
        "sensation",
        "whereas",
        "concept",
        "gold",
        "tied",
        "colour",
        "yellow",
        "consequently",
        "identity",
        "pain",
        "cfibre",
        "firing",
        "physical",
        "state",
        "likewise",
        "physical",
        "essence",
        "pain",
        "posteriori",
        "natural",
        "kind",
        "essentialism",
        "fails",
        "case",
        "recently",
        "discussion",
        "whether",
        "mental",
        "concept",
        "natural",
        "kind",
        "claim",
        "concept",
        "form",
        "natural",
        "kind",
        "accepted",
        "philosopher",
        "psychology",
        "cognitive",
        "psychologist",
        "alike",
        "margolis",
        "fodor",
        "recent",
        "literature",
        "argued",
        "assumption",
        "griffith",
        "machery",
        "piccinini",
        "scott",
        "griffith",
        "argued",
        "individual",
        "familiar",
        "concept",
        "emotion",
        "correspond",
        "genuine",
        "natural",
        "kind",
        "therefore",
        "eliminated",
        "scientific",
        "vocabulary",
        "machery",
        "ch",
        "heterogeneity",
        "hypothesis",
        "claim",
        "furthermore",
        "class",
        "concept",
        "delineate",
        "homogeneous",
        "class",
        "kind",
        "concept",
        "rather",
        "divide",
        "several",
        "distinct",
        "kind",
        "actually",
        "little",
        "common",
        "thus",
        "mistake",
        "assume",
        "many",
        "general",
        "property",
        "concept",
        "theory",
        "concept",
        "attempt",
        "describe",
        "general",
        "notion",
        "concept",
        "part",
        "adequate",
        "taxonomy",
        "mental",
        "representation"
    ]
}