{
    "main_text": "Objections to Naturalism || The Normativity and Triviality Objections\n4.2 The Normativity and Triviality Objections\n\nAlthough Moore’s version of the Open Question Argument today has\nfew defenders, there have been a number of recent attempts to\nrefashion it into a more compelling form. One popular version of the\nOpen Question Argument, called the Normativity Objection (see, e.g.,\nParfit 2011; Scanlon 2014), sidesteps questions about the cognitive\nsignificance of moral and descriptive terminology and appeals to\nconsiderations regarding the natures of natural and normative facts.\nMoral facts are normative. They concern what is good and what we have\nreasons or obligations to do. Natural facts – the kinds of facts\nthat scientists study – are facts about the innate physical\nstructure of the universe and the causal principles that govern the\ninteraction of matter. Those are obviously just two different kinds of\nfacts; moral facts are normative but natural facts are not. In trying\nto give a naturalistic account of morality, naturalists forgot the\nmost important thing: that moral facts aren’t purely facts about\nthe way the world is; they are facts about what\nmatters.\n\nThere are, generally, two ways in which a naturalist might respond to\nthis objection. First, a naturalist could say that moral facts\naren’t essentially normative; it may be the case that we\ntypically have reasons to act morally, but reason-giving force is not\npart of the essence of moral facts. That suggestion might have the\nfeeling of an absurdity – of course moral facts are the kinds of\nthings that provide reasons; if an action is morally required,\nthat’s a good reason to do it! But according to some\n“reforming definitions” of morality (Brandt 1979; Railton\n1986), this thought is a defect in our conception of morality. It\nwould be more accurate and fruitful to define moral facts in terms\nthat are typically reason-providing but not\nnecessarily reason-providing.\n\nThe biggest problem for reforming definitions is that reason-giving\nnormativity is (arguably) essential to morality. As Joyce\n(2000, Ch. 1) argues, normativity is a non-negotiable commitment of\nour moral discourse. If the only kinds of facts that exist are\nnatural, and natural facts are not a source of reasons for everyone,\nthen this amounts to a proof that moral facts don’t exist (see\nalso Luco 2016). Reformers may respond by calling into question\nJoyce’s notion of “non-negotiable” commitments. It\nis controversial whether any of our concepts have commitments that are\nnon-negotiable in this way (compare Prinzing 2017). Reformers may also\nreply by pointing out that they’re not entirely giving up on\nnormativity. If moral facts are the kinds of facts that we typically\nhave reason to care about, and there are strong forces in human\nsociety and psychology that lead us to care about moral facts, then\nthey’re normative enough for all practical purposes.\n\nThe second way to respond to the Normativity Objection is to say that\nnormativity is itself a natural phenomenon. The most popular strategy\nfor substantiating natural normativity proceeds in two steps. First,\nshow that all normative concepts can be analyzed in terms of one,\nfundamental normative concept. Second, show that that fundamental\nnormative concept picks out a natural property. There are a number of\nways that such an account could proceed: here are two recent,\ninfluential examples:\n\nMark Schroeder (2005; 2007) accepts the “buck-passing”\nor “reasons first” account of normativity (Scanlon 1998),\nwhich says that all normative concepts can be analyzed in terms of the\nconcept of a reason. Schroeder also accepts the “Humean”\ntheory of reasons (as a substantive, synthetic truth), which says\nthat, roughly, S has a reason to Φ just in case Φ-ing will\npromote the satisfaction of one of S’s desires. If the Humean\ntheory is correct, then being a reason is a natural property. And, if\nall other moral facts are to be analyzed in terms of reasons, then all\nmoral facts are natural facts.\nPhillipa Foot (2001) accepts a “value first” account\nof normativity, which says that goodness is the fundamental normative\nconcept. She also accepts a neo-Aristotelian account of goodness (see\nSection 5 below for more on neo-Aristotelianism.) If\nneo-Aristotelianism is correct, goodness is a natural property. And if\nall moral facts are to be analyzed in terms of goodness, then all\nmoral facts are natural facts.\n\n\nThis two-step strategy is popular but controversial. Those moved by\nthe Open Question Argument and the Normativity Objection are skeptical\nthat the second step of the naturalizing strategy could ever be\ncompleted. Non-naturalists doubt that it could ever be shown that the\nfundamental normative concept picks out some natural property because\nnormative properties and natural properties just seem to obviously be\ndifferent kinds of properties. Wittgenstein claimed to “see\nclearly, as it were in a flash of light, not only that no description\nthat I can think of would do to describe what I mean by absolute\nvalue, but that I would reject every significant description that\nanybody could possibly suggest, ab initio, on the ground of its\nsignificance” (Wittgenstein 1965). David Enoch (2011) is more\npithy, saying simply that natural properties and normative properties\nare just too different for any natural account of a\nfundamental normative property to be satisfying.\n\nBut it’s unclear what this “just too different”\nintuition amounts to (Laskowski 2019). In what sense are the natural\nand the normative “just too different?” Schroeder thinks\nthat the intuition has force only if there is “a perfectly\ngeneral single truth about which any reductive view would be forced\ninto error” (Schroeder 2005, 14). The existence of such a truth\nwould be the proof that the natural and normative are just too\ndifferent; without such a truth, the non-naturalist hasn’t\nreally offered an argument against naturalism. But because all\nnormative claims conceptually reduce to claims about reasons, argues\nSchroeder, there will be no such truth, provided that we have a\ncoherent account of the foundational notion of a reason. So a coherent\naccount of normative reasons can explain all normative claims. These\nfundamental normative facts about reasons are themselves explained by\nthe natural facts to which reasons reduce. But because this reduction\nof reasons will take the form of a synthetic reduction, there end up\nbeing no conceptual connections between the normative and the natural.\nThis general lack of conceptual connections between the normative and\nthe natural is what explains the “just too different”\nintuition, and it is fully compatible with moral naturalism as a\nsynthetic metaphysical truth (see also Copp 2020).\n\nSchroeder’s response may succeed in providing a\nnaturalist-friendly explanation of the “just too\ndifferent” intuition, but it seems strange to say that the\nexistence of numerous analytic relations between different normative\nconcepts, combined with a lack of analytic relations between normative\nand natural concepts, supports the thesis that the normative is\nnatural. The lack of conceptual connections between the natural and\nnormative may be better explained by non-naturalism (Enoch 2011).\n\nDerek Parfit’s Triviality Objection (Parfit 2011) is another\ncontemporary extension of the Open Question Argument. If moral\nnaturalism is true, says Parfit, then it will be possible to make\nmoral claims and natural claims and have those two claims be about the\nsame fact. Parfit worries that if the two claims are about the same\nfact, then those two claims must contain all the same information. And\na statement of equivalence between any two claims that contain the\nsame information must be trivial. But moral claims that describe the\nrelationships between moral facts and natural facts are not trivial at\nall – they are highly substantive.\n\nDerek Parfit’s Triviality Objection (Parfit 2011) is another\ncontemporary extension of the Open Question Argument. If moral\nnaturalism is true, says Parfit, then it will be possible to make\nmoral claims and natural claims and have those two claims contain all\nthe same information. And a statement of equivalence between any two\nclaims that contain the same information must be trivial. But moral\nclaims that describe the relationships between moral facts and natural\nfacts are not trivial at all – they are highly substantive. So\nmoral naturalism is false. However, it is not clear that this\nTriviality Objection is any more forceful than the Open Question\nArgument. Parfit’s central motivating thoughts are that\nnatural-moral identity claims are substantive rather than trivial, and\ntherefore moral claims concern a different kind of fact than natural\nclaims. These are exactly the central thoughts behind Moore’s\nOpen Question Argument, and so naturalists to respond to this\nobjection in largely the same way that they respond to the Open\nQuestion Argument. Naturalists typically respond by adopting a version\nof synthetic naturalism, and arguing that moral-natural identities are\ninformative in the same way that other synthetic property identity\nclaims (like water = H2O) are (Copp 2017).\n\nHaving discussed moral naturalism in general terms, we’ll now\nexamine three of the most popular naturalistic metaethical views in\ndetail. As we go, it will be worth keeping the normativity objection\nin mind. A version of the normativity objection will end up being one\nof the most pressing objections to all of these views.\n",
    "section_title": "4.2 The Normativity and Triviality Objections",
    "entry_title": "Moral Naturalism",
    "hierarchy_title": "Moral Naturalism || Objections to Naturalism || The Normativity and Triviality Objections",
    "tokenized_text": [
        "objection",
        "naturalism",
        "normativity",
        "triviality",
        "objection",
        "normativity",
        "triviality",
        "objection",
        "although",
        "moore",
        "version",
        "open",
        "question",
        "argument",
        "today",
        "defender",
        "number",
        "recent",
        "attempt",
        "refashion",
        "compelling",
        "form",
        "one",
        "popular",
        "version",
        "open",
        "question",
        "argument",
        "called",
        "normativity",
        "objection",
        "see",
        "eg",
        "parfit",
        "scanlon",
        "sidestep",
        "question",
        "cognitive",
        "significance",
        "moral",
        "descriptive",
        "terminology",
        "appeal",
        "consideration",
        "regarding",
        "nature",
        "natural",
        "normative",
        "fact",
        "moral",
        "fact",
        "normative",
        "concern",
        "good",
        "reason",
        "obligation",
        "natural",
        "fact",
        "kind",
        "fact",
        "scientist",
        "study",
        "fact",
        "innate",
        "physical",
        "structure",
        "universe",
        "causal",
        "principle",
        "govern",
        "interaction",
        "matter",
        "obviously",
        "two",
        "different",
        "kind",
        "fact",
        "moral",
        "fact",
        "normative",
        "natural",
        "fact",
        "trying",
        "give",
        "naturalistic",
        "account",
        "morality",
        "naturalist",
        "forgot",
        "important",
        "thing",
        "moral",
        "fact",
        "purely",
        "fact",
        "way",
        "world",
        "fact",
        "matter",
        "generally",
        "two",
        "way",
        "naturalist",
        "might",
        "respond",
        "objection",
        "first",
        "naturalist",
        "could",
        "say",
        "moral",
        "fact",
        "essentially",
        "normative",
        "may",
        "case",
        "typically",
        "reason",
        "act",
        "morally",
        "reasongiving",
        "force",
        "part",
        "essence",
        "moral",
        "fact",
        "suggestion",
        "might",
        "feeling",
        "absurdity",
        "course",
        "moral",
        "fact",
        "kind",
        "thing",
        "provide",
        "reason",
        "action",
        "morally",
        "required",
        "good",
        "reason",
        "according",
        "reforming",
        "definition",
        "morality",
        "brandt",
        "railton",
        "thought",
        "defect",
        "conception",
        "morality",
        "would",
        "accurate",
        "fruitful",
        "define",
        "moral",
        "fact",
        "term",
        "typically",
        "reasonproviding",
        "necessarily",
        "reasonproviding",
        "biggest",
        "problem",
        "reforming",
        "definition",
        "reasongiving",
        "normativity",
        "arguably",
        "essential",
        "morality",
        "joyce",
        "ch",
        "argues",
        "normativity",
        "nonnegotiable",
        "commitment",
        "moral",
        "discourse",
        "kind",
        "fact",
        "exist",
        "natural",
        "natural",
        "fact",
        "source",
        "reason",
        "everyone",
        "amount",
        "proof",
        "moral",
        "fact",
        "exist",
        "see",
        "also",
        "luco",
        "reformer",
        "may",
        "respond",
        "calling",
        "question",
        "joyce",
        "notion",
        "nonnegotiable",
        "commitment",
        "controversial",
        "whether",
        "concept",
        "commitment",
        "nonnegotiable",
        "way",
        "compare",
        "prinzing",
        "reformer",
        "may",
        "also",
        "reply",
        "pointing",
        "entirely",
        "giving",
        "normativity",
        "moral",
        "fact",
        "kind",
        "fact",
        "typically",
        "reason",
        "care",
        "strong",
        "force",
        "human",
        "society",
        "psychology",
        "lead",
        "u",
        "care",
        "moral",
        "fact",
        "normative",
        "enough",
        "practical",
        "purpose",
        "second",
        "way",
        "respond",
        "normativity",
        "objection",
        "say",
        "normativity",
        "natural",
        "phenomenon",
        "popular",
        "strategy",
        "substantiating",
        "natural",
        "normativity",
        "proceeds",
        "two",
        "step",
        "first",
        "show",
        "normative",
        "concept",
        "analyzed",
        "term",
        "one",
        "fundamental",
        "normative",
        "concept",
        "second",
        "show",
        "fundamental",
        "normative",
        "concept",
        "pick",
        "natural",
        "property",
        "number",
        "way",
        "account",
        "could",
        "proceed",
        "two",
        "recent",
        "influential",
        "example",
        "mark",
        "schroeder",
        "accepts",
        "buckpassing",
        "reason",
        "first",
        "account",
        "normativity",
        "scanlon",
        "say",
        "normative",
        "concept",
        "analyzed",
        "term",
        "concept",
        "reason",
        "schroeder",
        "also",
        "accepts",
        "humean",
        "theory",
        "reason",
        "substantive",
        "synthetic",
        "truth",
        "say",
        "roughly",
        "reason",
        "φ",
        "case",
        "φing",
        "promote",
        "satisfaction",
        "one",
        "desire",
        "humean",
        "theory",
        "correct",
        "reason",
        "natural",
        "property",
        "moral",
        "fact",
        "analyzed",
        "term",
        "reason",
        "moral",
        "fact",
        "natural",
        "fact",
        "phillipa",
        "foot",
        "accepts",
        "value",
        "first",
        "account",
        "normativity",
        "say",
        "goodness",
        "fundamental",
        "normative",
        "concept",
        "also",
        "accepts",
        "neoaristotelian",
        "account",
        "goodness",
        "see",
        "section",
        "neoaristotelianism",
        "neoaristotelianism",
        "correct",
        "goodness",
        "natural",
        "property",
        "moral",
        "fact",
        "analyzed",
        "term",
        "goodness",
        "moral",
        "fact",
        "natural",
        "fact",
        "twostep",
        "strategy",
        "popular",
        "controversial",
        "moved",
        "open",
        "question",
        "argument",
        "normativity",
        "objection",
        "skeptical",
        "second",
        "step",
        "naturalizing",
        "strategy",
        "could",
        "ever",
        "completed",
        "nonnaturalists",
        "doubt",
        "could",
        "ever",
        "shown",
        "fundamental",
        "normative",
        "concept",
        "pick",
        "natural",
        "property",
        "normative",
        "property",
        "natural",
        "property",
        "seem",
        "obviously",
        "different",
        "kind",
        "property",
        "wittgenstein",
        "claimed",
        "see",
        "clearly",
        "flash",
        "light",
        "description",
        "think",
        "would",
        "describe",
        "mean",
        "absolute",
        "value",
        "would",
        "reject",
        "every",
        "significant",
        "description",
        "anybody",
        "could",
        "possibly",
        "suggest",
        "ab",
        "initio",
        "ground",
        "significance",
        "wittgenstein",
        "david",
        "enoch",
        "pithy",
        "saying",
        "simply",
        "natural",
        "property",
        "normative",
        "property",
        "different",
        "natural",
        "account",
        "fundamental",
        "normative",
        "property",
        "satisfying",
        "unclear",
        "different",
        "intuition",
        "amount",
        "laskowski",
        "sense",
        "natural",
        "normative",
        "different",
        "schroeder",
        "think",
        "intuition",
        "force",
        "perfectly",
        "general",
        "single",
        "truth",
        "reductive",
        "view",
        "would",
        "forced",
        "error",
        "schroeder",
        "existence",
        "truth",
        "would",
        "proof",
        "natural",
        "normative",
        "different",
        "without",
        "truth",
        "nonnaturalist",
        "really",
        "offered",
        "argument",
        "naturalism",
        "normative",
        "claim",
        "conceptually",
        "reduce",
        "claim",
        "reason",
        "argues",
        "schroeder",
        "truth",
        "provided",
        "coherent",
        "account",
        "foundational",
        "notion",
        "reason",
        "coherent",
        "account",
        "normative",
        "reason",
        "explain",
        "normative",
        "claim",
        "fundamental",
        "normative",
        "fact",
        "reason",
        "explained",
        "natural",
        "fact",
        "reason",
        "reduce",
        "reduction",
        "reason",
        "take",
        "form",
        "synthetic",
        "reduction",
        "end",
        "conceptual",
        "connection",
        "normative",
        "natural",
        "general",
        "lack",
        "conceptual",
        "connection",
        "normative",
        "natural",
        "explains",
        "different",
        "intuition",
        "fully",
        "compatible",
        "moral",
        "naturalism",
        "synthetic",
        "metaphysical",
        "truth",
        "see",
        "also",
        "copp",
        "schroeder",
        "response",
        "may",
        "succeed",
        "providing",
        "naturalistfriendly",
        "explanation",
        "different",
        "intuition",
        "seems",
        "strange",
        "say",
        "existence",
        "numerous",
        "analytic",
        "relation",
        "different",
        "normative",
        "concept",
        "combined",
        "lack",
        "analytic",
        "relation",
        "normative",
        "natural",
        "concept",
        "support",
        "thesis",
        "normative",
        "natural",
        "lack",
        "conceptual",
        "connection",
        "natural",
        "normative",
        "may",
        "better",
        "explained",
        "nonnaturalism",
        "enoch",
        "derek",
        "parfit",
        "triviality",
        "objection",
        "parfit",
        "another",
        "contemporary",
        "extension",
        "open",
        "question",
        "argument",
        "moral",
        "naturalism",
        "true",
        "say",
        "parfit",
        "possible",
        "make",
        "moral",
        "claim",
        "natural",
        "claim",
        "two",
        "claim",
        "fact",
        "parfit",
        "worry",
        "two",
        "claim",
        "fact",
        "two",
        "claim",
        "must",
        "contain",
        "information",
        "statement",
        "equivalence",
        "two",
        "claim",
        "contain",
        "information",
        "must",
        "trivial",
        "moral",
        "claim",
        "describe",
        "relationship",
        "moral",
        "fact",
        "natural",
        "fact",
        "trivial",
        "highly",
        "substantive",
        "derek",
        "parfit",
        "triviality",
        "objection",
        "parfit",
        "another",
        "contemporary",
        "extension",
        "open",
        "question",
        "argument",
        "moral",
        "naturalism",
        "true",
        "say",
        "parfit",
        "possible",
        "make",
        "moral",
        "claim",
        "natural",
        "claim",
        "two",
        "claim",
        "contain",
        "information",
        "statement",
        "equivalence",
        "two",
        "claim",
        "contain",
        "information",
        "must",
        "trivial",
        "moral",
        "claim",
        "describe",
        "relationship",
        "moral",
        "fact",
        "natural",
        "fact",
        "trivial",
        "highly",
        "substantive",
        "moral",
        "naturalism",
        "false",
        "however",
        "clear",
        "triviality",
        "objection",
        "forceful",
        "open",
        "question",
        "argument",
        "parfit",
        "central",
        "motivating",
        "thought",
        "naturalmoral",
        "identity",
        "claim",
        "substantive",
        "rather",
        "trivial",
        "therefore",
        "moral",
        "claim",
        "concern",
        "different",
        "kind",
        "fact",
        "natural",
        "claim",
        "exactly",
        "central",
        "thought",
        "behind",
        "moore",
        "open",
        "question",
        "argument",
        "naturalist",
        "respond",
        "objection",
        "largely",
        "way",
        "respond",
        "open",
        "question",
        "argument",
        "naturalist",
        "typically",
        "respond",
        "adopting",
        "version",
        "synthetic",
        "naturalism",
        "arguing",
        "moralnatural",
        "identity",
        "informative",
        "way",
        "synthetic",
        "property",
        "identity",
        "claim",
        "like",
        "water",
        "ho",
        "copp",
        "discussed",
        "moral",
        "naturalism",
        "general",
        "term",
        "examine",
        "three",
        "popular",
        "naturalistic",
        "metaethical",
        "view",
        "detail",
        "go",
        "worth",
        "keeping",
        "normativity",
        "objection",
        "mind",
        "version",
        "normativity",
        "objection",
        "end",
        "one",
        "pressing",
        "objection",
        "view"
    ]
}