{
    "main_text": "Common Features of Neo-Kantians\n1. Common Features of Neo-Kantians\n\nThe Neo-Kantians did not always think of themselves as members of a\ncommon movement. Though the members of the Marburg school very clearly\nidentified with one another, and the members of the Southwest school\nidentified themselves with one another, the two schools\n initially[4]\n made little effort to present themselves as part of a common\nmovement. Their doctrines were different in some fundamental ways, and\nthey often criticized one another’s positions. Nevertheless,\nthere were some common features of Neo-Kantians of both\nschools—common features that made it natural for their\ncontemporaries and for historians today to talk about them together.\nThis section presents seven common features of the Neo-Kantians.\nThese seven common features make it possible to distinguish, in a\nprincipled philosophical way, between the (“classical”) Neo-Kantians\nof the Marburg and Southwest schools and the various “back to\nKant” philosophers of the mid nineteenth century and the\nassorted philosophers contemporary with the Neo-Kantians who were\n“neo-Kantian” in some broader sense. For example,\nHelmholtz and Lange did not share the Neo-Kantians’\nanti-psychologism or commitment to the transcendental method (features\n2 and 3 below), while Alois Riehl did not share their idealistic\ntheory of objective validity (feature 6).\n\n1. Most obviously, the Neo-Kantians thought of\nthemselves as reviving, defending, and extending Kant’s\nphilosophy. They self-consciously adopted Kant’s vocabulary, and\nsome of his key ideas and arguments. They wrote commentaries on\nKant’s major writings, and would often present their own\npositive views in the form of commentaries or interpretations of Kant.\nNevertheless, they never considered themselves to be orthodox\nKantians, nor did they see the value in defending Kant’s views\non all topics. As Windelband famously said in the preface to the 1883\nfirst edition of Windelband\n 1915,[5]\n “to understand Kant means to go beyond him”. And, as\nNatorp explained, \n\n\nit was never anyone’s wish nor intent to cling to Kant’s\ndoctrines in an absolute way. Talk of an orthodox Kantianism within\nthe Marburg School was never justified. (Natorp 1912a: 180) \n\n\nIn fact, there were some core Kantian ideas that the Neo-Kantians\nself-consciously rejected. They rejected the doctrine of the\nthing-in-itself as incoherent and unnecessary (Windelband 1910: 323),\nor radically reinterpreted talk of things-in-themselves as talk of a\npostulated final and complete theory of the world (Cohen 1885:\n503ff.). Their rejection of Kant’s dualism of appearances and\nthings-in-themselves was closely related to their rethinking of\nKant’s distinction between two “stems” of cognition:\nsensibility and understanding. The Marburg philosophers came to\nfundamentally reject this distinction, while the Southwest\nNeo-Kantians (while maintaining the irreducibility of intuitions to\nconcepts) still rejected the idea that intuitions are the result of a\nmind-independent thing-in-itself affecting sensibility. Though the\nNeo-Kantians took as fundamental to their philosophies the existence\nof substantive a priori concepts and principles that make knowledge\npossible, they did not accept that the categories and principles\nidentified in the Critique of Pure Reason were complete or\nfixed for all time. In particular, Marburg Neo-Kantians believed that\nsome of the categories and principles that Kant identified were\nrelative to the scientific theories of Kant’s day, and that the\ncategories and principles could change as scientists develop new\nempirical theories. Southwest Neo-Kantians, on the other hand, were\nkeen to argue that history is just as much a science as mathematical\nphysics, and they thought that Kant’s critical project had to be\nextended in order to identify the a priori elements in history. Last,\nthe classical Neo-Kantians held that transcendental philosophy is\ndistinct and independent of empirical psychology, even though (they\nargued) Kant himself was not always innocent of psychologism, despite\nthe fact that Kant’s philosophy when rightly interpreted is the\nbasis for a sound anti-psychologism (Cohen 1883: §8).\n\n2. The Neo-Kantians put forward a suite of arguments\nto show that philosophy is independent of psychology. Logic, or the\ntheory of knowledge, concerns what is objective, not what is\nsubjective, as psychology does (Cohen 1883: §6). It does not\nconcern itself with the mental processes of subjects, with their\ncognitive apparatus, or with empirical results about human sense\norgans or nervous system. As Windelband 1883 put it, psychologistic\nphilosophers employ the “genetic method” trying to find\nthe justification of some part of our knowledge by tracing empirically\nits causal antecedents. The correct method, however, is the\n“critical method”, which distinguishes what he calls\n“factual” from “teleological” or normative\nvalidity. The critical method is the only correct method, because the\nfact that we do believe something, or even that all humans by some\nbiological necessity have to believe it, does not yet solve the\ncritical question: what we ought to\n believe.[6]\n For these reasons, the Neo-Kantians sharply distinguished a priority\nfrom innateness—a distinction they claimed was obscured by\nphilosophers such as Helmholtz and Lange.\n\nA return to an anti-psychologistic Kant was the Neo-Kantians’\nsolution to what the historian Herbert Schnädelbach (1984: 5)\ncalled the “identity crisis” that faced philosophy in the\nmiddle of the nineteenth century. Given the collapse of the conception\nof philosophy shared by post-Kantian speculative idealists, and the\nconcurrent spectacular advances made in the sciences, philosophers\nwere left questioning what (if anything) was left as the distinctive\nsubject matter and method of philosophy (Beiser 2014a: Ch.1). In\nparticular, in opposing psychologism, the Neo-Kantians were staking\nout a conception of philosophy that avoids the naturalism defended by\nmany German philosophers in the decades after Hegel’s death\n(Cassirer 1912). According to naturalistic conceptions of philosophy,\nthe method of philosophy is in fact not distinguishable from that of\nnatural science, and the theory of knowledge just becomes applied\nempirical psychology. Nevertheless, the Neo-Kantians shared with these\nnaturalistic philosophers a deep distrust of speculative metaphysics:\nthey denied that philosophy could deliver knowledge of the\nsupersensible, could deduce facts of the special sciences from a\npriori principles knowable in some special philosophical way, or that\nphilosophy could even be done in ignorance of the results of the\nsciences.\n\n3. This via media, this third way of doing\nphilosophy, they found in the transcendental method. The two\nschools conceived of the transcendental method differently. For Cohen\nand his school, philosophy begins with a fact—paradigmatically,\nthe fact of science—and investigates the conditions that make\nthat fact possible. For Windelband and his school, the transcendental\nquestion is understood teleologically: given certain fundamental\ngoals, such as knowing the truth, or doing good, or experiencing what\nis beautiful, what is necessary for achieving these values? Still,\nthough, there was a common core to both schools’ conceptions of\nthe transcendental method: they wanted to identify those objective\nelements within some part of human culture (say, physics, history, or\nethics) that made possible objective validity (say, the objective\nvalidity of physical theories, historical narratives, or ethical\nclaims). Adherence to the transcendental method led the Neo-Kantians\nto reject skepticism. Philosophical reflection begins with the fact\nthat scientists have developed successful theories of the physical\nworld; or with the universal validity of the value of truth. So no\nroom is left for the skeptical worry that scientific theories do not\nin fact deliver empirical knowledge, or that truth is in fact\nunattainable (Windelband 1883: 280).\n\n4. The object of the transcendental method, for the\nNeo-Kantians, is culture. Often, they approached human\nculture using Kant’s three-fold distinction between knowledge,\nethics, aesthetics. Because they saw the achievements of science as\none of the most significant aspects of modern culture, a good portion\nof their writings concern the philosophy of science. As Kant\napplied the transcendental method to Newtonian science, they sought to\napply the method to the best science of their day. Typically (not\nexclusively), the Marburg philosophers were concerned with the physics\nand mathematics of the late nineteenth and early twentieth century,\nwhich (they emphasized) differed fundamentally from that of\nKant’s own day. The Southwest Neo-Kantians, on the other hand,\nwere more concerned with the so-called\n“Geisteswissenschaften” (the “human\nsciences”), which had come into their own in the nineteenth\ncentury and now deserved (they argued) to be recognized as autonomous\nand fully scientific (despite the fact that Kant himself had sharply\ndistinguished history from science (Kant 1786: Ak 4:468)).\n\n5. Neo-Kantian philosophy of science is distinctive\nin its focus on the methodology of science. Thus, Neo-Kantian\nphilosophy of physics is not so much concerned directly with what\nmatter is, but with how mathematical physics comes to know about\nmatter. Neo-Kantian philosophy of history is not concerned with grand\ntheories concerning what drives history, but with what makes the\nmethodology of a historian different from that of a physicist or\nempirical psychologist. Philosophy of science, for them, is the\nlogic of the sciences—in the extended sense of\n“logic” that includes theory of knowledge and scientific\nmethodology. And, true to their anti-psychologistic conception of\nlogic, Neo-Kantian accounts of scientific methodology are not intended\nto be empirical descriptions of what scientists do, but accounts that\nidentify objective norms, or the fundamental principles and concepts\nof a particular\n science.[7]\n Philosophy of science thus becomes a second order discipline,\ndifferent in kind from the natural sciences (thus avoiding\nnaturalism). But because Neo-Kantian philosophy of science adheres to\nthe transcendental method, it avoids the errors of speculative\nmetaphysics. It does not, for instance, try to derive the concept of\nmatter or life a priori, but is content to demonstrate that these\nconcepts are necessary conditions for physics and biology. Since\nphilosophy of science for the Neo-Kantians is a second order\ndiscipline, they were in general committed to a non-revisionist\nattitude. According to Rickert, philosophy \n\n\ndoes not claim to direct science onto the paths it should take. On the\ncontrary, it proposes only to follow science with a view to\nunderstanding it. (1902: 340) \n\n\nFor Cassirer, “critical philosophy … does not seek to\ndirect the sciences but to understand them” (1907b: 31).\n\n6. Since the goal of transcendental philosophy, for\nthe Neo-Kantians, is to identify those elements within some part of\nhuman culture that are necessary for its objective validity,\nthey were also led to investigate the nature of objective validity\nitself (Natorp 1887, Rickert\n 1915).[8]\n The two schools construed the question of objective validity\ndifferently. The Marburg philosophers emphasized objectivity, and gave\nan account of objectivity in terms of constant laws (see\n section 2.2).\n The Southwest Neo-Kantians emphasized the question of\nvalidity—specifically the validity of values\n (section 3.2).\n For both schools, a central issue in the investigation of objective\nvalidity is the question of transcendence: what does it mean\nthat the object is independent of our knowledge and provides the\nstandard for its truth?\n\nThere are four key ideas that are common to the Southwest and Marburg\ntheories of objective validity. First, both schools emphasized the\ncentrality of judgments (as opposed to concepts or intuitions), as the\nkind of representation that first makes objective validity possible\n(Rickert 1915: Ch.3; Cohen 1902: §10–11). Second, the\nNeo-Kantians were emphatic that the objective validity of knowledge\ndoes not consist in its being a copy (Abbild) or mirror of\nthe object (Windelband 1910; Rickert 1934; Cassirer 1910: Ch.1;\nRickert 1915: Ch.2). This “copy theory” of knowledge is\ninconsistent with a third key idea, that the objective validity of\nevery area of culture is made possible by substantive a priori\nprinciples. The a priori principles that make possible some part of\nhuman culture are again not interpreted psychologistically: they are\nnot features of the minds of individual subjects, they are not\ndiscovered empirically, and their necessity is not grounded in the\nempirical fact that they are universally accepted. These a priori\nprinciples are parts of culture—they are its fundamental norms\nor laws. Fourth, the Neo-Kantians described themselves as\n“idealists”. Idealism meant different things to different\nNeo-Kantians (see\n section 2.2\n and\n 3.2).\n But all Neo-Kantians shared the view that knowledge requires a priori\nelements that are not present in what is given in immediate intuition.\nKnowledge, then, requires a “reshaping” or\n“transformation” of what is given. The copy theory that\nthey reject would in this sense be a kind of “realism”. Of\ncourse, Neo-Kantian idealism must be rigorously distinguished from\nother kinds of idealisms. As noted earlier, they reject Kant’s\ndoctrine of the thing-in-itself, and they emphatically do not believe\nthat objects are in any way subjective or dependent on the\nrepresentations of individual psychological subjects.\n\n7. There is one final common feature of Neo-Kantian\nphilosophers that should not be overlooked: the Neo-Kantians were\ngreat historians of philosophy. It’s not surprising that the\nNeo-Kantians wrote extensively on Kant, producing commentaries (e.g.,\nCohen 1885; Cassirer 1918) and critical editions of his writing. But\nthe Neo-Kantians also wrote extensively on other philosophers, ancient\nand modern, and on the history of science and mathematics (e.g.,\nWindelband 1891; Cassirer 1906, 1907a). These historical works were\nnot thought of as side projects, but as essential aspects of their\nphilosophy. Neo-Kantians did not sharply distinguish history of\nphilosophy from philosophy (see Introduction to Windelband 1891;\n§I of the 1902 version of Cohen 1898).\n",
    "section_title": "1. Common Features of Neo-Kantians",
    "entry_title": "Neo-Kantianism",
    "hierarchy_title": "Neo-Kantianism || Common Features of Neo-Kantians",
    "tokenized_text": [
        "common",
        "feature",
        "neokantians",
        "common",
        "feature",
        "neokantians",
        "neokantians",
        "always",
        "think",
        "member",
        "common",
        "movement",
        "though",
        "member",
        "marburg",
        "school",
        "clearly",
        "identified",
        "one",
        "another",
        "member",
        "southwest",
        "school",
        "identified",
        "one",
        "another",
        "two",
        "school",
        "initially",
        "made",
        "little",
        "effort",
        "present",
        "part",
        "common",
        "movement",
        "doctrine",
        "different",
        "fundamental",
        "way",
        "often",
        "criticized",
        "one",
        "another",
        "position",
        "nevertheless",
        "common",
        "feature",
        "neokantians",
        "schoolscommon",
        "feature",
        "made",
        "natural",
        "contemporary",
        "historian",
        "today",
        "talk",
        "together",
        "section",
        "present",
        "seven",
        "common",
        "feature",
        "neokantians",
        "seven",
        "common",
        "feature",
        "make",
        "possible",
        "distinguish",
        "principled",
        "philosophical",
        "way",
        "classical",
        "neokantians",
        "marburg",
        "southwest",
        "school",
        "various",
        "back",
        "kant",
        "philosopher",
        "mid",
        "nineteenth",
        "century",
        "assorted",
        "philosopher",
        "contemporary",
        "neokantians",
        "neokantian",
        "broader",
        "sense",
        "example",
        "helmholtz",
        "lange",
        "share",
        "neokantians",
        "antipsychologism",
        "commitment",
        "transcendental",
        "method",
        "feature",
        "alois",
        "riehl",
        "share",
        "idealistic",
        "theory",
        "objective",
        "validity",
        "feature",
        "obviously",
        "neokantians",
        "thought",
        "reviving",
        "defending",
        "extending",
        "kant",
        "philosophy",
        "selfconsciously",
        "adopted",
        "kant",
        "vocabulary",
        "key",
        "idea",
        "argument",
        "wrote",
        "commentary",
        "kant",
        "major",
        "writing",
        "would",
        "often",
        "present",
        "positive",
        "view",
        "form",
        "commentary",
        "interpretation",
        "kant",
        "nevertheless",
        "never",
        "considered",
        "orthodox",
        "kantians",
        "see",
        "value",
        "defending",
        "kant",
        "view",
        "topic",
        "windelband",
        "famously",
        "said",
        "preface",
        "first",
        "edition",
        "windelband",
        "understand",
        "kant",
        "mean",
        "go",
        "beyond",
        "natorp",
        "explained",
        "never",
        "anyone",
        "wish",
        "intent",
        "cling",
        "kant",
        "doctrine",
        "absolute",
        "way",
        "talk",
        "orthodox",
        "kantianism",
        "within",
        "marburg",
        "school",
        "never",
        "justified",
        "natorp",
        "a",
        "fact",
        "core",
        "kantian",
        "idea",
        "neokantians",
        "selfconsciously",
        "rejected",
        "rejected",
        "doctrine",
        "thinginitself",
        "incoherent",
        "unnecessary",
        "windelband",
        "radically",
        "reinterpreted",
        "talk",
        "thingsinthemselves",
        "talk",
        "postulated",
        "final",
        "complete",
        "theory",
        "world",
        "cohen",
        "ff",
        "rejection",
        "kant",
        "dualism",
        "appearance",
        "thingsinthemselves",
        "closely",
        "related",
        "rethinking",
        "kant",
        "distinction",
        "two",
        "stem",
        "cognition",
        "sensibility",
        "understanding",
        "marburg",
        "philosopher",
        "came",
        "fundamentally",
        "reject",
        "distinction",
        "southwest",
        "neokantians",
        "maintaining",
        "irreducibility",
        "intuition",
        "concept",
        "still",
        "rejected",
        "idea",
        "intuition",
        "result",
        "mindindependent",
        "thinginitself",
        "affecting",
        "sensibility",
        "though",
        "neokantians",
        "took",
        "fundamental",
        "philosophy",
        "existence",
        "substantive",
        "priori",
        "concept",
        "principle",
        "make",
        "knowledge",
        "possible",
        "accept",
        "category",
        "principle",
        "identified",
        "critique",
        "pure",
        "reason",
        "complete",
        "fixed",
        "time",
        "particular",
        "marburg",
        "neokantians",
        "believed",
        "category",
        "principle",
        "kant",
        "identified",
        "relative",
        "scientific",
        "theory",
        "kant",
        "day",
        "category",
        "principle",
        "could",
        "change",
        "scientist",
        "develop",
        "new",
        "empirical",
        "theory",
        "southwest",
        "neokantians",
        "hand",
        "keen",
        "argue",
        "history",
        "much",
        "science",
        "mathematical",
        "physic",
        "thought",
        "kant",
        "critical",
        "project",
        "extended",
        "order",
        "identify",
        "priori",
        "element",
        "history",
        "last",
        "classical",
        "neokantians",
        "held",
        "transcendental",
        "philosophy",
        "distinct",
        "independent",
        "empirical",
        "psychology",
        "even",
        "though",
        "argued",
        "kant",
        "always",
        "innocent",
        "psychologism",
        "despite",
        "fact",
        "kant",
        "philosophy",
        "rightly",
        "interpreted",
        "basis",
        "sound",
        "antipsychologism",
        "cohen",
        "neokantians",
        "put",
        "forward",
        "suite",
        "argument",
        "show",
        "philosophy",
        "independent",
        "psychology",
        "logic",
        "theory",
        "knowledge",
        "concern",
        "objective",
        "subjective",
        "psychology",
        "cohen",
        "concern",
        "mental",
        "process",
        "subject",
        "cognitive",
        "apparatus",
        "empirical",
        "result",
        "human",
        "sense",
        "organ",
        "nervous",
        "system",
        "windelband",
        "put",
        "psychologistic",
        "philosopher",
        "employ",
        "genetic",
        "method",
        "trying",
        "find",
        "justification",
        "part",
        "knowledge",
        "tracing",
        "empirically",
        "causal",
        "antecedent",
        "correct",
        "method",
        "however",
        "critical",
        "method",
        "distinguishes",
        "call",
        "factual",
        "teleological",
        "normative",
        "validity",
        "critical",
        "method",
        "correct",
        "method",
        "fact",
        "believe",
        "something",
        "even",
        "human",
        "biological",
        "necessity",
        "believe",
        "yet",
        "solve",
        "critical",
        "question",
        "ought",
        "believe",
        "reason",
        "neokantians",
        "sharply",
        "distinguished",
        "priority",
        "innatenessa",
        "distinction",
        "claimed",
        "obscured",
        "philosopher",
        "helmholtz",
        "lange",
        "return",
        "antipsychologistic",
        "kant",
        "neokantians",
        "solution",
        "historian",
        "herbert",
        "schnädelbach",
        "called",
        "identity",
        "crisis",
        "faced",
        "philosophy",
        "middle",
        "nineteenth",
        "century",
        "given",
        "collapse",
        "conception",
        "philosophy",
        "shared",
        "postkantian",
        "speculative",
        "idealist",
        "concurrent",
        "spectacular",
        "advance",
        "made",
        "science",
        "philosopher",
        "left",
        "questioning",
        "anything",
        "left",
        "distinctive",
        "subject",
        "matter",
        "method",
        "philosophy",
        "beiser",
        "a",
        "ch",
        "particular",
        "opposing",
        "psychologism",
        "neokantians",
        "staking",
        "conception",
        "philosophy",
        "avoids",
        "naturalism",
        "defended",
        "many",
        "german",
        "philosopher",
        "decade",
        "hegel",
        "death",
        "cassirer",
        "according",
        "naturalistic",
        "conception",
        "philosophy",
        "method",
        "philosophy",
        "fact",
        "distinguishable",
        "natural",
        "science",
        "theory",
        "knowledge",
        "becomes",
        "applied",
        "empirical",
        "psychology",
        "nevertheless",
        "neokantians",
        "shared",
        "naturalistic",
        "philosopher",
        "deep",
        "distrust",
        "speculative",
        "metaphysics",
        "denied",
        "philosophy",
        "could",
        "deliver",
        "knowledge",
        "supersensible",
        "could",
        "deduce",
        "fact",
        "special",
        "science",
        "priori",
        "principle",
        "knowable",
        "special",
        "philosophical",
        "way",
        "philosophy",
        "could",
        "even",
        "done",
        "ignorance",
        "result",
        "science",
        "via",
        "medium",
        "third",
        "way",
        "philosophy",
        "found",
        "transcendental",
        "method",
        "two",
        "school",
        "conceived",
        "transcendental",
        "method",
        "differently",
        "cohen",
        "school",
        "philosophy",
        "begin",
        "factparadigmatically",
        "fact",
        "scienceand",
        "investigates",
        "condition",
        "make",
        "fact",
        "possible",
        "windelband",
        "school",
        "transcendental",
        "question",
        "understood",
        "teleologically",
        "given",
        "certain",
        "fundamental",
        "goal",
        "knowing",
        "truth",
        "good",
        "experiencing",
        "beautiful",
        "necessary",
        "achieving",
        "value",
        "still",
        "though",
        "common",
        "core",
        "school",
        "conception",
        "transcendental",
        "method",
        "wanted",
        "identify",
        "objective",
        "element",
        "within",
        "part",
        "human",
        "culture",
        "say",
        "physic",
        "history",
        "ethic",
        "made",
        "possible",
        "objective",
        "validity",
        "say",
        "objective",
        "validity",
        "physical",
        "theory",
        "historical",
        "narrative",
        "ethical",
        "claim",
        "adherence",
        "transcendental",
        "method",
        "led",
        "neokantians",
        "reject",
        "skepticism",
        "philosophical",
        "reflection",
        "begin",
        "fact",
        "scientist",
        "developed",
        "successful",
        "theory",
        "physical",
        "world",
        "universal",
        "validity",
        "value",
        "truth",
        "room",
        "left",
        "skeptical",
        "worry",
        "scientific",
        "theory",
        "fact",
        "deliver",
        "empirical",
        "knowledge",
        "truth",
        "fact",
        "unattainable",
        "windelband",
        "object",
        "transcendental",
        "method",
        "neokantians",
        "culture",
        "often",
        "approached",
        "human",
        "culture",
        "using",
        "kant",
        "threefold",
        "distinction",
        "knowledge",
        "ethic",
        "aesthetic",
        "saw",
        "achievement",
        "science",
        "one",
        "significant",
        "aspect",
        "modern",
        "culture",
        "good",
        "portion",
        "writing",
        "concern",
        "philosophy",
        "science",
        "kant",
        "applied",
        "transcendental",
        "method",
        "newtonian",
        "science",
        "sought",
        "apply",
        "method",
        "best",
        "science",
        "day",
        "typically",
        "exclusively",
        "marburg",
        "philosopher",
        "concerned",
        "physic",
        "mathematics",
        "late",
        "nineteenth",
        "early",
        "twentieth",
        "century",
        "emphasized",
        "differed",
        "fundamentally",
        "kant",
        "day",
        "southwest",
        "neokantians",
        "hand",
        "concerned",
        "socalled",
        "geisteswissenschaften",
        "human",
        "science",
        "come",
        "nineteenth",
        "century",
        "deserved",
        "argued",
        "recognized",
        "autonomous",
        "fully",
        "scientific",
        "despite",
        "fact",
        "kant",
        "sharply",
        "distinguished",
        "history",
        "science",
        "kant",
        "ak",
        "neokantian",
        "philosophy",
        "science",
        "distinctive",
        "focus",
        "methodology",
        "science",
        "thus",
        "neokantian",
        "philosophy",
        "physic",
        "much",
        "concerned",
        "directly",
        "matter",
        "mathematical",
        "physic",
        "come",
        "know",
        "matter",
        "neokantian",
        "philosophy",
        "history",
        "concerned",
        "grand",
        "theory",
        "concerning",
        "drive",
        "history",
        "make",
        "methodology",
        "historian",
        "different",
        "physicist",
        "empirical",
        "psychologist",
        "philosophy",
        "science",
        "logic",
        "sciencesin",
        "extended",
        "sense",
        "logic",
        "includes",
        "theory",
        "knowledge",
        "scientific",
        "methodology",
        "true",
        "antipsychologistic",
        "conception",
        "logic",
        "neokantian",
        "account",
        "scientific",
        "methodology",
        "intended",
        "empirical",
        "description",
        "scientist",
        "account",
        "identify",
        "objective",
        "norm",
        "fundamental",
        "principle",
        "concept",
        "particular",
        "science",
        "philosophy",
        "science",
        "thus",
        "becomes",
        "second",
        "order",
        "discipline",
        "different",
        "kind",
        "natural",
        "science",
        "thus",
        "avoiding",
        "naturalism",
        "neokantian",
        "philosophy",
        "science",
        "adheres",
        "transcendental",
        "method",
        "avoids",
        "error",
        "speculative",
        "metaphysics",
        "instance",
        "try",
        "derive",
        "concept",
        "matter",
        "life",
        "priori",
        "content",
        "demonstrate",
        "concept",
        "necessary",
        "condition",
        "physic",
        "biology",
        "since",
        "philosophy",
        "science",
        "neokantians",
        "second",
        "order",
        "discipline",
        "general",
        "committed",
        "nonrevisionist",
        "attitude",
        "according",
        "rickert",
        "philosophy",
        "claim",
        "direct",
        "science",
        "onto",
        "path",
        "take",
        "contrary",
        "proposes",
        "follow",
        "science",
        "view",
        "understanding",
        "cassirer",
        "critical",
        "philosophy",
        "seek",
        "direct",
        "science",
        "understand",
        "b",
        "since",
        "goal",
        "transcendental",
        "philosophy",
        "neokantians",
        "identify",
        "element",
        "within",
        "part",
        "human",
        "culture",
        "necessary",
        "objective",
        "validity",
        "also",
        "led",
        "investigate",
        "nature",
        "objective",
        "validity",
        "natorp",
        "rickert",
        "two",
        "school",
        "construed",
        "question",
        "objective",
        "validity",
        "differently",
        "marburg",
        "philosopher",
        "emphasized",
        "objectivity",
        "gave",
        "account",
        "objectivity",
        "term",
        "constant",
        "law",
        "see",
        "section",
        "southwest",
        "neokantians",
        "emphasized",
        "question",
        "validityspecifically",
        "validity",
        "value",
        "section",
        "school",
        "central",
        "issue",
        "investigation",
        "objective",
        "validity",
        "question",
        "transcendence",
        "mean",
        "object",
        "independent",
        "knowledge",
        "provides",
        "standard",
        "truth",
        "four",
        "key",
        "idea",
        "common",
        "southwest",
        "marburg",
        "theory",
        "objective",
        "validity",
        "first",
        "school",
        "emphasized",
        "centrality",
        "judgment",
        "opposed",
        "concept",
        "intuition",
        "kind",
        "representation",
        "first",
        "make",
        "objective",
        "validity",
        "possible",
        "rickert",
        "ch",
        "cohen",
        "second",
        "neokantians",
        "emphatic",
        "objective",
        "validity",
        "knowledge",
        "consist",
        "copy",
        "abbild",
        "mirror",
        "object",
        "windelband",
        "rickert",
        "cassirer",
        "ch",
        "rickert",
        "ch",
        "copy",
        "theory",
        "knowledge",
        "inconsistent",
        "third",
        "key",
        "idea",
        "objective",
        "validity",
        "every",
        "area",
        "culture",
        "made",
        "possible",
        "substantive",
        "priori",
        "principle",
        "priori",
        "principle",
        "make",
        "possible",
        "part",
        "human",
        "culture",
        "interpreted",
        "psychologistically",
        "feature",
        "mind",
        "individual",
        "subject",
        "discovered",
        "empirically",
        "necessity",
        "grounded",
        "empirical",
        "fact",
        "universally",
        "accepted",
        "priori",
        "principle",
        "part",
        "culturethey",
        "fundamental",
        "norm",
        "law",
        "fourth",
        "neokantians",
        "described",
        "idealist",
        "idealism",
        "meant",
        "different",
        "thing",
        "different",
        "neokantians",
        "see",
        "section",
        "neokantians",
        "shared",
        "view",
        "knowledge",
        "requires",
        "priori",
        "element",
        "present",
        "given",
        "immediate",
        "intuition",
        "knowledge",
        "requires",
        "reshaping",
        "transformation",
        "given",
        "copy",
        "theory",
        "reject",
        "would",
        "sense",
        "kind",
        "realism",
        "course",
        "neokantian",
        "idealism",
        "must",
        "rigorously",
        "distinguished",
        "kind",
        "idealism",
        "noted",
        "earlier",
        "reject",
        "kant",
        "doctrine",
        "thinginitself",
        "emphatically",
        "believe",
        "object",
        "way",
        "subjective",
        "dependent",
        "representation",
        "individual",
        "psychological",
        "subject",
        "one",
        "final",
        "common",
        "feature",
        "neokantian",
        "philosopher",
        "overlooked",
        "neokantians",
        "great",
        "historian",
        "philosophy",
        "surprising",
        "neokantians",
        "wrote",
        "extensively",
        "kant",
        "producing",
        "commentary",
        "eg",
        "cohen",
        "cassirer",
        "critical",
        "edition",
        "writing",
        "neokantians",
        "also",
        "wrote",
        "extensively",
        "philosopher",
        "ancient",
        "modern",
        "history",
        "science",
        "mathematics",
        "eg",
        "windelband",
        "cassirer",
        "a",
        "historical",
        "work",
        "thought",
        "side",
        "project",
        "essential",
        "aspect",
        "philosophy",
        "neokantians",
        "sharply",
        "distinguish",
        "history",
        "philosophy",
        "philosophy",
        "see",
        "introduction",
        "windelband",
        "i",
        "version",
        "cohen"
    ]
}