{
    "main_text": "The Marburg School || Theory of Knowledge\n2.2 Theory of Knowledge\n\nThe core of the Marburg Neo-Kantian theory of knowledge is a\nconception of “objective validity” (Natorp 1887; Cohen\n1902: §11). By the “objective validity” of knowledge,\nthey mean its objectivity (that is, its independence from\nindividual subjects), its truth, and its relation to\nobjects. A theory of objective validity is then also a theory\nof the “transcendence” of the object—in what sense\nthe object is an independent standard of correctness for knowledge. A\ngood way to approach the Marburg theory is by considering an\nalternative they reject. Consider the view that “objects in\nthemselves are there, outside and independent of all subjectivity,\nwithout any original relation to it”. That is, begin your theory\nof objective validity with the notion of an independent object, taken\nas a theoretical given. This notion of an object is then used to\nexplain aboutness, truth, and objectivity. A representation is about\nan object, say, if it is caused by an object or, perhaps, it resembles\nit. A representation is true if it then mirrors or copies the object\nas it is independently of us. And then knowledge is objective if it is\nabout an independent object, not about the subject and its states. For\nMarburg Neo-Kantians, this theory of objective validity (which they\ncall “naive realism”) simply presupposes the very thing it\nis supposed to explain:\n\n\nPerhaps this actually means something correct, but at least as it is\npresented, it is not really an answer to the question [What is\nobjective validity?]. The being-in-itself of the object is itself an\nenigma and thus cannot serve as a solution to our present enigma. If\nwe understood what it meant to say the object in itself is there\nindependent of all subjectivity and then is appropriated in our\nsubjectivity by knowledge there would be no problem in the knowing of\nobjects or in the objectivity of knowledge. (Natorp 1887: §4)\n\n\nThe Marburg theory of objective validity, on the other hand, turns\nthis order of explanation on its head: instead of beginning with the\nnotion of an object as its explanatory primitive, it sees the notion\nof an object as dependent on many other prior notions. In particular,\nit begins its account of objective validity with a distinctive\naccount of objectivity.\n\nObjectivity, according to the Marburg view, depends on laws. For\nexample, a particular physical thing (say a table in a room) appears\nin a certain way from my own subjective point of view in the room. To\nachieve an objective representation of the table, I would need to\nunderstand how all of the various appearances at various points of\nview in the room are related to one another in a law-like way. When I\nknow the law, I’ve moved from appearance to reality, from\nsubjectivity to objectivity. If there is no such law, then there is\nonly appearance, and I cannot speak about an independent object and\nits properties. This simple point generalizes at higher levels. It\nmerely appears from our subjective point of view that the earth is\nstationary and the sun moves. But it is objectively the case that the\nearth moves around the sun because the heliocentric model follows from\nNewton’s laws of motion. Even more fundamentally,\nscientific theories (such as Newton’s) are developed, adopted,\nand abandoned as science progresses; this whole progression is itself\nobjective because there are “laws” (that is, a common\nscientific method) that prescribe these changes. These laws secure the\n“unity” of knowledge: the various appearances of the same\nparticular are united as of the same particular object by a law; a law\nof nature unites various observed phenomena under it; the scientific\nmethod unites science in its development, prescribing a uniquely\ncorrect path to follow. This unity can also be described as\n“permanence”: the appearances change, even as the object\nstays the same; the planets move, but the law remains; theories come\nand go, but the method stays constant. This notion of objectivity as\nlawfulness is then used to give an account of truth and objecthood.\nKnowledge is true if it can be unified with other knowledge within an\nobjective system of knowledge. Last, an object is then what is known\nby fully objective knowledge: \n\n\nthe object signifies the law; it signifies the lasting unity in which\nthe changing manifold of appearance is unified and determined in\nthought. (Natorp 1887: §4)\n\n\nThis theory of objective validity has some notable consequences.\nFirst, the possibility of objective validity requires that we\npostulate, as a regulative ideal, a final science. The unity of\nknowledge through laws that the Marburgers point to as the foundation\nof objective validity has clearly not yet been achieved: there are\nstill phenomena that have not yet been explained, and our current\ntheories are certainly not going to be the final word. But it is\nclearly the case that even now we can know objects, even if our\nknowledge is partial. If unity through laws makes objectivity validity\npossible and that unity has not yet been achieved, how then can we\nknow any objects at all? We have to postulate that our current, only\npartially unified knowledge can progress in a law-like way into a\nunique, final theory. Such a final theory can never actually be\nachieved, because the task of knowledge is infinite—there is\nalways more to understand, deeper explanations to give. The postulated\nfinal theory is like the asymptote that a curve never quite reaches.\nThis viewpoint—that speaking of an object contains the demand\nfor unity of knowledge, that this task is infinite, that we must\ntherefore postulate the possibility of its completion—Natorp\ncalls the “genetic view of knowledge” (1910: Ch.1,\n§4–5). The genetic view delivers a unique way of cashing\nout the “transcendence” of the object. The fact that the\nobject is independent of knowledge, in the sense that it always\ntranscends our knowledge of it, is expressed by the infinity of the\ntask of knowledge. And the fact that the object is the standard for\nknowledge is expressed by the postulate that the course of knowledge\nis moving asymptotically towards a unique (though infinite) endpoint\nas its goal. Second, the emphasis on lawfulness gives the Marburgers a\nsatisfying explanation of the application of mathematics to the\nobjects of natural science: the laws of natural science are\nmathematical, and there would be no objects if there were no laws of\nnatural science. Third, since objectivity is explained in terms of\nlaws, and laws are a special kind of universal judgment, the Marburg\ntheory of objective validity emphasizes the priority of judgments over\nconcepts (Cohen 1902: §10). As Cohen memorably put it, modifying\nGalileo’s phrase: the book of nature is written in\nsentences (with mathematics as its letters, and the a priori\nprinciples of pure knowledge as its syntax) (1902: 204, 484).\n\nIn addition to their theory of objective validity, another core\ncommitment in the mature writings of the Marburg school is a rejection\nof the “given”. In this, they are explicitly departing\nfrom Kant. Kant had argued that our cognitive faculty has two stems: a\nreceptive faculty (sensibility), and a spontaneous faculty\n(understanding). Through sensibility, objects are given to us, and\nthrough the understanding, objects are thought. The representations of\nsensibility are intuitions, which relate to objects immediately; the\nrepresentations of the understanding are concepts, which relate to\nobjects mediately. The Marburgers’ skepticism of these\ndistinctions culminated in Cohen’s Logic of Pure\nKnowledge (1902: §7), where these dualisms are definitively\nrejected. As Natorp put the point: \n\n\nIn the end, “intuition” no longer remains a cognitive\nfactor which stands across from or is opposed to thinking. It is\nthinking, just not thinking in terms of laws, but thinking in terms of\nfull objects. In its implementation, in its exercise, intuition is to\nconceptual thought as function is to the law of function. (1912a: 186)\n\n\n\nIntuition is itself a “function”, because even intuitions\nare active or spontaneous, and not merely given. Similarly, they were\noften uncomfortable with Kant’s word “synthesis”\nbecause it suggests that the function of thinking is only to combine a\ncontent that is already given. Instead, Cohen prefers the term\n“generate” in order to indicate the “creative\nsovereignty of thinking” (1902: 25). In another favorite slogan,\nan object is not given [geben] to knowledge, but given as a\ntask [aufgegeben], echoing the genetic view of knowledge\ndescribed in the previous paragraph (Natorp 1912a: 183–4; Natorp\n1910: Ch.1, §5). In Substance and Function (1910: Ch.1),\nCassirer attacks the given by attacking a related doctrine: the\ntraditional view that all concepts are formed by abstraction. On this\nview of concept formation, concepts would have to be abstracted from\ngiven material that is completely independent of thought and its\nconcepts—thus presupposing the doctrine of the given.\n\nIt is hard to interpret the Marburg rejection of the given. It seems\nto deny the obvious fact that there is some passive element in\nperception, and to leave no room for experiment within natural science\n(as Natorp recognized: 1912a: 186). In interpreting the doctrine, it\nis helpful to remember that the Marburg theory of knowledge concerns\nrelations among the content of knowledge—how one part of the\ncontent of knowledge justifies another. It is not concerned with\ncausal relations between acts of the mind in perception. Plausibly,\nthe only content that could justify a thought must itself be something\nthinkable, since “knowledge is only grounded through other\nknowledge” (Natorp 1887: 168). (In this sense, the denial of the\ngiven is a denial of content that is not conceptual or dependent on\nwhat is conceptual.) In Cassirer’s polemic against the given, he\nattacks the “epistemological atomism” implicit in it: the\nview that there are some contents that can be efficacious for\nknowledge without requiring that a knower possess any concepts or know\nany facts. (In this sense, the denial of the given is a defense of\nsemantic holism.) For this reason, he argues against the given by\narguing that even the most basic\nexperiments—measurements—depend on the experimenter\npossessing concepts and knowing certain theoretical facts (see\n section 2.3\n below).\n\nThe Marburg philosophers characterize their philosophy as a kind of\n“idealism”. This idealism should be sharply distinguished\nfrom “subjectivism”, since they do not believe that\nobjects of knowledge are representations—they do not believe\nthat the objects of knowledge depend for their existence on the\nexistence of minds to think them (Cassirer 1910: 298). This idealism\nis also opposed to the view that our knowledge is really illusory;\nthey do not hold that there are unknowable objects, or that the real\nnature of objects of knowledge is in principle unknowable (Cohen 1902:\n507ff). Rather, their position is idealist in four senses. First, they\ndefend an “idealist” conception of philosophy, as\nfollowing the transcendental method. In this sense, idealism is\nopposed to “naturalism”, the view that the method of\nphilosophy does not differ in kind from that of the natural sciences.\nSecond, they hold that there are substantive a priori principles that\nmake experience possible. In this sense, their idealism is opposed to\nempiricism. Third, according to their theory of objective validity,\nour conception of an object depends on our conception of objectivity,\nwhich is grounded in the idea of the unity of knowledge according to\nlaws. In this sense of idealism, idealism is opposed to\n“realism”, which takes the concept of an object as a\nphilosophical primitive. Fourth, according to their philosophy of\nscience (see below\n section 2.3),\n our empirical theories make essential use of fundamental concepts\n(such as mathematical concepts, or “theoretical concepts”,\nsuch as the concept <force> or <energy>) that are\nradically unlike the features that the world appears to have to\nuntutored, everyday experience. These “ideal” concepts are\nnot reducible to “sensible” concepts such as color,\ntexture, or shape. In this sense, idealism is opposed to\n“sensualism”.\n\nThe Marburg conception of philosophy, as guided by the transcendental\nmethod, along with their rejection of the given, leads them to a\nunique conception of logic. For further discussion, see the\nSupplement,\n Philosophy of Logic in the Marburg School.\n\nThe Marburg rejection of the given, along with their view that\nobjectivity is conferred by laws, has significant consequences for\ntheir philosophy of psychology. For further information, see the\nSupplement,\n Philosophy of Psychology in the Marburg School.\n",
    "section_title": "2.2 Theory of Knowledge",
    "entry_title": "Neo-Kantianism",
    "hierarchy_title": "Neo-Kantianism || The Marburg School || Theory of Knowledge",
    "tokenized_text": [
        "marburg",
        "school",
        "theory",
        "knowledge",
        "theory",
        "knowledge",
        "core",
        "marburg",
        "neokantian",
        "theory",
        "knowledge",
        "conception",
        "objective",
        "validity",
        "natorp",
        "cohen",
        "objective",
        "validity",
        "knowledge",
        "mean",
        "objectivity",
        "independence",
        "individual",
        "subject",
        "truth",
        "relation",
        "object",
        "theory",
        "objective",
        "validity",
        "also",
        "theory",
        "transcendence",
        "objectin",
        "sense",
        "object",
        "independent",
        "standard",
        "correctness",
        "knowledge",
        "good",
        "way",
        "approach",
        "marburg",
        "theory",
        "considering",
        "alternative",
        "reject",
        "consider",
        "view",
        "object",
        "outside",
        "independent",
        "subjectivity",
        "without",
        "original",
        "relation",
        "begin",
        "theory",
        "objective",
        "validity",
        "notion",
        "independent",
        "object",
        "taken",
        "theoretical",
        "given",
        "notion",
        "object",
        "used",
        "explain",
        "aboutness",
        "truth",
        "objectivity",
        "representation",
        "object",
        "say",
        "caused",
        "object",
        "perhaps",
        "resembles",
        "representation",
        "true",
        "mirror",
        "copy",
        "object",
        "independently",
        "u",
        "knowledge",
        "objective",
        "independent",
        "object",
        "subject",
        "state",
        "marburg",
        "neokantians",
        "theory",
        "objective",
        "validity",
        "call",
        "naive",
        "realism",
        "simply",
        "presupposes",
        "thing",
        "supposed",
        "explain",
        "perhaps",
        "actually",
        "mean",
        "something",
        "correct",
        "least",
        "presented",
        "really",
        "answer",
        "question",
        "objective",
        "validity",
        "beinginitself",
        "object",
        "enigma",
        "thus",
        "serve",
        "solution",
        "present",
        "enigma",
        "understood",
        "meant",
        "say",
        "object",
        "independent",
        "subjectivity",
        "appropriated",
        "subjectivity",
        "knowledge",
        "would",
        "problem",
        "knowing",
        "object",
        "objectivity",
        "knowledge",
        "natorp",
        "marburg",
        "theory",
        "objective",
        "validity",
        "hand",
        "turn",
        "order",
        "explanation",
        "head",
        "instead",
        "beginning",
        "notion",
        "object",
        "explanatory",
        "primitive",
        "see",
        "notion",
        "object",
        "dependent",
        "many",
        "prior",
        "notion",
        "particular",
        "begin",
        "account",
        "objective",
        "validity",
        "distinctive",
        "account",
        "objectivity",
        "objectivity",
        "according",
        "marburg",
        "view",
        "depends",
        "law",
        "example",
        "particular",
        "physical",
        "thing",
        "say",
        "table",
        "room",
        "appears",
        "certain",
        "way",
        "subjective",
        "point",
        "view",
        "room",
        "achieve",
        "objective",
        "representation",
        "table",
        "would",
        "need",
        "understand",
        "various",
        "appearance",
        "various",
        "point",
        "view",
        "room",
        "related",
        "one",
        "another",
        "lawlike",
        "way",
        "know",
        "law",
        "moved",
        "appearance",
        "reality",
        "subjectivity",
        "objectivity",
        "law",
        "appearance",
        "speak",
        "independent",
        "object",
        "property",
        "simple",
        "point",
        "generalizes",
        "higher",
        "level",
        "merely",
        "appears",
        "subjective",
        "point",
        "view",
        "earth",
        "stationary",
        "sun",
        "move",
        "objectively",
        "case",
        "earth",
        "move",
        "around",
        "sun",
        "heliocentric",
        "model",
        "follows",
        "newton",
        "law",
        "motion",
        "even",
        "fundamentally",
        "scientific",
        "theory",
        "newton",
        "developed",
        "adopted",
        "abandoned",
        "science",
        "progress",
        "whole",
        "progression",
        "objective",
        "law",
        "common",
        "scientific",
        "method",
        "prescribe",
        "change",
        "law",
        "secure",
        "unity",
        "knowledge",
        "various",
        "appearance",
        "particular",
        "united",
        "particular",
        "object",
        "law",
        "law",
        "nature",
        "unites",
        "various",
        "observed",
        "phenomenon",
        "scientific",
        "method",
        "unites",
        "science",
        "development",
        "prescribing",
        "uniquely",
        "correct",
        "path",
        "follow",
        "unity",
        "also",
        "described",
        "permanence",
        "appearance",
        "change",
        "even",
        "object",
        "stay",
        "planet",
        "move",
        "law",
        "remains",
        "theory",
        "come",
        "go",
        "method",
        "stay",
        "constant",
        "notion",
        "objectivity",
        "lawfulness",
        "used",
        "give",
        "account",
        "truth",
        "objecthood",
        "knowledge",
        "true",
        "unified",
        "knowledge",
        "within",
        "objective",
        "system",
        "knowledge",
        "last",
        "object",
        "known",
        "fully",
        "objective",
        "knowledge",
        "object",
        "signifies",
        "law",
        "signifies",
        "lasting",
        "unity",
        "changing",
        "manifold",
        "appearance",
        "unified",
        "determined",
        "thought",
        "natorp",
        "theory",
        "objective",
        "validity",
        "notable",
        "consequence",
        "first",
        "possibility",
        "objective",
        "validity",
        "requires",
        "postulate",
        "regulative",
        "ideal",
        "final",
        "science",
        "unity",
        "knowledge",
        "law",
        "marburgers",
        "point",
        "foundation",
        "objective",
        "validity",
        "clearly",
        "yet",
        "achieved",
        "still",
        "phenomenon",
        "yet",
        "explained",
        "current",
        "theory",
        "certainly",
        "going",
        "final",
        "word",
        "clearly",
        "case",
        "even",
        "know",
        "object",
        "even",
        "knowledge",
        "partial",
        "unity",
        "law",
        "make",
        "objectivity",
        "validity",
        "possible",
        "unity",
        "yet",
        "achieved",
        "know",
        "object",
        "postulate",
        "current",
        "partially",
        "unified",
        "knowledge",
        "progress",
        "lawlike",
        "way",
        "unique",
        "final",
        "theory",
        "final",
        "theory",
        "never",
        "actually",
        "achieved",
        "task",
        "knowledge",
        "infinitethere",
        "always",
        "understand",
        "deeper",
        "explanation",
        "give",
        "postulated",
        "final",
        "theory",
        "like",
        "asymptote",
        "curve",
        "never",
        "quite",
        "reach",
        "viewpointthat",
        "speaking",
        "object",
        "contains",
        "demand",
        "unity",
        "knowledge",
        "task",
        "infinite",
        "must",
        "therefore",
        "postulate",
        "possibility",
        "completionnatorp",
        "call",
        "genetic",
        "view",
        "knowledge",
        "ch",
        "genetic",
        "view",
        "delivers",
        "unique",
        "way",
        "cashing",
        "transcendence",
        "object",
        "fact",
        "object",
        "independent",
        "knowledge",
        "sense",
        "always",
        "transcends",
        "knowledge",
        "expressed",
        "infinity",
        "task",
        "knowledge",
        "fact",
        "object",
        "standard",
        "knowledge",
        "expressed",
        "postulate",
        "course",
        "knowledge",
        "moving",
        "asymptotically",
        "towards",
        "unique",
        "though",
        "infinite",
        "endpoint",
        "goal",
        "second",
        "emphasis",
        "lawfulness",
        "give",
        "marburgers",
        "satisfying",
        "explanation",
        "application",
        "mathematics",
        "object",
        "natural",
        "science",
        "law",
        "natural",
        "science",
        "mathematical",
        "would",
        "object",
        "law",
        "natural",
        "science",
        "third",
        "since",
        "objectivity",
        "explained",
        "term",
        "law",
        "law",
        "special",
        "kind",
        "universal",
        "judgment",
        "marburg",
        "theory",
        "objective",
        "validity",
        "emphasizes",
        "priority",
        "judgment",
        "concept",
        "cohen",
        "cohen",
        "memorably",
        "put",
        "modifying",
        "galileo",
        "phrase",
        "book",
        "nature",
        "written",
        "sentence",
        "mathematics",
        "letter",
        "priori",
        "principle",
        "pure",
        "knowledge",
        "syntax",
        "addition",
        "theory",
        "objective",
        "validity",
        "another",
        "core",
        "commitment",
        "mature",
        "writing",
        "marburg",
        "school",
        "rejection",
        "given",
        "explicitly",
        "departing",
        "kant",
        "kant",
        "argued",
        "cognitive",
        "faculty",
        "two",
        "stem",
        "receptive",
        "faculty",
        "sensibility",
        "spontaneous",
        "faculty",
        "understanding",
        "sensibility",
        "object",
        "given",
        "u",
        "understanding",
        "object",
        "thought",
        "representation",
        "sensibility",
        "intuition",
        "relate",
        "object",
        "immediately",
        "representation",
        "understanding",
        "concept",
        "relate",
        "object",
        "mediately",
        "marburgers",
        "skepticism",
        "distinction",
        "culminated",
        "cohen",
        "logic",
        "pure",
        "knowledge",
        "dualism",
        "definitively",
        "rejected",
        "natorp",
        "put",
        "point",
        "end",
        "intuition",
        "longer",
        "remains",
        "cognitive",
        "factor",
        "stand",
        "across",
        "opposed",
        "thinking",
        "thinking",
        "thinking",
        "term",
        "law",
        "thinking",
        "term",
        "full",
        "object",
        "implementation",
        "exercise",
        "intuition",
        "conceptual",
        "thought",
        "function",
        "law",
        "function",
        "a",
        "intuition",
        "function",
        "even",
        "intuition",
        "active",
        "spontaneous",
        "merely",
        "given",
        "similarly",
        "often",
        "uncomfortable",
        "kant",
        "word",
        "synthesis",
        "suggests",
        "function",
        "thinking",
        "combine",
        "content",
        "already",
        "given",
        "instead",
        "cohen",
        "prefers",
        "term",
        "generate",
        "order",
        "indicate",
        "creative",
        "sovereignty",
        "thinking",
        "another",
        "favorite",
        "slogan",
        "object",
        "given",
        "geben",
        "knowledge",
        "given",
        "task",
        "aufgegeben",
        "echoing",
        "genetic",
        "view",
        "knowledge",
        "described",
        "previous",
        "paragraph",
        "natorp",
        "a",
        "natorp",
        "ch",
        "substance",
        "function",
        "ch",
        "cassirer",
        "attack",
        "given",
        "attacking",
        "related",
        "doctrine",
        "traditional",
        "view",
        "concept",
        "formed",
        "abstraction",
        "view",
        "concept",
        "formation",
        "concept",
        "would",
        "abstracted",
        "given",
        "material",
        "completely",
        "independent",
        "thought",
        "conceptsthus",
        "presupposing",
        "doctrine",
        "given",
        "hard",
        "interpret",
        "marburg",
        "rejection",
        "given",
        "seems",
        "deny",
        "obvious",
        "fact",
        "passive",
        "element",
        "perception",
        "leave",
        "room",
        "experiment",
        "within",
        "natural",
        "science",
        "natorp",
        "recognized",
        "a",
        "interpreting",
        "doctrine",
        "helpful",
        "remember",
        "marburg",
        "theory",
        "knowledge",
        "concern",
        "relation",
        "among",
        "content",
        "knowledgehow",
        "one",
        "part",
        "content",
        "knowledge",
        "justifies",
        "another",
        "concerned",
        "causal",
        "relation",
        "act",
        "mind",
        "perception",
        "plausibly",
        "content",
        "could",
        "justify",
        "thought",
        "must",
        "something",
        "thinkable",
        "since",
        "knowledge",
        "grounded",
        "knowledge",
        "natorp",
        "sense",
        "denial",
        "given",
        "denial",
        "content",
        "conceptual",
        "dependent",
        "conceptual",
        "cassirer",
        "polemic",
        "given",
        "attack",
        "epistemological",
        "atomism",
        "implicit",
        "view",
        "content",
        "efficacious",
        "knowledge",
        "without",
        "requiring",
        "knower",
        "posse",
        "concept",
        "know",
        "fact",
        "sense",
        "denial",
        "given",
        "defense",
        "semantic",
        "holism",
        "reason",
        "argues",
        "given",
        "arguing",
        "even",
        "basic",
        "experimentsmeasurementsdepend",
        "experimenter",
        "possessing",
        "concept",
        "knowing",
        "certain",
        "theoretical",
        "fact",
        "see",
        "section",
        "marburg",
        "philosopher",
        "characterize",
        "philosophy",
        "kind",
        "idealism",
        "idealism",
        "sharply",
        "distinguished",
        "subjectivism",
        "since",
        "believe",
        "object",
        "knowledge",
        "representationsthey",
        "believe",
        "object",
        "knowledge",
        "depend",
        "existence",
        "existence",
        "mind",
        "think",
        "cassirer",
        "idealism",
        "also",
        "opposed",
        "view",
        "knowledge",
        "really",
        "illusory",
        "hold",
        "unknowable",
        "object",
        "real",
        "nature",
        "object",
        "knowledge",
        "principle",
        "unknowable",
        "cohen",
        "ff",
        "rather",
        "position",
        "idealist",
        "four",
        "sens",
        "first",
        "defend",
        "idealist",
        "conception",
        "philosophy",
        "following",
        "transcendental",
        "method",
        "sense",
        "idealism",
        "opposed",
        "naturalism",
        "view",
        "method",
        "philosophy",
        "differ",
        "kind",
        "natural",
        "science",
        "second",
        "hold",
        "substantive",
        "priori",
        "principle",
        "make",
        "experience",
        "possible",
        "sense",
        "idealism",
        "opposed",
        "empiricism",
        "third",
        "according",
        "theory",
        "objective",
        "validity",
        "conception",
        "object",
        "depends",
        "conception",
        "objectivity",
        "grounded",
        "idea",
        "unity",
        "knowledge",
        "according",
        "law",
        "sense",
        "idealism",
        "idealism",
        "opposed",
        "realism",
        "take",
        "concept",
        "object",
        "philosophical",
        "primitive",
        "fourth",
        "according",
        "philosophy",
        "science",
        "see",
        "section",
        "empirical",
        "theory",
        "make",
        "essential",
        "use",
        "fundamental",
        "concept",
        "mathematical",
        "concept",
        "theoretical",
        "concept",
        "concept",
        "force",
        "energy",
        "radically",
        "unlike",
        "feature",
        "world",
        "appears",
        "untutored",
        "everyday",
        "experience",
        "ideal",
        "concept",
        "reducible",
        "sensible",
        "concept",
        "color",
        "texture",
        "shape",
        "sense",
        "idealism",
        "opposed",
        "sensualism",
        "marburg",
        "conception",
        "philosophy",
        "guided",
        "transcendental",
        "method",
        "along",
        "rejection",
        "given",
        "lead",
        "unique",
        "conception",
        "logic",
        "discussion",
        "see",
        "supplement",
        "philosophy",
        "logic",
        "marburg",
        "school",
        "marburg",
        "rejection",
        "given",
        "along",
        "view",
        "objectivity",
        "conferred",
        "law",
        "significant",
        "consequence",
        "philosophy",
        "psychology",
        "information",
        "see",
        "supplement",
        "philosophy",
        "psychology",
        "marburg",
        "school"
    ]
}