{
    "main_text": "Democracy\n5. Democracy\n\nNeoliberals embrace democracy. More specifically, they endorse equal\nrights to vote and participate in elections, and they support\nparliamentary democracy as the means of enacting legislation. Hayek\nsays,\n\n\nI profoundly believe in the basic principles of democracy as the only\neffective method which we have yet discovered of making peaceful\nchange possible, (1979: xiii)\n\n\nand he claims to be concerned about disillusionment with democracy\n“as a desirable method of government”. For Hayek, the\nmarket system must be “embedded in a set of social\ninstitutions” if it is to work, and that includes a\n“democratic polity subject to the rule of law” (Caldwell\n2004: 348). The point of The Road to Serfdom is to argue that\nliberal democratic socialism is unstable and that socialism must cease\nto be democratic or cease being socialism. So any attempt to plan the\neconomy would not only destroy liberal rights; it would inevitably\ndestroy democracy.\n\nHayek’s case for democracy tends to be instrumentalist, as he\nargues that\n\n\nthe true value of democracy is to serve as a sanitary precaution\nprotecting us against an abuse of power. It enables us to get rid of a\ngovernment and try to replace it by a better one. (1979: 137)\n\n\nIt is also “one of the most important safeguards of\nfreedom” (1979: 5). And yet Hayek thinks recognizing that\npersons are equals requires not only equality before the law but\n“the demand that all men should also have the same share in\nmaking the law” even if democracy is a “means rather than\nan end” that needs limits (1960 [2011: 103, 107–8]).\n\nThis commitment was shared by members of the Mont Pelerin Society,\nwhich Hayek organized. Angus Burgin argues that\n\n\nAn assumed relationship between free markets and democratic politics\npervaded the society’s discussions throughout its first decade\nof existence and provided a foundational premise for many of the\nmembers’ contributions to its debates. (2012: 117)\n\n\nFriedman routinely defends free markets on the ground that they\ncontribute to political freedom and democracy; both freedoms are\n“inseparable” (Butler 1985: 207). Friedman (1962a [2002:\n9]) often says that he knows of\n\n\nno example in time or place of a society that has been marked by a\nlarge measure of political freedom, and that has not also used\nsomething comparable to a free market to organize the bulk of economic\nactivity.\n\n\nSo, he appears to think that democracy is a great good, but we are led\nto guess the reasons why. One could argue that Friedman’s case\nfor democracy is largely that it protects liberty and allows a bad\ngovernment to be peacefully replaced. But there is little in his\ncorpus that speaks to this question one way or another.\n\nBuchanan is the most democratic of the three. He agrees that democracy\nis essential for social peace and prosperity, but he emphasizes that\npolitical equality requires government to be based on the consent of\nthe people. Democracy is an extension of his individualism:\n\n\nThe approach must be democratic, which in this sense is merely a\nvariant of the definitional norm for individualism. Each man counts\nfor one, and that is that. (Buchanan 1975: 2).\n\n\nWhile Buchanan insists on unanimous consent for\nconstitutional rules (strikingly, among non-ideal persons), he thinks\nthat constitutions may allow for decision-making rules weaker than\nunanimity, such as majority rule. It is true that Buchanan (Buchanan\nand Tullock 1962: 85–96) argues that legislative rules should be\nsupermajoritarian rather than majoritarian, but that is still an\nembrace of democracy, especially when undergirded by the consent of\nthe people as a whole.\n\nHowever, unlike many classical and contemporary democratic theorists,\nneoliberals do not see democracy as involving a social ethos or\nnational culture, nor do they see democracy as an expression of\nfreedom in itself. As Hayek (1979: 5) notes, “democracy itself\nis not freedom”. Friedman insists that freedom is to be\nunderstood negatively, such that the political process is understood\nas restricting freedom and perhaps protecting it, but not as embodying\nit. Buchanan also criticizes what he regarded as an essentially\n“romantic” view of democracy according to which the will\nof the people is expressed in the actions of a democratic\ngovernment.\n\nNotably, neoliberals spend far more time arguing for limits on\ndemocracy than arguing for democracy itself. This is partly because,\nsince fascism was defeated, the goodness of democracy has been taken\nfor granted by both neoliberals and their interlocutors. Hayek,\nFriedman, and Buchanan instead focus on criticizing\n“unlimited” democracy. Hayek (1944 [2007: 111–2]) is\nworried that an unlimited democracy could undermine the rule of law\nand create tyranny. The powers of any “temporary majority”\nhave to be limited, he says (1960 [2011: 106]). Unlimited power is\n“the fatal defect of the prevailing form of democracy” and\nis based on the erroneous premise that all law “emanate[s] from\nlegislatures” (1979: 3–4). Another problem for unlimited\ndemocracy is that democratic assemblies will take on more power that\nthey can wield effectively and so will be forced to\n\n\nhand [authority] over to the administrators charged with the\nachievement of particular goals. (1960 [2011: 116])\n\n\nIn an unlimited democracy\n\n\nthe holders of discretionary powers are forced to use them, whether\nthey wish it or not, to favour particular groups on whose swing-vote\ntheir powers depend. (1979: 139)\n\n\nThe point of the third volume of Law, Legislation, and\nLiberty was arguably to restore faith in democracy by defending\nlimitations upon it.\n\nFriedman (1962b [2017: 26]) echoes many of these points, stressing\nthat political freedom is just “the absence of coercion of a man\nby his fellow men” and that the fundamental threat to freedom\n“is the power to coerce” whether that power be in the\nhands of a dictator or of “a momentary majority”. Friedman\nalso worries that democracy will tend to lead to regulation,\ninefficiency, and control if we have “bureaucratic\ndemocracy” rather than “participatory\n democracy”.[8]\n\nBuchanan’s (1962: 131–146) rationale for constitutional\nconstraints on democracy is richer and more perceptive than\nHayek’s or Friedman’s. His contract theory is devoted to\narguing that simple majority rule can lead to a variety of problems,\nmost centrally the risks of shifting coalitions of voters or\nlegislators redistributing wealth away from one another, leading to\nPareto-inferior outcomes for all. Another problem with unlimited\ndemocracy is that\n\n\neven under the most favorable conditions the operation of the\ndemocratic process may generate budgetary excesses. Democracy may\nbecome its own Leviathan unless constitutional limits are imposed and\nenforced. (Buchanan 1975: 204–5)\n\n\nLimitations on democracy are also required by political equality\nitself, since the “tyranny of the majority” is a threat to\nthe minority’s equal rights, and can be especially dangerous\n“because it feeds on the idealistic illusion that participation\nis all that matters (Buchanan 1993: 259). Consequently, Buchanan\n(1999: 75–88) advocates exit mechanisms, such as federalist\narrangements, that allow people to escape excessive democracy.\n\nFour caveats before the section ends: First, despite their concerns\nabout unlimited democracy, neoliberals want to protect democratic\nrights. One problem they have with expansive states is that large\nstates reduce the effectiveness of each person’s vote. This is\nbecause large governments cannot balance their many tasks and cannot\nsecure agreement on top priorities. The result, Hayek argues, will be\ndemocratic instability, leading to dictatorship. In contrast to more\negalitarian liberals, neoliberals do not attempt to engineer the\ndemocratic process through democratic deliberation. They instead hope\nto protect democratic rights by adopting constitutional constraints\nlater in the democratic process, for example by restricting the power\nto legislate. Second, while neoliberals support restrictions on\ndemocracy, they strongly favor decentralizing of political power and\nensuring that power is held by all and they are committed to\nprotections from governmental and corporate predation and domination.\nAs Friedman notes,\n\n\nBusiness corporations are not a defense of free enterprise. On the\ncontrary, they are one of the chief sources of danger. (Burgin 2012:\n202)\n\n\nThey simply disagree with egalitarian liberals about how to ensure\nthis institutionally. As noted above, neoliberals stress designing\ninstitutions so that corrupt and domineering institutions cannot form,\nwithin or outside government, such as using markets. But they also\nappeal to constitutional mechanisms like supermajority rules (Buchanan\n& Tullock 1962) and federalism (Feld 2014) to limit oppression and\ncorruption. Thus, neoliberals are deeply concerned that people be\nprotected from excessive political control, but they do not emphasize\npublic deliberation is central to securing those ends. We might say\nthey prefer “exit” mechanisms over “voice”\nmechanisms for restraining the use of political power (Hirschman\n1970). Third, neoliberals are not alone in advocating constitutional\nlimits on democracy, even though most democratic theorists on the left\nplace fewer limitations on democracy than neoliberals do.\n\nFinally, historians of political thought have drawn attention to the\nfact that the neoliberals discussed here were sometimes associated\nwith the dictatorship of Augusto Pinochet in Chile. But Buchanan\n(Farrant & Tarko 2018) and Friedman (Burgin 2012: 205) have at\nbest a scant connection with that regime and were critical of it.\nUnfortunately, Hayek is another story. Hayek had a partial theory of\n“transitional dictatorship” that allowed a liberal\ndictator to avoid socialist outcomes and transition a society into a\nliberal democracy, and this helps explain some favorable remarks he\nmade on behalf of the Pinochet regime (Farrant, McPhail, & Berger\n2012; Biebricher 2018: 142–7; Slobodian 2018: 277).\nHayek’s support for the regime does not undermine the democratic\ncommitments of neoliberals, but Hayek was arguably too suspicious of\ndemocracy. We can see the dangers in sharply separating liberalism\nfrom democracy, which tempts one to choose liberal dictatorship over\ndemocratic socialism.\n",
    "section_title": "5. Democracy",
    "entry_title": "Neoliberalism",
    "hierarchy_title": "Neoliberalism || Democracy",
    "tokenized_text": [
        "democracy",
        "democracy",
        "neoliberal",
        "embrace",
        "democracy",
        "specifically",
        "endorse",
        "equal",
        "right",
        "vote",
        "participate",
        "election",
        "support",
        "parliamentary",
        "democracy",
        "mean",
        "enacting",
        "legislation",
        "hayek",
        "say",
        "profoundly",
        "believe",
        "basic",
        "principle",
        "democracy",
        "effective",
        "method",
        "yet",
        "discovered",
        "making",
        "peaceful",
        "change",
        "possible",
        "xiii",
        "claim",
        "concerned",
        "disillusionment",
        "democracy",
        "desirable",
        "method",
        "government",
        "hayek",
        "market",
        "system",
        "must",
        "embedded",
        "set",
        "social",
        "institution",
        "work",
        "includes",
        "democratic",
        "polity",
        "subject",
        "rule",
        "law",
        "caldwell",
        "point",
        "road",
        "serfdom",
        "argue",
        "liberal",
        "democratic",
        "socialism",
        "unstable",
        "socialism",
        "must",
        "cease",
        "democratic",
        "cease",
        "socialism",
        "attempt",
        "plan",
        "economy",
        "would",
        "destroy",
        "liberal",
        "right",
        "would",
        "inevitably",
        "destroy",
        "democracy",
        "hayek",
        "case",
        "democracy",
        "tends",
        "instrumentalist",
        "argues",
        "true",
        "value",
        "democracy",
        "serve",
        "sanitary",
        "precaution",
        "protecting",
        "u",
        "abuse",
        "power",
        "enables",
        "u",
        "get",
        "rid",
        "government",
        "try",
        "replace",
        "better",
        "one",
        "also",
        "one",
        "important",
        "safeguard",
        "freedom",
        "yet",
        "hayek",
        "think",
        "recognizing",
        "person",
        "equal",
        "requires",
        "equality",
        "law",
        "demand",
        "men",
        "also",
        "share",
        "making",
        "law",
        "even",
        "democracy",
        "mean",
        "rather",
        "end",
        "need",
        "limit",
        "commitment",
        "shared",
        "member",
        "mont",
        "pelerin",
        "society",
        "hayek",
        "organized",
        "angus",
        "burgin",
        "argues",
        "assumed",
        "relationship",
        "free",
        "market",
        "democratic",
        "politics",
        "pervaded",
        "society",
        "discussion",
        "throughout",
        "first",
        "decade",
        "existence",
        "provided",
        "foundational",
        "premise",
        "many",
        "member",
        "contribution",
        "debate",
        "friedman",
        "routinely",
        "defends",
        "free",
        "market",
        "ground",
        "contribute",
        "political",
        "freedom",
        "democracy",
        "freedom",
        "inseparable",
        "butler",
        "friedman",
        "a",
        "often",
        "say",
        "know",
        "example",
        "time",
        "place",
        "society",
        "marked",
        "large",
        "measure",
        "political",
        "freedom",
        "also",
        "used",
        "something",
        "comparable",
        "free",
        "market",
        "organize",
        "bulk",
        "economic",
        "activity",
        "appears",
        "think",
        "democracy",
        "great",
        "good",
        "led",
        "guess",
        "reason",
        "one",
        "could",
        "argue",
        "friedman",
        "case",
        "democracy",
        "largely",
        "protects",
        "liberty",
        "allows",
        "bad",
        "government",
        "peacefully",
        "replaced",
        "little",
        "corpus",
        "speaks",
        "question",
        "one",
        "way",
        "another",
        "buchanan",
        "democratic",
        "three",
        "agrees",
        "democracy",
        "essential",
        "social",
        "peace",
        "prosperity",
        "emphasizes",
        "political",
        "equality",
        "requires",
        "government",
        "based",
        "consent",
        "people",
        "democracy",
        "extension",
        "individualism",
        "approach",
        "must",
        "democratic",
        "sense",
        "merely",
        "variant",
        "definitional",
        "norm",
        "individualism",
        "man",
        "count",
        "one",
        "buchanan",
        "buchanan",
        "insists",
        "unanimous",
        "consent",
        "constitutional",
        "rule",
        "strikingly",
        "among",
        "nonideal",
        "person",
        "think",
        "constitution",
        "may",
        "allow",
        "decisionmaking",
        "rule",
        "weaker",
        "unanimity",
        "majority",
        "rule",
        "true",
        "buchanan",
        "buchanan",
        "tullock",
        "argues",
        "legislative",
        "rule",
        "supermajoritarian",
        "rather",
        "majoritarian",
        "still",
        "embrace",
        "democracy",
        "especially",
        "undergirded",
        "consent",
        "people",
        "whole",
        "however",
        "unlike",
        "many",
        "classical",
        "contemporary",
        "democratic",
        "theorist",
        "neoliberal",
        "see",
        "democracy",
        "involving",
        "social",
        "ethos",
        "national",
        "culture",
        "see",
        "democracy",
        "expression",
        "freedom",
        "hayek",
        "note",
        "democracy",
        "freedom",
        "friedman",
        "insists",
        "freedom",
        "understood",
        "negatively",
        "political",
        "process",
        "understood",
        "restricting",
        "freedom",
        "perhaps",
        "protecting",
        "embodying",
        "buchanan",
        "also",
        "criticizes",
        "regarded",
        "essentially",
        "romantic",
        "view",
        "democracy",
        "according",
        "people",
        "expressed",
        "action",
        "democratic",
        "government",
        "notably",
        "neoliberal",
        "spend",
        "far",
        "time",
        "arguing",
        "limit",
        "democracy",
        "arguing",
        "democracy",
        "partly",
        "since",
        "fascism",
        "defeated",
        "goodness",
        "democracy",
        "taken",
        "granted",
        "neoliberal",
        "interlocutor",
        "hayek",
        "friedman",
        "buchanan",
        "instead",
        "focus",
        "criticizing",
        "unlimited",
        "democracy",
        "hayek",
        "worried",
        "unlimited",
        "democracy",
        "could",
        "undermine",
        "rule",
        "law",
        "create",
        "tyranny",
        "power",
        "temporary",
        "majority",
        "limited",
        "say",
        "unlimited",
        "power",
        "fatal",
        "defect",
        "prevailing",
        "form",
        "democracy",
        "based",
        "erroneous",
        "premise",
        "law",
        "emanate",
        "legislature",
        "another",
        "problem",
        "unlimited",
        "democracy",
        "democratic",
        "assembly",
        "take",
        "power",
        "wield",
        "effectively",
        "forced",
        "hand",
        "authority",
        "administrator",
        "charged",
        "achievement",
        "particular",
        "goal",
        "unlimited",
        "democracy",
        "holder",
        "discretionary",
        "power",
        "forced",
        "use",
        "whether",
        "wish",
        "favour",
        "particular",
        "group",
        "whose",
        "swingvote",
        "power",
        "depend",
        "point",
        "third",
        "volume",
        "law",
        "legislation",
        "liberty",
        "arguably",
        "restore",
        "faith",
        "democracy",
        "defending",
        "limitation",
        "upon",
        "friedman",
        "b",
        "echo",
        "many",
        "point",
        "stressing",
        "political",
        "freedom",
        "absence",
        "coercion",
        "man",
        "fellow",
        "men",
        "fundamental",
        "threat",
        "freedom",
        "power",
        "coerce",
        "whether",
        "power",
        "hand",
        "dictator",
        "momentary",
        "majority",
        "friedman",
        "also",
        "worry",
        "democracy",
        "tend",
        "lead",
        "regulation",
        "inefficiency",
        "control",
        "bureaucratic",
        "democracy",
        "rather",
        "participatory",
        "democracy",
        "buchanan",
        "rationale",
        "constitutional",
        "constraint",
        "democracy",
        "richer",
        "perceptive",
        "hayek",
        "friedman",
        "contract",
        "theory",
        "devoted",
        "arguing",
        "simple",
        "majority",
        "rule",
        "lead",
        "variety",
        "problem",
        "centrally",
        "risk",
        "shifting",
        "coalition",
        "voter",
        "legislator",
        "redistributing",
        "wealth",
        "away",
        "one",
        "another",
        "leading",
        "paretoinferior",
        "outcome",
        "another",
        "problem",
        "unlimited",
        "democracy",
        "even",
        "favorable",
        "condition",
        "operation",
        "democratic",
        "process",
        "may",
        "generate",
        "budgetary",
        "excess",
        "democracy",
        "may",
        "become",
        "leviathan",
        "unless",
        "constitutional",
        "limit",
        "imposed",
        "enforced",
        "buchanan",
        "limitation",
        "democracy",
        "also",
        "required",
        "political",
        "equality",
        "since",
        "tyranny",
        "majority",
        "threat",
        "minority",
        "equal",
        "right",
        "especially",
        "dangerous",
        "feed",
        "idealistic",
        "illusion",
        "participation",
        "matter",
        "buchanan",
        "consequently",
        "buchanan",
        "advocate",
        "exit",
        "mechanism",
        "federalist",
        "arrangement",
        "allow",
        "people",
        "escape",
        "excessive",
        "democracy",
        "four",
        "caveat",
        "section",
        "end",
        "first",
        "despite",
        "concern",
        "unlimited",
        "democracy",
        "neoliberal",
        "want",
        "protect",
        "democratic",
        "right",
        "one",
        "problem",
        "expansive",
        "state",
        "large",
        "state",
        "reduce",
        "effectiveness",
        "person",
        "vote",
        "large",
        "government",
        "balance",
        "many",
        "task",
        "secure",
        "agreement",
        "top",
        "priority",
        "result",
        "hayek",
        "argues",
        "democratic",
        "instability",
        "leading",
        "dictatorship",
        "contrast",
        "egalitarian",
        "liberal",
        "neoliberal",
        "attempt",
        "engineer",
        "democratic",
        "process",
        "democratic",
        "deliberation",
        "instead",
        "hope",
        "protect",
        "democratic",
        "right",
        "adopting",
        "constitutional",
        "constraint",
        "later",
        "democratic",
        "process",
        "example",
        "restricting",
        "power",
        "legislate",
        "second",
        "neoliberal",
        "support",
        "restriction",
        "democracy",
        "strongly",
        "favor",
        "decentralizing",
        "political",
        "power",
        "ensuring",
        "power",
        "held",
        "committed",
        "protection",
        "governmental",
        "corporate",
        "predation",
        "domination",
        "friedman",
        "note",
        "business",
        "corporation",
        "defense",
        "free",
        "enterprise",
        "contrary",
        "one",
        "chief",
        "source",
        "danger",
        "burgin",
        "simply",
        "disagree",
        "egalitarian",
        "liberal",
        "ensure",
        "institutionally",
        "noted",
        "neoliberal",
        "stress",
        "designing",
        "institution",
        "corrupt",
        "domineering",
        "institution",
        "form",
        "within",
        "outside",
        "government",
        "using",
        "market",
        "also",
        "appeal",
        "constitutional",
        "mechanism",
        "like",
        "supermajority",
        "rule",
        "buchanan",
        "tullock",
        "federalism",
        "feld",
        "limit",
        "oppression",
        "corruption",
        "thus",
        "neoliberal",
        "deeply",
        "concerned",
        "people",
        "protected",
        "excessive",
        "political",
        "control",
        "emphasize",
        "public",
        "deliberation",
        "central",
        "securing",
        "end",
        "might",
        "say",
        "prefer",
        "exit",
        "mechanism",
        "voice",
        "mechanism",
        "restraining",
        "use",
        "political",
        "power",
        "hirschman",
        "third",
        "neoliberal",
        "alone",
        "advocating",
        "constitutional",
        "limit",
        "democracy",
        "even",
        "though",
        "democratic",
        "theorist",
        "left",
        "place",
        "fewer",
        "limitation",
        "democracy",
        "neoliberal",
        "finally",
        "historian",
        "political",
        "thought",
        "drawn",
        "attention",
        "fact",
        "neoliberal",
        "discussed",
        "sometimes",
        "associated",
        "dictatorship",
        "augusto",
        "pinochet",
        "chile",
        "buchanan",
        "farrant",
        "tarko",
        "friedman",
        "burgin",
        "best",
        "scant",
        "connection",
        "regime",
        "critical",
        "unfortunately",
        "hayek",
        "another",
        "story",
        "hayek",
        "partial",
        "theory",
        "transitional",
        "dictatorship",
        "allowed",
        "liberal",
        "dictator",
        "avoid",
        "socialist",
        "outcome",
        "transition",
        "society",
        "liberal",
        "democracy",
        "help",
        "explain",
        "favorable",
        "remark",
        "made",
        "behalf",
        "pinochet",
        "regime",
        "farrant",
        "mcphail",
        "berger",
        "biebricher",
        "slobodian",
        "hayek",
        "support",
        "regime",
        "undermine",
        "democratic",
        "commitment",
        "neoliberal",
        "hayek",
        "arguably",
        "suspicious",
        "democracy",
        "see",
        "danger",
        "sharply",
        "separating",
        "liberalism",
        "democracy",
        "tempts",
        "one",
        "choose",
        "liberal",
        "dictatorship",
        "democratic",
        "socialism"
    ]
}