{
    "main_text": "From economic theory to scientific epistemology\n2. From economic theory to scientific epistemology\n\nDuring the Vienna Circle years, Neurath introduced in the new context\nviews which he developed and generalized from his earlier social\ntheory, only now in terms of the debates on scientific epistemology\nthat came to characterize logical empiricism: (1) a notion of\ntheorizing in natural and social sciences, including history, based on\nthe exploration of combinatorial possibilities and models; (2) the\nlogical under-determination and conventional and pragmatic aspect of\ndecision-making in the methodology of evaluation and choice of data\nand hypotheses; (3) the social, cooperative dimension of scientific\nresearch (‘the republic of scientists’); and, connectedly,\n(4) an argument for a holistic approach to scientific knowledge in the\nform of unified science as a tool for successful prediction and\nengineering (mechanical, electrical and social) of events and their\nevolution in a world understood as a complex of factors (Cat et\nal. 1991 and 1996)—where an alternative model of\nunification would replace the standard set by the reductive, precise\nand abstract monetary units of the market model (Nemeth 1991).\n\nThis engineering value of unity applied equally to political\ngovernance and scientific action, since both are collective and\npragmatic endeavors. According to Neurath, ‘scientific theories\nare sociological events’ (Neurath 1932a/1983, 88), and, since\n‘our thinking is a tool’, in this case the ‘modern\nscientific world-conception’ aims to ‘create a unified\nscience that can successfully serve all transforming activity’\n(Neurath 1930/1983, 42). In both cases, Neurath noted, ‘common\nplanned action is possible only if the participants make common\npredictions’ and group predictions yield more reliable results;\ntherefore, he concluded, ‘common action presses us toward\nunified science’ (Neurath 1931/1973, 407). Indeed, all along,\nfor Neurath scientific attitude and solidarity (and socialism) go\ntogether (Neurath 1928/1973, 252).\n\nDuring the 1910s Neurath engaged the intellectual issues of holism and\nconventionalism raised both by the models of economies in kind\n—the Balkan war economies and socialization of the Bavarian\neconomy—and by Duhem’s philosophy of scientific testing.\nNot surprisingly, his intellectual attitude led him to the recurrent\ndismissal of the myth of the fundamental epistemological and political\nvalue of isolated statements (hypotheses) and isolated individuals\n(citizens, scholars). The problem of unity of the sciences would\nbecome another problem of coordination and cooperation, social and\nintellectual (see above), of scholars and statements, and Neurath\npresented it in just those terms (Neurath 1936/1983).\n\nNeurath developed and generalized his early practical, theoretical and\nmeta-theoretical concerns about social theory (with his talk of a\n‘universal science’ in 1910, a ‘unified construction\nof economic science’ in 1917 and a ‘unified program’\nfor socialization in 1919) as a philosophy of the human sciences.\nThese included psychology and sociology, which he treated in contrast\nwith the natural sciences. His study of the foundations of the social\nsciences extended to import normative constraints set by logical\nempiricism, e.g., the emphasis on foundations and the logical and\nempiricist considerations with respect to physicalism. This\ncontribution determined his qualifications to ideals of unity of the\nsciences, especially involving the relation between the natural and\nthe human sciences, and to ideals of shared scientific\nmethodology.\n\nThe new framework for philosophy, and meta-theory, was characterized\nby an anti-metaphysical attitude towards linguistic and otherwise\nformal, rather than material, entities. For Neurath, social theory\npoints not only to the contingent historical and social nature of\nlanguage; it also points to a more naturalistic attitude towards\nlanguage—and knowledge—in connection with its social roots\nand uses. As a result, his early considerations of social theory and\nvalues yielded a model of language of theory and observation that were\nmeant to do justice to the social and voluntaristic dimensions of\nunity, rationality, and objectivity in the language and methodology of\nthe sciences. Next, in the rest of this section, I provide details of\nthe connection I have indicated. \n\nIn the early 1930s Neurath would point to weakness and incompleteness\nof the logical and linguistic relations between different kinds of\nscientific statements—mainly due to the unavoidable presence of\nvague cluster-concepts, or congestions (Ballungen). They\nconsisted in linguistic manifestation of the ineliminable social,\neveryday, non-theoretical vague elements of language and of the\nintrinsic complexity of the world discussed in the German metaphysical\nliterature and the later socialist debates (Cat 1995 and Cartwright\net al. 1996). Since then his notion of unity is phrased in\nterms of an anti-reductionistic and\nanti-systematic—anti-axiomatic—‘encyclopedia\nmodel’, by establishing cross-connections among disciplines, as\nin a Crusonian archipelago: a ‘great, rather badly coordinated\nmass of statements’ in which at best ‘systems develop like\nlittle islands, which we must try to enlarge’ (Neurath\n1936/1983, 153).\n\nThe connection between the arguments and positions in 1930s scientific\nepistemology or philosophy of science and the arguments in the debates\nin the history of economics points to a kind of unity and continuity\nin Neurath’s thinking in which specific claims in epistemology\nand social thought are historically as well as conceptually connected.\nThis unity is moreover an instance of Neurath’s persistent\nviews: his pragmatic and conventionalist epistemology and his view of\nthe unity of science.\n\nThe historical and conceptual link is suggested by two elements that\nappear in Neurath’s arguments. One is the notion of control, the\nother is the reference to the scenario illustrated by the fiction of\nRobinson Crusoe. They are both a common feature of discussions of\ncentral planning. In Neurath’s writings on that subject they\nappear together at least once, in 1935 in his essay ‘What is\nMeant by a Rational Economic Theory?’ There, Neurath protests\nthat\n\n\n’quite a few political economists advocate the thesis that a\nRobinson Crusoe—or what amounts to the same thing, a controlled\neconomy—calculates in terms of profits and losses.’\n(Neurath 1935/1987, 95)\n\n\nThe two references appear also in the formulations of his private\nlanguage argument, this time with epistemological meaning. A reference\nto controlling and an indirect mention of Crusoe appear in 1931 in his\nessay ‘Physicalism’ and an explicit reference to Crusoe\nappears in 1932 in ‘On Protocol Statements’. Thus in\n‘Physicalism’ Neurath put the argument as follows:\n\n\nCarnap…distinguished two languages: a\n‘monologizing’ one (phenomenalist) and an\n‘intersubjective’ (physicalist) one. (…) only one\nlanguage comes into question from the start, and that is the\nphysicalist. One can learn the physicalist language from earliest\nchildhood. If someone makes predictions and wants to check them\nhimself, he must count on changes in the system of his senses, he must\nuse clocks and rulers, in short, the person supposedly in isolation\nalready makes use of the ‘intersensual’ and\n‘intersubjective’ language. The forecaster of yesterday\nand the controller of today are, so to speak, two persons. (Neurath\n1931/1983, 54–55)\n\n\nIn ‘On Protocol Statements’ Neurath refers to Robinson\nCrusoe explicitly:\n\n\nThe universal jargon…is the same for the child and for the\nadult. It is the same for a Robinson Crusoe as for a human society. If\nRobinson wants to join what is in a protocol of yesterday with what is\nin his protocol today, that is, if he wants to make use of language at\nall, he must make use of the ‘intersubjective’ language.\nThe Robinson of yesterday and the Robinson of today stand precisely in\nthe same relation in which Robinson stands to Friday…In other\nwords, every language as such is intersubjective. (Neurath 1932b/1983,\n96)\n\n\nObjectivity features prominently in the private language argument.\nBoth Neurath’s argument and Wittgenstein’s earlier one are\nlaid out for the case of an individual epistemic agent understanding\nhimself before he needs to understand others (Uebel 1995b). For both,\nthe constancy and consistency of language use is paramount. It can\nonly be ensured by an intersubjective, that is, objective and social,\nlanguage, namely the language of physicalism, about\n‘spatio-temporal structures’. For Wittgenstein, especially\nin the Philosophical Investigations, the social dimension of\nlanguage is a key element of its extrinsic character and therefore its\nproper justification, the normative condition of possibility and\nintelligibility of success, and likewise for the more general case of\nrule-following. The scope of Neurath’s argument is more\nparticularly directed to the case of scientific language in the\nscientific community.\n\nThe notion of private language argument is typically associated with\nthe later argument by Wittgenstein in Philosophical\nInvestigations to the effect that a private language is logically\nimpossible for an individual to use consistently and for others to\nunderstand. By private language, Wittgenstein means a language with\nwords whose meaning is essentially constituted by and for the inner\nexperience or individual consciousness of a subject. In a previous\nversion from 1929 (see the Bergen electronic edition), Wittgenstein\nrefers to the primacy of our public everyday language about physical\nthings over a language of immediate sensations. In the 1951 version\n(2009, 203, 242ff) such language is impossible to coherently make\nsense of, the language is being shown to be dependent on the public\nsocial institutions of language-games and their rules as embedded in\nactual forms of life. A private language would be a language which\ncould be generated wholly through individual acts of unsharable\nself-consciousness and understood, in principle, only by that\nindividual speaker, by means of his or her self-consciousness. This is\nan incoherent notion. \n\nTo follow a rule privately means to assume that thinking that one is\nfollowing a rule is the same as following it (Philosophical\nInvestigations, art. 202). But this assumption is based on a\nsubjective internal notion of justification, dependent on intrinsic\nindividual consciousness. And this is incorrect. For according to\nWittgenstein ‘justification consists in appealing to something\nindependent’ (ibid., art. 265). The independence is\nprovided by a notion of language use and rule following with\nreference, actual or potential, to membership in a wider external\ncommunity and to intersubjective, that is, public and social,\ninteraction.\n\nFor Wittgenstein as well the external, pragmatic and independent\nnotion of calculation and rule following applies to the circulation of\nmoney as economic practice. In Wittgenstein’s own words:\n\n\nWhy can’t the right hand give my left hand money? My right hand\ncan put it into my left hand. My right hand can write a deed of gift\nand my left hand a receipt. But the further practical consequences\nwould not be those of a gift. When the left hand has taken money from\nthe right, etc., we shall ask, “Well, what of it?”\n(ibid., art. 268)\n\n\nThis intersubjective or objective constraint provides a normative,\neven if conventional, distinction between consistent and inconsistent\nlanguage use, or between correct and incorrect rule following. Kripke\nand David Bloor correctly point out that this condition is not\nincompatible with Robinson Crusoe’s physical isolation (Kripke\n1989, 112, n. 89; Bloor 1997). Now we can see the point of\nKripke’s analogy between the impossibility of a private language\nand the impossibility of central planning. If, as in Mises’s\nargument, an economic agent has no extrinsic range of intersubjective\nand commensurable values—that is, the numerical market prices\nwhich are set independently by others—, then he has no rational\nand objective justification for choosing between alternative courses\nof action. Here exact numerical commensurability and explicit\ncalculation rules are the basis for both objectivity and rationality.\nIn contrast with Kripke’s analogy there is a strong opposing\nanalogy between Neurath’s argument against private language and\nhis defense of central planning. The analogy, as explained in\nconnection with Neurath’s position towards Mises, above, reveals\na common set of values that are coherent yet different from the ones\ninvolved in Mises’s argument.\n\nThe issue of the connection between social models of society and\nscientific methodology might have been encouraged by the social and\npolitical turmoils of the first half of the twentieth century.\nNeurath’s case was not unique. The issue persists in the works\nof Neurath’s contemporaries, the philosophers of science Michael\nPolanyi (1958) and Karl Popper (1950, 1957). Their epistemology of\nscience is also radically social and linked to political and economic\nthought. A recurring thought experiment that provides guidance through\nthese discussions is the story of Robinson Crusoe.\n",
    "section_title": "2. From economic theory to scientific epistemology",
    "entry_title": "Otto Neurath",
    "hierarchy_title": "Otto Neurath || From economic theory to scientific epistemology",
    "tokenized_text": [
        "economic",
        "theory",
        "scientific",
        "epistemology",
        "economic",
        "theory",
        "scientific",
        "epistemology",
        "vienna",
        "circle",
        "year",
        "neurath",
        "introduced",
        "new",
        "context",
        "view",
        "developed",
        "generalized",
        "earlier",
        "social",
        "theory",
        "term",
        "debate",
        "scientific",
        "epistemology",
        "came",
        "characterize",
        "logical",
        "empiricism",
        "notion",
        "theorizing",
        "natural",
        "social",
        "science",
        "including",
        "history",
        "based",
        "exploration",
        "combinatorial",
        "possibility",
        "model",
        "logical",
        "underdetermination",
        "conventional",
        "pragmatic",
        "aspect",
        "decisionmaking",
        "methodology",
        "evaluation",
        "choice",
        "data",
        "hypothesis",
        "social",
        "cooperative",
        "dimension",
        "scientific",
        "research",
        "republic",
        "scientist",
        "connectedly",
        "argument",
        "holistic",
        "approach",
        "scientific",
        "knowledge",
        "form",
        "unified",
        "science",
        "tool",
        "successful",
        "prediction",
        "engineering",
        "mechanical",
        "electrical",
        "social",
        "event",
        "evolution",
        "world",
        "understood",
        "complex",
        "factor",
        "cat",
        "et",
        "al",
        "where",
        "alternative",
        "model",
        "unification",
        "would",
        "replace",
        "standard",
        "set",
        "reductive",
        "precise",
        "abstract",
        "monetary",
        "unit",
        "market",
        "model",
        "nemeth",
        "engineering",
        "value",
        "unity",
        "applied",
        "equally",
        "political",
        "governance",
        "scientific",
        "action",
        "since",
        "collective",
        "pragmatic",
        "endeavor",
        "according",
        "neurath",
        "scientific",
        "theory",
        "sociological",
        "event",
        "neurath",
        "a",
        "since",
        "thinking",
        "tool",
        "case",
        "modern",
        "scientific",
        "worldconception",
        "aim",
        "create",
        "unified",
        "science",
        "successfully",
        "serve",
        "transforming",
        "activity",
        "neurath",
        "case",
        "neurath",
        "noted",
        "common",
        "planned",
        "action",
        "possible",
        "participant",
        "make",
        "common",
        "prediction",
        "group",
        "prediction",
        "yield",
        "reliable",
        "result",
        "therefore",
        "concluded",
        "common",
        "action",
        "press",
        "u",
        "toward",
        "unified",
        "science",
        "neurath",
        "indeed",
        "along",
        "neurath",
        "scientific",
        "attitude",
        "solidarity",
        "socialism",
        "go",
        "together",
        "neurath",
        "s",
        "neurath",
        "engaged",
        "intellectual",
        "issue",
        "holism",
        "conventionalism",
        "raised",
        "model",
        "economy",
        "kind",
        "the",
        "balkan",
        "war",
        "economy",
        "socialization",
        "bavarian",
        "economyand",
        "duhem",
        "philosophy",
        "scientific",
        "testing",
        "surprisingly",
        "intellectual",
        "attitude",
        "led",
        "recurrent",
        "dismissal",
        "myth",
        "fundamental",
        "epistemological",
        "political",
        "value",
        "isolated",
        "statement",
        "hypothesis",
        "isolated",
        "individual",
        "citizen",
        "scholar",
        "problem",
        "unity",
        "science",
        "would",
        "become",
        "another",
        "problem",
        "coordination",
        "cooperation",
        "social",
        "intellectual",
        "see",
        "scholar",
        "statement",
        "neurath",
        "presented",
        "term",
        "neurath",
        "neurath",
        "developed",
        "generalized",
        "early",
        "practical",
        "theoretical",
        "metatheoretical",
        "concern",
        "social",
        "theory",
        "talk",
        "universal",
        "science",
        "unified",
        "construction",
        "economic",
        "science",
        "unified",
        "program",
        "socialization",
        "philosophy",
        "human",
        "science",
        "included",
        "psychology",
        "sociology",
        "treated",
        "contrast",
        "natural",
        "science",
        "study",
        "foundation",
        "social",
        "science",
        "extended",
        "import",
        "normative",
        "constraint",
        "set",
        "logical",
        "empiricism",
        "eg",
        "emphasis",
        "foundation",
        "logical",
        "empiricist",
        "consideration",
        "respect",
        "physicalism",
        "contribution",
        "determined",
        "qualification",
        "ideal",
        "unity",
        "science",
        "especially",
        "involving",
        "relation",
        "natural",
        "human",
        "science",
        "ideal",
        "shared",
        "scientific",
        "methodology",
        "new",
        "framework",
        "philosophy",
        "metatheory",
        "characterized",
        "antimetaphysical",
        "attitude",
        "towards",
        "linguistic",
        "otherwise",
        "formal",
        "rather",
        "material",
        "entity",
        "neurath",
        "social",
        "theory",
        "point",
        "contingent",
        "historical",
        "social",
        "nature",
        "language",
        "also",
        "point",
        "naturalistic",
        "attitude",
        "towards",
        "languageand",
        "knowledgein",
        "connection",
        "social",
        "root",
        "us",
        "result",
        "early",
        "consideration",
        "social",
        "theory",
        "value",
        "yielded",
        "model",
        "language",
        "theory",
        "observation",
        "meant",
        "justice",
        "social",
        "voluntaristic",
        "dimension",
        "unity",
        "rationality",
        "objectivity",
        "language",
        "methodology",
        "science",
        "next",
        "rest",
        "section",
        "provide",
        "detail",
        "connection",
        "indicated",
        "early",
        "s",
        "neurath",
        "would",
        "point",
        "weakness",
        "incompleteness",
        "logical",
        "linguistic",
        "relation",
        "different",
        "kind",
        "scientific",
        "statementsmainly",
        "due",
        "unavoidable",
        "presence",
        "vague",
        "clusterconcepts",
        "congestion",
        "ballungen",
        "consisted",
        "linguistic",
        "manifestation",
        "ineliminable",
        "social",
        "everyday",
        "nontheoretical",
        "vague",
        "element",
        "language",
        "intrinsic",
        "complexity",
        "world",
        "discussed",
        "german",
        "metaphysical",
        "literature",
        "later",
        "socialist",
        "debate",
        "cat",
        "cartwright",
        "et",
        "al",
        "since",
        "notion",
        "unity",
        "phrased",
        "term",
        "antireductionistic",
        "antisystematicantiaxiomatic",
        "encyclopedia",
        "model",
        "establishing",
        "crossconnections",
        "among",
        "discipline",
        "crusonian",
        "archipelago",
        "great",
        "rather",
        "badly",
        "coordinated",
        "mass",
        "statement",
        "best",
        "system",
        "develop",
        "like",
        "little",
        "island",
        "must",
        "try",
        "enlarge",
        "neurath",
        "connection",
        "argument",
        "position",
        "s",
        "scientific",
        "epistemology",
        "philosophy",
        "science",
        "argument",
        "debate",
        "history",
        "economics",
        "point",
        "kind",
        "unity",
        "continuity",
        "neurath",
        "thinking",
        "specific",
        "claim",
        "epistemology",
        "social",
        "thought",
        "historically",
        "well",
        "conceptually",
        "connected",
        "unity",
        "moreover",
        "instance",
        "neurath",
        "persistent",
        "view",
        "pragmatic",
        "conventionalist",
        "epistemology",
        "view",
        "unity",
        "science",
        "historical",
        "conceptual",
        "link",
        "suggested",
        "two",
        "element",
        "appear",
        "neurath",
        "argument",
        "one",
        "notion",
        "control",
        "reference",
        "scenario",
        "illustrated",
        "fiction",
        "robinson",
        "crusoe",
        "common",
        "feature",
        "discussion",
        "central",
        "planning",
        "neurath",
        "writing",
        "subject",
        "appear",
        "together",
        "least",
        "essay",
        "meant",
        "rational",
        "economic",
        "theory",
        "neurath",
        "protest",
        "quite",
        "political",
        "economist",
        "advocate",
        "thesis",
        "robinson",
        "crusoeor",
        "amount",
        "thing",
        "controlled",
        "economycalculates",
        "term",
        "profit",
        "losses",
        "neurath",
        "two",
        "reference",
        "appear",
        "also",
        "formulation",
        "private",
        "language",
        "argument",
        "time",
        "epistemological",
        "meaning",
        "reference",
        "controlling",
        "indirect",
        "mention",
        "crusoe",
        "appear",
        "essay",
        "physicalism",
        "explicit",
        "reference",
        "crusoe",
        "appears",
        "protocol",
        "statement",
        "thus",
        "physicalism",
        "neurath",
        "put",
        "argument",
        "follows",
        "carnapdistinguished",
        "two",
        "language",
        "monologizing",
        "one",
        "phenomenalist",
        "intersubjective",
        "physicalist",
        "one",
        "one",
        "language",
        "come",
        "question",
        "start",
        "physicalist",
        "one",
        "learn",
        "physicalist",
        "language",
        "earliest",
        "childhood",
        "someone",
        "make",
        "prediction",
        "want",
        "check",
        "must",
        "count",
        "change",
        "system",
        "sens",
        "must",
        "use",
        "clock",
        "ruler",
        "short",
        "person",
        "supposedly",
        "isolation",
        "already",
        "make",
        "use",
        "intersensual",
        "intersubjective",
        "language",
        "forecaster",
        "yesterday",
        "controller",
        "today",
        "speak",
        "two",
        "person",
        "neurath",
        "protocol",
        "statement",
        "neurath",
        "refers",
        "robinson",
        "crusoe",
        "explicitly",
        "universal",
        "jargonis",
        "child",
        "adult",
        "robinson",
        "crusoe",
        "human",
        "society",
        "robinson",
        "want",
        "join",
        "protocol",
        "yesterday",
        "protocol",
        "today",
        "want",
        "make",
        "use",
        "language",
        "must",
        "make",
        "use",
        "intersubjective",
        "language",
        "robinson",
        "yesterday",
        "robinson",
        "today",
        "stand",
        "precisely",
        "relation",
        "robinson",
        "stand",
        "fridayin",
        "word",
        "every",
        "language",
        "intersubjective",
        "neurath",
        "b",
        "objectivity",
        "feature",
        "prominently",
        "private",
        "language",
        "argument",
        "neurath",
        "argument",
        "wittgenstein",
        "earlier",
        "one",
        "laid",
        "case",
        "individual",
        "epistemic",
        "agent",
        "understanding",
        "need",
        "understand",
        "others",
        "uebel",
        "b",
        "constancy",
        "consistency",
        "language",
        "use",
        "paramount",
        "ensured",
        "intersubjective",
        "objective",
        "social",
        "language",
        "namely",
        "language",
        "physicalism",
        "spatiotemporal",
        "structure",
        "wittgenstein",
        "especially",
        "philosophical",
        "investigation",
        "social",
        "dimension",
        "language",
        "key",
        "element",
        "extrinsic",
        "character",
        "therefore",
        "proper",
        "justification",
        "normative",
        "condition",
        "possibility",
        "intelligibility",
        "success",
        "likewise",
        "general",
        "case",
        "rulefollowing",
        "scope",
        "neurath",
        "argument",
        "particularly",
        "directed",
        "case",
        "scientific",
        "language",
        "scientific",
        "community",
        "notion",
        "private",
        "language",
        "argument",
        "typically",
        "associated",
        "later",
        "argument",
        "wittgenstein",
        "philosophical",
        "investigation",
        "effect",
        "private",
        "language",
        "logically",
        "impossible",
        "individual",
        "use",
        "consistently",
        "others",
        "understand",
        "private",
        "language",
        "wittgenstein",
        "mean",
        "language",
        "word",
        "whose",
        "meaning",
        "essentially",
        "constituted",
        "inner",
        "experience",
        "individual",
        "consciousness",
        "subject",
        "previous",
        "version",
        "see",
        "bergen",
        "electronic",
        "edition",
        "wittgenstein",
        "refers",
        "primacy",
        "public",
        "everyday",
        "language",
        "physical",
        "thing",
        "language",
        "immediate",
        "sensation",
        "version",
        "ff",
        "language",
        "impossible",
        "coherently",
        "make",
        "sense",
        "language",
        "shown",
        "dependent",
        "public",
        "social",
        "institution",
        "languagegames",
        "rule",
        "embedded",
        "actual",
        "form",
        "life",
        "private",
        "language",
        "would",
        "language",
        "could",
        "generated",
        "wholly",
        "individual",
        "act",
        "unsharable",
        "selfconsciousness",
        "understood",
        "principle",
        "individual",
        "speaker",
        "mean",
        "selfconsciousness",
        "incoherent",
        "notion",
        "follow",
        "rule",
        "privately",
        "mean",
        "assume",
        "thinking",
        "one",
        "following",
        "rule",
        "following",
        "philosophical",
        "investigation",
        "art",
        "assumption",
        "based",
        "subjective",
        "internal",
        "notion",
        "justification",
        "dependent",
        "intrinsic",
        "individual",
        "consciousness",
        "incorrect",
        "according",
        "wittgenstein",
        "justification",
        "consists",
        "appealing",
        "something",
        "independent",
        "ibid",
        "art",
        "independence",
        "provided",
        "notion",
        "language",
        "use",
        "rule",
        "following",
        "reference",
        "actual",
        "potential",
        "membership",
        "wider",
        "external",
        "community",
        "intersubjective",
        "public",
        "social",
        "interaction",
        "wittgenstein",
        "well",
        "external",
        "pragmatic",
        "independent",
        "notion",
        "calculation",
        "rule",
        "following",
        "applies",
        "circulation",
        "money",
        "economic",
        "practice",
        "wittgenstein",
        "word",
        "right",
        "hand",
        "give",
        "left",
        "hand",
        "money",
        "right",
        "hand",
        "put",
        "left",
        "hand",
        "right",
        "hand",
        "write",
        "deed",
        "gift",
        "left",
        "hand",
        "receipt",
        "practical",
        "consequence",
        "would",
        "gift",
        "left",
        "hand",
        "taken",
        "money",
        "right",
        "etc",
        "shall",
        "ask",
        "well",
        "ibid",
        "art",
        "intersubjective",
        "objective",
        "constraint",
        "provides",
        "normative",
        "even",
        "conventional",
        "distinction",
        "consistent",
        "inconsistent",
        "language",
        "use",
        "correct",
        "incorrect",
        "rule",
        "following",
        "kripke",
        "david",
        "bloor",
        "correctly",
        "point",
        "condition",
        "incompatible",
        "robinson",
        "crusoe",
        "physical",
        "isolation",
        "kripke",
        "n",
        "bloor",
        "see",
        "point",
        "kripke",
        "analogy",
        "impossibility",
        "private",
        "language",
        "impossibility",
        "central",
        "planning",
        "mi",
        "argument",
        "economic",
        "agent",
        "extrinsic",
        "range",
        "intersubjective",
        "commensurable",
        "valuesthat",
        "numerical",
        "market",
        "price",
        "set",
        "independently",
        "others",
        "rational",
        "objective",
        "justification",
        "choosing",
        "alternative",
        "course",
        "action",
        "exact",
        "numerical",
        "commensurability",
        "explicit",
        "calculation",
        "rule",
        "basis",
        "objectivity",
        "rationality",
        "contrast",
        "kripke",
        "analogy",
        "strong",
        "opposing",
        "analogy",
        "neurath",
        "argument",
        "private",
        "language",
        "defense",
        "central",
        "planning",
        "analogy",
        "explained",
        "connection",
        "neurath",
        "position",
        "towards",
        "mi",
        "reveals",
        "common",
        "set",
        "value",
        "coherent",
        "yet",
        "different",
        "one",
        "involved",
        "mi",
        "argument",
        "issue",
        "connection",
        "social",
        "model",
        "society",
        "scientific",
        "methodology",
        "might",
        "encouraged",
        "social",
        "political",
        "turmoil",
        "first",
        "half",
        "twentieth",
        "century",
        "neurath",
        "case",
        "unique",
        "issue",
        "persists",
        "work",
        "neurath",
        "contemporary",
        "philosopher",
        "science",
        "michael",
        "polanyi",
        "karl",
        "popper",
        "epistemology",
        "science",
        "also",
        "radically",
        "social",
        "linked",
        "political",
        "economic",
        "thought",
        "recurring",
        "thought",
        "experiment",
        "provides",
        "guidance",
        "discussion",
        "story",
        "robinson",
        "crusoe"
    ]
}