{
    "main_text": "Philosophy of psychology, education, and the social sciences || Philosophy of education\n5.2 Philosophy of education\n\nAs mentioned above, psychology and pedagogy were inseparable in\nVienna’s intellectual, scientific and political culture of the\n1920s. Glöckel’s school reform movement of 1922 onwards\nadvocated empirical research in pedagogy, it separated school from\nchurch and promoted social equality. Child welfare became a central\nconcern and attracted the pedagogical interest for intellectual and or\npolitical reasons of Popper, Wittgenstein and Neurath (on Popper see\nHacohen 2002; Wittgenstein see Bartley 1974 and Peters 2001). In their\npedagogical activities one can find the roots of some of their\nepistemological views. Popper and Wittgenstein became school-teachers\nand Wittgenstein even published in 1925 a spelling dictionary,\nWörterbuch für Volksschullen. Lili Roubiczek, a\nstudent of Maria Montessori in London and Karl Bühler in Vienna\nestablished a Montessori school in 1923 and soon Montessori ideas\nattracted educators and psychologists alike (from Charlotte\nBühler to Anna Freud) (Kramer 1988). Montessori stressed the idea\nof the child’s capacity for active self-directed learning\nthrough sensory and motor interaction with the environment with\nguidance and error-correcting feedback. Gestalt psychologists,\npsychoanalysts and others defended similarly active models of the\nchild’s mind. \n\nIn 1927, after Vienna’s city council had unified the\npsychological and pedagogical institutes into a Pedagogic Institute,\nPopper wrote his first thesis, ‘“Habit” and\n“Experience of Law” in Education’. There, he\njustified the scientific status of pedagogy on inductivist grounds.\nAnd he raised the fateful philosophical problems of the\n‘objective-scientific decidability of pedagogical\nproblems’ and ‘the delimitation of the empirical part of\npedagogy from its non-empirical part’ (ter Hark 2002, 88 and\nGattei 2004, 454). Selz’s holistic and functional notion of\n‘total task’, based on a psychological mechanism of trial\nand error would inspire Popper’s pedagogy as well as his\nscientific methodology. Moreover, his awareness of Montessori methods\nwas secured in the 1920s by his teaching education, his friendship\nwith a carpenter who made toys for a Montessori orphanage and turned\nhim to cabinet-making and the Montessori-inspired ‘Socratic\nmethod’ of his admired Kantian critical philosopher Leonard\nNelson (Hacohen 2000, 90 and 122).\n\nNeurath’s views on education, as did his scientific\nepistemology, integrated social, political, scientific and empiricist\nelements in a mutually reinforcing manner. Equally, his synthetic\nattitude integrated attention to different specific dimensions such as\nconceptual information, material, linguistic and graphic\nrepresentation, and cognitive and social attitudes, capacities,\nvalues, goals and institutions. The most influential example and\noutcome of his views were the development and application of ISOTYPE\nmethod of visual education (See the supplementary document\n Visual Education.).\n\nEducation involves argument and discussion. It is in\nthis sense dialogical. The term ‘argument’ was used by\nNeurath broadly, to include the case or point being made and\ncommunicated, both senses of demonstration. Neurath wrote that to\nargue requires one to distinguish between essentials and incidentals\n(Neurath 1945/1973, 239). So a visual argument is ‘a combination\nof verbal and visual aids leading to the essentials’\n(ibid., 240). \n\nUnder the aegis of the values of neutrality and universality that\ncharacterized his economic theory, social views and scientific\nepistemology, Neurath sought also the universal media of communication\nof knowledge: visual perception and scientific information. Science is\n‘the typical species of arguing which human beings of all\nnations, rich and poor, have in common’ (ibid., 229),\nallowing for discussions in any civilization, which other disciplines\nor discourses render local. As in the doctrines of the objective\n(intersubjective), universal, unifying value of observation language,\nNeurath claimed that simple visual representations were theoretically-\nand value-neutral, eliminating judgment, at least compared to verbal\nexpressions (and theoretical statements) (ibid., 234).\n\nThe interest in cognitive psychology, child psychology and child\nwelfare, and the anti-metaphysical and epistemological value of\nempiricism led him to defend the value of visual education. Quoting\nfrom the Victorian self-improvement author Samuel Smiles, he declared\nthat ‘all persons are more or less apt to learn through the eyes\nrather than the ear… especially the case in early youth, when\nthe eye is the chief inlet of knowledge’ (Neurath 1946, 100).\nThis approach was consistent with Montessori’s and other\ncontemporary educational theories as well as with scientific\neducation. He repeatedly pointed to another Victorian hero of his,\nBritain’s foremost experimental scientist and popular science\neducator, Michael Faraday, and his Course of Six Lectures\non the Chemical History of a Candle (1861), which was intended\nprimarily for children. Given the importance he placed on scientific\ninformation, also socially, the main challenge he routinely took up\nbecame the concretization of abstract information, especially the\nvisual communication of statistical information. More generally, he\nbelieved that visual education provided a unifying framework that\nbridged the gap between science and the humanities (Neurath 1945/1973,\n234). \n\nEducation requires simplification, that is, the empiricist\nnotion of abstraction in the face of the complexity of facts.\nTeaching requires knowing what to leave out, what counts as\nsuperfluous detail and accuracy: ‘he who knows best what to omit\nis the best teacher’ and so ‘to remember simplified\npictures is better than to forget accurate figures’ (Neurath\n1933/1973, 220 and 1945a, 440). The graphic, visual counterpart of\nthis point constitutes the basis for his design of ISOTYPE icons, by\nanalogy with the method of silhouettes, so popular in Austrian art, as\na form of visual abstraction for the communication of information\nabout types or general concepts. The approach was consistent with the\nempiricist anti-metaphysical spirit and Bauhaus and modernist\naesthetic of the rejection of ornament famously advocated by the\nViennese architect Adolf Loos in Ornament and Crime (1908)\nalso echoed by Neurath in 1926: ‘the time of ornaments is\nover’ (recounted by Ernst Niekisch in Neurath 1973, 22).\n\nReinforced by the Viennese School Reform movement led by Glöckel,\nhis scientific attitude, and the philosophy of logical empiricism, was\nthe scientific and empirical attitude towards models of education.\nThis applied to the methods and tools of visual education in two ways:\nby applying accepted recent ideas from empirical disciplines such as\ndevelopmental psychology, anthropology, art history, even ideas by his\nEncyclopedia co-editor Charles Morris in his Foundations of a\nTheory of Signs (Morris 1938); and by testing the end-products,\nalbeit with different degrees of rigor (see the supplementary document\non\n Visual Education).\n\nNeurath was aware of the values and limitations of the elements of\nvisual education (see below), and admitted the diversity of tools and\nvalues with the same kind of pluralism, holism and\npragmatism he adopted in his economic theory and more general\nscientific epistemology: each educational media had educational\ncharacteristics of each own that are incomparable and non-additive,\ncannot be ranked and serve different purposes (Neurath 1944, 56,\nNeurath 1945/1973, 238 and Neurath 1946, 99).\n\nThe sensual dimension of education is part of the larger goal of\nhumanization: the elimination of secret knowledge and\nexclusive communities. Education involves the language of daily life\nand the avoidance of unnecessary technical terms, and thereby enables\norganized humanity, including international cooperation (Neurath\n1945/1973, 231). \n\nMore intellectually, education involves comparison (Neurath\n1945/1973, 238). But the comparative analysis, which Hume made a\nstaple of empiricist methodology, does not exhaust the gamut of\nintellectual values. The exploration of incomparable or alternative\npossibilities, as was illustrated by the cases of economic and social\ntheory, practical rationality and scientific method (see the\nsupplementary document\n Political Economy),\n is a key cognitive goal of education that was to make the other\nspecific practices possible (logically and psychologically). He called\nthis meditation: besides handing out knowledge, education\ninvolves a transfer of criticism, a meditative mood and atmosphere,\nand the ability to consider matter under discussion from all sides\n(possible and actual perspectives within the pluralistic attitude)\n(ibid., 233).\n\nEducation should discourage narrow specialization. Since the holistic\nand synthetic model of socialization, epistemology and science\nrequires the consideration of alternative perspectives and the\nintegration of different kinds of knowledge. Neurath praised the\nDanish pedagogical model of university education, a Philosophy Faculty\nin the medieval comprehensive, universalist spirit of the scholastic\nmeaning of ‘university’. In the setting of one of the\nCongresses of the Unity of Science Movement, he praised the\nrequirement at University of Copenhagen of mandatory science and\nphilosophy courses for students of all specialties, and Joerg\nJoergensen’s lectures on scientific thinking based on historical\nexplanation and logical reasoning (Neurath 1938).\n\nEducation depends on intellectual ethos and social values as\nwell. Education includes what he called also the habits of scientific\nattitude: habits of ‘sincerity of research and\nintegrity of arguing’ (Neurath 1946/1973, 233).\nEducation involves also tolerance: the transfer of tradition\nis a preference within one community, not an expression of an absolute\nhigher point of view above other communities, also a preference among\nothers within that community independent of that tradition\n(ibid., 229). \n\nThe social dimension was a recurring theme even though with changing\nconnotations or emphasis, from post-WWI socialism to post-WWII\ninternationalism. Public education was dependent on an institutional\nbasis consisting of a number of institutions: schools, museums and\nother places holding public exhibitions, and periodicals (Neurath\n1931/1973, 222). Neurath was director of the Social and Economic\nMuseum in Vienna from 1924 until 1934. Not coincidently, his cousin\nWaldemar Kaempffert planned and proceeded along lines similar to\nNeurath’s during his tenure as director of the Museum for\nScience and Industry of Chicago from 1928 until 1931.\n\nThe social dimension extended to groups, generations and nations\nrelated by education as the process of group transfer of\ntraditions: ‘Education may be regarded as the transfer of\ncertain traditions in a more or less systematized way, from one person\nto another person, from one group of persons to another group,\nparticularly from one generation to the next. It is also the transfer\nof tradition from one nation to another’ (Neurath 1945/1973,\n228).\n\nIt also extended to political arrangements, from socialism\nand democracy to ideals of international\ncooperation. The earlier views emphasized the socialist\nsignificance of education as condition of democracy in the form of\ninformed participation and of cooperation, since ‘successful\ncollaboration is possible only when those who act fix on one\npossibility, whether by agreement or by propaganda’ (Neurath\n1928/1973, 293). Education as spreading of knowledge is required for\neveryone involved in taking common decisions and hence for the working\nof democracy (Neurath 1945/1973, 230). Democratic society, Neurath\nconcluded, requires a common language (ibid., 247). Post-WWII\ninternationalism became a motivation for visual education\n(ibid., 234, 247). Common language without common laws and\ncommon language for common knowledge and cooperation, rendered visual\nlanguage a socio-political tool, as the non-dictatorial basis for a\npotential human brotherhood (ibid., 248). In both contexts,\nNeurath offered a criticism of elitist individualistic teaching with a\ncontrast between Anglo-Saxon education methods linked to empiricism\nand utilitarianism and Nazi education linked to German romanticism and\ntranscendentalism (Neurath 1945b, 370–1).\n\nThe social and political valence of education provided the framework\nfor linking education to social structures such as entrenched\ninstitutions, techniques and habits involving advertising and\nentertainment that supported the relevant cognitive models such as\nvisual media: ‘Modern man is conditioned by the cinema and a\nwealth of illustrations. He gets much of his knowledge during leisure\nhours in the most pleasing way through his eyes. If one wants to\nspread social knowledge, one should use means similar to modern\nadvertisement’ (Neurath 1925/1973, 214). In the latter context,\nNeurath stressed the superiority of visual education to verbal\neducation as the basis for international or general education:\n‘words divide, pictures unite’ (Neurath 1931/1973, 217).\n\n",
    "section_title": "5.2 Philosophy of education",
    "entry_title": "Otto Neurath",
    "hierarchy_title": "Otto Neurath || Philosophy of psychology, education, and the social sciences || Philosophy of education",
    "tokenized_text": [
        "philosophy",
        "psychology",
        "education",
        "social",
        "science",
        "philosophy",
        "education",
        "philosophy",
        "education",
        "mentioned",
        "psychology",
        "pedagogy",
        "inseparable",
        "vienna",
        "intellectual",
        "scientific",
        "political",
        "culture",
        "s",
        "glöckel",
        "school",
        "reform",
        "movement",
        "onwards",
        "advocated",
        "empirical",
        "research",
        "pedagogy",
        "separated",
        "school",
        "church",
        "promoted",
        "social",
        "equality",
        "child",
        "welfare",
        "became",
        "central",
        "concern",
        "attracted",
        "pedagogical",
        "interest",
        "intellectual",
        "political",
        "reason",
        "popper",
        "wittgenstein",
        "neurath",
        "popper",
        "see",
        "hacohen",
        "wittgenstein",
        "see",
        "bartley",
        "peter",
        "pedagogical",
        "activity",
        "one",
        "find",
        "root",
        "epistemological",
        "view",
        "popper",
        "wittgenstein",
        "became",
        "schoolteachers",
        "wittgenstein",
        "even",
        "published",
        "spelling",
        "dictionary",
        "wörterbuch",
        "für",
        "volksschullen",
        "lili",
        "roubiczek",
        "student",
        "maria",
        "montessori",
        "london",
        "karl",
        "bühler",
        "vienna",
        "established",
        "montessori",
        "school",
        "soon",
        "montessori",
        "idea",
        "attracted",
        "educator",
        "psychologist",
        "alike",
        "charlotte",
        "bühler",
        "anna",
        "freud",
        "kramer",
        "montessori",
        "stressed",
        "idea",
        "child",
        "capacity",
        "active",
        "selfdirected",
        "learning",
        "sensory",
        "motor",
        "interaction",
        "environment",
        "guidance",
        "errorcorrecting",
        "feedback",
        "gestalt",
        "psychologist",
        "psychoanalyst",
        "others",
        "defended",
        "similarly",
        "active",
        "model",
        "child",
        "mind",
        "vienna",
        "city",
        "council",
        "unified",
        "psychological",
        "pedagogical",
        "institute",
        "pedagogic",
        "institute",
        "popper",
        "wrote",
        "first",
        "thesis",
        "habit",
        "experience",
        "law",
        "education",
        "justified",
        "scientific",
        "status",
        "pedagogy",
        "inductivist",
        "ground",
        "raised",
        "fateful",
        "philosophical",
        "problem",
        "objectivescientific",
        "decidability",
        "pedagogical",
        "problem",
        "delimitation",
        "empirical",
        "part",
        "pedagogy",
        "nonempirical",
        "part",
        "ter",
        "hark",
        "gattei",
        "selz",
        "holistic",
        "functional",
        "notion",
        "total",
        "task",
        "based",
        "psychological",
        "mechanism",
        "trial",
        "error",
        "would",
        "inspire",
        "popper",
        "pedagogy",
        "well",
        "scientific",
        "methodology",
        "moreover",
        "awareness",
        "montessori",
        "method",
        "secured",
        "s",
        "teaching",
        "education",
        "friendship",
        "carpenter",
        "made",
        "toy",
        "montessori",
        "orphanage",
        "turned",
        "cabinetmaking",
        "montessoriinspired",
        "socratic",
        "method",
        "admired",
        "kantian",
        "critical",
        "philosopher",
        "leonard",
        "nelson",
        "hacohen",
        "neurath",
        "view",
        "education",
        "scientific",
        "epistemology",
        "integrated",
        "social",
        "political",
        "scientific",
        "empiricist",
        "element",
        "mutually",
        "reinforcing",
        "manner",
        "equally",
        "synthetic",
        "attitude",
        "integrated",
        "attention",
        "different",
        "specific",
        "dimension",
        "conceptual",
        "information",
        "material",
        "linguistic",
        "graphic",
        "representation",
        "cognitive",
        "social",
        "attitude",
        "capacity",
        "value",
        "goal",
        "institution",
        "influential",
        "example",
        "outcome",
        "view",
        "development",
        "application",
        "isotype",
        "method",
        "visual",
        "education",
        "see",
        "supplementary",
        "document",
        "visual",
        "education",
        "education",
        "involves",
        "argument",
        "discussion",
        "sense",
        "dialogical",
        "term",
        "argument",
        "used",
        "neurath",
        "broadly",
        "include",
        "case",
        "point",
        "made",
        "communicated",
        "sens",
        "demonstration",
        "neurath",
        "wrote",
        "argue",
        "requires",
        "one",
        "distinguish",
        "essential",
        "incidental",
        "neurath",
        "visual",
        "argument",
        "combination",
        "verbal",
        "visual",
        "aid",
        "leading",
        "essential",
        "ibid",
        "aegis",
        "value",
        "neutrality",
        "universality",
        "characterized",
        "economic",
        "theory",
        "social",
        "view",
        "scientific",
        "epistemology",
        "neurath",
        "sought",
        "also",
        "universal",
        "medium",
        "communication",
        "knowledge",
        "visual",
        "perception",
        "scientific",
        "information",
        "science",
        "typical",
        "specie",
        "arguing",
        "human",
        "being",
        "nation",
        "rich",
        "poor",
        "common",
        "ibid",
        "allowing",
        "discussion",
        "civilization",
        "discipline",
        "discourse",
        "render",
        "local",
        "doctrine",
        "objective",
        "intersubjective",
        "universal",
        "unifying",
        "value",
        "observation",
        "language",
        "neurath",
        "claimed",
        "simple",
        "visual",
        "representation",
        "theoretically",
        "valueneutral",
        "eliminating",
        "judgment",
        "least",
        "compared",
        "verbal",
        "expression",
        "theoretical",
        "statement",
        "ibid",
        "interest",
        "cognitive",
        "psychology",
        "child",
        "psychology",
        "child",
        "welfare",
        "antimetaphysical",
        "epistemological",
        "value",
        "empiricism",
        "led",
        "defend",
        "value",
        "visual",
        "education",
        "quoting",
        "victorian",
        "selfimprovement",
        "author",
        "samuel",
        "smile",
        "declared",
        "person",
        "le",
        "apt",
        "learn",
        "eye",
        "rather",
        "ear",
        "especially",
        "case",
        "early",
        "youth",
        "eye",
        "chief",
        "inlet",
        "knowledge",
        "neurath",
        "approach",
        "consistent",
        "montessori",
        "contemporary",
        "educational",
        "theory",
        "well",
        "scientific",
        "education",
        "repeatedly",
        "pointed",
        "another",
        "victorian",
        "hero",
        "britain",
        "foremost",
        "experimental",
        "scientist",
        "popular",
        "science",
        "educator",
        "michael",
        "faraday",
        "course",
        "six",
        "lecture",
        "chemical",
        "history",
        "candle",
        "intended",
        "primarily",
        "child",
        "given",
        "importance",
        "placed",
        "scientific",
        "information",
        "also",
        "socially",
        "main",
        "challenge",
        "routinely",
        "took",
        "became",
        "concretization",
        "abstract",
        "information",
        "especially",
        "visual",
        "communication",
        "statistical",
        "information",
        "generally",
        "believed",
        "visual",
        "education",
        "provided",
        "unifying",
        "framework",
        "bridged",
        "gap",
        "science",
        "humanity",
        "neurath",
        "education",
        "requires",
        "simplification",
        "empiricist",
        "notion",
        "abstraction",
        "face",
        "complexity",
        "fact",
        "teaching",
        "requires",
        "knowing",
        "leave",
        "count",
        "superfluous",
        "detail",
        "accuracy",
        "know",
        "best",
        "omit",
        "best",
        "teacher",
        "remember",
        "simplified",
        "picture",
        "better",
        "forget",
        "accurate",
        "figure",
        "neurath",
        "a",
        "graphic",
        "visual",
        "counterpart",
        "point",
        "constitutes",
        "basis",
        "design",
        "isotype",
        "icon",
        "analogy",
        "method",
        "silhouette",
        "popular",
        "austrian",
        "art",
        "form",
        "visual",
        "abstraction",
        "communication",
        "information",
        "type",
        "general",
        "concept",
        "approach",
        "consistent",
        "empiricist",
        "antimetaphysical",
        "spirit",
        "bauhaus",
        "modernist",
        "aesthetic",
        "rejection",
        "ornament",
        "famously",
        "advocated",
        "viennese",
        "architect",
        "adolf",
        "loo",
        "ornament",
        "crime",
        "also",
        "echoed",
        "neurath",
        "time",
        "ornament",
        "recounted",
        "ernst",
        "niekisch",
        "neurath",
        "reinforced",
        "viennese",
        "school",
        "reform",
        "movement",
        "led",
        "glöckel",
        "scientific",
        "attitude",
        "philosophy",
        "logical",
        "empiricism",
        "scientific",
        "empirical",
        "attitude",
        "towards",
        "model",
        "education",
        "applied",
        "method",
        "tool",
        "visual",
        "education",
        "two",
        "way",
        "applying",
        "accepted",
        "recent",
        "idea",
        "empirical",
        "discipline",
        "developmental",
        "psychology",
        "anthropology",
        "art",
        "history",
        "even",
        "idea",
        "encyclopedia",
        "coeditor",
        "charles",
        "morris",
        "foundation",
        "theory",
        "sign",
        "morris",
        "testing",
        "endproducts",
        "albeit",
        "different",
        "degree",
        "rigor",
        "see",
        "supplementary",
        "document",
        "visual",
        "education",
        "neurath",
        "aware",
        "value",
        "limitation",
        "element",
        "visual",
        "education",
        "see",
        "admitted",
        "diversity",
        "tool",
        "value",
        "kind",
        "pluralism",
        "holism",
        "pragmatism",
        "adopted",
        "economic",
        "theory",
        "general",
        "scientific",
        "epistemology",
        "educational",
        "medium",
        "educational",
        "characteristic",
        "incomparable",
        "nonadditive",
        "ranked",
        "serve",
        "different",
        "purpose",
        "neurath",
        "neurath",
        "neurath",
        "sensual",
        "dimension",
        "education",
        "part",
        "larger",
        "goal",
        "humanization",
        "elimination",
        "secret",
        "knowledge",
        "exclusive",
        "community",
        "education",
        "involves",
        "language",
        "daily",
        "life",
        "avoidance",
        "unnecessary",
        "technical",
        "term",
        "thereby",
        "enables",
        "organized",
        "humanity",
        "including",
        "international",
        "cooperation",
        "neurath",
        "intellectually",
        "education",
        "involves",
        "comparison",
        "neurath",
        "comparative",
        "analysis",
        "hume",
        "made",
        "staple",
        "empiricist",
        "methodology",
        "exhaust",
        "gamut",
        "intellectual",
        "value",
        "exploration",
        "incomparable",
        "alternative",
        "possibility",
        "illustrated",
        "case",
        "economic",
        "social",
        "theory",
        "practical",
        "rationality",
        "scientific",
        "method",
        "see",
        "supplementary",
        "document",
        "political",
        "economy",
        "key",
        "cognitive",
        "goal",
        "education",
        "make",
        "specific",
        "practice",
        "possible",
        "logically",
        "psychologically",
        "called",
        "meditation",
        "besides",
        "handing",
        "knowledge",
        "education",
        "involves",
        "transfer",
        "criticism",
        "meditative",
        "mood",
        "atmosphere",
        "ability",
        "consider",
        "matter",
        "discussion",
        "side",
        "possible",
        "actual",
        "perspective",
        "within",
        "pluralistic",
        "attitude",
        "ibid",
        "education",
        "discourage",
        "narrow",
        "specialization",
        "since",
        "holistic",
        "synthetic",
        "model",
        "socialization",
        "epistemology",
        "science",
        "requires",
        "consideration",
        "alternative",
        "perspective",
        "integration",
        "different",
        "kind",
        "knowledge",
        "neurath",
        "praised",
        "danish",
        "pedagogical",
        "model",
        "university",
        "education",
        "philosophy",
        "faculty",
        "medieval",
        "comprehensive",
        "universalist",
        "spirit",
        "scholastic",
        "meaning",
        "university",
        "setting",
        "one",
        "congress",
        "unity",
        "science",
        "movement",
        "praised",
        "requirement",
        "university",
        "copenhagen",
        "mandatory",
        "science",
        "philosophy",
        "course",
        "student",
        "specialty",
        "joerg",
        "joergensen",
        "lecture",
        "scientific",
        "thinking",
        "based",
        "historical",
        "explanation",
        "logical",
        "reasoning",
        "neurath",
        "education",
        "depends",
        "intellectual",
        "ethos",
        "social",
        "value",
        "well",
        "education",
        "includes",
        "called",
        "also",
        "habit",
        "scientific",
        "attitude",
        "habit",
        "sincerity",
        "research",
        "integrity",
        "arguing",
        "neurath",
        "education",
        "involves",
        "also",
        "tolerance",
        "transfer",
        "tradition",
        "preference",
        "within",
        "one",
        "community",
        "expression",
        "absolute",
        "higher",
        "point",
        "view",
        "community",
        "also",
        "preference",
        "among",
        "others",
        "within",
        "community",
        "independent",
        "tradition",
        "ibid",
        "social",
        "dimension",
        "recurring",
        "theme",
        "even",
        "though",
        "changing",
        "connotation",
        "emphasis",
        "postwwi",
        "socialism",
        "postwwii",
        "internationalism",
        "public",
        "education",
        "dependent",
        "institutional",
        "basis",
        "consisting",
        "number",
        "institution",
        "school",
        "museum",
        "place",
        "holding",
        "public",
        "exhibition",
        "periodical",
        "neurath",
        "neurath",
        "director",
        "social",
        "economic",
        "museum",
        "vienna",
        "coincidently",
        "cousin",
        "waldemar",
        "kaempffert",
        "planned",
        "proceeded",
        "along",
        "line",
        "similar",
        "neurath",
        "tenure",
        "director",
        "museum",
        "science",
        "industry",
        "chicago",
        "social",
        "dimension",
        "extended",
        "group",
        "generation",
        "nation",
        "related",
        "education",
        "process",
        "group",
        "transfer",
        "tradition",
        "education",
        "may",
        "regarded",
        "transfer",
        "certain",
        "tradition",
        "le",
        "systematized",
        "way",
        "one",
        "person",
        "another",
        "person",
        "one",
        "group",
        "person",
        "another",
        "group",
        "particularly",
        "one",
        "generation",
        "next",
        "also",
        "transfer",
        "tradition",
        "one",
        "nation",
        "another",
        "neurath",
        "also",
        "extended",
        "political",
        "arrangement",
        "socialism",
        "democracy",
        "ideal",
        "international",
        "cooperation",
        "earlier",
        "view",
        "emphasized",
        "socialist",
        "significance",
        "education",
        "condition",
        "democracy",
        "form",
        "informed",
        "participation",
        "cooperation",
        "since",
        "successful",
        "collaboration",
        "possible",
        "act",
        "fix",
        "one",
        "possibility",
        "whether",
        "agreement",
        "propaganda",
        "neurath",
        "education",
        "spreading",
        "knowledge",
        "required",
        "everyone",
        "involved",
        "taking",
        "common",
        "decision",
        "hence",
        "working",
        "democracy",
        "neurath",
        "democratic",
        "society",
        "neurath",
        "concluded",
        "requires",
        "common",
        "language",
        "ibid",
        "postwwii",
        "internationalism",
        "became",
        "motivation",
        "visual",
        "education",
        "ibid",
        "common",
        "language",
        "without",
        "common",
        "law",
        "common",
        "language",
        "common",
        "knowledge",
        "cooperation",
        "rendered",
        "visual",
        "language",
        "sociopolitical",
        "tool",
        "nondictatorial",
        "basis",
        "potential",
        "human",
        "brotherhood",
        "ibid",
        "context",
        "neurath",
        "offered",
        "criticism",
        "elitist",
        "individualistic",
        "teaching",
        "contrast",
        "anglosaxon",
        "education",
        "method",
        "linked",
        "empiricism",
        "utilitarianism",
        "nazi",
        "education",
        "linked",
        "german",
        "romanticism",
        "transcendentalism",
        "neurath",
        "b",
        "social",
        "political",
        "valence",
        "education",
        "provided",
        "framework",
        "linking",
        "education",
        "social",
        "structure",
        "entrenched",
        "institution",
        "technique",
        "habit",
        "involving",
        "advertising",
        "entertainment",
        "supported",
        "relevant",
        "cognitive",
        "model",
        "visual",
        "medium",
        "modern",
        "man",
        "conditioned",
        "cinema",
        "wealth",
        "illustration",
        "get",
        "much",
        "knowledge",
        "leisure",
        "hour",
        "pleasing",
        "way",
        "eye",
        "one",
        "want",
        "spread",
        "social",
        "knowledge",
        "one",
        "use",
        "mean",
        "similar",
        "modern",
        "advertisement",
        "neurath",
        "latter",
        "context",
        "neurath",
        "stressed",
        "superiority",
        "visual",
        "education",
        "verbal",
        "education",
        "basis",
        "international",
        "general",
        "education",
        "word",
        "divide",
        "picture",
        "unite",
        "neurath"
    ]
}