{
    "main_text": "Book 2 of the Principia\n7. Book 2 of the Principia\n\n\nThe purpose of Book 2 is to provide a conclusive refutation of the\nCartesian idea, adopted as well by Leibniz, that the planets are\ncarried around their orbits by fluid vortices. Newton's main\nargument, which extends from the beginning of Section 1 until the end\nof Section 7, occupies 80 percent of the Book. Section 9, which\nends the Book, offers a further, parting argument. We best\ndispense with this second argument before turning to the first.\n\n\nThe thrust of the argument in Section 9 is that fluid vortices are\nincompatible with Kepler's area and 3/2 power rules. The argument\nhas two shortcomings, both of them recognized by Newton's opponents at\nthe time. First, the entire argument is predicated on a\nhypothesis: “The resistance that arises from want of slipperiness of\nthe parts of the fluid is, ceteris paribus, proportional to\nthe velocity with which the parts of the fluid are separated from one\nanother.” Fluids of this sort are now called “Newtonian.”\nThe absence of evidence for the hypothesis left Newton's opponents free\nto adopt other rules for the velocity gradient in a vortex generated\naround a rotating cylinder or sphere, rules that could undercut his\nconclusions. Second, his analysis of the vortex generated around\na rotating cylinder or sphere involves fundamentally wrong physics: it\ndefines steady state in terms of a balance of forces instead of torques\nacross each shell element comprising the vortex. To use Johann\nBernoulli's words from 1730, Newton “completely neglects to take into\naccount the action of the lever, the consideration of which however is\nabsolutely necessary here, it being obvious that the same force,\napplied along the tangent to the circumference of a large wheel, has a\ngreater efficacity for making it turn than it has when applied to the\ncircumference of a smaller\n radius.”[38]\n(This is not the only place in the\nPrincipia where it is clear that Newton had not thought\nthrough the mechanics of angular motion.)\n\n\nThe argument that carried much more weight at the time — it convinced\nHuygens, for example — is the one that extends across the first seven\nsections of the Book. The thrust of this argument is clear from\nits conclusion, as stated more forcefully in the second and third\neditions than in the first:\n\n\nAnd even if air, water, quicksilver, and similar fluids, by some\ninfinite division of their parts, could be subtilized and become\ninfinitely fluid mediums, they would not resist projected balls any the\nless. For the resistance which is the subject of the\npreceding propositions arises from the inertia of matter; and the\ninertia of matter is essential to bodies and is always\nproportional to the quantity of matter. By the division of\nthe parts of a fluid, the resistance that arises from the tenacity and\nfriction of the parts can indeed be diminished, but the quantity of\nmatter is not diminished by the division of its parts; and since the\nquantity of matter remains the same, its force of inertia — to which\nthe resistance discussed here is always proportional — remains the\nsame. For the resistance to be diminished, the quantity of matter\nin the spaces through which bodies move must be diminished. And\ntherefore the celestial spaces, through which the globes of the planets\nand comets move continually in all directions freely and without any\nsensible diminution of motion, are devoid of any corporeal fluid,\nexcept perhaps the very rarest of vapors and rays of light transmitted\nthrough those spaces. [P, 761]\n\n\nTo reach this conclusion Newton had to show that (1) the inertia of\nthe fluid does indeed produce a resistance force proportional to its\ndensity, a force that (2) is independent of the tenacity (that is,\nsurface friction) and the friction of the parts (that is, viscosity) of\nthe fluid. Perhaps in part in emulation of the approach to\ncentripetal forces that appeared to have succeeded so well in Books 1\nand 3, the approach Newton takes in Book 2 is to develop, so far as he\ncan, a generic mathematical theory of motion under resistance forces\nand then turn to experimental phenomena so that, in the words of Book\n1, “it may be found out which conditions of forces apply” to different\nkinds of fluids. The theory in Book 1 is generic in that it\nexamines centripetal forces that vary as different functions of the\ndistance from the force center. The theory in Book 2 is generic\nin that it examines motion under resistance forces that vary as the\nvelocity, the velocity squared, the sum of these two, and ultimately\neven the sum of two or three independent contributions, each of which\nis allowed to vary as any power of velocity whatever. Because\nNewton's goal was to reach a conclusion about the contribution to the\ntotal resistance made by the inertia of the fluid, and he recognized\nthat surface friction and viscosity can contribute to the resistance as\nwell, his empirical problem became one of disaggregating the\ninertial contribution from the total resistance, that is, the\ncontribution that alone varies with the density of the fluid.\nFortunately, because gravitational forces so totally dominate celestial\nmotions, this need to disaggregate different sorts of forces did not\narise in Book 3.\n\n\nFrom Newton's point of view, then, the basic problem — assuming that\nthree independent mechanisms contribute to the total resistance forces,\nonly one of which is proportional to the fluid density\nρf — was to find an experimental\nphenomenon that would allow him to determine (1) the three exponents in\nthe following schema, and (2) laws defining the three coefficients —\nor, more minimally, at least the variation of the coefficient of the\nlast term for the specific case of spheres:\n\nFresist = a0vn0 +\na1vn1 +\nb2ρfvn2\n\n\n\nSome preliminary pendulum-decay experiments showed promise for doing\nthis, leading him in the first edition to rely solely on this\nphenomenon. The idea was to start a pendulum from several\ndifferent heights in order to cover a range of velocities and then to\nuse simultaneous algebraic equations to fit a two or three term\npolynomial to two or three lost-arc data-points, changing the exponents\nuntil the polynomial achieved good agreement with the other lost-arc\ndata points. The theoretical solutions for pendulum motion under\nresistance forces in Section 6 would then allow him to infer the forces\nfrom the rate of decay of the pendulum. These theoretical\nsolutions covered resistance forces that vary not only as velocity to\nthe powers 0, 1, and 2, but also as any power at all of velocity.\nIn principle, therefore, he saw himself in a position to infer laws for\nresistance forces on spheres from the phenomenon of pendulum decay in\nfull parallel with his deduction of the law of universal gravity from\nthe phenomena of orbital motion in Book 3. And he could then\nconclude from the total absence of signs of resistance forces acting on\nthe planets and, most especially, comets that the density of any fluid\nin the celestial regions must be exactly or very nearly zero.\n\n\nUnfortunately, pendulum-decay turned out not to be as well behaved a\nphenomenon as Newton anticipated it was going to be while he was\nworking on the first edition. The problem, as he later realized,\nwas that he had to let the pendulum swing many times in order to\nmeasure the rate of decay, and in the process it gave rise to a “to and\nfro” motion in the surrounding fluid, so that the relative\nvelocity between the bob and the fluid, which is the velocity that\nmatters in resistance, could not be determined or controlled. The\nGeneral Scholium following Section\n 6[39]\nreports detailed decay-rate data for an\nimpressive range of experiments, including different size bobs in air\nand bobs moving as well in water and mercury. The reader is also\nshown in detail how to proceed from the data in each case to a\npolynomial as above defining the resistance force. Any reader who\nworked through the data discovered what Newton knew, but was less than\ncandid about: no polynomial fit the data. The experiments did\nclearly indicate that resistance forces involve no power of velocity\ngreater than 2, and they provided good evidence that a velocity squared\neffect was dominant, even to the extent of masking any effect involving\nsome other power. Newton also managed to extract some highly\nqualified evidence that the velocity squared effect varies as the\ndensity of the fluid and the frontal area (that is, the square of the\ndiameter) of spheres.\n\n\nThe approach to resistance in the first edition relied entirely on\npendulum-decay experiments. The disappointing evidence they\nyielded led to a far weaker statement of the conclusion about the\nabsence of fluid in the celestial regions in the first edition than the\nconclusion in the subsequent editions quoted above. Not long\nafter the first edition was published, Newton initiated some\nvertical-fall experiments in water that persuaded him that the\nphenomenon of vertical-fall in resisting media would yield much better\nbehaved data. In the second and third editions, therefore, even\nthough the pendulum-decay experiments are still fully reported, the\ncentral argument in Book 2 relies on vertical-fall experiments\n(including ones from the top of the dome of the newly completed St.\nPaul's Cathedral) to establish a resistance effect on spheres that is\nproportional to the density of the fluid, the square of the diameter,\nand the square of the velocity. The data from these experiments\nwere very good — indeed, even better than Newton realized, for small\nvagaries in them that he dismissed as experimental error were in fact\nnot vagaries at all, but evidence that no polynomial of the sort he was\nseeking is adequate for resistance forces.\n\n\nWhile the vertical-fall experiments put Newton in a position to make\nhis concluding rejection of vortex theories more forceful, they also\nposed a methodological complication. The vertical-fall\nexperiments offered no way of disaggregating the contribution to\nresistance made by the inertia of the medium from the total\nresistance. But the argument against vortices required him to\nshow that, no matter how perfectly free of friction and viscosity the\ncelestial fluid might be, its inertia would still give rise to\nresistance forces that would affect the motions of comets, if not\nplanets as well. From the resistance measured in the\npendulum-decay experiments, Newton could conclude that the forces in\nair and water are dominated by a contribution that varies as the\nvelocity squared. In the vertical-fall experiments in air and\nwater the measured forces varied to first approximation as the product\nof the density and the velocity squared, but only to a first\napproximation, leaving room to question whether a purely inertial\ncontribution had been isolated. Newton dealt with this problem by\noffering a rather ad hoc theoretical derivation for the purely\ninertial contribution, showing how closely it agreed with the\nvertical-fall results, and proposing that the differences between the\ntheoretical and the measured resistances could be used to investigate\nother contributions. Success of such a program in characterizing\nthe contributions made by surface friction and the viscosity would have\nprovided compelling support for Newton's theory of the inertial\ncontribution. Still, the approach left Newton with not so\nstraightforward a derivation of the laws of resistance forces from\nphenomena as he had hoped for in the first\n edition.[40]\n\n\nIn fact, there is a deep mistake in Newton's approach to resistance\nforces that came to be understood only at the beginning of the\ntwentieth century. Resistance forces do not arise from\nindependent contributions made by such factors as the viscosity and\ninertia of the fluid. Consequently, no polynomial consisting of a\nfew always positive terms in powers of velocity can ever be adequate\nfor resistance forces. The first indication of this came when\nd'Alembert, unhappy with Newton's ad hoc theory for the\ninertial contribution, analyzed the flow of what we now call a perfect\nfluid about spheres and bodies of other shapes, discovering in all\ncases that the net force of the fluid is exactly zero.\nConsequently, contrary to Newton, there is no such thing as\nthe contribution made to resistance purely by the inertia of\nthe fluid. Resistance forces always arise from a combination of\nviscous and inertial effects, however low the viscosity of the fluid\nmay be. Newton's assumption that resistance forces can be\nrepresented as a sum, one term of which gives the contribution made\npurely by the inertia of the fluid, was wrong empirically, much as his\nassumptions about simultaneity and space being Euclidean turned out to\nbe wrong. Unlike the latter assumptions, however, the\nassumption about resistance amounted to a dead end. All Newton\nachieved in Book 2 with resistance forces was merely a curve-fit.\n",
    "section_title": "7. Book 2 of the Principia",
    "entry_title": "Newton’s Philosophiae Naturalis Principia Mathematica",
    "hierarchy_title": "Newton’s Philosophiae Naturalis Principia Mathematica || Book 2 of the Principia",
    "tokenized_text": [
        "book",
        "principia",
        "book",
        "principia",
        "purpose",
        "book",
        "provide",
        "conclusive",
        "refutation",
        "cartesian",
        "idea",
        "adopted",
        "well",
        "leibniz",
        "planet",
        "carried",
        "around",
        "orbit",
        "fluid",
        "vortex",
        "newton",
        "s",
        "main",
        "argument",
        "extends",
        "beginning",
        "section",
        "end",
        "section",
        "occupies",
        "percent",
        "book",
        "section",
        "end",
        "book",
        "offer",
        "parting",
        "argument",
        "best",
        "dispense",
        "second",
        "argument",
        "turning",
        "first",
        "thrust",
        "argument",
        "section",
        "fluid",
        "vortex",
        "incompatible",
        "kepler",
        "s",
        "area",
        "power",
        "rule",
        "argument",
        "two",
        "shortcoming",
        "recognized",
        "newton",
        "s",
        "opponent",
        "time",
        "first",
        "entire",
        "argument",
        "predicated",
        "hypothesis",
        "resistance",
        "arises",
        "want",
        "slipperiness",
        "part",
        "fluid",
        "ceteris",
        "paribus",
        "proportional",
        "velocity",
        "part",
        "fluid",
        "separated",
        "one",
        "another",
        "fluid",
        "sort",
        "called",
        "newtonian",
        "absence",
        "evidence",
        "hypothesis",
        "left",
        "newton",
        "s",
        "opponent",
        "free",
        "adopt",
        "rule",
        "velocity",
        "gradient",
        "vortex",
        "generated",
        "around",
        "rotating",
        "cylinder",
        "sphere",
        "rule",
        "could",
        "undercut",
        "conclusion",
        "second",
        "analysis",
        "vortex",
        "generated",
        "around",
        "rotating",
        "cylinder",
        "sphere",
        "involves",
        "fundamentally",
        "wrong",
        "physic",
        "defines",
        "steady",
        "state",
        "term",
        "balance",
        "force",
        "instead",
        "torque",
        "across",
        "shell",
        "element",
        "comprising",
        "vortex",
        "use",
        "johann",
        "bernoulli",
        "s",
        "word",
        "newton",
        "completely",
        "neglect",
        "take",
        "account",
        "action",
        "lever",
        "consideration",
        "however",
        "absolutely",
        "necessary",
        "obvious",
        "force",
        "applied",
        "along",
        "tangent",
        "circumference",
        "large",
        "wheel",
        "greater",
        "efficacity",
        "making",
        "turn",
        "applied",
        "circumference",
        "smaller",
        "radius",
        "place",
        "principia",
        "clear",
        "newton",
        "thought",
        "mechanic",
        "angular",
        "motion",
        "argument",
        "carried",
        "much",
        "weight",
        "time",
        "convinced",
        "huygens",
        "example",
        "one",
        "extends",
        "across",
        "first",
        "seven",
        "section",
        "book",
        "thrust",
        "argument",
        "clear",
        "conclusion",
        "stated",
        "forcefully",
        "second",
        "third",
        "edition",
        "first",
        "even",
        "air",
        "water",
        "quicksilver",
        "similar",
        "fluid",
        "infinite",
        "division",
        "part",
        "could",
        "subtilized",
        "become",
        "infinitely",
        "fluid",
        "medium",
        "would",
        "resist",
        "projected",
        "ball",
        "le",
        "resistance",
        "subject",
        "preceding",
        "proposition",
        "arises",
        "inertia",
        "matter",
        "inertia",
        "matter",
        "essential",
        "body",
        "always",
        "proportional",
        "quantity",
        "matter",
        "division",
        "part",
        "fluid",
        "resistance",
        "arises",
        "tenacity",
        "friction",
        "part",
        "indeed",
        "diminished",
        "quantity",
        "matter",
        "diminished",
        "division",
        "part",
        "since",
        "quantity",
        "matter",
        "remains",
        "force",
        "inertia",
        "resistance",
        "discussed",
        "always",
        "proportional",
        "remains",
        "resistance",
        "diminished",
        "quantity",
        "matter",
        "space",
        "body",
        "move",
        "must",
        "diminished",
        "therefore",
        "celestial",
        "space",
        "globe",
        "planet",
        "comet",
        "move",
        "continually",
        "direction",
        "freely",
        "without",
        "sensible",
        "diminution",
        "motion",
        "devoid",
        "corporeal",
        "fluid",
        "except",
        "perhaps",
        "rarest",
        "vapor",
        "ray",
        "light",
        "transmitted",
        "space",
        "p",
        "reach",
        "conclusion",
        "newton",
        "show",
        "inertia",
        "fluid",
        "indeed",
        "produce",
        "resistance",
        "force",
        "proportional",
        "density",
        "force",
        "independent",
        "tenacity",
        "surface",
        "friction",
        "friction",
        "part",
        "viscosity",
        "fluid",
        "perhaps",
        "part",
        "emulation",
        "approach",
        "centripetal",
        "force",
        "appeared",
        "succeeded",
        "well",
        "book",
        "approach",
        "newton",
        "take",
        "book",
        "develop",
        "far",
        "generic",
        "mathematical",
        "theory",
        "motion",
        "resistance",
        "force",
        "turn",
        "experimental",
        "phenomenon",
        "word",
        "book",
        "may",
        "found",
        "condition",
        "force",
        "apply",
        "different",
        "kind",
        "fluid",
        "theory",
        "book",
        "generic",
        "examines",
        "centripetal",
        "force",
        "vary",
        "different",
        "function",
        "distance",
        "force",
        "center",
        "theory",
        "book",
        "generic",
        "examines",
        "motion",
        "resistance",
        "force",
        "vary",
        "velocity",
        "velocity",
        "squared",
        "sum",
        "two",
        "ultimately",
        "even",
        "sum",
        "two",
        "three",
        "independent",
        "contribution",
        "allowed",
        "vary",
        "power",
        "velocity",
        "whatever",
        "newton",
        "s",
        "goal",
        "reach",
        "conclusion",
        "contribution",
        "total",
        "resistance",
        "made",
        "inertia",
        "fluid",
        "recognized",
        "surface",
        "friction",
        "viscosity",
        "contribute",
        "resistance",
        "well",
        "empirical",
        "problem",
        "became",
        "one",
        "disaggregating",
        "inertial",
        "contribution",
        "total",
        "resistance",
        "contribution",
        "alone",
        "varies",
        "density",
        "fluid",
        "fortunately",
        "gravitational",
        "force",
        "totally",
        "dominate",
        "celestial",
        "motion",
        "need",
        "disaggregate",
        "different",
        "sort",
        "force",
        "arise",
        "book",
        "newton",
        "s",
        "point",
        "view",
        "basic",
        "problem",
        "assuming",
        "three",
        "independent",
        "mechanism",
        "contribute",
        "total",
        "resistance",
        "force",
        "one",
        "proportional",
        "fluid",
        "density",
        "ρf",
        "find",
        "experimental",
        "phenomenon",
        "would",
        "allow",
        "determine",
        "three",
        "exponent",
        "following",
        "schema",
        "law",
        "defining",
        "three",
        "coefficient",
        "minimally",
        "least",
        "variation",
        "coefficient",
        "last",
        "term",
        "specific",
        "case",
        "sphere",
        "fresist",
        "avn",
        "avn",
        "bρfvn",
        "preliminary",
        "pendulumdecay",
        "experiment",
        "showed",
        "promise",
        "leading",
        "first",
        "edition",
        "rely",
        "solely",
        "phenomenon",
        "idea",
        "start",
        "pendulum",
        "several",
        "different",
        "height",
        "order",
        "cover",
        "range",
        "velocity",
        "use",
        "simultaneous",
        "algebraic",
        "equation",
        "fit",
        "two",
        "three",
        "term",
        "polynomial",
        "two",
        "three",
        "lostarc",
        "datapoints",
        "changing",
        "exponent",
        "polynomial",
        "achieved",
        "good",
        "agreement",
        "lostarc",
        "data",
        "point",
        "theoretical",
        "solution",
        "pendulum",
        "motion",
        "resistance",
        "force",
        "section",
        "would",
        "allow",
        "infer",
        "force",
        "rate",
        "decay",
        "pendulum",
        "theoretical",
        "solution",
        "covered",
        "resistance",
        "force",
        "vary",
        "velocity",
        "power",
        "also",
        "power",
        "velocity",
        "principle",
        "therefore",
        "saw",
        "position",
        "infer",
        "law",
        "resistance",
        "force",
        "sphere",
        "phenomenon",
        "pendulum",
        "decay",
        "full",
        "parallel",
        "deduction",
        "law",
        "universal",
        "gravity",
        "phenomenon",
        "orbital",
        "motion",
        "book",
        "could",
        "conclude",
        "total",
        "absence",
        "sign",
        "resistance",
        "force",
        "acting",
        "planet",
        "especially",
        "comet",
        "density",
        "fluid",
        "celestial",
        "region",
        "must",
        "exactly",
        "nearly",
        "zero",
        "unfortunately",
        "pendulumdecay",
        "turned",
        "well",
        "behaved",
        "phenomenon",
        "newton",
        "anticipated",
        "going",
        "working",
        "first",
        "edition",
        "problem",
        "later",
        "realized",
        "let",
        "pendulum",
        "swing",
        "many",
        "time",
        "order",
        "measure",
        "rate",
        "decay",
        "process",
        "gave",
        "rise",
        "fro",
        "motion",
        "surrounding",
        "fluid",
        "relative",
        "velocity",
        "bob",
        "fluid",
        "velocity",
        "matter",
        "resistance",
        "could",
        "determined",
        "controlled",
        "general",
        "scholium",
        "following",
        "section",
        "report",
        "detailed",
        "decayrate",
        "data",
        "impressive",
        "range",
        "experiment",
        "including",
        "different",
        "size",
        "bob",
        "air",
        "bob",
        "moving",
        "well",
        "water",
        "mercury",
        "reader",
        "also",
        "shown",
        "detail",
        "proceed",
        "data",
        "case",
        "polynomial",
        "defining",
        "resistance",
        "force",
        "reader",
        "worked",
        "data",
        "discovered",
        "newton",
        "knew",
        "le",
        "candid",
        "polynomial",
        "fit",
        "data",
        "experiment",
        "clearly",
        "indicate",
        "resistance",
        "force",
        "involve",
        "power",
        "velocity",
        "greater",
        "provided",
        "good",
        "evidence",
        "velocity",
        "squared",
        "effect",
        "dominant",
        "even",
        "extent",
        "masking",
        "effect",
        "involving",
        "power",
        "newton",
        "also",
        "managed",
        "extract",
        "highly",
        "qualified",
        "evidence",
        "velocity",
        "squared",
        "effect",
        "varies",
        "density",
        "fluid",
        "frontal",
        "area",
        "square",
        "diameter",
        "sphere",
        "approach",
        "resistance",
        "first",
        "edition",
        "relied",
        "entirely",
        "pendulumdecay",
        "experiment",
        "disappointing",
        "evidence",
        "yielded",
        "led",
        "far",
        "weaker",
        "statement",
        "conclusion",
        "absence",
        "fluid",
        "celestial",
        "region",
        "first",
        "edition",
        "conclusion",
        "subsequent",
        "edition",
        "quoted",
        "long",
        "first",
        "edition",
        "published",
        "newton",
        "initiated",
        "verticalfall",
        "experiment",
        "water",
        "persuaded",
        "phenomenon",
        "verticalfall",
        "resisting",
        "medium",
        "would",
        "yield",
        "much",
        "better",
        "behaved",
        "data",
        "second",
        "third",
        "edition",
        "therefore",
        "even",
        "though",
        "pendulumdecay",
        "experiment",
        "still",
        "fully",
        "reported",
        "central",
        "argument",
        "book",
        "relies",
        "verticalfall",
        "experiment",
        "including",
        "one",
        "top",
        "dome",
        "newly",
        "completed",
        "st",
        "paul",
        "s",
        "cathedral",
        "establish",
        "resistance",
        "effect",
        "sphere",
        "proportional",
        "density",
        "fluid",
        "square",
        "diameter",
        "square",
        "velocity",
        "data",
        "experiment",
        "good",
        "indeed",
        "even",
        "better",
        "newton",
        "realized",
        "small",
        "vagary",
        "dismissed",
        "experimental",
        "error",
        "fact",
        "vagary",
        "evidence",
        "polynomial",
        "sort",
        "seeking",
        "adequate",
        "resistance",
        "force",
        "verticalfall",
        "experiment",
        "put",
        "newton",
        "position",
        "make",
        "concluding",
        "rejection",
        "vortex",
        "theory",
        "forceful",
        "also",
        "posed",
        "methodological",
        "complication",
        "verticalfall",
        "experiment",
        "offered",
        "way",
        "disaggregating",
        "contribution",
        "resistance",
        "made",
        "inertia",
        "medium",
        "total",
        "resistance",
        "argument",
        "vortex",
        "required",
        "show",
        "matter",
        "perfectly",
        "free",
        "friction",
        "viscosity",
        "celestial",
        "fluid",
        "might",
        "inertia",
        "would",
        "still",
        "give",
        "rise",
        "resistance",
        "force",
        "would",
        "affect",
        "motion",
        "comet",
        "planet",
        "well",
        "resistance",
        "measured",
        "pendulumdecay",
        "experiment",
        "newton",
        "could",
        "conclude",
        "force",
        "air",
        "water",
        "dominated",
        "contribution",
        "varies",
        "velocity",
        "squared",
        "verticalfall",
        "experiment",
        "air",
        "water",
        "measured",
        "force",
        "varied",
        "first",
        "approximation",
        "product",
        "density",
        "velocity",
        "squared",
        "first",
        "approximation",
        "leaving",
        "room",
        "question",
        "whether",
        "purely",
        "inertial",
        "contribution",
        "isolated",
        "newton",
        "dealt",
        "problem",
        "offering",
        "rather",
        "ad",
        "hoc",
        "theoretical",
        "derivation",
        "purely",
        "inertial",
        "contribution",
        "showing",
        "closely",
        "agreed",
        "verticalfall",
        "result",
        "proposing",
        "difference",
        "theoretical",
        "measured",
        "resistance",
        "could",
        "used",
        "investigate",
        "contribution",
        "success",
        "program",
        "characterizing",
        "contribution",
        "made",
        "surface",
        "friction",
        "viscosity",
        "would",
        "provided",
        "compelling",
        "support",
        "newton",
        "s",
        "theory",
        "inertial",
        "contribution",
        "still",
        "approach",
        "left",
        "newton",
        "straightforward",
        "derivation",
        "law",
        "resistance",
        "force",
        "phenomenon",
        "hoped",
        "first",
        "edition",
        "fact",
        "deep",
        "mistake",
        "newton",
        "s",
        "approach",
        "resistance",
        "force",
        "came",
        "understood",
        "beginning",
        "twentieth",
        "century",
        "resistance",
        "force",
        "arise",
        "independent",
        "contribution",
        "made",
        "factor",
        "viscosity",
        "inertia",
        "fluid",
        "consequently",
        "polynomial",
        "consisting",
        "always",
        "positive",
        "term",
        "power",
        "velocity",
        "ever",
        "adequate",
        "resistance",
        "force",
        "first",
        "indication",
        "came",
        "dalembert",
        "unhappy",
        "newton",
        "s",
        "ad",
        "hoc",
        "theory",
        "inertial",
        "contribution",
        "analyzed",
        "flow",
        "call",
        "perfect",
        "fluid",
        "sphere",
        "body",
        "shape",
        "discovering",
        "case",
        "net",
        "force",
        "fluid",
        "exactly",
        "zero",
        "consequently",
        "contrary",
        "newton",
        "thing",
        "contribution",
        "made",
        "resistance",
        "purely",
        "inertia",
        "fluid",
        "resistance",
        "force",
        "always",
        "arise",
        "combination",
        "viscous",
        "inertial",
        "effect",
        "however",
        "low",
        "viscosity",
        "fluid",
        "may",
        "newton",
        "s",
        "assumption",
        "resistance",
        "force",
        "represented",
        "sum",
        "one",
        "term",
        "give",
        "contribution",
        "made",
        "purely",
        "inertia",
        "fluid",
        "wrong",
        "empirically",
        "much",
        "assumption",
        "simultaneity",
        "space",
        "euclidean",
        "turned",
        "wrong",
        "unlike",
        "latter",
        "assumption",
        "however",
        "assumption",
        "resistance",
        "amounted",
        "dead",
        "end",
        "newton",
        "achieved",
        "book",
        "resistance",
        "force",
        "merely",
        "curvefit"
    ]
}