{
    "main_text": "“Definitions” and absolute space, time, and motion\n4. “Definitions” and absolute space, time, and motion\n\n\nThe Principia opens with a section called “Definitions”\nthat includes Newton's discussion of absolute space, time, and\nmotion. No part of the Principia has received more\ndiscussion by philosophers over the three centuries since it was\npublished. Unfortunately, however, a tendency not to pay close\nattention to the text has caused much of this discussion to produce\nunnecessary\n confusion.[18]\n\n\nThe definitions inform the reader of how key technical terms, all of\nthem designating quantities, are going to be used throughout the\nPrincipia. In the process Newton introduces terms that\nhave remained a part of physics ever since, such as mass,\ninertia, and centripetal force. The emphasis in\nevery one of the definitions is on how the designated quantity is to be\nmeasured, as illustrated by the opening definition: “Quantity of matter\n[or mass] is a measure of matter that arises from its density and\nvolume jointly.” (Because a primary measure of density was then\nspecific gravity, no circularity arises here.) Newton\ndistinguishes among three ways of quantifying centripetal forces: the\nabsolute quantity, which corresponds to what we would call the field\nstrength of a central force field; the accelerative quantity, which “is\nthe measure of this force that is proportional to the acceleration\ngenerated in a given time;” and the motive quantity, which is the\nmeasure of the force proportional to what we would call the change in\nlinear momentum in a given time.\n\n\nIt is important to recognize that, in calling the referents of the\ndefined terms “quantities,” Newton is assigning them to the ontological\ncategory of quantity in Aristotle's sense. Thus force and motion\nare quantities that have direction as well as magnitude, and it makes\nno sense to talk of forces as individuated entities or\nsubstances. Newton's laws of motion and the propositions derived\nfrom them involve relations among quantities, not among objects.\nIn place of “no entity without identity,” we have “no quantity without\ndefinite\n proportions;”[19]\nand the demand on measurement is to supply\nvalues that unequivocally yield an adequate approximation to these\ndefinite proportions.\n\n\nImmediately following the eight definitions is a Scholium on space,\ntime, and motion. One source of confusion in the literature on\nthis scholium is not paying attention to the primary distinction Newton\nis drawing, which is between “absolute, true, mathematical” motion\nversus “relative, apparent, common” motion. The naive distinction\nbetween true and apparent motion was, of course, entirely\ncommonplace. Moreover, Newton is scarcely introducing it into\nastronomy. Ptolemy's principal innovation in orbital astronomy —\nthe so-called bi-section of eccentricity — entailed that half of the\nobserved first inequality in the motion of the planets arises from a\ntrue variation in speed, and half from an only apparent variation\nassociated with the observer being off center. Similarly,\nCopernicus's main point was that the second inequality — that is, the\nobserved retrograde motions of the planets — involved not true, but\nonly apparent motions. And the subsequent issue between the\nCopernican and Tychonic system concerned whether the observed annual\nmotion of the Sun through the zodiac is a true or only an apparent\nmotion of the Sun. So, what Newton is doing in the scholium on\nspace and time is not to introduce a new distinction, but to explicate\nwith more care a distinction that had been fundamental to astronomy for\ncenturies.\n\n\nThe distinctions between “absolute, true, and mathematical” and\n“relative, apparent, and common” time and space are the conceptual\nbasis Newton employs in laying out the corresponding distinction for\nmotion. He says, “relative, apparent, and common time is any\nsensible and external measure (precise or imprecise) of duration by\nmotion,” adding a parallel point about absolute space. He points\nout that the distinction between absolute and relative time has long\nbeen part of astronomy insofar as astronomers have long introduced\ncorrections (via the equation of time) to the natural day “in order to\nmeasure celestial motions on the basis of a truer time,” and he raises\nthe possibility of there being “no uniform motion by which time may\nhave an exact measure.” Absolute motion is defined as change from\none place in absolute space to another. “But since these parts of\nspace cannot be seen and cannot be distinguished from one another by\nour senses, we use sensible measures in their stead,” adding “it is\npossible that there is no body truly at rest to which places and\nmotions may be referred” [P, 410]. In short,\nboth absolute time and absolute location are quantities that cannot\nthemselves be observed, but instead have to be inferred from measures\nof relative time and location, and these measures are always only\nprovisional; that is, they are always open to the possibility of being\nreplaced by some new (still relative) measure that is deemed to be\nbetter behaved across a variety of phenomena in parallel with the way\nin which sidereal time was deemed to be preferable to solar\ntime.\n\n\nNotice here the expressed concern with measuring absolute, true,\nmathematical time, space, and motion, all of which are identified at\nthe beginning of the scholium as quantities. The scholium that\nfollows the eight definitions thus continues their concern with\nmeasures that will enable values to be assigned to the quantities in\nquestion. Newton expressly acknowledges that these measures are\nwhat we would now call theory-mediated and provisional.\nMeasurement is at the very heart of the Principia. It\npervades the definitions and scholium on space and time precisely\nbecause the primary point of this section is to spell out (in Howard\nStein's words) “the empirical content of a set of theoretical\nnotions” [Stein, 1967, 281].\n\n\nAccordingly, while Newton's distinctions between absolute and relative\ntime and space provide a conceptual basis for his explicating his\ndistinction between absolute and relative motion, absolute time and\nspace cannot enter directly into empirical reasoning insofar as they\nare not themselves empirically accessible. In other words, the\nPrincipia presupposes absolute time and space for purposes of\nconceptualizing the aim of measurement, but the measurements themselves\nare always of relative time and space, and the preferred measures are\nthose deemed to be providing the best approximations to the absolute\nquantities. Newton never presupposes absolute time and space in\nhis empirical reasoning. Motion in the planetary system is\nreferred to the fixed stars, which are provisionally being taken as an\nappropriate reference for measurement, and sidereal time is\nprovisionally taken as the preferred approximation to absolute\ntime. Moreover, in the corollaries to the laws of motion Newton\nspecifically renounces the need to worry about absolute versus relative\nmotion in two cases:\n\n\n Corollary 5. When bodies are\nenclosed in a given space, their motions in relation to one another are\nthe same whether the space is at rest or whether it is moving uniformly\nstraight forward without circular motion.\n\n Corollary 6. If bodies are\nmoving in any way whatsoever with respect to one another and are urged\nby equal accelerative forces along parallel lines, they will all\ncontinue to move with respect to one another in the same way as they\nwould if they were not acted on by those forces.\n\n\n\nSo, while the Principia presupposes absolute time and space\nfor purposes of conceptualizing absolute motion, the presuppositions\nunderlying all the empirical reasoning about actual motions are\nphilosophically more modest.\n\n\nIf absolute time and space cannot serve to distinguish absolute from\nrelative motions — more precisely, absolute from relative\nchanges of motion — empirically, then what can? Newton\nanswers, “The causes which distinguish true motions from relative\nmotions are the forces impressed upon bodies to generate motion.\nTrue motion is neither generated nor changed except by forces impressed\nupon the moving body itself.” The problem then becomes one of\ndistinguishing the forces impressed on bodies, where forces are\nquantities; and hence the key issue is whether there are\ntheory-mediated measures of them that yield unequivocal values — in\ncontrast to different measures of the same force that yield different\nvalues, the hallmark of relative motion. The famous bucket\nexample that follows is offered as illustrating how forces can be\ndistinguished that will then distinguish between true and apparent\nmotion. The final paragraph of the scholium begins and ends as\nfollows:\n\n\nIt is certainly very difficult to find out the true motions of\nindividual bodies and actually to differentiate them from apparent\nmotions, because the parts of that immovable space in which the bodies\ntruly move make no impression on the senses. But the situation is\nnot utterly hopeless…. But in what follows, a fuller explanation\nwill be given of how to determine true motions from their causes,\neffects, and apparent differences, and, conversely, of how to determine\nfrom motions, whether true or apparent, their causes and effects.\nFor this was the purpose for which I composed the following treatise.\n[P, 414f]\n\n\nWhat does follow are two books of propositions that provide means\nfor inferring forces from motions and motions from forces and a final\nbook that illustrates how these propositions can be applied to the\nsystem of the world first to identify the forces governing motion in\nour planetary system and then to use them to differentiate between\ncertain true and apparent motions of particular interest. In this\nrespect, the empirical content of the theoretical concepts that Newton\nhas explicated in the section called “Definitions” is inextricably\nlinked with the physical theory presented in the rest of the\nPrincipia.\n\n\nThe contention that the empirical reasoning in the Principia\ndoes not presuppose an unbridled form of absolute time and space should\nnot be taken as suggesting that Newton's theory is free of fundamental\nassumptions about time and space that have subsequently proved to be\nproblematic. For example, in the case of space, Newton\npresupposes that the geometric structure governing which lines are\nparallel and what the distances are between two points is\nthree-dimensional and Euclidean. In the case of time Newton\npresupposes that, with suitable corrections for such factors as the\nspeed of light, questions about whether two celestial events happened\nat the same time can in principle always have a definite answer.\nAnd the appeal to forces to distinguish real from apparent non-inertial\nmotions presupposes that free-fall under gravity can always, at least\nin principle, be distinguished from inertial\n motion.[20]\n\n\nEqually, the contention that the empirical reasoning in the\nPrincipia does not presuppose an unbridled form of absolute\nspace should not be taken as denying that Newton invoked absolute space\nas his means for conceptualizing true deviations from inertial\nmotion. Corollary 5 to the Laws of Motion, quoted above, put him\nin a position to introduce the notion of an inertial frame, but he did\nnot do so, perhaps in part because Corollary 6 showed that even using\nan inertial frame to define deviations from inertial motion would not\nsuffice. Empirically, nevertheless, the Principia\nfollows astronomical practice in treating celestial motions relative to\nthe fixed stars, and one of its key empirical conclusions (Book 3,\nProp. 14, Corol. 1) is that the fixed stars are at rest with respect to\nthe center of gravity of our planetary system.\n",
    "section_title": "4. “Definitions” and absolute space, time, and motion",
    "entry_title": "Newton’s Philosophiae Naturalis Principia Mathematica",
    "hierarchy_title": "Newton’s Philosophiae Naturalis Principia Mathematica || “Definitions” and absolute space, time, and motion",
    "tokenized_text": [
        "definition",
        "absolute",
        "space",
        "time",
        "motion",
        "definition",
        "absolute",
        "space",
        "time",
        "motion",
        "principia",
        "open",
        "section",
        "called",
        "definition",
        "includes",
        "newton",
        "s",
        "discussion",
        "absolute",
        "space",
        "time",
        "motion",
        "part",
        "principia",
        "received",
        "discussion",
        "philosopher",
        "three",
        "century",
        "since",
        "published",
        "unfortunately",
        "however",
        "tendency",
        "pay",
        "close",
        "attention",
        "text",
        "caused",
        "much",
        "discussion",
        "produce",
        "unnecessary",
        "confusion",
        "definition",
        "inform",
        "reader",
        "key",
        "technical",
        "term",
        "designating",
        "quantity",
        "going",
        "used",
        "throughout",
        "principia",
        "process",
        "newton",
        "introduces",
        "term",
        "remained",
        "part",
        "physic",
        "ever",
        "since",
        "mass",
        "inertia",
        "centripetal",
        "force",
        "emphasis",
        "every",
        "one",
        "definition",
        "designated",
        "quantity",
        "measured",
        "illustrated",
        "opening",
        "definition",
        "quantity",
        "matter",
        "mass",
        "measure",
        "matter",
        "arises",
        "density",
        "volume",
        "jointly",
        "primary",
        "measure",
        "density",
        "specific",
        "gravity",
        "circularity",
        "arises",
        "newton",
        "distinguishes",
        "among",
        "three",
        "way",
        "quantifying",
        "centripetal",
        "force",
        "absolute",
        "quantity",
        "corresponds",
        "would",
        "call",
        "field",
        "strength",
        "central",
        "force",
        "field",
        "accelerative",
        "quantity",
        "measure",
        "force",
        "proportional",
        "acceleration",
        "generated",
        "given",
        "time",
        "motive",
        "quantity",
        "measure",
        "force",
        "proportional",
        "would",
        "call",
        "change",
        "linear",
        "momentum",
        "given",
        "time",
        "important",
        "recognize",
        "calling",
        "referent",
        "defined",
        "term",
        "quantity",
        "newton",
        "assigning",
        "ontological",
        "category",
        "quantity",
        "aristotle",
        "s",
        "sense",
        "thus",
        "force",
        "motion",
        "quantity",
        "direction",
        "well",
        "magnitude",
        "make",
        "sense",
        "talk",
        "force",
        "individuated",
        "entity",
        "substance",
        "newton",
        "s",
        "law",
        "motion",
        "proposition",
        "derived",
        "involve",
        "relation",
        "among",
        "quantity",
        "among",
        "object",
        "place",
        "entity",
        "without",
        "identity",
        "quantity",
        "without",
        "definite",
        "proportion",
        "demand",
        "measurement",
        "supply",
        "value",
        "unequivocally",
        "yield",
        "adequate",
        "approximation",
        "definite",
        "proportion",
        "immediately",
        "following",
        "eight",
        "definition",
        "scholium",
        "space",
        "time",
        "motion",
        "one",
        "source",
        "confusion",
        "literature",
        "scholium",
        "paying",
        "attention",
        "primary",
        "distinction",
        "newton",
        "drawing",
        "absolute",
        "true",
        "mathematical",
        "motion",
        "versus",
        "relative",
        "apparent",
        "common",
        "motion",
        "naive",
        "distinction",
        "true",
        "apparent",
        "motion",
        "course",
        "entirely",
        "commonplace",
        "moreover",
        "newton",
        "scarcely",
        "introducing",
        "astronomy",
        "ptolemy",
        "s",
        "principal",
        "innovation",
        "orbital",
        "astronomy",
        "socalled",
        "bisection",
        "eccentricity",
        "entailed",
        "half",
        "observed",
        "first",
        "inequality",
        "motion",
        "planet",
        "arises",
        "true",
        "variation",
        "speed",
        "half",
        "apparent",
        "variation",
        "associated",
        "observer",
        "center",
        "similarly",
        "copernicus",
        "s",
        "main",
        "point",
        "second",
        "inequality",
        "observed",
        "retrograde",
        "motion",
        "planet",
        "involved",
        "true",
        "apparent",
        "motion",
        "subsequent",
        "issue",
        "copernican",
        "tychonic",
        "system",
        "concerned",
        "whether",
        "observed",
        "annual",
        "motion",
        "sun",
        "zodiac",
        "true",
        "apparent",
        "motion",
        "sun",
        "newton",
        "scholium",
        "space",
        "time",
        "introduce",
        "new",
        "distinction",
        "explicate",
        "care",
        "distinction",
        "fundamental",
        "astronomy",
        "century",
        "distinction",
        "absolute",
        "true",
        "mathematical",
        "relative",
        "apparent",
        "common",
        "time",
        "space",
        "conceptual",
        "basis",
        "newton",
        "employ",
        "laying",
        "corresponding",
        "distinction",
        "motion",
        "say",
        "relative",
        "apparent",
        "common",
        "time",
        "sensible",
        "external",
        "measure",
        "precise",
        "imprecise",
        "duration",
        "motion",
        "adding",
        "parallel",
        "point",
        "absolute",
        "space",
        "point",
        "distinction",
        "absolute",
        "relative",
        "time",
        "long",
        "part",
        "astronomy",
        "insofar",
        "astronomer",
        "long",
        "introduced",
        "correction",
        "via",
        "equation",
        "time",
        "natural",
        "day",
        "order",
        "measure",
        "celestial",
        "motion",
        "basis",
        "truer",
        "time",
        "raise",
        "possibility",
        "uniform",
        "motion",
        "time",
        "may",
        "exact",
        "measure",
        "absolute",
        "motion",
        "defined",
        "change",
        "one",
        "place",
        "absolute",
        "space",
        "another",
        "since",
        "part",
        "space",
        "seen",
        "distinguished",
        "one",
        "another",
        "sens",
        "use",
        "sensible",
        "measure",
        "stead",
        "adding",
        "possible",
        "body",
        "truly",
        "rest",
        "place",
        "motion",
        "may",
        "referred",
        "p",
        "short",
        "absolute",
        "time",
        "absolute",
        "location",
        "quantity",
        "observed",
        "instead",
        "inferred",
        "measure",
        "relative",
        "time",
        "location",
        "measure",
        "always",
        "provisional",
        "always",
        "open",
        "possibility",
        "replaced",
        "new",
        "still",
        "relative",
        "measure",
        "deemed",
        "better",
        "behaved",
        "across",
        "variety",
        "phenomenon",
        "parallel",
        "way",
        "sidereal",
        "time",
        "deemed",
        "preferable",
        "solar",
        "time",
        "notice",
        "expressed",
        "concern",
        "measuring",
        "absolute",
        "true",
        "mathematical",
        "time",
        "space",
        "motion",
        "identified",
        "beginning",
        "scholium",
        "quantity",
        "scholium",
        "follows",
        "eight",
        "definition",
        "thus",
        "continues",
        "concern",
        "measure",
        "enable",
        "value",
        "assigned",
        "quantity",
        "question",
        "newton",
        "expressly",
        "acknowledges",
        "measure",
        "would",
        "call",
        "theorymediated",
        "provisional",
        "measurement",
        "heart",
        "principia",
        "pervades",
        "definition",
        "scholium",
        "space",
        "time",
        "precisely",
        "primary",
        "point",
        "section",
        "spell",
        "howard",
        "stein",
        "s",
        "word",
        "empirical",
        "content",
        "set",
        "theoretical",
        "notion",
        "stein",
        "accordingly",
        "newton",
        "s",
        "distinction",
        "absolute",
        "relative",
        "time",
        "space",
        "provide",
        "conceptual",
        "basis",
        "explicating",
        "distinction",
        "absolute",
        "relative",
        "motion",
        "absolute",
        "time",
        "space",
        "enter",
        "directly",
        "empirical",
        "reasoning",
        "insofar",
        "empirically",
        "accessible",
        "word",
        "principia",
        "presupposes",
        "absolute",
        "time",
        "space",
        "purpose",
        "conceptualizing",
        "aim",
        "measurement",
        "measurement",
        "always",
        "relative",
        "time",
        "space",
        "preferred",
        "measure",
        "deemed",
        "providing",
        "best",
        "approximation",
        "absolute",
        "quantity",
        "newton",
        "never",
        "presupposes",
        "absolute",
        "time",
        "space",
        "empirical",
        "reasoning",
        "motion",
        "planetary",
        "system",
        "referred",
        "fixed",
        "star",
        "provisionally",
        "taken",
        "appropriate",
        "reference",
        "measurement",
        "sidereal",
        "time",
        "provisionally",
        "taken",
        "preferred",
        "approximation",
        "absolute",
        "time",
        "moreover",
        "corollary",
        "law",
        "motion",
        "newton",
        "specifically",
        "renounces",
        "need",
        "worry",
        "absolute",
        "versus",
        "relative",
        "motion",
        "two",
        "case",
        "corollary",
        "body",
        "enclosed",
        "given",
        "space",
        "motion",
        "relation",
        "one",
        "another",
        "whether",
        "space",
        "rest",
        "whether",
        "moving",
        "uniformly",
        "straight",
        "forward",
        "without",
        "circular",
        "motion",
        "corollary",
        "body",
        "moving",
        "way",
        "whatsoever",
        "respect",
        "one",
        "another",
        "urged",
        "equal",
        "accelerative",
        "force",
        "along",
        "parallel",
        "line",
        "continue",
        "move",
        "respect",
        "one",
        "another",
        "way",
        "would",
        "acted",
        "force",
        "principia",
        "presupposes",
        "absolute",
        "time",
        "space",
        "purpose",
        "conceptualizing",
        "absolute",
        "motion",
        "presupposition",
        "underlying",
        "empirical",
        "reasoning",
        "actual",
        "motion",
        "philosophically",
        "modest",
        "absolute",
        "time",
        "space",
        "serve",
        "distinguish",
        "absolute",
        "relative",
        "motion",
        "precisely",
        "absolute",
        "relative",
        "change",
        "motion",
        "empirically",
        "newton",
        "answer",
        "cause",
        "distinguish",
        "true",
        "motion",
        "relative",
        "motion",
        "force",
        "impressed",
        "upon",
        "body",
        "generate",
        "motion",
        "true",
        "motion",
        "neither",
        "generated",
        "changed",
        "except",
        "force",
        "impressed",
        "upon",
        "moving",
        "body",
        "itself",
        "problem",
        "becomes",
        "one",
        "distinguishing",
        "force",
        "impressed",
        "body",
        "force",
        "quantity",
        "hence",
        "key",
        "issue",
        "whether",
        "theorymediated",
        "measure",
        "yield",
        "unequivocal",
        "value",
        "contrast",
        "different",
        "measure",
        "force",
        "yield",
        "different",
        "value",
        "hallmark",
        "relative",
        "motion",
        "famous",
        "bucket",
        "example",
        "follows",
        "offered",
        "illustrating",
        "force",
        "distinguished",
        "distinguish",
        "true",
        "apparent",
        "motion",
        "final",
        "paragraph",
        "scholium",
        "begin",
        "end",
        "follows",
        "certainly",
        "difficult",
        "find",
        "true",
        "motion",
        "individual",
        "body",
        "actually",
        "differentiate",
        "apparent",
        "motion",
        "part",
        "immovable",
        "space",
        "body",
        "truly",
        "move",
        "make",
        "impression",
        "sens",
        "situation",
        "utterly",
        "hopeless",
        "follows",
        "fuller",
        "explanation",
        "given",
        "determine",
        "true",
        "motion",
        "cause",
        "effect",
        "apparent",
        "difference",
        "conversely",
        "determine",
        "motion",
        "whether",
        "true",
        "apparent",
        "cause",
        "effect",
        "purpose",
        "composed",
        "following",
        "treatise",
        "p",
        "f",
        "follow",
        "two",
        "book",
        "proposition",
        "provide",
        "mean",
        "inferring",
        "force",
        "motion",
        "motion",
        "force",
        "final",
        "book",
        "illustrates",
        "proposition",
        "applied",
        "system",
        "world",
        "first",
        "identify",
        "force",
        "governing",
        "motion",
        "planetary",
        "system",
        "use",
        "differentiate",
        "certain",
        "true",
        "apparent",
        "motion",
        "particular",
        "interest",
        "respect",
        "empirical",
        "content",
        "theoretical",
        "concept",
        "newton",
        "explicated",
        "section",
        "called",
        "definition",
        "inextricably",
        "linked",
        "physical",
        "theory",
        "presented",
        "rest",
        "principia",
        "contention",
        "empirical",
        "reasoning",
        "principia",
        "presuppose",
        "unbridled",
        "form",
        "absolute",
        "time",
        "space",
        "taken",
        "suggesting",
        "newton",
        "s",
        "theory",
        "free",
        "fundamental",
        "assumption",
        "time",
        "space",
        "subsequently",
        "proved",
        "problematic",
        "example",
        "case",
        "space",
        "newton",
        "presupposes",
        "geometric",
        "structure",
        "governing",
        "line",
        "parallel",
        "distance",
        "two",
        "point",
        "threedimensional",
        "euclidean",
        "case",
        "time",
        "newton",
        "presupposes",
        "suitable",
        "correction",
        "factor",
        "speed",
        "light",
        "question",
        "whether",
        "two",
        "celestial",
        "event",
        "happened",
        "time",
        "principle",
        "always",
        "definite",
        "answer",
        "appeal",
        "force",
        "distinguish",
        "real",
        "apparent",
        "noninertial",
        "motion",
        "presupposes",
        "freefall",
        "gravity",
        "always",
        "least",
        "principle",
        "distinguished",
        "inertial",
        "motion",
        "equally",
        "contention",
        "empirical",
        "reasoning",
        "principia",
        "presuppose",
        "unbridled",
        "form",
        "absolute",
        "space",
        "taken",
        "denying",
        "newton",
        "invoked",
        "absolute",
        "space",
        "mean",
        "conceptualizing",
        "true",
        "deviation",
        "inertial",
        "motion",
        "corollary",
        "law",
        "motion",
        "quoted",
        "put",
        "position",
        "introduce",
        "notion",
        "inertial",
        "frame",
        "perhaps",
        "part",
        "corollary",
        "showed",
        "even",
        "using",
        "inertial",
        "frame",
        "define",
        "deviation",
        "inertial",
        "motion",
        "would",
        "suffice",
        "empirically",
        "nevertheless",
        "principia",
        "follows",
        "astronomical",
        "practice",
        "treating",
        "celestial",
        "motion",
        "relative",
        "fixed",
        "star",
        "one",
        "key",
        "empirical",
        "conclusion",
        "book",
        "prop",
        "corol",
        "fixed",
        "star",
        "rest",
        "respect",
        "center",
        "gravity",
        "planetary",
        "system"
    ]
}