{
    "main_text": "Overview: The Importance of the Work\n1. Overview: The Importance of the Work\n\n\nViewed retrospectively, no work was more seminal in the development\nof modern physics and astronomy than Newton's\nPrincipia. Its conclusion that the force retaining the\nplanets in their orbits is one in kind with terrestrial gravity ended\nforever the view dating back at least to Aristotle that the celestial\nrealm calls for one science and the sublunar realm, another. Just\nas the Preface to its first edition had proposed, the ultimate success\nof Newton's theory of gravity made the identification of the\nfundamental forces of nature and their characterization in laws the\nprimary pursuit of physics. The success of the theory led as well\nto a new conception of exact science under which every\nsystematic discrepancy between observation and theory, no matter how\nsmall, is taken as telling us something important about the\nworld. And, once it became clear that the theory of gravity\nprovided a far more effective means than observation for precisely\ncharacterizing complex orbital motions — just as Newton had proposed\nin the Principia in the case of the orbit of the Moon —\nphysical theory gained primacy over observation for purposes of\nanswering specific questions about the world.\n\n\n The retrospective view of the Principia has been\ndifferent in the aftermath of Einstein's special and general theories\nof relativity from what it was throughout the nineteenth century.\nNewtonian theory is now seen to hold only to high approximation in\nlimited circumstances in much the way that Galileo's and Huygens's\nresults for motion under uniform gravity came to be seen as holding\nonly to high approximation in the aftermath of Newtonian inverse-square\ngravity. In the middle of the nineteenth century, however, when\nthere was no reason to think that any confuting discrepancy between\nNewtonian theory and observation was ever going to emerge, the\nPrincipia was viewed as the exemplar of perfection in\nempirical science in much the way that Euclid's Elements had\nbeen viewed as the exemplar of perfection in mathematics at the\nbeginning of the seventeenth century. Because of the extent to\nwhich Einsteinian theory was grounded historically on Newtonian\nscience, the Principia has retained its unique seminal\nposition in the history of physics in our post-Newtonian era.\nPerhaps more strikingly, because of the logical relationship between\nNewtonian and Einsteinian theory — Einstein showed that Newtonian\ngravity holds as a limit-case of general relativity in just the way\nNewton showed (in Book 1, Section 10) that Galilean uniform gravity\nholds as a limit-case of inverse-square gravity — even though the\nPrincipia can no longer be regarded as an exemplar of\nperfection, it is still widely regarded by physicists as an exemplar of\nempirical science at its best.\n\n\nIn spite of extravagant claims made about the Principia by\nsome in the years after it first appeared — “… he seems to have\nexhausted his Argument, and left little to be done by those that shall\nsucceed\n him”[1]\n—\nthe most positive view of it that anyone could have substantiated\nduring the first half of the eighteenth century would have emphasized\nits promise more than its achievements. The theory of gravity had\ntoo many loose ends, the most glaring of which was a factor of 2\ndiscrepancy in the mean motion of the lunar apogee, a discrepancy that\nundercut the claim that the Moon is held in orbit by an inverse-square\nforce. No one knew these loose ends better than Newton himself,\nyet no one had a greater sense of the potential of the theory of\ngravity to resolve a whole host of questions in planetary astronomy —\nwhich may well explain why he made these loose ends difficult to see\nexcept by the most technically skilled, careful readers. Between\nthe late 1730s and the early 1750s the situation changed dramatically\nwhen several of the loose ends were tied up, in some cases yielding\nsuch extraordinary results as the first truly successful descriptive\naccount of the motion of the Moon in the history of astronomy.\nDuring the second half of the eighteenth century the promise of the\nPrincipia was not only universally recognized by those active\nin empirical research, but a large fraction of this promise was\nrealized. What we now call “Newtonian mechanics” emerged in this\nprocess, as did the gravity-based accounts of the often substantial\ndivergences of the planets from Keplerian motion, the achievement of\nNewton's theory of gravity that ultimately ended all opposition to\nit.\n\n\nDuring the eighteenth century the Principia was also seen as\nputting forward a world view directly in opposition to the broadly\nCartesian world view that in many circles had taken over from the\nScholastic world view during the second half of the seventeenth\ncentury. Newton clearly intended the work to be viewed in this\nway when in 1686 he changed its title to Philosophiae Naturalis\nPrincipia Mathematica, in allusion to Descartes's most prominent\nwork at the time, Principia Philosophiae. (The title\npage of Newton's first edition underscored this allusion by placing the\nfirst and third words of the title in larger type.) The main\ndifference in the world view in Newton's Principia was to rid\nthe celestial spaces of vortices carrying the planets. Newtonians\nsubsequently went beyond Newton in enhancing this world view in various\nways, including forces everywhere expressly acting at a distance.\nThe “clockwork universe” aspect of the Newtonian world view, for\nexample, is not to be found in the Principia; it was added by\nLaplace late in the eighteenth century, after the success of the theory\nof gravity in accounting for complex deviations from Keplerian motion\nbecame fully evident.\n\n\nIn addition to viewing the theory of gravity as potentially\ntransforming orbital astronomy, Newton saw the Principia as\nillustrating a new way of doing natural philosophy. One aspect of\nthis new way, announced in the Preface to the first edition, was the\nfocus on forces:\n\n\nFor the whole difficulty of philosophy seems to be to discover the\nforces of nature from the phenomena of motions and then to demonstrate\nthe other phenomena from these forces. It is to these ends that\nthe general propositions in books 1 and 2 are directed, while in book 3\nour explication of the system of the world illustrates these\npropositions. For in book 3, by means of propositions\ndemonstrated mathematically in books 1 and 2, we derive from celestial\nphenomena the gravitational forces by which bodies tend toward the sun\nand toward the individual planets. Then the motions of the\nplanets, the comets, the moon, and the sea are deduced from these\nforces by propositions that are also mathematical. If only we\ncould derive the other phenomena of nature from mechanical principles\nby the same kind of reasoning! For many things lead me to have a\nsuspicion that all phenomena may depend on certain forces by which\nparticles of bodies, by causes not yet known, either are impelled\ntoward one another and cohere in regular figures, or are repelled from\none another and recede. Since these forces are unknown,\nphilosophers have hitherto made trial of nature in vain. But I\nhope that the principles set down here will shed some light on either\nthis mode of philosophizing or some truer one. [P,\n 382][2]\n\n\nA second aspect of the new method concerns the use of mathematical\ntheory not to derive testable conclusions from hypotheses, as Galileo\nand Huygens had done, but to cover a full range of alternative\ntheoretical possibilities, enabling the empirical world then to select\namong them. This new approach is spelled out most forcefully at the\nend of Book 1, Section 11:\n\n\nI use the word “attraction” here in a general sense for any endeavor\nwhatever of bodies to approach one another, whether that endeavor\noccurs as a result of the action of the bodies either drawn toward one\nanother or acting on one another by means of spirits emitted or\nwhether it arises from the action of ether or of air or of any medium\nwhatsoever — whether corporeal or incorporeal — in any way\nimpelling toward one another the bodies floating therein. I use the\nword “impulse” in the same general sense, considering in this treatise\nnot the species of forces and their physical qualities but their\nquantities and mathematical proportions, as I have explained in the\ndefinitions.  Mathematics requires an investigation of those\nquantities of forces and their proportions that follow from any\nconditions that may be supposed. Then, coming down to physics, these\nproportions must be compared with the phenomena, so that it may be\nfound out which conditions of forces apply to each kind of attracting\nbodies. And then, finally, it will be possible to argue more securely\nconcerning the physical species, physical causes, and physical\nproportions of these forces. [P, 588]\n\n\n A third aspect of the new method, which proved most controversial at\nthe time, was the willingness to hold questions about the mechanism\nthrough which forces effect their changes in motion in abeyance, even\nwhen the mathematical theory of the species and proportions of the\nforces seemed to leave no alternative but action at a distance. This\naspect remained somewhat tacit in the first edition, but then, in\nresponse to criticisms it received, was made polemically explicit in\nthe General Scholium added at the end of the second edition:\n\n\n I have not as yet been able to deduce from phenomena the reason for\nthese properties of gravity, and I do not feign hypotheses. For\nwhatever is not deduced from the phenomena must be called a\nhypothesis; and hypotheses, whether metaphysical or physical, or based\non occult qualities, or mechanical, have no place in experimental\nphilosophy. In this experimental philosophy, propositions are deduced\nfrom the phenomena and are made general by induction. The\nimpenetrability, mobility, and impetus of bodies and the laws of\nmotion and law of gravity have been found by this method. And it is\nenough that gravity should really exist and should act according to\nthe laws that we have set forth and should suffice for all the motions\nof the heavenly bodies and of our sea.  [P,\n 943][3]\n\n\nDuring most of the eighteenth century the primary challenge the\nPrincipia presented to philosophers revolved around what to\nmake of a mathematical theory of forces in the absence of a mechanism,\nother than action at a distance, through which these forces work.  By\nthe last decades of the century, however, little room remained for\nquestioning whether gravity does act according to the laws that Newton\nhad set forth and does suffice for all the motions of the heavenly\nbodies and of our sea. No one could deny that a science had emerged\nthat, at least in certain respects, so far exceeded anything that had\never gone before that it stood alone as the ultimate exemplar of\nscience generally. The challenge to philosophers then became one of\nspelling out first the precise nature and limits of the knowledge\nattained in this science and then how, methodologically, this\nextraordinary advance had been achieved, with a view to enabling other\nareas of inquiry to follow suit.\n",
    "section_title": "1. Overview: The Importance of the Work",
    "entry_title": "Newton’s Philosophiae Naturalis Principia Mathematica",
    "hierarchy_title": "Newton’s Philosophiae Naturalis Principia Mathematica || Overview: The Importance of the Work",
    "tokenized_text": [
        "overview",
        "importance",
        "work",
        "overview",
        "importance",
        "work",
        "viewed",
        "retrospectively",
        "work",
        "seminal",
        "development",
        "modern",
        "physic",
        "astronomy",
        "newton",
        "s",
        "principia",
        "conclusion",
        "force",
        "retaining",
        "planet",
        "orbit",
        "one",
        "kind",
        "terrestrial",
        "gravity",
        "ended",
        "forever",
        "view",
        "dating",
        "back",
        "least",
        "aristotle",
        "celestial",
        "realm",
        "call",
        "one",
        "science",
        "sublunar",
        "realm",
        "another",
        "preface",
        "first",
        "edition",
        "proposed",
        "ultimate",
        "success",
        "newton",
        "s",
        "theory",
        "gravity",
        "made",
        "identification",
        "fundamental",
        "force",
        "nature",
        "characterization",
        "law",
        "primary",
        "pursuit",
        "physic",
        "success",
        "theory",
        "led",
        "well",
        "new",
        "conception",
        "exact",
        "science",
        "every",
        "systematic",
        "discrepancy",
        "observation",
        "theory",
        "matter",
        "small",
        "taken",
        "telling",
        "u",
        "something",
        "important",
        "world",
        "became",
        "clear",
        "theory",
        "gravity",
        "provided",
        "far",
        "effective",
        "mean",
        "observation",
        "precisely",
        "characterizing",
        "complex",
        "orbital",
        "motion",
        "newton",
        "proposed",
        "principia",
        "case",
        "orbit",
        "moon",
        "physical",
        "theory",
        "gained",
        "primacy",
        "observation",
        "purpose",
        "answering",
        "specific",
        "question",
        "world",
        "retrospective",
        "view",
        "principia",
        "different",
        "aftermath",
        "einstein",
        "s",
        "special",
        "general",
        "theory",
        "relativity",
        "throughout",
        "nineteenth",
        "century",
        "newtonian",
        "theory",
        "seen",
        "hold",
        "high",
        "approximation",
        "limited",
        "circumstance",
        "much",
        "way",
        "galileo",
        "s",
        "huygens",
        "s",
        "result",
        "motion",
        "uniform",
        "gravity",
        "came",
        "seen",
        "holding",
        "high",
        "approximation",
        "aftermath",
        "newtonian",
        "inversesquare",
        "gravity",
        "middle",
        "nineteenth",
        "century",
        "however",
        "reason",
        "think",
        "confuting",
        "discrepancy",
        "newtonian",
        "theory",
        "observation",
        "ever",
        "going",
        "emerge",
        "principia",
        "viewed",
        "exemplar",
        "perfection",
        "empirical",
        "science",
        "much",
        "way",
        "euclid",
        "s",
        "element",
        "viewed",
        "exemplar",
        "perfection",
        "mathematics",
        "beginning",
        "seventeenth",
        "century",
        "extent",
        "einsteinian",
        "theory",
        "grounded",
        "historically",
        "newtonian",
        "science",
        "principia",
        "retained",
        "unique",
        "seminal",
        "position",
        "history",
        "physic",
        "postnewtonian",
        "era",
        "perhaps",
        "strikingly",
        "logical",
        "relationship",
        "newtonian",
        "einsteinian",
        "theory",
        "einstein",
        "showed",
        "newtonian",
        "gravity",
        "hold",
        "limitcase",
        "general",
        "relativity",
        "way",
        "newton",
        "showed",
        "book",
        "section",
        "galilean",
        "uniform",
        "gravity",
        "hold",
        "limitcase",
        "inversesquare",
        "gravity",
        "even",
        "though",
        "principia",
        "longer",
        "regarded",
        "exemplar",
        "perfection",
        "still",
        "widely",
        "regarded",
        "physicist",
        "exemplar",
        "empirical",
        "science",
        "best",
        "spite",
        "extravagant",
        "claim",
        "made",
        "principia",
        "year",
        "first",
        "appeared",
        "seems",
        "exhausted",
        "argument",
        "left",
        "little",
        "done",
        "shall",
        "succeed",
        "positive",
        "view",
        "anyone",
        "could",
        "substantiated",
        "first",
        "half",
        "eighteenth",
        "century",
        "would",
        "emphasized",
        "promise",
        "achievement",
        "theory",
        "gravity",
        "many",
        "loose",
        "end",
        "glaring",
        "factor",
        "discrepancy",
        "mean",
        "motion",
        "lunar",
        "apogee",
        "discrepancy",
        "undercut",
        "claim",
        "moon",
        "held",
        "orbit",
        "inversesquare",
        "force",
        "one",
        "knew",
        "loose",
        "end",
        "better",
        "newton",
        "yet",
        "one",
        "greater",
        "sense",
        "potential",
        "theory",
        "gravity",
        "resolve",
        "whole",
        "host",
        "question",
        "planetary",
        "astronomy",
        "may",
        "well",
        "explain",
        "made",
        "loose",
        "end",
        "difficult",
        "see",
        "except",
        "technically",
        "skilled",
        "careful",
        "reader",
        "late",
        "s",
        "early",
        "s",
        "situation",
        "changed",
        "dramatically",
        "several",
        "loose",
        "end",
        "tied",
        "case",
        "yielding",
        "extraordinary",
        "result",
        "first",
        "truly",
        "successful",
        "descriptive",
        "account",
        "motion",
        "moon",
        "history",
        "astronomy",
        "second",
        "half",
        "eighteenth",
        "century",
        "promise",
        "principia",
        "universally",
        "recognized",
        "active",
        "empirical",
        "research",
        "large",
        "fraction",
        "promise",
        "realized",
        "call",
        "newtonian",
        "mechanic",
        "emerged",
        "process",
        "gravitybased",
        "account",
        "often",
        "substantial",
        "divergence",
        "planet",
        "keplerian",
        "motion",
        "achievement",
        "newton",
        "s",
        "theory",
        "gravity",
        "ultimately",
        "ended",
        "opposition",
        "eighteenth",
        "century",
        "principia",
        "also",
        "seen",
        "putting",
        "forward",
        "world",
        "view",
        "directly",
        "opposition",
        "broadly",
        "cartesian",
        "world",
        "view",
        "many",
        "circle",
        "taken",
        "scholastic",
        "world",
        "view",
        "second",
        "half",
        "seventeenth",
        "century",
        "newton",
        "clearly",
        "intended",
        "work",
        "viewed",
        "way",
        "changed",
        "title",
        "philosophiae",
        "naturalis",
        "principia",
        "mathematica",
        "allusion",
        "descartes",
        "s",
        "prominent",
        "work",
        "time",
        "principia",
        "philosophiae",
        "title",
        "page",
        "newton",
        "s",
        "first",
        "edition",
        "underscored",
        "allusion",
        "placing",
        "first",
        "third",
        "word",
        "title",
        "larger",
        "type",
        "main",
        "difference",
        "world",
        "view",
        "newton",
        "s",
        "principia",
        "rid",
        "celestial",
        "space",
        "vortex",
        "carrying",
        "planet",
        "newtonian",
        "subsequently",
        "went",
        "beyond",
        "newton",
        "enhancing",
        "world",
        "view",
        "various",
        "way",
        "including",
        "force",
        "everywhere",
        "expressly",
        "acting",
        "distance",
        "clockwork",
        "universe",
        "aspect",
        "newtonian",
        "world",
        "view",
        "example",
        "found",
        "principia",
        "added",
        "laplace",
        "late",
        "eighteenth",
        "century",
        "success",
        "theory",
        "gravity",
        "accounting",
        "complex",
        "deviation",
        "keplerian",
        "motion",
        "became",
        "fully",
        "evident",
        "addition",
        "viewing",
        "theory",
        "gravity",
        "potentially",
        "transforming",
        "orbital",
        "astronomy",
        "newton",
        "saw",
        "principia",
        "illustrating",
        "new",
        "way",
        "natural",
        "philosophy",
        "one",
        "aspect",
        "new",
        "way",
        "announced",
        "preface",
        "first",
        "edition",
        "focus",
        "force",
        "whole",
        "difficulty",
        "philosophy",
        "seems",
        "discover",
        "force",
        "nature",
        "phenomenon",
        "motion",
        "demonstrate",
        "phenomenon",
        "force",
        "end",
        "general",
        "proposition",
        "book",
        "directed",
        "book",
        "explication",
        "system",
        "world",
        "illustrates",
        "proposition",
        "book",
        "mean",
        "proposition",
        "demonstrated",
        "mathematically",
        "book",
        "derive",
        "celestial",
        "phenomenon",
        "gravitational",
        "force",
        "body",
        "tend",
        "toward",
        "sun",
        "toward",
        "individual",
        "planet",
        "motion",
        "planet",
        "comet",
        "moon",
        "sea",
        "deduced",
        "force",
        "proposition",
        "also",
        "mathematical",
        "could",
        "derive",
        "phenomenon",
        "nature",
        "mechanical",
        "principle",
        "kind",
        "reasoning",
        "many",
        "thing",
        "lead",
        "suspicion",
        "phenomenon",
        "may",
        "depend",
        "certain",
        "force",
        "particle",
        "body",
        "cause",
        "yet",
        "known",
        "either",
        "impelled",
        "toward",
        "one",
        "another",
        "cohere",
        "regular",
        "figure",
        "repelled",
        "one",
        "another",
        "recede",
        "since",
        "force",
        "unknown",
        "philosopher",
        "hitherto",
        "made",
        "trial",
        "nature",
        "vain",
        "hope",
        "principle",
        "set",
        "shed",
        "light",
        "either",
        "mode",
        "philosophizing",
        "truer",
        "one",
        "p",
        "second",
        "aspect",
        "new",
        "method",
        "concern",
        "use",
        "mathematical",
        "theory",
        "derive",
        "testable",
        "conclusion",
        "hypothesis",
        "galileo",
        "huygens",
        "done",
        "cover",
        "full",
        "range",
        "alternative",
        "theoretical",
        "possibility",
        "enabling",
        "empirical",
        "world",
        "select",
        "among",
        "new",
        "approach",
        "spelled",
        "forcefully",
        "end",
        "book",
        "section",
        "use",
        "word",
        "attraction",
        "general",
        "sense",
        "endeavor",
        "whatever",
        "body",
        "approach",
        "one",
        "another",
        "whether",
        "endeavor",
        "occurs",
        "result",
        "action",
        "body",
        "either",
        "drawn",
        "toward",
        "one",
        "another",
        "acting",
        "one",
        "another",
        "mean",
        "spirit",
        "emitted",
        "whether",
        "arises",
        "action",
        "ether",
        "air",
        "medium",
        "whatsoever",
        "whether",
        "corporeal",
        "incorporeal",
        "way",
        "impelling",
        "toward",
        "one",
        "another",
        "body",
        "floating",
        "therein",
        "use",
        "word",
        "impulse",
        "general",
        "sense",
        "considering",
        "treatise",
        "specie",
        "force",
        "physical",
        "quality",
        "quantity",
        "mathematical",
        "proportion",
        "explained",
        "definition",
        "mathematics",
        "requires",
        "investigation",
        "quantity",
        "force",
        "proportion",
        "follow",
        "condition",
        "may",
        "supposed",
        "coming",
        "physic",
        "proportion",
        "must",
        "compared",
        "phenomenon",
        "may",
        "found",
        "condition",
        "force",
        "apply",
        "kind",
        "attracting",
        "body",
        "finally",
        "possible",
        "argue",
        "securely",
        "concerning",
        "physical",
        "specie",
        "physical",
        "cause",
        "physical",
        "proportion",
        "force",
        "p",
        "third",
        "aspect",
        "new",
        "method",
        "proved",
        "controversial",
        "time",
        "willingness",
        "hold",
        "question",
        "mechanism",
        "force",
        "effect",
        "change",
        "motion",
        "abeyance",
        "even",
        "mathematical",
        "theory",
        "specie",
        "proportion",
        "force",
        "seemed",
        "leave",
        "alternative",
        "action",
        "distance",
        "aspect",
        "remained",
        "somewhat",
        "tacit",
        "first",
        "edition",
        "response",
        "criticism",
        "received",
        "made",
        "polemically",
        "explicit",
        "general",
        "scholium",
        "added",
        "end",
        "second",
        "edition",
        "yet",
        "able",
        "deduce",
        "phenomenon",
        "reason",
        "property",
        "gravity",
        "feign",
        "hypothesis",
        "whatever",
        "deduced",
        "phenomenon",
        "must",
        "called",
        "hypothesis",
        "hypothesis",
        "whether",
        "metaphysical",
        "physical",
        "based",
        "occult",
        "quality",
        "mechanical",
        "place",
        "experimental",
        "philosophy",
        "experimental",
        "philosophy",
        "proposition",
        "deduced",
        "phenomenon",
        "made",
        "general",
        "induction",
        "impenetrability",
        "mobility",
        "impetus",
        "body",
        "law",
        "motion",
        "law",
        "gravity",
        "found",
        "method",
        "enough",
        "gravity",
        "really",
        "exist",
        "act",
        "according",
        "law",
        "set",
        "forth",
        "suffice",
        "motion",
        "heavenly",
        "body",
        "sea",
        "p",
        "eighteenth",
        "century",
        "primary",
        "challenge",
        "principia",
        "presented",
        "philosopher",
        "revolved",
        "around",
        "make",
        "mathematical",
        "theory",
        "force",
        "absence",
        "mechanism",
        "action",
        "distance",
        "force",
        "work",
        "last",
        "decade",
        "century",
        "however",
        "little",
        "room",
        "remained",
        "questioning",
        "whether",
        "gravity",
        "act",
        "according",
        "law",
        "newton",
        "set",
        "forth",
        "suffice",
        "motion",
        "heavenly",
        "body",
        "sea",
        "one",
        "could",
        "deny",
        "science",
        "emerged",
        "least",
        "certain",
        "respect",
        "far",
        "exceeded",
        "anything",
        "ever",
        "gone",
        "stood",
        "alone",
        "ultimate",
        "exemplar",
        "science",
        "generally",
        "challenge",
        "philosopher",
        "became",
        "one",
        "spelling",
        "first",
        "precise",
        "nature",
        "limit",
        "knowledge",
        "attained",
        "science",
        "methodologically",
        "extraordinary",
        "advance",
        "achieved",
        "view",
        "enabling",
        "area",
        "inquiry",
        "follow",
        "suit"
    ]
}