{
    "main_text": "The Structure of Newton's Scholium on Time, Space, Place and Motion || The Arguments from Properties, Causes, and Effects\n5.3 The Arguments from Properties, Causes, and Effects\n\n Newton devotes five full paragraphs to justifying his\ncharacterization of the distinction between absolute and relative\nmotion. The first three present arguments from properties of absolute\nmotion and rest, the next presents an argument from their causes, and\nthe final an argument from their effects. The force of these has\nconfused modern commentators for a combination of reasons which,\nhistorically, are difficult to untangle. Since only those not already\nprejudiced by those commentaries, directly or indirectly, will find\nwhat follows unusual, it is best to defer an autopsy of those reasons\nuntil Section 6, after an exposition of the arguments.\n\n\n Suffice it to say for the moment that it is a common misunderstanding\nthat in these arguments Newton intends to develop empirical\ncriteria for distinguishing cases of absolute motion from merely\napparent motion and  thereby to disprove the thesis that all motion is \nmerely relative motion. To the contrary,\nthe arguments take as their point of departure the assumption, common\nto Cartesian and Aristotelian philosophy, that each body has a unique\nstate of true motion (or rest). Throughout the arguments, the terms\n‘true motion’ and ‘absolute motion’ are\ntreated synonymously. At issue is whether true motion (and rest) can\nbe reduced to some special instance of relative motion (or rest) with\nrespect to other bodies. In announcing at the outset of these\narguments that “absolute and relative rest and motion are\ndistinguished by by their properties, causes, and effects”, Newton\nindicates his intent to show that they cannot, at least if true motion\nand rest are to have those features we generally associate, or ought\nto associate, with them.  \n\nArgument 1 from Properties\n  [Paragraph VIII]\n \n\nProperty: Bodies that are truly at rest are at rest\n with respect to one another.\n\n\nConclusion: True rest cannot be defined simply in\n terms of position relative to other bodies in the local\n vicinity.\n\n\n\nReasoning: Suppose there were a body somewhere in\nthe universe absolutely at rest, say far away, in the region of the\nfixed stars, or even farther. (Whether or not that body might ever be\nobserved doesn't enter into what follows.) Clearly it is impossible to\nknow just from considering the positions of bodies in our region\nrelative to one another whether any of these latter bodies maintains a\nfixed position with respect to that hypothetical distant body. To\namplify, let B be one of the local bodies, C the relative\nconfiguration over time of the set of local bodies, and A the far\ndistant body at absolute rest. The specification of C alone fails to\nestablish the position of B relative to A over time. In particular, C\nfails to establish whether B is relatively at rest with respect A,\nwhich, by the property stated above, is a necessary condition for B to\nbe absolutely at rest. Hence, specification of the local configuration\nC underdetermines whether or not B is at absolute rest. Thus the\nconclusion: it is impossible to define what it is for a body such as B\nto be at absolute rest [i.e., to give necessary and sufficient\nconditions for when it is that B is at rest] simply in terms of how B\nfits into the local configuration C.  \n\nArgument 2 from Properties\n  [Paragraph IX]\n \n\nProperty: If a part of a body maintains a fixed\nposition with respect to the body as a whole, then it participates in\nthe motion of the whole body.  \n\nConclusion: True and absolute motion cannot be\ndefined as a translation from the vicinity of (the immediately\nsurrounding) bodies, viewing the latter as if they were at rest.  \n\n\nReasoning: Newton first introduces two\nconsiderations that can be taken either to support, or to illustrate,\nor to amplify upon the import of the stated property. The first is\nthat if a part of a rotating body is at rest relative to the body as a\nwhole, it endeavors to recede from the axis of rotation. The second is\nthat the impetus of a body to move forward arises from the combination\nof the impetus of its parts.  \n\n From the property it follows that if those bodies surrounding a given\nbody move (either rotationally or progressively forward as a fixed\nconfiguration) while the surrounded body is at rest relative to the\nsurrounding ones, then the surrounded body partakes in the (true)\nmotion of the group of surrounding bodies. Hence, if the surrounding\nbodies move truly, then so does the surrounded body. But according to\nthe (Cartesian) definition of motion—which identifies the true\nmotion of a body with its transference from the vicinity of\nimmediately surrounding bodies, regarding the surrounding bodies to be\nas though they are at rest—it would have to be said (wrongly)\nthat the surrounded body is truly at rest. Hence that definition is\nuntenable.  \n\nArgument 3 from Properties\n  [Paragraph X]\n\n\nProperty: Anything put in a moving place moves along\nwith that place, and hence a body participates in the motion of its\nplace when it moves [relatively] away from that place.  \n\nConclusion: The complete and absolute motion of a\nbody cannot be defined except by means of stationary places.  \n\n\nReasoning: From the property, the [relative] motion\nof a body out of a given place is only part of the motion of the body\nif the place in question is itself in motion. The complete and true\nmotion of the body consists of its motion relative to the moving place\nadded vectorially to whatever motion the place may have. Should the\nplace be moving relative to a place which is in turn moving, then the\nmotion of that place must be added, and so on. Barring infinite\nregress, the sum must terminate with a motion relative to a stationary\nplace.  \n\nAddended Argument: After deriving this conclusion,\nNewton amplifies upon the consequences. The only places that are\nstationary are all of those that that stay in fixed positions with\nrespect to one another from infinity to infinity, and since these\nalways remain stationary, they make up what Newton calls immobile\nabsolute space.  \n\nThe Argument from Causes\n [Paragraph XI]\n \n\nCauses: the forces impressed upon bodies. The major\npremise is that application of a [non-zero net] force on a body is\nboth a necessary and sufficient condition for either generating or\naltering its true motion. More specifically: \n\n (A) Impressed force is a necessary condition for generating or\naltering true motion (but not, as remains to be shown, merely relative\nmotion).  \n\n (B) Application of a [non-zero net] force is a sufficient condition\nfor the generation or alteration of true motion (but not, as will be\nshown subsequently, merely relative motion).  \n\nConclusion: The true motion of an individual body\ncannot be defined as any particular sub-instance of its motion\nrelative to other bodies.  \n\n\nReasoning: Newton seeks to establish that\napplication of a positive net force to a body is neither a necessary\nnot a sufficient condition for the generation of motion relative to\nother bodies. The two lines of reasoning are given separately, call\nthem ‘Prong A’ and ‘Prong B’, respectively.\n\n\nProng A: To be established is that, although an impressed\nforce is necessary for the generation or alteration of true motion in\na body, it is not necessary for the generation of motion relative to\nother bodies. The reasoning is quite simple: pick a given body and\nmerely apply the same [accelerative] force to all other bodies in\nquestion. These other bodies will then remain in the same relative\nconfiguration with respect to one another, but a relative motion with\nrespect to the original body [to which no force has been applied] will\neither be generated or altered.  \n\nProng B: To be established is that, although an impressed\nforce is sufficient for the generation or alteration of true motion in\na body, it is not sufficient for the generation of motion relative to\nother bodies. Again, the line of reasoning is quite\nstraightforward. Consider an arbitrarily given body amongst a system\nof bodies and simply apply the same [accelerative] force to all bodies\nin question. Then, despite the fact that a force has been impressed\nupon the originally given body, there is neither generation nor\nalteration of relative motion with respect to the remaining bodies.\n\n\n The Argument from Effects\n  [Paragraph XII]\n\n\nEffects: the forces of receding from the axis of\nrotational motion [centrifugal endeavor]. The major premise is that\nthe centrifugal endeavor of bodies [or parts of bodies] to recede from\nthe axis of rotation is directly proportional to the quantity of the\ntrue circular motion.  \n\nConclusion: True rotational motion cannot be defined\nas relative rotation with respect to the surrounding bodies.  \n\n\nReasoning: The line of reasoning is in fact parallel\nto the preceding argument from causes, although this may not be\ncompletely perspicuous due to the fact that the correlates of the two\nprongs above are here stages of a single on-going experimental\nsituation, the so-called “rotating bucket” experiment, which, Newton\nintimates, he actually performed. In order to set up this experiment,\none suspends a bucket using a long cord and by turning the bucket\nrepeatedly, winds up the cord until it is strongly twisted, then fills\nthe bucket with water. During the course of the experiment, the degree\nto which the water tries to climb up the sides of the bucket is used\nas a measure of its centrifugal endeavor to recede from the\ncenter. Newton uses the experiment to establish that centrifugal\nendeavor is neither a necessary condition nor a sufficient condition\nfor the existence of relative circular motion [of the water] with\nrespect to its surroundings [the bucket].  \n\nStage 1: When the bucket is first released, it rotates\nrapidly with respect to the rest frame of the experimenter while the\nwater remains at rest with respect to the experimenter. In other\nwords, there is rapid relative motion of the water with respect to the\nbucket. However, the surface of the water remains flat, indicating\nthat it has no tendency to recede from the axis of relative\nrotation. Thus, the existence of centrifugal endeavor in the parts of\na body is not a necessary condition for the body to be rotating\nrelative to its surroundings. That is, such relative rotation with\nrespect to immediately adjacent bodies need not produce any\ncentrifugal endeavor in the parts of the body to recede from the axis\nof relative rotation.  \n\n In the further course of the experiment, as the bucket continues to\nrotate, the water gradually begins to rotate with it, and as it does\nso, begins to climb up the sides of the bucket. Eventually, according\nto Newton, the water acquires the same rotation of the bucket relative\nto the lab frame, at which point we have the following situation.\n\n\nStage 2: The water and the bucket are at relative rest, yet\nthe water has achieved its highest ascent up the sides of the bucket,\nindicating a maximum centrifugal endeavor to recede from the axis of\ncommon rotation. Hence, the existence of centrifugal endeavor is not a\nsufficient condition for the presence of relative circular motion\nbetween a body and its surroundings, i.e., if a body, or rather its\nparts, have a centrifugal endeavor to recede from a central axis, it\ndoes not follow that there is a relative circular motion of the body\nwith respect to its immediate surroundings.  \n\nAstrophysical Application. After deriving the\nconclusion, Newton uses the premises of the first two arguments from\nproperties, together with the premise of the argument from effects, to\ncritique the vortex theory of planetary motion. According to that\ntheory, each of the planets (and most notably the earth) is relatively\nat rest with respect to the “subtle” matter of the celestial vortex of\nour own sun. Hence, according to Descartes' own definition of true\nmotion (as well as his explicit insistence), they have no true\nmotion. However, it is manifest that they do not maintain fixed\npositions with respect to one another. So, according to the property\ninvoked in the first argument, they cannot [all] be truly at\nrest. Moreover, from the property invoked in the second argument, they\npartake in the circular motion of the solar vortex [assuming that\nmotion to be true motion, as Descartes implicitly assumed]. Finally,\nbecause they would accordingly participate in the true circular motion\nof this hypothetical vortex, they should have an endeavor to recede\nfrom the axis of its rotation.  \n\n This completes the sequence of arguments from the properties, causes,\nand effects of motion. The next paragraph\n  [XIII]\n states the cumulative conclusions of the arguments marshalled\nbeginning with the arguments for absolute time in paragraph V: “Hence\nrelative quantities are not the quantities themselves, whose names\nthey bear, but are only sensible measures of them (either accurate or\ninaccurate), which are commonly used in place of the quantities they\nmeasure.” Having made his case, Newton comments on the ordinary\nlanguage meaning of the terms for these quantities\nin order to address contemporary issues of dogma\nand heresy.  \n\n Galileo's condemnation by the Catholic Church for asserting that the\nearth is in motion was still recent history at the time Newton\ncomposed the Principia. Descartes, who lived in reach of\nPapal authority and feared similar fate, had found a clever way of\nespousing Copernicanism without falling prey to accusation of\nheresy. According to his definition of motion “properly speaking”, he\ncontends, the earth is truly at rest.  \n\n In Newton's system of the world as set out in Book III of the\nPrincipia, the earth patently moves absolutely. In\nanticipation, Newton indicates how to reconcile this with scripture by\nobserving that, if usage determines the meanings of words, then in\nordinary discourse (including the Bible) the terms ‘time’,\n‘space’, ‘place’, and ‘motion‘ are\nproperly understood to signify the relative quantities; only in\nspecialized and mathematical contexts do they denote the absolute\nquantities. (Keep in mind Newton's title, The\nMathematical Principles of Natural Philosophy.)\nHe proceeds to chastise Descartes on two counts, first for doing\nviolence to the scriptures by taking them to refer to the absolute\nquantities, and second, for confusing the true quantities with their\nrelative measures.  \n",
    "section_title": "5.3 The Arguments from Properties, Causes, and Effects",
    "entry_title": "Newton’s Views on Space, Time, and Motion",
    "hierarchy_title": "Newton’s Views on Space, Time, and Motion || The Structure of Newton's Scholium on Time, Space, Place and Motion || The Arguments from Properties, Causes, and Effects",
    "tokenized_text": [
        "structure",
        "newton",
        "s",
        "scholium",
        "time",
        "space",
        "place",
        "motion",
        "argument",
        "property",
        "cause",
        "effect",
        "argument",
        "property",
        "cause",
        "effect",
        "newton",
        "devotes",
        "five",
        "full",
        "paragraph",
        "justifying",
        "characterization",
        "distinction",
        "absolute",
        "relative",
        "motion",
        "first",
        "three",
        "present",
        "argument",
        "property",
        "absolute",
        "motion",
        "rest",
        "next",
        "present",
        "argument",
        "cause",
        "final",
        "argument",
        "effect",
        "force",
        "confused",
        "modern",
        "commentator",
        "combination",
        "reason",
        "historically",
        "difficult",
        "untangle",
        "since",
        "already",
        "prejudiced",
        "commentary",
        "directly",
        "indirectly",
        "find",
        "follows",
        "unusual",
        "best",
        "defer",
        "autopsy",
        "reason",
        "section",
        "exposition",
        "argument",
        "suffice",
        "say",
        "moment",
        "common",
        "misunderstanding",
        "argument",
        "newton",
        "intends",
        "develop",
        "empirical",
        "criterion",
        "distinguishing",
        "case",
        "absolute",
        "motion",
        "merely",
        "apparent",
        "motion",
        "thereby",
        "disprove",
        "thesis",
        "motion",
        "merely",
        "relative",
        "motion",
        "contrary",
        "argument",
        "take",
        "point",
        "departure",
        "assumption",
        "common",
        "cartesian",
        "aristotelian",
        "philosophy",
        "body",
        "unique",
        "state",
        "true",
        "motion",
        "rest",
        "throughout",
        "argument",
        "term",
        "true",
        "motion",
        "absolute",
        "motion",
        "treated",
        "synonymously",
        "issue",
        "whether",
        "true",
        "motion",
        "rest",
        "reduced",
        "special",
        "instance",
        "relative",
        "motion",
        "rest",
        "respect",
        "body",
        "announcing",
        "outset",
        "argument",
        "absolute",
        "relative",
        "rest",
        "motion",
        "distinguished",
        "property",
        "cause",
        "effect",
        "newton",
        "indicates",
        "intent",
        "show",
        "least",
        "true",
        "motion",
        "rest",
        "feature",
        "generally",
        "associate",
        "ought",
        "associate",
        "argument",
        "property",
        "paragraph",
        "viii",
        "property",
        "body",
        "truly",
        "rest",
        "rest",
        "respect",
        "one",
        "another",
        "conclusion",
        "true",
        "rest",
        "defined",
        "simply",
        "term",
        "position",
        "relative",
        "body",
        "local",
        "vicinity",
        "reasoning",
        "suppose",
        "body",
        "somewhere",
        "universe",
        "absolutely",
        "rest",
        "say",
        "far",
        "away",
        "region",
        "fixed",
        "star",
        "even",
        "farther",
        "whether",
        "body",
        "might",
        "ever",
        "observed",
        "nt",
        "enter",
        "follows",
        "clearly",
        "impossible",
        "know",
        "considering",
        "position",
        "body",
        "region",
        "relative",
        "one",
        "another",
        "whether",
        "latter",
        "body",
        "maintains",
        "fixed",
        "position",
        "respect",
        "hypothetical",
        "distant",
        "body",
        "amplify",
        "let",
        "b",
        "one",
        "local",
        "body",
        "c",
        "relative",
        "configuration",
        "time",
        "set",
        "local",
        "body",
        "far",
        "distant",
        "body",
        "absolute",
        "rest",
        "specification",
        "c",
        "alone",
        "fails",
        "establish",
        "position",
        "b",
        "relative",
        "time",
        "particular",
        "c",
        "fails",
        "establish",
        "whether",
        "b",
        "relatively",
        "rest",
        "respect",
        "property",
        "stated",
        "necessary",
        "condition",
        "b",
        "absolutely",
        "rest",
        "hence",
        "specification",
        "local",
        "configuration",
        "c",
        "underdetermines",
        "whether",
        "b",
        "absolute",
        "rest",
        "thus",
        "conclusion",
        "impossible",
        "define",
        "body",
        "b",
        "absolute",
        "rest",
        "ie",
        "give",
        "necessary",
        "sufficient",
        "condition",
        "b",
        "rest",
        "simply",
        "term",
        "b",
        "fit",
        "local",
        "configuration",
        "c",
        "argument",
        "property",
        "paragraph",
        "ix",
        "property",
        "part",
        "body",
        "maintains",
        "fixed",
        "position",
        "respect",
        "body",
        "whole",
        "participates",
        "motion",
        "whole",
        "body",
        "conclusion",
        "true",
        "absolute",
        "motion",
        "defined",
        "translation",
        "vicinity",
        "immediately",
        "surrounding",
        "body",
        "viewing",
        "latter",
        "rest",
        "reasoning",
        "newton",
        "first",
        "introduces",
        "two",
        "consideration",
        "taken",
        "either",
        "support",
        "illustrate",
        "amplify",
        "upon",
        "import",
        "stated",
        "property",
        "first",
        "part",
        "rotating",
        "body",
        "rest",
        "relative",
        "body",
        "whole",
        "endeavor",
        "recede",
        "axis",
        "rotation",
        "second",
        "impetus",
        "body",
        "move",
        "forward",
        "arises",
        "combination",
        "impetus",
        "part",
        "property",
        "follows",
        "body",
        "surrounding",
        "given",
        "body",
        "move",
        "either",
        "rotationally",
        "progressively",
        "forward",
        "fixed",
        "configuration",
        "surrounded",
        "body",
        "rest",
        "relative",
        "surrounding",
        "one",
        "surrounded",
        "body",
        "partakes",
        "true",
        "motion",
        "group",
        "surrounding",
        "body",
        "hence",
        "surrounding",
        "body",
        "move",
        "truly",
        "surrounded",
        "body",
        "according",
        "cartesian",
        "definition",
        "motionwhich",
        "identifies",
        "true",
        "motion",
        "body",
        "transference",
        "vicinity",
        "immediately",
        "surrounding",
        "body",
        "regarding",
        "surrounding",
        "body",
        "though",
        "restit",
        "would",
        "said",
        "wrongly",
        "surrounded",
        "body",
        "truly",
        "rest",
        "hence",
        "definition",
        "untenable",
        "argument",
        "property",
        "paragraph",
        "x",
        "property",
        "anything",
        "put",
        "moving",
        "place",
        "move",
        "along",
        "place",
        "hence",
        "body",
        "participates",
        "motion",
        "place",
        "move",
        "relatively",
        "away",
        "place",
        "conclusion",
        "complete",
        "absolute",
        "motion",
        "body",
        "defined",
        "except",
        "mean",
        "stationary",
        "place",
        "reasoning",
        "property",
        "relative",
        "motion",
        "body",
        "given",
        "place",
        "part",
        "motion",
        "body",
        "place",
        "question",
        "motion",
        "complete",
        "true",
        "motion",
        "body",
        "consists",
        "motion",
        "relative",
        "moving",
        "place",
        "added",
        "vectorially",
        "whatever",
        "motion",
        "place",
        "may",
        "place",
        "moving",
        "relative",
        "place",
        "turn",
        "moving",
        "motion",
        "place",
        "must",
        "added",
        "barring",
        "infinite",
        "regress",
        "sum",
        "must",
        "terminate",
        "motion",
        "relative",
        "stationary",
        "place",
        "addended",
        "argument",
        "deriving",
        "conclusion",
        "newton",
        "amplifies",
        "upon",
        "consequence",
        "place",
        "stationary",
        "stay",
        "fixed",
        "position",
        "respect",
        "one",
        "another",
        "infinity",
        "infinity",
        "since",
        "always",
        "remain",
        "stationary",
        "make",
        "newton",
        "call",
        "immobile",
        "absolute",
        "space",
        "argument",
        "cause",
        "paragraph",
        "xi",
        "cause",
        "force",
        "impressed",
        "upon",
        "body",
        "major",
        "premise",
        "application",
        "nonzero",
        "net",
        "force",
        "body",
        "necessary",
        "sufficient",
        "condition",
        "either",
        "generating",
        "altering",
        "true",
        "motion",
        "specifically",
        "impressed",
        "force",
        "necessary",
        "condition",
        "generating",
        "altering",
        "true",
        "motion",
        "remains",
        "shown",
        "merely",
        "relative",
        "motion",
        "b",
        "application",
        "nonzero",
        "net",
        "force",
        "sufficient",
        "condition",
        "generation",
        "alteration",
        "true",
        "motion",
        "shown",
        "subsequently",
        "merely",
        "relative",
        "motion",
        "conclusion",
        "true",
        "motion",
        "individual",
        "body",
        "defined",
        "particular",
        "subinstance",
        "motion",
        "relative",
        "body",
        "reasoning",
        "newton",
        "seek",
        "establish",
        "application",
        "positive",
        "net",
        "force",
        "body",
        "neither",
        "necessary",
        "sufficient",
        "condition",
        "generation",
        "motion",
        "relative",
        "body",
        "two",
        "line",
        "reasoning",
        "given",
        "separately",
        "call",
        "prong",
        "prong",
        "b",
        "respectively",
        "prong",
        "established",
        "although",
        "impressed",
        "force",
        "necessary",
        "generation",
        "alteration",
        "true",
        "motion",
        "body",
        "necessary",
        "generation",
        "motion",
        "relative",
        "body",
        "reasoning",
        "quite",
        "simple",
        "pick",
        "given",
        "body",
        "merely",
        "apply",
        "accelerative",
        "force",
        "body",
        "question",
        "body",
        "remain",
        "relative",
        "configuration",
        "respect",
        "one",
        "another",
        "relative",
        "motion",
        "respect",
        "original",
        "body",
        "force",
        "applied",
        "either",
        "generated",
        "altered",
        "prong",
        "b",
        "established",
        "although",
        "impressed",
        "force",
        "sufficient",
        "generation",
        "alteration",
        "true",
        "motion",
        "body",
        "sufficient",
        "generation",
        "motion",
        "relative",
        "body",
        "line",
        "reasoning",
        "quite",
        "straightforward",
        "consider",
        "arbitrarily",
        "given",
        "body",
        "amongst",
        "system",
        "body",
        "simply",
        "apply",
        "accelerative",
        "force",
        "body",
        "question",
        "despite",
        "fact",
        "force",
        "impressed",
        "upon",
        "originally",
        "given",
        "body",
        "neither",
        "generation",
        "alteration",
        "relative",
        "motion",
        "respect",
        "remaining",
        "body",
        "argument",
        "effect",
        "paragraph",
        "xii",
        "effect",
        "force",
        "receding",
        "axis",
        "rotational",
        "motion",
        "centrifugal",
        "endeavor",
        "major",
        "premise",
        "centrifugal",
        "endeavor",
        "body",
        "part",
        "body",
        "recede",
        "axis",
        "rotation",
        "directly",
        "proportional",
        "quantity",
        "true",
        "circular",
        "motion",
        "conclusion",
        "true",
        "rotational",
        "motion",
        "defined",
        "relative",
        "rotation",
        "respect",
        "surrounding",
        "body",
        "reasoning",
        "line",
        "reasoning",
        "fact",
        "parallel",
        "preceding",
        "argument",
        "cause",
        "although",
        "may",
        "completely",
        "perspicuous",
        "due",
        "fact",
        "correlate",
        "two",
        "prong",
        "stage",
        "single",
        "ongoing",
        "experimental",
        "situation",
        "socalled",
        "rotating",
        "bucket",
        "experiment",
        "newton",
        "intimate",
        "actually",
        "performed",
        "order",
        "set",
        "experiment",
        "one",
        "suspends",
        "bucket",
        "using",
        "long",
        "cord",
        "turning",
        "bucket",
        "repeatedly",
        "wind",
        "cord",
        "strongly",
        "twisted",
        "fill",
        "bucket",
        "water",
        "course",
        "experiment",
        "degree",
        "water",
        "try",
        "climb",
        "side",
        "bucket",
        "used",
        "measure",
        "centrifugal",
        "endeavor",
        "recede",
        "center",
        "newton",
        "us",
        "experiment",
        "establish",
        "centrifugal",
        "endeavor",
        "neither",
        "necessary",
        "condition",
        "sufficient",
        "condition",
        "existence",
        "relative",
        "circular",
        "motion",
        "water",
        "respect",
        "surroundings",
        "bucket",
        "stage",
        "bucket",
        "first",
        "released",
        "rotates",
        "rapidly",
        "respect",
        "rest",
        "frame",
        "experimenter",
        "water",
        "remains",
        "rest",
        "respect",
        "experimenter",
        "word",
        "rapid",
        "relative",
        "motion",
        "water",
        "respect",
        "bucket",
        "however",
        "surface",
        "water",
        "remains",
        "flat",
        "indicating",
        "tendency",
        "recede",
        "axis",
        "relative",
        "rotation",
        "thus",
        "existence",
        "centrifugal",
        "endeavor",
        "part",
        "body",
        "necessary",
        "condition",
        "body",
        "rotating",
        "relative",
        "surroundings",
        "relative",
        "rotation",
        "respect",
        "immediately",
        "adjacent",
        "body",
        "need",
        "produce",
        "centrifugal",
        "endeavor",
        "part",
        "body",
        "recede",
        "axis",
        "relative",
        "rotation",
        "course",
        "experiment",
        "bucket",
        "continues",
        "rotate",
        "water",
        "gradually",
        "begin",
        "rotate",
        "begin",
        "climb",
        "side",
        "bucket",
        "eventually",
        "according",
        "newton",
        "water",
        "acquires",
        "rotation",
        "bucket",
        "relative",
        "lab",
        "frame",
        "point",
        "following",
        "situation",
        "stage",
        "water",
        "bucket",
        "relative",
        "rest",
        "yet",
        "water",
        "achieved",
        "highest",
        "ascent",
        "side",
        "bucket",
        "indicating",
        "maximum",
        "centrifugal",
        "endeavor",
        "recede",
        "axis",
        "common",
        "rotation",
        "hence",
        "existence",
        "centrifugal",
        "endeavor",
        "sufficient",
        "condition",
        "presence",
        "relative",
        "circular",
        "motion",
        "body",
        "surroundings",
        "ie",
        "body",
        "rather",
        "part",
        "centrifugal",
        "endeavor",
        "recede",
        "central",
        "axis",
        "follow",
        "relative",
        "circular",
        "motion",
        "body",
        "respect",
        "immediate",
        "surroundings",
        "astrophysical",
        "application",
        "deriving",
        "conclusion",
        "newton",
        "us",
        "premise",
        "first",
        "two",
        "argument",
        "property",
        "together",
        "premise",
        "argument",
        "effect",
        "critique",
        "vortex",
        "theory",
        "planetary",
        "motion",
        "according",
        "theory",
        "planet",
        "notably",
        "earth",
        "relatively",
        "rest",
        "respect",
        "subtle",
        "matter",
        "celestial",
        "vortex",
        "sun",
        "hence",
        "according",
        "descartes",
        "definition",
        "true",
        "motion",
        "well",
        "explicit",
        "insistence",
        "true",
        "motion",
        "however",
        "manifest",
        "maintain",
        "fixed",
        "position",
        "respect",
        "one",
        "another",
        "according",
        "property",
        "invoked",
        "first",
        "argument",
        "truly",
        "rest",
        "moreover",
        "property",
        "invoked",
        "second",
        "argument",
        "partake",
        "circular",
        "motion",
        "solar",
        "vortex",
        "assuming",
        "motion",
        "true",
        "motion",
        "descartes",
        "implicitly",
        "assumed",
        "finally",
        "would",
        "accordingly",
        "participate",
        "true",
        "circular",
        "motion",
        "hypothetical",
        "vortex",
        "endeavor",
        "recede",
        "axis",
        "rotation",
        "completes",
        "sequence",
        "argument",
        "property",
        "cause",
        "effect",
        "motion",
        "next",
        "paragraph",
        "xiii",
        "state",
        "cumulative",
        "conclusion",
        "argument",
        "marshalled",
        "beginning",
        "argument",
        "absolute",
        "time",
        "paragraph",
        "v",
        "hence",
        "relative",
        "quantity",
        "quantity",
        "whose",
        "name",
        "bear",
        "sensible",
        "measure",
        "either",
        "accurate",
        "inaccurate",
        "commonly",
        "used",
        "place",
        "quantity",
        "measure",
        "made",
        "case",
        "newton",
        "comment",
        "ordinary",
        "language",
        "meaning",
        "term",
        "quantity",
        "order",
        "address",
        "contemporary",
        "issue",
        "dogma",
        "heresy",
        "galileo",
        "s",
        "condemnation",
        "catholic",
        "church",
        "asserting",
        "earth",
        "motion",
        "still",
        "recent",
        "history",
        "time",
        "newton",
        "composed",
        "principia",
        "descartes",
        "lived",
        "reach",
        "papal",
        "authority",
        "feared",
        "similar",
        "fate",
        "found",
        "clever",
        "way",
        "espousing",
        "copernicanism",
        "without",
        "falling",
        "prey",
        "accusation",
        "heresy",
        "according",
        "definition",
        "motion",
        "properly",
        "speaking",
        "contends",
        "earth",
        "truly",
        "rest",
        "newton",
        "s",
        "system",
        "world",
        "set",
        "book",
        "iii",
        "principia",
        "earth",
        "patently",
        "move",
        "absolutely",
        "anticipation",
        "newton",
        "indicates",
        "reconcile",
        "scripture",
        "observing",
        "usage",
        "determines",
        "meaning",
        "word",
        "ordinary",
        "discourse",
        "including",
        "bible",
        "term",
        "time",
        "space",
        "place",
        "motion",
        "properly",
        "understood",
        "signify",
        "relative",
        "quantity",
        "specialized",
        "mathematical",
        "context",
        "denote",
        "absolute",
        "quantity",
        "keep",
        "mind",
        "newton",
        "s",
        "title",
        "mathematical",
        "principle",
        "natural",
        "philosophy",
        "proceeds",
        "chastise",
        "descartes",
        "two",
        "count",
        "first",
        "violence",
        "scripture",
        "taking",
        "refer",
        "absolute",
        "quantity",
        "second",
        "confusing",
        "true",
        "quantity",
        "relative",
        "measure"
    ]
}