{
    "main_text": "The Scientific Achievement of the Principia\n10. The Methodology of the Principia\n\n\nIn two passages that remained word for word the same in all three\neditions Newton announced that the Principia was meant to\nillustrate a new approach to empirical inquiry. Neither the\nremark about deriving forces from phenomena of motion and then motions\nfrom these forces in the Preface to the first edition nor the remark\nabout comparing a generic mathematical theory of centripetal forces\nwith the phenomena in order to find out which conditions of force\nactually hold at the end of Book 1, Section 11, however, shed much\nlight on just what this new approach is supposed to be. Other\nthan these two passages, the only notable remark about methodology is\nthe famous passage, quoted earlier, from the General Scholium added in\nthe second edition as a final, parting statement:\n\n\nI have not as yet been able to deduce from phenomena the reason for\nthese properties of gravity, and I do not feign hypotheses. For\nwhatever is not deduced from the phenomena must be called a\nhypothesis; and hypotheses, whether metaphysical or physical, or based\non occult qualities, or mechanical, have no place in experimental\nphilosophy. In this experimental philosophy, propositions are deduced\nfrom the phenomena and are made general by induction. The\nimpenetrability, mobility, and impetus of bodies, and the laws of\nmotion and law of gravity have been found by this method. And it is\nenough that gravity should really exist and should act according to\nthe laws that we have set forth and should suffice for all the motions\nof the heavenly bodies and of our sea. [P,\n943]\n\n\nMuch of the discussion of the methodology of the Principia\nin the philosophical literature, from the eighteenth century down to\nthe present time, has taken this clearly polemical passage as the\nstarting point, generating unfortunately more heat than\n light.[57]\nThis is\nnot the place to grapple with all the controversies surrounding this\npassage. Some guarded comments about the methodology of the\nPrincipia may nevertheless prove helpful.\n\n\nIt is scarcely surprising that the unprecedented success of Newton's\ntheory of gravity stimulated interest in the methodology of the\nPrincipia. The obvious thought was to emulate this\nsuccess in other areas by following the same method. But then,\neven independently of questions about what the method was, one has to\nconsider exactly how it contributed to the success. Viewed in\nretrospect, Book 2 makes clear that this question has no simple\nanswer. If Newton followed the same method in Book 2, then the\nfailure of his effort on resistance forces — even worse, the failure\nthat he did not recognize — shows that the method was no guarantee of\nsuccess. The empirical world must cooperate for it to\nsucceed.\n\n\nTwo aspects of the general thrust of the method are perfectly\nclear. First, Newton viewed it as contrasting with what was then\ncalled the method of hypotheses — that is, the method of putting\nforward hypotheses that reached far beyond the available data and then\nmarshalling evidence for them by deducing testable conclusions\nfrom\n them.[58]\nSecond, Newton viewed the method as requiring that questions be\nregarded as open when empirical considerations had not yet yielded\nanswers to them. Whatever may have been required for empirical\nconsideration to establish a theoretical conclusion, and whatever the\nstatus, provisional or otherwise, any such established conclusion was\nsupposed to have, Newton viewed the method as allowing — even\nmandating — that theoretical answers to some questions could be\nestablished even while other closely related questions remained in\nabeyance. In particular, to use Newton's phrasing from the\nScholium that ends Section 11, the physical species and physical\nproportions of forces could, in the appropriate sense, be established\neven though the question of their physical causes remained open.\nThe clear aim of the method was accordingly to limit theoretical claims\nto “inductive generalizations,” as specified by the Rules of Reasoning,\nof conclusions dictated by experiment and observation.\n\n\nNewton's eschewing the method of hypotheses produced no controversy at\nthe time. In a manuscript revision of his “Essay on the causes of\ncelestial motions” Leibniz even adopted Newtonian phrasing: “What\nfollows is not based on hypotheses but is deduced from phenomena by the\nlaws of motion” [Aiton, 1972, 132]. A large fraction of those who had\nread at most small portions of the Principia and depended on\nothers for their knowledge of it most likely saw Newton as having\nhypothesized inverse-square attraction and hence as in fact following\nthe method of hypotheses. In the years after Newton died, the\nmost celebrated issues receiving concentrated research arose not from\nhow Newton had arrived at universal gravity, but from the claims he had\nderived from it concerning the figure of the Earth, the vagaries in the\nmotions of Jupiter and Saturn, and the motion of the Moon. The\nindividuals at the center of this research certainly saw these issues\nas a test of Newton's theory of gravity, but the distinction between\ntaking the theory as a hypothesis and taking it as a provisionally\nestablished conclusion was a distinction without much difference for\nthem. Still, it is worth noting that the conclusion Clairaut\nfirst drew from the factor of 2 discrepancy in the motion of the lunar\napogee was not that Newton's theory of gravity was false, but that the\ninverse-square needed to be supplemented by a 1/r4\nterm — a response fully in keeping with Newton's fourth rule of\nreasoning.\n\n\nThe aspect of Newton's method that did produce controversy at the time\nwas his insisting that he had established conclusions about the\nphysical species and physical proportions of celestial forces while\nholding questions about their physical causes in abeyance. This\nwas the core of the complaint by Cartesians that the Principia\nwas a work of mathematics, not physics. For Newton's two most\nimportant critics, however, Huygens and Leibniz, the objection was not\nto holding the question of physical causes open, but to accepting\ncertain conclusions that in their mind ruled out the very possibility\nof a proper answer to the question of physical cause. The defect\nin Newton's method lay in its not imposing the constraint on theory\nthat all action be through contact, and not at a distance. The\nviolation of this constraint lay behind Huygens's remarking,\n\n\nConcerning the Cause of the tides given by M. Newton, I am by no means\nsatisfied, nor by all the other Theories that he builds upon his\nPrinciple of Attraction, which seems to me absurd, as I have already\nmentioned in the addition to the Discourse on Gravity.\nAnd I have often wondered how he could have given himself all the\ntrouble of making such a number of investigations and difficult\ncalculations that have no other foundation than this very principle.\n[OH, IX, 538]\n\n\nThis, then, was the truly controversial aspect of Newton's method in\nthe Principia with which the next generation had to come to\nsome accommodation before research on its loose ends could\nbecome\n respectable.[59]\n\n\nThe idea of developing a mathematical theory in order to enable\nexperiment and observation to provide theory-mediated answers to\nquestions did not originate with the Principia. In his\nHorologium Oscillatorium, the work the Principia most\nemulates, Huygens had developed a mathematical theory of pendulum\nmotion that enabled measurement of the length and period of pendulums\nto provide a robust precise answer to the question, how far does an\nobject fall in the absence of air resistance in the first second? —\nthe measure then of the strength of surface gravity; and he had\ndeveloped a mathematical theory of uniform circular motion that enabled\nmeasurement of the height and period of conical pendulums to provide a\nsecond answer to this question. By the time Newton started on the\nPrincipia pendulums had been used for more than a decade to\nanswer questions about how surface gravity varies between Paris and\nother locations. The special problem Newton saw himself as having\nto face in using mathematical theory to a comparable end in the\nPrincipia stemmed from his realization, expressed in the\n“Copernican scholium,” that the phenomena of orbital motions are\ninordinately complicated and hence open to multiple competing\ndescriptions. The problem thus became one of finding a way to use\nmathematical theory to draw definite robust answers to questions about\nthe physical species and proportions of forces from these\nphenomena. These answers opened the way to pursing the true\nmotions in a sequence of successive approximations, in the process of\nwhich continuing evidence could be brought to bear on the theory,\npotentially delimiting its exactness and its universal applicability in\nthe manner Newton had noted in his fourth rule of reasoning.\nBecause the “Copernican scholium” was unknown at the time, the\nsubtleties of the new method Newton followed to get around\nthis problem went largely unnoticed.\n\n\nNeedless to say, these comments do not answer the philosophically most\ninteresting question of how the method of the Principia\ncontributed to the unprecedented success of its theory of\ngravity. Hopefully, however, they do remove some sources of\nconfusion that have distorted so much of the philosophical discussion\nof the Principia.\n",
    "section_title": "10. The Methodology of the Principia",
    "entry_title": "Newton’s Philosophiae Naturalis Principia Mathematica",
    "hierarchy_title": "Newton’s Philosophiae Naturalis Principia Mathematica || The Scientific Achievement of the Principia",
    "tokenized_text": [
        "scientific",
        "achievement",
        "principia",
        "methodology",
        "principia",
        "two",
        "passage",
        "remained",
        "word",
        "word",
        "three",
        "edition",
        "newton",
        "announced",
        "principia",
        "meant",
        "illustrate",
        "new",
        "approach",
        "empirical",
        "inquiry",
        "neither",
        "remark",
        "deriving",
        "force",
        "phenomenon",
        "motion",
        "motion",
        "force",
        "preface",
        "first",
        "edition",
        "remark",
        "comparing",
        "generic",
        "mathematical",
        "theory",
        "centripetal",
        "force",
        "phenomenon",
        "order",
        "find",
        "condition",
        "force",
        "actually",
        "hold",
        "end",
        "book",
        "section",
        "however",
        "shed",
        "much",
        "light",
        "new",
        "approach",
        "supposed",
        "two",
        "passage",
        "notable",
        "remark",
        "methodology",
        "famous",
        "passage",
        "quoted",
        "earlier",
        "general",
        "scholium",
        "added",
        "second",
        "edition",
        "final",
        "parting",
        "statement",
        "yet",
        "able",
        "deduce",
        "phenomenon",
        "reason",
        "property",
        "gravity",
        "feign",
        "hypothesis",
        "whatever",
        "deduced",
        "phenomenon",
        "must",
        "called",
        "hypothesis",
        "hypothesis",
        "whether",
        "metaphysical",
        "physical",
        "based",
        "occult",
        "quality",
        "mechanical",
        "place",
        "experimental",
        "philosophy",
        "experimental",
        "philosophy",
        "proposition",
        "deduced",
        "phenomenon",
        "made",
        "general",
        "induction",
        "impenetrability",
        "mobility",
        "impetus",
        "body",
        "law",
        "motion",
        "law",
        "gravity",
        "found",
        "method",
        "enough",
        "gravity",
        "really",
        "exist",
        "act",
        "according",
        "law",
        "set",
        "forth",
        "suffice",
        "motion",
        "heavenly",
        "body",
        "sea",
        "p",
        "much",
        "discussion",
        "methodology",
        "principia",
        "philosophical",
        "literature",
        "eighteenth",
        "century",
        "present",
        "time",
        "taken",
        "clearly",
        "polemical",
        "passage",
        "starting",
        "point",
        "generating",
        "unfortunately",
        "heat",
        "light",
        "place",
        "grapple",
        "controversy",
        "surrounding",
        "passage",
        "guarded",
        "comment",
        "methodology",
        "principia",
        "may",
        "nevertheless",
        "prove",
        "helpful",
        "scarcely",
        "surprising",
        "unprecedented",
        "success",
        "newton",
        "s",
        "theory",
        "gravity",
        "stimulated",
        "interest",
        "methodology",
        "principia",
        "obvious",
        "thought",
        "emulate",
        "success",
        "area",
        "following",
        "method",
        "even",
        "independently",
        "question",
        "method",
        "one",
        "consider",
        "exactly",
        "contributed",
        "success",
        "viewed",
        "retrospect",
        "book",
        "make",
        "clear",
        "question",
        "simple",
        "answer",
        "newton",
        "followed",
        "method",
        "book",
        "failure",
        "effort",
        "resistance",
        "force",
        "even",
        "worse",
        "failure",
        "recognize",
        "show",
        "method",
        "guarantee",
        "success",
        "empirical",
        "world",
        "must",
        "cooperate",
        "succeed",
        "two",
        "aspect",
        "general",
        "thrust",
        "method",
        "perfectly",
        "clear",
        "first",
        "newton",
        "viewed",
        "contrasting",
        "called",
        "method",
        "hypothesis",
        "method",
        "putting",
        "forward",
        "hypothesis",
        "reached",
        "far",
        "beyond",
        "available",
        "data",
        "marshalling",
        "evidence",
        "deducing",
        "testable",
        "conclusion",
        "second",
        "newton",
        "viewed",
        "method",
        "requiring",
        "question",
        "regarded",
        "open",
        "empirical",
        "consideration",
        "yet",
        "yielded",
        "answer",
        "whatever",
        "may",
        "required",
        "empirical",
        "consideration",
        "establish",
        "theoretical",
        "conclusion",
        "whatever",
        "status",
        "provisional",
        "otherwise",
        "established",
        "conclusion",
        "supposed",
        "newton",
        "viewed",
        "method",
        "allowing",
        "even",
        "mandating",
        "theoretical",
        "answer",
        "question",
        "could",
        "established",
        "even",
        "closely",
        "related",
        "question",
        "remained",
        "abeyance",
        "particular",
        "use",
        "newton",
        "s",
        "phrasing",
        "scholium",
        "end",
        "section",
        "physical",
        "specie",
        "physical",
        "proportion",
        "force",
        "could",
        "appropriate",
        "sense",
        "established",
        "even",
        "though",
        "question",
        "physical",
        "cause",
        "remained",
        "open",
        "clear",
        "aim",
        "method",
        "accordingly",
        "limit",
        "theoretical",
        "claim",
        "inductive",
        "generalization",
        "specified",
        "rule",
        "reasoning",
        "conclusion",
        "dictated",
        "experiment",
        "observation",
        "newton",
        "s",
        "eschewing",
        "method",
        "hypothesis",
        "produced",
        "controversy",
        "time",
        "manuscript",
        "revision",
        "essay",
        "cause",
        "celestial",
        "motion",
        "leibniz",
        "even",
        "adopted",
        "newtonian",
        "phrasing",
        "follows",
        "based",
        "hypothesis",
        "deduced",
        "phenomenon",
        "law",
        "motion",
        "aiton",
        "large",
        "fraction",
        "read",
        "small",
        "portion",
        "principia",
        "depended",
        "others",
        "knowledge",
        "likely",
        "saw",
        "newton",
        "hypothesized",
        "inversesquare",
        "attraction",
        "hence",
        "fact",
        "following",
        "method",
        "hypothesis",
        "year",
        "newton",
        "died",
        "celebrated",
        "issue",
        "receiving",
        "concentrated",
        "research",
        "arose",
        "newton",
        "arrived",
        "universal",
        "gravity",
        "claim",
        "derived",
        "concerning",
        "figure",
        "earth",
        "vagary",
        "motion",
        "jupiter",
        "saturn",
        "motion",
        "moon",
        "individual",
        "center",
        "research",
        "certainly",
        "saw",
        "issue",
        "test",
        "newton",
        "s",
        "theory",
        "gravity",
        "distinction",
        "taking",
        "theory",
        "hypothesis",
        "taking",
        "provisionally",
        "established",
        "conclusion",
        "distinction",
        "without",
        "much",
        "difference",
        "still",
        "worth",
        "noting",
        "conclusion",
        "clairaut",
        "first",
        "drew",
        "factor",
        "discrepancy",
        "motion",
        "lunar",
        "apogee",
        "newton",
        "s",
        "theory",
        "gravity",
        "false",
        "inversesquare",
        "needed",
        "supplemented",
        "r",
        "term",
        "response",
        "fully",
        "keeping",
        "newton",
        "s",
        "fourth",
        "rule",
        "reasoning",
        "aspect",
        "newton",
        "s",
        "method",
        "produce",
        "controversy",
        "time",
        "insisting",
        "established",
        "conclusion",
        "physical",
        "specie",
        "physical",
        "proportion",
        "celestial",
        "force",
        "holding",
        "question",
        "physical",
        "cause",
        "abeyance",
        "core",
        "complaint",
        "cartesian",
        "principia",
        "work",
        "mathematics",
        "physic",
        "newton",
        "s",
        "two",
        "important",
        "critic",
        "however",
        "huygens",
        "leibniz",
        "objection",
        "holding",
        "question",
        "physical",
        "cause",
        "open",
        "accepting",
        "certain",
        "conclusion",
        "mind",
        "ruled",
        "possibility",
        "proper",
        "answer",
        "question",
        "physical",
        "cause",
        "defect",
        "newton",
        "s",
        "method",
        "lay",
        "imposing",
        "constraint",
        "theory",
        "action",
        "contact",
        "distance",
        "violation",
        "constraint",
        "lay",
        "behind",
        "huygens",
        "s",
        "remarking",
        "concerning",
        "cause",
        "tide",
        "given",
        "m",
        "newton",
        "mean",
        "satisfied",
        "theory",
        "build",
        "upon",
        "principle",
        "attraction",
        "seems",
        "absurd",
        "already",
        "mentioned",
        "addition",
        "discourse",
        "gravity",
        "often",
        "wondered",
        "could",
        "given",
        "trouble",
        "making",
        "number",
        "investigation",
        "difficult",
        "calculation",
        "foundation",
        "principle",
        "oh",
        "ix",
        "truly",
        "controversial",
        "aspect",
        "newton",
        "s",
        "method",
        "principia",
        "next",
        "generation",
        "come",
        "accommodation",
        "research",
        "loose",
        "end",
        "could",
        "become",
        "respectable",
        "idea",
        "developing",
        "mathematical",
        "theory",
        "order",
        "enable",
        "experiment",
        "observation",
        "provide",
        "theorymediated",
        "answer",
        "question",
        "originate",
        "principia",
        "horologium",
        "oscillatorium",
        "work",
        "principia",
        "emulates",
        "huygens",
        "developed",
        "mathematical",
        "theory",
        "pendulum",
        "motion",
        "enabled",
        "measurement",
        "length",
        "period",
        "pendulum",
        "provide",
        "robust",
        "precise",
        "answer",
        "question",
        "far",
        "object",
        "fall",
        "absence",
        "air",
        "resistance",
        "first",
        "second",
        "measure",
        "strength",
        "surface",
        "gravity",
        "developed",
        "mathematical",
        "theory",
        "uniform",
        "circular",
        "motion",
        "enabled",
        "measurement",
        "height",
        "period",
        "conical",
        "pendulum",
        "provide",
        "second",
        "answer",
        "question",
        "time",
        "newton",
        "started",
        "principia",
        "pendulum",
        "used",
        "decade",
        "answer",
        "question",
        "surface",
        "gravity",
        "varies",
        "paris",
        "location",
        "special",
        "problem",
        "newton",
        "saw",
        "face",
        "using",
        "mathematical",
        "theory",
        "comparable",
        "end",
        "principia",
        "stemmed",
        "realization",
        "expressed",
        "copernican",
        "scholium",
        "phenomenon",
        "orbital",
        "motion",
        "inordinately",
        "complicated",
        "hence",
        "open",
        "multiple",
        "competing",
        "description",
        "problem",
        "thus",
        "became",
        "one",
        "finding",
        "way",
        "use",
        "mathematical",
        "theory",
        "draw",
        "definite",
        "robust",
        "answer",
        "question",
        "physical",
        "specie",
        "proportion",
        "force",
        "phenomenon",
        "answer",
        "opened",
        "way",
        "pursing",
        "true",
        "motion",
        "sequence",
        "successive",
        "approximation",
        "process",
        "continuing",
        "evidence",
        "could",
        "brought",
        "bear",
        "theory",
        "potentially",
        "delimiting",
        "exactness",
        "universal",
        "applicability",
        "manner",
        "newton",
        "noted",
        "fourth",
        "rule",
        "reasoning",
        "copernican",
        "scholium",
        "unknown",
        "time",
        "subtlety",
        "new",
        "method",
        "newton",
        "followed",
        "get",
        "around",
        "problem",
        "went",
        "largely",
        "unnoticed",
        "needle",
        "say",
        "comment",
        "answer",
        "philosophically",
        "interesting",
        "question",
        "method",
        "principia",
        "contributed",
        "unprecedented",
        "success",
        "theory",
        "gravity",
        "hopefully",
        "however",
        "remove",
        "source",
        "confusion",
        "distorted",
        "much",
        "philosophical",
        "discussion",
        "principia"
    ]
}