{
    "main_text": "The Place of Asian Philosophies in Nishida’s Thought\n9. The Place of Asian Philosophies in Nishida’s Thought\n\n\nBecause Nishida throughout his career cited Western philosophers far\nmore often than Asian sources, it is easy to read his thought as an\nongoing engagement with problems that have their origin in Western\ntraditions.  In addressing the concerns of Western thinkers he\nfollowed the path taken by nearly all Japanese professors of\nphilosophy since the inception of the academic discipline in the\n1880s. Yet his appropriation of ideas from Asian philosophies is also\nevident to the discerning reader, if more by way of allusion and\naffinity than by direct citation. It was not always necessary for him\nto name his Asian sources as explicitly, for he could appeal to the\ngeneral education of Japanese readers who would be familiar with the\nclassics of Asia and with the convention of appropriating ideas\nwithout directly referring to them. While commentators have long\npointed out the debt of Nishida to Zen Buddhist practice and thought,\nthey have only recently begun to identify other Asian sources of his\nphilosophy by researching his vast library in Asian languages\n(Dalissier 2009b).  In retrospect, it is clear that all along Nishida\nwas infusing Western philosophy with Asian thought far more\npervasively than the few references to Buddhism above might indicate.\n\n\nIn general, we can discern two ways that Nishida made use of Asian\nsources: anecdotally and systematically. Nishida’s writings are strewn\nwith unacknowledged quotations or paraphrases of verses in classical\nChinese sources, as well as allusions that may or may not identify\ntheir source in Indian, Chinese, or Japanese literature. This sort of\nallusion is anecdotal.  Unobtrusively placed in the current of a\ndiscussion on a particular issue, the anecdotal allusions serve to\nclarify an idea, to provide a concrete example, or to insert a playful\nturn of phrase into otherwise ponderous prose.  One example is the\npassage in the early work, Intuition and Reflection in\nSelf-Consciousness, where Nishida argues that the will of the\nindividual can freely express absolute will as the creative activity\nof the universe when the individual will operates spontaneously,\nwithout reflection or objectification.  Nishida inserts a saying from\nthe Zen Buddhist Record of Linji in the middle of a sentence\nto express this undivided spontaneity: “To think of the infinite\nbehind the finite, or of noumenon behind actuality, is to enter the\nrealm of objectified knowledge.  In the immediate, lived experience of\nwilling, however, the finite is immediately infinite, actuality is\nimmediately noumenon, one walks when needing to walk and sits when\nneeding to sit, and there is no interval for conceptual\nanalysis” (NKZ II, 299; see Nishida 1987b, 147). Nishida also\nincorporates Confucian phrases, often without identifying them as\nsuch. In his first book, An Inquiry Into the Good, for\nexample, arguing that logical reasons are often not sufficient to\nmotivate good conduct, he alludes to a maxim of Confucius: “The\nsaying Do not do unto others what you would not have others do\nunto you, is nearly meaningless without the motivation of\nsympathy” (Nishida 1990, 113; NKZ I, 132).\n\n\nNishida makes use of Asian philosophies systematically both in key\nnotions such as nothingness and in the methods that\ncharacterize his thinking.  The notion of absolute nothingness recalls\nIndian ideas as well as Chinese Daoist and Buddhist\nexpressions. Indeed, Nishida once suggested that we can distinguish\ntraditional Eastern and Western philosophies by the East’s\nprioritizing of nothingness and the West’s reliance on being (NKZ VII,\n429–30; Nishida 1970b, 237). He explicitly mentions the profound idea\nof nothingness developed in Indian religion (Nishida 1970b, 239), and\nwe can find a precedent to his notion of absolute nothingness as beyond\nbeing and nonbeing in the Hymn of Creation in book ten of the Rg\nVeda: “nonbeing existed not, nor being”\n(Radhakrishnan 1957, 23). Nishida also had in mind the Chinese Daoist\nclassics attributed to Laozi and Zhuangzi, where “the Way (or\nDao) was clearly said to be ‘nonbeing’” (Nishida\n1970b, 242). The Japanese term Nishida uses is mu\n(wu in Chinese), a sinogram that in Chinese literature\nusually functions simply as a negation of being or having and in this\nrespect fails to convey Nishida’s full sense of nothingness that does\nnot reduce to a lack of being. Nevertheless, philosophical Daoist\nliterature provided a precedent that Nishida could draw upon. In\nchapter 40 of Laozi’s Daodejing we find the statement,\n“The myriad things are born from being. Being is born from\nnonbeing.” Reminiscent of Nishida’s absolute nothingness as a\ncreative source, the Daodejing refers to the generative power\nof nonbeing and to the non-nameable Dao or Way that gives rise to the\nmyriad things. One source suggestive of Nishida’s sense of absolute\nnothingness as the most inclusive and undifferentiated place is the text\nknown by its legendary author’s name, the Zhuangzi. It refers to\na Dao that has never known boundaries but preserves the possibility of\ndistinctions. Taken up by Chinese Buddhism, wu not only\nreferred to non-existence but also served as a variant of the Mahayana\nBuddhist notion of emptiness (śūnyatā), a\nnegation of the self-subsistence of individual beings and an\naffirmation of their interdependence. Nishida drew upon such Buddhist\nand Daoist precedents in formulating his critique of substantialist\nmetaphysics and his notion of absolute nothingness as an\nall-encompassing, ultimate frame of reference that is creative yet not\ntranscendent to the world.\n\n\nSystematic use of Asian philosophies is also apparent in Nishida’s\nmethods. Where his arguments seek higher forms of inclusion rather\nthan rejection of opposing views, he harks back to Chinese Buddhist\nschemes of explanation that absorb and contextualize rival doctrines\nrather than exclude them. Nishida’s manner of contextualizing, in his\ntheory of place or topos, draws from Chinese cosmological methods in\nwhich “to explain and infer is to locate within the\npattern” (Graham 1989, 320; cited in Dalissier 2009b,\n226). Yogacara Buddhist theories of consciousness as the primary\nreality and explanatory principle most likely influenced Nishida’s\ntendency in his early works to explain all reality in terms of\nconsciousness. Later, his way of unifying opposites and defining\nthings in terms of self-negation adapts a\nBuddhist prajñapāramitā logic of negation,\nin which individuated terms entail their negation and are understood\nas co-relational rather than exclusive.\n\n\nBut the reader of Nishida can find resonances with certain Asian philosophical ideas even when Nishida did not make use of them. Even where there is no evidence of direct influence, the affinity of\nsome key notions and arguments with classical Indian Buddhist ideas is\nstriking. It is possible, for example, to read Nishida’s development of\nthe three topoi or places of being, relative nothingness, and absolute\nnothingness, as a deepening of awareness that resembles the\nprogression of awareness, described in many Buddhist schemes, where one first sees through the realm of desire, then through the\nrealm of forms, and finally awakens to the formless realm beyond discrimination (Stevens\n2009, 71). Also suggestive of the convictions underlying Nishida’s\nphilosophy are arguments of the Mādhyamaka school of\nNāgārjuna pressing for the relationality of all existents,\nand exhortations to appreciate the “groundlessless of\nthings” in the Vimalakīrti-nirdeśa Sūtra\n(Priest 2009, 472). We might also recognize distant affinities—and related significant differences—between Nishida’s notion of reality (the world) itself becoming self-aware and pre-Buddhist Indian Vedanta, or its later development, non-dual Advaita Vedanta.  Where some Vedantic texts equate reality with Brahman and assert that “awareness is Brahman” (prajñānaṁbrahma, Aitareya Upanishad 3.3), “I am Brahman” (ahaṁbrahmāsmi, Brihadaranyaka Upanishad 1.4.10), or “You are That” (tat tvam asi, Chandogya Upanishad 6.8.7), meaning your true self is identical with ultimate reality, Nishida places a caesura—his “inverse correlation”—in the equation of relative human self and the Absolute.  Yet when Nishida urges us to “see the self from the standpoint of the world,” he suggests a kind of phenomenological bracketing or epoché of the “I”—of the Ichdoxa—that resonates with the intentions of these Vedantic expressions.  That implied suggestion and its challenge to both Vedantic thought and Husserlian phenomenology, however, remain to be explored in the growing literature on Nishida’s philosophy.     \n\n",
    "section_title": "9. The Place of Asian Philosophies in Nishida’s Thought",
    "entry_title": "Nishida Kitarō",
    "hierarchy_title": "Nishida Kitarō || The Place of Asian Philosophies in Nishida’s Thought",
    "tokenized_text": [
        "place",
        "asian",
        "philosophy",
        "nishida",
        "thought",
        "place",
        "asian",
        "philosophy",
        "nishida",
        "thought",
        "nishida",
        "throughout",
        "career",
        "cited",
        "western",
        "philosopher",
        "far",
        "often",
        "asian",
        "source",
        "easy",
        "read",
        "thought",
        "ongoing",
        "engagement",
        "problem",
        "origin",
        "western",
        "tradition",
        "addressing",
        "concern",
        "western",
        "thinker",
        "followed",
        "path",
        "taken",
        "nearly",
        "japanese",
        "professor",
        "philosophy",
        "since",
        "inception",
        "academic",
        "discipline",
        "s",
        "yet",
        "appropriation",
        "idea",
        "asian",
        "philosophy",
        "also",
        "evident",
        "discerning",
        "reader",
        "way",
        "allusion",
        "affinity",
        "direct",
        "citation",
        "always",
        "necessary",
        "name",
        "asian",
        "source",
        "explicitly",
        "could",
        "appeal",
        "general",
        "education",
        "japanese",
        "reader",
        "would",
        "familiar",
        "classic",
        "asia",
        "convention",
        "appropriating",
        "idea",
        "without",
        "directly",
        "referring",
        "commentator",
        "long",
        "pointed",
        "debt",
        "nishida",
        "zen",
        "buddhist",
        "practice",
        "thought",
        "recently",
        "begun",
        "identify",
        "asian",
        "source",
        "philosophy",
        "researching",
        "vast",
        "library",
        "asian",
        "language",
        "dalissier",
        "b",
        "retrospect",
        "clear",
        "along",
        "nishida",
        "infusing",
        "western",
        "philosophy",
        "asian",
        "thought",
        "far",
        "pervasively",
        "reference",
        "buddhism",
        "might",
        "indicate",
        "general",
        "discern",
        "two",
        "way",
        "nishida",
        "made",
        "use",
        "asian",
        "source",
        "anecdotally",
        "systematically",
        "nishida",
        "writing",
        "strewn",
        "unacknowledged",
        "quotation",
        "paraphrase",
        "verse",
        "classical",
        "chinese",
        "source",
        "well",
        "allusion",
        "may",
        "may",
        "identify",
        "source",
        "indian",
        "chinese",
        "japanese",
        "literature",
        "sort",
        "allusion",
        "anecdotal",
        "unobtrusively",
        "placed",
        "current",
        "discussion",
        "particular",
        "issue",
        "anecdotal",
        "allusion",
        "serve",
        "clarify",
        "idea",
        "provide",
        "concrete",
        "example",
        "insert",
        "playful",
        "turn",
        "phrase",
        "otherwise",
        "ponderous",
        "prose",
        "one",
        "example",
        "passage",
        "early",
        "work",
        "intuition",
        "reflection",
        "selfconsciousness",
        "nishida",
        "argues",
        "individual",
        "freely",
        "express",
        "absolute",
        "creative",
        "activity",
        "universe",
        "individual",
        "operates",
        "spontaneously",
        "without",
        "reflection",
        "objectification",
        "nishida",
        "insert",
        "saying",
        "zen",
        "buddhist",
        "record",
        "linji",
        "middle",
        "sentence",
        "express",
        "undivided",
        "spontaneity",
        "think",
        "infinite",
        "behind",
        "finite",
        "noumenon",
        "behind",
        "actuality",
        "enter",
        "realm",
        "objectified",
        "knowledge",
        "immediate",
        "lived",
        "experience",
        "willing",
        "however",
        "finite",
        "immediately",
        "infinite",
        "actuality",
        "immediately",
        "noumenon",
        "one",
        "walk",
        "needing",
        "walk",
        "sits",
        "needing",
        "sit",
        "interval",
        "conceptual",
        "analysis",
        "nkz",
        "ii",
        "see",
        "nishida",
        "b",
        "nishida",
        "also",
        "incorporates",
        "confucian",
        "phrase",
        "often",
        "without",
        "identifying",
        "first",
        "book",
        "inquiry",
        "good",
        "example",
        "arguing",
        "logical",
        "reason",
        "often",
        "sufficient",
        "motivate",
        "good",
        "conduct",
        "alludes",
        "maxim",
        "confucius",
        "saying",
        "unto",
        "others",
        "would",
        "others",
        "unto",
        "nearly",
        "meaningless",
        "without",
        "motivation",
        "sympathy",
        "nishida",
        "nkz",
        "nishida",
        "make",
        "use",
        "asian",
        "philosophy",
        "systematically",
        "key",
        "notion",
        "nothingness",
        "method",
        "characterize",
        "thinking",
        "notion",
        "absolute",
        "nothingness",
        "recall",
        "indian",
        "idea",
        "well",
        "chinese",
        "daoist",
        "buddhist",
        "expression",
        "indeed",
        "nishida",
        "suggested",
        "distinguish",
        "traditional",
        "eastern",
        "western",
        "philosophy",
        "east",
        "prioritizing",
        "nothingness",
        "west",
        "reliance",
        "nkz",
        "vii",
        "nishida",
        "b",
        "explicitly",
        "mention",
        "profound",
        "idea",
        "nothingness",
        "developed",
        "indian",
        "religion",
        "nishida",
        "b",
        "find",
        "precedent",
        "notion",
        "absolute",
        "nothingness",
        "beyond",
        "nonbeing",
        "hymn",
        "creation",
        "book",
        "ten",
        "rg",
        "veda",
        "nonbeing",
        "existed",
        "radhakrishnan",
        "nishida",
        "also",
        "mind",
        "chinese",
        "daoist",
        "classic",
        "attributed",
        "laozi",
        "zhuangzi",
        "way",
        "dao",
        "clearly",
        "said",
        "nonbeing",
        "nishida",
        "b",
        "japanese",
        "term",
        "nishida",
        "us",
        "mu",
        "wu",
        "chinese",
        "sinogram",
        "chinese",
        "literature",
        "usually",
        "function",
        "simply",
        "negation",
        "respect",
        "fails",
        "convey",
        "nishida",
        "full",
        "sense",
        "nothingness",
        "reduce",
        "lack",
        "nevertheless",
        "philosophical",
        "daoist",
        "literature",
        "provided",
        "precedent",
        "nishida",
        "could",
        "draw",
        "upon",
        "chapter",
        "laozi",
        "daodejing",
        "find",
        "statement",
        "myriad",
        "thing",
        "born",
        "born",
        "nonbeing",
        "reminiscent",
        "nishida",
        "absolute",
        "nothingness",
        "creative",
        "source",
        "daodejing",
        "refers",
        "generative",
        "power",
        "nonbeing",
        "nonnameable",
        "dao",
        "way",
        "give",
        "rise",
        "myriad",
        "thing",
        "one",
        "source",
        "suggestive",
        "nishida",
        "sense",
        "absolute",
        "nothingness",
        "inclusive",
        "undifferentiated",
        "place",
        "text",
        "known",
        "legendary",
        "author",
        "name",
        "zhuangzi",
        "refers",
        "dao",
        "never",
        "known",
        "boundary",
        "preserve",
        "possibility",
        "distinction",
        "taken",
        "chinese",
        "buddhism",
        "wu",
        "referred",
        "nonexistence",
        "also",
        "served",
        "variant",
        "mahayana",
        "buddhist",
        "notion",
        "emptiness",
        "śūnyatā",
        "negation",
        "selfsubsistence",
        "individual",
        "being",
        "affirmation",
        "interdependence",
        "nishida",
        "drew",
        "upon",
        "buddhist",
        "daoist",
        "precedent",
        "formulating",
        "critique",
        "substantialist",
        "metaphysics",
        "notion",
        "absolute",
        "nothingness",
        "allencompassing",
        "ultimate",
        "frame",
        "reference",
        "creative",
        "yet",
        "transcendent",
        "world",
        "systematic",
        "use",
        "asian",
        "philosophy",
        "also",
        "apparent",
        "nishida",
        "method",
        "argument",
        "seek",
        "higher",
        "form",
        "inclusion",
        "rather",
        "rejection",
        "opposing",
        "view",
        "harks",
        "back",
        "chinese",
        "buddhist",
        "scheme",
        "explanation",
        "absorb",
        "contextualize",
        "rival",
        "doctrine",
        "rather",
        "exclude",
        "nishida",
        "manner",
        "contextualizing",
        "theory",
        "place",
        "topos",
        "draw",
        "chinese",
        "cosmological",
        "method",
        "explain",
        "infer",
        "locate",
        "within",
        "pattern",
        "graham",
        "cited",
        "dalissier",
        "b",
        "yogacara",
        "buddhist",
        "theory",
        "consciousness",
        "primary",
        "reality",
        "explanatory",
        "principle",
        "likely",
        "influenced",
        "nishida",
        "tendency",
        "early",
        "work",
        "explain",
        "reality",
        "term",
        "consciousness",
        "later",
        "way",
        "unifying",
        "opposite",
        "defining",
        "thing",
        "term",
        "selfnegation",
        "adapts",
        "buddhist",
        "prajñapāramitā",
        "logic",
        "negation",
        "individuated",
        "term",
        "entail",
        "negation",
        "understood",
        "corelational",
        "rather",
        "exclusive",
        "reader",
        "nishida",
        "find",
        "resonance",
        "certain",
        "asian",
        "philosophical",
        "idea",
        "even",
        "nishida",
        "make",
        "use",
        "even",
        "evidence",
        "direct",
        "influence",
        "affinity",
        "key",
        "notion",
        "argument",
        "classical",
        "indian",
        "buddhist",
        "idea",
        "striking",
        "possible",
        "example",
        "read",
        "nishida",
        "development",
        "three",
        "topos",
        "place",
        "relative",
        "nothingness",
        "absolute",
        "nothingness",
        "deepening",
        "awareness",
        "resembles",
        "progression",
        "awareness",
        "described",
        "many",
        "buddhist",
        "scheme",
        "one",
        "first",
        "see",
        "realm",
        "desire",
        "realm",
        "form",
        "finally",
        "awakens",
        "formless",
        "realm",
        "beyond",
        "discrimination",
        "stevens",
        "also",
        "suggestive",
        "conviction",
        "underlying",
        "nishida",
        "philosophy",
        "argument",
        "mādhyamaka",
        "school",
        "nāgārjuna",
        "pressing",
        "relationality",
        "existents",
        "exhortation",
        "appreciate",
        "groundlessless",
        "thing",
        "vimalakīrtinirdeśa",
        "sūtra",
        "priest",
        "might",
        "also",
        "recognize",
        "distant",
        "affinitiesand",
        "related",
        "significant",
        "differencesbetween",
        "nishida",
        "notion",
        "reality",
        "world",
        "becoming",
        "selfaware",
        "prebuddhist",
        "indian",
        "vedanta",
        "later",
        "development",
        "nondual",
        "advaita",
        "vedanta",
        "vedantic",
        "text",
        "equate",
        "reality",
        "brahman",
        "assert",
        "awareness",
        "brahman",
        "prajñānaṁbrahma",
        "aitareya",
        "upanishad",
        "brahman",
        "ahaṁbrahmāsmi",
        "brihadaranyaka",
        "upanishad",
        "tat",
        "tvam",
        "asi",
        "chandogya",
        "upanishad",
        "meaning",
        "true",
        "self",
        "identical",
        "ultimate",
        "reality",
        "nishida",
        "place",
        "caesurahis",
        "inverse",
        "correlation",
        "in",
        "equation",
        "relative",
        "human",
        "self",
        "absolute",
        "yet",
        "nishida",
        "urge",
        "u",
        "see",
        "self",
        "standpoint",
        "world",
        "suggests",
        "kind",
        "phenomenological",
        "bracketing",
        "epoché",
        "of",
        "ichdoxathat",
        "resonates",
        "intention",
        "vedantic",
        "expression",
        "implied",
        "suggestion",
        "challenge",
        "vedantic",
        "thought",
        "husserlian",
        "phenomenology",
        "however",
        "remain",
        "explored",
        "growing",
        "literature",
        "nishida",
        "philosophy"
    ]
}