{
    "main_text": "Mathematical Fictionalism || Assessment: benefits and problems of mathematical fictionalism\n3.3 Assessment: benefits and problems of mathematical fictionalism\n3.3.1 The epistemological problem\nGiven that mathematical objects do not exist, on the mathematical\nfictionalist perspective, the problem of how we can obtain knowledge\nof them simply vanishes. But another problem emerges instead: what is\nit that distinguishes a mathematician (who knows a lot about\nmathematics) and a non-mathematician (who does not have such\nknowledge)? The difference here (according to Field 1984) is not about\nhaving or lacking mathematical knowledge, but rather it is\nabout logical knowledge: of knowing which mathematical\ntheorems follow from certain mathematical principles, and which do\nnot. The epistemological problem is then solved—as long as the\nmathematical fictionalist provides an epistemology\nfor logic.\nIn fact, what needs to be offered is ultimately an epistemology\nfor modality. After all, on Field's account, in order to\navoid the platonist commitment to models or proofs, the concept of\nlogical consequence is understood in terms of the primitive modal\nconcept of logical possibility: A follows logically\nfrom B as long as the conjunction of B and the negation\nof A is impossible, that is, ¬◊(B ∧\n¬A).\nHowever, how are such judgments of impossibility established? Under\nwhat conditions do we know that they hold? In simple cases, involving\nstraightforward statements, to establish such judgments may be\nunproblematic. The problem emerges when more substantive statements\nare invoked. In these cases, we seem to need a significant amount\nof mathematical information in order to be able to determine\nwhether the impossibilities in question really hold or not. Consider,\nfor instance, the difficulty of establishing the independence of the\naxiom of choice and the continuum hypotheses from the axioms of\nZermelo-Fraenkel set theory. Significantly complex mathematical models\nneed to be constructed in this case, which rely on the development of\nspecial mathematical techniques to build them. What is required from\nthe mathematical fictionalist at this stage is the nominalization of\nset theory itself—something that, as we saw, Field still owes\nus.\n3.3.2 The problem of the application of mathematics\nSimilarly to the epistemological problem, the problem of the\napplication of mathematics is partially solved by the mathematical\nfictionalist. Field provides an account of the application of\nmathematics that does not require the truth of mathematical\ntheories. As we saw, this demands that mathematics be conservative in\nthe relevant sense. However, it is unclear whether Field has\nestablished the conservativeness of mathematics, given his restrictive\nway of introducing non-set-theoretic vocabulary into the axioms of set\ntheory as part of his attempted proof of the conservativeness of set\ntheory (Azzouni 2009b, p. 169, note 47; additional difficulties for\nthe mathematical fictionalist program can be found in Melia 1998,\n2000). Field was working with restricted ZFU, Zermelo-Fraenkel set\ntheory with the axiom of choice modified to allow\nfor Urelemente, objects that are not sets, but not\nallowing for any non-set-theoretic vocabulary to appear in the\ncomprehension axioms, that is, replacement or separation (Field\n1980, p. 17). This is, however, a huge restriction, given that when\nmathematics is actually applied, non-set-theoretic vocabulary, when\ntranslated into set-theoretic language, will have to appear in the\ncomprehension axioms. As formulated by Field, the proof failed to\naddress the crucial case of actual applications of mathematics.\nMoreover, it is also unclear whether the nominalization program\nadvanced by the mathematical fictionalist can be extended to other\nscientific theories, such as quantum mechanics (Malament 1992). Mark\nBalaguer responded to this challenge by trying to nominalize quantum\nmechanics along mathematical fictionalist lines (Balaguer\n1998). However, as argued by Bueno (Bueno 2003), Balaguer's strategy\nis incompatible with a number of interpretations of quantum mechanics,\nin particular with Bas van Fraassen's version of the modal\ninterpretation (van Fraassen 1991). And given that Balaguer's strategy\ninvokes physically real propensities, it is unclear whether it is even\ncompatible with nominalism. As a result, the nominalization of quantum\nmechanics still remains a major problem for the mathematical\nfictionalist.\nBut even if these difficulties can all be addressed, it is unclear\nthat the mathematical fictionalist has offered an account of the\napplication of mathematics that allows us to make sense of how\nmathematical theories are actually applied. After all, the\nfictionalist account requires us to rewrite the relevant theories, by\nfinding suitable nominalistic versions for them. This leaves the issue\nof making sense of the actual process of the application of\nmathematics entirely untouched, given that no such reformulations are\never employed in actual scientific practice. Rather than engaging with\nactual features of the application process, the fictionalist creates a\nparallel discourse in an effort to provide a nominalist reconstruction\nof the use of mathematics in science. The reconstruction shows, at\nbest, that mathematical fictionalists need not worry about the\napplication of mathematics vis-à-vis increasing their\nontology. But the problem still remains of whether they are in a\nposition to make sense of the actual use of mathematics in\nscience. This problem, which is crucial for a proper\nunderstanding of mathematical practice, still remains.\nA similar difficulty also emerges for Balaguer's version of\nfictionalism (see the second half of Balaguer 1998). Balaguer relies\non the possibility of distinguishing between the mathematical and the\nphysical contents of an applied mathematical theory: in particular,\nthe truth of such a theory holds only in virtue of physical facts,\nwith no contribution from mathematics. It is, however, controversial\nwhether the distinction between mathematical and physical content can\nbe characterized without implementing a Field-like nominalization\nprogram. In this case, the same difficulties that the latter face also\ncarry over to Balaguer's account (Colyvan 2010; Azzouni 2011).\nMoreover, according to Azzouni (Azzouni 2009b), in order for\nscientists to use a scientific theory, they need to assert\nit. On his view, it is not enough for scientists simply to recognize\nthat a scientific theory is true (or exhibits some other theoretical\nvirtue). It is required that they assert the theory. In particular,\nscientists would then need to assert a nominalistic theory. They\ncannot simply contemplate such a theory; they need to be able to\nassert it as well (Azzouni 2009b, footnotes 31, 43, 53, and 55, and\np. 171). Thus, nominalists who grant this point to Azzouni need to\nshow that scientists are in a position to assert the relevant\nnominalistic theories in order to address the issue of the application\nof mathematics.\n3.3.3 Uniform semantics\nIn one respect, mathematical fictionalists offer a uniform\nsemantics for mathematical and scientific discourse, in another\nrespect, they don't. Initially, both types of discourse are assessed\nin the same way. Electrons and relations among them make certain\nquantum-mechanical statements true; in turn, mathematical objects and\nrelations among them make the corresponding mathematical\nstatements true. It just happens that, as opposed to electrons on a\nrealist interpretation of quantum mechanics, mathematical objects do\nnot exist. Hence, as noted, existential mathematical statements, such\nas ‘there are infinitely many prime numbers’, are\nfalse. Although the resulting truth-value assignments for existential\nstatements conflict with those found in mathematical practice, at\nleast the same semantics is offered for mathematical and scientific\nlanguages.\nIn an attempt to agree with the truth-value assignments that are\nusually displayed in mathematical discourse, the mathematical\nfictionalist introduces a fictional operator: ‘According to\nmathematical theory M…’. Such an operator,\nhowever, changes the semantics of mathematical discourse. Applied to a\ntrue mathematical statement, at least one that the platonist\nrecognizes as true, the result will be a true statement—even\naccording to the mathematical fictionalist. For instance, from both\nplatonist and fictionalist perspectives, the statement\n‘according to arithmetic, there are infinitely many prime\nnumbers’ comes out true. But, in this case, the mathematical\nfictionalist can no longer offer a unified semantics for mathematical\nand scientific languages, given that the latter does not involve the\nintroduction of fictional operators. Thus, whether mathematical\nfictionalists are able to provide a uniform semantics ultimately\ndepends on whether fictional operators are introduced or not.\n3.3.4. Taking mathematics literally\nAn immediate consequence of the introduction of fiction operators\nis that mathematical discourse is no longer taken literally. As just\nnoted, without such operators, mathematical fictionalism produces\nnon-standard attributions of truth-values to mathematical\nstatements. But with fiction operators in place, the syntax of\nmathematical discourse is changed, and thus the latter cannot be taken\nliterally.\n3.3.5 The ontological problem\nThe ontological problem—the problem of the acceptability of\nthe ontological commitments made by the mathematical\nfictionalist—is basically solved. No commitment to mathematical\nobjects is, in principle, made. Although a primitive modal notion is\nintroduced, it has only a limited role in the nominalization of\nmathematics: to allow for a nominalist formulation of the crucial\nconcept of conservativeness. As we saw, however, without a proper\nnominalization of set theory itself, it is unclear whether the\nmathematical fictionalist program ultimately succeeds.\n\n",
    "section_title": "3.3 Assessment: benefits and problems of mathematical fictionalism",
    "entry_title": "Nominalism in the Philosophy of Mathematics",
    "hierarchy_title": "Nominalism in the Philosophy of Mathematics || Mathematical Fictionalism || Assessment: benefits and problems of mathematical fictionalism",
    "tokenized_text": [
        "mathematical",
        "fictionalism",
        "assessment",
        "benefit",
        "problem",
        "mathematical",
        "fictionalism",
        "assessment",
        "benefit",
        "problem",
        "mathematical",
        "fictionalism",
        "epistemological",
        "problem",
        "given",
        "mathematical",
        "object",
        "exist",
        "mathematical",
        "fictionalist",
        "perspective",
        "problem",
        "obtain",
        "knowledge",
        "simply",
        "vanishes",
        "another",
        "problem",
        "emerges",
        "instead",
        "distinguishes",
        "mathematician",
        "know",
        "lot",
        "mathematics",
        "nonmathematician",
        "knowledge",
        "difference",
        "according",
        "field",
        "lacking",
        "mathematical",
        "knowledge",
        "rather",
        "logical",
        "knowledge",
        "knowing",
        "mathematical",
        "theorem",
        "follow",
        "certain",
        "mathematical",
        "principle",
        "epistemological",
        "problem",
        "solvedas",
        "long",
        "mathematical",
        "fictionalist",
        "provides",
        "epistemology",
        "logic",
        "fact",
        "need",
        "offered",
        "ultimately",
        "epistemology",
        "modality",
        "field",
        "s",
        "account",
        "order",
        "avoid",
        "platonist",
        "commitment",
        "model",
        "proof",
        "concept",
        "logical",
        "consequence",
        "understood",
        "term",
        "primitive",
        "modal",
        "concept",
        "logical",
        "possibility",
        "follows",
        "logically",
        "b",
        "long",
        "conjunction",
        "b",
        "negation",
        "impossible",
        "b",
        "a",
        "however",
        "judgment",
        "impossibility",
        "established",
        "condition",
        "know",
        "hold",
        "simple",
        "case",
        "involving",
        "straightforward",
        "statement",
        "establish",
        "judgment",
        "may",
        "unproblematic",
        "problem",
        "emerges",
        "substantive",
        "statement",
        "invoked",
        "case",
        "seem",
        "need",
        "significant",
        "amount",
        "mathematical",
        "information",
        "order",
        "able",
        "determine",
        "whether",
        "impossibility",
        "question",
        "really",
        "hold",
        "consider",
        "instance",
        "difficulty",
        "establishing",
        "independence",
        "axiom",
        "choice",
        "continuum",
        "hypothesis",
        "axiom",
        "zermelofraenkel",
        "set",
        "theory",
        "significantly",
        "complex",
        "mathematical",
        "model",
        "need",
        "constructed",
        "case",
        "rely",
        "development",
        "special",
        "mathematical",
        "technique",
        "build",
        "required",
        "mathematical",
        "fictionalist",
        "stage",
        "nominalization",
        "set",
        "theory",
        "itselfsomething",
        "saw",
        "field",
        "still",
        "owes",
        "u",
        "problem",
        "application",
        "mathematics",
        "similarly",
        "epistemological",
        "problem",
        "problem",
        "application",
        "mathematics",
        "partially",
        "solved",
        "mathematical",
        "fictionalist",
        "field",
        "provides",
        "account",
        "application",
        "mathematics",
        "require",
        "truth",
        "mathematical",
        "theory",
        "saw",
        "demand",
        "mathematics",
        "conservative",
        "relevant",
        "sense",
        "however",
        "unclear",
        "whether",
        "field",
        "established",
        "conservativeness",
        "mathematics",
        "given",
        "restrictive",
        "way",
        "introducing",
        "nonsettheoretic",
        "vocabulary",
        "axiom",
        "set",
        "theory",
        "part",
        "attempted",
        "proof",
        "conservativeness",
        "set",
        "theory",
        "azzouni",
        "b",
        "p",
        "note",
        "additional",
        "difficulty",
        "mathematical",
        "fictionalist",
        "program",
        "found",
        "melia",
        "field",
        "working",
        "restricted",
        "zfu",
        "zermelofraenkel",
        "set",
        "theory",
        "axiom",
        "choice",
        "modified",
        "allow",
        "urelemente",
        "object",
        "set",
        "allowing",
        "nonsettheoretic",
        "vocabulary",
        "appear",
        "comprehension",
        "axiom",
        "replacement",
        "separation",
        "field",
        "p",
        "however",
        "huge",
        "restriction",
        "given",
        "mathematics",
        "actually",
        "applied",
        "nonsettheoretic",
        "vocabulary",
        "translated",
        "settheoretic",
        "language",
        "appear",
        "comprehension",
        "axiom",
        "formulated",
        "field",
        "proof",
        "failed",
        "address",
        "crucial",
        "case",
        "actual",
        "application",
        "mathematics",
        "moreover",
        "also",
        "unclear",
        "whether",
        "nominalization",
        "program",
        "advanced",
        "mathematical",
        "fictionalist",
        "extended",
        "scientific",
        "theory",
        "quantum",
        "mechanic",
        "malament",
        "mark",
        "balaguer",
        "responded",
        "challenge",
        "trying",
        "nominalize",
        "quantum",
        "mechanic",
        "along",
        "mathematical",
        "fictionalist",
        "line",
        "balaguer",
        "however",
        "argued",
        "bueno",
        "bueno",
        "balaguer",
        "s",
        "strategy",
        "incompatible",
        "number",
        "interpretation",
        "quantum",
        "mechanic",
        "particular",
        "ba",
        "van",
        "fraassen",
        "s",
        "version",
        "modal",
        "interpretation",
        "van",
        "fraassen",
        "given",
        "balaguer",
        "s",
        "strategy",
        "invokes",
        "physically",
        "real",
        "propensity",
        "unclear",
        "whether",
        "even",
        "compatible",
        "nominalism",
        "result",
        "nominalization",
        "quantum",
        "mechanic",
        "still",
        "remains",
        "major",
        "problem",
        "mathematical",
        "fictionalist",
        "even",
        "difficulty",
        "addressed",
        "unclear",
        "mathematical",
        "fictionalist",
        "offered",
        "account",
        "application",
        "mathematics",
        "allows",
        "u",
        "make",
        "sense",
        "mathematical",
        "theory",
        "actually",
        "applied",
        "fictionalist",
        "account",
        "requires",
        "u",
        "rewrite",
        "relevant",
        "theory",
        "finding",
        "suitable",
        "nominalistic",
        "version",
        "leaf",
        "issue",
        "making",
        "sense",
        "actual",
        "process",
        "application",
        "mathematics",
        "entirely",
        "untouched",
        "given",
        "reformulations",
        "ever",
        "employed",
        "actual",
        "scientific",
        "practice",
        "rather",
        "engaging",
        "actual",
        "feature",
        "application",
        "process",
        "fictionalist",
        "creates",
        "parallel",
        "discourse",
        "effort",
        "provide",
        "nominalist",
        "reconstruction",
        "use",
        "mathematics",
        "science",
        "reconstruction",
        "show",
        "best",
        "mathematical",
        "fictionalists",
        "need",
        "worry",
        "application",
        "mathematics",
        "visàvis",
        "increasing",
        "ontology",
        "problem",
        "still",
        "remains",
        "whether",
        "position",
        "make",
        "sense",
        "actual",
        "use",
        "mathematics",
        "science",
        "problem",
        "crucial",
        "proper",
        "understanding",
        "mathematical",
        "practice",
        "still",
        "remains",
        "similar",
        "difficulty",
        "also",
        "emerges",
        "balaguer",
        "s",
        "version",
        "fictionalism",
        "see",
        "second",
        "half",
        "balaguer",
        "balaguer",
        "relies",
        "possibility",
        "distinguishing",
        "mathematical",
        "physical",
        "content",
        "applied",
        "mathematical",
        "theory",
        "particular",
        "truth",
        "theory",
        "hold",
        "virtue",
        "physical",
        "fact",
        "contribution",
        "mathematics",
        "however",
        "controversial",
        "whether",
        "distinction",
        "mathematical",
        "physical",
        "content",
        "characterized",
        "without",
        "implementing",
        "fieldlike",
        "nominalization",
        "program",
        "case",
        "difficulty",
        "latter",
        "face",
        "also",
        "carry",
        "balaguer",
        "s",
        "account",
        "colyvan",
        "azzouni",
        "moreover",
        "according",
        "azzouni",
        "azzouni",
        "b",
        "order",
        "scientist",
        "use",
        "scientific",
        "theory",
        "need",
        "assert",
        "view",
        "enough",
        "scientist",
        "simply",
        "recognize",
        "scientific",
        "theory",
        "true",
        "exhibit",
        "theoretical",
        "virtue",
        "required",
        "assert",
        "theory",
        "particular",
        "scientist",
        "would",
        "need",
        "assert",
        "nominalistic",
        "theory",
        "simply",
        "contemplate",
        "theory",
        "need",
        "able",
        "assert",
        "well",
        "azzouni",
        "b",
        "footnote",
        "p",
        "thus",
        "nominalist",
        "grant",
        "point",
        "azzouni",
        "need",
        "show",
        "scientist",
        "position",
        "assert",
        "relevant",
        "nominalistic",
        "theory",
        "order",
        "address",
        "issue",
        "application",
        "mathematics",
        "uniform",
        "semantics",
        "one",
        "respect",
        "mathematical",
        "fictionalists",
        "offer",
        "uniform",
        "semantics",
        "mathematical",
        "scientific",
        "discourse",
        "another",
        "respect",
        "nt",
        "initially",
        "type",
        "discourse",
        "assessed",
        "way",
        "electron",
        "relation",
        "among",
        "make",
        "certain",
        "quantummechanical",
        "statement",
        "true",
        "turn",
        "mathematical",
        "object",
        "relation",
        "among",
        "make",
        "corresponding",
        "mathematical",
        "statement",
        "true",
        "happens",
        "opposed",
        "electron",
        "realist",
        "interpretation",
        "quantum",
        "mechanic",
        "mathematical",
        "object",
        "exist",
        "hence",
        "noted",
        "existential",
        "mathematical",
        "statement",
        "infinitely",
        "many",
        "prime",
        "number",
        "false",
        "although",
        "resulting",
        "truthvalue",
        "assignment",
        "existential",
        "statement",
        "conflict",
        "found",
        "mathematical",
        "practice",
        "least",
        "semantics",
        "offered",
        "mathematical",
        "scientific",
        "language",
        "attempt",
        "agree",
        "truthvalue",
        "assignment",
        "usually",
        "displayed",
        "mathematical",
        "discourse",
        "mathematical",
        "fictionalist",
        "introduces",
        "fictional",
        "operator",
        "according",
        "mathematical",
        "theory",
        "m",
        "operator",
        "however",
        "change",
        "semantics",
        "mathematical",
        "discourse",
        "applied",
        "true",
        "mathematical",
        "statement",
        "least",
        "one",
        "platonist",
        "recognizes",
        "true",
        "result",
        "true",
        "statementeven",
        "according",
        "mathematical",
        "fictionalist",
        "instance",
        "platonist",
        "fictionalist",
        "perspective",
        "statement",
        "according",
        "arithmetic",
        "infinitely",
        "many",
        "prime",
        "number",
        "come",
        "true",
        "case",
        "mathematical",
        "fictionalist",
        "longer",
        "offer",
        "unified",
        "semantics",
        "mathematical",
        "scientific",
        "language",
        "given",
        "latter",
        "involve",
        "introduction",
        "fictional",
        "operator",
        "thus",
        "whether",
        "mathematical",
        "fictionalists",
        "able",
        "provide",
        "uniform",
        "semantics",
        "ultimately",
        "depends",
        "whether",
        "fictional",
        "operator",
        "introduced",
        "taking",
        "mathematics",
        "literally",
        "immediate",
        "consequence",
        "introduction",
        "fiction",
        "operator",
        "mathematical",
        "discourse",
        "longer",
        "taken",
        "literally",
        "noted",
        "without",
        "operator",
        "mathematical",
        "fictionalism",
        "produce",
        "nonstandard",
        "attribution",
        "truthvalues",
        "mathematical",
        "statement",
        "fiction",
        "operator",
        "place",
        "syntax",
        "mathematical",
        "discourse",
        "changed",
        "thus",
        "latter",
        "taken",
        "literally",
        "ontological",
        "problem",
        "ontological",
        "problemthe",
        "problem",
        "acceptability",
        "ontological",
        "commitment",
        "made",
        "mathematical",
        "fictionalistis",
        "basically",
        "solved",
        "commitment",
        "mathematical",
        "object",
        "principle",
        "made",
        "although",
        "primitive",
        "modal",
        "notion",
        "introduced",
        "limited",
        "role",
        "nominalization",
        "mathematics",
        "allow",
        "nominalist",
        "formulation",
        "crucial",
        "concept",
        "conservativeness",
        "saw",
        "however",
        "without",
        "proper",
        "nominalization",
        "set",
        "theory",
        "unclear",
        "whether",
        "mathematical",
        "fictionalist",
        "program",
        "ultimately",
        "succeeds"
    ]
}