{
    "main_text": "Varieties of Nominalism || Nominalism about universals\n4.1 Nominalism about universals\n\n\nGiven that nominalists about universals believe only in particulars,\nthere are two strategies that they might implement regarding the\nquestion of the alleged existence of allegedly universal entities like\nproperties and relations. One strategy is to reject the existence of\nsuch entities. Another strategy is to accept that such entities exist\nbut to deny that they are universals. Both strategies have been\nimplemented in the history of philosophy. One way to implement these\nstrategies is to provide nominalistically acceptable paraphrases or\nanalyses of sentences that appear (a) to be true and (b) imply the\nexistence of universals. Another way, more fashionable nowadays, is to\ngive a nominalistic account of the truthmakers for sentences that are\napparently made true by universals.\n\n\nWhat follows is a brief review of the main nominalistic positions of\nthis sort, and of some of the problems they face. For the sake of\nbrevity I shall illustrate the positions only with respect to\nproperties. The extension to kinds and relations is straightforward and\nonly occasionally do I say what a certain theory says about\nrelations.\n\n\nProperties are entities that are meant to play different theoretical\nroles. For instance, one role they are meant to play is that of being\nthe semantic values of predicates. Another role is that of accounting\nfor similarity and the causal powers of things. But there is no reason\nwhy these different roles should be played by one and the same kind of\nentity. When philosophers nowadays discuss the issue of universals they\nnormally think of properties as entities that account for the\nsimilarity and causal powers of things. Properties in this sense are\nsometimes called sparse properties, as opposed to\nabundant properties (the distinction between sparse and\nabundant properties comes from Lewis 1983). Sparse properties are those\nwhich would be sufficient to account for the similarity and causal\npowers of things, and to characterise them completely and without\nredundancy. In what follows it is assumed, for the sake of example,\nthat properties like being square and being scarlet\ncount as sparse.\n\n\nThe question that realists and nominalists about universals try to\nanswer is: What makes F-things F\n(where “F” is a sparse property\npredicate)? For instance, what makes a square thing square? For the\nrealist about universals if something is square, this is in virtue of\nthe thing instantiating the universal squareness. In general, for the\nrealist about universals, things have the sparse properties they do in\nvirtue of instantiating universals.\n\n\nHow do nominalists answer this question? A popular nominalist theory\nof properties is so-called Trope Theory, which has been held by Donald\nWilliams (1953), Keith Campbell (1990), and Douglas Ehring (2011) among others. Trope theory\ndoes not reject the existence of properties, but takes properties to be\ncertain entities usually called ‘tropes’. Tropes are\nparticulars, in the same sense in which individual people and\nindividual apples are particulars. Thus when there is a scarlet apple\nthe scarletness of the apple is not a universal but a particular\nscarletness, the scarletness of this apple, which exists\nexactly where and when this apple is \n scarlet.[9] \nSuch a\nparticular scarletness is a trope. The apple is scarlet not in virtue\nof instantiating a universal but in virtue of possessing a scarlet\ntrope.\n\n\nBut what makes scarlet tropes scarlet tropes? One possible answer\nhere is that scarlet tropes are scarlet tropes because they resemble\neach other, where resemblance is not explained in terms of\ninstantiating some same universal. Of course crimson tropes also\nresemble each other. What makes a trope scarlet is that it resembles\nthese tropes (the scarlet ones) as opposed to resembling those ones\n(the crimson ones).\n\n\nAnother answer would be that scarlet tropes form a primitive natural\nclass (this view has been forcefully defended by Ehring 2011:\n175-241). But whether or not what makes scarlet tropes scarlet tropes\nis that they resemble each other, scarlet tropes do resemble each\nother.  And the fact that they do raises an important problem. This is\nthe problem of the resemblance regress. Suppose\nthat a, b and c are scarlet apples. If so,\neach one has its own scarlet trope: call\nthem sa, sb, and\nsc. Since sa,\nsb, and sc are scarlet tropes,\nevery two of them resemble each other. But then there are three\nresemblance tropes as well: the resemblance between\nsa and sb, the resemblance\nbetween sa and sc, and the\nresemblance between sb and sc.\nBut these resemblance tropes, since they are resemblance tropes,\nresemble each other. So there are ‘second-order’\nresemblance tropes: the resemblance between the resemblance between\nsa and sb and the resemblance\nbetween sa and sc, the\nresemblance between the resemblance between sa and\nsb and the resemblance between\nsb and sc, and the resemblance\nbetween the resemblance between sa and\nsc and the resemblance between\nsb and sc. But these\n‘second-order’ resemblance tropes resemble each other. So\nthere are ‘third-order’ resemblance tropes, and so on\nad infinitum.\n\n\nThere are some ways out for the trope theorist. One solution is to\nargue that the regress is not vicious at all and that at most it\nrepresents an increment in the number of entities (not kinds\nof entities) postulated by the theory. Another solution is to deny the\nexistence of resemblance tropes and make do only with resembling tropes\n(for further discussion see Daly 1997 and Maurin 2002,\n96–115).\n\n\nThere are other forms of nominalism about universals, two of which\nare Predicate Nominalism and Concept Nominalism. The realist about\nuniversals admits that the predicate ‘scarlet’ applies to a\nscarlet thing. But he says that the predicate ‘scarlet’\napplies to it in virtue of its being scarlet, which is nothing else\nthan its instantiating the universal scarletness. Similarly he says\nthat the thing in question falls under the concept scarlet in\nvirtue of being scarlet, which is nothing else than the thing\ninstantiating the universal scarletness. But for Predicate\nNominalism there is nothing like scarletness. According to this theory\na thing is scarlet in virtue of the fact that the predicate\n‘scarlet’ applies to it. Similarly, according to Concept\nNominalism (or Conceptualism), there is nothing like scarletness and a\nthing is scarlet in virtue of its falling under the concept\n scarlet.[10]\n These two views entail that if there were no\nspeakers or thinkers, things would not be scarlet. If only because of\nthis many would feel inclined towards another view, called Ostrich\n Nominalism.[11]\n This view, held by Quine, among others, maintains\nthat there is nothing in virtue of which our thing is scarlet: it just\nis scarlet (Devitt 1980, 97). But many think that being scarlet cannot\nbe a metaphysically ultimate fact, but that there must be something in\nvirtue of which scarlet things are scarlet.\n\n\nAnother theory is Mereological Nominalism, according to which the\nproperty of being scarlet is the aggregate of scarlet things, and for\nwhich something is scarlet in virtue of being a part of the aggregate\nof scarlet \n things.[12]\n An aggregate, or mereological sum, is a\nparticular. But the theory faces a difficulty with so-called extensive\nproperties like mass and shape. Not every part of the aggregate of\nsquare things is square since, for instance, not every sum of squares\nis itself square, and not every part of a square is itself square. So\nit is false that square things are square in virtue of being parts of\nthe aggregate of square things.\n\n\nA better theory in the same spirit is Class Nominalism, a\nversion of which was maintained by Lewis (1983). Whether abstract or\nnot, classes are particular on this \n view.[13]\n According to Class\nNominalism properties are classes of things, and so the property of\nbeing scarlet is the class of all and only scarlet\n things.[14]\n\n\n\nOne problem with this theory is that no two classes can have the\nsame members, while it does not seem that properties with the same\ninstances need be the same. So there is no guarantee that the\nidentification of properties with classes is correct. And even if\ncorrect, the identification is clearly not necessarily correct.\nFurthermore, if every F is a G and\nvice versa, the theory forces us to say that what makes something\nF is the same as what makes it G. But\nwhile every F might be a G and vice\nversa, it does not follow that what makes things F is\nthe same as what makes them G.\n\n\nOne solution to this is to embrace a version of Modal Realism, for\ninstance David Lewis', according to which other possible worlds\nexist and contain things of the same kinds as the things in the actual\nworld (see Lewis 1986a). Then properties get identified with classes\nwhose members need not belong to the same possible world. Thus the\nproperty of scarlet things is the class of things that are scarlet in\nany possible \n world.[15]\n And even if every actual F is a\nG and vice versa, since not every possible\nF is a G or vice versa, what makes\nsomething F, namely belonging to the class of actual\nand possible Fs, is not the same as what makes it\nG. The theory denies that there are and there could be\nnecessarily coextensive properties.\n\n\nAnother version of Nominalism is Resemblance Nominalism. According\nto this theory, it is not that scarlet things resemble one another\nbecause they are scarlet, but what makes them scarlet is that they\nresemble one another. Thus what makes something scarlet is that it\nresembles the scarlet things. Similarly, what makes square things\nsquare is that they resemble one another, and so what makes something\nsquare is that it resembles the square things. Resemblance is\nfundamental and primitive and so either there are no properties or the\nproperties of a thing depend on what things it resembles.\n\n\nThus on one version of the theory a property like being\nscarlet is a certain class whose members satisfy certain definite\nresemblance conditions. On another version of the theory there are no\nproperties, but what makes scarlet things scarlet is that they satisfy\ncertain resemblance conditions.\n\n\nWhat are these resemblance conditions? Sometimes the resemblance\nconditions include some that must be satisfied, not by the things in\nquestion (e.g. not by the scarlet things), but by things suitably\nrelated to them. For instance, in the version of Resemblance Nominalism\ndeveloped in Rodriguez-Pereyra 2002, what makes scarlet things scarlet\nis that they resemble each other, that there is a degree of resemblance\nd such that no two scarlet things, and no two\nnth-order pairs (two-membered unordered classes) whose\nur-elements are scarlet things, resemble each other to a degree less\nthan d, and that the class of scarlet things is or fails to be\nincluded in certain other classes defined in terms of resemblance\nconditions like the ones just mentioned (see Rodriguez-Pereyra 2002,\n156–98, for details). Of course the crimson things also resemble\neach other and they also meet the other conditions having to do with\nresemblance degrees and their class being or failing to be included in\ncertain other classes. But this does not mean that what makes something\nscarlet is what makes something crimson: what makes a scarlet thing\nscarlet is that it resembles these things (i.e. the scarlet\nones), which happen to satisfy the stated conditions having to do with\nresemblance degrees and their class being or failing to be included in\ncertain other classes while what makes a crimson thing crimson is that\nit resembles those things (i.e. the crimson ones), which also\nhappen to satisfy the stated conditions having to do with resemblance\ndegrees and their class being or failing to be included in certain\nother classes.\n\n\nThe resemblance nominalist ontology is an ontology of resembling\nparticulars like horses, atoms, houses, stars, men (and classes). But\nthe resemblance nominalist does not reify resemblance. Thus that\na and b resemble each other does not require that\nthere are three entities there: a, b and a third,\nrelational entity that is their resemblance. The only entities\ninvolved in that situation are a and b. In this\nrespect, Resemblance Nominalism resembles Ostrich Nominalism. The\ndifference is that whereas the latter admits many sorts of basic facts\ninvolving only particulars – ‘a is\nscarlet’, ‘b is an electron’ – the\nformer admits only basic facts of the form ‘a\nresembles b to such and such a degree’.\n\n\nLike Class Nominalism, Resemblance Nominalism faces the problem\nabout the identity of coextensive properties, and the solution is the\nsame, namely to adopt some version of Modal Realism according to which\nmerely possible particulars are as real as actual ones. Thus (part of)\nwhat makes a certain apple scarlet is that it resembles all scarlet\nthings, including merely possible scarlet things.\n\n\nRussell (1912, 96–7) and others think that Resemblance\nNominalism faces the resemblance regress. But this regress presupposes\nthat resemblances are entities that can resemble one another. Since\nResemblance Nominalism does not reify resemblances, the regress does\nnot arise (see Rodriguez-Pereyra 2002, 105–23, for further\ndiscussion).\n\n\nFinally, there is Causal Nominalism, according to which what makes it\ntrue that a is F is that a would stand in certain\ncausal relations given certain circumstances. In other words, the\nclaim is that for a to be F is for the theory that\nwhich charts out the functional role of F-particulars to be\ntrue of a (Whittle 2009, 246). F-particulars will\nresemble each other in realising the same functional role, but this\ndoes not collapse Causal Nominalism into Resemblance Nominalism, since\nsuch resemblances are not what explains why a is F,\nbut a consequence of what explains that, namely the fact that such\nparticulars realise a certain functional role (Whittle 2009:\n255). Similar reasons might also suggest that Causal Nominalism does\nnot collapse into any of the other nominalisms. But it has been argued\nthat to be thoroughly nominalistic, Causal Nominalism owes a\nnominalistic account of what it is for different particulars to\nrealise the same functional role, and such an account can only be in\nterms of any of the nominalisms distinguished above, in which case\nCausal Nominalism collapses into some other form of nominalism (Tugby\n2013).\n\n\nWhich one of these theories is the best has to be decided by\ncomparing how they score with respect to certain theoretical virtues,\nlike accommodating firm and stable intuitions and common sense\nopinions, avoiding the unnecessary multiplication of entities, reducing\nthe number of undefined primitive concepts, etc.\n",
    "section_title": "4.1 Nominalism about universals",
    "entry_title": "Nominalism in Metaphysics",
    "hierarchy_title": "Nominalism in Metaphysics || Varieties of Nominalism || Nominalism about universals",
    "tokenized_text": [
        "variety",
        "nominalism",
        "nominalism",
        "universal",
        "nominalism",
        "universal",
        "given",
        "nominalist",
        "universal",
        "believe",
        "particular",
        "two",
        "strategy",
        "might",
        "implement",
        "regarding",
        "question",
        "alleged",
        "existence",
        "allegedly",
        "universal",
        "entity",
        "like",
        "property",
        "relation",
        "one",
        "strategy",
        "reject",
        "existence",
        "entity",
        "another",
        "strategy",
        "accept",
        "entity",
        "exist",
        "deny",
        "universal",
        "strategy",
        "implemented",
        "history",
        "philosophy",
        "one",
        "way",
        "implement",
        "strategy",
        "provide",
        "nominalistically",
        "acceptable",
        "paraphrase",
        "analysis",
        "sentence",
        "appear",
        "true",
        "b",
        "imply",
        "existence",
        "universal",
        "another",
        "way",
        "fashionable",
        "nowadays",
        "give",
        "nominalistic",
        "account",
        "truthmakers",
        "sentence",
        "apparently",
        "made",
        "true",
        "universal",
        "follows",
        "brief",
        "review",
        "main",
        "nominalistic",
        "position",
        "sort",
        "problem",
        "face",
        "sake",
        "brevity",
        "shall",
        "illustrate",
        "position",
        "respect",
        "property",
        "extension",
        "kind",
        "relation",
        "straightforward",
        "occasionally",
        "say",
        "certain",
        "theory",
        "say",
        "relation",
        "property",
        "entity",
        "meant",
        "play",
        "different",
        "theoretical",
        "role",
        "instance",
        "one",
        "role",
        "meant",
        "play",
        "semantic",
        "value",
        "predicate",
        "another",
        "role",
        "accounting",
        "similarity",
        "causal",
        "power",
        "thing",
        "reason",
        "different",
        "role",
        "played",
        "one",
        "kind",
        "entity",
        "philosopher",
        "nowadays",
        "discus",
        "issue",
        "universal",
        "normally",
        "think",
        "property",
        "entity",
        "account",
        "similarity",
        "causal",
        "power",
        "thing",
        "property",
        "sense",
        "sometimes",
        "called",
        "sparse",
        "property",
        "opposed",
        "abundant",
        "property",
        "distinction",
        "sparse",
        "abundant",
        "property",
        "come",
        "lewis",
        "sparse",
        "property",
        "would",
        "sufficient",
        "account",
        "similarity",
        "causal",
        "power",
        "thing",
        "characterise",
        "completely",
        "without",
        "redundancy",
        "follows",
        "assumed",
        "sake",
        "example",
        "property",
        "like",
        "square",
        "scarlet",
        "count",
        "sparse",
        "question",
        "realist",
        "nominalist",
        "universal",
        "try",
        "answer",
        "make",
        "fthings",
        "f",
        "f",
        "sparse",
        "property",
        "predicate",
        "instance",
        "make",
        "square",
        "thing",
        "square",
        "realist",
        "universal",
        "something",
        "square",
        "virtue",
        "thing",
        "instantiating",
        "universal",
        "squareness",
        "general",
        "realist",
        "universal",
        "thing",
        "sparse",
        "property",
        "virtue",
        "instantiating",
        "universal",
        "nominalist",
        "answer",
        "question",
        "popular",
        "nominalist",
        "theory",
        "property",
        "socalled",
        "trope",
        "theory",
        "held",
        "donald",
        "williams",
        "keith",
        "campbell",
        "douglas",
        "ehring",
        "among",
        "others",
        "trope",
        "theory",
        "reject",
        "existence",
        "property",
        "take",
        "property",
        "certain",
        "entity",
        "usually",
        "called",
        "trope",
        "trope",
        "particular",
        "sense",
        "individual",
        "people",
        "individual",
        "apple",
        "particular",
        "thus",
        "scarlet",
        "apple",
        "scarletness",
        "apple",
        "universal",
        "particular",
        "scarletness",
        "scarletness",
        "apple",
        "exists",
        "exactly",
        "apple",
        "scarlet",
        "particular",
        "scarletness",
        "trope",
        "apple",
        "scarlet",
        "virtue",
        "instantiating",
        "universal",
        "virtue",
        "possessing",
        "scarlet",
        "trope",
        "make",
        "scarlet",
        "trope",
        "scarlet",
        "trope",
        "one",
        "possible",
        "answer",
        "scarlet",
        "trope",
        "scarlet",
        "trope",
        "resemble",
        "resemblance",
        "explained",
        "term",
        "instantiating",
        "universal",
        "course",
        "crimson",
        "trope",
        "also",
        "resemble",
        "make",
        "trope",
        "scarlet",
        "resembles",
        "trope",
        "scarlet",
        "one",
        "opposed",
        "resembling",
        "one",
        "crimson",
        "one",
        "another",
        "answer",
        "would",
        "scarlet",
        "trope",
        "form",
        "primitive",
        "natural",
        "class",
        "view",
        "forcefully",
        "defended",
        "ehring",
        "whether",
        "make",
        "scarlet",
        "trope",
        "scarlet",
        "trope",
        "resemble",
        "scarlet",
        "trope",
        "resemble",
        "fact",
        "raise",
        "important",
        "problem",
        "problem",
        "resemblance",
        "regress",
        "suppose",
        "b",
        "c",
        "scarlet",
        "apple",
        "one",
        "scarlet",
        "trope",
        "call",
        "sa",
        "sb",
        "sc",
        "since",
        "sa",
        "sb",
        "sc",
        "scarlet",
        "trope",
        "every",
        "two",
        "resemble",
        "three",
        "resemblance",
        "trope",
        "well",
        "resemblance",
        "sa",
        "sb",
        "resemblance",
        "sa",
        "sc",
        "resemblance",
        "sb",
        "sc",
        "resemblance",
        "trope",
        "since",
        "resemblance",
        "trope",
        "resemble",
        "secondorder",
        "resemblance",
        "trope",
        "resemblance",
        "resemblance",
        "sa",
        "sb",
        "resemblance",
        "sa",
        "sc",
        "resemblance",
        "resemblance",
        "sa",
        "sb",
        "resemblance",
        "sb",
        "sc",
        "resemblance",
        "resemblance",
        "sa",
        "sc",
        "resemblance",
        "sb",
        "sc",
        "secondorder",
        "resemblance",
        "trope",
        "resemble",
        "thirdorder",
        "resemblance",
        "trope",
        "ad",
        "infinitum",
        "way",
        "trope",
        "theorist",
        "one",
        "solution",
        "argue",
        "regress",
        "vicious",
        "represents",
        "increment",
        "number",
        "entity",
        "kind",
        "entity",
        "postulated",
        "theory",
        "another",
        "solution",
        "deny",
        "existence",
        "resemblance",
        "trope",
        "make",
        "resembling",
        "trope",
        "discussion",
        "see",
        "daly",
        "maurin",
        "form",
        "nominalism",
        "universal",
        "two",
        "predicate",
        "nominalism",
        "concept",
        "nominalism",
        "realist",
        "universal",
        "admits",
        "predicate",
        "scarlet",
        "applies",
        "scarlet",
        "thing",
        "say",
        "predicate",
        "scarlet",
        "applies",
        "virtue",
        "scarlet",
        "nothing",
        "else",
        "instantiating",
        "universal",
        "scarletness",
        "similarly",
        "say",
        "thing",
        "question",
        "fall",
        "concept",
        "scarlet",
        "virtue",
        "scarlet",
        "nothing",
        "else",
        "thing",
        "instantiating",
        "universal",
        "scarletness",
        "predicate",
        "nominalism",
        "nothing",
        "like",
        "scarletness",
        "according",
        "theory",
        "thing",
        "scarlet",
        "virtue",
        "fact",
        "predicate",
        "scarlet",
        "applies",
        "similarly",
        "according",
        "concept",
        "nominalism",
        "conceptualism",
        "nothing",
        "like",
        "scarletness",
        "thing",
        "scarlet",
        "virtue",
        "falling",
        "concept",
        "scarlet",
        "two",
        "view",
        "entail",
        "speaker",
        "thinker",
        "thing",
        "would",
        "scarlet",
        "many",
        "would",
        "feel",
        "inclined",
        "towards",
        "another",
        "view",
        "called",
        "ostrich",
        "nominalism",
        "view",
        "held",
        "quine",
        "among",
        "others",
        "maintains",
        "nothing",
        "virtue",
        "thing",
        "scarlet",
        "scarlet",
        "devitt",
        "many",
        "think",
        "scarlet",
        "metaphysically",
        "ultimate",
        "fact",
        "must",
        "something",
        "virtue",
        "scarlet",
        "thing",
        "scarlet",
        "another",
        "theory",
        "mereological",
        "nominalism",
        "according",
        "property",
        "scarlet",
        "aggregate",
        "scarlet",
        "thing",
        "something",
        "scarlet",
        "virtue",
        "part",
        "aggregate",
        "scarlet",
        "thing",
        "aggregate",
        "mereological",
        "sum",
        "particular",
        "theory",
        "face",
        "difficulty",
        "socalled",
        "extensive",
        "property",
        "like",
        "mass",
        "shape",
        "every",
        "part",
        "aggregate",
        "square",
        "thing",
        "square",
        "since",
        "instance",
        "every",
        "sum",
        "square",
        "square",
        "every",
        "part",
        "square",
        "square",
        "false",
        "square",
        "thing",
        "square",
        "virtue",
        "part",
        "aggregate",
        "square",
        "thing",
        "better",
        "theory",
        "spirit",
        "class",
        "nominalism",
        "version",
        "maintained",
        "lewis",
        "whether",
        "abstract",
        "class",
        "particular",
        "view",
        "according",
        "class",
        "nominalism",
        "property",
        "class",
        "thing",
        "property",
        "scarlet",
        "class",
        "scarlet",
        "thing",
        "one",
        "problem",
        "theory",
        "two",
        "class",
        "member",
        "seem",
        "property",
        "instance",
        "need",
        "guarantee",
        "identification",
        "property",
        "class",
        "correct",
        "even",
        "correct",
        "identification",
        "clearly",
        "necessarily",
        "correct",
        "furthermore",
        "every",
        "f",
        "g",
        "vice",
        "versa",
        "theory",
        "force",
        "u",
        "say",
        "make",
        "something",
        "f",
        "make",
        "g",
        "every",
        "f",
        "might",
        "g",
        "vice",
        "versa",
        "follow",
        "make",
        "thing",
        "f",
        "make",
        "g",
        "one",
        "solution",
        "embrace",
        "version",
        "modal",
        "realism",
        "instance",
        "david",
        "lewis",
        "according",
        "possible",
        "world",
        "exist",
        "contain",
        "thing",
        "kind",
        "thing",
        "actual",
        "world",
        "see",
        "lewis",
        "a",
        "property",
        "get",
        "identified",
        "class",
        "whose",
        "member",
        "need",
        "belong",
        "possible",
        "world",
        "thus",
        "property",
        "scarlet",
        "thing",
        "class",
        "thing",
        "scarlet",
        "possible",
        "world",
        "even",
        "every",
        "actual",
        "f",
        "g",
        "vice",
        "versa",
        "since",
        "every",
        "possible",
        "f",
        "g",
        "vice",
        "versa",
        "make",
        "something",
        "f",
        "namely",
        "belonging",
        "class",
        "actual",
        "possible",
        "f",
        "make",
        "g",
        "theory",
        "denies",
        "could",
        "necessarily",
        "coextensive",
        "property",
        "another",
        "version",
        "nominalism",
        "resemblance",
        "nominalism",
        "according",
        "theory",
        "scarlet",
        "thing",
        "resemble",
        "one",
        "another",
        "scarlet",
        "make",
        "scarlet",
        "resemble",
        "one",
        "another",
        "thus",
        "make",
        "something",
        "scarlet",
        "resembles",
        "scarlet",
        "thing",
        "similarly",
        "make",
        "square",
        "thing",
        "square",
        "resemble",
        "one",
        "another",
        "make",
        "something",
        "square",
        "resembles",
        "square",
        "thing",
        "resemblance",
        "fundamental",
        "primitive",
        "either",
        "property",
        "property",
        "thing",
        "depend",
        "thing",
        "resembles",
        "thus",
        "one",
        "version",
        "theory",
        "property",
        "like",
        "scarlet",
        "certain",
        "class",
        "whose",
        "member",
        "satisfy",
        "certain",
        "definite",
        "resemblance",
        "condition",
        "another",
        "version",
        "theory",
        "property",
        "make",
        "scarlet",
        "thing",
        "scarlet",
        "satisfy",
        "certain",
        "resemblance",
        "condition",
        "resemblance",
        "condition",
        "sometimes",
        "resemblance",
        "condition",
        "include",
        "must",
        "satisfied",
        "thing",
        "question",
        "eg",
        "scarlet",
        "thing",
        "thing",
        "suitably",
        "related",
        "instance",
        "version",
        "resemblance",
        "nominalism",
        "developed",
        "rodriguezpereyra",
        "make",
        "scarlet",
        "thing",
        "scarlet",
        "resemble",
        "degree",
        "resemblance",
        "two",
        "scarlet",
        "thing",
        "two",
        "nthorder",
        "pair",
        "twomembered",
        "unordered",
        "class",
        "whose",
        "urelements",
        "scarlet",
        "thing",
        "resemble",
        "degree",
        "le",
        "class",
        "scarlet",
        "thing",
        "fails",
        "included",
        "certain",
        "class",
        "defined",
        "term",
        "resemblance",
        "condition",
        "like",
        "one",
        "mentioned",
        "see",
        "rodriguezpereyra",
        "detail",
        "course",
        "crimson",
        "thing",
        "also",
        "resemble",
        "also",
        "meet",
        "condition",
        "resemblance",
        "degree",
        "class",
        "failing",
        "included",
        "certain",
        "class",
        "mean",
        "make",
        "something",
        "scarlet",
        "make",
        "something",
        "crimson",
        "make",
        "scarlet",
        "thing",
        "scarlet",
        "resembles",
        "thing",
        "ie",
        "scarlet",
        "one",
        "happen",
        "satisfy",
        "stated",
        "condition",
        "resemblance",
        "degree",
        "class",
        "failing",
        "included",
        "certain",
        "class",
        "make",
        "crimson",
        "thing",
        "crimson",
        "resembles",
        "thing",
        "ie",
        "crimson",
        "one",
        "also",
        "happen",
        "satisfy",
        "stated",
        "condition",
        "resemblance",
        "degree",
        "class",
        "failing",
        "included",
        "certain",
        "class",
        "resemblance",
        "nominalist",
        "ontology",
        "ontology",
        "resembling",
        "particular",
        "like",
        "horse",
        "atom",
        "house",
        "star",
        "men",
        "class",
        "resemblance",
        "nominalist",
        "reify",
        "resemblance",
        "thus",
        "b",
        "resemble",
        "require",
        "three",
        "entity",
        "b",
        "third",
        "relational",
        "entity",
        "resemblance",
        "entity",
        "involved",
        "situation",
        "b",
        "respect",
        "resemblance",
        "nominalism",
        "resembles",
        "ostrich",
        "nominalism",
        "difference",
        "whereas",
        "latter",
        "admits",
        "many",
        "sort",
        "basic",
        "fact",
        "involving",
        "particular",
        "scarlet",
        "b",
        "electron",
        "former",
        "admits",
        "basic",
        "fact",
        "form",
        "resembles",
        "b",
        "degree",
        "like",
        "class",
        "nominalism",
        "resemblance",
        "nominalism",
        "face",
        "problem",
        "identity",
        "coextensive",
        "property",
        "solution",
        "namely",
        "adopt",
        "version",
        "modal",
        "realism",
        "according",
        "merely",
        "possible",
        "particular",
        "real",
        "actual",
        "one",
        "thus",
        "part",
        "make",
        "certain",
        "apple",
        "scarlet",
        "resembles",
        "scarlet",
        "thing",
        "including",
        "merely",
        "possible",
        "scarlet",
        "thing",
        "russell",
        "others",
        "think",
        "resemblance",
        "nominalism",
        "face",
        "resemblance",
        "regress",
        "regress",
        "presupposes",
        "resemblance",
        "entity",
        "resemble",
        "one",
        "another",
        "since",
        "resemblance",
        "nominalism",
        "reify",
        "resemblance",
        "regress",
        "arise",
        "see",
        "rodriguezpereyra",
        "discussion",
        "finally",
        "causal",
        "nominalism",
        "according",
        "make",
        "true",
        "f",
        "would",
        "stand",
        "certain",
        "causal",
        "relation",
        "given",
        "certain",
        "circumstance",
        "word",
        "claim",
        "f",
        "theory",
        "chart",
        "functional",
        "role",
        "fparticulars",
        "true",
        "whittle",
        "fparticulars",
        "resemble",
        "realising",
        "functional",
        "role",
        "collapse",
        "causal",
        "nominalism",
        "resemblance",
        "nominalism",
        "since",
        "resemblance",
        "explains",
        "f",
        "consequence",
        "explains",
        "namely",
        "fact",
        "particular",
        "realise",
        "certain",
        "functional",
        "role",
        "whittle",
        "similar",
        "reason",
        "might",
        "also",
        "suggest",
        "causal",
        "nominalism",
        "collapse",
        "nominalism",
        "argued",
        "thoroughly",
        "nominalistic",
        "causal",
        "nominalism",
        "owes",
        "nominalistic",
        "account",
        "different",
        "particular",
        "realise",
        "functional",
        "role",
        "account",
        "term",
        "nominalism",
        "distinguished",
        "case",
        "causal",
        "nominalism",
        "collapse",
        "form",
        "nominalism",
        "tugby",
        "one",
        "theory",
        "best",
        "decided",
        "comparing",
        "score",
        "respect",
        "certain",
        "theoretical",
        "virtue",
        "like",
        "accommodating",
        "firm",
        "stable",
        "intuition",
        "common",
        "sense",
        "opinion",
        "avoiding",
        "unnecessary",
        "multiplication",
        "entity",
        "reducing",
        "number",
        "undefined",
        "primitive",
        "concept",
        "etc"
    ]
}