{
    "main_text": "Modal Structuralism || Assessment: benefits and problems of modal structuralism\n4.2 Assessment: benefits and problems of modal structuralism\n4.2.1 The epistemological problem\nThe modal structuralist solves partially the epistemological\nproblem for mathematics. Assuming that the modal-structural\ntranslation scheme works for set theory, modal structuralists need not\nexplain how we can have knowledge of the existence of mathematical\nobjects, relations or structures—given the lack of commitment to\nthese entities. However, they still need to explain our knowledge of\nthe possibility of the relevant structures, since the translation\nscheme commits them to such possibility.\nOne worry that emerges here is that, in the case of substantive\nmathematical structures (such as those invoked in set theory),\nknowledge of the possibility of such structures may require knowledge\nof substantial parts of mathematics. For instance, in order to know\nthat the structures formulated in Zermelo set theory are possible,\npresumably we need to know that the theory itself is consistent. But\nthe consistency of the theory can only be established in another\ntheory, whose consistency, in turn, also needs to be\nestablished—and we face a regress. It would be arbitrary simply\nto assume the consistency of the theories in question, given that if\nsuch theories turn out to be in fact inconsistent, given classical\nlogic, everything could be proved in them.\nOf course, these considerations do not establish that the modal\nstructuralist cannot develop an epistemology for mathematics. They\njust suggest that further developments on the epistemological front\nseem to be called for in order to address more fully the\nepistemological problem for mathematics.\n4.2.2 The problem of the application of mathematics\nSimilarly, the problem of the application of mathematics is\npartially solved by the modal structuralist. After all, a framework to\ninterpret the use of mathematics in science is provided, and in terms\nof this framework the application of mathematics can be accommodated\nwithout the commitment to the existence of the corresponding\nobjects.\nOne concern that emerges (besides those already mentioned at the\nend of section 4.1 above) is that, similarly to what happens to\nmathematical fictionalism, the proposed framework does not allow us to\nmake sense of actual uses of the application of mathematics. Rather\nthan explaining how mathematics is in fact applied in scientific\npractice, the modal-structural framework is advanced in order to\nregiment that practice and dispense with the commitment to\nmathematical entities. But even if the framework succeeds at the\nlatter task, thus allowing the modal structuralist to avoid the\nrelevant commitment, the issue of how to make sense of the way\nmathematics is actually used in scientific contexts still\nremains. Providing a translation scheme into a nominalistic language\ndoes not address this issue. A significant aspect of mathematical\npractice is then left unaccounted for.\nThe status of the indispensability argument within the\nmodal-structural interpretation is quite unique. On the one hand, the\nconclusion of the argument is undermined (if the proposed translation\nscheme goes through), since commitment to the existence of\nmathematical objects can be avoided. On the other hand, a revised\nversion of the indispensability argument can be used to motivate the\ntranslation into the modal language, thus emphasizing the\nindispensable role played by the primitive modal notions introduced by\nthe modal structuralist. The idea is to change the argument's second\npremise, insisting that modal-structural translations of\nmathematical theories are indispensable to our best theories of the\nworld, and concluding that we ought to be ontologically committed to\nthe possibility of the corresponding structures. In this sense, modal\nstructuralists can invoke the indispensability argument in support of\nthe translation scheme they favor and, hence, the possibility of the\nrelevant structures, which are referred to in the conclusion of the\nrevised argument. But rather than supporting the existence of\nmathematical objects, the argument would only support commitment to\nmodal-structural translations of mathematical theories and the\npossibility of mathematical structures.\n4.2.3 Uniform semantics\nWith the introduction of modal operators and the proposed\ntranslation scheme, the modal structuralist is unable to provide a\nuniform semantics for scientific and mathematical theories. Only the\nlatter, as opposed to the former, requires such operators. In fact,\nField has argued that if modal operators were invoked in the\nformulation of scientific theories, not only their mathematical\ncontent, but also their physical content would be nominalized (Field\n1989). After all, in that case, instead of asserting that some\nphysical situation is actually the case, the theory would only state\nthe possibility that this is so.\nOne strategy to avoid this difficulty (of losing the physical\ncontent of a scientific theory due to the use of modal operators) is\nto employ an actuality operator. By properly placing this operator\nwithin the scope of the modal operators, it is possible to undo the\nnominalization of the physical content in question (Friedman\n2005). Without the introduction of the actuality operator, or some\nrelated maneuver, it is unclear that the modal structuralist would be\nin a position to preserve the physical content of the scientific\ntheory in question.\nBut the introduction of an actuality operator in this context\nrequires the distinction between nominalist and mathematical\ncontent. (That such a distinction cannot be drawn at all is argued in\nAzzouni 2011.) Otherwise, there is no guarantee that the application\nof the actuality operator will not yield more than what is physically\nreal.\nHowever, even with the introduction of such an operator, there\nwould still be a significant difference, on the modal-structural\ntranslation scheme, between the semantics for mathematical and\nscientific discourse. For the former, as opposed to the latter, does\nnot invoke such an operator. The result is that modal structuralism\ndoes not seem to be able to provide a uniform semantics for\nmathematical and scientific language.\n4.2.4 Taking mathematics literally\nGiven the need for introducing modal operators, the modal\nstructuralist does not take mathematical discourse literally. In fact,\nit may be argued, this is the whole point of the view! Taken\nliterally, mathematical discourse seems to be committed to abstract\nobjects and structures—a commitment that the modal structuralist\nclearly aims to avoid.\nHowever, the point still stands that, in order to block such\ncommitment, a parallel discourse to actual mathematical practice is\noffered. The discourse is ‘parallel’ given that\nmathematical practice typically does not invoke the modal operators\nintroduced by the modal structuralist. For those who aim to understand\nmathematical discourse as it is used in the practice of mathematics,\nand who try to identify suitable features of that practice that\nprevent commitment to mathematical entities, the proposed translation\nwill make the realization of that goal particularly difficult.\n4.2.5 The ontological problem\nThe modal structuralist has solved, in part, the ontological\nproblem. No commitment to mathematical objects or structures seems to\nbe needed to implement the proposed translation scheme. The main\nconcern emerges from the introduction of modal operators. But as the\nmodal structuralist emphasizes, these operators do not presuppose a\npossible-worlds semantics: they are introduced as primitive terms.\nHowever, since the modal translation of mathematical axioms is\ntaken to be true, the question arises as to what makes such\nstatements true. For instance, when it is asserted that\n‘it is possible that there are structures satisfying the axioms\nof Peano Arithmetic’, what is responsible for the truth of such\nstatement? Clearly, the modal structuralist will not ground the\npossibility in question on the actual truth of the Peano axioms, for\nthis move, on a reasonable interpretation, would require\nplatonism. Nor will the modal structuralist support the relevant\npossibility on the basis of the existence of a consistency proof for\nthe Peano axioms. After all, any such proof is an abstract object, and\nto invoke it at the foundation of modal structuralism clearly\nthreatens the coherence of the overall view. Furthermore, to invoke a\nmodalized version of such a consistency proof would beg the question,\nsince it assumes that the use of modal operators is already\njustified. Ultimately, what is needed to solve properly the\nontological problem is a suitable account of modal discourse.\n\n",
    "section_title": "4.2 Assessment: benefits and problems of modal structuralism",
    "entry_title": "Nominalism in the Philosophy of Mathematics",
    "hierarchy_title": "Nominalism in the Philosophy of Mathematics || Modal Structuralism || Assessment: benefits and problems of modal structuralism",
    "tokenized_text": [
        "modal",
        "structuralism",
        "assessment",
        "benefit",
        "problem",
        "modal",
        "structuralism",
        "assessment",
        "benefit",
        "problem",
        "modal",
        "structuralism",
        "epistemological",
        "problem",
        "modal",
        "structuralist",
        "solves",
        "partially",
        "epistemological",
        "problem",
        "mathematics",
        "assuming",
        "modalstructural",
        "translation",
        "scheme",
        "work",
        "set",
        "theory",
        "modal",
        "structuralists",
        "need",
        "explain",
        "knowledge",
        "existence",
        "mathematical",
        "object",
        "relation",
        "structuresgiven",
        "lack",
        "commitment",
        "entity",
        "however",
        "still",
        "need",
        "explain",
        "knowledge",
        "possibility",
        "relevant",
        "structure",
        "since",
        "translation",
        "scheme",
        "commits",
        "possibility",
        "one",
        "worry",
        "emerges",
        "case",
        "substantive",
        "mathematical",
        "structure",
        "invoked",
        "set",
        "theory",
        "knowledge",
        "possibility",
        "structure",
        "may",
        "require",
        "knowledge",
        "substantial",
        "part",
        "mathematics",
        "instance",
        "order",
        "know",
        "structure",
        "formulated",
        "zermelo",
        "set",
        "theory",
        "possible",
        "presumably",
        "need",
        "know",
        "theory",
        "consistent",
        "consistency",
        "theory",
        "established",
        "another",
        "theory",
        "whose",
        "consistency",
        "turn",
        "also",
        "need",
        "establishedand",
        "face",
        "regress",
        "would",
        "arbitrary",
        "simply",
        "assume",
        "consistency",
        "theory",
        "question",
        "given",
        "theory",
        "turn",
        "fact",
        "inconsistent",
        "given",
        "classical",
        "logic",
        "everything",
        "could",
        "proved",
        "course",
        "consideration",
        "establish",
        "modal",
        "structuralist",
        "develop",
        "epistemology",
        "mathematics",
        "suggest",
        "development",
        "epistemological",
        "front",
        "seem",
        "called",
        "order",
        "address",
        "fully",
        "epistemological",
        "problem",
        "mathematics",
        "problem",
        "application",
        "mathematics",
        "similarly",
        "problem",
        "application",
        "mathematics",
        "partially",
        "solved",
        "modal",
        "structuralist",
        "framework",
        "interpret",
        "use",
        "mathematics",
        "science",
        "provided",
        "term",
        "framework",
        "application",
        "mathematics",
        "accommodated",
        "without",
        "commitment",
        "existence",
        "corresponding",
        "object",
        "one",
        "concern",
        "emerges",
        "besides",
        "already",
        "mentioned",
        "end",
        "section",
        "similarly",
        "happens",
        "mathematical",
        "fictionalism",
        "proposed",
        "framework",
        "allow",
        "u",
        "make",
        "sense",
        "actual",
        "us",
        "application",
        "mathematics",
        "rather",
        "explaining",
        "mathematics",
        "fact",
        "applied",
        "scientific",
        "practice",
        "modalstructural",
        "framework",
        "advanced",
        "order",
        "regiment",
        "practice",
        "dispense",
        "commitment",
        "mathematical",
        "entity",
        "even",
        "framework",
        "succeeds",
        "latter",
        "task",
        "thus",
        "allowing",
        "modal",
        "structuralist",
        "avoid",
        "relevant",
        "commitment",
        "issue",
        "make",
        "sense",
        "way",
        "mathematics",
        "actually",
        "used",
        "scientific",
        "context",
        "still",
        "remains",
        "providing",
        "translation",
        "scheme",
        "nominalistic",
        "language",
        "address",
        "issue",
        "significant",
        "aspect",
        "mathematical",
        "practice",
        "left",
        "unaccounted",
        "status",
        "indispensability",
        "argument",
        "within",
        "modalstructural",
        "interpretation",
        "quite",
        "unique",
        "one",
        "hand",
        "conclusion",
        "argument",
        "undermined",
        "proposed",
        "translation",
        "scheme",
        "go",
        "since",
        "commitment",
        "existence",
        "mathematical",
        "object",
        "avoided",
        "hand",
        "revised",
        "version",
        "indispensability",
        "argument",
        "used",
        "motivate",
        "translation",
        "modal",
        "language",
        "thus",
        "emphasizing",
        "indispensable",
        "role",
        "played",
        "primitive",
        "modal",
        "notion",
        "introduced",
        "modal",
        "structuralist",
        "idea",
        "change",
        "argument",
        "s",
        "second",
        "premise",
        "insisting",
        "modalstructural",
        "translation",
        "mathematical",
        "theory",
        "indispensable",
        "best",
        "theory",
        "world",
        "concluding",
        "ought",
        "ontologically",
        "committed",
        "possibility",
        "corresponding",
        "structure",
        "sense",
        "modal",
        "structuralists",
        "invoke",
        "indispensability",
        "argument",
        "support",
        "translation",
        "scheme",
        "favor",
        "hence",
        "possibility",
        "relevant",
        "structure",
        "referred",
        "conclusion",
        "revised",
        "argument",
        "rather",
        "supporting",
        "existence",
        "mathematical",
        "object",
        "argument",
        "would",
        "support",
        "commitment",
        "modalstructural",
        "translation",
        "mathematical",
        "theory",
        "possibility",
        "mathematical",
        "structure",
        "uniform",
        "semantics",
        "introduction",
        "modal",
        "operator",
        "proposed",
        "translation",
        "scheme",
        "modal",
        "structuralist",
        "unable",
        "provide",
        "uniform",
        "semantics",
        "scientific",
        "mathematical",
        "theory",
        "latter",
        "opposed",
        "former",
        "requires",
        "operator",
        "fact",
        "field",
        "argued",
        "modal",
        "operator",
        "invoked",
        "formulation",
        "scientific",
        "theory",
        "mathematical",
        "content",
        "also",
        "physical",
        "content",
        "would",
        "nominalized",
        "field",
        "case",
        "instead",
        "asserting",
        "physical",
        "situation",
        "actually",
        "case",
        "theory",
        "would",
        "state",
        "possibility",
        "one",
        "strategy",
        "avoid",
        "difficulty",
        "losing",
        "physical",
        "content",
        "scientific",
        "theory",
        "due",
        "use",
        "modal",
        "operator",
        "employ",
        "actuality",
        "operator",
        "properly",
        "placing",
        "operator",
        "within",
        "scope",
        "modal",
        "operator",
        "possible",
        "undo",
        "nominalization",
        "physical",
        "content",
        "question",
        "friedman",
        "without",
        "introduction",
        "actuality",
        "operator",
        "related",
        "maneuver",
        "unclear",
        "modal",
        "structuralist",
        "would",
        "position",
        "preserve",
        "physical",
        "content",
        "scientific",
        "theory",
        "question",
        "introduction",
        "actuality",
        "operator",
        "context",
        "requires",
        "distinction",
        "nominalist",
        "mathematical",
        "content",
        "distinction",
        "drawn",
        "argued",
        "azzouni",
        "otherwise",
        "guarantee",
        "application",
        "actuality",
        "operator",
        "yield",
        "physically",
        "real",
        "however",
        "even",
        "introduction",
        "operator",
        "would",
        "still",
        "significant",
        "difference",
        "modalstructural",
        "translation",
        "scheme",
        "semantics",
        "mathematical",
        "scientific",
        "discourse",
        "former",
        "opposed",
        "latter",
        "invoke",
        "operator",
        "result",
        "modal",
        "structuralism",
        "seem",
        "able",
        "provide",
        "uniform",
        "semantics",
        "mathematical",
        "scientific",
        "language",
        "taking",
        "mathematics",
        "literally",
        "given",
        "need",
        "introducing",
        "modal",
        "operator",
        "modal",
        "structuralist",
        "take",
        "mathematical",
        "discourse",
        "literally",
        "fact",
        "may",
        "argued",
        "whole",
        "point",
        "view",
        "taken",
        "literally",
        "mathematical",
        "discourse",
        "seems",
        "committed",
        "abstract",
        "object",
        "structuresa",
        "commitment",
        "modal",
        "structuralist",
        "clearly",
        "aim",
        "avoid",
        "however",
        "point",
        "still",
        "stand",
        "order",
        "block",
        "commitment",
        "parallel",
        "discourse",
        "actual",
        "mathematical",
        "practice",
        "offered",
        "discourse",
        "parallel",
        "given",
        "mathematical",
        "practice",
        "typically",
        "invoke",
        "modal",
        "operator",
        "introduced",
        "modal",
        "structuralist",
        "aim",
        "understand",
        "mathematical",
        "discourse",
        "used",
        "practice",
        "mathematics",
        "try",
        "identify",
        "suitable",
        "feature",
        "practice",
        "prevent",
        "commitment",
        "mathematical",
        "entity",
        "proposed",
        "translation",
        "make",
        "realization",
        "goal",
        "particularly",
        "difficult",
        "ontological",
        "problem",
        "modal",
        "structuralist",
        "solved",
        "part",
        "ontological",
        "problem",
        "commitment",
        "mathematical",
        "object",
        "structure",
        "seems",
        "needed",
        "implement",
        "proposed",
        "translation",
        "scheme",
        "main",
        "concern",
        "emerges",
        "introduction",
        "modal",
        "operator",
        "modal",
        "structuralist",
        "emphasizes",
        "operator",
        "presuppose",
        "possibleworlds",
        "semantics",
        "introduced",
        "primitive",
        "term",
        "however",
        "since",
        "modal",
        "translation",
        "mathematical",
        "axiom",
        "taken",
        "true",
        "question",
        "arises",
        "make",
        "statement",
        "true",
        "instance",
        "asserted",
        "possible",
        "structure",
        "satisfying",
        "axiom",
        "peano",
        "arithmetic",
        "responsible",
        "truth",
        "statement",
        "clearly",
        "modal",
        "structuralist",
        "ground",
        "possibility",
        "question",
        "actual",
        "truth",
        "peano",
        "axiom",
        "move",
        "reasonable",
        "interpretation",
        "would",
        "require",
        "platonism",
        "modal",
        "structuralist",
        "support",
        "relevant",
        "possibility",
        "basis",
        "existence",
        "consistency",
        "proof",
        "peano",
        "axiom",
        "proof",
        "abstract",
        "object",
        "invoke",
        "foundation",
        "modal",
        "structuralism",
        "clearly",
        "threatens",
        "coherence",
        "overall",
        "view",
        "furthermore",
        "invoke",
        "modalized",
        "version",
        "consistency",
        "proof",
        "would",
        "beg",
        "question",
        "since",
        "assumes",
        "use",
        "modal",
        "operator",
        "already",
        "justified",
        "ultimately",
        "needed",
        "solve",
        "properly",
        "ontological",
        "problem",
        "suitable",
        "account",
        "modal",
        "discourse"
    ]
}