{
    "main_text": "Using AFA || The axioms again\n4.5 Conceptual comparison\n\nA chart just below  indicates a kind of  conceptual comparison \nof iterative and coiterative ideas.      \nThe entries towards the top are dualities in the categorical sense.\nMoving downwards, the rows in the chart are more like research directions\nthan actual results.    So spelling out the details in the chart is more like\nan ongoing research project than a settled matter.\n\n\nFor many functors on Set, especially polynomial functors\nand the finite power set functor, \nthe initial algebra is the least fixed point together with the identity.\nFor the polynomial functors, this least fixed point is \nitself an algebra of terms.   \n\n\n\n\n\nalgebra for a functor\ncoalgebra for a functor\n\n\ninitial algebra\nfinal coalgebra\n\n\nleast fixed point\ngreatest fixed point\n\n\ncongruence relation\nbisimulation equivalence relation\n\n\nequational logic\nmodal logic\n\n\nrecursion: map out of an initial algebra\ncorecursion: map into a final coalgebra\n\n\nFoundation Axiom   \nAnti-Foundation Axiom   \n\n\niterative conception\ncoiterative conception   \n\n\nset with operations   \n set with transitions and observations  \n\n\nuseful in syntax   \nuseful in semantics   \n\n\nbottom-up   \n top-down  \n\n\n\n\nThe connection between greatest fixed points and final coalgebras is the\ncontent of the following result.\n\n\nTheorem [Aczel]\nFor every power polynomial F on \nClass, the greatest fixed point \ntogether with the identity on it, (F*, id),\n is a final coalgebra of F on \nClass.\nMoreover, if F is a polynomial functor, then \nF* is a set, and \n (F*, id)\nis a final coalgebra of F on Set.\n\n\nThe original result used much weaker hypotheses on F, \nusing notions which we did not define, so \nour statement is rather weaker than in Aczel’s book.   Several papers\nhave gone on to weaken strengthen this Final Coalgebra Theorem.\n\nBisimulation.\nWe have given the definition of bisimulation earlier,\nin Section 3.1.\nWe discussed it in connection with graphs, but the reader may also\nknow of a notion with the same name coming from modal logic.\nActually, the theory of coalgebra studies a more general notion,\nthat of bisimulation on a coalgebra for a given functor, defined first\nin Aczel and Mendler (1989).\nThis more general notion\nspecializes to several concepts which had been proposed in their own \nfields.     In addition, it is (nearly) the dual concept of a congruence on\nan algebra; this explains our line in \nthe conceptual comparison chart.\n\nEquational logic and modal logic.\nA great deal of work has shown ways in which equational logic\nand modal logic are “dual”,   but to spell this out in detail would\nrequire quite a bit more category theory than we need in the rest\nof this entry.\n\n\nThere is a growing field\nof coalgebraic generalizations of modal logic.   For a survey of\nthis area, see Kurz (2006).      \n\n\nThe final coalgebra\nof a functor may be regarded as a space of complete observations.\n(As with all our points in this section, this statement is mainly for functors on\nSet, and the notion of “complete observation”\nis, of course, merely suggestive.) For example, let \nAtProp be a set whose elements are\ncalled atomic propositions, and consider the functor\nF(a) = ℘fin(a) ×\n℘(AtProp ).  A coalgebra for this is a set a\ntogether with one map of a into its finite subsets, and\nanother map into the collection of sets of atomic propositions.\nPutting the two maps together gives a finitely-branching\nKripke model: each point has finitely many children and some set of\natomic propositions.  Now modal logic gives us a way of\n“observing” properties of points in coalgebras (Kripke\nmodels).  And the record of everything that one could observe from a\npoint is the modal theory of that point.  Further, one may take the\ncollection of all theories of all points in all finitely-branching\nKripke models and make this collection (it is a set) into the carrier\nof a final coalgebra for the functor.  Indeed, this would be one way\nto construct a final coalgebra.\n\n\nCorecursion. Returning now to \nthe chart, we present an example of a corecursive\ndefinition.\n The equation for zip \ngiven above shows \n how the zip  function on streams is\nto work.    It should satisfy \n\n\nzip(s, t)       =   \n⟨head(s), \n zip(t,\n  tail(s))⟩  \n  \n\nHere is how zip  is uniquely defined via a corecursive definition.\nWrite  N∞×\nN∞  as S in this discussion.\nWe want a map from S to N∞. \nWe are dealing with S as the final coalgebra of \n the functor Fa = N × a.\n And we’ll write the structure\n on the final coalgebra as\n⟨ head, tail&thinsp;⟩, just as we did it in\nSection 1.1.\nThe idea is to turn  S into the carrier set\nof a coalgebra for, say  (S, f). \nThen zip\nwill be the unique coalgebra morphism from \n (S, f) to \n (S,\n⟨ head,tail ⟩ ).   \nIt remains to define f.\nLet \n\n\nf(s, t) =\n⟨head(s),\n ⟨t, tail(s)⟩⟩ .\n\n\nAs mentioned, by finality there is a unique \nzip : S → N∞ \n so that\nthe diagram below commutes:\n\n\n\n\n\nS\nf→\nFS\n\n\nzip\n↓\n\n↓    Fzip\n\n\n\nN∞\n→\n⟨head,tail⟩\nFN∞\n\n\n\n\nTo make sure that this works, we follow an arbitrary pair of streams,\nsay \n⟨s,t⟩  around the square, starting in the upper-left.\n  Going down, we have the stream\n   zip(s, t).\nFrom this, the structure takes this to\n⟨head(zip(s, t)),\n tail(zip(s, t))⟩\n ∈ FN∞.\nBut we could also take our \n⟨s, t⟩  across the top via f to get \n⟨head(s), \n    ⟨t, tail(s)⟩⟩.\nNow Fzip applies to this pair, and\n this is where the action of F as a functor\nenters.   We get \n⟨head(s),\nzip(tail(t), s)⟩.\nSo overall, we have \n\n\nzip(s, t))     =    \n head(s) \n \n\n tail(zip(s, t)) \n      =       \n   zip(tail(t), s)\n\n\njust as desired.    It says:  to zip two streams, start with the head of the first,\nand then repeat this very process on the second followed by the tail of the first.\n\n\nThe main point of this demonstration is that the principle of finality is \nsufficient to define and study corecursive definitions.    There are many further\ndevelopments in this area.\n\n\nSets, again. We have already discussed at length the lines in the table concerning \nthe Foundation and Anti-Foundation Axioms, and their attendant \nconceptual backgrounds.   The point of this section is to situate\nthat entire discussion inside of a larger one.\n\n\nExamples of final coalgebras and corecursive definitions. \nOur conceptual comparison makes the point that algebras embody \nsets with operations.    This point is almost too easy:   \nthe reason behind the terminology\nof  “algebras” in category theory is that sets with operations may be modeled\nas algebras in the categorical sense.    For coalgebras, it is harder to make the\ncase that they directly correspond to sets with either “transitions” or “observations”.\nHowever, we present a few examples that motivate this point.\n\n\n\n Functor Fa \n coalgebra \n final coalgebra \n logic \n\n\n S × a \n stream system \n infinite streams over S \n a : φ for a ∈  S \n\n\n (S × a) + 1 \n stream system, allowing ends \n finite and infinite streams over S \n add an “end of stream marker”\n\n\n ℘a\n graph = Kripke frame = system of set equations \n pointed graphs modulo bisimulation \n a fragment of infinitary modal, no atoms\n\n\n ℘fina\n× ℘(AtProp)\n\n finitely branching Kripke model over the\nset  AtProp of atomic propositions\n a certain subset of the canonical model \n a fragment of modal logic over AtProp\n\n\n\nThe table above lists a few functors on Set \n  or \nClass  along with\nfinal coalgebras or other data from \nthe conceptual comparison chart.\n\n\nFirst, for any set S, the functor Fa = S×\n a.    \nA coalgebra for this F is a stream system of equations\nas we saw it in \nSection 1.1,\n except that there\nwe made things concrete and took S to be the set of natural numbers.\nThe final coalgebra is the set S∞ =  S ×\n  S∞  of \nstreams over S.\n   The logical language for this functor\nwould be a sentential  (propositional) language \nwhose sentences are either true  or of the form s : φ\n where s∈S.\nThe semantics would be the obvious one; for example\n\n\n(0, 1, 2, 3, … )  ⊨\n 0 : 1 : 2 : true.\n\n\nOne should note that  carrier of the  final coalgebra may be taken to be   \ncertain theories in this language.   These may be described extrinsically as\nthe theories of all points in all coalgebra.   It is more informative, however, to \nset down a logical system and then consider the maximal consistent sets in the system.\nWith the right definition, the maximal consistent sets do turn out to be the carrier of a\nfinal coalgebra for the functor.\n\n\nSecond, we consider Fa = (S × a)   + 1.\nHere 1 = {0} and + is the disjoint union operation.   However, it is \nmore common for people to represent the one and only element of \n1 using a symbol like *.\nThe coalgebras are like stream systems of equations, except now an\nequation might ask for a stream to “stop” by having * on the right-hand \nside.\nSo an example of a coalgebra would be \nx ≈ \n⟨s,y⟩ ,\n y ≈ *.\nThen the solution would  take \nx†  to be the one-term sequence  s.\nThe logic for this functor would be the same logic (HML) as before, except that\nnow we add an atomic sentence to detect the ends of finite sequences.\n \n\nTurning to the last two lines,  we already know that AFA is equivalent to\nthe assertion that  (V, id)\n is a final coalgebra of ℘; also, even without \nAFA, we have a final coalgebra whose carrier set is the pointed graphs modulo\nbisimulation.   The logic in this case is infinitary modal logic,\nactually, it is a fragment of this logic.   It turns\nout that two points in a given coalgebra have the same infinitary modal theory\niff they are bisimilar.\n \n\nThe line concerning ℘fin(a) ×\n ℘(AtProp) is the closest to \nthe Kripke semantics of modal logic.   One might hope that the final coalgebra\nwould turn out to be the canonical model of the modal logic \nK, but this is not\nquite right.    One needs to cut down to those maximal consistent sets which are\nrealized by some point in some finitely branching model.\n \nAs the reader may notice, we are being extremely vague about matters\nconcerning the logics: is there a principled explanation of where they come from?\nWhat, if anything,\nis the relation between the final coalgebras and canonical models\nas we find them in modal logic?  The explanations here are too long and too\ninvolved for this entry.   Once again,\none place to start reading about these matters is Kurz (2006).\n\n\nThe lines in at the bottom of the  conceptual comparison chart\n are the  most programmatic of all.\n \nDoing without AFA: final coalgebras\nin ZF. We mentioned in note [2] that it is possible to alter the pairing\noperation in such a way that one may prove many of the results that\nour treatment obtains only by using ZFA.  This points is\nmentioned in Forster (1994) and developed in detail in Paulson (1999)\n(and in other papers by Paulson). One replaces the Kuratowski pair\n⟨x,y⟩ with a variant,\n({0}× a)∪ ({1}× b).  (This is the\nusual disjoint union operation, also called the coproduct on\nsets.)  Then one defines variants of other notions: the cartesian\nproduct, functions, etc.  And in terms of these one can indeed study\nstreams and infinite trees, and many other sets of interest in this\nentry.  Even more, one can prove\nfinal coalgebra theorems, stating sufficient conditions\nfor the existence of a final coalgebra whose structure is the identity.\n(This is an important point for this line of work: in ZF we can \nshow the existence of final coalgebras for the same functors as in\nZFA, but in the latter theory we can get final coalgebras whose\nstructure maps are the identity.)\n\n\nOne might think that this move undermines much of the interest\nin AFA.     For Paulson, the reduction is important since he wants\nto use an automatic theorem prover to work with assertions in set theory.\nIt makes sense to work out detailed reductions so as to avoid changing\nthe set theory.    \n\nOtthers may not find this conclusive, for two reasons.  First, the\nmethod doesn’t apply to equations like x =\n{x}, or to collections like\nx = ℘fin(x).  The latter kind of\nequation is especially useful in applications.  But even more, what\nwill be of interest will be the whole assembly of what we might\ncall coalgebraic concepts: coinduction, corecursion, and\ntop-down treatments of various phenomena.  Someone who is using these\nconcepts and is also worried about modeling in set theory would\nprobably find it convenient to work with AFA, even if many of\nthe end applications could be done in standard set theory.\n \n\nTo put things differently, and to ask a question that surely belongs\nin this entry, why should one work with AFA instead\nof FA?  Much depends on the purposes one brings to set\ntheoretic modeling in the first place.  For most purposes, including\nmost of mathematics, it makes little or no difference.  To model some\ncircular phenomena, it turns out to be convenient to work with final\ncoalgebras of various functors.  It is especially nice with the\nstructure maps on those final coalgebras may be taken to be the\nidentity function.  For example, this would allow us to say that a\nstream of numbers really and truly is an ordered pair of a number and\na stream.  In this case, having AFA would be nice, but the\nresults above show that in many of the interesting cases, it is not\nactually needed.  On the other hand, if one is content to work with\nisomorphisms, then having the structure map be the identity is a kind\nof “optional extra”.  Further, the question of which axiom\nto adopt might appear to be besides the point.\n\n  Interested readers may consult the following supplementary\ndocument for a discussion of how the more general ideas from coalgebra\nand closely related fields help with discussions of the kinds of\nmathematical circularity which we looked at previously. \n   \n\nAdditional related modeling of circularity\n\nConclusion\n\n This entry has two major thrusts.  First, it introduced\nnon-wellfounded sets and described some of the mathematics around\nthem.  It was not comprehensive in this regard, and one should see\nPeter Aczel’s book (1988) for much more, including\ndiscussions of axioms besides AFA that we did not even mention.\nOne could also see Barwise and Moss (1996) for more on some of the\npoints that were touched on \nhere.[13]\n The presentation owes much to work in coalgebra that began\nshortly after these books appeared.  So readers familiar with either\nof them would still find something new in the first sections of the\nentry.\n\n The other thrust had to do with the conceptual points made in\nSection 4.5.\nThe idea is to situate the\nmathematics of set theoretic circularity inside a larger topic,\ncoalgebra, and then to understand both points in terms of a larger\ndivision between “bottom-up” and “top-down”\nideas.  This larger discussion is more programmatic than we would\nlike, and much remains to be done on it.  Our hope is that it helps\nreaders understand set theoretic circularity, both how it\nworks, and also why it is attractive.\n",
    "section_title": "4.5 Conceptual comparison",
    "entry_title": "Non-wellfounded Set Theory",
    "hierarchy_title": "Non-wellfounded Set Theory || Using AFA || The axioms again",
    "tokenized_text": [
        "using",
        "afa",
        "axiom",
        "conceptual",
        "comparison",
        "chart",
        "indicates",
        "kind",
        "conceptual",
        "comparison",
        "iterative",
        "coiterative",
        "idea",
        "entry",
        "towards",
        "top",
        "duality",
        "categorical",
        "sense",
        "moving",
        "downwards",
        "row",
        "chart",
        "like",
        "research",
        "direction",
        "actual",
        "result",
        "spelling",
        "detail",
        "chart",
        "like",
        "ongoing",
        "research",
        "project",
        "settled",
        "matter",
        "many",
        "functors",
        "set",
        "especially",
        "polynomial",
        "functors",
        "finite",
        "power",
        "set",
        "functor",
        "initial",
        "algebra",
        "least",
        "fixed",
        "point",
        "together",
        "identity",
        "polynomial",
        "functors",
        "least",
        "fixed",
        "point",
        "algebra",
        "term",
        "algebra",
        "functor",
        "coalgebra",
        "functor",
        "initial",
        "algebra",
        "final",
        "coalgebra",
        "least",
        "fixed",
        "point",
        "greatest",
        "fixed",
        "point",
        "congruence",
        "relation",
        "bisimulation",
        "equivalence",
        "relation",
        "equational",
        "logic",
        "modal",
        "logic",
        "recursion",
        "map",
        "initial",
        "algebra",
        "corecursion",
        "map",
        "final",
        "coalgebra",
        "foundation",
        "axiom",
        "antifoundation",
        "axiom",
        "iterative",
        "conception",
        "coiterative",
        "conception",
        "set",
        "operation",
        "set",
        "transition",
        "observation",
        "useful",
        "syntax",
        "useful",
        "semantics",
        "bottomup",
        "topdown",
        "connection",
        "greatest",
        "fixed",
        "point",
        "final",
        "coalgebras",
        "content",
        "following",
        "result",
        "theorem",
        "aczel",
        "every",
        "power",
        "polynomial",
        "f",
        "class",
        "greatest",
        "fixed",
        "point",
        "together",
        "identity",
        "f",
        "id",
        "final",
        "coalgebra",
        "f",
        "class",
        "moreover",
        "f",
        "polynomial",
        "functor",
        "f",
        "set",
        "f",
        "id",
        "final",
        "coalgebra",
        "f",
        "set",
        "original",
        "result",
        "used",
        "much",
        "weaker",
        "hypothesis",
        "f",
        "using",
        "notion",
        "define",
        "statement",
        "rather",
        "weaker",
        "aczel",
        "book",
        "several",
        "paper",
        "gone",
        "weaken",
        "strengthen",
        "final",
        "coalgebra",
        "theorem",
        "bisimulation",
        "given",
        "definition",
        "bisimulation",
        "earlier",
        "section",
        "discussed",
        "connection",
        "graph",
        "reader",
        "may",
        "also",
        "know",
        "notion",
        "name",
        "coming",
        "modal",
        "logic",
        "actually",
        "theory",
        "coalgebra",
        "study",
        "general",
        "notion",
        "bisimulation",
        "coalgebra",
        "given",
        "functor",
        "defined",
        "first",
        "aczel",
        "mendler",
        "general",
        "notion",
        "specializes",
        "several",
        "concept",
        "proposed",
        "field",
        "addition",
        "nearly",
        "dual",
        "concept",
        "congruence",
        "algebra",
        "explains",
        "line",
        "conceptual",
        "comparison",
        "chart",
        "equational",
        "logic",
        "modal",
        "logic",
        "great",
        "deal",
        "work",
        "shown",
        "way",
        "equational",
        "logic",
        "modal",
        "logic",
        "dual",
        "spell",
        "detail",
        "would",
        "require",
        "quite",
        "bit",
        "category",
        "theory",
        "need",
        "rest",
        "entry",
        "growing",
        "field",
        "coalgebraic",
        "generalization",
        "modal",
        "logic",
        "survey",
        "area",
        "see",
        "kurz",
        "final",
        "coalgebra",
        "functor",
        "may",
        "regarded",
        "space",
        "complete",
        "observation",
        "point",
        "section",
        "statement",
        "mainly",
        "functors",
        "set",
        "notion",
        "complete",
        "observation",
        "course",
        "merely",
        "suggestive",
        "example",
        "let",
        "atprop",
        "set",
        "whose",
        "element",
        "called",
        "atomic",
        "proposition",
        "consider",
        "functor",
        "f",
        "fin",
        "atprop",
        "coalgebra",
        "set",
        "together",
        "one",
        "map",
        "finite",
        "subset",
        "another",
        "map",
        "collection",
        "set",
        "atomic",
        "proposition",
        "putting",
        "two",
        "map",
        "together",
        "give",
        "finitelybranching",
        "kripke",
        "model",
        "point",
        "finitely",
        "many",
        "child",
        "set",
        "atomic",
        "proposition",
        "modal",
        "logic",
        "give",
        "u",
        "way",
        "observing",
        "property",
        "point",
        "coalgebras",
        "kripke",
        "model",
        "record",
        "everything",
        "one",
        "could",
        "observe",
        "point",
        "modal",
        "theory",
        "point",
        "one",
        "may",
        "take",
        "collection",
        "theory",
        "point",
        "finitelybranching",
        "kripke",
        "model",
        "make",
        "collection",
        "set",
        "carrier",
        "final",
        "coalgebra",
        "functor",
        "indeed",
        "would",
        "one",
        "way",
        "construct",
        "final",
        "coalgebra",
        "corecursion",
        "returning",
        "chart",
        "present",
        "example",
        "corecursive",
        "definition",
        "equation",
        "zip",
        "given",
        "show",
        "zip",
        "function",
        "stream",
        "work",
        "satisfy",
        "zip",
        "head",
        "zip",
        "tail",
        "zip",
        "uniquely",
        "defined",
        "via",
        "corecursive",
        "definition",
        "write",
        "n",
        "n",
        "discussion",
        "want",
        "map",
        "n",
        "dealing",
        "final",
        "coalgebra",
        "functor",
        "fa",
        "n",
        "a",
        "write",
        "structure",
        "final",
        "coalgebra",
        "head",
        "tail",
        "thinsp",
        "section",
        "idea",
        "turn",
        "carrier",
        "set",
        "coalgebra",
        "say",
        "f",
        "zip",
        "unique",
        "coalgebra",
        "morphism",
        "f",
        "head",
        "tail",
        "remains",
        "define",
        "f",
        "let",
        "f",
        "head",
        "t",
        "tail",
        "mentioned",
        "finality",
        "unique",
        "zip",
        "n",
        "diagram",
        "commute",
        "f",
        "f",
        "zip",
        "fzip",
        "n",
        "head",
        "tail",
        "fn",
        "make",
        "sure",
        "work",
        "follow",
        "arbitrary",
        "pair",
        "stream",
        "say",
        "s",
        "t",
        "around",
        "square",
        "starting",
        "upperleft",
        "going",
        "stream",
        "zip",
        "structure",
        "take",
        "head",
        "zip",
        "tail",
        "zip",
        "fn",
        "could",
        "also",
        "take",
        "s",
        "t",
        "across",
        "top",
        "via",
        "f",
        "get",
        "head",
        "t",
        "tail",
        "fzip",
        "applies",
        "pair",
        "action",
        "f",
        "functor",
        "enters",
        "get",
        "head",
        "zip",
        "tail",
        "overall",
        "zip",
        "head",
        "tail",
        "zip",
        "zip",
        "tail",
        "desired",
        "say",
        "zip",
        "two",
        "stream",
        "start",
        "head",
        "first",
        "repeat",
        "process",
        "second",
        "followed",
        "tail",
        "first",
        "main",
        "point",
        "demonstration",
        "principle",
        "finality",
        "sufficient",
        "define",
        "study",
        "corecursive",
        "definition",
        "many",
        "development",
        "area",
        "set",
        "already",
        "discussed",
        "length",
        "line",
        "table",
        "concerning",
        "foundation",
        "antifoundation",
        "axiom",
        "attendant",
        "conceptual",
        "background",
        "point",
        "section",
        "situate",
        "entire",
        "discussion",
        "inside",
        "larger",
        "one",
        "example",
        "final",
        "coalgebras",
        "corecursive",
        "definition",
        "conceptual",
        "comparison",
        "make",
        "point",
        "algebra",
        "embody",
        "set",
        "operation",
        "point",
        "almost",
        "easy",
        "reason",
        "behind",
        "terminology",
        "algebra",
        "category",
        "theory",
        "set",
        "operation",
        "may",
        "modeled",
        "algebra",
        "categorical",
        "sense",
        "coalgebras",
        "harder",
        "make",
        "case",
        "directly",
        "correspond",
        "set",
        "either",
        "transition",
        "observation",
        "however",
        "present",
        "example",
        "motivate",
        "point",
        "functor",
        "fa",
        "coalgebra",
        "final",
        "coalgebra",
        "logic",
        "stream",
        "system",
        "infinite",
        "stream",
        "φ",
        "stream",
        "system",
        "allowing",
        "end",
        "finite",
        "infinite",
        "stream",
        "add",
        "end",
        "stream",
        "marker",
        "a",
        "graph",
        "kripke",
        "frame",
        "system",
        "set",
        "equation",
        "pointed",
        "graph",
        "modulo",
        "bisimulation",
        "fragment",
        "infinitary",
        "modal",
        "atom",
        "fina",
        "atprop",
        "finitely",
        "branching",
        "kripke",
        "model",
        "set",
        "atprop",
        "atomic",
        "proposition",
        "certain",
        "subset",
        "canonical",
        "model",
        "fragment",
        "modal",
        "logic",
        "atprop",
        "table",
        "list",
        "functors",
        "set",
        "class",
        "along",
        "final",
        "coalgebras",
        "data",
        "conceptual",
        "comparison",
        "chart",
        "first",
        "set",
        "functor",
        "fa",
        "s",
        "a",
        "coalgebra",
        "f",
        "stream",
        "system",
        "equation",
        "saw",
        "section",
        "except",
        "made",
        "thing",
        "concrete",
        "took",
        "set",
        "natural",
        "number",
        "final",
        "coalgebra",
        "set",
        "s",
        "s",
        "stream",
        "s",
        "logical",
        "language",
        "functor",
        "would",
        "sentential",
        "propositional",
        "language",
        "whose",
        "sentence",
        "either",
        "true",
        "form",
        "φ",
        "ss",
        "semantics",
        "would",
        "obvious",
        "one",
        "example",
        "true",
        "one",
        "note",
        "carrier",
        "final",
        "coalgebra",
        "may",
        "taken",
        "certain",
        "theory",
        "language",
        "may",
        "described",
        "extrinsically",
        "theory",
        "point",
        "coalgebra",
        "informative",
        "however",
        "set",
        "logical",
        "system",
        "consider",
        "maximal",
        "consistent",
        "set",
        "system",
        "right",
        "definition",
        "maximal",
        "consistent",
        "set",
        "turn",
        "carrier",
        "final",
        "coalgebra",
        "functor",
        "second",
        "consider",
        "fa",
        "disjoint",
        "union",
        "operation",
        "however",
        "common",
        "people",
        "represent",
        "one",
        "element",
        "using",
        "symbol",
        "like",
        "coalgebras",
        "like",
        "stream",
        "system",
        "equation",
        "except",
        "equation",
        "might",
        "ask",
        "stream",
        "stop",
        "righthand",
        "side",
        "example",
        "coalgebra",
        "would",
        "x",
        "s",
        "y",
        "solution",
        "would",
        "take",
        "x",
        "oneterm",
        "sequence",
        "s",
        "logic",
        "functor",
        "would",
        "logic",
        "hml",
        "except",
        "add",
        "atomic",
        "sentence",
        "detect",
        "end",
        "finite",
        "sequence",
        "turning",
        "last",
        "two",
        "line",
        "already",
        "know",
        "afa",
        "equivalent",
        "assertion",
        "v",
        "id",
        "final",
        "coalgebra",
        "also",
        "even",
        "without",
        "afa",
        "final",
        "coalgebra",
        "whose",
        "carrier",
        "set",
        "pointed",
        "graph",
        "modulo",
        "bisimulation",
        "logic",
        "case",
        "infinitary",
        "modal",
        "logic",
        "actually",
        "fragment",
        "logic",
        "turn",
        "two",
        "point",
        "given",
        "coalgebra",
        "infinitary",
        "modal",
        "theory",
        "iff",
        "bisimilar",
        "line",
        "concerning",
        "fin",
        "atprop",
        "closest",
        "kripke",
        "semantics",
        "modal",
        "logic",
        "one",
        "might",
        "hope",
        "final",
        "coalgebra",
        "would",
        "turn",
        "canonical",
        "model",
        "modal",
        "logic",
        "k",
        "quite",
        "right",
        "one",
        "need",
        "cut",
        "maximal",
        "consistent",
        "set",
        "realized",
        "point",
        "finitely",
        "branching",
        "model",
        "reader",
        "may",
        "notice",
        "extremely",
        "vague",
        "matter",
        "concerning",
        "logic",
        "principled",
        "explanation",
        "come",
        "anything",
        "relation",
        "final",
        "coalgebras",
        "canonical",
        "model",
        "find",
        "modal",
        "logic",
        "explanation",
        "long",
        "involved",
        "entry",
        "one",
        "place",
        "start",
        "reading",
        "matter",
        "kurz",
        "line",
        "bottom",
        "conceptual",
        "comparison",
        "chart",
        "programmatic",
        "without",
        "afa",
        "final",
        "coalgebras",
        "zf",
        "mentioned",
        "note",
        "possible",
        "alter",
        "pairing",
        "operation",
        "way",
        "one",
        "may",
        "prove",
        "many",
        "result",
        "treatment",
        "obtains",
        "using",
        "zfa",
        "point",
        "mentioned",
        "forster",
        "developed",
        "detail",
        "paulson",
        "paper",
        "paulson",
        "one",
        "replaces",
        "kuratowski",
        "pair",
        "x",
        "y",
        "variant",
        "b",
        "usual",
        "disjoint",
        "union",
        "operation",
        "also",
        "called",
        "coproduct",
        "set",
        "one",
        "defines",
        "variant",
        "notion",
        "cartesian",
        "product",
        "function",
        "etc",
        "term",
        "one",
        "indeed",
        "study",
        "stream",
        "infinite",
        "tree",
        "many",
        "set",
        "interest",
        "entry",
        "even",
        "one",
        "prove",
        "final",
        "coalgebra",
        "theorem",
        "stating",
        "sufficient",
        "condition",
        "existence",
        "final",
        "coalgebra",
        "whose",
        "structure",
        "identity",
        "important",
        "point",
        "line",
        "work",
        "zf",
        "show",
        "existence",
        "final",
        "coalgebras",
        "functors",
        "zfa",
        "latter",
        "theory",
        "get",
        "final",
        "coalgebras",
        "whose",
        "structure",
        "map",
        "identity",
        "one",
        "might",
        "think",
        "move",
        "undermines",
        "much",
        "interest",
        "afa",
        "paulson",
        "reduction",
        "important",
        "since",
        "want",
        "use",
        "automatic",
        "theorem",
        "prover",
        "work",
        "assertion",
        "set",
        "theory",
        "make",
        "sense",
        "work",
        "detailed",
        "reduction",
        "avoid",
        "changing",
        "set",
        "theory",
        "otthers",
        "may",
        "find",
        "conclusive",
        "two",
        "reason",
        "first",
        "method",
        "apply",
        "equation",
        "like",
        "x",
        "x",
        "collection",
        "like",
        "x",
        "fin",
        "x",
        "latter",
        "kind",
        "equation",
        "especially",
        "useful",
        "application",
        "even",
        "interest",
        "whole",
        "assembly",
        "might",
        "call",
        "coalgebraic",
        "concept",
        "coinduction",
        "corecursion",
        "topdown",
        "treatment",
        "various",
        "phenomenon",
        "someone",
        "using",
        "concept",
        "also",
        "worried",
        "modeling",
        "set",
        "theory",
        "would",
        "probably",
        "find",
        "convenient",
        "work",
        "afa",
        "even",
        "many",
        "end",
        "application",
        "could",
        "done",
        "standard",
        "set",
        "theory",
        "put",
        "thing",
        "differently",
        "ask",
        "question",
        "surely",
        "belongs",
        "entry",
        "one",
        "work",
        "afa",
        "instead",
        "fa",
        "much",
        "depends",
        "purpose",
        "one",
        "brings",
        "set",
        "theoretic",
        "modeling",
        "first",
        "place",
        "purpose",
        "including",
        "mathematics",
        "make",
        "little",
        "difference",
        "model",
        "circular",
        "phenomenon",
        "turn",
        "convenient",
        "work",
        "final",
        "coalgebras",
        "various",
        "functors",
        "especially",
        "nice",
        "structure",
        "map",
        "final",
        "coalgebras",
        "may",
        "taken",
        "identity",
        "function",
        "example",
        "would",
        "allow",
        "u",
        "say",
        "stream",
        "number",
        "really",
        "truly",
        "ordered",
        "pair",
        "number",
        "stream",
        "case",
        "afa",
        "would",
        "nice",
        "result",
        "show",
        "many",
        "interesting",
        "case",
        "actually",
        "needed",
        "hand",
        "one",
        "content",
        "work",
        "isomorphism",
        "structure",
        "map",
        "identity",
        "kind",
        "optional",
        "extra",
        "question",
        "axiom",
        "adopt",
        "might",
        "appear",
        "besides",
        "point",
        "interested",
        "reader",
        "may",
        "consult",
        "following",
        "supplementary",
        "document",
        "discussion",
        "general",
        "idea",
        "coalgebra",
        "closely",
        "related",
        "field",
        "help",
        "discussion",
        "kind",
        "mathematical",
        "circularity",
        "looked",
        "previously",
        "additional",
        "related",
        "modeling",
        "circularity",
        "conclusion",
        "entry",
        "two",
        "major",
        "thrust",
        "first",
        "introduced",
        "nonwellfounded",
        "set",
        "described",
        "mathematics",
        "around",
        "comprehensive",
        "regard",
        "one",
        "see",
        "peter",
        "aczel",
        "book",
        "much",
        "including",
        "discussion",
        "axiom",
        "besides",
        "afa",
        "even",
        "mention",
        "one",
        "could",
        "also",
        "see",
        "barwise",
        "moss",
        "point",
        "touched",
        "presentation",
        "owes",
        "much",
        "work",
        "coalgebra",
        "began",
        "shortly",
        "book",
        "appeared",
        "reader",
        "familiar",
        "either",
        "would",
        "still",
        "find",
        "something",
        "new",
        "first",
        "section",
        "entry",
        "thrust",
        "conceptual",
        "point",
        "made",
        "section",
        "idea",
        "situate",
        "mathematics",
        "set",
        "theoretic",
        "circularity",
        "inside",
        "larger",
        "topic",
        "coalgebra",
        "understand",
        "point",
        "term",
        "larger",
        "division",
        "bottomup",
        "topdown",
        "idea",
        "larger",
        "discussion",
        "programmatic",
        "would",
        "like",
        "much",
        "remains",
        "done",
        "hope",
        "help",
        "reader",
        "understand",
        "set",
        "theoretic",
        "circularity",
        "work",
        "also",
        "attractive"
    ]
}