{
    "main_text": "Can Normativity Be Given a Naturalistic Explanation?\n3. Can Normativity Be Given a Naturalistic Explanation?\n\nWe have been helping ourselves to the ideas of a normative\nproperty and a normative fact, but we haven’t yet\nconsidered in a systematic way views about what the\nnormativity of such properties and facts might consist in. As\nwe explained, the queerness argument for the error theory rests on the\nidea that some property of normative facts is queer, and the leading\ncandidate seems to be the normativity of the normative facts.\nOne way to answer the queerness argument, then, would be to provide an\nexplanation of what the property of being normative consists in, and a\nnaturalistic explanation would ideally put to rest the worry that\nthere is something queer about normativity. This is one reason to take\nseriously the question whether normativity can be explained\nnaturalistically.\n\nNon-naturalists deny that normative properties are natural ones, often\nbecause they hold that the normativity of these properties rules out\ntheir being natural ones. The idea here is that natural properties are\nnot and could not be normative. But the issue whether a normative\nproperty could be a natural one is not the same as the issue whether\nnormativity can be given a naturalistic explanation. Normative\nnaturalists hold that normative predicates ascribe or refer to natural\nproperties, and some if not all normative naturalists would contend\nthat normative properties are natural ones. But this does not\ncommit them to the view that normativity can be explained\nnaturalistically. It is open to a normative naturalist to deny that\nnormativity can be explained at all. So the dispute between\nnaturalists and their opponents, including non-naturalists, cuts\nacross the issue raised by our question.\n\nIn this section, then, we explore whether normativity can be given a\nnaturalistic explanation. In the next section, we explore a variety of\nputative explanations of normativity, including naturalistic ones.\n\nWe begin by clarifying our question. An explanation puts an\nexplanandum into an explanatory relation with an\nexplanans. So, first, what exactly is the explanandum in the\ncase of our question? Second, what kind of explanatory relation is at\nissue? What relation between explanandum and naturalistic explanans\nare we looking for? There are different kinds of explanation. And\nthird, the explanans of a naturalistic explanation would be something\nnaturalistic, but what would count as a naturalistic\nexplanans?\n\nThe explanandum in question is the property of being\nnormative, one might say. But we need to bring this into sharper\nfocus. The error theory contests the idea that there are normative\nproperties and normative facts. Certain other anti-realist theories\nmight agree with the error theory that there are not any normative\nfacts – understood as worldly states of\naffairs – but, as we will see, might not deny that there are\nnormative truths. And all of these theories, as well as\nrealist theories, would agree that there are normative\nconcepts and normative claims and\njudgments. As we said before, the main area of debate among\nthese theories concerns whether there are worldly normative properties\nand facts. Nevertheless, our question in this section is about the\npossibility of providing a naturalistic explanation of\nnormativity. Normative properties and facts (if there are\nany) instantiate the property of being normative, but so do normative\nconcepts, normative claims, normative judgments, and normative truths\n(if there are any). The explanandum of the question we are asking,\nthen, is this property of being normative. Is it possible to provide a\nnaturalistic explanation of this property?\n\nPerhaps, however, there is more than one such property. Perhaps there\nis a family of “normativity properties”. For it is not\nclear that normative properties, facts, truths, and claims would all\nbe normative in virtue of having exactly the same property. Perhaps\nnormative claims are normative in virtue of having the normative truth\nconditions they have, whereas these truth conditions are normative in\nvirtue of the normativity of the properties that partly constitute\nthem. Perhaps, then, what normative concepts, claims, truths, facts,\nand properties have in common, assuming there are such things, is not\nthat they all instantiate the property of being normative,\nbut rather that they instantiate one of the properties from\nthe “normativity family”.\n\nWhat kind of explanation is at issue? As we understand matters, we are\nlooking for a “constitutive explanation”, an account of\nthe essential nature of the property (or properties) of being\nnormative, or a “real definition” of the property (or of\neach of the properties) (Rosen 2010; also Schroeder 2005, King 1998).\nA non-normative example of such an explanation would be the account of\nthe property of being an acid according to which to be an\nacid is to be a proton donor. The question is whether there could be a\nrelevantly similar naturalistic account of the essential nature of the\nproperty of being normative. Or, if there is more than one\nsuch property, the question is whether there could be naturalistic\naccounts of the essential natures of the normativity properties.\n\nIn a naturalistic constitutive explanation of the property\n(or properties) of being normative, the explanans (for each\nnormativity property) would be a natural property, or perhaps a\nnaturalistic “condition”, all the constituents of which\nare natural properties. For example, if to be an acid is to be a\nproton donor, then it is a necessary truth that every acid satisfies\nthe condition, or has the complex property, of being a proton donor.\nOur question, then, is whether there could be a similar explanation of\nnormativity. Could there be an explanation of the normativity of\nnormative facts according to which, for such a fact to be normative is\nfor it to satisfy a condition X, Y, Z where\neach constituent of this condition is something natural?\n\nUnfortunately, it is tricky to specify what we mean by a\n“natural” property. For our purposes in this entry, as a\nfirst approximation, we might take natural properties to be, roughly,\nthose that figure in scientific theories. Examples would be the\nproperties that figure in biology, economics, psychology, and so on,\nincluding the property of being an acid, the property of being\ndeciduous, the property of being inflationary, and so on. More\nbroadly, as a second approximation, we might say that a natural\nproperty is such that any substantive knowledge we could have about\nits instantiation would be empirical. This broader usage would allow\nus to count the properties of being an automobile and being a lawn\nchair to count as natural ones. (For discussion of the idea of a\nnatural property, see entries on\n moral naturalism\n and\n moral non-naturalism).\n\nWe have said that the explanandum of our question is the property of\nbeing normative or perhaps the family of normativity properties. A\ncomplication is that there are philosophical disagreements about the\nnature of properties, or about the use of the word\n“property”.\n\nAs we said before, we understand properties to be worldly\ncharacteristics that underlie objective, genuine, worldly similarities\namong things. Call this the “robust” or\n“realist” view of properties. On a very different\n“minimalist” view, to speak of a property is simply to\ntalk in an abstract way about uses of predicates, such as their use in\ndescribing things. On such a view, our taking it to be true that it\nwould be bad to drink more Dr. Peppers commits us to there being a\n“property” that is ascribed by “bad”, but this\nis nothing but a commitment to (roughly) whatever is involved in the\npredicative use of “bad”. Similarly, on such a view, the\nidea that there is a property ascribed by “normative” is\nmerely a commitment to (roughly) whatever is involved in the\npredicative use of “normative”.\n\nThe upshot is that there are both minimalist and realist views about\nthe nature of the explanandum of our question. On the realist view,\nthe challenge is to explain the nature of the property or properties\nthat underlie the objective similarity among normative properties, in\nvirtue of which they are normative, as well as the objective\nsimilarities among normative concepts, normative facts, and normative\nclaims. On a minimalist view, the challenge is very different. It is,\nroughly, to explain what is involved in the predicative use of\n“normative”. Minimalism leaves open what might be\ninvolved. For all that it says, the predicative use of\n“normative” might involve ascribing a realist property.\nHowever, there are alternatives, which, as we will see, are taken up\nby anti-realist metaethical views such as non-cognitivist\nexpressivism.\n\nIt is worth mentioning that there are also minimalist views about the\nmeanings of the words “true” and “fact”, or\nabout how these terms are used. On one minimalist view about the\nmeaning of “true”, for example, to say it is true that it\nwould be bad to drink another Dr. Pepper is just a way of saying that\nit would be bad to drink another Dr. Pepper. And on one minimalist\nview about “fact”, facts are simply true propositions.\nThese minimalist views seem to imply that uses of “true”\nand “fact”, as well as uses of “property”, do\nnot have any metaphysical implications. Most important, they do not\ncommit us to the existence of worldly states of affairs or worldly\nproperties that underwrite genuine similarities among things.\n\nMinimalist views of these kinds are not uncommon. Minimalism figures\nin the quasi-realist expressivism advocated by Simon Blackburn (2006).\nArguably Parfit’s “non-metaphysical non-naturalism”\n(2011: vol 2, 486) or “non-realist cognitivism” (2017: 49)\nalso incorporates minimalist views. So-called “quietist\nrealist” positions also arguably involve a kind of minimalism\n(see Dworkin 1996 and 2011: part 1; Scanlon 2014).\n\nIn addition to the difference between realist and minimalist\nunderstandings of the explanandum, there is a difference between\nrobust and formalist understandings. We will explain this distinction\nin\n section 3.1.\n The formalist view is a kind of deflationary view about normativity.\nIt would sidestep our question, in effect. There is controversy about\nwhether there is such a thing as robust normativity, but our question\npresupposes that there is such a thing and asks whether its nature can\nbe given a naturalistic explanation. We will therefore set aside the\nformalist view after a brief discussion of it.\n\nIn\n section 3.2,\n we introduce the distinction between normative realism and normative\nanti-realism. We sketch the challenge that our question poses to\nnormative realism, and the kinds of answers that realists might\nprovide. Realism is, however, compatible with fundamentally different\nviews about the explanation of normativity. In\n section 3.3,\n we consider the “primitivist” view that the nature of\nnormativity cannot be explained at all, at least not in non-normative\nterms. Primitivism is characteristic of non-naturalism, but it is also\navailable to naturalists.\n\nIn\n section 3.4,\n we introduce a distinction between “conceptualism” and\n“objectualism”, two views about the kinds of things that\ninstantiate the property of being normative.\n“Objectualist” theories hold that there are worldly\nnormative properties and states of affairs, whereas\n“conceptualist” theories deny this and hold instead that\nnormativity lies exclusively, or at least fundamentally, in the realm\nof thought. Conceptualism is, we think, the characteristic position of\nanti-realists; at least, this is so if we set aside the error theory,\nbut conceptualism is also compatible with normative realism. In\n section 3.4.1\n and\n section 3.4.2,\n we look at anti-realist and realist versions of conceptualism,\nrespectively.\n\nFinally, in\n section 3.5,\n we turn to objectualism, and the issue whether there might be a\nsuccessful form of reductive normative naturalism. This kind of theory\nwould provide an ambitious answer to our organizing question. It would\ncombine a realist, robust view of the property of being normative with\nthe objectualist view that this property is instantiated by states of\naffairs and first-order ethical properties. It then contends that it\nis possible to provide a naturalistic constitutive explanation of the\nproperty (or properties) of being normative.\n\nThe question we address in this section concerns whether a\nnaturalistic constitutive explanation of normativity can be\nprovided. In this section, we address the question in abstract\nterms. In the following section,\n section 4,\n we explore a variety of putative explanations of normativity,\nincluding naturalistic ones. The best way to show that a naturalistic\nexplanation of normativity is possible would be to provide one.\n",
    "section_title": "3. Can Normativity Be Given a Naturalistic Explanation?",
    "entry_title": "Normativity in Metaethics",
    "hierarchy_title": "Normativity in Metaethics || Can Normativity Be Given a Naturalistic Explanation?",
    "tokenized_text": [
        "normativity",
        "given",
        "naturalistic",
        "explanation",
        "normativity",
        "given",
        "naturalistic",
        "explanation",
        "helping",
        "idea",
        "normative",
        "property",
        "normative",
        "fact",
        "yet",
        "considered",
        "systematic",
        "way",
        "view",
        "normativity",
        "property",
        "fact",
        "might",
        "consist",
        "explained",
        "queerness",
        "argument",
        "error",
        "theory",
        "rest",
        "idea",
        "property",
        "normative",
        "fact",
        "queer",
        "leading",
        "candidate",
        "seems",
        "normativity",
        "normative",
        "fact",
        "one",
        "way",
        "answer",
        "queerness",
        "argument",
        "would",
        "provide",
        "explanation",
        "property",
        "normative",
        "consists",
        "naturalistic",
        "explanation",
        "would",
        "ideally",
        "put",
        "rest",
        "worry",
        "something",
        "queer",
        "normativity",
        "one",
        "reason",
        "take",
        "seriously",
        "question",
        "whether",
        "normativity",
        "explained",
        "naturalistically",
        "nonnaturalists",
        "deny",
        "normative",
        "property",
        "natural",
        "one",
        "often",
        "hold",
        "normativity",
        "property",
        "rule",
        "natural",
        "one",
        "idea",
        "natural",
        "property",
        "could",
        "normative",
        "issue",
        "whether",
        "normative",
        "property",
        "could",
        "natural",
        "one",
        "issue",
        "whether",
        "normativity",
        "given",
        "naturalistic",
        "explanation",
        "normative",
        "naturalist",
        "hold",
        "normative",
        "predicate",
        "ascribe",
        "refer",
        "natural",
        "property",
        "normative",
        "naturalist",
        "would",
        "contend",
        "normative",
        "property",
        "natural",
        "one",
        "commit",
        "view",
        "normativity",
        "explained",
        "naturalistically",
        "open",
        "normative",
        "naturalist",
        "deny",
        "normativity",
        "explained",
        "dispute",
        "naturalist",
        "opponent",
        "including",
        "nonnaturalists",
        "cut",
        "across",
        "issue",
        "raised",
        "question",
        "section",
        "explore",
        "whether",
        "normativity",
        "given",
        "naturalistic",
        "explanation",
        "next",
        "section",
        "explore",
        "variety",
        "putative",
        "explanation",
        "normativity",
        "including",
        "naturalistic",
        "one",
        "begin",
        "clarifying",
        "question",
        "explanation",
        "put",
        "explanandum",
        "explanatory",
        "relation",
        "explanans",
        "first",
        "exactly",
        "explanandum",
        "case",
        "question",
        "second",
        "kind",
        "explanatory",
        "relation",
        "issue",
        "relation",
        "explanandum",
        "naturalistic",
        "explanans",
        "looking",
        "different",
        "kind",
        "explanation",
        "third",
        "explanans",
        "naturalistic",
        "explanation",
        "would",
        "something",
        "naturalistic",
        "would",
        "count",
        "naturalistic",
        "explanans",
        "explanandum",
        "question",
        "property",
        "normative",
        "one",
        "might",
        "say",
        "need",
        "bring",
        "sharper",
        "focus",
        "error",
        "theory",
        "contest",
        "idea",
        "normative",
        "property",
        "normative",
        "fact",
        "certain",
        "antirealist",
        "theory",
        "might",
        "agree",
        "error",
        "theory",
        "normative",
        "fact",
        "understood",
        "worldly",
        "state",
        "affair",
        "see",
        "might",
        "deny",
        "normative",
        "truth",
        "theory",
        "well",
        "realist",
        "theory",
        "would",
        "agree",
        "normative",
        "concept",
        "normative",
        "claim",
        "judgment",
        "said",
        "main",
        "area",
        "debate",
        "among",
        "theory",
        "concern",
        "whether",
        "worldly",
        "normative",
        "property",
        "fact",
        "nevertheless",
        "question",
        "section",
        "possibility",
        "providing",
        "naturalistic",
        "explanation",
        "normativity",
        "normative",
        "property",
        "fact",
        "instantiate",
        "property",
        "normative",
        "normative",
        "concept",
        "normative",
        "claim",
        "normative",
        "judgment",
        "normative",
        "truth",
        "explanandum",
        "question",
        "asking",
        "property",
        "normative",
        "possible",
        "provide",
        "naturalistic",
        "explanation",
        "property",
        "perhaps",
        "however",
        "one",
        "property",
        "perhaps",
        "family",
        "normativity",
        "property",
        "clear",
        "normative",
        "property",
        "fact",
        "truth",
        "claim",
        "would",
        "normative",
        "virtue",
        "exactly",
        "property",
        "perhaps",
        "normative",
        "claim",
        "normative",
        "virtue",
        "normative",
        "truth",
        "condition",
        "whereas",
        "truth",
        "condition",
        "normative",
        "virtue",
        "normativity",
        "property",
        "partly",
        "constitute",
        "perhaps",
        "normative",
        "concept",
        "claim",
        "truth",
        "fact",
        "property",
        "common",
        "assuming",
        "thing",
        "instantiate",
        "property",
        "normative",
        "rather",
        "instantiate",
        "one",
        "property",
        "normativity",
        "family",
        "kind",
        "explanation",
        "issue",
        "understand",
        "matter",
        "looking",
        "constitutive",
        "explanation",
        "account",
        "essential",
        "nature",
        "property",
        "property",
        "normative",
        "real",
        "definition",
        "property",
        "property",
        "rosen",
        "also",
        "schroeder",
        "king",
        "nonnormative",
        "example",
        "explanation",
        "would",
        "account",
        "property",
        "acid",
        "according",
        "acid",
        "proton",
        "donor",
        "question",
        "whether",
        "could",
        "relevantly",
        "similar",
        "naturalistic",
        "account",
        "essential",
        "nature",
        "property",
        "normative",
        "one",
        "property",
        "question",
        "whether",
        "could",
        "naturalistic",
        "account",
        "essential",
        "nature",
        "normativity",
        "property",
        "naturalistic",
        "constitutive",
        "explanation",
        "property",
        "property",
        "normative",
        "explanans",
        "normativity",
        "property",
        "would",
        "natural",
        "property",
        "perhaps",
        "naturalistic",
        "condition",
        "constituent",
        "natural",
        "property",
        "example",
        "acid",
        "proton",
        "donor",
        "necessary",
        "truth",
        "every",
        "acid",
        "satisfies",
        "condition",
        "complex",
        "property",
        "proton",
        "donor",
        "question",
        "whether",
        "could",
        "similar",
        "explanation",
        "normativity",
        "could",
        "explanation",
        "normativity",
        "normative",
        "fact",
        "according",
        "fact",
        "normative",
        "satisfy",
        "condition",
        "x",
        "z",
        "constituent",
        "condition",
        "something",
        "natural",
        "unfortunately",
        "tricky",
        "specify",
        "mean",
        "natural",
        "property",
        "purpose",
        "entry",
        "first",
        "approximation",
        "might",
        "take",
        "natural",
        "property",
        "roughly",
        "figure",
        "scientific",
        "theory",
        "example",
        "would",
        "property",
        "figure",
        "biology",
        "economics",
        "psychology",
        "including",
        "property",
        "acid",
        "property",
        "deciduous",
        "property",
        "inflationary",
        "broadly",
        "second",
        "approximation",
        "might",
        "say",
        "natural",
        "property",
        "substantive",
        "knowledge",
        "could",
        "instantiation",
        "would",
        "empirical",
        "broader",
        "usage",
        "would",
        "allow",
        "u",
        "count",
        "property",
        "automobile",
        "lawn",
        "chair",
        "count",
        "natural",
        "one",
        "discussion",
        "idea",
        "natural",
        "property",
        "see",
        "entry",
        "moral",
        "naturalism",
        "moral",
        "nonnaturalism",
        "said",
        "explanandum",
        "question",
        "property",
        "normative",
        "perhaps",
        "family",
        "normativity",
        "property",
        "complication",
        "philosophical",
        "disagreement",
        "nature",
        "property",
        "use",
        "word",
        "property",
        "said",
        "understand",
        "property",
        "worldly",
        "characteristic",
        "underlie",
        "objective",
        "genuine",
        "worldly",
        "similarity",
        "among",
        "thing",
        "call",
        "robust",
        "realist",
        "view",
        "property",
        "different",
        "minimalist",
        "view",
        "speak",
        "property",
        "simply",
        "talk",
        "abstract",
        "way",
        "us",
        "predicate",
        "use",
        "describing",
        "thing",
        "view",
        "taking",
        "true",
        "would",
        "bad",
        "drink",
        "dr",
        "pepper",
        "commits",
        "u",
        "property",
        "ascribed",
        "bad",
        "nothing",
        "commitment",
        "roughly",
        "whatever",
        "involved",
        "predicative",
        "use",
        "bad",
        "similarly",
        "view",
        "idea",
        "property",
        "ascribed",
        "normative",
        "merely",
        "commitment",
        "roughly",
        "whatever",
        "involved",
        "predicative",
        "use",
        "normative",
        "upshot",
        "minimalist",
        "realist",
        "view",
        "nature",
        "explanandum",
        "question",
        "realist",
        "view",
        "challenge",
        "explain",
        "nature",
        "property",
        "property",
        "underlie",
        "objective",
        "similarity",
        "among",
        "normative",
        "property",
        "virtue",
        "normative",
        "well",
        "objective",
        "similarity",
        "among",
        "normative",
        "concept",
        "normative",
        "fact",
        "normative",
        "claim",
        "minimalist",
        "view",
        "challenge",
        "different",
        "roughly",
        "explain",
        "involved",
        "predicative",
        "use",
        "normative",
        "minimalism",
        "leaf",
        "open",
        "might",
        "involved",
        "say",
        "predicative",
        "use",
        "normative",
        "might",
        "involve",
        "ascribing",
        "realist",
        "property",
        "however",
        "alternative",
        "see",
        "taken",
        "antirealist",
        "metaethical",
        "view",
        "noncognitivist",
        "expressivism",
        "worth",
        "mentioning",
        "also",
        "minimalist",
        "view",
        "meaning",
        "word",
        "true",
        "fact",
        "term",
        "used",
        "one",
        "minimalist",
        "view",
        "meaning",
        "true",
        "example",
        "say",
        "true",
        "would",
        "bad",
        "drink",
        "another",
        "dr",
        "pepper",
        "way",
        "saying",
        "would",
        "bad",
        "drink",
        "another",
        "dr",
        "pepper",
        "one",
        "minimalist",
        "view",
        "fact",
        "fact",
        "simply",
        "true",
        "proposition",
        "minimalist",
        "view",
        "seem",
        "imply",
        "us",
        "true",
        "fact",
        "well",
        "us",
        "property",
        "metaphysical",
        "implication",
        "important",
        "commit",
        "u",
        "existence",
        "worldly",
        "state",
        "affair",
        "worldly",
        "property",
        "underwrite",
        "genuine",
        "similarity",
        "among",
        "thing",
        "minimalist",
        "view",
        "kind",
        "uncommon",
        "minimalism",
        "figure",
        "quasirealist",
        "expressivism",
        "advocated",
        "simon",
        "blackburn",
        "arguably",
        "parfit",
        "nonmetaphysical",
        "nonnaturalism",
        "vol",
        "nonrealist",
        "cognitivism",
        "also",
        "incorporates",
        "minimalist",
        "view",
        "socalled",
        "quietist",
        "realist",
        "position",
        "also",
        "arguably",
        "involve",
        "kind",
        "minimalism",
        "see",
        "dworkin",
        "part",
        "scanlon",
        "addition",
        "difference",
        "realist",
        "minimalist",
        "understanding",
        "explanandum",
        "difference",
        "robust",
        "formalist",
        "understanding",
        "explain",
        "distinction",
        "section",
        "formalist",
        "view",
        "kind",
        "deflationary",
        "view",
        "normativity",
        "would",
        "sidestep",
        "question",
        "effect",
        "controversy",
        "whether",
        "thing",
        "robust",
        "normativity",
        "question",
        "presupposes",
        "thing",
        "asks",
        "whether",
        "nature",
        "given",
        "naturalistic",
        "explanation",
        "therefore",
        "set",
        "aside",
        "formalist",
        "view",
        "brief",
        "discussion",
        "section",
        "introduce",
        "distinction",
        "normative",
        "realism",
        "normative",
        "antirealism",
        "sketch",
        "challenge",
        "question",
        "pose",
        "normative",
        "realism",
        "kind",
        "answer",
        "realist",
        "might",
        "provide",
        "realism",
        "however",
        "compatible",
        "fundamentally",
        "different",
        "view",
        "explanation",
        "normativity",
        "section",
        "consider",
        "primitivist",
        "view",
        "nature",
        "normativity",
        "explained",
        "least",
        "nonnormative",
        "term",
        "primitivism",
        "characteristic",
        "nonnaturalism",
        "also",
        "available",
        "naturalist",
        "section",
        "introduce",
        "distinction",
        "conceptualism",
        "objectualism",
        "two",
        "view",
        "kind",
        "thing",
        "instantiate",
        "property",
        "normative",
        "objectualist",
        "theory",
        "hold",
        "worldly",
        "normative",
        "property",
        "state",
        "affair",
        "whereas",
        "conceptualist",
        "theory",
        "deny",
        "hold",
        "instead",
        "normativity",
        "lie",
        "exclusively",
        "least",
        "fundamentally",
        "realm",
        "thought",
        "conceptualism",
        "think",
        "characteristic",
        "position",
        "antirealists",
        "least",
        "set",
        "aside",
        "error",
        "theory",
        "conceptualism",
        "also",
        "compatible",
        "normative",
        "realism",
        "section",
        "section",
        "look",
        "antirealist",
        "realist",
        "version",
        "conceptualism",
        "respectively",
        "finally",
        "section",
        "turn",
        "objectualism",
        "issue",
        "whether",
        "might",
        "successful",
        "form",
        "reductive",
        "normative",
        "naturalism",
        "kind",
        "theory",
        "would",
        "provide",
        "ambitious",
        "answer",
        "organizing",
        "question",
        "would",
        "combine",
        "realist",
        "robust",
        "view",
        "property",
        "normative",
        "objectualist",
        "view",
        "property",
        "instantiated",
        "state",
        "affair",
        "firstorder",
        "ethical",
        "property",
        "contends",
        "possible",
        "provide",
        "naturalistic",
        "constitutive",
        "explanation",
        "property",
        "property",
        "normative",
        "question",
        "address",
        "section",
        "concern",
        "whether",
        "naturalistic",
        "constitutive",
        "explanation",
        "normativity",
        "provided",
        "section",
        "address",
        "question",
        "abstract",
        "term",
        "following",
        "section",
        "section",
        "explore",
        "variety",
        "putative",
        "explanation",
        "normativity",
        "including",
        "naturalistic",
        "one",
        "best",
        "way",
        "show",
        "naturalistic",
        "explanation",
        "normativity",
        "possible",
        "would",
        "provide",
        "one"
    ]
}