{
    "main_text": "Is Normativity Mind-Dependent? || What is Mind-Dependence?\n5.1 What is Mind-Dependence?\n\nFirst, what is the important scope of mind-dependence? Is the\nimportant question whether some normative facts are\nmind-dependent, or whether all such facts are? We think it is\nthe latter. Mark Schroeder claims, with regard to reasons in\nparticular, that it is uncontroversial that some reasons\nare explained by mental states – Ronnie has a reason to go to the\ndance because he loves to dance, but Bradley has a reason to avoid the\ndance because he hates dancing. What would be controversial\nis the idea that all reasons are explained by mental states;\nthis is actually entailed by Schroeder’s “Humean”\nview of reasons (Schroeder 2007). We agree that the interesting\nquestion is whether all normative facts are mind-dependent,\nor whether, instead, some are mind-independent.\n\nWe also note, however, that there could be important questions about\nthe mind-independence of distinct normative subdomains. For example,\nthere are the questions whether all moral facts are\nmind-dependent, whether all aesthetic facts are\nmind-independent, etc.\n\nSecond, it would be good to get a clearer idea of what kind of\ndependence is involved in mind-dependence. In brief, we are going to\ntry to be as ecumenical as possible, not tying mind-dependence to any\nnarrowly defined or parochial metaphysical relation. Rather,\nmind-dependence concerns broad metaphysical dependence on the mental.\nThis is for two reasons: first, this just seems to us to be what\nimportant debate in the vicinity is about. It’s not as if\nmind-dependence concerns metaphysical constitution by the mental,\nrather than reduction. Certainly advocates of the view that wrongness\nis constituted by disapproval disagree on some points with\nthose who think that wrongness reduces to disapproval. But in\ngeneral they seem to agree on an important point: that the there is\nsome kind of robust metaphysical dependence of wrongness on some\nmental state. It is our sense that this agreed-upon claim is what is\nat stake in debates about mind-dependence.\n\nThe second reason to define mind-dependence ecumenically is that this\nis the best way of making sense of the extant literature. Sharon\nStreet’s body of work is an example. She describes her position\nas committing her to mind-dependence (Street 2016: 298n). But she\ndescribes it differently in different places: she writes (2012) that\nnormative truth consists in what follows from within the\npractical point of view; or (2008) that normative facts are\nconstituted by facts about the agent’s judgments; she\n(2016) characterizes mind-dependence views at those on which\n“things [are] valuable ultimately because we value\nthem” (emphasis added). So we should understand the defining\nrelation of mind-dependence so that it encompasses all of these\nrelations. Below, we will call this generic relation\n“grounding”, for simplicity. This term is\nimperfect – grounding has become intensely theorized and\ndisputed – but we use it as a stand-in for a broad kind of\nmetaphysical dependence.\n\nFinally, we think that the relevant notion of mind-dependence rules\nout there being mind-independent normative constraints on the kinds of\nmental states that can ground normative facts. A few examples will\nexplain what we mean. Take the view that what we have reason to do is\ngrounded in what an ideally rational agent in our situation would want\nto do, where rationality is an irreducibly normative property. Or take\nthe view that value is grounded in being the appropriate object of an\nattitude such as admiration, where appropriateness is irreducibly\nnormative. Both views ground some significant set of normative facts\nin mental facts, but they also entail that other normative facts\n(facts about rationality and appropriateness, respectively) are\nnot grounded in mental states. Such views do not, on our\nreckoning, count as mind-dependent, for two reasons. First, we have\nestablished that the important question about mind-dependence is\nwhether all normative facts are mind-dependent, and these\nviews are views on which some aren’t. Second, and most\nimportant, the relevant normative facts are partly grounded in other\nnormative facts that are themselves not grounded in mental\nfacts: facts about rationality or appropriateness are in the grounds,\nwhere these facts explicitly do not “ground out” in mental\nfacts.\n\nThis leaves us, so far, with the claim that mind-dependence views are\nthose that fully ground all normative facts (or some significant\nsubset thereof) in mental facts. Yet as we’ll see, even this\nformulation leaves some problems.\n\nMany have worried that the debate over mind-dependence is not a\nsignificant one. Gideon Rosen (1994) argued that the notion of\nmind-independence does not track our intuitive notion of objectivity.\nHis arguments often take the form: X-facts are a paradigm example of\nmind-dependent facts, but they depend on Y-facts, and Y-facts seem\nperfectly real and objective even though they are obviously mind\ndependent. Facts about humor, for example, may depend on what humans\nfind funny – but facts about what humans find funny are perfectly\nobjective! Other of his arguments take the form: X-facts are clearly\nobjective, but they depend on mental facts, and so are mind-dependent.\nFacts about fox terriers, for example depend causally on the\nintentions of those who bred them – but surely facts about fox\nterriers are objective!\n\nRuss Shafer-Landau points to a different kind of problem: mundane\nfirst-order normative truths depend on mental facts. Thus, if\nparticular normative facts are mind-dependent just when they depend on\nmental facts, and if we don’t distinguish kinds of dependence,\nit looks like many mundane first-order claims commit one to the\nmind-dependence of the relevant particular normative fact:\n\n\nWe obviously can’t enter a moral assessment of an agent’s\nmotivations and intentions without recourse to what is going on in her\nmind. And the moral status of an action may depend very importantly on\nhow pleased or miserable it makes others, whether it prompts feelings\nof anger or empathy, whether one who is harmed has given his consent\nto the treatment, etc. (2003: 15)\n\n\nThis problem has been discussed by, for example, Enoch (2011:\n2–3), Rosati (2018), and Morton (forthcoming). The problem is\nthat mind-dependence is not something that should be an entailment of\nmundane first-order moral claims that, presumably, would be accepted\nby theorists on both sides of the debate about mind-dependence.\n\nAs it stands, this problem can be solved by appeal to our earlier\nclarification: the claim worth arguing about is whether all\nnormative facts (or at least all moral facts) are mind-dependent. As\nlong as there are some moral facts that don’t depend on mental\nfacts, Shafer-Landau’s point shouldn’t worry us.\n\nThere is, however, a related, although perhaps more subtle point, that\narises for certain ethical theories. Utilitarianism, for example,\nentails that all particular moral facts depend on mental facts about\nhappiness and unhappiness. This means that – assuming a normative\nfact is mind-dependent just when it depends on mental\nfacts – utilitarianism is by definition a theory on which all\nparticular moral facts are mind-dependent. (The theory does not imply\nthat the fact that it itself is true is mind-dependent.) But surely it\nwould be a mistake to think that utilitarianism implies that all\nparticular moral facts are mind-dependent in the sense at issue in\nmeta-ethical debate about realism! And utilitarianism is not unique.\nMany other moral theories hold that that which makes right actions\nright (and good actions good, etc.) is purely mental. Consider a view\non which all moral evaluations depend on the intentions of the actor,\nfor example. So we need a solution to this puzzle – an account of\nthe nature of mind-dependence (in the sense relevant to the\nmeta-ethical debate) that doesn’t commit such theories one way\nor the other on whether particular moral facts are mind-dependent (in\nthat sense).\n\nThis is a puzzle about the very notion of mind-dependence. One\nsolution would be Shafer-Landau’s (2003: 15): he suggests that\nmind-dependence is ultimately a matter of how “the moral\nstandards that fix the moral facts” are “made true”.\nWe could parlay this into a general account of the mind-dependence of\nnormative facts in the following way: a particular normative fact is\nmind-dependent when the normative principle that governs its grounding\nin the non-normative is mind-dependent. And a principle is\nmind-dependent when it is grounded in mental facts. This solution\nallows mundane first-order claims to make no commitment on the issue\nof mind-dependence. The important question regarding the\nmind-dependence of a particular normative fact will be what explains\nor grounds the connection between, for example, causing\nunhappiness and being wrong. For example, is the principle of utility\nonly true because I believe it or because of some other mental fact?\nIf so, the principle is mind-dependent, and this mind-dependence is\ninherited by the fact that my act is wrong.\n\nAnother way to solve the problem would be to be pluralists about the\nkinds of mind-dependence that could be relevant. Fine (2012)\nsuggested, in a broader context, that metaphysical grounding is\nfundamentally distinct from normative grounding. So perhaps when\nutilitarianism says the moral depends on the mental, it means that it\nnormatively depends on the mental, while the meta-ethical\ndebate about mind-dependence (about the moral) concerns the claim that\nthe moral metaphysically depends on the mental. This is a\nsuggestion that has not been fully explored yet (though it is\ndiscussed in Berker (2018), Enoch (2019) and Morton\n(forthcoming)).\n\nEither proposal would solve the problem with utilitarianism. If\nmind-dependence (in the sense relevant to the meta-ethical debate\nabout realism) is a matter of whether normative principles are\ngrounded in mental facts, then utilitarians are free (as far as their\nutilitarianism goes) to endorse either the mind-dependence or the\nmind-independence of the moral. Utilitarianism just says that the\nparticular moral facts are grounded in mental facts, but does\nnot commit one way or the other on the grounding of the Principle of\nUtility. Similarly, if mind-dependence is a matter of\nmetaphysical (as opposed to normative) grounding of\nparticular facts in the mental, then utilitarianism can (and should)\nbe read as the claim that moral facts are normatively\ngrounded in happiness facts. Utilitarianism is silent on the further\nclaim that moral facts are metaphysically grounded in\nhappiness facts (or any mental facts whatsoever), which leaves it open\nto the utilitarian to either affirm or deny the mind-dependence of\nmoral facts – i.e., to either affirm or deny mind-independent\nmoral realism.\n\nThe puzzles around mind-dependence remain not fully explored, and it\nseems to us that more work is needed here. Nevertheless, we will press\non now to consider arguments for and against the mind-dependence of\nthe normative (or in some cases, the moral in particular). For\nsimplicity, however, we will continue to talk about mind-dependence as\nconcerning whether normative facts are grounded in mental facts. We\nwill not attempt to cash this out in terms of either or both of the\nabove more nuanced accounts.\n",
    "section_title": "5.1 What is Mind-Dependence?",
    "entry_title": "Normativity in Metaethics",
    "hierarchy_title": "Normativity in Metaethics || Is Normativity Mind-Dependent? || What is Mind-Dependence?",
    "tokenized_text": [
        "normativity",
        "minddependent",
        "minddependence",
        "minddependence",
        "first",
        "important",
        "scope",
        "minddependence",
        "important",
        "question",
        "whether",
        "normative",
        "fact",
        "minddependent",
        "whether",
        "fact",
        "think",
        "latter",
        "mark",
        "schroeder",
        "claim",
        "regard",
        "reason",
        "particular",
        "uncontroversial",
        "reason",
        "explained",
        "mental",
        "state",
        "ronnie",
        "reason",
        "go",
        "dance",
        "love",
        "dance",
        "bradley",
        "reason",
        "avoid",
        "dance",
        "hate",
        "dancing",
        "would",
        "controversial",
        "idea",
        "reason",
        "explained",
        "mental",
        "state",
        "actually",
        "entailed",
        "schroeder",
        "humean",
        "view",
        "reason",
        "schroeder",
        "agree",
        "interesting",
        "question",
        "whether",
        "normative",
        "fact",
        "minddependent",
        "whether",
        "instead",
        "mindindependent",
        "also",
        "note",
        "however",
        "could",
        "important",
        "question",
        "mindindependence",
        "distinct",
        "normative",
        "subdomains",
        "example",
        "question",
        "whether",
        "moral",
        "fact",
        "minddependent",
        "whether",
        "aesthetic",
        "fact",
        "mindindependent",
        "etc",
        "second",
        "would",
        "good",
        "get",
        "clearer",
        "idea",
        "kind",
        "dependence",
        "involved",
        "minddependence",
        "brief",
        "going",
        "try",
        "ecumenical",
        "possible",
        "tying",
        "minddependence",
        "narrowly",
        "defined",
        "parochial",
        "metaphysical",
        "relation",
        "rather",
        "minddependence",
        "concern",
        "broad",
        "metaphysical",
        "dependence",
        "mental",
        "two",
        "reason",
        "first",
        "seems",
        "u",
        "important",
        "debate",
        "vicinity",
        "minddependence",
        "concern",
        "metaphysical",
        "constitution",
        "mental",
        "rather",
        "reduction",
        "certainly",
        "advocate",
        "view",
        "wrongness",
        "constituted",
        "disapproval",
        "disagree",
        "point",
        "think",
        "wrongness",
        "reduces",
        "disapproval",
        "general",
        "seem",
        "agree",
        "important",
        "point",
        "kind",
        "robust",
        "metaphysical",
        "dependence",
        "wrongness",
        "mental",
        "state",
        "sense",
        "agreedupon",
        "claim",
        "stake",
        "debate",
        "minddependence",
        "second",
        "reason",
        "define",
        "minddependence",
        "ecumenically",
        "best",
        "way",
        "making",
        "sense",
        "extant",
        "literature",
        "sharon",
        "street",
        "body",
        "work",
        "example",
        "describes",
        "position",
        "committing",
        "minddependence",
        "street",
        "n",
        "describes",
        "differently",
        "different",
        "place",
        "writes",
        "normative",
        "truth",
        "consists",
        "follows",
        "within",
        "practical",
        "point",
        "view",
        "normative",
        "fact",
        "constituted",
        "fact",
        "agent",
        "judgment",
        "characterizes",
        "minddependence",
        "view",
        "thing",
        "valuable",
        "ultimately",
        "value",
        "emphasis",
        "added",
        "understand",
        "defining",
        "relation",
        "minddependence",
        "encompasses",
        "relation",
        "call",
        "generic",
        "relation",
        "grounding",
        "simplicity",
        "term",
        "imperfect",
        "grounding",
        "become",
        "intensely",
        "theorized",
        "disputed",
        "use",
        "standin",
        "broad",
        "kind",
        "metaphysical",
        "dependence",
        "finally",
        "think",
        "relevant",
        "notion",
        "minddependence",
        "rule",
        "mindindependent",
        "normative",
        "constraint",
        "kind",
        "mental",
        "state",
        "ground",
        "normative",
        "fact",
        "example",
        "explain",
        "mean",
        "take",
        "view",
        "reason",
        "grounded",
        "ideally",
        "rational",
        "agent",
        "situation",
        "would",
        "want",
        "rationality",
        "irreducibly",
        "normative",
        "property",
        "take",
        "view",
        "value",
        "grounded",
        "appropriate",
        "object",
        "attitude",
        "admiration",
        "appropriateness",
        "irreducibly",
        "normative",
        "view",
        "ground",
        "significant",
        "set",
        "normative",
        "fact",
        "mental",
        "fact",
        "also",
        "entail",
        "normative",
        "fact",
        "fact",
        "rationality",
        "appropriateness",
        "respectively",
        "grounded",
        "mental",
        "state",
        "view",
        "reckoning",
        "count",
        "minddependent",
        "two",
        "reason",
        "first",
        "established",
        "important",
        "question",
        "minddependence",
        "whether",
        "normative",
        "fact",
        "minddependent",
        "view",
        "view",
        "second",
        "important",
        "relevant",
        "normative",
        "fact",
        "partly",
        "grounded",
        "normative",
        "fact",
        "grounded",
        "mental",
        "fact",
        "fact",
        "rationality",
        "appropriateness",
        "ground",
        "fact",
        "explicitly",
        "ground",
        "mental",
        "fact",
        "leaf",
        "u",
        "far",
        "claim",
        "minddependence",
        "view",
        "fully",
        "ground",
        "normative",
        "fact",
        "significant",
        "subset",
        "thereof",
        "mental",
        "fact",
        "yet",
        "see",
        "even",
        "formulation",
        "leaf",
        "problem",
        "many",
        "worried",
        "debate",
        "minddependence",
        "significant",
        "one",
        "gideon",
        "rosen",
        "argued",
        "notion",
        "mindindependence",
        "track",
        "intuitive",
        "notion",
        "objectivity",
        "argument",
        "often",
        "take",
        "form",
        "xfacts",
        "paradigm",
        "example",
        "minddependent",
        "fact",
        "depend",
        "yfacts",
        "yfacts",
        "seem",
        "perfectly",
        "real",
        "objective",
        "even",
        "though",
        "obviously",
        "mind",
        "dependent",
        "fact",
        "humor",
        "example",
        "may",
        "depend",
        "human",
        "find",
        "funny",
        "fact",
        "human",
        "find",
        "funny",
        "perfectly",
        "objective",
        "argument",
        "take",
        "form",
        "xfacts",
        "clearly",
        "objective",
        "depend",
        "mental",
        "fact",
        "minddependent",
        "fact",
        "fox",
        "terrier",
        "example",
        "depend",
        "causally",
        "intention",
        "bred",
        "surely",
        "fact",
        "fox",
        "terrier",
        "objective",
        "rus",
        "shaferlandau",
        "point",
        "different",
        "kind",
        "problem",
        "mundane",
        "firstorder",
        "normative",
        "truth",
        "depend",
        "mental",
        "fact",
        "thus",
        "particular",
        "normative",
        "fact",
        "minddependent",
        "depend",
        "mental",
        "fact",
        "distinguish",
        "kind",
        "dependence",
        "look",
        "like",
        "many",
        "mundane",
        "firstorder",
        "claim",
        "commit",
        "one",
        "minddependence",
        "relevant",
        "particular",
        "normative",
        "fact",
        "obviously",
        "enter",
        "moral",
        "assessment",
        "agent",
        "motivation",
        "intention",
        "without",
        "recourse",
        "going",
        "mind",
        "moral",
        "status",
        "action",
        "may",
        "depend",
        "importantly",
        "pleased",
        "miserable",
        "make",
        "others",
        "whether",
        "prompt",
        "feeling",
        "anger",
        "empathy",
        "whether",
        "one",
        "harmed",
        "given",
        "consent",
        "treatment",
        "etc",
        "problem",
        "discussed",
        "example",
        "enoch",
        "rosati",
        "morton",
        "forthcoming",
        "problem",
        "minddependence",
        "something",
        "entailment",
        "mundane",
        "firstorder",
        "moral",
        "claim",
        "presumably",
        "would",
        "accepted",
        "theorist",
        "side",
        "debate",
        "minddependence",
        "stand",
        "problem",
        "solved",
        "appeal",
        "earlier",
        "clarification",
        "claim",
        "worth",
        "arguing",
        "whether",
        "normative",
        "fact",
        "least",
        "moral",
        "fact",
        "minddependent",
        "long",
        "moral",
        "fact",
        "depend",
        "mental",
        "fact",
        "shaferlandau",
        "point",
        "worry",
        "u",
        "however",
        "related",
        "although",
        "perhaps",
        "subtle",
        "point",
        "arises",
        "certain",
        "ethical",
        "theory",
        "utilitarianism",
        "example",
        "entail",
        "particular",
        "moral",
        "fact",
        "depend",
        "mental",
        "fact",
        "happiness",
        "unhappiness",
        "mean",
        "assuming",
        "normative",
        "fact",
        "minddependent",
        "depends",
        "mental",
        "fact",
        "utilitarianism",
        "definition",
        "theory",
        "particular",
        "moral",
        "fact",
        "minddependent",
        "theory",
        "imply",
        "fact",
        "true",
        "minddependent",
        "surely",
        "would",
        "mistake",
        "think",
        "utilitarianism",
        "implies",
        "particular",
        "moral",
        "fact",
        "minddependent",
        "sense",
        "issue",
        "metaethical",
        "debate",
        "realism",
        "utilitarianism",
        "unique",
        "many",
        "moral",
        "theory",
        "hold",
        "make",
        "right",
        "action",
        "right",
        "good",
        "action",
        "good",
        "etc",
        "purely",
        "mental",
        "consider",
        "view",
        "moral",
        "evaluation",
        "depend",
        "intention",
        "actor",
        "example",
        "need",
        "solution",
        "puzzle",
        "account",
        "nature",
        "minddependence",
        "sense",
        "relevant",
        "metaethical",
        "debate",
        "commit",
        "theory",
        "one",
        "way",
        "whether",
        "particular",
        "moral",
        "fact",
        "minddependent",
        "sense",
        "puzzle",
        "notion",
        "minddependence",
        "one",
        "solution",
        "would",
        "shaferlandau",
        "suggests",
        "minddependence",
        "ultimately",
        "matter",
        "moral",
        "standard",
        "fix",
        "moral",
        "fact",
        "made",
        "true",
        "could",
        "parlay",
        "general",
        "account",
        "minddependence",
        "normative",
        "fact",
        "following",
        "way",
        "particular",
        "normative",
        "fact",
        "minddependent",
        "normative",
        "principle",
        "governs",
        "grounding",
        "nonnormative",
        "minddependent",
        "principle",
        "minddependent",
        "grounded",
        "mental",
        "fact",
        "solution",
        "allows",
        "mundane",
        "firstorder",
        "claim",
        "make",
        "commitment",
        "issue",
        "minddependence",
        "important",
        "question",
        "regarding",
        "minddependence",
        "particular",
        "normative",
        "fact",
        "explains",
        "ground",
        "connection",
        "example",
        "causing",
        "unhappiness",
        "wrong",
        "example",
        "principle",
        "utility",
        "true",
        "believe",
        "mental",
        "fact",
        "principle",
        "minddependent",
        "minddependence",
        "inherited",
        "fact",
        "act",
        "wrong",
        "another",
        "way",
        "solve",
        "problem",
        "would",
        "pluralist",
        "kind",
        "minddependence",
        "could",
        "relevant",
        "fine",
        "suggested",
        "broader",
        "context",
        "metaphysical",
        "grounding",
        "fundamentally",
        "distinct",
        "normative",
        "grounding",
        "perhaps",
        "utilitarianism",
        "say",
        "moral",
        "depends",
        "mental",
        "mean",
        "normatively",
        "depends",
        "mental",
        "metaethical",
        "debate",
        "minddependence",
        "moral",
        "concern",
        "claim",
        "moral",
        "metaphysically",
        "depends",
        "mental",
        "suggestion",
        "fully",
        "explored",
        "yet",
        "though",
        "discussed",
        "berker",
        "enoch",
        "morton",
        "forthcoming",
        "either",
        "proposal",
        "would",
        "solve",
        "problem",
        "utilitarianism",
        "minddependence",
        "sense",
        "relevant",
        "metaethical",
        "debate",
        "realism",
        "matter",
        "whether",
        "normative",
        "principle",
        "grounded",
        "mental",
        "fact",
        "utilitarian",
        "free",
        "far",
        "utilitarianism",
        "go",
        "endorse",
        "either",
        "minddependence",
        "mindindependence",
        "moral",
        "utilitarianism",
        "say",
        "particular",
        "moral",
        "fact",
        "grounded",
        "mental",
        "fact",
        "commit",
        "one",
        "way",
        "grounding",
        "principle",
        "utility",
        "similarly",
        "minddependence",
        "matter",
        "metaphysical",
        "opposed",
        "normative",
        "grounding",
        "particular",
        "fact",
        "mental",
        "utilitarianism",
        "read",
        "claim",
        "moral",
        "fact",
        "normatively",
        "grounded",
        "happiness",
        "fact",
        "utilitarianism",
        "silent",
        "claim",
        "moral",
        "fact",
        "metaphysically",
        "grounded",
        "happiness",
        "fact",
        "mental",
        "fact",
        "whatsoever",
        "leaf",
        "open",
        "utilitarian",
        "either",
        "affirm",
        "deny",
        "minddependence",
        "moral",
        "fact",
        "ie",
        "either",
        "affirm",
        "deny",
        "mindindependent",
        "moral",
        "realism",
        "puzzle",
        "around",
        "minddependence",
        "remain",
        "fully",
        "explored",
        "seems",
        "u",
        "work",
        "needed",
        "nevertheless",
        "press",
        "consider",
        "argument",
        "minddependence",
        "normative",
        "case",
        "moral",
        "particular",
        "simplicity",
        "however",
        "continue",
        "talk",
        "minddependence",
        "concerning",
        "whether",
        "normative",
        "fact",
        "grounded",
        "mental",
        "fact",
        "attempt",
        "cash",
        "term",
        "either",
        "nuanced",
        "account"
    ]
}