{
    "main_text": "Philosophy of Bildung and History\n5. Philosophy of Bildung and History\n\nAccording to Novalis, the “academy ought to be a thoroughly\nphilosophical institution—only one faculty—the whole\nestablishment organized—to arouse and exercise the capacity to\nthink [Denkkraft] in a purposive way” (MO #4, trans. modified).\nBy emphasizing the need for independent thinking, Fichte endorsed\nKant’s critical turn and his transformation of philosophy,\npitched as a set of doctrines and principles, into philosophizing,\npictured as a critical activity. Furthermore, Fichte had realized that\nphilosophizing is a call of the self to the self (FS #567). Yet the\nself to which the philosophizing turns is not understood as an empty\nor merely formal capacity for self-positing. True idealism, Novalis\nclaims, is not opposed to realism, but only to formalism. A proper\naccount of the self, in its relation to itself, should consider the\nself’s development in and through history as well as its\nexternalizing of itself in the encounter with other minds and\nnature.\n\nThe idea of Bildung, education in and through culture,\nremains one of the most significant contributions of late\neighteenth-century philosophy. Even though it is most often associated\nwith Hegel’s Phenomenology of Spirit (as well as his\nslightly later speech “On Classical Studies”), in which\nthe philosophical mind retrieves its historical-systematic development\nas a succession of various philosophical paradigms and thought models,\nthe notion was widely applied before 1807. We find it in the work of\nHerder, the young Schleiermacher, and, expanding the focus to the\nrealm of literature, the idea of Bildung is operative in\nGoethe’s Wilhelm Meister. Goethe’s work, as the\nsequel commences in the mid 1790s, follows Wilhelm through his\nyouthful adventures and beyond, seeing how the protagonist gradually\nreaches an understanding of his formative experiences and thus gains\nan ever-increasing sense of freedom and self-determination.\n\nFor Novalis, too, philosophy involves a process of maturity and\nself-understanding (though he would eventually grow more critical of\nGoethe’s work). This is another dimension of his call for a\npractical turn in philosophy. In Novalis’s words: “Whoever\nknows what philosophizing is, also knows what life is” (AB\n#702). Philosophy does not manifest itself in a set of theoretical\ndogmas, but in a capacity to judge. As such, philosophy cannot be\nlearned or passively appropriated, but only triggered by such Socratic\nprovocations as the fragment, irony, the joke, and the essay. Hence\nNovalis’s call for a romanticizing of the world does not involve\nperceiving it through a new or different lens, but the ability to\nraise oneself to a state of critical self-understanding. This aim,\nNovalis emphasizes, cannot be reached through the means of isolated\nsoliloquy, but requires an engagement with the larger community as\nwell as with history, tradition, natural science, and art. It\ninvolves, in short, the realization that the self necessarily belongs\nto a more comprehensive, historically developed, and cross-culturally\nfertilized totality of meaning. In affinity with\nSchleiermacher’s Speeches (which Novalis studied in the\nearly fall of 1799), Novalis makes it clear that individuality proper\nis only developed in interaction with other individuals. If\n“[e]ach human being is a society in miniature” (MO #42),\nit still applies that “[e]very individual is the center of a\nsystem of emanation” (MO #109).\n\nThe self understands itself as part of a given community, but also as\nthe product of a historical development that spans the arts and the\nsciences alike. Only in this way can the I, in Novalis’s\nparadoxical formulation, be the I of its I (MO #28). In order to see\noneself as situated within a given historical and intersubjective\ncontext, history cannot be fully objectivized: “[w]e are related\nto all parts of the universe—as we are to the future and to\ntimes past” (MO #91). The understanding of history is thus a\nmatter of self-understanding. However, in the enlightenment\ncelebration of novelty and progress, history is reduced to a catalogue\nof mistakes that are left behind in favor of a more mature\ncomprehension of reality past and present. In Novalis’s view,\nphilosophical romanticism must take on the responsibility of\noverthrowing—at a meta-philosophical as well as\nhistorical-empirical level—such an ahistorical concept of\nhistory. Thus the emphasis on Bildung involves a reassessment\nnot only of the self (it involves recognizing that the self is\nfundamentally situated in tradition), but also of the tradition. This\nimplies, first, the view that tradition extends into the present and,\nsecond, the claim that in order to gain understanding of history,\nhence also of the interpreter’s own time, historical expressions\nshould not be judged by the criteria of the present but be seen within\ntheir own context, be it cultural, political, religious, or all of the\nabove.\n\nFor Novalis, the classical world is so to speak the other of\nmodernity; it is different, yet a fundamental part of it. Furthermore,\nany modern culture—and here we see, again, the traces of\nNovalis’s turn towards the more cosmopolitan spirit of the\nHanseatic League—understands itself in critical interaction with\nother cultures, including those of the non-Western world and the\ntemporally distant parts of the interpreter’s own culture. In\nhis 1798 reflections on Goethe, Novalis writes that spirit by nature\nstrives to absorb and understand its other. This process of expanding\none’s horizon by considering the other’s point of view is,\nat one and the same time, the nature and the ultimate goal of\nBildung. In Kant Studies such an enterprise is\npresented, along the lines of Kantian anthropology, as the theory of\nthe causes and remedies of prejudices (KS 330).\n\nThe emphasis on understanding others does not involve a relativization\nof history and intercultural understanding. Like Schleiermacher and\nSchlegel, Novalis takes a strong interest in philology and demands\nthat every author and reader must be philologically minded\n(Teplitz Fragments #42). Philology, for the romantic\nphilosopher, is, among other things, about the reader taking into\naccount the original context in which the text was produced. Hence,\naccording to Novalis, “[p]hilologizing is the true\nscholarly occupation. It corresponds to\nexperimenting” (AB #724). Philologizing—and note\nagain, as in the case of philosophizing, the active form\nphilologisiren and the reference to experimenting—is\nabout breaking through illegitimate prejudices, trying to understand a\nsymbolic expression on its own terms rather than reducing it to a\nfamiliar position, which would minimize its capacity to challenge the\nreader’s system of beliefs and values. Conceived in this way,\nphilology challenges every scholastic passing down of authoritative\ninterpretations. It curbs the threat of the dead letter and\ncounteracts the tendency of modern society to steward the tradition in\nsuch a formalistic way that it overlooks the meaning of the\nhieroglyph, as Novalis at one point puts it. In the spirit of the\nEnlightenment, he wishes to challenge and critically reflect on\nprejudices handed down from tradition. But unlike the enlightenment\nphilosophers—at least in their most undialectical championing of\nprogress—Novalis believes that the past can itself offer\nresources for a critical-reflexive discussion of and stance towards\nthe present. In this sense, Novalis can claim that “The theory\nof the future belongs to history” (AB #425). Even if the past\ncannot be immediately retrieved and even if it is neither desirable\nnor rational to long for a revival of times long gone, the past,\nproviding an alternative to the intellectual framework of the present,\ncan aid the philosopher, the artist, the scientist, or the politician\nin developing a critical attitude to the beliefs and assumptions he or\nshe had previously left unanalyzed. The past should in other words be\nreconstructed on its own terms, but precisely such a reconstruction,\nNovalis argues, will ensure its relevance for the present.\n\nWhile it is entirely crucial to the romantic concept of\nBildung, the idea of philology is related to the return to\nthe classical form of the fragment. At stake in both cases is the\nawareness that there are, in philosophy, two ways to look at things,\nfrom above and downward or from below and upward, roughly\ncorresponding to what Kant in the same period had addressed as\nreflective and determinative judgment or Herder, drawing on the\nresources of Scottish enlightenment philosophy, had seen as the\ndifference between inductive-empirical and deductively-minded\nphilosophy.\n\nUltimately, Novalis identifies the never-ending process of\nBildung with philosophy itself. Doing philosophy, Novalis\nexplains, is a conversation with oneself (LFI #21), but one that takes\nplace through the encounter with the other. Thus, the decision to\n“do philosophy is a challenge to the real self to reflect, to\nawaken and to be spirit” (LFI #21). Philosophy is about the\nself’s capacity to take responsibility for itself. For, at the\nend of the day, “[l]ife must not be a novel that is given to us,\nbut one that is made by us” (LFI #99).\n",
    "section_title": "5. Philosophy of Bildung and History",
    "entry_title": "Georg Friedrich Philipp von Hardenberg [Novalis]",
    "hierarchy_title": "Georg Friedrich Philipp von Hardenberg [Novalis] || Philosophy of Bildung and History",
    "tokenized_text": [
        "philosophy",
        "bildung",
        "history",
        "philosophy",
        "bildung",
        "history",
        "according",
        "novalis",
        "academy",
        "ought",
        "thoroughly",
        "philosophical",
        "institutiononly",
        "one",
        "facultythe",
        "whole",
        "establishment",
        "organizedto",
        "arouse",
        "exercise",
        "capacity",
        "think",
        "denkkraft",
        "purposive",
        "way",
        "mo",
        "trans",
        "modified",
        "emphasizing",
        "need",
        "independent",
        "thinking",
        "fichte",
        "endorsed",
        "kant",
        "critical",
        "turn",
        "transformation",
        "philosophy",
        "pitched",
        "set",
        "doctrine",
        "principle",
        "philosophizing",
        "pictured",
        "critical",
        "activity",
        "furthermore",
        "fichte",
        "realized",
        "philosophizing",
        "call",
        "self",
        "self",
        "f",
        "yet",
        "self",
        "philosophizing",
        "turn",
        "understood",
        "empty",
        "merely",
        "formal",
        "capacity",
        "selfpositing",
        "true",
        "idealism",
        "novalis",
        "claim",
        "opposed",
        "realism",
        "formalism",
        "proper",
        "account",
        "self",
        "relation",
        "consider",
        "self",
        "development",
        "history",
        "well",
        "externalizing",
        "encounter",
        "mind",
        "nature",
        "idea",
        "bildung",
        "education",
        "culture",
        "remains",
        "one",
        "significant",
        "contribution",
        "late",
        "eighteenthcentury",
        "philosophy",
        "even",
        "though",
        "often",
        "associated",
        "hegel",
        "phenomenology",
        "spirit",
        "well",
        "slightly",
        "later",
        "speech",
        "classical",
        "study",
        "philosophical",
        "mind",
        "retrieves",
        "historicalsystematic",
        "development",
        "succession",
        "various",
        "philosophical",
        "paradigm",
        "thought",
        "model",
        "notion",
        "widely",
        "applied",
        "find",
        "work",
        "herder",
        "young",
        "schleiermacher",
        "expanding",
        "focus",
        "realm",
        "literature",
        "idea",
        "bildung",
        "operative",
        "goethe",
        "wilhelm",
        "meister",
        "goethe",
        "work",
        "sequel",
        "commences",
        "mid",
        "s",
        "follows",
        "wilhelm",
        "youthful",
        "adventure",
        "beyond",
        "seeing",
        "protagonist",
        "gradually",
        "reach",
        "understanding",
        "formative",
        "experience",
        "thus",
        "gain",
        "everincreasing",
        "sense",
        "freedom",
        "selfdetermination",
        "novalis",
        "philosophy",
        "involves",
        "process",
        "maturity",
        "selfunderstanding",
        "though",
        "would",
        "eventually",
        "grow",
        "critical",
        "goethe",
        "work",
        "another",
        "dimension",
        "call",
        "practical",
        "turn",
        "philosophy",
        "novalis",
        "word",
        "whoever",
        "know",
        "philosophizing",
        "also",
        "know",
        "life",
        "ab",
        "philosophy",
        "manifest",
        "set",
        "theoretical",
        "dogma",
        "capacity",
        "judge",
        "philosophy",
        "learned",
        "passively",
        "appropriated",
        "triggered",
        "socratic",
        "provocation",
        "fragment",
        "irony",
        "joke",
        "essay",
        "hence",
        "novalis",
        "call",
        "romanticizing",
        "world",
        "involve",
        "perceiving",
        "new",
        "different",
        "lens",
        "ability",
        "raise",
        "oneself",
        "state",
        "critical",
        "selfunderstanding",
        "aim",
        "novalis",
        "emphasizes",
        "reached",
        "mean",
        "isolated",
        "soliloquy",
        "requires",
        "engagement",
        "larger",
        "community",
        "well",
        "history",
        "tradition",
        "natural",
        "science",
        "art",
        "involves",
        "short",
        "realization",
        "self",
        "necessarily",
        "belongs",
        "comprehensive",
        "historically",
        "developed",
        "crossculturally",
        "fertilized",
        "totality",
        "meaning",
        "affinity",
        "schleiermacher",
        "speech",
        "novalis",
        "studied",
        "early",
        "fall",
        "novalis",
        "make",
        "clear",
        "individuality",
        "proper",
        "developed",
        "interaction",
        "individual",
        "e",
        "ach",
        "human",
        "society",
        "miniature",
        "mo",
        "still",
        "applies",
        "e",
        "individual",
        "center",
        "system",
        "emanation",
        "mo",
        "self",
        "understands",
        "part",
        "given",
        "community",
        "also",
        "product",
        "historical",
        "development",
        "span",
        "art",
        "science",
        "alike",
        "way",
        "novalis",
        "paradoxical",
        "formulation",
        "mo",
        "order",
        "see",
        "oneself",
        "situated",
        "within",
        "given",
        "historical",
        "intersubjective",
        "context",
        "history",
        "fully",
        "objectivized",
        "w",
        "e",
        "related",
        "part",
        "universeas",
        "future",
        "time",
        "past",
        "mo",
        "understanding",
        "history",
        "thus",
        "matter",
        "selfunderstanding",
        "however",
        "enlightenment",
        "celebration",
        "novelty",
        "progress",
        "history",
        "reduced",
        "catalogue",
        "mistake",
        "left",
        "behind",
        "favor",
        "mature",
        "comprehension",
        "reality",
        "past",
        "present",
        "novalis",
        "view",
        "philosophical",
        "romanticism",
        "must",
        "take",
        "responsibility",
        "overthrowingat",
        "metaphilosophical",
        "well",
        "historicalempirical",
        "levelsuch",
        "ahistorical",
        "concept",
        "history",
        "thus",
        "emphasis",
        "bildung",
        "involves",
        "reassessment",
        "self",
        "involves",
        "recognizing",
        "self",
        "fundamentally",
        "situated",
        "tradition",
        "also",
        "tradition",
        "implies",
        "first",
        "view",
        "tradition",
        "extends",
        "present",
        "second",
        "claim",
        "order",
        "gain",
        "understanding",
        "history",
        "hence",
        "also",
        "interpreter",
        "time",
        "historical",
        "expression",
        "judged",
        "criterion",
        "present",
        "seen",
        "within",
        "context",
        "cultural",
        "political",
        "religious",
        "novalis",
        "classical",
        "world",
        "speak",
        "modernity",
        "different",
        "yet",
        "fundamental",
        "part",
        "furthermore",
        "modern",
        "cultureand",
        "see",
        "trace",
        "novalis",
        "turn",
        "towards",
        "cosmopolitan",
        "spirit",
        "hanseatic",
        "leagueunderstands",
        "critical",
        "interaction",
        "culture",
        "including",
        "nonwestern",
        "world",
        "temporally",
        "distant",
        "part",
        "interpreter",
        "culture",
        "reflection",
        "goethe",
        "novalis",
        "writes",
        "spirit",
        "nature",
        "strives",
        "absorb",
        "understand",
        "process",
        "expanding",
        "one",
        "horizon",
        "considering",
        "point",
        "view",
        "one",
        "time",
        "nature",
        "ultimate",
        "goal",
        "bildung",
        "kant",
        "study",
        "enterprise",
        "presented",
        "along",
        "line",
        "kantian",
        "anthropology",
        "theory",
        "cause",
        "remedy",
        "prejudice",
        "k",
        "emphasis",
        "understanding",
        "others",
        "involve",
        "relativization",
        "history",
        "intercultural",
        "understanding",
        "like",
        "schleiermacher",
        "schlegel",
        "novalis",
        "take",
        "strong",
        "interest",
        "philology",
        "demand",
        "every",
        "author",
        "reader",
        "must",
        "philologically",
        "minded",
        "teplitz",
        "fragment",
        "philology",
        "romantic",
        "philosopher",
        "among",
        "thing",
        "reader",
        "taking",
        "account",
        "original",
        "context",
        "text",
        "produced",
        "hence",
        "according",
        "novalis",
        "p",
        "hilologizing",
        "true",
        "scholarly",
        "occupation",
        "corresponds",
        "experimenting",
        "ab",
        "philologizingand",
        "note",
        "case",
        "philosophizing",
        "active",
        "form",
        "philologisiren",
        "reference",
        "experimentingis",
        "breaking",
        "illegitimate",
        "prejudice",
        "trying",
        "understand",
        "symbolic",
        "expression",
        "term",
        "rather",
        "reducing",
        "familiar",
        "position",
        "would",
        "minimize",
        "capacity",
        "challenge",
        "reader",
        "system",
        "belief",
        "value",
        "conceived",
        "way",
        "philology",
        "challenge",
        "every",
        "scholastic",
        "passing",
        "authoritative",
        "interpretation",
        "curb",
        "threat",
        "dead",
        "letter",
        "counteracts",
        "tendency",
        "modern",
        "society",
        "steward",
        "tradition",
        "formalistic",
        "way",
        "overlook",
        "meaning",
        "hieroglyph",
        "novalis",
        "one",
        "point",
        "put",
        "spirit",
        "enlightenment",
        "wish",
        "challenge",
        "critically",
        "reflect",
        "prejudice",
        "handed",
        "tradition",
        "unlike",
        "enlightenment",
        "philosophersat",
        "least",
        "undialectical",
        "championing",
        "progressnovalis",
        "belief",
        "past",
        "offer",
        "resource",
        "criticalreflexive",
        "discussion",
        "stance",
        "towards",
        "present",
        "sense",
        "novalis",
        "claim",
        "theory",
        "future",
        "belongs",
        "history",
        "ab",
        "even",
        "past",
        "immediately",
        "retrieved",
        "even",
        "neither",
        "desirable",
        "rational",
        "long",
        "revival",
        "time",
        "long",
        "gone",
        "past",
        "providing",
        "alternative",
        "intellectual",
        "framework",
        "present",
        "aid",
        "philosopher",
        "artist",
        "scientist",
        "politician",
        "developing",
        "critical",
        "attitude",
        "belief",
        "assumption",
        "previously",
        "left",
        "unanalyzed",
        "past",
        "word",
        "reconstructed",
        "term",
        "precisely",
        "reconstruction",
        "novalis",
        "argues",
        "ensure",
        "relevance",
        "present",
        "entirely",
        "crucial",
        "romantic",
        "concept",
        "bildung",
        "idea",
        "philology",
        "related",
        "return",
        "classical",
        "form",
        "fragment",
        "stake",
        "case",
        "awareness",
        "philosophy",
        "two",
        "way",
        "look",
        "thing",
        "downward",
        "upward",
        "roughly",
        "corresponding",
        "kant",
        "period",
        "addressed",
        "reflective",
        "determinative",
        "judgment",
        "herder",
        "drawing",
        "resource",
        "scottish",
        "enlightenment",
        "philosophy",
        "seen",
        "difference",
        "inductiveempirical",
        "deductivelyminded",
        "philosophy",
        "ultimately",
        "novalis",
        "identifies",
        "neverending",
        "process",
        "bildung",
        "philosophy",
        "philosophy",
        "novalis",
        "explains",
        "conversation",
        "oneself",
        "lfi",
        "one",
        "take",
        "place",
        "encounter",
        "thus",
        "decision",
        "philosophy",
        "challenge",
        "real",
        "self",
        "reflect",
        "awaken",
        "spirit",
        "lfi",
        "philosophy",
        "self",
        "capacity",
        "take",
        "responsibility",
        "end",
        "day",
        "l",
        "ife",
        "must",
        "novel",
        "given",
        "u",
        "one",
        "made",
        "u",
        "lfi"
    ]
}