{
    "main_text": "Moral Rights and Side-Constraints || The Foundation of Rights\n2.2 The Foundation of Rights\n\nIt is a commonplace to say that in ASU Nozick provides no\nfoundation for his affirmation of such Lockean natural rights (Nagel\n1975). And, not many pages after Nozick proclaims these rights, he\nhimself points out that his book provides no “precise theory of\nthe moral basis of individual rights” (xiv). Nevertheless,\nNozick does have important things to say about the underpinning of\nthese rights and about their deontic character and their stringency.\nIndeed, it is striking that, when Nozick seeks to motivate his opening\naffirmation of rights, he starts with the same understanding and\ncritique of utilitarianism that Rawls offers in A Theory of\nJustice when Rawls begins to motivate his contractarian doctrine.\nWhat separates Nozick from Rawls at this very basic level is a\ndifference in their construal of the implications of this common\ncritique. Nozick may, in this way, offer as much of a foundation for\nadopting his natural rights stance as Rawls offers in A Theory of\nJustice for adopting his contractarian stance.\n\nAs is well known, Rawls starts by ascribing to the utilitarian the\nclaim that the rationality of a certain principle of social choice can\nbe inferred from the rationality of a certain principle of individual\nchoice. The principle of individual choice is that, at least if no\nother party is affected, it is rational for an individual to incur\ncosts for herself (or to forego benefits for herself) if doing so will\nspare her greater costs (or provide her with greater benefits).\nAccording to Rawls, the utilitarian holds that by parity of reasoning\nit is rational for a member of society to incur costs for herself (or\nto forego benefits for herself) if doing so will spare any\nmember of society greater costs (or provide any member of\nsociety with greater benefits). This is the purported rational\nprinciple of social choice. Thus, we get to the utilitarian conclusion\nthat each agent as a member of society has reason to maximize the\naggregate social good even at the expense of the individual good of\nherself (or others).\n\nAs is also well-known, Rawls rejects this reasoning on the grounds\nthat it does not take seriously the separateness and distinctness of\npersons. Persons are markedly more separate and distinct from one\nanother than are the different phases or time-slices of a given\nperson’s life. Because of this, one cannot proceed from its\nbeing worthwhile for a given person to incur costs for herself in\norder to spare herself greater costs to its being worthwhile for a\ngiven person as a member of society to incur costs for herself in\norder to spare any member of society greater costs. According to\nRawls, only if we conflate individuals—only if we mistakenly\nconceive of them as parts of a single person-like being, will the\nutilitarian principle of social choice be on a par with the principle\nof individual choice (Rawls 1971: 26–7).\n\nRawls summarizes his primary case against utilitarianism by\nsaying,\n\n\n… if we assume that the correct regulative principle for\nanything depends on the nature of that thing, and the plurality of\ndistinct persons with separate systems of ends is an essential feature\nof human societies, we should not expect the principles of social\nchoice to be utilitarian. (Rawls 1971: 29)\n\n\nThis summation goes well beyond the dismissal of the utilitarian\nregulative principle. For it strongly suggests a criterion for\nidentifying the correct regulative principle (or set of principles)\nfor the governance of social interaction. Such regulative principles\nmust differ significantly from the utilitarian principle by being\nresponsive to or reflective of the plurality of distinct persons with\nseparate systems of ends. We should note here that what is crucial is\nnot the bare normatively neutral fact that individuals have separate\nsystems of ends but, rather that individuals rationally seek to\npromote their own ends. It is the rational propriety of each\nperson’s pursuit her own good that basic regulative principles\nneed to be responsive to or reflect. Rawls then offers his crucial\ncontractarian construal of how regulative principles qualify as being\nresponsive to or reflective of the plurality of persons. According to\nRawls, they so qualify by being principles that all individuals\nconcerned with the promotion of their own systems of ends would agree\nto under circumstances suitable for such agreement.\n\nIt is striking that Nozick proceeds through a highly similar critical\ntreatment of utilitarianism when he asks why persons may not be\nviolated for the greater social good.\n\n\nIndividually, we each sometimes choose to undergo some pain or\nsacrifice for a greater benefit or to avoid a greater harm… In\neach case, some cost is borne for the sake of the greater overall\ngood. Why not, similarly, hold that some persons have to bear some\ncosts that benefit other persons more, for the sake of the overall\nsocial good? (ASU 32)\n\n\nNozick’s response to this question is,\n\n\nBut there is no social entity with a good that undergoes some\nsacrifice for its own good. There are only individual people,\ndifferent individual people, with their own individual lives. Using\none of these people for the benefit of others, uses him and benefits\nthe others. Nothing more. What happens is that something is done to\nhim for the sake of others. Talk of an overall social good covers this\nup. (32–3)\n\n\nHere Nozick makes things too easy for himself by ascribing to the\nutilitarian a belief in a social entity—as Rawls makes things\ntoo easy for himself by saying that the utilitarian argument depends\non fusing or conflating persons. For the utilitarian may simply hold\nthat the best explanation for the rationality of a given person\nincurring some cost for herself in order to avoid some greater cost\nfor herself is the unrestricted rationality of minimizing net costs\n(or maximizing net benefits). According to this utilitarian, we do not\nhave to move from the principle of individual choice to the principle\nof social choice. For, we start with the unrestricted rationality of\nminimizing costs (or maximizing benefits); and the principle of\nindividual choice is simply the application of that principle of\nsocial choice to the special case in which there is only one agent who\nis also the one subject of benefits and costs.\n\nTo counter the contention that, at the outset, practical rationality\ncalls for the minimization of net costs (or the maximization of net\nbenefits), Rawls and Nozick need to hold that what makes it\npractically rational for a given individual to incur some cost to\nherself (or forego some benefit for herself) is the\navoidance of some greater cost to herself (or the attainment\nof some greater benefit for herself). They need to hold that\n(at least absent further argument) the rational balancing of costs\nincurred (or benefits foregone) and costs avoided (or benefits\nattained) must take place within lives and not\nacross lives. And this does seem to be part of the intended force\nof Rawls’ invocation of a “plurality of distinct persons\nwith separate systems of\n ends”[6]\n and of Nozick’s insistence that there are “only\nindividual people, different individual people, with their own\nindividual lives” (33). In Nozick this stance is most explicit\nwhen he parses “the fact of our separate existences”\nas,\n\n\n… the fact that no moral balancing act can take place among us;\nthere is no moral outweighing of one of our lives by others so as to\nlead to a great overall social good. There is no justified sacrifice\nof some of us for others. (33)\n\n\nNote, however, that this last sentence is ambiguous. It may mean\nsimply that there is no moral balancing across individuals that\nrequires individuals to sacrifice for others or that justifies others\nin imposing such sacrifices. However, that sentence may also mean that\n“no one may be sacrificed for others” (33) in the sense\nthat those who impose such sacrifices wrong the individuals\nwho are subjected to those losses. That is, it may also mean that\nthere is (in Rawls’ terminology) a “correct regulative\nprinciple” that forbids and condemns the imposition of such\nsacrifices. It is clear that Nozick intends to assert this further\nclaim even though he does not explicitly recognize that it is a\nfurther and distinct proposition. For, according to Nozick, one will\nnot “sufficiently respect and take account of the fact that he\n[i.e., any given individual] is a separate person, that his is the\nonly life he has” (33) unless one morally condemns and eschews\nuses of that person—in particular, impositions of losses on that\nperson for the sake of (what purports to be) the social good.\n\nThe “fact of our separate existences” is “the fact\nthat that no moral balancing act can take place among us”\n(because costs and benefits add up within persons’ lives and not\nacross them). In contrast, the further fact that there are moral\nside-constraints against imposing sacrifices on some to serve the\ninterests of others is a reflection of the “fact of our\nseparate existences”. We come to the affirmation of those\nside-constraints when we sufficiently respect and take account of the\nseparateness of\n persons.[7]\n This is what Nozick must mean when he says that “The moral side\nconstraints upon what we may do… reflect the fact of our\nseparate existences” (33). The fact of our separate\nexistences—as Nozick parses that fact—is the morally\nimpressive fact about the nature of individuals that provides us with\nreason to be circumspect in our conduct toward one another. We respect\nor honor others as agents with rational ends of their own not by\npromoting their ends as we do our own but, rather, by not sacrificing\nthem to our ends.\n\nIf correct regulative principles for social interaction must\nsufficiently respect and take account of the plurality of distinct\npersons with separate systems of ends, those regulative principles\nmust not treat persons as means for the attainment of any (putatively)\nchoice-worthy social outcome. Regulative principles that endorse the\nuse of persons for the sake of (purportedly) choice-worthy social\noutcomes—e.g., the social outcome of there being a choice-worthy\ndistribution of goods among individuals—too much resemble the\nutilitarian regulative principle. They share the failure of the\nutilitarian principle to sufficiently respect and take account of the\nplurality of distinct persons with separate systems of ends. Thus,\nNozick contends, correct regulative principles must take the form of\nmoral side constraints upon what may be done to individuals even for\nthe sake of really valuable, choice-worthy social outcomes. Rawls\nreads the willingness of utilitarianism to impose losses on\nindividuals for the sake of the aggregate good as a mark of\nutilitarianism’s failure to recognize the status of individuals\nas ends-in-themselves and not merely means to the ends of others.\nNozick follows suit in appropriating this Kantian language (see Cohen\n1995: 238–243). But, contrary to Rawls, Nozick maintains that\nthe endorsement of the imposition of sacrifices on individuals for the\nsake of any (non-trivial) conception of the social\ngood—even, e.g., distribution-sensitive conceptions of the\nsocial good—fails to recognize the status of individuals as\n ends-in-themselves.[8]\n\nSo, Nozick offers very much the same type of argument for the\nexistence of some correct regulative principle for social\ninteraction as Rawls does in A Theory of Justice. The\ndifference is that Nozick does not hold that the mark of principles\nbeing responsive to or reflective of the fact of our separate\nexistences is that they would be agreed to by everyone under suitable\nagreement circumstances. Rather, he supposes that we can identify\ntypes of treatment of persons as not sufficiently respecting and\ntaking account of the rationality of individuals pursuing of their own\ngood without having to appeal to any actual or hypothetical agreement.\nIn particular, the imposition of sacrifices upon individuals does not\nsufficiently take account of their being agents who rationally pursue\ntheir own systems of ends. The key “moral content gotten by this\nargument which focuses upon the fact that there are distinct\nindividuals each with his own life to lead” is that\n“sacrificing one person to benefit another” is morally\nprohibited (34).\n",
    "section_title": "2.2 The Foundation of Rights",
    "entry_title": "Robert Nozick’s Political Philosophy",
    "hierarchy_title": "Robert Nozick’s Political Philosophy || Moral Rights and Side-Constraints || The Foundation of Rights",
    "tokenized_text": [
        "moral",
        "right",
        "sideconstraints",
        "foundation",
        "right",
        "foundation",
        "right",
        "commonplace",
        "say",
        "asu",
        "nozick",
        "provides",
        "foundation",
        "affirmation",
        "lockean",
        "natural",
        "right",
        "nagel",
        "many",
        "page",
        "nozick",
        "proclaims",
        "right",
        "point",
        "book",
        "provides",
        "precise",
        "theory",
        "moral",
        "basis",
        "individual",
        "right",
        "xiv",
        "nevertheless",
        "nozick",
        "important",
        "thing",
        "say",
        "underpinning",
        "right",
        "deontic",
        "character",
        "stringency",
        "indeed",
        "striking",
        "nozick",
        "seek",
        "motivate",
        "opening",
        "affirmation",
        "right",
        "start",
        "understanding",
        "critique",
        "utilitarianism",
        "rawls",
        "offer",
        "theory",
        "justice",
        "rawls",
        "begin",
        "motivate",
        "contractarian",
        "doctrine",
        "separate",
        "nozick",
        "rawls",
        "basic",
        "level",
        "difference",
        "construal",
        "implication",
        "common",
        "critique",
        "nozick",
        "may",
        "way",
        "offer",
        "much",
        "foundation",
        "adopting",
        "natural",
        "right",
        "stance",
        "rawls",
        "offer",
        "theory",
        "justice",
        "adopting",
        "contractarian",
        "stance",
        "well",
        "known",
        "rawls",
        "start",
        "ascribing",
        "utilitarian",
        "claim",
        "rationality",
        "certain",
        "principle",
        "social",
        "choice",
        "inferred",
        "rationality",
        "certain",
        "principle",
        "individual",
        "choice",
        "principle",
        "individual",
        "choice",
        "least",
        "party",
        "affected",
        "rational",
        "individual",
        "incur",
        "cost",
        "forego",
        "benefit",
        "spare",
        "greater",
        "cost",
        "provide",
        "greater",
        "benefit",
        "according",
        "rawls",
        "utilitarian",
        "hold",
        "parity",
        "reasoning",
        "rational",
        "member",
        "society",
        "incur",
        "cost",
        "forego",
        "benefit",
        "spare",
        "member",
        "society",
        "greater",
        "cost",
        "provide",
        "member",
        "society",
        "greater",
        "benefit",
        "purported",
        "rational",
        "principle",
        "social",
        "choice",
        "thus",
        "get",
        "utilitarian",
        "conclusion",
        "agent",
        "member",
        "society",
        "reason",
        "maximize",
        "aggregate",
        "social",
        "good",
        "even",
        "expense",
        "individual",
        "good",
        "others",
        "also",
        "wellknown",
        "rawls",
        "reject",
        "reasoning",
        "ground",
        "take",
        "seriously",
        "separateness",
        "distinctness",
        "person",
        "person",
        "markedly",
        "separate",
        "distinct",
        "one",
        "another",
        "different",
        "phase",
        "timeslices",
        "given",
        "person",
        "life",
        "one",
        "proceed",
        "worthwhile",
        "given",
        "person",
        "incur",
        "cost",
        "order",
        "spare",
        "greater",
        "cost",
        "worthwhile",
        "given",
        "person",
        "member",
        "society",
        "incur",
        "cost",
        "order",
        "spare",
        "member",
        "society",
        "greater",
        "cost",
        "according",
        "rawls",
        "conflate",
        "individualsonly",
        "mistakenly",
        "conceive",
        "part",
        "single",
        "personlike",
        "utilitarian",
        "principle",
        "social",
        "choice",
        "par",
        "principle",
        "individual",
        "choice",
        "rawls",
        "rawls",
        "summarizes",
        "primary",
        "case",
        "utilitarianism",
        "saying",
        "assume",
        "correct",
        "regulative",
        "principle",
        "anything",
        "depends",
        "nature",
        "thing",
        "plurality",
        "distinct",
        "person",
        "separate",
        "system",
        "end",
        "essential",
        "feature",
        "human",
        "society",
        "expect",
        "principle",
        "social",
        "choice",
        "utilitarian",
        "rawls",
        "summation",
        "go",
        "well",
        "beyond",
        "dismissal",
        "utilitarian",
        "regulative",
        "principle",
        "strongly",
        "suggests",
        "criterion",
        "identifying",
        "correct",
        "regulative",
        "principle",
        "set",
        "principle",
        "governance",
        "social",
        "interaction",
        "regulative",
        "principle",
        "must",
        "differ",
        "significantly",
        "utilitarian",
        "principle",
        "responsive",
        "reflective",
        "plurality",
        "distinct",
        "person",
        "separate",
        "system",
        "end",
        "note",
        "crucial",
        "bare",
        "normatively",
        "neutral",
        "fact",
        "individual",
        "separate",
        "system",
        "end",
        "rather",
        "individual",
        "rationally",
        "seek",
        "promote",
        "end",
        "rational",
        "propriety",
        "person",
        "pursuit",
        "good",
        "basic",
        "regulative",
        "principle",
        "need",
        "responsive",
        "reflect",
        "rawls",
        "offer",
        "crucial",
        "contractarian",
        "construal",
        "regulative",
        "principle",
        "qualify",
        "responsive",
        "reflective",
        "plurality",
        "person",
        "according",
        "rawls",
        "qualify",
        "principle",
        "individual",
        "concerned",
        "promotion",
        "system",
        "end",
        "would",
        "agree",
        "circumstance",
        "suitable",
        "agreement",
        "striking",
        "nozick",
        "proceeds",
        "highly",
        "similar",
        "critical",
        "treatment",
        "utilitarianism",
        "asks",
        "person",
        "may",
        "violated",
        "greater",
        "social",
        "good",
        "individually",
        "sometimes",
        "choose",
        "undergo",
        "pain",
        "sacrifice",
        "greater",
        "benefit",
        "avoid",
        "greater",
        "harm",
        "case",
        "cost",
        "borne",
        "sake",
        "greater",
        "overall",
        "good",
        "similarly",
        "hold",
        "person",
        "bear",
        "cost",
        "benefit",
        "person",
        "sake",
        "overall",
        "social",
        "good",
        "asu",
        "nozick",
        "response",
        "question",
        "social",
        "entity",
        "good",
        "undergoes",
        "sacrifice",
        "good",
        "individual",
        "people",
        "different",
        "individual",
        "people",
        "individual",
        "life",
        "using",
        "one",
        "people",
        "benefit",
        "others",
        "us",
        "benefit",
        "others",
        "nothing",
        "happens",
        "something",
        "done",
        "sake",
        "others",
        "talk",
        "overall",
        "social",
        "good",
        "cover",
        "nozick",
        "make",
        "thing",
        "easy",
        "ascribing",
        "utilitarian",
        "belief",
        "social",
        "entityas",
        "rawls",
        "make",
        "thing",
        "easy",
        "saying",
        "utilitarian",
        "argument",
        "depends",
        "fusing",
        "conflating",
        "person",
        "utilitarian",
        "may",
        "simply",
        "hold",
        "best",
        "explanation",
        "rationality",
        "given",
        "person",
        "incurring",
        "cost",
        "order",
        "avoid",
        "greater",
        "cost",
        "unrestricted",
        "rationality",
        "minimizing",
        "net",
        "cost",
        "maximizing",
        "net",
        "benefit",
        "according",
        "utilitarian",
        "move",
        "principle",
        "individual",
        "choice",
        "principle",
        "social",
        "choice",
        "start",
        "unrestricted",
        "rationality",
        "minimizing",
        "cost",
        "maximizing",
        "benefit",
        "principle",
        "individual",
        "choice",
        "simply",
        "application",
        "principle",
        "social",
        "choice",
        "special",
        "case",
        "one",
        "agent",
        "also",
        "one",
        "subject",
        "benefit",
        "cost",
        "counter",
        "contention",
        "outset",
        "practical",
        "rationality",
        "call",
        "minimization",
        "net",
        "cost",
        "maximization",
        "net",
        "benefit",
        "rawls",
        "nozick",
        "need",
        "hold",
        "make",
        "practically",
        "rational",
        "given",
        "individual",
        "incur",
        "cost",
        "forego",
        "benefit",
        "avoidance",
        "greater",
        "cost",
        "attainment",
        "greater",
        "benefit",
        "need",
        "hold",
        "least",
        "absent",
        "argument",
        "rational",
        "balancing",
        "cost",
        "incurred",
        "benefit",
        "foregone",
        "cost",
        "avoided",
        "benefit",
        "attained",
        "must",
        "take",
        "place",
        "within",
        "life",
        "across",
        "life",
        "seem",
        "part",
        "intended",
        "force",
        "rawls",
        "invocation",
        "plurality",
        "distinct",
        "person",
        "separate",
        "system",
        "end",
        "nozick",
        "insistence",
        "individual",
        "people",
        "different",
        "individual",
        "people",
        "individual",
        "life",
        "nozick",
        "stance",
        "explicit",
        "par",
        "fact",
        "separate",
        "existence",
        "fact",
        "moral",
        "balancing",
        "act",
        "take",
        "place",
        "among",
        "u",
        "moral",
        "outweighing",
        "one",
        "life",
        "others",
        "lead",
        "great",
        "overall",
        "social",
        "good",
        "justified",
        "sacrifice",
        "u",
        "others",
        "note",
        "however",
        "last",
        "sentence",
        "ambiguous",
        "may",
        "mean",
        "simply",
        "moral",
        "balancing",
        "across",
        "individual",
        "requires",
        "individual",
        "sacrifice",
        "others",
        "justifies",
        "others",
        "imposing",
        "sacrifice",
        "however",
        "sentence",
        "may",
        "also",
        "mean",
        "one",
        "may",
        "sacrificed",
        "others",
        "sense",
        "impose",
        "sacrifice",
        "wrong",
        "individual",
        "subjected",
        "loss",
        "may",
        "also",
        "mean",
        "rawls",
        "terminology",
        "correct",
        "regulative",
        "principle",
        "forbids",
        "condemns",
        "imposition",
        "sacrifice",
        "clear",
        "nozick",
        "intends",
        "assert",
        "claim",
        "even",
        "though",
        "explicitly",
        "recognize",
        "distinct",
        "proposition",
        "according",
        "nozick",
        "one",
        "sufficiently",
        "respect",
        "take",
        "account",
        "fact",
        "ie",
        "given",
        "individual",
        "separate",
        "person",
        "life",
        "unless",
        "one",
        "morally",
        "condemns",
        "eschews",
        "us",
        "personin",
        "particular",
        "imposition",
        "loss",
        "person",
        "sake",
        "purport",
        "social",
        "good",
        "fact",
        "separate",
        "existence",
        "fact",
        "moral",
        "balancing",
        "act",
        "take",
        "place",
        "among",
        "u",
        "cost",
        "benefit",
        "add",
        "within",
        "person",
        "life",
        "across",
        "contrast",
        "fact",
        "moral",
        "sideconstraints",
        "imposing",
        "sacrifice",
        "serve",
        "interest",
        "others",
        "reflection",
        "fact",
        "separate",
        "existence",
        "come",
        "affirmation",
        "sideconstraints",
        "sufficiently",
        "respect",
        "take",
        "account",
        "separateness",
        "person",
        "nozick",
        "must",
        "mean",
        "say",
        "moral",
        "side",
        "constraint",
        "upon",
        "may",
        "do",
        "reflect",
        "fact",
        "separate",
        "existence",
        "fact",
        "separate",
        "existencesas",
        "nozick",
        "par",
        "factis",
        "morally",
        "impressive",
        "fact",
        "nature",
        "individual",
        "provides",
        "u",
        "reason",
        "circumspect",
        "conduct",
        "toward",
        "one",
        "another",
        "respect",
        "honor",
        "others",
        "agent",
        "rational",
        "end",
        "promoting",
        "end",
        "rather",
        "sacrificing",
        "end",
        "correct",
        "regulative",
        "principle",
        "social",
        "interaction",
        "must",
        "sufficiently",
        "respect",
        "take",
        "account",
        "plurality",
        "distinct",
        "person",
        "separate",
        "system",
        "end",
        "regulative",
        "principle",
        "must",
        "treat",
        "person",
        "mean",
        "attainment",
        "putatively",
        "choiceworthy",
        "social",
        "outcome",
        "regulative",
        "principle",
        "endorse",
        "use",
        "person",
        "sake",
        "purportedly",
        "choiceworthy",
        "social",
        "outcomeseg",
        "social",
        "outcome",
        "choiceworthy",
        "distribution",
        "good",
        "among",
        "individualstoo",
        "much",
        "resemble",
        "utilitarian",
        "regulative",
        "principle",
        "share",
        "failure",
        "utilitarian",
        "principle",
        "sufficiently",
        "respect",
        "take",
        "account",
        "plurality",
        "distinct",
        "person",
        "separate",
        "system",
        "end",
        "thus",
        "nozick",
        "contends",
        "correct",
        "regulative",
        "principle",
        "must",
        "take",
        "form",
        "moral",
        "side",
        "constraint",
        "upon",
        "may",
        "done",
        "individual",
        "even",
        "sake",
        "really",
        "valuable",
        "choiceworthy",
        "social",
        "outcome",
        "rawls",
        "read",
        "willingness",
        "utilitarianism",
        "impose",
        "loss",
        "individual",
        "sake",
        "aggregate",
        "good",
        "mark",
        "utilitarianism",
        "failure",
        "recognize",
        "status",
        "individual",
        "endsinthemselves",
        "merely",
        "mean",
        "end",
        "others",
        "nozick",
        "follows",
        "suit",
        "appropriating",
        "kantian",
        "language",
        "see",
        "cohen",
        "contrary",
        "rawls",
        "nozick",
        "maintains",
        "endorsement",
        "imposition",
        "sacrifice",
        "individual",
        "sake",
        "nontrivial",
        "conception",
        "social",
        "goodeven",
        "eg",
        "distributionsensitive",
        "conception",
        "social",
        "goodfails",
        "recognize",
        "status",
        "individual",
        "endsinthemselves",
        "nozick",
        "offer",
        "much",
        "type",
        "argument",
        "existence",
        "correct",
        "regulative",
        "principle",
        "social",
        "interaction",
        "rawls",
        "theory",
        "justice",
        "difference",
        "nozick",
        "hold",
        "mark",
        "principle",
        "responsive",
        "reflective",
        "fact",
        "separate",
        "existence",
        "would",
        "agreed",
        "everyone",
        "suitable",
        "agreement",
        "circumstance",
        "rather",
        "supposes",
        "identify",
        "type",
        "treatment",
        "person",
        "sufficiently",
        "respecting",
        "taking",
        "account",
        "rationality",
        "individual",
        "pursuing",
        "good",
        "without",
        "appeal",
        "actual",
        "hypothetical",
        "agreement",
        "particular",
        "imposition",
        "sacrifice",
        "upon",
        "individual",
        "sufficiently",
        "take",
        "account",
        "agent",
        "rationally",
        "pursue",
        "system",
        "end",
        "key",
        "moral",
        "content",
        "gotten",
        "argument",
        "focus",
        "upon",
        "fact",
        "distinct",
        "individual",
        "life",
        "lead",
        "sacrificing",
        "one",
        "person",
        "benefit",
        "another",
        "morally",
        "prohibited"
    ]
}