{
    "main_text": "Utopia || The Framework as Discovery Procedure\n5.1 The Framework as Discovery Procedure\n\nThe framework is—or, more precisely, sustains—a discovery\nprocedure. Under the protective umbrella of the framework, individuals\nare presented with and can try out diverse communities while\ncommunities themselves arise and modify themselves in their\ncompetitive search to sustain, improve, or increase their membership.\nA wide range of communities will continually arise out of and in\nresponse to the evolving perceptions that diverse individuals will\nhave about what modes of sociality will best suit them and will best\nattract welcome partners. Communities will survive and perhaps expand\nor be imitated insofar as they actually embody modes of relationship\nthat serve well their actual or prospective membership or insofar as\nthey successfully refine their offerings in the market place of\ncommunities. The framework also insures that those who are already\nconfident that they know what sort of community is best for them will\nbe free to form those communities by voluntary subscription and,\nthereby, to manifest their actual value (or disvalue) to themselves\nand to other seekers of well-being.\n\nPart of Nozick’s sub-text here is a message to socialist\nutopians that nothing in the framework (or the minimal state)\nprecludes their non-coercive pursuit of their ideal communities. How,\ntherefore, can socialists object to the framework (or the minimal\nstate)? This generalizes Nozick’s earlier claims in ASU\nthat that advocates of meaningful work and workers’ control of\nproductive enterprises ought not to be hostile to the minimal state\nsince the minimal state is fully tolerant of non-coercive endeavors to\nestablish such conditions (246–253).\n\nIn a short essay in Reason magazine published four years\nafter ASU, Nozick asked, “Who Would Choose\nSocialism?” (Nozick 1978). More precisely, his question was:\nWhat percent of the adult population would choose “to\nparticipate in socialist interpersonal relations of equality and\ncommunity” were they in position to choose between “a\nreasonably attractive socialist option and also a reasonably\nattractive non-socialist one?” (Nozick 1978: 277). Nozick takes\nthe choice available to Israelis between membership and non-membership\nin kibbutzim to be a good instance of a choice between such options\nand notes that around six percent of the adult population of Israel in\nthe 1970s had chosen the socialist option. He speculates that\nsocialists are at least “tempted” to be imperialists,\ni.e., to impose on everyone one their own vision of utopia, precisely\nbecause they sense that there will be too few volunteers (Nozick 1978:\n279).\n\nThe discovery procedure that the framework sustains is a version of\nMillian experiments in living—albeit it is a version that places\nmuch more emphasis on the role of a marketplace of communities in\nproviding individuals with experimental options. This discovery\nprocedure (like Millian experiments in living) is, of course, a\nHayekian invisible hand process. Given the enormous diversity among\nindividuals, we do not know what one form of community would be\nbest.\n\n\nThe idea that there is one best composite answer to all of these\nquestions [about what features utopia has], one best society for\neveryone to live in, seems to me to be an incredible one. (And the\nidea that, if there is one, we now know enough to describe it is even\nmore incredible.) (311)\n\n\nNor do we know what distinct modes of community would be best for\ndistinct types of persons. Thus, we cannot design an inclusive utopia;\nnor can we design an array of mini-utopia such that some significantly\nfulfilling community will be available to everyone—or even to\nmost.\n\n\nIt is helpful to imagine cavemen sitting together to think up what,\nfor all time, will be the best possible society and then setting out\nto institute it. Do none of the reasons that make you smile at this\napply to us? (313–314)\n\n\nGiven our ignorance, the best way to realize utopia—almost\ncertainly many distinct utopia—is through the discovery\nprocedure that the framework sustains. (We should note, however, an\nimplicit, somewhat puzzling, and wholly unnecessary presupposition of\nNozick’s discussion, viz, that individuals with utopian\naspirations will generally seek out communities that are made up of\nother individuals like themselves. The suggestion is that chosen\ncommunities will be internally homogeneous with heterogeneity existing\nonly across these communities.)\n5.2. An Independent Route to the Minimal State\n\nThe role of the framework in sustaining a discovery procedure brings\nus to the second main purpose of “Utopia”. This is the\nprovision of an independent vindication of the minimal state—one\nthat specifically does not depend on “the moral arguments for\nindividual liberty” (309 footnote*) offered in Parts I and II of\nAnarchy, State, and Utopia. Although the activities of the\nframework are described in terms of protecting the rights that are\naffirmed in early parts of the book, the utopian advocacy of the\nframework does not rely upon the validity of those rights. Rather,\nthat advocacy turns on a general endorsement of utopian aspiration\ncombined with the core epistemic claim that, given our ignorance, the\nonly sensible route to utopia is the discovery procedure that the\nframework sustains.\n\nThere is, however, an apparent problem with Nozick’s\nindependence claim. Nozick distinguishes among three sorts of\nutopians. There are “existential utopians” who have a\nparticular utopia in mind for themselves and others who will be drawn\nto it but have no problem with yet others being drawn to different\nutopia. There are “missionary utopians” who hope “to\npersuade or convince everyone to live in one particular kind of\ncommunity, but will not force them to do so”. And there are\n“imperialistic utopians” who countenance “the\nforcing of everyone into one pattern of community”\n(319–320). While existential utopians will embrace the framework\nand missionary utopians will (less heartily) support it, imperialistic\n“will oppose the framework as long as some others do not agree\nwith them” (320). Nozick’s response to the imperialist is\nto say “Well you can’t satisfy everyone, especially if\nthere are those who will be dissatisfied unless not everybody is\nsatisfied” (320). The suggestion—never explicitly stated\nby Nozick—is that the imperialist pursuit of utopia is to be\nsuppressed by the framework precisely because it is\nimpermissibly coercive. But, if so, the justification for\nthis crucial operation of the framework must appeal to some of\n“the moral arguments for individual liberty” from which\nNozick wants his utopia argument to be independent.\n\nHowever, Nozick may be able to escape from this problem by emphasizing\nthat imperialists are being excluded on epistemic rather than moral\ngrounds. The question is, on what procedures will epistemically\nsensible utopians—utopians with a due appreciation for the\ndifficulties involved in identifying and instituting\nutopia—converge? And the answer is, on the processes of\nvoluntary association and dissociation and adjustment that the\nframework aims to sustain. Imperialist utopian coercion is simply not\npart of the process that all utopians have reason to favor because of\nits epistemic fecundity. Moreover, the operation of the framework does\nnot preclude the establishment—for some people or for\nall—of the mode of community favored by any\nutopian.\n\n\nSince any particular community may be established within the\nframework, it is compatible with all particular utopian visions, while\nguaranteeing none. (320)\n\n\nAny utopian who wants her (current) vision to be guaranteed by being\nforced upon others has good epistemic reasons to shed that desire.\n\nStill, it might be maintained that the most informative discovery\nprocedure is one that embodies no-holds-barred competition among\ncommunities. For surely we want to know which communities or\nassociations of communities, if any, will be capable of defending\nthemselves against the imperialists. Since it seems that the most\ninformative discovery procedure would not exclude imperialist\nutopians, it seems that the real basis for the exclusion of\nimperialists must be moral. Hence, it appears that their exclusion\ndoes undercut Nozick’s goal of providing an independent\nvindication of the minimal state.\n\nHowever, this problem also may be just a matter of appearance. After\nall, the framework proposed by Nozick does not exclude imperialists in\nthe sense of stipulating their non-existence. Rather, one of the core\nroles of the framework is precisely to protect non-imperialists and\ntheir voluntary modes of association and dissociation from those\nepistemically short-sighted, albeit still existing, imperialists. The\noperation of the framework should, therefore, be seen as a two-level\ndiscovery procedure. On one level it operates as Nozick explicitly\ndescribes—as a competitive market place of communities serving\nindividuals who are becoming more informed about their taste for\ncommunity. However, on another level, the operation of the framework\nis a procedure through which non-imperialist communities and\nnon-imperialist individuals who do not enter any utopian community\ndiscover how, if at all, they can cooperate in maintaining and\noperating the framework so as to protect themselves and their\nepistemic quest from the imperialists.",
    "section_title": "5.1 The Framework as Discovery Procedure",
    "entry_title": "Robert Nozick’s Political Philosophy",
    "hierarchy_title": "Robert Nozick’s Political Philosophy || Utopia || The Framework as Discovery Procedure",
    "tokenized_text": [
        "utopia",
        "framework",
        "discovery",
        "procedure",
        "framework",
        "discovery",
        "procedure",
        "framework",
        "isor",
        "precisely",
        "sustainsa",
        "discovery",
        "procedure",
        "protective",
        "umbrella",
        "framework",
        "individual",
        "presented",
        "try",
        "diverse",
        "community",
        "community",
        "arise",
        "modify",
        "competitive",
        "search",
        "sustain",
        "improve",
        "increase",
        "membership",
        "wide",
        "range",
        "community",
        "continually",
        "arise",
        "response",
        "evolving",
        "perception",
        "diverse",
        "individual",
        "mode",
        "sociality",
        "best",
        "suit",
        "best",
        "attract",
        "welcome",
        "partner",
        "community",
        "survive",
        "perhaps",
        "expand",
        "imitated",
        "insofar",
        "actually",
        "embody",
        "mode",
        "relationship",
        "serve",
        "well",
        "actual",
        "prospective",
        "membership",
        "insofar",
        "successfully",
        "refine",
        "offering",
        "market",
        "place",
        "community",
        "framework",
        "also",
        "insures",
        "already",
        "confident",
        "know",
        "sort",
        "community",
        "best",
        "free",
        "form",
        "community",
        "voluntary",
        "subscription",
        "thereby",
        "manifest",
        "actual",
        "value",
        "disvalue",
        "seeker",
        "wellbeing",
        "part",
        "nozick",
        "subtext",
        "message",
        "socialist",
        "utopian",
        "nothing",
        "framework",
        "minimal",
        "state",
        "precludes",
        "noncoercive",
        "pursuit",
        "ideal",
        "community",
        "therefore",
        "socialist",
        "object",
        "framework",
        "minimal",
        "state",
        "generalizes",
        "nozick",
        "earlier",
        "claim",
        "asu",
        "advocate",
        "meaningful",
        "work",
        "worker",
        "control",
        "productive",
        "enterprise",
        "ought",
        "hostile",
        "minimal",
        "state",
        "since",
        "minimal",
        "state",
        "fully",
        "tolerant",
        "noncoercive",
        "endeavor",
        "establish",
        "condition",
        "short",
        "essay",
        "reason",
        "magazine",
        "published",
        "four",
        "year",
        "asu",
        "nozick",
        "asked",
        "would",
        "choose",
        "socialism",
        "nozick",
        "precisely",
        "question",
        "percent",
        "adult",
        "population",
        "would",
        "choose",
        "participate",
        "socialist",
        "interpersonal",
        "relation",
        "equality",
        "community",
        "position",
        "choose",
        "reasonably",
        "attractive",
        "socialist",
        "option",
        "also",
        "reasonably",
        "attractive",
        "nonsocialist",
        "one",
        "nozick",
        "nozick",
        "take",
        "choice",
        "available",
        "israeli",
        "membership",
        "nonmembership",
        "kibbutz",
        "good",
        "instance",
        "choice",
        "option",
        "note",
        "around",
        "six",
        "percent",
        "adult",
        "population",
        "israel",
        "s",
        "chosen",
        "socialist",
        "option",
        "speculates",
        "socialist",
        "least",
        "tempted",
        "imperialist",
        "ie",
        "impose",
        "everyone",
        "one",
        "vision",
        "utopia",
        "precisely",
        "sense",
        "volunteer",
        "nozick",
        "discovery",
        "procedure",
        "framework",
        "sustains",
        "version",
        "millian",
        "experiment",
        "livingalbeit",
        "version",
        "place",
        "much",
        "emphasis",
        "role",
        "marketplace",
        "community",
        "providing",
        "individual",
        "experimental",
        "option",
        "discovery",
        "procedure",
        "like",
        "millian",
        "experiment",
        "living",
        "course",
        "hayekian",
        "invisible",
        "hand",
        "process",
        "given",
        "enormous",
        "diversity",
        "among",
        "individual",
        "know",
        "one",
        "form",
        "community",
        "would",
        "best",
        "idea",
        "one",
        "best",
        "composite",
        "answer",
        "question",
        "feature",
        "utopia",
        "one",
        "best",
        "society",
        "everyone",
        "live",
        "seems",
        "incredible",
        "one",
        "idea",
        "one",
        "know",
        "enough",
        "describe",
        "even",
        "incredible",
        "know",
        "distinct",
        "mode",
        "community",
        "would",
        "best",
        "distinct",
        "type",
        "person",
        "thus",
        "design",
        "inclusive",
        "utopia",
        "design",
        "array",
        "miniutopia",
        "significantly",
        "fulfilling",
        "community",
        "available",
        "everyoneor",
        "even",
        "helpful",
        "imagine",
        "caveman",
        "sitting",
        "together",
        "think",
        "time",
        "best",
        "possible",
        "society",
        "setting",
        "institute",
        "none",
        "reason",
        "make",
        "smile",
        "apply",
        "u",
        "given",
        "ignorance",
        "best",
        "way",
        "realize",
        "utopiaalmost",
        "certainly",
        "many",
        "distinct",
        "utopiais",
        "discovery",
        "procedure",
        "framework",
        "sustains",
        "note",
        "however",
        "implicit",
        "somewhat",
        "puzzling",
        "wholly",
        "unnecessary",
        "presupposition",
        "nozick",
        "discussion",
        "viz",
        "individual",
        "utopian",
        "aspiration",
        "generally",
        "seek",
        "community",
        "made",
        "individual",
        "like",
        "suggestion",
        "chosen",
        "community",
        "internally",
        "homogeneous",
        "heterogeneity",
        "existing",
        "across",
        "community",
        "independent",
        "route",
        "minimal",
        "state",
        "role",
        "framework",
        "sustaining",
        "discovery",
        "procedure",
        "brings",
        "u",
        "second",
        "main",
        "purpose",
        "utopia",
        "provision",
        "independent",
        "vindication",
        "minimal",
        "stateone",
        "specifically",
        "depend",
        "moral",
        "argument",
        "individual",
        "liberty",
        "footnote",
        "offered",
        "part",
        "ii",
        "anarchy",
        "state",
        "utopia",
        "although",
        "activity",
        "framework",
        "described",
        "term",
        "protecting",
        "right",
        "affirmed",
        "early",
        "part",
        "book",
        "utopian",
        "advocacy",
        "framework",
        "rely",
        "upon",
        "validity",
        "right",
        "rather",
        "advocacy",
        "turn",
        "general",
        "endorsement",
        "utopian",
        "aspiration",
        "combined",
        "core",
        "epistemic",
        "claim",
        "given",
        "ignorance",
        "sensible",
        "route",
        "utopia",
        "discovery",
        "procedure",
        "framework",
        "sustains",
        "however",
        "apparent",
        "problem",
        "nozick",
        "independence",
        "claim",
        "nozick",
        "distinguishes",
        "among",
        "three",
        "sort",
        "utopian",
        "existential",
        "utopian",
        "particular",
        "utopia",
        "mind",
        "others",
        "drawn",
        "problem",
        "yet",
        "others",
        "drawn",
        "different",
        "utopia",
        "missionary",
        "utopian",
        "hope",
        "persuade",
        "convince",
        "everyone",
        "live",
        "one",
        "particular",
        "kind",
        "community",
        "force",
        "imperialistic",
        "utopian",
        "countenance",
        "forcing",
        "everyone",
        "one",
        "pattern",
        "community",
        "existential",
        "utopian",
        "embrace",
        "framework",
        "missionary",
        "utopian",
        "le",
        "heartily",
        "support",
        "imperialistic",
        "oppose",
        "framework",
        "long",
        "others",
        "agree",
        "nozick",
        "response",
        "imperialist",
        "say",
        "well",
        "satisfy",
        "everyone",
        "especially",
        "dissatisfied",
        "unless",
        "everybody",
        "satisfied",
        "suggestionnever",
        "explicitly",
        "stated",
        "nozickis",
        "imperialist",
        "pursuit",
        "utopia",
        "suppressed",
        "framework",
        "precisely",
        "impermissibly",
        "coercive",
        "justification",
        "crucial",
        "operation",
        "framework",
        "must",
        "appeal",
        "moral",
        "argument",
        "individual",
        "liberty",
        "nozick",
        "want",
        "utopia",
        "argument",
        "independent",
        "however",
        "nozick",
        "may",
        "able",
        "escape",
        "problem",
        "emphasizing",
        "imperialist",
        "excluded",
        "epistemic",
        "rather",
        "moral",
        "ground",
        "question",
        "procedure",
        "epistemically",
        "sensible",
        "utopiansutopians",
        "due",
        "appreciation",
        "difficulty",
        "involved",
        "identifying",
        "instituting",
        "utopiaconverge",
        "answer",
        "process",
        "voluntary",
        "association",
        "dissociation",
        "adjustment",
        "framework",
        "aim",
        "sustain",
        "imperialist",
        "utopian",
        "coercion",
        "simply",
        "part",
        "process",
        "utopian",
        "reason",
        "favor",
        "epistemic",
        "fecundity",
        "moreover",
        "operation",
        "framework",
        "preclude",
        "establishmentfor",
        "people",
        "allof",
        "mode",
        "community",
        "favored",
        "utopian",
        "since",
        "particular",
        "community",
        "may",
        "established",
        "within",
        "framework",
        "compatible",
        "particular",
        "utopian",
        "vision",
        "guaranteeing",
        "none",
        "utopian",
        "want",
        "current",
        "vision",
        "guaranteed",
        "forced",
        "upon",
        "others",
        "good",
        "epistemic",
        "reason",
        "shed",
        "desire",
        "still",
        "might",
        "maintained",
        "informative",
        "discovery",
        "procedure",
        "one",
        "embodies",
        "noholdsbarred",
        "competition",
        "among",
        "community",
        "surely",
        "want",
        "know",
        "community",
        "association",
        "community",
        "capable",
        "defending",
        "imperialist",
        "since",
        "seems",
        "informative",
        "discovery",
        "procedure",
        "would",
        "exclude",
        "imperialist",
        "utopian",
        "seems",
        "real",
        "basis",
        "exclusion",
        "imperialist",
        "must",
        "moral",
        "hence",
        "appears",
        "exclusion",
        "undercut",
        "nozick",
        "goal",
        "providing",
        "independent",
        "vindication",
        "minimal",
        "state",
        "however",
        "problem",
        "also",
        "may",
        "matter",
        "appearance",
        "framework",
        "proposed",
        "nozick",
        "exclude",
        "imperialist",
        "sense",
        "stipulating",
        "nonexistence",
        "rather",
        "one",
        "core",
        "role",
        "framework",
        "precisely",
        "protect",
        "nonimperialists",
        "voluntary",
        "mode",
        "association",
        "dissociation",
        "epistemically",
        "shortsighted",
        "albeit",
        "still",
        "existing",
        "imperialist",
        "operation",
        "framework",
        "therefore",
        "seen",
        "twolevel",
        "discovery",
        "procedure",
        "one",
        "level",
        "operates",
        "nozick",
        "explicitly",
        "describesas",
        "competitive",
        "market",
        "place",
        "community",
        "serving",
        "individual",
        "becoming",
        "informed",
        "taste",
        "community",
        "however",
        "another",
        "level",
        "operation",
        "framework",
        "procedure",
        "nonimperialist",
        "community",
        "nonimperialist",
        "individual",
        "enter",
        "utopian",
        "community",
        "discover",
        "cooperate",
        "maintaining",
        "operating",
        "framework",
        "protect",
        "epistemic",
        "quest",
        "imperialist"
    ]
}