{
    "main_text": "Nature || What Objects Are\n3.2 What Objects Are\n\nSome think there’s more to being an object than playing a\nparticular theoretical role. On this view, what it is for something to\nbe an object is a matter of that thing’s intrinsic character or\nnature. One way of giving the intrinsic nature of a thing is by giving\na real definition. Says Dasgupta (2014), a real definition is:\n\n\na statement of what something is… For example, when one says\nthat {Socrates} is the unique singleton containing Socrates, one is\ndefining what the set is—that is, giving its real definition.\nOr, equivalently, one is stating its essence or nature… (2014:\n577)\n\n\nStatements of what something is—of a thing’s essence or\nnature—could take a variety of forms. One says what it is to be\nthat thing; the real definition of x might be put: to be\nx is to be y. Or the real definition of a category\nF: to be an F is to be a G. When one says,\n“To be a bachelor is to be an unmarried male”, one is\ngiving the real definition of bachelorhood.\n\nAnother way is to say what is essential to an object or category, as\nsuggested by Fine (1995): It is essential to x that Φ.\nOr, it is essential to Fs that Φ.\n\nIn any case, the task at hand is not to write a section about what it\nis to be a real definition, but rather how the notion relates to\nobject.\n\nIf one thinks real definitions best get at the nature of things, and\none is interested in stating the nature of object or of\nobjects, there are two options. One is to substitute for Φ in the\nfollowing: To be an object is to be Φ. The second is to substitute\nfor Φ in the following: It is essential to objects that Φ.\n\nNote the difference between this method and the method of giving\nnecessary and sufficient conditions: x is an object iff\nΦ. If one has a contrast class in mind, then presumably one can\nsubstitute for Φ the negation of that contrast class, e.g.,\n“x is an object iff x is not a\nproperty”. But that isn’t what it is to be an\nobject. A real definition demands more.\n\nOne might think that object doesn’t have a real\ndefinition. It may be that the contrast class (property, say)\nis a natural class, but object is not.\n\nOntologies—roughly, abstract and systematic catalogues of the\nkinds of things there are—divide on the question of how objects\nrelate to their properties. On constituent ontologies,\nproperties are parts or constituents or components of the objects that\nhave them or that they characterize (see entry on\n mereology).\n So on constituent ontologies, a tall tree has tall, somehow,\nas a part or constituent or component. On relational\nontologies, properties are not in any sense parts or constituents or\ncomponents of the objects that have them or that they characterize. So\non relational ontologies, though a tall tree bears an interesting\nrelationship to tall (perhaps it bears the\ninstantiation relation to that property), tall is\nnot among the tree’s various parts or constituents or\n components.[26]\n\nWe will canvas three theories of objects that draw from constituent\nontologies, and then describe a relational alternative.\n3.2.1 Constituent Ontologies\n\nConstituent ontologists agree that objects have properties or\nproperty-like items as constituents or parts. They disagree, however,\nover whether objects have additional non-property-like items as\nconstituents or parts and over how the constituents or parts of\nobjects are related.\nBundle theory\n\nAccording to the bundle theory, objects are bundles of properties.\nDifferent theories of properties will make for different versions of\nthe bundle theory. The most common theories of properties for bundle\ntheorists to hold are\n trope theory (see entry on tropes)\n and immanent universals.\n\nOn the immanent universal version of the bundle theory, objects are\nbundles of universals, and those universals are located in space and\ntime. When some universals are compresent, however compresence is to\nbe understood (and perhaps when some other condition is satisfied),\nthere is an object that is the bundle of those universals. (For some\nbundle theorists, not just any group of immanent universals forms a\nbundle.) The way it’s often put is that objects are bundles of\ncoinstantiated universals, where the coinstantiation relation\nmay be a primitive\n relation.[27]\n\nOn the trope version of the bundle theory, objects are bundles of\ntropes. Like the immanent universal version, not just any collection\nof tropes forms a bundle which is an object; the tropes have to be\ncompresent. The compresence relation is taken to be\n primitive.[28]\n\nThe bundle theory is a theory about objects according to which objects\nare composed of items of a different kind or category (namely,\n properties).[29]\n So the bundle theory suggests that object has a contrast or\ncomplement. The bundle theory also suggests this broad answer to the\nExtension Question: whenever there is a bundle of coinstantiated\nuniversals (or, alternatively, compresent tropes), there is an object.\nThe extension of object includes all and only the bundles,\nand what bundles there are is determined by which immanent universals\nor tropes stand in the coinstantiation or compresence\n relation.[30]\nBare particularism\n\nLike the bundle theory, bare particularism maintains that objects have\ntheir properties as constituents. But bare particularism adds that\nthere’s something else too. In addition to its properties, every\nobject has as a constituent a bare particular (or ‘thin\nparticular’ or ‘substratum’) that instantiates those\nproperties. Bare particulars are ‘bare’ in at least this\nsense: unlike objects, they have no properties as parts.\n\nBare particularism, then, is the conjunction of two theses. First,\nevery object has at least two kinds of constituents: its properties\nand its bare particular. Second, every object has its properties by\nhaving as constituents properties that are instantiated by another of\nits constituents: its bare particular.\n\nBare particulars play two important roles in the theory at hand.\nFirst, they are the subjects of properties or the items to\nwhich the properties are attached by instantiation or exemplification.\nThus Alston:\n\n\nWe must ask concerning any situation involving this relation (e.g., a\nexemplifying [Greenness]) what the relata are. One of them is a\nuniversal. What is the other? It will obviously not do to\nreply—a grum (defined as an instance of [greenness]); for this\nwould amount to saying that the relatum in question is that which\nstands in the instancing relation to [Greenness]; true enough but\nhardly enlightening. It still leaves open the question—what is\nit that stands in the instancing relation to [Greenness]? …the\nonly alternative left appears to be a ‘bare’ particular,\nor what I prefer to call a substratum. Once we see the need for\nsupplying an entity to which the universal involved bears the relation\nof being exemplified, we can see that only a bare particular would do\nthe job. (1954: 255)\n\n\nSecond, bare particulars individuate. Consider two objects\nthat are exactly alike in relevant respects (they are both royal blue,\nweigh 1kg, and so on); what could make them two and not\none? What might explain their distinctness? Since they are\nexactly alike in relevant respects no appeal to differences in their\nproperty-like constituents (being royal blue, weighing 1 kg, and so\non) would seem to do the trick. So, the bare particularists maintain,\nthere must be non-property-like constituents by virtue of which they\nare\n distinct.[31]\nHylomorphism\n\nAccording to hylomorphism, objects consist of matter and form\n(see entry on\n form vs. matter).\n Objects are comprised of various parts: electrons and upquarks, for\nexample. In addition to these ordinary material parts, objects have\nrather special components or\nconstituents—forms—property-like items that\ninform the matter of their host substance. Forms give objects\nstructure and shape and are what make each object the kind of thing it\nis. Forms account for the character or nature of objects; they are\nproperty-like in that respect. Socrates, for example, is a human\nanimal comprising form and matter; and Socrates is a human animal\nbecause he has a certain form as a constituent.\n\nHylomorphism may be thought of as a special case of or variation on\nthe bare particular view. For on hylomorphism, an object has both a\nproperty-like constituent (in this case, form) that bears a\nspecial tie to non-property-like constituents (in this case,\n matter).[32]\n3.2.2 Relational Ontologies\n\nWe turn now to relational ontologies. Constituent ontologies, recall,\nhave it that objects have properties as parts or constituents.\nRelational ontologies accept that the extension of both\nobject and property is not\n empty[33]—but\n for them, no object has any property as a part or constituent.\nObjects are, one might say with Armstrong, blobs (1989: 76–77).\nMost relational ontologists will be perfectly happy to say that\nobjects have parts—it’s just that none of those parts are\nproperties; they’re other objects.\nObjects as blobs\n\nIn contrast to the constituent ontologies surveyed above, relational\nontologies posit no internal structure to objects beyond ordinary\nmereological structure. Objects are not layer-cakes of thin\nparticulars and properties (or layer-cakes of matter and form); they\nare blobs instead. Put this way, the blob view of objects has only\nnegative content; it tells us what objects are not. It\noffers, then, a partial account of the nature of objects, and thus\ninvites\n supplementation.[34]\n\nWe will now consider two relational ontologies and their implications\nfor the theory of objects.\nPlatonism\n\nThe Platonist view of properties is that they are transcendent\nuniversals. They exist independently, and are outside of space and\ntime, unchanging, and causally inert. Clearly such things cannot be\nparts of ordinary material objects which are inside space and time,\nchange, and participate in causal chains. But objects still are red,\nlarge, heavy, and the like—and this in virtue of standing in\nsome relation to the transcendent universals. That relation is usually\ncalled exemplification or instantiation, and it is\ntaken as primitive. But, importantly, it is\nexternal—objects are related to things outside of\nthemselves—whereas the relation between object and property on\nconstituent ontologies is internal.\n\nSo, while Platonism is primarily a view about the nature of\nproperties, it has implications for the nature of objects. In\nparticular, it entails that they don’t have properties as parts.\nAs Armstrong puts the point:\n\n\nIt is interesting to notice that a separate-realm theory of universals\npermits of a blob as opposed to a layer-cake view of particulars. For\non this view, what is it for a thing to have a property? It is not the\nthing’s having some internal feature, but rather its having a\nrelationship, the instantiation relationship, to certain universals or\nForms in another realm. The thing itself could be bloblike. (Armstrong\n1989: 76–77)\n\n\nAs it turns out, Platonism is not the only account of properties that\nsits well with an unstructured or bloblike view of objects.\nClass Nominalism\n\nOn class nominalism, properties are classes of things or classes of\npossible things. The property being green is the class of all\ngreen things, the property being wise is the class of all\nwise things, the relation is the sister of is the class of\nordered pairs the first member of which is the sister of the second\nmember, and so on.\n [35]\n\nFor an object to have (or exemplify, or instantiate, or whatever) a\nproperty, on this view, is for it to belong to a class of things.\nClass membership, like set membership, is an external relation; so\nclass nominalism sits best with a blob view of objects. van Inwagen\nexplains this connection as follows:\n\n\nAccording to Lewis [a class nominalist], a property is a set of\npossible objects. (Something is a property if and only if it is a set\nall of whose members are possible objects.) The property of being a\npig or porcinity, Lewis says, is simply the set of all possible\npigs—a set far larger than the set of actual pigs. Consider an\nactual pig, Freddy. Freddy of course has porcinity. And what is this\nrelation “having” that holds between the pig and the\nproperty? Why, simply set-membership. And the relation that a set of\npossibilia bears to its individual members is certainly not\nconstituency. Freddy is no doubt in some sense a constituent of the\nset of all possible pigs—‘constituent’ is a very\nflexible word, and it is probably flexible enough to permit that\napplication —, but there is no conceivable sense in which the\nset of all possible pigs is a constituent of Freddy. (2011:\n392–393)\n",
    "section_title": "3.2 What Objects Are",
    "entry_title": "Object",
    "hierarchy_title": "Object || Nature || What Objects Are",
    "tokenized_text": [
        "nature",
        "object",
        "object",
        "think",
        "object",
        "playing",
        "particular",
        "theoretical",
        "role",
        "view",
        "something",
        "object",
        "matter",
        "thing",
        "intrinsic",
        "character",
        "nature",
        "one",
        "way",
        "giving",
        "intrinsic",
        "nature",
        "thing",
        "giving",
        "real",
        "definition",
        "say",
        "dasgupta",
        "real",
        "definition",
        "statement",
        "something",
        "is",
        "example",
        "one",
        "say",
        "socrates",
        "unique",
        "singleton",
        "containing",
        "socrates",
        "one",
        "defining",
        "set",
        "isthat",
        "giving",
        "real",
        "definition",
        "equivalently",
        "one",
        "stating",
        "essence",
        "nature",
        "statement",
        "something",
        "isof",
        "thing",
        "essence",
        "naturecould",
        "take",
        "variety",
        "form",
        "one",
        "say",
        "thing",
        "real",
        "definition",
        "x",
        "might",
        "put",
        "x",
        "y",
        "real",
        "definition",
        "category",
        "f",
        "f",
        "g",
        "one",
        "say",
        "bachelor",
        "unmarried",
        "male",
        "one",
        "giving",
        "real",
        "definition",
        "bachelorhood",
        "another",
        "way",
        "say",
        "essential",
        "object",
        "category",
        "suggested",
        "fine",
        "essential",
        "x",
        "φ",
        "essential",
        "f",
        "φ",
        "case",
        "task",
        "hand",
        "write",
        "section",
        "real",
        "definition",
        "rather",
        "notion",
        "relates",
        "object",
        "one",
        "think",
        "real",
        "definition",
        "best",
        "get",
        "nature",
        "thing",
        "one",
        "interested",
        "stating",
        "nature",
        "object",
        "object",
        "two",
        "option",
        "one",
        "substitute",
        "φ",
        "following",
        "object",
        "φ",
        "second",
        "substitute",
        "φ",
        "following",
        "essential",
        "object",
        "φ",
        "note",
        "difference",
        "method",
        "method",
        "giving",
        "necessary",
        "sufficient",
        "condition",
        "x",
        "object",
        "iff",
        "φ",
        "one",
        "contrast",
        "class",
        "mind",
        "presumably",
        "one",
        "substitute",
        "φ",
        "negation",
        "contrast",
        "class",
        "eg",
        "x",
        "object",
        "iff",
        "x",
        "property",
        "object",
        "real",
        "definition",
        "demand",
        "one",
        "might",
        "think",
        "object",
        "real",
        "definition",
        "may",
        "contrast",
        "class",
        "property",
        "say",
        "natural",
        "class",
        "object",
        "ontologiesroughly",
        "abstract",
        "systematic",
        "catalogue",
        "kind",
        "thing",
        "aredivide",
        "question",
        "object",
        "relate",
        "property",
        "constituent",
        "ontology",
        "property",
        "part",
        "constituent",
        "component",
        "object",
        "characterize",
        "see",
        "entry",
        "mereology",
        "constituent",
        "ontology",
        "tall",
        "tree",
        "tall",
        "somehow",
        "part",
        "constituent",
        "component",
        "relational",
        "ontology",
        "property",
        "sense",
        "part",
        "constituent",
        "component",
        "object",
        "characterize",
        "relational",
        "ontology",
        "though",
        "tall",
        "tree",
        "bear",
        "interesting",
        "relationship",
        "tall",
        "perhaps",
        "bear",
        "instantiation",
        "relation",
        "property",
        "tall",
        "among",
        "tree",
        "various",
        "part",
        "constituent",
        "component",
        "canvas",
        "three",
        "theory",
        "object",
        "draw",
        "constituent",
        "ontology",
        "describe",
        "relational",
        "alternative",
        "constituent",
        "ontology",
        "constituent",
        "ontologists",
        "agree",
        "object",
        "property",
        "propertylike",
        "item",
        "constituent",
        "part",
        "disagree",
        "however",
        "whether",
        "object",
        "additional",
        "nonpropertylike",
        "item",
        "constituent",
        "part",
        "constituent",
        "part",
        "object",
        "related",
        "bundle",
        "theory",
        "according",
        "bundle",
        "theory",
        "object",
        "bundle",
        "property",
        "different",
        "theory",
        "property",
        "make",
        "different",
        "version",
        "bundle",
        "theory",
        "common",
        "theory",
        "property",
        "bundle",
        "theorist",
        "hold",
        "trope",
        "theory",
        "see",
        "entry",
        "trope",
        "immanent",
        "universal",
        "immanent",
        "universal",
        "version",
        "bundle",
        "theory",
        "object",
        "bundle",
        "universal",
        "universal",
        "located",
        "space",
        "time",
        "universal",
        "compresent",
        "however",
        "compresence",
        "understood",
        "perhaps",
        "condition",
        "satisfied",
        "object",
        "bundle",
        "universal",
        "bundle",
        "theorist",
        "group",
        "immanent",
        "universal",
        "form",
        "bundle",
        "way",
        "often",
        "put",
        "object",
        "bundle",
        "coinstantiated",
        "universal",
        "coinstantiation",
        "relation",
        "may",
        "primitive",
        "relation",
        "trope",
        "version",
        "bundle",
        "theory",
        "object",
        "bundle",
        "trope",
        "like",
        "immanent",
        "universal",
        "version",
        "collection",
        "trope",
        "form",
        "bundle",
        "object",
        "trope",
        "compresent",
        "compresence",
        "relation",
        "taken",
        "primitive",
        "bundle",
        "theory",
        "theory",
        "object",
        "according",
        "object",
        "composed",
        "item",
        "different",
        "kind",
        "category",
        "namely",
        "property",
        "bundle",
        "theory",
        "suggests",
        "object",
        "contrast",
        "complement",
        "bundle",
        "theory",
        "also",
        "suggests",
        "broad",
        "answer",
        "extension",
        "question",
        "whenever",
        "bundle",
        "coinstantiated",
        "universal",
        "alternatively",
        "compresent",
        "trope",
        "object",
        "extension",
        "object",
        "includes",
        "bundle",
        "bundle",
        "determined",
        "immanent",
        "universal",
        "trope",
        "stand",
        "coinstantiation",
        "compresence",
        "relation",
        "bare",
        "particularism",
        "like",
        "bundle",
        "theory",
        "bare",
        "particularism",
        "maintains",
        "object",
        "property",
        "constituent",
        "bare",
        "particularism",
        "add",
        "something",
        "else",
        "addition",
        "property",
        "every",
        "object",
        "constituent",
        "bare",
        "particular",
        "thin",
        "particular",
        "substratum",
        "instantiates",
        "property",
        "bare",
        "particular",
        "bare",
        "least",
        "sense",
        "unlike",
        "object",
        "property",
        "part",
        "bare",
        "particularism",
        "conjunction",
        "two",
        "thesis",
        "first",
        "every",
        "object",
        "least",
        "two",
        "kind",
        "constituent",
        "property",
        "bare",
        "particular",
        "second",
        "every",
        "object",
        "property",
        "constituent",
        "property",
        "instantiated",
        "another",
        "constituent",
        "bare",
        "particular",
        "bare",
        "particular",
        "play",
        "two",
        "important",
        "role",
        "theory",
        "hand",
        "first",
        "subject",
        "property",
        "item",
        "property",
        "attached",
        "instantiation",
        "exemplification",
        "thus",
        "alston",
        "must",
        "ask",
        "concerning",
        "situation",
        "involving",
        "relation",
        "eg",
        "exemplifying",
        "greenness",
        "relatum",
        "one",
        "universal",
        "obviously",
        "replya",
        "grum",
        "defined",
        "instance",
        "greenness",
        "would",
        "amount",
        "saying",
        "relatum",
        "question",
        "stand",
        "instancing",
        "relation",
        "greenness",
        "true",
        "enough",
        "hardly",
        "enlightening",
        "still",
        "leaf",
        "open",
        "questionwhat",
        "stand",
        "instancing",
        "relation",
        "greenness",
        "the",
        "alternative",
        "left",
        "appears",
        "bare",
        "particular",
        "prefer",
        "call",
        "substratum",
        "see",
        "need",
        "supplying",
        "entity",
        "universal",
        "involved",
        "bear",
        "relation",
        "exemplified",
        "see",
        "bare",
        "particular",
        "would",
        "job",
        "second",
        "bare",
        "particular",
        "individuate",
        "consider",
        "two",
        "object",
        "exactly",
        "alike",
        "relevant",
        "respect",
        "royal",
        "blue",
        "weigh",
        "kg",
        "could",
        "make",
        "two",
        "one",
        "might",
        "explain",
        "distinctness",
        "since",
        "exactly",
        "alike",
        "relevant",
        "respect",
        "appeal",
        "difference",
        "propertylike",
        "constituent",
        "royal",
        "blue",
        "weighing",
        "kg",
        "would",
        "seem",
        "trick",
        "bare",
        "particularists",
        "maintain",
        "must",
        "nonpropertylike",
        "constituent",
        "virtue",
        "distinct",
        "hylomorphism",
        "according",
        "hylomorphism",
        "object",
        "consist",
        "matter",
        "form",
        "see",
        "entry",
        "form",
        "vs",
        "matter",
        "object",
        "comprised",
        "various",
        "part",
        "electron",
        "upquarks",
        "example",
        "addition",
        "ordinary",
        "material",
        "part",
        "object",
        "rather",
        "special",
        "component",
        "constituentsformspropertylike",
        "item",
        "inform",
        "matter",
        "host",
        "substance",
        "form",
        "give",
        "object",
        "structure",
        "shape",
        "make",
        "object",
        "kind",
        "thing",
        "form",
        "account",
        "character",
        "nature",
        "object",
        "propertylike",
        "respect",
        "socrates",
        "example",
        "human",
        "animal",
        "comprising",
        "form",
        "matter",
        "socrates",
        "human",
        "animal",
        "certain",
        "form",
        "constituent",
        "hylomorphism",
        "may",
        "thought",
        "special",
        "case",
        "variation",
        "bare",
        "particular",
        "view",
        "hylomorphism",
        "object",
        "propertylike",
        "constituent",
        "case",
        "form",
        "bear",
        "special",
        "tie",
        "nonpropertylike",
        "constituent",
        "case",
        "matter",
        "relational",
        "ontology",
        "turn",
        "relational",
        "ontology",
        "constituent",
        "ontology",
        "recall",
        "object",
        "property",
        "part",
        "constituent",
        "relational",
        "ontology",
        "accept",
        "extension",
        "object",
        "property",
        "empty",
        "but",
        "object",
        "property",
        "part",
        "constituent",
        "object",
        "one",
        "might",
        "say",
        "armstrong",
        "blob",
        "relational",
        "ontologists",
        "perfectly",
        "happy",
        "say",
        "object",
        "partsit",
        "none",
        "part",
        "property",
        "object",
        "object",
        "blob",
        "contrast",
        "constituent",
        "ontology",
        "surveyed",
        "relational",
        "ontology",
        "posit",
        "internal",
        "structure",
        "object",
        "beyond",
        "ordinary",
        "mereological",
        "structure",
        "object",
        "layercakes",
        "thin",
        "particular",
        "property",
        "layercakes",
        "matter",
        "form",
        "blob",
        "instead",
        "put",
        "way",
        "blob",
        "view",
        "object",
        "negative",
        "content",
        "tell",
        "u",
        "object",
        "offer",
        "partial",
        "account",
        "nature",
        "object",
        "thus",
        "invite",
        "supplementation",
        "consider",
        "two",
        "relational",
        "ontology",
        "implication",
        "theory",
        "object",
        "platonism",
        "platonist",
        "view",
        "property",
        "transcendent",
        "universal",
        "exist",
        "independently",
        "outside",
        "space",
        "time",
        "unchanging",
        "causally",
        "inert",
        "clearly",
        "thing",
        "part",
        "ordinary",
        "material",
        "object",
        "inside",
        "space",
        "time",
        "change",
        "participate",
        "causal",
        "chain",
        "object",
        "still",
        "red",
        "large",
        "heavy",
        "likeand",
        "virtue",
        "standing",
        "relation",
        "transcendent",
        "universal",
        "relation",
        "usually",
        "called",
        "exemplification",
        "instantiation",
        "taken",
        "primitive",
        "importantly",
        "externalobjects",
        "related",
        "thing",
        "outside",
        "themselveswhereas",
        "relation",
        "object",
        "property",
        "constituent",
        "ontology",
        "internal",
        "platonism",
        "primarily",
        "view",
        "nature",
        "property",
        "implication",
        "nature",
        "object",
        "particular",
        "entail",
        "property",
        "part",
        "armstrong",
        "put",
        "point",
        "interesting",
        "notice",
        "separaterealm",
        "theory",
        "universal",
        "permit",
        "blob",
        "opposed",
        "layercake",
        "view",
        "particular",
        "view",
        "thing",
        "property",
        "thing",
        "internal",
        "feature",
        "rather",
        "relationship",
        "instantiation",
        "relationship",
        "certain",
        "universal",
        "form",
        "another",
        "realm",
        "thing",
        "could",
        "bloblike",
        "armstrong",
        "turn",
        "platonism",
        "account",
        "property",
        "sits",
        "well",
        "unstructured",
        "bloblike",
        "view",
        "object",
        "class",
        "nominalism",
        "class",
        "nominalism",
        "property",
        "class",
        "thing",
        "class",
        "possible",
        "thing",
        "property",
        "green",
        "class",
        "green",
        "thing",
        "property",
        "wise",
        "class",
        "wise",
        "thing",
        "relation",
        "sister",
        "class",
        "ordered",
        "pair",
        "first",
        "member",
        "sister",
        "second",
        "member",
        "object",
        "exemplify",
        "instantiate",
        "whatever",
        "property",
        "view",
        "belong",
        "class",
        "thing",
        "class",
        "membership",
        "like",
        "set",
        "membership",
        "external",
        "relation",
        "class",
        "nominalism",
        "sits",
        "best",
        "blob",
        "view",
        "object",
        "van",
        "inwagen",
        "explains",
        "connection",
        "follows",
        "according",
        "lewis",
        "class",
        "nominalist",
        "property",
        "set",
        "possible",
        "object",
        "something",
        "property",
        "set",
        "whose",
        "member",
        "possible",
        "object",
        "property",
        "pig",
        "porcinity",
        "lewis",
        "say",
        "simply",
        "set",
        "possible",
        "pigsa",
        "set",
        "far",
        "larger",
        "set",
        "actual",
        "pig",
        "consider",
        "actual",
        "pig",
        "freddy",
        "freddy",
        "course",
        "porcinity",
        "relation",
        "hold",
        "pig",
        "property",
        "simply",
        "setmembership",
        "relation",
        "set",
        "possibilia",
        "bear",
        "individual",
        "member",
        "certainly",
        "constituency",
        "freddy",
        "doubt",
        "sense",
        "constituent",
        "set",
        "possible",
        "pigs",
        "constituent",
        "flexible",
        "word",
        "probably",
        "flexible",
        "enough",
        "permit",
        "application",
        "conceivable",
        "sense",
        "set",
        "possible",
        "pig",
        "constituent",
        "freddy"
    ]
}