{
    "main_text": "Revisions of the rules\n4. Revisions of the rules\n\nWalter Burley’s rules of obligational disputations can be called\nthe standard approach, but they were also challenged in the fourteenth\ncentury discussions. All these challenges may be taken to be directed\nat understanding in what sense the respondent must avoid contradicting\nhimself in an obligational disputation.\n\nTime and modality. When discussing modalities in his\nOrdinatio (I, d. 38, 2), John Duns Scotus rejects a principle\nwhich he calls an obligational rule, namely that with a false\npositio one must “deny the present instant”. And\nin fact, Walter Burley (writing roughly at the same time) mentions\nthis as a valid, useful rule. The reasoning behind the rule is the\nnecessity of the present. For example, suppose “you are\nrunning” is the false positum when you are in fact\nstanding in a university hall and participating in an obligational\ndisputation. Now, if one considers the possibility that you are\nrunning, this possibility must according to Burley be referred to some\nother time, because of the necessity of the present. You cannot be\nrunning now since you are standing now, but afterwards you can of\ncourse run. (Kretzmann and Stump 1988, 394.)\n\nDuns Scotus denied the necessity of the present and thought that it\nneed not be incoherent to consider actually false propositions as\npossible at the present instant. That you are standing does not\nexclude that you are running is a logical possibility, it only\nexcludes actual running. This kind of thinking has been found to\nreflect a major change in how alethic modalities are conceived. After\nScotus, many thinkers thought of modalities as related to\nconceivability and logic, and not so much as based on being in\nsomeone’s power, or true at some time or other. That is, the\npossibility of a proposition became taken to be an issue unrelated to\nthe flow of time.\n\nThis change is visible in obligations treatises. When Burley mentions\ndenying the present instant as a useful rule, he takes up a topic that\nis found in the earlier treatises, but in fact not often in later\ntreatises. It looks as if Scotus’ rejection of the rule became\naccepted.\n\nCounterfactual thinking. Richard Kilvington comments on\nobligations in his Sophismata (S47; Kretzmann & Kretzmann\n1990a; 1990b). In his view, it should not be possible to force the\nrespondent to grant any falsities whatsoever, and the order in which\npropositions are put forward ought not to have an effect on their\nevaluation. As Kilvington sees it, the respondent should grant only\nthose falsities which would be true if the positum were true.\nKilvington gives the following example (S47, (q); Kretzmann &\nKretzmann 1990b, 127–8):\n\n\n\n\nPositum\nYou are in Rome.\nAccepted as possible. \n\nProposition 1\n‘You are in Rome’ and ‘you are a bishop’\nare similar in truth value.\nDenied, since you are not a bishop. \n\nProposition 2\nYou are a bishop.\nDenied, does not follow.  \n\n\nDisputation D2\n\n\nAssuming that the respondent is not in Rome or a bishop both of the\npropositions mentioned in Proposition 1 are false. According\nBurley’s rules, Proposition 1 would have to be granted as\nirrelevant and true. But after having granted Proposition 1, it may\nappear that Proposition 2 follows and must be granted. According to\nKilvington, that should not be so. Indeed, he goes directly on to\ngenerally denying Burley’s useful rule that anything false that\nis compossible with the positum may have to be granted. By\nKilvington’s comparison, the respondent is bound or obligated by\nthe positum “you are in Rome” to answer as he\nwould if he were in Rome. Thus, he ought not to grant “you are a\nbishop” unless he is a bishop.\n\nWhen concluding his discussion of the example, Kilvington describes\nProposition 1 as one “that is true now and that would not be\ntrue in virtue of its being in fact as is signified by the\npositum” (S47, (cc); Kretzmann & Kretzmann 1990b,\n131). Kilvington is thus inviting the respondent to think\ncounterfactually when defending a false positum, and as he\ncontinues, he applies this to how one ought to answer when evaluating\na sophisma. One ought to grant what would be true and deny what would\nbe false, given the positum.\n\nAn anonymous treatise De arte obligatoria probably from the\n1330s (edited and translated from a Merton College manuscript in\nKretzmann & Stump 1985) seems to develop a central aspect of\nKilvington’s suggestion into a complete set of rules for\nobligational disputations. Just like Kilvington, the anonymous author\nthought that in an obligational disputation the order of the\npropositions ought not influence the answers. The core change to\nBurley’s rules is that rules 5. and 6. above are revised so that\ninstead of referring to earlier answers, they must refer to\npropositions which would be true if the positum was true.\nThus, a proposition must be granted as sequentially relevant, if it\nfollows from the positum together with a proposition that\nwould be true if the positum were true. Similarly, it has to\ndenied as incompatibly relevant if it is incompatible with the\npositum together with a proposition that would be true if the\npositum were true. The result is that all answers must be\ngiven “in accordance with how it is possible for things to\nbe”, or “on the basis of the facts then”, as the\nanonymous author puts it.\n\nThis approach was not followed in later theories of\nobligationes. It may be that obligations were thought of as\nconcerned with relations between propositions rather than building a\ndescription of a possible situation that could be imagined. The\nanonymous author’s approach requires the respondent to imagine\nwhat the situation would be like if the positum were true and\ngive evaluations on the basis of that situation. Thus, the evaluations\nwould not be based on the logical relations between the various\npropositions of the disputation itself. If obligational disputations\nwere conceived as a tool for examining logical relations between\npropositions, such counterfactual thinking may not be the best way to\nproceed.\n\nAccepting contradictions. There is also another direction\ninto which Kilvington’s comments can be developed. In another\ncomment on the example D2 above, Kilvington says that the respondent\ncould grant Proposition 1 and deny Proposition 2 (S47, (bb); Kretzmann\n& Kretzmann 1990b, 131). His point is that when the propositions\n‘you are in Rome’ and ‘you are a bishop’ are\nclaimed to be similar in truth value, they are mentioned rather than\nused. Given that the meanings of these strings of words is not\nlogically necessary, it might be that Proposition 1 (claiming that the\ntwo mentioned propositions are similar in truth value) has nothing to\ndo with the respondent being in Rome or being a bishop. Thus,\nProposition 2 does not follow from the positum and\nProposition 1 together.\n\nThis approach is even stronger in a related discussion where\nKilvington rejects what is nowadays called Tarskian biconditionals, or\nthe equivalence between a proposition and the claim that the\nproposition is true. Logically, inferring that you are in Rome from\nthe claim that the sentence ‘you are in Rome’ is true is\nvalid only if ‘you are in Rome’ means that you are in\nRome. (S47, (t); Kretzmann & Kretzmann 1990b, 128.)\n\nIt seems that in his treatise on obligationes, Roger\nSwyneshed developed his rules for obligational disputations with an\napproach like this (the text is edited in Spade 1977). Especially\ninteresting in this respect is his discussion on impositio,\nor the kind of obligational disputation where a new meaning is given\nto some linguistic entity. According to Swyneshed, even if the\nrespondent were obligated by the impositio that ‘you\nare a donkey’ means that God exists, the respondent must deny\nbeing a donkey. The proposition “‘you are a donkey’\nis true” must however be granted. According to Swyneshed’s\nprinciple, “because of an impositio of some proposition\nthe answer to be given to it is not to be changed” (Spade 1977,\n254). It seems thus that the impositio influences only\nsituations where the proposition at issue is mentioned rather than\nused.\n\nRecent scholarship has found Swyneshed’s rules for\npositio more puzzling (see e.g., Spade 1982; Stump 1981;\nYrjönsuuri 1994 and 2001). They are very clear in terms of how to\nanswer according to them, but it seems very problematic to give a\nsensible interpretation to the set of evaluations to be given\naccording to them. Swyneshed simply rejects Burley’s rules 5 and\n6. Just like Kilvington and the above-mentioned anonymous author of\nDe arte obligatoria, Swyneshed does not allow the order of\nthe propositions to have any effect on the answers. However, he does\nnot allow counterfactual considerations either, but rather thinks that\nthe respondent must rely on logical relations between the propositions\nin giving the evaluations.\n\nAs Swyneshed recognizes, his rules may lead the respondent into\ngranting triads or larger sets of propositions containing\ncontradictions. In his formulation, “the conclusion must be\ngranted that three incompatible propositions must be granted, and\nfour, and so on” (Spade 1977, 274). The sequence of propositions\nin D1 above is an example of this. The respondent cannot according to\nSwyneshed rely on Burley’s rule 5 to grant Proposition 2.\nInstead, the respondent should grant a disjunction but deny both of\nits parts. Also, it may happen that a conjunction must be denied\ndespite granting both of its parts. These structural combinations are\nexplicitly accepted by Swyneshed (Spade 1977, 257).\n\nIt must be kept in mind that in each case of granting a contradictory\nset by Swyneshed’s rules, at least one evaluation is given on\nthe basis of one proposition being relevant, and at least one other\nanswer on the basis of that proposition being irrelevant. Thus, if the\nevaluations of irrelevant propositions were not allowed to be mixed\nwith evaluations of relevant ones, these contradictions would not\narise. However, it seems that this is not how Swyneshed thought about\nthe rules, since he explicitly allows the contradictions without\ndiscussing the idea of two domains of interpretation.\n\nIn the context of obligations, Swyneshed does not say that it would be\nacceptable to grant or deny a contradictory pair of propositions in\nthe same disputation: he discusses contradictory triads, not pairs.\nHowever, in his discussion on the Liar’s paradox, he goes as far\nas explicitly accepting that in some cases both contradictories are\nfalse (cf. Read 2020). This shows that Swyneshed’s understanding\nof what contradictions are and how they behave in logic is somewhat\noutside the logical mainstream. Thus, it may be that further study may\nshed more light on how exactly he thought about allowing\ncontradictions in obligational evaluations of sets of\npropositions.\n\nHistorically, it seems that counterfactual thinking as an approach to\nobligations was mainly rejected, but Swyneshed’s approach\ngarnered some following. Both of these approaches appear to take issue\nwith Burley’s principle that the order of propositions has\ncrucial significance in how they are to be evaluated. Since\nSwyneshed’s way of rejecting this principle found some\nfollowers, this fact may signal that his approach was taken to be\ncloser to what really is at issue in obligations as a genre of logic.\nHowever, generally speaking Burley’s approach became the\nmainstream towards the end of the fourteenth century. Perhaps, taking\nthe order of propositions into account was taken to be less\nproblematic than Swyneshed’s acceptance of contradictory\ntriads.\n",
    "section_title": "4. Revisions of the rules",
    "entry_title": "Medieval Theories of Obligationes",
    "hierarchy_title": "Medieval Theories of Obligationes || Revisions of the rules",
    "tokenized_text": [
        "revision",
        "rule",
        "revision",
        "rule",
        "walter",
        "burley",
        "rule",
        "obligational",
        "disputation",
        "called",
        "standard",
        "approach",
        "also",
        "challenged",
        "fourteenth",
        "century",
        "discussion",
        "challenge",
        "may",
        "taken",
        "directed",
        "understanding",
        "sense",
        "respondent",
        "must",
        "avoid",
        "contradicting",
        "obligational",
        "disputation",
        "time",
        "modality",
        "discussing",
        "modality",
        "ordinatio",
        "d",
        "john",
        "dun",
        "scotus",
        "reject",
        "principle",
        "call",
        "obligational",
        "rule",
        "namely",
        "false",
        "positio",
        "one",
        "must",
        "deny",
        "present",
        "instant",
        "fact",
        "walter",
        "burley",
        "writing",
        "roughly",
        "time",
        "mention",
        "valid",
        "useful",
        "rule",
        "reasoning",
        "behind",
        "rule",
        "necessity",
        "present",
        "example",
        "suppose",
        "running",
        "false",
        "positum",
        "fact",
        "standing",
        "university",
        "hall",
        "participating",
        "obligational",
        "disputation",
        "one",
        "considers",
        "possibility",
        "running",
        "possibility",
        "must",
        "according",
        "burley",
        "referred",
        "time",
        "necessity",
        "present",
        "running",
        "since",
        "standing",
        "afterwards",
        "course",
        "run",
        "kretzmann",
        "stump",
        "dun",
        "scotus",
        "denied",
        "necessity",
        "present",
        "thought",
        "need",
        "incoherent",
        "consider",
        "actually",
        "false",
        "proposition",
        "possible",
        "present",
        "instant",
        "standing",
        "exclude",
        "running",
        "logical",
        "possibility",
        "excludes",
        "actual",
        "running",
        "kind",
        "thinking",
        "found",
        "reflect",
        "major",
        "change",
        "alethic",
        "modality",
        "conceived",
        "scotus",
        "many",
        "thinker",
        "thought",
        "modality",
        "related",
        "conceivability",
        "logic",
        "much",
        "based",
        "someone",
        "power",
        "true",
        "time",
        "possibility",
        "proposition",
        "became",
        "taken",
        "issue",
        "unrelated",
        "flow",
        "time",
        "change",
        "visible",
        "obligation",
        "treatise",
        "burley",
        "mention",
        "denying",
        "present",
        "instant",
        "useful",
        "rule",
        "take",
        "topic",
        "found",
        "earlier",
        "treatise",
        "fact",
        "often",
        "later",
        "treatise",
        "look",
        "scotus",
        "rejection",
        "rule",
        "became",
        "accepted",
        "counterfactual",
        "thinking",
        "richard",
        "kilvington",
        "comment",
        "obligation",
        "sophismata",
        "s",
        "kretzmann",
        "kretzmann",
        "a",
        "b",
        "view",
        "possible",
        "force",
        "respondent",
        "grant",
        "falsity",
        "whatsoever",
        "order",
        "proposition",
        "put",
        "forward",
        "ought",
        "effect",
        "evaluation",
        "kilvington",
        "see",
        "respondent",
        "grant",
        "falsity",
        "would",
        "true",
        "positum",
        "true",
        "kilvington",
        "give",
        "following",
        "example",
        "s",
        "q",
        "kretzmann",
        "kretzmann",
        "b",
        "positum",
        "rome",
        "accepted",
        "possible",
        "proposition",
        "rome",
        "bishop",
        "similar",
        "truth",
        "value",
        "denied",
        "since",
        "bishop",
        "proposition",
        "bishop",
        "denied",
        "follow",
        "disputation",
        "d",
        "assuming",
        "respondent",
        "rome",
        "bishop",
        "proposition",
        "mentioned",
        "proposition",
        "false",
        "according",
        "burley",
        "rule",
        "proposition",
        "would",
        "granted",
        "irrelevant",
        "true",
        "granted",
        "proposition",
        "may",
        "appear",
        "proposition",
        "follows",
        "must",
        "granted",
        "according",
        "kilvington",
        "indeed",
        "go",
        "directly",
        "generally",
        "denying",
        "burley",
        "useful",
        "rule",
        "anything",
        "false",
        "compossible",
        "positum",
        "may",
        "granted",
        "kilvington",
        "comparison",
        "respondent",
        "bound",
        "obligated",
        "positum",
        "rome",
        "answer",
        "would",
        "rome",
        "thus",
        "ought",
        "grant",
        "bishop",
        "unless",
        "bishop",
        "concluding",
        "discussion",
        "example",
        "kilvington",
        "describes",
        "proposition",
        "one",
        "true",
        "would",
        "true",
        "virtue",
        "fact",
        "signified",
        "positum",
        "s",
        "cc",
        "kretzmann",
        "kretzmann",
        "b",
        "kilvington",
        "thus",
        "inviting",
        "respondent",
        "think",
        "counterfactually",
        "defending",
        "false",
        "positum",
        "continues",
        "applies",
        "one",
        "ought",
        "answer",
        "evaluating",
        "sophisma",
        "one",
        "ought",
        "grant",
        "would",
        "true",
        "deny",
        "would",
        "false",
        "given",
        "positum",
        "anonymous",
        "treatise",
        "de",
        "arte",
        "obligatoria",
        "probably",
        "s",
        "edited",
        "translated",
        "merton",
        "college",
        "manuscript",
        "kretzmann",
        "stump",
        "seems",
        "develop",
        "central",
        "aspect",
        "kilvington",
        "suggestion",
        "complete",
        "set",
        "rule",
        "obligational",
        "disputation",
        "like",
        "kilvington",
        "anonymous",
        "author",
        "thought",
        "obligational",
        "disputation",
        "order",
        "proposition",
        "ought",
        "influence",
        "answer",
        "core",
        "change",
        "burley",
        "rule",
        "rule",
        "revised",
        "instead",
        "referring",
        "earlier",
        "answer",
        "must",
        "refer",
        "proposition",
        "would",
        "true",
        "positum",
        "true",
        "thus",
        "proposition",
        "must",
        "granted",
        "sequentially",
        "relevant",
        "follows",
        "positum",
        "together",
        "proposition",
        "would",
        "true",
        "positum",
        "true",
        "similarly",
        "denied",
        "incompatibly",
        "relevant",
        "incompatible",
        "positum",
        "together",
        "proposition",
        "would",
        "true",
        "positum",
        "true",
        "result",
        "answer",
        "must",
        "given",
        "accordance",
        "possible",
        "thing",
        "basis",
        "fact",
        "anonymous",
        "author",
        "put",
        "approach",
        "followed",
        "later",
        "theory",
        "obligationes",
        "may",
        "obligation",
        "thought",
        "concerned",
        "relation",
        "proposition",
        "rather",
        "building",
        "description",
        "possible",
        "situation",
        "could",
        "imagined",
        "anonymous",
        "author",
        "approach",
        "requires",
        "respondent",
        "imagine",
        "situation",
        "would",
        "like",
        "positum",
        "true",
        "give",
        "evaluation",
        "basis",
        "situation",
        "thus",
        "evaluation",
        "would",
        "based",
        "logical",
        "relation",
        "various",
        "proposition",
        "disputation",
        "obligational",
        "disputation",
        "conceived",
        "tool",
        "examining",
        "logical",
        "relation",
        "proposition",
        "counterfactual",
        "thinking",
        "may",
        "best",
        "way",
        "proceed",
        "accepting",
        "contradiction",
        "also",
        "another",
        "direction",
        "kilvington",
        "comment",
        "developed",
        "another",
        "comment",
        "example",
        "d",
        "kilvington",
        "say",
        "respondent",
        "could",
        "grant",
        "proposition",
        "deny",
        "proposition",
        "s",
        "bb",
        "kretzmann",
        "kretzmann",
        "b",
        "point",
        "proposition",
        "rome",
        "bishop",
        "claimed",
        "similar",
        "truth",
        "value",
        "mentioned",
        "rather",
        "used",
        "given",
        "meaning",
        "string",
        "word",
        "logically",
        "necessary",
        "might",
        "proposition",
        "claiming",
        "two",
        "mentioned",
        "proposition",
        "similar",
        "truth",
        "value",
        "nothing",
        "respondent",
        "rome",
        "bishop",
        "thus",
        "proposition",
        "follow",
        "positum",
        "proposition",
        "together",
        "approach",
        "even",
        "stronger",
        "related",
        "discussion",
        "kilvington",
        "reject",
        "nowadays",
        "called",
        "tarskian",
        "biconditionals",
        "equivalence",
        "proposition",
        "claim",
        "proposition",
        "true",
        "logically",
        "inferring",
        "rome",
        "claim",
        "sentence",
        "rome",
        "true",
        "valid",
        "rome",
        "mean",
        "rome",
        "s",
        "kretzmann",
        "kretzmann",
        "b",
        "seems",
        "treatise",
        "obligationes",
        "roger",
        "swyneshed",
        "developed",
        "rule",
        "obligational",
        "disputation",
        "approach",
        "like",
        "text",
        "edited",
        "spade",
        "especially",
        "interesting",
        "respect",
        "discussion",
        "impositio",
        "kind",
        "obligational",
        "disputation",
        "new",
        "meaning",
        "given",
        "linguistic",
        "entity",
        "according",
        "swyneshed",
        "even",
        "respondent",
        "obligated",
        "impositio",
        "donkey",
        "mean",
        "god",
        "exists",
        "respondent",
        "must",
        "deny",
        "donkey",
        "proposition",
        "donkey",
        "true",
        "must",
        "however",
        "granted",
        "according",
        "swyneshed",
        "principle",
        "impositio",
        "proposition",
        "answer",
        "given",
        "changed",
        "spade",
        "seems",
        "thus",
        "impositio",
        "influence",
        "situation",
        "proposition",
        "issue",
        "mentioned",
        "rather",
        "used",
        "recent",
        "scholarship",
        "found",
        "swyneshed",
        "rule",
        "positio",
        "puzzling",
        "see",
        "eg",
        "spade",
        "stump",
        "yrjönsuuri",
        "clear",
        "term",
        "answer",
        "according",
        "seems",
        "problematic",
        "give",
        "sensible",
        "interpretation",
        "set",
        "evaluation",
        "given",
        "according",
        "swyneshed",
        "simply",
        "reject",
        "burley",
        "rule",
        "like",
        "kilvington",
        "abovementioned",
        "anonymous",
        "author",
        "de",
        "arte",
        "obligatoria",
        "swyneshed",
        "allow",
        "order",
        "proposition",
        "effect",
        "answer",
        "however",
        "allow",
        "counterfactual",
        "consideration",
        "either",
        "rather",
        "think",
        "respondent",
        "must",
        "rely",
        "logical",
        "relation",
        "proposition",
        "giving",
        "evaluation",
        "swyneshed",
        "recognizes",
        "rule",
        "may",
        "lead",
        "respondent",
        "granting",
        "triad",
        "larger",
        "set",
        "proposition",
        "containing",
        "contradiction",
        "formulation",
        "conclusion",
        "must",
        "granted",
        "three",
        "incompatible",
        "proposition",
        "must",
        "granted",
        "four",
        "spade",
        "sequence",
        "proposition",
        "d",
        "example",
        "respondent",
        "according",
        "swyneshed",
        "rely",
        "burley",
        "rule",
        "grant",
        "proposition",
        "instead",
        "respondent",
        "grant",
        "disjunction",
        "deny",
        "part",
        "also",
        "may",
        "happen",
        "conjunction",
        "must",
        "denied",
        "despite",
        "granting",
        "part",
        "structural",
        "combination",
        "explicitly",
        "accepted",
        "swyneshed",
        "spade",
        "must",
        "kept",
        "mind",
        "case",
        "granting",
        "contradictory",
        "set",
        "swyneshed",
        "rule",
        "least",
        "one",
        "evaluation",
        "given",
        "basis",
        "one",
        "proposition",
        "relevant",
        "least",
        "one",
        "answer",
        "basis",
        "proposition",
        "irrelevant",
        "thus",
        "evaluation",
        "irrelevant",
        "proposition",
        "allowed",
        "mixed",
        "evaluation",
        "relevant",
        "one",
        "contradiction",
        "would",
        "arise",
        "however",
        "seems",
        "swyneshed",
        "thought",
        "rule",
        "since",
        "explicitly",
        "allows",
        "contradiction",
        "without",
        "discussing",
        "idea",
        "two",
        "domain",
        "interpretation",
        "context",
        "obligation",
        "swyneshed",
        "say",
        "would",
        "acceptable",
        "grant",
        "deny",
        "contradictory",
        "pair",
        "proposition",
        "disputation",
        "discus",
        "contradictory",
        "triad",
        "pair",
        "however",
        "discussion",
        "liar",
        "paradox",
        "go",
        "far",
        "explicitly",
        "accepting",
        "case",
        "contradictory",
        "false",
        "cf",
        "read",
        "show",
        "swyneshed",
        "understanding",
        "contradiction",
        "behave",
        "logic",
        "somewhat",
        "outside",
        "logical",
        "mainstream",
        "thus",
        "may",
        "study",
        "may",
        "shed",
        "light",
        "exactly",
        "thought",
        "allowing",
        "contradiction",
        "obligational",
        "evaluation",
        "set",
        "proposition",
        "historically",
        "seems",
        "counterfactual",
        "thinking",
        "approach",
        "obligation",
        "mainly",
        "rejected",
        "swyneshed",
        "approach",
        "garnered",
        "following",
        "approach",
        "appear",
        "take",
        "issue",
        "burley",
        "principle",
        "order",
        "proposition",
        "crucial",
        "significance",
        "evaluated",
        "since",
        "swyneshed",
        "way",
        "rejecting",
        "principle",
        "found",
        "follower",
        "fact",
        "may",
        "signal",
        "approach",
        "taken",
        "closer",
        "really",
        "issue",
        "obligation",
        "genre",
        "logic",
        "however",
        "generally",
        "speaking",
        "burley",
        "approach",
        "became",
        "mainstream",
        "towards",
        "end",
        "fourteenth",
        "century",
        "perhaps",
        "taking",
        "order",
        "proposition",
        "account",
        "taken",
        "le",
        "problematic",
        "swyneshed",
        "acceptance",
        "contradictory",
        "triad"
    ]
}