{
    "main_text": "Practical Philosophy || Political Philosophy\n3.2 Political Philosophy\n3.2.1 Poverty\n\nAlthough Olivi did not leave behind systematic treatises on political\nphilosophy, his works touched upon several politically loaded\ntheological and philosophical ideas. In particular, he played a\ncentral role in the controversy over how rigorously to understand the\nFranciscan vow of poverty, which would have a lasting effect on\nmedieval political reality (Burr 1989, 2001). Although the controversy\ncentered on Franciscan poverty and was thus strongly motivated by\ntheological worries and Church politics, it is not difficult to see\nthat it has several philosophical dimensions to it. For instance, it\nhas been argued that the modern conception of subjective rights was\nfirst developed in the debate between the Franciscan order and the\npope over the correct interpretation of poverty and the vow (see,\ne.g., van Duffel 2010).\n\nFranciscans held that the vow of poverty requires renouncing ownership\n(dominium), but that using products owned by someone\nelse (e.g., the Church) does not violate the vow. However, the\nquestion that divided them in the latter half of the thirteenth\ncentury was whether the vow requires that, even when merely using the\ngoods of another, one adheres to strict standards of austerity, the\nso-called “poor use” (usus pauper). Olivi insisted\non these strict standards but claimed that they are part of the vow\nonly indeterminately. This means first that not every violation is a\nmortal sin, provided that one’s general tendency is to strive\nfor spiritual humility by living poorly. It also means that what\nexactly counts as poor use depends on the circumstances and situation,\nsince it is impossible to find a precise and fixed line between poor\nand lax use of commodities. In other words, Olivi admitted a certain\nlatitude and flexibility in this notion (Burr 2001, pp.\n51–53).\n\nAnother central idea for Olivi was that one should not obey\none’s superiors if obeying their commands entails sinful action\nor the violation of the Franciscan vow, thus endangering one’s\nsalvation. Given Olivi’s flexible view of the scope of the poor\nuse, this last restriction makes the limit between the duties of\nobedience and disobedience vague. Each individual friar must judge in\nhis own conscience whether he should obey or disobey (and ultimately\nprotest) the commands of their superiors. It is not surprising that\nOlivi’s theoretical model of the vow, in conjunction with the\npotential for disobedience, fueled the political controversy within\nthe Franciscan order and the Church (Burr 2001, pp. 64–65).\n\nFrom a philosophical perspective, one of the most important aspects of\nOlivi’s view is the connection between the freedom of the will\nand the evangelical vow’s renunciation of ownership understood\nas dominion (dominium). The idea that ownership is a form of\ndominion stems from a more general theory according to which freedom\nof the will can be understood as a dominion that one has over\none’s will. This dominion is extended to one’s body and\nexternal actions, and ultimately to external goods. Olivi thinks that\nthe Franciscan vow means not only giving up the dominion over external\ngoods but also over one’s own actions (obedience) and ultimately\none’s own freedom, as it means subjection to the will of God.\nYet, when someone voluntarily subjects his will to God, he\nparadoxically proclaims his ultimate freedom: the vow must be\ncontinuously renewed. The choice to give up the freedom of the will is\na voluntary choice that is freely given every moment as long as one\nkeeps to the vow (QPE, q. 8, p. 169; QPE, q. 14, p.\n135; Piron 1996; Toivanen 2016a).\n3.2.2 The nature of political power\n\nOne of the most important texts where Olivi deals with political\nphilosophy is his Quid ponat ius (= Summa IV q. 1). His aim in\nthis text is to provide a theoretical foundation for his discussion on\nthe sacraments, and he considers it useful to start with a detailed\nanalysis of the ontology of political power and property rights.\nAlthough it has been pointed out that Olivi seems to prefer a mixed\nform of government (Blythe 1992, pp. 151–52), this particular\ntext does not aim at offering a political theory; it is a\nphilosophical exercise in social ontology, which centers on a question\nconcerning the ontological foundation of relational terms such as\n‘right’ (ius), ‘authority’\n(auctoritas), ‘power’ (potestas),\n‘obligation’ (obligatio), and ‘property\nright’ (proprietas). (For discussion, see Piron 1996,\n2016; Rode 2014, 2016; Toivanen 2016a.)\n\nOlivi develops his view in relation to two opposing views. According\nto the first view, there must be something real in the end-terms of\nthese relations because otherwise they would not be real: “a\nrelation that posits nothing in the related things is only a relation\naccording to what is said (relatio secundum dici) […]\nbut it is clear that the power of a king, or any real jurisdiction, or\nobligation, or subordination of some people are really actual even\nwhen none of us thinks or talks about them” (Summa IV q.\n1, par. 7). The second view holds that relational properties such as\ndominium are radically different from natural properties, and\nthat no ontological change takes place when, for instance, someone is\ncrowned a king. Olivi seeks for a position between these two views,\nand he finds one when he argues that relations of this kind are based\non rationes reales (see\n § 2.1).\n They are real relations in the sense that they do not depend on\nsomeone actually thinking of them but they do not entail any real\n(Aristotelian) ontological addition to the relata.\n\nThe relation that a ruler has to the subjects is a form of dominion,\nand it it principally related to the will of the ruler:\n\n\nTherefore, since this kind of power does not add anything intrinsic to\nthe person of the king, it can relate to the whole person of the king\nin such a way that it will not determinately relate to any of his\npowers, unless it perhaps relates to the free will (liberum\narbitrium) and the powers that are bound to it, insofar as they\nare such. (Summa IV q. 1, par. 53)\n\n\nCoronation extends the dominion of the king over his subjects, and\nthis is due to the human ability to change the normative reality by\nestablishing new relations between human beings, between human beings\nand property, and so forth (Rode 2014, pp. 377–78). Although the\nnormative reality ultimately depends on the will of God and natural\nlaw (Rode 2016, pp. 117–19), the human will plays an important\nrole in the detailed explanation of how it works.\n3.2.3 Economic theory\n\nIn addition to his philosophical and theological ambitions, Olivi took\npart in a theoretical discussion concerning economic justice. He\ncomposed a short treatise Tractatus de contractibus (ed. Piron\n2012) while he was working at the Franciscan studium generale\nof Narbonne in mid-1290s. The work is a theoretical treatise that is\nrelated to the moral dimension of economic activities and it was\nprobably occasioned by pastoral duties that Franciscan friars had in\nan urban context. Although Olivi’s views can be traced back to\nearlier discussions on Roman and Canon law, as well as other works\ndealing with just price, scholars have also argued that his overall\napproach profoundly changed medieval economic theory (Kaye 1998, 2014;\nLangholm 1992, 1998; Piron 2012; Todeschini 2009; a more critical\nevaluation is Kirshner and Lo Prete 1984).\n\nIn De contractibus Olivi discusses several topics related to\nthe morality of economic activity, such as contracts, commerce, usury,\nvalue, and capital. The first question of the treatise serves as an\nillustrative example of his general approach to economics. It focuses\non the notion of just price, which Olivi analyzes with the intention\nof setting normative limits that regulate but do not completely\nprevent economic activity. As in Quid ponat ius, he proposes a\ntheory that reconciles two sets of opposing arguments. According to\nthe first set of arguments, a voluntary contract between a buyer and a\nseller suffices to establish a just price. The price the parties\nfreely agree upon is just, because any other way of setting the just\nprice would make commercial activities liable to immorality. Without\nfull knowledge of the just price, the buyer and the seller might\naccidentally deviate from it and thus sin. By contrast, the second set\nof arguments aims to prove that there must be objectively determinable\nlimits for the just price. Otherwise there might be a situation in\nwhich someone charges an extremely high price for a glass of water,\nand one who is dying of thirst pays it voluntarily, thereby making the\nprice just. Thus, all deviations from the objectively just price are\nagainst the principles of justice.\n\nOlivi treats just price in a similar way as usus pauper: it\ncannot be a pre-fixed and universally applicable single point but\nthere must be some amount of latitude and flexibility to it. He adopts\nthe Aristotelian idea of virtuous action as a middle-point between two\nopposing vices: just as virtue is not a fixed middle that can be known\na priori but depends on the context and situation, so just price has\nlimits but is open to variation due to various contextual factors.\n(Piron 2012, p. 45.) There are normative limits for the just\nprice—for instance, vital needs may force the buyer to agree on\na price that is unjust, but the seller should refrain from asking more\nthan a fair price. Yet, the flexibility of the limits of just price\nleave room for economic activity and allow merchants to profit, and\nwithin these limits the participants agree on the price freely. Olivi\nalso submits that if neither party deceives the other and both enter\nthe transaction freely (no compelling circumstances obtain), one may\neven give away one’s commodities for free.\n\nOlivi provides more detailed set of criteria for determining the\nlimits of just price in various situations in scholastic literature\n(Kaye 2014, p. 114). Among these criteria are the obvious quality of\nthe commodity, the materials and the amount of work needed to produce\nit, and rarity, but also individual desires and personal values (De\ncontractibus 1.1, pp. 98–102; Toivanen 2016b). Further, he\nargues that the just price is affected by social factors such as\ncommon estimation and common needs, and that ultimately economic\nactivity exists for the sake of the common good of the community\n(Tractatus de contractibus 1.2, pp. 108–10). In this way,\nOlivi’s analysis reflects the fact that medieval economic\ndiscourse was fundamentally normative and related to moral\ntheology—unlike contemporary economics, which is more\ndescriptive and lacks the normative dimension (Piron 2012).",
    "section_title": "3.2 Political Philosophy",
    "entry_title": "Peter John Olivi",
    "hierarchy_title": "Peter John Olivi || Practical Philosophy || Political Philosophy",
    "tokenized_text": [
        "practical",
        "philosophy",
        "political",
        "philosophy",
        "political",
        "philosophy",
        "poverty",
        "although",
        "olivi",
        "leave",
        "behind",
        "systematic",
        "treatise",
        "political",
        "philosophy",
        "work",
        "touched",
        "upon",
        "several",
        "politically",
        "loaded",
        "theological",
        "philosophical",
        "idea",
        "particular",
        "played",
        "central",
        "role",
        "controversy",
        "rigorously",
        "understand",
        "franciscan",
        "vow",
        "poverty",
        "would",
        "lasting",
        "effect",
        "medieval",
        "political",
        "reality",
        "burr",
        "although",
        "controversy",
        "centered",
        "franciscan",
        "poverty",
        "thus",
        "strongly",
        "motivated",
        "theological",
        "worry",
        "church",
        "politics",
        "difficult",
        "see",
        "several",
        "philosophical",
        "dimension",
        "instance",
        "argued",
        "modern",
        "conception",
        "subjective",
        "right",
        "first",
        "developed",
        "debate",
        "franciscan",
        "order",
        "pope",
        "correct",
        "interpretation",
        "poverty",
        "vow",
        "see",
        "eg",
        "van",
        "duffel",
        "franciscan",
        "held",
        "vow",
        "poverty",
        "requires",
        "renouncing",
        "ownership",
        "dominium",
        "using",
        "product",
        "owned",
        "someone",
        "else",
        "eg",
        "church",
        "violate",
        "vow",
        "however",
        "question",
        "divided",
        "latter",
        "half",
        "thirteenth",
        "century",
        "whether",
        "vow",
        "requires",
        "even",
        "merely",
        "using",
        "good",
        "another",
        "one",
        "adheres",
        "strict",
        "standard",
        "austerity",
        "socalled",
        "poor",
        "use",
        "usus",
        "pauper",
        "olivi",
        "insisted",
        "strict",
        "standard",
        "claimed",
        "part",
        "vow",
        "indeterminately",
        "mean",
        "first",
        "every",
        "violation",
        "mortal",
        "sin",
        "provided",
        "one",
        "general",
        "tendency",
        "strive",
        "spiritual",
        "humility",
        "living",
        "poorly",
        "also",
        "mean",
        "exactly",
        "count",
        "poor",
        "use",
        "depends",
        "circumstance",
        "situation",
        "since",
        "impossible",
        "find",
        "precise",
        "fixed",
        "line",
        "poor",
        "lax",
        "use",
        "commodity",
        "word",
        "olivi",
        "admitted",
        "certain",
        "latitude",
        "flexibility",
        "notion",
        "burr",
        "pp",
        "another",
        "central",
        "idea",
        "olivi",
        "one",
        "obey",
        "one",
        "superior",
        "obeying",
        "command",
        "entail",
        "sinful",
        "action",
        "violation",
        "franciscan",
        "vow",
        "thus",
        "endangering",
        "one",
        "salvation",
        "given",
        "olivi",
        "flexible",
        "view",
        "scope",
        "poor",
        "use",
        "last",
        "restriction",
        "make",
        "limit",
        "duty",
        "obedience",
        "disobedience",
        "vague",
        "individual",
        "friar",
        "must",
        "judge",
        "conscience",
        "whether",
        "obey",
        "disobey",
        "ultimately",
        "protest",
        "command",
        "superior",
        "surprising",
        "olivi",
        "theoretical",
        "model",
        "vow",
        "conjunction",
        "potential",
        "disobedience",
        "fueled",
        "political",
        "controversy",
        "within",
        "franciscan",
        "order",
        "church",
        "burr",
        "pp",
        "philosophical",
        "perspective",
        "one",
        "important",
        "aspect",
        "olivi",
        "view",
        "connection",
        "freedom",
        "evangelical",
        "vow",
        "renunciation",
        "ownership",
        "understood",
        "dominion",
        "dominium",
        "idea",
        "ownership",
        "form",
        "dominion",
        "stem",
        "general",
        "theory",
        "according",
        "freedom",
        "understood",
        "dominion",
        "one",
        "one",
        "dominion",
        "extended",
        "one",
        "body",
        "external",
        "action",
        "ultimately",
        "external",
        "good",
        "olivi",
        "think",
        "franciscan",
        "vow",
        "mean",
        "giving",
        "dominion",
        "external",
        "good",
        "also",
        "one",
        "action",
        "obedience",
        "ultimately",
        "one",
        "freedom",
        "mean",
        "subjection",
        "god",
        "yet",
        "someone",
        "voluntarily",
        "subject",
        "god",
        "paradoxically",
        "proclaims",
        "ultimate",
        "freedom",
        "vow",
        "must",
        "continuously",
        "renewed",
        "choice",
        "give",
        "freedom",
        "voluntary",
        "choice",
        "freely",
        "given",
        "every",
        "moment",
        "long",
        "one",
        "keep",
        "vow",
        "qpe",
        "q",
        "p",
        "qpe",
        "q",
        "p",
        "piron",
        "toivanen",
        "a",
        "nature",
        "political",
        "power",
        "one",
        "important",
        "text",
        "olivi",
        "deal",
        "political",
        "philosophy",
        "quid",
        "ponat",
        "ius",
        "summa",
        "iv",
        "q",
        "aim",
        "text",
        "provide",
        "theoretical",
        "foundation",
        "discussion",
        "sacrament",
        "considers",
        "useful",
        "start",
        "detailed",
        "analysis",
        "ontology",
        "political",
        "power",
        "property",
        "right",
        "although",
        "pointed",
        "olivi",
        "seems",
        "prefer",
        "mixed",
        "form",
        "government",
        "blythe",
        "pp",
        "particular",
        "text",
        "aim",
        "offering",
        "political",
        "theory",
        "philosophical",
        "exercise",
        "social",
        "ontology",
        "center",
        "question",
        "concerning",
        "ontological",
        "foundation",
        "relational",
        "term",
        "right",
        "ius",
        "authority",
        "auctoritas",
        "power",
        "potestas",
        "obligation",
        "obligatio",
        "property",
        "right",
        "proprietas",
        "discussion",
        "see",
        "piron",
        "rode",
        "toivanen",
        "a",
        "olivi",
        "develops",
        "view",
        "relation",
        "two",
        "opposing",
        "view",
        "according",
        "first",
        "view",
        "must",
        "something",
        "real",
        "endterms",
        "relation",
        "otherwise",
        "would",
        "real",
        "relation",
        "posit",
        "nothing",
        "related",
        "thing",
        "relation",
        "according",
        "said",
        "relatio",
        "secundum",
        "dici",
        "clear",
        "power",
        "king",
        "real",
        "jurisdiction",
        "obligation",
        "subordination",
        "people",
        "really",
        "actual",
        "even",
        "none",
        "u",
        "think",
        "talk",
        "summa",
        "iv",
        "q",
        "par",
        "second",
        "view",
        "hold",
        "relational",
        "property",
        "dominium",
        "radically",
        "different",
        "natural",
        "property",
        "ontological",
        "change",
        "take",
        "place",
        "instance",
        "someone",
        "crowned",
        "king",
        "olivi",
        "seek",
        "position",
        "two",
        "view",
        "find",
        "one",
        "argues",
        "relation",
        "kind",
        "based",
        "rationes",
        "real",
        "see",
        "real",
        "relation",
        "sense",
        "depend",
        "someone",
        "actually",
        "thinking",
        "entail",
        "real",
        "aristotelian",
        "ontological",
        "addition",
        "relatum",
        "relation",
        "ruler",
        "subject",
        "form",
        "dominion",
        "principally",
        "related",
        "ruler",
        "therefore",
        "since",
        "kind",
        "power",
        "add",
        "anything",
        "intrinsic",
        "person",
        "king",
        "relate",
        "whole",
        "person",
        "king",
        "way",
        "determinately",
        "relate",
        "power",
        "unless",
        "perhaps",
        "relates",
        "free",
        "liberum",
        "arbitrium",
        "power",
        "bound",
        "insofar",
        "summa",
        "iv",
        "q",
        "par",
        "coronation",
        "extends",
        "dominion",
        "king",
        "subject",
        "due",
        "human",
        "ability",
        "change",
        "normative",
        "reality",
        "establishing",
        "new",
        "relation",
        "human",
        "being",
        "human",
        "being",
        "property",
        "forth",
        "rode",
        "pp",
        "although",
        "normative",
        "reality",
        "ultimately",
        "depends",
        "god",
        "natural",
        "law",
        "rode",
        "pp",
        "human",
        "play",
        "important",
        "role",
        "detailed",
        "explanation",
        "work",
        "economic",
        "theory",
        "addition",
        "philosophical",
        "theological",
        "ambition",
        "olivi",
        "took",
        "part",
        "theoretical",
        "discussion",
        "concerning",
        "economic",
        "justice",
        "composed",
        "short",
        "treatise",
        "tractatus",
        "de",
        "contractibus",
        "ed",
        "piron",
        "working",
        "franciscan",
        "studium",
        "generale",
        "narbonne",
        "mids",
        "work",
        "theoretical",
        "treatise",
        "related",
        "moral",
        "dimension",
        "economic",
        "activity",
        "probably",
        "occasioned",
        "pastoral",
        "duty",
        "franciscan",
        "friar",
        "urban",
        "context",
        "although",
        "olivi",
        "view",
        "traced",
        "back",
        "earlier",
        "discussion",
        "roman",
        "canon",
        "law",
        "well",
        "work",
        "dealing",
        "price",
        "scholar",
        "also",
        "argued",
        "overall",
        "approach",
        "profoundly",
        "changed",
        "medieval",
        "economic",
        "theory",
        "kaye",
        "langholm",
        "piron",
        "todeschini",
        "critical",
        "evaluation",
        "kirshner",
        "lo",
        "prete",
        "de",
        "contractibus",
        "olivi",
        "discus",
        "several",
        "topic",
        "related",
        "morality",
        "economic",
        "activity",
        "contract",
        "commerce",
        "usury",
        "value",
        "capital",
        "first",
        "question",
        "treatise",
        "serf",
        "illustrative",
        "example",
        "general",
        "approach",
        "economics",
        "focus",
        "notion",
        "price",
        "olivi",
        "analyzes",
        "intention",
        "setting",
        "normative",
        "limit",
        "regulate",
        "completely",
        "prevent",
        "economic",
        "activity",
        "quid",
        "ponat",
        "ius",
        "proposes",
        "theory",
        "reconciles",
        "two",
        "set",
        "opposing",
        "argument",
        "according",
        "first",
        "set",
        "argument",
        "voluntary",
        "contract",
        "buyer",
        "seller",
        "suffices",
        "establish",
        "price",
        "price",
        "party",
        "freely",
        "agree",
        "upon",
        "way",
        "setting",
        "price",
        "would",
        "make",
        "commercial",
        "activity",
        "liable",
        "immorality",
        "without",
        "full",
        "knowledge",
        "price",
        "buyer",
        "seller",
        "might",
        "accidentally",
        "deviate",
        "thus",
        "sin",
        "contrast",
        "second",
        "set",
        "argument",
        "aim",
        "prove",
        "must",
        "objectively",
        "determinable",
        "limit",
        "price",
        "otherwise",
        "might",
        "situation",
        "someone",
        "charge",
        "extremely",
        "high",
        "price",
        "glass",
        "water",
        "one",
        "dying",
        "thirst",
        "pay",
        "voluntarily",
        "thereby",
        "making",
        "price",
        "thus",
        "deviation",
        "objectively",
        "price",
        "principle",
        "justice",
        "olivi",
        "treat",
        "price",
        "similar",
        "way",
        "usus",
        "pauper",
        "prefixed",
        "universally",
        "applicable",
        "single",
        "point",
        "must",
        "amount",
        "latitude",
        "flexibility",
        "adopts",
        "aristotelian",
        "idea",
        "virtuous",
        "action",
        "middlepoint",
        "two",
        "opposing",
        "vice",
        "virtue",
        "fixed",
        "middle",
        "known",
        "priori",
        "depends",
        "context",
        "situation",
        "price",
        "limit",
        "open",
        "variation",
        "due",
        "various",
        "contextual",
        "factor",
        "piron",
        "p",
        "normative",
        "limit",
        "pricefor",
        "instance",
        "vital",
        "need",
        "may",
        "force",
        "buyer",
        "agree",
        "price",
        "unjust",
        "seller",
        "refrain",
        "asking",
        "fair",
        "price",
        "yet",
        "flexibility",
        "limit",
        "price",
        "leave",
        "room",
        "economic",
        "activity",
        "allow",
        "merchant",
        "profit",
        "within",
        "limit",
        "participant",
        "agree",
        "price",
        "freely",
        "olivi",
        "also",
        "submits",
        "neither",
        "party",
        "deceives",
        "enter",
        "transaction",
        "freely",
        "compelling",
        "circumstance",
        "obtain",
        "one",
        "may",
        "even",
        "give",
        "away",
        "one",
        "commodity",
        "free",
        "olivi",
        "provides",
        "detailed",
        "set",
        "criterion",
        "determining",
        "limit",
        "price",
        "various",
        "situation",
        "scholastic",
        "literature",
        "kaye",
        "p",
        "among",
        "criterion",
        "obvious",
        "quality",
        "commodity",
        "material",
        "amount",
        "work",
        "needed",
        "produce",
        "rarity",
        "also",
        "individual",
        "desire",
        "personal",
        "value",
        "de",
        "contractibus",
        "pp",
        "toivanen",
        "b",
        "argues",
        "price",
        "affected",
        "social",
        "factor",
        "common",
        "estimation",
        "common",
        "need",
        "ultimately",
        "economic",
        "activity",
        "exists",
        "sake",
        "common",
        "good",
        "community",
        "tractatus",
        "de",
        "contractibus",
        "pp",
        "way",
        "olivi",
        "analysis",
        "reflects",
        "fact",
        "medieval",
        "economic",
        "discourse",
        "fundamentally",
        "normative",
        "related",
        "moral",
        "theologyunlike",
        "contemporary",
        "economics",
        "descriptive",
        "lack",
        "normative",
        "dimension",
        "piron"
    ]
}