{
    "main_text": "Current relevance of operationalism || Operationalism as a philosophy of extension\n3.2 Operationalism as a philosophy of extension\n\nAbove I presented a new operationalism as a promising framework for\nthe analysis of scientific practice. Do Bridgman’s ideas and\nattitudes also hold any current relevance for practicing \n scientists?[5]\nIt should have been clear from the discussion in Section 1 above that\nBridgman intended to reform scientific practice itself, not just its\nsecond-order analysis, so we must ask whether his reformist agenda has\nanything left in it for current science. To the casual reader, much of\nBridgman’s writing will seem like a series of radical complaints\nabout the meaninglessness of various concepts and statements. But he\nwas not interested in skeptical critique as an idle and indiscriminate\nphilosophical exercise. He got most worried when a concept was being\nextended to new situations where the familiar operations defining the\nconcept ceased to be applicable. His arguments often had an\niconoclastic flavor because he was exceptionally good at recognizing\nwhere a concept had been extended to new domains unthinkingly and most\npeople were not even aware that the extension had been made. From the\nmethodological lesson he took from Einstein to the insights gained in\nhis own high-pressure physics, an important focus of Bridgman’s\noperationalism was on regulating the extension of concepts to\nuncharted domains.\n\nBridgman reminded us forcefully that measurement operations did not\nhave unlimited domains of application, and that our conceptual\nstructures consequently had “joints” at which operational\nmeanings changed. But there can be no “joints” if there is\nno continuous tissue around the disjointed bones. Less metaphorically:\nif we reduce meaning entirely to measurement operations, there are no\npossible grounds for assuming or demanding any continuity of meaning\nwhere there is clear discontinuity in measurement operations. When we\nhave two different operations which give convergent results in the\noverlapping domain, how do we tell whether what we have is an\naccidental convergence of the measured values of two unrelated\nquantities, or a unified concept measured by two different methods?\nSome critics have maintained that only a recourse to theories can give\nus the answer (e.g., Lindsay 1937, 458; Gillies 1972, 23). That does\nnot seem to me always necessary, as theory is not the only source of\nsemantic continuity. There are instrumental operations that are not\nmetrological, and these operations can provide a continuity of meaning\nagainst which metrological validity can be judged (see Section 2.1).\nWe can take operationalism as a useful and practicable caution not to\nmake conceptual extensions without operational grounds.\n\nA homespun example from the 18th century illustrates this point\nnicely: the efforts of the English potter Josiah Wedgwood\n(1730–1795) to extend the temperature scale to cover the very\nhigh temperatures in his kilns, at which mercury vaporized and glass\nmelted. All previously known thermometers failed in that pyrometric\nrange, so Wedgwood felt obliged to invent a whole new measurement\nstandard (reminiscent of Bridgman in his high-pressure laboratory).\nWedgwood noticed that very high temperatures made pieces of clay\nshrink, and created a temperature scale by assuming that the amount of\ncontraction was proportional to temperature beyond “red\nheat”. As the start of his scale (red heat, defined as 0) was\nalready beyond the boiling point of mercury, Wedgwood’s scale\nwas wholly disconnected from the temperature scale defined by mercury\nthermometers. Later, in response to widespread demand to clarify the\nmeaning of his scale in more usual terms, Wedgwood made a translation\nof his scale into Fahrenheit degrees, by means of an intermediate\nstandard (thermal expansion of silver) which overlapped with the high\nend of the mercury scale and the low end of the clay scale. (This\nprocedure produced some unlikely numbers, for example 21,877°F for\nthe temperature of his air-furnace.) It seems that Wedgwood initially\ndid exactly what operationalist conscience would dictate: as the new\ninstrument did not operate at all in the range of any trustworthy\nprevious thermometers, he made a fresh scale. Why was that not the\nhonest thing to do, and quite sufficient, too? Why did everyone,\nincluding Wedgwood himself, feel compelled to interpret the Wedgwood\nclay scale in terms of the Fahrenheit mercury scale? Why was a\ncontinuous extension desired so strongly, when a disjointed set of\noperations seemed to serve all necessary practical purposes?\n\nThe urge for conceptual extension, in the Wedgwood case, was rooted in\na widespread feeling that there was a property in the\npyrometric range that was continuous in its meaning with temperature\nin the everyday range. Where did that feeling come from, long before\nthere was any well-defined and agreed-upon theoretical concept of\ntemperature? If we look closely at the situation, numerous subtle and\noften-unspoken connections do emerge between pyrometric temperature\nand everyday temperature. In the first place, we do bring objects to\npyrometric domains by prolonged heating—that is to say, by a\nprolonged application of ordinary processes that cause the rise of\ntemperature within the everyday domain. Likewise, the same causes of\ncooling that operate in the everyday domain will bring objects from\npyrometric temperatures down to everyday temperatures; that is\nprecisely what happens in calorimetric pyrometry (or, when we simply\nleave very hot things out in cold air for a while). These concrete\nphysical operations provide a continuity of operational meaning\nbetween two domains that are not connected by a common measurement\nstandard. Here again we need to articulate something that Bridgman\nalready did imply: not all instrumental operations are measurement\noperations (for instance, we may know how to make iron melt without\nthereby obtaining any precise idea of the temperature at which that\nhappens). Operational meaning even in the narrow, instrumental sense\nis broader than meaning specified by methods of measurement.\n\nThe connections listed above rest on very basic qualitative causal\nassumptions about temperature: fire raises the temperature of any\nordinary objects on which it acts directly; if two objects at\ndifferent temperatures are put in contact with each other, their\ntemperatures tend to approach each other. There are semi-quantitative\nlinks as well. It is taken for granted that the consumption of more\nfuel should result in the generation of more heat, and that is partly\nbased on a primitive notion of energy conservation. It is assumed that\nthe amount of heat communicated to an object is roughly proportional\nto the amount of change in its temperature (barring changes of state\nand interfering influences), and that assumption is based on the rough\nbut robust understanding of temperature as the “degree of\nheat.” So, for example, when a crucible is put on a steady fire,\none assumes that the temperature of its contents will rise steadily,\nup to a certain maximum. That is exactly the kind of reasoning used by\nthe chemist John Frederic Daniell (1790–1845) to criticize some\nof Wedgwood’s results:\n\nNow, any body almost knows, how very soon silver melts after it has\nattained a bright red heat, and every practical chemist has observed\nit to his cost, when working with silver crucibles. Neither the\nconsumption of fuel, nor the increase of the air-draught, necessary to\nproduce this effect, can warrant us in supposing that the fusing point\nof silver is 4 1/2 times higher than a red heat, fully visible in\nday-light. Neither on the same grounds, is it possible to admit that a\nfull red-heat being 1077°[F], and the welding heat of iron\n12,777°[F], that the fusing point of cast iron can be more than\n5000° higher. The welding of iron must surely be considered as\nincipient fusion. (quoted in Chang 2004, 149)\n\n\nSimilar types of rough assumptions were also used in the extension of\ntemperature to very low temperatures (beyond the freezing point of\nmercury and alcohol).\n\nThese cases illustrate that concepts can and do get extended to fresh\nnew domains in which theories are uncertain and experience scant, even\nif no definite measurement operations have been worked out. We start\nwith a concept with a secure net of uses giving it stable meaning in a\nrestricted domain of circumstances. The extension of such a concept\nconsists in giving it a secure net of uses, also credibly linked to\nthe earlier net, in an adjacent domain. Such extension can happen in\nall kinds of ways, including theoretical fiat and metaphysical\npresumption, but the operational method is the most assured one.\nSpecific, well-defined operations, whether they be instrumental,\nmental or paper-and-pencil type, can start a secure skeleton of\nmeaning in the new domain. With all the elements of new meaning\noperationally well-defined, it also becomes possible to attempt\nlinking them up with each other at each step along the way and check\nthe whole meaning for coherence. (Compare such a deliberate process\nwith the vague presumption that terms in a theoretical equation must\nhave the same meaning in the entire mathematical range given to the\nvariables.) Operationalism in this guise can be used as a secure\nmethod of conceptual extension, quite the opposite of the kind of\nfragmentation that Hempel feared. Such operationalism would not\ndestroy systematic unity; on the contrary, it is an optimal strategy\nfor achieving as much systematic unity as nature would allow, in a\nstrongly empiricist system of knowledge.\n",
    "section_title": "3.2 Operationalism as a philosophy of extension",
    "entry_title": "Operationalism",
    "hierarchy_title": "Operationalism || Current relevance of operationalism || Operationalism as a philosophy of extension",
    "tokenized_text": [
        "current",
        "relevance",
        "operationalism",
        "operationalism",
        "philosophy",
        "extension",
        "operationalism",
        "philosophy",
        "extension",
        "presented",
        "new",
        "operationalism",
        "promising",
        "framework",
        "analysis",
        "scientific",
        "practice",
        "bridgman",
        "idea",
        "attitude",
        "also",
        "hold",
        "current",
        "relevance",
        "practicing",
        "scientist",
        "clear",
        "discussion",
        "section",
        "bridgman",
        "intended",
        "reform",
        "scientific",
        "practice",
        "secondorder",
        "analysis",
        "must",
        "ask",
        "whether",
        "reformist",
        "agenda",
        "anything",
        "left",
        "current",
        "science",
        "casual",
        "reader",
        "much",
        "bridgman",
        "writing",
        "seem",
        "like",
        "series",
        "radical",
        "complaint",
        "meaninglessness",
        "various",
        "concept",
        "statement",
        "interested",
        "skeptical",
        "critique",
        "idle",
        "indiscriminate",
        "philosophical",
        "exercise",
        "got",
        "worried",
        "concept",
        "extended",
        "new",
        "situation",
        "familiar",
        "operation",
        "defining",
        "concept",
        "ceased",
        "applicable",
        "argument",
        "often",
        "iconoclastic",
        "flavor",
        "exceptionally",
        "good",
        "recognizing",
        "concept",
        "extended",
        "new",
        "domain",
        "unthinkingly",
        "people",
        "even",
        "aware",
        "extension",
        "made",
        "methodological",
        "lesson",
        "took",
        "einstein",
        "insight",
        "gained",
        "highpressure",
        "physic",
        "important",
        "focus",
        "bridgman",
        "operationalism",
        "regulating",
        "extension",
        "concept",
        "uncharted",
        "domain",
        "bridgman",
        "reminded",
        "u",
        "forcefully",
        "measurement",
        "operation",
        "unlimited",
        "domain",
        "application",
        "conceptual",
        "structure",
        "consequently",
        "joint",
        "operational",
        "meaning",
        "changed",
        "joint",
        "continuous",
        "tissue",
        "around",
        "disjointed",
        "bone",
        "le",
        "metaphorically",
        "reduce",
        "meaning",
        "entirely",
        "measurement",
        "operation",
        "possible",
        "ground",
        "assuming",
        "demanding",
        "continuity",
        "meaning",
        "clear",
        "discontinuity",
        "measurement",
        "operation",
        "two",
        "different",
        "operation",
        "give",
        "convergent",
        "result",
        "overlapping",
        "domain",
        "tell",
        "whether",
        "accidental",
        "convergence",
        "measured",
        "value",
        "two",
        "unrelated",
        "quantity",
        "unified",
        "concept",
        "measured",
        "two",
        "different",
        "method",
        "critic",
        "maintained",
        "recourse",
        "theory",
        "give",
        "u",
        "answer",
        "eg",
        "lindsay",
        "gillie",
        "seem",
        "always",
        "necessary",
        "theory",
        "source",
        "semantic",
        "continuity",
        "instrumental",
        "operation",
        "metrological",
        "operation",
        "provide",
        "continuity",
        "meaning",
        "metrological",
        "validity",
        "judged",
        "see",
        "section",
        "take",
        "operationalism",
        "useful",
        "practicable",
        "caution",
        "make",
        "conceptual",
        "extension",
        "without",
        "operational",
        "ground",
        "homespun",
        "example",
        "th",
        "century",
        "illustrates",
        "point",
        "nicely",
        "effort",
        "english",
        "potter",
        "josiah",
        "wedgwood",
        "extend",
        "temperature",
        "scale",
        "cover",
        "high",
        "temperature",
        "kiln",
        "mercury",
        "vaporized",
        "glass",
        "melted",
        "previously",
        "known",
        "thermometer",
        "failed",
        "pyrometric",
        "range",
        "wedgwood",
        "felt",
        "obliged",
        "invent",
        "whole",
        "new",
        "measurement",
        "standard",
        "reminiscent",
        "bridgman",
        "highpressure",
        "laboratory",
        "wedgwood",
        "noticed",
        "high",
        "temperature",
        "made",
        "piece",
        "clay",
        "shrink",
        "created",
        "temperature",
        "scale",
        "assuming",
        "amount",
        "contraction",
        "proportional",
        "temperature",
        "beyond",
        "red",
        "heat",
        "start",
        "scale",
        "red",
        "heat",
        "defined",
        "already",
        "beyond",
        "boiling",
        "point",
        "mercury",
        "wedgwood",
        "scale",
        "wholly",
        "disconnected",
        "temperature",
        "scale",
        "defined",
        "mercury",
        "thermometer",
        "later",
        "response",
        "widespread",
        "demand",
        "clarify",
        "meaning",
        "scale",
        "usual",
        "term",
        "wedgwood",
        "made",
        "translation",
        "scale",
        "fahrenheit",
        "degree",
        "mean",
        "intermediate",
        "standard",
        "thermal",
        "expansion",
        "silver",
        "overlapped",
        "high",
        "end",
        "mercury",
        "scale",
        "low",
        "end",
        "clay",
        "scale",
        "procedure",
        "produced",
        "unlikely",
        "number",
        "example",
        "f",
        "temperature",
        "airfurnace",
        "seems",
        "wedgwood",
        "initially",
        "exactly",
        "operationalist",
        "conscience",
        "would",
        "dictate",
        "new",
        "instrument",
        "operate",
        "range",
        "trustworthy",
        "previous",
        "thermometer",
        "made",
        "fresh",
        "scale",
        "honest",
        "thing",
        "quite",
        "sufficient",
        "everyone",
        "including",
        "wedgwood",
        "feel",
        "compelled",
        "interpret",
        "wedgwood",
        "clay",
        "scale",
        "term",
        "fahrenheit",
        "mercury",
        "scale",
        "continuous",
        "extension",
        "desired",
        "strongly",
        "disjointed",
        "set",
        "operation",
        "seemed",
        "serve",
        "necessary",
        "practical",
        "purpose",
        "urge",
        "conceptual",
        "extension",
        "wedgwood",
        "case",
        "rooted",
        "widespread",
        "feeling",
        "property",
        "pyrometric",
        "range",
        "continuous",
        "meaning",
        "temperature",
        "everyday",
        "range",
        "feeling",
        "come",
        "long",
        "welldefined",
        "agreedupon",
        "theoretical",
        "concept",
        "temperature",
        "look",
        "closely",
        "situation",
        "numerous",
        "subtle",
        "oftenunspoken",
        "connection",
        "emerge",
        "pyrometric",
        "temperature",
        "everyday",
        "temperature",
        "first",
        "place",
        "bring",
        "object",
        "pyrometric",
        "domain",
        "prolonged",
        "heatingthat",
        "say",
        "prolonged",
        "application",
        "ordinary",
        "process",
        "cause",
        "rise",
        "temperature",
        "within",
        "everyday",
        "domain",
        "likewise",
        "cause",
        "cooling",
        "operate",
        "everyday",
        "domain",
        "bring",
        "object",
        "pyrometric",
        "temperature",
        "everyday",
        "temperature",
        "precisely",
        "happens",
        "calorimetric",
        "pyrometry",
        "simply",
        "leave",
        "hot",
        "thing",
        "cold",
        "air",
        "concrete",
        "physical",
        "operation",
        "provide",
        "continuity",
        "operational",
        "meaning",
        "two",
        "domain",
        "connected",
        "common",
        "measurement",
        "standard",
        "need",
        "articulate",
        "something",
        "bridgman",
        "already",
        "imply",
        "instrumental",
        "operation",
        "measurement",
        "operation",
        "instance",
        "may",
        "know",
        "make",
        "iron",
        "melt",
        "without",
        "thereby",
        "obtaining",
        "precise",
        "idea",
        "temperature",
        "happens",
        "operational",
        "meaning",
        "even",
        "narrow",
        "instrumental",
        "sense",
        "broader",
        "meaning",
        "specified",
        "method",
        "measurement",
        "connection",
        "listed",
        "rest",
        "basic",
        "qualitative",
        "causal",
        "assumption",
        "temperature",
        "fire",
        "raise",
        "temperature",
        "ordinary",
        "object",
        "act",
        "directly",
        "two",
        "object",
        "different",
        "temperature",
        "put",
        "contact",
        "temperature",
        "tend",
        "approach",
        "semiquantitative",
        "link",
        "well",
        "taken",
        "granted",
        "consumption",
        "fuel",
        "result",
        "generation",
        "heat",
        "partly",
        "based",
        "primitive",
        "notion",
        "energy",
        "conservation",
        "assumed",
        "amount",
        "heat",
        "communicated",
        "object",
        "roughly",
        "proportional",
        "amount",
        "change",
        "temperature",
        "barring",
        "change",
        "state",
        "interfering",
        "influence",
        "assumption",
        "based",
        "rough",
        "robust",
        "understanding",
        "temperature",
        "degree",
        "heat",
        "example",
        "crucible",
        "put",
        "steady",
        "fire",
        "one",
        "assumes",
        "temperature",
        "content",
        "rise",
        "steadily",
        "certain",
        "maximum",
        "exactly",
        "kind",
        "reasoning",
        "used",
        "chemist",
        "john",
        "frederic",
        "daniell",
        "criticize",
        "wedgwood",
        "result",
        "body",
        "almost",
        "know",
        "soon",
        "silver",
        "melt",
        "attained",
        "bright",
        "red",
        "heat",
        "every",
        "practical",
        "chemist",
        "observed",
        "cost",
        "working",
        "silver",
        "crucible",
        "neither",
        "consumption",
        "fuel",
        "increase",
        "airdraught",
        "necessary",
        "produce",
        "effect",
        "warrant",
        "u",
        "supposing",
        "fusing",
        "point",
        "silver",
        "time",
        "higher",
        "red",
        "heat",
        "fully",
        "visible",
        "daylight",
        "neither",
        "ground",
        "possible",
        "admit",
        "full",
        "redheat",
        "f",
        "welding",
        "heat",
        "iron",
        "f",
        "fusing",
        "point",
        "cast",
        "iron",
        "higher",
        "welding",
        "iron",
        "must",
        "surely",
        "considered",
        "incipient",
        "fusion",
        "quoted",
        "chang",
        "similar",
        "type",
        "rough",
        "assumption",
        "also",
        "used",
        "extension",
        "temperature",
        "low",
        "temperature",
        "beyond",
        "freezing",
        "point",
        "mercury",
        "alcohol",
        "case",
        "illustrate",
        "concept",
        "get",
        "extended",
        "fresh",
        "new",
        "domain",
        "theory",
        "uncertain",
        "experience",
        "scant",
        "even",
        "definite",
        "measurement",
        "operation",
        "worked",
        "start",
        "concept",
        "secure",
        "net",
        "us",
        "giving",
        "stable",
        "meaning",
        "restricted",
        "domain",
        "circumstance",
        "extension",
        "concept",
        "consists",
        "giving",
        "secure",
        "net",
        "us",
        "also",
        "credibly",
        "linked",
        "earlier",
        "net",
        "adjacent",
        "domain",
        "extension",
        "happen",
        "kind",
        "way",
        "including",
        "theoretical",
        "fiat",
        "metaphysical",
        "presumption",
        "operational",
        "method",
        "assured",
        "one",
        "specific",
        "welldefined",
        "operation",
        "whether",
        "instrumental",
        "mental",
        "paperandpencil",
        "type",
        "start",
        "secure",
        "skeleton",
        "meaning",
        "new",
        "domain",
        "element",
        "new",
        "meaning",
        "operationally",
        "welldefined",
        "also",
        "becomes",
        "possible",
        "attempt",
        "linking",
        "step",
        "along",
        "way",
        "check",
        "whole",
        "meaning",
        "coherence",
        "compare",
        "deliberate",
        "process",
        "vague",
        "presumption",
        "term",
        "theoretical",
        "equation",
        "must",
        "meaning",
        "entire",
        "mathematical",
        "range",
        "given",
        "variable",
        "operationalism",
        "guise",
        "used",
        "secure",
        "method",
        "conceptual",
        "extension",
        "quite",
        "opposite",
        "kind",
        "fragmentation",
        "hempel",
        "feared",
        "operationalism",
        "would",
        "destroy",
        "systematic",
        "unity",
        "contrary",
        "optimal",
        "strategy",
        "achieving",
        "much",
        "systematic",
        "unity",
        "nature",
        "would",
        "allow",
        "strongly",
        "empiricist",
        "system",
        "knowledge"
    ]
}