{
    "main_text": "Inducements and Consent\n6. Exploitation, Instrumentalisation, and Objectification\n\n\nPerhaps the most commonly discussed objection to organ sale is the\nclaim that it is exploitative (Greasley 2014; Hughes 1998; Lawler\n2011, 2014; Wilkinson 2003). Saying what exploitation amounts to is\nitself a complex task, however, and I will not say much here about how\nit should be defined (see the SEP entry\non exploitation).  It is, however,\nworth noting that, on one view, defective (or invalid) consent is a\nnecessary condition for the occurrence of exploitation. Thus\n(according to this view) a transaction can only be exploitative if the\nputative victim of exploitation is coerced, lacking capacity,\nill-informed, or manipulated (or more generally, if there is some\nconsent-invalidating factor in play). If this view of the relationship\nbetween consent and exploitation were correct, then the discussion of\nexploitation could be ended here; for consent issues were dealt with\nin the previous section and the exploitation worry about organ sale\nwould only be worth taking seriously inasmuch as those consent\narguments discussed above were sound. However, not everyone thinks\nthat defective consent is required for there to be exploitation and so\nthere may be some mileage in looking independently at\nexploitation.\n\n\nSimilar thoughts apply to the unjust distribution of benefits and\nburdens. One view is that a transaction can only count as\nexploitative if the relevant benefits and burdens are unfairly\ndistributed in favour of the exploiter and/or against the\nexploited. With this in mind, Harris (1992, 120) usefully\ndistinguishes between two kinds of exploitation-claim. The\nfirst:\n\n\n… involves the idea of some disparity in the value of an\nexchange of goods and services.\n\n\nExploitation concerns of this kind, or at least most of them, can be\ntaken care of by utilizing some version of the Erin-Harris proposal\n(discussed above) since this is designed to ensure that organ\nsellers receive just rewards and adequate care, whilst also going a\nlong way towards ensuring that the distribution of organs to transplant\nrecipients is fair. And while there may be some practical\nobstacles to creating such a system there seem no reasons to suppose\nthat it is impossible in principle.\n\nThere is, however, another sense of ‘exploitation’.\nThis is:\n\n\n… the idea of wrongful use and may occur when there are\nno financial or commercial dimensions to the transaction. A classic\ncase here would be where it is claimed that lovers may exploit one\nanother, that is, use one another in some wrongful way. The most\nfamiliar of such wrongful ways in this context might be where it is\nclaimed that one partner uses the other or treats the other merely as a\n‘sex object’ (1992, 120).\n\n\n\nSimilarly Goodin (1987, 166) notes that:\n\n\n\nLovers can exploit one another just as surely as can economic\nclasses. Yet neither party in an affectionate relationship is\nfunctioning in any standard sense as a ‘factor of\nproduction’. Nor, since neither party is creating valuable\nobjects in any ordinary respect, does it in that context make much\nsense to define exploitation in the standard economics-based terms\n…\n\n\n\nSo it looks as if (in Harris's terms) ‘wrongful use’\nexploitation is independent of some of the usual concerns about\ndistributive justice and could persist even within a distributively\nfair organ sale system. Exploitation of this second kind is closely\nrelated to a number of other concepts or terms (Wilkinson 2003). One\nof these is\nobjectification: wrongfully treating something (or someone)\nthat is not a mere object as if it were a mere object. Another is\ninstrumentalisation, which can be similarly defined as\ntreating something (or someone) that is not a mere means as if it were\na mere means (Davis 2009). A third is commodification,\ntreating something (or someone) that is not a mere commodity as if it\nwere a mere commodity (Sandel 2012; Wilkinson 2000).  These ideas are\nclosely connected to the Kantian idea of dignity (Radin 1996). As\nDillon (2010) puts it, on this view:\n\n\nTo be a person is to have a status and worth that is unlike that of any\nother kind of being: it is to be an end in itself with dignity. And the\nonly response that is appropriate to such a being is respect.\n\n\n\nSo we have the claim that exploitation,\nobjectification, instrumentalisation, or commodification could occur within\ndistributively fair transactions. How might this apply in the\ncase of organ sale? Specifically, how could these ideas underpin\na sound moral argument against organ sale?\n\n\nIn common with some of the arguments considered earlier, attempts to\nuse these ideas in an argument against organ sale run up against two\nproblems. First, there is the similarity of (free) donation and\nsale. Let us say that someone objects to organ sale (even where\nthere is consent and distributive justice) on the grounds that the\nseller's body (organ) or the seller herself is objectified or\ninstrumentalised. This immediately raises the question of why the\nvery same consideration does not apply to (free) donation, which is\nstandardly thought to be admirable rather than morally dubious.\nFor in both cases, a part of the donor's (or vendor's) body\nis removed and treated (quite possibly solely) as a means by the\nrecipient and the transplant team.\n\n\nThen, second, there is the question of consent. For can we\nreally make sense of someone being instrumentalised or objectified (in\nthe relevant normative or pejorative senses of these terms) if what is\ndone to them is done with valid consent, and especially if what is done\nto them would not have been done but for their giving of valid\nconsent? So one possible principle that we might wish to endorse\nhere is that:\n\n\nIf A requires and obtains from B valid consent to\ndo x to B, that is sufficient to guarantee that, in\ndoing x to B, A does not wrongfully\ninstrumentalise or objectify B.\nOr, to put it another way, as with the other sort of\nexploitation discussed above, perhaps even instrumentalisation and\nobjectification turn out to rely on defective consent: or perhaps\nrather on the fact that the putative instrumentaliser (objectifier)\ndoes not care about or require valid consent. Alternatively we\nmight make this principle slightly more cautious and include a\nsubstantial harm constraint as follows:\n\n\nIf A requires and obtains from B valid consent to\ndo x to B,\nand if doing x to B will not substantially\nharm B, that is sufficient to guarantee that, in\ndoing x to B, A does not wrongfully\ninstrumentalise or objectify B.\nTo help think through these principles consider the case of Manuel\nWackenheim. Wackenheim is a (so-called) ‘dwarf’ who (until\na ban was imposed by the local mayor) made a living from being\n‘tossed’ by customers in bars and nightclubs. This\n‘tossing’ formed part of a dwarf throwing\ncompetition—a sport ‘in which the aim of the competitors\nis to fling a dwarf over the furthest distance possible’ (Millns\n1996, 375). Wackenheim appeared keen to pursue his chosen career and\ndidn't welcome the ban on dwarf throwing, saying ‘this spectacle\nis my life; I want to be allowed to do what I want’.\nWackenheim can be regarded both as intrinsically valuable\nas a person but also as instrumentally valuable as an object\n(specifically as a projectile). That is, there is no reason in\nprinciple why a friend of his could not both respect him as an\n‘end’ and recognise the fact that his body is formed in a\nway which makes it instrumentally valuable to ‘dwarf\nthrowers’. But could Wackenheim's friend actually use\nhim as a projectile, whilst at the same time respecting the fact\nthat he is a person or (in Kantian terms) an end-in-himself? It\nis the overall context of the relationship, along with other structural\nfeatures of the situation, which determine whether he is appropriately\nrespected. Surely this must be right, for it would be extraordinarily\nhard to argue plausibly that it is impossible, in all contexts, to use\nWackenheim as a projectile whilst at the same time respecting his\npersonhood. For what if he enjoys being thrown, gets paid for it, and\nfreely and knowingly consents to it? If for these reasons—i.e.,\nbecause I want to ensure that he derives pleasure and money, and am\ncertain that it is what he really wants etc.—I throw him, then\nthere seems no basis whatsoever for saying that I am failing to respect\nhis personhood. For in such a case, I am (let us assume) deliberately\ngiving him what he wants (and wants in a free, informed and otherwise\nautonomous way) and deliberately benefiting him. How can this be a\nfailure to recognise his status as an ‘end’?\n\n\nIt is difficult to see how it could be. Although we should add two\ncaveats. First, this doesn't rule out the existence of other\nseparate moral objections to ‘dwarf throwing’. Second,\nthere certainly are contexts in which this practice would constitute\nwrongful instrumentalisation. These may include cases in which the\npeople thrown are substantially harmed and cases in which they do not\nconsent or in which their consent is invalid. Indeed, this is the main\npoint. What does all the ethical work here is context: in particular\nissues relating to the existence and quality of the\n‘dwarf's’ consent—and perhaps also those\nrelating to harm and welfare.\n\n\nMuch the same goes for organ sale, or indeed (unpaid) organ\ndonation. When we look at a person with a view to using her\norgans for transplantation we are of course viewing at least the organ,\nor possibly even the person, as a means to an end, and as a useful\nobject. But this is not inconsistent with also respecting the\nperson's dignity and viewing her as an end-in-herself provided\nthat we take seriously the person's rational agency by requiring\nher valid consent for the organ removal and by ensuring that any risk\nof harm is minimized and reasonable. The particular issues for\norgan sale (as opposed to free donation) then turn out to be those\ndiscussed at length in previous sections. Perhaps there is an\nincreased risk that consent will be flawed in sale cases; if organ\nremoval proceeded without proper consent then that could be a failure\nto respect the person. And perhaps there is an increased risk\nthat harm will occur in sale cases; if so (and if the risk goes above a\ncertain level) then perhaps this also would constitute a failure to\nrespect the person. Thus the appeal to dignity,\ninstrumentalisation, and objectification would seem merely to amplify\nsome of the concerns aired previously about consent and\nharm.\n",
    "section_title": "6. Exploitation, Instrumentalisation, and Objectification",
    "entry_title": "The Sale of Human Organs",
    "hierarchy_title": "The Sale of Human Organs || Inducements and Consent",
    "tokenized_text": [
        "inducement",
        "consent",
        "exploitation",
        "instrumentalisation",
        "objectification",
        "perhaps",
        "commonly",
        "discussed",
        "objection",
        "organ",
        "sale",
        "claim",
        "exploitative",
        "greasley",
        "hughes",
        "lawler",
        "wilkinson",
        "saying",
        "exploitation",
        "amount",
        "complex",
        "task",
        "however",
        "say",
        "much",
        "defined",
        "see",
        "sep",
        "entry",
        "exploitation",
        "however",
        "worth",
        "noting",
        "one",
        "view",
        "defective",
        "invalid",
        "consent",
        "necessary",
        "condition",
        "occurrence",
        "exploitation",
        "thus",
        "according",
        "view",
        "transaction",
        "exploitative",
        "putative",
        "victim",
        "exploitation",
        "coerced",
        "lacking",
        "capacity",
        "illinformed",
        "manipulated",
        "generally",
        "consentinvalidating",
        "factor",
        "play",
        "view",
        "relationship",
        "consent",
        "exploitation",
        "correct",
        "discussion",
        "exploitation",
        "could",
        "ended",
        "consent",
        "issue",
        "dealt",
        "previous",
        "section",
        "exploitation",
        "worry",
        "organ",
        "sale",
        "would",
        "worth",
        "taking",
        "seriously",
        "inasmuch",
        "consent",
        "argument",
        "discussed",
        "sound",
        "however",
        "everyone",
        "think",
        "defective",
        "consent",
        "required",
        "exploitation",
        "may",
        "mileage",
        "looking",
        "independently",
        "exploitation",
        "similar",
        "thought",
        "apply",
        "unjust",
        "distribution",
        "benefit",
        "burden",
        "one",
        "view",
        "transaction",
        "count",
        "exploitative",
        "relevant",
        "benefit",
        "burden",
        "unfairly",
        "distributed",
        "favour",
        "exploiter",
        "andor",
        "exploited",
        "mind",
        "harris",
        "usefully",
        "distinguishes",
        "two",
        "kind",
        "exploitationclaim",
        "first",
        "involves",
        "idea",
        "disparity",
        "value",
        "exchange",
        "good",
        "service",
        "exploitation",
        "concern",
        "kind",
        "least",
        "taken",
        "care",
        "utilizing",
        "version",
        "erinharris",
        "proposal",
        "discussed",
        "since",
        "designed",
        "ensure",
        "organ",
        "seller",
        "receive",
        "reward",
        "adequate",
        "care",
        "whilst",
        "also",
        "going",
        "long",
        "way",
        "towards",
        "ensuring",
        "distribution",
        "organ",
        "transplant",
        "recipient",
        "fair",
        "may",
        "practical",
        "obstacle",
        "creating",
        "system",
        "seem",
        "reason",
        "suppose",
        "impossible",
        "principle",
        "however",
        "another",
        "sense",
        "exploitation",
        "idea",
        "wrongful",
        "use",
        "may",
        "occur",
        "financial",
        "commercial",
        "dimension",
        "transaction",
        "classic",
        "case",
        "would",
        "claimed",
        "lover",
        "may",
        "exploit",
        "one",
        "another",
        "use",
        "one",
        "another",
        "wrongful",
        "way",
        "familiar",
        "wrongful",
        "way",
        "context",
        "might",
        "claimed",
        "one",
        "partner",
        "us",
        "treat",
        "merely",
        "sex",
        "object",
        "similarly",
        "goodin",
        "note",
        "lover",
        "exploit",
        "one",
        "another",
        "surely",
        "economic",
        "class",
        "yet",
        "neither",
        "party",
        "affectionate",
        "relationship",
        "functioning",
        "standard",
        "sense",
        "factor",
        "production",
        "since",
        "neither",
        "party",
        "creating",
        "valuable",
        "object",
        "ordinary",
        "respect",
        "context",
        "make",
        "much",
        "sense",
        "define",
        "exploitation",
        "standard",
        "economicsbased",
        "term",
        "look",
        "harris",
        "s",
        "term",
        "wrongful",
        "use",
        "exploitation",
        "independent",
        "usual",
        "concern",
        "distributive",
        "justice",
        "could",
        "persist",
        "even",
        "within",
        "distributively",
        "fair",
        "organ",
        "sale",
        "system",
        "exploitation",
        "second",
        "kind",
        "closely",
        "related",
        "number",
        "concept",
        "term",
        "wilkinson",
        "one",
        "objectification",
        "wrongfully",
        "treating",
        "something",
        "someone",
        "mere",
        "object",
        "mere",
        "object",
        "another",
        "instrumentalisation",
        "similarly",
        "defined",
        "treating",
        "something",
        "someone",
        "mere",
        "mean",
        "mere",
        "mean",
        "davis",
        "third",
        "commodification",
        "treating",
        "something",
        "someone",
        "mere",
        "commodity",
        "mere",
        "commodity",
        "sandel",
        "wilkinson",
        "idea",
        "closely",
        "connected",
        "kantian",
        "idea",
        "dignity",
        "radin",
        "dillon",
        "put",
        "view",
        "person",
        "status",
        "worth",
        "unlike",
        "kind",
        "end",
        "dignity",
        "response",
        "appropriate",
        "respect",
        "claim",
        "exploitation",
        "objectification",
        "instrumentalisation",
        "commodification",
        "could",
        "occur",
        "within",
        "distributively",
        "fair",
        "transaction",
        "might",
        "apply",
        "case",
        "organ",
        "sale",
        "specifically",
        "could",
        "idea",
        "underpin",
        "sound",
        "moral",
        "argument",
        "organ",
        "sale",
        "common",
        "argument",
        "considered",
        "earlier",
        "attempt",
        "use",
        "idea",
        "argument",
        "organ",
        "sale",
        "run",
        "two",
        "problem",
        "first",
        "similarity",
        "free",
        "donation",
        "sale",
        "let",
        "u",
        "say",
        "someone",
        "object",
        "organ",
        "sale",
        "even",
        "consent",
        "distributive",
        "justice",
        "ground",
        "seller",
        "s",
        "body",
        "organ",
        "seller",
        "objectified",
        "instrumentalised",
        "immediately",
        "raise",
        "question",
        "consideration",
        "apply",
        "free",
        "donation",
        "standardly",
        "thought",
        "admirable",
        "rather",
        "morally",
        "dubious",
        "case",
        "part",
        "donor",
        "s",
        "vendor",
        "s",
        "body",
        "removed",
        "treated",
        "quite",
        "possibly",
        "solely",
        "mean",
        "recipient",
        "transplant",
        "team",
        "second",
        "question",
        "consent",
        "really",
        "make",
        "sense",
        "someone",
        "instrumentalised",
        "objectified",
        "relevant",
        "normative",
        "pejorative",
        "sens",
        "term",
        "done",
        "done",
        "valid",
        "consent",
        "especially",
        "done",
        "would",
        "done",
        "giving",
        "valid",
        "consent",
        "one",
        "possible",
        "principle",
        "might",
        "wish",
        "endorse",
        "requires",
        "obtains",
        "b",
        "valid",
        "consent",
        "x",
        "b",
        "sufficient",
        "guarantee",
        "x",
        "b",
        "wrongfully",
        "instrumentalise",
        "objectify",
        "b",
        "put",
        "another",
        "way",
        "sort",
        "exploitation",
        "discussed",
        "perhaps",
        "even",
        "instrumentalisation",
        "objectification",
        "turn",
        "rely",
        "defective",
        "consent",
        "perhaps",
        "rather",
        "fact",
        "putative",
        "instrumentaliser",
        "objectifier",
        "care",
        "require",
        "valid",
        "consent",
        "alternatively",
        "might",
        "make",
        "principle",
        "slightly",
        "cautious",
        "include",
        "substantial",
        "harm",
        "constraint",
        "follows",
        "requires",
        "obtains",
        "b",
        "valid",
        "consent",
        "x",
        "b",
        "x",
        "b",
        "substantially",
        "harm",
        "b",
        "sufficient",
        "guarantee",
        "x",
        "b",
        "wrongfully",
        "instrumentalise",
        "objectify",
        "b",
        "help",
        "think",
        "principle",
        "consider",
        "case",
        "manuel",
        "wackenheim",
        "wackenheim",
        "socalled",
        "dwarf",
        "ban",
        "imposed",
        "local",
        "mayor",
        "made",
        "living",
        "tossed",
        "customer",
        "bar",
        "nightclub",
        "tossing",
        "formed",
        "part",
        "dwarf",
        "throwing",
        "competitiona",
        "sport",
        "aim",
        "competitor",
        "fling",
        "dwarf",
        "furthest",
        "distance",
        "possible",
        "millns",
        "wackenheim",
        "appeared",
        "keen",
        "pursue",
        "chosen",
        "career",
        "nt",
        "welcome",
        "ban",
        "dwarf",
        "throwing",
        "saying",
        "spectacle",
        "life",
        "want",
        "allowed",
        "want",
        "wackenheim",
        "regarded",
        "intrinsically",
        "valuable",
        "person",
        "also",
        "instrumentally",
        "valuable",
        "object",
        "specifically",
        "projectile",
        "reason",
        "principle",
        "friend",
        "could",
        "respect",
        "end",
        "recognise",
        "fact",
        "body",
        "formed",
        "way",
        "make",
        "instrumentally",
        "valuable",
        "dwarf",
        "thrower",
        "could",
        "wackenheim",
        "s",
        "friend",
        "actually",
        "use",
        "projectile",
        "whilst",
        "time",
        "respecting",
        "fact",
        "person",
        "kantian",
        "term",
        "endinhimself",
        "overall",
        "context",
        "relationship",
        "along",
        "structural",
        "feature",
        "situation",
        "determine",
        "whether",
        "appropriately",
        "respected",
        "surely",
        "must",
        "right",
        "would",
        "extraordinarily",
        "hard",
        "argue",
        "plausibly",
        "impossible",
        "context",
        "use",
        "wackenheim",
        "projectile",
        "whilst",
        "time",
        "respecting",
        "personhood",
        "enjoys",
        "thrown",
        "get",
        "paid",
        "freely",
        "knowingly",
        "consent",
        "reasonsie",
        "want",
        "ensure",
        "derives",
        "pleasure",
        "money",
        "certain",
        "really",
        "want",
        "etci",
        "throw",
        "seems",
        "basis",
        "whatsoever",
        "saying",
        "failing",
        "respect",
        "personhood",
        "case",
        "let",
        "u",
        "assume",
        "deliberately",
        "giving",
        "want",
        "want",
        "free",
        "informed",
        "otherwise",
        "autonomous",
        "way",
        "deliberately",
        "benefiting",
        "failure",
        "recognise",
        "status",
        "end",
        "difficult",
        "see",
        "could",
        "although",
        "add",
        "two",
        "caveat",
        "first",
        "nt",
        "rule",
        "existence",
        "separate",
        "moral",
        "objection",
        "dwarf",
        "throwing",
        "second",
        "certainly",
        "context",
        "practice",
        "would",
        "constitute",
        "wrongful",
        "instrumentalisation",
        "may",
        "include",
        "case",
        "people",
        "thrown",
        "substantially",
        "harmed",
        "case",
        "consent",
        "consent",
        "invalid",
        "indeed",
        "main",
        "point",
        "ethical",
        "work",
        "context",
        "particular",
        "issue",
        "relating",
        "existence",
        "quality",
        "dwarf",
        "s",
        "consentand",
        "perhaps",
        "also",
        "relating",
        "harm",
        "welfare",
        "much",
        "go",
        "organ",
        "sale",
        "indeed",
        "unpaid",
        "organ",
        "donation",
        "look",
        "person",
        "view",
        "using",
        "organ",
        "transplantation",
        "course",
        "viewing",
        "least",
        "organ",
        "possibly",
        "even",
        "person",
        "mean",
        "end",
        "useful",
        "object",
        "inconsistent",
        "also",
        "respecting",
        "person",
        "s",
        "dignity",
        "viewing",
        "endinherself",
        "provided",
        "take",
        "seriously",
        "person",
        "s",
        "rational",
        "agency",
        "requiring",
        "valid",
        "consent",
        "organ",
        "removal",
        "ensuring",
        "risk",
        "harm",
        "minimized",
        "reasonable",
        "particular",
        "issue",
        "organ",
        "sale",
        "opposed",
        "free",
        "donation",
        "turn",
        "discussed",
        "length",
        "previous",
        "section",
        "perhaps",
        "increased",
        "risk",
        "consent",
        "flawed",
        "sale",
        "case",
        "organ",
        "removal",
        "proceeded",
        "without",
        "proper",
        "consent",
        "could",
        "failure",
        "respect",
        "person",
        "perhaps",
        "increased",
        "risk",
        "harm",
        "occur",
        "sale",
        "case",
        "risk",
        "go",
        "certain",
        "level",
        "perhaps",
        "also",
        "would",
        "constitute",
        "failure",
        "respect",
        "person",
        "thus",
        "appeal",
        "dignity",
        "instrumentalisation",
        "objectification",
        "would",
        "seem",
        "merely",
        "amplify",
        "concern",
        "aired",
        "previously",
        "consent",
        "harm"
    ]
}