{
    "main_text": "The Arguments for the Principles of Justice from the Original Position || The Argument from the Maximin Criterion (TJ, §§26–28)\n6.2 The Argument from the Maximin Criterion (TJ, §§26–28)\n\nDescribing the parties’ choice as a rational choice subject to\nthe reasonable constraints imposed by the original position allows\nRawls to invoke the theory of rational choice and decision under\nconditions of uncertainty. In rational choice theory there are a\nnumber of potential “strategies” or rules of choice that\nare more or less reliably used depending on the circumstances. One\nrule of choice—called “maximin”—directs that\nwe play it as safe as possible by choosing the alternative whose worst\noutcome leaves us better off than the worst outcome of all other\nalternatives. The aim is to “maximize the minimum” regret\nor loss to one’s position (measured in terms of welfare or, for\nRawls, one’s share of primary social goods). To follow this\nstrategy, Rawls says you should choose as if your enemy were to assign\nyour social position in whatever kind of society you end up in. By\ncontrast another strategy leads us to focus on the most advantaged\nposition and says we should “maximize the maximum”\npotential gain—“maximax”—and choose the\nalternative whose best outcome leaves us better off than all other\nalternatives. Which, if either, of these strategies is more sensible\nto use depends on the circumstances and many other factors.\n\nA third strategy advocated by orthodox Bayesian decision theory, says\nwe should always choose to directly maximize expected\nutility. To do so under conditions of uncertainty of outcomes,\nthe degree of uncertainty should be factored into one’s utility\nfunction, with probability estimates assigned to alternatives based on\nthe limited knowledge that one has. Given these subjective estimates\nof probability incorporated into one’s utility function, one can\nalways choose the alternative that maximizes expected\nutility. Since it simplifies matters to apply the same rule of choice\nto all decisions this is a highly attractive idea, so long as one can\naccept that it is normally safe to assume that that the maximization\nof expected utility leads over time to maximizing\nactual utility.\n\nWhat about those extremely rare instances where there is absolutely\nno basis upon which to make probability estimates? Suppose\nyou don’t even have a hunch regarding the greater likelihood of\none alternative over another. According to orthodox Bayesian decision\ntheory, the “principle of insufficient reason” should then\nbe observed; it says that when there is no reason to assign a greater\nlikelihood to one alternative rather than another, then an equal\nprobability is to be assigned to each potential outcome. This\nmakes sense on the assumption that if you have no more premonition of\nthe likelihood of one option rather than another, they are for all\nyou know equally likely to occur. By observing this rule of\nchoice consistently over time, a rational chooser presumably should\nmaximize expected individual utility, and hopefully actual utility as\nwell.\n\nWhat now is the appropriate decision rule to be used to choose\nprinciples of justice under conditions of complete uncertainty of\nprobabilities in Rawls’s original position? Rawls argues that,\ngiven the enormous gravity of choice in the original position, plus\nthe fact that the choice is not repeatable (there’s no\nopportunity to renegotiate or revise one’s decision), it is\nrational for the parties to follow the maximin strategy when choosing\nbetween the principles of justice and principles of average or\naggregate utility (or any other principles that do not guarantee basic\nrights, liberties, opportunities, and a social minimum). Not\nsurprisingly, following the maximin rule of choice results in choice\nof the principles of justice over the principles of utility (average\nor aggregate); for unlike utilitarianism, justice as fairness\nguarantees equal basic liberties, fair equal opportunities, and an\nadequate social minimum for all citizens.\n\nWhy does Rawls think maximin is the rational choice rule? Recall what\nis at stake in choice from the original position. The decision is not\nan ordinary choice. It is rather a unique and irrevocable choice where\nthe parties decide the basic structure of their society, or the kind\nof social world they will live in and the background conditions\nagainst which they will develop and pursue their aims. It is a kind of\nsuperchoice—an inimitable choice of the background conditions\nfor all one’s future choices. Rawls argues that because of the\nunique importance of the choice in the original\nposition—including the gravity of the choice, the fact that it\nis not renegotiable or repeatable, and the fact that it determines all\none’s future prospects—it is rational to follow the\nmaximin rule and choose the principles of justice. For should even the\nworst transpire, the principles of justice guarantee an adequate share\nof primary goods enabling one to maintain one’s conscientious\nconvictions and sincerest affections and pursue a wide range of\npermissible ends by protecting equal basic liberties and fair equal\nopportunities and guaranteeing an adequate social minimum of income\nand wealth. The principles of utility, by contrast, provide no\nguarantee of any of these benefits.\n\nRawls says that in general there are three conditions that must be met\nin order to make it rational to follow the maximin rule (TJ\n154–55/134 rev.). First, there should be no basis or at most a\nvery insecure basis upon which to make estimates of probabilities.\nSecond, the choice singled out by observing the maximin rule is an\nacceptable alternative we can live with, so that one cares relatively\nlittle by comparison for what is to be gained above the minimum\nconditions secured by the maximin choice. When this condition is\nsatisfied, then no matter what position one eventually ends up in, it\nis at least acceptable. The third condition for applying the maximin\nrule is that all the other alternatives have worse outcomes that we\ncould not accept and live with. Of these three conditions Rawls later\nsays that the first plays a minor role, and that it is the second and\nthird conditions that are crucial to the maximin argument for justice\nas fairness (JF 99). This seems to suggest that, even if the veil of\nignorance were not as thick and parties did have some degree of\nknowledge of the likelihood of ending up in one social position rather\nthan another, still it would be more rational to choose the principles\nof justice over the principle of utility.\n\nRawls contends all three conditions for the maximin strategy are\nsatisfied in the original position when choice is made between the\nprinciples of justice and the principle of utility (average and\naggregate). Because all one’s values, commitments, and future\nprospects are at stake in the original position, and there is no hope\nof renegotiating the outcome, a rational person would agree to the\nprinciples of justice instead of the principle of utility. For the\nprinciples of justice imply that no matter what position you occupy in\nsociety, you will have the rights and resources needed to maintain\nyour valued commitments and purposes, to effectively exercise your\ncapacities for rational and moral deliberation and action, and to\nmaintain your sense of self-respect as an equal citizen. With the\nprinciple of utility there is no such guarantee; everything is\n“up for grabs” (so to speak) and subject to loss if\nrequired by the greater sum of utilities. Conditions (2) and (3) for\napplying maximin are then satisfied in the comparison of justice as\nfairness with the principle of (average or aggregate) utility.\n\nIt is often claimed that Rawls’s parties are\n“risk-averse;” otherwise they would never follow the\nmaximin rule but would take a chance on riskier but more rewarding\noutcomes provided by the principle of utility. Thus, John Harsanyi\ncontends that it is more rational under conditions of complete\nuncertainty always to choose according to the principle of\ninsufficient reason and assume an equal probability of occupying any\nposition in society. When the equiprobability assumption is made, the\nparties in the original position would choose the principle of average\nutility instead of the principles of justice (Harsanyi 1975).\n\nRawls denies that the parties have a psychological disposition to\nrisk-aversion. They have no knowledge of their attitudes towards risk.\nHe argues however that it is rational to choose as if one\nwere risk averse under the highly exceptional circumstances of the\noriginal position. His point is that, while there is nothing rational\nabout a fixed disposition to risk aversion, it is nonetheless rational\nin some circumstances to choose conservatively to protect certain\nfundamental interests against loss or compromise. It does not make one\na risk averse person, but instead it is normally rational to purchase\nauto liability, health, and home insurance against accident or\ncalamity (assuming it is affordable). The original position is such a\nsituation writ large. Even if one knew in the original position that\nthe citizen one represents enjoys gambling and taking great risks,\nthis would still not be a reason to gamble with their rights,\nliberties and starting position in society. For if the high risktaker\nwere born into a traditional, repressive, or fundamentalist society,\nthey might never have an opportunity for gambling and taking other\nrisks they normally enjoy. It is rational then even for high\nrisktakers to choose conservatively in the original position and\nguarantee their future opportunities to gamble or otherwise take\nrisks.\n\nHarsanyi and other orthodox Bayesians contend that maximin is an\nirrational decision rule, and they provide ample examples. To take\nRawls’ own example, in a lottery where the loss and gain\nalternatives are either (0, n) or (1/n, 1) for all natural numbers n,\nmaximin says choose the latter alternative (1/n, 1). This is clearly\nirrational for almost any number n except very small numbers. (TJ 136\nrev.). But such examples do not suffice here; simply because maximin\nis under most circumstances irrational does not mean that it is\nnever rational. For example, suppose n>1 and you must have\n1/n to save you own life. Given the gravity of the circumstances, it\nwould be rational to choose conservatively since you are guaranteed\n1/n according to the maximin strategy, and there is no guarantee you\nwill survive if you choose according to the principle of insufficient\nreason.\n\nNo doubt maximin is an irrational strategy under most\ncircumstances of choice uncertainty, particularly under circumstances\nwhere we will have future opportunities to recoup our losses and\nchoose again. But these are not the circumstances of the original\nposition. Once the principles of justice are decided, they apply in\nperpetuity, and there is no opportunity to renegotiate or escape the\nsituation. One who relies on the equiprobability assumption in\nchoosing principles of justice in the original position is being\nfoolishly reckless given the gravity of choice at stake. It is not\nbeing risk-averse, but rather entirely rational to refuse to gamble\nwith one’s basic liberties, fair equal opportunities and\nadequate resources needed to pursue one’s most cherished ends\nand commitments, simply for the unknown chance of gaining the\nmarginally greater social powers, income and wealth that might be\navailable to some in a society governed entirely by the principle of\nutility.\n\nRawls exhibits the force of the maximin argument in discussing liberty\nof conscience. He says (TJ, sect. 33) that a person who is willing to\njeopardize their right to hold and practice their conscientious\nreligious, philosophical and moral convictions, all for the sake of\ngaining uncertain added benefits via the principle of utility, does\nnot know what it means to have conscientious beliefs, or at least does\nnot take such beliefs seriously (TJ 207–08/181–82 rev.). A\nrational person with convictions about what gives life meaning is not\nwilling to negotiate with and gamble away the right to hold and\nexpress those convictions and the freedom to act on them. After all\nwhat could be the basis for negotiation, for what could matter more\nthan the objects of one’s most sincere convictions and\ncommitments? Some people (e.g. some nihilists) may not have\nany conscientious convictions (except the belief that nothing\nis worthwhile) and are simply willing to act on impulse or on whatever\nthoughts and desires they happen to have at the moment. But behind the\nveil of ignorance no one knows whether they are such a person, and it\nwould be foolish to make this assumption. Knowing general facts about\nhuman propensities and sociability, the parties must take into account\nthat people normally have conscientious convictions and values and\ncommitments they are unwilling to compromise. (Besides, even the\nnihilist should want to protect the freedom to be a nihilist, to avoid\nending up in an intolerant religious society.) Thus it remains\nirrational to jeopardize basic liberties by choosing the principle of\nutility instead of the principles of justice.\n\nNone of this is to say that maximin is normally a rational choice\nstrategy. Rawls himself says it “is not, in general, a suitable\nguide for choices under uncertainty” (TJ 153). It is not even a\nrational strategy in the original position when the alternatives for\nchoice guarantee basic liberties, equal opportunities, and a social\nminimum guaranteed by the principle of average utility – see the\ndiscussion in the supplementary section:\n\nThe Argument for the Difference Principle\n\n\nin the supplementary document\n The Argument for the Difference Principle and the Four Stage Sequence.\n\nRawls relies upon the maximin argument mainly to argue for the first\nprinciple of justice and fair equality of opportunity. Other arguments\nare needed to support his claim that justice requires the social\nminimum be determined by the difference principle.\n",
    "section_title": "6.2 The Argument from the Maximin Criterion (TJ, §§26–28)",
    "entry_title": "Original Position",
    "hierarchy_title": "Original Position || The Arguments for the Principles of Justice from the Original Position || The Argument from the Maximin Criterion (TJ, §§26–28)",
    "tokenized_text": [
        "argument",
        "principle",
        "justice",
        "original",
        "position",
        "argument",
        "maximin",
        "criterion",
        "tj",
        "argument",
        "maximin",
        "criterion",
        "tj",
        "describing",
        "party",
        "choice",
        "rational",
        "choice",
        "subject",
        "reasonable",
        "constraint",
        "imposed",
        "original",
        "position",
        "allows",
        "rawls",
        "invoke",
        "theory",
        "rational",
        "choice",
        "decision",
        "condition",
        "uncertainty",
        "rational",
        "choice",
        "theory",
        "number",
        "potential",
        "strategy",
        "rule",
        "choice",
        "le",
        "reliably",
        "used",
        "depending",
        "circumstance",
        "one",
        "rule",
        "choicecalled",
        "maximin",
        "directs",
        "play",
        "safe",
        "possible",
        "choosing",
        "alternative",
        "whose",
        "worst",
        "outcome",
        "leaf",
        "u",
        "better",
        "worst",
        "outcome",
        "alternative",
        "aim",
        "maximize",
        "minimum",
        "regret",
        "loss",
        "one",
        "position",
        "measured",
        "term",
        "welfare",
        "rawls",
        "one",
        "share",
        "primary",
        "social",
        "good",
        "follow",
        "strategy",
        "rawls",
        "say",
        "choose",
        "enemy",
        "assign",
        "social",
        "position",
        "whatever",
        "kind",
        "society",
        "end",
        "contrast",
        "another",
        "strategy",
        "lead",
        "u",
        "focus",
        "advantaged",
        "position",
        "say",
        "maximize",
        "maximum",
        "potential",
        "gain",
        "maximax",
        "and",
        "choose",
        "alternative",
        "whose",
        "best",
        "outcome",
        "leaf",
        "u",
        "better",
        "alternative",
        "either",
        "strategy",
        "sensible",
        "use",
        "depends",
        "circumstance",
        "many",
        "factor",
        "third",
        "strategy",
        "advocated",
        "orthodox",
        "bayesian",
        "decision",
        "theory",
        "say",
        "always",
        "choose",
        "directly",
        "maximize",
        "expected",
        "utility",
        "condition",
        "uncertainty",
        "outcome",
        "degree",
        "uncertainty",
        "factored",
        "one",
        "utility",
        "function",
        "probability",
        "estimate",
        "assigned",
        "alternative",
        "based",
        "limited",
        "knowledge",
        "one",
        "given",
        "subjective",
        "estimate",
        "probability",
        "incorporated",
        "one",
        "utility",
        "function",
        "one",
        "always",
        "choose",
        "alternative",
        "maximizes",
        "expected",
        "utility",
        "since",
        "simplifies",
        "matter",
        "apply",
        "rule",
        "choice",
        "decision",
        "highly",
        "attractive",
        "idea",
        "long",
        "one",
        "accept",
        "normally",
        "safe",
        "assume",
        "maximization",
        "expected",
        "utility",
        "lead",
        "time",
        "maximizing",
        "actual",
        "utility",
        "extremely",
        "rare",
        "instance",
        "absolutely",
        "basis",
        "upon",
        "make",
        "probability",
        "estimate",
        "suppose",
        "even",
        "hunch",
        "regarding",
        "greater",
        "likelihood",
        "one",
        "alternative",
        "another",
        "according",
        "orthodox",
        "bayesian",
        "decision",
        "theory",
        "principle",
        "insufficient",
        "reason",
        "observed",
        "say",
        "reason",
        "assign",
        "greater",
        "likelihood",
        "one",
        "alternative",
        "rather",
        "another",
        "equal",
        "probability",
        "assigned",
        "potential",
        "outcome",
        "make",
        "sense",
        "assumption",
        "premonition",
        "likelihood",
        "one",
        "option",
        "rather",
        "another",
        "know",
        "equally",
        "likely",
        "occur",
        "observing",
        "rule",
        "choice",
        "consistently",
        "time",
        "rational",
        "chooser",
        "presumably",
        "maximize",
        "expected",
        "individual",
        "utility",
        "hopefully",
        "actual",
        "utility",
        "well",
        "appropriate",
        "decision",
        "rule",
        "used",
        "choose",
        "principle",
        "justice",
        "condition",
        "complete",
        "uncertainty",
        "probability",
        "rawls",
        "original",
        "position",
        "rawls",
        "argues",
        "given",
        "enormous",
        "gravity",
        "choice",
        "original",
        "position",
        "plus",
        "fact",
        "choice",
        "repeatable",
        "opportunity",
        "renegotiate",
        "revise",
        "one",
        "decision",
        "rational",
        "party",
        "follow",
        "maximin",
        "strategy",
        "choosing",
        "principle",
        "justice",
        "principle",
        "average",
        "aggregate",
        "utility",
        "principle",
        "guarantee",
        "basic",
        "right",
        "liberty",
        "opportunity",
        "social",
        "minimum",
        "surprisingly",
        "following",
        "maximin",
        "rule",
        "choice",
        "result",
        "choice",
        "principle",
        "justice",
        "principle",
        "utility",
        "average",
        "aggregate",
        "unlike",
        "utilitarianism",
        "justice",
        "fairness",
        "guarantee",
        "equal",
        "basic",
        "liberty",
        "fair",
        "equal",
        "opportunity",
        "adequate",
        "social",
        "minimum",
        "citizen",
        "rawls",
        "think",
        "maximin",
        "rational",
        "choice",
        "rule",
        "recall",
        "stake",
        "choice",
        "original",
        "position",
        "decision",
        "ordinary",
        "choice",
        "rather",
        "unique",
        "irrevocable",
        "choice",
        "party",
        "decide",
        "basic",
        "structure",
        "society",
        "kind",
        "social",
        "world",
        "live",
        "background",
        "condition",
        "develop",
        "pursue",
        "aim",
        "kind",
        "superchoicean",
        "inimitable",
        "choice",
        "background",
        "condition",
        "one",
        "future",
        "choice",
        "rawls",
        "argues",
        "unique",
        "importance",
        "choice",
        "original",
        "positionincluding",
        "gravity",
        "choice",
        "fact",
        "renegotiable",
        "repeatable",
        "fact",
        "determines",
        "one",
        "future",
        "prospectsit",
        "rational",
        "follow",
        "maximin",
        "rule",
        "choose",
        "principle",
        "justice",
        "even",
        "worst",
        "transpire",
        "principle",
        "justice",
        "guarantee",
        "adequate",
        "share",
        "primary",
        "good",
        "enabling",
        "one",
        "maintain",
        "one",
        "conscientious",
        "conviction",
        "sincerest",
        "affection",
        "pursue",
        "wide",
        "range",
        "permissible",
        "end",
        "protecting",
        "equal",
        "basic",
        "liberty",
        "fair",
        "equal",
        "opportunity",
        "guaranteeing",
        "adequate",
        "social",
        "minimum",
        "income",
        "wealth",
        "principle",
        "utility",
        "contrast",
        "provide",
        "guarantee",
        "benefit",
        "rawls",
        "say",
        "general",
        "three",
        "condition",
        "must",
        "met",
        "order",
        "make",
        "rational",
        "follow",
        "maximin",
        "rule",
        "tj",
        "rev",
        "first",
        "basis",
        "insecure",
        "basis",
        "upon",
        "make",
        "estimate",
        "probability",
        "second",
        "choice",
        "singled",
        "observing",
        "maximin",
        "rule",
        "acceptable",
        "alternative",
        "live",
        "one",
        "care",
        "relatively",
        "little",
        "comparison",
        "gained",
        "minimum",
        "condition",
        "secured",
        "maximin",
        "choice",
        "condition",
        "satisfied",
        "matter",
        "position",
        "one",
        "eventually",
        "end",
        "least",
        "acceptable",
        "third",
        "condition",
        "applying",
        "maximin",
        "rule",
        "alternative",
        "worse",
        "outcome",
        "could",
        "accept",
        "live",
        "three",
        "condition",
        "rawls",
        "later",
        "say",
        "first",
        "play",
        "minor",
        "role",
        "second",
        "third",
        "condition",
        "crucial",
        "maximin",
        "argument",
        "justice",
        "fairness",
        "jf",
        "seems",
        "suggest",
        "even",
        "veil",
        "ignorance",
        "thick",
        "party",
        "degree",
        "knowledge",
        "likelihood",
        "ending",
        "one",
        "social",
        "position",
        "rather",
        "another",
        "still",
        "would",
        "rational",
        "choose",
        "principle",
        "justice",
        "principle",
        "utility",
        "rawls",
        "contends",
        "three",
        "condition",
        "maximin",
        "strategy",
        "satisfied",
        "original",
        "position",
        "choice",
        "made",
        "principle",
        "justice",
        "principle",
        "utility",
        "average",
        "aggregate",
        "one",
        "value",
        "commitment",
        "future",
        "prospect",
        "stake",
        "original",
        "position",
        "hope",
        "renegotiating",
        "outcome",
        "rational",
        "person",
        "would",
        "agree",
        "principle",
        "justice",
        "instead",
        "principle",
        "utility",
        "principle",
        "justice",
        "imply",
        "matter",
        "position",
        "occupy",
        "society",
        "right",
        "resource",
        "needed",
        "maintain",
        "valued",
        "commitment",
        "purpose",
        "effectively",
        "exercise",
        "capacity",
        "rational",
        "moral",
        "deliberation",
        "action",
        "maintain",
        "sense",
        "selfrespect",
        "equal",
        "citizen",
        "principle",
        "utility",
        "guarantee",
        "everything",
        "grab",
        "speak",
        "subject",
        "loss",
        "required",
        "greater",
        "sum",
        "utility",
        "condition",
        "applying",
        "maximin",
        "satisfied",
        "comparison",
        "justice",
        "fairness",
        "principle",
        "average",
        "aggregate",
        "utility",
        "often",
        "claimed",
        "rawls",
        "party",
        "riskaverse",
        "otherwise",
        "would",
        "never",
        "follow",
        "maximin",
        "rule",
        "would",
        "take",
        "chance",
        "riskier",
        "rewarding",
        "outcome",
        "provided",
        "principle",
        "utility",
        "thus",
        "john",
        "harsanyi",
        "contends",
        "rational",
        "condition",
        "complete",
        "uncertainty",
        "always",
        "choose",
        "according",
        "principle",
        "insufficient",
        "reason",
        "assume",
        "equal",
        "probability",
        "occupying",
        "position",
        "society",
        "equiprobability",
        "assumption",
        "made",
        "party",
        "original",
        "position",
        "would",
        "choose",
        "principle",
        "average",
        "utility",
        "instead",
        "principle",
        "justice",
        "harsanyi",
        "rawls",
        "denies",
        "party",
        "psychological",
        "disposition",
        "riskaversion",
        "knowledge",
        "attitude",
        "towards",
        "risk",
        "argues",
        "however",
        "rational",
        "choose",
        "one",
        "risk",
        "averse",
        "highly",
        "exceptional",
        "circumstance",
        "original",
        "position",
        "point",
        "nothing",
        "rational",
        "fixed",
        "disposition",
        "risk",
        "aversion",
        "nonetheless",
        "rational",
        "circumstance",
        "choose",
        "conservatively",
        "protect",
        "certain",
        "fundamental",
        "interest",
        "loss",
        "compromise",
        "make",
        "one",
        "risk",
        "averse",
        "person",
        "instead",
        "normally",
        "rational",
        "purchase",
        "auto",
        "liability",
        "health",
        "home",
        "insurance",
        "accident",
        "calamity",
        "assuming",
        "affordable",
        "original",
        "position",
        "situation",
        "writ",
        "large",
        "even",
        "one",
        "knew",
        "original",
        "position",
        "citizen",
        "one",
        "represents",
        "enjoys",
        "gambling",
        "taking",
        "great",
        "risk",
        "would",
        "still",
        "reason",
        "gamble",
        "right",
        "liberty",
        "starting",
        "position",
        "society",
        "high",
        "risktaker",
        "born",
        "traditional",
        "repressive",
        "fundamentalist",
        "society",
        "might",
        "never",
        "opportunity",
        "gambling",
        "taking",
        "risk",
        "normally",
        "enjoy",
        "rational",
        "even",
        "high",
        "risktakers",
        "choose",
        "conservatively",
        "original",
        "position",
        "guarantee",
        "future",
        "opportunity",
        "gamble",
        "otherwise",
        "take",
        "risk",
        "harsanyi",
        "orthodox",
        "bayesians",
        "contend",
        "maximin",
        "irrational",
        "decision",
        "rule",
        "provide",
        "ample",
        "example",
        "take",
        "rawls",
        "example",
        "lottery",
        "loss",
        "gain",
        "alternative",
        "either",
        "n",
        "n",
        "natural",
        "number",
        "n",
        "maximin",
        "say",
        "choose",
        "latter",
        "alternative",
        "n",
        "clearly",
        "irrational",
        "almost",
        "number",
        "n",
        "except",
        "small",
        "number",
        "tj",
        "rev",
        "example",
        "suffice",
        "simply",
        "maximin",
        "circumstance",
        "irrational",
        "mean",
        "never",
        "rational",
        "example",
        "suppose",
        "n",
        "must",
        "n",
        "save",
        "life",
        "given",
        "gravity",
        "circumstance",
        "would",
        "rational",
        "choose",
        "conservatively",
        "since",
        "guaranteed",
        "n",
        "according",
        "maximin",
        "strategy",
        "guarantee",
        "survive",
        "choose",
        "according",
        "principle",
        "insufficient",
        "reason",
        "doubt",
        "maximin",
        "irrational",
        "strategy",
        "circumstance",
        "choice",
        "uncertainty",
        "particularly",
        "circumstance",
        "future",
        "opportunity",
        "recoup",
        "loss",
        "choose",
        "circumstance",
        "original",
        "position",
        "principle",
        "justice",
        "decided",
        "apply",
        "perpetuity",
        "opportunity",
        "renegotiate",
        "escape",
        "situation",
        "one",
        "relies",
        "equiprobability",
        "assumption",
        "choosing",
        "principle",
        "justice",
        "original",
        "position",
        "foolishly",
        "reckless",
        "given",
        "gravity",
        "choice",
        "stake",
        "riskaverse",
        "rather",
        "entirely",
        "rational",
        "refuse",
        "gamble",
        "one",
        "basic",
        "liberty",
        "fair",
        "equal",
        "opportunity",
        "adequate",
        "resource",
        "needed",
        "pursue",
        "one",
        "cherished",
        "end",
        "commitment",
        "simply",
        "unknown",
        "chance",
        "gaining",
        "marginally",
        "greater",
        "social",
        "power",
        "income",
        "wealth",
        "might",
        "available",
        "society",
        "governed",
        "entirely",
        "principle",
        "utility",
        "rawls",
        "exhibit",
        "force",
        "maximin",
        "argument",
        "discussing",
        "liberty",
        "conscience",
        "say",
        "tj",
        "sect",
        "person",
        "willing",
        "jeopardize",
        "right",
        "hold",
        "practice",
        "conscientious",
        "religious",
        "philosophical",
        "moral",
        "conviction",
        "sake",
        "gaining",
        "uncertain",
        "added",
        "benefit",
        "via",
        "principle",
        "utility",
        "know",
        "mean",
        "conscientious",
        "belief",
        "least",
        "take",
        "belief",
        "seriously",
        "tj",
        "rev",
        "rational",
        "person",
        "conviction",
        "give",
        "life",
        "meaning",
        "willing",
        "negotiate",
        "gamble",
        "away",
        "right",
        "hold",
        "express",
        "conviction",
        "freedom",
        "act",
        "could",
        "basis",
        "negotiation",
        "could",
        "matter",
        "object",
        "one",
        "sincere",
        "conviction",
        "commitment",
        "people",
        "eg",
        "nihilist",
        "may",
        "conscientious",
        "conviction",
        "except",
        "belief",
        "nothing",
        "worthwhile",
        "simply",
        "willing",
        "act",
        "impulse",
        "whatever",
        "thought",
        "desire",
        "happen",
        "moment",
        "behind",
        "veil",
        "ignorance",
        "one",
        "know",
        "whether",
        "person",
        "would",
        "foolish",
        "make",
        "assumption",
        "knowing",
        "general",
        "fact",
        "human",
        "propensity",
        "sociability",
        "party",
        "must",
        "take",
        "account",
        "people",
        "normally",
        "conscientious",
        "conviction",
        "value",
        "commitment",
        "unwilling",
        "compromise",
        "besides",
        "even",
        "nihilist",
        "want",
        "protect",
        "freedom",
        "nihilist",
        "avoid",
        "ending",
        "intolerant",
        "religious",
        "society",
        "thus",
        "remains",
        "irrational",
        "jeopardize",
        "basic",
        "liberty",
        "choosing",
        "principle",
        "utility",
        "instead",
        "principle",
        "justice",
        "none",
        "say",
        "maximin",
        "normally",
        "rational",
        "choice",
        "strategy",
        "rawls",
        "say",
        "general",
        "suitable",
        "guide",
        "choice",
        "uncertainty",
        "tj",
        "even",
        "rational",
        "strategy",
        "original",
        "position",
        "alternative",
        "choice",
        "guarantee",
        "basic",
        "liberty",
        "equal",
        "opportunity",
        "social",
        "minimum",
        "guaranteed",
        "principle",
        "average",
        "utility",
        "see",
        "discussion",
        "supplementary",
        "section",
        "argument",
        "difference",
        "principle",
        "supplementary",
        "document",
        "argument",
        "difference",
        "principle",
        "four",
        "stage",
        "sequence",
        "rawls",
        "relies",
        "upon",
        "maximin",
        "argument",
        "mainly",
        "argue",
        "first",
        "principle",
        "justice",
        "fair",
        "equality",
        "opportunity",
        "argument",
        "needed",
        "support",
        "claim",
        "justice",
        "requires",
        "social",
        "minimum",
        "determined",
        "difference",
        "principle"
    ]
}