{
    "main_text": "\n\nOrigen (c. 185–c. 253) was a Christian exegete and theologian,\nwho made copious use of the allegorical method in his commentaries,\nand (though later considered a heretic) laid the foundations of\nphilosophical theology for the church. He was taught by a certain\nAmmonius, whom the majority of scholars identify as Ammonius Saccas,\nthe teacher of Plotinus; many believe, however, that the external\nevidence will not allow us to identify him with the Origen whom\nPlotinus knew as a colleague. He was certainly well-instructed in\nphilosophy and made use of it as an ancillary to the exposition and\nharmonization of scripture. This was the task that he undertook in\nmost of his extant writings, and the more systematic theology is\nfounded on the ecclesiastical doctrines of the Trinity, the\nincarnation, salvation after death and the inerrancy of scripture.\n\nOrigen was the first Christian to speak of three\n“hypostases” in the Trinity and to use the term\nhomoousios (though only by analogy) of the relation between\nthe second of these hypostases and the first. The Father, or first\nperson, is nevertheless the only one who is autotheos, God in\nthe fullest sense, whereas the Son is his dunamis or power\nand the Spirit a dependent being, operative only in the elect. All\nthree are eternal and incorporeal, the Son being known as Wisdom in\nrelation to the Father and Logos (reason, word) in relation to the\nworld. In this capacity he is the shepherd of rational beings the\nlogikoi, who, according to his later critics, were said in\nhis lost writings to have been in origin incorporeal beings coeval\nwith the world if not eternal, and currently imprisoned in material\nbodies only because of a cooling in their love. It is not so easy to\ndemonstrate from his extant works that he held the material world in\nsuch contempt, though he certainly holds it to be created out of\nnothing and suspects that the concept of matter is philosophically\nredundant. Souls, in his view, are sent down into bodies (perhaps\nnever more than once, though again some critics impute to him a\ndoctrine of transmigration or chronic falling away from bliss). The\nsoul remains indefeasibly free in its choices, and the misuse of this\nfreedom is the cause of its captivity to the devil.\n\nThe deliverance of the soul is effected by the incarnation of the\nLogos, or second person of the Trinity, who assumes real body but\nremains fully God. His death on the Cross is a ransom to the devil,\nand his resurrection prefigures that of the saints, though he seems to\nimagine the body after death, in Platonic terms, as a tenuous vehicle\nof the soul. Scholars differ as to whether he envisages a final\nabsorption of the body into incorporeal spirit. It is clear that he\nexpects the vast majority of souls to endure a fiery purification\nafter death, and that no soul will be excluded by God’s will\nfrom this purgatory. While he thinks it possible that some may be too\ndebauched by their sins to repent, he also opines that the devil\nhimself will at last make peace with God, though he cannot attain\nbeatitude. In the present life, an anticipation of bliss in the\npresence of Christ can be enjoyed by the exegete who has fully\nmastered the spiritual meaning of the scriptures. These are the word\nof God to us because Christ the word is ubiquitously present in them,\ninvesting them with a threefold sense as he himself assumed body, soul\nand spirit for our sake in his sojourn on earth.\n",
    "section_title": "Preamble",
    "entry_title": "Origen",
    "hierarchy_title": "Origen || Preamble",
    "tokenized_text": [
        "origen",
        "c",
        "c",
        "christian",
        "exegete",
        "theologian",
        "made",
        "copious",
        "use",
        "allegorical",
        "method",
        "commentary",
        "though",
        "later",
        "considered",
        "heretic",
        "laid",
        "foundation",
        "philosophical",
        "theology",
        "church",
        "taught",
        "certain",
        "ammonius",
        "majority",
        "scholar",
        "identify",
        "ammonius",
        "saccas",
        "teacher",
        "plotinus",
        "many",
        "believe",
        "however",
        "external",
        "evidence",
        "allow",
        "u",
        "identify",
        "origen",
        "plotinus",
        "knew",
        "colleague",
        "certainly",
        "wellinstructed",
        "philosophy",
        "made",
        "use",
        "ancillary",
        "exposition",
        "harmonization",
        "scripture",
        "task",
        "undertook",
        "extant",
        "writing",
        "systematic",
        "theology",
        "founded",
        "ecclesiastical",
        "doctrine",
        "trinity",
        "incarnation",
        "salvation",
        "death",
        "inerrancy",
        "scripture",
        "origen",
        "first",
        "christian",
        "speak",
        "three",
        "hypostasis",
        "trinity",
        "use",
        "term",
        "homoousios",
        "though",
        "analogy",
        "relation",
        "second",
        "hypostasis",
        "first",
        "father",
        "first",
        "person",
        "nevertheless",
        "one",
        "autotheos",
        "god",
        "fullest",
        "sense",
        "whereas",
        "son",
        "dunamis",
        "power",
        "spirit",
        "dependent",
        "operative",
        "elect",
        "three",
        "eternal",
        "incorporeal",
        "son",
        "known",
        "wisdom",
        "relation",
        "father",
        "logo",
        "reason",
        "word",
        "relation",
        "world",
        "capacity",
        "shepherd",
        "rational",
        "being",
        "logikoi",
        "according",
        "later",
        "critic",
        "said",
        "lost",
        "writing",
        "origin",
        "incorporeal",
        "being",
        "coeval",
        "world",
        "eternal",
        "currently",
        "imprisoned",
        "material",
        "body",
        "cooling",
        "love",
        "easy",
        "demonstrate",
        "extant",
        "work",
        "held",
        "material",
        "world",
        "contempt",
        "though",
        "certainly",
        "hold",
        "created",
        "nothing",
        "suspect",
        "concept",
        "matter",
        "philosophically",
        "redundant",
        "soul",
        "view",
        "sent",
        "body",
        "perhaps",
        "never",
        "though",
        "critic",
        "impute",
        "doctrine",
        "transmigration",
        "chronic",
        "falling",
        "away",
        "bliss",
        "soul",
        "remains",
        "indefeasibly",
        "free",
        "choice",
        "misuse",
        "freedom",
        "cause",
        "captivity",
        "devil",
        "deliverance",
        "soul",
        "effected",
        "incarnation",
        "logo",
        "second",
        "person",
        "trinity",
        "assumes",
        "real",
        "body",
        "remains",
        "fully",
        "god",
        "death",
        "cross",
        "ransom",
        "devil",
        "resurrection",
        "prefigures",
        "saint",
        "though",
        "seems",
        "imagine",
        "body",
        "death",
        "platonic",
        "term",
        "tenuous",
        "vehicle",
        "soul",
        "scholar",
        "differ",
        "whether",
        "envisages",
        "final",
        "absorption",
        "body",
        "incorporeal",
        "spirit",
        "clear",
        "expects",
        "vast",
        "majority",
        "soul",
        "endure",
        "fiery",
        "purification",
        "death",
        "soul",
        "excluded",
        "god",
        "purgatory",
        "think",
        "possible",
        "may",
        "debauched",
        "sin",
        "repent",
        "also",
        "opines",
        "devil",
        "last",
        "make",
        "peace",
        "god",
        "though",
        "attain",
        "beatitude",
        "present",
        "life",
        "anticipation",
        "bliss",
        "presence",
        "christ",
        "enjoyed",
        "exegete",
        "fully",
        "mastered",
        "spiritual",
        "meaning",
        "scripture",
        "word",
        "god",
        "u",
        "christ",
        "word",
        "ubiquitously",
        "present",
        "investing",
        "threefold",
        "sense",
        "assumed",
        "body",
        "soul",
        "spirit",
        "sake",
        "sojourn",
        "earth"
    ]
}