{
    "main_text": "The (Traditional) Epistemological Problem || Criteria\n1.3 Criteria\n\nIt has been suggested that an alternative to the view that mind lies\nbehind and serves as the cause of behavior is the view that behavior\nserves as the criterion of mind (see\n §1.1).\n The former conception of mind in relation to behavior is associated\nwith the following ideas: (i) my mind is private to me; (ii) I am both\ninfallible and incorrigible with respect to my own mental states; and\n(iii) I can know my own mental state without having to observe\nanything about my body. This picture of mind is bolstered by the\nthought that, whatever another person says or does, it is always\npossible that they are deceiving me about what is going on in their\nminds—an extreme version of which leads to the thought that I am\nentirely deceived and all others are mere automata or zombies. In\nshort, this conception of mind leads to the traditional\nepistemological problem of other minds. Standard responses to this\nproblem—arguments from analogy and best explanation—draw a\nparallel between knowledge of another’s mind and explanation in\nscience. In this connection Wittgenstein writes: “Misleading\nparallel: psychology treats of processes in the psychical sphere, as\ndoes physics in the physical” (1953: §571). In The Blue\nBook (24–25) Wittgenstein contrasts the business of citing\ncriteria with that of giving symptoms in answer to the question,\n“How do you know?” He associates the giving of symptoms\nwith the making of hypotheses; he associates the citing of criteria\nwith “the grammar (the use)” of a word or with linguistic\nconvention (1958: 23).\n\nIt has not proved an easy thing for philosophers to understand what\nWittgenstein means here (see Albritton 1959; Shoemaker 1963; Kenny\n1967; Baker 1974). What one can say is that a criterial relation\nbetween mind and behavior is designed to be distinct from, on the one\nhand, logical entailment, and on the other, inductive inference. Some\nsee a connection between a criterial relation here and the possibility\nof perceptual knowledge of another’s mind (McDowell 1982, Hacker\n1997; see\n §1.4.1).\n Those that advocate a criterial relation between mind and behavior\nalso tend to understand the problem of other minds to be a conceptual\none (see\n §2).\n As well as being associated with the rejection of a certain\nconception of mind that can be labeled ‘Cartesian’, appeal\nto a criterial relationship between mind and behavior is often thought\nto form part of an anti-sceptical stance in connection with\nothers.\n\nSome have seen in the appeal to criteria nothing but a form of\nbehaviorism. Chihara and Fodor (1965) are among such philosophers, and\ntheir work has served to turn the tide against talk of criteria as a\nway of understanding the relationship between mental states and\nbehavior. Chihara and Fodor sum up the Wittgensteinian argument as\nfollows: if we are justified in claiming that one can tell or\ndetermine that a predicate ‘Y’ applies on the\nbasis of the presence of X then either X is a\ncriterion of Y or X can be shown to be correlated\nwith Y. They then claim that this overlooks the possibility\nthat in some cases the justification for the application of a\npredicate rests on an appeal to the “simplicity, plausibility\nand predictive adequacy of an explanatory system as a whole”\n(1965: 411). They point out that scientists use this method of\nexplanation when it comes to the detection of particles that are not\ndirectly observable (see\n §1.2).\n Chihara and Fodor agree with the Wittgensteinian who holds that the\nchild does not learn about mental states by introspection but rather\nlearns about complex relations between mental states and behavior in\nthe course of learning her language, but they point out that part of\nwhat the child learns is how to explain another’s behavior by\nreference to her thoughts and feelings and suggest that this may be\nthe result either of explicit training or of an innate capacity.\n\nWhether one is persuaded by Chihara and Fodor’s position against\nappeal to criteria will depend in part upon one’s assessment of\nthe correctness of thinking about mental states on the model of\nunobservables in science. Furthermore, it may be thought that to\nunderstand mental states to be entirely explanatory phenomena is\narguably to lose sight of the subjective aspect of these states.\nFinally, to think of mental states as lying behind and causing\nbehavior may be thought to break what some see as a deep connection\nbetween mentality and behavior, thereby opening up the possibility\nthat I am alone in the universe (Avramides 2013).\n\nMany have continued to defend a criterial approach here. Crispin\nWright and John McDowell have written extensively on this topic, each\noffering a very different interpretation of the notion of a criterion.\nWhile the debate here is complex and interwoven with issues such as\nrealist vs anti-realist semantics, there is one thread in this debate\nthat is particularly relevant to the epistemological problem of other\nminds: the question of whether criteria should be thought of as\ndefeasible or indefeasible. Wright rightly sees this question as\nconnected with the question of whether appeal to criteria can provide\none with an anti-sceptical stance. Wright’s own understanding of\ncriteria turns on an important distinction between constituting\nknowledge that P and an entitlement to a knowledge-claim that\nP. While a sceptic can always challenge the truth of any claim to\nknow that which lies beyond the cognitive reach of the subject\n(examples here include the past and other minds), Wright suggests that\nthe sceptic can make no inroads when one pulls in one’s horns\nand simply makes a statement about the reasonableness of one’s\nbelief or claim to know in such cases. He then argues that\nreasonableness is secured if one can show that the criteria for the\nclaim that, for example, another is in pain are satisfied and one\nknows of no consideration that would defeat the claim—in other\nwords, just so long as one is using a word, e.g., “pain”,\nin accordance with the conventions in play in one’s linguistic\ncommunity. It is a consequence of this understanding of criteria that,\nwhile one may be in the best position to make a claim to know that Tom\nis in pain by observing his behavior, one’s claim is\ndefeasible—that is, it is open to being shown to be mistaken in\nthe light of further evidence. Importantly, to hold that behavioral\ncriteria are defeasible is not, according to Wright, to be committed\nto understanding behavior as ‘outer’ evidence (a symptom)\nof the other’s ‘inner’ mental states. Wright admits,\nhowever, that his position leaves room for scepticism: “a form\nof scepticism that is endemic in the very practice of assertion”\n(1984: [1993:\n 389–390]).[2]\n\nMcDowell is not content to concede any ground to the sceptic, and\nbelieves that appeal to criteria can confer (sceptic-proof) knowledge.\nBut for this to be the case, criteria must be understood to be\nindefeasible (McDowell 1982). McDowell finds an\nincompatibility between, on the one hand, the legitimacy of a\nknowledge ascription and, on the other, the possible of its falsity\n(its defeasibility). McDowell is not persuaded by Wright’s\nunderstanding of criteria, and proposes an alternative to it.\nMcDowell’s understanding of criteria is thought to form a part\nof his defense of a direct, perceptual, account of our knowledge of\nother minds (see\n §1.4.1).\n\nIn the work of Stanley Cavell one finds yet another understanding of\ncriteria: “Criteria are ‘criteria for something’s\nbeing so”, not in the sense that they tell us of a thing’s\nexistence, but of something like its identity, not of its\nbeing so, but of its being so. Criteria do not\ndetermine the certainty of statements, but the application of the\nconcepts employed in statements“ (Cavell 1979: 45; for a good\ndiscussion of Cavell’s understanding of criteria see Mulhall\n1994, Pt. II,). I may come to know that the criteria for pain have\nbeen satisfied, but this does not touch the question of whether the\nother really experiences thoughts and feelings (the thick\nsceptical question). Cavell insists that, rather than reply to the\nsceptic or show why this thick sceptical question does not arise\n(inferential arguments attempt to do the former, appeal to criteria\nhave been used by some to do the latter), we need to understand what\nit is that gives rise to the sceptic’s worry. Cavell urges that\nwe see the sceptic as being motivated by a genuine concern, but one\nthat s/he misunderstands to be an epistemological concern. Rather than\nask, How can I know the thoughts and feelings of others?, Cavell\nthinks we should look to how how I respond to the other. He draws\nattention to the Philosophical Investigations (p. 178) where\nWittgenstein writes, My attitude towards him is an attitude towards a\nsoul”. Cavell sees in this attitude an acknowledgement of\nanother. Acknowledgment is active, it is something we do in relation\nto another; it is not a cognitive achievement. With his emphasis on\nacknowledgement, Cavell aims to turn us away from the idea that my\nfundamental relation to others is a cognitive one (see Cavell, 1979,\nPt. IV, and Avramides 2023). \n",
    "section_title": "1.3 Criteria",
    "entry_title": "Other Minds",
    "hierarchy_title": "Other Minds || The (Traditional) Epistemological Problem || Criteria",
    "tokenized_text": [
        "traditional",
        "epistemological",
        "problem",
        "criterion",
        "criterion",
        "suggested",
        "alternative",
        "view",
        "mind",
        "lie",
        "behind",
        "serf",
        "cause",
        "behavior",
        "view",
        "behavior",
        "serf",
        "criterion",
        "mind",
        "see",
        "former",
        "conception",
        "mind",
        "relation",
        "behavior",
        "associated",
        "following",
        "idea",
        "mind",
        "private",
        "ii",
        "infallible",
        "incorrigible",
        "respect",
        "mental",
        "state",
        "iii",
        "know",
        "mental",
        "state",
        "without",
        "observe",
        "anything",
        "body",
        "picture",
        "mind",
        "bolstered",
        "thought",
        "whatever",
        "another",
        "person",
        "say",
        "always",
        "possible",
        "deceiving",
        "going",
        "mindsan",
        "extreme",
        "version",
        "lead",
        "thought",
        "entirely",
        "deceived",
        "others",
        "mere",
        "automaton",
        "zombie",
        "short",
        "conception",
        "mind",
        "lead",
        "traditional",
        "epistemological",
        "problem",
        "mind",
        "standard",
        "response",
        "problemarguments",
        "analogy",
        "best",
        "explanationdraw",
        "parallel",
        "knowledge",
        "another",
        "mind",
        "explanation",
        "science",
        "connection",
        "wittgenstein",
        "writes",
        "misleading",
        "parallel",
        "psychology",
        "treat",
        "process",
        "psychical",
        "sphere",
        "physic",
        "physical",
        "blue",
        "book",
        "wittgenstein",
        "contrast",
        "business",
        "citing",
        "criterion",
        "giving",
        "symptom",
        "answer",
        "question",
        "know",
        "associate",
        "giving",
        "symptom",
        "making",
        "hypothesis",
        "associate",
        "citing",
        "criterion",
        "grammar",
        "use",
        "word",
        "linguistic",
        "convention",
        "proved",
        "easy",
        "thing",
        "philosopher",
        "understand",
        "wittgenstein",
        "mean",
        "see",
        "albritton",
        "shoemaker",
        "kenny",
        "baker",
        "one",
        "say",
        "criterial",
        "relation",
        "mind",
        "behavior",
        "designed",
        "distinct",
        "one",
        "hand",
        "logical",
        "entailment",
        "inductive",
        "inference",
        "see",
        "connection",
        "criterial",
        "relation",
        "possibility",
        "perceptual",
        "knowledge",
        "another",
        "mind",
        "mcdowell",
        "hacker",
        "see",
        "advocate",
        "criterial",
        "relation",
        "mind",
        "behavior",
        "also",
        "tend",
        "understand",
        "problem",
        "mind",
        "conceptual",
        "one",
        "see",
        "well",
        "associated",
        "rejection",
        "certain",
        "conception",
        "mind",
        "labeled",
        "cartesian",
        "appeal",
        "criterial",
        "relationship",
        "mind",
        "behavior",
        "often",
        "thought",
        "form",
        "part",
        "antisceptical",
        "stance",
        "connection",
        "others",
        "seen",
        "appeal",
        "criterion",
        "nothing",
        "form",
        "behaviorism",
        "chihara",
        "fodor",
        "among",
        "philosopher",
        "work",
        "served",
        "turn",
        "tide",
        "talk",
        "criterion",
        "way",
        "understanding",
        "relationship",
        "mental",
        "state",
        "behavior",
        "chihara",
        "fodor",
        "sum",
        "wittgensteinian",
        "argument",
        "follows",
        "justified",
        "claiming",
        "one",
        "tell",
        "determine",
        "predicate",
        "applies",
        "basis",
        "presence",
        "x",
        "either",
        "x",
        "criterion",
        "x",
        "shown",
        "correlated",
        "y",
        "claim",
        "overlook",
        "possibility",
        "case",
        "justification",
        "application",
        "predicate",
        "rest",
        "appeal",
        "simplicity",
        "plausibility",
        "predictive",
        "adequacy",
        "explanatory",
        "system",
        "whole",
        "point",
        "scientist",
        "use",
        "method",
        "explanation",
        "come",
        "detection",
        "particle",
        "directly",
        "observable",
        "see",
        "chihara",
        "fodor",
        "agree",
        "wittgensteinian",
        "hold",
        "child",
        "learn",
        "mental",
        "state",
        "introspection",
        "rather",
        "learns",
        "complex",
        "relation",
        "mental",
        "state",
        "behavior",
        "course",
        "learning",
        "language",
        "point",
        "part",
        "child",
        "learns",
        "explain",
        "another",
        "behavior",
        "reference",
        "thought",
        "feeling",
        "suggest",
        "may",
        "result",
        "either",
        "explicit",
        "training",
        "innate",
        "capacity",
        "whether",
        "one",
        "persuaded",
        "chihara",
        "fodor",
        "position",
        "appeal",
        "criterion",
        "depend",
        "part",
        "upon",
        "one",
        "assessment",
        "correctness",
        "thinking",
        "mental",
        "state",
        "model",
        "unobservables",
        "science",
        "furthermore",
        "may",
        "thought",
        "understand",
        "mental",
        "state",
        "entirely",
        "explanatory",
        "phenomenon",
        "arguably",
        "lose",
        "sight",
        "subjective",
        "aspect",
        "state",
        "finally",
        "think",
        "mental",
        "state",
        "lying",
        "behind",
        "causing",
        "behavior",
        "may",
        "thought",
        "break",
        "see",
        "deep",
        "connection",
        "mentality",
        "behavior",
        "thereby",
        "opening",
        "possibility",
        "alone",
        "universe",
        "avramides",
        "many",
        "continued",
        "defend",
        "criterial",
        "approach",
        "crispin",
        "wright",
        "john",
        "mcdowell",
        "written",
        "extensively",
        "topic",
        "offering",
        "different",
        "interpretation",
        "notion",
        "criterion",
        "debate",
        "complex",
        "interwoven",
        "issue",
        "realist",
        "v",
        "antirealist",
        "semantics",
        "one",
        "thread",
        "debate",
        "particularly",
        "relevant",
        "epistemological",
        "problem",
        "mind",
        "question",
        "whether",
        "criterion",
        "thought",
        "defeasible",
        "indefeasible",
        "wright",
        "rightly",
        "see",
        "question",
        "connected",
        "question",
        "whether",
        "appeal",
        "criterion",
        "provide",
        "one",
        "antisceptical",
        "stance",
        "wright",
        "understanding",
        "criterion",
        "turn",
        "important",
        "distinction",
        "constituting",
        "knowledge",
        "p",
        "entitlement",
        "knowledgeclaim",
        "p",
        "sceptic",
        "always",
        "challenge",
        "truth",
        "claim",
        "know",
        "lie",
        "beyond",
        "cognitive",
        "reach",
        "subject",
        "example",
        "include",
        "past",
        "mind",
        "wright",
        "suggests",
        "sceptic",
        "make",
        "inroad",
        "one",
        "pull",
        "one",
        "horn",
        "simply",
        "make",
        "statement",
        "reasonableness",
        "one",
        "belief",
        "claim",
        "know",
        "case",
        "argues",
        "reasonableness",
        "secured",
        "one",
        "show",
        "criterion",
        "claim",
        "example",
        "another",
        "pain",
        "satisfied",
        "one",
        "know",
        "consideration",
        "would",
        "defeat",
        "claimin",
        "word",
        "long",
        "one",
        "using",
        "word",
        "eg",
        "pain",
        "accordance",
        "convention",
        "play",
        "one",
        "linguistic",
        "community",
        "consequence",
        "understanding",
        "criterion",
        "one",
        "may",
        "best",
        "position",
        "make",
        "claim",
        "know",
        "tom",
        "pain",
        "observing",
        "behavior",
        "one",
        "claim",
        "defeasiblethat",
        "open",
        "shown",
        "mistaken",
        "light",
        "evidence",
        "importantly",
        "hold",
        "behavioral",
        "criterion",
        "defeasible",
        "according",
        "wright",
        "committed",
        "understanding",
        "behavior",
        "outer",
        "evidence",
        "symptom",
        "inner",
        "mental",
        "state",
        "wright",
        "admits",
        "however",
        "position",
        "leaf",
        "room",
        "scepticism",
        "form",
        "scepticism",
        "endemic",
        "practice",
        "assertion",
        "mcdowell",
        "content",
        "concede",
        "ground",
        "sceptic",
        "belief",
        "appeal",
        "criterion",
        "confer",
        "scepticproof",
        "knowledge",
        "case",
        "criterion",
        "must",
        "understood",
        "indefeasible",
        "mcdowell",
        "mcdowell",
        "find",
        "incompatibility",
        "one",
        "hand",
        "legitimacy",
        "knowledge",
        "ascription",
        "possible",
        "falsity",
        "defeasibility",
        "mcdowell",
        "persuaded",
        "wright",
        "understanding",
        "criterion",
        "proposes",
        "alternative",
        "mcdowell",
        "understanding",
        "criterion",
        "thought",
        "form",
        "part",
        "defense",
        "direct",
        "perceptual",
        "account",
        "knowledge",
        "mind",
        "see",
        "work",
        "stanley",
        "cavell",
        "one",
        "find",
        "yet",
        "another",
        "understanding",
        "criterion",
        "criterion",
        "criterion",
        "something",
        "sense",
        "tell",
        "u",
        "thing",
        "existence",
        "something",
        "like",
        "identity",
        "criterion",
        "determine",
        "certainty",
        "statement",
        "application",
        "concept",
        "employed",
        "statement",
        "cavell",
        "good",
        "discussion",
        "cavell",
        "understanding",
        "criterion",
        "see",
        "mulhall",
        "pt",
        "ii",
        "may",
        "come",
        "know",
        "criterion",
        "pain",
        "satisfied",
        "touch",
        "question",
        "whether",
        "really",
        "experience",
        "thought",
        "feeling",
        "thick",
        "sceptical",
        "question",
        "cavell",
        "insists",
        "rather",
        "reply",
        "sceptic",
        "show",
        "thick",
        "sceptical",
        "question",
        "arise",
        "inferential",
        "argument",
        "attempt",
        "former",
        "appeal",
        "criterion",
        "used",
        "latter",
        "need",
        "understand",
        "give",
        "rise",
        "sceptic",
        "worry",
        "cavell",
        "urge",
        "see",
        "sceptic",
        "motivated",
        "genuine",
        "concern",
        "one",
        "she",
        "misunderstands",
        "epistemological",
        "concern",
        "rather",
        "ask",
        "know",
        "thought",
        "feeling",
        "others",
        "cavell",
        "think",
        "look",
        "respond",
        "draw",
        "attention",
        "philosophical",
        "investigation",
        "p",
        "wittgenstein",
        "writes",
        "attitude",
        "towards",
        "attitude",
        "towards",
        "soul",
        "cavell",
        "see",
        "attitude",
        "acknowledgement",
        "another",
        "acknowledgment",
        "active",
        "something",
        "relation",
        "another",
        "cognitive",
        "achievement",
        "emphasis",
        "acknowledgement",
        "cavell",
        "aim",
        "turn",
        "u",
        "away",
        "idea",
        "fundamental",
        "relation",
        "others",
        "cognitive",
        "one",
        "see",
        "cavell",
        "pt",
        "iv",
        "avramides"
    ]
}