{
    "main_text": "Consequentialist Pacifism\n3. Consequentialist Pacifism\n\nDeontological prohibitions against war are usually absolute, while\nconsequentialist prohibitions against war are for the most part\ncontingent.\n\nConsequentialist pacifism is usually grounded in some sort of\nrule-utilitarianism. A utilitarian pacifist may argue that a rule\nagainst war or other sorts of violence will tend to promote the\ngreatest happiness for the greatest number. A broader prohibition\nagainst violence other than war can extend the “greatest\nhappiness” concept to take into account the happiness of\nsentient beings other than humans.\n\nUtilitarian pacifists must appeal to empirical and historical data to\nsupport this rule. A utilitarian argument for pacifism could be\ngrounded in the claim that history shows us that wars tend to produce\nmore harm than good. As Bentham put it, “The happiest of mankind\nare sufferers by war; and the wisest, nay, even the least wise, are\nwise enough to ascribe the chief of their sufferings to that\ncause” (Bentham 1789, Fourth Essay) One of the problems for\nconsequentialist arguments against war is that judgments vary about\nwhether war always causes more suffering than it prevents. Utilitarian\ndefenders of the just war theory will argue that some wars help\nalleviate suffering, as for example, in the case of humanitarian wars\nin defense of human rights.\n\nUtilitarian pacifists may articulate a rule-based argument that holds\nthat a general rule against war will, in the long run, produce more\nhappiness. A utilitarian might support such an argument by also\narguing that economic and other resources that are spent on war and\npreparation for war could produce more happiness if spent on peaceful\ngoods such as education, hunger relief, and so on. And a\nrule-utilitarian might argue that a rule against humanitarian\nintervention would produce more happiness in the long run by\nprotecting international stability and preserving important values\nlike national sovereignty.\n\nIt is important to note that, unlike deontological pacifism,\nconsequentialist pacifism is not opposed to killing per se. Nor is the\nconsequentialist approach especially concerned with the distinction\nbetween combatants and noncombatants, since the “greatest\nhappiness” principle adopts a perspective that includes both\ncombatants and noncombatants. Indeed, the combatant/noncombatant\ndistinction is better understood as a deontological principle, as\ndiscussed below. It is difficult to see how absolute pacifism can\ndevelop from act-utilitarianism that is devoid of side-constraints\nagainst killing. The rule-utilitarian approach can, however, allow for\ngeneral rules that allow killing in certain circumstances, say in\nself-defense. The idea of proportionality in just war theory is an\nexample of such a rule: killing in war is justifiable if it promotes\ngeneral long-term happiness.\n\nThe claim that war produces more harm than good is disputable; at\nleast, it requires empirical research to decide if it is true.\nEmpirical research into the consequences of war provides mixed results\ndepending upon contexts and circumstances in which wars are fought and\nthe range of consequences considered (whether short-term or\nlong-term). Some authors (Pinker and Goldstein) suggest that the use\nof judicious military power during the last several decades has\nproduced good results. But other authors reach different conclusions.\nIan Bickerton concludes that the wars of the past 200 years have\nproduced ambiguous results: “victory did not achieve its desired\nresults and war sacrifices were largely in vain. The reality is that\nthe costs of war are rarely, if ever, worthwhile” (Bickerton\n2011, xi).\n\nGiven the difficulty of assessing the empirical data, consequentialist\npacifism will usually be a sort of contingent pacifism. But this is\nnot always true, since absolute pacifism might be justifiable on\nconsequentialist grounds as a rule that will in the long run produce\ngood consequences. There may be variable judgments among\nconsequentialists about whether some wars produce more harm than good.\nThus pacifists such as Einstein and Russell could agree that the First\nWorld War was wrong, while admitting that the Second World War could\nbe justified. The Second World War is in fact often used as an example\nof a war that can be justified in consequentialist terms: the good\nproduced by the war—the defeat of Nazism in Europe, for\nexample—is thought to outweigh its negative consequences,\nespecially the massive numbers of persons killed in the war. In\nresponse, consequentialist pacifists might emphasize the negative\nutility of the deaths caused by the war while also arguing that the\nSecond World War produced long-term negative consequences with the\nintroduction of nuclear weapons, the partition of Europe, and the\nmadness of the Cold War. Consequentialist defenders of pacifism will\nalso argue that creative and coordinated nonviolent action can produce\ngood consequences that are at least as good as the consequences of\nwar.\n\nOne of the issues that consequentialists must consider is the temporal\nand spatial scope of our concern for consequences. It is possible that\nwars may produce short-term benefits for some and long-term\ndisadvantages for others. Judgments about benefits and harms are thus\ncomplex and we must clarify our understanding of what matters in\nthinking about consequences. Often consequentialist arguments for\npacifism emphasize the short-term damage of war. It is obviously true\nthat wars kill people. But the further question to be asked from the\nstandpoint of consequentialism is whether the harms that occur in the\nnear-term are outweighed by the long-term benefits of the war. Just\nwar theorists believe that some wars do have positive long-term\nconsequences. Pacifists do not think that long-term benefits outweigh\nsuch near-term harms. Consequentialist pacifists often also consider\nthe broad and long-term negative effects of war on the economy, on\nculture, on political life, and on the environment. Moreover,\npacifists worry that war contributes to long-term international\ninstability.\n\nWhen thinking about the negative consequences of war it is important\nto recognize that we are engaged in comparative cost-benefit analysis.\nCritics of consequentialist pacifism often skew the results of such\ncost-benefit analysis by comparing war to passivity or inaction. But\nmost forms of pacifism do not advocate complete passivity. It is a\nmistake to compare the consequences of going to war to the\nconsequences of doing nothing. Rather, the cost-benefit analysis must\ncompare the costs and benefits of going to war against those of\ncreative, organized, and sustained nonviolent action.\n\nA further consequentialist argument claims that cultures and states\nthat fight wars tend to become militaristic and expansionist. This\nargument focuses on the long-term negative consequences of a social\nand political system that is committed to militarism. One of these\nnegative consequences is the rise of the so-called\n“military-industrial complex” in which social capital is\nexpended on military infrastructure at the expense of other social\nprojects. A negative consequence of militarism is the tendency of\nmilitarist states to become centralized, secretive, and imperial. This\ncritique of military expansionism can be connected to a general\ncritique of the potential negative consequences of imperial power. One\nsuch negative consequence is found in the illiberal tendencies of\nmilitary power. Another negative consequence can be found in the\npossibility of “blow-back” or retaliation in which those\nwho are subjugated turn against the colonial power. And other negative\nconsequences include the danger of an arms races and the wasted money\nand energy that are spent on preparing for war.\n\nEmpirical research is required to say whether it is true that what\npacifists often call “the war system” does produce these\nnegative political consequences. Judgment about these empirical facts\nwill likely vary in accord with historical, geographical, and\npolitical differences, as well as in light of which consequences we\nchose to emphasize. Thus while pacifists argue that resources are\nsquandered in war and environmentalists will point out the military is\none of the largest polluters on the planet, proponents of war argue\nthat war and the military produces goods and technologies, such as\nairplanes, satellites, and so on, that are useful for civilians\n(Ruttan 2006).\n\nAnother consequentialist argument can be located in the idea of the\nsort of “just war pacifism” that developed during the late\n20th Century (see Sterba 1998 and Neu 2011). One\nsignificant worry of just war pacifism is that modern wars fought with\nweapons of mass destruction can never be justified. There are\ndeontological concerns behind this sort of pacifism—with regard\nto concern for noncombatants. But there are also consequentialist\nreasons to be skeptical of wars fought with weapons of mass\ndestruction, most notably the problem of escalation. Nuclear deterrent\nstrategy relies upon the threat of escalation to keep antagonists in\ncheck. The idea of deterrent strategy is to make the negative\nconsequences of war for the enemy so horrifying that war will not\noccur. But if the threat of escalation is real and the results of war\nare really so atrocious, then there are good consequentialist reasons\nto be opposed to war: wars fought with weapons of mass destruction\nwill tend to produce horrifying consequences including the potentially\ntotal devastation of what was called during the Cold War,\n“mutually assured destruction.” During the Cold War, this\nconcern was located in the worry about “nuclear winter,”\nwhich was the catastrophic destruction of the earth’s climate\nand biosphere that would occur if an all out nuclear war had erupted.\nEven more limited conflicts that occur among states that possess\nweapons of mass destruction could produce horrible consequences.\nNuclear proliferation remains a concern along with the general threat\nof terrorists in possession of weapons of mass destruction.\n\nJust war pacifists generally claim that the negative consequences of\nmodern war make war unjustifiable. Just war pacifism might be more\nnarrowly focused on the immorality of nuclear war and nuclear\ndeterrence strategy. But those who reject nuclear warfare might still\nallow that limited defensive or even humanitarian wars can be fought\nprovided we could be sure that just war principles were respected.\nPerhaps the most important conclusion of just war pacifism is that the\nburden of proof rests on the proponent of war: for just war pacifists\nwho base their conclusions on consequentialist reasoning, war is\npresumed to produce negative consequences until is proved\notherwise.\n",
    "section_title": "3. Consequentialist Pacifism",
    "entry_title": "Pacifism",
    "hierarchy_title": "Pacifism || Consequentialist Pacifism",
    "tokenized_text": [
        "consequentialist",
        "pacifism",
        "consequentialist",
        "pacifism",
        "deontological",
        "prohibition",
        "war",
        "usually",
        "absolute",
        "consequentialist",
        "prohibition",
        "war",
        "part",
        "contingent",
        "consequentialist",
        "pacifism",
        "usually",
        "grounded",
        "sort",
        "ruleutilitarianism",
        "utilitarian",
        "pacifist",
        "may",
        "argue",
        "rule",
        "war",
        "sort",
        "violence",
        "tend",
        "promote",
        "greatest",
        "happiness",
        "greatest",
        "number",
        "broader",
        "prohibition",
        "violence",
        "war",
        "extend",
        "greatest",
        "happiness",
        "concept",
        "take",
        "account",
        "happiness",
        "sentient",
        "being",
        "human",
        "utilitarian",
        "pacifist",
        "must",
        "appeal",
        "empirical",
        "historical",
        "data",
        "support",
        "rule",
        "utilitarian",
        "argument",
        "pacifism",
        "could",
        "grounded",
        "claim",
        "history",
        "show",
        "u",
        "war",
        "tend",
        "produce",
        "harm",
        "good",
        "bentham",
        "put",
        "happiest",
        "mankind",
        "sufferer",
        "war",
        "wisest",
        "nay",
        "even",
        "least",
        "wise",
        "wise",
        "enough",
        "ascribe",
        "chief",
        "suffering",
        "cause",
        "bentham",
        "fourth",
        "essay",
        "one",
        "problem",
        "consequentialist",
        "argument",
        "war",
        "judgment",
        "vary",
        "whether",
        "war",
        "always",
        "cause",
        "suffering",
        "prevents",
        "utilitarian",
        "defender",
        "war",
        "theory",
        "argue",
        "war",
        "help",
        "alleviate",
        "suffering",
        "example",
        "case",
        "humanitarian",
        "war",
        "defense",
        "human",
        "right",
        "utilitarian",
        "pacifist",
        "may",
        "articulate",
        "rulebased",
        "argument",
        "hold",
        "general",
        "rule",
        "war",
        "long",
        "run",
        "produce",
        "happiness",
        "utilitarian",
        "might",
        "support",
        "argument",
        "also",
        "arguing",
        "economic",
        "resource",
        "spent",
        "war",
        "preparation",
        "war",
        "could",
        "produce",
        "happiness",
        "spent",
        "peaceful",
        "good",
        "education",
        "hunger",
        "relief",
        "ruleutilitarian",
        "might",
        "argue",
        "rule",
        "humanitarian",
        "intervention",
        "would",
        "produce",
        "happiness",
        "long",
        "run",
        "protecting",
        "international",
        "stability",
        "preserving",
        "important",
        "value",
        "like",
        "national",
        "sovereignty",
        "important",
        "note",
        "unlike",
        "deontological",
        "pacifism",
        "consequentialist",
        "pacifism",
        "opposed",
        "killing",
        "per",
        "se",
        "consequentialist",
        "approach",
        "especially",
        "concerned",
        "distinction",
        "combatant",
        "noncombatant",
        "since",
        "greatest",
        "happiness",
        "principle",
        "adopts",
        "perspective",
        "includes",
        "combatant",
        "noncombatant",
        "indeed",
        "combatantnoncombatant",
        "distinction",
        "better",
        "understood",
        "deontological",
        "principle",
        "discussed",
        "difficult",
        "see",
        "absolute",
        "pacifism",
        "develop",
        "actutilitarianism",
        "devoid",
        "sideconstraints",
        "killing",
        "ruleutilitarian",
        "approach",
        "however",
        "allow",
        "general",
        "rule",
        "allow",
        "killing",
        "certain",
        "circumstance",
        "say",
        "selfdefense",
        "idea",
        "proportionality",
        "war",
        "theory",
        "example",
        "rule",
        "killing",
        "war",
        "justifiable",
        "promotes",
        "general",
        "longterm",
        "happiness",
        "claim",
        "war",
        "produce",
        "harm",
        "good",
        "disputable",
        "least",
        "requires",
        "empirical",
        "research",
        "decide",
        "true",
        "empirical",
        "research",
        "consequence",
        "war",
        "provides",
        "mixed",
        "result",
        "depending",
        "upon",
        "context",
        "circumstance",
        "war",
        "fought",
        "range",
        "consequence",
        "considered",
        "whether",
        "shortterm",
        "longterm",
        "author",
        "pinker",
        "goldstein",
        "suggest",
        "use",
        "judicious",
        "military",
        "power",
        "last",
        "several",
        "decade",
        "produced",
        "good",
        "result",
        "author",
        "reach",
        "different",
        "conclusion",
        "ian",
        "bickerton",
        "concludes",
        "war",
        "past",
        "year",
        "produced",
        "ambiguous",
        "result",
        "victory",
        "achieve",
        "desired",
        "result",
        "war",
        "sacrifice",
        "largely",
        "vain",
        "reality",
        "cost",
        "war",
        "rarely",
        "ever",
        "worthwhile",
        "bickerton",
        "xi",
        "given",
        "difficulty",
        "assessing",
        "empirical",
        "data",
        "consequentialist",
        "pacifism",
        "usually",
        "sort",
        "contingent",
        "pacifism",
        "always",
        "true",
        "since",
        "absolute",
        "pacifism",
        "might",
        "justifiable",
        "consequentialist",
        "ground",
        "rule",
        "long",
        "run",
        "produce",
        "good",
        "consequence",
        "may",
        "variable",
        "judgment",
        "among",
        "consequentialists",
        "whether",
        "war",
        "produce",
        "harm",
        "good",
        "thus",
        "pacifist",
        "einstein",
        "russell",
        "could",
        "agree",
        "first",
        "world",
        "war",
        "wrong",
        "admitting",
        "second",
        "world",
        "war",
        "could",
        "justified",
        "second",
        "world",
        "war",
        "fact",
        "often",
        "used",
        "example",
        "war",
        "justified",
        "consequentialist",
        "term",
        "good",
        "produced",
        "warthe",
        "defeat",
        "nazism",
        "europe",
        "exampleis",
        "thought",
        "outweigh",
        "negative",
        "consequence",
        "especially",
        "massive",
        "number",
        "person",
        "killed",
        "war",
        "response",
        "consequentialist",
        "pacifist",
        "might",
        "emphasize",
        "negative",
        "utility",
        "death",
        "caused",
        "war",
        "also",
        "arguing",
        "second",
        "world",
        "war",
        "produced",
        "longterm",
        "negative",
        "consequence",
        "introduction",
        "nuclear",
        "weapon",
        "partition",
        "europe",
        "madness",
        "cold",
        "war",
        "consequentialist",
        "defender",
        "pacifism",
        "also",
        "argue",
        "creative",
        "coordinated",
        "nonviolent",
        "action",
        "produce",
        "good",
        "consequence",
        "least",
        "good",
        "consequence",
        "war",
        "one",
        "issue",
        "consequentialists",
        "must",
        "consider",
        "temporal",
        "spatial",
        "scope",
        "concern",
        "consequence",
        "possible",
        "war",
        "may",
        "produce",
        "shortterm",
        "benefit",
        "longterm",
        "disadvantage",
        "others",
        "judgment",
        "benefit",
        "harm",
        "thus",
        "complex",
        "must",
        "clarify",
        "understanding",
        "matter",
        "thinking",
        "consequence",
        "often",
        "consequentialist",
        "argument",
        "pacifism",
        "emphasize",
        "shortterm",
        "damage",
        "war",
        "obviously",
        "true",
        "war",
        "kill",
        "people",
        "question",
        "asked",
        "standpoint",
        "consequentialism",
        "whether",
        "harm",
        "occur",
        "nearterm",
        "outweighed",
        "longterm",
        "benefit",
        "war",
        "war",
        "theorist",
        "believe",
        "war",
        "positive",
        "longterm",
        "consequence",
        "pacifist",
        "think",
        "longterm",
        "benefit",
        "outweigh",
        "nearterm",
        "harm",
        "consequentialist",
        "pacifist",
        "often",
        "also",
        "consider",
        "broad",
        "longterm",
        "negative",
        "effect",
        "war",
        "economy",
        "culture",
        "political",
        "life",
        "environment",
        "moreover",
        "pacifist",
        "worry",
        "war",
        "contributes",
        "longterm",
        "international",
        "instability",
        "thinking",
        "negative",
        "consequence",
        "war",
        "important",
        "recognize",
        "engaged",
        "comparative",
        "costbenefit",
        "analysis",
        "critic",
        "consequentialist",
        "pacifism",
        "often",
        "skew",
        "result",
        "costbenefit",
        "analysis",
        "comparing",
        "war",
        "passivity",
        "inaction",
        "form",
        "pacifism",
        "advocate",
        "complete",
        "passivity",
        "mistake",
        "compare",
        "consequence",
        "going",
        "war",
        "consequence",
        "nothing",
        "rather",
        "costbenefit",
        "analysis",
        "must",
        "compare",
        "cost",
        "benefit",
        "going",
        "war",
        "creative",
        "organized",
        "sustained",
        "nonviolent",
        "action",
        "consequentialist",
        "argument",
        "claim",
        "culture",
        "state",
        "fight",
        "war",
        "tend",
        "become",
        "militaristic",
        "expansionist",
        "argument",
        "focus",
        "longterm",
        "negative",
        "consequence",
        "social",
        "political",
        "system",
        "committed",
        "militarism",
        "one",
        "negative",
        "consequence",
        "rise",
        "socalled",
        "militaryindustrial",
        "complex",
        "social",
        "capital",
        "expended",
        "military",
        "infrastructure",
        "expense",
        "social",
        "project",
        "negative",
        "consequence",
        "militarism",
        "tendency",
        "militarist",
        "state",
        "become",
        "centralized",
        "secretive",
        "imperial",
        "critique",
        "military",
        "expansionism",
        "connected",
        "general",
        "critique",
        "potential",
        "negative",
        "consequence",
        "imperial",
        "power",
        "one",
        "negative",
        "consequence",
        "found",
        "illiberal",
        "tendency",
        "military",
        "power",
        "another",
        "negative",
        "consequence",
        "found",
        "possibility",
        "blowback",
        "retaliation",
        "subjugated",
        "turn",
        "colonial",
        "power",
        "negative",
        "consequence",
        "include",
        "danger",
        "arm",
        "race",
        "wasted",
        "money",
        "energy",
        "spent",
        "preparing",
        "war",
        "empirical",
        "research",
        "required",
        "say",
        "whether",
        "true",
        "pacifist",
        "often",
        "call",
        "war",
        "system",
        "produce",
        "negative",
        "political",
        "consequence",
        "judgment",
        "empirical",
        "fact",
        "likely",
        "vary",
        "accord",
        "historical",
        "geographical",
        "political",
        "difference",
        "well",
        "light",
        "consequence",
        "chose",
        "emphasize",
        "thus",
        "pacifist",
        "argue",
        "resource",
        "squandered",
        "war",
        "environmentalist",
        "point",
        "military",
        "one",
        "largest",
        "polluter",
        "planet",
        "proponent",
        "war",
        "argue",
        "war",
        "military",
        "produce",
        "good",
        "technology",
        "airplane",
        "satellite",
        "useful",
        "civilian",
        "ruttan",
        "another",
        "consequentialist",
        "argument",
        "located",
        "idea",
        "sort",
        "war",
        "pacifism",
        "developed",
        "late",
        "th",
        "century",
        "see",
        "sterba",
        "neu",
        "one",
        "significant",
        "worry",
        "war",
        "pacifism",
        "modern",
        "war",
        "fought",
        "weapon",
        "mass",
        "destruction",
        "never",
        "justified",
        "deontological",
        "concern",
        "behind",
        "sort",
        "pacifismwith",
        "regard",
        "concern",
        "noncombatant",
        "also",
        "consequentialist",
        "reason",
        "skeptical",
        "war",
        "fought",
        "weapon",
        "mass",
        "destruction",
        "notably",
        "problem",
        "escalation",
        "nuclear",
        "deterrent",
        "strategy",
        "relies",
        "upon",
        "threat",
        "escalation",
        "keep",
        "antagonist",
        "check",
        "idea",
        "deterrent",
        "strategy",
        "make",
        "negative",
        "consequence",
        "war",
        "enemy",
        "horrifying",
        "war",
        "occur",
        "threat",
        "escalation",
        "real",
        "result",
        "war",
        "really",
        "atrocious",
        "good",
        "consequentialist",
        "reason",
        "opposed",
        "war",
        "war",
        "fought",
        "weapon",
        "mass",
        "destruction",
        "tend",
        "produce",
        "horrifying",
        "consequence",
        "including",
        "potentially",
        "total",
        "devastation",
        "called",
        "cold",
        "war",
        "mutually",
        "assured",
        "destruction",
        "cold",
        "war",
        "concern",
        "located",
        "worry",
        "nuclear",
        "winter",
        "catastrophic",
        "destruction",
        "earth",
        "climate",
        "biosphere",
        "would",
        "occur",
        "nuclear",
        "war",
        "erupted",
        "even",
        "limited",
        "conflict",
        "occur",
        "among",
        "state",
        "posse",
        "weapon",
        "mass",
        "destruction",
        "could",
        "produce",
        "horrible",
        "consequence",
        "nuclear",
        "proliferation",
        "remains",
        "concern",
        "along",
        "general",
        "threat",
        "terrorist",
        "possession",
        "weapon",
        "mass",
        "destruction",
        "war",
        "pacifist",
        "generally",
        "claim",
        "negative",
        "consequence",
        "modern",
        "war",
        "make",
        "war",
        "unjustifiable",
        "war",
        "pacifism",
        "might",
        "narrowly",
        "focused",
        "immorality",
        "nuclear",
        "war",
        "nuclear",
        "deterrence",
        "strategy",
        "reject",
        "nuclear",
        "warfare",
        "might",
        "still",
        "allow",
        "limited",
        "defensive",
        "even",
        "humanitarian",
        "war",
        "fought",
        "provided",
        "could",
        "sure",
        "war",
        "principle",
        "respected",
        "perhaps",
        "important",
        "conclusion",
        "war",
        "pacifism",
        "burden",
        "proof",
        "rest",
        "proponent",
        "war",
        "war",
        "pacifist",
        "base",
        "conclusion",
        "consequentialist",
        "reasoning",
        "war",
        "presumed",
        "produce",
        "negative",
        "consequence",
        "proved",
        "otherwise"
    ]
}