{
    "main_text": "Life\n1. Life\n\nThomas Paine was born on January 29, 1737 to a family of moderate\nmeans in Norfolk, England. His father was a Quaker and his mother an\nAnglican, and it is likely Paine was baptized into the Anglican\nchurch. He had some schooling, although his father forbade him to\nlearn Latin, and at the age of twelve he was withdrawn from school and\napprenticed to his father to learn the craft of staymaking. When he\nwas in his mid-teens, inspired by the romantic stories of naval life\nby one of his teachers, Paine twice ran away from home to sea. The\nfirst time he was intercepted. The second time he enlisted on the\nprivateer, the King of Prussia. The exact sequence of events\nover the subsequent ten to fifteen years is unclear. He lived in\nLondon on and off, but also had periods in Sandwich and in Margate. He\ncontinued periodically to ply his skills as a staymaker; he may have\ndone some preaching (in the Methodist persuasion); and in 1759 he\nmarried a Mary Lambert, who died the following year in childbirth.\nFollowing his wife’s death, he sought his father-in-law’s\nsupport to take up a career in the excise service. He first served as\nan officer in December 1762, but in August 1765 he was dismissed.\nTradition has it that this was for\n‘stamping’—providing certificates for goods not\ninspected. New research (in Brent et al) suggests it may have been for\nwhistleblowing. He wrote formally seeking re-admission to the service,\nwhich was granted. While awaiting a posting he taught school in\nLondon. In 1768 he accepted a posting to Lewes, on the South Coast of\nEngland, and he took up lodgings with a Samuel Ollive, a local\ntobacconist. In Lewes he became a member of the debating\nsociety—the Headstrong Club—and he was also reputed as a\nskater and player of bowls. Ollive died in July 1769, and Paine took\nlodgings elsewhere. But he sustained his links with the family, and in\nMarch 1771 he married the daughter, Elizabeth Ollive (1741–1808)\nand established himself as part proprietor of the business. The\nfollowing year he went to London to press the claims of the excisemen\nfor higher pay. Although he returned to Lewes, he was sacked by the\nexcise and his marriage had failed, and he sold up his business. In\nthe final settlement between Paine and his wife he was awarded\n£400. He headed to London, where he secured letters of\nintroduction from Benjamin Franklin, whom he had encountered on an\nearlier visit to the capital, and embarked in April 1774 for the New\nWorld. He was carried ashore in Philadelphia in November 1774\nsuffering from putrid fever, but he survived. \n\nIn Philadelphia Paine developed an acquaintance with Robert Aitkin, a\npublisher and bookseller, who employed him to edit the\nPennsylvania Magazine. There remains considerable\ndisagreement about which pieces in the Magazine were written by Paine,\nbut it seems clear that he did contribute and that he developed a\nreputation among political circles in Philadelphia as a result, at\njust the time that tensions with Britain were reaching a crisis point.\nIn the autumn of 1775, encouraged by Benjamin Rush, Paine began work\non a pamphlet defending the case of American independence. He\ndiscussed his work with Rush, David Rittenhouse, Benjamin Franklin,\nand Samuel Adams, but the work was his own (save for the title, for\nwhich Rush claimed responsibility). Common Sense (1776) was\nthe most widely read pamphlet of the American Revolution. It was a\nclarion call for unity, against the corrupt British court, so as to\nrealize America’s providential role in providing an asylum for\nliberty. Written in a direct and lively style, it denounced the\ndecaying despotisms of Europe and pilloried hereditary monarchy as an\nabsurdity. At a time when many still hoped for reconciliation with\nBritain, Common Sense demonstrated to many the inevitability\nof separation.\n\nPaine consolidated his reputation as a pamphleteer with his series of\nAmerican Crisis letters (1777–83); he also served in a\nnumber of capacities for Congress and the Pennsylvanian Assembly.\nAlthough he had links with the more radical elements of Pennsylvanian\npolitics, he also committed his energies to a number of more elite\nprojects—contributing to the establishment of the Bank of\nAmerica to help raise money for the war, and working with Robert\nMorris to encourage State Legislatures to accept the need for Federal\ntaxation to support the war. Following the conclusion of the war he\nwas awarded a farm by the New York assembly, and Congress voted him a\ngrant of $3,000 for his services.\n\nAfter the Revolution he dedicated his time to scientific experiments,\ndesigning an iron bridge capable of spanning wide distances without\nthe use of piers, experimenting with marsh gas with Washington, and\nattempting to produce a smokeless candle with Franklin. In 1787 he\ntook a wooden model of his bridge to Paris, and subsequently to\nEngland where an iron model of 110 feet was forged and constructed for\npublic display in a field near Paddington in May 1790. He also became\nincreasingly caught up in the initial events of the French revolution,\nthanks in part to his involvement with a group of French intellectuals\nenabled by Thomas Jefferson (US Minister to France until late 1789).\nPaine contemplated writing a history of the French Revolution but he\nmade slow progress—exacerbated by his poor French. When Edmund\nBurke’s Reflections on the Revolution in France\nappeared in November 1790, he determined to answer it and turned his\nmaterials to that task. The result, Rights of Man\n(February/March 1791) coupled a narrative of French events with a\ntrenchant attack on Burke and the Revolution Settlement of 1688. It\nwas an immediate success, and brought Paine into the circles of those\nseeking to achieve parliamentary reform in Britain. He continued to\nvisit France and was in Paris in June 1791 in the immediate aftermath\nof Louis XVI’s flight to Varennes. He collaborated with a small\ngroup (including Nicholas Bonneville and the Marquis de Condorcet) to\nproduce a republican manifesto that was pasted on the walls of Paris,\nto the outrage of most members of the National Assembly. That movement\nwas firmly repressed at the Massacre of the Champs de Mars in July\n1791, by which time Paine was already back in Britain. But the\noccasion marks a shift in his thinking—from seeing monarchy as\nan inevitable part of the institutional order in the corrupt states of\nEurope, to thinking that the American model could be applied more\ngenerally throughout Europe. Where Rights of Man had shown\nconsiderable tolerance for France’s limited monarchy, his\nRights of Man: Part the Second (March 1792) was explicitly\nrepublican and he drew extensively on his American experience in\nsketching the basic principles of a largely self-regulating commercial\nsociety, coupled with representative government, the rule of law, and\na periodically renewable covenant. The final chapter, influenced by\nhis friendship with Condorcet and other members of the\nComité de Mendicité, outlined a program for\nwelfare provision for the poor, aged, disabled and destitute.\n\nThe two parts of Rights of Man were quickly combined in cheap\neditions (at Paine’s insistence) and sold in unprecedented\nnumbers. Paine’s advocacy of natural rights, his attacks on\nmixed government, his outspoken republicanism, and his extensive\nproposals for schemes of social welfare set him apart from the more\ncommon opposition rhetoric that emphasized the need to protect the\nintegrity of the mixed constitution to secure English liberties. His\nsuccess suggests that he was reaching a popular audience who attached\ndiminishing weight to these traditions and were struck by his\ninsistence on their essential equality and their right to challenge\nthe status quo. In May 1792 a prosecution for sedition was initiated\nagainst him. When the case was heard in November of that year he was\noutlawed—but by this time he had returned to France, having been\nelected as a member to the National Convention in the summer of\n1792.\n\nHe arrived in Paris shortly before the September massacres, and it\nseems clear that he found it hard to find his feet—being out of\nsympathy with the more sanguinary elements in the city. His closest\nconnections were with Girondin leaders in Paris, who were rapidly to\nfall from favour. Moreover, his plea in the National Convention for\nclemency for Louis XVI at his trial at the end of 1792, led to his\ndenunciation by Marat and the enmity of the Jacobin faction. He served\nwith Condorcet and Sieyes on the Committee to design a republican\nconstitution, but the extent of his contribution is unclear, and\nalthough Condorcet pressed on with the work, producing a report in the\nspring of 1793, it was immediately shelved. Paine led an increasingly\nconstrained life as the Jacobins assumed ascendancy and his friends\nwere arrested and executed, fled, or killed themselves. Orders for his\narrest were issued on 27 December 1793. While he was being taken into\ncustody he passed to his American friend Joel Barlow the manuscript\nfor the first part of Age of Reason which was published\nshortly thereafter. Paine spent eleven months in the Luxembourg (not\nunconnected to the studied neglect of his case by the US Minister,\nGouvernor Morris), and seems only narrowly to have escaped the\nguillotine. When he left prison, after Robespierre’s execution,\nit was thanks to the intervention of Morris’s successor, James\nMonroe. On his release, Paine was in an extremely debilitated state,\nand Monroe looked after him in his home. Paine’s angry\ndenunciation of Washington, whom he believed had ignored his pleas for\nhelp, and the publication of subsequent parts of Age of\nReason made Monroe increasingly uncomfortable with his guest and\nPaine left to live with the printer Nicholas Bonneville and his\nfamily.\n\nAlthough still a member of the National Convention, Paine had rarely\nattended and did not do so after his release. His one intervention was\nhis Dissertation on First Principles of Government (1795), a\ncritique of the Constitution of 1795, and a summary of his own\nthinking about politics, in which he urged the Convention to institute\nuniversal manhood suffrage. In 1796, responding to the attempted coup\nby Babeuf’s ‘conspiracy of equals’, Paine’s\nAgrarian Justice developed further ideas fist canvassed in\nthe second part of Rights of Man and set out a principled\ncase for a tax on inheritance so as to provide a capital grant for all\nreaching the age of majority, together with an annual pension for all\nat fifty, arguing that the earth is common property to the human race\nand that everyone is owed compensation for the private appropriation\nof it.\n\nPaine finally left France to return to America in 1803, during the\nPeace of Amiens, but was vilified on his return for his radicalism,\nhis deism, and for his embittered critique of Washington. He was\njoined in America in 1804 by the wife of Nicholas de Bonneville and\nher three sons who lived with him for a period; but this arrangement\nbroke down and Paine became increasingly ill and isolated. He died in\nobscurity in 1809. In 1819, William Cobbett, the Tory turned radical\nand critic of Paine turned supporter, had Paine’s bones dug up\nand returned to England to be buried with honour. They were promptly\nlost, thereby ensuring that the man who declared his attachment to be\n‘to all the world, not to any particular part’ retained\nhis universal citizenship.\n",
    "section_title": "1. Life",
    "entry_title": "Thomas Paine",
    "hierarchy_title": "Thomas Paine || Life",
    "tokenized_text": [
        "life",
        "life",
        "thomas",
        "paine",
        "born",
        "january",
        "family",
        "moderate",
        "mean",
        "norfolk",
        "england",
        "father",
        "quaker",
        "mother",
        "anglican",
        "likely",
        "paine",
        "baptized",
        "anglican",
        "church",
        "schooling",
        "although",
        "father",
        "forbade",
        "learn",
        "latin",
        "age",
        "twelve",
        "withdrawn",
        "school",
        "apprenticed",
        "father",
        "learn",
        "craft",
        "staymaking",
        "midteens",
        "inspired",
        "romantic",
        "story",
        "naval",
        "life",
        "one",
        "teacher",
        "paine",
        "twice",
        "ran",
        "away",
        "home",
        "sea",
        "first",
        "time",
        "intercepted",
        "second",
        "time",
        "enlisted",
        "privateer",
        "king",
        "prussia",
        "exact",
        "sequence",
        "event",
        "subsequent",
        "ten",
        "fifteen",
        "year",
        "unclear",
        "lived",
        "london",
        "also",
        "period",
        "sandwich",
        "margate",
        "continued",
        "periodically",
        "ply",
        "skill",
        "staymaker",
        "may",
        "done",
        "preaching",
        "methodist",
        "persuasion",
        "married",
        "mary",
        "lambert",
        "died",
        "following",
        "year",
        "childbirth",
        "following",
        "wife",
        "death",
        "sought",
        "fatherinlaw",
        "support",
        "take",
        "career",
        "excise",
        "service",
        "first",
        "served",
        "officer",
        "december",
        "august",
        "dismissed",
        "tradition",
        "stamping",
        "providing",
        "certificate",
        "good",
        "inspected",
        "new",
        "research",
        "brent",
        "et",
        "al",
        "suggests",
        "may",
        "whistleblowing",
        "wrote",
        "formally",
        "seeking",
        "readmission",
        "service",
        "granted",
        "awaiting",
        "posting",
        "taught",
        "school",
        "london",
        "accepted",
        "posting",
        "lewes",
        "south",
        "coast",
        "england",
        "took",
        "lodging",
        "samuel",
        "ollive",
        "local",
        "tobacconist",
        "lewes",
        "became",
        "member",
        "debating",
        "societythe",
        "headstrong",
        "cluband",
        "also",
        "reputed",
        "skater",
        "player",
        "bowl",
        "ollive",
        "died",
        "july",
        "paine",
        "took",
        "lodging",
        "elsewhere",
        "sustained",
        "link",
        "family",
        "march",
        "married",
        "daughter",
        "elizabeth",
        "ollive",
        "established",
        "part",
        "proprietor",
        "business",
        "following",
        "year",
        "went",
        "london",
        "press",
        "claim",
        "exciseman",
        "higher",
        "pay",
        "although",
        "returned",
        "lewes",
        "sacked",
        "excise",
        "marriage",
        "failed",
        "sold",
        "business",
        "final",
        "settlement",
        "paine",
        "wife",
        "awarded",
        "headed",
        "london",
        "secured",
        "letter",
        "introduction",
        "benjamin",
        "franklin",
        "encountered",
        "earlier",
        "visit",
        "capital",
        "embarked",
        "april",
        "new",
        "world",
        "carried",
        "ashore",
        "philadelphia",
        "november",
        "suffering",
        "putrid",
        "fever",
        "survived",
        "philadelphia",
        "paine",
        "developed",
        "acquaintance",
        "robert",
        "aitkin",
        "publisher",
        "bookseller",
        "employed",
        "edit",
        "pennsylvania",
        "magazine",
        "remains",
        "considerable",
        "disagreement",
        "piece",
        "magazine",
        "written",
        "paine",
        "seems",
        "clear",
        "contribute",
        "developed",
        "reputation",
        "among",
        "political",
        "circle",
        "philadelphia",
        "result",
        "time",
        "tension",
        "britain",
        "reaching",
        "crisis",
        "point",
        "autumn",
        "encouraged",
        "benjamin",
        "rush",
        "paine",
        "began",
        "work",
        "pamphlet",
        "defending",
        "case",
        "american",
        "independence",
        "discussed",
        "work",
        "rush",
        "david",
        "rittenhouse",
        "benjamin",
        "franklin",
        "samuel",
        "adam",
        "work",
        "save",
        "title",
        "rush",
        "claimed",
        "responsibility",
        "common",
        "sense",
        "widely",
        "read",
        "pamphlet",
        "american",
        "revolution",
        "clarion",
        "call",
        "unity",
        "corrupt",
        "british",
        "court",
        "realize",
        "america",
        "providential",
        "role",
        "providing",
        "asylum",
        "liberty",
        "written",
        "direct",
        "lively",
        "style",
        "denounced",
        "decaying",
        "despotism",
        "europe",
        "pilloried",
        "hereditary",
        "monarchy",
        "absurdity",
        "time",
        "many",
        "still",
        "hoped",
        "reconciliation",
        "britain",
        "common",
        "sense",
        "demonstrated",
        "many",
        "inevitability",
        "separation",
        "paine",
        "consolidated",
        "reputation",
        "pamphleteer",
        "series",
        "american",
        "crisis",
        "letter",
        "also",
        "served",
        "number",
        "capacity",
        "congress",
        "pennsylvanian",
        "assembly",
        "although",
        "link",
        "radical",
        "element",
        "pennsylvanian",
        "politics",
        "also",
        "committed",
        "energy",
        "number",
        "elite",
        "projectscontributing",
        "establishment",
        "bank",
        "america",
        "help",
        "raise",
        "money",
        "war",
        "working",
        "robert",
        "morris",
        "encourage",
        "state",
        "legislature",
        "accept",
        "need",
        "federal",
        "taxation",
        "support",
        "war",
        "following",
        "conclusion",
        "war",
        "awarded",
        "farm",
        "new",
        "york",
        "assembly",
        "congress",
        "voted",
        "grant",
        "service",
        "revolution",
        "dedicated",
        "time",
        "scientific",
        "experiment",
        "designing",
        "iron",
        "bridge",
        "capable",
        "spanning",
        "wide",
        "distance",
        "without",
        "use",
        "pier",
        "experimenting",
        "marsh",
        "gas",
        "washington",
        "attempting",
        "produce",
        "smokeless",
        "candle",
        "franklin",
        "took",
        "wooden",
        "model",
        "bridge",
        "paris",
        "subsequently",
        "england",
        "iron",
        "model",
        "foot",
        "forged",
        "constructed",
        "public",
        "display",
        "field",
        "near",
        "paddington",
        "may",
        "also",
        "became",
        "increasingly",
        "caught",
        "initial",
        "event",
        "french",
        "revolution",
        "thanks",
        "part",
        "involvement",
        "group",
        "french",
        "intellectual",
        "enabled",
        "thomas",
        "jefferson",
        "u",
        "minister",
        "france",
        "late",
        "paine",
        "contemplated",
        "writing",
        "history",
        "french",
        "revolution",
        "made",
        "slow",
        "progressexacerbated",
        "poor",
        "french",
        "edmund",
        "burke",
        "reflection",
        "revolution",
        "france",
        "appeared",
        "november",
        "determined",
        "answer",
        "turned",
        "material",
        "task",
        "result",
        "right",
        "man",
        "februarymarch",
        "coupled",
        "narrative",
        "french",
        "event",
        "trenchant",
        "attack",
        "burke",
        "revolution",
        "settlement",
        "immediate",
        "success",
        "brought",
        "paine",
        "circle",
        "seeking",
        "achieve",
        "parliamentary",
        "reform",
        "britain",
        "continued",
        "visit",
        "france",
        "paris",
        "june",
        "immediate",
        "aftermath",
        "louis",
        "xvi",
        "flight",
        "varennes",
        "collaborated",
        "small",
        "group",
        "including",
        "nicholas",
        "bonneville",
        "marquis",
        "de",
        "condorcet",
        "produce",
        "republican",
        "manifesto",
        "pasted",
        "wall",
        "paris",
        "outrage",
        "member",
        "national",
        "assembly",
        "movement",
        "firmly",
        "repressed",
        "massacre",
        "champ",
        "de",
        "mar",
        "july",
        "time",
        "paine",
        "already",
        "back",
        "britain",
        "occasion",
        "mark",
        "shift",
        "thinkingfrom",
        "seeing",
        "monarchy",
        "inevitable",
        "part",
        "institutional",
        "order",
        "corrupt",
        "state",
        "europe",
        "thinking",
        "american",
        "model",
        "could",
        "applied",
        "generally",
        "throughout",
        "europe",
        "right",
        "man",
        "shown",
        "considerable",
        "tolerance",
        "france",
        "limited",
        "monarchy",
        "right",
        "man",
        "part",
        "second",
        "march",
        "explicitly",
        "republican",
        "drew",
        "extensively",
        "american",
        "experience",
        "sketching",
        "basic",
        "principle",
        "largely",
        "selfregulating",
        "commercial",
        "society",
        "coupled",
        "representative",
        "government",
        "rule",
        "law",
        "periodically",
        "renewable",
        "covenant",
        "final",
        "chapter",
        "influenced",
        "friendship",
        "condorcet",
        "member",
        "comité",
        "de",
        "mendicité",
        "outlined",
        "program",
        "welfare",
        "provision",
        "poor",
        "aged",
        "disabled",
        "destitute",
        "two",
        "part",
        "right",
        "man",
        "quickly",
        "combined",
        "cheap",
        "edition",
        "paine",
        "insistence",
        "sold",
        "unprecedented",
        "number",
        "paine",
        "advocacy",
        "natural",
        "right",
        "attack",
        "mixed",
        "government",
        "outspoken",
        "republicanism",
        "extensive",
        "proposal",
        "scheme",
        "social",
        "welfare",
        "set",
        "apart",
        "common",
        "opposition",
        "rhetoric",
        "emphasized",
        "need",
        "protect",
        "integrity",
        "mixed",
        "constitution",
        "secure",
        "english",
        "liberty",
        "success",
        "suggests",
        "reaching",
        "popular",
        "audience",
        "attached",
        "diminishing",
        "weight",
        "tradition",
        "struck",
        "insistence",
        "essential",
        "equality",
        "right",
        "challenge",
        "status",
        "quo",
        "may",
        "prosecution",
        "sedition",
        "initiated",
        "case",
        "heard",
        "november",
        "year",
        "outlawedbut",
        "time",
        "returned",
        "france",
        "elected",
        "member",
        "national",
        "convention",
        "summer",
        "arrived",
        "paris",
        "shortly",
        "september",
        "massacre",
        "seems",
        "clear",
        "found",
        "hard",
        "find",
        "feetbeing",
        "sympathy",
        "sanguinary",
        "element",
        "city",
        "closest",
        "connection",
        "girondin",
        "leader",
        "paris",
        "rapidly",
        "fall",
        "favour",
        "moreover",
        "plea",
        "national",
        "convention",
        "clemency",
        "louis",
        "xvi",
        "trial",
        "end",
        "led",
        "denunciation",
        "marat",
        "enmity",
        "jacobin",
        "faction",
        "served",
        "condorcet",
        "sieyes",
        "committee",
        "design",
        "republican",
        "constitution",
        "extent",
        "contribution",
        "unclear",
        "although",
        "condorcet",
        "pressed",
        "work",
        "producing",
        "report",
        "spring",
        "immediately",
        "shelved",
        "paine",
        "led",
        "increasingly",
        "constrained",
        "life",
        "jacobin",
        "assumed",
        "ascendancy",
        "friend",
        "arrested",
        "executed",
        "fled",
        "killed",
        "order",
        "arrest",
        "issued",
        "december",
        "taken",
        "custody",
        "passed",
        "american",
        "friend",
        "joel",
        "barlow",
        "manuscript",
        "first",
        "part",
        "age",
        "reason",
        "published",
        "shortly",
        "thereafter",
        "paine",
        "spent",
        "eleven",
        "month",
        "luxembourg",
        "unconnected",
        "studied",
        "neglect",
        "case",
        "u",
        "minister",
        "gouvernor",
        "morris",
        "seems",
        "narrowly",
        "escaped",
        "guillotine",
        "left",
        "prison",
        "robespierre",
        "execution",
        "thanks",
        "intervention",
        "morris",
        "successor",
        "james",
        "monroe",
        "release",
        "paine",
        "extremely",
        "debilitated",
        "state",
        "monroe",
        "looked",
        "home",
        "paine",
        "angry",
        "denunciation",
        "washington",
        "believed",
        "ignored",
        "plea",
        "help",
        "publication",
        "subsequent",
        "part",
        "age",
        "reason",
        "made",
        "monroe",
        "increasingly",
        "uncomfortable",
        "guest",
        "paine",
        "left",
        "live",
        "printer",
        "nicholas",
        "bonneville",
        "family",
        "although",
        "still",
        "member",
        "national",
        "convention",
        "paine",
        "rarely",
        "attended",
        "release",
        "one",
        "intervention",
        "dissertation",
        "first",
        "principle",
        "government",
        "critique",
        "constitution",
        "summary",
        "thinking",
        "politics",
        "urged",
        "convention",
        "institute",
        "universal",
        "manhood",
        "suffrage",
        "responding",
        "attempted",
        "coup",
        "babeuf",
        "conspiracy",
        "equal",
        "paine",
        "agrarian",
        "justice",
        "developed",
        "idea",
        "fist",
        "canvassed",
        "second",
        "part",
        "right",
        "man",
        "set",
        "principled",
        "case",
        "tax",
        "inheritance",
        "provide",
        "capital",
        "grant",
        "reaching",
        "age",
        "majority",
        "together",
        "annual",
        "pension",
        "fifty",
        "arguing",
        "earth",
        "common",
        "property",
        "human",
        "race",
        "everyone",
        "owed",
        "compensation",
        "private",
        "appropriation",
        "paine",
        "finally",
        "left",
        "france",
        "return",
        "america",
        "peace",
        "amiens",
        "vilified",
        "return",
        "radicalism",
        "deism",
        "embittered",
        "critique",
        "washington",
        "joined",
        "america",
        "wife",
        "nicholas",
        "de",
        "bonneville",
        "three",
        "son",
        "lived",
        "period",
        "arrangement",
        "broke",
        "paine",
        "became",
        "increasingly",
        "ill",
        "isolated",
        "died",
        "obscurity",
        "william",
        "cobbett",
        "tory",
        "turned",
        "radical",
        "critic",
        "paine",
        "turned",
        "supporter",
        "paine",
        "bone",
        "dug",
        "returned",
        "england",
        "buried",
        "honour",
        "promptly",
        "lost",
        "thereby",
        "ensuring",
        "man",
        "declared",
        "attachment",
        "world",
        "particular",
        "part",
        "retained",
        "universal",
        "citizenship"
    ]
}