{
    "main_text": "Representationalist theories || The problem of focus\n4.2 The problem of focus\n\nOne of the central difficulties for any perceptual/representational\nview of pain is to explain why, if feeling pain is genuinely\nperceiving tissue damage in a body part, we report its experience\nrather than the tissue damage (see Pitcher 1970, pp. 379–80;\nArmstrong 1962, p. 125; and Aydede 2009, 2017b for the statement of\nthe\n difficulty).[17]\n We may call this difficulty the problem of focus for perceptual\ntheories in general (including strong representationalist views).\nAccording to the common sense conception of pain (and following it,\nmost perceptual theories) we are, epistemologically and\npsychologically, more interested in the experience than its object,\ntissue damage. Our spontaneous conceptual reaction also follows this\npattern: there is a marked difference in the locus of concept\napplication or conceptual identification between standard\nexteroception and pain. As depicted in Figure 1 above, there is an\nobvious asymmetry between the two. If feeling pain is nothing but\nperceiving tissue damage in a bodily region on a par with seeing a red\napple, then one would naturally expect that when we report pain in\nbody parts, we are reporting a perceptual relation that obtains\nbetween the perceiver and an extramental condition perceived.\n\nBut this is not what we find. Instead, what we find is a report of an\nexperience of a certain sort whose informational/representational\netiology makes no difference to its own conceptual classification. A\npain report is a report of an experience whose representational\naccuracy is of no relevance to whether the report itself is accurate.\nRecall that, on most perceptual theories, when I utter a sentence like\n(5), I am saying something like “I am having an experience which\ntells me that there is some sort of physical disorder in the back of\nmy hand.” In other words, I simply report an experience that\ntells me something. Whether or not I come to believe what it tells me\nis a matter of factors that ought not to be read into the analysis of\nwhat the truth-conditions of (5) are. In fact, this sort of analysis\nproposed by perceptual theorists seems initially plausible given the\nordinary conception of pain, and thus can be taken as an argument in\nfavor of such theories. But this is precisely where the problem lies\nfor perceptual theories. Why is a pain report a report of an\nexperience in the first instance if the experience is genuinely\nperceptual (exteroceptual)? Isn’t this strange? Nothing of this\nsort happens in genuine perception. In fact, this asymmetry can be\ntransformed into a compelling argument against perceptual (as well as\nstrong representationalist) theories in the following way.\n\nEvery genuine case of perception invites reporting an instance of\nperception in the relevant modality by sentences similar to (9)-(13),\nwhere the perceptual verb is used dominantly as a success verb. For\ninstance:\n\n\n(10) I see a red apple on the table.\n\n\nThis is for good reason: perception essentially is an activity whereby\none gathers information about one’s (extramental) environment in\nreal time (including one’s internal bodily environment of\ncourse). So it is not surprising that the dominant form of reporting\nis in the form of a relation between the perceiver and the perceived\nwhere the latter are extramental objects or conditions of one’s\nenvironment. It is also not surprising that perception typically\nyields conceptual categorization of the perceived object or condition\nin the first instance: the typical result of a perceptual process is\nbringing the perceived object under a perceptual concept. Genuine\nperception thus puts the premium in the perceived object, not in the\nperceptual activity itself or in the perceptual experience whereby one\nis typically brought into epistemic contact with one’s\nextramental environment. Hence the typical result of perception is the\nacquisition of beliefs with contents expressible by sentences like\n(9)–(13). If sentences reporting pain in body parts don’t\nfollow this pattern, i.e., if they are not to be construed as reports\nof perceptual relations between the perceiver and the perceived, then\npain reports are prima facie not perceptual reports, reports\nto the effect that one stands in a perceptual relation to something\nextramental. But pain reports report feeling pain. Thus feeling pain\nis a not a form of genuine perception. Let us call this the\nargument from focus against perceptual theories.\n\nThere is an obvious sense in which the perceptual theorist is bound to\nconcede that reporting pain is not a case of reporting the obtaining\nof a perceptual relation between the perceiver and the extramental\nperceived object. For to the extent to which reporting pain is\nreporting a conscious experience and only that, to that extent it is\nan introspective report, a report of intramental activity.\nNevertheless, a perceptual theorist would insist that this reported\nexperience is a perceptual experience. But why report the experience,\nthe messenger, rather than its object, the message? Why are we fixated\non the messenger here?\n\nA natural explanation that a perceptual theorist might give is that\nunlike other perceptual modalities, the acts of sensing tissue damage\ninvolved in feeling pain (i.e., the experience) have a very pronounced\nnegative affective quality: pains are unpleasant, awful, hurtful,\npainful (see Pitcher 1970, p. 379ff; and Armstrong 1962, p. 125ff;\n1968, p. 310ff). It is this negative affect that explains why we are\nfixated on the experience itself, rather than what it is a perception\nof, i.e., traumatized body parts. In other words, it is this negative\nquality that turns the recognitional focus onto itself, and with it,\nonto the experience it attaches to. If this is correct, then, of\ncourse, pains are equally unpleasant even when they misrepresent. This\nis why we pick out our acts of sensing (i.e., the experiences\nthemselves) rather than their external objects irrespective of their\ninformational etiology: whether or not they are veridical, they\nequally hurt.\n\nThis seems to be a plausible explanation on a first pass. Indeed, a\nperceptual theorist can even give, plausibly, an evolutionary story\nabout why these perceptual experiences should feel unpleasant: they\nrepresent or signal a property of body parts that tends to hinder\nsurvival. However, can the same sort of explanation be given for other\nintransitive bodily sensations like itches, tickles, tingles, and\norgasms? Perhaps it can be done for experiencing orgasms, which are\nusually intensely pleasurable and has obvious evolutionary benefits\n(Block 1996, Tye 1996b, Aydede 2019). But what about others? Itches\nhave an unpleasant quality to them which normally makes one want to\nscratch the spot where one itches. But tickles and tingles can be\npleasant at times and unpleasant at others, as well as affectively\nneutral at still other times. Still, the concept of a tickle or tingle\nis like the concept of a pain in that they apply to the acts of\nsensing or experiencing, rather than to what external conditions these\nacts may be representing — if they represent\n anything.[18]\n Further, gustatory and olfactory experiences can be pleasant,\nunpleasant or affectively neutral, yet the acts of sensing involved in\nthe exercise of these sensory modalities seem to be largely\ntransparent in that we apply the relevant concepts like SWEET, BITTER,\netc. to the external objects of these experiences in the first\ninstance, and only derivatively or incidentally to the acts of sensing\nor to the experiences themselves.\n\nThese observations cast doubt on the plausibility of the explanation\noffered by the perceptual theorist for the asymmetry in focus.\nHowever, the perceptual theorist can still claim that whatever the\nexplanation might be in the case of other intransitive bodily\nsensations, the explanation offered for pain is essentially correct,\nand such a theorist may thus conclude that she has discharged the\nburden of proof in claiming that experiencing pain is engaging in\ngenuine exteroception. This reply has some initial plausibility since\npain experiences have almost always a pronounced negative affect.\nNevertheless, if one suspects — as one should — that the\nintransitivity of certain kinds of bodily sensations as a whole must\nhave a unified explanation, one would be wise to conclude that the\noffered explanation is probably not the whole story, and thus might\nnot be adequate all by itself.\n\nThere is also quite substantial scientific evidence that there are\nabnormal pain phenomena where the sensory and affective aspects of\npain experiences are dissociated from each other — see Section\n6.1 below for references and for further discussion. The most typical\ncase is known as the pain asymbolia syndrome, where people who suffer\nfrom it have pain experiences without the negative affect.\nInterestingly, these people still identify their experience as pain,\nbut show no bodily, emotional, and behavioral signs typically\nassociated with the unpleasant aspect of pains. They are feeling a\npain that doesn’t hurt! If pains are not necessarily unpleasant,\nas this syndrome seems to show, it is an interesting and open question\nwhether feeling pains without its negative affect would still retain\nits intransitive nature.\n\nBut the real problem for this response that appeals to negative affect\nis that even if the provided explanation were correct, it would not\nsave a perceptual theory. The explanandum (namely, that the semantic\nfocus of spontaneous concept application in reporting pains is the\nexperience rather than the extramental object of this experience) can\nplausibly be interpreted as admission that feeling pain in a body part\nis not perceiving something extramental there. What justifies this\ninterpretation is a reasonable condition on genuine perception: an\nexperience kind is genuinely perceptual only if it generally gives\nrise to proprietary concept applications whose semantic focus is the\nproper object of this kind of experience. In other words, some\ncognitive uptake of a certain sort is necessary for a sensory process\nto become genuinely perceptual. Generally, concepts of secondary\nqualities are taken to be proprietary for each sensory modality.\nIndeed these concepts primarily apply to objects of experiences\ntypically generated by these modalities, rather than to the\nexperiences themselves (or if they do, only derivatively). But in the\ncase of pain, we don’t seem to semantically apply PAIN, or\n‘pain’ for that matter, to tissue damage. Again this is\nevidenced by the truth-conditions of pain attributing sentences, as\nwe’ve seen before. So the explanans may be correct, but it seems\nto miss its target, the explanandum: it turns out to be an explanation\nof why feeling pain is not genuinely perceptual.\n\nAnother kind of response to the problem of focus might be to treat it\nas a pseudo problem that stems from our linguistic practices without\naffecting the phenomena. It might be argued in the following way\n(Chalmers in correspondence; cf. Hill 2006, 2009, 2017). We can invent\na term ‘see2’ such that one can see2\neven when the perceptual object is not present (so\n‘see2’ applies to the visual experience, unlike\nthe ordinary ‘see1’). We can also invent a term\n‘feel1’ such that feeling1 requires\nthe presence of the perceptual object, tissue damage (so\n‘feel1’ is unlike the ordinary\n‘feel2’). As it happens, in our language\n‘see’ expresses “see1” and\n‘feel’ expresses “feel2”, but\nthat’s just terminology. At the level of phenomena, the two\ncases are on a par.\n\nBut the problem won’t go away with this maneuver. For one thing,\nit doesn’t really address the anti-perceptualist argument from\nfocus given above. For another, the question isn’t whether we\ncan or cannot invent new terms or form new concepts so that the two\nphenomena turn out to be type-identical. Linguistic practices reflect\nour conceptual practices, how we think and conceptually respond to\nincoming perceptual information. As a matter of fact, our conceptual\npractices treat seeing and other standard exteroception differently\nfrom the way they treat feeling pain, despite the fact that the types\nof information flow seem identical in both cases. The question is why?\nFor these practices are shaped by our epistemic needs and\npsychological preferences that show up in our behavior. They are not\narbitrary. If perception is a psychological process by which we gather\ninformation about the extramental world and align our conceptual and\nbehavioral responses on this basis in a certain way, it is a fair\nquestion to ask whether a psychological process that deviates from\nthis is perception, especially when the deviation seems to reflect\nthat our epistemic needs and psychological preferences are markedly\ndifferent than those involved in exteroception. The question of\nwhether feeling pain is perception is not a purely metaphysical or\nphilosophical question, but it is also partly and importantly an\nempirical (psychological) question.\n",
    "section_title": "4.2 The problem of focus",
    "entry_title": "Pain",
    "hierarchy_title": "Pain || Representationalist theories || The problem of focus",
    "tokenized_text": [
        "representationalist",
        "theory",
        "problem",
        "focus",
        "problem",
        "focus",
        "one",
        "central",
        "difficulty",
        "perceptualrepresentational",
        "view",
        "pain",
        "explain",
        "feeling",
        "pain",
        "genuinely",
        "perceiving",
        "tissue",
        "damage",
        "body",
        "part",
        "report",
        "experience",
        "rather",
        "tissue",
        "damage",
        "see",
        "pitcher",
        "pp",
        "armstrong",
        "p",
        "aydede",
        "b",
        "statement",
        "difficulty",
        "may",
        "call",
        "difficulty",
        "problem",
        "focus",
        "perceptual",
        "theory",
        "general",
        "including",
        "strong",
        "representationalist",
        "view",
        "according",
        "common",
        "sense",
        "conception",
        "pain",
        "following",
        "perceptual",
        "theory",
        "epistemologically",
        "psychologically",
        "interested",
        "experience",
        "object",
        "tissue",
        "damage",
        "spontaneous",
        "conceptual",
        "reaction",
        "also",
        "follows",
        "pattern",
        "marked",
        "difference",
        "locus",
        "concept",
        "application",
        "conceptual",
        "identification",
        "standard",
        "exteroception",
        "pain",
        "depicted",
        "figure",
        "obvious",
        "asymmetry",
        "two",
        "feeling",
        "pain",
        "nothing",
        "perceiving",
        "tissue",
        "damage",
        "bodily",
        "region",
        "par",
        "seeing",
        "red",
        "apple",
        "one",
        "would",
        "naturally",
        "expect",
        "report",
        "pain",
        "body",
        "part",
        "reporting",
        "perceptual",
        "relation",
        "obtains",
        "perceiver",
        "extramental",
        "condition",
        "perceived",
        "find",
        "instead",
        "find",
        "report",
        "experience",
        "certain",
        "sort",
        "whose",
        "informationalrepresentational",
        "etiology",
        "make",
        "difference",
        "conceptual",
        "classification",
        "pain",
        "report",
        "report",
        "experience",
        "whose",
        "representational",
        "accuracy",
        "relevance",
        "whether",
        "report",
        "accurate",
        "recall",
        "perceptual",
        "theory",
        "utter",
        "sentence",
        "like",
        "saying",
        "something",
        "like",
        "experience",
        "tell",
        "sort",
        "physical",
        "disorder",
        "back",
        "hand",
        "word",
        "simply",
        "report",
        "experience",
        "tell",
        "something",
        "whether",
        "come",
        "believe",
        "tell",
        "matter",
        "factor",
        "ought",
        "read",
        "analysis",
        "truthconditions",
        "fact",
        "sort",
        "analysis",
        "proposed",
        "perceptual",
        "theorist",
        "seems",
        "initially",
        "plausible",
        "given",
        "ordinary",
        "conception",
        "pain",
        "thus",
        "taken",
        "argument",
        "favor",
        "theory",
        "precisely",
        "problem",
        "lie",
        "perceptual",
        "theory",
        "pain",
        "report",
        "report",
        "experience",
        "first",
        "instance",
        "experience",
        "genuinely",
        "perceptual",
        "exteroceptual",
        "strange",
        "nothing",
        "sort",
        "happens",
        "genuine",
        "perception",
        "fact",
        "asymmetry",
        "transformed",
        "compelling",
        "argument",
        "perceptual",
        "well",
        "strong",
        "representationalist",
        "theory",
        "following",
        "way",
        "every",
        "genuine",
        "case",
        "perception",
        "invite",
        "reporting",
        "instance",
        "perception",
        "relevant",
        "modality",
        "sentence",
        "similar",
        "perceptual",
        "verb",
        "used",
        "dominantly",
        "success",
        "verb",
        "instance",
        "see",
        "red",
        "apple",
        "table",
        "good",
        "reason",
        "perception",
        "essentially",
        "activity",
        "whereby",
        "one",
        "gather",
        "information",
        "one",
        "extramental",
        "environment",
        "real",
        "time",
        "including",
        "one",
        "internal",
        "bodily",
        "environment",
        "course",
        "surprising",
        "dominant",
        "form",
        "reporting",
        "form",
        "relation",
        "perceiver",
        "perceived",
        "latter",
        "extramental",
        "object",
        "condition",
        "one",
        "environment",
        "also",
        "surprising",
        "perception",
        "typically",
        "yield",
        "conceptual",
        "categorization",
        "perceived",
        "object",
        "condition",
        "first",
        "instance",
        "typical",
        "result",
        "perceptual",
        "process",
        "bringing",
        "perceived",
        "object",
        "perceptual",
        "concept",
        "genuine",
        "perception",
        "thus",
        "put",
        "premium",
        "perceived",
        "object",
        "perceptual",
        "activity",
        "perceptual",
        "experience",
        "whereby",
        "one",
        "typically",
        "brought",
        "epistemic",
        "contact",
        "one",
        "extramental",
        "environment",
        "hence",
        "typical",
        "result",
        "perception",
        "acquisition",
        "belief",
        "content",
        "expressible",
        "sentence",
        "like",
        "sentence",
        "reporting",
        "pain",
        "body",
        "part",
        "follow",
        "pattern",
        "ie",
        "construed",
        "report",
        "perceptual",
        "relation",
        "perceiver",
        "perceived",
        "pain",
        "report",
        "prima",
        "facie",
        "perceptual",
        "report",
        "report",
        "effect",
        "one",
        "stand",
        "perceptual",
        "relation",
        "something",
        "extramental",
        "pain",
        "report",
        "report",
        "feeling",
        "pain",
        "thus",
        "feeling",
        "pain",
        "form",
        "genuine",
        "perception",
        "let",
        "u",
        "call",
        "argument",
        "focus",
        "perceptual",
        "theory",
        "obvious",
        "sense",
        "perceptual",
        "theorist",
        "bound",
        "concede",
        "reporting",
        "pain",
        "case",
        "reporting",
        "obtaining",
        "perceptual",
        "relation",
        "perceiver",
        "extramental",
        "perceived",
        "object",
        "extent",
        "reporting",
        "pain",
        "reporting",
        "conscious",
        "experience",
        "extent",
        "introspective",
        "report",
        "report",
        "intramental",
        "activity",
        "nevertheless",
        "perceptual",
        "theorist",
        "would",
        "insist",
        "reported",
        "experience",
        "perceptual",
        "experience",
        "report",
        "experience",
        "messenger",
        "rather",
        "object",
        "message",
        "fixated",
        "messenger",
        "natural",
        "explanation",
        "perceptual",
        "theorist",
        "might",
        "give",
        "unlike",
        "perceptual",
        "modality",
        "act",
        "sensing",
        "tissue",
        "damage",
        "involved",
        "feeling",
        "pain",
        "ie",
        "experience",
        "pronounced",
        "negative",
        "affective",
        "quality",
        "pain",
        "unpleasant",
        "awful",
        "hurtful",
        "painful",
        "see",
        "pitcher",
        "p",
        "ff",
        "armstrong",
        "p",
        "ff",
        "p",
        "ff",
        "negative",
        "affect",
        "explains",
        "fixated",
        "experience",
        "rather",
        "perception",
        "ie",
        "traumatized",
        "body",
        "part",
        "word",
        "negative",
        "quality",
        "turn",
        "recognitional",
        "focus",
        "onto",
        "onto",
        "experience",
        "attache",
        "correct",
        "course",
        "pain",
        "equally",
        "unpleasant",
        "even",
        "misrepresent",
        "pick",
        "act",
        "sensing",
        "ie",
        "experience",
        "rather",
        "external",
        "object",
        "irrespective",
        "informational",
        "etiology",
        "whether",
        "veridical",
        "equally",
        "hurt",
        "seems",
        "plausible",
        "explanation",
        "first",
        "pas",
        "indeed",
        "perceptual",
        "theorist",
        "even",
        "give",
        "plausibly",
        "evolutionary",
        "story",
        "perceptual",
        "experience",
        "feel",
        "unpleasant",
        "represent",
        "signal",
        "property",
        "body",
        "part",
        "tends",
        "hinder",
        "survival",
        "however",
        "sort",
        "explanation",
        "given",
        "intransitive",
        "bodily",
        "sensation",
        "like",
        "itch",
        "tickle",
        "tingle",
        "orgasm",
        "perhaps",
        "done",
        "experiencing",
        "orgasm",
        "usually",
        "intensely",
        "pleasurable",
        "obvious",
        "evolutionary",
        "benefit",
        "block",
        "tye",
        "b",
        "aydede",
        "others",
        "itch",
        "unpleasant",
        "quality",
        "normally",
        "make",
        "one",
        "want",
        "scratch",
        "spot",
        "one",
        "itch",
        "tickle",
        "tingle",
        "pleasant",
        "time",
        "unpleasant",
        "others",
        "well",
        "affectively",
        "neutral",
        "still",
        "time",
        "still",
        "concept",
        "tickle",
        "tingle",
        "like",
        "concept",
        "pain",
        "apply",
        "act",
        "sensing",
        "experiencing",
        "rather",
        "external",
        "condition",
        "act",
        "may",
        "representing",
        "represent",
        "anything",
        "gustatory",
        "olfactory",
        "experience",
        "pleasant",
        "unpleasant",
        "affectively",
        "neutral",
        "yet",
        "act",
        "sensing",
        "involved",
        "exercise",
        "sensory",
        "modality",
        "seem",
        "largely",
        "transparent",
        "apply",
        "relevant",
        "concept",
        "like",
        "sweet",
        "bitter",
        "etc",
        "external",
        "object",
        "experience",
        "first",
        "instance",
        "derivatively",
        "incidentally",
        "act",
        "sensing",
        "experience",
        "observation",
        "cast",
        "doubt",
        "plausibility",
        "explanation",
        "offered",
        "perceptual",
        "theorist",
        "asymmetry",
        "focus",
        "however",
        "perceptual",
        "theorist",
        "still",
        "claim",
        "whatever",
        "explanation",
        "might",
        "case",
        "intransitive",
        "bodily",
        "sensation",
        "explanation",
        "offered",
        "pain",
        "essentially",
        "correct",
        "theorist",
        "may",
        "thus",
        "conclude",
        "discharged",
        "burden",
        "proof",
        "claiming",
        "experiencing",
        "pain",
        "engaging",
        "genuine",
        "exteroception",
        "reply",
        "initial",
        "plausibility",
        "since",
        "pain",
        "experience",
        "almost",
        "always",
        "pronounced",
        "negative",
        "affect",
        "nevertheless",
        "one",
        "suspect",
        "one",
        "intransitivity",
        "certain",
        "kind",
        "bodily",
        "sensation",
        "whole",
        "must",
        "unified",
        "explanation",
        "one",
        "would",
        "wise",
        "conclude",
        "offered",
        "explanation",
        "probably",
        "whole",
        "story",
        "thus",
        "might",
        "adequate",
        "also",
        "quite",
        "substantial",
        "scientific",
        "evidence",
        "abnormal",
        "pain",
        "phenomenon",
        "sensory",
        "affective",
        "aspect",
        "pain",
        "experience",
        "dissociated",
        "see",
        "section",
        "reference",
        "discussion",
        "typical",
        "case",
        "known",
        "pain",
        "asymbolia",
        "syndrome",
        "people",
        "suffer",
        "pain",
        "experience",
        "without",
        "negative",
        "affect",
        "interestingly",
        "people",
        "still",
        "identify",
        "experience",
        "pain",
        "show",
        "bodily",
        "emotional",
        "behavioral",
        "sign",
        "typically",
        "associated",
        "unpleasant",
        "aspect",
        "pain",
        "feeling",
        "pain",
        "hurt",
        "pain",
        "necessarily",
        "unpleasant",
        "syndrome",
        "seems",
        "show",
        "interesting",
        "open",
        "question",
        "whether",
        "feeling",
        "pain",
        "without",
        "negative",
        "affect",
        "would",
        "still",
        "retain",
        "intransitive",
        "nature",
        "real",
        "problem",
        "response",
        "appeal",
        "negative",
        "affect",
        "even",
        "provided",
        "explanation",
        "correct",
        "would",
        "save",
        "perceptual",
        "theory",
        "explanandum",
        "namely",
        "semantic",
        "focus",
        "spontaneous",
        "concept",
        "application",
        "reporting",
        "pain",
        "experience",
        "rather",
        "extramental",
        "object",
        "experience",
        "plausibly",
        "interpreted",
        "admission",
        "feeling",
        "pain",
        "body",
        "part",
        "perceiving",
        "something",
        "extramental",
        "justifies",
        "interpretation",
        "reasonable",
        "condition",
        "genuine",
        "perception",
        "experience",
        "kind",
        "genuinely",
        "perceptual",
        "generally",
        "give",
        "rise",
        "proprietary",
        "concept",
        "application",
        "whose",
        "semantic",
        "focus",
        "proper",
        "object",
        "kind",
        "experience",
        "word",
        "cognitive",
        "uptake",
        "certain",
        "sort",
        "necessary",
        "sensory",
        "process",
        "become",
        "genuinely",
        "perceptual",
        "generally",
        "concept",
        "secondary",
        "quality",
        "taken",
        "proprietary",
        "sensory",
        "modality",
        "indeed",
        "concept",
        "primarily",
        "apply",
        "object",
        "experience",
        "typically",
        "generated",
        "modality",
        "rather",
        "experience",
        "derivatively",
        "case",
        "pain",
        "seem",
        "semantically",
        "apply",
        "pain",
        "pain",
        "matter",
        "tissue",
        "damage",
        "evidenced",
        "truthconditions",
        "pain",
        "attributing",
        "sentence",
        "seen",
        "explanans",
        "may",
        "correct",
        "seems",
        "miss",
        "target",
        "explanandum",
        "turn",
        "explanation",
        "feeling",
        "pain",
        "genuinely",
        "perceptual",
        "another",
        "kind",
        "response",
        "problem",
        "focus",
        "might",
        "treat",
        "pseudo",
        "problem",
        "stem",
        "linguistic",
        "practice",
        "without",
        "affecting",
        "phenomenon",
        "might",
        "argued",
        "following",
        "way",
        "chalmers",
        "correspondence",
        "cf",
        "hill",
        "invent",
        "term",
        "see",
        "one",
        "see",
        "even",
        "perceptual",
        "object",
        "present",
        "see",
        "applies",
        "visual",
        "experience",
        "unlike",
        "ordinary",
        "see",
        "also",
        "invent",
        "term",
        "feel",
        "feeling",
        "requires",
        "presence",
        "perceptual",
        "object",
        "tissue",
        "damage",
        "feel",
        "unlike",
        "ordinary",
        "feel",
        "happens",
        "language",
        "see",
        "express",
        "see",
        "feel",
        "express",
        "feel",
        "terminology",
        "level",
        "phenomenon",
        "two",
        "case",
        "par",
        "problem",
        "go",
        "away",
        "maneuver",
        "one",
        "thing",
        "really",
        "address",
        "antiperceptualist",
        "argument",
        "focus",
        "given",
        "another",
        "question",
        "whether",
        "invent",
        "new",
        "term",
        "form",
        "new",
        "concept",
        "two",
        "phenomenon",
        "turn",
        "typeidentical",
        "linguistic",
        "practice",
        "reflect",
        "conceptual",
        "practice",
        "think",
        "conceptually",
        "respond",
        "incoming",
        "perceptual",
        "information",
        "matter",
        "fact",
        "conceptual",
        "practice",
        "treat",
        "seeing",
        "standard",
        "exteroception",
        "differently",
        "way",
        "treat",
        "feeling",
        "pain",
        "despite",
        "fact",
        "type",
        "information",
        "flow",
        "seem",
        "identical",
        "case",
        "question",
        "practice",
        "shaped",
        "epistemic",
        "need",
        "psychological",
        "preference",
        "show",
        "behavior",
        "arbitrary",
        "perception",
        "psychological",
        "process",
        "gather",
        "information",
        "extramental",
        "world",
        "align",
        "conceptual",
        "behavioral",
        "response",
        "basis",
        "certain",
        "way",
        "fair",
        "question",
        "ask",
        "whether",
        "psychological",
        "process",
        "deviate",
        "perception",
        "especially",
        "deviation",
        "seems",
        "reflect",
        "epistemic",
        "need",
        "psychological",
        "preference",
        "markedly",
        "different",
        "involved",
        "exteroception",
        "question",
        "whether",
        "feeling",
        "pain",
        "perception",
        "purely",
        "metaphysical",
        "philosophical",
        "question",
        "also",
        "partly",
        "importantly",
        "empirical",
        "psychological",
        "question"
    ]
}