{
    "main_text": "Representationalist theories || The problem of affective phenomenology\n4.3 The problem of affective phenomenology\n\nPains are not only sensory or perceptual experiences, they are also\naffective-motivational experiences, or at least they seem to have an\naffective aspect. Feeling pain is normally having an awful, hurtful,\n‘painful,’ experience. So we may say that pains have a\nnegative hedonic valence or affective value.\n\nStrong representationalists are committed to claiming that all aspects\nof phenomenology are representational. So if this negative affective\naspect of pain (i.e., the hurting, painful quality of pains) is a\nproper part of pain’s overall qualitative phenomenology, then it\nmust also be representational. But what does it represent? Pain\nphenomenology seems complex in that it seems to consist of at least\ntwo dimensions, affective-motivational and sensory-discriminative.\nRepresentationalists, along with earlier perceptual theorists, claim\nthat the sensory aspect of pain is representational: it represents\ntissue damage. But what does the affective aspect represent? There\ndoesn’t seem to be a plausible candidate.\n\nThe early perceptual theorists, especially direct realists, were\ncognitivist about pain’s negative affect. They claimed,\nroughly, that it consists of the experiencer’s spontaneous\ncognitive/conative reactions to their own pain experiences. These\nreactions were conceived as forming conative or evaluative\npropositional attitudes. In other words, the painfulness of pains\nwas constituted by their power to immediately “evoke in [one]\nthe peremptory desire that the [pain] perception should cease”\n(Armstrong 1968, pp. 314–16). (See also, Stephens and Graham\n1985, 1987; Nelkin 1986, 1994; Hall 1989. Cf. Parfit 1984. According\nto Chisholm’s 1987 presentation, Brentano also held that pains\nand pleasures are partly conative reactions to sensory elements.)\n\nEven though theoretically cognitivism is an option for\nrepresentationalism, adopting it would seem to violate the spirit of\nstrong representationalism. It all depends on how one would like to\ndevelop the cognitivist line. One option is to say that the affective\naspect of pain is not qualitative or phenomenological. We are under\nthe illusion that it is because we are hard-wired to cognitively and\nbehaviorally react to the sensory content of pain in a certain way.\nThis option has the advantage of preserving strong\nrepresentationalism: if affect is not qualitative, there is no\npressure to treat it as representational — cf. Tye (1996, pp.\n111–16 and 134–36; 1997, p. 332–3). But if it is\nadmitted that affective aspect of pain is as qualitative as its\nsensory content, then cognitivism comes as a compromise for strong\nrepresentationalist because it admits that not all phenomenal\ncharacter is representational. This latter option may lead to\nrepresentational-cum-functionalist approaches to pains and other\naffectively non-neutral experiences in that the sensory content of an\nexperience may be given a purely representational account while its\naffective dimension may be a matter of functionally processing this\ncontent for setting motivational parameters (on the assumption that\ncognitive attitudes can be captured functionally).\n\nThe problem with cognitivism in general is that it suffers from\nintuitive implausibility: it certainly doesn’t appear that the\nhurting aspect of pain experiences is just a matter of our\ncognitive reactions to them as ordinarily\nunderstood. Cognitive reactions in the form of propositional attitudes\ndon’t seem to have much qualitative phenomenology peculiar to\nthem. But more importantly, this move appears to mislocate the\nproblem. The question is: in what does the painfulness, the hurting\nquality, of pains consist? The answer offered seems to be: in our\ncognitive/conative reaction to the experience, something like having a\ndesire for it to stop, for instance. But one would like to think that\nit is because the experience is painful that one desires it to stop,\nnot the other way round.\n\nThe most straightforward way to deal with affective phenomenology for\na representationalist is to say that it too is representational, just\nlike the sensory phenomenology. Tye seems to propose such a view:\n\n\nPeople in pain try to get rid of it or to diminish it. Why? The answer\nsurely is because pain feels unpleasant or bad, because it is\nexperienced as such. But what exactly is experienced as\nunpleasant? One’s attention, when one feels pain, goes to a\nplace different from the one in which the experience of pain is\nlocated. The qualities that are experienced as unpleasant are located\nin the bodily location to which one attends (in normal circumstances).\nPeople whose pains lack the affective dimension undergo purely\nsensory, non-evaluative representations of tissue damage of one sort\nor another in a localized bodily region. Those whose pains are normal\nexperience the same qualities, but now those qualities are experienced\nby them as unpleasant. It is precisely because the qualities\nare experienced as unpleasant or bad that people have the cognitive\nreactions to them they do, reactions such as desiring to stop the\npain. To experience tissue damage as bad is to undergo an experience\nwhich represents that damage as bad. Accordingly, in my view, the\naffective dimension of pain is as much a part of the representational\ncontent of pain as the sensory dimension is. (Tye 2006a: 107)\n\n\nSo the experience I undergo when I feel a sharp pain in the back of my\nhand feels the way it does because it represents tissue damage in my\nhand and it represents it as bad. In other words, it represents tissue\ndamage as having the quality of being bad. (See also O’Sullivan\n& Schroer 2012; Bain 2013, 2017.)\n\nOf course, normally having one’s tissue damaged is bad. We also\nnormally think/judge that it is bad. Not only that, experiencing\ntissue damage (i.e., feeling pain) is bad. We think/judge so too. But\nit doesn’t follow from these truisms (without additional\npremises) that the experience represents the damage as\nbad. These truisms should not be confused with this last claim,\nwhich is a substantive metaphysical claim. But what does it mean for\none’s experience to represent tissue damage as bad?\n\nThis is a non-trivial question for a strong representationalist who\naspires to be a naturalist. Recall that strong representationalism\nusually comes with a naturalistic story about how experiences acquire\ntheir representational content. So it is important that representing\ntissue damage as bad can be cashed out in terms of whatever\nnaturalistic story a representationalist has in his disposal. Many\nrepresentationalists including Tye defend (or at least start with) an\ninformational theory. But what is the natural property of the tissue\ndamage itself that is detected or tracked by the experience so that we\ncan say the experience carries information about it? The\nproperty of being bad doesn’t seem to be the kind of property\nthat can be informationally detected or transduced. Arguably, an\ninformation-theoretic version of representationalism seems not quite\nappropriate for affective phenomenology (but see Tye 2006b for a\nresponse — for different options and critical discussion, see\nBain 2017, Cutter & Tye 2014, and Corns 2018).\n\nBut perhaps a functional role semantics might work better for cashing\nout what it means for pain experiences to represent tissue damage as\nbad. The idea is that pain experiences play a certain\nfunctional/causal role in the behavioral and mental economy of their\nowners. In particular, given that they normally signal injury, such\nexperiences are typically causally associated with a certain battery\nof cognitive and behavioral effects. It might be claimed that this\ncausal or functional profile as a whole (rather than a mere\ninformational link) is what makes pain experiences represent\ntissue damage as bad.\n\nIt is not clear, however, whether representationalism is doing any\nwork in this proposal once an appeal to functionalism is made. For one\nthing, it transforms strong representationalism into a partly\ninternalist theory. For another, why not simply say that the\nfunctional role itself constitutes pain’s affective\nphenomenology? Indeed, functionalism (or better: psychofunctionalism)\nin the philosophy of mind has always treated pains as paradigmatic\nexamples of qualitative mental states whose phenomenology can\nplausibly be captured by functionalist proposals. What made this prima\nfacie plausible was pain’s affective phenomenology (as opposed\nto its sensory phenomenology), which is essentially connected with\npain’s being an inherent motivator. But once functionalism is\nallowed, we don’t need to make a detour via representationalism.\nIn fact, it is hard to see how an experience’s representing\nsomething as bad can be an inherent motivator all by itself. To\nexplain how, a representationalist has to advert to additional\n(learning?) mechanisms to connect representational content with drive\nand motivation. (See Aydede & Fulkerson 2014, 2019 for an\nelaboration of a psychofunctionalist account of pain affect as well as\nfurther criticisms of representationalism from a functionalist\nperspective. See Corns 2014 for criticism.)\n",
    "section_title": "4.3 The problem of affective phenomenology",
    "entry_title": "Pain",
    "hierarchy_title": "Pain || Representationalist theories || The problem of affective phenomenology",
    "tokenized_text": [
        "representationalist",
        "theory",
        "problem",
        "affective",
        "phenomenology",
        "problem",
        "affective",
        "phenomenology",
        "pain",
        "sensory",
        "perceptual",
        "experience",
        "also",
        "affectivemotivational",
        "experience",
        "least",
        "seem",
        "affective",
        "aspect",
        "feeling",
        "pain",
        "normally",
        "awful",
        "hurtful",
        "painful",
        "experience",
        "may",
        "say",
        "pain",
        "negative",
        "hedonic",
        "valence",
        "affective",
        "value",
        "strong",
        "representationalists",
        "committed",
        "claiming",
        "aspect",
        "phenomenology",
        "representational",
        "negative",
        "affective",
        "aspect",
        "pain",
        "ie",
        "hurting",
        "painful",
        "quality",
        "pain",
        "proper",
        "part",
        "pain",
        "overall",
        "qualitative",
        "phenomenology",
        "must",
        "also",
        "representational",
        "represent",
        "pain",
        "phenomenology",
        "seems",
        "complex",
        "seems",
        "consist",
        "least",
        "two",
        "dimension",
        "affectivemotivational",
        "sensorydiscriminative",
        "representationalists",
        "along",
        "earlier",
        "perceptual",
        "theorist",
        "claim",
        "sensory",
        "aspect",
        "pain",
        "representational",
        "represents",
        "tissue",
        "damage",
        "affective",
        "aspect",
        "represent",
        "seem",
        "plausible",
        "candidate",
        "early",
        "perceptual",
        "theorist",
        "especially",
        "direct",
        "realist",
        "cognitivist",
        "pain",
        "negative",
        "affect",
        "claimed",
        "roughly",
        "consists",
        "experiencer",
        "spontaneous",
        "cognitiveconative",
        "reaction",
        "pain",
        "experience",
        "reaction",
        "conceived",
        "forming",
        "conative",
        "evaluative",
        "propositional",
        "attitude",
        "word",
        "painfulness",
        "pain",
        "constituted",
        "power",
        "immediately",
        "evoke",
        "one",
        "peremptory",
        "desire",
        "pain",
        "perception",
        "cease",
        "armstrong",
        "pp",
        "see",
        "also",
        "stephen",
        "graham",
        "nelkin",
        "hall",
        "cf",
        "parfit",
        "according",
        "chisholm",
        "presentation",
        "brentano",
        "also",
        "held",
        "pain",
        "pleasure",
        "partly",
        "conative",
        "reaction",
        "sensory",
        "element",
        "even",
        "though",
        "theoretically",
        "cognitivism",
        "option",
        "representationalism",
        "adopting",
        "would",
        "seem",
        "violate",
        "spirit",
        "strong",
        "representationalism",
        "depends",
        "one",
        "would",
        "like",
        "develop",
        "cognitivist",
        "line",
        "one",
        "option",
        "say",
        "affective",
        "aspect",
        "pain",
        "qualitative",
        "phenomenological",
        "illusion",
        "hardwired",
        "cognitively",
        "behaviorally",
        "react",
        "sensory",
        "content",
        "pain",
        "certain",
        "way",
        "option",
        "advantage",
        "preserving",
        "strong",
        "representationalism",
        "affect",
        "qualitative",
        "pressure",
        "treat",
        "representational",
        "cf",
        "tye",
        "pp",
        "p",
        "admitted",
        "affective",
        "aspect",
        "pain",
        "qualitative",
        "sensory",
        "content",
        "cognitivism",
        "come",
        "compromise",
        "strong",
        "representationalist",
        "admits",
        "phenomenal",
        "character",
        "representational",
        "latter",
        "option",
        "may",
        "lead",
        "representationalcumfunctionalist",
        "approach",
        "pain",
        "affectively",
        "nonneutral",
        "experience",
        "sensory",
        "content",
        "experience",
        "may",
        "given",
        "purely",
        "representational",
        "account",
        "affective",
        "dimension",
        "may",
        "matter",
        "functionally",
        "processing",
        "content",
        "setting",
        "motivational",
        "parameter",
        "assumption",
        "cognitive",
        "attitude",
        "captured",
        "functionally",
        "problem",
        "cognitivism",
        "general",
        "suffers",
        "intuitive",
        "implausibility",
        "certainly",
        "appear",
        "hurting",
        "aspect",
        "pain",
        "experience",
        "matter",
        "cognitive",
        "reaction",
        "ordinarily",
        "understood",
        "cognitive",
        "reaction",
        "form",
        "propositional",
        "attitude",
        "seem",
        "much",
        "qualitative",
        "phenomenology",
        "peculiar",
        "importantly",
        "move",
        "appears",
        "mislocate",
        "problem",
        "question",
        "painfulness",
        "hurting",
        "quality",
        "pain",
        "consist",
        "answer",
        "offered",
        "seems",
        "cognitiveconative",
        "reaction",
        "experience",
        "something",
        "like",
        "desire",
        "stop",
        "instance",
        "one",
        "would",
        "like",
        "think",
        "experience",
        "painful",
        "one",
        "desire",
        "stop",
        "way",
        "round",
        "straightforward",
        "way",
        "deal",
        "affective",
        "phenomenology",
        "representationalist",
        "say",
        "representational",
        "like",
        "sensory",
        "phenomenology",
        "tye",
        "seems",
        "propose",
        "view",
        "people",
        "pain",
        "try",
        "get",
        "rid",
        "diminish",
        "answer",
        "surely",
        "pain",
        "feel",
        "unpleasant",
        "bad",
        "experienced",
        "exactly",
        "experienced",
        "unpleasant",
        "one",
        "attention",
        "one",
        "feel",
        "pain",
        "go",
        "place",
        "different",
        "one",
        "experience",
        "pain",
        "located",
        "quality",
        "experienced",
        "unpleasant",
        "located",
        "bodily",
        "location",
        "one",
        "attends",
        "normal",
        "circumstance",
        "people",
        "whose",
        "pain",
        "lack",
        "affective",
        "dimension",
        "undergo",
        "purely",
        "sensory",
        "nonevaluative",
        "representation",
        "tissue",
        "damage",
        "one",
        "sort",
        "another",
        "localized",
        "bodily",
        "region",
        "whose",
        "pain",
        "normal",
        "experience",
        "quality",
        "quality",
        "experienced",
        "unpleasant",
        "precisely",
        "quality",
        "experienced",
        "unpleasant",
        "bad",
        "people",
        "cognitive",
        "reaction",
        "reaction",
        "desiring",
        "stop",
        "pain",
        "experience",
        "tissue",
        "damage",
        "bad",
        "undergo",
        "experience",
        "represents",
        "damage",
        "bad",
        "accordingly",
        "view",
        "affective",
        "dimension",
        "pain",
        "much",
        "part",
        "representational",
        "content",
        "pain",
        "sensory",
        "dimension",
        "tye",
        "a",
        "experience",
        "undergo",
        "feel",
        "sharp",
        "pain",
        "back",
        "hand",
        "feel",
        "way",
        "represents",
        "tissue",
        "damage",
        "hand",
        "represents",
        "bad",
        "word",
        "represents",
        "tissue",
        "damage",
        "quality",
        "bad",
        "see",
        "also",
        "sullivan",
        "schroer",
        "bain",
        "course",
        "normally",
        "one",
        "tissue",
        "damaged",
        "bad",
        "also",
        "normally",
        "thinkjudge",
        "bad",
        "experiencing",
        "tissue",
        "damage",
        "ie",
        "feeling",
        "pain",
        "bad",
        "thinkjudge",
        "follow",
        "truism",
        "without",
        "additional",
        "premise",
        "experience",
        "represents",
        "damage",
        "bad",
        "truism",
        "confused",
        "last",
        "claim",
        "substantive",
        "metaphysical",
        "claim",
        "mean",
        "one",
        "experience",
        "represent",
        "tissue",
        "damage",
        "bad",
        "nontrivial",
        "question",
        "strong",
        "representationalist",
        "aspires",
        "naturalist",
        "recall",
        "strong",
        "representationalism",
        "usually",
        "come",
        "naturalistic",
        "story",
        "experience",
        "acquire",
        "representational",
        "content",
        "important",
        "representing",
        "tissue",
        "damage",
        "bad",
        "cashed",
        "term",
        "whatever",
        "naturalistic",
        "story",
        "representationalist",
        "disposal",
        "many",
        "representationalists",
        "including",
        "tye",
        "defend",
        "least",
        "start",
        "informational",
        "theory",
        "natural",
        "property",
        "tissue",
        "damage",
        "detected",
        "tracked",
        "experience",
        "say",
        "experience",
        "carry",
        "information",
        "property",
        "bad",
        "seem",
        "kind",
        "property",
        "informationally",
        "detected",
        "transduced",
        "arguably",
        "informationtheoretic",
        "version",
        "representationalism",
        "seems",
        "quite",
        "appropriate",
        "affective",
        "phenomenology",
        "see",
        "tye",
        "b",
        "response",
        "different",
        "option",
        "critical",
        "discussion",
        "see",
        "bain",
        "cutter",
        "tye",
        "corn",
        "perhaps",
        "functional",
        "role",
        "semantics",
        "might",
        "work",
        "better",
        "cashing",
        "mean",
        "pain",
        "experience",
        "represent",
        "tissue",
        "damage",
        "bad",
        "idea",
        "pain",
        "experience",
        "play",
        "certain",
        "functionalcausal",
        "role",
        "behavioral",
        "mental",
        "economy",
        "owner",
        "particular",
        "given",
        "normally",
        "signal",
        "injury",
        "experience",
        "typically",
        "causally",
        "associated",
        "certain",
        "battery",
        "cognitive",
        "behavioral",
        "effect",
        "might",
        "claimed",
        "causal",
        "functional",
        "profile",
        "whole",
        "rather",
        "mere",
        "informational",
        "link",
        "make",
        "pain",
        "experience",
        "represent",
        "tissue",
        "damage",
        "bad",
        "clear",
        "however",
        "whether",
        "representationalism",
        "work",
        "proposal",
        "appeal",
        "functionalism",
        "made",
        "one",
        "thing",
        "transforms",
        "strong",
        "representationalism",
        "partly",
        "internalist",
        "theory",
        "another",
        "simply",
        "say",
        "functional",
        "role",
        "constitutes",
        "pain",
        "affective",
        "phenomenology",
        "indeed",
        "functionalism",
        "better",
        "psychofunctionalism",
        "philosophy",
        "mind",
        "always",
        "treated",
        "pain",
        "paradigmatic",
        "example",
        "qualitative",
        "mental",
        "state",
        "whose",
        "phenomenology",
        "plausibly",
        "captured",
        "functionalist",
        "proposal",
        "made",
        "prima",
        "facie",
        "plausible",
        "pain",
        "affective",
        "phenomenology",
        "opposed",
        "sensory",
        "phenomenology",
        "essentially",
        "connected",
        "pain",
        "inherent",
        "motivator",
        "functionalism",
        "allowed",
        "need",
        "make",
        "detour",
        "via",
        "representationalism",
        "fact",
        "hard",
        "see",
        "experience",
        "representing",
        "something",
        "bad",
        "inherent",
        "motivator",
        "explain",
        "representationalist",
        "advert",
        "additional",
        "learning",
        "mechanism",
        "connect",
        "representational",
        "content",
        "drive",
        "motivation",
        "see",
        "aydede",
        "fulkerson",
        "elaboration",
        "psychofunctionalist",
        "account",
        "pain",
        "affect",
        "well",
        "criticism",
        "representationalism",
        "functionalist",
        "perspective",
        "see",
        "corn",
        "criticism"
    ]
}