{
    "main_text": "Objections to Panpsychism || The Subject-Summing Problem\n4.4 Other Forms of the Combination Problem\nIn David Chalmers’ (2016) taxonomy of the combination problem, there are three dimensions of difficulty:\n\nDifficulties relating to subject combination: the core difficulty being the subject-summing problem\nDifficulties relating to quality combination: the core difficulty being the palette problem\nDifficulties relating to combination of structure: the core difficulties being the structural mismatch problem and the grain problem.\n\nWe have already covered the subject-summing problem in some detail. I turn now to a briefer treatment of problems pertaining to quality and structure.\n4.4.1 The Palette Problem\nHuman consciousness is a rich and wonderful thing. In any given sense modality, we enjoy an incredible variety of qualities. Moreover, prima facie the delightful qualities we enjoy in one sense modality seem to be wildly different from the sensory qualities we enjoy in any other sensory modality; what it’s like to smell, for example, seems to have nothing in common with what it’s like to see a colour. For the panpsychist all this richness and variety results from fundamental kinds of mental qualities, which panpsychists tend to suppose are quite small in number (e.g., for Russellian monists basic conscious properties are the intrinsic nature of the basic properties picked out by physics, which are relatively few in number). The palette problem (Chalmers 2016), expressed as metaphor, goes as follows: How is it that the richly painted canvas of human experiences is produced from such a small palette of paints?\nNumerous speculative solutions have been offered to the palette problem. Patrick Lewtas (2017) avoids the palette problem altogether by postulating an enormous number of fundamental micro-experiential properties, one corresponding to every basic quality we find in human experience. Luke Roelofs (2014, 2015, 2019) develops a form of constitutive micropsychism according to which we cannot recognise or imagine the basic micro-conscious ingredients which make up human consciousness, because we never experience them in isolation from the extremely complex combinations we find in our experience; given that we are unable even to imagine the micro-conscious ingredients, we have no good reason to deny that those ingredients are extremely small in number. Keith Turausky (2012, Other Internet Resources) considers the view that perhaps there is just one fundamental mental quality that somehow contains all others, in something like the way white light contains all colours.\n4.4.2 The Structural Mismatch Problem\nHuman conscious experience is not only rich in qualities, but also rich in structure. For example visual experience appears to have a structure that corresponds to the spatial environment being experienced, and experience as a whole comes carved up into distinct sensory modalities. The structure of our experience seems very different from the structure of the brain, at either the micro or the macro level. For the dualist this is of course not a worry, as the conscious mind is a completely distinct entity from the brain. However, many panpsychists believe that the conscious mind is identical with, or bears a very intimate relationship with, the brain. Most Russellian monists, for example, believe that the conscious mind is the intrinsic nature of the brain. And all constitutive micropsychists think that human experience is grounded in the properties of micro-level entities. Thus, these forms of panpsychism face the challenge of explaining how the rich structure of consciousness results from, or at least co-exists with, the seemingly very different structure of the brain. Perhaps the most discussed form of the structural mismatch problem is the grain problem (Maxwell 1979; Lockwood 1993): the worry that experiences seem to be smooth and continuous in a way that is at odds with the discrete, particularized structure of brain properties.\nAgain there are numerous proposals for addressing the worry. Michael Lockwood (1993) suggests that the worry only arises when we are implicitly thinking of the brain in terms of classical physics, and that it evaporates when we explicitly adopt more recent scientific paradigms. Stoljar (2001) argues that the alleged problem arises from philosophers confusing the structure of consciousness itself with the structure of what is represented by consciousness. Nagasawa & Wager (2016) suggest that the problem goes away when we adopt cosmopsychism rather than micropsychism, because we no longer suppose that the structure of the macro-level brain is derived from its structure at the micro-level. Roelofs (2019) has argued, echoing certain views of Leibniz and Spinoza, that the structure of our conscious experience might outstrip our awareness of it. Goff (2017: ch. 8) argues that we do find structure in the brain isomorphic with the structure of consciousness, so long as we consider less basic kinds of brain structure; and hence the moral of the story is that there is much more consciousness present in the brain than we ordinarily suppose, corresponding both to more basic and to less basic brain structures (cf. Roelofs 2019; Chalmers 2016: 7.8).\n4.5 Other Objections to Panpsychism\nWhilst the combination problem focuses on the challenge of getting our consciousness (and the consciousness of non-human animals) out of consciousness at the level of fundamental physics, Damian Aleksiev and Miri Albahari (independently) have focused on the challenge of getting the physical world, or certain aspects of it, out of the facts about fundamental consciousness.[25] In what she calls the ‘Inner-Outer Gap Problem’ Albahari (2022) worries that in standard versions of panpsychism, experiential properties ‘face the wrong way’ for this purpose. The experiential properties that are supposed to realise observer-independent properties, such as mass or charge, are accessible only to the subject undergoing them rather than to external observers. On this basis, Albahari argues that it is incoherent to suppose that facts about the ‘inner-facing’ experiential properties of micro-level subjects could somehow constitute the ‘outer-facing’ observer-independent objects. Aleksiev’s (2021) ‘Missing Entities Problem’ focuses on specific features of fundamental physical reality, according to popular views in theoretical physics. More specifically, Aleksiev doubts whether the following phenomena could be intelligibly grounded in facts about consciousness: spacetime, a high-dimensional quantum state, and timeless entities referred to in certain quantum gravity theories.\nA focus on the fact that neither space nor time are fundamental entities in many popular approaches to quantum gravity is also taken up by Susan Schneider (2018). There is a certain plausibility to the thesis that conscious experience is essentially temporal, which would seem to imply that consciousness cannot exist at the fundamental level of reality if time does not exist at the fundamental reality. Barry Dainton (forthcoming) also critiques panpsychism starting from the assumption that consciousness is essentially temporal, but this time focusing on the fact that for photons, as entities that travel at the speed of light, time does not pass. Einstein famously asked what it’d be like to ride on a beam of light; Dainton wonders what the panpsychist should think about what it’s like to be an electron.\nZach Blaesi (2021) has constructed a moral parody argument against panpsychism. Some panpsychists argue that the kind of experience we pre-theoretically believe in must be grounded in experience at the fundamental level, on the basis that the traditional options of physicalism and dualism are inadequate. If we carry over this line of reasoning to meta-ethics, Blaesi thinks, we would argue that the kind of moral facts we pre-theoretically believe in, e.g. torturing children for fun is wrong, are grounded in facts about fundamental normative properties instantiated by micro-level entities, a kind of ‘panmoralism.’ Blaesi hopes his reader will reject this line of reasoning to the absurd position of panmoralist; by analogy, they ought to reject the analogous line of reasoning to panpsychism. However, Einar Duenger Bohn (2018) defends a form of ‘pannormism’ (there is normativity all the way down to the fundamental level of reality), which resembles the rather unusual form of panpsychism (2019) Bohn has also explored.\n",
    "section_title": "4.4 Other Forms of the Combination Problem",
    "entry_title": "Panpsychism",
    "hierarchy_title": "Panpsychism || Objections to Panpsychism || The Subject-Summing Problem",
    "tokenized_text": [
        "objection",
        "panpsychism",
        "subjectsumming",
        "problem",
        "form",
        "combination",
        "problem",
        "david",
        "chalmers",
        "taxonomy",
        "combination",
        "problem",
        "three",
        "dimension",
        "difficulty",
        "difficulty",
        "relating",
        "subject",
        "combination",
        "core",
        "difficulty",
        "subjectsumming",
        "problem",
        "difficulty",
        "relating",
        "quality",
        "combination",
        "core",
        "difficulty",
        "palette",
        "problem",
        "difficulty",
        "relating",
        "combination",
        "structure",
        "core",
        "difficulty",
        "structural",
        "mismatch",
        "problem",
        "grain",
        "problem",
        "already",
        "covered",
        "subjectsumming",
        "problem",
        "detail",
        "turn",
        "briefer",
        "treatment",
        "problem",
        "pertaining",
        "quality",
        "structure",
        "palette",
        "problem",
        "human",
        "consciousness",
        "rich",
        "wonderful",
        "thing",
        "given",
        "sense",
        "modality",
        "enjoy",
        "incredible",
        "variety",
        "quality",
        "moreover",
        "prima",
        "facie",
        "delightful",
        "quality",
        "enjoy",
        "one",
        "sense",
        "modality",
        "seem",
        "wildly",
        "different",
        "sensory",
        "quality",
        "enjoy",
        "sensory",
        "modality",
        "like",
        "smell",
        "example",
        "seems",
        "nothing",
        "common",
        "like",
        "see",
        "colour",
        "panpsychist",
        "richness",
        "variety",
        "result",
        "fundamental",
        "kind",
        "mental",
        "quality",
        "panpsychists",
        "tend",
        "suppose",
        "quite",
        "small",
        "number",
        "eg",
        "russellian",
        "monists",
        "basic",
        "conscious",
        "property",
        "intrinsic",
        "nature",
        "basic",
        "property",
        "picked",
        "physic",
        "relatively",
        "number",
        "palette",
        "problem",
        "chalmers",
        "expressed",
        "metaphor",
        "go",
        "follows",
        "richly",
        "painted",
        "canvas",
        "human",
        "experience",
        "produced",
        "small",
        "palette",
        "paint",
        "numerous",
        "speculative",
        "solution",
        "offered",
        "palette",
        "problem",
        "patrick",
        "lewtas",
        "avoids",
        "palette",
        "problem",
        "altogether",
        "postulating",
        "enormous",
        "number",
        "fundamental",
        "microexperiential",
        "property",
        "one",
        "corresponding",
        "every",
        "basic",
        "quality",
        "find",
        "human",
        "experience",
        "luke",
        "roelofs",
        "develops",
        "form",
        "constitutive",
        "micropsychism",
        "according",
        "recognise",
        "imagine",
        "basic",
        "microconscious",
        "ingredient",
        "make",
        "human",
        "consciousness",
        "never",
        "experience",
        "isolation",
        "extremely",
        "complex",
        "combination",
        "find",
        "experience",
        "given",
        "unable",
        "even",
        "imagine",
        "microconscious",
        "ingredient",
        "good",
        "reason",
        "deny",
        "ingredient",
        "extremely",
        "small",
        "number",
        "keith",
        "turausky",
        "internet",
        "resource",
        "considers",
        "view",
        "perhaps",
        "one",
        "fundamental",
        "mental",
        "quality",
        "somehow",
        "contains",
        "others",
        "something",
        "like",
        "way",
        "white",
        "light",
        "contains",
        "colour",
        "structural",
        "mismatch",
        "problem",
        "human",
        "conscious",
        "experience",
        "rich",
        "quality",
        "also",
        "rich",
        "structure",
        "example",
        "visual",
        "experience",
        "appears",
        "structure",
        "corresponds",
        "spatial",
        "environment",
        "experienced",
        "experience",
        "whole",
        "come",
        "carved",
        "distinct",
        "sensory",
        "modality",
        "structure",
        "experience",
        "seems",
        "different",
        "structure",
        "brain",
        "either",
        "micro",
        "macro",
        "level",
        "dualist",
        "course",
        "worry",
        "conscious",
        "mind",
        "completely",
        "distinct",
        "entity",
        "brain",
        "however",
        "many",
        "panpsychists",
        "believe",
        "conscious",
        "mind",
        "identical",
        "bear",
        "intimate",
        "relationship",
        "brain",
        "russellian",
        "monists",
        "example",
        "believe",
        "conscious",
        "mind",
        "intrinsic",
        "nature",
        "brain",
        "constitutive",
        "micropsychists",
        "think",
        "human",
        "experience",
        "grounded",
        "property",
        "microlevel",
        "entity",
        "thus",
        "form",
        "panpsychism",
        "face",
        "challenge",
        "explaining",
        "rich",
        "structure",
        "consciousness",
        "result",
        "least",
        "coexists",
        "seemingly",
        "different",
        "structure",
        "brain",
        "perhaps",
        "discussed",
        "form",
        "structural",
        "mismatch",
        "problem",
        "grain",
        "problem",
        "maxwell",
        "lockwood",
        "worry",
        "experience",
        "seem",
        "smooth",
        "continuous",
        "way",
        "odds",
        "discrete",
        "particularized",
        "structure",
        "brain",
        "property",
        "numerous",
        "proposal",
        "addressing",
        "worry",
        "michael",
        "lockwood",
        "suggests",
        "worry",
        "arises",
        "implicitly",
        "thinking",
        "brain",
        "term",
        "classical",
        "physic",
        "evaporates",
        "explicitly",
        "adopt",
        "recent",
        "scientific",
        "paradigm",
        "stoljar",
        "argues",
        "alleged",
        "problem",
        "arises",
        "philosopher",
        "confusing",
        "structure",
        "consciousness",
        "structure",
        "represented",
        "consciousness",
        "nagasawa",
        "wager",
        "suggest",
        "problem",
        "go",
        "away",
        "adopt",
        "cosmopsychism",
        "rather",
        "micropsychism",
        "longer",
        "suppose",
        "structure",
        "macrolevel",
        "brain",
        "derived",
        "structure",
        "microlevel",
        "roelofs",
        "argued",
        "echoing",
        "certain",
        "view",
        "leibniz",
        "spinoza",
        "structure",
        "conscious",
        "experience",
        "might",
        "outstrip",
        "awareness",
        "goff",
        "ch",
        "argues",
        "find",
        "structure",
        "brain",
        "isomorphic",
        "structure",
        "consciousness",
        "long",
        "consider",
        "le",
        "basic",
        "kind",
        "brain",
        "structure",
        "hence",
        "moral",
        "story",
        "much",
        "consciousness",
        "present",
        "brain",
        "ordinarily",
        "suppose",
        "corresponding",
        "basic",
        "le",
        "basic",
        "brain",
        "structure",
        "cf",
        "roelofs",
        "chalmers",
        "objection",
        "panpsychism",
        "whilst",
        "combination",
        "problem",
        "focus",
        "challenge",
        "getting",
        "consciousness",
        "consciousness",
        "nonhuman",
        "animal",
        "consciousness",
        "level",
        "fundamental",
        "physic",
        "damian",
        "aleksiev",
        "miri",
        "albahari",
        "independently",
        "focused",
        "challenge",
        "getting",
        "physical",
        "world",
        "certain",
        "aspect",
        "fact",
        "fundamental",
        "consciousness",
        "call",
        "innerouter",
        "gap",
        "problem",
        "albahari",
        "worry",
        "standard",
        "version",
        "panpsychism",
        "experiential",
        "property",
        "face",
        "wrong",
        "way",
        "purpose",
        "experiential",
        "property",
        "supposed",
        "realise",
        "observerindependent",
        "property",
        "mass",
        "charge",
        "accessible",
        "subject",
        "undergoing",
        "rather",
        "external",
        "observer",
        "basis",
        "albahari",
        "argues",
        "incoherent",
        "suppose",
        "fact",
        "innerfacing",
        "experiential",
        "property",
        "microlevel",
        "subject",
        "could",
        "somehow",
        "constitute",
        "outerfacing",
        "observerindependent",
        "object",
        "aleksiev",
        "missing",
        "entity",
        "problem",
        "focus",
        "specific",
        "feature",
        "fundamental",
        "physical",
        "reality",
        "according",
        "popular",
        "view",
        "theoretical",
        "physic",
        "specifically",
        "aleksiev",
        "doubt",
        "whether",
        "following",
        "phenomenon",
        "could",
        "intelligibly",
        "grounded",
        "fact",
        "consciousness",
        "spacetime",
        "highdimensional",
        "quantum",
        "state",
        "timeless",
        "entity",
        "referred",
        "certain",
        "quantum",
        "gravity",
        "theory",
        "focus",
        "fact",
        "neither",
        "space",
        "time",
        "fundamental",
        "entity",
        "many",
        "popular",
        "approach",
        "quantum",
        "gravity",
        "also",
        "taken",
        "susan",
        "schneider",
        "certain",
        "plausibility",
        "thesis",
        "conscious",
        "experience",
        "essentially",
        "temporal",
        "would",
        "seem",
        "imply",
        "consciousness",
        "exist",
        "fundamental",
        "level",
        "reality",
        "time",
        "exist",
        "fundamental",
        "reality",
        "barry",
        "dainton",
        "forthcoming",
        "also",
        "critique",
        "panpsychism",
        "starting",
        "assumption",
        "consciousness",
        "essentially",
        "temporal",
        "time",
        "focusing",
        "fact",
        "photon",
        "entity",
        "travel",
        "speed",
        "light",
        "time",
        "pas",
        "einstein",
        "famously",
        "asked",
        "like",
        "ride",
        "beam",
        "light",
        "dainton",
        "wonder",
        "panpsychist",
        "think",
        "like",
        "electron",
        "zach",
        "blaesi",
        "constructed",
        "moral",
        "parody",
        "argument",
        "panpsychism",
        "panpsychists",
        "argue",
        "kind",
        "experience",
        "pretheoretically",
        "believe",
        "must",
        "grounded",
        "experience",
        "fundamental",
        "level",
        "basis",
        "traditional",
        "option",
        "physicalism",
        "dualism",
        "inadequate",
        "carry",
        "line",
        "reasoning",
        "metaethics",
        "blaesi",
        "think",
        "would",
        "argue",
        "kind",
        "moral",
        "fact",
        "pretheoretically",
        "believe",
        "eg",
        "torturing",
        "child",
        "fun",
        "wrong",
        "grounded",
        "fact",
        "fundamental",
        "normative",
        "property",
        "instantiated",
        "microlevel",
        "entity",
        "kind",
        "panmoralism",
        "blaesi",
        "hope",
        "reader",
        "reject",
        "line",
        "reasoning",
        "absurd",
        "position",
        "panmoralist",
        "analogy",
        "ought",
        "reject",
        "analogous",
        "line",
        "reasoning",
        "panpsychism",
        "however",
        "einar",
        "duenger",
        "bohn",
        "defends",
        "form",
        "pannormism",
        "normativity",
        "way",
        "fundamental",
        "level",
        "reality",
        "resembles",
        "rather",
        "unusual",
        "form",
        "panpsychism",
        "bohn",
        "also",
        "explored"
    ]
}