{
    "main_text": "Arguments for Panpsychism || The Anti-Emergence Argument\n3.1 The Anti-Emergence Argument\nNeuroscience has made great progress in uncovering the mechanisms in the brain that underlie our cognitive and behavioural functioning. But this form of scientific investigation has not produced anything approaching a satisfying explanation of why it is that a person has subjective experience, i.e., of why there is something that it’s like to be a human being. It seems that we can imagine a creature that was empirically indiscernible from a human being in terms of its physical brain processes and the behaviour they give rise to, but which had no experience whatsoever (it screams and runs away when you stick a knife in it, but it doesn’t actually feel pain). And it arguably follows that facts about physical brain processes and behaviour cannot explain, at least not in a transparent and satisfying manner, the reality of conscious experience.\nThis is the problem David Chalmers (1995, 1996) famously named “the hard problem of consciousness”.[18] Some think the alleged problem involves a confusion, although anyone who thinks this is obliged to diagnose the exact root of the confusion. Others think that there is a problem, but one that further scientific investigation will solve. Perhaps we just need to wait for the arrival of the “Darwin of consciousness” to make progress. However, there is no reason to suppose that “further scientific investigation” has to be pursued under the methodological assumption that consciousness is to be accounted for in terms of processes which don’t involve consciousness, e.g., in terms of facts about non-conscious neurons. The panpsychist proposes an alternative approach: explain human and animal consciousness in terms of more basic forms of consciousness. These more basic forms of consciousness are then postulated as properties of the fundamental constituents of the material world, perhaps of quarks and electrons. Thus, we try to explain the consciousness of the human brain in terms of the consciousness of its most fundamental parts.\nThomas Nagel (1979) influentially argued that adopting a view like panpsychism is the only way to avoid what he called “emergence”. Crucially, close examination of the text reveals that Nagel is using the word “emergence” slightly differently to how it has come to be used in contemporary discussions of panpsychism (discussed above). For Nagel, “emergent” properties of a complex system are ones that cannot be intelligibly derived from the properties of its parts. In contrast, for the “emergentist panpsychists” discussed above, “emergent” properties of a complex system are simply fundamental macro-level properties, which may or may not be intelligibly derived from the properties of its parts.[19] Following Galen Strawson (2006a) we can use the word “radical emergence” to express Nagel’s notion of emergence.[20]\nNagel’s argument involves four premises:\n\nMaterial Composition—Living organisms are complex material systems with no immaterial parts. The matter composing us is not special; the matter composing any material entity, if broken down far enough and rearranged, could in principle be incorporated into a living organism.\nRealism—Mental states are genuine properties of living organisms.\nNo Radical Emergence—All the properties of a complex organism are intelligibly derived from the properties of its parts.\nNon-Reductionism—The mental states of an organism are not intelligibly derived from its physical properties alone (including the physical properties of its parts).\n\nNagel concludes from these premises that there must be non-physical properties of basic matter that, when combined in the right way, intelligibly imply the existence of mental states. It is worth noting that, although Nagel calls the resulting view “panpsychism”, it seems compatible with panprotopsychism (discussed above).\nMore recently, Galen Strawson (2006a) has defended a similar argument from the untenability of radical emergence. Whereas Nagel’s aim is merely to establish the disjunction of panpsychism and panprotopsychism, the conclusion of Strawson’s argument is very definitely the truth of panpsychism. Strawson begins by arguing that radical emergence is upon reflection unintelligible:\n\nEmergence can’t be brute. It is built into the heart of the notion of emergence that emergence cannot be brute in the sense of there being absolutely no reason in the nature of things why the emerging thing is as it is (so that it is unintelligible even to God). For any feature Y of anything that is correctly considered to be emergent from X, there must be something about X and X alone in virtue of which Y emerges, and which is sufficient for Y (Strawson 2006a: 18)\n\nThere are of course cases in which one property arises from another, e.g., liquid arises from individual molecules each of which is not itself liquid. However, in all such cases, Strawson argues, the emergence is perfectly intelligible:\n\nWe can easily make intuitive sense of the idea that certain sorts of molecules are so constituted that they don’t bind together in a tight lattice but slide past or off each other (in accordance with van de Waals molecular interaction laws) in a way that gives rise to—is—the phenomenon of liquidity....we move in a small set of conceptually homogeneous shape-size-mass-charge-number-position-motion-involving physics notions with no sense of puzzlement…. Using the notion of reduction in a familiar loose way, we can say that the phenomena of liquidity reduce without remainder to shape-size-mass-charge-etc. (Strawson 2006a: 18)\n\nThus, the crucial feature of intelligible emergence, according to Strawson, is that the relationship between the product of emergence and its producer can be adequately characterized using a single set of conceptually homogeneous concepts. But it’s very hard to see how any set of conceptually homogeneous concepts could capture both the experiential (i.e., consciousness-involving) and the non-experiential (non-conscious-involving), and hence hard to see how the thesis that consciousness emerges from non-consciousness could be rendered intelligible. Strawson argues that it is only by supposing that human and animal consciousness emerges from more basic forms of consciousness, that we have hope of avoiding the emergence of animal consciousness being a brute and inexplicable miracle.\nIt is not clear that Strawson is able to conclusively rule out the panprotopsychist option discussed above. It is plausible that we currently have no positive conception of wholly non-experiential states that would intelligibly give rise to consciousness. But maybe that’s because the Darwin of consciousness hasn’t come along yet to theorise her way to their nature. Or maybe, as Colin McGinn (1989) famously argued, human beings are constitutively incapable of grasping the nature of the properties underlying consciousness; it could nonetheless be that the emergence of consciousness from non-consciousness is intelligible to God if not to us. We have seen that Strawson insists that an emergent feature and that from which it emerges must be capable of being captured under a set of conceptually homogeneous notions; but perhaps there is an unknown (at least thus far) neutral vocabulary in terms of which both experiential and non-experiential features of reality can be adequately described (Nagel is open to this possibility, which is another way of seeing how the conclusion of Strawson’s argument is stronger than that of Nagel’s). Furthermore, as Philip Goff (2006, 2017: ch. 7) has argued in response to Strawson, there is reason to doubt that the panpsychist herself is able to give a wholly intelligible story as to how macro-level consciousness emerges from the micro-level consciousness, which threatens to undermine Strawson’s claim that panpsychism avoids radical emergence. (This issue is discussed in detail below in the section on The Subject-Summing Problem).\nStrawson’s argument is intended to show that a non-panpsychist reduction of consciousness is impossible. However, it is not obvious that this is essential for the anti-emergence argument for panpsychism to have force. Philosophers and scientists have spent a great deal of time trying to explain consciousness in terms of non-consciousness, and these efforts have not produced even the beginnings of an intelligible explanation. Given this failure it seems reasonable to explore other paradigms of scientific explanation.\nIt might seem obvious that emergentist panpsychists (discussed above) are unable to make use of the anti-emergence argument for panpsychism. However, many panpsychists argue that panpsychist forms of emergentism are less radical than non-panpsychism forms of emergentism. Hedda Hassel Mørch (2014), for example, defends a form of panpsychism involving partially intelligible emergence, which she argues is to be preferred over fully brute emergence.\nBrian McLaughlin (2016) responds to Nagel’s argument by deploying a currently popular strategy for defending physicalism: the phenomenal concept strategy. See also Freeman 2006 for a volume of responses to Strawson’s anti-emergence argument, followed by Strawson’s counter-responses.\n",
    "section_title": "3.1 The Anti-Emergence Argument",
    "entry_title": "Panpsychism",
    "hierarchy_title": "Panpsychism || Arguments for Panpsychism || The Anti-Emergence Argument",
    "tokenized_text": [
        "argument",
        "panpsychism",
        "antiemergence",
        "argument",
        "antiemergence",
        "argument",
        "neuroscience",
        "made",
        "great",
        "progress",
        "uncovering",
        "mechanism",
        "brain",
        "underlie",
        "cognitive",
        "behavioural",
        "functioning",
        "form",
        "scientific",
        "investigation",
        "produced",
        "anything",
        "approaching",
        "satisfying",
        "explanation",
        "person",
        "subjective",
        "experience",
        "ie",
        "something",
        "like",
        "human",
        "seems",
        "imagine",
        "creature",
        "empirically",
        "indiscernible",
        "human",
        "term",
        "physical",
        "brain",
        "process",
        "behaviour",
        "give",
        "rise",
        "experience",
        "whatsoever",
        "scream",
        "run",
        "away",
        "stick",
        "knife",
        "actually",
        "feel",
        "pain",
        "arguably",
        "follows",
        "fact",
        "physical",
        "brain",
        "process",
        "behaviour",
        "explain",
        "least",
        "transparent",
        "satisfying",
        "manner",
        "reality",
        "conscious",
        "experience",
        "problem",
        "david",
        "chalmers",
        "famously",
        "named",
        "hard",
        "problem",
        "consciousness",
        "think",
        "alleged",
        "problem",
        "involves",
        "confusion",
        "although",
        "anyone",
        "think",
        "obliged",
        "diagnose",
        "exact",
        "root",
        "confusion",
        "others",
        "think",
        "problem",
        "one",
        "scientific",
        "investigation",
        "solve",
        "perhaps",
        "need",
        "wait",
        "arrival",
        "darwin",
        "consciousness",
        "make",
        "progress",
        "however",
        "reason",
        "suppose",
        "scientific",
        "investigation",
        "pursued",
        "methodological",
        "assumption",
        "consciousness",
        "accounted",
        "term",
        "process",
        "involve",
        "consciousness",
        "eg",
        "term",
        "fact",
        "nonconscious",
        "neuron",
        "panpsychist",
        "proposes",
        "alternative",
        "approach",
        "explain",
        "human",
        "animal",
        "consciousness",
        "term",
        "basic",
        "form",
        "consciousness",
        "basic",
        "form",
        "consciousness",
        "postulated",
        "property",
        "fundamental",
        "constituent",
        "material",
        "world",
        "perhaps",
        "quark",
        "electron",
        "thus",
        "try",
        "explain",
        "consciousness",
        "human",
        "brain",
        "term",
        "consciousness",
        "fundamental",
        "part",
        "thomas",
        "nagel",
        "influentially",
        "argued",
        "adopting",
        "view",
        "like",
        "panpsychism",
        "way",
        "avoid",
        "called",
        "emergence",
        "crucially",
        "close",
        "examination",
        "text",
        "reveals",
        "nagel",
        "using",
        "word",
        "emergence",
        "slightly",
        "differently",
        "come",
        "used",
        "contemporary",
        "discussion",
        "panpsychism",
        "discussed",
        "nagel",
        "emergent",
        "property",
        "complex",
        "system",
        "one",
        "intelligibly",
        "derived",
        "property",
        "part",
        "contrast",
        "emergentist",
        "panpsychists",
        "discussed",
        "emergent",
        "property",
        "complex",
        "system",
        "simply",
        "fundamental",
        "macrolevel",
        "property",
        "may",
        "may",
        "intelligibly",
        "derived",
        "property",
        "part",
        "following",
        "galen",
        "strawson",
        "a",
        "use",
        "word",
        "radical",
        "emergence",
        "express",
        "nagel",
        "notion",
        "emergence",
        "nagel",
        "argument",
        "involves",
        "four",
        "premise",
        "material",
        "compositionliving",
        "organism",
        "complex",
        "material",
        "system",
        "immaterial",
        "part",
        "matter",
        "composing",
        "u",
        "special",
        "matter",
        "composing",
        "material",
        "entity",
        "broken",
        "far",
        "enough",
        "rearranged",
        "could",
        "principle",
        "incorporated",
        "living",
        "organism",
        "realismmental",
        "state",
        "genuine",
        "property",
        "living",
        "organism",
        "radical",
        "emergenceall",
        "property",
        "complex",
        "organism",
        "intelligibly",
        "derived",
        "property",
        "part",
        "nonreductionismthe",
        "mental",
        "state",
        "organism",
        "intelligibly",
        "derived",
        "physical",
        "property",
        "alone",
        "including",
        "physical",
        "property",
        "part",
        "nagel",
        "concludes",
        "premise",
        "must",
        "nonphysical",
        "property",
        "basic",
        "matter",
        "combined",
        "right",
        "way",
        "intelligibly",
        "imply",
        "existence",
        "mental",
        "state",
        "worth",
        "noting",
        "although",
        "nagel",
        "call",
        "resulting",
        "view",
        "panpsychism",
        "seems",
        "compatible",
        "panprotopsychism",
        "discussed",
        "recently",
        "galen",
        "strawson",
        "a",
        "defended",
        "similar",
        "argument",
        "untenability",
        "radical",
        "emergence",
        "whereas",
        "nagel",
        "aim",
        "merely",
        "establish",
        "disjunction",
        "panpsychism",
        "panprotopsychism",
        "conclusion",
        "strawson",
        "argument",
        "definitely",
        "truth",
        "panpsychism",
        "strawson",
        "begin",
        "arguing",
        "radical",
        "emergence",
        "upon",
        "reflection",
        "unintelligible",
        "emergence",
        "brute",
        "built",
        "heart",
        "notion",
        "emergence",
        "emergence",
        "brute",
        "sense",
        "absolutely",
        "reason",
        "nature",
        "thing",
        "emerging",
        "thing",
        "unintelligible",
        "even",
        "god",
        "feature",
        "anything",
        "correctly",
        "considered",
        "emergent",
        "x",
        "must",
        "something",
        "x",
        "x",
        "alone",
        "virtue",
        "emerges",
        "sufficient",
        "strawson",
        "a",
        "course",
        "case",
        "one",
        "property",
        "arises",
        "another",
        "eg",
        "liquid",
        "arises",
        "individual",
        "molecule",
        "liquid",
        "however",
        "case",
        "strawson",
        "argues",
        "emergence",
        "perfectly",
        "intelligible",
        "easily",
        "make",
        "intuitive",
        "sense",
        "idea",
        "certain",
        "sort",
        "molecule",
        "constituted",
        "bind",
        "together",
        "tight",
        "lattice",
        "slide",
        "past",
        "accordance",
        "van",
        "de",
        "waals",
        "molecular",
        "interaction",
        "law",
        "way",
        "give",
        "rise",
        "toisthe",
        "phenomenon",
        "liquidity",
        "move",
        "small",
        "set",
        "conceptually",
        "homogeneous",
        "shapesizemasschargenumberpositionmotioninvolving",
        "physic",
        "notion",
        "sense",
        "puzzlement",
        "using",
        "notion",
        "reduction",
        "familiar",
        "loose",
        "way",
        "say",
        "phenomenon",
        "liquidity",
        "reduce",
        "without",
        "remainder",
        "shapesizemasschargeetc",
        "strawson",
        "a",
        "thus",
        "crucial",
        "feature",
        "intelligible",
        "emergence",
        "according",
        "strawson",
        "relationship",
        "product",
        "emergence",
        "producer",
        "adequately",
        "characterized",
        "using",
        "single",
        "set",
        "conceptually",
        "homogeneous",
        "concept",
        "hard",
        "see",
        "set",
        "conceptually",
        "homogeneous",
        "concept",
        "could",
        "capture",
        "experiential",
        "ie",
        "consciousnessinvolving",
        "nonexperiential",
        "nonconsciousinvolving",
        "hence",
        "hard",
        "see",
        "thesis",
        "consciousness",
        "emerges",
        "nonconsciousness",
        "could",
        "rendered",
        "intelligible",
        "strawson",
        "argues",
        "supposing",
        "human",
        "animal",
        "consciousness",
        "emerges",
        "basic",
        "form",
        "consciousness",
        "hope",
        "avoiding",
        "emergence",
        "animal",
        "consciousness",
        "brute",
        "inexplicable",
        "miracle",
        "clear",
        "strawson",
        "able",
        "conclusively",
        "rule",
        "panprotopsychist",
        "option",
        "discussed",
        "plausible",
        "currently",
        "positive",
        "conception",
        "wholly",
        "nonexperiential",
        "state",
        "would",
        "intelligibly",
        "give",
        "rise",
        "consciousness",
        "maybe",
        "darwin",
        "consciousness",
        "come",
        "along",
        "yet",
        "theorise",
        "way",
        "nature",
        "maybe",
        "colin",
        "mcginn",
        "famously",
        "argued",
        "human",
        "being",
        "constitutively",
        "incapable",
        "grasping",
        "nature",
        "property",
        "underlying",
        "consciousness",
        "could",
        "nonetheless",
        "emergence",
        "consciousness",
        "nonconsciousness",
        "intelligible",
        "god",
        "u",
        "seen",
        "strawson",
        "insists",
        "emergent",
        "feature",
        "emerges",
        "must",
        "capable",
        "captured",
        "set",
        "conceptually",
        "homogeneous",
        "notion",
        "perhaps",
        "unknown",
        "least",
        "thus",
        "far",
        "neutral",
        "vocabulary",
        "term",
        "experiential",
        "nonexperiential",
        "feature",
        "reality",
        "adequately",
        "described",
        "nagel",
        "open",
        "possibility",
        "another",
        "way",
        "seeing",
        "conclusion",
        "strawson",
        "argument",
        "stronger",
        "nagel",
        "furthermore",
        "philip",
        "goff",
        "ch",
        "argued",
        "response",
        "strawson",
        "reason",
        "doubt",
        "panpsychist",
        "able",
        "give",
        "wholly",
        "intelligible",
        "story",
        "macrolevel",
        "consciousness",
        "emerges",
        "microlevel",
        "consciousness",
        "threatens",
        "undermine",
        "strawson",
        "claim",
        "panpsychism",
        "avoids",
        "radical",
        "emergence",
        "issue",
        "discussed",
        "detail",
        "section",
        "subjectsumming",
        "problem",
        "strawson",
        "argument",
        "intended",
        "show",
        "nonpanpsychist",
        "reduction",
        "consciousness",
        "impossible",
        "however",
        "obvious",
        "essential",
        "antiemergence",
        "argument",
        "panpsychism",
        "force",
        "philosopher",
        "scientist",
        "spent",
        "great",
        "deal",
        "time",
        "trying",
        "explain",
        "consciousness",
        "term",
        "nonconsciousness",
        "effort",
        "produced",
        "even",
        "beginning",
        "intelligible",
        "explanation",
        "given",
        "failure",
        "seems",
        "reasonable",
        "explore",
        "paradigm",
        "scientific",
        "explanation",
        "might",
        "seem",
        "obvious",
        "emergentist",
        "panpsychists",
        "discussed",
        "unable",
        "make",
        "use",
        "antiemergence",
        "argument",
        "panpsychism",
        "however",
        "many",
        "panpsychists",
        "argue",
        "panpsychist",
        "form",
        "emergentism",
        "le",
        "radical",
        "nonpanpsychism",
        "form",
        "emergentism",
        "hedda",
        "hassel",
        "mørch",
        "example",
        "defends",
        "form",
        "panpsychism",
        "involving",
        "partially",
        "intelligible",
        "emergence",
        "argues",
        "preferred",
        "fully",
        "brute",
        "emergence",
        "brian",
        "mclaughlin",
        "responds",
        "nagel",
        "argument",
        "deploying",
        "currently",
        "popular",
        "strategy",
        "defending",
        "physicalism",
        "phenomenal",
        "concept",
        "strategy",
        "see",
        "also",
        "freeman",
        "volume",
        "response",
        "strawson",
        "antiemergence",
        "argument",
        "followed",
        "strawson",
        "counterresponses"
    ]
}