{
    "main_text": "Arguments for Panpsychism || The Intrinsic Nature Argument\n3.2 The Intrinsic Nature Argument\nThere is a second prominent argument for panpsychism, which has nothing to do with the need to explain human consciousness; rather it begins from a certain gap in the picture of the world we get from the physical sciences. This argument has its roots in Leibniz, Schopenhauer, Russell (1927) and Whitehead (1933 [1967]), and is defended by many panpsychists, including Sprigge (1999), Strawson (2003) and Goff (2017). It is also strongly connected to the motivations for Russellian monism, and so it may be useful to read this section in close conjunction with the section above on Russellian monism.\nIn the public mind physics is on its way to giving us a complete account of the fundamental nature of the material world. It seems almost tautological that “physics” is the true theory of “the physical”, and hence that it is to physics we should turn for an understanding of the complete nature of space, time and matter. However, this commonplace opinion comes under pressure when we reflect on the austere vocabulary in terms of which physical theories are framed. A crucial moment in the scientific revolution was Galileo’s declaration that the book of the universe is written in the language of mathematics; from this point onwards mathematics has been the language of physics. The vocabulary of physics is arguably not entirely mathematical, as it involves causal or nomic notions, such as the notion of a law of nature. But the kind of qualitative concepts we find in the Aristotelian characterisation of the universe are wholly absent from modern physics. Physical theories are framed in a wholly mathematico-nomic vocabulary.[21]\nThe problem is that it’s not clear that such an austere vocabulary can even in principle capture the complete nature of concrete reality. A mathematical description of a situation abstracts from concrete reality; a mathematical model in economics, for example abstracts away from what is being bought or sold, or the nature of labour. And nomic predicates can only express information about how physical entities are disposed to behave. This is fine if we want to predict, say, how electrons will behave. But intuitively there must also be an intrinsic nature to an electron; there must be an answer to the question “How is the electron in and of itself?” And this question doesn’t seem to be answered by describing how electrons are disposed to behave.\nSome philosophers, known as “dispositional essentialists”, hold that all fundamental properties are pure dispositions (Ellis 2001; Molnar 2003; Mumford 2004; Bird 2007). On this view, once we have fully described how the electron is disposed to behave, e.g., the disposition to repel other electrons and to attract positrons, or the disposition to exert gravitational attraction on other entities with mass, we have thereby said everything there is to be said about the nature of the electron. Entities on this view are not so much beings as doings.\nHowever, there are powerful arguments against the intelligibility of dispositional essentialism. Most discussed is the charge that attempts to characterize the nature of properties under the assumption of dispositional essentialism lead to vicious regress (Robinson 1982; Blackburn 1990; Armstrong 1997; Heil 2003; Lowe 2006; Goff 2017: ch. 6; Goff 2019a: Technical Appendix A). For any given disposition X, we understand the nature of X only when we know the nature of its manifestation, that is, the property it gives rise to when manifested. For example, the manifestation of flammability is burning; we only know what flammability is when we know that burning is its manifestation. However, assuming dispositional essentialism the manifestation of any disposition X will be another disposition, call it “Y”. To know the nature of X we need to know the nature of Y. But we can only know the nature of Y by knowing the nature of its manifestation, which will be another disposition, call it “Z”. To know the nature of Z we need to know the nature of its manifestation, and so on ad infinitum. The buck is continually passed, and hence an adequate understanding of the nature of any property is impossible, even for an omniscient being; in other words, a dispositional essentialist world is unintelligible. Russell records the moral of the story thus:\n\nThere are many possible ways of turning some things hitherto regarded as “real” into mere laws concerning the other things. Obviously there must be a limit to this process, or else all the things in the world will merely be each other’s washing (Russell 1927: 325)\n\nIf this argument is sound, then physical theory will never provide us with a complete and adequate account of the nature of the material world. The job of physics is to provide us with mathematical models that accurately predict the behaviour of matter. This is incredibly useful information; rich understanding of the causal structure of matter has enabled us to manipulate the natural world in all sorts of extraordinary ways, allowing us to build lasers and hairdryers, and to put men on the moon. Indeed we can explain the extraordinary success of physics in terms of the fact that from Galileo onwards it focused on this more limited project of capturing matter’s causal structure, rather than speculating about the underlying nature of the stuff that has that structure.\nHowever, as philosophers we may be interested in finding out what the intrinsic nature of matter is, or at least having our best guess as to what it might be. And if the above line of reasoning is correct, we must look beyond physics for this. The panpsychist has a proposal: the intrinsic nature of matter is, at least in part, consciousness. Supposing for the sake of discussion that electrons are fundamental constituents of reality, the panpsychist proposal is as follows: physics tells us how an electron behaves, but in and of itself the electron is essentially a thing that instantiates consciousness (of presumably some extremely basic kind).\nWhat is to be said in favour of this proposal? The first thing to say is that it is not obvious that we have an alternative proposal, at least at present. We learn about matter through its causal impact on our senses or on our measuring devices; as Eddington (1928: 58–60; quoted in Strawson 2006a) put it “Our knowledge of the nature of the objects treated in physics consists solely of readings of pointers [on instrument dials] and other indicators”. It’s hard to see how this indirect method of investigating matter could yield insight into its intrinsic nature. Derk Pereboom (2011) has suggested that future thinkers may through imagination theorise their way to a positive hypothesis concerning the intrinsic nature of matter, and such a proposal may turn out to have empirical support, or theoretical support of some other kind. However, at least as they are currently conceived of, the physical sciences have no use for speculation concerning matter’s intrinsic nature. It is arguable that our choice is between the panpsychist proposal and the view that the intrinsic nature of matter is “we know not what”.\nFurthermore, assuming the falsity of dualism, we know that the intrinsic nature of at least some matter is consciousness-involving: namely the matter of brains (or whole organisms if we think that organisms are the bearers of consciousness). This is perhaps our only real clue as to the intrinsic nature of matter in general; as regards the intrinsic nature of stuff outside of brains (or of the parts of brains) we can only speculate. Goff (2016, 2017: ch. 7, 2019a: ch. 4) has argued that from this epistemic starting point there is a clear “simplicity argument” in favour of panpsychism: in the absence of any reason to suppose otherwise, the most simple, elegant, parsimonious hypothesis is that the matter outside of brains is continuous with the matter of brains in also having a consciousness-involving nature. Eddington (1928: 259–60; quoted in Strawson 2003) remarked that it was rather “silly”, given that we know nothing from physics of the intrinsic nature of matter, to suppose that its nature is incongruent with mentality and then to wonder where mentality comes from. These panpsychists try to put the onus on their opponents to come up with a non-panpsychist proposal as to the intrinsic nature of matter, and to give reasons to prefer it to the prima facie much simpler and more parsimonious panpsychist proposal. Responses to Goff’s simplicity argument for panpsychism are offered by Taylor (2019) and Dainton (forthcoming).\n",
    "section_title": "3.2 The Intrinsic Nature Argument",
    "entry_title": "Panpsychism",
    "hierarchy_title": "Panpsychism || Arguments for Panpsychism || The Intrinsic Nature Argument",
    "tokenized_text": [
        "argument",
        "panpsychism",
        "intrinsic",
        "nature",
        "argument",
        "intrinsic",
        "nature",
        "argument",
        "second",
        "prominent",
        "argument",
        "panpsychism",
        "nothing",
        "need",
        "explain",
        "human",
        "consciousness",
        "rather",
        "begin",
        "certain",
        "gap",
        "picture",
        "world",
        "get",
        "physical",
        "science",
        "argument",
        "root",
        "leibniz",
        "schopenhauer",
        "russell",
        "whitehead",
        "defended",
        "many",
        "panpsychists",
        "including",
        "sprigge",
        "strawson",
        "goff",
        "also",
        "strongly",
        "connected",
        "motivation",
        "russellian",
        "monism",
        "may",
        "useful",
        "read",
        "section",
        "close",
        "conjunction",
        "section",
        "russellian",
        "monism",
        "public",
        "mind",
        "physic",
        "way",
        "giving",
        "u",
        "complete",
        "account",
        "fundamental",
        "nature",
        "material",
        "world",
        "seems",
        "almost",
        "tautological",
        "physic",
        "true",
        "theory",
        "physical",
        "hence",
        "physic",
        "turn",
        "understanding",
        "complete",
        "nature",
        "space",
        "time",
        "matter",
        "however",
        "commonplace",
        "opinion",
        "come",
        "pressure",
        "reflect",
        "austere",
        "vocabulary",
        "term",
        "physical",
        "theory",
        "framed",
        "crucial",
        "moment",
        "scientific",
        "revolution",
        "galileo",
        "declaration",
        "book",
        "universe",
        "written",
        "language",
        "mathematics",
        "point",
        "onwards",
        "mathematics",
        "language",
        "physic",
        "vocabulary",
        "physic",
        "arguably",
        "entirely",
        "mathematical",
        "involves",
        "causal",
        "nomic",
        "notion",
        "notion",
        "law",
        "nature",
        "kind",
        "qualitative",
        "concept",
        "find",
        "aristotelian",
        "characterisation",
        "universe",
        "wholly",
        "absent",
        "modern",
        "physic",
        "physical",
        "theory",
        "framed",
        "wholly",
        "mathematiconomic",
        "vocabulary",
        "problem",
        "clear",
        "austere",
        "vocabulary",
        "even",
        "principle",
        "capture",
        "complete",
        "nature",
        "concrete",
        "reality",
        "mathematical",
        "description",
        "situation",
        "abstract",
        "concrete",
        "reality",
        "mathematical",
        "model",
        "economics",
        "example",
        "abstract",
        "away",
        "bought",
        "sold",
        "nature",
        "labour",
        "nomic",
        "predicate",
        "express",
        "information",
        "physical",
        "entity",
        "disposed",
        "behave",
        "fine",
        "want",
        "predict",
        "say",
        "electron",
        "behave",
        "intuitively",
        "must",
        "also",
        "intrinsic",
        "nature",
        "electron",
        "must",
        "answer",
        "question",
        "electron",
        "question",
        "seem",
        "answered",
        "describing",
        "electron",
        "disposed",
        "behave",
        "philosopher",
        "known",
        "dispositional",
        "essentialists",
        "hold",
        "fundamental",
        "property",
        "pure",
        "disposition",
        "elli",
        "molnar",
        "mumford",
        "bird",
        "view",
        "fully",
        "described",
        "electron",
        "disposed",
        "behave",
        "eg",
        "disposition",
        "repel",
        "electron",
        "attract",
        "positron",
        "disposition",
        "exert",
        "gravitational",
        "attraction",
        "entity",
        "mass",
        "thereby",
        "said",
        "everything",
        "said",
        "nature",
        "electron",
        "entity",
        "view",
        "much",
        "being",
        "doings",
        "however",
        "powerful",
        "argument",
        "intelligibility",
        "dispositional",
        "essentialism",
        "discussed",
        "charge",
        "attempt",
        "characterize",
        "nature",
        "property",
        "assumption",
        "dispositional",
        "essentialism",
        "lead",
        "vicious",
        "regress",
        "robinson",
        "blackburn",
        "armstrong",
        "heil",
        "lowe",
        "goff",
        "ch",
        "goff",
        "a",
        "technical",
        "appendix",
        "given",
        "disposition",
        "x",
        "understand",
        "nature",
        "x",
        "know",
        "nature",
        "manifestation",
        "property",
        "give",
        "rise",
        "manifested",
        "example",
        "manifestation",
        "flammability",
        "burning",
        "know",
        "flammability",
        "know",
        "burning",
        "manifestation",
        "however",
        "assuming",
        "dispositional",
        "essentialism",
        "manifestation",
        "disposition",
        "x",
        "another",
        "disposition",
        "call",
        "know",
        "nature",
        "x",
        "need",
        "know",
        "nature",
        "y",
        "know",
        "nature",
        "knowing",
        "nature",
        "manifestation",
        "another",
        "disposition",
        "call",
        "z",
        "know",
        "nature",
        "z",
        "need",
        "know",
        "nature",
        "manifestation",
        "ad",
        "infinitum",
        "buck",
        "continually",
        "passed",
        "hence",
        "adequate",
        "understanding",
        "nature",
        "property",
        "impossible",
        "even",
        "omniscient",
        "word",
        "dispositional",
        "essentialist",
        "world",
        "unintelligible",
        "russell",
        "record",
        "moral",
        "story",
        "thus",
        "many",
        "possible",
        "way",
        "turning",
        "thing",
        "hitherto",
        "regarded",
        "real",
        "mere",
        "law",
        "concerning",
        "thing",
        "obviously",
        "must",
        "limit",
        "process",
        "else",
        "thing",
        "world",
        "merely",
        "washing",
        "russell",
        "argument",
        "sound",
        "physical",
        "theory",
        "never",
        "provide",
        "u",
        "complete",
        "adequate",
        "account",
        "nature",
        "material",
        "world",
        "job",
        "physic",
        "provide",
        "u",
        "mathematical",
        "model",
        "accurately",
        "predict",
        "behaviour",
        "matter",
        "incredibly",
        "useful",
        "information",
        "rich",
        "understanding",
        "causal",
        "structure",
        "matter",
        "enabled",
        "u",
        "manipulate",
        "natural",
        "world",
        "sort",
        "extraordinary",
        "way",
        "allowing",
        "u",
        "build",
        "laser",
        "hairdryers",
        "put",
        "men",
        "moon",
        "indeed",
        "explain",
        "extraordinary",
        "success",
        "physic",
        "term",
        "fact",
        "galileo",
        "onwards",
        "focused",
        "limited",
        "project",
        "capturing",
        "matter",
        "causal",
        "structure",
        "rather",
        "speculating",
        "underlying",
        "nature",
        "stuff",
        "structure",
        "however",
        "philosopher",
        "may",
        "interested",
        "finding",
        "intrinsic",
        "nature",
        "matter",
        "least",
        "best",
        "guess",
        "might",
        "line",
        "reasoning",
        "correct",
        "must",
        "look",
        "beyond",
        "physic",
        "panpsychist",
        "proposal",
        "intrinsic",
        "nature",
        "matter",
        "least",
        "part",
        "consciousness",
        "supposing",
        "sake",
        "discussion",
        "electron",
        "fundamental",
        "constituent",
        "reality",
        "panpsychist",
        "proposal",
        "follows",
        "physic",
        "tell",
        "u",
        "electron",
        "behaves",
        "electron",
        "essentially",
        "thing",
        "instantiates",
        "consciousness",
        "presumably",
        "extremely",
        "basic",
        "kind",
        "said",
        "favour",
        "proposal",
        "first",
        "thing",
        "say",
        "obvious",
        "alternative",
        "proposal",
        "least",
        "present",
        "learn",
        "matter",
        "causal",
        "impact",
        "sens",
        "measuring",
        "device",
        "eddington",
        "quoted",
        "strawson",
        "a",
        "put",
        "knowledge",
        "nature",
        "object",
        "treated",
        "physic",
        "consists",
        "solely",
        "reading",
        "pointer",
        "instrument",
        "dial",
        "indicator",
        "hard",
        "see",
        "indirect",
        "method",
        "investigating",
        "matter",
        "could",
        "yield",
        "insight",
        "intrinsic",
        "nature",
        "derk",
        "pereboom",
        "suggested",
        "future",
        "thinker",
        "may",
        "imagination",
        "theorise",
        "way",
        "positive",
        "hypothesis",
        "concerning",
        "intrinsic",
        "nature",
        "matter",
        "proposal",
        "may",
        "turn",
        "empirical",
        "support",
        "theoretical",
        "support",
        "kind",
        "however",
        "least",
        "currently",
        "conceived",
        "physical",
        "science",
        "use",
        "speculation",
        "concerning",
        "matter",
        "intrinsic",
        "nature",
        "arguable",
        "choice",
        "panpsychist",
        "proposal",
        "view",
        "intrinsic",
        "nature",
        "matter",
        "know",
        "furthermore",
        "assuming",
        "falsity",
        "dualism",
        "know",
        "intrinsic",
        "nature",
        "least",
        "matter",
        "consciousnessinvolving",
        "namely",
        "matter",
        "brain",
        "whole",
        "organism",
        "think",
        "organism",
        "bearer",
        "consciousness",
        "perhaps",
        "real",
        "clue",
        "intrinsic",
        "nature",
        "matter",
        "general",
        "regard",
        "intrinsic",
        "nature",
        "stuff",
        "outside",
        "brain",
        "part",
        "brain",
        "speculate",
        "goff",
        "ch",
        "a",
        "ch",
        "argued",
        "epistemic",
        "starting",
        "point",
        "clear",
        "simplicity",
        "argument",
        "favour",
        "panpsychism",
        "absence",
        "reason",
        "suppose",
        "otherwise",
        "simple",
        "elegant",
        "parsimonious",
        "hypothesis",
        "matter",
        "outside",
        "brain",
        "continuous",
        "matter",
        "brain",
        "also",
        "consciousnessinvolving",
        "nature",
        "eddington",
        "quoted",
        "strawson",
        "remarked",
        "rather",
        "silly",
        "given",
        "know",
        "nothing",
        "physic",
        "intrinsic",
        "nature",
        "matter",
        "suppose",
        "nature",
        "incongruent",
        "mentality",
        "wonder",
        "mentality",
        "come",
        "panpsychists",
        "try",
        "put",
        "onus",
        "opponent",
        "come",
        "nonpanpsychist",
        "proposal",
        "intrinsic",
        "nature",
        "matter",
        "give",
        "reason",
        "prefer",
        "prima",
        "facie",
        "much",
        "simpler",
        "parsimonious",
        "panpsychist",
        "proposal",
        "response",
        "goff",
        "simplicity",
        "argument",
        "panpsychism",
        "offered",
        "taylor",
        "dainton",
        "forthcoming"
    ]
}