{
    "main_text": "Philosophical Issues || Skolem's Views\n3.1 Skolem's Views\n\n\nIn the 1922 paper where he originally presented Skolem's Paradox,\nSkolem used the paradox to argue for two philosophical conclusions:\nthat set theory can't serve as a “foundation for\nmathematics” and that axiomatizing set theory leads to a\n“relativity of set theoretic notions” (Skolem 1922). These\nclaims, and Skolem's arguments for them, have attracted considerable\nattention in the literature. Unfortunately, Skolem's paper is quite\ncompressed, and so it's difficult to determine exactly what these\nclaims were really supposed to amount to. At present, there are three\ninterpretations of Skolem's paper which have some currency in the\nphilosophical literature.\n\n\nLet's begin with Skolem's claim that axiomatizing set theory leads\nto a relativity of set-theoretic notions. One way to understand this\nclaim is to view it against the backdrop of what we might call an\nalgebraic or model-theoretic conception of\naxiomatization. On this conception, the axioms of set theory serve to\ncharacterize—or perhaps even to implicitly define—basic\nset-theoretic notions like set, membership and set-theoretic universe.\nSo, a set-theoretic universe is simply a model for the axioms\nof set theory, a set is simply an element in some\nset-theoretic universe, and membership just refers to whatever\nbinary relation a particular universe uses to interpret the symbol\n“∈.” On this conception of axiomatization, then, the\naxioms of set theory should not be seen as attempts at\ndescribing—or even partially describing—some antecedently\ngiven “intended model” of set theory; instead, the intended\nmodels of set theory are simply those models which happen to\nsatisfy our initial collection of set-theoretic\n axioms.[31]\n\n\nWe should emphasize, here, that this algebraic conception of\naxiomatization would have been quite familiar to mathematicians working\nat the time Skolem wrote his 1922 paper. Skolem himself was trained\nin Schröder's algebraic school of logic, so this would have been\nthe natural way for him to think about axioms. But even people who\nweren't trained in Schröder's school would have found the\nconception familiar. It's the conception which lay behind Hilbert's\nfamous axiomatization of geometry (about which Hilbert reputedly\nclaimed, somewhat notoriously, that we can replace points, lines, and\nplanes with tables, chairs, and beer mugs as long as the latter objects\nstand in the right kinds of relations). It's also the conception which\nlay behind the 19th-century results that arithmetic and analysis can be\ngiven categorical (second-order) axiomatizations. Finally, and most\nimportantly, it's the conception of axiomatization which Skolem\nattributes to Zermelo in the very paper that we're currently\ndiscussing, and so it's the conception of Zermelo's axioms that Skolem\nis primarily concerned with\n criticizing.[32]\n\n\nGiven this algebraic conception of axiomatization, then, Skolem\nappeals to the Löwenheim-Skolem theorems to argue that the axioms\nof set theory lack the resources to pin down the notion of\nuncountability. Given any first-order axiomatization of set theory and\nany formula Ω(x) which is supposed to capture\nthe notion of uncountability, the Löwenheim-Skolem theorems show\nthat we can find a countable model M which satisfies\nour axioms. As in section 1, therefore, we can find an element\nmˆ ∈\n M such that M\n ⊨ Ω(mˆ) but\n{m | M\n ⊨\n m ∈ mˆ } is only\ncountable. Thus, as long the basic set theoretic notions are\ncharacterized simply by looking at the model theory of first-order\naxiomatizations of set theory, then many of these notions—and, in\nparticular, the notions of countability and uncountability—will\nturn out to be unavoidably\n relative.[33]\n\n\nThis, then, provides the content of Skolem's claim that axiomatizing\nset theory leads to a relativity of set-theoretic notions. It is\nimportant, here, to distinguish this claim from a more trivial claim\nwhich Skolem might be thought to be making. From one perspective, the\nalgebraic conception of axiomatization leads to an obvious\nform of relativity: the elements which count as sets in one model may\nnot count as sets in another model, the membership relation of one\nmodel may be different than the membership relation of another model,\nand this latter difference in membership relations may hold even if the\ntwo models happen to share the same domain. On this trivial notion of\nrelativity, therefore, almost everything turns out to be relative, even\nsimple notions like “x is the empty set” or\n“x is a singleton.” After all, an object could be\na “singleton” in one model while being a\n“doubleton” in another model, or it could be “the\nempty set” in one model while being omitted entirely from another\nmodel's domain.\n\n\nIt's important to emphasize that Skolem's own notion of relativity\nis more sophisticated than this. Let's grant that the specific element\nwhich serves as “the empty set” will not remain constant as\nwe move from one model of set theory to another—with the empty\nset in the first model becoming, perhaps, a singleton in the second.\nNonetheless, we can still use a formula in the language of set theory\nto capture the notion “x is the empty set” in an\nessentially absolute way. In any model of our axioms, an\nelement mˆ ∈\n M will satisfy the\nopen formula “∀y y ∉ x”\nif and only if the set {m | M\n ⊨\n m ∈\nmˆ } \nis really empty. Hence, there's at least\na sense in which we can still capture the notion\n“x is the empty set” from within the algebraic\nframework. And this point extends more widely—a similar argument\nwould apply to notions like “x is a singleton” or\n“x has seventeen members.” Even on the algebraic\nconception of axiomatization, therefore, there are some set-theoretic\nnotions which we can still pin down pretty precisely. What the\nLöwenheim-Skolem theorems show is that, no matter how rich our\n(first-order) set-theoretic axioms may be, we cannot use this kind of\ntechnique to pin down the notion “x is\nuncountable.” This is the result which lies behind all of\nSkolem's talk about “relativity,” and it's a result which\nhighlights a genuine weakness in the algebraic approach to\nset-theoretic\n axiomatization.[34]\n\n\nTo summarize, then, the upshot of this discussion is this:\nif we take a purely algebraic approach to the axioms of set\ntheory, then many basic set-theoretic notions—including the\nnotions of countability and uncountability—will turn out to be\nrelative. In Skolem's words: “axiomatizing set theory leads to a\nrelativity of set-theoretic notions, and this relativity is inseparably\nbound up with every thoroughgoing axiomatization” (Skolem 1922,\np. 296). Of course, this still leaves open the question of whether\nthese notions are, as it were, absolutely relative—of\nwhether there is some other, non-algebraic and non-thoroughgoing, way\nof understanding our axioms which does not lead to the sort of\nrelativity we've just been discussing. It's when we turn to this latter\nquestion that the various interpretations of Skolem's paper begin to\ncome apart.\n\n\nThe most traditional interpretation of the paper sees Skolem as\nmounting a straightforward attack on set theory. Skolem starts his\npaper by noting that the classical set-theoretic paradoxes should lead\nus to be skeptical of informal understandings of set theory—of\n“naive reasoning with sets,” to use Skolem's own\nexpression. Given this, our only real option is to fall back on some\nform of axiomatized set theory, and the only respectable way to\nunderstand our axioms is algebraically (since understanding them\nintuitively would amount to falling back into our previously\ndiscredited naiveté). But Skolem's Paradox shows that\nset-theoretic notions are relative on the algebraic conception of\naxiomatization. So, these notions are really relative. In\nshort: the classical paradoxes show that the algebraic conception of\nset theory is the best conception we've got, and so Skolem's Paradox\nshows that set-theoretic notions are unavoidably relative. This\ntraditional reading of Skolem is quite prevalent in the folklore;\nvariants of it are discussed in Hart 1970, McIntosh 1979, Muller 2005,\nand Bellotti 2006.\n\n\nThe second interpretation focuses on Skolem's claim that set theory\ncannot provide an adequate foundation for mathematics. In particular,\nSkolem thinks that set theory lacks the resources to provide a\nfoundation for ordinary arithmetic—on his view, arithmetic is\n“clear, natural and not open to question,” while set theory\nitself is far more problematic. To show that set theory is\nproblematic, Skolem runs through a number of different ways of\ninterpreting set theory—naive set theory, axiomatized set theory\nconstrued proof-theoretically, axiomatized set theory construed\nalgebraically, etc.—and he argues that each of these\nunderstandings of set theory is inadequate for foundational purposes.\nOn this reading, then, Skolem's Paradox plays only a modest role in\nSkolem's overall argument. It serves to highlight some problems with\none particular conception of set theory (the algebraic conception), but\nit plays no role in Skolem's arguments against other conceptions of set\ntheory. Further, these other arguments do not show—or even\npurport to show—that the various non-algebraic conceptions of set\ntheory lead to any kind of relativity (although they do, of course,\nhave other problems which render them unsuitable for foundationalist\n purposes).[35]\nVersions of this foundationalist reading of Skolem's paper can be found\nin George 1985 and Benacerraf 1985; see Jané 2001 for some\ncriticisms of this line of interpretation.\n\n\nThe final interpretation of Skolem's argument comes in a\npaper by Ignacio Jané (Jané 2001). Jané's reading\nagrees with the traditional interpretation in taking Skolem to be\nmounting a fairly general attack on set theory—and, in\nparticular, on the notion of an absolutely uncountable set. But it\nagrees with the foundationalist interpretation in that it takes this\nattack to be mounted piecemeal, with Skolem's Paradox itself playing\nonly a modest role in one prong of the attack. Very roughly,\nJané thinks that Skolem is trying to show that there is no\nrigorous way to initially introduce the notion of an uncountable set\ninto mathematics. The set-theoretic paradoxes show that we should not\nnaively take Cantor's Theorem at face value—so, Cantor's proof\nitself doesn't force us to accept uncountable sets. Skolem's Paradox\nshows that adopting an algebraic understanding of the set-theoretic\naxioms also doesn't force us to accept uncountable sets, since we can\nalways interpret these axioms as applying to a model that's only\ncountable.\n\n\nOf course, as Jané notices, there are a number of strategies\nthat we could use to evade this application of Skolem's Paradox: we\ncould use uncountably many axioms to force our models to have\nuncountable domains, we could appeal to the Upward\nLöwenheim-Skolem theorem to show that Zermelo's axioms\nalso have uncountable models (see section\n 1),\nor we could move to a second-order version of Zermelo's axioms and then\nprove that these axioms can only be satisfied by models with\nuncountable domains (see section\n 2.5).\nUnfortunately, each of these strategies presupposes that we already\nhave a prior grip on the notion of an uncountable set—e.g., to\ninitially characterize an uncountable set of axioms, to formulate the\nUpward Löwenheim-Skolem theorem, or to prove that second-order ZFC\nhas only uncountable models. So, none of these strategies can be used\nto introduce uncountable sets into mathematics in the first\nplace. Or so, at any rate, Jané takes Skolem to be arguing.\n\n\nThese, then, are the three main interpretations of Skolem's paper in\nthe literature. Without taking a stand on which of these\ninterpretations best captures Skolem's own intentions, we note that\nmost of Skolem's contemporaries interpreted him as giving\nsomething like the “traditional” argument described above\nand that their responses to Skolem's Paradox reflected this\ninterpretation. Zermelo himself came to accept the algebraic conception\nof his axioms, but he then insisted that these axioms should be\ninterpreted in second-order terms and that, so interpreted, they do not\nfall prey to Skolem's Paradox (Zermelo 1930; Taylor 1993; Ebbinghaus\n2003). Similarly, Tarski suggested that Skolem's Paradox could be\ndefused by treating “∈” as a logical constant in some\nversion of type theory (see the remarks published at the end of Skolem\n1958). But, while both of these suggestions would allow mathematicians\nto avoid Skolem's Paradox, they both depend on accepting pieces of\npowerful mathematical machinery which Skolem—on any\nreading of his paper—would almost certainly have wanted to\nreject. Given Skolem's philosophical purposes, therefore,\nthese contemporary responses to his paradox would not have seemed very\nthreatening (see Skolem 1955 and Skolem 1958 for some of Skolem's own\nreflections on these kinds of responses).\n",
    "section_title": "3.1 Skolem's Views",
    "entry_title": "Skolem’s Paradox",
    "hierarchy_title": "Skolem’s Paradox || Philosophical Issues || Skolem's Views",
    "tokenized_text": [
        "philosophical",
        "issue",
        "skolem",
        "s",
        "view",
        "skolem",
        "s",
        "view",
        "paper",
        "originally",
        "presented",
        "skolem",
        "s",
        "paradox",
        "skolem",
        "used",
        "paradox",
        "argue",
        "two",
        "philosophical",
        "conclusion",
        "set",
        "theory",
        "ca",
        "nt",
        "serve",
        "foundation",
        "mathematics",
        "axiomatizing",
        "set",
        "theory",
        "lead",
        "relativity",
        "set",
        "theoretic",
        "notion",
        "skolem",
        "claim",
        "skolem",
        "s",
        "argument",
        "attracted",
        "considerable",
        "attention",
        "literature",
        "unfortunately",
        "skolem",
        "s",
        "paper",
        "quite",
        "compressed",
        "s",
        "difficult",
        "determine",
        "exactly",
        "claim",
        "really",
        "supposed",
        "amount",
        "present",
        "three",
        "interpretation",
        "skolem",
        "s",
        "paper",
        "currency",
        "philosophical",
        "literature",
        "let",
        "s",
        "begin",
        "skolem",
        "s",
        "claim",
        "axiomatizing",
        "set",
        "theory",
        "lead",
        "relativity",
        "settheoretic",
        "notion",
        "one",
        "way",
        "understand",
        "claim",
        "view",
        "backdrop",
        "might",
        "call",
        "algebraic",
        "modeltheoretic",
        "conception",
        "axiomatization",
        "conception",
        "axiom",
        "set",
        "theory",
        "serve",
        "characterizeor",
        "perhaps",
        "even",
        "implicitly",
        "definebasic",
        "settheoretic",
        "notion",
        "like",
        "set",
        "membership",
        "settheoretic",
        "universe",
        "settheoretic",
        "universe",
        "simply",
        "model",
        "axiom",
        "set",
        "theory",
        "set",
        "simply",
        "element",
        "settheoretic",
        "universe",
        "membership",
        "refers",
        "whatever",
        "binary",
        "relation",
        "particular",
        "universe",
        "us",
        "interpret",
        "symbol",
        "conception",
        "axiomatization",
        "axiom",
        "set",
        "theory",
        "seen",
        "attempt",
        "describingor",
        "even",
        "partially",
        "describingsome",
        "antecedently",
        "given",
        "intended",
        "model",
        "set",
        "theory",
        "instead",
        "intended",
        "model",
        "set",
        "theory",
        "simply",
        "model",
        "happen",
        "satisfy",
        "initial",
        "collection",
        "settheoretic",
        "axiom",
        "emphasize",
        "algebraic",
        "conception",
        "axiomatization",
        "would",
        "quite",
        "familiar",
        "mathematician",
        "working",
        "time",
        "skolem",
        "wrote",
        "paper",
        "skolem",
        "trained",
        "schröder",
        "s",
        "algebraic",
        "school",
        "logic",
        "would",
        "natural",
        "way",
        "think",
        "axiom",
        "even",
        "people",
        "nt",
        "trained",
        "schröder",
        "s",
        "school",
        "would",
        "found",
        "conception",
        "familiar",
        "s",
        "conception",
        "lay",
        "behind",
        "hilbert",
        "s",
        "famous",
        "axiomatization",
        "geometry",
        "hilbert",
        "reputedly",
        "claimed",
        "somewhat",
        "notoriously",
        "replace",
        "point",
        "line",
        "plane",
        "table",
        "chair",
        "beer",
        "mug",
        "long",
        "latter",
        "object",
        "stand",
        "right",
        "kind",
        "relation",
        "s",
        "also",
        "conception",
        "lay",
        "behind",
        "thcentury",
        "result",
        "arithmetic",
        "analysis",
        "given",
        "categorical",
        "secondorder",
        "axiomatizations",
        "finally",
        "importantly",
        "s",
        "conception",
        "axiomatization",
        "skolem",
        "attribute",
        "zermelo",
        "paper",
        "re",
        "currently",
        "discussing",
        "s",
        "conception",
        "zermelo",
        "s",
        "axiom",
        "skolem",
        "primarily",
        "concerned",
        "criticizing",
        "given",
        "algebraic",
        "conception",
        "axiomatization",
        "skolem",
        "appeal",
        "löwenheimskolem",
        "theorem",
        "argue",
        "axiom",
        "set",
        "theory",
        "lack",
        "resource",
        "pin",
        "notion",
        "uncountability",
        "given",
        "firstorder",
        "axiomatization",
        "set",
        "theory",
        "formula",
        "ω",
        "x",
        "supposed",
        "capture",
        "notion",
        "uncountability",
        "löwenheimskolem",
        "theorem",
        "show",
        "find",
        "countable",
        "model",
        "satisfies",
        "axiom",
        "section",
        "therefore",
        "find",
        "element",
        "mˆ",
        "ω",
        "mˆ",
        "mˆ",
        "countable",
        "thus",
        "long",
        "basic",
        "set",
        "theoretic",
        "notion",
        "characterized",
        "simply",
        "looking",
        "model",
        "theory",
        "firstorder",
        "axiomatizations",
        "set",
        "theory",
        "many",
        "notionsand",
        "particular",
        "notion",
        "countability",
        "uncountabilitywill",
        "turn",
        "unavoidably",
        "relative",
        "provides",
        "content",
        "skolem",
        "s",
        "claim",
        "axiomatizing",
        "set",
        "theory",
        "lead",
        "relativity",
        "settheoretic",
        "notion",
        "important",
        "distinguish",
        "claim",
        "trivial",
        "claim",
        "skolem",
        "might",
        "thought",
        "making",
        "one",
        "perspective",
        "algebraic",
        "conception",
        "axiomatization",
        "lead",
        "obvious",
        "form",
        "relativity",
        "element",
        "count",
        "set",
        "one",
        "model",
        "may",
        "count",
        "set",
        "another",
        "model",
        "membership",
        "relation",
        "one",
        "model",
        "may",
        "different",
        "membership",
        "relation",
        "another",
        "model",
        "latter",
        "difference",
        "membership",
        "relation",
        "may",
        "hold",
        "even",
        "two",
        "model",
        "happen",
        "share",
        "domain",
        "trivial",
        "notion",
        "relativity",
        "therefore",
        "almost",
        "everything",
        "turn",
        "relative",
        "even",
        "simple",
        "notion",
        "like",
        "x",
        "empty",
        "set",
        "x",
        "singleton",
        "object",
        "could",
        "singleton",
        "one",
        "model",
        "doubleton",
        "another",
        "model",
        "could",
        "empty",
        "set",
        "one",
        "model",
        "omitted",
        "entirely",
        "another",
        "model",
        "s",
        "domain",
        "s",
        "important",
        "emphasize",
        "skolem",
        "s",
        "notion",
        "relativity",
        "sophisticated",
        "let",
        "s",
        "grant",
        "specific",
        "element",
        "serf",
        "empty",
        "set",
        "remain",
        "constant",
        "move",
        "one",
        "model",
        "set",
        "theory",
        "anotherwith",
        "empty",
        "set",
        "first",
        "model",
        "becoming",
        "perhaps",
        "singleton",
        "second",
        "nonetheless",
        "still",
        "use",
        "formula",
        "language",
        "set",
        "theory",
        "capture",
        "notion",
        "x",
        "empty",
        "set",
        "essentially",
        "absolute",
        "way",
        "model",
        "axiom",
        "element",
        "mˆ",
        "satisfy",
        "open",
        "formula",
        "y",
        "x",
        "set",
        "mˆ",
        "really",
        "empty",
        "hence",
        "s",
        "least",
        "sense",
        "still",
        "capture",
        "notion",
        "x",
        "empty",
        "set",
        "within",
        "algebraic",
        "framework",
        "point",
        "extends",
        "widelya",
        "similar",
        "argument",
        "would",
        "apply",
        "notion",
        "like",
        "x",
        "singleton",
        "x",
        "seventeen",
        "members",
        "even",
        "algebraic",
        "conception",
        "axiomatization",
        "therefore",
        "settheoretic",
        "notion",
        "still",
        "pin",
        "pretty",
        "precisely",
        "löwenheimskolem",
        "theorem",
        "show",
        "matter",
        "rich",
        "firstorder",
        "settheoretic",
        "axiom",
        "may",
        "use",
        "kind",
        "technique",
        "pin",
        "notion",
        "x",
        "uncountable",
        "result",
        "lie",
        "behind",
        "skolem",
        "s",
        "talk",
        "relativity",
        "s",
        "result",
        "highlight",
        "genuine",
        "weakness",
        "algebraic",
        "approach",
        "settheoretic",
        "axiomatization",
        "summarize",
        "upshot",
        "discussion",
        "take",
        "purely",
        "algebraic",
        "approach",
        "axiom",
        "set",
        "theory",
        "many",
        "basic",
        "settheoretic",
        "notionsincluding",
        "notion",
        "countability",
        "uncountabilitywill",
        "turn",
        "relative",
        "skolem",
        "s",
        "word",
        "axiomatizing",
        "set",
        "theory",
        "lead",
        "relativity",
        "settheoretic",
        "notion",
        "relativity",
        "inseparably",
        "bound",
        "every",
        "thoroughgoing",
        "axiomatization",
        "skolem",
        "p",
        "course",
        "still",
        "leaf",
        "open",
        "question",
        "whether",
        "notion",
        "absolutely",
        "relativeof",
        "whether",
        "nonalgebraic",
        "nonthoroughgoing",
        "way",
        "understanding",
        "axiom",
        "lead",
        "sort",
        "relativity",
        "ve",
        "discussing",
        "s",
        "turn",
        "latter",
        "question",
        "various",
        "interpretation",
        "skolem",
        "s",
        "paper",
        "begin",
        "come",
        "apart",
        "traditional",
        "interpretation",
        "paper",
        "see",
        "skolem",
        "mounting",
        "straightforward",
        "attack",
        "set",
        "theory",
        "skolem",
        "start",
        "paper",
        "noting",
        "classical",
        "settheoretic",
        "paradox",
        "lead",
        "u",
        "skeptical",
        "informal",
        "understanding",
        "set",
        "theoryof",
        "naive",
        "reasoning",
        "set",
        "use",
        "skolem",
        "s",
        "expression",
        "given",
        "real",
        "option",
        "fall",
        "back",
        "form",
        "axiomatized",
        "set",
        "theory",
        "respectable",
        "way",
        "understand",
        "axiom",
        "algebraically",
        "since",
        "understanding",
        "intuitively",
        "would",
        "amount",
        "falling",
        "back",
        "previously",
        "discredited",
        "naiveté",
        "skolem",
        "s",
        "paradox",
        "show",
        "settheoretic",
        "notion",
        "relative",
        "algebraic",
        "conception",
        "axiomatization",
        "notion",
        "really",
        "relative",
        "short",
        "classical",
        "paradox",
        "show",
        "algebraic",
        "conception",
        "set",
        "theory",
        "best",
        "conception",
        "ve",
        "got",
        "skolem",
        "s",
        "paradox",
        "show",
        "settheoretic",
        "notion",
        "unavoidably",
        "relative",
        "traditional",
        "reading",
        "skolem",
        "quite",
        "prevalent",
        "folklore",
        "variant",
        "discussed",
        "hart",
        "mcintosh",
        "muller",
        "bellotti",
        "second",
        "interpretation",
        "focus",
        "skolem",
        "s",
        "claim",
        "set",
        "theory",
        "provide",
        "adequate",
        "foundation",
        "mathematics",
        "particular",
        "skolem",
        "think",
        "set",
        "theory",
        "lack",
        "resource",
        "provide",
        "foundation",
        "ordinary",
        "arithmeticon",
        "view",
        "arithmetic",
        "clear",
        "natural",
        "open",
        "question",
        "set",
        "theory",
        "far",
        "problematic",
        "show",
        "set",
        "theory",
        "problematic",
        "skolem",
        "run",
        "number",
        "different",
        "way",
        "interpreting",
        "set",
        "theorynaive",
        "set",
        "theory",
        "axiomatized",
        "set",
        "theory",
        "construed",
        "prooftheoretically",
        "axiomatized",
        "set",
        "theory",
        "construed",
        "algebraically",
        "etcand",
        "argues",
        "understanding",
        "set",
        "theory",
        "inadequate",
        "foundational",
        "purpose",
        "reading",
        "skolem",
        "s",
        "paradox",
        "play",
        "modest",
        "role",
        "skolem",
        "s",
        "overall",
        "argument",
        "serf",
        "highlight",
        "problem",
        "one",
        "particular",
        "conception",
        "set",
        "theory",
        "algebraic",
        "conception",
        "play",
        "role",
        "skolem",
        "s",
        "argument",
        "conception",
        "set",
        "theory",
        "argument",
        "showor",
        "even",
        "purport",
        "showthat",
        "various",
        "nonalgebraic",
        "conception",
        "set",
        "theory",
        "lead",
        "kind",
        "relativity",
        "although",
        "course",
        "problem",
        "render",
        "unsuitable",
        "foundationalist",
        "purpose",
        "version",
        "foundationalist",
        "reading",
        "skolem",
        "s",
        "paper",
        "found",
        "george",
        "benacerraf",
        "see",
        "jané",
        "criticism",
        "line",
        "interpretation",
        "final",
        "interpretation",
        "skolem",
        "s",
        "argument",
        "come",
        "paper",
        "ignacio",
        "jané",
        "jané",
        "jané",
        "s",
        "reading",
        "agrees",
        "traditional",
        "interpretation",
        "taking",
        "skolem",
        "mounting",
        "fairly",
        "general",
        "attack",
        "set",
        "theoryand",
        "particular",
        "notion",
        "absolutely",
        "uncountable",
        "set",
        "agrees",
        "foundationalist",
        "interpretation",
        "take",
        "attack",
        "mounted",
        "piecemeal",
        "skolem",
        "s",
        "paradox",
        "playing",
        "modest",
        "role",
        "one",
        "prong",
        "attack",
        "roughly",
        "jané",
        "think",
        "skolem",
        "trying",
        "show",
        "rigorous",
        "way",
        "initially",
        "introduce",
        "notion",
        "uncountable",
        "set",
        "mathematics",
        "settheoretic",
        "paradox",
        "show",
        "naively",
        "take",
        "cantor",
        "s",
        "theorem",
        "face",
        "valueso",
        "cantor",
        "s",
        "proof",
        "nt",
        "force",
        "u",
        "accept",
        "uncountable",
        "set",
        "skolem",
        "s",
        "paradox",
        "show",
        "adopting",
        "algebraic",
        "understanding",
        "settheoretic",
        "axiom",
        "also",
        "nt",
        "force",
        "u",
        "accept",
        "uncountable",
        "set",
        "since",
        "always",
        "interpret",
        "axiom",
        "applying",
        "model",
        "s",
        "countable",
        "course",
        "jané",
        "notice",
        "number",
        "strategy",
        "could",
        "use",
        "evade",
        "application",
        "skolem",
        "s",
        "paradox",
        "could",
        "use",
        "uncountably",
        "many",
        "axiom",
        "force",
        "model",
        "uncountable",
        "domain",
        "could",
        "appeal",
        "upward",
        "löwenheimskolem",
        "theorem",
        "show",
        "zermelo",
        "s",
        "axiom",
        "also",
        "uncountable",
        "model",
        "see",
        "section",
        "could",
        "move",
        "secondorder",
        "version",
        "zermelo",
        "s",
        "axiom",
        "prove",
        "axiom",
        "satisfied",
        "model",
        "uncountable",
        "domain",
        "see",
        "section",
        "unfortunately",
        "strategy",
        "presupposes",
        "already",
        "prior",
        "grip",
        "notion",
        "uncountable",
        "seteg",
        "initially",
        "characterize",
        "uncountable",
        "set",
        "axiom",
        "formulate",
        "upward",
        "löwenheimskolem",
        "theorem",
        "prove",
        "secondorder",
        "zfc",
        "uncountable",
        "model",
        "none",
        "strategy",
        "used",
        "introduce",
        "uncountable",
        "set",
        "mathematics",
        "first",
        "place",
        "rate",
        "jané",
        "take",
        "skolem",
        "arguing",
        "three",
        "main",
        "interpretation",
        "skolem",
        "s",
        "paper",
        "literature",
        "without",
        "taking",
        "stand",
        "interpretation",
        "best",
        "capture",
        "skolem",
        "s",
        "intention",
        "note",
        "skolem",
        "s",
        "contemporary",
        "interpreted",
        "giving",
        "something",
        "like",
        "traditional",
        "argument",
        "described",
        "response",
        "skolem",
        "s",
        "paradox",
        "reflected",
        "interpretation",
        "zermelo",
        "came",
        "accept",
        "algebraic",
        "conception",
        "axiom",
        "insisted",
        "axiom",
        "interpreted",
        "secondorder",
        "term",
        "interpreted",
        "fall",
        "prey",
        "skolem",
        "s",
        "paradox",
        "zermelo",
        "taylor",
        "ebbinghaus",
        "similarly",
        "tarski",
        "suggested",
        "skolem",
        "s",
        "paradox",
        "could",
        "defused",
        "treating",
        "logical",
        "constant",
        "version",
        "type",
        "theory",
        "see",
        "remark",
        "published",
        "end",
        "skolem",
        "suggestion",
        "would",
        "allow",
        "mathematician",
        "avoid",
        "skolem",
        "s",
        "paradox",
        "depend",
        "accepting",
        "piece",
        "powerful",
        "mathematical",
        "machinery",
        "skolemon",
        "reading",
        "paperwould",
        "almost",
        "certainly",
        "wanted",
        "reject",
        "given",
        "skolem",
        "s",
        "philosophical",
        "purpose",
        "therefore",
        "contemporary",
        "response",
        "paradox",
        "would",
        "seemed",
        "threatening",
        "see",
        "skolem",
        "skolem",
        "skolem",
        "s",
        "reflection",
        "kind",
        "response"
    ]
}