{
    "main_text": "The Paradoxes of Plurality || The Argument from Finite Size\n2.2 The Argument from Finite Size\n\n… if it should be added to something else that exists, it would\nnot make it any bigger. For if it were of no size and was added, it\ncannot increase in size. And so it follows immediately that what is\nadded is nothing. But if when it is subtracted, the other thing is no\nsmaller, nor is it increased when it is added, clearly the thing being\nadded or subtracted is nothing. (Simplicius(a) On\nAristotle’s Physics,139.9)\n\n\nBut if it exists, each thing must have some size and thickness, and\npart of it must be apart from the rest. And the same reasoning holds\nconcerning the part that is in front. For that too will have size and\npart of it will be in front. Now it is the same thing to say this once\nand to keep saying it forever. For no such part of it will be last,\nnor will there be one part not related to another. Therefore, if there\nare many things, they must be both small and large; so small as not to\nhave size, but so large as to be unlimited. (Simplicius(a) On\nAristotle’s Physics, 141.2)\n\n\nOnce again we have Zeno’s own words. According to his\nconclusion, there are three parts to this argument, but only two\nsurvive. The first—missing—argument purports to show that\nif many things exist then they must have no size at all. Second, from\nthis Zeno argues that it follows that they do not exist at all; since\nthe result of joining (or removing) a sizeless object to anything is\nno change at all, he concludes that the thing added (or removed) is\nliterally nothing. The argument to this point is a self-contained\nrefutation of pluralism, but Zeno goes on to generate a further\nproblem for someone who continues to urge the existence of a\nplurality. This third part of the argument is rather badly put but it\nseems to run something like this: suppose there is a plurality, so\nsome spatially extended object exists (after all, he’s just\nargued that inextended things do not exist). Since it is extended, it\nhas two spatially distinct parts (one ‘in front’ of the\nother). And the parts exist, so they have extension, and so they also\neach have two spatially distinct parts; and so on without end. And\nhence, the final line of argument seems to conclude, the object, if it\nis extended at all, is infinite in extent.\n\nBut what could justify this final step? It doesn’t seem that\nbecause an object has two parts it must be infinitely big! And neither\ndoes it follow from any other of the divisions that Zeno describes\nhere; four, eight, sixteen, or whatever finite parts make a finite\nwhole. Again, surely Zeno is aware of these facts, and so must have\nsomething else in mind, presumably the following: he assumes that if\nthe infinite series of divisions he describes were repeated infinitely\nmany times then a definite collection of parts would result. And\nnotice that he doesn’t have to assume that anyone could actually\ncarry out the divisions—there’s not enough time and knives\naren’t sharp enough—just that an object can be\ngeometrically decomposed into such parts (neither does he assume that\nthese parts are what we would naturally categorize as distinct\nphysical objects like apples, cells, molecules, electrons or so on,\nbut only that they are geometric parts of these objects). Now,\nif—as a pluralist might well accept—such parts exist, it\nfollows from the second part of his argument that they are extended,\nand, he apparently assumes, an infinite sum of finite parts is\ninfinite.\n\nHere we should note that there are two ways he may be envisioning the\nresult of the infinite division.\n\nFirst, one could read him as first dividing the object into 1/2s, then\none of the 1/2s—say the second—into two 1/4s, then one of\nthe 1/4s—say the second again—into two 1/8s and so on. In\nthis case the result of the infinite division results in an endless\nsequence of pieces of size 1/2 the total length, 1/4 the length, 1/8\nthe length …. And then so the total length is (1/2 + 1/4\n+ 1/8 + … of the length, which Zeno concludes is an infinite\ndistance, so that the pluralist is committed to the absurdity that\nfinite bodies are ‘so large as to be unlimited’.\n\nWhat is often pointed out in response is that Zeno gives us no reason\nto think that the sum is infinite rather than finite. He might have\nhad the intuition that any infinite sum of finite quantities, since it\ngrows endlessly with each new term must be infinite, but one might\nalso take this kind of example as showing that some infinite sums are\nafter all finite. Thus, contrary to what he thought, Zeno has not\nproven that the absurd conclusion follows. However, what is not always\nappreciated is that the pluralist is not off the hook so easily, for\nit is not enough just to say that the sum might be finite,\nshe must also show that it is finite—otherwise we\nremain uncertain about the tenability of her position. As an\nillustration of the difficulty faced here consider the following: many\ncommentators speak as if it is simply obvious that the infinite sum of\nthe fractions is 1, that there is nothing to infinite summation. But\nwhat about the following sum: \\(1 - 1 + 1 - 1 + 1\n-\\ldots\\). Obviously, it seems, the sum can be rewritten \\((1 - 1) +\n(1 - 1) + \\ldots = 0 + 0 + \\ldots = 0\\). Surely this answer seems as\nintuitive as the sum of fractions. But this sum can also be rewritten\n\\(1 - (1 - 1 + 1 - 1 +\\ldots) = 1 - 0\\)—since we’ve just\nshown that the term in parentheses vanishes—\\(= 1\\). Relying on\nintuitions about how to perform infinite sums leads to the conclusion\nthat \\(1 = 0\\). Until one can give a theory of infinite sums that can\ngive a satisfactory answer to any problem, one cannot say that\nZeno’s infinite sum is obviously finite. Such a theory was not\nfully worked out until the Nineteenth century by Cauchy. (In\nCauchy’s system \\(1/2 + 1/4 + \\ldots = 1\\) but \\(1 - 1 + 1\n-\\ldots\\) is undefined.)\n\nSecond, it could be that Zeno means that the object is divided in\nhalf, then both the 1/2s are both divided in half, then the 1/4s are\nall divided in half and so on. In this case the pieces at any\nparticular stage are all the same finite size, and so one could\nconclude that the result of carrying on the procedure infinitely would\nbe pieces the same size, which if they exist—according to\nZeno—is greater than zero; but an infinity of equal\nextended parts is indeed infinitely big.\n\nBut this line of thought can be resisted. First, suppose that the\nprocedure just described completely divides the object into\nnon-overlapping parts. (There is a problem with this supposition that\nwe will see just below.) It involves doubling the number of pieces\nafter every division and so after \\(N\\) divisions there are\n\\(2^N\\) pieces. But it turns out that for any natural\nor infinite number, \\(N\\), \\(2^N \\gt N\\), and so the number of (supposed) parts obtained by the\ninfinity of divisions described is an even larger infinity. This\nresult poses no immediate difficulty since, as we mentioned above,\ninfinities come in different sizes. The number of times everything is\ndivided in two is said to be ‘countably infinite’: there\nis a countable infinity of things in a collection if they can be\nlabeled by the numbers 1, 2, 3, … without remainder on either\nside. But the number of pieces the infinite division produces is\n‘uncountably infinite’, which means that there is no way\nto label them 1, 2, 3, … without missing some of them—in\nfact infinitely many of them. However, Cauchy’s definition of an\ninfinite sum only applies to countably infinite series of numbers, and\nso does not apply to the pieces we are considering. However, we could\nconsider just countably many of them, whose lengths according to\nZeno—since he claims they are all equal and non-zero—will\nsum to an infinite length; the length of all of the pieces\ncould not be less than this.\n\nAt this point the pluralist who believes that Zeno’s division\ncompletely divides objects into non-overlapping parts (see the next\nparagraph) could respond that the parts in fact have no extension,\neven though they exist. That would block the conclusion that finite\nobjects are infinite, but it seems to push her back to the other horn\nof Zeno’s argument, for how can all these zero length pieces\nmake up a non-zero sized whole? (Note that according to Cauchy \\(0 + 0\n+ 0 + \\ldots = 0\\) but this result shows nothing here, for as we saw\nthere are uncountably many pieces to add up—more than are added\nin this sum.) We shall postpone this question for the discussion of\nthe next paradox, where it comes up explicitly.\n\nThe second problem with interpreting the infinite division as a\nrepeated division of all parts is that it does not divide an object\ninto distinct parts, if objects are composed in the natural way. To\nsee this, let’s ask the question of what parts are obtained by\nthis division into 1/2s, 1/4s, 1/8s, …. Since the division is\nrepeated without end there is no last piece we can give as an answer,\nand so we need to think about the question in a different way. If we\nsuppose that an object can be represented by a line segment of unit\nlength, then the division produces collections of segments, where the\nfirst is either the first or second half of the whole segment, the\nsecond is the first or second quarter, or third or fourth quarter, and\nin general the segment produced by \\(N\\) divisions is either the\nfirst or second half of the previous segment. For instance, writing\nthe segment with endpoints \\(a\\) and \\(b\\) as\n\\([a,b]\\), some of these collections (technically known\nas ‘chains’ since the elements of the collection are\nordered by size) would start \\(\\{[0,1], [0,1/2], [1/4,1/2], [1/4,3/8],\n\\ldots \\}\\). (When we argued before that Zeno’s division produced\nuncountably many pieces of the object, what we should have said more\ncarefully is that it produces uncountably many chains like this.)\n\nThe question of which parts the division picks out is then the\nquestion of which part any given chain picks out; it’s natural\nto say that a chain picks out the part of the line which is contained\nin every one of its elements. Consider for instance the chain\n\\(\\{[0,1/2], [1/4,1/2], [3/8,1/2], \\ldots \\}\\), in other words the chain\nthat starts with the left half of the line and for which every other\nelement is the right half of the previous one. The half-way point is\nin every one of the segments in this chain; it’s the right-hand\nendpoint of each one. But no other point is in all its elements:\nclearly no point beyond half-way is; and pick any point \\(p\\)\nbefore half-way, if you take right halves of [0,1/2] enough times, the\nleft-hand end of the segment will be to the right of \\(p\\). Thus\nthe only part of the line that is in all the elements of this chain is\nthe half-way point, and so that is the part of the line picked out by\nthe chain. (In fact, it follows from a postulate of number theory that\nthere is exactly one point that all the members of any such a\nchain have in common.) The problem is that by parallel reasoning, the\nhalf-way point is also picked out by the distinct chain \\(\\{[1/2,1],\n[1/2,3/4], [1/2,5/8], \\ldots \\}\\), where each segment after the first is\nthe left half of the preceding one. And so both chains pick out the\nsame piece of the line: the half-way point. And so on for many other\npairs of chains. Thus Zeno’s argument, interpreted in terms of a\nrepeated division of all parts into half, doesn’t\ndivide the line into distinct parts. Hence, if we think that objects\nare composed in the same way as the line, it follows that despite\nappearances, this version of the argument does not cut objects into\nparts whose total size we can properly discuss.\n\n(You might think that this problem could be fixed by taking the\nelements of the chains to be segments with no endpoint to the right.\nThen the first of the two chains we considered no longer has the\nhalf-way point in any of its segments, and so does not pick out that\npoint. The problem now is that it fails to pick out any part of the\nline: the previous reasoning showed that it doesn’t pick out any\npoint greater than or less than the half-way point, and now it\ndoesn’t pick out that point either!)\n",
    "section_title": "2.2 The Argument from Finite Size",
    "entry_title": "Zeno’s Paradoxes",
    "hierarchy_title": "Zeno’s Paradoxes || The Paradoxes of Plurality || The Argument from Finite Size",
    "tokenized_text": [
        "paradox",
        "plurality",
        "argument",
        "finite",
        "size",
        "argument",
        "finite",
        "size",
        "added",
        "something",
        "else",
        "exists",
        "would",
        "make",
        "bigger",
        "size",
        "added",
        "increase",
        "size",
        "follows",
        "immediately",
        "added",
        "nothing",
        "subtracted",
        "thing",
        "smaller",
        "increased",
        "added",
        "clearly",
        "thing",
        "added",
        "subtracted",
        "nothing",
        "simplicius",
        "aristotle",
        "physics",
        "exists",
        "thing",
        "must",
        "size",
        "thickness",
        "part",
        "must",
        "apart",
        "rest",
        "reasoning",
        "hold",
        "concerning",
        "part",
        "front",
        "size",
        "part",
        "front",
        "thing",
        "say",
        "keep",
        "saying",
        "forever",
        "part",
        "last",
        "one",
        "part",
        "related",
        "another",
        "therefore",
        "many",
        "thing",
        "must",
        "small",
        "large",
        "small",
        "size",
        "large",
        "unlimited",
        "simplicius",
        "aristotle",
        "physic",
        "zeno",
        "word",
        "according",
        "conclusion",
        "three",
        "part",
        "argument",
        "two",
        "survive",
        "firstmissingargument",
        "purport",
        "show",
        "many",
        "thing",
        "exist",
        "must",
        "size",
        "second",
        "zeno",
        "argues",
        "follows",
        "exist",
        "since",
        "result",
        "joining",
        "removing",
        "sizeless",
        "object",
        "anything",
        "change",
        "concludes",
        "thing",
        "added",
        "removed",
        "literally",
        "nothing",
        "argument",
        "point",
        "selfcontained",
        "refutation",
        "pluralism",
        "zeno",
        "go",
        "generate",
        "problem",
        "someone",
        "continues",
        "urge",
        "existence",
        "plurality",
        "third",
        "part",
        "argument",
        "rather",
        "badly",
        "put",
        "seems",
        "run",
        "something",
        "like",
        "suppose",
        "plurality",
        "spatially",
        "extended",
        "object",
        "exists",
        "argued",
        "inextended",
        "thing",
        "exist",
        "since",
        "extended",
        "two",
        "spatially",
        "distinct",
        "part",
        "one",
        "front",
        "part",
        "exist",
        "extension",
        "also",
        "two",
        "spatially",
        "distinct",
        "part",
        "without",
        "end",
        "hence",
        "final",
        "line",
        "argument",
        "seems",
        "conclude",
        "object",
        "extended",
        "infinite",
        "extent",
        "could",
        "justify",
        "final",
        "step",
        "seem",
        "object",
        "two",
        "part",
        "must",
        "infinitely",
        "big",
        "neither",
        "follow",
        "division",
        "zeno",
        "describes",
        "four",
        "eight",
        "sixteen",
        "whatever",
        "finite",
        "part",
        "make",
        "finite",
        "whole",
        "surely",
        "zeno",
        "aware",
        "fact",
        "must",
        "something",
        "else",
        "mind",
        "presumably",
        "following",
        "assumes",
        "infinite",
        "series",
        "division",
        "describes",
        "repeated",
        "infinitely",
        "many",
        "time",
        "definite",
        "collection",
        "part",
        "would",
        "result",
        "notice",
        "assume",
        "anyone",
        "could",
        "actually",
        "carry",
        "divisionsthere",
        "enough",
        "time",
        "knife",
        "sharp",
        "enoughjust",
        "object",
        "geometrically",
        "decomposed",
        "part",
        "neither",
        "assume",
        "part",
        "would",
        "naturally",
        "categorize",
        "distinct",
        "physical",
        "object",
        "like",
        "apple",
        "cell",
        "molecule",
        "electron",
        "geometric",
        "part",
        "object",
        "ifas",
        "pluralist",
        "might",
        "well",
        "acceptsuch",
        "part",
        "exist",
        "follows",
        "second",
        "part",
        "argument",
        "extended",
        "apparently",
        "assumes",
        "infinite",
        "sum",
        "finite",
        "part",
        "infinite",
        "note",
        "two",
        "way",
        "may",
        "envisioning",
        "result",
        "infinite",
        "division",
        "first",
        "one",
        "could",
        "read",
        "first",
        "dividing",
        "object",
        "s",
        "one",
        "ssay",
        "secondinto",
        "two",
        "s",
        "one",
        "ssay",
        "second",
        "againinto",
        "two",
        "s",
        "case",
        "result",
        "infinite",
        "division",
        "result",
        "endless",
        "sequence",
        "piece",
        "size",
        "total",
        "length",
        "length",
        "length",
        "total",
        "length",
        "length",
        "zeno",
        "concludes",
        "infinite",
        "distance",
        "pluralist",
        "committed",
        "absurdity",
        "finite",
        "body",
        "large",
        "unlimited",
        "often",
        "pointed",
        "response",
        "zeno",
        "give",
        "u",
        "reason",
        "think",
        "sum",
        "infinite",
        "rather",
        "finite",
        "might",
        "intuition",
        "infinite",
        "sum",
        "finite",
        "quantity",
        "since",
        "grows",
        "endlessly",
        "new",
        "term",
        "must",
        "infinite",
        "one",
        "might",
        "also",
        "take",
        "kind",
        "example",
        "showing",
        "infinite",
        "sum",
        "finite",
        "thus",
        "contrary",
        "thought",
        "zeno",
        "proven",
        "absurd",
        "conclusion",
        "follows",
        "however",
        "always",
        "appreciated",
        "pluralist",
        "hook",
        "easily",
        "enough",
        "say",
        "sum",
        "might",
        "finite",
        "must",
        "also",
        "show",
        "finiteotherwise",
        "remain",
        "uncertain",
        "tenability",
        "position",
        "illustration",
        "difficulty",
        "faced",
        "consider",
        "following",
        "many",
        "commentator",
        "speak",
        "simply",
        "obvious",
        "infinite",
        "sum",
        "fraction",
        "nothing",
        "infinite",
        "summation",
        "following",
        "sum",
        "ldots",
        "obviously",
        "seems",
        "sum",
        "rewritten",
        "ldots",
        "ldots",
        "surely",
        "answer",
        "seems",
        "intuitive",
        "sum",
        "fraction",
        "sum",
        "also",
        "rewritten",
        "ldots",
        "since",
        "shown",
        "term",
        "parenthesis",
        "vanishes",
        "relying",
        "intuition",
        "perform",
        "infinite",
        "sum",
        "lead",
        "conclusion",
        "one",
        "give",
        "theory",
        "infinite",
        "sum",
        "give",
        "satisfactory",
        "answer",
        "problem",
        "one",
        "say",
        "zeno",
        "infinite",
        "sum",
        "obviously",
        "finite",
        "theory",
        "fully",
        "worked",
        "nineteenth",
        "century",
        "cauchy",
        "cauchy",
        "system",
        "ldots",
        "ldots",
        "undefined",
        "second",
        "could",
        "zeno",
        "mean",
        "object",
        "divided",
        "half",
        "s",
        "divided",
        "half",
        "s",
        "divided",
        "half",
        "case",
        "piece",
        "particular",
        "stage",
        "finite",
        "size",
        "one",
        "could",
        "conclude",
        "result",
        "carrying",
        "procedure",
        "infinitely",
        "would",
        "piece",
        "size",
        "existaccording",
        "zenois",
        "greater",
        "zero",
        "infinity",
        "equal",
        "extended",
        "part",
        "indeed",
        "infinitely",
        "big",
        "line",
        "thought",
        "resisted",
        "first",
        "suppose",
        "procedure",
        "described",
        "completely",
        "divide",
        "object",
        "nonoverlapping",
        "part",
        "problem",
        "supposition",
        "see",
        "involves",
        "doubling",
        "number",
        "piece",
        "every",
        "division",
        "n",
        "division",
        "n",
        "piece",
        "turn",
        "natural",
        "infinite",
        "number",
        "n",
        "n",
        "gt",
        "n",
        "number",
        "supposed",
        "part",
        "obtained",
        "infinity",
        "division",
        "described",
        "even",
        "larger",
        "infinity",
        "result",
        "pose",
        "immediate",
        "difficulty",
        "since",
        "mentioned",
        "infinity",
        "come",
        "different",
        "size",
        "number",
        "time",
        "everything",
        "divided",
        "two",
        "said",
        "countably",
        "infinite",
        "countable",
        "infinity",
        "thing",
        "collection",
        "labeled",
        "number",
        "without",
        "remainder",
        "either",
        "side",
        "number",
        "piece",
        "infinite",
        "division",
        "produce",
        "uncountably",
        "infinite",
        "mean",
        "way",
        "label",
        "without",
        "missing",
        "themin",
        "fact",
        "infinitely",
        "many",
        "however",
        "cauchy",
        "definition",
        "infinite",
        "sum",
        "applies",
        "countably",
        "infinite",
        "series",
        "number",
        "apply",
        "piece",
        "considering",
        "however",
        "could",
        "consider",
        "countably",
        "many",
        "whose",
        "length",
        "according",
        "zenosince",
        "claim",
        "equal",
        "nonzerowill",
        "sum",
        "infinite",
        "length",
        "length",
        "piece",
        "could",
        "le",
        "point",
        "pluralist",
        "belief",
        "zeno",
        "division",
        "completely",
        "divide",
        "object",
        "nonoverlapping",
        "part",
        "see",
        "next",
        "paragraph",
        "could",
        "respond",
        "part",
        "fact",
        "extension",
        "even",
        "though",
        "exist",
        "would",
        "block",
        "conclusion",
        "finite",
        "object",
        "infinite",
        "seems",
        "push",
        "back",
        "horn",
        "zeno",
        "argument",
        "zero",
        "length",
        "piece",
        "make",
        "nonzero",
        "sized",
        "whole",
        "note",
        "according",
        "cauchy",
        "ldots",
        "result",
        "show",
        "nothing",
        "saw",
        "uncountably",
        "many",
        "piece",
        "add",
        "upmore",
        "added",
        "sum",
        "shall",
        "postpone",
        "question",
        "discussion",
        "next",
        "paradox",
        "come",
        "explicitly",
        "second",
        "problem",
        "interpreting",
        "infinite",
        "division",
        "repeated",
        "division",
        "part",
        "divide",
        "object",
        "distinct",
        "part",
        "object",
        "composed",
        "natural",
        "way",
        "see",
        "let",
        "ask",
        "question",
        "part",
        "obtained",
        "division",
        "s",
        "s",
        "s",
        "since",
        "division",
        "repeated",
        "without",
        "end",
        "last",
        "piece",
        "give",
        "answer",
        "need",
        "think",
        "question",
        "different",
        "way",
        "suppose",
        "object",
        "represented",
        "line",
        "segment",
        "unit",
        "length",
        "division",
        "produce",
        "collection",
        "segment",
        "first",
        "either",
        "first",
        "second",
        "half",
        "whole",
        "segment",
        "second",
        "first",
        "second",
        "quarter",
        "third",
        "fourth",
        "quarter",
        "general",
        "segment",
        "produced",
        "n",
        "division",
        "either",
        "first",
        "second",
        "half",
        "previous",
        "segment",
        "instance",
        "writing",
        "segment",
        "endpoint",
        "a",
        "b",
        "b",
        "collection",
        "technically",
        "known",
        "chain",
        "since",
        "element",
        "collection",
        "ordered",
        "size",
        "would",
        "start",
        "ldots",
        "argued",
        "zeno",
        "division",
        "produced",
        "uncountably",
        "many",
        "piece",
        "object",
        "said",
        "carefully",
        "produce",
        "uncountably",
        "many",
        "chain",
        "like",
        "question",
        "part",
        "division",
        "pick",
        "question",
        "part",
        "given",
        "chain",
        "pick",
        "natural",
        "say",
        "chain",
        "pick",
        "part",
        "line",
        "contained",
        "every",
        "one",
        "element",
        "consider",
        "instance",
        "chain",
        "ldots",
        "word",
        "chain",
        "start",
        "left",
        "half",
        "line",
        "every",
        "element",
        "right",
        "half",
        "previous",
        "one",
        "halfway",
        "point",
        "every",
        "one",
        "segment",
        "chain",
        "righthand",
        "endpoint",
        "one",
        "point",
        "element",
        "clearly",
        "point",
        "beyond",
        "halfway",
        "pick",
        "point",
        "p",
        "halfway",
        "take",
        "right",
        "half",
        "enough",
        "time",
        "lefthand",
        "end",
        "segment",
        "right",
        "p",
        "thus",
        "part",
        "line",
        "element",
        "chain",
        "halfway",
        "point",
        "part",
        "line",
        "picked",
        "chain",
        "fact",
        "follows",
        "postulate",
        "number",
        "theory",
        "exactly",
        "one",
        "point",
        "member",
        "chain",
        "common",
        "problem",
        "parallel",
        "reasoning",
        "halfway",
        "point",
        "also",
        "picked",
        "distinct",
        "chain",
        "ldots",
        "segment",
        "first",
        "left",
        "half",
        "preceding",
        "one",
        "chain",
        "pick",
        "piece",
        "line",
        "halfway",
        "point",
        "many",
        "pair",
        "chain",
        "thus",
        "zeno",
        "argument",
        "interpreted",
        "term",
        "repeated",
        "division",
        "part",
        "half",
        "divide",
        "line",
        "distinct",
        "part",
        "hence",
        "think",
        "object",
        "composed",
        "way",
        "line",
        "follows",
        "despite",
        "appearance",
        "version",
        "argument",
        "cut",
        "object",
        "part",
        "whose",
        "total",
        "size",
        "properly",
        "discus",
        "might",
        "think",
        "problem",
        "could",
        "fixed",
        "taking",
        "element",
        "chain",
        "segment",
        "endpoint",
        "right",
        "first",
        "two",
        "chain",
        "considered",
        "longer",
        "halfway",
        "point",
        "segment",
        "pick",
        "point",
        "problem",
        "fails",
        "pick",
        "part",
        "line",
        "previous",
        "reasoning",
        "showed",
        "pick",
        "point",
        "greater",
        "le",
        "halfway",
        "point",
        "pick",
        "point",
        "either"
    ]
}