{
    "main_text": "What Makes Simpson’s Paradox Paradoxical?\n4. What Makes Simpson’s Paradox Paradoxical?\n\nSimpson’s Paradox is not a paradox in the sense of presenting an\ninconsistent set of plausible propositions of which at least one must\nbe rejected. As shown in\n Section 2.2,\n mathematics does not rule out associations to be reversed at the\nlevel of subpopulations. Bandyopadhyay et al. (2011) helpfully\ndistinguish between three questions one could ask about\nSimpson’s Paradox:\n\nWhy or in what sense is Simpson’s Paradox a paradox?\nWhat is the proper analysis of the paradox?\nHow one should proceed when confronted with a typical case of the\nparadox?\n\n\nQuestion (i) is essentially a question about the psychology of\nreasoning: one must offer an account of why the (mathematically\ninnocent) association reversals seem paradoxical to many. Such\naccounts help to identify valid forms of inference that leads\nindividuals to mistakenly rule out association reversals, and thereby\nprovide answers to question (ii). Such analyses can differentiate\namong subtly different forms of reasoning, and open the door to\nempirical work testing whether humans systematically fail to attend to\nparticular differences.\n\nSection 3.4\n already presented one analysis of the paradox. On Pearl’s\ncausal analysis, the appearance of a paradox results\nfrom a conflation between causal and probabilistic reasoning.\nIf one interprets the claim that taking the drug raises the\nprobability of recovery as the causal statement that intervening to\ngive the drug will make patients more likely to recover, and plausibly\nassumes that taking the drug has no influence on gender, then the drug\ncannot lower the probability of recovery both among males and among\nfemales. But, of course, if one is considering ordinary conditional\nprobabilities without any do-operators, such reversals can occur.\nAccordingly, the appearance of paradox results from conflating\nordinary conditional probabilities with conditional probabilities\nrepresenting the results of interventions.\n\nPearl’s answer to (ii) has immediate implications for (iii). In\nevaluating the relationships between two variables \\(X\\) and \\(Y\\) and\ndetermining whether one should partition based on some variable (or\nvariable set) \\(Z\\), one should partition based on \\(Z\\) only if doing\nso will enable one to identify the causal relationship between\n\\(X\\) and \\(Y\\). This answer presupposes that the aim of\npartitioning the population is to identify causal relationships.\nQuestions about how to proceed in light of the paradox only make sense\ngiven a context and given the kind of inference one wishes to\ndraw.\n\nPearl (2014) presents several reasons supporting his analysis of the\nparadox. First, he argues that were the surprise resulting from the\nparadox to be the result of a mere mathematical error, this could\nneither account for why the paradox “has captured the\nfascination of statisticians, mathematicians, and philosophers for\nover a century” (2014: 9) nor for the difficulty that reasoners\nhave in avoiding the error even once they’ve been made aware of\nit. Only by means of a causal semantics can one demonstrate that\nSimpson’s reversals cannot occur when the conditional\nprobabilities are interpreted causally. Second, he points to\nSimpson’s (1951) observation that judgments about whether the\naggregated or non-aggregated population is relevant for evaluating the\ncorrelations depends on the story behind the what the\nfrequencies represent. Pearl accounts for this story-relativity by\nshowing that whether one should partition a population is decided not\nby the probabilities but rather by the causal model generating the\nprobabilities. These causal models\n\ncannot be distinguished by conditional probabilities alone.\n\nBandyopadhyay et al. (2011) reject Pearl’s causal analysis of\nthe paradox, and defend an alternative mathematical\nexplanation. They note that there can be instances of the\nparadox that do not seem to invoke any causal notions. For example,\nsuppose we take the proportions in Table 1 not to refer to the\nproportions of recovering/non-recovering patients among the\ntreatment/non-treatment groups in male and female populations, but\nrather to the proportions of red and blue marbles among big or small\nmarbles in two bags. Suppose that in either bag the big marbles have a\nhigher red-to-blue ratio than the small marbles. Bandyopadhyay et\nal. plausibly claim that in this case, it would be surprising to\ndiscover that, were we to pour the bags into a single box, the small\nmarbles have a higher red-to-blue ratio than the big ones. If there\nare cases of the paradox that still exhibit surprise despite having\nnothing to do with causality, then the general explanation of the\nparadox cannot be causal.[9]\n\nBandyopadhyay et al. rephrase the paradox as being about ratios and\nproportions: when it is the case that \n\n\n\\[\n\\tag{6}\n\\frac{a_1+b_1}{b_1} \\gt \\frac{c_1+d_1}{d_1} \\quad \\text{and} \\quad \\frac{a_2+b_2}{b_2} \\gt \\frac{c_2+d_2}{d_2}  \n\\]\n\n\n\n—to be read as success proportions for treatment and control in\nthe subpopulations, compare\n Table 2—many\n people expect that these equalities are preserved in the overall\npopulation: \n\n\n\\[\\tag{7}\n\\frac{a_1+a_2+b_1+b_2}{b_1+b_2} > \\frac{c_1+c_2+d_1+d_2}{d_1+d_2}\\]\n\n\n\nAs we know from\n Section 2,\n this need not be the case. Bandyopadhyay et al. conducted a survey\nwith university students on this matter: only 12% give the correct\nanswer that equations\n (6),\n by themselves, do not constrain the truth value of equation\n (7).\n\nGiven the widespread literature revealing how seemingly error-prone\nhumans can be when reasoning about probabilities (e.g., Kahneman,\nSlovic, & Tversky 1982), the proposal that Simpson’s Paradox\ncan be explained by appeal to an error in probabilistic reasoning is\nplausible. Yet Bandyopadhyay et al. do not specify what this error is.\nOr, more specifically, they do not propose a valid form of reasoning\nthat reasoners are mistakenly appealing to when falling prey to the\nparadox. The fact that people expect that the ratios in subpopulations\nto be preserved in the combined population just shows that people are\ntricked by the paradox. It does not illuminate the underlying mistake\nthat they are making when they are tricked. In this sense,\nBandyopadhyay et al. do not answer their second question. They also,\nby their own admission, do not provide a general answer to (iii). They\nview this as a virtue of their account, since they believe that\ndiscussions of (iii) ought to be divorced from discussions of (i) and\n(ii).\n\nRecently, Fitelson (2017) has proposed a\nconfirmation-theoretic explanation of Simpson’s\nParadox. His analysis relies on identifying confirmation with\nincreasing the (subjective) probability of a proposition. Statements\nof the form “evidence \\(\\r{E}\\) confirms hypothesis\n\\(\\r{H}\\)” are, however, usually evaluated with respect to\nbackground knowledge K, and this can lead to ambiguities. In\nparticular, Fitelson distinguishes between the suppositional\nand conjunctive readings of a confirmation statement. In our\nrunning example, these statements would be as follows:\n\n\nSuppositional (\\(\\bf \\r{E}\\) raises the probability of\n\\(\\bf\\r{H}\\) given \\(\\b{K}\\)): If one is female, then\nreceiving treatment increases one’s chance of recovery.\n\nConjunctive (\\(\\bf \\r{E}\\wedge\\b{K}\\) raises the probability\nof \\(\\bf \\r{H}\\)): Being a female treatment-receiver\nincreases one’s chance of recovery.\n\n\nWhile the suppositional and conjunctive reading coincide for some\naccounts of confirmation (e.g., Carnap’s account of degree of\nconfirmation as conditional probability), they can produce different\noutcomes for confirmation as probability-raising. For our\ndata in\n Table 1,\n the suppositional reading is true: if one is in the female\nsubpopulation, receiving treatment rather than being in the control\ngroup increases one’s chances of recovery. On the conjunctive\nreading, however, the statement is false: female treatment-receivers\nare less-likely to recover (12/27) compared to the set of individuals\nwho are either male or did not receive the treatment (16/25). More\nimportantly, while the suppositional reading allows for association\nreversals, on the conjunctive reading it cannot be the case both that\nbeing a female treatment-receiver and being a male treatment-receiver\nraises the probability of recovery, but being a treatment receiver\nsimpliciter does not (Fitelson 2017: 300–302).\n\nFitelson’s confirmation-theoretic explanation of Simpson’s\nParadox is that reasoners are not attentive to the difference between\nthe suppositional and conjunctive readings of confirmation statements\nwhen considering the evidential relevance of learning an\nindividual’s gender. In the conjunctive reading there cannot be\nassociation reversals, and because the suppositional and conjunctive\nreading do not differ for many accounts of confirmation, people\nmistakenly assume that there cannot be such reversals, even when they\nare relying on the suppositional reading.\n\nBoth Bandyopadhyay et al. and Fitelson claim that because the\nformulation of Simpson’s paradox does not itself appeal to\ncausal considerations, it is a preferable to find a non-causal\nexplanation for the paradox. Ultimately, it is an empirical question\nwhether the paradox can be accounted for exclusively by errors in\nprobabilistic reasoning, or, as Pearl suggests, due to a conflation of\ncausal and probabilistic reasoning. One conceptual barrier to\ndisentangling these hypotheses is that there are systematic\nrelationships between causal and probabilistic claims For example,\nwhen the third variable \\(\\r{M}\\) is uncorrelated with treatment \\(T\\)\n(i.e., \\(p(\\r{T}\\mid \\r{M}) = p(\\r{T})\\)), there can be no reversals\n(see also the theorems in\n Section 2.2).\n Does it follow that Simpson’s Paradox has a purely\nprobabilistic explanation? Not necessarily. An alternative hypothesis\nis that the epistemic agent does not have knowledge of the relevant\nconditional probabilities, but does know that \\(M\\) is not a cause of\n\\(T\\) \\((p(\\r{T}\\mid \\do(\\r{M})) = p(\\r{T})\\)), preempting the\noccurrence of association reversals. The question of whether the\nsource of the paradox is causal cannot be resolved purely by appeal to\nthe mathematical conditions under which the it arises. Rather, it\ndepends on substantive psychological hypotheses about the role of\ncausal and probabilistic assumptions in human\n reasoning.[10]\n\nThe empirical evidence on the paradox shows that reasoners find\ntrivariate reasoning (i.e., with a causally relevant third variable)\ngenerally hard and fail to take its role properly into account, even\nif salient cues to its relevance are provided (Fiedler, Walther,\nFreytag, & Nickel 2003). Other studies point to the facilitative\neffect of causal model, statistical training and high motivation\n(Schaller 1992; Waldmann & Hagmayer 1995), but the significant\ndifficulties that reasoners encounter in Simpson-like tasks make it\nunlikely that the question of the right analysis of the paradox will\nsoon be decided empirically.\n",
    "section_title": "4. What Makes Simpson’s Paradox Paradoxical?",
    "entry_title": "Simpson’s Paradox",
    "hierarchy_title": "Simpson’s Paradox || What Makes Simpson’s Paradox Paradoxical?",
    "tokenized_text": [
        "make",
        "simpson",
        "paradox",
        "paradoxical",
        "make",
        "simpson",
        "paradox",
        "paradoxical",
        "simpson",
        "paradox",
        "paradox",
        "sense",
        "presenting",
        "inconsistent",
        "set",
        "plausible",
        "proposition",
        "least",
        "one",
        "must",
        "rejected",
        "shown",
        "section",
        "mathematics",
        "rule",
        "association",
        "reversed",
        "level",
        "subpopulation",
        "bandyopadhyay",
        "et",
        "al",
        "helpfully",
        "distinguish",
        "three",
        "question",
        "one",
        "could",
        "ask",
        "simpson",
        "paradox",
        "sense",
        "simpson",
        "paradox",
        "paradox",
        "proper",
        "analysis",
        "paradox",
        "one",
        "proceed",
        "confronted",
        "typical",
        "case",
        "paradox",
        "question",
        "essentially",
        "question",
        "psychology",
        "reasoning",
        "one",
        "must",
        "offer",
        "account",
        "mathematically",
        "innocent",
        "association",
        "reversal",
        "seem",
        "paradoxical",
        "many",
        "account",
        "help",
        "identify",
        "valid",
        "form",
        "inference",
        "lead",
        "individual",
        "mistakenly",
        "rule",
        "association",
        "reversal",
        "thereby",
        "provide",
        "answer",
        "question",
        "ii",
        "analysis",
        "differentiate",
        "among",
        "subtly",
        "different",
        "form",
        "reasoning",
        "open",
        "door",
        "empirical",
        "work",
        "testing",
        "whether",
        "human",
        "systematically",
        "fail",
        "attend",
        "particular",
        "difference",
        "section",
        "already",
        "presented",
        "one",
        "analysis",
        "paradox",
        "pearl",
        "causal",
        "analysis",
        "appearance",
        "paradox",
        "result",
        "conflation",
        "causal",
        "probabilistic",
        "reasoning",
        "one",
        "interprets",
        "claim",
        "taking",
        "drug",
        "raise",
        "probability",
        "recovery",
        "causal",
        "statement",
        "intervening",
        "give",
        "drug",
        "make",
        "patient",
        "likely",
        "recover",
        "plausibly",
        "assumes",
        "taking",
        "drug",
        "influence",
        "gender",
        "drug",
        "lower",
        "probability",
        "recovery",
        "among",
        "male",
        "among",
        "female",
        "course",
        "one",
        "considering",
        "ordinary",
        "conditional",
        "probability",
        "without",
        "dooperators",
        "reversal",
        "occur",
        "accordingly",
        "appearance",
        "paradox",
        "result",
        "conflating",
        "ordinary",
        "conditional",
        "probability",
        "conditional",
        "probability",
        "representing",
        "result",
        "intervention",
        "pearl",
        "answer",
        "ii",
        "immediate",
        "implication",
        "iii",
        "evaluating",
        "relationship",
        "two",
        "variable",
        "x",
        "y",
        "determining",
        "whether",
        "one",
        "partition",
        "based",
        "variable",
        "variable",
        "set",
        "z",
        "one",
        "partition",
        "based",
        "z",
        "enable",
        "one",
        "identify",
        "causal",
        "relationship",
        "x",
        "y",
        "answer",
        "presupposes",
        "aim",
        "partitioning",
        "population",
        "identify",
        "causal",
        "relationship",
        "question",
        "proceed",
        "light",
        "paradox",
        "make",
        "sense",
        "given",
        "context",
        "given",
        "kind",
        "inference",
        "one",
        "wish",
        "draw",
        "pearl",
        "present",
        "several",
        "reason",
        "supporting",
        "analysis",
        "paradox",
        "first",
        "argues",
        "surprise",
        "resulting",
        "paradox",
        "result",
        "mere",
        "mathematical",
        "error",
        "could",
        "neither",
        "account",
        "paradox",
        "captured",
        "fascination",
        "statistician",
        "mathematician",
        "philosopher",
        "century",
        "difficulty",
        "reasoner",
        "avoiding",
        "error",
        "even",
        "made",
        "aware",
        "mean",
        "causal",
        "semantics",
        "one",
        "demonstrate",
        "simpson",
        "reversal",
        "occur",
        "conditional",
        "probability",
        "interpreted",
        "causally",
        "second",
        "point",
        "simpson",
        "observation",
        "judgment",
        "whether",
        "aggregated",
        "nonaggregated",
        "population",
        "relevant",
        "evaluating",
        "correlation",
        "depends",
        "story",
        "behind",
        "frequency",
        "represent",
        "pearl",
        "account",
        "storyrelativity",
        "showing",
        "whether",
        "one",
        "partition",
        "population",
        "decided",
        "probability",
        "rather",
        "causal",
        "model",
        "generating",
        "probability",
        "causal",
        "model",
        "distinguished",
        "conditional",
        "probability",
        "alone",
        "bandyopadhyay",
        "et",
        "al",
        "reject",
        "pearl",
        "causal",
        "analysis",
        "paradox",
        "defend",
        "alternative",
        "mathematical",
        "explanation",
        "note",
        "instance",
        "paradox",
        "seem",
        "invoke",
        "causal",
        "notion",
        "example",
        "suppose",
        "take",
        "proportion",
        "table",
        "refer",
        "proportion",
        "recoveringnonrecovering",
        "patient",
        "among",
        "treatmentnontreatment",
        "group",
        "male",
        "female",
        "population",
        "rather",
        "proportion",
        "red",
        "blue",
        "marble",
        "among",
        "big",
        "small",
        "marble",
        "two",
        "bag",
        "suppose",
        "either",
        "bag",
        "big",
        "marble",
        "higher",
        "redtoblue",
        "ratio",
        "small",
        "marble",
        "bandyopadhyay",
        "et",
        "al",
        "plausibly",
        "claim",
        "case",
        "would",
        "surprising",
        "discover",
        "pour",
        "bag",
        "single",
        "box",
        "small",
        "marble",
        "higher",
        "redtoblue",
        "ratio",
        "big",
        "one",
        "case",
        "paradox",
        "still",
        "exhibit",
        "surprise",
        "despite",
        "nothing",
        "causality",
        "general",
        "explanation",
        "paradox",
        "causal",
        "bandyopadhyay",
        "et",
        "al",
        "rephrase",
        "paradox",
        "ratio",
        "proportion",
        "case",
        "tag",
        "frac",
        "a_b_",
        "b_",
        "gt",
        "frac",
        "c_d_",
        "d_",
        "quad",
        "text",
        "quad",
        "frac",
        "a_b_",
        "b_",
        "gt",
        "frac",
        "c_d_",
        "d_",
        "to",
        "read",
        "success",
        "proportion",
        "treatment",
        "control",
        "subpopulation",
        "compare",
        "table",
        "many",
        "people",
        "expect",
        "equality",
        "preserved",
        "overall",
        "population",
        "tag",
        "frac",
        "a_a_b_b_",
        "b_b_",
        "frac",
        "c_c_d_d_",
        "d_d_",
        "know",
        "section",
        "need",
        "case",
        "bandyopadhyay",
        "et",
        "al",
        "conducted",
        "survey",
        "university",
        "student",
        "matter",
        "give",
        "correct",
        "answer",
        "equation",
        "constrain",
        "truth",
        "value",
        "equation",
        "given",
        "widespread",
        "literature",
        "revealing",
        "seemingly",
        "errorprone",
        "human",
        "reasoning",
        "probability",
        "eg",
        "kahneman",
        "slovic",
        "tversky",
        "proposal",
        "simpson",
        "paradox",
        "explained",
        "appeal",
        "error",
        "probabilistic",
        "reasoning",
        "plausible",
        "yet",
        "bandyopadhyay",
        "et",
        "al",
        "specify",
        "error",
        "specifically",
        "propose",
        "valid",
        "form",
        "reasoning",
        "reasoner",
        "mistakenly",
        "appealing",
        "falling",
        "prey",
        "paradox",
        "fact",
        "people",
        "expect",
        "ratio",
        "subpopulation",
        "preserved",
        "combined",
        "population",
        "show",
        "people",
        "tricked",
        "paradox",
        "illuminate",
        "underlying",
        "mistake",
        "making",
        "tricked",
        "sense",
        "bandyopadhyay",
        "et",
        "al",
        "answer",
        "second",
        "question",
        "also",
        "admission",
        "provide",
        "general",
        "answer",
        "iii",
        "view",
        "virtue",
        "account",
        "since",
        "believe",
        "discussion",
        "iii",
        "ought",
        "divorced",
        "discussion",
        "ii",
        "recently",
        "fitelson",
        "proposed",
        "confirmationtheoretic",
        "explanation",
        "simpson",
        "paradox",
        "analysis",
        "relies",
        "identifying",
        "confirmation",
        "increasing",
        "subjective",
        "probability",
        "proposition",
        "statement",
        "form",
        "evidence",
        "r",
        "e",
        "confirms",
        "hypothesis",
        "r",
        "h",
        "however",
        "usually",
        "evaluated",
        "respect",
        "background",
        "knowledge",
        "k",
        "lead",
        "ambiguity",
        "particular",
        "fitelson",
        "distinguishes",
        "suppositional",
        "conjunctive",
        "reading",
        "confirmation",
        "statement",
        "running",
        "example",
        "statement",
        "would",
        "follows",
        "suppositional",
        "bf",
        "r",
        "e",
        "raise",
        "probability",
        "bfr",
        "h",
        "given",
        "b",
        "k",
        "one",
        "female",
        "receiving",
        "treatment",
        "increase",
        "one",
        "chance",
        "recovery",
        "conjunctive",
        "bf",
        "r",
        "e",
        "wedgeb",
        "k",
        "raise",
        "probability",
        "bf",
        "r",
        "h",
        "female",
        "treatmentreceiver",
        "increase",
        "one",
        "chance",
        "recovery",
        "suppositional",
        "conjunctive",
        "reading",
        "coincide",
        "account",
        "confirmation",
        "eg",
        "carnap",
        "account",
        "degree",
        "confirmation",
        "conditional",
        "probability",
        "produce",
        "different",
        "outcome",
        "confirmation",
        "probabilityraising",
        "data",
        "table",
        "suppositional",
        "reading",
        "true",
        "one",
        "female",
        "subpopulation",
        "receiving",
        "treatment",
        "rather",
        "control",
        "group",
        "increase",
        "one",
        "chance",
        "recovery",
        "conjunctive",
        "reading",
        "however",
        "statement",
        "false",
        "female",
        "treatmentreceivers",
        "lesslikely",
        "recover",
        "compared",
        "set",
        "individual",
        "either",
        "male",
        "receive",
        "treatment",
        "importantly",
        "suppositional",
        "reading",
        "allows",
        "association",
        "reversal",
        "conjunctive",
        "reading",
        "case",
        "female",
        "treatmentreceiver",
        "male",
        "treatmentreceiver",
        "raise",
        "probability",
        "recovery",
        "treatment",
        "receiver",
        "simpliciter",
        "fitelson",
        "fitelson",
        "confirmationtheoretic",
        "explanation",
        "simpson",
        "paradox",
        "reasoner",
        "attentive",
        "difference",
        "suppositional",
        "conjunctive",
        "reading",
        "confirmation",
        "statement",
        "considering",
        "evidential",
        "relevance",
        "learning",
        "individual",
        "gender",
        "conjunctive",
        "reading",
        "association",
        "reversal",
        "suppositional",
        "conjunctive",
        "reading",
        "differ",
        "many",
        "account",
        "confirmation",
        "people",
        "mistakenly",
        "assume",
        "reversal",
        "even",
        "relying",
        "suppositional",
        "reading",
        "bandyopadhyay",
        "et",
        "al",
        "fitelson",
        "claim",
        "formulation",
        "simpson",
        "paradox",
        "appeal",
        "causal",
        "consideration",
        "preferable",
        "find",
        "noncausal",
        "explanation",
        "paradox",
        "ultimately",
        "empirical",
        "question",
        "whether",
        "paradox",
        "accounted",
        "exclusively",
        "error",
        "probabilistic",
        "reasoning",
        "pearl",
        "suggests",
        "due",
        "conflation",
        "causal",
        "probabilistic",
        "reasoning",
        "one",
        "conceptual",
        "barrier",
        "disentangling",
        "hypothesis",
        "systematic",
        "relationship",
        "causal",
        "probabilistic",
        "claim",
        "example",
        "third",
        "variable",
        "r",
        "uncorrelated",
        "treatment",
        "t",
        "ie",
        "p",
        "r",
        "mid",
        "r",
        "p",
        "r",
        "reversal",
        "see",
        "also",
        "theorem",
        "section",
        "follow",
        "simpson",
        "paradox",
        "purely",
        "probabilistic",
        "explanation",
        "necessarily",
        "alternative",
        "hypothesis",
        "epistemic",
        "agent",
        "knowledge",
        "relevant",
        "conditional",
        "probability",
        "know",
        "m",
        "cause",
        "t",
        "p",
        "r",
        "mid",
        "do",
        "r",
        "p",
        "r",
        "preempting",
        "occurrence",
        "association",
        "reversal",
        "question",
        "whether",
        "source",
        "paradox",
        "causal",
        "resolved",
        "purely",
        "appeal",
        "mathematical",
        "condition",
        "arises",
        "rather",
        "depends",
        "substantive",
        "psychological",
        "hypothesis",
        "role",
        "causal",
        "probabilistic",
        "assumption",
        "human",
        "reasoning",
        "empirical",
        "evidence",
        "paradox",
        "show",
        "reasoner",
        "find",
        "trivariate",
        "reasoning",
        "ie",
        "causally",
        "relevant",
        "third",
        "variable",
        "generally",
        "hard",
        "fail",
        "take",
        "role",
        "properly",
        "account",
        "even",
        "salient",
        "cue",
        "relevance",
        "provided",
        "fiedler",
        "walther",
        "freytag",
        "nickel",
        "study",
        "point",
        "facilitative",
        "effect",
        "causal",
        "model",
        "statistical",
        "training",
        "high",
        "motivation",
        "schaller",
        "waldmann",
        "hagmayer",
        "significant",
        "difficulty",
        "reasoner",
        "encounter",
        "simpsonlike",
        "task",
        "make",
        "unlikely",
        "question",
        "right",
        "analysis",
        "paradox",
        "soon",
        "decided",
        "empirically"
    ]
}