{
    "main_text": "Theory of Knowledge\n4. Theory of Knowledge\n\n\nPascal did not publish an explicit theory of knowledge or philosophy\nof science in any single text. One can infer from disparate\nworks—such as his essays on the vacuum (written during the late\n1640s), De l'esprit géométrique (1655), and\nthe Entretien avec M. de Sacy (published\nposthumously)—that he had conflicting intuitions about natural\nknowledge, although they all recognise the special role of religious\nbelief. The Provincial Letters provide a statement of his\ngeneral overview: “How do we learn the truth about facts?  That\nwill be from our eyes … which are the appropriate judges of\nfact, as reason is of natural and intelligible things, and the faith\nis of things that are supernatural and revealed” (I,\n810). ‘The faith’ is not simply any religious faith; it is\nthe specific kind of belief to which Roman Catholics had access as a\ngift from God. Apart from faith, which is directed to revealed truths\nand the supernatural world, Pascal identified ‘experience and\nreason’ (I, 454) as the only ways of acquiring knowledge of the\nnatural world.\n\n\nThe scientific and theological controversies in which Pascal became\ninvolved engaged him in epistemological disputes that were both\ncommonplace and unresolved in the seventeenth century. These included\nquestions about observations or experiments as sources of evidence,\nthe certainty or otherwise of various types of knowledge claim, and\nthe epistemic status of hypotheses that are constructed to explain\nnatural phenomena.\n\n\nPascal was sympathetic to the mild, comprehensive pyrrhonism that is\nfound in Montaigne: “Montaigne is incomparable … for\ndisabusing those who cling to their opinions and who believe that they\nhave found unshakeable truths in the sciences”\n(Entretien: II, 97). Despite this tendency towards\nscepticism, Pascal frequently expressed confidence in the certainty\nwith which we can know ‘matters of fact.’ For example, he\nargued in the Provincial Letters that “matters of fact\nare proved only by the senses” and that they are “easily\ndecided” (I, 812, 723). This was consistent with one of the main\nlines of argument in the Letters. Pascal's\ndefence of Arnauld hinged on the claim that the five propositions\ncondemned by the Pope as heretical did not occur in the text of\nAugustinus, and that this fact could be established easily by\ninspection, i.e. by reading the book. On questions of fact, therefore,\neven the Pope (who, Pascal accepted, was an authoritative teacher of\nrevealed truths) could be mistaken, and it is inappropriate to appeal\nto any authority apart from one's senses to decide a factual question:\n‘authority is useless in that context’ (Preface to\nthe Traité du vide: I, 452). The same kind of\ncertainty about experimental facts, he thought, should have resolved\nthe dispute about heliocentrisim that led to Galileo's house\narrest. “It was in vain” therefore that the Jesuits\n“obtained from Rome a decree against Galileo … That is\nnot what will prove that the earth does not move; and if one had\nunchanging observations that proved that the earth revolves, all the\nmen in the world could not stop it moving” (Provincial\nLetters: I, 813).\n\n\nEven if facts could be known with certainty by observation, Pascal\nconceded that it would require the use of reason to understand or\nexplain natural phenomena, and that “the secrets of nature are\nhidden” (Preface to the Traité du vide: I, 455).\nTo penetrate those secrets, one has to have recourse to hypotheses.\nPascal's account of how hypotheses are confirmed, and the degree of\ncertainty that one could claim for them, were ambivalent. When\nreflecting on the results of the puy-de-Dôme experiment, he\nargued against critics that not only had he established that the\nmercury rises in a barometer because of the weight of the air, but\nthat the empty space at the top of a barometric tube is a\nvacuum. Others (including Descartes) accepted the experimental\nresults, but disputed this interpretation of them. They agreed that\nmercury is supported in a barometer by the weight of the atmosphere;\nthey also argued, however, that the apparently empty space in a\nbarometric tube contains a subtle matter of some kind, that it has\nphysical properties (for example, a specific size, or the capacity to\nbe penetrated by light, etc.), and that their interpretation of the\napparent vacuum was as consistent as Pascal's with the experimental\nresults.\n\n\nPascal's analysis of arguments that originate from hypotheses seems to\nhave been borrowed from mathematics. He argued that there are three\ntypes of hypothesis. The negation of some hypotheses implies an absurd\nconsequence, and they must therefore be true. The affirmation of\nothers implies an absurdity, and these must be false. In a third\ncategory, if no absurd conclusion results from either the affirmation\nor negation of an hypothesis, one cannot draw any valid conclusion\nabout its truth. Logically, different assumptions may “lead to\nthe same conclusion, for everyone knows that truth is often concluded\nfrom falsehood” (Entretien: II, 90). When applied to\nexperimental situations, it meant that one could get apparently\nconfirming results from a poorly executed experiment or one that is\nbased on a mistaken hypothesis. Accordingly, even the phenomenal\nsuccess of the puy-de-Dôme experiment did not show conclusively\nthat Pascal was correct about the vacuum. On the other hand, Pascal\nimplicitly assumed that a negative experimental result would have\ndisconfirmed the hypothesis that his experiment was designed to test\nbecause, by analogy with the claim that ‘absurd’\nconsequences disconfirm mathematical hypotheses, he failed to realize\nthat scientific experiments test clusters of interconnected hypotheses\nrather than individual hypotheses. The Duhem-Quine thesis, as it is\nknown today, shows that negative experimental results may be\nattributed to any of the many hypotheses that are assumed in\nobservations or experiments, and that the certainty to which Pascal\naspired cannot be realized even when experimental results are\ninconsistent with expectations.\n\n\nThis analysis left unresolved the status of scientific hypotheses.\nDo hypotheses provide genuine knowledge, despite their uncertainty? Or\ndid Pascal anticipate the solution later adopted by Locke and restrict\ngenuine knowledge to two categories: (a) what is perceived, and (b)\nwhat is ‘demonstrated’? De l'esprit\ngéométrique adopts a foundationalist perspective on\nknowledge, in which ‘principles’ are first established and\nthe certainty of other knowledge-claims derives from that of the\nprinciples. Such logically interconnected principles and conclusions\nwere called ‘demonstrations’. Thus every demonstration\nrequires that one first identify “the evident principles that it\nrequires. For, if one does not guarantee the foundations, one cannot\nguarantee the building” (II, 175). One establishes the\ncertainty of propositions if they are “deducible by infallible\nand necessary logical steps from such axioms or principles, on the\ncertitude of which depends all the certitude of the consequences that\nare properly deduced from them” (letter to Father Noël: I,\n378). This invites the question: does physical science provide\ndemonstrations in this sense? Pascal limited\n‘demonstration’ to mathematics and ‘whatever imitates\nit’ (II, 180). At the same time, he seems to have believed that\nhis own physical investigations were sufficiently similar to\nmathematics that they amounted to demonstrated knowledge, and that\nexperiments or observations provided their foundational principles.\n\n\nAccordingly, Pascal's preface to the Traité du vide\n(1651) claims: “the experiments that provide us with an\nunderstanding of nature continually proliferate; and, since they are\nthe only principles of physics, their consequences proliferate\naccordingly” (I, 455). The certainty of experimental results\nbased on observation, their role as principles of a scientific\ndemonstration, and the facility with which natural philosophers could\nperform appropriate experiments or make relevant observations, led\nPascal to an optimistic interpretation of scientific progress. He\nclaimed that, when researchers work together, they “make\ncontinual progress in science in proportion as the world gets\nolder” (I, 456). This apparently bright future for physical\nsciences contrasted with the scientific failure of earlier natural\nphilosophers, “those timid people who did not dare to discover\nanything in physics” (Preface to the Traité du\nvide: I, 454) and is reflected in the comment in the\nPensées, Fragment 654: “To what extent have\ntelescopes revealed realities to us that did not exist for earlier\nphilosophers?” (II, 807).\n\n\nIn summary, Pascal adopted an interpretation of natural science that\nexaggerated both the ease with which the consequences of observations\nand experiments could be determined, and the simplicity of the logical\nlinks between theories or hypotheses and their apparently confirming\nor disconfirming evidence.\n\n\nIn contrast with all knowledge that is derived from experience and\nreason, Pascal identified ‘authority’ as the exclusive\nfoundation of religious belief. Authority depends on memory and is\npurely historical, because the objective is simply to find out what\nsomeone said or wrote. This applies ‘especially in\ntheology’ (Preface to the Traité du vide: I,\n452), a discipline which Pascal presents as if there could be no\ndispute about what is revealed in the scriptures or, more\nfundamentally, about whether a particular writing belongs among the\ncanonical texts. He could not have avoided noticing that there were\nmany religious traditions that claimed to report divine revelations,\nand that each in turn rested its claims on its own authority as a\nreliable witness to earlier historical events and their\ninterpretation. This was apparent even with Christianity and, within\nCatholicism, Pascal was familiar with decisions of church Councils\nthat determined which interpretations of its doctrinal history were\nacceptable and which were anathemized as heretical. Thus the history\nof churches was rife with disputes about how to identify the\nappropriate religious authorities. Since Pascal rejected the validity\nof rational arguments as a criterion for distinguishing between what\nwas authentic or otherwise in Christian belief, he had to rely\nultimately on a personal choice of what to believe about the\nsupernatural, and then to interpret that personal choice as if it were\ninspired by a special grace from God.\n\n\nIt seems evident that the circularity of Pascal's\nself-justification could be repeated, with appropriate changes, by\nequally committed members of other religious traditions.\n",
    "section_title": "4. Theory of Knowledge",
    "entry_title": "Blaise Pascal",
    "hierarchy_title": "Blaise Pascal || Theory of Knowledge",
    "tokenized_text": [
        "theory",
        "knowledge",
        "theory",
        "knowledge",
        "pascal",
        "publish",
        "explicit",
        "theory",
        "knowledge",
        "philosophy",
        "science",
        "single",
        "text",
        "one",
        "infer",
        "disparate",
        "workssuch",
        "essay",
        "vacuum",
        "written",
        "late",
        "s",
        "de",
        "lesprit",
        "géométrique",
        "entretien",
        "avec",
        "m",
        "de",
        "sacy",
        "published",
        "posthumously",
        "that",
        "conflicting",
        "intuition",
        "natural",
        "knowledge",
        "although",
        "recognise",
        "special",
        "role",
        "religious",
        "belief",
        "provincial",
        "letter",
        "provide",
        "statement",
        "general",
        "overview",
        "learn",
        "truth",
        "fact",
        "eye",
        "appropriate",
        "judge",
        "fact",
        "reason",
        "natural",
        "intelligible",
        "thing",
        "faith",
        "thing",
        "supernatural",
        "revealed",
        "faith",
        "simply",
        "religious",
        "faith",
        "specific",
        "kind",
        "belief",
        "roman",
        "catholic",
        "access",
        "gift",
        "god",
        "apart",
        "faith",
        "directed",
        "revealed",
        "truth",
        "supernatural",
        "world",
        "pascal",
        "identified",
        "experience",
        "reason",
        "way",
        "acquiring",
        "knowledge",
        "natural",
        "world",
        "scientific",
        "theological",
        "controversy",
        "pascal",
        "became",
        "involved",
        "engaged",
        "epistemological",
        "dispute",
        "commonplace",
        "unresolved",
        "seventeenth",
        "century",
        "included",
        "question",
        "observation",
        "experiment",
        "source",
        "evidence",
        "certainty",
        "otherwise",
        "various",
        "type",
        "knowledge",
        "claim",
        "epistemic",
        "status",
        "hypothesis",
        "constructed",
        "explain",
        "natural",
        "phenomenon",
        "pascal",
        "sympathetic",
        "mild",
        "comprehensive",
        "pyrrhonism",
        "found",
        "montaigne",
        "montaigne",
        "incomparable",
        "disabusing",
        "cling",
        "opinion",
        "believe",
        "found",
        "unshakeable",
        "truth",
        "science",
        "entretien",
        "ii",
        "despite",
        "tendency",
        "towards",
        "scepticism",
        "pascal",
        "frequently",
        "expressed",
        "confidence",
        "certainty",
        "know",
        "matter",
        "fact",
        "example",
        "argued",
        "provincial",
        "letter",
        "matter",
        "fact",
        "proved",
        "sens",
        "easily",
        "decided",
        "consistent",
        "one",
        "main",
        "line",
        "argument",
        "letter",
        "pascal",
        "s",
        "defence",
        "arnauld",
        "hinged",
        "claim",
        "five",
        "proposition",
        "condemned",
        "pope",
        "heretical",
        "occur",
        "text",
        "augustinus",
        "fact",
        "could",
        "established",
        "easily",
        "inspection",
        "ie",
        "reading",
        "book",
        "question",
        "fact",
        "therefore",
        "even",
        "pope",
        "pascal",
        "accepted",
        "authoritative",
        "teacher",
        "revealed",
        "truth",
        "could",
        "mistaken",
        "inappropriate",
        "appeal",
        "authority",
        "apart",
        "one",
        "s",
        "sens",
        "decide",
        "factual",
        "question",
        "authority",
        "useless",
        "context",
        "preface",
        "traité",
        "du",
        "vide",
        "kind",
        "certainty",
        "experimental",
        "fact",
        "thought",
        "resolved",
        "dispute",
        "heliocentrisim",
        "led",
        "galileo",
        "s",
        "house",
        "arrest",
        "vain",
        "therefore",
        "jesuit",
        "obtained",
        "rome",
        "decree",
        "galileo",
        "prove",
        "earth",
        "move",
        "one",
        "unchanging",
        "observation",
        "proved",
        "earth",
        "revolves",
        "men",
        "world",
        "could",
        "stop",
        "moving",
        "provincial",
        "letter",
        "even",
        "fact",
        "could",
        "known",
        "certainty",
        "observation",
        "pascal",
        "conceded",
        "would",
        "require",
        "use",
        "reason",
        "understand",
        "explain",
        "natural",
        "phenomenon",
        "secret",
        "nature",
        "hidden",
        "preface",
        "traité",
        "du",
        "vide",
        "penetrate",
        "secret",
        "one",
        "recourse",
        "hypothesis",
        "pascal",
        "s",
        "account",
        "hypothesis",
        "confirmed",
        "degree",
        "certainty",
        "one",
        "could",
        "claim",
        "ambivalent",
        "reflecting",
        "result",
        "puydedôme",
        "experiment",
        "argued",
        "critic",
        "established",
        "mercury",
        "rise",
        "barometer",
        "weight",
        "air",
        "empty",
        "space",
        "top",
        "barometric",
        "tube",
        "vacuum",
        "others",
        "including",
        "descartes",
        "accepted",
        "experimental",
        "result",
        "disputed",
        "interpretation",
        "agreed",
        "mercury",
        "supported",
        "barometer",
        "weight",
        "atmosphere",
        "also",
        "argued",
        "however",
        "apparently",
        "empty",
        "space",
        "barometric",
        "tube",
        "contains",
        "subtle",
        "matter",
        "kind",
        "physical",
        "property",
        "example",
        "specific",
        "size",
        "capacity",
        "penetrated",
        "light",
        "etc",
        "interpretation",
        "apparent",
        "vacuum",
        "consistent",
        "pascal",
        "s",
        "experimental",
        "result",
        "pascal",
        "s",
        "analysis",
        "argument",
        "originate",
        "hypothesis",
        "seems",
        "borrowed",
        "mathematics",
        "argued",
        "three",
        "type",
        "hypothesis",
        "negation",
        "hypothesis",
        "implies",
        "absurd",
        "consequence",
        "must",
        "therefore",
        "true",
        "affirmation",
        "others",
        "implies",
        "absurdity",
        "must",
        "false",
        "third",
        "category",
        "absurd",
        "conclusion",
        "result",
        "either",
        "affirmation",
        "negation",
        "hypothesis",
        "one",
        "draw",
        "valid",
        "conclusion",
        "truth",
        "logically",
        "different",
        "assumption",
        "may",
        "lead",
        "conclusion",
        "everyone",
        "know",
        "truth",
        "often",
        "concluded",
        "falsehood",
        "entretien",
        "ii",
        "applied",
        "experimental",
        "situation",
        "meant",
        "one",
        "could",
        "get",
        "apparently",
        "confirming",
        "result",
        "poorly",
        "executed",
        "experiment",
        "one",
        "based",
        "mistaken",
        "hypothesis",
        "accordingly",
        "even",
        "phenomenal",
        "success",
        "puydedôme",
        "experiment",
        "show",
        "conclusively",
        "pascal",
        "correct",
        "vacuum",
        "hand",
        "pascal",
        "implicitly",
        "assumed",
        "negative",
        "experimental",
        "result",
        "would",
        "disconfirmed",
        "hypothesis",
        "experiment",
        "designed",
        "test",
        "analogy",
        "claim",
        "absurd",
        "consequence",
        "disconfirm",
        "mathematical",
        "hypothesis",
        "failed",
        "realize",
        "scientific",
        "experiment",
        "test",
        "cluster",
        "interconnected",
        "hypothesis",
        "rather",
        "individual",
        "hypothesis",
        "duhemquine",
        "thesis",
        "known",
        "today",
        "show",
        "negative",
        "experimental",
        "result",
        "may",
        "attributed",
        "many",
        "hypothesis",
        "assumed",
        "observation",
        "experiment",
        "certainty",
        "pascal",
        "aspired",
        "realized",
        "even",
        "experimental",
        "result",
        "inconsistent",
        "expectation",
        "analysis",
        "left",
        "unresolved",
        "status",
        "scientific",
        "hypothesis",
        "hypothesis",
        "provide",
        "genuine",
        "knowledge",
        "despite",
        "uncertainty",
        "pascal",
        "anticipate",
        "solution",
        "later",
        "adopted",
        "locke",
        "restrict",
        "genuine",
        "knowledge",
        "two",
        "category",
        "perceived",
        "b",
        "demonstrated",
        "de",
        "lesprit",
        "géométrique",
        "adopts",
        "foundationalist",
        "perspective",
        "knowledge",
        "principle",
        "first",
        "established",
        "certainty",
        "knowledgeclaims",
        "derives",
        "principle",
        "logically",
        "interconnected",
        "principle",
        "conclusion",
        "called",
        "demonstration",
        "thus",
        "every",
        "demonstration",
        "requires",
        "one",
        "first",
        "identify",
        "evident",
        "principle",
        "requires",
        "one",
        "guarantee",
        "foundation",
        "one",
        "guarantee",
        "building",
        "ii",
        "one",
        "establishes",
        "certainty",
        "proposition",
        "deducible",
        "infallible",
        "necessary",
        "logical",
        "step",
        "axiom",
        "principle",
        "certitude",
        "depends",
        "certitude",
        "consequence",
        "properly",
        "deduced",
        "letter",
        "father",
        "noël",
        "invite",
        "question",
        "physical",
        "science",
        "provide",
        "demonstration",
        "sense",
        "pascal",
        "limited",
        "demonstration",
        "mathematics",
        "whatever",
        "imitates",
        "ii",
        "time",
        "seems",
        "believed",
        "physical",
        "investigation",
        "sufficiently",
        "similar",
        "mathematics",
        "amounted",
        "demonstrated",
        "knowledge",
        "experiment",
        "observation",
        "provided",
        "foundational",
        "principle",
        "accordingly",
        "pascal",
        "s",
        "preface",
        "traité",
        "du",
        "vide",
        "claim",
        "experiment",
        "provide",
        "u",
        "understanding",
        "nature",
        "continually",
        "proliferate",
        "since",
        "principle",
        "physic",
        "consequence",
        "proliferate",
        "accordingly",
        "certainty",
        "experimental",
        "result",
        "based",
        "observation",
        "role",
        "principle",
        "scientific",
        "demonstration",
        "facility",
        "natural",
        "philosopher",
        "could",
        "perform",
        "appropriate",
        "experiment",
        "make",
        "relevant",
        "observation",
        "led",
        "pascal",
        "optimistic",
        "interpretation",
        "scientific",
        "progress",
        "claimed",
        "researcher",
        "work",
        "together",
        "make",
        "continual",
        "progress",
        "science",
        "proportion",
        "world",
        "get",
        "older",
        "apparently",
        "bright",
        "future",
        "physical",
        "science",
        "contrasted",
        "scientific",
        "failure",
        "earlier",
        "natural",
        "philosopher",
        "timid",
        "people",
        "dare",
        "discover",
        "anything",
        "physic",
        "preface",
        "traité",
        "du",
        "vide",
        "reflected",
        "comment",
        "pensées",
        "fragment",
        "extent",
        "telescope",
        "revealed",
        "reality",
        "u",
        "exist",
        "earlier",
        "philosopher",
        "ii",
        "summary",
        "pascal",
        "adopted",
        "interpretation",
        "natural",
        "science",
        "exaggerated",
        "ease",
        "consequence",
        "observation",
        "experiment",
        "could",
        "determined",
        "simplicity",
        "logical",
        "link",
        "theory",
        "hypothesis",
        "apparently",
        "confirming",
        "disconfirming",
        "evidence",
        "contrast",
        "knowledge",
        "derived",
        "experience",
        "reason",
        "pascal",
        "identified",
        "authority",
        "exclusive",
        "foundation",
        "religious",
        "belief",
        "authority",
        "depends",
        "memory",
        "purely",
        "historical",
        "objective",
        "simply",
        "find",
        "someone",
        "said",
        "wrote",
        "applies",
        "especially",
        "theology",
        "preface",
        "traité",
        "du",
        "vide",
        "discipline",
        "pascal",
        "present",
        "could",
        "dispute",
        "revealed",
        "scripture",
        "fundamentally",
        "whether",
        "particular",
        "writing",
        "belongs",
        "among",
        "canonical",
        "text",
        "could",
        "avoided",
        "noticing",
        "many",
        "religious",
        "tradition",
        "claimed",
        "report",
        "divine",
        "revelation",
        "turn",
        "rested",
        "claim",
        "authority",
        "reliable",
        "witness",
        "earlier",
        "historical",
        "event",
        "interpretation",
        "apparent",
        "even",
        "christianity",
        "within",
        "catholicism",
        "pascal",
        "familiar",
        "decision",
        "church",
        "council",
        "determined",
        "interpretation",
        "doctrinal",
        "history",
        "acceptable",
        "anathemized",
        "heretical",
        "thus",
        "history",
        "church",
        "rife",
        "dispute",
        "identify",
        "appropriate",
        "religious",
        "authority",
        "since",
        "pascal",
        "rejected",
        "validity",
        "rational",
        "argument",
        "criterion",
        "distinguishing",
        "authentic",
        "otherwise",
        "christian",
        "belief",
        "rely",
        "ultimately",
        "personal",
        "choice",
        "believe",
        "supernatural",
        "interpret",
        "personal",
        "choice",
        "inspired",
        "special",
        "grace",
        "god",
        "seems",
        "evident",
        "circularity",
        "pascal",
        "s",
        "selfjustification",
        "could",
        "repeated",
        "appropriate",
        "change",
        "equally",
        "committed",
        "member",
        "religious",
        "tradition"
    ]
}