{
    "main_text": "Ontology\n4. Ontology\n\nPaul’s world consists of finite beings (that is, things like men\nor horses) really existing outside the mind, each made up of a primary\nsubstance and a host of forms existing in it and by it. The forms of a\nprimary substance belong to ten different types of being, or\ncategories. Therefore a finite being cannot be totally identified with\nthe primary substance. (In fact no primary substance contains the\nwhole being of a finite being.) Rather it is an ordered congeries of\ncategorial items. Primary substances are not simple items but complex\nobjects, since they are compounded of particular matter and\nform—a form that is really identical with and formally distinct\nfrom the specific nature itself that the primary substance\ninstantiates (SN, part VI, chap. 1, fols. 92vb–93ra).\nThe concepts of matter and form are relative, since their meanings are\nconnected with each other (In Post., fol. 40rb). Being the\nform of something and being the matter of something are converse\nrelations of three different kinds, whose arguments and values\nare:\n\nthe metaphysical constituents of the individual substance (i.e.\nsingular matter and form);\nthe metaphysical constituents of the specific natures (i.e. genus\nand difference); and\nthe categorial items (i.e. individual and universal substances and\naccidents) considered according to their various degrees of\ngenerality.\n\n\nThe specific nature (or essence) can be conceived from a twofold point\nof view: intensionally (in abstracto) and extensionally\n(in concreto). Intensionally viewed, the specific nature\nsimply expresses the set of essential properties that compose a\ncategorial form, without any reference to the existence of individuals\nwhich, if there are any, instantiate it. Extensionally viewed, the\nspecific nature is that same form conceived of as instantiated by at\nleast one singular entity. For instance, human nature intensionally\nconsidered is humanity (humanitas); extensionally it is man\n(homo) (In Porph., prooem., fol. 9va). Both\nof them are substantial forms superordinated to the whole human\ncompound, but while humanity is properly a form, i.e. something\nexistentially incomplete and dependent, man is an existentially\nautonomous and independent entity. Thus they differ from each other in\nthe same way as a predicate (for example ‘P’)\ndiffers from a formula (for example,\n‘P(x)’).\n\nBecause of the complexity of the metaphysical composition of the\nfinite corporeal being, every creature has four different levels of\nbeing: real, essential, temporal, and individual. Real being is\nnothing but the whole reality of the finite being. Essential being is\nthe mode of being proper to the specific nature that a certain\nsingular directly instantiates. Temporal being is the state of affairs\ndesignated by infinitival expressions like ‘being a man’\n(‘hominem esse’) or ‘being white’\n(‘esse album’)—that is, the object of the\nact of judging. Finally, individual being is the actual existence of\nthe primary substance of a finite being as distinct from the whole\nreality of the finite being itself (SN, part VI, chap. 1,\nfol. 92vb).\n\nPaul asserts the following relationships among these four levels of\nbeing and the essence of a creature: the essence and being of any\ncreature are not really distinct from each other; the essence of a\nthing is formally different from its real being and from its essential\nbeing; the essence and the essential being of a thing are formally\n(ratione) different from temporal and individual beings;\nspecific and generic essences can keep on being even though no\nindividual instantiates them, but in this case they do not have any\nactual existence (esse actuale). From that point of view,\nSocrates being a man (Sortem esse hominem) is in reality\nSocrates himself considered together with all the properties of which\nhe is the bearer. On the other hand, the proposition identifies only\none of these properties, that signified by the predicate-term (in our\nexample the property of being a man), which is formally different from\nthe form (in our example that of humanity) connoted by the\npredicate-term itself (ibidem, fols. 92vb–93ra).\n\nAccording to Paul, who follows Duns Scotus and Wyclif on this subject,\nbeing is univocally shared by everything real, since it is the stuff\nthat the ten categories modulate according to their own essence\n(In Phys., book I, tr. 1, chap. 2, t. c. 13; In\nMetaph., book IV, tr. 1, chap. 1, fols. 122ra–125vb,\npassim; In Porph., chap. De specie, fol.\n22rb). In view of this position, Paul maintains no real distinction\nbetween essence and being (In Metaph., book IV, tr. 1, chap.\n2, fol. 127rb; book VI, chap. 1, fol. 223vb). Like Duns Scotus and\nWyclif, Paul speaks of a formal difference (or difference of reason)\nbetween essence and being in creatures, as the essence and the\nessential being of a thing are one and the same entity considered from\ntwo distinct points of view, intensionally (the essence) and\nextensionally (the being) (SN, part VI, chap. 1, fol.\n93ra).\n\nThis analysis identifies the opposition between essence and being with\nthe opposition between universals and individuals. Like Wyclif, Paul\nthinks of essence as a universal form intensionally considered, and\nexistence (taken in the strict sense) as the mode of being proper to\nprimary substances. Thus, when Paul affirms that essence and being are\nreally identical and formally different, he simply restates the thesis\nof the real identity and formal distinction between universals and\nindividuals that was typical of the Realists of the late Middle Ages.\nConsequently, like Burley and Wyclif, Paul holds that a formal\nuniversal actually (in actu) exists outside our minds only if\nthere is at least one individual that instantiates it, so that without\nindividuals common natures (or essences) are not really universals\n(SN, part VI, chap. 2, fol. 94ra).\n\nThis means that the relationship between common natures and singulars\nis ultimately grounded on individuation, since no actual universality\nand no instantiation is possible without individuation. On this\nsubject Paul successfully reconciles the Scotistic approach with\ncertain Thomistic theses. Paul claims that the principle of\nindividuation is twofold, immanent and remote. The immanent principle\nis the one whose presence necessarily entails the existence of the\nindividual it constitutes, and whose absence necessarily entails the\nnon-existence (or disappearance) of the individual. The remote\nprinciple, on the other hand, is just what the immanent principle\npresupposes, but whose presence and absence alone are insufficient for\ncausing the existence or disappearance of the individual, as it\ncontinues being after the corruption of the individual. Thisness\n(haecceitas) is the immanent principle of individuation,\nwhereas form, matter, and quantity are the remote principle. Thisness\nin turn has a twofold origin, as it derives from matter and form\ntogether in the case of corporeal substances, and as it derives from\nthe essence (quidditas) alone in the case of angelic\nintelligences (SN, part VI, chap. 5, fol. 95vb). Furthermore,\naccording to Paul there is a close similarity between the thisness,\nwhich he now calls individual difference (differentia\nindividualis), and the specific difference. The specific\ndifference is what differentiates the species from the genus, since it\nis the determination or property which, once added to the genus,\nresults in the species. On the other hand, the specific difference is\nreally identical with the genus, from which it is distinct only in\nvirtue of a formal principle. The same happens to the individual\ndifference: it is what differentiates the individual from the species;\nfrom the ontological point of view, it is really identical with and\nformally distinct from the species itself; and it is the formal\nprinciple in virtue of which the individual is what it is, something\nparticular, concrete, and perfectly determined in itself (SN,\npart VI, chap. 5, fol. 96rb; chap. 26, fol. 112rb–va;\nQdU, fol. 128va; fol. 129rb; In Metaph., book III,\ntr. 1, chap. 1, fol. 83vb).\n\nAs far as the problem of angelic individuation is concerned, the\nlogical consequence deriving from such premisses is that it is\nimpossible to find two angels who share the same specific nature and\nare numerically distinct, since only one haecceitas can\nspring up from an incorporeal species (SN, part VI, chap. 5,\nfol. 96ra). This solution is close to the inner meaning of Duns\nScotus’ position and contrasts with Aquinas’ view,\nalthough Paul affirms that the angelic intelligences are specifically,\nand not numerically, different. In fact, according to St. Thomas,\nangels are specifically different because they are incorporeal, and\nwithout matter no individuation is possible. On the contrary, Paul of\nVenice thinks angels are individuated by means of thisnesses, but not\nmultiplied by them, because of the absence of matter, so that there is\nonly one angel per species. Since specific natures of incorporeal\nbeings do not include any reference to matter, only a unique principle\nof individuation (ratio suppositalis) can flow from such\nspecies. As a consequence, no angel is one in number in the strict\nsense of the term (as being one in number necessarily implies the\nactual presence of a multiplicity of things of the same species), even\nthough broadly speaking every angel is one in number, as two (or more)\nangels are, after all, “many things”—but never many\nangels of the same kind (SN, part VI, chap. 5, fol.\n95vb).\n\nIn his last work, the commentary on the Ars Vetus, Paul\nsummarizes his position as follows:\n\nThe individual is the final result of a process of individuation\nwhose starting point is a specific form.\nThe individuation is what differentiates the individual from its\nspecies.\nThe individuation is nothing but the thisness itself.\nThe thisness and the specific form are only formally distinct from\nthe individual they make up (In Porph., chap. De\nspecie, fol. 60ra).\nThe principle of individuation, when causing the passage from the\nlevel of universals to that of singulars, does not play the role of\nform (or act) in relation to the specific nature, but the role of\nmatter (or potency), as it is what the specific form structures\n(In Cat., chap. De substantia, fol. 60ra).\n\n\nIn this way Paul of Venice tried to solve the aporetic aspects of Duns\nScotus’ theory of individuation. Scotus said nothing about the\nproblem of the relation between the thisness and the particular matter\nand form that constitute the individual. The Franciscan master was\nalso silent about a possible identification of the thisness with one\nof the two essential forms of the individual substance, the forma\npartis (for instance, the individual soul) and the forma\ntotius (the human nature). Paul identifies the principle of\nindividuation with the informing act through which the specific nature\nmolds its matter. This identification had been already suggested by\nthe opposition between immanent and remote principles of individuation\ndescribed in the Summa philosophiae naturalis. In fact, all\nthe constituents of the individual compound (matter, form, and\nquantity) had been contrasted with the thisness, which for that reason\ncould not be identified with any of them. Moreover, it is obvious\nthat:\n\nIt is the union of the singular form with its matter that\nestablishes the “birth” of the individual.\nIt is its separation from the matter that establishes the\n“death” of the individual.\nThe union of the singular form with its matter is the necessary\nand sufficient condition for the passage of the specific essence from\nits abstract (or intensional) mode of being to its concrete (or\nextensional) mode of being.\n\n",
    "section_title": "4. Ontology",
    "entry_title": "Paul of Venice",
    "hierarchy_title": "Paul of Venice || Ontology",
    "tokenized_text": [
        "ontology",
        "ontology",
        "paul",
        "world",
        "consists",
        "finite",
        "being",
        "thing",
        "like",
        "men",
        "horse",
        "really",
        "existing",
        "outside",
        "mind",
        "made",
        "primary",
        "substance",
        "host",
        "form",
        "existing",
        "form",
        "primary",
        "substance",
        "belong",
        "ten",
        "different",
        "type",
        "category",
        "therefore",
        "finite",
        "totally",
        "identified",
        "primary",
        "substance",
        "fact",
        "primary",
        "substance",
        "contains",
        "whole",
        "finite",
        "rather",
        "ordered",
        "congeries",
        "categorial",
        "item",
        "primary",
        "substance",
        "simple",
        "item",
        "complex",
        "object",
        "since",
        "compounded",
        "particular",
        "matter",
        "forma",
        "form",
        "really",
        "identical",
        "formally",
        "distinct",
        "specific",
        "nature",
        "primary",
        "substance",
        "instantiates",
        "sn",
        "part",
        "vi",
        "chap",
        "fols",
        "vbra",
        "concept",
        "matter",
        "form",
        "relative",
        "since",
        "meaning",
        "connected",
        "post",
        "fol",
        "rb",
        "form",
        "something",
        "matter",
        "something",
        "converse",
        "relation",
        "three",
        "different",
        "kind",
        "whose",
        "argument",
        "value",
        "metaphysical",
        "constituent",
        "individual",
        "substance",
        "ie",
        "singular",
        "matter",
        "form",
        "metaphysical",
        "constituent",
        "specific",
        "nature",
        "ie",
        "genus",
        "difference",
        "categorial",
        "item",
        "ie",
        "individual",
        "universal",
        "substance",
        "accident",
        "considered",
        "according",
        "various",
        "degree",
        "generality",
        "specific",
        "nature",
        "essence",
        "conceived",
        "twofold",
        "point",
        "view",
        "intensionally",
        "abstracto",
        "extensionally",
        "concreto",
        "intensionally",
        "viewed",
        "specific",
        "nature",
        "simply",
        "express",
        "set",
        "essential",
        "property",
        "compose",
        "categorial",
        "form",
        "without",
        "reference",
        "existence",
        "individual",
        "instantiate",
        "extensionally",
        "viewed",
        "specific",
        "nature",
        "form",
        "conceived",
        "instantiated",
        "least",
        "one",
        "singular",
        "entity",
        "instance",
        "human",
        "nature",
        "intensionally",
        "considered",
        "humanity",
        "humanitas",
        "extensionally",
        "man",
        "homo",
        "porph",
        "prooem",
        "fol",
        "va",
        "substantial",
        "form",
        "superordinated",
        "whole",
        "human",
        "compound",
        "humanity",
        "properly",
        "form",
        "ie",
        "something",
        "existentially",
        "incomplete",
        "dependent",
        "man",
        "existentially",
        "autonomous",
        "independent",
        "entity",
        "thus",
        "differ",
        "way",
        "predicate",
        "example",
        "p",
        "differs",
        "formula",
        "example",
        "p",
        "x",
        "complexity",
        "metaphysical",
        "composition",
        "finite",
        "corporeal",
        "every",
        "creature",
        "four",
        "different",
        "level",
        "real",
        "essential",
        "temporal",
        "individual",
        "real",
        "nothing",
        "whole",
        "reality",
        "finite",
        "essential",
        "mode",
        "proper",
        "specific",
        "nature",
        "certain",
        "singular",
        "directly",
        "instantiates",
        "temporal",
        "state",
        "affair",
        "designated",
        "infinitival",
        "expression",
        "like",
        "man",
        "hominem",
        "esse",
        "white",
        "esse",
        "album",
        "that",
        "object",
        "act",
        "judging",
        "finally",
        "individual",
        "actual",
        "existence",
        "primary",
        "substance",
        "finite",
        "distinct",
        "whole",
        "reality",
        "finite",
        "sn",
        "part",
        "vi",
        "chap",
        "fol",
        "vb",
        "paul",
        "asserts",
        "following",
        "relationship",
        "among",
        "four",
        "level",
        "essence",
        "creature",
        "essence",
        "creature",
        "really",
        "distinct",
        "essence",
        "thing",
        "formally",
        "different",
        "real",
        "essential",
        "essence",
        "essential",
        "thing",
        "formally",
        "ratione",
        "different",
        "temporal",
        "individual",
        "being",
        "specific",
        "generic",
        "essence",
        "keep",
        "even",
        "though",
        "individual",
        "instantiates",
        "case",
        "actual",
        "existence",
        "esse",
        "actuale",
        "point",
        "view",
        "socrates",
        "man",
        "sortem",
        "esse",
        "hominem",
        "reality",
        "socrates",
        "considered",
        "together",
        "property",
        "bearer",
        "hand",
        "proposition",
        "identifies",
        "one",
        "property",
        "signified",
        "predicateterm",
        "example",
        "property",
        "man",
        "formally",
        "different",
        "form",
        "example",
        "humanity",
        "connoted",
        "predicateterm",
        "ibidem",
        "fols",
        "vbra",
        "according",
        "paul",
        "follows",
        "dun",
        "scotus",
        "wyclif",
        "subject",
        "univocally",
        "shared",
        "everything",
        "real",
        "since",
        "stuff",
        "ten",
        "category",
        "modulate",
        "according",
        "essence",
        "phys",
        "book",
        "tr",
        "chap",
        "t",
        "c",
        "metaph",
        "book",
        "iv",
        "tr",
        "chap",
        "fols",
        "ravb",
        "passim",
        "porph",
        "chap",
        "de",
        "specie",
        "fol",
        "rb",
        "view",
        "position",
        "paul",
        "maintains",
        "real",
        "distinction",
        "essence",
        "metaph",
        "book",
        "iv",
        "tr",
        "chap",
        "fol",
        "rb",
        "book",
        "vi",
        "chap",
        "fol",
        "vb",
        "like",
        "dun",
        "scotus",
        "wyclif",
        "paul",
        "speaks",
        "formal",
        "difference",
        "difference",
        "reason",
        "essence",
        "creature",
        "essence",
        "essential",
        "thing",
        "one",
        "entity",
        "considered",
        "two",
        "distinct",
        "point",
        "view",
        "intensionally",
        "essence",
        "extensionally",
        "sn",
        "part",
        "vi",
        "chap",
        "fol",
        "ra",
        "analysis",
        "identifies",
        "opposition",
        "essence",
        "opposition",
        "universal",
        "individual",
        "like",
        "wyclif",
        "paul",
        "think",
        "essence",
        "universal",
        "form",
        "intensionally",
        "considered",
        "existence",
        "taken",
        "strict",
        "sense",
        "mode",
        "proper",
        "primary",
        "substance",
        "thus",
        "paul",
        "affirms",
        "essence",
        "really",
        "identical",
        "formally",
        "different",
        "simply",
        "restates",
        "thesis",
        "real",
        "identity",
        "formal",
        "distinction",
        "universal",
        "individual",
        "typical",
        "realist",
        "late",
        "middle",
        "age",
        "consequently",
        "like",
        "burley",
        "wyclif",
        "paul",
        "hold",
        "formal",
        "universal",
        "actually",
        "actu",
        "exists",
        "outside",
        "mind",
        "least",
        "one",
        "individual",
        "instantiates",
        "without",
        "individual",
        "common",
        "nature",
        "essence",
        "really",
        "universal",
        "sn",
        "part",
        "vi",
        "chap",
        "fol",
        "ra",
        "mean",
        "relationship",
        "common",
        "nature",
        "singular",
        "ultimately",
        "grounded",
        "individuation",
        "since",
        "actual",
        "universality",
        "instantiation",
        "possible",
        "without",
        "individuation",
        "subject",
        "paul",
        "successfully",
        "reconciles",
        "scotistic",
        "approach",
        "certain",
        "thomistic",
        "thesis",
        "paul",
        "claim",
        "principle",
        "individuation",
        "twofold",
        "immanent",
        "remote",
        "immanent",
        "principle",
        "one",
        "whose",
        "presence",
        "necessarily",
        "entail",
        "existence",
        "individual",
        "constitutes",
        "whose",
        "absence",
        "necessarily",
        "entail",
        "nonexistence",
        "disappearance",
        "individual",
        "remote",
        "principle",
        "hand",
        "immanent",
        "principle",
        "presupposes",
        "whose",
        "presence",
        "absence",
        "alone",
        "insufficient",
        "causing",
        "existence",
        "disappearance",
        "individual",
        "continues",
        "corruption",
        "individual",
        "thisness",
        "haecceitas",
        "immanent",
        "principle",
        "individuation",
        "whereas",
        "form",
        "matter",
        "quantity",
        "remote",
        "principle",
        "thisness",
        "turn",
        "twofold",
        "origin",
        "derives",
        "matter",
        "form",
        "together",
        "case",
        "corporeal",
        "substance",
        "derives",
        "essence",
        "quidditas",
        "alone",
        "case",
        "angelic",
        "intelligence",
        "sn",
        "part",
        "vi",
        "chap",
        "fol",
        "vb",
        "furthermore",
        "according",
        "paul",
        "close",
        "similarity",
        "thisness",
        "call",
        "individual",
        "difference",
        "differentia",
        "individualis",
        "specific",
        "difference",
        "specific",
        "difference",
        "differentiates",
        "specie",
        "genus",
        "since",
        "determination",
        "property",
        "added",
        "genus",
        "result",
        "specie",
        "hand",
        "specific",
        "difference",
        "really",
        "identical",
        "genus",
        "distinct",
        "virtue",
        "formal",
        "principle",
        "happens",
        "individual",
        "difference",
        "differentiates",
        "individual",
        "specie",
        "ontological",
        "point",
        "view",
        "really",
        "identical",
        "formally",
        "distinct",
        "specie",
        "formal",
        "principle",
        "virtue",
        "individual",
        "something",
        "particular",
        "concrete",
        "perfectly",
        "determined",
        "sn",
        "part",
        "vi",
        "chap",
        "fol",
        "rb",
        "chap",
        "fol",
        "rbva",
        "qdu",
        "fol",
        "va",
        "fol",
        "rb",
        "metaph",
        "book",
        "iii",
        "tr",
        "chap",
        "fol",
        "vb",
        "far",
        "problem",
        "angelic",
        "individuation",
        "concerned",
        "logical",
        "consequence",
        "deriving",
        "premiss",
        "impossible",
        "find",
        "two",
        "angel",
        "share",
        "specific",
        "nature",
        "numerically",
        "distinct",
        "since",
        "one",
        "haecceitas",
        "spring",
        "incorporeal",
        "specie",
        "sn",
        "part",
        "vi",
        "chap",
        "fol",
        "ra",
        "solution",
        "close",
        "inner",
        "meaning",
        "dun",
        "scotus",
        "position",
        "contrast",
        "aquinas",
        "view",
        "although",
        "paul",
        "affirms",
        "angelic",
        "intelligence",
        "specifically",
        "numerically",
        "different",
        "fact",
        "according",
        "st",
        "thomas",
        "angel",
        "specifically",
        "different",
        "incorporeal",
        "without",
        "matter",
        "individuation",
        "possible",
        "contrary",
        "paul",
        "venice",
        "think",
        "angel",
        "individuated",
        "mean",
        "thisnesses",
        "multiplied",
        "absence",
        "matter",
        "one",
        "angel",
        "per",
        "specie",
        "since",
        "specific",
        "nature",
        "incorporeal",
        "being",
        "include",
        "reference",
        "matter",
        "unique",
        "principle",
        "individuation",
        "ratio",
        "suppositalis",
        "flow",
        "specie",
        "consequence",
        "angel",
        "one",
        "number",
        "strict",
        "sense",
        "term",
        "one",
        "number",
        "necessarily",
        "implies",
        "actual",
        "presence",
        "multiplicity",
        "thing",
        "specie",
        "even",
        "though",
        "broadly",
        "speaking",
        "every",
        "angel",
        "one",
        "number",
        "two",
        "angel",
        "many",
        "thing",
        "but",
        "never",
        "many",
        "angel",
        "kind",
        "sn",
        "part",
        "vi",
        "chap",
        "fol",
        "vb",
        "last",
        "work",
        "commentary",
        "ar",
        "vetus",
        "paul",
        "summarizes",
        "position",
        "follows",
        "individual",
        "final",
        "result",
        "process",
        "individuation",
        "whose",
        "starting",
        "point",
        "specific",
        "form",
        "individuation",
        "differentiates",
        "individual",
        "specie",
        "individuation",
        "nothing",
        "thisness",
        "thisness",
        "specific",
        "form",
        "formally",
        "distinct",
        "individual",
        "make",
        "porph",
        "chap",
        "de",
        "specie",
        "fol",
        "ra",
        "principle",
        "individuation",
        "causing",
        "passage",
        "level",
        "universal",
        "singular",
        "play",
        "role",
        "form",
        "act",
        "relation",
        "specific",
        "nature",
        "role",
        "matter",
        "potency",
        "specific",
        "form",
        "structure",
        "cat",
        "chap",
        "de",
        "substantia",
        "fol",
        "ra",
        "way",
        "paul",
        "venice",
        "tried",
        "solve",
        "aporetic",
        "aspect",
        "dun",
        "scotus",
        "theory",
        "individuation",
        "scotus",
        "said",
        "nothing",
        "problem",
        "relation",
        "thisness",
        "particular",
        "matter",
        "form",
        "constitute",
        "individual",
        "franciscan",
        "master",
        "also",
        "silent",
        "possible",
        "identification",
        "thisness",
        "one",
        "two",
        "essential",
        "form",
        "individual",
        "substance",
        "forma",
        "partis",
        "instance",
        "individual",
        "soul",
        "forma",
        "totius",
        "human",
        "nature",
        "paul",
        "identifies",
        "principle",
        "individuation",
        "informing",
        "act",
        "specific",
        "nature",
        "mold",
        "matter",
        "identification",
        "already",
        "suggested",
        "opposition",
        "immanent",
        "remote",
        "principle",
        "individuation",
        "described",
        "summa",
        "philosophiae",
        "naturalis",
        "fact",
        "constituent",
        "individual",
        "compound",
        "matter",
        "form",
        "quantity",
        "contrasted",
        "thisness",
        "reason",
        "could",
        "identified",
        "moreover",
        "obvious",
        "union",
        "singular",
        "form",
        "matter",
        "establishes",
        "birth",
        "individual",
        "separation",
        "matter",
        "establishes",
        "death",
        "individual",
        "union",
        "singular",
        "form",
        "matter",
        "necessary",
        "sufficient",
        "condition",
        "passage",
        "specific",
        "essence",
        "abstract",
        "intensional",
        "mode",
        "concrete",
        "extensional",
        "mode"
    ]
}