{
    "main_text": "Contemporary Practical Application of Peirce’s Ideas\n16. Significant Students of Peirce\n\n\nDuring the time of Peirce’s teaching logic at Johns Hopkins\nUniversity, that is: during the years from 1879 through 1884, Peirce\nhad a number of students in logic who then went on to establish\nsignificant reputations in their own right. Often mentioned in this\nconnection are John Dewey, Allan Marquand, Christine Ladd-Franklin,\nOscar Howard Mitchell, Benjamin I. Gilman, Fabian Franklin, and \nThorstein Veblen. Here we provide brief descriptions of\nthree of these students, Dewey, Ladd-Franklin, and Mitchell. Of\nnecessity the accounts given here of the work of these students will\nbe extremely brief. It is obvious that full-length accounts of each of\nthem can be given, and in the case of one of them, John Dewey,\nfull-length accounts have, indeed, often been given.\n\n\nWithout a doubt, the best known of all Peirce’s students, even including \nThorstein Veblen, is John Dewey (1859–1952). \nDewey attended Peirce’s logic class at John’s\nHopkins during the years 1882 through 1883. Along with Peirce, Dewey\nunderstood the subject of logic in an extremely broad way, so that the\nsubject in his mind, as well as in Peirce’s mind, comprised the entire\ntopic of the methodology of the exact sciences. It is not surprising,\nthen, that the structure of logic in Dewey’s own works in logic,\nviz. most notably in his book Logic: the Theory of Inquiry\n(1938), is a close approximation of the structure of the scientific\nmethod as Peirce understands it. Recall that for Peirce inquiry begins\nwith an anomalous situation, in which a particular puzzle or set of\npuzzles is elicited from an indeterminate background. Then, by an\nongoing, and in fact ultimately endless, process, hypotheses are\nformulated (abduction) and tested (deduction and induction). so that\nat each iteration of the methodological “loop,” indeterminacy as to\nthe original anomalous situation is successively, though never\ntotally, eliminated. Dewey’s own account of inquiry, especially\ninsofar as Dewey considers it to be the successive elimination of\nindeterminacy, is remarkably akin to Peirce’s account of scientific\nmethodology in action. Of course there are differences. Dewey often\nwrites as though at each stage of development of the method of logic\n(of science) the next stage is more or less already specified; for\nexample, at any stage of indeterminacy, Dewey writes as if the\nrelevant hypothesis or hypotheses to test at the next stage are more\nor less already determined. By contrast, Peirce (although he sometimes\nspeaks this way) more often emphasizes the creative and non-determined\naspect of eliciting/developing hypotheses. Nevertheless, even despite\nthe differences in emphasis from Peirce to Dewey, the similarities\nbetween their positions are unmistakeable.\n\n\nUnlike Dewey, both Christine Ladd and Oscar Howard Mitchell\nconcentrated on formal deductive logic, i.e. mathematical logic,\nrather than on the informal methodology of the sciences. Also unlike\nDewey, Ladd and Mitchell both published articles in the 1883\nvolume Studies in Logic, which was edited by Peirce. Again,\nin his own “Preface” to this volume Peirce singles out\nboth Ladd and Mitchell for commentary and overt praise\n(p. v). To these two students of Peirce we now turn.\n\n\nChristine Ladd, born December 1, 1847, was later (from her marriage to\nFabian Franklin in 1882) known as Christine Ladd-Franklin. Although\nshe is almost unknown today, she was very well-known and\nhighly-regarded as a mathematician, logician, and psychologist from\nthe 1870s until her death on March 5, 1930 at the age of 82. Her\nearliest published work was in mathematics, in the Educational\nTimes of England. Here it attracted the attention of the great\nmathematician J. J. Sylvester, who also published in the \nEducational Times and who in 1876 assumed the position of the\nfirst professor of mathematics at the new Johns Hopkins\nUniversity. (It was Sylvester who hired Peirce in 1879.) On the\nstrength of her already-published work, as known by Sylvester, Ladd\napplied to Johns Hopkins in 1888 to become a graduate student in\nmathematics.  Although, because she was a woman, she could not become\na regular graduate student at Johns Hopkins, still at the ardent and\ninsistent urgings of Sylvester, she was admitted as a special-status\nstudent, and she was even awarded a fellowship to study\nmathematics. She held this fellowship from 1879 until 1882, when she\ncompleted all the requirements for the Ph.D. degree. It was during\nthis period that she became attracted to mathematical logic, and to\nthe teachings on logic of Peirce, with whom she studied\ncarefully. Because of her gender, her status as a student of\nmathematics was recorded only in notes rather than on the usual\nstudent lists. For the same reason, she could not actually be given\nthe Ph.D. degree in 1882, although she was ultimately (but not until\n1926), awarded the Ph.D. degree in mathematics. (Meanwhile, Vassar\nCollege awarded her an LL.D. degree in 1887.) On August 24, 1882, upon\nthe completion of her mathematics fellowship, she married a member of\nthe Johns Hopkins department of mathematics and a fellow-student of\nPeirce’s, Fabian Franklin (b. 1853, d. 1939). Both she and Fabian\nFranklin seem to have stayed closely connected to Peirce until his\ndeath in 1914.\n\n\nAs can be gathered from the foregoing, it was studying with Peirce\nthat focussed Ladd’s attention from mathematics in general to\nmathematical logic (also called symbolic logic) in particular.  Ladd’s\nbest-known, and most-celebrated work was her paper “On the Algebra of\nLogic,” published in Studies in Logic by the members of the Johns\nHopkins University (C. S. Peirce, editor), Little, Brown, 1883,\npp. 17–71. In it, she is (or at least was once) widely regarded\nas having achieved for the first time in history a completely general\nand unified account of the Aristotelian syllogism, including a general\naccount of the differences between valid and invalid\nsyllogisms. (Josiah Royce, for example, held this view of\nLadd-Franklin’s work in logic.) It is thus worth looking in some\ndetail at how she achieves this result through the algebraizing of the\nsyllogism, but here such detail will not be entered into. Basically,\nhowever, we can say that her basic idea is to associate with each\npossible syllogism a certain “triad”. The syllogism is\nvalid if and only if the “triad” is an\n“antilogism,” that is to say, is an inconsistent\n“triad”. Ladd-Franklin wrote on the antilogism as late as\n1928 in volume 37 of Mind, pp. 532–534. Whether or not\nher work is really the first work to unify the theory of the\nsyllogism, and whether or not she ultimately merits the exalted status\nas a logician that Royce assigns to her must remain a task for future\nexploration to determine.\n\n\nIn addition to her major work on the syllogism, equivalently on the\nnotion of the antilogism, Ladd-Franklin as well wrote some of the\nentries in the three-volume work of James Mark Baldwin\n(1861–1934), Dictionary of Philosophy and Psychology,\n1901–1905, for example the entries “syllogism,”\n“symbolic logic,” and “algebra of logic.” In\nfact she was an associate editor of Baldwin’s Dictionary. She\nalso wrote at least one related paper in the Journal of\nPhilosophy, Psychology, and Scientific Method, later named simply\nthe Journal of Philosophy. Her specialty in psychology\nwas the theory of vision, and she early espoused the theory that all\ncolor vision both developed historically and was based on three\nprimary colors, hence three distinct processes of chemical\nreaction. Her writings on the psychology of vision continued to pour\nfirth voluminously, and these continued from the early 1890s through\nat least 1926, when she published a paper on the mysterious visual\nphenomenon known as “blue arcs” in the Proceedings of\nthe National Academy of Sciences.\n\n\n\nPeirce praised O. H. Mitchell as being his very best student in\nlogic. Mitchell was trained as a mathematician even befoe coming to\nJohns Hopkins, and he was especially noted by all those who knew him\nas being extraordinarily meticulous and attentive to detail. He was so\nattentive to exactitude that he was even noted for slowness and\nponderousness in speech. But what was there in Mitchell’s 1883 paper\nthat stimulated Peirce’s high praise? It seems to be closely\nconnected, perhaps identical, with what Peirce praises Mitchell for\naccomplishing in Peirce’s entry in Baldwin’s Dictionary of\nPhilosophy and Psychology, particularly in his article there for\nthe word “dimension.” In the article Peirce credits\nMitchell with having introduced “the concept of a\nmultidimensional logical universe” into exact logic, and Peirce\nclaims that it is one of the “fecund contributions” that\nMitchell made to exact logic. There seem to be two components to the\nidea of a multidimensional logical universe. The first one is simply\nthe idea of multiple quantification in connection with polyadic\npredicates, so that (in modern terminology) we can have propositions\nwith quantifiers occurring within the scope of other quantifiers. That\nMitchell employs a formalism suggestive of this idea is undeniable,\nbut whether he successfully distinguishes (for all x)(there\nexists a y) from (there exists a y)(for\nall x) is very much less than obvious. Moreover, that\nMitchell was the very first logician to have conceived of multiple\nquantification and polyadic predicates seems a bit dubious, especially\nsince by 1870 Peirce himself was already making use of notions for\nwhich multiple quantification and polyadic predicates are\ninvolved. The second component of the idea of a multidimensional\nlogical universe is (again, using modern terminology) the idea that\nthe universe of discourse relevant to one variable might not be the\nsame as the universe of discourse relevant to another\nvariable. Moreover, since the universe of discourse relevant to one\nvariable might be all the times there are, all the places there are,\nall possible situations, or even all possible worlds, it is not\ndifficult (though it is perhaps a bit far-fetched) to connect\nMitchell’s idea of a multidimensional logical universe to the idea of\ntense logic or even modal logic. Whether a careful study of Mitchell’s\nlogical contribution really supports such a reading of Mitchell’s\ncontributions to logic is not as yet clearly determined.\n\n\nClearly, close study of the logical accomplishments of Peirce’s\nnotable students is in order.\n",
    "section_title": "16. Significant Students of Peirce",
    "entry_title": "Charles Sanders Peirce",
    "hierarchy_title": "Charles Sanders Peirce || Contemporary Practical Application of Peirce’s Ideas",
    "tokenized_text": [
        "contemporary",
        "practical",
        "application",
        "peirce",
        "idea",
        "significant",
        "student",
        "peirce",
        "time",
        "peirce",
        "teaching",
        "logic",
        "john",
        "hopkins",
        "university",
        "year",
        "peirce",
        "number",
        "student",
        "logic",
        "went",
        "establish",
        "significant",
        "reputation",
        "right",
        "often",
        "mentioned",
        "connection",
        "john",
        "dewey",
        "allan",
        "marquand",
        "christine",
        "laddfranklin",
        "oscar",
        "howard",
        "mitchell",
        "benjamin",
        "i",
        "gilman",
        "fabian",
        "franklin",
        "thorstein",
        "veblen",
        "provide",
        "brief",
        "description",
        "three",
        "student",
        "dewey",
        "laddfranklin",
        "mitchell",
        "necessity",
        "account",
        "given",
        "work",
        "student",
        "extremely",
        "brief",
        "obvious",
        "fulllength",
        "account",
        "given",
        "case",
        "one",
        "john",
        "dewey",
        "fulllength",
        "account",
        "indeed",
        "often",
        "given",
        "without",
        "doubt",
        "best",
        "known",
        "peirce",
        "student",
        "even",
        "including",
        "thorstein",
        "veblen",
        "john",
        "dewey",
        "dewey",
        "attended",
        "peirce",
        "logic",
        "class",
        "john",
        "hopkins",
        "year",
        "along",
        "peirce",
        "dewey",
        "understood",
        "subject",
        "logic",
        "extremely",
        "broad",
        "way",
        "subject",
        "mind",
        "well",
        "peirce",
        "mind",
        "comprised",
        "entire",
        "topic",
        "methodology",
        "exact",
        "science",
        "surprising",
        "structure",
        "logic",
        "dewey",
        "work",
        "logic",
        "viz",
        "notably",
        "book",
        "logic",
        "theory",
        "inquiry",
        "close",
        "approximation",
        "structure",
        "scientific",
        "method",
        "peirce",
        "understands",
        "recall",
        "peirce",
        "inquiry",
        "begin",
        "anomalous",
        "situation",
        "particular",
        "puzzle",
        "set",
        "puzzle",
        "elicited",
        "indeterminate",
        "background",
        "ongoing",
        "fact",
        "ultimately",
        "endless",
        "process",
        "hypothesis",
        "formulated",
        "abduction",
        "tested",
        "deduction",
        "induction",
        "iteration",
        "methodological",
        "loop",
        "indeterminacy",
        "original",
        "anomalous",
        "situation",
        "successively",
        "though",
        "never",
        "totally",
        "eliminated",
        "dewey",
        "account",
        "inquiry",
        "especially",
        "insofar",
        "dewey",
        "considers",
        "successive",
        "elimination",
        "indeterminacy",
        "remarkably",
        "akin",
        "peirce",
        "account",
        "scientific",
        "methodology",
        "action",
        "course",
        "difference",
        "dewey",
        "often",
        "writes",
        "though",
        "stage",
        "development",
        "method",
        "logic",
        "science",
        "next",
        "stage",
        "le",
        "already",
        "specified",
        "example",
        "stage",
        "indeterminacy",
        "dewey",
        "writes",
        "relevant",
        "hypothesis",
        "hypothesis",
        "test",
        "next",
        "stage",
        "le",
        "already",
        "determined",
        "contrast",
        "peirce",
        "although",
        "sometimes",
        "speaks",
        "way",
        "often",
        "emphasizes",
        "creative",
        "nondetermined",
        "aspect",
        "elicitingdeveloping",
        "hypothesis",
        "nevertheless",
        "even",
        "despite",
        "difference",
        "emphasis",
        "peirce",
        "dewey",
        "similarity",
        "position",
        "unmistakeable",
        "unlike",
        "dewey",
        "christine",
        "ladd",
        "oscar",
        "howard",
        "mitchell",
        "concentrated",
        "formal",
        "deductive",
        "logic",
        "ie",
        "mathematical",
        "logic",
        "rather",
        "informal",
        "methodology",
        "science",
        "also",
        "unlike",
        "dewey",
        "ladd",
        "mitchell",
        "published",
        "article",
        "volume",
        "study",
        "logic",
        "edited",
        "peirce",
        "preface",
        "volume",
        "peirce",
        "single",
        "ladd",
        "mitchell",
        "commentary",
        "overt",
        "praise",
        "p",
        "v",
        "two",
        "student",
        "peirce",
        "turn",
        "christine",
        "ladd",
        "born",
        "december",
        "later",
        "marriage",
        "fabian",
        "franklin",
        "known",
        "christine",
        "laddfranklin",
        "although",
        "almost",
        "unknown",
        "today",
        "wellknown",
        "highlyregarded",
        "mathematician",
        "logician",
        "psychologist",
        "s",
        "death",
        "march",
        "age",
        "earliest",
        "published",
        "work",
        "mathematics",
        "educational",
        "time",
        "england",
        "attracted",
        "attention",
        "great",
        "mathematician",
        "j",
        "j",
        "sylvester",
        "also",
        "published",
        "educational",
        "time",
        "assumed",
        "position",
        "first",
        "professor",
        "mathematics",
        "new",
        "john",
        "hopkins",
        "university",
        "sylvester",
        "hired",
        "peirce",
        "strength",
        "alreadypublished",
        "work",
        "known",
        "sylvester",
        "ladd",
        "applied",
        "john",
        "hopkins",
        "become",
        "graduate",
        "student",
        "mathematics",
        "although",
        "woman",
        "could",
        "become",
        "regular",
        "graduate",
        "student",
        "john",
        "hopkins",
        "still",
        "ardent",
        "insistent",
        "urging",
        "sylvester",
        "admitted",
        "specialstatus",
        "student",
        "even",
        "awarded",
        "fellowship",
        "study",
        "mathematics",
        "held",
        "fellowship",
        "completed",
        "requirement",
        "phd",
        "degree",
        "period",
        "became",
        "attracted",
        "mathematical",
        "logic",
        "teaching",
        "logic",
        "peirce",
        "studied",
        "carefully",
        "gender",
        "status",
        "student",
        "mathematics",
        "recorded",
        "note",
        "rather",
        "usual",
        "student",
        "list",
        "reason",
        "could",
        "actually",
        "given",
        "phd",
        "degree",
        "although",
        "ultimately",
        "awarded",
        "phd",
        "degree",
        "mathematics",
        "meanwhile",
        "vassar",
        "college",
        "awarded",
        "lld",
        "degree",
        "august",
        "upon",
        "completion",
        "mathematics",
        "fellowship",
        "married",
        "member",
        "john",
        "hopkins",
        "department",
        "mathematics",
        "fellowstudent",
        "peirce",
        "fabian",
        "franklin",
        "b",
        "d",
        "fabian",
        "franklin",
        "seem",
        "stayed",
        "closely",
        "connected",
        "peirce",
        "death",
        "gathered",
        "foregoing",
        "studying",
        "peirce",
        "focussed",
        "ladd",
        "attention",
        "mathematics",
        "general",
        "mathematical",
        "logic",
        "also",
        "called",
        "symbolic",
        "logic",
        "particular",
        "ladd",
        "bestknown",
        "mostcelebrated",
        "work",
        "paper",
        "algebra",
        "logic",
        "published",
        "study",
        "logic",
        "member",
        "john",
        "hopkins",
        "university",
        "c",
        "s",
        "peirce",
        "editor",
        "little",
        "brown",
        "pp",
        "least",
        "widely",
        "regarded",
        "achieved",
        "first",
        "time",
        "history",
        "completely",
        "general",
        "unified",
        "account",
        "aristotelian",
        "syllogism",
        "including",
        "general",
        "account",
        "difference",
        "valid",
        "invalid",
        "syllogism",
        "josiah",
        "royce",
        "example",
        "held",
        "view",
        "laddfranklin",
        "work",
        "logic",
        "thus",
        "worth",
        "looking",
        "detail",
        "achieves",
        "result",
        "algebraizing",
        "syllogism",
        "detail",
        "entered",
        "basically",
        "however",
        "say",
        "basic",
        "idea",
        "associate",
        "possible",
        "syllogism",
        "certain",
        "triad",
        "syllogism",
        "valid",
        "triad",
        "antilogism",
        "say",
        "inconsistent",
        "triad",
        "laddfranklin",
        "wrote",
        "antilogism",
        "late",
        "volume",
        "mind",
        "pp",
        "whether",
        "work",
        "really",
        "first",
        "work",
        "unify",
        "theory",
        "syllogism",
        "whether",
        "ultimately",
        "merit",
        "exalted",
        "status",
        "logician",
        "royce",
        "assigns",
        "must",
        "remain",
        "task",
        "future",
        "exploration",
        "determine",
        "addition",
        "major",
        "work",
        "syllogism",
        "equivalently",
        "notion",
        "antilogism",
        "laddfranklin",
        "well",
        "wrote",
        "entry",
        "threevolume",
        "work",
        "james",
        "mark",
        "baldwin",
        "dictionary",
        "philosophy",
        "psychology",
        "example",
        "entry",
        "syllogism",
        "symbolic",
        "logic",
        "algebra",
        "logic",
        "fact",
        "associate",
        "editor",
        "baldwin",
        "dictionary",
        "also",
        "wrote",
        "least",
        "one",
        "related",
        "paper",
        "journal",
        "philosophy",
        "psychology",
        "scientific",
        "method",
        "later",
        "named",
        "simply",
        "journal",
        "philosophy",
        "specialty",
        "psychology",
        "theory",
        "vision",
        "early",
        "espoused",
        "theory",
        "color",
        "vision",
        "developed",
        "historically",
        "based",
        "three",
        "primary",
        "color",
        "hence",
        "three",
        "distinct",
        "process",
        "chemical",
        "reaction",
        "writing",
        "psychology",
        "vision",
        "continued",
        "pour",
        "firth",
        "voluminously",
        "continued",
        "early",
        "s",
        "least",
        "published",
        "paper",
        "mysterious",
        "visual",
        "phenomenon",
        "known",
        "blue",
        "arc",
        "proceeding",
        "national",
        "academy",
        "science",
        "peirce",
        "praised",
        "o",
        "h",
        "mitchell",
        "best",
        "student",
        "logic",
        "mitchell",
        "trained",
        "mathematician",
        "even",
        "befoe",
        "coming",
        "john",
        "hopkins",
        "especially",
        "noted",
        "knew",
        "extraordinarily",
        "meticulous",
        "attentive",
        "detail",
        "attentive",
        "exactitude",
        "even",
        "noted",
        "slowness",
        "ponderousness",
        "speech",
        "mitchell",
        "paper",
        "stimulated",
        "peirce",
        "high",
        "praise",
        "seems",
        "closely",
        "connected",
        "perhaps",
        "identical",
        "peirce",
        "praise",
        "mitchell",
        "accomplishing",
        "peirce",
        "entry",
        "baldwin",
        "dictionary",
        "philosophy",
        "psychology",
        "particularly",
        "article",
        "word",
        "dimension",
        "article",
        "peirce",
        "credit",
        "mitchell",
        "introduced",
        "concept",
        "multidimensional",
        "logical",
        "universe",
        "exact",
        "logic",
        "peirce",
        "claim",
        "one",
        "fecund",
        "contribution",
        "mitchell",
        "made",
        "exact",
        "logic",
        "seem",
        "two",
        "component",
        "idea",
        "multidimensional",
        "logical",
        "universe",
        "first",
        "one",
        "simply",
        "idea",
        "multiple",
        "quantification",
        "connection",
        "polyadic",
        "predicate",
        "modern",
        "terminology",
        "proposition",
        "quantifier",
        "occurring",
        "within",
        "scope",
        "quantifier",
        "mitchell",
        "employ",
        "formalism",
        "suggestive",
        "idea",
        "undeniable",
        "whether",
        "successfully",
        "distinguishes",
        "x",
        "exists",
        "exists",
        "x",
        "much",
        "le",
        "obvious",
        "moreover",
        "mitchell",
        "first",
        "logician",
        "conceived",
        "multiple",
        "quantification",
        "polyadic",
        "predicate",
        "seems",
        "bit",
        "dubious",
        "especially",
        "since",
        "peirce",
        "already",
        "making",
        "use",
        "notion",
        "multiple",
        "quantification",
        "polyadic",
        "predicate",
        "involved",
        "second",
        "component",
        "idea",
        "multidimensional",
        "logical",
        "universe",
        "using",
        "modern",
        "terminology",
        "idea",
        "universe",
        "discourse",
        "relevant",
        "one",
        "variable",
        "might",
        "universe",
        "discourse",
        "relevant",
        "another",
        "variable",
        "moreover",
        "since",
        "universe",
        "discourse",
        "relevant",
        "one",
        "variable",
        "might",
        "time",
        "place",
        "possible",
        "situation",
        "even",
        "possible",
        "world",
        "difficult",
        "though",
        "perhaps",
        "bit",
        "farfetched",
        "connect",
        "mitchell",
        "idea",
        "multidimensional",
        "logical",
        "universe",
        "idea",
        "tense",
        "logic",
        "even",
        "modal",
        "logic",
        "whether",
        "careful",
        "study",
        "mitchell",
        "logical",
        "contribution",
        "really",
        "support",
        "reading",
        "mitchell",
        "contribution",
        "logic",
        "yet",
        "clearly",
        "determined",
        "clearly",
        "close",
        "study",
        "logical",
        "accomplishment",
        "peirce",
        "notable",
        "student",
        "order"
    ]
}