{
    "main_text": "Nirvikalpaka and Savikalpaka Pratyakṣa || The development of Hindu realism: the Nyāya mission\n3.2 The development of Hindu realism: the Nyāya mission\n\nThe Nyāya view evolves in response to Buddhist account of\nperception. They regard perception as a cognitive episode triggered by\ncausal interaction between a sense faculty and an object. This\ninteraction first results in a sensory impression, nothing more than\nmere physiological change. This preliminary awareness, non-conceptual\nperception, is a necessary first step in the process of perception and\nis invariably followed by a structured awareness leading to conceptual\nperception. A cognition that is independent of preliminary sensory\nawareness cannot result in a perceptual judgment. The first awareness\ndoes not destroy the perceptual character of the second; rather, it\nfacilitates this subsequent awareness. Non-conceptual perception is an\nindispensable causal factor for generation of conceptual perception,\nalthough memory, concepts and collateral information may also be\nrequired. It is important to note that the Nyāya notion of\nvikalpa (in their distinction of nir-vikalpa and\nsa-vikalpa) is different from that of the Buddhists. Unlike\nthe latter, the Naiyāyikas do not think of vikalpa-s as\nmental creations or imaginative constructions but as objectively real\nproperties and features of objects. Vikalpa in this sense\nindicates the operation of judging and synthesizing rather than\nimagining or constructing. Thus conceptual perceptions truly\nrepresent the structure of reality. Of the five types of concepts\n(vikalpa-s) recognized by the Buddhists, viz.\nnāma (word), jāti (universal),\nguṇa (quality), kriyā (action) and\ndravya (substance), the Naiyāyikas, regard all but the\nfirst vikalpa as categories of reality (Mondal, 1982, p.\n364). Unlike the Grammarians, the Nyāya schools do not accept the\nobjective reality of words; words are not inherent to the object\npresented in perception. Rather, the Naiyāyikas hold that the\nrelation between word and object is created by convention in a\nlinguistic community. Although a concept is associated with a word\n(nāma-vikalpa) by means of a convention, it is not\nmerely a fabrication. For example, when someone brings garlic clove\nnear my nose and teaches me by pointing to it that it is called\ngarlic, then subsequently confronted with the garlicky odor and a\nsimilar clove, I can see it and smell it as garlic. Thus\nperceptual awareness includes knowledge of words but, insofar as it is\nperceptual awareness, it is brought about by sensory contact with the\nobject and, its properties which exists independently of words.\n\nThe Buddhists reject this argument on the basis that the conventional\nmeaning of a word relates the word with the concept or the universal.\nUniversals or concepts cannot be objects of our perception; they\ncannot be sensed. Universals, attributes and concepts are theoretical\nconstructs for the Buddhists; what is sensed is the actual object, the\nexclusive particular, the ultimate existent. The Buddhists offer two\narguments in favor of the claim that only particulars are real. First,\nknowledge by means of words or verbal testimony is very different from\nperceptual knowledge, for what we are aware of when we hear the words\n“garlic is pungent” is very different from what we are\nphenomenologically aware of when we smell garlic; words do not denote\nor stand-in for actual objects and can be uttered in the absence of\nany objects, but perception cannot arise in the absence of objects.\nSecond, the particulars are real or existent because they have causal\nefficacy (arthakriyāsāmarthya). Only particular\nreal garlic can flavor one’s food or ruin it, but the universal\ngarlichood cannot do any of these; in this sense, only the particulars\nare real for they fulfill the purposes (artha) of humans.\n\nThe foregoing discussion shows that the epistemological debate between\nthe Buddhists and the Naiyāyikas regarding the nature of\nperception rests on, and brings to the fore, their metaphysical\ndisagreement about the nature of universals. The Naiyāyikas are\nrealists about universals; universals are objective features of the\nworld that impress themselves upon minds; they are not mere figments\nof our imagination. The Naiyāyikas hold that particulars are\nqualified propertied wholes and we directly perceive them as they\nare, without any kind of manipulation or imposition; we do not\nimpose universals on property-less real particulars, rather we find\nstable, durable, relational wholes in reality that do not require any\nimposition or manipulation. They argue that there is no evidence of a\nworld of bare particulars, as claimed by the Buddhists. Therefore\nconceptual or determinate perception does not involve distortion of\nreality; rather it presents things as they really are. To see a piece\nof sandalwood as it really is, we do not need to see the\nsandalwood as a colorless, odorless pure particular; indeed, since the\npiece of sandalwood is really brown and really\nfragrant, to see it as a propertied whole is to see it as it\nreally is.\n\nThe idea that the world consists of propertied particulars seems to\nput pressure on the notion of non-conceptual perception. If there are\nno indeterminate particulars, what is the object of indeterminate\nperception? Indeed some Navya-Nyāya thinkers hold that the raw\ndata of perception (‘real particulars’ in the Buddhists\nsense) is too inchoate and elusive to count as objects of knowledge.\nRecently, Arindam Chakrabarti (2000), a prominent contemporary\nNavya-Nyāya thinker offered seven reasons for altogether\neliminating non-conceptual, or immaculate perceptions as he calls\nthem, from Nyāya epistemology in an attempt to understand the\n“deeper relation between direct realism and concept-enriched\nperception”. Chakrabarti’s skepticism about non-conceptual\nperception as a cognitive state stems from the fact that we cannot\nassign an intentional role to the object of indeterminate perception\nbecause the object of non-conceptual perception is incapable of being\napperceived or directly intuited in any fashion. Chakrabarti’s\ngauntlet has been picked by several Nyāya enthusiasts (Phillips,\n2001 and 2004; Chadha, 2001, 2004 and 2006) and defenders of Buddhist\ndoctrine (Siderits, 2004). This debate brings to the fore an important\nfeature of non-conceptual perception first highlighted by\nGaṅgeśa, suggesting that while there is no direct,\napperceptive evidence for non-conceptual perception, it is posited as\nthe best explanation for the availability of the qualifier (property,\nfeature), since the cognizing subject is not immediately aware of the\nobject of non-conceptual perception. Phillips (2001: 105) presents\nGaṅgeśa’s argument for the inclusion of\nnon-conceptual perception as an essential part of Nyāya\nepistemology:\n\n…it [nirvikalpa pratyakṣa] is posited by the force of the\nfollowing inference as the first step of a two step argument.\n“The perceptual cognition ‘A cow’ (for example) is\ngenerated by a cognition of the qualifier, since it is a cognition of\nan entity as qualified (by that qualifier appearing) like an\ninference”. The second step takes a person’s first\nperception of an individual (Bessie, let us say) as a cow (i.e., as\nhaving some such property) as the perceptual cognition figuring as the\ninference’s subject (pakśa) such that the\ncognizer’s memory not informed by previous cow experience could\nnot possibly provide the qualifier cowhood. The qualifier has to be\navailable, and the best candidate seems to be its perception in the\nraw, a qualifier (cowhood), that is to say, not (as some are wont to\nmisinterpret the point) as divorced from its qualificandum\n(Bessie) but rather as neither divorced nor joined, and, furthermore,\nnot as qualified by another qualifier (such as being-a-heifer) but\nrather just the plain, unadorned entity. In the particular example,\nthe entity is the universal, cowhood, or being-a-cow, although, again,\nit would not be grasped as a universal. Or as anything except itself.\n\n\nThe Navya-Nyāya notion of non-conceptual perception differs from\nthat of the Buddhists in many respects, two of which are very\nimportant. First, according to Navya-Naiyāyikas, there is no\napperceptive evidence for non-conceptual perception, unlike the\nBuddhists who contend that conception-free awareness is necessarily\nself-aware. The Navya-Naiyāyikas, as is obvious from the quote\nabove, emphasize that the evidence for a non-conceptual sensory grasp\nof universals comes in the form of an inference. Second, according to\nNavya-Nyāya, the object of non-conceptual perception is a\nqualifier (concept), although not given as that in the first instance,\nbut not a bare particular as the Buddhists hypothesize. It is, as the\nabove quote explains, posited by the force of an inference; the\n‘bare object’ of non-conceptual perception\nbecomes the qualifier in a resultant determinate perception.\nWhile this does not satisfactorily address Chakrabarti’s concern\nthat lack of apperceptive evidence implies that the subject cannot\nassign an intentional role to the object of non-conceptual perception,\nChadha (2006) argues that the subject’s not being in a position\nto assign an intentional role to the object of non-conceptual\nperception is no hindrance to the intentionality of non-conceptual\nperception itself. Non-conceptual perception is awareness of\na “non-particular individual” (Chakrabarti, 1995) and can\nbe assigned the intentional role of a qualifier in virtue of the\nrecognitional abilities acquired by the subject on the basis of the\nperceptual episode. The subject sees a non-particular\nindividual but, since there is no apperceptive or conscious awareness,\nthe subject does not see it as an instance of a universal or\na qualifier. Chadha explicates Gaṅgeśa’s insight that\na qualifier is given as a non-particular individual, neither divorced\nfrom nor joined to the qualificandum and, therefore it is\nwrong to suggest that lack of apperceptive evidence implies that\nnon-conceptual perception is not an intentional perceptual state.\n\nMore recently, Chaturvedi (2020) analyses counter-arguments against\nGaṅgeśa’s defense of non-conceptual perception\noffered by the sixteenth century Dvāita Vedanta scholar\nVyāsatīrtha. Chaturvedi argues that\nVyāsatīrtha’s objection undermine\nGaṅgeśa’s main inferential proof of non-conceptual\nperception to show that it has a necessary role to play in generating\nconcept-laden determinate perception. In addition,\nVyāsatīrtha’s questions the internal consistency of\nGaṅgeśa’s that the contents of indeterminate\nperception is not available for introspection. Despite all the\nproblems pointed out by the Vedantin, Chaturvedi argues that there is\nstill hope to reconstruct Gaṅgeśa’s account of\nindeterminate perception with some help from recent empirical science\ncan help to restore the overall plausibility of the view.\n",
    "section_title": "3.2 The development of Hindu realism: the Nyāya mission",
    "entry_title": "Perceptual Experience and Concepts in Classical Indian Philosophy",
    "hierarchy_title": "Perceptual Experience and Concepts in Classical Indian Philosophy || Nirvikalpaka and Savikalpaka Pratyakṣa || The development of Hindu realism: the Nyāya mission",
    "tokenized_text": [
        "nirvikalpaka",
        "savikalpaka",
        "pratyakṣa",
        "development",
        "hindu",
        "realism",
        "nyāya",
        "mission",
        "development",
        "hindu",
        "realism",
        "nyāya",
        "mission",
        "nyāya",
        "view",
        "evolves",
        "response",
        "buddhist",
        "account",
        "perception",
        "regard",
        "perception",
        "cognitive",
        "episode",
        "triggered",
        "causal",
        "interaction",
        "sense",
        "faculty",
        "object",
        "interaction",
        "first",
        "result",
        "sensory",
        "impression",
        "nothing",
        "mere",
        "physiological",
        "change",
        "preliminary",
        "awareness",
        "nonconceptual",
        "perception",
        "necessary",
        "first",
        "step",
        "process",
        "perception",
        "invariably",
        "followed",
        "structured",
        "awareness",
        "leading",
        "conceptual",
        "perception",
        "cognition",
        "independent",
        "preliminary",
        "sensory",
        "awareness",
        "result",
        "perceptual",
        "judgment",
        "first",
        "awareness",
        "destroy",
        "perceptual",
        "character",
        "second",
        "rather",
        "facilitates",
        "subsequent",
        "awareness",
        "nonconceptual",
        "perception",
        "indispensable",
        "causal",
        "factor",
        "generation",
        "conceptual",
        "perception",
        "although",
        "memory",
        "concept",
        "collateral",
        "information",
        "may",
        "also",
        "required",
        "important",
        "note",
        "nyāya",
        "notion",
        "vikalpa",
        "distinction",
        "nirvikalpa",
        "savikalpa",
        "different",
        "buddhist",
        "unlike",
        "latter",
        "naiyāyikas",
        "think",
        "vikalpas",
        "mental",
        "creation",
        "imaginative",
        "construction",
        "objectively",
        "real",
        "property",
        "feature",
        "object",
        "vikalpa",
        "sense",
        "indicates",
        "operation",
        "judging",
        "synthesizing",
        "rather",
        "imagining",
        "constructing",
        "thus",
        "conceptual",
        "perception",
        "truly",
        "represent",
        "structure",
        "reality",
        "five",
        "type",
        "concept",
        "vikalpas",
        "recognized",
        "buddhist",
        "viz",
        "nāma",
        "word",
        "jāti",
        "universal",
        "guṇa",
        "quality",
        "kriyā",
        "action",
        "dravya",
        "substance",
        "naiyāyikas",
        "regard",
        "first",
        "vikalpa",
        "category",
        "reality",
        "mondal",
        "p",
        "unlike",
        "grammarian",
        "nyāya",
        "school",
        "accept",
        "objective",
        "reality",
        "word",
        "word",
        "inherent",
        "object",
        "presented",
        "perception",
        "rather",
        "naiyāyikas",
        "hold",
        "relation",
        "word",
        "object",
        "created",
        "convention",
        "linguistic",
        "community",
        "although",
        "concept",
        "associated",
        "word",
        "nāmavikalpa",
        "mean",
        "convention",
        "merely",
        "fabrication",
        "example",
        "someone",
        "brings",
        "garlic",
        "clove",
        "near",
        "nose",
        "teach",
        "pointing",
        "called",
        "garlic",
        "subsequently",
        "confronted",
        "garlicky",
        "odor",
        "similar",
        "clove",
        "see",
        "smell",
        "garlic",
        "thus",
        "perceptual",
        "awareness",
        "includes",
        "knowledge",
        "word",
        "insofar",
        "perceptual",
        "awareness",
        "brought",
        "sensory",
        "contact",
        "object",
        "property",
        "exists",
        "independently",
        "word",
        "buddhist",
        "reject",
        "argument",
        "basis",
        "conventional",
        "meaning",
        "word",
        "relates",
        "word",
        "concept",
        "universal",
        "universal",
        "concept",
        "object",
        "perception",
        "sensed",
        "universal",
        "attribute",
        "concept",
        "theoretical",
        "construct",
        "buddhist",
        "sensed",
        "actual",
        "object",
        "exclusive",
        "particular",
        "ultimate",
        "existent",
        "buddhist",
        "offer",
        "two",
        "argument",
        "favor",
        "claim",
        "particular",
        "real",
        "first",
        "knowledge",
        "mean",
        "word",
        "verbal",
        "testimony",
        "different",
        "perceptual",
        "knowledge",
        "aware",
        "hear",
        "word",
        "garlic",
        "pungent",
        "different",
        "phenomenologically",
        "aware",
        "smell",
        "garlic",
        "word",
        "denote",
        "standin",
        "actual",
        "object",
        "uttered",
        "absence",
        "object",
        "perception",
        "arise",
        "absence",
        "object",
        "second",
        "particular",
        "real",
        "existent",
        "causal",
        "efficacy",
        "arthakriyāsāmarthya",
        "particular",
        "real",
        "garlic",
        "flavor",
        "one",
        "food",
        "ruin",
        "universal",
        "garlichood",
        "sense",
        "particular",
        "real",
        "fulfill",
        "purpose",
        "artha",
        "human",
        "foregoing",
        "discussion",
        "show",
        "epistemological",
        "debate",
        "buddhist",
        "naiyāyikas",
        "regarding",
        "nature",
        "perception",
        "rest",
        "brings",
        "fore",
        "metaphysical",
        "disagreement",
        "nature",
        "universal",
        "naiyāyikas",
        "realist",
        "universal",
        "universal",
        "objective",
        "feature",
        "world",
        "impress",
        "upon",
        "mind",
        "mere",
        "figment",
        "imagination",
        "naiyāyikas",
        "hold",
        "particular",
        "qualified",
        "propertied",
        "whole",
        "directly",
        "perceive",
        "without",
        "kind",
        "manipulation",
        "imposition",
        "impose",
        "universal",
        "propertyless",
        "real",
        "particular",
        "rather",
        "find",
        "stable",
        "durable",
        "relational",
        "whole",
        "reality",
        "require",
        "imposition",
        "manipulation",
        "argue",
        "evidence",
        "world",
        "bare",
        "particular",
        "claimed",
        "buddhist",
        "therefore",
        "conceptual",
        "determinate",
        "perception",
        "involve",
        "distortion",
        "reality",
        "rather",
        "present",
        "thing",
        "really",
        "see",
        "piece",
        "sandalwood",
        "really",
        "need",
        "see",
        "sandalwood",
        "colorless",
        "odorless",
        "pure",
        "particular",
        "indeed",
        "since",
        "piece",
        "sandalwood",
        "really",
        "brown",
        "really",
        "fragrant",
        "see",
        "propertied",
        "whole",
        "see",
        "really",
        "idea",
        "world",
        "consists",
        "propertied",
        "particular",
        "seems",
        "put",
        "pressure",
        "notion",
        "nonconceptual",
        "perception",
        "indeterminate",
        "particular",
        "object",
        "indeterminate",
        "perception",
        "indeed",
        "navyanyāya",
        "thinker",
        "hold",
        "raw",
        "data",
        "perception",
        "real",
        "particular",
        "buddhist",
        "sense",
        "inchoate",
        "elusive",
        "count",
        "object",
        "knowledge",
        "recently",
        "arindam",
        "chakrabarti",
        "prominent",
        "contemporary",
        "navyanyāya",
        "thinker",
        "offered",
        "seven",
        "reason",
        "altogether",
        "eliminating",
        "nonconceptual",
        "immaculate",
        "perception",
        "call",
        "nyāya",
        "epistemology",
        "attempt",
        "understand",
        "deeper",
        "relation",
        "direct",
        "realism",
        "conceptenriched",
        "perception",
        "chakrabarti",
        "skepticism",
        "nonconceptual",
        "perception",
        "cognitive",
        "state",
        "stem",
        "fact",
        "assign",
        "intentional",
        "role",
        "object",
        "indeterminate",
        "perception",
        "object",
        "nonconceptual",
        "perception",
        "incapable",
        "apperceived",
        "directly",
        "intuited",
        "fashion",
        "chakrabarti",
        "gauntlet",
        "picked",
        "several",
        "nyāya",
        "enthusiast",
        "phillips",
        "chadha",
        "defender",
        "buddhist",
        "doctrine",
        "siderits",
        "debate",
        "brings",
        "fore",
        "important",
        "feature",
        "nonconceptual",
        "perception",
        "first",
        "highlighted",
        "gaṅgeśa",
        "suggesting",
        "direct",
        "apperceptive",
        "evidence",
        "nonconceptual",
        "perception",
        "posited",
        "best",
        "explanation",
        "availability",
        "qualifier",
        "property",
        "feature",
        "since",
        "cognizing",
        "subject",
        "immediately",
        "aware",
        "object",
        "nonconceptual",
        "perception",
        "phillips",
        "present",
        "gaṅgeśa",
        "argument",
        "inclusion",
        "nonconceptual",
        "perception",
        "essential",
        "part",
        "nyāya",
        "epistemology",
        "it",
        "nirvikalpa",
        "pratyakṣa",
        "posited",
        "force",
        "following",
        "inference",
        "first",
        "step",
        "two",
        "step",
        "argument",
        "perceptual",
        "cognition",
        "cow",
        "example",
        "generated",
        "cognition",
        "qualifier",
        "since",
        "cognition",
        "entity",
        "qualified",
        "qualifier",
        "appearing",
        "like",
        "inference",
        "second",
        "step",
        "take",
        "person",
        "first",
        "perception",
        "individual",
        "bessie",
        "let",
        "u",
        "say",
        "cow",
        "ie",
        "property",
        "perceptual",
        "cognition",
        "figuring",
        "inference",
        "subject",
        "pakśa",
        "cognizer",
        "memory",
        "informed",
        "previous",
        "cow",
        "experience",
        "could",
        "possibly",
        "provide",
        "qualifier",
        "cowhood",
        "qualifier",
        "available",
        "best",
        "candidate",
        "seems",
        "perception",
        "raw",
        "qualifier",
        "cowhood",
        "say",
        "wont",
        "misinterpret",
        "point",
        "divorced",
        "qualificandum",
        "bessie",
        "rather",
        "neither",
        "divorced",
        "joined",
        "furthermore",
        "qualified",
        "another",
        "qualifier",
        "beingaheifer",
        "rather",
        "plain",
        "unadorned",
        "entity",
        "particular",
        "example",
        "entity",
        "universal",
        "cowhood",
        "beingacow",
        "although",
        "would",
        "grasped",
        "universal",
        "anything",
        "except",
        "navyanyāya",
        "notion",
        "nonconceptual",
        "perception",
        "differs",
        "buddhist",
        "many",
        "respect",
        "two",
        "important",
        "first",
        "according",
        "navyanaiyāyikas",
        "apperceptive",
        "evidence",
        "nonconceptual",
        "perception",
        "unlike",
        "buddhist",
        "contend",
        "conceptionfree",
        "awareness",
        "necessarily",
        "selfaware",
        "navyanaiyāyikas",
        "obvious",
        "quote",
        "emphasize",
        "evidence",
        "nonconceptual",
        "sensory",
        "grasp",
        "universal",
        "come",
        "form",
        "inference",
        "second",
        "according",
        "navyanyāya",
        "object",
        "nonconceptual",
        "perception",
        "qualifier",
        "concept",
        "although",
        "given",
        "first",
        "instance",
        "bare",
        "particular",
        "buddhist",
        "hypothesize",
        "quote",
        "explains",
        "posited",
        "force",
        "inference",
        "bare",
        "object",
        "nonconceptual",
        "perception",
        "becomes",
        "qualifier",
        "resultant",
        "determinate",
        "perception",
        "satisfactorily",
        "address",
        "chakrabarti",
        "concern",
        "lack",
        "apperceptive",
        "evidence",
        "implies",
        "subject",
        "assign",
        "intentional",
        "role",
        "object",
        "nonconceptual",
        "perception",
        "chadha",
        "argues",
        "subject",
        "position",
        "assign",
        "intentional",
        "role",
        "object",
        "nonconceptual",
        "perception",
        "hindrance",
        "intentionality",
        "nonconceptual",
        "perception",
        "nonconceptual",
        "perception",
        "awareness",
        "nonparticular",
        "individual",
        "chakrabarti",
        "assigned",
        "intentional",
        "role",
        "qualifier",
        "virtue",
        "recognitional",
        "ability",
        "acquired",
        "subject",
        "basis",
        "perceptual",
        "episode",
        "subject",
        "see",
        "nonparticular",
        "individual",
        "since",
        "apperceptive",
        "conscious",
        "awareness",
        "subject",
        "see",
        "instance",
        "universal",
        "qualifier",
        "chadha",
        "explicates",
        "gaṅgeśa",
        "insight",
        "qualifier",
        "given",
        "nonparticular",
        "individual",
        "neither",
        "divorced",
        "joined",
        "qualificandum",
        "therefore",
        "wrong",
        "suggest",
        "lack",
        "apperceptive",
        "evidence",
        "implies",
        "nonconceptual",
        "perception",
        "intentional",
        "perceptual",
        "state",
        "recently",
        "chaturvedi",
        "analysis",
        "counterarguments",
        "gaṅgeśa",
        "defense",
        "nonconceptual",
        "perception",
        "offered",
        "sixteenth",
        "century",
        "dvāita",
        "vedanta",
        "scholar",
        "vyāsatīrtha",
        "chaturvedi",
        "argues",
        "vyāsatīrtha",
        "objection",
        "undermine",
        "gaṅgeśa",
        "main",
        "inferential",
        "proof",
        "nonconceptual",
        "perception",
        "show",
        "necessary",
        "role",
        "play",
        "generating",
        "conceptladen",
        "determinate",
        "perception",
        "addition",
        "vyāsatīrtha",
        "question",
        "internal",
        "consistency",
        "gaṅgeśa",
        "content",
        "indeterminate",
        "perception",
        "available",
        "introspection",
        "despite",
        "problem",
        "pointed",
        "vedantin",
        "chaturvedi",
        "argues",
        "still",
        "hope",
        "reconstruct",
        "gaṅgeśa",
        "account",
        "indeterminate",
        "perception",
        "help",
        "recent",
        "empirical",
        "science",
        "help",
        "restore",
        "overall",
        "plausibility",
        "view"
    ]
}