{
    "main_text": "Contents as Accuracy Conditions || Do Experiences Have Accuracy Conditions?\n2.1 Do Experiences Have Accuracy Conditions?\n\nSome philosophers deny that experiences have accuracy conditions. Such\nphilosophers must offer a different account of what is happening in\ncases where one is misled by one’s senses, and they must dismiss\nor explain away putative intuitions about the accuracy or inaccuracy\nof experiences. A natural way to do so is to confine accuracy and\ninaccuracy to the level of belief, further downstream from\nexperience.\n\nThere are a number of positions that deny that experiences have\naccuracy conditions (Wilson and Locatelli 2017). All these positions\ndeny this claim on the grounds that it is not supported by either the\nmetaphysics of experience or by its phenomenology. The positions\ndiffer, however, on their positive views of the metaphysics and\nphenomenology of experience.\n\nThe first position is the view that experiences are raw feels, or\nsensory affectations of the subject, that do not purport to represent\nthe world in any way at all. The eighteenth-century philosopher\n Thomas Reid\n held a view of this sort: Reid argued that experiences have a sensory\npart that is a mere raw feel, and that is independent of judgments\nabout how things are in the environment. (He took the latter\nessentially to involve concepts). One might, on this view, speak more\nbroadly about experiences as having two parts, sensory part and a\njudgment part; or one might speak more narrowly about experience as\nbeing limited to the sensory part that is typically accompanied by\njudgment. Which way one speaks is merely a matter of terminology. The\ncore feature of the view is its cleavage between the sensory aspect of\nexperiences, on the one hand, and assessability for accuracy, on the\nother. Given a judgement that occurs simultaneously with a sensation,\none could in principle make that very same judgment without having any\nsensation, and one could in principle have those very sensations\nwithout making any judgments. That is the force of saying that these\ntwo aspects, sensation and judgment, are independent. If experiences\nare understood narrowly as being limited to the sensory part, then\nthey are not assessable for accuracy; and if they are understood\nbroadly as having both a sensory part and a judgmental part, then it\nis only the latter that is assessable for accuracy.\n\nThe second position is a version of adverbialism about visual\nexperiences, according to which such experiences are nothing more than\nmodifications of a subject that can be characterized by specialized\nadverbs specifying how one is visually ‘appeared-to’.\nE.g., normally, when one sees a red tomato, one is appeared to red-ly\nand round-ly. Visual experience, on this view, does not by itself even\npurport to present one with objects or their properties. There are\nthus no accuracy conditions associated with such experiences. Instead,\non this view, to be misled by one’s sense is to end up with a\nfalse belief that is caused by one’s experience. (For further\ndiscussion of adverbialism, see\n the problem of perception;\n also Chisholm 1957, Ducasse 1942, Tye 1984, Sellars 1975, and for\ncritical discussion, Jackson 1977). Strictly speaking, it should be\nnoted that so long as the core thesis of adverbialism is that\nexperiences are modifications or properties of the subject,\nadverbialism leaves open whether experiences are assessable for\naccuracy or not. For all that core thesis says, being appeared-to\nF-ly could be a way of representing that something is\nF. Historically, adverbialists’ main motivation was to\noppose the act-object conception of experience, according to which\nexperiences are structured by an act of awareness, on the one hand,\nand an object of awareness, on the other. Early formulations of the\nview presented it as a view according which experiences were not\nassessable for accuracy.\n\nThe third position is that at least some perceptual experiences come\nin degrees that correspond to degrees of uncertainty. Compare: there\nis straight answer to the question “Is the sound I hear a\ncoyote?”, when you are uncertain whether the sound comes from a\ncoyote or a human baby. You cannot simply answer Yes or No to express\nyour opinion; you have to hedge. If you are in such a state of\nuncertainty, it might seem, then there no way the world could be in\norder for your state to be accurate or inaccurate. By analogy, on the\nthird position, experiences sometimes reflect uncertainty in a way\nthat leaves them with no accuracy conditions (Madary 2012, Morrison\n2015, Munton 2016, Vance 2020, Raleigh and Vindrola 2020). There is a\nfourth position that denies that experiences have accuracy conditions.\nThis position starts with the claim that some experiences consist in a\nchunk of the environment—for instance, a lavender\nbush—being perceptually presented to a subject, so that both the\nlavender bush and the perceptual relation between it and the subject\nare constituents of the experience. (Note that this is more specific\nthan the view that says merely that perception of public\nobjects is ‘direct’. That view is silent on what the\nnature of perceptual experience is). According to one version of this\nview, when you see a lavender bush, some of its properties are\npresented to you, and your experience consists in your being so\nrelated to the bush and those of its properties that are presenting\nthemselves to you. You could have an experience that was\nindistinguishable from one of so seeing that very lavender bush: as it\nmight be, an experience of seeing a different lavender bush, or a\nhallucination that was indistinguishable from the original experience.\nBut neither of these experiences, according to this view, would be the\nsame sort of experience as the experience of seeing the original\nlavender bush. Martin (2006) and Smith (2002) call this view\n“naïve realism”. Another version of this approach,\ndeveloped by Johnston (2006) and (2014), develops the idea that\nperceivers are presented with instances of properties rather than with\nuniversals. Note that both Martin and Smith’s versions are\nsimply silent on the nature of hallucinatory experiences. (For more on\nnaïve realism see the entry on\n the disjunctive theory of perception).\n\n\nAs stated so far, naïve realism is neutral on whether any\nexperiences have accuracy conditions. A version of the view, however,\nexplicitly denies this. This version holds that experiences are\nanalogous to chunks of the environment that clearly lack accuracy\nconditions. The lawn chair on the deck is not the kind of thing that\ncan be accurate or inaccurate (though it may figure in the accuracy\nconditions of an utterance, such as an utterance of “that is a\nlawn chair”). Travis (2004, 2013) develops naïve realism in\njust this way. He also offers further reasons for denying that\nexperiences have accuracy conditions. Travis agrees that in having an\nexperience one may represent that such-and-such is the case. He holds,\nhowever, that there is no unique ‘taking’ associated with\nan experience, and experience is only ever an input to representation,\nnever the result of it. One of Travis’s examples is this: if you\nsee Sid and Pia touch hands at the dinner table, you make take them to\nbe trysting. But considered independently of this\n‘taking’, your experience simply consists in being\npresented with an unrepeatable, particular chunk of the environment,\nnamely Sid and Pia at the table touching hands. (The notion of being\n‘presented with’ is left as primitive). Accuracy\nconditions come into the picture only after you take the environment\nas it is presented to you to be some specific, potentially repeatable\nway. So according to Travis, the experience does not map onto any\nunique set of accuracy conditions. Since illusions involve inaccuracy,\nby Travis’s lights illusory experiences are experiences that\nhave been ‘taken’ in such a way that the\n‘taking’ is false.\n\nA fifth position that denies that experiences have accuracy conditions\nsays that experiences are raw feels, but also holds that all\nexperiences have the same structure as perception of objects. On this\nview, experience consists in immediately perceiving private objects\nknown as sense-data. According to sense-datum theories, when\nyour experience is a case of perceiving a public object, such as a\nwhite wall that looks red, you indirectly perceive the wall\nby immediately perceiving a red sense-datum. In general, sense-data\nreally have the properties that public objects look to have. In this\nway your having (i.e., immediately perceiving) the sense-data you do\nis supposed to account for what it is for a public object to appear to\nyou to be a certain way; and you have sense-data whether or not there\nis any public object that you indirectly perceive by immediately\nperceiving them.\n\nIt should be noted that if the core commitment of sense-datum theories\nis that one immediately perceives mental objects in experience, then\nsense-datum theories are neutral on whether experiences are assessable\nfor accuracy. From the fact that one perceives (or immediately\nperceives) a particular object (be it a public object or a private\nmental one), nothing at all follows about whether the experience of so\nperceiving is assessable for accuracy or not (for more on sense-datum\ntheories, see the entries on\n sense data\n and the\n problem of perception).\n Jackson (1977) defends a version of the sense-datum view according to\nwhich experiences are not assessable for accuracy.\n\nAll of these positions except the third one could be seen as offering\nconstruals of the contents of the perceiver’s mind, where these\nare analogous to the contents of a bucket. Such construals contrast\nwith the newspaper model of perceptual contents, and more specifically\nwith the conception of contents as the accuracy conditions of\nexperience. Henceforth ‘the contents of experience’ will\nbe restricted to a notion that says that the contents of an experience\nare the conditions of accuracy associated with it. The claim that\nexperiences have contents in this sense is substantive, and, as we\nhave seen, is denied by some philosophers. But many philosophers\naccept that experiences have contents in this sense, and this\nconception of the contents of experience dominates the recent\nphilosophical literature on perception. Defenses of the thesis that\nexperiences have contents can be found in Byrne 2009, Pautz 2010,\nSchellenberg 2018, and Siegel 2010a and 2010b, and criticisms of those\ndefenses in Breckenridge 2007 and Wilson and Locatelli (2017).\n",
    "section_title": "2.1 Do Experiences Have Accuracy Conditions?",
    "entry_title": "The Contents of Perception",
    "hierarchy_title": "The Contents of Perception || Contents as Accuracy Conditions || Do Experiences Have Accuracy Conditions?",
    "tokenized_text": [
        "content",
        "accuracy",
        "condition",
        "experience",
        "accuracy",
        "condition",
        "experience",
        "accuracy",
        "condition",
        "philosopher",
        "deny",
        "experience",
        "accuracy",
        "condition",
        "philosopher",
        "must",
        "offer",
        "different",
        "account",
        "happening",
        "case",
        "one",
        "misled",
        "one",
        "sens",
        "must",
        "dismiss",
        "explain",
        "away",
        "putative",
        "intuition",
        "accuracy",
        "inaccuracy",
        "experience",
        "natural",
        "way",
        "confine",
        "accuracy",
        "inaccuracy",
        "level",
        "belief",
        "downstream",
        "experience",
        "number",
        "position",
        "deny",
        "experience",
        "accuracy",
        "condition",
        "wilson",
        "locatelli",
        "position",
        "deny",
        "claim",
        "ground",
        "supported",
        "either",
        "metaphysics",
        "experience",
        "phenomenology",
        "position",
        "differ",
        "however",
        "positive",
        "view",
        "metaphysics",
        "phenomenology",
        "experience",
        "first",
        "position",
        "view",
        "experience",
        "raw",
        "feel",
        "sensory",
        "affectation",
        "subject",
        "purport",
        "represent",
        "world",
        "way",
        "eighteenthcentury",
        "philosopher",
        "thomas",
        "reid",
        "held",
        "view",
        "sort",
        "reid",
        "argued",
        "experience",
        "sensory",
        "part",
        "mere",
        "raw",
        "feel",
        "independent",
        "judgment",
        "thing",
        "environment",
        "took",
        "latter",
        "essentially",
        "involve",
        "concept",
        "one",
        "might",
        "view",
        "speak",
        "broadly",
        "experience",
        "two",
        "part",
        "sensory",
        "part",
        "judgment",
        "part",
        "one",
        "might",
        "speak",
        "narrowly",
        "experience",
        "limited",
        "sensory",
        "part",
        "typically",
        "accompanied",
        "judgment",
        "way",
        "one",
        "speaks",
        "merely",
        "matter",
        "terminology",
        "core",
        "feature",
        "view",
        "cleavage",
        "sensory",
        "aspect",
        "experience",
        "one",
        "hand",
        "assessability",
        "accuracy",
        "given",
        "judgement",
        "occurs",
        "simultaneously",
        "sensation",
        "one",
        "could",
        "principle",
        "make",
        "judgment",
        "without",
        "sensation",
        "one",
        "could",
        "principle",
        "sensation",
        "without",
        "making",
        "judgment",
        "force",
        "saying",
        "two",
        "aspect",
        "sensation",
        "judgment",
        "independent",
        "experience",
        "understood",
        "narrowly",
        "limited",
        "sensory",
        "part",
        "assessable",
        "accuracy",
        "understood",
        "broadly",
        "sensory",
        "part",
        "judgmental",
        "part",
        "latter",
        "assessable",
        "accuracy",
        "second",
        "position",
        "version",
        "adverbialism",
        "visual",
        "experience",
        "according",
        "experience",
        "nothing",
        "modification",
        "subject",
        "characterized",
        "specialized",
        "adverb",
        "specifying",
        "one",
        "visually",
        "appearedto",
        "eg",
        "normally",
        "one",
        "see",
        "red",
        "tomato",
        "one",
        "appeared",
        "redly",
        "roundly",
        "visual",
        "experience",
        "view",
        "even",
        "purport",
        "present",
        "one",
        "object",
        "property",
        "thus",
        "accuracy",
        "condition",
        "associated",
        "experience",
        "instead",
        "view",
        "misled",
        "one",
        "sense",
        "end",
        "false",
        "belief",
        "caused",
        "one",
        "experience",
        "discussion",
        "adverbialism",
        "see",
        "problem",
        "perception",
        "also",
        "chisholm",
        "ducasse",
        "tye",
        "sellars",
        "critical",
        "discussion",
        "jackson",
        "strictly",
        "speaking",
        "noted",
        "long",
        "core",
        "thesis",
        "adverbialism",
        "experience",
        "modification",
        "property",
        "subject",
        "adverbialism",
        "leaf",
        "open",
        "whether",
        "experience",
        "assessable",
        "accuracy",
        "core",
        "thesis",
        "say",
        "appearedto",
        "fly",
        "could",
        "way",
        "representing",
        "something",
        "f",
        "historically",
        "adverbialists",
        "main",
        "motivation",
        "oppose",
        "actobject",
        "conception",
        "experience",
        "according",
        "experience",
        "structured",
        "act",
        "awareness",
        "one",
        "hand",
        "object",
        "awareness",
        "early",
        "formulation",
        "view",
        "presented",
        "view",
        "according",
        "experience",
        "assessable",
        "accuracy",
        "third",
        "position",
        "least",
        "perceptual",
        "experience",
        "come",
        "degree",
        "correspond",
        "degree",
        "uncertainty",
        "compare",
        "straight",
        "answer",
        "question",
        "sound",
        "hear",
        "coyote",
        "uncertain",
        "whether",
        "sound",
        "come",
        "coyote",
        "human",
        "baby",
        "simply",
        "answer",
        "yes",
        "express",
        "opinion",
        "hedge",
        "state",
        "uncertainty",
        "might",
        "seem",
        "way",
        "world",
        "could",
        "order",
        "state",
        "accurate",
        "inaccurate",
        "analogy",
        "third",
        "position",
        "experience",
        "sometimes",
        "reflect",
        "uncertainty",
        "way",
        "leaf",
        "accuracy",
        "condition",
        "madary",
        "morrison",
        "munton",
        "vance",
        "raleigh",
        "vindrola",
        "fourth",
        "position",
        "denies",
        "experience",
        "accuracy",
        "condition",
        "position",
        "start",
        "claim",
        "experience",
        "consist",
        "chunk",
        "environmentfor",
        "instance",
        "lavender",
        "bushbeing",
        "perceptually",
        "presented",
        "subject",
        "lavender",
        "bush",
        "perceptual",
        "relation",
        "subject",
        "constituent",
        "experience",
        "note",
        "specific",
        "view",
        "say",
        "merely",
        "perception",
        "public",
        "object",
        "direct",
        "view",
        "silent",
        "nature",
        "perceptual",
        "experience",
        "according",
        "one",
        "version",
        "view",
        "see",
        "lavender",
        "bush",
        "property",
        "presented",
        "experience",
        "consists",
        "related",
        "bush",
        "property",
        "presenting",
        "could",
        "experience",
        "indistinguishable",
        "one",
        "seeing",
        "lavender",
        "bush",
        "might",
        "experience",
        "seeing",
        "different",
        "lavender",
        "bush",
        "hallucination",
        "indistinguishable",
        "original",
        "experience",
        "neither",
        "experience",
        "according",
        "view",
        "would",
        "sort",
        "experience",
        "experience",
        "seeing",
        "original",
        "lavender",
        "bush",
        "martin",
        "smith",
        "call",
        "view",
        "naïve",
        "realism",
        "another",
        "version",
        "approach",
        "developed",
        "johnston",
        "develops",
        "idea",
        "perceiver",
        "presented",
        "instance",
        "property",
        "rather",
        "universal",
        "note",
        "martin",
        "smith",
        "version",
        "simply",
        "silent",
        "nature",
        "hallucinatory",
        "experience",
        "naïve",
        "realism",
        "see",
        "entry",
        "disjunctive",
        "theory",
        "perception",
        "stated",
        "far",
        "naïve",
        "realism",
        "neutral",
        "whether",
        "experience",
        "accuracy",
        "condition",
        "version",
        "view",
        "however",
        "explicitly",
        "denies",
        "version",
        "hold",
        "experience",
        "analogous",
        "chunk",
        "environment",
        "clearly",
        "lack",
        "accuracy",
        "condition",
        "lawn",
        "chair",
        "deck",
        "kind",
        "thing",
        "accurate",
        "inaccurate",
        "though",
        "may",
        "figure",
        "accuracy",
        "condition",
        "utterance",
        "utterance",
        "lawn",
        "chair",
        "travis",
        "develops",
        "naïve",
        "realism",
        "way",
        "also",
        "offer",
        "reason",
        "denying",
        "experience",
        "accuracy",
        "condition",
        "travis",
        "agrees",
        "experience",
        "one",
        "may",
        "represent",
        "suchandsuch",
        "case",
        "hold",
        "however",
        "unique",
        "taking",
        "associated",
        "experience",
        "experience",
        "ever",
        "input",
        "representation",
        "never",
        "result",
        "one",
        "travis",
        "example",
        "see",
        "sid",
        "pia",
        "touch",
        "hand",
        "dinner",
        "table",
        "make",
        "take",
        "trysting",
        "considered",
        "independently",
        "taking",
        "experience",
        "simply",
        "consists",
        "presented",
        "unrepeatable",
        "particular",
        "chunk",
        "environment",
        "namely",
        "sid",
        "pia",
        "table",
        "touching",
        "hand",
        "notion",
        "presented",
        "left",
        "primitive",
        "accuracy",
        "condition",
        "come",
        "picture",
        "take",
        "environment",
        "presented",
        "specific",
        "potentially",
        "repeatable",
        "way",
        "according",
        "travis",
        "experience",
        "map",
        "onto",
        "unique",
        "set",
        "accuracy",
        "condition",
        "since",
        "illusion",
        "involve",
        "inaccuracy",
        "travis",
        "light",
        "illusory",
        "experience",
        "experience",
        "taken",
        "way",
        "taking",
        "false",
        "fifth",
        "position",
        "denies",
        "experience",
        "accuracy",
        "condition",
        "say",
        "experience",
        "raw",
        "feel",
        "also",
        "hold",
        "experience",
        "structure",
        "perception",
        "object",
        "view",
        "experience",
        "consists",
        "immediately",
        "perceiving",
        "private",
        "object",
        "known",
        "sensedata",
        "according",
        "sensedatum",
        "theory",
        "experience",
        "case",
        "perceiving",
        "public",
        "object",
        "white",
        "wall",
        "look",
        "red",
        "indirectly",
        "perceive",
        "wall",
        "immediately",
        "perceiving",
        "red",
        "sensedatum",
        "general",
        "sensedata",
        "really",
        "property",
        "public",
        "object",
        "look",
        "way",
        "ie",
        "immediately",
        "perceiving",
        "sensedata",
        "supposed",
        "account",
        "public",
        "object",
        "appear",
        "certain",
        "way",
        "sensedata",
        "whether",
        "public",
        "object",
        "indirectly",
        "perceive",
        "immediately",
        "perceiving",
        "noted",
        "core",
        "commitment",
        "sensedatum",
        "theory",
        "one",
        "immediately",
        "perceives",
        "mental",
        "object",
        "experience",
        "sensedatum",
        "theory",
        "neutral",
        "whether",
        "experience",
        "assessable",
        "accuracy",
        "fact",
        "one",
        "perceives",
        "immediately",
        "perceives",
        "particular",
        "object",
        "public",
        "object",
        "private",
        "mental",
        "one",
        "nothing",
        "follows",
        "whether",
        "experience",
        "perceiving",
        "assessable",
        "accuracy",
        "sensedatum",
        "theory",
        "see",
        "entry",
        "sense",
        "data",
        "problem",
        "perception",
        "jackson",
        "defends",
        "version",
        "sensedatum",
        "view",
        "according",
        "experience",
        "assessable",
        "accuracy",
        "position",
        "except",
        "third",
        "one",
        "could",
        "seen",
        "offering",
        "construal",
        "content",
        "perceiver",
        "mind",
        "analogous",
        "content",
        "bucket",
        "construal",
        "contrast",
        "newspaper",
        "model",
        "perceptual",
        "content",
        "specifically",
        "conception",
        "content",
        "accuracy",
        "condition",
        "experience",
        "henceforth",
        "content",
        "experience",
        "restricted",
        "notion",
        "say",
        "content",
        "experience",
        "condition",
        "accuracy",
        "associated",
        "claim",
        "experience",
        "content",
        "sense",
        "substantive",
        "seen",
        "denied",
        "philosopher",
        "many",
        "philosopher",
        "accept",
        "experience",
        "content",
        "sense",
        "conception",
        "content",
        "experience",
        "dominates",
        "recent",
        "philosophical",
        "literature",
        "perception",
        "defense",
        "thesis",
        "experience",
        "content",
        "found",
        "byrne",
        "pautz",
        "schellenberg",
        "siegel",
        "a",
        "b",
        "criticism",
        "defense",
        "breckenridge",
        "wilson",
        "locatelli"
    ]
}