{
    "main_text": "Is perfect goodness possibly exemplified?\n4. Is perfect goodness possibly exemplified?\n\nThe argument from evil, noted in the previous section, appeals to\ncontingent facts about the world in order to call into question the\nexistence of a being of perfect goodness (who exhibits perfect\nknowledge and power as well). But one might call into question the\nexistence of such a being without appeal to supplementary premises\nabout contingent facts concerning the existence of evil. One might say\nthat perfect goodness is not even a real possibility.\n\nIs perfect goodness a possibility? One might think that it is obvious\nthat it is. After all, whatever standard of moral goodness that one\nputs forward as the ideal, it must be a standard that is possible for\nagents to meet, for ‘ought’ – at least, the moral\n‘ought’ – implies ‘can.’ But one might\nclaim that the standard for moral goodness is not really like that.\nInstead of putting forward an ideal, the standard of moral goodness is\na comparative standard: with respect to cases of appropriate\ncomparison, the standard of moral goodness tells one how the two items\nbeing compared – whether desires, traits of character, actions\n– are ordered with respect to one another. So the standard of\nmoral goodness declares one set of desires morally better than\nanother, or declares them equally good; or declares one set of\ncharacter traits better than another, or declares them equally good;\nor declares one career of actions better than another, or declares\nthem equally good. (Put to the side the possibility that some such\nitems are simply incommensurable.) Understood in this comparative way,\nthe standard of moral goodness could still honor ‘ought implies\ncan’: perhaps if A’s performing action X is\nmorally better than A’s performing action Y, this\ncomparison presupposes that performing X is possible for\nA and performing Y is possible for A. But the key\npoint is that, understood in this comparative way, it is not at all\nobvious that perfect moral goodness is possible. For it may\nbe that the facts about what it is possible for A to do and the\ncomparative moral standard together entail that for every action that\nA might perform, there is a morally better action that it is\npossible for A to perform.\n\nThis possibility has been most intensively discussed with respect to\n‘no best world’ scenarios. Say that God ‘actualizes\na world’ when some maximal state of affairs obtains as a result\nof God’s choosing to create or choosing to refrain from\ncreating. (Whether God actualizes a world is thus not an open\nquestion; God actualizes some world, and the only questions are\nwhether it will include items other than God and if so, which ones.)\nSuppose that there are infinitely many possible worlds, each of which\nis within God’s power to actualize. For each of these worlds,\nthere is another that is better from a moral perspective, i.e. for\neach world, one who takes the moral point of view will prefer some\nother world’s being actual to its being actual. Since a possible\nworld is a maximal state of affairs, God cannot actualize more than\none of these. So whichever world God chooses to actualize, it will be\ntrue that God could have actualized a morally better one. One might\nthink that it is clear that an action of actualizing a world that is\nbetter from a moral point of view is morally better than an action of\nactualizing a world that is worse from a moral point of view. It\nfollows that in a ‘no best world’ scenario, there is no\nagency that God could exhibit that is unsurpassable. Since God is\nperfectly good only if God’s agency is unsurpassable,\nnecessarily, God is not perfectly good.\n\nThe argument is as follows:\n\nNecessarily, God actualizes some world\nNecessarily, for each actualizable world w1,\nthere is an actualizable world w2 such that from the\nmoral point of view one would prefer w2 to\nw1\nNecessarily, for whatever world that God actualizes, there is a\nmorally better world that God does not actualize yet could have (from\n(2))\nNecessarily, for whatever world that God actualizes, God’s\nact of actualizing that world is not as morally good as some other act\nthat God does not perform but could have (from (3))\nNecessarily, for whatever world that God actualizes, God’s\nagency is not as morally good as it could have been (from (4))\nNecessarily, God’s agency is not perfectly good (from (1),\n(5))\n\n\nSome have found the reasoning from no-best-world to\nno-perfect-goodness persuasive, while drawing different morals from\nthat entailment. Leibniz concludes that, because there is a God, there\nis a best world (“Essays on the Justice of God,” §8);\nRowe and Wielenberg, by contrast, conclude that this entailment can\nserve as part of an argument against God’s existence (Rowe 2004,\npp. 88–150; Wielenberg 2004). Others have been unmoved.\n\nThe main sticking point in this argument is the move from (3) to (4).\n(For a denial of (2) based on the possibility and moral\nunsurpassability of an infinitely valuable world, see Climenhaga\n2018.) Detractors of this argument wonder whether it follows from the\nfact that any world actualized by God is morally surpassable that any\nact of actualizing a world is morally surpassable. It is easy to be\ntempted by the following line of thought. If we think of an action as\na state of affairs to be evaluated in terms of moral goodness in the\nsame way that any other state of affairs is to be evaluated, then\nthere is a pretty straightforward argument for the view that any act\nof actualizing a world will be surpassable. For if one prefers from a\nmoral point of view the obtaining of possible world\nw2 to the obtaining of possible world\nw1, then it seems very plausible that one would,\nfrom the moral point of view, prefer God’s actualizing\nw2 to God’s actualizing\nw1.\n\nThis line of thought requires the assumption that the standard of\nmoral goodness that applies to actions, in virtue of which a\nbeing’s agency counts as morally good, is the same as the\nstandard that applies to states of affairs generally. But this is not\nobvious. One might think that while the standard of moral goodness\napplying to states of affairs is third-personal in character –\none considers various items, and asks what one would prefer from a\nparticular perspective, the moral point of view – the standard\nof moral goodness applying to actions is first-personal in character,\nmore closely tied to the quality of the agent’s deliberation in\ndeciding what to do. We can put things in a slightly different way. We\ncan consider an agent’s action as simply an event in the world,\nand evaluate whether we prefer the agent’s having performed it\nto the agent’s having performed some other action. Or we can\nconsider an agent’s action as the outcome of deliberation, as a\ndecision of what the agent is to do as a result of considering the\nvarious reasons in play. It may be that even though,\nconsidered as an event, God’s actualizing a world is necessarily\nsurpassable, considered as an action, as a choice to carry out a plan,\nGod’s actualizing that world is unsurpassable.\n\nIf we think that the evaluation of worlds is distinct from the\nevaluation of actions, then there is room to resist the move from (3)\nto (4), and this is indeed the standard point at which to resist. One\nmight object that this resistance is bound to come to nothing. A world\nis a maximal state of affairs; everything that is morally relevant,\nand thus can give God reason to choose to actualize one world over\nanother, is included in its value. So it of course follows that, from\nthe deliberative perspective, God must have more reason to realize a\nworld with more value, and given the no-best-world scenario, it will\nfollow that God never does what God has most reason to do, and thus\nGod’s action is never supremely morally good. But again, there\nis plenty of room for resistance. It does not follow from the fact\nthat all of the value to be realized in God’s acting is included\nin the world actualized that these are the only reasons that bear on\nGod’s choice. For there may be, in addition to these first-order\nreasons, second-order reasons (Raz 1999, p. 39). A second-order reason\nis a reason to act for, or not to act for, a reason; and that there\nare such reasons makes a difference in assessing actions in terms of\ntheir moral worth. \n\nEngage in a bit of picture-thinking. Suppose we imagine God trying to\nchoose which world to actualize in a no-best-world scenario. We\nimagine God trying to do so on the basis of first-order reasons of the\nvalue of various worlds that might be actualized. But God of course\nwould know that this would be to no avail. God cannot treat the fact\nthat one world realizes more value than another world as a\ndifference-making consideration, for if it were, that would render God\nunable to make any choice. The fact that relying on some consideration\nwould undermine the possibility of reaching a decision is itself a\nconsideration relevant to deliberation; if one has good reason to\nreach a decision, and relying on some consideration precludes one from\nreaching a decision, that very fact constitutes a reason relevant to\none’s deliberation. It is a second-order reason, a reason of a\nsort that Joseph Raz calls “exclusionary”: an exclusionary\nreason is a reason that directs one not to treat a first-order reason\nas relevant in one’s deliberation (Raz 1999, p. 39). \n\nIf this account is right, then the reasons relevant to God’s\ndecision about which world to actualize are not exhausted by the\nfirst-order reasons constituted by the value of the worlds actualized;\nthese reasons also include second-order reasons, reasons that direct\nGod not to make the choice by comparing worlds’ first-order\nvalue. God’s decision to actualize a world might then be morally\nunsurpassable, in that it correctly responds to the reasons relevant\nto the choice in precisely the way that those reasons call for, even\nif the world that is thereby created is surpassable (Howard-Snyder and\nHoward-Snyder 1994; Langtry 2008, pp. 74-78). God might make this\ndecision on the basis of some personal, non-morally-objectionable\nconsiderations rather than on the basis of considerations salient from\nthe moral point of view, or God might just pick, in Ullman-Margalit\nand Morgenbesser’s sense (Ullman-Margalit and Morgenbesser\n1977).\n",
    "section_title": "4. Is perfect goodness possibly exemplified?",
    "entry_title": "Perfect Goodness",
    "hierarchy_title": "Perfect Goodness || Is perfect goodness possibly exemplified?",
    "tokenized_text": [
        "perfect",
        "goodness",
        "possibly",
        "exemplified",
        "perfect",
        "goodness",
        "possibly",
        "exemplified",
        "argument",
        "evil",
        "noted",
        "previous",
        "section",
        "appeal",
        "contingent",
        "fact",
        "world",
        "order",
        "call",
        "question",
        "existence",
        "perfect",
        "goodness",
        "exhibit",
        "perfect",
        "knowledge",
        "power",
        "well",
        "one",
        "might",
        "call",
        "question",
        "existence",
        "without",
        "appeal",
        "supplementary",
        "premise",
        "contingent",
        "fact",
        "concerning",
        "existence",
        "evil",
        "one",
        "might",
        "say",
        "perfect",
        "goodness",
        "even",
        "real",
        "possibility",
        "perfect",
        "goodness",
        "possibility",
        "one",
        "might",
        "think",
        "obvious",
        "whatever",
        "standard",
        "moral",
        "goodness",
        "one",
        "put",
        "forward",
        "ideal",
        "must",
        "standard",
        "possible",
        "agent",
        "meet",
        "ought",
        "least",
        "moral",
        "ought",
        "implies",
        "can",
        "one",
        "might",
        "claim",
        "standard",
        "moral",
        "goodness",
        "really",
        "like",
        "instead",
        "putting",
        "forward",
        "ideal",
        "standard",
        "moral",
        "goodness",
        "comparative",
        "standard",
        "respect",
        "case",
        "appropriate",
        "comparison",
        "standard",
        "moral",
        "goodness",
        "tell",
        "one",
        "two",
        "item",
        "compared",
        "whether",
        "desire",
        "trait",
        "character",
        "action",
        "ordered",
        "respect",
        "one",
        "another",
        "standard",
        "moral",
        "goodness",
        "declares",
        "one",
        "set",
        "desire",
        "morally",
        "better",
        "another",
        "declares",
        "equally",
        "good",
        "declares",
        "one",
        "set",
        "character",
        "trait",
        "better",
        "another",
        "declares",
        "equally",
        "good",
        "declares",
        "one",
        "career",
        "action",
        "better",
        "another",
        "declares",
        "equally",
        "good",
        "put",
        "side",
        "possibility",
        "item",
        "simply",
        "incommensurable",
        "understood",
        "comparative",
        "way",
        "standard",
        "moral",
        "goodness",
        "could",
        "still",
        "honor",
        "ought",
        "implies",
        "perhaps",
        "performing",
        "action",
        "x",
        "morally",
        "better",
        "performing",
        "action",
        "comparison",
        "presupposes",
        "performing",
        "x",
        "possible",
        "performing",
        "possible",
        "a",
        "key",
        "point",
        "understood",
        "comparative",
        "way",
        "obvious",
        "perfect",
        "moral",
        "goodness",
        "possible",
        "may",
        "fact",
        "possible",
        "comparative",
        "moral",
        "standard",
        "together",
        "entail",
        "every",
        "action",
        "might",
        "perform",
        "morally",
        "better",
        "action",
        "possible",
        "perform",
        "possibility",
        "intensively",
        "discussed",
        "respect",
        "best",
        "world",
        "scenario",
        "say",
        "god",
        "actualizes",
        "world",
        "maximal",
        "state",
        "affair",
        "obtains",
        "result",
        "god",
        "choosing",
        "create",
        "choosing",
        "refrain",
        "creating",
        "whether",
        "god",
        "actualizes",
        "world",
        "thus",
        "open",
        "question",
        "god",
        "actualizes",
        "world",
        "question",
        "whether",
        "include",
        "item",
        "god",
        "one",
        "suppose",
        "infinitely",
        "many",
        "possible",
        "world",
        "within",
        "god",
        "power",
        "actualize",
        "world",
        "another",
        "better",
        "moral",
        "perspective",
        "ie",
        "world",
        "one",
        "take",
        "moral",
        "point",
        "view",
        "prefer",
        "world",
        "actual",
        "actual",
        "since",
        "possible",
        "world",
        "maximal",
        "state",
        "affair",
        "god",
        "actualize",
        "one",
        "whichever",
        "world",
        "god",
        "chooses",
        "actualize",
        "true",
        "god",
        "could",
        "actualized",
        "morally",
        "better",
        "one",
        "one",
        "might",
        "think",
        "clear",
        "action",
        "actualizing",
        "world",
        "better",
        "moral",
        "point",
        "view",
        "morally",
        "better",
        "action",
        "actualizing",
        "world",
        "worse",
        "moral",
        "point",
        "view",
        "follows",
        "best",
        "world",
        "scenario",
        "agency",
        "god",
        "could",
        "exhibit",
        "unsurpassable",
        "since",
        "god",
        "perfectly",
        "good",
        "god",
        "agency",
        "unsurpassable",
        "necessarily",
        "god",
        "perfectly",
        "good",
        "argument",
        "follows",
        "necessarily",
        "god",
        "actualizes",
        "world",
        "necessarily",
        "actualizable",
        "world",
        "w",
        "actualizable",
        "world",
        "w",
        "moral",
        "point",
        "view",
        "one",
        "would",
        "prefer",
        "w",
        "w",
        "necessarily",
        "whatever",
        "world",
        "god",
        "actualizes",
        "morally",
        "better",
        "world",
        "god",
        "actualize",
        "yet",
        "could",
        "necessarily",
        "whatever",
        "world",
        "god",
        "actualizes",
        "god",
        "act",
        "actualizing",
        "world",
        "morally",
        "good",
        "act",
        "god",
        "perform",
        "could",
        "necessarily",
        "whatever",
        "world",
        "god",
        "actualizes",
        "god",
        "agency",
        "morally",
        "good",
        "could",
        "necessarily",
        "god",
        "agency",
        "perfectly",
        "good",
        "found",
        "reasoning",
        "nobestworld",
        "noperfectgoodness",
        "persuasive",
        "drawing",
        "different",
        "moral",
        "entailment",
        "leibniz",
        "concludes",
        "god",
        "best",
        "world",
        "essay",
        "justice",
        "god",
        "rowe",
        "wielenberg",
        "contrast",
        "conclude",
        "entailment",
        "serve",
        "part",
        "argument",
        "god",
        "existence",
        "rowe",
        "pp",
        "wielenberg",
        "others",
        "unmoved",
        "main",
        "sticking",
        "point",
        "argument",
        "move",
        "denial",
        "based",
        "possibility",
        "moral",
        "unsurpassability",
        "infinitely",
        "valuable",
        "world",
        "see",
        "climenhaga",
        "detractor",
        "argument",
        "wonder",
        "whether",
        "follows",
        "fact",
        "world",
        "actualized",
        "god",
        "morally",
        "surpassable",
        "act",
        "actualizing",
        "world",
        "morally",
        "surpassable",
        "easy",
        "tempted",
        "following",
        "line",
        "thought",
        "think",
        "action",
        "state",
        "affair",
        "evaluated",
        "term",
        "moral",
        "goodness",
        "way",
        "state",
        "affair",
        "evaluated",
        "pretty",
        "straightforward",
        "argument",
        "view",
        "act",
        "actualizing",
        "world",
        "surpassable",
        "one",
        "prefers",
        "moral",
        "point",
        "view",
        "obtaining",
        "possible",
        "world",
        "w",
        "obtaining",
        "possible",
        "world",
        "w",
        "seems",
        "plausible",
        "one",
        "would",
        "moral",
        "point",
        "view",
        "prefer",
        "god",
        "actualizing",
        "w",
        "god",
        "actualizing",
        "w",
        "line",
        "thought",
        "requires",
        "assumption",
        "standard",
        "moral",
        "goodness",
        "applies",
        "action",
        "virtue",
        "agency",
        "count",
        "morally",
        "good",
        "standard",
        "applies",
        "state",
        "affair",
        "generally",
        "obvious",
        "one",
        "might",
        "think",
        "standard",
        "moral",
        "goodness",
        "applying",
        "state",
        "affair",
        "thirdpersonal",
        "character",
        "one",
        "considers",
        "various",
        "item",
        "asks",
        "one",
        "would",
        "prefer",
        "particular",
        "perspective",
        "moral",
        "point",
        "view",
        "standard",
        "moral",
        "goodness",
        "applying",
        "action",
        "firstpersonal",
        "character",
        "closely",
        "tied",
        "quality",
        "agent",
        "deliberation",
        "deciding",
        "put",
        "thing",
        "slightly",
        "different",
        "way",
        "consider",
        "agent",
        "action",
        "simply",
        "event",
        "world",
        "evaluate",
        "whether",
        "prefer",
        "agent",
        "performed",
        "agent",
        "performed",
        "action",
        "consider",
        "agent",
        "action",
        "outcome",
        "deliberation",
        "decision",
        "agent",
        "result",
        "considering",
        "various",
        "reason",
        "play",
        "may",
        "even",
        "though",
        "considered",
        "event",
        "god",
        "actualizing",
        "world",
        "necessarily",
        "surpassable",
        "considered",
        "action",
        "choice",
        "carry",
        "plan",
        "god",
        "actualizing",
        "world",
        "unsurpassable",
        "think",
        "evaluation",
        "world",
        "distinct",
        "evaluation",
        "action",
        "room",
        "resist",
        "move",
        "indeed",
        "standard",
        "point",
        "resist",
        "one",
        "might",
        "object",
        "resistance",
        "bound",
        "come",
        "nothing",
        "world",
        "maximal",
        "state",
        "affair",
        "everything",
        "morally",
        "relevant",
        "thus",
        "give",
        "god",
        "reason",
        "choose",
        "actualize",
        "one",
        "world",
        "another",
        "included",
        "value",
        "course",
        "follows",
        "deliberative",
        "perspective",
        "god",
        "must",
        "reason",
        "realize",
        "world",
        "value",
        "given",
        "nobestworld",
        "scenario",
        "follow",
        "god",
        "never",
        "god",
        "reason",
        "thus",
        "god",
        "action",
        "never",
        "supremely",
        "morally",
        "good",
        "plenty",
        "room",
        "resistance",
        "follow",
        "fact",
        "value",
        "realized",
        "god",
        "acting",
        "included",
        "world",
        "actualized",
        "reason",
        "bear",
        "god",
        "choice",
        "may",
        "addition",
        "firstorder",
        "reason",
        "secondorder",
        "reason",
        "raz",
        "p",
        "secondorder",
        "reason",
        "reason",
        "act",
        "act",
        "reason",
        "reason",
        "make",
        "difference",
        "assessing",
        "action",
        "term",
        "moral",
        "worth",
        "engage",
        "bit",
        "picturethinking",
        "suppose",
        "imagine",
        "god",
        "trying",
        "choose",
        "world",
        "actualize",
        "nobestworld",
        "scenario",
        "imagine",
        "god",
        "trying",
        "basis",
        "firstorder",
        "reason",
        "value",
        "various",
        "world",
        "might",
        "actualized",
        "god",
        "course",
        "would",
        "know",
        "would",
        "avail",
        "god",
        "treat",
        "fact",
        "one",
        "world",
        "realizes",
        "value",
        "another",
        "world",
        "differencemaking",
        "consideration",
        "would",
        "render",
        "god",
        "unable",
        "make",
        "choice",
        "fact",
        "relying",
        "consideration",
        "would",
        "undermine",
        "possibility",
        "reaching",
        "decision",
        "consideration",
        "relevant",
        "deliberation",
        "one",
        "good",
        "reason",
        "reach",
        "decision",
        "relying",
        "consideration",
        "precludes",
        "one",
        "reaching",
        "decision",
        "fact",
        "constitutes",
        "reason",
        "relevant",
        "one",
        "deliberation",
        "secondorder",
        "reason",
        "reason",
        "sort",
        "joseph",
        "raz",
        "call",
        "exclusionary",
        "exclusionary",
        "reason",
        "reason",
        "directs",
        "one",
        "treat",
        "firstorder",
        "reason",
        "relevant",
        "one",
        "deliberation",
        "raz",
        "p",
        "account",
        "right",
        "reason",
        "relevant",
        "god",
        "decision",
        "world",
        "actualize",
        "exhausted",
        "firstorder",
        "reason",
        "constituted",
        "value",
        "world",
        "actualized",
        "reason",
        "also",
        "include",
        "secondorder",
        "reason",
        "reason",
        "direct",
        "god",
        "make",
        "choice",
        "comparing",
        "world",
        "firstorder",
        "value",
        "god",
        "decision",
        "actualize",
        "world",
        "might",
        "morally",
        "unsurpassable",
        "correctly",
        "responds",
        "reason",
        "relevant",
        "choice",
        "precisely",
        "way",
        "reason",
        "call",
        "even",
        "world",
        "thereby",
        "created",
        "surpassable",
        "howardsnyder",
        "howardsnyder",
        "langtry",
        "pp",
        "god",
        "might",
        "make",
        "decision",
        "basis",
        "personal",
        "nonmorallyobjectionable",
        "consideration",
        "rather",
        "basis",
        "consideration",
        "salient",
        "moral",
        "point",
        "view",
        "god",
        "might",
        "pick",
        "ullmanmargalit",
        "morgenbesser",
        "sense",
        "ullmanmargalit",
        "morgenbesser"
    ]
}