{
    "main_text": "Perfectionism in Politics || Indirect Arguments\n3.6 Indirect Arguments\n\n\nThe principle of state neutrality, the harm principle, and the\npurported right to ethical independence all impose moral limits on the\npower of governments to promote the good or the means by which they can\nuse to promote the good. But sometimes it is claimed not that\nperfectionist politics are in principle illegitimate, but rather that\nthey are or would be self-defeating. The best way for the state to\npromote the good, it is sometimes claimed, is for it to refrain\nscrupulously from all direct efforts at promoting the good (Kymlicka\n1990, 199–205). An indirect argument against perfectionist politics\nthus grants that it is permissible for the state to promote good human\nlives, but seeks to shows that efforts by the state to do so will fail.\nIndirect arguments of this kind take different forms. Some arguments\nappeal to the nature of the human good, while others point to the\nincompetence of modern governments.\n\n\nThe most influential argument that appeals to the nature of the\nhuman good holds that for an activity or relationship to improve a\nperson’s life he or she must endorse its value. This argument, which is\noften referred to as the endorsement constraint, holds that\npolitical measures that compel or guide people into activities or\npursuits that they do not value will be counterproductive. These\nmeasures will not improve the lives of anyone; and they may do harm by\ndirecting people away from activities and pursuits that would add value\nto their lives.\n\n\nThe endorsement constraint is based on a simple idea. To add value\nto a human life, an activity or relationship must be affirmed from the\ninside. “No life goes better by being led from the outside\naccording to values the person does not endorse” (Kymlicka 1990,\n203). Questions can be raised about what constitutes endorsement of an\nactivity. For example, does endorsement require a positive affirmation\nof the value of an activity or does it merely require that one not be\nalienated from it? Different versions of the endorsement constraint can\nbe distinguished depending on how the motive that is taken to condition\nthe value of activities is characterized. And different versions of the\nendorsement constraint will have different implications for state\npolicies. Suppose, for example, that many citizens have no opinion\nwhatsoever on the value of art and that they are induced to attend art\nmuseums because their government gives them a tax break for doing so.\nHere they do not endorse the activity in the strong sense of positively\naffirming its value. Nevertheless, the government policy of giving tax\nbreaks to citizens who attend art museums may do some good if\nendorsement does not require positive affirmation. If the citizens are\nnot alienated from the activity, then they may derive value from\nit.\n\n\nThe endorsement constraint looks particularly compelling when\ncertain examples are considered. To take one such example: it is widely\nthought that for religious worship to add value to a life it must be\ntrue that the person actually sees the value of religious worship from\n“the inside.” Critics of the endorsement constraint contend\nthat the argument overgeneralizes from these plausible examples (Wall\n1998). Critics also contend that the endorsement constraint has real\nforce when directed at state efforts to compel people to pursue\nparticular activities, but much less force when directed at state\nefforts to discourage, or forbid, certain worthless activities (Hurka\n1995, 47–48). For example, if the state criminalizes prostitution, then\nit need not compel anyone to pursue an activity that he or she judges\nto be of no value. Closing off a worthless option can leave many\nworthwhile options open for people to pursue according to their own\njudgments about the value of these options.\n\n\nThe endorsement constraint can be bolstered so that it speaks\nagainst state efforts to screen off bad options, even when these\nefforts leave citizens free to pursue valuable options according to\ntheir own judgments. The endorsement constraint, it is sometimes\nclaimed, is necessary to ensure that people lead lives of ethical\nintegrity. To lead a life of ethical integrity one must respond well to\nthe challenge one’s life presents one with. And such a challenge, or so\nit may be argued, cannot be made better when “it has been\nnarrowed, simplified, and bowdlerized by others in advance”\n(Dworkin 1995, 271).\n\n\nThis defense of the endorsement constraint grounds it in a\nbackground conception of a good human life, one that holds that the\ngoodness of a human life lies in “the inherent value of a skilled\nperformance of living” (Dworkin 1995, 244). This background\nconception of a good human life (a conception Ronald Dworkin refers to\nas “the challenge model”) has been subject to telling\ncriticism (Arneson 2003); but its availability nicely illustrates how\nan ethical concern for promoting good human lives can ground resistance\nto perfectionist state policies designed to promote such lives.\n\n\nRather than appealing to a background conception of a good human\nlife, indirect arguments more frequently appeal to more mundane facts\nabout the competence of modern governments. For a variety of reasons,\nit is often thought that modern governments simply are not up to the\ntask of promoting the good. It will be helpful to distinguish local\nfrom global versions of this objection. It might be true that a\nparticular state should not directly promote the good. Those in power\nin this state might hold false beliefs about the good, for example. In\naddition, it might be true that states in general should not directly\npromote certain objective goods. Friendship is a good that plausibly\ncontributes to the objective value of human lives, but if states try to\npromote it directly they may do more harm than good. These are both\ninstances of local worries about perfectionist politics.\n\n\nThe global objection generalizes from either or both of these\nworries. It holds either that all states lack the competence to promote\nthe good or that all (or perhaps most) goods are such that it would be\ncounterproductive for the state directly to promote them. Local worries\nabout the effectiveness of perfectionist politics present no deep\nproblem for perfectionist political theory. No serious writer on\npolitics does not share them to some extent. Global distrust of\nperfectionist politics, however, may seem to present a genuine\nobjection. If global distrust of the competence of modern governments\nto promote the good were warranted, then the best policy for states to\nadopt might be state neutrality. For consequentialist reasons, a\nperfectionist approach to politics could recommend that the state never\naim to promote the good.\n\n\nThe global objection rests on very strong claims. Perfectionists can\nreply that those who advance them exaggerate valid worries about the\npotential for states to abuse their power. In addition, they can argue\nthat the global objection threatens more than perfectionist politics.\nIf states cannot competently promote the good, then, for the same\nreasons, they may not be able to enforce justice competently either\n(Caney 1991). Finally, perfectionists can argue that institutional\nsafeguards, such as legally codified rights, can be effective in\npreventing the abuse of state power, including state power that\npromotes perfectionist goods (Sher 1997).\n\n\nBe this as it may, it is important not to confuse means with ends.\nThe end of perfectionist politics is the protection and promotion of\nobjective goods and/or objectively valuable human lives. The question\nof where and how often the state should rely on indirect, rather than\ndirect, measures to promote the good is a question within perfectionist\npolitical\n theory.[18]\nThough nothing of much importance turns on it, one could categorize a\nview that holds that perfectionist political ends are, for contingent\nreasons, always best pursued indirectly as a genuine instance of\nperfectionism. Indeed, one can imagine a view that holds that\nperfectionist political ends will be best achieved if no state official\naccepts the perfectionist approach to politics. This would be an\nextreme limiting case—a self-effacing perfectionism, but\nperhaps a perfectionist theory of politics nonetheless.\nAlternatively, one might conclude that a perfectionism that always\ncounseled its own rejection would not be worthy of the name.\n",
    "section_title": "3.6 Indirect Arguments",
    "entry_title": "Perfectionism in Moral and Political Philosophy",
    "hierarchy_title": "Perfectionism in Moral and Political Philosophy || Perfectionism in Politics || Indirect Arguments",
    "tokenized_text": [
        "perfectionism",
        "politics",
        "indirect",
        "argument",
        "indirect",
        "argument",
        "principle",
        "state",
        "neutrality",
        "harm",
        "principle",
        "purported",
        "right",
        "ethical",
        "independence",
        "impose",
        "moral",
        "limit",
        "power",
        "government",
        "promote",
        "good",
        "mean",
        "use",
        "promote",
        "good",
        "sometimes",
        "claimed",
        "perfectionist",
        "politics",
        "principle",
        "illegitimate",
        "rather",
        "would",
        "selfdefeating",
        "best",
        "way",
        "state",
        "promote",
        "good",
        "sometimes",
        "claimed",
        "refrain",
        "scrupulously",
        "direct",
        "effort",
        "promoting",
        "good",
        "kymlicka",
        "indirect",
        "argument",
        "perfectionist",
        "politics",
        "thus",
        "grant",
        "permissible",
        "state",
        "promote",
        "good",
        "human",
        "life",
        "seek",
        "show",
        "effort",
        "state",
        "fail",
        "indirect",
        "argument",
        "kind",
        "take",
        "different",
        "form",
        "argument",
        "appeal",
        "nature",
        "human",
        "good",
        "others",
        "point",
        "incompetence",
        "modern",
        "government",
        "influential",
        "argument",
        "appeal",
        "nature",
        "human",
        "good",
        "hold",
        "activity",
        "relationship",
        "improve",
        "person",
        "life",
        "must",
        "endorse",
        "value",
        "argument",
        "often",
        "referred",
        "endorsement",
        "constraint",
        "hold",
        "political",
        "measure",
        "compel",
        "guide",
        "people",
        "activity",
        "pursuit",
        "value",
        "counterproductive",
        "measure",
        "improve",
        "life",
        "anyone",
        "may",
        "harm",
        "directing",
        "people",
        "away",
        "activity",
        "pursuit",
        "would",
        "add",
        "value",
        "life",
        "endorsement",
        "constraint",
        "based",
        "simple",
        "idea",
        "add",
        "value",
        "human",
        "life",
        "activity",
        "relationship",
        "must",
        "affirmed",
        "inside",
        "life",
        "go",
        "better",
        "led",
        "outside",
        "according",
        "value",
        "person",
        "endorse",
        "kymlicka",
        "question",
        "raised",
        "constitutes",
        "endorsement",
        "activity",
        "example",
        "endorsement",
        "require",
        "positive",
        "affirmation",
        "value",
        "activity",
        "merely",
        "require",
        "one",
        "alienated",
        "different",
        "version",
        "endorsement",
        "constraint",
        "distinguished",
        "depending",
        "motive",
        "taken",
        "condition",
        "value",
        "activity",
        "characterized",
        "different",
        "version",
        "endorsement",
        "constraint",
        "different",
        "implication",
        "state",
        "policy",
        "suppose",
        "example",
        "many",
        "citizen",
        "opinion",
        "whatsoever",
        "value",
        "art",
        "induced",
        "attend",
        "art",
        "museum",
        "government",
        "give",
        "tax",
        "break",
        "endorse",
        "activity",
        "strong",
        "sense",
        "positively",
        "affirming",
        "value",
        "nevertheless",
        "government",
        "policy",
        "giving",
        "tax",
        "break",
        "citizen",
        "attend",
        "art",
        "museum",
        "may",
        "good",
        "endorsement",
        "require",
        "positive",
        "affirmation",
        "citizen",
        "alienated",
        "activity",
        "may",
        "derive",
        "value",
        "endorsement",
        "constraint",
        "look",
        "particularly",
        "compelling",
        "certain",
        "example",
        "considered",
        "take",
        "one",
        "example",
        "widely",
        "thought",
        "religious",
        "worship",
        "add",
        "value",
        "life",
        "must",
        "true",
        "person",
        "actually",
        "see",
        "value",
        "religious",
        "worship",
        "inside",
        "critic",
        "endorsement",
        "constraint",
        "contend",
        "argument",
        "overgeneralizes",
        "plausible",
        "example",
        "wall",
        "critic",
        "also",
        "contend",
        "endorsement",
        "constraint",
        "real",
        "force",
        "directed",
        "state",
        "effort",
        "compel",
        "people",
        "pursue",
        "particular",
        "activity",
        "much",
        "le",
        "force",
        "directed",
        "state",
        "effort",
        "discourage",
        "forbid",
        "certain",
        "worthless",
        "activity",
        "hurka",
        "example",
        "state",
        "criminalizes",
        "prostitution",
        "need",
        "compel",
        "anyone",
        "pursue",
        "activity",
        "judge",
        "value",
        "closing",
        "worthless",
        "option",
        "leave",
        "many",
        "worthwhile",
        "option",
        "open",
        "people",
        "pursue",
        "according",
        "judgment",
        "value",
        "option",
        "endorsement",
        "constraint",
        "bolstered",
        "speaks",
        "state",
        "effort",
        "screen",
        "bad",
        "option",
        "even",
        "effort",
        "leave",
        "citizen",
        "free",
        "pursue",
        "valuable",
        "option",
        "according",
        "judgment",
        "endorsement",
        "constraint",
        "sometimes",
        "claimed",
        "necessary",
        "ensure",
        "people",
        "lead",
        "life",
        "ethical",
        "integrity",
        "lead",
        "life",
        "ethical",
        "integrity",
        "one",
        "must",
        "respond",
        "well",
        "challenge",
        "one",
        "life",
        "present",
        "one",
        "challenge",
        "may",
        "argued",
        "made",
        "better",
        "narrowed",
        "simplified",
        "bowdlerized",
        "others",
        "advance",
        "dworkin",
        "defense",
        "endorsement",
        "constraint",
        "ground",
        "background",
        "conception",
        "good",
        "human",
        "life",
        "one",
        "hold",
        "goodness",
        "human",
        "life",
        "lie",
        "inherent",
        "value",
        "skilled",
        "performance",
        "living",
        "dworkin",
        "background",
        "conception",
        "good",
        "human",
        "life",
        "conception",
        "ronald",
        "dworkin",
        "refers",
        "challenge",
        "model",
        "subject",
        "telling",
        "criticism",
        "arneson",
        "availability",
        "nicely",
        "illustrates",
        "ethical",
        "concern",
        "promoting",
        "good",
        "human",
        "life",
        "ground",
        "resistance",
        "perfectionist",
        "state",
        "policy",
        "designed",
        "promote",
        "life",
        "rather",
        "appealing",
        "background",
        "conception",
        "good",
        "human",
        "life",
        "indirect",
        "argument",
        "frequently",
        "appeal",
        "mundane",
        "fact",
        "competence",
        "modern",
        "government",
        "variety",
        "reason",
        "often",
        "thought",
        "modern",
        "government",
        "simply",
        "task",
        "promoting",
        "good",
        "helpful",
        "distinguish",
        "local",
        "global",
        "version",
        "objection",
        "might",
        "true",
        "particular",
        "state",
        "directly",
        "promote",
        "good",
        "power",
        "state",
        "might",
        "hold",
        "false",
        "belief",
        "good",
        "example",
        "addition",
        "might",
        "true",
        "state",
        "general",
        "directly",
        "promote",
        "certain",
        "objective",
        "good",
        "friendship",
        "good",
        "plausibly",
        "contributes",
        "objective",
        "value",
        "human",
        "life",
        "state",
        "try",
        "promote",
        "directly",
        "may",
        "harm",
        "good",
        "instance",
        "local",
        "worry",
        "perfectionist",
        "politics",
        "global",
        "objection",
        "generalizes",
        "either",
        "worry",
        "hold",
        "either",
        "state",
        "lack",
        "competence",
        "promote",
        "good",
        "perhaps",
        "good",
        "would",
        "counterproductive",
        "state",
        "directly",
        "promote",
        "local",
        "worry",
        "effectiveness",
        "perfectionist",
        "politics",
        "present",
        "deep",
        "problem",
        "perfectionist",
        "political",
        "theory",
        "serious",
        "writer",
        "politics",
        "share",
        "extent",
        "global",
        "distrust",
        "perfectionist",
        "politics",
        "however",
        "may",
        "seem",
        "present",
        "genuine",
        "objection",
        "global",
        "distrust",
        "competence",
        "modern",
        "government",
        "promote",
        "good",
        "warranted",
        "best",
        "policy",
        "state",
        "adopt",
        "might",
        "state",
        "neutrality",
        "consequentialist",
        "reason",
        "perfectionist",
        "approach",
        "politics",
        "could",
        "recommend",
        "state",
        "never",
        "aim",
        "promote",
        "good",
        "global",
        "objection",
        "rest",
        "strong",
        "claim",
        "perfectionist",
        "reply",
        "advance",
        "exaggerate",
        "valid",
        "worry",
        "potential",
        "state",
        "abuse",
        "power",
        "addition",
        "argue",
        "global",
        "objection",
        "threatens",
        "perfectionist",
        "politics",
        "state",
        "competently",
        "promote",
        "good",
        "reason",
        "may",
        "able",
        "enforce",
        "justice",
        "competently",
        "either",
        "caney",
        "finally",
        "perfectionist",
        "argue",
        "institutional",
        "safeguard",
        "legally",
        "codified",
        "right",
        "effective",
        "preventing",
        "abuse",
        "state",
        "power",
        "including",
        "state",
        "power",
        "promotes",
        "perfectionist",
        "good",
        "sher",
        "may",
        "important",
        "confuse",
        "mean",
        "end",
        "end",
        "perfectionist",
        "politics",
        "protection",
        "promotion",
        "objective",
        "good",
        "andor",
        "objectively",
        "valuable",
        "human",
        "life",
        "question",
        "often",
        "state",
        "rely",
        "indirect",
        "rather",
        "direct",
        "measure",
        "promote",
        "good",
        "question",
        "within",
        "perfectionist",
        "political",
        "theory",
        "though",
        "nothing",
        "much",
        "importance",
        "turn",
        "one",
        "could",
        "categorize",
        "view",
        "hold",
        "perfectionist",
        "political",
        "end",
        "contingent",
        "reason",
        "always",
        "best",
        "pursued",
        "indirectly",
        "genuine",
        "instance",
        "perfectionism",
        "indeed",
        "one",
        "imagine",
        "view",
        "hold",
        "perfectionist",
        "political",
        "end",
        "best",
        "achieved",
        "state",
        "official",
        "accepts",
        "perfectionist",
        "approach",
        "politics",
        "would",
        "extreme",
        "limiting",
        "casea",
        "selfeffacing",
        "perfectionism",
        "perhaps",
        "perfectionist",
        "theory",
        "politics",
        "nonetheless",
        "alternatively",
        "one",
        "might",
        "conclude",
        "perfectionism",
        "always",
        "counseled",
        "rejection",
        "would",
        "worthy",
        "name"
    ]
}