{
    "main_text": "Introduction\n1. Introduction\n\n\nWhen people living in some region of the world declare that their\ngroup has the right to live autonomously, they are saying that they\nought to be allowed to govern themselves. In making this claim, they\nare, in essence, rejecting the political and legal authority of those\nnot in their group. They are insisting that whatever power these\noutsiders may have over them, this power is illegitimate; they, and\nthey alone, have the authority to determine and enforce the rules and\npolicies that govern their lives.\n\n\nWhen an individual makes a similar declaration about some sphere of\nher own life, she, too, is denying that anyone else has the authority\nto control her activity within this sphere; she is saying that any\nexercise of power over this activity is illegitimate unless she\nauthorizes it herself. Most of the reasons that can be offered in\nsupport of this claim have correlates in the case of demands for group\nautonomy. But there is one very important exception: a reason that\ntakes us beyond politics, to the metaphysics of agency.\n\n\nAn agent is one who acts. In order to act, one must initiate one’s\naction. And one cannot initiate one’s action without exercising one’s\npower to do so. Since nothing and no one has the power to act except\nthe agent herself, she alone is entitled to exercise this power, if she\nis entitled to act. This means that insofar as someone is an agent,\ni.e., insofar as she is one who acts—she is correct to regard\nher own commitments to acting, her own judgments and decisions about\nhow she should act, as authoritative. Indeed, if she were to challenge\nthe authority that is an essential feature of her judgments and\ndecisions, then they would cease to be her own practical conclusions.\nTheir power to move her would cease to be a manifestation of her power\nto move herself; it would not be the power of her own agency.\n\n\nIn short, every agent has an authority over herself that is\ngrounded, not in her political or social role, nor in any law or\ncustom, but in the simple fact that she alone can initiate her actions.\nTo be sure, it might be unwise for someone to follow the commands she\ngives to herself when she “makes up her mind.” The point,\nhowever, is that she has no conceivable option. In order to form an\nintention to do one thing rather than another, an agent must regard her\nown judgment about how to act as authoritative—even if it is\nonly the judgment that she should follow the command or advice of\nsomeone else. This tight connection between being an agent and having\nauthority has no correlate in cases where the authority at issue is\npolitical. Anyone can coherently (and often plausibly) challenge the\npolitical authority of some individual or group. Even a political\nleader herself can with good reason believe that her political power is\nillegitimate, and that exercising this power is unjustified.\n\n\nDespite the special inalienable nature of our authority over\nourselves, it is possible for us to fail to govern ourselves, just as\nit is possible for a political leader to fail to govern those who fall\nwithin her domain. Indeed, precisely because our authority over our own\nactions is an intrinsic feature of our agency, our deference to this\nauthority is but the form of self-government. It is no guarantee that\nwhenever we act, the forces that move us owe their power to\nour power to decide what to do. Just as a political leader’s\nofficial status is compatible with her having no real power to call the\nshots, so too, a person can have an authoritative status with respect\nto her motives without having any real power over them. Though it is an\nagent’s job to determine how she will act, she can do this job without\nreally being in control. Of course, no one can govern herself without\nbeing subject to influences whose power does not derive from her own\nauthority: everything we do is a response to past and present\ncircumstances over which we have no control. But some of the forces\nthat move us to act do not merely affect which actions we choose to\nperform, nor how we govern ourselves in making these choices. They\ninfluence us in a way that makes a mockery of our authority to\ndetermine our own actions. They undermine our autonomy.\n\n\nWhat distinguishes autonomy-undermining influences on a person’s\ndecision, intention, or will from those motivating forces that merely\nplay a role in the self-governing process? This is the question that\nall accounts of autonomy try to answer. As the number and variety of\nthese accounts indicate, the distinction is extremely elusive. There is\ncertainly widespread agreement about the paradigm threats to personal\nautonomy: brainwashing and addiction are the favorite examples in the\nphilosophical literature. But philosophers seem unable to reach a\nconsensus about the precise nature of these threats. They cannot agree\nabout how it is that certain influences on our behavior prevent us from\ngoverning ourselves.\n\n\nThis disagreement about the defining characteristics of autonomous\nagency reflects the fact that even as concrete examples appear to call\nattention to a very real difference between those who govern themselves\nand those who do not, there are significant conceptual obstacles to\nmaking sense of this distinction. These obstacles are tied to the very\nfeature of agency mentioned above—the feature that appears to\nsupport the demand that individuals be granted considerable political\nand legal power. If an agent fails to govern herself when she acts,\nthis must be because what she does is independent of her power to\ndetermine how she will act. But if she necessarily has the authority to\ndetermine how she will act, and if this essential feature of agency is\ninseparable from the fact that she necessarily defers to herself\nwhenever she initiates her action, then how can her behavior possibly\nescape her control? Intuitively, an agent can fall under the sway of\ndesires, or urges, or compulsions whose power is at odds with her own\npower as an agent; she can be moved by such impulses “in spite of\nherself.” But in what sense, exactly, are such motives\n“external” to the agent herself? How can their\npower to move her fail to be a manifestation of her power to\nact? How can their power reduce her authorization of her action to a\nmere formality? It is difficult to answer these questions when the\ngoverning agent and the agent she governs are one and the same.\n\n\n(Again, the perplexity to which these questions give voice does not\nhave a correlate in the political case. We can easily grasp the idea of\na country’s army (or legislative body, or cabinet ministers) dictating\nto the president what legislation he must approve; for in this case\nthere are (at least) two independently identifiable \ndecision-makers—each with its own point of view, each with its own power. The\ndifficulty in the case where the relevant powers are all within the\npsyche of a single individual agent is that there is no such\nindependently identifiable pair of standpoints in terms of which we can\ndistinguish the powers that bully this agent from the powers that can\nbe attributed to the agent herself. An account of the conditions under\nwhich an individual agent is bullied by her motives is, at the same\ntime, an account of what makes a motive external to the agent’s own\nstandpoint.)\n",
    "section_title": "1. Introduction",
    "entry_title": "Personal Autonomy",
    "hierarchy_title": "Personal Autonomy || Introduction",
    "tokenized_text": [
        "introduction",
        "introduction",
        "people",
        "living",
        "region",
        "world",
        "declare",
        "group",
        "right",
        "live",
        "autonomously",
        "saying",
        "ought",
        "allowed",
        "govern",
        "making",
        "claim",
        "essence",
        "rejecting",
        "political",
        "legal",
        "authority",
        "group",
        "insisting",
        "whatever",
        "power",
        "outsider",
        "may",
        "power",
        "illegitimate",
        "alone",
        "authority",
        "determine",
        "enforce",
        "rule",
        "policy",
        "govern",
        "life",
        "individual",
        "make",
        "similar",
        "declaration",
        "sphere",
        "life",
        "denying",
        "anyone",
        "else",
        "authority",
        "control",
        "activity",
        "within",
        "sphere",
        "saying",
        "exercise",
        "power",
        "activity",
        "illegitimate",
        "unless",
        "authorizes",
        "reason",
        "offered",
        "support",
        "claim",
        "correlate",
        "case",
        "demand",
        "group",
        "autonomy",
        "one",
        "important",
        "exception",
        "reason",
        "take",
        "u",
        "beyond",
        "politics",
        "metaphysics",
        "agency",
        "agent",
        "one",
        "act",
        "order",
        "act",
        "one",
        "must",
        "initiate",
        "one",
        "action",
        "one",
        "initiate",
        "one",
        "action",
        "without",
        "exercising",
        "one",
        "power",
        "since",
        "nothing",
        "one",
        "power",
        "act",
        "except",
        "agent",
        "alone",
        "entitled",
        "exercise",
        "power",
        "entitled",
        "act",
        "mean",
        "insofar",
        "someone",
        "agent",
        "ie",
        "insofar",
        "one",
        "actsshe",
        "correct",
        "regard",
        "commitment",
        "acting",
        "judgment",
        "decision",
        "act",
        "authoritative",
        "indeed",
        "challenge",
        "authority",
        "essential",
        "feature",
        "judgment",
        "decision",
        "would",
        "cease",
        "practical",
        "conclusion",
        "power",
        "move",
        "would",
        "cease",
        "manifestation",
        "power",
        "move",
        "would",
        "power",
        "agency",
        "short",
        "every",
        "agent",
        "authority",
        "grounded",
        "political",
        "social",
        "role",
        "law",
        "custom",
        "simple",
        "fact",
        "alone",
        "initiate",
        "action",
        "sure",
        "might",
        "unwise",
        "someone",
        "follow",
        "command",
        "give",
        "make",
        "mind",
        "point",
        "however",
        "conceivable",
        "option",
        "order",
        "form",
        "intention",
        "one",
        "thing",
        "rather",
        "another",
        "agent",
        "must",
        "regard",
        "judgment",
        "act",
        "authoritativeeven",
        "judgment",
        "follow",
        "command",
        "advice",
        "someone",
        "else",
        "tight",
        "connection",
        "agent",
        "authority",
        "correlate",
        "case",
        "authority",
        "issue",
        "political",
        "anyone",
        "coherently",
        "often",
        "plausibly",
        "challenge",
        "political",
        "authority",
        "individual",
        "group",
        "even",
        "political",
        "leader",
        "good",
        "reason",
        "believe",
        "political",
        "power",
        "illegitimate",
        "exercising",
        "power",
        "unjustified",
        "despite",
        "special",
        "inalienable",
        "nature",
        "authority",
        "possible",
        "u",
        "fail",
        "govern",
        "possible",
        "political",
        "leader",
        "fail",
        "govern",
        "fall",
        "within",
        "domain",
        "indeed",
        "precisely",
        "authority",
        "action",
        "intrinsic",
        "feature",
        "agency",
        "deference",
        "authority",
        "form",
        "selfgovernment",
        "guarantee",
        "whenever",
        "act",
        "force",
        "move",
        "u",
        "owe",
        "power",
        "power",
        "decide",
        "political",
        "leader",
        "official",
        "status",
        "compatible",
        "real",
        "power",
        "call",
        "shot",
        "person",
        "authoritative",
        "status",
        "respect",
        "motif",
        "without",
        "real",
        "power",
        "though",
        "agent",
        "job",
        "determine",
        "act",
        "job",
        "without",
        "really",
        "control",
        "course",
        "one",
        "govern",
        "without",
        "subject",
        "influence",
        "whose",
        "power",
        "derive",
        "authority",
        "everything",
        "response",
        "past",
        "present",
        "circumstance",
        "control",
        "force",
        "move",
        "u",
        "act",
        "merely",
        "affect",
        "action",
        "choose",
        "perform",
        "govern",
        "making",
        "choice",
        "influence",
        "u",
        "way",
        "make",
        "mockery",
        "authority",
        "determine",
        "action",
        "undermine",
        "autonomy",
        "distinguishes",
        "autonomyundermining",
        "influence",
        "person",
        "decision",
        "intention",
        "motivating",
        "force",
        "merely",
        "play",
        "role",
        "selfgoverning",
        "process",
        "question",
        "account",
        "autonomy",
        "try",
        "answer",
        "number",
        "variety",
        "account",
        "indicate",
        "distinction",
        "extremely",
        "elusive",
        "certainly",
        "widespread",
        "agreement",
        "paradigm",
        "threat",
        "personal",
        "autonomy",
        "brainwashing",
        "addiction",
        "favorite",
        "example",
        "philosophical",
        "literature",
        "philosopher",
        "seem",
        "unable",
        "reach",
        "consensus",
        "precise",
        "nature",
        "threat",
        "agree",
        "certain",
        "influence",
        "behavior",
        "prevent",
        "u",
        "governing",
        "disagreement",
        "defining",
        "characteristic",
        "autonomous",
        "agency",
        "reflects",
        "fact",
        "even",
        "concrete",
        "example",
        "appear",
        "call",
        "attention",
        "real",
        "difference",
        "govern",
        "significant",
        "conceptual",
        "obstacle",
        "making",
        "sense",
        "distinction",
        "obstacle",
        "tied",
        "feature",
        "agency",
        "mentioned",
        "abovethe",
        "feature",
        "appears",
        "support",
        "demand",
        "individual",
        "granted",
        "considerable",
        "political",
        "legal",
        "power",
        "agent",
        "fails",
        "govern",
        "act",
        "must",
        "independent",
        "power",
        "determine",
        "act",
        "necessarily",
        "authority",
        "determine",
        "act",
        "essential",
        "feature",
        "agency",
        "inseparable",
        "fact",
        "necessarily",
        "defers",
        "whenever",
        "initiate",
        "action",
        "behavior",
        "possibly",
        "escape",
        "control",
        "intuitively",
        "agent",
        "fall",
        "sway",
        "desire",
        "urge",
        "compulsion",
        "whose",
        "power",
        "odds",
        "power",
        "agent",
        "moved",
        "impulse",
        "spite",
        "herself",
        "sense",
        "exactly",
        "motif",
        "external",
        "agent",
        "power",
        "move",
        "fail",
        "manifestation",
        "power",
        "act",
        "power",
        "reduce",
        "authorization",
        "action",
        "mere",
        "formality",
        "difficult",
        "answer",
        "question",
        "governing",
        "agent",
        "agent",
        "governs",
        "one",
        "perplexity",
        "question",
        "give",
        "voice",
        "correlate",
        "political",
        "case",
        "easily",
        "grasp",
        "idea",
        "country",
        "army",
        "legislative",
        "body",
        "cabinet",
        "minister",
        "dictating",
        "president",
        "legislation",
        "must",
        "approve",
        "case",
        "least",
        "two",
        "independently",
        "identifiable",
        "decisionmakerseach",
        "point",
        "view",
        "power",
        "difficulty",
        "case",
        "relevant",
        "power",
        "within",
        "psyche",
        "single",
        "individual",
        "agent",
        "independently",
        "identifiable",
        "pair",
        "standpoint",
        "term",
        "distinguish",
        "power",
        "bully",
        "agent",
        "power",
        "attributed",
        "agent",
        "account",
        "condition",
        "individual",
        "agent",
        "bullied",
        "motif",
        "time",
        "account",
        "make",
        "motive",
        "external",
        "agent",
        "standpoint"
    ]
}