{
    "main_text": "From Phenomena to Phenomenology\n3. From Phenomena to Phenomenology\n\nThe Oxford English Dictionary presents the following\ndefinition: “Phenomenology. a. The science of phenomena as distinct\nfrom being (ontology). b. That division of any science which describes\nand classifies its phenomena. From the Greek phainomenon,\nappearance.” In philosophy, the term is used in the first sense, amid\ndebates of theory and methodology. In physics and philosophy of\nscience, the term is used in the second sense, albeit only\noccasionally.\n\n\nIn its root meaning, then, phenomenology is the study of\nphenomena: literally, appearances as opposed to reality. This\nancient distinction launched philosophy as we emerged from Plato’s\ncave. Yet the discipline of phenomenology did not blossom until the\n20th century and remains poorly understood in many circles of\ncontemporary philosophy. What is that discipline? How did philosophy\nmove from a root concept of phenomena to the discipline of\nphenomenology?\n\n\nOriginally, in the 18th century, “phenomenology” meant the\ntheory of appearances fundamental to empirical knowledge, especially\nsensory appearances.  The Latin term “Phenomenologia” was\nintroduced by Christoph Friedrich Oetinger in 1736.  Subsequently, the\nGerman term “Phänomenologia” was used by Johann\nHeinrich Lambert, a follower of Christian Wolff. Immanuel Kant used\nthe term occasionally in various writings, as did Johann Gottlieb\nFichte.  In 1807, G. W. F. Hegel wrote a book\ntitled Phänomenologie des Geistes (usually translated\nas Phenomenology of Spirit). By 1889 Franz Brentano used the\nterm to characterize what he called “descriptive\npsychology”. From there Edmund Husserl took up the term for his\nnew science of consciousness, and the rest is history.\n\n\nSuppose we say phenomenology studies phenomena: what appears to \nus—and its appearing. How shall we understand phenomena? The term\nhas a rich history in recent centuries, in which we can see traces of\nthe emerging discipline of phenomenology.\n\n\nIn a strict empiricist vein, what appears before the mind are\nsensory data or qualia: either patterns of one’s own sensations (seeing\nred here now, feeling this ticklish feeling, hearing that resonant bass\ntone) or sensible patterns of worldly things, say, the looks and smells\nof flowers (what John Locke called secondary qualities of things). In a\nstrict rationalist vein, by contrast, what appears before the mind are\nideas, rationally formed “clear and distinct ideas” (in René\nDescartes’ ideal). In Immanuel Kant’s theory of knowledge, fusing\nrationalist and empiricist aims, what appears to the mind are phenomena\ndefined as things-as-they-appear or things-as-they-are-represented (in\na synthesis of sensory and conceptual forms of objects-as-known). In\nAuguste Comte’s theory of science, phenomena (phenomenes) are\nthe facts (faits, what occurs) that a given science would\nexplain.\n\n\nIn 18th and 19th century epistemology, then,\nphenomena are the starting points in building knowledge, especially\nscience. Accordingly, in a familiar and still current sense, phenomena\nare whatever we observe (perceive) and seek to explain.\n\n\nAs the discipline of psychology emerged late in the 19th\ncentury, however, phenomena took on a somewhat different guise. In\nFranz Brentano’s Psychology from an Empirical Standpoint\n(1874), phenomena are what occur in the mind: mental phenomena are acts\nof consciousness (or their contents), and physical phenomena are\nobjects of external perception starting with colors and shapes. For\nBrentano, physical phenomena exist “intentionally” in acts of\nconsciousness. This view revives a Medieval notion Brentano called\n“intentional in-existence”, but the ontology remains undeveloped (what\nis it to exist in the mind, and do physical objects exist only in the\nmind?). More generally, we might say, phenomena are whatever we are\nconscious of: objects and events around us, other people, ourselves,\neven (in reflection) our own conscious experiences, as we experience\nthese. In a certain technical sense, phenomena are things as\nthey are given to our consciousness, whether in perception or\nimagination or thought or volition. This conception of phenomena would\nsoon inform the new discipline of phenomenology.\n\n\nBrentano distinguished descriptive psychology from\ngenetic psychology. Where genetic psychology seeks the causes\nof various types of mental phenomena, descriptive psychology defines\nand classifies the various types of mental phenomena, including\nperception, judgment, emotion, etc. According to Brentano, every mental\nphenomenon, or act of consciousness, is directed toward some object,\nand only mental phenomena are so directed. This thesis of intentional\ndirectedness was the hallmark of Brentano’s descriptive psychology. In\n1889 Brentano used the term “phenomenology” for descriptive psychology,\nand the way was paved for Husserl’s new science of phenomenology.\n\n\nPhenomenology as we know it was launched by Edmund Husserl in his\nLogical Investigations (1900–01). Two importantly different\nlines of theory came together in that monumental work: psychological\ntheory, on the heels of Franz Brentano (and also William James, whose\nPrinciples of Psychology appeared in 1891 and greatly\nimpressed Husserl); and logical or semantic theory, on the heels of\nBernard Bolzano and Husserl’s contemporaries who founded modern logic,\nincluding Gottlob Frege. (Interestingly, both lines of research trace\nback to Aristotle, and both reached importantly new results in\nHusserl’s day.)\n\n\nHusserl’s Logical Investigations was inspired by Bolzano’s\nideal of logic, while taking up Brentano’s conception of descriptive\npsychology. In his Theory of Science (1835) Bolzano\ndistinguished between subjective and objective ideas or representations\n(Vorstellungen). In effect Bolzano criticized Kant and before\nhim the classical empiricists and rationalists for failing to make this\nsort of distinction, thereby rendering phenomena merely subjective.\nLogic studies objective ideas, including propositions, which in turn\nmake up objective theories as in the sciences. Psychology would, by\ncontrast, study subjective ideas, the concrete contents (occurrences)\nof mental activities in particular minds at a given time. Husserl was\nafter both, within a single discipline. So phenomena must be\nreconceived as objective intentional contents (sometimes called\nintentional objects) of subjective acts of consciousness. Phenomenology\nwould then study this complex of consciousness and correlated\nphenomena. In Ideas I (Book One, 1913) Husserl introduced two\nGreek words to capture his version of the Bolzanoan distinction:\nnoesis and noema, from the Greek verb\nnoéō (νοέω), meaning to\nperceive, think, intend, whence the noun nous or mind. The\nintentional process of consciousness is called noesis, while\nits ideal content is called\nnoema. The noema of an act of consciousness Husserl\ncharacterized both as an ideal meaning and as “the object as\nintended”. Thus the phenomenon, or object-as-it-appears, becomes the\nnoema, or object-as-it-is-intended. The interpretations of Husserl’s\ntheory of noema have been several and amount to different developments\nof Husserl’s basic theory of intentionality. (Is the noema an aspect of\nthe object intended, or rather a medium of intention?)\n\n\nFor Husserl, then, phenomenology integrates a kind of psychology\nwith a kind of logic. It develops a descriptive or analytic psychology\nin that it describes and analyzes types of subjective mental activity\nor experience, in short, acts of consciousness. Yet it develops a kind\nof logic—a theory of meaning (today we say logical \nsemantics)—in that it describes and analyzes objective contents of\nconsciousness: ideas, concepts, images, propositions, in short, ideal\nmeanings of various types that serve as intentional contents, or\nnoematic meanings, of various types of experience. These contents are\nshareable by different acts of consciousness, and in that sense they\nare objective, ideal meanings. Following Bolzano (and to some extent\nthe platonistic logician Hermann Lotze), Husserl opposed any reduction\nof logic or mathematics or science to mere psychology, to how people\nhappen to think, and in the same spirit he distinguished phenomenology\nfrom mere psychology. For Husserl, phenomenology would study\nconsciousness without reducing the objective and shareable meanings\nthat inhabit experience to merely subjective happenstances. Ideal\nmeaning would be the engine of intentionality in acts of\nconsciousness.\n\n\nA clear conception of phenomenology awaited Husserl’s development of\na clear model of intentionality. Indeed, phenomenology and the modern\nconcept of intentionality emerged hand-in-hand in Husserl’s Logical\nInvestigations (1900–01). With theoretical foundations laid in the\nInvestigations, Husserl would then promote the radical new\nscience of phenomenology in Ideas I (1913). And alternative\nvisions of phenomenology would soon follow.\n",
    "section_title": "3. From Phenomena to Phenomenology",
    "entry_title": "Phenomenology",
    "hierarchy_title": "Phenomenology || From Phenomena to Phenomenology",
    "tokenized_text": [
        "phenomenon",
        "phenomenology",
        "phenomenon",
        "phenomenology",
        "oxford",
        "english",
        "dictionary",
        "present",
        "following",
        "definition",
        "phenomenology",
        "a",
        "science",
        "phenomenon",
        "distinct",
        "ontology",
        "b",
        "division",
        "science",
        "describes",
        "classifies",
        "phenomenon",
        "greek",
        "phainomenon",
        "appearance",
        "philosophy",
        "term",
        "used",
        "first",
        "sense",
        "amid",
        "debate",
        "theory",
        "methodology",
        "physic",
        "philosophy",
        "science",
        "term",
        "used",
        "second",
        "sense",
        "albeit",
        "occasionally",
        "root",
        "meaning",
        "phenomenology",
        "study",
        "phenomenon",
        "literally",
        "appearance",
        "opposed",
        "reality",
        "ancient",
        "distinction",
        "launched",
        "philosophy",
        "emerged",
        "plato",
        "cave",
        "yet",
        "discipline",
        "phenomenology",
        "blossom",
        "th",
        "century",
        "remains",
        "poorly",
        "understood",
        "many",
        "circle",
        "contemporary",
        "philosophy",
        "discipline",
        "philosophy",
        "move",
        "root",
        "concept",
        "phenomenon",
        "discipline",
        "phenomenology",
        "originally",
        "th",
        "century",
        "phenomenology",
        "meant",
        "theory",
        "appearance",
        "fundamental",
        "empirical",
        "knowledge",
        "especially",
        "sensory",
        "appearance",
        "latin",
        "term",
        "phenomenologia",
        "introduced",
        "christoph",
        "friedrich",
        "oetinger",
        "subsequently",
        "german",
        "term",
        "phänomenologia",
        "used",
        "johann",
        "heinrich",
        "lambert",
        "follower",
        "christian",
        "wolff",
        "immanuel",
        "kant",
        "used",
        "term",
        "occasionally",
        "various",
        "writing",
        "johann",
        "gottlieb",
        "fichte",
        "g",
        "w",
        "f",
        "hegel",
        "wrote",
        "book",
        "titled",
        "phänomenologie",
        "de",
        "geistes",
        "usually",
        "translated",
        "phenomenology",
        "spirit",
        "franz",
        "brentano",
        "used",
        "term",
        "characterize",
        "called",
        "descriptive",
        "psychology",
        "edmund",
        "husserl",
        "took",
        "term",
        "new",
        "science",
        "consciousness",
        "rest",
        "history",
        "suppose",
        "say",
        "phenomenology",
        "study",
        "phenomenon",
        "appears",
        "usand",
        "appearing",
        "shall",
        "understand",
        "phenomenon",
        "term",
        "rich",
        "history",
        "recent",
        "century",
        "see",
        "trace",
        "emerging",
        "discipline",
        "phenomenology",
        "strict",
        "empiricist",
        "vein",
        "appears",
        "mind",
        "sensory",
        "data",
        "qualia",
        "either",
        "pattern",
        "one",
        "sensation",
        "seeing",
        "red",
        "feeling",
        "ticklish",
        "feeling",
        "hearing",
        "resonant",
        "bass",
        "tone",
        "sensible",
        "pattern",
        "worldly",
        "thing",
        "say",
        "look",
        "smell",
        "flower",
        "john",
        "locke",
        "called",
        "secondary",
        "quality",
        "thing",
        "strict",
        "rationalist",
        "vein",
        "contrast",
        "appears",
        "mind",
        "idea",
        "rationally",
        "formed",
        "clear",
        "distinct",
        "idea",
        "rené",
        "descartes",
        "ideal",
        "immanuel",
        "kant",
        "theory",
        "knowledge",
        "fusing",
        "rationalist",
        "empiricist",
        "aim",
        "appears",
        "mind",
        "phenomenon",
        "defined",
        "thingsastheyappear",
        "thingsastheyarerepresented",
        "synthesis",
        "sensory",
        "conceptual",
        "form",
        "objectsasknown",
        "auguste",
        "comte",
        "theory",
        "science",
        "phenomenon",
        "phenomenes",
        "fact",
        "faits",
        "occurs",
        "given",
        "science",
        "would",
        "explain",
        "th",
        "th",
        "century",
        "epistemology",
        "phenomenon",
        "starting",
        "point",
        "building",
        "knowledge",
        "especially",
        "science",
        "accordingly",
        "familiar",
        "still",
        "current",
        "sense",
        "phenomenon",
        "whatever",
        "observe",
        "perceive",
        "seek",
        "explain",
        "discipline",
        "psychology",
        "emerged",
        "late",
        "th",
        "century",
        "however",
        "phenomenon",
        "took",
        "somewhat",
        "different",
        "guise",
        "franz",
        "brentano",
        "psychology",
        "empirical",
        "standpoint",
        "phenomenon",
        "occur",
        "mind",
        "mental",
        "phenomenon",
        "act",
        "consciousness",
        "content",
        "physical",
        "phenomenon",
        "object",
        "external",
        "perception",
        "starting",
        "color",
        "shape",
        "brentano",
        "physical",
        "phenomenon",
        "exist",
        "intentionally",
        "act",
        "consciousness",
        "view",
        "revives",
        "medieval",
        "notion",
        "brentano",
        "called",
        "intentional",
        "inexistence",
        "ontology",
        "remains",
        "undeveloped",
        "exist",
        "mind",
        "physical",
        "object",
        "exist",
        "mind",
        "generally",
        "might",
        "say",
        "phenomenon",
        "whatever",
        "conscious",
        "object",
        "event",
        "around",
        "u",
        "people",
        "even",
        "reflection",
        "conscious",
        "experience",
        "experience",
        "certain",
        "technical",
        "sense",
        "phenomenon",
        "thing",
        "given",
        "consciousness",
        "whether",
        "perception",
        "imagination",
        "thought",
        "volition",
        "conception",
        "phenomenon",
        "would",
        "soon",
        "inform",
        "new",
        "discipline",
        "phenomenology",
        "brentano",
        "distinguished",
        "descriptive",
        "psychology",
        "genetic",
        "psychology",
        "genetic",
        "psychology",
        "seek",
        "cause",
        "various",
        "type",
        "mental",
        "phenomenon",
        "descriptive",
        "psychology",
        "defines",
        "classifies",
        "various",
        "type",
        "mental",
        "phenomenon",
        "including",
        "perception",
        "judgment",
        "emotion",
        "etc",
        "according",
        "brentano",
        "every",
        "mental",
        "phenomenon",
        "act",
        "consciousness",
        "directed",
        "toward",
        "object",
        "mental",
        "phenomenon",
        "directed",
        "thesis",
        "intentional",
        "directedness",
        "hallmark",
        "brentano",
        "descriptive",
        "psychology",
        "brentano",
        "used",
        "term",
        "phenomenology",
        "descriptive",
        "psychology",
        "way",
        "paved",
        "husserl",
        "new",
        "science",
        "phenomenology",
        "phenomenology",
        "know",
        "launched",
        "edmund",
        "husserl",
        "logical",
        "investigation",
        "two",
        "importantly",
        "different",
        "line",
        "theory",
        "came",
        "together",
        "monumental",
        "work",
        "psychological",
        "theory",
        "heel",
        "franz",
        "brentano",
        "also",
        "william",
        "james",
        "whose",
        "principle",
        "psychology",
        "appeared",
        "greatly",
        "impressed",
        "husserl",
        "logical",
        "semantic",
        "theory",
        "heel",
        "bernard",
        "bolzano",
        "husserl",
        "contemporary",
        "founded",
        "modern",
        "logic",
        "including",
        "gottlob",
        "frege",
        "interestingly",
        "line",
        "research",
        "trace",
        "back",
        "aristotle",
        "reached",
        "importantly",
        "new",
        "result",
        "husserl",
        "day",
        "husserl",
        "logical",
        "investigation",
        "inspired",
        "bolzano",
        "ideal",
        "logic",
        "taking",
        "brentano",
        "conception",
        "descriptive",
        "psychology",
        "theory",
        "science",
        "bolzano",
        "distinguished",
        "subjective",
        "objective",
        "idea",
        "representation",
        "vorstellungen",
        "effect",
        "bolzano",
        "criticized",
        "kant",
        "classical",
        "empiricist",
        "rationalist",
        "failing",
        "make",
        "sort",
        "distinction",
        "thereby",
        "rendering",
        "phenomenon",
        "merely",
        "subjective",
        "logic",
        "study",
        "objective",
        "idea",
        "including",
        "proposition",
        "turn",
        "make",
        "objective",
        "theory",
        "science",
        "psychology",
        "would",
        "contrast",
        "study",
        "subjective",
        "idea",
        "concrete",
        "content",
        "occurrence",
        "mental",
        "activity",
        "particular",
        "mind",
        "given",
        "time",
        "husserl",
        "within",
        "single",
        "discipline",
        "phenomenon",
        "must",
        "reconceived",
        "objective",
        "intentional",
        "content",
        "sometimes",
        "called",
        "intentional",
        "object",
        "subjective",
        "act",
        "consciousness",
        "phenomenology",
        "would",
        "study",
        "complex",
        "consciousness",
        "correlated",
        "phenomenon",
        "idea",
        "book",
        "one",
        "husserl",
        "introduced",
        "two",
        "greek",
        "word",
        "capture",
        "version",
        "bolzanoan",
        "distinction",
        "noesis",
        "noema",
        "greek",
        "verb",
        "noéō",
        "νοέω",
        "meaning",
        "perceive",
        "think",
        "intend",
        "whence",
        "noun",
        "nous",
        "mind",
        "intentional",
        "process",
        "consciousness",
        "called",
        "noesis",
        "ideal",
        "content",
        "called",
        "noema",
        "noema",
        "act",
        "consciousness",
        "husserl",
        "characterized",
        "ideal",
        "meaning",
        "object",
        "intended",
        "thus",
        "phenomenon",
        "objectasitappears",
        "becomes",
        "noema",
        "objectasitisintended",
        "interpretation",
        "husserl",
        "theory",
        "noema",
        "several",
        "amount",
        "different",
        "development",
        "husserl",
        "basic",
        "theory",
        "intentionality",
        "noema",
        "aspect",
        "object",
        "intended",
        "rather",
        "medium",
        "intention",
        "husserl",
        "phenomenology",
        "integrates",
        "kind",
        "psychology",
        "kind",
        "logic",
        "develops",
        "descriptive",
        "analytic",
        "psychology",
        "describes",
        "analyzes",
        "type",
        "subjective",
        "mental",
        "activity",
        "experience",
        "short",
        "act",
        "consciousness",
        "yet",
        "develops",
        "kind",
        "logica",
        "theory",
        "meaning",
        "today",
        "say",
        "logical",
        "semantics",
        "in",
        "describes",
        "analyzes",
        "objective",
        "content",
        "consciousness",
        "idea",
        "concept",
        "image",
        "proposition",
        "short",
        "ideal",
        "meaning",
        "various",
        "type",
        "serve",
        "intentional",
        "content",
        "noematic",
        "meaning",
        "various",
        "type",
        "experience",
        "content",
        "shareable",
        "different",
        "act",
        "consciousness",
        "sense",
        "objective",
        "ideal",
        "meaning",
        "following",
        "bolzano",
        "extent",
        "platonistic",
        "logician",
        "hermann",
        "lotze",
        "husserl",
        "opposed",
        "reduction",
        "logic",
        "mathematics",
        "science",
        "mere",
        "psychology",
        "people",
        "happen",
        "think",
        "spirit",
        "distinguished",
        "phenomenology",
        "mere",
        "psychology",
        "husserl",
        "phenomenology",
        "would",
        "study",
        "consciousness",
        "without",
        "reducing",
        "objective",
        "shareable",
        "meaning",
        "inhabit",
        "experience",
        "merely",
        "subjective",
        "happenstance",
        "ideal",
        "meaning",
        "would",
        "engine",
        "intentionality",
        "act",
        "consciousness",
        "clear",
        "conception",
        "phenomenology",
        "awaited",
        "husserl",
        "development",
        "clear",
        "model",
        "intentionality",
        "indeed",
        "phenomenology",
        "modern",
        "concept",
        "intentionality",
        "emerged",
        "handinhand",
        "husserl",
        "logical",
        "investigation",
        "theoretical",
        "foundation",
        "laid",
        "investigation",
        "husserl",
        "would",
        "promote",
        "radical",
        "new",
        "science",
        "phenomenology",
        "idea",
        "alternative",
        "vision",
        "phenomenology",
        "would",
        "soon",
        "follow"
    ]
}