{
    "main_text": "Phenomenology and Philosophy of Mind\n6. Phenomenology and Philosophy of Mind\n\n\nIt ought to be obvious that phenomenology has a lot to say in the\narea called philosophy of mind. Yet the traditions of phenomenology and\nanalytic philosophy of mind have not been closely joined, despite\noverlapping areas of interest. So it is appropriate to close this\nsurvey of phenomenology by addressing philosophy of mind, one of the\nmost vigorously debated areas in recent philosophy.\n\n\nThe tradition of analytic philosophy began, early in the 20th\ncentury, with analyses of language, notably in the works of Gottlob\nFrege, Bertrand Russell, and Ludwig Wittgenstein. Then in The Concept\nof Mind (1949) Gilbert Ryle developed a series of analyses of language\nabout different mental states, including sensation, belief, and will.\nThough Ryle is commonly deemed a philosopher of ordinary language, Ryle\nhimself said The Concept of Mind could be called phenomenology. In\neffect, Ryle analyzed our phenomenological understanding of mental\nstates as reflected in ordinary language about the mind. From this\nlinguistic phenomenology Ryle argued that Cartesian mind-body dualism\ninvolves a category mistake (the logic or grammar of mental \nverbs—“believe”, “see”, etc.—does not\nmean that we ascribe belief, sensation, etc., to “the ghost in\nthe machine”). With Ryle’s rejection of mind-body dualism, the\nmind-body problem was re-awakened: what is the ontology of mind\nvis-à-vis body, and how are mind and body related?\n\n\nRené Descartes, in his epoch-making Meditations on First\nPhilosophy (1641), had argued that minds and bodies are two distinct\nkinds of being or substance with two distinct kinds of attributes or\nmodes: bodies are characterized by spatiotemporal physical properties,\nwhile minds are characterized by properties of thinking (including\nseeing, feeling, etc.). Centuries later, phenomenology would find, with\nBrentano and Husserl, that mental acts are characterized by\nconsciousness and intentionality, while natural science would find that\nphysical systems are characterized by mass and force, ultimately by\ngravitational, electromagnetic, and quantum fields. Where do we find\nconsciousness and intentionality in the\nquantum-electromagnetic-gravitational field that, by hypothesis, orders\neverything in the natural world in which we humans and our minds exist?\nThat is the mind-body problem today. In short, phenomenology by any\nother name lies at the heart of the contemporary mind-body problem.\n\n\nAfter Ryle, philosophers sought a more explicit and generally\nnaturalistic ontology of mind. In the 1950s materialism was argued\nanew, urging that mental states are identical with states of the\ncentral nervous system. The classical identity theory holds that each\ntoken mental state (in a particular person’s mind at a particular time)\nis identical with a token brain state (in that person’s brain at that\ntime). A stronger materialism holds, instead, that each type of mental\nstate is identical with a type of brain state. But materialism does not\nfit comfortably with phenomenology. For it is not obvious how conscious\nmental states as we experience them—sensations, thoughts,\nemotions—can simply be the complex neural states that somehow\nsubserve or implement them. If mental states and neural states are\nsimply identical, in token or in type, where in our scientific theory\nof mind does the phenomenology occur—is it not simply replaced\nby neuroscience? And yet experience is part of what is to be explained\nby neuroscience.\n\n\nIn the late 1960s and 1970s the computer model of mind set in, and\nfunctionalism became the dominant model of mind. On this model, mind is\nnot what the brain consists in (electrochemical transactions in neurons\nin vast complexes). Instead, mind is what brains do: their function of\nmediating between information coming into the organism and behavior\nproceeding from the organism. Thus, a mental state is a functional\nstate of the brain or of the human (or animal) organism. More\nspecifically, on a favorite variation of functionalism, the mind is a\ncomputing system: mind is to brain as software is to hardware; thoughts\nare just programs running on the brain’s “wetware”. Since\nthe 1970s the cognitive sciences—from experimental studies of\ncognition to neuroscience—have tended toward a mix of\nmaterialism and functionalism. Gradually, however, philosophers found\nthat phenomenological aspects of the mind pose problems for the\nfunctionalist paradigm too.\n\n\nIn the early 1970s Thomas Nagel argued in “What Is It Like to\nBe a Bat?” (1974) that consciousness itself—especially\nthe subjective character of what it is like to have a certain type of\nexperience—escapes physical theory. Many philosophers pressed\nthe case that sensory qualia—what it is like to feel pain, to\nsee red, etc.—are not addressed or explained by a physical\naccount of either brain structure or brain function. Consciousness has\nproperties of its own. And yet, we know, it is closely tied to the\nbrain. And, at some level of description, neural activities implement\ncomputation.\n\n\nIn the 1980s John Searle argued in Intentionality (1983) (and\nfurther in The Rediscovery of the Mind (1991)) that intentionality and\nconsciousness are essential properties of mental states. For Searle,\nour brains produce mental states with properties of consciousness and\nintentionality, and this is all part of our biology, yet consciousness\nand intentionality require a “first-person” ontology.\nSearle also argued that computers simulate but do not have mental\nstates characterized by intentionality. As Searle argued, a computer\nsystem has a syntax (processing symbols of certain shapes) but has no\nsemantics (the symbols lack meaning: we interpret the symbols). In this\nway Searle rejected both materialism and functionalism, while insisting\nthat mind is a biological property of organisms like us: our brains\n“secrete” consciousness.\n\n\nThe analysis of consciousness and intentionality is central to\nphenomenology as appraised above, and Searle’s theory of intentionality\nreads like a modernized version of Husserl’s. (Contemporary logical\ntheory takes the form of stating truth conditions for propositions, and\nSearle characterizes a mental state’s intentionality by specifying its\n“satisfaction conditions”). However, there is an important\ndifference in background theory. For Searle explicitly assumes the\nbasic worldview of natural science, holding that consciousness is part\nof nature. But Husserl explicitly brackets that assumption, and later\nphenomenologists—including Heidegger, Sartre, \nMerleau-Ponty—seem to seek a certain sanctuary for phenomenology beyond the\nnatural sciences. And yet phenomenology itself should be largely\nneutral about further theories of how experience arises, notably from\nbrain activity.\n\n\nSince the late 1980s, and especially the late 1990s, a variety of\nwriters working in philosophy of mind have focused on the fundamental\ncharacter of consciousness, ultimately a phenomenological issue. Does\nconsciousness always and essentially involve self-consciousness, or\nconsciousness-of-consciousness, as Brentano, Husserl, and Sartre held\n(in varying detail)? If so, then every act of consciousness either\nincludes or is adjoined by a consciousness-of-that-consciousness. Does\nthat self-consciousness take the form of an internal self-monitoring?\nIf so, is that monitoring of a higher order, where each act of\nconsciousness is joined by a further mental act monitoring the base\nact? Or is such monitoring of the same order as the base act, a proper\npart of the act without which the act would not be conscious? A variety\nof models of this self-consciousness have been developed, some\nexplicitly drawing on or adapting views in Brentano, Husserl, and\nSartre. Two recent collections address these issues: David Woodruff\nSmith and Amie L. Thomasson (editors), Phenomenology and Philosophy of\nMind (2005), and Uriah Kriegel and Kenneth Williford (editors),\nSelf-Representational Approaches to Consciousness (2006).\n\n\nThe philosophy of mind may be factored into the following\ndisciplines or ranges of theory relevant to mind:\n\nPhenomenology\nstudies conscious experience as experienced, analyzing the \nstructure—the types, intentional forms and meanings, dynamics, and\n(certain) enabling conditions—of perception, thought,\nimagination, emotion, and volition and action.\nNeuroscience studies\nthe neural activities that serve as biological substrate to the various\ntypes of mental activity, including conscious experience. Neuroscience\nwill be framed by evolutionary biology (explaining how neural phenomena\nevolved) and ultimately by basic physics (explaining how biological\nphenomena are grounded in physical phenomena). Here lie the intricacies\nof the natural sciences. Part of what the sciences are accountable for\nis the structure of experience, analyzed by phenomenology.\nCultural analysis\nstudies the social practices that help to shape or serve as cultural\nsubstrate of the various types of mental activity, including conscious\nexperience, typically manifest in embodied action. Here we study the\nimport of language and other social practices, including background\nattitudes or assumptions, sometimes involving particular political\nsystems.\nOntology of mind\nstudies the ontological type of mental activity in general, ranging\nfrom perception (which involves causal input from environment to\nexperience) to volitional action (which involves causal output from\nvolition to bodily movement).\n\n\n\nThis division of labor in the theory of mind can be seen as an\nextension of Brentano’s original distinction between descriptive and\ngenetic psychology. Phenomenology offers descriptive analyses of mental\nphenomena, while neuroscience (and wider biology and ultimately\nphysics) offers models of explanation of what causes or gives rise to\nmental phenomena. Cultural theory offers analyses of social activities\nand their impact on experience, including ways language shapes our\nthought, emotion, and motivation. And ontology frames all these results\nwithin a basic scheme of the structure of the world, including our own\nminds.\n\n\nThe ontological distinction among the form, appearance, and substrate\nof an activity of consciousness is detailed in D. W. Smith, Mind World\n(2004), in the essay “Three Facets of Consciousness”.\n\n\nMeanwhile, from an epistemological standpoint, all these ranges of\ntheory about mind begin with how we observe and reason about and seek\nto explain phenomena we encounter in the world. And that is where\nphenomenology begins. Moreover, how we understand each piece of\ntheory, including theory about mind, is central to the theory of\nintentionality, as it were, the semantics of thought and experience in\ngeneral. And that is the heart of phenomenology.\n",
    "section_title": "6. Phenomenology and Philosophy of Mind",
    "entry_title": "Phenomenology",
    "hierarchy_title": "Phenomenology || Phenomenology and Philosophy of Mind",
    "tokenized_text": [
        "phenomenology",
        "philosophy",
        "mind",
        "phenomenology",
        "philosophy",
        "mind",
        "ought",
        "obvious",
        "phenomenology",
        "lot",
        "say",
        "area",
        "called",
        "philosophy",
        "mind",
        "yet",
        "tradition",
        "phenomenology",
        "analytic",
        "philosophy",
        "mind",
        "closely",
        "joined",
        "despite",
        "overlapping",
        "area",
        "interest",
        "appropriate",
        "close",
        "survey",
        "phenomenology",
        "addressing",
        "philosophy",
        "mind",
        "one",
        "vigorously",
        "debated",
        "area",
        "recent",
        "philosophy",
        "tradition",
        "analytic",
        "philosophy",
        "began",
        "early",
        "th",
        "century",
        "analysis",
        "language",
        "notably",
        "work",
        "gottlob",
        "frege",
        "bertrand",
        "russell",
        "ludwig",
        "wittgenstein",
        "concept",
        "mind",
        "gilbert",
        "ryle",
        "developed",
        "series",
        "analysis",
        "language",
        "different",
        "mental",
        "state",
        "including",
        "sensation",
        "belief",
        "though",
        "ryle",
        "commonly",
        "deemed",
        "philosopher",
        "ordinary",
        "language",
        "ryle",
        "said",
        "concept",
        "mind",
        "could",
        "called",
        "phenomenology",
        "effect",
        "ryle",
        "analyzed",
        "phenomenological",
        "understanding",
        "mental",
        "state",
        "reflected",
        "ordinary",
        "language",
        "mind",
        "linguistic",
        "phenomenology",
        "ryle",
        "argued",
        "cartesian",
        "mindbody",
        "dualism",
        "involves",
        "category",
        "mistake",
        "logic",
        "grammar",
        "mental",
        "verbs",
        "believe",
        "see",
        "etcdoes",
        "mean",
        "ascribe",
        "belief",
        "sensation",
        "etc",
        "ghost",
        "machine",
        "ryle",
        "rejection",
        "mindbody",
        "dualism",
        "mindbody",
        "problem",
        "reawakened",
        "ontology",
        "mind",
        "visàvis",
        "body",
        "mind",
        "body",
        "related",
        "rené",
        "descartes",
        "epochmaking",
        "meditation",
        "first",
        "philosophy",
        "argued",
        "mind",
        "body",
        "two",
        "distinct",
        "kind",
        "substance",
        "two",
        "distinct",
        "kind",
        "attribute",
        "mode",
        "body",
        "characterized",
        "spatiotemporal",
        "physical",
        "property",
        "mind",
        "characterized",
        "property",
        "thinking",
        "including",
        "seeing",
        "feeling",
        "etc",
        "century",
        "later",
        "phenomenology",
        "would",
        "find",
        "brentano",
        "husserl",
        "mental",
        "act",
        "characterized",
        "consciousness",
        "intentionality",
        "natural",
        "science",
        "would",
        "find",
        "physical",
        "system",
        "characterized",
        "mass",
        "force",
        "ultimately",
        "gravitational",
        "electromagnetic",
        "quantum",
        "field",
        "find",
        "consciousness",
        "intentionality",
        "quantumelectromagneticgravitational",
        "field",
        "hypothesis",
        "order",
        "everything",
        "natural",
        "world",
        "human",
        "mind",
        "exist",
        "mindbody",
        "problem",
        "today",
        "short",
        "phenomenology",
        "name",
        "lie",
        "heart",
        "contemporary",
        "mindbody",
        "problem",
        "ryle",
        "philosopher",
        "sought",
        "explicit",
        "generally",
        "naturalistic",
        "ontology",
        "mind",
        "s",
        "materialism",
        "argued",
        "anew",
        "urging",
        "mental",
        "state",
        "identical",
        "state",
        "central",
        "nervous",
        "system",
        "classical",
        "identity",
        "theory",
        "hold",
        "token",
        "mental",
        "state",
        "particular",
        "person",
        "mind",
        "particular",
        "time",
        "identical",
        "token",
        "brain",
        "state",
        "person",
        "brain",
        "time",
        "stronger",
        "materialism",
        "hold",
        "instead",
        "type",
        "mental",
        "state",
        "identical",
        "type",
        "brain",
        "state",
        "materialism",
        "fit",
        "comfortably",
        "phenomenology",
        "obvious",
        "conscious",
        "mental",
        "state",
        "experience",
        "themsensations",
        "thought",
        "emotionscan",
        "simply",
        "complex",
        "neural",
        "state",
        "somehow",
        "subserve",
        "implement",
        "mental",
        "state",
        "neural",
        "state",
        "simply",
        "identical",
        "token",
        "type",
        "scientific",
        "theory",
        "mind",
        "phenomenology",
        "occuris",
        "simply",
        "replaced",
        "neuroscience",
        "yet",
        "experience",
        "part",
        "explained",
        "neuroscience",
        "late",
        "s",
        "s",
        "computer",
        "model",
        "mind",
        "set",
        "functionalism",
        "became",
        "dominant",
        "model",
        "mind",
        "model",
        "mind",
        "brain",
        "consists",
        "electrochemical",
        "transaction",
        "neuron",
        "vast",
        "complex",
        "instead",
        "mind",
        "brain",
        "function",
        "mediating",
        "information",
        "coming",
        "organism",
        "behavior",
        "proceeding",
        "organism",
        "thus",
        "mental",
        "state",
        "functional",
        "state",
        "brain",
        "human",
        "animal",
        "organism",
        "specifically",
        "favorite",
        "variation",
        "functionalism",
        "mind",
        "computing",
        "system",
        "mind",
        "brain",
        "software",
        "hardware",
        "thought",
        "program",
        "running",
        "brain",
        "wetware",
        "since",
        "s",
        "cognitive",
        "sciencesfrom",
        "experimental",
        "study",
        "cognition",
        "neurosciencehave",
        "tended",
        "toward",
        "mix",
        "materialism",
        "functionalism",
        "gradually",
        "however",
        "philosopher",
        "found",
        "phenomenological",
        "aspect",
        "mind",
        "pose",
        "problem",
        "functionalist",
        "paradigm",
        "early",
        "s",
        "thomas",
        "nagel",
        "argued",
        "like",
        "bat",
        "consciousness",
        "itselfespecially",
        "subjective",
        "character",
        "like",
        "certain",
        "type",
        "experienceescapes",
        "physical",
        "theory",
        "many",
        "philosopher",
        "pressed",
        "case",
        "sensory",
        "qualiawhat",
        "like",
        "feel",
        "pain",
        "see",
        "red",
        "etcare",
        "addressed",
        "explained",
        "physical",
        "account",
        "either",
        "brain",
        "structure",
        "brain",
        "function",
        "consciousness",
        "property",
        "yet",
        "know",
        "closely",
        "tied",
        "brain",
        "level",
        "description",
        "neural",
        "activity",
        "implement",
        "computation",
        "s",
        "john",
        "searle",
        "argued",
        "intentionality",
        "rediscovery",
        "mind",
        "intentionality",
        "consciousness",
        "essential",
        "property",
        "mental",
        "state",
        "searle",
        "brain",
        "produce",
        "mental",
        "state",
        "property",
        "consciousness",
        "intentionality",
        "part",
        "biology",
        "yet",
        "consciousness",
        "intentionality",
        "require",
        "firstperson",
        "ontology",
        "searle",
        "also",
        "argued",
        "computer",
        "simulate",
        "mental",
        "state",
        "characterized",
        "intentionality",
        "searle",
        "argued",
        "computer",
        "system",
        "syntax",
        "processing",
        "symbol",
        "certain",
        "shape",
        "semantics",
        "symbol",
        "lack",
        "meaning",
        "interpret",
        "symbol",
        "way",
        "searle",
        "rejected",
        "materialism",
        "functionalism",
        "insisting",
        "mind",
        "biological",
        "property",
        "organism",
        "like",
        "u",
        "brain",
        "secrete",
        "consciousness",
        "analysis",
        "consciousness",
        "intentionality",
        "central",
        "phenomenology",
        "appraised",
        "searle",
        "theory",
        "intentionality",
        "read",
        "like",
        "modernized",
        "version",
        "husserl",
        "contemporary",
        "logical",
        "theory",
        "take",
        "form",
        "stating",
        "truth",
        "condition",
        "proposition",
        "searle",
        "characterizes",
        "mental",
        "state",
        "intentionality",
        "specifying",
        "satisfaction",
        "condition",
        "however",
        "important",
        "difference",
        "background",
        "theory",
        "searle",
        "explicitly",
        "assumes",
        "basic",
        "worldview",
        "natural",
        "science",
        "holding",
        "consciousness",
        "part",
        "nature",
        "husserl",
        "explicitly",
        "bracket",
        "assumption",
        "later",
        "phenomenologistsincluding",
        "heidegger",
        "sartre",
        "merleaupontyseem",
        "seek",
        "certain",
        "sanctuary",
        "phenomenology",
        "beyond",
        "natural",
        "science",
        "yet",
        "phenomenology",
        "largely",
        "neutral",
        "theory",
        "experience",
        "arises",
        "notably",
        "brain",
        "activity",
        "since",
        "late",
        "s",
        "especially",
        "late",
        "s",
        "variety",
        "writer",
        "working",
        "philosophy",
        "mind",
        "focused",
        "fundamental",
        "character",
        "consciousness",
        "ultimately",
        "phenomenological",
        "issue",
        "consciousness",
        "always",
        "essentially",
        "involve",
        "selfconsciousness",
        "consciousnessofconsciousness",
        "brentano",
        "husserl",
        "sartre",
        "held",
        "varying",
        "detail",
        "every",
        "act",
        "consciousness",
        "either",
        "includes",
        "adjoined",
        "consciousnessofthatconsciousness",
        "selfconsciousness",
        "take",
        "form",
        "internal",
        "selfmonitoring",
        "monitoring",
        "higher",
        "order",
        "act",
        "consciousness",
        "joined",
        "mental",
        "act",
        "monitoring",
        "base",
        "act",
        "monitoring",
        "order",
        "base",
        "act",
        "proper",
        "part",
        "act",
        "without",
        "act",
        "would",
        "conscious",
        "variety",
        "model",
        "selfconsciousness",
        "developed",
        "explicitly",
        "drawing",
        "adapting",
        "view",
        "brentano",
        "husserl",
        "sartre",
        "two",
        "recent",
        "collection",
        "address",
        "issue",
        "david",
        "woodruff",
        "smith",
        "amie",
        "l",
        "thomasson",
        "editor",
        "phenomenology",
        "philosophy",
        "mind",
        "uriah",
        "kriegel",
        "kenneth",
        "williford",
        "editor",
        "selfrepresentational",
        "approach",
        "consciousness",
        "philosophy",
        "mind",
        "may",
        "factored",
        "following",
        "discipline",
        "range",
        "theory",
        "relevant",
        "mind",
        "phenomenology",
        "study",
        "conscious",
        "experience",
        "experienced",
        "analyzing",
        "structurethe",
        "type",
        "intentional",
        "form",
        "meaning",
        "dynamic",
        "certain",
        "enabling",
        "conditionsof",
        "perception",
        "thought",
        "imagination",
        "emotion",
        "volition",
        "action",
        "neuroscience",
        "study",
        "neural",
        "activity",
        "serve",
        "biological",
        "substrate",
        "various",
        "type",
        "mental",
        "activity",
        "including",
        "conscious",
        "experience",
        "neuroscience",
        "framed",
        "evolutionary",
        "biology",
        "explaining",
        "neural",
        "phenomenon",
        "evolved",
        "ultimately",
        "basic",
        "physic",
        "explaining",
        "biological",
        "phenomenon",
        "grounded",
        "physical",
        "phenomenon",
        "lie",
        "intricacy",
        "natural",
        "science",
        "part",
        "science",
        "accountable",
        "structure",
        "experience",
        "analyzed",
        "phenomenology",
        "cultural",
        "analysis",
        "study",
        "social",
        "practice",
        "help",
        "shape",
        "serve",
        "cultural",
        "substrate",
        "various",
        "type",
        "mental",
        "activity",
        "including",
        "conscious",
        "experience",
        "typically",
        "manifest",
        "embodied",
        "action",
        "study",
        "import",
        "language",
        "social",
        "practice",
        "including",
        "background",
        "attitude",
        "assumption",
        "sometimes",
        "involving",
        "particular",
        "political",
        "system",
        "ontology",
        "mind",
        "study",
        "ontological",
        "type",
        "mental",
        "activity",
        "general",
        "ranging",
        "perception",
        "involves",
        "causal",
        "input",
        "environment",
        "experience",
        "volitional",
        "action",
        "involves",
        "causal",
        "output",
        "volition",
        "bodily",
        "movement",
        "division",
        "labor",
        "theory",
        "mind",
        "seen",
        "extension",
        "brentano",
        "original",
        "distinction",
        "descriptive",
        "genetic",
        "psychology",
        "phenomenology",
        "offer",
        "descriptive",
        "analysis",
        "mental",
        "phenomenon",
        "neuroscience",
        "wider",
        "biology",
        "ultimately",
        "physic",
        "offer",
        "model",
        "explanation",
        "cause",
        "give",
        "rise",
        "mental",
        "phenomenon",
        "cultural",
        "theory",
        "offer",
        "analysis",
        "social",
        "activity",
        "impact",
        "experience",
        "including",
        "way",
        "language",
        "shape",
        "thought",
        "emotion",
        "motivation",
        "ontology",
        "frame",
        "result",
        "within",
        "basic",
        "scheme",
        "structure",
        "world",
        "including",
        "mind",
        "ontological",
        "distinction",
        "among",
        "form",
        "appearance",
        "substrate",
        "activity",
        "consciousness",
        "detailed",
        "d",
        "w",
        "smith",
        "mind",
        "world",
        "essay",
        "three",
        "facet",
        "consciousness",
        "meanwhile",
        "epistemological",
        "standpoint",
        "range",
        "theory",
        "mind",
        "begin",
        "observe",
        "reason",
        "seek",
        "explain",
        "phenomenon",
        "encounter",
        "world",
        "phenomenology",
        "begin",
        "moreover",
        "understand",
        "piece",
        "theory",
        "including",
        "theory",
        "mind",
        "central",
        "theory",
        "intentionality",
        "semantics",
        "thought",
        "experience",
        "general",
        "heart",
        "phenomenology"
    ]
}