{
    "main_text": "The Munich and Göttingen Circles of Phenomenology: A Brief History\n1. The Munich and Göttingen Circles of Phenomenology: A Brief History\n\nAt the turn of the twentieth century, the relation between philosophy\nand psychology was a topic of intense debate in various academic\ncircles. Among other issues, this debate concerned whether psychology\nshould be understood as a philosophical discipline or, the other way\naround, whether philosophy should be grounded in psychology. Of\nparticular importance to this debate is whether ethical, metaphysical\nand logical concepts are psychological or not. Since these concepts\nare usually held to be constitutive of the corresponding laws of\nethics, metaphysics, and logic, claiming that these concepts are\npsychological would imply that the nature of such laws is\npsychological and, thus, that their investigation is a task that\nshould be assigned to psychology. To give an example, according to\nlogical psychologism (Mohanty 1982: §2; Kusch 2007 [2011]), the\nlaw of the excluded middle is about the psychological impossibility of\na subject judging that p and that non-p at the same time.\nOn this interpretation, this law is psychological in nature and its\ninvestigation should be pursued by psychology. Psychologism was not\nuncontested, as we will see: although the anti-psychologist camp\nencompassed different views as to how logical, ethical, and\nmetaphysical concepts have to be positively defined, these views all\nagreed on the negative insight that logic, ethics, and metaphysics do\nnot depend on psychology.\n\nIt is against this background that Theodor Lipps founded the Academic\nSociety for Psychology in Munich, most likely in 1895. Lipps, who was\nboth a philosopher and a trained psychologist, helped to shape the\nDepartment of Philosophy in Munich, where he became professor in 1894.\nAlthough Lipps revised his initial views over the years, by the end of\nthe nineteenth century he endorsed a psychologistic approach by\npromoting a form of psychology that he at times qualified as\n“descriptive” (1903: 5). Lipps understood descriptive\npsychology as a discipline that, by means of inner perception,\ndescribes, compares, and systematizes mental contents (basically, any\npart of our conscious mental life, see 1903: 5). Lipps maintained that\ninner perception is able to grasp these contents with evidence.\n\nThe meetings of the Society dealt with a broad range of issues at the\nintersection of philosophy and psychology. Some of the topics\ndiscussed in the initial years are: “the sensations and the\ncontents of consciousness as objects of psychology” (1895),\n“the theory of feelings and striving” (1895–1896),\n“the definition of psychology” (1896), etc. (Schuhmann\n2000: 19f). In addition to Lipps, other senior figures of the circle\nwere Alexander Pfänder, Max Ettlinger, and Johannes Daubert. In\nthe decades after its foundation, a rapidly growing community of young\nstudents partook in the activities of the Society. These students\nincluded (in alphabetical order): Maximilian Beck, Alfred Brunswig,\nTheodor Conrad (nephew of Theodor Lipps), Aloys Fischer, August\nGallinger, Moritz Geiger, Dietrich von Hildebrand, Paul Linke, Karl\nLoewenstein-Freudenberg, Karl Löwith, Adolf Reinach, Hermann\nRitzel, Herman Schmalenbach, Otto Selz, Alfred Schwenninger, Gerda\nWalther, and Czesław Znamierowski (Avé-Lallemant 1975a;\nSmid 1982). It is worth noting that Max Scheler, who had been teaching\nin Munich since 1906, also participated in these meetings.\nScheler’s philosophy followed its own peculiar trajectory within\nthe history of phenomenology and deeply influenced the members of the\nMunich and, later on, Göttingen circle.\n\nTradition credits Daubert with the merit of submitting Edmund\nHusserl’s work to the attention of the group in Munich. Daubert\nbegan to discuss Husserl’s Logical Investigations\n(1900–01, henceforth: LI) at the meetings of the Society from\n1902 (Schuhmann 2002; Smid 1985: 269). This two-volume work follows\nHusserl’s first book of 1891, Philosophy of Arithmetic.\nPsychological and Logical Investigations (Hua XII), and is the\nresult of Husserl’s attempt to reconcile the various positions\nthat inspired his thinking in that period and, in particular, the\nlogical realism advocated by authors like Bernard Bolzano, Hermann\nLotze, and Gottlob Frege, and the philosophical psychology of Franz\nBrentano and Carl Stumpf. Briefly after the publication of the LI,\nHusserl was appointed Extraordinary Professor at the University of\nGöttingen, where Daubert paid him a visit in 1903. This was the\nfirst personal contact between Husserl and a member of the Munich\ncircle and has been described as “easily the most important\nsingle event in the history of the Munich Phenomenological\nCircle” (Spiegelberg 1982: 169). As a consequence of this\nmeeting, Husserl was invited to give a lecture at the Society in May\n1904, after which the LI became one of the main philosophical\nreferences for the members of the Munich circle.\n\nAs the following section illustrates, the LI were not received without\nsubstantial criticism, but one element that was explicitly appreciated\nin Husserl’s line of argument was its anti-psychologism, which\nearly phenomenological reading of this work put particular emphasis\non. Husserl devoted extensive efforts especially in the first volume\nof the LI (the Prolegomena to Pure Logic) to show that the\nlaws of logic and ontology are not psychological. Mental acts are\nintentional, i.e., they are directed towards objects and facts that\ntranscend the mind: these objects and facts are not mere contents of\nconsciousness and, thus, have a structure of their own, which is\nregulated by laws of their own. Early phenomenologists thought this\nidea provided the systematic basis for what could be qualified as an\n“objectivist” approach to philosophical problems\n(according to which ontology, logic, ethics and aesthetics are about\nentities with an ontological status of their own, see Conrad 1954\n[1992: 81]; in a similar vein, Geiger speaks of a “turning to\nthe object” in the LI, see Geiger 1933: 13). At the same time,\nthe Prolegomena also questions what it means for mental\nexperiences to be intentionally directed towards objects and asks for\na clarification of the relationship between logic and psychology. The\nsecond volume of the book (Investigations in Phenomenology and\nTheory of Knowledge) attempts to provide a solution to these and\ncognate questions by presenting an articulated theory of\nintentionality, which attracted a more critical reception in early\nphenomenology (partly because this theory was perceived as, to some\nextent, reneging on the anti-psychologist principles of the\nProlegomena, see Conrad-Martius 1959: 177).\n\nIn 1905, Daubert and Reinach began to attend Husserl’s lectures\nin Göttingen. This initiated a trend that culminated in what has\nbeen described as the “Munich invasion” of Göttingen\n(Schapp 1959: 20f): in 1906, several students of Lipps left Munich to\nstudy under Husserl. The first were Moritz Geiger, Alfred\nSchwenninger, and Fritz Weinmann, but others followed: most notably,\nConrad in 1907 and von Hildebrand in 1909. Göttingen became thus\nhome to a large community of young phenomenologists, which included:\nWinthrop Bell, Rudolf Clemens, Hedwig Conrad-Martius, Fritz\nFrankfurter, Siegfried Hamburger, Erich Heinrich, Jean Héring,\nHeinrich Hoffman, Roman Ingarden, Alexandre Koyré, Hans Lipps,\nDietrich Mahnke, Helmuth Plessner, Wilhelm Schapp, Kurt Stavenhagen,\nEdith Stein, and Alfred von Sybel (Avé-Lallemant 1988; Sepp\n1988a).\n\nThis group of scholars gave itself an institutional form when Conrad\nand von Sybel founded the Philosophical Society of Göttingen in\n1907. The pivotal center of this new circle of phenomenology was Adolf\nReinach, who taught at the local university after receiving his\nhabilitation to teach at university level (the venia legendi)\nin 1909. Reinach’s philosophical and didactic skills were so\nadmired that several members referred to him, and not Husserl, as\ntheir teacher in phenomenology (Conrad-Martius 1921; Ingarden 1968\n[1998: 408f]; Stein 1965: 195; von Hildebrand 1975: 78).\n\nThe period that extended from 1906 to the end of the First World War\nwas particularly fruitful in the history of early phenomenology.\nImportant dissertations were submitted and defended (e.g., Conrad in\n1909, Conrad-Martius in 1912 [1913], von Hildebrand in 1912 [1917],\nStein in 1917). In 1911 Pfänder edited the important\nLipps-Festschrift with the title Munich Philosophical\nEssays (1911b), which contains influential articles by Brunswig,\nConrad, Geiger, Reinach, and Pfänder himself. Just two years\nlater, in 1913, the first volume of the Yearbook for Philosophy\nand Phenomenological Research (Jahrbuch für\nPhänomenologie und phänomenologische Forschung)\nappeared: Geiger, Pfänder, Reinach, and Scheler were co-editors,\ntogether with Husserl. By presenting classics such as the first part\nof Pfänder’s On the Psychology of Sentiments,\nGeiger’s Contributions to the Phenomenology of Aesthetic\nEnjoyment, the first part of Scheler’s Formalism in\nEthics and Non-Formal Ethics of Values, and Reinach’s\nThe Apriori Foundations of the Civil Law, this volume\nprobably marks the peak in the philosophical production of the two\ncircles.\n\nThe first volume of the Yearbook also featured\nHusserl’s Ideas Pertaining to a Pure Phenomenology and to a\nPhenomenological Philosophy, where Husserl places transcendental\nphilosophy at the heart of his research agenda in terms that are far\nclearer than those he has used up to that point. Husserl’s\ntranscendental phenomenology has many facets and one aspect is\nparticularly significant for early phenomenologists: this is the idea\nof a necessary correlation between reality and consciousness (Zahavi\n2008: 361). To put this in Husserl’s own words:\n\n\n[a]n object existing in itself is never one with which\nconsciousness or the Ego pertaining to consciousness has nothing to\ndo. (Hua III/1, Eng. trans. 106)\n\n\nHusserl’s so-called transcendental idealism remains a matter of\ndebate today: questions concerning the relation between\nHusserl’s Ideas and his previous works (especially the\nLI) or the exact location of his transcendental phenomenology between\nthe two poles of idealism and realism have not yet found a definite\nanswer in the relevant literature.\n\nIn the Munich and Göttingen circles, Husserl’s\nIdeas was intensively discussed. Parts of its research\nprogram were pursued further; to make just one example, Héring\n(1921) and Ingarden (1925) further developed Husserl’s eidetics\n(ontology of essences). Generally, however, the Ideas\nprovoked what could be seen as a mirror image reaction, for it\nprovided young phenomenologists with an opportunity to renew their\ncommitment to a robust form of metaphysical realism, which was\nperceived as incompatible with Husserl’s transcendental\nidealism. Reality, it was claimed, exists independently of\nsubjectivity (whether this is intended empirically or\ntranscendentally). The clash between these two different approaches to\nphenomenology has been labeled “the realism-idealism\ncontroversy” (Ingarden 1929; Avé-Lallemant 1975b) and\nturned out to be a decisive episode in the history of the\nphenomenological movement. To mention but one of its most important\nconsequences, Husserl referred to Pfänder’s dismissal of\ntranscendental idealism (shared, as he writes, by “the\nphenomenologists of the Munich and Göttingen tradition”) as\nthe main reason for preferring Martin Heidegger as his successor for\nthe professorship in Freiburg in 1928 (Husserl 1994: 180f).\n\nThe tragedy of the Great War not only led to an abrupt stop in the\nscientific output of the two circles, but also contributed to the\ndissolution of the Munich and, in particular, the Göttingen\ngroup. Many among early phenomenologists died at the front: Reinach\nfell in 1917, and his fate was shared by, among others, Clemens,\nFrankfurter, and Ritzel. In 1916, when Husserl moved to Freiburg to\ntake over Heinrich Rickert’s position as chair of philosophy,\nthe “tradition of phenomenology” fostered by the two\ncircles remained active mainly in Munich and Bergzabern (a small city\nin Rhineland-Palatinate, where the Conrads had an estate and regularly\nhosted discussions in which mainly Héring, Koyré, Lipps,\nStein, and von Sybel took part, see Feldes 2015). It was in Munich,\nhowever, that the future of this approach to phenomenology seemed most\nsecure: there, Pfänder became full professor in 1929, and\nGallinger and von Hildebrand taught as Privatdozenten. The\nrise of Nazism in Germany, however, put an end to this group, too. Due\nto his opposition to the regime, von Hildebrand had to flee to the\nUnited States. Gallinger, who was of Jewish origin, left Germany for\nSweden. Geiger (full professor in Göttingen from 1923) was forced\nto retire in 1933. And Stein died in Auschwitz in 1942.\n\nAlthough it could be argued that the Munich and Göttingen eras of\nphenomenology ended in those years, some of its members (e.g.,\nConrad-Martius, von Hildebrand, Ingarden, and Stavenhagen) continued\nto publish and remained active after the Second World War. Their ideas\nhave also directly influenced other authors, including Friedrich\nBassenge, Nicolai Hartmann, Aurel Kolnai, José Ortega y Gasset,\nHerbert Spiegelberg, and Karol Wojtyła.\n",
    "section_title": "1. The Munich and Göttingen Circles of Phenomenology: A Brief History",
    "entry_title": "The Phenomenology of the Munich and Göttingen Circles",
    "hierarchy_title": "The Phenomenology of the Munich and Göttingen Circles || The Munich and Göttingen Circles of Phenomenology: A Brief History",
    "tokenized_text": [
        "munich",
        "göttingen",
        "circle",
        "phenomenology",
        "brief",
        "history",
        "munich",
        "göttingen",
        "circle",
        "phenomenology",
        "brief",
        "history",
        "turn",
        "twentieth",
        "century",
        "relation",
        "philosophy",
        "psychology",
        "topic",
        "intense",
        "debate",
        "various",
        "academic",
        "circle",
        "among",
        "issue",
        "debate",
        "concerned",
        "whether",
        "psychology",
        "understood",
        "philosophical",
        "discipline",
        "way",
        "around",
        "whether",
        "philosophy",
        "grounded",
        "psychology",
        "particular",
        "importance",
        "debate",
        "whether",
        "ethical",
        "metaphysical",
        "logical",
        "concept",
        "psychological",
        "since",
        "concept",
        "usually",
        "held",
        "constitutive",
        "corresponding",
        "law",
        "ethic",
        "metaphysics",
        "logic",
        "claiming",
        "concept",
        "psychological",
        "would",
        "imply",
        "nature",
        "law",
        "psychological",
        "thus",
        "investigation",
        "task",
        "assigned",
        "psychology",
        "give",
        "example",
        "according",
        "logical",
        "psychologism",
        "mohanty",
        "kusch",
        "law",
        "excluded",
        "middle",
        "psychological",
        "impossibility",
        "subject",
        "judging",
        "p",
        "nonp",
        "time",
        "interpretation",
        "law",
        "psychological",
        "nature",
        "investigation",
        "pursued",
        "psychology",
        "psychologism",
        "uncontested",
        "see",
        "although",
        "antipsychologist",
        "camp",
        "encompassed",
        "different",
        "view",
        "logical",
        "ethical",
        "metaphysical",
        "concept",
        "positively",
        "defined",
        "view",
        "agreed",
        "negative",
        "insight",
        "logic",
        "ethic",
        "metaphysics",
        "depend",
        "psychology",
        "background",
        "theodor",
        "lipps",
        "founded",
        "academic",
        "society",
        "psychology",
        "munich",
        "likely",
        "lipps",
        "philosopher",
        "trained",
        "psychologist",
        "helped",
        "shape",
        "department",
        "philosophy",
        "munich",
        "became",
        "professor",
        "although",
        "lipps",
        "revised",
        "initial",
        "view",
        "year",
        "end",
        "nineteenth",
        "century",
        "endorsed",
        "psychologistic",
        "approach",
        "promoting",
        "form",
        "psychology",
        "time",
        "qualified",
        "descriptive",
        "lipps",
        "understood",
        "descriptive",
        "psychology",
        "discipline",
        "mean",
        "inner",
        "perception",
        "describes",
        "compare",
        "systematizes",
        "mental",
        "content",
        "basically",
        "part",
        "conscious",
        "mental",
        "life",
        "see",
        "lipps",
        "maintained",
        "inner",
        "perception",
        "able",
        "grasp",
        "content",
        "evidence",
        "meeting",
        "society",
        "dealt",
        "broad",
        "range",
        "issue",
        "intersection",
        "philosophy",
        "psychology",
        "topic",
        "discussed",
        "initial",
        "year",
        "sensation",
        "content",
        "consciousness",
        "object",
        "psychology",
        "theory",
        "feeling",
        "striving",
        "definition",
        "psychology",
        "etc",
        "schuhmann",
        "f",
        "addition",
        "lipps",
        "senior",
        "figure",
        "circle",
        "alexander",
        "pfänder",
        "max",
        "ettlinger",
        "johannes",
        "daubert",
        "decade",
        "foundation",
        "rapidly",
        "growing",
        "community",
        "young",
        "student",
        "partook",
        "activity",
        "society",
        "student",
        "included",
        "alphabetical",
        "order",
        "maximilian",
        "beck",
        "alfred",
        "brunswig",
        "theodor",
        "conrad",
        "nephew",
        "theodor",
        "lipps",
        "aloys",
        "fischer",
        "august",
        "gallinger",
        "moritz",
        "geiger",
        "dietrich",
        "von",
        "hildebrand",
        "paul",
        "linke",
        "karl",
        "loewensteinfreudenberg",
        "karl",
        "löwith",
        "adolf",
        "reinach",
        "hermann",
        "ritzel",
        "herman",
        "schmalenbach",
        "otto",
        "selz",
        "alfred",
        "schwenninger",
        "gerda",
        "walther",
        "czesław",
        "znamierowski",
        "avélallemant",
        "a",
        "smid",
        "worth",
        "noting",
        "max",
        "scheler",
        "teaching",
        "munich",
        "since",
        "also",
        "participated",
        "meeting",
        "scheler",
        "philosophy",
        "followed",
        "peculiar",
        "trajectory",
        "within",
        "history",
        "phenomenology",
        "deeply",
        "influenced",
        "member",
        "munich",
        "later",
        "göttingen",
        "circle",
        "tradition",
        "credit",
        "daubert",
        "merit",
        "submitting",
        "edmund",
        "husserl",
        "work",
        "attention",
        "group",
        "munich",
        "daubert",
        "began",
        "discus",
        "husserl",
        "logical",
        "investigation",
        "henceforth",
        "li",
        "meeting",
        "society",
        "schuhmann",
        "smid",
        "twovolume",
        "work",
        "follows",
        "husserl",
        "first",
        "book",
        "philosophy",
        "arithmetic",
        "psychological",
        "logical",
        "investigation",
        "hua",
        "xii",
        "result",
        "husserl",
        "attempt",
        "reconcile",
        "various",
        "position",
        "inspired",
        "thinking",
        "period",
        "particular",
        "logical",
        "realism",
        "advocated",
        "author",
        "like",
        "bernard",
        "bolzano",
        "hermann",
        "lotze",
        "gottlob",
        "frege",
        "philosophical",
        "psychology",
        "franz",
        "brentano",
        "carl",
        "stumpf",
        "briefly",
        "publication",
        "li",
        "husserl",
        "appointed",
        "extraordinary",
        "professor",
        "university",
        "göttingen",
        "daubert",
        "paid",
        "visit",
        "first",
        "personal",
        "contact",
        "husserl",
        "member",
        "munich",
        "circle",
        "described",
        "easily",
        "important",
        "single",
        "event",
        "history",
        "munich",
        "phenomenological",
        "circle",
        "spiegelberg",
        "consequence",
        "meeting",
        "husserl",
        "invited",
        "give",
        "lecture",
        "society",
        "may",
        "li",
        "became",
        "one",
        "main",
        "philosophical",
        "reference",
        "member",
        "munich",
        "circle",
        "following",
        "section",
        "illustrates",
        "li",
        "received",
        "without",
        "substantial",
        "criticism",
        "one",
        "element",
        "explicitly",
        "appreciated",
        "husserl",
        "line",
        "argument",
        "antipsychologism",
        "early",
        "phenomenological",
        "reading",
        "work",
        "put",
        "particular",
        "emphasis",
        "husserl",
        "devoted",
        "extensive",
        "effort",
        "especially",
        "first",
        "volume",
        "li",
        "prolegomenon",
        "pure",
        "logic",
        "show",
        "law",
        "logic",
        "ontology",
        "psychological",
        "mental",
        "act",
        "intentional",
        "ie",
        "directed",
        "towards",
        "object",
        "fact",
        "transcend",
        "mind",
        "object",
        "fact",
        "mere",
        "content",
        "consciousness",
        "thus",
        "structure",
        "regulated",
        "law",
        "early",
        "phenomenologists",
        "thought",
        "idea",
        "provided",
        "systematic",
        "basis",
        "could",
        "qualified",
        "objectivist",
        "approach",
        "philosophical",
        "problem",
        "according",
        "ontology",
        "logic",
        "ethic",
        "aesthetic",
        "entity",
        "ontological",
        "status",
        "see",
        "conrad",
        "similar",
        "vein",
        "geiger",
        "speaks",
        "turning",
        "object",
        "li",
        "see",
        "geiger",
        "time",
        "prolegomenon",
        "also",
        "question",
        "mean",
        "mental",
        "experience",
        "intentionally",
        "directed",
        "towards",
        "object",
        "asks",
        "clarification",
        "relationship",
        "logic",
        "psychology",
        "second",
        "volume",
        "book",
        "investigation",
        "phenomenology",
        "theory",
        "knowledge",
        "attempt",
        "provide",
        "solution",
        "cognate",
        "question",
        "presenting",
        "articulated",
        "theory",
        "intentionality",
        "attracted",
        "critical",
        "reception",
        "early",
        "phenomenology",
        "partly",
        "theory",
        "perceived",
        "extent",
        "reneging",
        "antipsychologist",
        "principle",
        "prolegomenon",
        "see",
        "conradmartius",
        "daubert",
        "reinach",
        "began",
        "attend",
        "husserl",
        "lecture",
        "göttingen",
        "initiated",
        "trend",
        "culminated",
        "described",
        "munich",
        "invasion",
        "göttingen",
        "schapp",
        "f",
        "several",
        "student",
        "lipps",
        "left",
        "munich",
        "study",
        "husserl",
        "first",
        "moritz",
        "geiger",
        "alfred",
        "schwenninger",
        "fritz",
        "weinmann",
        "others",
        "followed",
        "notably",
        "conrad",
        "von",
        "hildebrand",
        "göttingen",
        "became",
        "thus",
        "home",
        "large",
        "community",
        "young",
        "phenomenologists",
        "included",
        "winthrop",
        "bell",
        "rudolf",
        "clemens",
        "hedwig",
        "conradmartius",
        "fritz",
        "frankfurter",
        "siegfried",
        "hamburger",
        "erich",
        "heinrich",
        "jean",
        "héring",
        "heinrich",
        "hoffman",
        "roman",
        "ingarden",
        "alexandre",
        "koyré",
        "han",
        "lipps",
        "dietrich",
        "mahnke",
        "helmuth",
        "plessner",
        "wilhelm",
        "schapp",
        "kurt",
        "stavenhagen",
        "edith",
        "stein",
        "alfred",
        "von",
        "sybel",
        "avélallemant",
        "sepp",
        "a",
        "group",
        "scholar",
        "gave",
        "institutional",
        "form",
        "conrad",
        "von",
        "sybel",
        "founded",
        "philosophical",
        "society",
        "göttingen",
        "pivotal",
        "center",
        "new",
        "circle",
        "phenomenology",
        "adolf",
        "reinach",
        "taught",
        "local",
        "university",
        "receiving",
        "habilitation",
        "teach",
        "university",
        "level",
        "venia",
        "legendi",
        "reinach",
        "philosophical",
        "didactic",
        "skill",
        "admired",
        "several",
        "member",
        "referred",
        "husserl",
        "teacher",
        "phenomenology",
        "conradmartius",
        "ingarden",
        "f",
        "stein",
        "von",
        "hildebrand",
        "period",
        "extended",
        "end",
        "first",
        "world",
        "war",
        "particularly",
        "fruitful",
        "history",
        "early",
        "phenomenology",
        "important",
        "dissertation",
        "submitted",
        "defended",
        "eg",
        "conrad",
        "conradmartius",
        "von",
        "hildebrand",
        "stein",
        "pfänder",
        "edited",
        "important",
        "lippsfestschrift",
        "title",
        "munich",
        "philosophical",
        "essay",
        "b",
        "contains",
        "influential",
        "article",
        "brunswig",
        "conrad",
        "geiger",
        "reinach",
        "pfänder",
        "two",
        "year",
        "later",
        "first",
        "volume",
        "yearbook",
        "philosophy",
        "phenomenological",
        "research",
        "jahrbuch",
        "für",
        "phänomenologie",
        "und",
        "phänomenologische",
        "forschung",
        "appeared",
        "geiger",
        "pfänder",
        "reinach",
        "scheler",
        "coeditors",
        "together",
        "husserl",
        "presenting",
        "classic",
        "first",
        "part",
        "pfänder",
        "psychology",
        "sentiment",
        "geiger",
        "contribution",
        "phenomenology",
        "aesthetic",
        "enjoyment",
        "first",
        "part",
        "scheler",
        "formalism",
        "ethic",
        "nonformal",
        "ethic",
        "value",
        "reinach",
        "apriori",
        "foundation",
        "civil",
        "law",
        "volume",
        "probably",
        "mark",
        "peak",
        "philosophical",
        "production",
        "two",
        "circle",
        "first",
        "volume",
        "yearbook",
        "also",
        "featured",
        "husserl",
        "idea",
        "pertaining",
        "pure",
        "phenomenology",
        "phenomenological",
        "philosophy",
        "husserl",
        "place",
        "transcendental",
        "philosophy",
        "heart",
        "research",
        "agenda",
        "term",
        "far",
        "clearer",
        "used",
        "point",
        "husserl",
        "transcendental",
        "phenomenology",
        "many",
        "facet",
        "one",
        "aspect",
        "particularly",
        "significant",
        "early",
        "phenomenologists",
        "idea",
        "necessary",
        "correlation",
        "reality",
        "consciousness",
        "zahavi",
        "put",
        "husserl",
        "word",
        "n",
        "object",
        "existing",
        "never",
        "one",
        "consciousness",
        "ego",
        "pertaining",
        "consciousness",
        "nothing",
        "hua",
        "iii",
        "eng",
        "trans",
        "husserl",
        "socalled",
        "transcendental",
        "idealism",
        "remains",
        "matter",
        "debate",
        "today",
        "question",
        "concerning",
        "relation",
        "husserl",
        "idea",
        "previous",
        "work",
        "especially",
        "li",
        "exact",
        "location",
        "transcendental",
        "phenomenology",
        "two",
        "pole",
        "idealism",
        "realism",
        "yet",
        "found",
        "definite",
        "answer",
        "relevant",
        "literature",
        "munich",
        "göttingen",
        "circle",
        "husserl",
        "idea",
        "intensively",
        "discussed",
        "part",
        "research",
        "program",
        "pursued",
        "make",
        "one",
        "example",
        "héring",
        "ingarden",
        "developed",
        "husserl",
        "eidetics",
        "ontology",
        "essence",
        "generally",
        "however",
        "idea",
        "provoked",
        "could",
        "seen",
        "mirror",
        "image",
        "reaction",
        "provided",
        "young",
        "phenomenologists",
        "opportunity",
        "renew",
        "commitment",
        "robust",
        "form",
        "metaphysical",
        "realism",
        "perceived",
        "incompatible",
        "husserl",
        "transcendental",
        "idealism",
        "reality",
        "claimed",
        "exists",
        "independently",
        "subjectivity",
        "whether",
        "intended",
        "empirically",
        "transcendentally",
        "clash",
        "two",
        "different",
        "approach",
        "phenomenology",
        "labeled",
        "realismidealism",
        "controversy",
        "ingarden",
        "avélallemant",
        "b",
        "turned",
        "decisive",
        "episode",
        "history",
        "phenomenological",
        "movement",
        "mention",
        "one",
        "important",
        "consequence",
        "husserl",
        "referred",
        "pfänder",
        "dismissal",
        "transcendental",
        "idealism",
        "shared",
        "writes",
        "phenomenologists",
        "munich",
        "göttingen",
        "tradition",
        "main",
        "reason",
        "preferring",
        "martin",
        "heidegger",
        "successor",
        "professorship",
        "freiburg",
        "husserl",
        "f",
        "tragedy",
        "great",
        "war",
        "led",
        "abrupt",
        "stop",
        "scientific",
        "output",
        "two",
        "circle",
        "also",
        "contributed",
        "dissolution",
        "munich",
        "particular",
        "göttingen",
        "group",
        "many",
        "among",
        "early",
        "phenomenologists",
        "died",
        "front",
        "reinach",
        "fell",
        "fate",
        "shared",
        "among",
        "others",
        "clemens",
        "frankfurter",
        "ritzel",
        "husserl",
        "moved",
        "freiburg",
        "take",
        "heinrich",
        "rickert",
        "position",
        "chair",
        "philosophy",
        "tradition",
        "phenomenology",
        "fostered",
        "two",
        "circle",
        "remained",
        "active",
        "mainly",
        "munich",
        "bergzabern",
        "small",
        "city",
        "rhinelandpalatinate",
        "conrad",
        "estate",
        "regularly",
        "hosted",
        "discussion",
        "mainly",
        "héring",
        "koyré",
        "lipps",
        "stein",
        "von",
        "sybel",
        "took",
        "part",
        "see",
        "feldes",
        "munich",
        "however",
        "future",
        "approach",
        "phenomenology",
        "seemed",
        "secure",
        "pfänder",
        "became",
        "full",
        "professor",
        "gallinger",
        "von",
        "hildebrand",
        "taught",
        "privatdozenten",
        "rise",
        "nazism",
        "germany",
        "however",
        "put",
        "end",
        "group",
        "due",
        "opposition",
        "regime",
        "von",
        "hildebrand",
        "flee",
        "united",
        "state",
        "gallinger",
        "jewish",
        "origin",
        "left",
        "germany",
        "sweden",
        "geiger",
        "full",
        "professor",
        "göttingen",
        "forced",
        "retire",
        "stein",
        "died",
        "auschwitz",
        "although",
        "could",
        "argued",
        "munich",
        "göttingen",
        "era",
        "phenomenology",
        "ended",
        "year",
        "member",
        "eg",
        "conradmartius",
        "von",
        "hildebrand",
        "ingarden",
        "stavenhagen",
        "continued",
        "publish",
        "remained",
        "active",
        "second",
        "world",
        "war",
        "idea",
        "also",
        "directly",
        "influenced",
        "author",
        "including",
        "friedrich",
        "bassenge",
        "nicolai",
        "hartmann",
        "aurel",
        "kolnai",
        "josé",
        "ortega",
        "gasset",
        "herbert",
        "spiegelberg",
        "karol",
        "wojtyła"
    ]
}