{
    "main_text": "Applied Ethics\n4. Applied Ethics\n\nFoot was among the pioneers of writing on issues in applied ethics,\ntreating abortion and euthanasia. For reasons only made explicit in\nlater writings, Foot rejects consequentialist views of value,\nincluding utilitarianism. Charity, on her account, demands that we aid\nothers, but we cannot do so at the expense of violating rights to\nnon-interference, or negative rights. As Foot puts it, “in so\nfar as a man’s charity is limited only by his justice… he\nis not less than perfect in charity” (1983 [MD 57]). But what\ndoes justice demand? For Foot, answering this question depends on\nfiguring out the scope of our moral rights, and this is a project that\nshe pursued by reflecting on various thought experiments, some of\nwhich have entered popular culture.\n\nConsider a pair of scenarios called Rescue I and Rescue II (1984 [MD\n80]). In both cases, we are driving a jeep along a sea shore and have\nthe chance to save various configurations of stranded people from an\nincoming tide. In the first case, we are about to save one person from\nthe tide, and spot five others whom we can save, but we cannot save\nboth. In Rescue II, we can save five, but to reach them we would for\nsome reason would have to run over one person, killing him. Foot\nbelieves that there is a morally significant difference between these\ncases. She thinks it is impermissible to save the five in Rescue II;\nwhereas it is permissible (at least) to save the five in Rescue I. On\nFoot’s view, the significant difference lies in the fact that in\nRescue II, saving the five would require initiating a causal sequence\nthat kills one. In Rescue I, by contrast, saving the five is\npermissible because in this scenario we allow a deadly causal sequence\nthat we did not initiate to run its course. This is not to say that\nall instances of allowing deadly causal sequences to run their courses\nare permissible, or that the distinction between doing and allowing\nalways makes a difference to the moral status of an action. The claim\nis only that the distinction sometimes makes a significant moral\ndifference, as it does in this pair of cases. According to Foot,\n“it takes more to justify an interference than to justify the\nwithholding of goods and service” (1984 [MD 83]). At the very\nleast, this means that it is impermissible to kill one person to save\nanother.[5] This\ndistinction relates to the distinction between negative rights, rights\nto non-interference, versus positive rights, which obligate others to\nprovide some service. Negative rights would enjoin others not to\ninitiate a fatal causal sequence, and positive rights may give rise to\nan obligation to prevent a fatal causal sequence from running its\ncourse. Foot’s contention is that negative rights carry greater\nweight than positive rights.\n\nIn “The Problem of Abortion and the Doctrine of Double\nEffect”, (1967) Foot raises a related case that has been the\nsubject of much subsequent discussion: a runaway trolley is headed\ntoward five people who will be killed by the collision, but it could\nbe steered onto a track on which there is only one person (1967 [VV\n23]).  Intuitively, it seems permissible to turn the trolley to hit\nand kill one person, but the problem is that it does not seem\npermissible to kill one to save five in cases like Rescue II. Why,\nFoot asks, can we not argue for the permissibility of killing one to\nsave five in those cases by appealing to the Trolley case? As we have\nseen, Foot argues that negative rights are generally stronger than\npositive rights. In Rescue II, we must violate someone’s\nnegative rights to meet the positive rights of others, and this is\nimpermissible because the negative rights have priority over the\npositive rights that is not outweighed by five people’s need for\nassistance. In Trolley, by contrast, we are not violating negative\nrights to meet positive rights; the situation pits the negative rights\nof the five against the negative rights of one, and both choices\ninvolve violating someone’s negative rights. In such a case, it\nseems clearly preferable to minimize the violation of negative rights\nby turning the trolley (1967 [VV 27]).\n\nOn Foot’s view, we are generally not permitted to do something\nto someone that would interfere with someone’s negative rights,\nfor example, we may not steal someone’s property; yet we may not\nbe required to actively secure their possession of it, that is, we may\nallow them to lose their property. Foot thereby defends a principle\nthat draws a moral distinction between doing and allowing; she also\ndefends a version of the doctrine of double effect, which states that\nit is sometimes permissible to bring about a result that one foresees\nas a consequence of one’s action but does not intend that it\nwould be impermissible to aim at either as a means or an end (1985 [MD\n91]).  Foot believes that this principle is necessary because the\nprinciple of doing and allowing does not cover some morally\nsignificant distinctions. For example, consider a case in which we\npossess a certain drug, but only enough to either cure one person\nsuffering from a fatal condition, or to save five others who are\nsuffering from a milder, though still fatal case of the same\nillness. In such a circumstance, we can permissibly give the drug to\nthe five who are suffering from the milder form of the disease. If we\ncould save all six, we would surely do so. Clearly, we do not intend\nthe death of the one, though we foresee it as a consequence of our\nactions. On the other hand, it is not permissible to withhold a\nlive-saving drug from one to use his organs to save the lives of the\nfive others after he dies. In this case, the death of the one is an\nessential means to the achievement of the end and so his death is\nstrictly intended. Although in such a case I would be allowing someone\nto die rather than perpetrating a killing by my own agency, what I do\nis impermissible.  Only the doctrine of double effect captures the\ndistinction between these cases, on Foot’s view. Yet the\ndoctrine of double effect cannot stand on its own, according to Foot;\nwe need both the principle of double effect and the principle of doing\nand allowing. After all, we can sometimes impermissibly initiate harm\nwith indirect intention.  She gives the example of wicked merchants\nwho knowingly sell poisoned oil: their intention is not to harm their\ncustomers, but only to turn a profit, yet they are clearly initiating\na harmful causal sequence.\n\nThese principles systematize non-consequentialist ‘common\nmorality’, and Foot puts these principles to use in her\ntreatment of abortion and euthanasia. Foot is skeptical of any attempt\nto resolve the abortion debate without settling the issue of whether\nand when the fetus has moral rights, and she regards this as an\nintractable issue (1984 [MD 87]). In this view, she takes sides\nagainst Judith Jarvis Thomson, who argued that some abortions are\npermissible even if we allow for the sake of argument that the fetus\nhas full moral status. Thomson argues by analogy: imagine that while\nwe sleep a group of music lovers stealthily attach to us a famous\nviolinist who is suffering from an ailment, and we uniquely can keep\nhim alive for roughly nine months, as he convalesces (Thomson 1971:\n48). The question is: may we detach the violinist, causing his death?\nThomson argues that we may, since our negative rights have been\nviolated and no one has the right to use another’s body, even to\nsave his own life. Of course, the analogy here is limited to cases of\nnon-consensual impregnation, such as those resulting from rape.\n\nFoot argues that the analogy has a devastating fault. There is a\nmorally significant difference between unhooking someone from\none’s own body, which does not involve initiating a fatal causal\nsequence, since the person was already in the grips of a fatal\ncondition before being hooked up to us, and abortion, which does\ninitiate a fatal sequence. Foot believes that this makes abortion seem\nlike Rescue II, whereas the unhooking of the violinist is like Rescue\nI. As Foot puts it, \n\n\nthe fetus is not in jeopardy because it is in its mother’s womb;\nit is merely dependent on her in the way children are dependent on\ntheir parents for food. (1984 [MD 87]) \n\n\nRejecting Thomson’s view, which attempts to show that some\ninstances of abortion are permissible even if the fetus is fully a\nmoral person, Foot’s considered position on abortion is that it\nturns on precisely the issue Thomson wishes to set aside. On this\nissue, she rather surprisingly abandons her commitment to objectivity,\nclaiming that it is a matter for a community to decide whether to\ncount the fetus as a human being (1970 [MD 7]).\n\nPerhaps Foot’s most penetrating article on applied ethics is her\n“Euthanasia” (1977). Foot defines euthanasia as a killing\nthat is for the good of the individual in question, and she asks\nwhether such an act can ever be permissible. One central question here\nis whether it can ever be good for an individual to be deprived of his\nlife, and hence one of Foot’s central purposes is to determine\nwhat sort of a good life is for a person. She rejects the narrowly\nhedonistic view that the value of life is determined by the balance of\npleasure versus pain it promises. On her view, life is often still a\ngood to someone who is suffering and who is likely to continue in such\na state. Yet she also argues that merely being alive without suffering\nis not a good (1977 [VV 42]). What is of value, on her view, is the\nordinary human life that contains at least a minimum of “basic\nhuman goods”, which include: \n\n\nthat a man is not driven to work far beyond his capacity; that he has\nthe support of a family or community; that he can more or less satisfy\nhis hunger; that he has hopes for the future; that he can lie down to\nrest at night. (Ibid.) \n\n\nIn the absence of such minimal goods, she argues that life is not a\ngood to a person.\n\nThe issue of the permissibility of euthanasia for Foot, then, turns to\nissues about justice and charity (1977 [VV 44]). On her view, even\nwhen it seems better for someone not to survive, we must respect that\nperson’s rights. Hence, on her view, involuntary active\neuthanasia can never be permissible. On the other hand, the right to\nassistance in staying alive calls upon the charity of others and not\njustice, except in the case of a doctor who has a contractual duty to\nhelp keep us alive. Yet even in the case of a doctor, where assistance\nis a matter of justice, our claim on that assistance is limited by the\nclaims of others as well as a regard for our well-being. That is,\nthere may come a point at which such ‘assistance’ as a\ndoctor can offer to prolong a patient’s life does not actually\nconfer any benefit, and in such a case, it is not contrary to justice\nor charity for the doctor to withhold treatment; as Foot points out,\nsuch instances of passive euthanasia are already widely practiced (1977 [VV\n56]). However, she argues that it may be justifiable not to prolong the\nlife of someone who wants to live, giving the example of a dying\nsoldier whose life could be prolonged with a certain drug, but who\nwould thereby face death by starvation. According to Foot,\nnonvoluntary passive euthanasia is permissible in such an\ninstance.\n\nOf course, the central controversy here is whether voluntary active\neuthanasia is permissible. She dismisses James Rachels’ claim\nthat if we permit passive euthanasia then the only consistent position\nis to permit active euthanasia in similar circumstances because it is\n‘more humane’ than passive euthanasia (Rachels 1975). Foot\nargues by analogy that it may be ‘more humane’ to deprive\nsomeone of property that is bringing evil to him, but nevertheless\ntaking it away would be contrary to justice (1977 [VV 50]). On the\nother hand, someone may give permission for the destruction of his\nproperty, and as Foot concludes, \n\n\nIf someone gives you permission to destroy his property it can no\nlonger be said that you have no right to do so, and I do not see why\nit should not be the same with taking a man’s life. (1977 [VV\n53]) \n\n\nNevertheless, Foot admits that the moral issue is not entirely\nresolved by the matter of rights, so it does not follow that there is\nno moral objection to doing something because it would involve no\nviolation of rights. It is then a matter of whether it would be good\nfor the person to die and, hence, whether it would be contrary to\ncharity. This rules out cases in which death is wished for by someone\nwho is facing a life of dependency because they are worried about\nbeing a burden on others. In such circumstances, other things being\nequal, the death would not be for the good of the person. Foot also\nhas concerns about the practice of euthanasia that make her hesitate\nto suggest that the practice ought to be more widely legalized.\n",
    "section_title": "4. Applied Ethics",
    "entry_title": "Philippa Foot",
    "hierarchy_title": "Philippa Foot || Applied Ethics",
    "tokenized_text": [
        "applied",
        "ethic",
        "applied",
        "ethic",
        "foot",
        "among",
        "pioneer",
        "writing",
        "issue",
        "applied",
        "ethic",
        "treating",
        "abortion",
        "euthanasia",
        "reason",
        "made",
        "explicit",
        "later",
        "writing",
        "foot",
        "reject",
        "consequentialist",
        "view",
        "value",
        "including",
        "utilitarianism",
        "charity",
        "account",
        "demand",
        "aid",
        "others",
        "expense",
        "violating",
        "right",
        "noninterference",
        "negative",
        "right",
        "foot",
        "put",
        "far",
        "man",
        "charity",
        "limited",
        "justice",
        "le",
        "perfect",
        "charity",
        "md",
        "justice",
        "demand",
        "foot",
        "answering",
        "question",
        "depends",
        "figuring",
        "scope",
        "moral",
        "right",
        "project",
        "pursued",
        "reflecting",
        "various",
        "thought",
        "experiment",
        "entered",
        "popular",
        "culture",
        "consider",
        "pair",
        "scenario",
        "called",
        "rescue",
        "rescue",
        "ii",
        "md",
        "case",
        "driving",
        "jeep",
        "along",
        "sea",
        "shore",
        "chance",
        "save",
        "various",
        "configuration",
        "stranded",
        "people",
        "incoming",
        "tide",
        "first",
        "case",
        "save",
        "one",
        "person",
        "tide",
        "spot",
        "five",
        "others",
        "save",
        "save",
        "rescue",
        "ii",
        "save",
        "five",
        "reach",
        "would",
        "reason",
        "would",
        "run",
        "one",
        "person",
        "killing",
        "foot",
        "belief",
        "morally",
        "significant",
        "difference",
        "case",
        "think",
        "impermissible",
        "save",
        "five",
        "rescue",
        "ii",
        "whereas",
        "permissible",
        "least",
        "save",
        "five",
        "rescue",
        "i",
        "foot",
        "view",
        "significant",
        "difference",
        "lie",
        "fact",
        "rescue",
        "ii",
        "saving",
        "five",
        "would",
        "require",
        "initiating",
        "causal",
        "sequence",
        "kill",
        "one",
        "rescue",
        "contrast",
        "saving",
        "five",
        "permissible",
        "scenario",
        "allow",
        "deadly",
        "causal",
        "sequence",
        "initiate",
        "run",
        "course",
        "say",
        "instance",
        "allowing",
        "deadly",
        "causal",
        "sequence",
        "run",
        "course",
        "permissible",
        "distinction",
        "allowing",
        "always",
        "make",
        "difference",
        "moral",
        "status",
        "action",
        "claim",
        "distinction",
        "sometimes",
        "make",
        "significant",
        "moral",
        "difference",
        "pair",
        "case",
        "according",
        "foot",
        "take",
        "justify",
        "interference",
        "justify",
        "withholding",
        "good",
        "service",
        "md",
        "least",
        "mean",
        "impermissible",
        "kill",
        "one",
        "person",
        "save",
        "another",
        "distinction",
        "relates",
        "distinction",
        "negative",
        "right",
        "right",
        "noninterference",
        "versus",
        "positive",
        "right",
        "obligate",
        "others",
        "provide",
        "service",
        "negative",
        "right",
        "would",
        "enjoin",
        "others",
        "initiate",
        "fatal",
        "causal",
        "sequence",
        "positive",
        "right",
        "may",
        "give",
        "rise",
        "obligation",
        "prevent",
        "fatal",
        "causal",
        "sequence",
        "running",
        "course",
        "foot",
        "contention",
        "negative",
        "right",
        "carry",
        "greater",
        "weight",
        "positive",
        "right",
        "problem",
        "abortion",
        "doctrine",
        "double",
        "effect",
        "foot",
        "raise",
        "related",
        "case",
        "subject",
        "much",
        "subsequent",
        "discussion",
        "runaway",
        "trolley",
        "headed",
        "toward",
        "five",
        "people",
        "killed",
        "collision",
        "could",
        "steered",
        "onto",
        "track",
        "one",
        "person",
        "vv",
        "intuitively",
        "seems",
        "permissible",
        "turn",
        "trolley",
        "hit",
        "kill",
        "one",
        "person",
        "problem",
        "seem",
        "permissible",
        "kill",
        "one",
        "save",
        "five",
        "case",
        "like",
        "rescue",
        "ii",
        "foot",
        "asks",
        "argue",
        "permissibility",
        "killing",
        "one",
        "save",
        "five",
        "case",
        "appealing",
        "trolley",
        "case",
        "seen",
        "foot",
        "argues",
        "negative",
        "right",
        "generally",
        "stronger",
        "positive",
        "right",
        "rescue",
        "ii",
        "must",
        "violate",
        "someone",
        "negative",
        "right",
        "meet",
        "positive",
        "right",
        "others",
        "impermissible",
        "negative",
        "right",
        "priority",
        "positive",
        "right",
        "outweighed",
        "five",
        "people",
        "need",
        "assistance",
        "trolley",
        "contrast",
        "violating",
        "negative",
        "right",
        "meet",
        "positive",
        "right",
        "situation",
        "pit",
        "negative",
        "right",
        "five",
        "negative",
        "right",
        "one",
        "choice",
        "involve",
        "violating",
        "someone",
        "negative",
        "right",
        "case",
        "seems",
        "clearly",
        "preferable",
        "minimize",
        "violation",
        "negative",
        "right",
        "turning",
        "trolley",
        "vv",
        "foot",
        "view",
        "generally",
        "permitted",
        "something",
        "someone",
        "would",
        "interfere",
        "someone",
        "negative",
        "right",
        "example",
        "may",
        "steal",
        "someone",
        "property",
        "yet",
        "may",
        "required",
        "actively",
        "secure",
        "possession",
        "may",
        "allow",
        "lose",
        "property",
        "foot",
        "thereby",
        "defends",
        "principle",
        "draw",
        "moral",
        "distinction",
        "allowing",
        "also",
        "defends",
        "version",
        "doctrine",
        "double",
        "effect",
        "state",
        "sometimes",
        "permissible",
        "bring",
        "result",
        "one",
        "foresees",
        "consequence",
        "one",
        "action",
        "intend",
        "would",
        "impermissible",
        "aim",
        "either",
        "mean",
        "end",
        "md",
        "foot",
        "belief",
        "principle",
        "necessary",
        "principle",
        "allowing",
        "cover",
        "morally",
        "significant",
        "distinction",
        "example",
        "consider",
        "case",
        "posse",
        "certain",
        "drug",
        "enough",
        "either",
        "cure",
        "one",
        "person",
        "suffering",
        "fatal",
        "condition",
        "save",
        "five",
        "others",
        "suffering",
        "milder",
        "though",
        "still",
        "fatal",
        "case",
        "illness",
        "circumstance",
        "permissibly",
        "give",
        "drug",
        "five",
        "suffering",
        "milder",
        "form",
        "disease",
        "could",
        "save",
        "six",
        "would",
        "surely",
        "clearly",
        "intend",
        "death",
        "one",
        "though",
        "foresee",
        "consequence",
        "action",
        "hand",
        "permissible",
        "withhold",
        "livesaving",
        "drug",
        "one",
        "use",
        "organ",
        "save",
        "life",
        "five",
        "others",
        "dy",
        "case",
        "death",
        "one",
        "essential",
        "mean",
        "achievement",
        "end",
        "death",
        "strictly",
        "intended",
        "although",
        "case",
        "would",
        "allowing",
        "someone",
        "die",
        "rather",
        "perpetrating",
        "killing",
        "agency",
        "impermissible",
        "doctrine",
        "double",
        "effect",
        "capture",
        "distinction",
        "case",
        "foot",
        "view",
        "yet",
        "doctrine",
        "double",
        "effect",
        "stand",
        "according",
        "foot",
        "need",
        "principle",
        "double",
        "effect",
        "principle",
        "allowing",
        "sometimes",
        "impermissibly",
        "initiate",
        "harm",
        "indirect",
        "intention",
        "give",
        "example",
        "wicked",
        "merchant",
        "knowingly",
        "sell",
        "poisoned",
        "oil",
        "intention",
        "harm",
        "customer",
        "turn",
        "profit",
        "yet",
        "clearly",
        "initiating",
        "harmful",
        "causal",
        "sequence",
        "principle",
        "systematize",
        "nonconsequentialist",
        "common",
        "morality",
        "foot",
        "put",
        "principle",
        "use",
        "treatment",
        "abortion",
        "euthanasia",
        "foot",
        "skeptical",
        "attempt",
        "resolve",
        "abortion",
        "debate",
        "without",
        "settling",
        "issue",
        "whether",
        "fetus",
        "moral",
        "right",
        "regard",
        "intractable",
        "issue",
        "md",
        "view",
        "take",
        "side",
        "judith",
        "jarvis",
        "thomson",
        "argued",
        "abortion",
        "permissible",
        "even",
        "allow",
        "sake",
        "argument",
        "fetus",
        "full",
        "moral",
        "status",
        "thomson",
        "argues",
        "analogy",
        "imagine",
        "sleep",
        "group",
        "music",
        "lover",
        "stealthily",
        "attach",
        "u",
        "famous",
        "violinist",
        "suffering",
        "ailment",
        "uniquely",
        "keep",
        "alive",
        "roughly",
        "nine",
        "month",
        "convalesces",
        "thomson",
        "question",
        "may",
        "detach",
        "violinist",
        "causing",
        "death",
        "thomson",
        "argues",
        "may",
        "since",
        "negative",
        "right",
        "violated",
        "one",
        "right",
        "use",
        "another",
        "body",
        "even",
        "save",
        "life",
        "course",
        "analogy",
        "limited",
        "case",
        "nonconsensual",
        "impregnation",
        "resulting",
        "rape",
        "foot",
        "argues",
        "analogy",
        "devastating",
        "fault",
        "morally",
        "significant",
        "difference",
        "unhooking",
        "someone",
        "one",
        "body",
        "involve",
        "initiating",
        "fatal",
        "causal",
        "sequence",
        "since",
        "person",
        "already",
        "grip",
        "fatal",
        "condition",
        "hooked",
        "u",
        "abortion",
        "initiate",
        "fatal",
        "sequence",
        "foot",
        "belief",
        "make",
        "abortion",
        "seem",
        "like",
        "rescue",
        "ii",
        "whereas",
        "unhooking",
        "violinist",
        "like",
        "rescue",
        "i",
        "foot",
        "put",
        "fetus",
        "jeopardy",
        "mother",
        "womb",
        "merely",
        "dependent",
        "way",
        "child",
        "dependent",
        "parent",
        "food",
        "md",
        "rejecting",
        "thomson",
        "view",
        "attempt",
        "show",
        "instance",
        "abortion",
        "permissible",
        "even",
        "fetus",
        "fully",
        "moral",
        "person",
        "foot",
        "considered",
        "position",
        "abortion",
        "turn",
        "precisely",
        "issue",
        "thomson",
        "wish",
        "set",
        "aside",
        "issue",
        "rather",
        "surprisingly",
        "abandon",
        "commitment",
        "objectivity",
        "claiming",
        "matter",
        "community",
        "decide",
        "whether",
        "count",
        "fetus",
        "human",
        "md",
        "perhaps",
        "foot",
        "penetrating",
        "article",
        "applied",
        "ethic",
        "euthanasia",
        "foot",
        "defines",
        "euthanasia",
        "killing",
        "good",
        "individual",
        "question",
        "asks",
        "whether",
        "act",
        "ever",
        "permissible",
        "one",
        "central",
        "question",
        "whether",
        "ever",
        "good",
        "individual",
        "deprived",
        "life",
        "hence",
        "one",
        "foot",
        "central",
        "purpose",
        "determine",
        "sort",
        "good",
        "life",
        "person",
        "reject",
        "narrowly",
        "hedonistic",
        "view",
        "value",
        "life",
        "determined",
        "balance",
        "pleasure",
        "versus",
        "pain",
        "promise",
        "view",
        "life",
        "often",
        "still",
        "good",
        "someone",
        "suffering",
        "likely",
        "continue",
        "state",
        "yet",
        "also",
        "argues",
        "merely",
        "alive",
        "without",
        "suffering",
        "good",
        "vv",
        "value",
        "view",
        "ordinary",
        "human",
        "life",
        "contains",
        "least",
        "minimum",
        "basic",
        "human",
        "good",
        "include",
        "man",
        "driven",
        "work",
        "far",
        "beyond",
        "capacity",
        "support",
        "family",
        "community",
        "le",
        "satisfy",
        "hunger",
        "hope",
        "future",
        "lie",
        "rest",
        "night",
        "ibid",
        "absence",
        "minimal",
        "good",
        "argues",
        "life",
        "good",
        "person",
        "issue",
        "permissibility",
        "euthanasia",
        "foot",
        "turn",
        "issue",
        "justice",
        "charity",
        "vv",
        "view",
        "even",
        "seems",
        "better",
        "someone",
        "survive",
        "must",
        "respect",
        "person",
        "right",
        "hence",
        "view",
        "involuntary",
        "active",
        "euthanasia",
        "never",
        "permissible",
        "hand",
        "right",
        "assistance",
        "staying",
        "alive",
        "call",
        "upon",
        "charity",
        "others",
        "justice",
        "except",
        "case",
        "doctor",
        "contractual",
        "duty",
        "help",
        "keep",
        "u",
        "alive",
        "yet",
        "even",
        "case",
        "doctor",
        "assistance",
        "matter",
        "justice",
        "claim",
        "assistance",
        "limited",
        "claim",
        "others",
        "well",
        "regard",
        "wellbeing",
        "may",
        "come",
        "point",
        "assistance",
        "doctor",
        "offer",
        "prolong",
        "patient",
        "life",
        "actually",
        "confer",
        "benefit",
        "case",
        "contrary",
        "justice",
        "charity",
        "doctor",
        "withhold",
        "treatment",
        "foot",
        "point",
        "instance",
        "passive",
        "euthanasia",
        "already",
        "widely",
        "practiced",
        "vv",
        "however",
        "argues",
        "may",
        "justifiable",
        "prolong",
        "life",
        "someone",
        "want",
        "live",
        "giving",
        "example",
        "dying",
        "soldier",
        "whose",
        "life",
        "could",
        "prolonged",
        "certain",
        "drug",
        "would",
        "thereby",
        "face",
        "death",
        "starvation",
        "according",
        "foot",
        "nonvoluntary",
        "passive",
        "euthanasia",
        "permissible",
        "instance",
        "course",
        "central",
        "controversy",
        "whether",
        "voluntary",
        "active",
        "euthanasia",
        "permissible",
        "dismisses",
        "james",
        "rachel",
        "claim",
        "permit",
        "passive",
        "euthanasia",
        "consistent",
        "position",
        "permit",
        "active",
        "euthanasia",
        "similar",
        "circumstance",
        "humane",
        "passive",
        "euthanasia",
        "rachel",
        "foot",
        "argues",
        "analogy",
        "may",
        "humane",
        "deprive",
        "someone",
        "property",
        "bringing",
        "evil",
        "nevertheless",
        "taking",
        "away",
        "would",
        "contrary",
        "justice",
        "vv",
        "hand",
        "someone",
        "may",
        "give",
        "permission",
        "destruction",
        "property",
        "foot",
        "concludes",
        "someone",
        "give",
        "permission",
        "destroy",
        "property",
        "longer",
        "said",
        "right",
        "see",
        "taking",
        "man",
        "life",
        "vv",
        "nevertheless",
        "foot",
        "admits",
        "moral",
        "issue",
        "entirely",
        "resolved",
        "matter",
        "right",
        "follow",
        "moral",
        "objection",
        "something",
        "would",
        "involve",
        "violation",
        "right",
        "matter",
        "whether",
        "would",
        "good",
        "person",
        "die",
        "hence",
        "whether",
        "would",
        "contrary",
        "charity",
        "rule",
        "case",
        "death",
        "wished",
        "someone",
        "facing",
        "life",
        "dependency",
        "worried",
        "burden",
        "others",
        "circumstance",
        "thing",
        "equal",
        "death",
        "would",
        "good",
        "person",
        "foot",
        "also",
        "concern",
        "practice",
        "euthanasia",
        "make",
        "hesitate",
        "suggest",
        "practice",
        "ought",
        "widely",
        "legalized"
    ]
}