{
    "main_text": "Epistemology: The Role of Number\n3. Epistemology: The Role of Number\n\nIn the discussion of harmony above, another crucial concept in\nPhilolaus’ philosophy emerged, number. What role does number play in\nPhilolaus’ system? Fragment 4 provides a relatively clear answer to\nthis question:\n\nAnd indeed all things that are known have number. For it is not\npossible that anything whatsoever be understood or known without this.\n\n\nNumber plays an epistemological role; it is what allows things to be\nknown and understood. There are several ways to interpret this claim.\nSome scholars have regarded “having number” as the\nnecessary condition for the mere apprehension of an object. If\nsomething is not countable and hence distinguishable from other\nthings, it can’t be recognized as a separate entity at all (Nussbaum\n1979; Kirk, Raven and Schofield 1983, 327). The epistemological\nvocabulary which Philolaus uses (noein and\ngignôskein), however, more typically refers to\nunderstanding and knowledge than to simple apprehension of an object\n(Huffman 1993, 116–118). Several fragments make appeals to sense\nexperience without mentioning the concept of number (e.g. Fr. 2), so\nthat it would appear that Philolaus thinks that we can initially\napprehend objects through our senses but that we only come to have\ntrue knowledge or understanding of them by grasping their number.\nFragment 13 makes a clear distinction between sense perception, which\nhumans and animals share, and understanding, which is limited to\nhumans. Animals can apprehend objects in the world just as humans do,\nbut they do not understand them because they cannot grasp the numbers\nwhich govern them, as humans can. Such an interpretation is supported\nby Fragment 5:\n\nNumber, indeed, has two proper kinds, odd and even, and a third from\nboth mixed together, the even-odd. Of each of these two kinds there\nare many forms, of which each thing itself gives signs.\n\n\nThe last sentence of the fragment seems to say that individual things\nin the world “give signs” of the many forms of number. Our\nfirst experience of a musical scale comes through simple sense\nperception, but, when the phenomena are studied further, they\n“give signs of” or “point to” the whole-number\nratios that govern the musical intervals. Once we grasp these ratios,\nwe can claim to understand or know the scale. McKirahan (2012) argues\nthat in Fr. 6a Philolaus formally demonstrates that ratios are numbers\nand that the many forms of numbers in Fr. 5 are the different types of\nratios. Huffman (1993: 174) argues that Philolaus’ use of the term\nnumber includes ratios from the start and that the many forms of\nnumbers are just the even and odd natural numbers (1993: 191; cf.\n2012). Mourelatos has shown that Fragment 5 is also important\nin the history of the development of the concept of the universal.\nPhilolaus distinguishes between numbers as individual species and\ntheir genera, even and odd, i.e. between subordinate and superordinate\nuniversals, as well as between numbers and things, i.e. between types\nand tokens, e.g. four and four pebbles. Moreover, the reference in\nFragment 5 to things “giving signs” of numbers is\n“the first recorded attempt in the history of metaphysics at\ncoining a term for [the relation between a particular and a\nuniversal]”(Mourelatos 2006, 66). \n\nBurkert argues that Philolaus’ appeal to number has little to do\nwith the rigorous mathematics that was being developed in the work of\nhis contemporaries Hippocrates of Chios and Theodorus of Cyrene. It is\ninstead a manifestation of the Pythagorean number mysticism, which can\nbe found in the acusmata, the oral apothegms, many of which\nprobably go back to Pythagoras himself (1972a, 465 ff.). Burkert sees\nevidence that Philolaus was not interested in rigorous mathematics in\nthe mathematically nonsensical account of music in Fr. 6b and\ntestimonium A26 (1972a, 394–400) as well as in what might be the\nuse of mathematics for astrological purposes in A14 (1972a,\n349–350).  There are, however, independent reasons for\ndoubting the authenticity of these texts (Huffman 1993, 364–374\nand 381–391). Moreover, the mathematics of the surely authentic\nFr. 6a is above reproach, and Aristotle clearly presents the interest\nin number displayed by fifth-century Pythagoreans as the result of\ntheir training in rigorous mathematics (Metaph. 985b23 ff.;\ncf. Iamblichus, Comm. Math. Sc. 78.8–18). Fragments 4\nand 5 suggest that Philolaus’ program was to discover the\nnumbers and numerical relations that govern the phenomena which we\nobserve, and Fr. 6a suggests that the whole-number ratios which govern\nmusical scales served as the model of the kind of mathematical account\nwhich should be supplied for all phenomena. In identifying numerical\nrelations as the basis for knowledge Philolaus may in part be\nresponding to Parmenides’ strictures on what constitutes a\nproper object of thought. Mathematical relationships certainly fit a\nnumber of the characteristics of a proper object of thought as set out\nby Parmenides in Fr. 8, e.g., they are ungenerated, imperishable, and\nunchangeable. Philolaus does not provide many further specific\nexamples of mathematical relations controlling phenomena, which is not\nsurprising given the scientific capabilities of the time. Indeed, the\nfact that the fragments and testimonia are not full of facile\nequations between numbers and phenomena once again suggests that\nPhilolaus was not simply interested in symbolic connections between\nnumbers and things and that Philolaus was looking for connections that\nwere scientifically verifiable, as in the case of the ratios that\ngovern musical intervals. Moreover, Greek usage shows that\n“having number” need not indicate just a simple one to one\nrelation between a number and things but can also have a general sense\nindicating that something is constituted by an ordered plurality or\nrelations between ordered pluralities (Huffman 1993: 175). The musical\nscale is one example but the alphabet may be another so that in\nPhilolaus’ epistemology science may involve a classification and\nsystematization of a subject that has similarities to Plato’s\ncollection and division (Graham 2014: 55). His successor in the\nPythagorean tradition, Archytas of Tarentum, appears to have adopted\nand been even more successful in carrying out Philolaus’ project\nof accounting for things in the phenomenal world in terms of\nnumber. In some cases, however, Philolaus may have been content to\naccept similarities between the properties of number and the\nproperties of things. Aristotle reports that the Pythagoreans\nidentified individual numbers with certain concepts, e.g., the number\nfour is associated with justice (Metaph. 985b29), evidently\nbecause it is the first square number (cf. the English expression\n“a square deal”). It is not certain that this is a\nreference to Philolaus, but, when Aristotle says that the\ncounter-earth was introduced into the Pythagorean astronomical system\nin order to bring the number of bodies orbiting the central fire up to\nthe perfect number ten, this must apply to Philolaus, since the\nastronomical system described belongs to him (see 4.2 below). Since\nthe world of numbers is ordered in tens, the cosmos too must parallel\nthis order. (For further analysis of Philolaus’ use of\nmathematics see Huffman 1988 and 1993, 54–77.) Zhmud (2016)\nargues that, while Philolaus and the early Pythagoreans had some\ninterest in the number symbolism that is found in many cultures, they\ndid not engage in arithmology, which focuses on the special properties\nof the first ten numbers. Certainly it is true that there is no\nevidence for anything as elaborate as the the later arithmological\ntreatises such as the Theologumena Arithmeticae. However, in\norder to deny any special significance for the numbers from one to ten\nin Philolaus one has to dismiss clear Aristotelian evidence and\nPhilolaus’ own use of four psychic faculties and ten bodies\nrotating around the central fire. \n\nThere is no evidence that Philolaus thought that numbers had a\nmetaphysical status independent of the objects which they describe\n(for the contrary view, i.e. that Philolaus thought that the abstract\nwas prior to the concrete, see Netz 2005: 87–88). Aristotle\nemphasizes that the Pythagoreans differed from Plato in not separating\nnumbers from things (e.g. Metaph. 987b27–9), and Plato\nconfirms this interpretation with his criticism of the Pythagoreans on\nthe grounds that they looked for numbers in things rather than\nfocusing on numbers in themselves (R. 531c). On the other\nhand, Aristotle’s assertion that the Pythagoreans thought that things\nwere numbers or that they were made of numbers is also not supported\nby the fragments of Philolaus. When describing the components of\nthings in the world, Philolaus always talks in terms of limiters and\nunlimiteds and never asserts that things are made or arise from\nnumbers (cf. Fr. 1). In the surviving fragments, number is only\nexplicitly introduced to solve epistemological problems. It is true,\nhowever, that Philolaus’ third metaphysical principle,\n“harmonia,” is a “fitting together” of\nlimiters and unlimiteds in accordance with number. Number thus does\nplay a metaphysical role in defining the essence of things, but there\nis no indication that it is the material out of which they are made.\nAristotle’s assertion that the Pythagoreans thought that things were\nnumbers is best understood as his own interpretation of what\nPhilolaus’ system amounted to (Huffman 1993, 57–64; see Schibli\n1996 for a defense of Aristotle’s assertion as historically accurate).\nAristotle may well have thought that if numbers are what give us\nknowledge of things, then, in Aristotelian terms, they are the essence\nof things and hence that, in a sense, things are numbers. Philolaus\nappears to have thought that things were composed of unlimiteds such\nas material stuffs and structural features such as shapes; number\ndescribes the harmonia or fitting together that defines how the\nlimiters and unlimited were combined and hence give us the\n“formula” of the thing in question. There is no evidence\nthat he addressed the metaphysical status of the numbers themselves.\n\n",
    "section_title": "3. Epistemology: The Role of Number",
    "entry_title": "Philolaus",
    "hierarchy_title": "Philolaus || Epistemology: The Role of Number",
    "tokenized_text": [
        "epistemology",
        "role",
        "number",
        "epistemology",
        "role",
        "number",
        "discussion",
        "harmony",
        "another",
        "crucial",
        "concept",
        "philolaus",
        "philosophy",
        "emerged",
        "number",
        "role",
        "number",
        "play",
        "philolaus",
        "system",
        "fragment",
        "provides",
        "relatively",
        "clear",
        "answer",
        "question",
        "indeed",
        "thing",
        "known",
        "number",
        "possible",
        "anything",
        "whatsoever",
        "understood",
        "known",
        "without",
        "number",
        "play",
        "epistemological",
        "role",
        "allows",
        "thing",
        "known",
        "understood",
        "several",
        "way",
        "interpret",
        "claim",
        "scholar",
        "regarded",
        "number",
        "necessary",
        "condition",
        "mere",
        "apprehension",
        "object",
        "something",
        "countable",
        "hence",
        "distinguishable",
        "thing",
        "recognized",
        "separate",
        "entity",
        "nussbaum",
        "kirk",
        "raven",
        "schofield",
        "epistemological",
        "vocabulary",
        "philolaus",
        "us",
        "noein",
        "gignôskein",
        "however",
        "typically",
        "refers",
        "understanding",
        "knowledge",
        "simple",
        "apprehension",
        "object",
        "huffman",
        "several",
        "fragment",
        "make",
        "appeal",
        "sense",
        "experience",
        "without",
        "mentioning",
        "concept",
        "number",
        "eg",
        "fr",
        "would",
        "appear",
        "philolaus",
        "think",
        "initially",
        "apprehend",
        "object",
        "sens",
        "come",
        "true",
        "knowledge",
        "understanding",
        "grasping",
        "number",
        "fragment",
        "make",
        "clear",
        "distinction",
        "sense",
        "perception",
        "human",
        "animal",
        "share",
        "understanding",
        "limited",
        "human",
        "animal",
        "apprehend",
        "object",
        "world",
        "human",
        "understand",
        "grasp",
        "number",
        "govern",
        "human",
        "interpretation",
        "supported",
        "fragment",
        "number",
        "indeed",
        "two",
        "proper",
        "kind",
        "odd",
        "even",
        "third",
        "mixed",
        "together",
        "evenodd",
        "two",
        "kind",
        "many",
        "form",
        "thing",
        "give",
        "sign",
        "last",
        "sentence",
        "fragment",
        "seems",
        "say",
        "individual",
        "thing",
        "world",
        "give",
        "sign",
        "many",
        "form",
        "number",
        "first",
        "experience",
        "musical",
        "scale",
        "come",
        "simple",
        "sense",
        "perception",
        "phenomenon",
        "studied",
        "give",
        "sign",
        "point",
        "wholenumber",
        "ratio",
        "govern",
        "musical",
        "interval",
        "grasp",
        "ratio",
        "claim",
        "understand",
        "know",
        "scale",
        "mckirahan",
        "argues",
        "fr",
        "a",
        "philolaus",
        "formally",
        "demonstrates",
        "ratio",
        "number",
        "many",
        "form",
        "number",
        "fr",
        "different",
        "type",
        "ratio",
        "huffman",
        "argues",
        "philolaus",
        "use",
        "term",
        "number",
        "includes",
        "ratio",
        "start",
        "many",
        "form",
        "number",
        "even",
        "odd",
        "natural",
        "number",
        "cf",
        "mourelatos",
        "shown",
        "fragment",
        "also",
        "important",
        "history",
        "development",
        "concept",
        "universal",
        "philolaus",
        "distinguishes",
        "number",
        "individual",
        "specie",
        "genus",
        "even",
        "odd",
        "ie",
        "subordinate",
        "superordinate",
        "universal",
        "well",
        "number",
        "thing",
        "ie",
        "type",
        "token",
        "eg",
        "four",
        "four",
        "pebble",
        "moreover",
        "reference",
        "fragment",
        "thing",
        "giving",
        "sign",
        "number",
        "first",
        "recorded",
        "attempt",
        "history",
        "metaphysics",
        "coining",
        "term",
        "relation",
        "particular",
        "universal",
        "mourelatos",
        "burkert",
        "argues",
        "philolaus",
        "appeal",
        "number",
        "little",
        "rigorous",
        "mathematics",
        "developed",
        "work",
        "contemporary",
        "hippocrates",
        "chios",
        "theodorus",
        "cyrene",
        "instead",
        "manifestation",
        "pythagorean",
        "number",
        "mysticism",
        "found",
        "acusmata",
        "oral",
        "apothegm",
        "many",
        "probably",
        "go",
        "back",
        "pythagoras",
        "a",
        "ff",
        "burkert",
        "see",
        "evidence",
        "philolaus",
        "interested",
        "rigorous",
        "mathematics",
        "mathematically",
        "nonsensical",
        "account",
        "music",
        "fr",
        "b",
        "testimonium",
        "a",
        "a",
        "well",
        "might",
        "use",
        "mathematics",
        "astrological",
        "purpose",
        "a",
        "a",
        "however",
        "independent",
        "reason",
        "doubting",
        "authenticity",
        "text",
        "huffman",
        "moreover",
        "mathematics",
        "surely",
        "authentic",
        "fr",
        "a",
        "reproach",
        "aristotle",
        "clearly",
        "present",
        "interest",
        "number",
        "displayed",
        "fifthcentury",
        "pythagoreans",
        "result",
        "training",
        "rigorous",
        "mathematics",
        "metaph",
        "b",
        "ff",
        "cf",
        "iamblichus",
        "comm",
        "math",
        "sc",
        "fragment",
        "suggest",
        "philolaus",
        "program",
        "discover",
        "number",
        "numerical",
        "relation",
        "govern",
        "phenomenon",
        "observe",
        "fr",
        "a",
        "suggests",
        "wholenumber",
        "ratio",
        "govern",
        "musical",
        "scale",
        "served",
        "model",
        "kind",
        "mathematical",
        "account",
        "supplied",
        "phenomenon",
        "identifying",
        "numerical",
        "relation",
        "basis",
        "knowledge",
        "philolaus",
        "may",
        "part",
        "responding",
        "parmenides",
        "stricture",
        "constitutes",
        "proper",
        "object",
        "thought",
        "mathematical",
        "relationship",
        "certainly",
        "fit",
        "number",
        "characteristic",
        "proper",
        "object",
        "thought",
        "set",
        "parmenides",
        "fr",
        "eg",
        "ungenerated",
        "imperishable",
        "unchangeable",
        "philolaus",
        "provide",
        "many",
        "specific",
        "example",
        "mathematical",
        "relation",
        "controlling",
        "phenomenon",
        "surprising",
        "given",
        "scientific",
        "capability",
        "time",
        "indeed",
        "fact",
        "fragment",
        "testimonia",
        "full",
        "facile",
        "equation",
        "number",
        "phenomenon",
        "suggests",
        "philolaus",
        "simply",
        "interested",
        "symbolic",
        "connection",
        "number",
        "thing",
        "philolaus",
        "looking",
        "connection",
        "scientifically",
        "verifiable",
        "case",
        "ratio",
        "govern",
        "musical",
        "interval",
        "moreover",
        "greek",
        "usage",
        "show",
        "number",
        "need",
        "indicate",
        "simple",
        "one",
        "one",
        "relation",
        "number",
        "thing",
        "also",
        "general",
        "sense",
        "indicating",
        "something",
        "constituted",
        "ordered",
        "plurality",
        "relation",
        "ordered",
        "plurality",
        "huffman",
        "musical",
        "scale",
        "one",
        "example",
        "alphabet",
        "may",
        "another",
        "philolaus",
        "epistemology",
        "science",
        "may",
        "involve",
        "classification",
        "systematization",
        "subject",
        "similarity",
        "plato",
        "collection",
        "division",
        "graham",
        "successor",
        "pythagorean",
        "tradition",
        "archytas",
        "tarentum",
        "appears",
        "adopted",
        "even",
        "successful",
        "carrying",
        "philolaus",
        "project",
        "accounting",
        "thing",
        "phenomenal",
        "world",
        "term",
        "number",
        "case",
        "however",
        "philolaus",
        "may",
        "content",
        "accept",
        "similarity",
        "property",
        "number",
        "property",
        "thing",
        "aristotle",
        "report",
        "pythagoreans",
        "identified",
        "individual",
        "number",
        "certain",
        "concept",
        "eg",
        "number",
        "four",
        "associated",
        "justice",
        "metaph",
        "b",
        "evidently",
        "first",
        "square",
        "number",
        "cf",
        "english",
        "expression",
        "square",
        "deal",
        "certain",
        "reference",
        "philolaus",
        "aristotle",
        "say",
        "counterearth",
        "introduced",
        "pythagorean",
        "astronomical",
        "system",
        "order",
        "bring",
        "number",
        "body",
        "orbiting",
        "central",
        "fire",
        "perfect",
        "number",
        "ten",
        "must",
        "apply",
        "philolaus",
        "since",
        "astronomical",
        "system",
        "described",
        "belongs",
        "see",
        "since",
        "world",
        "number",
        "ordered",
        "ten",
        "cosmos",
        "must",
        "parallel",
        "order",
        "analysis",
        "philolaus",
        "use",
        "mathematics",
        "see",
        "huffman",
        "zhmud",
        "argues",
        "philolaus",
        "early",
        "pythagoreans",
        "interest",
        "number",
        "symbolism",
        "found",
        "many",
        "culture",
        "engage",
        "arithmology",
        "focus",
        "special",
        "property",
        "first",
        "ten",
        "number",
        "certainly",
        "true",
        "evidence",
        "anything",
        "elaborate",
        "later",
        "arithmological",
        "treatise",
        "theologumena",
        "arithmeticae",
        "however",
        "order",
        "deny",
        "special",
        "significance",
        "number",
        "one",
        "ten",
        "philolaus",
        "one",
        "dismiss",
        "clear",
        "aristotelian",
        "evidence",
        "philolaus",
        "use",
        "four",
        "psychic",
        "faculty",
        "ten",
        "body",
        "rotating",
        "around",
        "central",
        "fire",
        "evidence",
        "philolaus",
        "thought",
        "number",
        "metaphysical",
        "status",
        "independent",
        "object",
        "describe",
        "contrary",
        "view",
        "ie",
        "philolaus",
        "thought",
        "abstract",
        "prior",
        "concrete",
        "see",
        "netz",
        "aristotle",
        "emphasizes",
        "pythagoreans",
        "differed",
        "plato",
        "separating",
        "number",
        "thing",
        "eg",
        "metaph",
        "b",
        "plato",
        "confirms",
        "interpretation",
        "criticism",
        "pythagoreans",
        "ground",
        "looked",
        "number",
        "thing",
        "rather",
        "focusing",
        "number",
        "r",
        "c",
        "hand",
        "aristotle",
        "assertion",
        "pythagoreans",
        "thought",
        "thing",
        "number",
        "made",
        "number",
        "also",
        "supported",
        "fragment",
        "philolaus",
        "describing",
        "component",
        "thing",
        "world",
        "philolaus",
        "always",
        "talk",
        "term",
        "limiter",
        "unlimiteds",
        "never",
        "asserts",
        "thing",
        "made",
        "arise",
        "number",
        "cf",
        "fr",
        "surviving",
        "fragment",
        "number",
        "explicitly",
        "introduced",
        "solve",
        "epistemological",
        "problem",
        "true",
        "however",
        "philolaus",
        "third",
        "metaphysical",
        "principle",
        "harmonia",
        "fitting",
        "together",
        "limiter",
        "unlimiteds",
        "accordance",
        "number",
        "number",
        "thus",
        "play",
        "metaphysical",
        "role",
        "defining",
        "essence",
        "thing",
        "indication",
        "material",
        "made",
        "aristotle",
        "assertion",
        "pythagoreans",
        "thought",
        "thing",
        "number",
        "best",
        "understood",
        "interpretation",
        "philolaus",
        "system",
        "amounted",
        "huffman",
        "see",
        "schibli",
        "defense",
        "aristotle",
        "assertion",
        "historically",
        "accurate",
        "aristotle",
        "may",
        "well",
        "thought",
        "number",
        "give",
        "u",
        "knowledge",
        "thing",
        "aristotelian",
        "term",
        "essence",
        "thing",
        "hence",
        "sense",
        "thing",
        "number",
        "philolaus",
        "appears",
        "thought",
        "thing",
        "composed",
        "unlimiteds",
        "material",
        "stuff",
        "structural",
        "feature",
        "shape",
        "number",
        "describes",
        "harmonia",
        "fitting",
        "together",
        "defines",
        "limiter",
        "unlimited",
        "combined",
        "hence",
        "give",
        "u",
        "formula",
        "thing",
        "question",
        "evidence",
        "addressed",
        "metaphysical",
        "status",
        "number"
    ]
}