{
    "main_text": "Basic Principles of Reality || Limiters and Unlimiteds\n2.1 Limiters and Unlimiteds\n\nPhilolaus begins his book with a bold statement of his central insight\nabout reality:\n\nNature (physis) in the world-order (cosmos) was\nfitted together out of things which are unlimited and out of things\nwhich are limiting, both the world-order as a whole and everything in\nit. (Fr. 1)\n\n\nThe language of this fragment shows that Philolaus is firmly in the\ntradition of Presocratic philosophy. Aristotle refers to the\nPresocratics as the physiologoi, “writers on\nnature,” and it is precisely nature (physis) that is\nthe first word of Philolaus’ book. Physis here means\n“nature” or “real constitution” and finds a\ngood parallel in Heraclitus’ famous saying that “nature\nloves to hide” (fr. 123). Philolaus uses it universally to refer\nto the natures of all individual things in the world as well as the\nnature of the cosmos as a whole. For an alternate view see Zhmud\n(2018) who argues that it means “all the things that have come\ninto being and exist.” Zhmud points out that Philolaus is the\nfirst thinker to make physis the main subject of his\nbook. The next words show that Philolaus, like his Presocratic\npredecessors, regarded the natural world as a cosmos, as an order, and\nsaw it as his central problem to explain that order. His answer to\nthat problem, however, is quite unlike earlier answers. Earlier\nPresocratics had tended to explain the natural world in terms of\nmaterial elements such as water or air, or groups of elements such as\nthe earth, air, fire and water of Empedocles.  Opposites such as the\nhot and the cold or the rare and the dense also played a prominent\nrole. Instead of these concrete and tangible substances Philolaus\nappeals to things which are unlimited, “unlimiteds,” and\nthings which limit, “limiters.” The basic problem in\nunderstanding Philolaus’ philosophy is thus to determine what he\nmeans by limiters and unlimiteds. In the surviving fragments, he never\nprovides a definition of these terms nor does he provide an explicit\nexample. Nonetheless he uses them repeatedly. In Fragment 2 he argues\nthat the basic elements of the world must logically be either all\nlimiters, all unlimiteds or both limiters and unlimiteds. He is\nemphatic here and argues further in Fr. 3, evidently against some of\nhis predecessors, that the basic elements cannot be simply\nunlimiteds. Since the world around us manifestly contains some things\nthat limit, some that are unlimited and others that are both limiting\nand unlimited, we must suppose that the elements from which the world\narose included both limiters and unlimiteds (Fr. 2). How could a\nlimiter arise from an unlimited or an unlimited from a limiter? In\nFr. 6 Philolaus argues that we cannot say anything more definite about\nthe ultimate principles of reality (“nature in itself” and\n“the being of things”). We can only go so far as to say\nthat they must have included limiters and unlimiteds in order for the\nworld we see around us to have arisen. Beyond this description the\nbasic principles of reality admit only of divine and not of human\nknowledge. Thus, it is a matter of principle that Philolaus does not\nidentify any particular set of limiters and unlimiteds as the basic\nprinciples of the world; identification of such a set is beyond human\ncapability. On the other hand, he clearly thinks that we can recognize\nlimiters and unlimiteds in the world around us and repeatedly appeals\nto this fact. If the cosmos and everything in it is put together from\nlimiters and unlimiteds, we ought to be able to identify some of\nthem.\n\nIt is logical to begin with the very first thing that is put together\nin Philolaus’ cosmos. In Fragment 7 Philolaus asserts that “The\nfirst thing fitted together, the one in the center of the sphere, is\ncalled the hearth.” From other evidence we know that this hearth\nin the center of Philolaus’ cosmos was known as the central fire,\naround which all the heavenly bodies, including the earth, orbit.\nSince the central fire is explicitly said to have been “fitted\ntogether,” according to Fr. 1 it must have been fitted together\nout of a limiter and an unlimited, like everything else in the cosmos.\nIt appears that the term “central fire” itself identifies\nthe limiter and unlimited from which it is composed. It is composed of\nthe unlimited fire, which is limited by its position in the center of\nthe sphere. One interpretation then would be that unlimiteds are\nstuffs and limiters are shapes (Barnes 1982, 387 ff.). It is striking\nconfirmation of this conjecture that many earlier Presocratics\ndescribed their material principles as “unlimited.”\nAnaximander posited the unlimited as the source from which the basic\nmaterial principles of the world, the opposites such as hot and cold,\nemerged, and his successor Anaximenes explicitly described his basic\nmaterial principle air, as unlimited (DK 13 A1 and A6). Anaxagoras, in\nthe generation before Philolaus, described all the things in the\noriginal mixture from which the world emerges as unlimited and this\nlist would appear to include air, aither (Fr. 1), dry, wet, hot, cold,\nbright, dark (Fr. 4), dense and rare (Fr. 12). Thus, Philolaus’\nunlimiteds probably included stuffs in the broad Presocratic sense,\nwhich treats opposites such as the hot and the cold as material\nsubstances. The next stage in Philolaus’ cosmogony after the\nconstruction of the central fire helps to identify yet more\nunlimiteds. In his lost work On the Pythagoreans Aristotle\ndescribes the universe as drawing in time, breath, and void from the\nunlimited (Arist., Fr. 201). This text certainly means that the\nuniverse was surrounded by an unlimited from which time, breath and\nvoid were drawn, but it probably also means that time, breath and void\nwere regarded as unlimiteds. Breath can be equated with air as a\ntypical Presocratic stuff, but time and the void show that we must\nexpand Philolaus’ conception of unlimiteds beyond stuffs. Unlimiteds\nappear to be not just materials, which can appear in various shapes,\nbut also continua, like time, which can be limited by various measures\nbut which do not have a shape. Philolaus thus accepts the earlier\nPresocratic reliance on material principles but introduces two radical\nchanges. First, he thinks it beyond human knowledge to identify any\nprivileged set of unlimiteds, such as earth, air, fire and water, as\nultimate elements. Second, he focuses not on the qualitative features\nof these stuffs (e.g. hot) but rather on their role as continua\n(Huffman 1993: 43–4; Graham 2014: 52).\n\nPhilolaus’ most significant innovation, however, is to argue that the\ncosmos cannot be adequately explained in terms of unlimiteds alone.\nThere appear to be two related arguments for this thesis. First,\nPhilolaus takes it as self-evident that the world is full of limiters\nsuch as shapes. If this is so, however, we must suppose that limiters\nwere among the basic principles from which the world arose, since it\nis impossible for what limits to arise from what is unlimited (Fr. 2).\nSecond, in Fragment 3, he argues that if all things are unlimited then\n“there will not be anything that is going to know.” This\nargument makes most sense if directed against Anaxagoras, who\ngenerates the world from elements that are all unlimited (Fr. 1), but\nwho claims that mind (nous), which is also said to be\nunlimited, knows all the things that are separated off from the\noriginal mixture (Fr. 12). Philolaus seems to regard the act of\nknowing as an act of limitation and hence as impossible, if reality is\ncomposed just of unlimiteds (Huffman 1993, 119–120). Parmenides\nis the only Presocratic before Philolaus to emphasize the role of\nlimit in his account of reality. Parmenides likens reality to a sphere\nand describes it as held in the bonds of a limit (DK 28 B8).\nPhilolaus’ insistence that the ultimate elements from which the cosmos\ndeveloped must have included not just unlimiteds but also limiters is\nbest understood as an attempt to integrate Parmenides’ insights about\nthe nature of reality with the earlier Presocratic emphasis on\nmaterial elements which are unlimited (Huffman 1999). Earlier\nPresocratics, such as Heraclitus (DK B30, B31), had recognized that\nthere was measure and structure in the world but no Presocratic had\nmade structure an element or principle in the world with the same\nstatus as material principles. It is Philolaus who first insists that\nstructure is equal in importance to material constitution (Huffman\n2013b; Graham 2014: 53). Philolaus’ explanation of the cosmos in terms\nof limiters and unlimiteds cannot be fully understood, however,\nwithout discussing his third basic principle, harmonia.\n",
    "section_title": "2.1 Limiters and Unlimiteds",
    "entry_title": "Philolaus",
    "hierarchy_title": "Philolaus || Basic Principles of Reality || Limiters and Unlimiteds",
    "tokenized_text": [
        "basic",
        "principle",
        "reality",
        "limiter",
        "unlimiteds",
        "limiter",
        "unlimiteds",
        "philolaus",
        "begin",
        "book",
        "bold",
        "statement",
        "central",
        "insight",
        "reality",
        "nature",
        "physis",
        "worldorder",
        "cosmos",
        "fitted",
        "together",
        "thing",
        "unlimited",
        "thing",
        "limiting",
        "worldorder",
        "whole",
        "everything",
        "fr",
        "language",
        "fragment",
        "show",
        "philolaus",
        "firmly",
        "tradition",
        "presocratic",
        "philosophy",
        "aristotle",
        "refers",
        "presocratics",
        "physiologoi",
        "writer",
        "nature",
        "precisely",
        "nature",
        "physis",
        "first",
        "word",
        "philolaus",
        "book",
        "physis",
        "mean",
        "nature",
        "real",
        "constitution",
        "find",
        "good",
        "parallel",
        "heraclitus",
        "famous",
        "saying",
        "nature",
        "love",
        "hide",
        "fr",
        "philolaus",
        "us",
        "universally",
        "refer",
        "nature",
        "individual",
        "thing",
        "world",
        "well",
        "nature",
        "cosmos",
        "whole",
        "alternate",
        "view",
        "see",
        "zhmud",
        "argues",
        "mean",
        "thing",
        "come",
        "exist",
        "zhmud",
        "point",
        "philolaus",
        "first",
        "thinker",
        "make",
        "physis",
        "main",
        "subject",
        "book",
        "next",
        "word",
        "show",
        "philolaus",
        "like",
        "presocratic",
        "predecessor",
        "regarded",
        "natural",
        "world",
        "cosmos",
        "order",
        "saw",
        "central",
        "problem",
        "explain",
        "order",
        "answer",
        "problem",
        "however",
        "quite",
        "unlike",
        "earlier",
        "answer",
        "earlier",
        "presocratics",
        "tended",
        "explain",
        "natural",
        "world",
        "term",
        "material",
        "element",
        "water",
        "air",
        "group",
        "element",
        "earth",
        "air",
        "fire",
        "water",
        "empedocles",
        "opposite",
        "hot",
        "cold",
        "rare",
        "dense",
        "also",
        "played",
        "prominent",
        "role",
        "instead",
        "concrete",
        "tangible",
        "substance",
        "philolaus",
        "appeal",
        "thing",
        "unlimited",
        "unlimiteds",
        "thing",
        "limit",
        "limiters",
        "basic",
        "problem",
        "understanding",
        "philolaus",
        "philosophy",
        "thus",
        "determine",
        "mean",
        "limiter",
        "unlimiteds",
        "surviving",
        "fragment",
        "never",
        "provides",
        "definition",
        "term",
        "provide",
        "explicit",
        "example",
        "nonetheless",
        "us",
        "repeatedly",
        "fragment",
        "argues",
        "basic",
        "element",
        "world",
        "must",
        "logically",
        "either",
        "limiter",
        "unlimiteds",
        "limiter",
        "unlimiteds",
        "emphatic",
        "argues",
        "fr",
        "evidently",
        "predecessor",
        "basic",
        "element",
        "simply",
        "unlimiteds",
        "since",
        "world",
        "around",
        "u",
        "manifestly",
        "contains",
        "thing",
        "limit",
        "unlimited",
        "others",
        "limiting",
        "unlimited",
        "must",
        "suppose",
        "element",
        "world",
        "arose",
        "included",
        "limiter",
        "unlimiteds",
        "fr",
        "could",
        "limiter",
        "arise",
        "unlimited",
        "unlimited",
        "limiter",
        "fr",
        "philolaus",
        "argues",
        "say",
        "anything",
        "definite",
        "ultimate",
        "principle",
        "reality",
        "nature",
        "thing",
        "go",
        "far",
        "say",
        "must",
        "included",
        "limiter",
        "unlimiteds",
        "order",
        "world",
        "see",
        "around",
        "u",
        "arisen",
        "beyond",
        "description",
        "basic",
        "principle",
        "reality",
        "admit",
        "divine",
        "human",
        "knowledge",
        "thus",
        "matter",
        "principle",
        "philolaus",
        "identify",
        "particular",
        "set",
        "limiter",
        "unlimiteds",
        "basic",
        "principle",
        "world",
        "identification",
        "set",
        "beyond",
        "human",
        "capability",
        "hand",
        "clearly",
        "think",
        "recognize",
        "limiter",
        "unlimiteds",
        "world",
        "around",
        "u",
        "repeatedly",
        "appeal",
        "fact",
        "cosmos",
        "everything",
        "put",
        "together",
        "limiter",
        "unlimiteds",
        "ought",
        "able",
        "identify",
        "logical",
        "begin",
        "first",
        "thing",
        "put",
        "together",
        "philolaus",
        "cosmos",
        "fragment",
        "philolaus",
        "asserts",
        "first",
        "thing",
        "fitted",
        "together",
        "one",
        "center",
        "sphere",
        "called",
        "hearth",
        "evidence",
        "know",
        "hearth",
        "center",
        "philolaus",
        "cosmos",
        "known",
        "central",
        "fire",
        "around",
        "heavenly",
        "body",
        "including",
        "earth",
        "orbit",
        "since",
        "central",
        "fire",
        "explicitly",
        "said",
        "fitted",
        "together",
        "according",
        "fr",
        "must",
        "fitted",
        "together",
        "limiter",
        "unlimited",
        "like",
        "everything",
        "else",
        "cosmos",
        "appears",
        "term",
        "central",
        "fire",
        "identifies",
        "limiter",
        "unlimited",
        "composed",
        "composed",
        "unlimited",
        "fire",
        "limited",
        "position",
        "center",
        "sphere",
        "one",
        "interpretation",
        "would",
        "unlimiteds",
        "stuff",
        "limiter",
        "shape",
        "barnes",
        "ff",
        "striking",
        "confirmation",
        "conjecture",
        "many",
        "earlier",
        "presocratics",
        "described",
        "material",
        "principle",
        "unlimited",
        "anaximander",
        "posited",
        "unlimited",
        "source",
        "basic",
        "material",
        "principle",
        "world",
        "opposite",
        "hot",
        "cold",
        "emerged",
        "successor",
        "anaximenes",
        "explicitly",
        "described",
        "basic",
        "material",
        "principle",
        "air",
        "unlimited",
        "dk",
        "a",
        "a",
        "anaxagoras",
        "generation",
        "philolaus",
        "described",
        "thing",
        "original",
        "mixture",
        "world",
        "emerges",
        "unlimited",
        "list",
        "would",
        "appear",
        "include",
        "air",
        "aither",
        "fr",
        "dry",
        "wet",
        "hot",
        "cold",
        "bright",
        "dark",
        "fr",
        "dense",
        "rare",
        "fr",
        "thus",
        "philolaus",
        "unlimiteds",
        "probably",
        "included",
        "stuff",
        "broad",
        "presocratic",
        "sense",
        "treat",
        "opposite",
        "hot",
        "cold",
        "material",
        "substance",
        "next",
        "stage",
        "philolaus",
        "cosmogony",
        "construction",
        "central",
        "fire",
        "help",
        "identify",
        "yet",
        "unlimiteds",
        "lost",
        "work",
        "pythagoreans",
        "aristotle",
        "describes",
        "universe",
        "drawing",
        "time",
        "breath",
        "void",
        "unlimited",
        "arist",
        "fr",
        "text",
        "certainly",
        "mean",
        "universe",
        "surrounded",
        "unlimited",
        "time",
        "breath",
        "void",
        "drawn",
        "probably",
        "also",
        "mean",
        "time",
        "breath",
        "void",
        "regarded",
        "unlimiteds",
        "breath",
        "equated",
        "air",
        "typical",
        "presocratic",
        "stuff",
        "time",
        "void",
        "show",
        "must",
        "expand",
        "philolaus",
        "conception",
        "unlimiteds",
        "beyond",
        "stuff",
        "unlimiteds",
        "appear",
        "material",
        "appear",
        "various",
        "shape",
        "also",
        "continuum",
        "like",
        "time",
        "limited",
        "various",
        "measure",
        "shape",
        "philolaus",
        "thus",
        "accepts",
        "earlier",
        "presocratic",
        "reliance",
        "material",
        "principle",
        "introduces",
        "two",
        "radical",
        "change",
        "first",
        "think",
        "beyond",
        "human",
        "knowledge",
        "identify",
        "privileged",
        "set",
        "unlimiteds",
        "earth",
        "air",
        "fire",
        "water",
        "ultimate",
        "element",
        "second",
        "focus",
        "qualitative",
        "feature",
        "stuff",
        "eg",
        "hot",
        "rather",
        "role",
        "continuum",
        "huffman",
        "graham",
        "philolaus",
        "significant",
        "innovation",
        "however",
        "argue",
        "cosmos",
        "adequately",
        "explained",
        "term",
        "unlimiteds",
        "alone",
        "appear",
        "two",
        "related",
        "argument",
        "thesis",
        "first",
        "philolaus",
        "take",
        "selfevident",
        "world",
        "full",
        "limiter",
        "shape",
        "however",
        "must",
        "suppose",
        "limiter",
        "among",
        "basic",
        "principle",
        "world",
        "arose",
        "since",
        "impossible",
        "limit",
        "arise",
        "unlimited",
        "fr",
        "second",
        "fragment",
        "argues",
        "thing",
        "unlimited",
        "anything",
        "going",
        "know",
        "argument",
        "make",
        "sense",
        "directed",
        "anaxagoras",
        "generates",
        "world",
        "element",
        "unlimited",
        "fr",
        "claim",
        "mind",
        "nous",
        "also",
        "said",
        "unlimited",
        "know",
        "thing",
        "separated",
        "original",
        "mixture",
        "fr",
        "philolaus",
        "seems",
        "regard",
        "act",
        "knowing",
        "act",
        "limitation",
        "hence",
        "impossible",
        "reality",
        "composed",
        "unlimiteds",
        "huffman",
        "parmenides",
        "presocratic",
        "philolaus",
        "emphasize",
        "role",
        "limit",
        "account",
        "reality",
        "parmenides",
        "likens",
        "reality",
        "sphere",
        "describes",
        "held",
        "bond",
        "limit",
        "dk",
        "b",
        "philolaus",
        "insistence",
        "ultimate",
        "element",
        "cosmos",
        "developed",
        "must",
        "included",
        "unlimiteds",
        "also",
        "limiter",
        "best",
        "understood",
        "attempt",
        "integrate",
        "parmenides",
        "insight",
        "nature",
        "reality",
        "earlier",
        "presocratic",
        "emphasis",
        "material",
        "element",
        "unlimited",
        "huffman",
        "earlier",
        "presocratics",
        "heraclitus",
        "dk",
        "b",
        "b",
        "recognized",
        "measure",
        "structure",
        "world",
        "presocratic",
        "made",
        "structure",
        "element",
        "principle",
        "world",
        "status",
        "material",
        "principle",
        "philolaus",
        "first",
        "insists",
        "structure",
        "equal",
        "importance",
        "material",
        "constitution",
        "huffman",
        "b",
        "graham",
        "philolaus",
        "explanation",
        "cosmos",
        "term",
        "limiter",
        "unlimiteds",
        "fully",
        "understood",
        "however",
        "without",
        "discussing",
        "third",
        "basic",
        "principle",
        "harmonia"
    ]
}