{
    "main_text": "Religious Epistemology || Evidentialism, Reformed Epistemology, and Volitional Epistemology\n3.1 Evidentialism, Reformed Epistemology, and Volitional Epistemology\n\nEvidentialism is the view that for a person to be justified in some\nbelief, that person must have some awareness of the evidence for the\nbelief. This is usually articulated as a person’s belief being\njustified given the total evidence available to the person. On this\nview, the belief in question must not be undermined (or defeated) by\nother, evident beliefs held by the person. Moreover, evidentialists\noften contend that the degree of confidence in a belief should be\nproportional to the evidence. Evidentialism has been defended by\nrepresentatives of all the different viewpoints in philosophy of\nreligion: theism, atheism, advocates of non-theistic models of God,\nagnostics. Evidentialists have differed in terms of their accounts of\nevidence (what weight might be given to phenomenology?) and the\nrelationship between evident beliefs (must beliefs either be\nfoundational or basic or entailed by such foundational beliefs?)\nProbably the most well known evidentialist in the field of philosophy\nof religion who advocates for theism is Richard Swinburne\n(1934–).\n\nSwinburne was (and is) the leading advocate of theistic natural\ntheology since the early 1970s. Swinburne has applied his considerable\nanalytical skills in arguing for the coherence and cogency of theism,\nand the analysis and defense of specific Christian teachings about the\ntrinity, incarnation, the resurrection of Christ, revelation, and\nmore. Swinburne’s projects in the evidentialist tradition in\nphilosophy of religion are in the great tradition of British\nphilosophy of religion from the Cambridge Platonists in the\nseventeenth century through Joseph Butler (1692–1752) and\nWilliam Paley (1743–1805) to twentieth century British\nphilosophers such as A.E. Taylor (1869–1945), F. R. Tennant\n(1866–1957), William Temple (1881–1944), H.D. Lewis\n(1910–1992), and A.C. Ewing (1899–1973). The positive\nphilosophical case for theism has been met by work by many powerful\nphilosophers, most recently Ronald Hepburn (1927–2008), J.L.\nMackie (1917–1981), Antony Flew (1923–2010), Richard Gale\n(1932–2015), William Rowe (1931–2015), Michael Martin\n(1932–2015), Graham Oppy (1960–), J.L. Schellenberg\n(1959–), and Paul Draper (1957–). (See The Routledge\nCompanion to Theism [Taliaferro, Harrison, & Goetz 2012] for\nan overview of such work.)\n\nThere have been at least two interesting, recent developments in the\nphilosophy of religion in the framework of evidentialism. One has been\nadvanced by John Schellenberg who argues that if the God of\nChristianity exists, God’s reality would be far more evident\nthan it is. Arguably, in the Christian understanding of values, an\nevident relationship with God is part of the highest human good, and\nif God were loving, God would bring about such a good. Because there\nis evidence that God does not make Godself available to earnest\nseekers of such a relationship, this is evidence that such a God does\nnot exist. According to this line of reasoning, the absence of\nevidence of the God of Christianity is evidence of absence (see\nSchellenberg 2007 and Howard-Snyder & Moser 2001). The argument\napplies beyond Christian values and theism, and to any concept of God\nin which God is powerful and good and such that a relationship with\nsuch a good God would be fulfilling and good for creatures. It would\nnot work with a concept of God (as we find, for example, in the work\nof Aristotle) in which God is not lovingly and providentially engaged\nin the world. This line of reasoning is often referred to in terms of\nthe hiddenness of God.\n\nAnother interesting development has been advanced by Sandra Menssen\nand Thomas Sullivan. In philosophical reflection about God the\ntendency has been to give priority to what may be called bare theism\n(assessing the plausibility of there being the God of theism) rather\nthan a more specific concept of God. This priority makes sense insofar\nas the plausibility of a general thesis (there are mammals on the\nsavanna) will be greater than a more specific thesis (there are 12,796\ngiraffes on the savanna). But Menssen and Sullivan argue that\npracticing philosophy of religion from a more particular, especially\nChristian, context, provides a richer “data base” for\nreflection.\n\n\nThe all–too–common insistence among philosophers that\nproper procedure requires establishing the likelihood of God’s\nexistence prior to testing revelatory claims cuts off a huge part of\nthe data base relevant to arguing for theism… For it is\ndifficult to establish God’s existence as likely unless some\naccount can be given of the evils of the world, and the account\nChristianity has to offer is unimaginably richer than any\nnon-religious account. The Christian account, accessed through\nscripture, is a story of love: of God’s love for us and of what\nGod has prepared for those who love him… It is a story of the\nsalvific value of suffering: our sufferings are caught up with\nChrist’s, and are included in the sufferings adequate for the\nworld’s redemption, sufferings Christ has willed to make his\nown. (Menssen & Sullivan 2017: 37–38)\n\n\nIn terms of the order of inquiry, it may be helpful at times, to\nconsider more specific philosophical positions—for example, it\nmay seem at first glance that materialism is hopeless until one\nengages the resources of some specific materialist account that\ninvolves functionalism—but, arguably, this does not alone offset\nthe logical primacy of the more general thesis (whether this is bare\ntheism or bare materialism). Perhaps the import of the\nMenssen-Sullivan proposal is that philosophers of religion need to\nenhance their critical assessment of general positions along with\ntaking seriously more specific accounts about the data on hand (e.g.,\nwhen it comes to theism, assessing the problem of evil in terms of\npossible theological positions on redemption as presented in\nostensible revelations).\n\nEvidentialism has been challenged on many grounds. Some argue that it\nis too stringent; we have many evident beliefs that we would be at a\nloss to successfully justify. Instead of evidentialism, some\nphilosophers adopt a form of reliabilism, according to which a person\nmay be justified in a belief so long as the belief is produced by a\nreliable means, whether or not the person is aware of evidence that\njustifies the belief. Two movements in philosophy of religion develop\npositions that are not in line with the traditional evidential\ntradition: reformed epistemology and volitional epistemology.\n\nReformed epistemology has been championed by Alvin Plantinga\n(1932–) and Nicholas Wolterstorff (1932–), among others.\nReformed epistemology is “Reformed” insofar as it draws on\nthe Reformer John Calvin (1509–1564) who claimed that persons\nare created with a sense of God (sensus divinitatis). While\nthis sense of God may not be apparent due to sin, it can reliably\nprompt persons to believe in God and support a life of Christian\nfaith. While this prompting may play an evidential role in terms of\nthe experience or ostensible perception of God, it can also warrant\nChristian belief in the absence of evidence or argument (see K. Clark\n& VanArragon 2011; M. Bergmann 2017; and Plantinga & Bergmann\n2016). In the language Plantinga introduced, belief in God may be as\nproperly basic as our ordinary beliefs about other persons and the\nworld. The framework of Reformed epistemology is conditional as it\nadvances the thesis that if there is a God and if God has indeed\ncreated us with a sensus divinitatis that reliably leads us\nto believe (truly) that God exists, then such belief is warranted.\nThere is a sense in which Reformed epistemology is more of a defensive\nstrategy (offering grounds for thinking that religious belief, if\ntrue, is warranted) rather than providing a positive reason why\npersons who do not have (or believe they have) a sensus\ndivinitatis should embrace Christian faith. Plantinga has argued\nthat at least one alternative to Christian faith, secular naturalism,\nis deeply problematic, if not self-refuting, but this position (if\ncogent) has been advanced more as a reason not to be a naturalist than\nas a reason for being a theist. (For a stronger version of the\nargument that theism better accounts for the normativity of reason\nthan alternatives, see Angus Menuge’s Agents Under\nFire, 2004.)\n\nReformed epistemology is not ipso facto fideism. Fideism\nexplicitly endorses the legitimacy of faith without the support, not\njust of (propositional) evidence, but also of reason (MacSwain 2013).\nBy contrast, Reformed epistemology offers a metaphysical and\nepistemological account of warrant according to which belief in God\ncan be warranted even if it is not supported by evidence and it offers\nan account of properly basic belief according to which basic belief in\nGod is on an epistemic par with our ordinary basic beliefs about the\nworld and other minds which seem to be paradigmatically rational.\nNonetheless, while Reformed epistemology is not necessarily fideistic,\nit shares with fideism the idea that a person may have a justified\nreligious belief in the absence of evidence.\n\nConsider now what is called volitional epistemology in the philosophy\nof religion. Paul Moser has systematically argued for a profoundly\ndifferent framework in which he contends that if the God of\nChristianity exists, this God would not be evident to inquirers who\n(for example) are curious about whether God exists. By Moser’s\nlights, the God of Christianity would only become evident in a process\nthat would involve the moral and spiritual transformation of persons\n(Moser 2017). This process might involve persons receiving (accepting)\nthe revelation of Jesus Christ as redeemer and sanctifier who calls\npersons to a radical life of loving compassion, even the loving of our\nenemies. By willfully subjecting oneself to the commanding love of\nGod, a person in this filial relationship with God through Christ may\nexperience a change of character (from self-centeredness to serving\nothers) in which the person’s character (or very being) may come\nto serve as evidence of the truths of faith.\n",
    "section_title": "3.1 Evidentialism, Reformed Epistemology, and Volitional Epistemology",
    "entry_title": "Philosophy of Religion",
    "hierarchy_title": "Philosophy of Religion || Religious Epistemology || Evidentialism, Reformed Epistemology, and Volitional Epistemology",
    "tokenized_text": [
        "religious",
        "epistemology",
        "evidentialism",
        "reformed",
        "epistemology",
        "volitional",
        "epistemology",
        "evidentialism",
        "reformed",
        "epistemology",
        "volitional",
        "epistemology",
        "evidentialism",
        "view",
        "person",
        "justified",
        "belief",
        "person",
        "must",
        "awareness",
        "evidence",
        "belief",
        "usually",
        "articulated",
        "person",
        "belief",
        "justified",
        "given",
        "total",
        "evidence",
        "available",
        "person",
        "view",
        "belief",
        "question",
        "must",
        "undermined",
        "defeated",
        "evident",
        "belief",
        "held",
        "person",
        "moreover",
        "evidentialists",
        "often",
        "contend",
        "degree",
        "confidence",
        "belief",
        "proportional",
        "evidence",
        "evidentialism",
        "defended",
        "representative",
        "different",
        "viewpoint",
        "philosophy",
        "religion",
        "theism",
        "atheism",
        "advocate",
        "nontheistic",
        "model",
        "god",
        "agnostic",
        "evidentialists",
        "differed",
        "term",
        "account",
        "evidence",
        "weight",
        "might",
        "given",
        "phenomenology",
        "relationship",
        "evident",
        "belief",
        "must",
        "belief",
        "either",
        "foundational",
        "basic",
        "entailed",
        "foundational",
        "belief",
        "probably",
        "well",
        "known",
        "evidentialist",
        "field",
        "philosophy",
        "religion",
        "advocate",
        "theism",
        "richard",
        "swinburne",
        "swinburne",
        "leading",
        "advocate",
        "theistic",
        "natural",
        "theology",
        "since",
        "early",
        "s",
        "swinburne",
        "applied",
        "considerable",
        "analytical",
        "skill",
        "arguing",
        "coherence",
        "cogency",
        "theism",
        "analysis",
        "defense",
        "specific",
        "christian",
        "teaching",
        "trinity",
        "incarnation",
        "resurrection",
        "christ",
        "revelation",
        "swinburne",
        "project",
        "evidentialist",
        "tradition",
        "philosophy",
        "religion",
        "great",
        "tradition",
        "british",
        "philosophy",
        "religion",
        "cambridge",
        "platonist",
        "seventeenth",
        "century",
        "joseph",
        "butler",
        "william",
        "paley",
        "twentieth",
        "century",
        "british",
        "philosopher",
        "ae",
        "taylor",
        "f",
        "r",
        "tennant",
        "william",
        "temple",
        "hd",
        "lewis",
        "ac",
        "ewing",
        "positive",
        "philosophical",
        "case",
        "theism",
        "met",
        "work",
        "many",
        "powerful",
        "philosopher",
        "recently",
        "ronald",
        "hepburn",
        "jl",
        "mackie",
        "antony",
        "flew",
        "richard",
        "gale",
        "william",
        "rowe",
        "michael",
        "martin",
        "graham",
        "oppy",
        "jl",
        "schellenberg",
        "paul",
        "draper",
        "see",
        "routledge",
        "companion",
        "theism",
        "taliaferro",
        "harrison",
        "goetz",
        "overview",
        "work",
        "least",
        "two",
        "interesting",
        "recent",
        "development",
        "philosophy",
        "religion",
        "framework",
        "evidentialism",
        "one",
        "advanced",
        "john",
        "schellenberg",
        "argues",
        "god",
        "christianity",
        "exists",
        "god",
        "reality",
        "would",
        "far",
        "evident",
        "arguably",
        "christian",
        "understanding",
        "value",
        "evident",
        "relationship",
        "god",
        "part",
        "highest",
        "human",
        "good",
        "god",
        "loving",
        "god",
        "would",
        "bring",
        "good",
        "evidence",
        "god",
        "make",
        "godself",
        "available",
        "earnest",
        "seeker",
        "relationship",
        "evidence",
        "god",
        "exist",
        "according",
        "line",
        "reasoning",
        "absence",
        "evidence",
        "god",
        "christianity",
        "evidence",
        "absence",
        "see",
        "schellenberg",
        "howardsnyder",
        "moser",
        "argument",
        "applies",
        "beyond",
        "christian",
        "value",
        "theism",
        "concept",
        "god",
        "god",
        "powerful",
        "good",
        "relationship",
        "good",
        "god",
        "would",
        "fulfilling",
        "good",
        "creature",
        "would",
        "work",
        "concept",
        "god",
        "find",
        "example",
        "work",
        "aristotle",
        "god",
        "lovingly",
        "providentially",
        "engaged",
        "world",
        "line",
        "reasoning",
        "often",
        "referred",
        "term",
        "hiddenness",
        "god",
        "another",
        "interesting",
        "development",
        "advanced",
        "sandra",
        "menssen",
        "thomas",
        "sullivan",
        "philosophical",
        "reflection",
        "god",
        "tendency",
        "give",
        "priority",
        "may",
        "called",
        "bare",
        "theism",
        "assessing",
        "plausibility",
        "god",
        "theism",
        "rather",
        "specific",
        "concept",
        "god",
        "priority",
        "make",
        "sense",
        "insofar",
        "plausibility",
        "general",
        "thesis",
        "mammal",
        "savanna",
        "greater",
        "specific",
        "thesis",
        "giraffe",
        "savanna",
        "menssen",
        "sullivan",
        "argue",
        "practicing",
        "philosophy",
        "religion",
        "particular",
        "especially",
        "christian",
        "context",
        "provides",
        "richer",
        "data",
        "base",
        "reflection",
        "alltoocommon",
        "insistence",
        "among",
        "philosopher",
        "proper",
        "procedure",
        "requires",
        "establishing",
        "likelihood",
        "god",
        "existence",
        "prior",
        "testing",
        "revelatory",
        "claim",
        "cut",
        "huge",
        "part",
        "data",
        "base",
        "relevant",
        "arguing",
        "theism",
        "difficult",
        "establish",
        "god",
        "existence",
        "likely",
        "unless",
        "account",
        "given",
        "evil",
        "world",
        "account",
        "christianity",
        "offer",
        "unimaginably",
        "richer",
        "nonreligious",
        "account",
        "christian",
        "account",
        "accessed",
        "scripture",
        "story",
        "love",
        "god",
        "love",
        "u",
        "god",
        "prepared",
        "love",
        "him",
        "story",
        "salvific",
        "value",
        "suffering",
        "suffering",
        "caught",
        "christ",
        "included",
        "suffering",
        "adequate",
        "world",
        "redemption",
        "suffering",
        "christ",
        "willed",
        "make",
        "menssen",
        "sullivan",
        "term",
        "order",
        "inquiry",
        "may",
        "helpful",
        "time",
        "consider",
        "specific",
        "philosophical",
        "positionsfor",
        "example",
        "may",
        "seem",
        "first",
        "glance",
        "materialism",
        "hopeless",
        "one",
        "engages",
        "resource",
        "specific",
        "materialist",
        "account",
        "involves",
        "functionalismbut",
        "arguably",
        "alone",
        "offset",
        "logical",
        "primacy",
        "general",
        "thesis",
        "whether",
        "bare",
        "theism",
        "bare",
        "materialism",
        "perhaps",
        "import",
        "menssensullivan",
        "proposal",
        "philosopher",
        "religion",
        "need",
        "enhance",
        "critical",
        "assessment",
        "general",
        "position",
        "along",
        "taking",
        "seriously",
        "specific",
        "account",
        "data",
        "hand",
        "eg",
        "come",
        "theism",
        "assessing",
        "problem",
        "evil",
        "term",
        "possible",
        "theological",
        "position",
        "redemption",
        "presented",
        "ostensible",
        "revelation",
        "evidentialism",
        "challenged",
        "many",
        "ground",
        "argue",
        "stringent",
        "many",
        "evident",
        "belief",
        "would",
        "loss",
        "successfully",
        "justify",
        "instead",
        "evidentialism",
        "philosopher",
        "adopt",
        "form",
        "reliabilism",
        "according",
        "person",
        "may",
        "justified",
        "belief",
        "long",
        "belief",
        "produced",
        "reliable",
        "mean",
        "whether",
        "person",
        "aware",
        "evidence",
        "justifies",
        "belief",
        "two",
        "movement",
        "philosophy",
        "religion",
        "develop",
        "position",
        "line",
        "traditional",
        "evidential",
        "tradition",
        "reformed",
        "epistemology",
        "volitional",
        "epistemology",
        "reformed",
        "epistemology",
        "championed",
        "alvin",
        "plantinga",
        "nicholas",
        "wolterstorff",
        "among",
        "others",
        "reformed",
        "epistemology",
        "reformed",
        "insofar",
        "draw",
        "reformer",
        "john",
        "calvin",
        "claimed",
        "person",
        "created",
        "sense",
        "god",
        "sensus",
        "divinitatis",
        "sense",
        "god",
        "may",
        "apparent",
        "due",
        "sin",
        "reliably",
        "prompt",
        "person",
        "believe",
        "god",
        "support",
        "life",
        "christian",
        "faith",
        "prompting",
        "may",
        "play",
        "evidential",
        "role",
        "term",
        "experience",
        "ostensible",
        "perception",
        "god",
        "also",
        "warrant",
        "christian",
        "belief",
        "absence",
        "evidence",
        "argument",
        "see",
        "k",
        "clark",
        "vanarragon",
        "m",
        "bergmann",
        "plantinga",
        "bergmann",
        "language",
        "plantinga",
        "introduced",
        "belief",
        "god",
        "may",
        "properly",
        "basic",
        "ordinary",
        "belief",
        "person",
        "world",
        "framework",
        "reformed",
        "epistemology",
        "conditional",
        "advance",
        "thesis",
        "god",
        "god",
        "indeed",
        "created",
        "u",
        "sensus",
        "divinitatis",
        "reliably",
        "lead",
        "u",
        "believe",
        "truly",
        "god",
        "exists",
        "belief",
        "warranted",
        "sense",
        "reformed",
        "epistemology",
        "defensive",
        "strategy",
        "offering",
        "ground",
        "thinking",
        "religious",
        "belief",
        "true",
        "warranted",
        "rather",
        "providing",
        "positive",
        "reason",
        "person",
        "believe",
        "sensus",
        "divinitatis",
        "embrace",
        "christian",
        "faith",
        "plantinga",
        "argued",
        "least",
        "one",
        "alternative",
        "christian",
        "faith",
        "secular",
        "naturalism",
        "deeply",
        "problematic",
        "selfrefuting",
        "position",
        "cogent",
        "advanced",
        "reason",
        "naturalist",
        "reason",
        "theist",
        "stronger",
        "version",
        "argument",
        "theism",
        "better",
        "account",
        "normativity",
        "reason",
        "alternative",
        "see",
        "angus",
        "menuge",
        "agent",
        "fire",
        "reformed",
        "epistemology",
        "ipso",
        "facto",
        "fideism",
        "fideism",
        "explicitly",
        "endorses",
        "legitimacy",
        "faith",
        "without",
        "support",
        "propositional",
        "evidence",
        "also",
        "reason",
        "macswain",
        "contrast",
        "reformed",
        "epistemology",
        "offer",
        "metaphysical",
        "epistemological",
        "account",
        "warrant",
        "according",
        "belief",
        "god",
        "warranted",
        "even",
        "supported",
        "evidence",
        "offer",
        "account",
        "properly",
        "basic",
        "belief",
        "according",
        "basic",
        "belief",
        "god",
        "epistemic",
        "par",
        "ordinary",
        "basic",
        "belief",
        "world",
        "mind",
        "seem",
        "paradigmatically",
        "rational",
        "nonetheless",
        "reformed",
        "epistemology",
        "necessarily",
        "fideistic",
        "share",
        "fideism",
        "idea",
        "person",
        "may",
        "justified",
        "religious",
        "belief",
        "absence",
        "evidence",
        "consider",
        "called",
        "volitional",
        "epistemology",
        "philosophy",
        "religion",
        "paul",
        "moser",
        "systematically",
        "argued",
        "profoundly",
        "different",
        "framework",
        "contends",
        "god",
        "christianity",
        "exists",
        "god",
        "would",
        "evident",
        "inquirer",
        "example",
        "curious",
        "whether",
        "god",
        "exists",
        "moser",
        "light",
        "god",
        "christianity",
        "would",
        "become",
        "evident",
        "process",
        "would",
        "involve",
        "moral",
        "spiritual",
        "transformation",
        "person",
        "moser",
        "process",
        "might",
        "involve",
        "person",
        "receiving",
        "accepting",
        "revelation",
        "jesus",
        "christ",
        "redeemer",
        "sanctifier",
        "call",
        "person",
        "radical",
        "life",
        "loving",
        "compassion",
        "even",
        "loving",
        "enemy",
        "willfully",
        "subjecting",
        "oneself",
        "commanding",
        "love",
        "god",
        "person",
        "filial",
        "relationship",
        "god",
        "christ",
        "may",
        "experience",
        "change",
        "character",
        "selfcenteredness",
        "serving",
        "others",
        "person",
        "character",
        "may",
        "come",
        "serve",
        "evidence",
        "truth",
        "faith"
    ]
}