{
    "main_text": "Ethics, Part Two: Why a Person should be Just || Psychological Health\n3.1 Psychological Health\n\n\nIt is possible to find in the Republic as many as five\nseparate arguments for the claim that it is better to be just than\nunjust, without regard to how other people and gods perceive us. The\nfirst appeals to an analogy between psychological health and physical\nhealth in Book Four (445a–b). The second, third, and fourth are what\nSocrates calls his three “proofs” in Books Eight and Nine\n(543c–580c, esp. 576b–580c; 580c–583a; 583b–588a). And the fifth is\nthe image of the human soul consisting of a little human being\n(reason), a lion (spirit), and a many-headed beast (appetite) (588b\nff.). Yet the first of these is interrupted and said in Book Eight to\nbe continuous with the first “proof” of Books Eight and\nNine (543c), and the last of them seems to be offered as a closing\nexhortation. This whittling leaves us with the three arguments that\nSocrates labels his “proofs” (580c9, cf. 583b), the first\ndiscussing psychological health and disease at length and the second\nand third concerning pleasure.\n\n\nAlready in Book Four, Glaucon is ready to declare that unjust souls \nare ruined and in turmoil. But Socrates presses for a fuller \nreckoning. When he finally resumes in Book Eight where he had left \noff in Book Four, Socrates offers a long account of four defective \npsychological types. The list is not exhaustive (544cd, cf. \n445c), but it captures the four imperfect kinds of pure psychological\nconstitutions: pure rule by spirited attitudes, pure rule by \nnecessary appetitive attitudes, pure rule by unnecessary but \nregulable appetitive attitudes, and pure rule by lawless appetitive \nattitudes. At the end of this long discussion, Socrates will again \nask which sort of person lives the best life: the aristocratic soul \nof Books Six and Seven, or one of the other souls of Books Eight and \nNine?\n\n\nWe might expect Socrates and Glaucon to argue carefully by \nelimination, showing the just life to be better than every sort of \nunjust life. But they do not. Instead, they quickly contrast the \ntyrannical soul with the aristocratic soul, the most unjust with the \nmost just. This might seem to pick up on Glaucon’s original demand \n(in Book Two) to see how the perfectly just—who is most \nunfortunate but still just—is better than the perfectly \nunjust—who is unjust but still esteemed. But it does not even \ndo that, since Socrates is very far from portraying the best soul in \nthe least favorable circumstances and the worst soul in the most \nfavorable circumstances. Nevertheless, Socrates’ limited comparison \nin Book Nine might provide the resources to explain why it is better \nto be the unluckiest philosopher than the luckiest tyrant and why it \nis better to be just than to be unjust in any way whatsoever, for it \nmight provide general lessons that apply to these other comparisons.\n\n\nSocrates and Glaucon characterize the person ruled by his lawless \nattitudes as enslaved, as least able to do what it wants, as full of \ndisorder and regret, as poor and unsatisfiable, and as fearful \n(577c–578a). These characterizations fit in a logical order. The \ntyrant is enslaved because he is ruled by an utterly unlimited \nappetite, which prompts in him appetitive desire whenever any chance \nobject of appetite presents itself to his consideration. Given this \ncondition, he experiences appetitive desires that he cannot satisfy, \neither because they are too difficult for him to satisfy or because \nsatisfying them would prevent satisfying other of his desires. His \nexperience of unsatisfied desires must make him wish that he could \nsatisfy them and feel poor and unsatisfiable because he cannot. \nWorse, because his unsatisfied appetitive desires continue to press \nfor satisfaction over time, they make him aware of his past inability\nto to do what he wants, which prompts regret, and of his likely \nfuture inability to do what he wants, which makes him fearful. The \nresult is a miserable existence, and the misery is rooted in \nunlimited attitudes that demand more satisfaction than a person can \nachieve. In a nutshell, the tyrant lacks the capacity to do what he \nwants to do.\n\n\nThe philosopher, by contrast, is most able to do what she wants to \ndo, for she wants to do what is best, and as long as one has agency, \nthere would seem to be a doable best. (Should circumstances make a \ncertain apparent best undoable, then it would no longer appear to be \nbest.) But this is not to say that the philosopher is guaranteed to \nbe able to do what she wants. First, Socrates is quite clear that \nsome appetitive attitudes are necessary, and one can well imagine \ncircumstances of extreme deprivation in which the necessary \nappetitive attitudes (for food or drink, say) are unsatisfiable. \nSecond, the capacity to do what is best might require engaging in \ncertain kinds of activities in order to maintain itself. So even if \nthe philosopher can satisfy her necessary appetitive attitudes, she \nmight be prevented by unfortunate circumstances from the sorts of \nregular thought and action that are required to hold onto the \ncapacity to do what is best. Thus, even if a philosophical soul is \nmost able to do what it wants, and the closest thing to a sure bet \nfor this capacity, it does not retain this ability in every \ncircumstance.\n\n\nThis comparison between the tyrannical soul and the philosophical \nsoul does all the work that Socrates needs if the capacity to do what\none wants correlates closely with human success or happiness and if \nthe lessons about the tyrant’s incapacity generalize to the other \ndefective psychological constitutions. \n\n\nSocrates does not need happiness to be the capacity to do \nwhat one wants, or the absence of regret, frustration, and fear. He \ncould continue to think, as he thought in Book One, that happiness is\nvirtuous activity (354a). But if his argument here works, happiness, \nwhatever it is, must require the capacity to do what one wants and be\ninconsistent with regret, frustration, and fear.\n\n\nHow does the argument apply to unjust people who are not \npsychologically tyrannical? Anyone who is not a philosopher either \nhas a divided soul or is ruled by spirit or appetite. Division in the soul \nplainly undercuts the ability to do what one wants. Can one seek \nhonor or money above all and do what one wants? Although the ability \nto do what is honorable or make money is not as flexible as the \nability to do what is best, it is surely possible, in favorable \ncircumstances, for someone to be consistently able to do what is \nhonorable or money-making. This will not work if the agent is \nconflicted about what is honorable or makes money. So he needs to be \ncarefully educated, and he needs limited options. But if he does \nenjoy adequate education and an orderly social environment, there is \nno reason to suppose that he could not escape being racked by regret,\nfrustration, or fear. This explains how the members of the lower \nclasses in Socrates’ ideal city—who are probably not best identified as the timocrats and oligarchs of Book Eight (Wilberding 2009 and Jeon 2014)—can have a kind of capacity to do \nwhat they want, even though they are slavishly dependent upon the \nrulers’ work (cf. 590c–d).\n\n\nThe characterization of appropriately ruled non-philosophers as \nslavish might suggest a special concern for the “heteronomous” \ncharacter of their capacity to do what they want and a special \nvalorization of the philosophers’ “autonomous” capacity. But we \nshould be hesitant about applying these frequently confused and \npossibly anachronistic concepts to the Republic. Plato would\nprobably prefer to think in terms of self-sufficiency (369b), and for the \npurposes of Socrates’ argument here, it is enough to contrast the way\na producer’s capacity is deeply dependent upon social surroundings \nand the way a philosopher’s capacity is relatively free from this \ndependence, once it has been cultivated.\n\n\nThis contrast must not be undersold, for it is plausible to think \nthat the self-sufficiency of the philosopher makes him better off. \nAppropriately ruled non-philosophers can enjoy the capacity to do \nwhat they want only so long as their circumstances are appropriately \nruled, and this makes their success far less stable than what the \nphilosophers enjoy. Things in the world tend to change, and the \nphilosopher is in a much better position to flourish through these \nchanges. Those of us living in imperfect cities, looking to the \nRepublic for a model of how to live (cf. 592b), need to \nemulate the philosopher in order to pursue stable, reliable success or \nhappiness.\n\n\nNevertheless, so far as this argument shows, the success or happiness of \nappropriately ruled non-philosophers is just as real as that\nof philosophers. Judged exclusively by the capacity to do what one wants \nand the presence or absence of regret, frustration, and fear, \nphilosophers are not better off than very fortunate non-philosophers. \n(The non-philosophers have to be so fortunate that they do not even \nrecognize any risk to their good fortune. Otherwise, they would fear \na change in their luck.) The philosopher’s success is more secure \nthan the non-philosopher’s, but if it is also better as success than the \nnon-philosopher’s, Socrates’ first argument does not show that it is. (See also Kenny 1969 and Kraut 1992.)\n\n\nSocrates needs further argument in any case if he wants to convince \nthose of us in imperfect circumstances (like Glaucon and Adeimantus) \nto pursue the philosophical life of perfect justice. The first \nargument tries to show that anyone who wants to satisfy her desires \nperfectly should cultivate certain kinds of desires rather than \nothers. We can reject this argument in either of two ways, by taking \nissue with his analysis of which desires are regularly satisfiable \nand which are not, or by explaining why a person should not want to \nsatisfy her desires perfectly. The first response calls for a \nquasi-empirical investigation of a difficult sort, but the second \nseems easy. We can just argue that a good human life must be subject \nto regret and loss. Of course, it is not enough to say that the human\ncondition is in fact marked by regret and loss. There is no \ninconsistency in maintaining that one should aim at a secure life in \norder to live the best possible human life while also realizing that \nthe best possible human life will be marked by insecurity. In fact, \none might even think that the proper experience of fragility requires\nattachment to security as one’s end. Instead, to reject Socrates’ argument,\nwe must show that it is wrong to aim at a life that is free of regret\nand loss: we must show that the pursuit of security leads one to \nreject certain desires that one should not reject. In this way, we \nmove beyond a discussion of which desires are satisfiable, and we \ntackle the question about the value of what is desired and the value \nof the desiring itself. To address this possible objection, Socrates \nneeds to give us a different argument.\n",
    "section_title": "3.1 Psychological Health",
    "entry_title": "Plato’s Ethics and Politics in The Republic",
    "hierarchy_title": "Plato’s Ethics and Politics in The Republic || Ethics, Part Two: Why a Person should be Just || Psychological Health",
    "tokenized_text": [
        "ethic",
        "part",
        "two",
        "person",
        "psychological",
        "health",
        "psychological",
        "health",
        "possible",
        "find",
        "republic",
        "many",
        "five",
        "separate",
        "argument",
        "claim",
        "better",
        "unjust",
        "without",
        "regard",
        "people",
        "god",
        "perceive",
        "u",
        "first",
        "appeal",
        "analogy",
        "psychological",
        "health",
        "physical",
        "health",
        "book",
        "four",
        "ab",
        "second",
        "third",
        "fourth",
        "socrates",
        "call",
        "three",
        "proof",
        "book",
        "eight",
        "nine",
        "cc",
        "esp",
        "bc",
        "ca",
        "ba",
        "fifth",
        "image",
        "human",
        "soul",
        "consisting",
        "little",
        "human",
        "reason",
        "lion",
        "spirit",
        "manyheaded",
        "beast",
        "appetite",
        "b",
        "ff",
        "yet",
        "first",
        "interrupted",
        "said",
        "book",
        "eight",
        "continuous",
        "first",
        "proof",
        "book",
        "eight",
        "nine",
        "c",
        "last",
        "seems",
        "offered",
        "closing",
        "exhortation",
        "whittling",
        "leaf",
        "u",
        "three",
        "argument",
        "socrates",
        "label",
        "proof",
        "c",
        "cf",
        "b",
        "first",
        "discussing",
        "psychological",
        "health",
        "disease",
        "length",
        "second",
        "third",
        "concerning",
        "pleasure",
        "already",
        "book",
        "four",
        "glaucon",
        "ready",
        "declare",
        "unjust",
        "soul",
        "ruined",
        "turmoil",
        "socrates",
        "press",
        "fuller",
        "reckoning",
        "finally",
        "resume",
        "book",
        "eight",
        "left",
        "book",
        "four",
        "socrates",
        "offer",
        "long",
        "account",
        "four",
        "defective",
        "psychological",
        "type",
        "list",
        "exhaustive",
        "cd",
        "cf",
        "c",
        "capture",
        "four",
        "imperfect",
        "kind",
        "pure",
        "psychological",
        "constitution",
        "pure",
        "rule",
        "spirited",
        "attitude",
        "pure",
        "rule",
        "necessary",
        "appetitive",
        "attitude",
        "pure",
        "rule",
        "unnecessary",
        "regulable",
        "appetitive",
        "attitude",
        "pure",
        "rule",
        "lawless",
        "appetitive",
        "attitude",
        "end",
        "long",
        "discussion",
        "socrates",
        "ask",
        "sort",
        "person",
        "life",
        "best",
        "life",
        "aristocratic",
        "soul",
        "book",
        "six",
        "seven",
        "one",
        "soul",
        "book",
        "eight",
        "nine",
        "might",
        "expect",
        "socrates",
        "glaucon",
        "argue",
        "carefully",
        "elimination",
        "showing",
        "life",
        "better",
        "every",
        "sort",
        "unjust",
        "life",
        "instead",
        "quickly",
        "contrast",
        "tyrannical",
        "soul",
        "aristocratic",
        "soul",
        "unjust",
        "might",
        "seem",
        "pick",
        "glaucon",
        "original",
        "demand",
        "book",
        "two",
        "see",
        "perfectly",
        "justwho",
        "unfortunate",
        "still",
        "justis",
        "better",
        "perfectly",
        "unjustwho",
        "unjust",
        "still",
        "esteemed",
        "even",
        "since",
        "socrates",
        "far",
        "portraying",
        "best",
        "soul",
        "least",
        "favorable",
        "circumstance",
        "worst",
        "soul",
        "favorable",
        "circumstance",
        "nevertheless",
        "socrates",
        "limited",
        "comparison",
        "book",
        "nine",
        "might",
        "provide",
        "resource",
        "explain",
        "better",
        "unluckiest",
        "philosopher",
        "luckiest",
        "tyrant",
        "better",
        "unjust",
        "way",
        "whatsoever",
        "might",
        "provide",
        "general",
        "lesson",
        "apply",
        "comparison",
        "socrates",
        "glaucon",
        "characterize",
        "person",
        "ruled",
        "lawless",
        "attitude",
        "enslaved",
        "least",
        "able",
        "want",
        "full",
        "disorder",
        "regret",
        "poor",
        "unsatisfiable",
        "fearful",
        "ca",
        "characterization",
        "fit",
        "logical",
        "order",
        "tyrant",
        "enslaved",
        "ruled",
        "utterly",
        "unlimited",
        "appetite",
        "prompt",
        "appetitive",
        "desire",
        "whenever",
        "chance",
        "object",
        "appetite",
        "present",
        "consideration",
        "given",
        "condition",
        "experience",
        "appetitive",
        "desire",
        "satisfy",
        "either",
        "difficult",
        "satisfy",
        "satisfying",
        "would",
        "prevent",
        "satisfying",
        "desire",
        "experience",
        "unsatisfied",
        "desire",
        "must",
        "make",
        "wish",
        "could",
        "satisfy",
        "feel",
        "poor",
        "unsatisfiable",
        "worse",
        "unsatisfied",
        "appetitive",
        "desire",
        "continue",
        "press",
        "satisfaction",
        "time",
        "make",
        "aware",
        "past",
        "inability",
        "want",
        "prompt",
        "regret",
        "likely",
        "future",
        "inability",
        "want",
        "make",
        "fearful",
        "result",
        "miserable",
        "existence",
        "misery",
        "rooted",
        "unlimited",
        "attitude",
        "demand",
        "satisfaction",
        "person",
        "achieve",
        "nutshell",
        "tyrant",
        "lack",
        "capacity",
        "want",
        "philosopher",
        "contrast",
        "able",
        "want",
        "want",
        "best",
        "long",
        "one",
        "agency",
        "would",
        "seem",
        "doable",
        "best",
        "circumstance",
        "make",
        "certain",
        "apparent",
        "best",
        "undoable",
        "would",
        "longer",
        "appear",
        "best",
        "say",
        "philosopher",
        "guaranteed",
        "able",
        "want",
        "first",
        "socrates",
        "quite",
        "clear",
        "appetitive",
        "attitude",
        "necessary",
        "one",
        "well",
        "imagine",
        "circumstance",
        "extreme",
        "deprivation",
        "necessary",
        "appetitive",
        "attitude",
        "food",
        "drink",
        "say",
        "unsatisfiable",
        "second",
        "capacity",
        "best",
        "might",
        "require",
        "engaging",
        "certain",
        "kind",
        "activity",
        "order",
        "maintain",
        "even",
        "philosopher",
        "satisfy",
        "necessary",
        "appetitive",
        "attitude",
        "might",
        "prevented",
        "unfortunate",
        "circumstance",
        "sort",
        "regular",
        "thought",
        "action",
        "required",
        "hold",
        "onto",
        "capacity",
        "best",
        "thus",
        "even",
        "philosophical",
        "soul",
        "able",
        "want",
        "closest",
        "thing",
        "sure",
        "bet",
        "capacity",
        "retain",
        "ability",
        "every",
        "circumstance",
        "comparison",
        "tyrannical",
        "soul",
        "philosophical",
        "soul",
        "work",
        "socrates",
        "need",
        "capacity",
        "one",
        "want",
        "correlate",
        "closely",
        "human",
        "success",
        "happiness",
        "lesson",
        "tyrant",
        "incapacity",
        "generalize",
        "defective",
        "psychological",
        "constitution",
        "socrates",
        "need",
        "happiness",
        "capacity",
        "one",
        "want",
        "absence",
        "regret",
        "frustration",
        "fear",
        "could",
        "continue",
        "think",
        "thought",
        "book",
        "one",
        "happiness",
        "virtuous",
        "activity",
        "a",
        "argument",
        "work",
        "happiness",
        "whatever",
        "must",
        "require",
        "capacity",
        "one",
        "want",
        "inconsistent",
        "regret",
        "frustration",
        "fear",
        "argument",
        "apply",
        "unjust",
        "people",
        "psychologically",
        "tyrannical",
        "anyone",
        "philosopher",
        "either",
        "divided",
        "soul",
        "ruled",
        "spirit",
        "appetite",
        "division",
        "soul",
        "plainly",
        "undercut",
        "ability",
        "one",
        "want",
        "one",
        "seek",
        "honor",
        "money",
        "one",
        "want",
        "although",
        "ability",
        "honorable",
        "make",
        "money",
        "flexible",
        "ability",
        "best",
        "surely",
        "possible",
        "favorable",
        "circumstance",
        "someone",
        "consistently",
        "able",
        "honorable",
        "moneymaking",
        "work",
        "agent",
        "conflicted",
        "honorable",
        "make",
        "money",
        "need",
        "carefully",
        "educated",
        "need",
        "limited",
        "option",
        "enjoy",
        "adequate",
        "education",
        "orderly",
        "social",
        "environment",
        "reason",
        "suppose",
        "could",
        "escape",
        "racked",
        "regret",
        "frustration",
        "fear",
        "explains",
        "member",
        "lower",
        "class",
        "socrates",
        "ideal",
        "citywho",
        "probably",
        "best",
        "identified",
        "timocrats",
        "oligarch",
        "book",
        "eight",
        "wilberding",
        "jeon",
        "can",
        "kind",
        "capacity",
        "want",
        "even",
        "though",
        "slavishly",
        "dependent",
        "upon",
        "ruler",
        "work",
        "cf",
        "cd",
        "characterization",
        "appropriately",
        "ruled",
        "nonphilosophers",
        "slavish",
        "might",
        "suggest",
        "special",
        "concern",
        "heteronomous",
        "character",
        "capacity",
        "want",
        "special",
        "valorization",
        "philosopher",
        "autonomous",
        "capacity",
        "hesitant",
        "applying",
        "frequently",
        "confused",
        "possibly",
        "anachronistic",
        "concept",
        "republic",
        "plato",
        "would",
        "probably",
        "prefer",
        "think",
        "term",
        "selfsufficiency",
        "b",
        "purpose",
        "socrates",
        "argument",
        "enough",
        "contrast",
        "way",
        "producer",
        "capacity",
        "deeply",
        "dependent",
        "upon",
        "social",
        "surroundings",
        "way",
        "philosopher",
        "capacity",
        "relatively",
        "free",
        "dependence",
        "cultivated",
        "contrast",
        "must",
        "undersold",
        "plausible",
        "think",
        "selfsufficiency",
        "philosopher",
        "make",
        "better",
        "appropriately",
        "ruled",
        "nonphilosophers",
        "enjoy",
        "capacity",
        "want",
        "long",
        "circumstance",
        "appropriately",
        "ruled",
        "make",
        "success",
        "far",
        "le",
        "stable",
        "philosopher",
        "enjoy",
        "thing",
        "world",
        "tend",
        "change",
        "philosopher",
        "much",
        "better",
        "position",
        "flourish",
        "change",
        "u",
        "living",
        "imperfect",
        "city",
        "looking",
        "republic",
        "model",
        "live",
        "cf",
        "b",
        "need",
        "emulate",
        "philosopher",
        "order",
        "pursue",
        "stable",
        "reliable",
        "success",
        "happiness",
        "nevertheless",
        "far",
        "argument",
        "show",
        "success",
        "happiness",
        "appropriately",
        "ruled",
        "nonphilosophers",
        "real",
        "philosopher",
        "judged",
        "exclusively",
        "capacity",
        "one",
        "want",
        "presence",
        "absence",
        "regret",
        "frustration",
        "fear",
        "philosopher",
        "better",
        "fortunate",
        "nonphilosophers",
        "nonphilosophers",
        "fortunate",
        "even",
        "recognize",
        "risk",
        "good",
        "fortune",
        "otherwise",
        "would",
        "fear",
        "change",
        "luck",
        "philosopher",
        "success",
        "secure",
        "nonphilosopher",
        "also",
        "better",
        "success",
        "nonphilosopher",
        "socrates",
        "first",
        "argument",
        "show",
        "see",
        "also",
        "kenny",
        "kraut",
        "socrates",
        "need",
        "argument",
        "case",
        "want",
        "convince",
        "u",
        "imperfect",
        "circumstance",
        "like",
        "glaucon",
        "adeimantus",
        "pursue",
        "philosophical",
        "life",
        "perfect",
        "justice",
        "first",
        "argument",
        "try",
        "show",
        "anyone",
        "want",
        "satisfy",
        "desire",
        "perfectly",
        "cultivate",
        "certain",
        "kind",
        "desire",
        "rather",
        "others",
        "reject",
        "argument",
        "either",
        "two",
        "way",
        "taking",
        "issue",
        "analysis",
        "desire",
        "regularly",
        "satisfiable",
        "explaining",
        "person",
        "want",
        "satisfy",
        "desire",
        "perfectly",
        "first",
        "response",
        "call",
        "quasiempirical",
        "investigation",
        "difficult",
        "sort",
        "second",
        "seems",
        "easy",
        "argue",
        "good",
        "human",
        "life",
        "must",
        "subject",
        "regret",
        "loss",
        "course",
        "enough",
        "say",
        "human",
        "condition",
        "fact",
        "marked",
        "regret",
        "loss",
        "inconsistency",
        "maintaining",
        "one",
        "aim",
        "secure",
        "life",
        "order",
        "live",
        "best",
        "possible",
        "human",
        "life",
        "also",
        "realizing",
        "best",
        "possible",
        "human",
        "life",
        "marked",
        "insecurity",
        "fact",
        "one",
        "might",
        "even",
        "think",
        "proper",
        "experience",
        "fragility",
        "requires",
        "attachment",
        "security",
        "one",
        "end",
        "instead",
        "reject",
        "socrates",
        "argument",
        "must",
        "show",
        "wrong",
        "aim",
        "life",
        "free",
        "regret",
        "loss",
        "must",
        "show",
        "pursuit",
        "security",
        "lead",
        "one",
        "reject",
        "certain",
        "desire",
        "one",
        "reject",
        "way",
        "move",
        "beyond",
        "discussion",
        "desire",
        "satisfiable",
        "tackle",
        "question",
        "value",
        "desired",
        "value",
        "desiring",
        "address",
        "possible",
        "objection",
        "socrates",
        "need",
        "give",
        "u",
        "different",
        "argument"
    ]
}