{
    "main_text": "Ethics, Part Two: Why a Person should be Just || Pleasure\n3.2 Pleasure\n\n\nThis explains why Socrates does not stop after offering his first\n“proof.” Many readers are puzzled about why he offers two\nmore. After all, the geometer does not need to offer multiple proofs\nof his theorem. What might seem worse, the additional proofs concern\npleasure, and thereby introduce—seemingly at the eleventh\nhour—a heap of new considerations for the ethics of the\nRepublic. But as the considerations at the end of the \nprevious section show, these pleasure proofs are crucial.\n\n\nPlato merely dramatizes these considerations. Socrates has offered not\nmerely to demonstrate that it is always better to be just than unjust\nbut to persuade Glaucon and Adeimantus (but especially Glaucon: see,\ne.g., 327a, 357a–b, 368c) of this claim. Insofar as Glaucon shows\nsympathy for spirited attitudes (372d with the discussion\nin\n section 4.1\n below, and cf. 548d), his attachment\nto these attitudes could survive the realization that they are far\nfrom perfectly satisfiable. He may say, “I can see the point of\nperfectly satisfiable attitudes, but those attitudes (and their objects)\nare not as good as my less-than-perfectly\nsatisfiable attitudes (and their objects).” Glaucon needs to be shown that the\nrewards of carrying insecure attitudes do not make up for the\ninsecurity.\n\n\nThe additional proofs serve a second purpose, as well. At the end of \nBook Five, Socrates says that faculties (at least psychological \nfaculties) are distinguished by their results (their rate of success)\nand by their objects (what they concern) (477c–d). So far, he has \ndiscussed only the success-rates of various kinds of psychological \nattitudes. He needs to discuss the objects of various kinds of \npsychological attitudes in order to complete his account. If we did \nnot have the discussion of the second proof, in particular, we would \nhave an incomplete picture of the Republic’s moral psychology.\n\n\nThe two arguments that Socrates proceeds to make are frustratingly \ndifficult (see Gosling and Taylor 1982, Nussbaum 1986, Russell 2005, Moss 2006, Warren 2014, Shaw 2016). They are very quick, and though they concern “pleasures,” \nSocrates never says exactly what pleasure is. (At one point \n(585d11), the now-standard translation of the Republic by \nGrube and Reeve suggests that “being filled with what is appropriate \nto our nature is pleasure,” but it is better to read less into the \nGreek by rendering the clause “being filled with what is appropriate \nto our nature is pleasant.”) The first argument suggests that \npleasures might be activities of a certain kind, but the remarkably \nabstract second argument does not provide any special support to that\nsuggestion. Even if a convincing account of how Plato wants us to \nconceive of pleasure in the Republic is wanting, however, we\ncan get a grasp on the form of the two “pleasure proofs.”\n\n\nThe first is an appeal to\nauthority, in four easy steps. First, Socrates suggests that just as\neach part of the soul has its own characteristic desires and\npleasures, so persons have characteristic desires and pleasures\ndepending upon which part of their soul rules them. The characteristic\npleasure of philosophers is learning. The characteristic pleasure of\nhonor-lovers is being honored. The characteristic pleasure of\nmoney-lovers is making money.  Next, Socrates suggests that each of\nthese three different kinds of person would say that her own\npleasure is best. So, third, to decide which pleasure really is best,\nwe need to determine which sort of person’s judgment is best, and\nSocrates suggests that whoever has the most reason, experience, and\nargument is the best judge. Finally, Socrates argues that the\nphilosopher is better than the honor-lover and the money-lover in\nreason, experience, and argument.\n\n\nIt is sometimes thought that the philosopher cannot be better off in \nexperience, for the philosopher has never lived as an adult who is \nfully committed to the pleasures of the money-lover. But this point \ndoes not disable Socrates’ argument. The philosopher does not have \nexactly the experience that the money-lover has, but the \nphilosopher has far more experience of the money-lover’s \npleasures than the money-lover has of the philosopher’s pleasures. \nThe comparative judgment is enough to secure Socrates’ conclusion: \nbecause the philosopher is a better judge than the others, \nthe philosopher’s judgment has a better claim on the truth.\n\n\nBut this first proof does not explain why the distinction in \npleasures is made; the appeal to the philosopher’s authority as a \njudge gives no account of the philosopher’s reasons for her judgment.\nMoreover, the first pleasure proof does not say that the \nphilosopher’s pleasures are vastly superior to those of the \nmoney-lover and the honor-lover. So Glaucon—or anyone else \ntempted to avoid the mathematical studies of Book Seven—might \nthink that the superiority of the philosopher’s psychological justice\nis slight, and given the disrepute heaped on the philosophers (487a \nff.), Glaucon or anyone else might decide that the \nless-than-perfectly just life is better overall. Socrates needs to \nshow that the philosopher’s activities are vastly better than the \nnon-philosopher’s activities in order to answer the challenge \noriginally put forth in Book Two by Glaucon and Adeimantus. So it is \nfor very good reason that Socrates proceeds to offer a second \npleasure proof that he promises to be the “greatest and most decisive\noverthrow” for the unjust (583b6–7).\n\n\nSocrates’ final argument moves in three broad steps. The first \nestablishes that pleasure and pain are not exhaustive contradictories\nbut opposites, separated by a calm middle that is neither pain nor \npleasure. This may sometimes seem false. The removal of pain can seem\nto be pleasant, and the removal of a pleasure can seem to be painful.\nBut Socrates argues that these appearances are deceptive. He \ndistinguishes between pleasures that fill a lack and thereby replace \na pain (these are not genuine pleasures) and those that do not fill a\nlack and thereby replace a pain (these are genuine pleasures). The \nsecond step in the argument is to establish that most bodily \npleasures—and the most intense of these—fill a painful \nlack and are not genuine pleasures. Finally, Socrates argues that the\nphilosopher’s pleasures do not fill a painful lack and are genuine \npleasures. Contra the epicure’s assumption, the philosopher’s \npleasures are more substantial than pleasures of the flesh.\n\n\nThe pleasure proofs tempt some readers to suppose that Socrates must \nhave a hedonistic conception of happiness. After all, he claims to \nhave shown that the just person is happier than the unjust (580a–c), \nand he says that his pleasure arguments are proofs of the same \nclaim (580c–d, 583b). But these arguments can work just as the first \nproof works: Socrates can suppose that happiness, whatever it is, \nis marked by pleasure (just as it is marked by the absence of regret,\nfrustration, and fear). This is not to say that one should take \npleasure to be one’s goal any more than it is to say that one should \npursue fearlessness as one’s goal. Pleasure is a misleading guide \n(see 581c–d and 603c), and there are many false, self-undermining \nroutes to pleasure (and fearlessness).\n\n\nSocrates’ indirect approach concerning happiness (cf. \n section 1.2\n above) makes sense if he thinks that justice (being just, acting\njustly) is happiness (being happy, living well) (354a). Anyone\ninclined to doubt that one should always be just would be inclined to\ndoubt that justice is happiness. So Socrates has to appeal to\ncharacteristics of happiness that do not, in his view, capture what\nhappiness is, in the hope that the skeptics might agree that happiness\ncorrelates with the absence of regret, frustration, and fear and the\npresence of pleasure. That would be enough for the proofs.\n\n\nEven at the end of his three “proofs,” Socrates knows that he cannot \nyet have fully persuaded Glaucon and Adeimantus that it is always \nbetter to be just than unjust. Their beliefs and desires have been \nstained too deeply by a world filled with mistakes, especially by the\nmisleading tales of the poets. To turn Glaucon and Adeimantus more \nfully toward virtue, Socrates needs to undercut their respect for the\npoets, and he needs to begin to stain their souls anew. But Socrates’\ntheoretical arguments on behalf of justice are finished. The work \nthat remains to be done—especially the sketch of a soul at the \nend of Book Nine and the myth of an afterlife in Book \nTen—should deepen without transforming our appreciation for the\npsychological ethics of the Republic.\n",
    "section_title": "3.2 Pleasure",
    "entry_title": "Plato’s Ethics and Politics in The Republic",
    "hierarchy_title": "Plato’s Ethics and Politics in The Republic || Ethics, Part Two: Why a Person should be Just || Pleasure",
    "tokenized_text": [
        "ethic",
        "part",
        "two",
        "person",
        "pleasure",
        "pleasure",
        "explains",
        "socrates",
        "stop",
        "offering",
        "first",
        "proof",
        "many",
        "reader",
        "puzzled",
        "offer",
        "two",
        "geometer",
        "need",
        "offer",
        "multiple",
        "proof",
        "theorem",
        "might",
        "seem",
        "worse",
        "additional",
        "proof",
        "concern",
        "pleasure",
        "thereby",
        "introduceseemingly",
        "eleventh",
        "houra",
        "heap",
        "new",
        "consideration",
        "ethic",
        "republic",
        "consideration",
        "end",
        "previous",
        "section",
        "show",
        "pleasure",
        "proof",
        "crucial",
        "plato",
        "merely",
        "dramatizes",
        "consideration",
        "socrates",
        "offered",
        "merely",
        "demonstrate",
        "always",
        "better",
        "unjust",
        "persuade",
        "glaucon",
        "adeimantus",
        "especially",
        "glaucon",
        "see",
        "eg",
        "a",
        "ab",
        "c",
        "claim",
        "insofar",
        "glaucon",
        "show",
        "sympathy",
        "spirited",
        "attitude",
        "d",
        "discussion",
        "section",
        "cf",
        "d",
        "attachment",
        "attitude",
        "could",
        "survive",
        "realization",
        "far",
        "perfectly",
        "satisfiable",
        "may",
        "say",
        "see",
        "point",
        "perfectly",
        "satisfiable",
        "attitude",
        "attitude",
        "object",
        "good",
        "lessthanperfectly",
        "satisfiable",
        "attitude",
        "object",
        "glaucon",
        "need",
        "shown",
        "reward",
        "carrying",
        "insecure",
        "attitude",
        "make",
        "insecurity",
        "additional",
        "proof",
        "serve",
        "second",
        "purpose",
        "well",
        "end",
        "book",
        "five",
        "socrates",
        "say",
        "faculty",
        "least",
        "psychological",
        "faculty",
        "distinguished",
        "result",
        "rate",
        "success",
        "object",
        "concern",
        "cd",
        "far",
        "discussed",
        "successrates",
        "various",
        "kind",
        "psychological",
        "attitude",
        "need",
        "discus",
        "object",
        "various",
        "kind",
        "psychological",
        "attitude",
        "order",
        "complete",
        "account",
        "discussion",
        "second",
        "proof",
        "particular",
        "would",
        "incomplete",
        "picture",
        "republic",
        "moral",
        "psychology",
        "two",
        "argument",
        "socrates",
        "proceeds",
        "make",
        "frustratingly",
        "difficult",
        "see",
        "gosling",
        "taylor",
        "nussbaum",
        "russell",
        "moss",
        "warren",
        "shaw",
        "quick",
        "though",
        "concern",
        "pleasure",
        "socrates",
        "never",
        "say",
        "exactly",
        "pleasure",
        "one",
        "point",
        "d",
        "nowstandard",
        "translation",
        "republic",
        "grube",
        "reeve",
        "suggests",
        "filled",
        "appropriate",
        "nature",
        "pleasure",
        "better",
        "read",
        "le",
        "greek",
        "rendering",
        "clause",
        "filled",
        "appropriate",
        "nature",
        "pleasant",
        "first",
        "argument",
        "suggests",
        "pleasure",
        "might",
        "activity",
        "certain",
        "kind",
        "remarkably",
        "abstract",
        "second",
        "argument",
        "provide",
        "special",
        "support",
        "suggestion",
        "even",
        "convincing",
        "account",
        "plato",
        "want",
        "u",
        "conceive",
        "pleasure",
        "republic",
        "wanting",
        "however",
        "get",
        "grasp",
        "form",
        "two",
        "pleasure",
        "proofs",
        "first",
        "appeal",
        "authority",
        "four",
        "easy",
        "step",
        "first",
        "socrates",
        "suggests",
        "part",
        "soul",
        "characteristic",
        "desire",
        "pleasure",
        "person",
        "characteristic",
        "desire",
        "pleasure",
        "depending",
        "upon",
        "part",
        "soul",
        "rule",
        "characteristic",
        "pleasure",
        "philosopher",
        "learning",
        "characteristic",
        "pleasure",
        "honorlovers",
        "honored",
        "characteristic",
        "pleasure",
        "moneylovers",
        "making",
        "money",
        "next",
        "socrates",
        "suggests",
        "three",
        "different",
        "kind",
        "person",
        "would",
        "say",
        "pleasure",
        "best",
        "third",
        "decide",
        "pleasure",
        "really",
        "best",
        "need",
        "determine",
        "sort",
        "person",
        "judgment",
        "best",
        "socrates",
        "suggests",
        "whoever",
        "reason",
        "experience",
        "argument",
        "best",
        "judge",
        "finally",
        "socrates",
        "argues",
        "philosopher",
        "better",
        "honorlover",
        "moneylover",
        "reason",
        "experience",
        "argument",
        "sometimes",
        "thought",
        "philosopher",
        "better",
        "experience",
        "philosopher",
        "never",
        "lived",
        "adult",
        "fully",
        "committed",
        "pleasure",
        "moneylover",
        "point",
        "disable",
        "socrates",
        "argument",
        "philosopher",
        "exactly",
        "experience",
        "moneylover",
        "philosopher",
        "far",
        "experience",
        "moneylover",
        "pleasure",
        "moneylover",
        "philosopher",
        "pleasure",
        "comparative",
        "judgment",
        "enough",
        "secure",
        "socrates",
        "conclusion",
        "philosopher",
        "better",
        "judge",
        "others",
        "philosopher",
        "judgment",
        "better",
        "claim",
        "truth",
        "first",
        "proof",
        "explain",
        "distinction",
        "pleasure",
        "made",
        "appeal",
        "philosopher",
        "authority",
        "judge",
        "give",
        "account",
        "philosopher",
        "reason",
        "judgment",
        "moreover",
        "first",
        "pleasure",
        "proof",
        "say",
        "philosopher",
        "pleasure",
        "vastly",
        "superior",
        "moneylover",
        "honorlover",
        "glauconor",
        "anyone",
        "else",
        "tempted",
        "avoid",
        "mathematical",
        "study",
        "book",
        "sevenmight",
        "think",
        "superiority",
        "philosopher",
        "psychological",
        "justice",
        "slight",
        "given",
        "disrepute",
        "heaped",
        "philosopher",
        "a",
        "ff",
        "glaucon",
        "anyone",
        "else",
        "might",
        "decide",
        "lessthanperfectly",
        "life",
        "better",
        "overall",
        "socrates",
        "need",
        "show",
        "philosopher",
        "activity",
        "vastly",
        "better",
        "nonphilosopher",
        "activity",
        "order",
        "answer",
        "challenge",
        "originally",
        "put",
        "forth",
        "book",
        "two",
        "glaucon",
        "adeimantus",
        "good",
        "reason",
        "socrates",
        "proceeds",
        "offer",
        "second",
        "pleasure",
        "proof",
        "promise",
        "greatest",
        "decisive",
        "overthrow",
        "unjust",
        "b",
        "socrates",
        "final",
        "argument",
        "move",
        "three",
        "broad",
        "step",
        "first",
        "establishes",
        "pleasure",
        "pain",
        "exhaustive",
        "contradictory",
        "opposite",
        "separated",
        "calm",
        "middle",
        "neither",
        "pain",
        "pleasure",
        "may",
        "sometimes",
        "seem",
        "false",
        "removal",
        "pain",
        "seem",
        "pleasant",
        "removal",
        "pleasure",
        "seem",
        "painful",
        "socrates",
        "argues",
        "appearance",
        "deceptive",
        "distinguishes",
        "pleasure",
        "fill",
        "lack",
        "thereby",
        "replace",
        "pain",
        "genuine",
        "pleasure",
        "fill",
        "lack",
        "thereby",
        "replace",
        "pain",
        "genuine",
        "pleasure",
        "second",
        "step",
        "argument",
        "establish",
        "bodily",
        "pleasuresand",
        "intense",
        "thesefill",
        "painful",
        "lack",
        "genuine",
        "pleasure",
        "finally",
        "socrates",
        "argues",
        "philosopher",
        "pleasure",
        "fill",
        "painful",
        "lack",
        "genuine",
        "pleasure",
        "contra",
        "epicure",
        "assumption",
        "philosopher",
        "pleasure",
        "substantial",
        "pleasure",
        "flesh",
        "pleasure",
        "proof",
        "tempt",
        "reader",
        "suppose",
        "socrates",
        "must",
        "hedonistic",
        "conception",
        "happiness",
        "claim",
        "shown",
        "person",
        "happier",
        "unjust",
        "ac",
        "say",
        "pleasure",
        "argument",
        "proof",
        "claim",
        "cd",
        "b",
        "argument",
        "work",
        "first",
        "proof",
        "work",
        "socrates",
        "suppose",
        "happiness",
        "whatever",
        "marked",
        "pleasure",
        "marked",
        "absence",
        "regret",
        "frustration",
        "fear",
        "say",
        "one",
        "take",
        "pleasure",
        "one",
        "goal",
        "say",
        "one",
        "pursue",
        "fearlessness",
        "one",
        "goal",
        "pleasure",
        "misleading",
        "guide",
        "see",
        "cd",
        "c",
        "many",
        "false",
        "selfundermining",
        "route",
        "pleasure",
        "fearlessness",
        "socrates",
        "indirect",
        "approach",
        "concerning",
        "happiness",
        "cf",
        "section",
        "make",
        "sense",
        "think",
        "justice",
        "acting",
        "justly",
        "happiness",
        "happy",
        "living",
        "well",
        "a",
        "anyone",
        "inclined",
        "doubt",
        "one",
        "always",
        "would",
        "inclined",
        "doubt",
        "justice",
        "happiness",
        "socrates",
        "appeal",
        "characteristic",
        "happiness",
        "view",
        "capture",
        "happiness",
        "hope",
        "skeptic",
        "might",
        "agree",
        "happiness",
        "correlate",
        "absence",
        "regret",
        "frustration",
        "fear",
        "presence",
        "pleasure",
        "would",
        "enough",
        "proof",
        "even",
        "end",
        "three",
        "proof",
        "socrates",
        "know",
        "yet",
        "fully",
        "persuaded",
        "glaucon",
        "adeimantus",
        "always",
        "better",
        "unjust",
        "belief",
        "desire",
        "stained",
        "deeply",
        "world",
        "filled",
        "mistake",
        "especially",
        "misleading",
        "tale",
        "poet",
        "turn",
        "glaucon",
        "adeimantus",
        "fully",
        "toward",
        "virtue",
        "socrates",
        "need",
        "undercut",
        "respect",
        "poet",
        "need",
        "begin",
        "stain",
        "soul",
        "anew",
        "socrates",
        "theoretical",
        "argument",
        "behalf",
        "justice",
        "finished",
        "work",
        "remains",
        "doneespecially",
        "sketch",
        "soul",
        "end",
        "book",
        "nine",
        "myth",
        "afterlife",
        "book",
        "tenshould",
        "deepen",
        "without",
        "transforming",
        "appreciation",
        "psychological",
        "ethic",
        "republic"
    ]
}