{
    "main_text": "Problems for the Theory of Forms 130a–134e || The Whole-Part Dilemma 130e–131e\n4.2 The Whole-Part Dilemma 130e–131e\n\n\nAfter leading Socrates to worry about whether there is indeed a form\ncorresponding to every property, Parmenides derives a number of\nabsurdities from the result of combining the theory of forms with a\nparticular conception of the partaking relation, the Pie Model.\nAccording to the Pie Model, participants literally get a share of the\nforms of which they partake, in a way analogous to the way in which\nthose who partake of a pie literally get a share of the pie. The\nPie Model comes in two versions: according to the Whole Pie Model, for\nX to partake of Y is for X to get the whole\nof Y as its share of Y (i.e., for the whole\nof Y to be in X); according to the Piece-of-Pie\nModel, for X to partake of Y is for X to\nget a (proper) part of Y as its share of Y (i.e.,\nfor a (proper) part of Y to be in X). What\nParmenides goes on to argue is that the theory of forms is internally\ninconsistent on either version of the Pie Model.\n\n\nSuppose, first, that partaking conforms to the Whole Pie Model.  Now\nimagine that there are at one time three sensible F\nthings, A, B, and C, each separate from\neach of the others. According to Causality, each\nof A, B, C is F by virtue of\npartaking of the F, and hence each\nof A, B, C partakes of\nthe F. Given the Whole Pie Model, it follows that\nthe F is, as a whole and at a single time, in each\nof A, B, C. Thus, the whole of\nthe F is in A, the whole of the F is\nin B, and the whole of the F is\nin C. If A, B, and C are in\nseparate places, then Causality and the Whole Pie Model together\nrequire that one and the same form be, as a whole, in separate places\nat the same time. Parmenides concludes that, on this picture, the\nrelevant form would be “separate from itself”\n(Parmenides 131b2).\n\n\nOn some interpretations (Meinwald 1991, 13–14; Allen 1997, 130;\nRickless 2007, 57–58), Plato thinks of the claim that a form is\nseparate from itself as an absurdity in itself. On other\ninterpretations (Teloh 1981, 155; Miller 1986, 48; Sayre 1996, 76),\nPlato does not treat this result as absurd in itself. Absurdity\nonly arises when this result is combined with the further thought that\nnothing that is separate from itself could be a single thing. (In\nthis case, the same form would have to be three things, rather than one\nthing.) For the claim that the relevant form is not one\ncontradicts Oneness, the claim that every form is one.\n\n\nSocrates tries to avoid the relevant absurdity, however it is\nunderstood, by supposing that a form is like a day, in the following\nsense: just as a day can be in many separate places at the same time\nwithout being separate from itself, so a form can be in many separate\nplaces at the same time without being separate from itself.\nParmenides does not think much of Socrates’ suggestion. He\nimmediately counters that Socrates’ day is like a sail: a day can\nbe in many separate places at the same time only inasmuch as different\nparts of it are over the separate places, just as a sail can cover many\nseparate people only inasmuch as each person is covered by a different\npart of the sail. Parmenides’ point, then, is that the only\nway to make sense of Socrates’ day analogy is to reduce it to the\nPiece-of-Pie Model, the very model against which Parmenides goes on to\nargue.\n\n\nA number of scholars have balked at Parmenides’ assimilation of\nthe day analogy to the sail analogy (Cherniss 1932, 135; Peck 1953,\n132; Crombie 1963, 330–331; Sprague 1967, 96; Miller 1986, 49–50; Sayre\n1996, 76). They have assumed that, whether a day is thought of as\na time-interval or as the sun’s rays (the light of day), it is in\nfact possible for one and the same day to be in separate places at the\nsame time. However, it does not in fact make sense to suppose\nthat a time-interval is in separate places at the same time\n(Rickless 2007, 58). And it is not in fact true that the same\npacket of rays shines on the separate places bathed by the light of\nday; rather, different packets of rays shine on different places\n(Panagiotou 1987, 18). Moreover, it makes little sense to suppose\nthat Plato would introduce a way out of the dilemma he himself has\nconstructed without explicitly alerting his readers to that fact.\nTo suppose otherwise would be to defend a particularly esoteric reading\nof Plato’s intentions.\n\n\nHaving assimilated Socrates’ day analogy to the Piece-of-Pie Model,\nParmenides turns to a criticism of this second version of the Pie\nModel. Suppose, then, the same three sensible F\nthings—A, B, and C—in separate\nplaces at the same time. According to Causality, A,\nB, and C are F by virtue of partaking of\nthe F, and hence A, B, and C\npartake of the F. Given the Piece-of-Pie Model, there is a\npart of the F in each of A, B, and\nC. If the same absurdity generated from the Whole Pie Model\nis to be avoided, we must suppose that the part of the F that\nis in A is numerically distinct from the part of the\nF that is in B and from the part of the F\nthat is in C, and also that the part of the F that\nis in B must be numerically distinct from the part of the\nF that is in C. (Otherwise we would have the same\npart of the F existing, as a whole, in separate places at the\nsame time; and hence we would have something that is separate from\nitself.) Thus the F must have numerically distinct parts, and\nmust therefore be divided (or, at least, divisible). Parmenides\nconcludes from this that the F cannot be one, a conclusion\nthat clearly contradicts Oneness.\n\n\nAlthough many commentators take it for granted that Parmenides’\nconclusion follows from the principle that divided (or divisible)\nthings automatically lose their unity, this supposition makes little\nsense in the wake of Socrates’ speech. There Socrates\ninsisted that he himself is one (in being one among many) even though\nhe has many parts (front and back, upper and lower, and so on).\nSo Socrates does not suppose that it is true in general that a\nthing with parts cannot be one. The hypothesis that makes most\nsense of Socrates’ admission at the end of Parmenides’\ncriticism of the Piece-of-Pie Model that the F cannot be one is that\nSocrates is antecedently committed to Purity-F. For anything that\nhas many parts is ipso facto many (just as Socrates’\nhaving many parts is sufficient for his being many), and yet, by\nPurity-F, no form can have contrary properties. Given that the\nproperty of being one and the property of being many are contraries, it\nfollows from Purity-F and the claim that the F is many that the F\ncannot be one (Rickless 2007, 59–60).\n\n\nThe upshot of the Whole-Part Dilemma is that absurdity or\ninconsistency follows from the theory of forms on either of the two\npossible versions of the Pie Model conception of\npartaking. If X’s partaking of Y amounts to the\nwhole of Y being in X (the Whole Pie model), then\nCausality conjoined with the existence of sensible things in separate\nplaces at the same time entails the absurd conclusion that forms are\nseparate from themselves; but if X’s partaking of Y\namounts to a part of Y being in X (the Piece-of-Pie\nModel), then Causality and Purity-F (along with the claim that having\nmany parts is sufficient for being many and the claim that being one\nand being many are contrary properties) are inconsistent with\nOneness.\n\n\nAt the conclusion of the Whole-Part Dilemma, Parmenides extracts four\nmore absurdities from the result of combining Causality with the\nPiece-of-Pie model:\n\nBy Causality, every F thing (other than the F)\nis F by partaking of the F. But, by the Piece-of-Pie\nModel, for X to partake of Y is for X to\nget a part of Y. Thus, every F thing (other than the\nF) is F by getting a part of the F. Now\nlet F be the property of being large. In that case, every\nlarge thing (other than the large) is large by getting a part of the\nlarge. But, Parmenides assumes, if X is a part of Y,\nthen X is smaller than Y (and Y is larger\nthan X), and hence X is (in some way) small. So\nevery large thing (other than the large) is large by getting something\nsmall. But this is absurd: as Socrates himself emphasizes\nat Phaedo 101b, it would be monstrous to say that something\nis made larger by something small. This is an instance of a general\nclaim we might call “No Causation by Contraries”:\n\n\n(No Causation by Contraries) For any property F, nothing that\nis F could make something possess a property that is contrary\nto the property of being F.\n\nThe result of combining Causality with the Piece-of-Pie Model\nentails that equal things (other than the equal) are equal by getting a\npart of the equal. Given that any part of X must be smaller than\nX (see above), it follows that equal things (other than the\nequal) are equal by getting something that is smaller than the\nequal. But, Parmenides assumes, if X is smaller\nthan Y, then X is unequal to Y, and\nhence X is (in some way) unequal. So every equal thing (other\nthan the equal) is equal by getting something unequal. But, again by\nNo Causation by Contraries, this result is absurd: nothing that is\nunequal could make something be equal.\nThe result of combining Causality with the Piece-of-Pie Model\nentails that small things (other than the small) are small by getting\na part of the small. This result entails that if there are any small\nthings (as indeed there are), then the small must have parts. But\nif X is a part of Y, then Y is larger\nthan X (see above), and hence Y is (in some way)\nlarge. Consequently, the small must be large. But, by\nSelf-Predication, the small is small. So the small is both large and\nsmall. But this result contradicts Purity-F, according to which the\nsmall cannot have contrary properties, and hence cannot be both large\nand small.\nAs before, the result of combining Causality with the\nPiece-of-Pie Model entails that small things (other than the small)\nare small by getting a part of the small. But, Parmenides assumes,\nfor X to get Y is just for Y to be added\nto X. It follows that small things (other than the small) are\nsmall by having a part of the small added to them. But this is absurd:\nit is impossible to make something small by adding something\nto it.\n\n\n\nThese four quick arguments show that the result of combining Causality\nwith the Piece-of-Pie Model does not sit well with other aspects of\nthe theory of forms, in particular No Causation by Contraries (1 and\n2), and the conjunction of Purity-F and Self-Predication (3).\n",
    "section_title": "4.2 The Whole-Part Dilemma 130e–131e",
    "entry_title": "Plato’s Parmenides",
    "hierarchy_title": "Plato’s Parmenides || Problems for the Theory of Forms 130a–134e || The Whole-Part Dilemma 130e–131e",
    "tokenized_text": [
        "problem",
        "theory",
        "form",
        "ae",
        "wholepart",
        "dilemma",
        "ee",
        "wholepart",
        "dilemma",
        "ee",
        "leading",
        "socrates",
        "worry",
        "whether",
        "indeed",
        "form",
        "corresponding",
        "every",
        "property",
        "parmenides",
        "derives",
        "number",
        "absurdity",
        "result",
        "combining",
        "theory",
        "form",
        "particular",
        "conception",
        "partaking",
        "relation",
        "pie",
        "model",
        "according",
        "pie",
        "model",
        "participant",
        "literally",
        "get",
        "share",
        "form",
        "partake",
        "way",
        "analogous",
        "way",
        "partake",
        "pie",
        "literally",
        "get",
        "share",
        "pie",
        "pie",
        "model",
        "come",
        "two",
        "version",
        "according",
        "whole",
        "pie",
        "model",
        "x",
        "partake",
        "x",
        "get",
        "whole",
        "share",
        "ie",
        "whole",
        "x",
        "according",
        "pieceofpie",
        "model",
        "x",
        "partake",
        "x",
        "get",
        "proper",
        "part",
        "share",
        "ie",
        "proper",
        "part",
        "x",
        "parmenides",
        "go",
        "argue",
        "theory",
        "form",
        "internally",
        "inconsistent",
        "either",
        "version",
        "pie",
        "model",
        "suppose",
        "first",
        "partaking",
        "conforms",
        "whole",
        "pie",
        "model",
        "imagine",
        "one",
        "time",
        "three",
        "sensible",
        "f",
        "thing",
        "b",
        "c",
        "separate",
        "others",
        "according",
        "causality",
        "b",
        "c",
        "f",
        "virtue",
        "partaking",
        "f",
        "hence",
        "b",
        "c",
        "partakes",
        "f",
        "given",
        "whole",
        "pie",
        "model",
        "follows",
        "f",
        "whole",
        "single",
        "time",
        "b",
        "c",
        "thus",
        "whole",
        "f",
        "whole",
        "f",
        "b",
        "whole",
        "f",
        "c",
        "b",
        "c",
        "separate",
        "place",
        "causality",
        "whole",
        "pie",
        "model",
        "together",
        "require",
        "one",
        "form",
        "whole",
        "separate",
        "place",
        "time",
        "parmenides",
        "concludes",
        "picture",
        "relevant",
        "form",
        "would",
        "separate",
        "parmenides",
        "b",
        "interpretation",
        "meinwald",
        "allen",
        "rickless",
        "plato",
        "think",
        "claim",
        "form",
        "separate",
        "absurdity",
        "interpretation",
        "teloh",
        "miller",
        "sayre",
        "plato",
        "treat",
        "result",
        "absurd",
        "absurdity",
        "arises",
        "result",
        "combined",
        "thought",
        "nothing",
        "separate",
        "could",
        "single",
        "thing",
        "case",
        "form",
        "would",
        "three",
        "thing",
        "rather",
        "one",
        "thing",
        "claim",
        "relevant",
        "form",
        "one",
        "contradicts",
        "oneness",
        "claim",
        "every",
        "form",
        "one",
        "socrates",
        "try",
        "avoid",
        "relevant",
        "absurdity",
        "however",
        "understood",
        "supposing",
        "form",
        "like",
        "day",
        "following",
        "sense",
        "day",
        "many",
        "separate",
        "place",
        "time",
        "without",
        "separate",
        "form",
        "many",
        "separate",
        "place",
        "time",
        "without",
        "separate",
        "parmenides",
        "think",
        "much",
        "socrates",
        "suggestion",
        "immediately",
        "counter",
        "socrates",
        "day",
        "like",
        "sail",
        "day",
        "many",
        "separate",
        "place",
        "time",
        "inasmuch",
        "different",
        "part",
        "separate",
        "place",
        "sail",
        "cover",
        "many",
        "separate",
        "people",
        "inasmuch",
        "person",
        "covered",
        "different",
        "part",
        "sail",
        "parmenides",
        "point",
        "way",
        "make",
        "sense",
        "socrates",
        "day",
        "analogy",
        "reduce",
        "pieceofpie",
        "model",
        "model",
        "parmenides",
        "go",
        "argue",
        "number",
        "scholar",
        "balked",
        "parmenides",
        "assimilation",
        "day",
        "analogy",
        "sail",
        "analogy",
        "cherniss",
        "peck",
        "crombie",
        "sprague",
        "miller",
        "sayre",
        "assumed",
        "whether",
        "day",
        "thought",
        "timeinterval",
        "sun",
        "ray",
        "light",
        "day",
        "fact",
        "possible",
        "one",
        "day",
        "separate",
        "place",
        "time",
        "however",
        "fact",
        "make",
        "sense",
        "suppose",
        "timeinterval",
        "separate",
        "place",
        "time",
        "rickless",
        "fact",
        "true",
        "packet",
        "ray",
        "shine",
        "separate",
        "place",
        "bathed",
        "light",
        "day",
        "rather",
        "different",
        "packet",
        "ray",
        "shine",
        "different",
        "place",
        "panagiotou",
        "moreover",
        "make",
        "little",
        "sense",
        "suppose",
        "plato",
        "would",
        "introduce",
        "way",
        "dilemma",
        "constructed",
        "without",
        "explicitly",
        "alerting",
        "reader",
        "fact",
        "suppose",
        "otherwise",
        "would",
        "defend",
        "particularly",
        "esoteric",
        "reading",
        "plato",
        "intention",
        "assimilated",
        "socrates",
        "day",
        "analogy",
        "pieceofpie",
        "model",
        "parmenides",
        "turn",
        "criticism",
        "second",
        "version",
        "pie",
        "model",
        "suppose",
        "three",
        "sensible",
        "f",
        "thingsa",
        "b",
        "cin",
        "separate",
        "place",
        "time",
        "according",
        "causality",
        "b",
        "c",
        "f",
        "virtue",
        "partaking",
        "f",
        "hence",
        "b",
        "c",
        "partake",
        "f",
        "given",
        "pieceofpie",
        "model",
        "part",
        "f",
        "b",
        "c",
        "absurdity",
        "generated",
        "whole",
        "pie",
        "model",
        "avoided",
        "must",
        "suppose",
        "part",
        "f",
        "numerically",
        "distinct",
        "part",
        "f",
        "b",
        "part",
        "f",
        "c",
        "also",
        "part",
        "f",
        "b",
        "must",
        "numerically",
        "distinct",
        "part",
        "f",
        "c",
        "otherwise",
        "would",
        "part",
        "f",
        "existing",
        "whole",
        "separate",
        "place",
        "time",
        "hence",
        "would",
        "something",
        "separate",
        "thus",
        "f",
        "must",
        "numerically",
        "distinct",
        "part",
        "must",
        "therefore",
        "divided",
        "least",
        "divisible",
        "parmenides",
        "concludes",
        "f",
        "one",
        "conclusion",
        "clearly",
        "contradicts",
        "oneness",
        "although",
        "many",
        "commentator",
        "take",
        "granted",
        "parmenides",
        "conclusion",
        "follows",
        "principle",
        "divided",
        "divisible",
        "thing",
        "automatically",
        "lose",
        "unity",
        "supposition",
        "make",
        "little",
        "sense",
        "wake",
        "socrates",
        "speech",
        "socrates",
        "insisted",
        "one",
        "one",
        "among",
        "many",
        "even",
        "though",
        "many",
        "part",
        "front",
        "back",
        "upper",
        "lower",
        "socrates",
        "suppose",
        "true",
        "general",
        "thing",
        "part",
        "one",
        "hypothesis",
        "make",
        "sense",
        "socrates",
        "admission",
        "end",
        "parmenides",
        "criticism",
        "pieceofpie",
        "model",
        "f",
        "one",
        "socrates",
        "antecedently",
        "committed",
        "purityf",
        "anything",
        "many",
        "part",
        "ipso",
        "facto",
        "many",
        "socrates",
        "many",
        "part",
        "sufficient",
        "many",
        "yet",
        "purityf",
        "form",
        "contrary",
        "property",
        "given",
        "property",
        "one",
        "property",
        "many",
        "contrary",
        "follows",
        "purityf",
        "claim",
        "f",
        "many",
        "f",
        "one",
        "rickless",
        "upshot",
        "wholepart",
        "dilemma",
        "absurdity",
        "inconsistency",
        "follows",
        "theory",
        "form",
        "either",
        "two",
        "possible",
        "version",
        "pie",
        "model",
        "conception",
        "partaking",
        "x",
        "partaking",
        "amount",
        "whole",
        "x",
        "whole",
        "pie",
        "model",
        "causality",
        "conjoined",
        "existence",
        "sensible",
        "thing",
        "separate",
        "place",
        "time",
        "entail",
        "absurd",
        "conclusion",
        "form",
        "separate",
        "x",
        "partaking",
        "amount",
        "part",
        "x",
        "pieceofpie",
        "model",
        "causality",
        "purityf",
        "along",
        "claim",
        "many",
        "part",
        "sufficient",
        "many",
        "claim",
        "one",
        "many",
        "contrary",
        "property",
        "inconsistent",
        "oneness",
        "conclusion",
        "wholepart",
        "dilemma",
        "parmenides",
        "extract",
        "four",
        "absurdity",
        "result",
        "combining",
        "causality",
        "pieceofpie",
        "model",
        "causality",
        "every",
        "f",
        "thing",
        "f",
        "f",
        "partaking",
        "f",
        "pieceofpie",
        "model",
        "x",
        "partake",
        "x",
        "get",
        "part",
        "y",
        "thus",
        "every",
        "f",
        "thing",
        "f",
        "f",
        "getting",
        "part",
        "f",
        "let",
        "f",
        "property",
        "large",
        "case",
        "every",
        "large",
        "thing",
        "large",
        "large",
        "getting",
        "part",
        "large",
        "parmenides",
        "assumes",
        "x",
        "part",
        "x",
        "smaller",
        "larger",
        "x",
        "hence",
        "x",
        "way",
        "small",
        "every",
        "large",
        "thing",
        "large",
        "large",
        "getting",
        "something",
        "small",
        "absurd",
        "socrates",
        "emphasizes",
        "phaedo",
        "b",
        "would",
        "monstrous",
        "say",
        "something",
        "made",
        "larger",
        "something",
        "small",
        "instance",
        "general",
        "claim",
        "might",
        "call",
        "causation",
        "contrary",
        "causation",
        "contrary",
        "property",
        "f",
        "nothing",
        "f",
        "could",
        "make",
        "something",
        "posse",
        "property",
        "contrary",
        "property",
        "f",
        "result",
        "combining",
        "causality",
        "pieceofpie",
        "model",
        "entail",
        "equal",
        "thing",
        "equal",
        "equal",
        "getting",
        "part",
        "equal",
        "given",
        "part",
        "x",
        "must",
        "smaller",
        "x",
        "see",
        "follows",
        "equal",
        "thing",
        "equal",
        "equal",
        "getting",
        "something",
        "smaller",
        "equal",
        "parmenides",
        "assumes",
        "x",
        "smaller",
        "x",
        "unequal",
        "hence",
        "x",
        "way",
        "unequal",
        "every",
        "equal",
        "thing",
        "equal",
        "equal",
        "getting",
        "something",
        "unequal",
        "causation",
        "contrary",
        "result",
        "absurd",
        "nothing",
        "unequal",
        "could",
        "make",
        "something",
        "equal",
        "result",
        "combining",
        "causality",
        "pieceofpie",
        "model",
        "entail",
        "small",
        "thing",
        "small",
        "small",
        "getting",
        "part",
        "small",
        "result",
        "entail",
        "small",
        "thing",
        "indeed",
        "small",
        "must",
        "part",
        "x",
        "part",
        "larger",
        "x",
        "see",
        "hence",
        "way",
        "large",
        "consequently",
        "small",
        "must",
        "large",
        "selfpredication",
        "small",
        "small",
        "small",
        "large",
        "small",
        "result",
        "contradicts",
        "purityf",
        "according",
        "small",
        "contrary",
        "property",
        "hence",
        "large",
        "small",
        "result",
        "combining",
        "causality",
        "pieceofpie",
        "model",
        "entail",
        "small",
        "thing",
        "small",
        "small",
        "getting",
        "part",
        "small",
        "parmenides",
        "assumes",
        "x",
        "get",
        "added",
        "x",
        "follows",
        "small",
        "thing",
        "small",
        "small",
        "part",
        "small",
        "added",
        "absurd",
        "impossible",
        "make",
        "something",
        "small",
        "adding",
        "something",
        "four",
        "quick",
        "argument",
        "show",
        "result",
        "combining",
        "causality",
        "pieceofpie",
        "model",
        "sit",
        "well",
        "aspect",
        "theory",
        "form",
        "particular",
        "causation",
        "contrary",
        "conjunction",
        "purityf",
        "selfpredication"
    ]
}