{
    "main_text": "Divine Inspiration || Ion\n3.1 Ion\n\nPlato’s shortest dialogue, the Ion is the only one that most\nreaders would clearly situate within aesthetics. It does not address\npoetry alone. The character Ion is a performer and interpreter of\nHomer’s poems, not a poet. Meanwhile, most of what are classed as arts\ntoday—painting, sculpture, music—appear as activities for\nwhich the problems of irrationality and knowledge signally\nfail to arise (532e–533c; for painting as\ntechnê cf. Gorgias 448c, Protagoras\n312d). Nevertheless the Ion belongs in aesthetics by virtue\nof its focus on artistic inspiration, and the question it provokes of\nwhat inspiration implies about poetry’s merits.\n\nAs a rhapsode Ion travels among Greek cities reciting and explicating\nepisodes from Homer. Between the dramatic recitation and the\ninterpretation, these performances offered much latitude for displays\nof talent, and Ion’s talent has won him first prize at a contest in\nEpidaurus. (For some discussion of the rhapsode’s work see Gonzalez\n2011, González 2013.)\n\nHis conversation with Socrates falls into three parts, covering\nidiosyncrasy (530a–533c), inspiration\n(533c–536d), and ignorance (536d–542b). Both the\nfirst and the third sections support the claims made in the second,\nwhich should be seen as the conclusion to the dialogue, supported in\ndifferent ways by the discussions that come before and after it. The\nidiosyncrasy in Ion’s attachment to Homer shows that Homer, and Ion\nbecause of him, function thanks to a divine visitation. But because\nIon resists accepting a claim according to which he is deranged in his\nperformances, Socrates presents a fall-back argument. Ion is\nunqualified to assess any of the factual claims that appear in Homer,\nabout medicine, chariot racing, or anything else. When Socrates\ncompels him to choose between divine inspiration and a very drab brand\nof knowing nothing, Ion agrees to be called inspired.\n\nThis is to say that although poets’ and their readers’ ignorance is\nindeed a fact for Plato, it is a fact in need of interpretation.\nWhether it means as in the Ion that gods inspire poetry, or\nas in Republic 10 that imitative poetry imitates appearance\nalone, ignorance matters less than the implications drawn from it.\nMoreover, ignorance alone will not demonstrate that poets are\npossessed by the gods. The proof of Ion’s ignorance supports\ninspiration but does not suffice to generate that doctrine. Even if\nIon’s ignorance takes up the last part of the dialogue, it is not\nPlato’s last word about poetry.\n\nThe idiosyncrasy treated in this dialogue’s opening section, by\ncomparison, is (for Plato) irrational on its face. The idiosyncrasy\nappears as soon as Socrates asks Ion about his technê\n(530b). That essential Platonic word has been mistranslated\n“art” or “craft.” “Skill” is not\nbad; but perhaps a technê most resembles a\nprofession. The word denotes both a paying occupation and the\npossession of expertise. In Ion’s case Socrates specifies that the\nexpertise for a rhapsode includes the ability to interpret poetry\n(530c). Ion rates himself superior at that task to all his competitors\nbut concedes that he can only interpret Homer (531a). Even though\nHomer and other poets sometimes address the same subjects, Ion has\nnothing to say about those other poets. He confesses this fact without\nshame or apology, as if his different responses reflected on the poets\ninstead of on his talents. Something in Homer makes him eloquent, and\nother poets lack that quality.\n\nSocrates argues that one who knows a field knows it whole\n(531e–532a). This denial of the knowledge of particulars in\ntheir particularity also appears at Charmides 166e;\nPhaedo 97d; Republic 334a, 409d. It is not that what\nis known about an individual thing cannot transfer to other\nthings of the same kind; rather that the act of treating an object as\nunique means attending to and knowing those qualities of it that\ndo not transfer, knowing them as nontransferable qualities.\nThis attitude toward particulars qua particulars is an\nobstacle to every theoretical expertise. It is the epistemic analogue\nto the irrational one-on-one erotic bond that Aristophanes describes\nin Plato’s Symposium (191c-d).\n\nIt may well be that what Ion understands about Homer happens to hold\ntrue of Hesiod. But if this is the case, Ion will not know it. He does\nnot generalize from one to many poets, and generalizing is the mark of\na professional. Diotima’s speech in the Symposium supplies a\nuseful comparison. She differentiates between love that clings to\nparticular objects and a philosophical erôs that\nescapes its attachment to particulars to pursue general knowledge\n(210b). Ion’s investment in Homer, like the lover’s lowest grade of\nattachment, reveals (and also causes) an unwillingness to move toward\nunderstanding.\n\nAnd so Ion presents Socrates with a conundrum. Although the man’s love\nfor Homer prohibits him from possessing expertise, Socrates recognizes\nhow well Ion performs at his job. How to account for success minus\nskill? Socrates needs to diagnose Ion by means of some positive trait\nhe possesses, not merely by the absence of knowledge.\n\nSocrates therefore speaks of poets and those they move as\nentheous. He elaborates an analogy. Picture an iron ring\nhanging from a magnet, magnetized so that a second ring hangs from the\nfirst and a third from that second one. Magnets are Muses, the rings\nattached to them poets, the second rings the poets’ interpreters,\nthird the rhapsodes’ audiences. (For a recent treatment of this image\nsee Wang 2016.)\n\nPlato’s image captures the transferability of charisma. By being made\nof iron each ring has the capacity to take on the charge that holds\nit. But the magnetism resides in the magnet, not in the temporarily\nmagnetized rings. No ring is itself the source of the next ring’s\nattachment to it. Homer analogously draws poetic power from his Muse\nand attracts a rhapsode by means of borrowed power. Ion charged with\nMusic energy collects enthusiastic fans, as if to his own\nperson and as if by technê—but only as\nif. The analogy lets poets and rhapsodes appear charismatic without\ngiving them credit for their appeal.\n\nSocrates takes a further step to pit inspiration against reason.\n“Epic poets who are good at all are never masters of their\nsubject. They are inspired and possessed [entheoi ontes kai\nkatechomenoi]” (533a). Inspiration now additionally means\nthat poets are irrational, as it never meant before Plato. This\nsuperadded irrationality explains why Ion rejects Socrates’ proposal,\nin a passage that is frequently overlooked. He is not unhinged during\nhis performances, Ion says; not katechomenos kai mainomenos,\npossessed and maddened (536d). Inspiration has come to imply madness\nand the madness in it is what Ion tries to reject.\n\nWhat went wrong? The image of rings and magnets is slyer than it\nappeared. While the analogy rests transparently on one feature of\nmagnetism, the transfer of attraction, it also smuggles in a second\nfeature. Socrates describes iron rings hanging in straight lines or\nbranching: Although each ring may have more than a single ring\ndependent upon it, no ring is said to hang from more than one. But\nreal rings hang in other ways, all the rings clumped against the\nmagnet, or one ring clinging to two or three above it. Why does\nSocrates keep the strings of rings so orderly?\n\nHere is one suggestion. Keeping Homer clung only to his Muse,and Ion\nclung only to Homer, preserves the idiosyncrasy that let Socrates deny\nexpertise to Ion. For otherwise a magnet and rings would show how\ngenuine knowledge is transmitted. Suppose you say that a Muse leads\nthe doctor Hippocrates to diagnostic insights that he tells his\nstudents and they tell theirs. That much divine help is all that the\nimage of magnet and rings strictly implies, and it is no threat to a\nprofession’s understanding of itself. But no one would claim that a\ndoctor can learn only from a single other doctor, or that a doctor\ntreats a unique group of adulatory patients. That constraint on\nmedical practice would threaten its status as technê;\nand that is exactly the constraint added by the array of rings as\nSocrates describes it. (For a contrasting and compelling reading of\nthis passage see Chapter 3 of Capra 2015.)\n\nAnalogies always introduce new traits into the thing being described.\nThat is in the nature of analogical thinking and no grounds for\nsuspicion. Plato’s readers should become suspicious because the\nfeature that slips into this figure, the orderly hanging of the rings,\nis neither called for by the way iron actually transmits magnetic\nforce, nor neutral in effect. Plato has distorted magnetism to make it\nmean not inspiration simpliciter but something crazy.\n\nThe combination of possession and madness in the Ion’s\nversion of inspiration makes it hard to decide whether the dialogue\nimplies some approval for inspired poetry or condemns it entirely.\nReaders have drawn opposite morals from this short work. (On the\ndebate see Stern-Gillet 2004.) As Socrates characterizes\nenthousiasmos, it denies Ion’s professional credibility, not\nto mention his sanity. But there is religion to think of. If not\ntraditionally pious, Plato is also not the irreverent type who would\nascribe an action to divinities in order to mock it. And consider the\nexample of inspired verse mentioned here. Socrates cites Tynnichus,\nauthor of only one passable poem, which was a tribute to the Muses\n(534d). It’s as if the Muses wanted to display their power, Socrates\nsays, by proving that their intervention could elicit a good poem even\nfrom an unskilled author. If this is Socrates’ paradigm of inspired\npoetry, then whatever else inspiration also explains, it appears\nparticularly well suited to producing praise of the gods. And praise\nof the gods is the lone poetic form that Plato respects and accepts\n(Republic 607a).\n\nFinally there is a version of the same problem that arose regarding\nthe Apology, Laws, and Meno, that the\nIon calls soothsayers and diviners possessed\n(chrêsmôidos, mantis: 534d). That already seems\nto justify inspiration. Add in that Socrates calls the diviner’s\npractice a technê (538e; cf. 531b) and this dialogue\nseems to be saying that an activity can be both professional and the\nresult of divine possession. So what does the charge of madness mean?\nThe word makes Ion recoil—but what does he know about higher\nstates of understanding? Maybe madness itself needs to be reconceived.\nThe Ion says far from enough to settle the question. But\nPlato’s other sustained discussion of inspiration returns to the\nlanguage of madness and finds some forms of it permissible, even\nphilosophical.\n",
    "section_title": "3.1 Ion",
    "entry_title": "Plato’s Aesthetics",
    "hierarchy_title": "Plato’s Aesthetics || Divine Inspiration || Ion",
    "tokenized_text": [
        "divine",
        "inspiration",
        "ion",
        "ion",
        "plato",
        "shortest",
        "dialogue",
        "ion",
        "one",
        "reader",
        "would",
        "clearly",
        "situate",
        "within",
        "aesthetic",
        "address",
        "poetry",
        "alone",
        "character",
        "ion",
        "performer",
        "interpreter",
        "homer",
        "poem",
        "poet",
        "meanwhile",
        "classed",
        "art",
        "todaypainting",
        "sculpture",
        "musicappear",
        "activity",
        "problem",
        "irrationality",
        "knowledge",
        "signally",
        "fail",
        "arise",
        "ec",
        "painting",
        "technê",
        "cf",
        "gorgias",
        "c",
        "protagoras",
        "d",
        "nevertheless",
        "ion",
        "belongs",
        "aesthetic",
        "virtue",
        "focus",
        "artistic",
        "inspiration",
        "question",
        "provokes",
        "inspiration",
        "implies",
        "poetry",
        "merit",
        "rhapsode",
        "ion",
        "travel",
        "among",
        "greek",
        "city",
        "reciting",
        "explicating",
        "episode",
        "homer",
        "dramatic",
        "recitation",
        "interpretation",
        "performance",
        "offered",
        "much",
        "latitude",
        "display",
        "talent",
        "ion",
        "talent",
        "first",
        "prize",
        "contest",
        "epidaurus",
        "discussion",
        "rhapsode",
        "work",
        "see",
        "gonzalez",
        "gonzález",
        "conversation",
        "socrates",
        "fall",
        "three",
        "part",
        "covering",
        "idiosyncrasy",
        "ac",
        "inspiration",
        "cd",
        "ignorance",
        "db",
        "first",
        "third",
        "section",
        "support",
        "claim",
        "made",
        "second",
        "seen",
        "conclusion",
        "dialogue",
        "supported",
        "different",
        "way",
        "discussion",
        "come",
        "idiosyncrasy",
        "ion",
        "attachment",
        "homer",
        "show",
        "homer",
        "ion",
        "function",
        "thanks",
        "divine",
        "visitation",
        "ion",
        "resists",
        "accepting",
        "claim",
        "according",
        "deranged",
        "performance",
        "socrates",
        "present",
        "fallback",
        "argument",
        "ion",
        "unqualified",
        "ass",
        "factual",
        "claim",
        "appear",
        "homer",
        "medicine",
        "chariot",
        "racing",
        "anything",
        "else",
        "socrates",
        "compels",
        "choose",
        "divine",
        "inspiration",
        "drab",
        "brand",
        "knowing",
        "nothing",
        "ion",
        "agrees",
        "called",
        "inspired",
        "say",
        "although",
        "poet",
        "reader",
        "ignorance",
        "indeed",
        "fact",
        "plato",
        "fact",
        "need",
        "interpretation",
        "whether",
        "mean",
        "ion",
        "god",
        "inspire",
        "poetry",
        "republic",
        "imitative",
        "poetry",
        "imitates",
        "appearance",
        "alone",
        "ignorance",
        "matter",
        "le",
        "implication",
        "drawn",
        "moreover",
        "ignorance",
        "alone",
        "demonstrate",
        "poet",
        "possessed",
        "god",
        "proof",
        "ion",
        "ignorance",
        "support",
        "inspiration",
        "suffice",
        "generate",
        "doctrine",
        "even",
        "ion",
        "ignorance",
        "take",
        "last",
        "part",
        "dialogue",
        "plato",
        "last",
        "word",
        "poetry",
        "idiosyncrasy",
        "treated",
        "dialogue",
        "opening",
        "section",
        "comparison",
        "plato",
        "irrational",
        "face",
        "idiosyncrasy",
        "appears",
        "soon",
        "socrates",
        "asks",
        "ion",
        "technê",
        "b",
        "essential",
        "platonic",
        "word",
        "mistranslated",
        "art",
        "craft",
        "skill",
        "bad",
        "perhaps",
        "technê",
        "resembles",
        "profession",
        "word",
        "denotes",
        "paying",
        "occupation",
        "possession",
        "expertise",
        "ion",
        "case",
        "socrates",
        "specifies",
        "expertise",
        "rhapsode",
        "includes",
        "ability",
        "interpret",
        "poetry",
        "c",
        "ion",
        "rate",
        "superior",
        "task",
        "competitor",
        "concedes",
        "interpret",
        "homer",
        "a",
        "even",
        "though",
        "homer",
        "poet",
        "sometimes",
        "address",
        "subject",
        "ion",
        "nothing",
        "say",
        "poet",
        "confesses",
        "fact",
        "without",
        "shame",
        "apology",
        "different",
        "response",
        "reflected",
        "poet",
        "instead",
        "talent",
        "something",
        "homer",
        "make",
        "eloquent",
        "poet",
        "lack",
        "quality",
        "socrates",
        "argues",
        "one",
        "know",
        "field",
        "know",
        "whole",
        "ea",
        "denial",
        "knowledge",
        "particular",
        "particularity",
        "also",
        "appears",
        "charmides",
        "e",
        "phaedo",
        "d",
        "republic",
        "a",
        "d",
        "known",
        "individual",
        "thing",
        "transfer",
        "thing",
        "kind",
        "rather",
        "act",
        "treating",
        "object",
        "unique",
        "mean",
        "attending",
        "knowing",
        "quality",
        "transfer",
        "knowing",
        "nontransferable",
        "quality",
        "attitude",
        "toward",
        "particular",
        "qua",
        "particular",
        "obstacle",
        "every",
        "theoretical",
        "expertise",
        "epistemic",
        "analogue",
        "irrational",
        "oneonone",
        "erotic",
        "bond",
        "aristophanes",
        "describes",
        "plato",
        "symposium",
        "cd",
        "may",
        "well",
        "ion",
        "understands",
        "homer",
        "happens",
        "hold",
        "true",
        "hesiod",
        "case",
        "ion",
        "know",
        "generalize",
        "one",
        "many",
        "poet",
        "generalizing",
        "mark",
        "professional",
        "diotima",
        "speech",
        "symposium",
        "supply",
        "useful",
        "comparison",
        "differentiates",
        "love",
        "cling",
        "particular",
        "object",
        "philosophical",
        "erôs",
        "escape",
        "attachment",
        "particular",
        "pursue",
        "general",
        "knowledge",
        "b",
        "ion",
        "investment",
        "homer",
        "like",
        "lover",
        "lowest",
        "grade",
        "attachment",
        "reveals",
        "also",
        "cause",
        "unwillingness",
        "move",
        "toward",
        "understanding",
        "ion",
        "present",
        "socrates",
        "conundrum",
        "although",
        "man",
        "love",
        "homer",
        "prohibits",
        "possessing",
        "expertise",
        "socrates",
        "recognizes",
        "well",
        "ion",
        "performs",
        "job",
        "account",
        "success",
        "minus",
        "skill",
        "socrates",
        "need",
        "diagnose",
        "ion",
        "mean",
        "positive",
        "trait",
        "posse",
        "merely",
        "absence",
        "knowledge",
        "socrates",
        "therefore",
        "speaks",
        "poet",
        "move",
        "entheous",
        "elaborates",
        "analogy",
        "picture",
        "iron",
        "ring",
        "hanging",
        "magnet",
        "magnetized",
        "second",
        "ring",
        "hang",
        "first",
        "third",
        "second",
        "one",
        "magnet",
        "mus",
        "ring",
        "attached",
        "poet",
        "second",
        "ring",
        "poet",
        "interpreter",
        "third",
        "rhapsodes",
        "audience",
        "recent",
        "treatment",
        "image",
        "see",
        "wang",
        "plato",
        "image",
        "capture",
        "transferability",
        "charisma",
        "made",
        "iron",
        "ring",
        "capacity",
        "take",
        "charge",
        "hold",
        "magnetism",
        "resides",
        "magnet",
        "temporarily",
        "magnetized",
        "ring",
        "ring",
        "source",
        "next",
        "ring",
        "attachment",
        "homer",
        "analogously",
        "draw",
        "poetic",
        "power",
        "muse",
        "attracts",
        "rhapsode",
        "mean",
        "borrowed",
        "power",
        "ion",
        "charged",
        "music",
        "energy",
        "collect",
        "enthusiastic",
        "fan",
        "person",
        "technêbut",
        "analogy",
        "let",
        "poet",
        "rhapsodes",
        "appear",
        "charismatic",
        "without",
        "giving",
        "credit",
        "appeal",
        "socrates",
        "take",
        "step",
        "pit",
        "inspiration",
        "reason",
        "epic",
        "poet",
        "good",
        "never",
        "master",
        "subject",
        "inspired",
        "possessed",
        "entheoi",
        "ontes",
        "kai",
        "katechomenoi",
        "a",
        "inspiration",
        "additionally",
        "mean",
        "poet",
        "irrational",
        "never",
        "meant",
        "plato",
        "superadded",
        "irrationality",
        "explains",
        "ion",
        "reject",
        "socrates",
        "proposal",
        "passage",
        "frequently",
        "overlooked",
        "unhinged",
        "performance",
        "ion",
        "say",
        "katechomenos",
        "kai",
        "mainomenos",
        "possessed",
        "maddened",
        "d",
        "inspiration",
        "come",
        "imply",
        "madness",
        "madness",
        "ion",
        "try",
        "reject",
        "went",
        "wrong",
        "image",
        "ring",
        "magnet",
        "slyer",
        "appeared",
        "analogy",
        "rest",
        "transparently",
        "one",
        "feature",
        "magnetism",
        "transfer",
        "attraction",
        "also",
        "smuggles",
        "second",
        "feature",
        "socrates",
        "describes",
        "iron",
        "ring",
        "hanging",
        "straight",
        "line",
        "branching",
        "although",
        "ring",
        "may",
        "single",
        "ring",
        "dependent",
        "upon",
        "ring",
        "said",
        "hang",
        "one",
        "real",
        "ring",
        "hang",
        "way",
        "ring",
        "clumped",
        "magnet",
        "one",
        "ring",
        "clinging",
        "two",
        "three",
        "socrates",
        "keep",
        "string",
        "ring",
        "orderly",
        "one",
        "suggestion",
        "keeping",
        "homer",
        "clung",
        "muse",
        "ion",
        "clung",
        "homer",
        "preserve",
        "idiosyncrasy",
        "let",
        "socrates",
        "deny",
        "expertise",
        "ion",
        "otherwise",
        "magnet",
        "ring",
        "would",
        "show",
        "genuine",
        "knowledge",
        "transmitted",
        "suppose",
        "say",
        "muse",
        "lead",
        "doctor",
        "hippocrates",
        "diagnostic",
        "insight",
        "tell",
        "student",
        "tell",
        "much",
        "divine",
        "help",
        "image",
        "magnet",
        "ring",
        "strictly",
        "implies",
        "threat",
        "profession",
        "understanding",
        "one",
        "would",
        "claim",
        "doctor",
        "learn",
        "single",
        "doctor",
        "doctor",
        "treat",
        "unique",
        "group",
        "adulatory",
        "patient",
        "constraint",
        "medical",
        "practice",
        "would",
        "threaten",
        "status",
        "technê",
        "exactly",
        "constraint",
        "added",
        "array",
        "ring",
        "socrates",
        "describes",
        "contrasting",
        "compelling",
        "reading",
        "passage",
        "see",
        "chapter",
        "capra",
        "analogy",
        "always",
        "introduce",
        "new",
        "trait",
        "thing",
        "described",
        "nature",
        "analogical",
        "thinking",
        "ground",
        "suspicion",
        "plato",
        "reader",
        "become",
        "suspicious",
        "feature",
        "slip",
        "figure",
        "orderly",
        "hanging",
        "ring",
        "neither",
        "called",
        "way",
        "iron",
        "actually",
        "transmits",
        "magnetic",
        "force",
        "neutral",
        "effect",
        "plato",
        "distorted",
        "magnetism",
        "make",
        "mean",
        "inspiration",
        "simpliciter",
        "something",
        "crazy",
        "combination",
        "possession",
        "madness",
        "ion",
        "version",
        "inspiration",
        "make",
        "hard",
        "decide",
        "whether",
        "dialogue",
        "implies",
        "approval",
        "inspired",
        "poetry",
        "condemns",
        "entirely",
        "reader",
        "drawn",
        "opposite",
        "moral",
        "short",
        "work",
        "debate",
        "see",
        "sterngillet",
        "socrates",
        "characterizes",
        "enthousiasmos",
        "denies",
        "ion",
        "professional",
        "credibility",
        "mention",
        "sanity",
        "religion",
        "think",
        "traditionally",
        "pious",
        "plato",
        "also",
        "irreverent",
        "type",
        "would",
        "ascribe",
        "action",
        "divinity",
        "order",
        "mock",
        "consider",
        "example",
        "inspired",
        "verse",
        "mentioned",
        "socrates",
        "cite",
        "tynnichus",
        "author",
        "one",
        "passable",
        "poem",
        "tribute",
        "mus",
        "d",
        "mus",
        "wanted",
        "display",
        "power",
        "socrates",
        "say",
        "proving",
        "intervention",
        "could",
        "elicit",
        "good",
        "poem",
        "even",
        "unskilled",
        "author",
        "socrates",
        "paradigm",
        "inspired",
        "poetry",
        "whatever",
        "else",
        "inspiration",
        "also",
        "explains",
        "appears",
        "particularly",
        "well",
        "suited",
        "producing",
        "praise",
        "god",
        "praise",
        "god",
        "lone",
        "poetic",
        "form",
        "plato",
        "respect",
        "accepts",
        "republic",
        "a",
        "finally",
        "version",
        "problem",
        "arose",
        "regarding",
        "apology",
        "law",
        "meno",
        "ion",
        "call",
        "soothsayer",
        "diviner",
        "possessed",
        "chrêsmôidos",
        "mantis",
        "d",
        "already",
        "seems",
        "justify",
        "inspiration",
        "add",
        "socrates",
        "call",
        "diviner",
        "practice",
        "technê",
        "e",
        "cf",
        "b",
        "dialogue",
        "seems",
        "saying",
        "activity",
        "professional",
        "result",
        "divine",
        "possession",
        "charge",
        "madness",
        "mean",
        "word",
        "make",
        "ion",
        "recoilbut",
        "know",
        "higher",
        "state",
        "understanding",
        "maybe",
        "madness",
        "need",
        "reconceived",
        "ion",
        "say",
        "far",
        "enough",
        "settle",
        "question",
        "plato",
        "sustained",
        "discussion",
        "inspiration",
        "return",
        "language",
        "madness",
        "find",
        "form",
        "permissible",
        "even",
        "philosophical"
    ]
}