{
    "main_text": "The Development of Mind\n14. The Development of Mind\n\n\nThe Seventh Book continues with the kinds of study conducive to the\neducation of the philosopher-ruler (521cff). The goal of intellectual\ndevelopment is knowledge of Forms, ultimately acquired through\ndialectic. Dialectic, however, is practiced late in life by a select\nfew with the requisite memory and quickness of mind, after they have\nstudied various, essentially mathematical disciplines. The winnowing\nprocess eliminates most people from ever developing the necessities for\nphilosophical thought. The first steps (523a-525a) in the turn towards\nabstract thinking are occasioned by the need for the mind to settle\nquestions arising from ordinary perception; that is, the mind of\neveryman is liable to be summoned to reflect upon the confused, and\nconfusing, reports of perception. About a host of perceptual qualities,\nthick, thin, hard, soft, large and small, the senses report that they\nare the same, at least in certain perceptual circumstances. Lumped in\nwith these properties is also number. The mind is summoned to settle\nwhat is large and what is small, and what is one.\n\n\nThe brief discussion of the summoners raises suspicions about the\nfaculty psychology presented in the final argument of Book V and in\nLine and Cave. It seems at times that Plato thinks that belonging to\neach part of the soul are capacities or faculties capable of issuing\njudgments (cf. 602c-603a; see Burnyeat 1976).  So, for instance, there\nare the judgments of sense that can and often do conflict with the\njudgments of reason.  But taken literally, if each faculty has its own\nobjects such that no other faculty can be set over them, then there\ncan be no conflict in judgments. The case of perception poses a\nspecial difficulty.  Perception, unlike discursive thought or belief,\nis aligned not with the so-called rational part of the soul, but with\nthe desiderative part. As we saw in the Phaedo, as well as in\nthe passages about the sightlovers and the summoners, the senses are\ndisparaged as a source of confusion and falsehood. The senses mislead\nus. One of Plato's complaints seems to be that people rely on\nperception, or belief relying on perception, with the result that they\ncome to think that what is real is the physical, sensible world. And,\nperhaps even worse, they come to think that one can understand (know)\nthings about the world such as what makes (for example) a temple\nbeautiful or a stick equal or a person large by appealing to\nproperties that are perceptual or observational or sensible.\n\n\nProponents of the thesis that Plato posits Forms only for incomplete\nproperties locate the problem for the sensible world not in the\nobjects themselves, but in the kinds of explanations that sightlovers\nand non-philosophers rely on to justify their claim to know\n(propositions about) the sensible, material world (see Fine 1978;\n1990; Irwin 1977; Gosling 1960).  It need not be the case, as the\npredicative reading in terms of objects would have it, that a given\ntemple is and is not- beautiful. In their view, the problem is the\nsensible property types cited by the sight-lovers in their accounts of\nwhat makes something beautiful. For example, there is the sensible\nproperty type, bright-color, that allegedly explains why the temple at\nBassae is beautiful. But, bright-color itself, the property type, is\nand is not-beautiful, for it accounts for beauty in some things but\naccounts for ugliness (not-beauty) in others. The crucial text for\nthis reading is 479d3–5: “So we have discovered, apparently,\nthat most people's varying standards (nomima) of beauty and\nthings like that are rattling around somewhere in the middle, between\nwhat is not something and what purely and simply is something”\n(Ferrari/Griffith trans.) The veridical reading\ntranslates nomima as ‘beliefs’ and contends that\nbecause most people rely on sensible property types as the\njustification for their beliefs, they are condemned to live in the\nrealm of belief. For, according to this reading, every sensible\nproperty type suffers from this compresence of opposites, i.e.,\nis F and not-F. In appealing to such properties in\ntheir accounts, the sight lover can never be justified in any of his\nbeliefs about the many beautifuls, because their accounts or reasons\nfor their beliefs about the world must be false. Hence, the sightlover\ncan have only beliefs about the many beautifuls, or equals, or, for any\nincomplete property F, the many fs. The sight-lover\ncan never achieve knowledge so long as he relies on sensible\nproperties in his accounts. And since Plato thinks that there is\nknowledge, he infers, says the veridical reading, that there must be\nnon-sensible objects, or rather there must be accounts or explanations\navailable which can be phrased in terms of ‘non-sensible’\nproperties, i.e., must appeal to properties which are not\nboth F and not-F, or more precisely, do not make\nsome things, say beautiful, and others ugly.\n\n\nThe veridical reading, combined with the account that limits Forms\nto incomplete properties (See §6, supra), allows for the\npossibility that the philosopher can have knowledge of the visible\nrealm. This can come about for at least two reasons. On the one hand,\nthere will be a host of non-sensible properties and propositions about\nordinary particulars and such properties, e.g., ‘Socrates is a\nman’. Since arguably Plato thinks that Socrates is completely or\nessentially a man, and since there is no Form of Man, the philosopher\n(and, perhaps, anyone) can know such a proposition. On the other hand,\nthe philosopher, once he comes to know the Forms of the Incomplete\nProperties, can then have knowledge of the external world in any and\nall respects. Not misled by the compresent opposite properties, and\nable to base all his accounts on the Good and the other Forms, nothing\nstands in his way of knowing the material world\n (520c).[23]\n\n\nThe predicative reading of the argument of Book V and the analogies\nof the central books does not limit the range of Forms and does not\ncommit itself to the possibility of knowledge of the external world. If\none treats the physical world as metaphysically defective, as\nvictimized in any and every respect by its being and not-being, then\nthat suffices to preclude one from knowing anything about such a world.\nThe objects of the physical world are simply not the right sorts of\nthings to qualify as objects of knowledge, regardless of what sorts of\nreasons or justifications or explanations one has at her disposal.\n\n\nRegardless of the epistemic status of the physical world, one task\nis to understand how Plato thinks the transition is made from one's\nperceptions and beliefs about the physical world to knowledge of the\nForms. In the Republic, Socrates says that every human being\nis capable of becoming a philosopher and thus able to know the Good and\nall the Forms (518c). On the other hand, the Republic leaves\nlittle doubt that Plato expects that few will actually achieve the\nknowledge each is capable of. Most of us will give in to the ordinary\nbeliefs generated through our perceptual encounters with the sensible\nworld, as well as those resulting from the conversations we have with\none another. Most will never even begin, it seems, the course of study\noutlined in Book VII, and most of those who begin will not become\ndialectically sophisticated so that they can give an account of what\nthey know that will ‘destroy the hypotheses'. But despite\nthe odds, from the Phaedo and Republic we can locate\ntwo elements of Plato's epistemological program that can lead to\nknowledge if properly exercised, recollection and the method of\nhypothesis. The latter is mentioned explicitly in the Phaedo\nand seems again to be alluded to in Plato's remarks about the\ndifferences between the top two sections of line. Since this method,\nassuming that it is the same in both, appears to be deployed as part of\nthe final stages of the pursuit of knowledge, there is reason to\npostpone consideration of the method until after consideration of\nperception and belief, i.e., the first two stages of Line.\n\n\nThe Phaedo's discussion of Recollection suggests that there\nis something inherently flawed with empiricist or abstractionist\naccounts, at least those that attempt to derive any concept from our\ncontacts, perceptual or linguistic, with the external world. It seems\nthat Plato thinks that the deficiency of the external, sensible,\nmaterial world vitiates all efforts to build or acquire concepts from\nit. The deficiency of the sensible material world makes it an\nunreliable source of information. Depending on how one accounts for\nthis deficiency, the trouble for perception, and belief based on\nperception, is explained in different ways. Aristotle's account\nemphasizes that it is changing. Another source of difficulty is that\nthe abstract, general Forms are always manifested in a concrete,\ndeterminate fashion (See §7, supra). The Affinity Argument\npoints to the complexity of material particulars. Rather than present a\nsingle property, as it were, to perception, perception is required to\nfocus on some aspect of the complex particular. If it is also true that\nat least with respect to some properties, namely the incomplete or\nrelative properties addressed by the Compresence accounts, every object\nis both F and not-F, then no sensible will be an\nunqualified bearer of these properties. Perception, considered in its\nown right, seems to be unable to explain how any feature of an object\nis selected for study. It also seems that Plato thinks that the\npsychological faculties of perception, or even belief, are incapable of\nprocessing the information in a reliable manner, or at least in a\nmanner requisite for knowledge. At times it seems that they distort or\nalter perceptions (Phaedo, 65ff). At other times, e.g., when\nwe emphasize the difference between the faculties, it seems that they\nare confined to work on whatever they process in such a manner that\nthey do not pass along anything to the rational faculty, or if they do,\nthey pass it along to belief. One problem is that whenever one engages\nin perception, and belief based on perceptual reports, one can never\novercome the inherently perspectival situation. For instance, no matter\nwhere one is situated, the round penny will appear to the eye, we might\nsay, somewhat elliptical. Or, to use Plato's example from Book Ten, the\nstraight stick in water will seem bent (owing to the laws of\nrefraction), even though an experienced person will believe that it is\nstraight\n (602c-603a).[24]\n",
    "section_title": "14. The Development of Mind",
    "entry_title": "Plato’s Middle Period Metaphysics and Epistemology",
    "hierarchy_title": "Plato’s Middle Period Metaphysics and Epistemology || The Development of Mind",
    "tokenized_text": [
        "development",
        "mind",
        "development",
        "mind",
        "seventh",
        "book",
        "continues",
        "kind",
        "study",
        "conducive",
        "education",
        "philosopherruler",
        "cff",
        "goal",
        "intellectual",
        "development",
        "knowledge",
        "form",
        "ultimately",
        "acquired",
        "dialectic",
        "dialectic",
        "however",
        "practiced",
        "late",
        "life",
        "select",
        "requisite",
        "memory",
        "quickness",
        "mind",
        "studied",
        "various",
        "essentially",
        "mathematical",
        "discipline",
        "winnowing",
        "process",
        "eliminates",
        "people",
        "ever",
        "developing",
        "necessity",
        "philosophical",
        "thought",
        "first",
        "step",
        "aa",
        "turn",
        "towards",
        "abstract",
        "thinking",
        "occasioned",
        "need",
        "mind",
        "settle",
        "question",
        "arising",
        "ordinary",
        "perception",
        "mind",
        "everyman",
        "liable",
        "summoned",
        "reflect",
        "upon",
        "confused",
        "confusing",
        "report",
        "perception",
        "host",
        "perceptual",
        "quality",
        "thick",
        "thin",
        "hard",
        "soft",
        "large",
        "small",
        "sens",
        "report",
        "least",
        "certain",
        "perceptual",
        "circumstance",
        "lumped",
        "property",
        "also",
        "number",
        "mind",
        "summoned",
        "settle",
        "large",
        "small",
        "one",
        "brief",
        "discussion",
        "summoners",
        "raise",
        "suspicion",
        "faculty",
        "psychology",
        "presented",
        "final",
        "argument",
        "book",
        "v",
        "line",
        "cave",
        "seems",
        "time",
        "plato",
        "think",
        "belonging",
        "part",
        "soul",
        "capacity",
        "faculty",
        "capable",
        "issuing",
        "judgment",
        "cf",
        "ca",
        "see",
        "burnyeat",
        "instance",
        "judgment",
        "sense",
        "often",
        "conflict",
        "judgment",
        "reason",
        "taken",
        "literally",
        "faculty",
        "object",
        "faculty",
        "set",
        "conflict",
        "judgment",
        "case",
        "perception",
        "pose",
        "special",
        "difficulty",
        "perception",
        "unlike",
        "discursive",
        "thought",
        "belief",
        "aligned",
        "socalled",
        "rational",
        "part",
        "soul",
        "desiderative",
        "part",
        "saw",
        "phaedo",
        "well",
        "passage",
        "sightlovers",
        "summoners",
        "sens",
        "disparaged",
        "source",
        "confusion",
        "falsehood",
        "sens",
        "mislead",
        "u",
        "one",
        "plato",
        "s",
        "complaint",
        "seems",
        "people",
        "rely",
        "perception",
        "belief",
        "relying",
        "perception",
        "result",
        "come",
        "think",
        "real",
        "physical",
        "sensible",
        "world",
        "perhaps",
        "even",
        "worse",
        "come",
        "think",
        "one",
        "understand",
        "know",
        "thing",
        "world",
        "make",
        "example",
        "temple",
        "beautiful",
        "stick",
        "equal",
        "person",
        "large",
        "appealing",
        "property",
        "perceptual",
        "observational",
        "sensible",
        "proponent",
        "thesis",
        "plato",
        "posit",
        "form",
        "incomplete",
        "property",
        "locate",
        "problem",
        "sensible",
        "world",
        "object",
        "kind",
        "explanation",
        "sightlovers",
        "nonphilosophers",
        "rely",
        "justify",
        "claim",
        "know",
        "proposition",
        "sensible",
        "material",
        "world",
        "see",
        "fine",
        "irwin",
        "gosling",
        "need",
        "case",
        "predicative",
        "reading",
        "term",
        "object",
        "would",
        "given",
        "temple",
        "not",
        "beautiful",
        "view",
        "problem",
        "sensible",
        "property",
        "type",
        "cited",
        "sightlovers",
        "account",
        "make",
        "something",
        "beautiful",
        "example",
        "sensible",
        "property",
        "type",
        "brightcolor",
        "allegedly",
        "explains",
        "temple",
        "bassae",
        "beautiful",
        "brightcolor",
        "property",
        "type",
        "notbeautiful",
        "account",
        "beauty",
        "thing",
        "account",
        "ugliness",
        "notbeauty",
        "others",
        "crucial",
        "text",
        "reading",
        "d",
        "discovered",
        "apparently",
        "people",
        "s",
        "varying",
        "standard",
        "nomima",
        "beauty",
        "thing",
        "like",
        "rattling",
        "around",
        "somewhere",
        "middle",
        "something",
        "purely",
        "simply",
        "something",
        "ferrarigriffith",
        "trans",
        "veridical",
        "reading",
        "translates",
        "nomima",
        "belief",
        "contends",
        "people",
        "rely",
        "sensible",
        "property",
        "type",
        "justification",
        "belief",
        "condemned",
        "live",
        "realm",
        "belief",
        "according",
        "reading",
        "every",
        "sensible",
        "property",
        "type",
        "suffers",
        "compresence",
        "opposite",
        "ie",
        "f",
        "notf",
        "appealing",
        "property",
        "account",
        "sight",
        "lover",
        "never",
        "justified",
        "belief",
        "many",
        "beautifuls",
        "account",
        "reason",
        "belief",
        "world",
        "must",
        "false",
        "hence",
        "sightlover",
        "belief",
        "many",
        "beautifuls",
        "equal",
        "incomplete",
        "property",
        "f",
        "many",
        "f",
        "sightlover",
        "never",
        "achieve",
        "knowledge",
        "long",
        "relies",
        "sensible",
        "property",
        "account",
        "since",
        "plato",
        "think",
        "knowledge",
        "infers",
        "say",
        "veridical",
        "reading",
        "must",
        "nonsensible",
        "object",
        "rather",
        "must",
        "account",
        "explanation",
        "available",
        "phrased",
        "term",
        "nonsensible",
        "property",
        "ie",
        "must",
        "appeal",
        "property",
        "f",
        "notf",
        "precisely",
        "make",
        "thing",
        "say",
        "beautiful",
        "others",
        "ugly",
        "veridical",
        "reading",
        "combined",
        "account",
        "limit",
        "form",
        "incomplete",
        "property",
        "see",
        "supra",
        "allows",
        "possibility",
        "philosopher",
        "knowledge",
        "visible",
        "realm",
        "come",
        "least",
        "two",
        "reason",
        "one",
        "hand",
        "host",
        "nonsensible",
        "property",
        "proposition",
        "ordinary",
        "particular",
        "property",
        "eg",
        "socrates",
        "man",
        "since",
        "arguably",
        "plato",
        "think",
        "socrates",
        "completely",
        "essentially",
        "man",
        "since",
        "form",
        "man",
        "philosopher",
        "perhaps",
        "anyone",
        "know",
        "proposition",
        "hand",
        "philosopher",
        "come",
        "know",
        "form",
        "incomplete",
        "property",
        "knowledge",
        "external",
        "world",
        "respect",
        "misled",
        "compresent",
        "opposite",
        "property",
        "able",
        "base",
        "account",
        "good",
        "form",
        "nothing",
        "stand",
        "way",
        "knowing",
        "material",
        "world",
        "c",
        "predicative",
        "reading",
        "argument",
        "book",
        "v",
        "analogy",
        "central",
        "book",
        "limit",
        "range",
        "form",
        "commit",
        "possibility",
        "knowledge",
        "external",
        "world",
        "one",
        "treat",
        "physical",
        "world",
        "metaphysically",
        "defective",
        "victimized",
        "every",
        "respect",
        "notbeing",
        "suffices",
        "preclude",
        "one",
        "knowing",
        "anything",
        "world",
        "object",
        "physical",
        "world",
        "simply",
        "right",
        "sort",
        "thing",
        "qualify",
        "object",
        "knowledge",
        "regardless",
        "sort",
        "reason",
        "justification",
        "explanation",
        "one",
        "disposal",
        "regardless",
        "epistemic",
        "status",
        "physical",
        "world",
        "one",
        "task",
        "understand",
        "plato",
        "think",
        "transition",
        "made",
        "one",
        "s",
        "perception",
        "belief",
        "physical",
        "world",
        "knowledge",
        "form",
        "republic",
        "socrates",
        "say",
        "every",
        "human",
        "capable",
        "becoming",
        "philosopher",
        "thus",
        "able",
        "know",
        "good",
        "form",
        "c",
        "hand",
        "republic",
        "leaf",
        "little",
        "doubt",
        "plato",
        "expects",
        "actually",
        "achieve",
        "knowledge",
        "capable",
        "u",
        "give",
        "ordinary",
        "belief",
        "generated",
        "perceptual",
        "encounter",
        "sensible",
        "world",
        "well",
        "resulting",
        "conversation",
        "one",
        "another",
        "never",
        "even",
        "begin",
        "seems",
        "course",
        "study",
        "outlined",
        "book",
        "vii",
        "begin",
        "become",
        "dialectically",
        "sophisticated",
        "give",
        "account",
        "know",
        "destroy",
        "hypothesis",
        "despite",
        "odds",
        "phaedo",
        "republic",
        "locate",
        "two",
        "element",
        "plato",
        "s",
        "epistemological",
        "program",
        "lead",
        "knowledge",
        "properly",
        "exercised",
        "recollection",
        "method",
        "hypothesis",
        "latter",
        "mentioned",
        "explicitly",
        "phaedo",
        "seems",
        "alluded",
        "plato",
        "s",
        "remark",
        "difference",
        "top",
        "two",
        "section",
        "line",
        "since",
        "method",
        "assuming",
        "appears",
        "deployed",
        "part",
        "final",
        "stage",
        "pursuit",
        "knowledge",
        "reason",
        "postpone",
        "consideration",
        "method",
        "consideration",
        "perception",
        "belief",
        "ie",
        "first",
        "two",
        "stage",
        "line",
        "phaedo",
        "s",
        "discussion",
        "recollection",
        "suggests",
        "something",
        "inherently",
        "flawed",
        "empiricist",
        "abstractionist",
        "account",
        "least",
        "attempt",
        "derive",
        "concept",
        "contact",
        "perceptual",
        "linguistic",
        "external",
        "world",
        "seems",
        "plato",
        "think",
        "deficiency",
        "external",
        "sensible",
        "material",
        "world",
        "vitiates",
        "effort",
        "build",
        "acquire",
        "concept",
        "deficiency",
        "sensible",
        "material",
        "world",
        "make",
        "unreliable",
        "source",
        "information",
        "depending",
        "one",
        "account",
        "deficiency",
        "trouble",
        "perception",
        "belief",
        "based",
        "perception",
        "explained",
        "different",
        "way",
        "aristotle",
        "s",
        "account",
        "emphasizes",
        "changing",
        "another",
        "source",
        "difficulty",
        "abstract",
        "general",
        "form",
        "always",
        "manifested",
        "concrete",
        "determinate",
        "fashion",
        "see",
        "supra",
        "affinity",
        "argument",
        "point",
        "complexity",
        "material",
        "particular",
        "rather",
        "present",
        "single",
        "property",
        "perception",
        "perception",
        "required",
        "focus",
        "aspect",
        "complex",
        "particular",
        "also",
        "true",
        "least",
        "respect",
        "property",
        "namely",
        "incomplete",
        "relative",
        "property",
        "addressed",
        "compresence",
        "account",
        "every",
        "object",
        "f",
        "notf",
        "sensible",
        "unqualified",
        "bearer",
        "property",
        "perception",
        "considered",
        "right",
        "seems",
        "unable",
        "explain",
        "feature",
        "object",
        "selected",
        "study",
        "also",
        "seems",
        "plato",
        "think",
        "psychological",
        "faculty",
        "perception",
        "even",
        "belief",
        "incapable",
        "processing",
        "information",
        "reliable",
        "manner",
        "least",
        "manner",
        "requisite",
        "knowledge",
        "time",
        "seems",
        "distort",
        "alter",
        "perception",
        "phaedo",
        "ff",
        "time",
        "eg",
        "emphasize",
        "difference",
        "faculty",
        "seems",
        "confined",
        "work",
        "whatever",
        "process",
        "manner",
        "pas",
        "along",
        "anything",
        "rational",
        "faculty",
        "pas",
        "along",
        "belief",
        "one",
        "problem",
        "whenever",
        "one",
        "engages",
        "perception",
        "belief",
        "based",
        "perceptual",
        "report",
        "one",
        "never",
        "overcome",
        "inherently",
        "perspectival",
        "situation",
        "instance",
        "matter",
        "one",
        "situated",
        "round",
        "penny",
        "appear",
        "eye",
        "might",
        "say",
        "somewhat",
        "elliptical",
        "use",
        "plato",
        "s",
        "example",
        "book",
        "ten",
        "straight",
        "stick",
        "water",
        "seem",
        "bent",
        "owing",
        "law",
        "refraction",
        "even",
        "though",
        "experienced",
        "person",
        "believe",
        "straight",
        "ca"
    ]
}