{
    "main_text": "The Singular Term Argument || Propositions\n4.2 Propositions\n\nWe turn now to a version of the singular term argument aimed at\nestablishing the existence of propositions. Once again, the most\nimportant figure in the development of this argument is Frege (1892,\n1919). Other relevant figures (who wouldn't all endorse an argument\nlike the one sketched below) include Russell (1905, 1910–1911),\nChurch (1950, 1954), Quine (1956), Kaplan (1968–69, 1989),\nKripke (1972, 1979), Schiffer (1977, 1987, 1994), Perry (1979), Evans\n(1981), Peacocke (1981), Barwise and Perry (1983), Bealer (1982,\n1993), Zalta (1983, 1988), Katz (1986), Salmon (1986), Soames (1987,\n2014), Forbes (1987), Crimmins and Perry (1989), Richard (1990),\nCrimmins (1998), Recanati (1993, 2000), King (1995, 2014), Braun\n(1998), and Saul (1999). \n\nThe relevant sentences here are belief ascriptions, i.e., sentences\nlike ‘Clinton believes that snow is white’ and\n‘Emily believes that Santa Claus is fat’. The first point\nto note about these sentences is that they involve\n‘that’-clauses, where a ‘that’-clause is\nsimply the word ‘that’ added to the front of a complete\nsentence — e.g., ‘that snow is white’. The second\npoint to be made is that ‘that’-clauses, in English, are\nsingular terms. A common way to illustrate this point — see,\ne.g., Bealer (1982 and 1993) and Schiffer (1994) — is to appeal\nto arguments like the following:\n\n\n\nI.\nClinton believes that snow is white.\n\nTherefore, Clinton believes something (namely, that snow is\nwhite). \n\n\n\nThis argument seems to be valid, and platonists claim that the best\nand only tenable explanation of this fact involves a commitment to the\nidea that the ‘that’-clause in this argument, i.e.,\n‘that snow is white’, is a singular term.\n\nBut if ‘that’-clauses are singular terms, what sorts of\nobjects do they refer to? Well, it might seem that they refer to\nfacts, or states of affairs. For instance, it might seem that\n‘that snow is white’ refers to the fact that snow is\nwhite. This, however, is a mistake (at least in connection with the\n‘that’-clauses that appear in belief reports). For since\nbeliefs can be false, it follows that the ‘that’-clauses\nin our belief reports refer to things that can be false. E.g., if\nSammy is seven years old, then the sentence ‘Sammy believes that\nsnow is powdered sugar’ could be true; but if this sentence is\ntrue, then (by our criterion of ontological commitment) its\n‘that’-clause refers to a real object; but then it cannot\nrefer to a fact, because (obviously) there is no such thing as the\nfact that snow is powdered sugar.\n\nThese considerations suggest that the referents of the\n‘that’-clauses that appear in belief ascriptions are\nthings that can be true or false. But if this is right, then it seems\nthat the objects of belief must be either sentences or propositions.\nThe standard platonist view is that they are propositions. Before we\nconsider their arguments for this claim, we need to say a few words\nabout the different kinds of sentential views that one might\nendorse.\n\nTo begin with, we need to distinguish between sentence types\nand sentence tokens. To appreciate the difference, consider\nthe following indented sentences:\n\nCats are cute.\n\nCats are cute.\n\n\nWe have here two different tokens of a single sentence type. Thus, a\ntoken is an actual physical thing, located at a specific place in\nspacetime; it is a pile of ink on a page (structured in an appropriate\nway), or a sound wave, or a collection of pixels on a computer screen,\nor something of this sort. A type, on the other hand, can be tokened\nnumerous times but is not identical with any single token. Thus, a\nsentence type is an abstract object. And so if we are looking for an\nanti-platonist view of what ‘that’-clauses refer to, or\nwhat belief reports are about, we cannot say that they're about\nsentence types; we have to say they're about sentence tokens.\n\nA second distinction that needs to be drawn here is between sentence\ntokens that are external, or public, and sentence tokens that\nare internal, or private. Examples of external sentence\ntokens were given in the last paragraph — piles of ink, sound\nwaves, and so on. An internal sentence token, on the other hand,\nexists inside a particular person's head. There is a wide-spread view\n— due mainly to Jerry Fodor (1975 and 1987) but adopted by many\nothers, e.g., Stich (1983) — that we are able to perform\ncognitive tasks (e.g., think, remember information, and have beliefs)\nonly because we are capable of storing information in our heads in a\nneural language (often called mentalese, or the language\nof thought). In connection with beliefs, the idea here is that to\nbelieve that, say, snow is white, is to have a neural sentence stored\nin your head (in a belief way, as opposed to a desire way, or some\nother way) that means in mentalese that snow is white.\n\nThis gives us two different anti-platonist alternatives to the view\nthat belief reports involve references to propositions. First, there\nis the conceptualistic (or mentalistic) view that belief reports\ninvolve references to sentences in our heads, or mentalese sentence\ntokens. And, second, there is the physicalistic view that belief\nreports involve references to external sentence tokens, i.e., to piles\nof ink, and so on (versions of this view have been endorsed by Carnap\n(1947), Davidson (1967), and Leeds (1979)).\n\nThere are a number of arguments that suggest that ordinary belief\nreports cannot be taken to be about (internal or external) sentences\nand that we have to take them to be about propositions. We will\nrehearse one such argument here, an argument that goes back at least\nto Church (1950). Suppose that Boris and Jerry both live in cold\nclimates and are very familiar with snow. Thus, they both believe that\nsnow is white. But Boris lives in Russia and speaks only Russian,\nwhereas Jerry lives in Minnesota and speaks only English. Now,\nconsider the following argument:\n\n\n\nII.\nBoris believes that snow is white.\n\nJerry believes that snow is white.\n\nTherefore, there's at least one thing that Boris and Jerry both\nbelieve, namely, that snow is white. \n\n\n\nThis argument seems clearly valid; but this seems to rule out the idea\nthat the belief reports here are about sentence tokens. For (a) in\norder to account for the validity of the argument, we have to take the\ntwo ‘that’-clauses to refer to the same thing, and (b)\nthere is no sentence token that they could both refer to. First of\nall, they couldn't refer to any external sentence token (or, for that\nmatter, any sentence type associated with any natural language),\nbecause (i) if the first ‘that’-clause refers to such a\nsentence, it would presumably be a Russian sentence, since Boris\nspeaks only\n Russian;[8]\n and (ii) if the second ‘that’-clause refers to such a\nsentence, it would presumably be an English sentence, since Jerry\nspeaks only English; and so (iii) the two ‘that’-clauses\ncannot both refer to the same external sentence token (or\nnatural-language sentence type). And second, they cannot refer to any\nmentalese sentence token, because (i) if the first\n‘that’-clause refers to such a sentence, it would\npresumably be in Boris's head; and (ii) if the second\n‘that’-clause refers to such a sentence, it would\npresumably be in Jerry's head; and so (iii) the two\n‘that’-clauses cannot both refer to the same mentalese\nsentence token. Therefore, it seems to follow that the\n‘that’-clauses in the above argument do not refer to\nsentence tokens of any kind. And since these are ordinary belief\nascriptions, it follows that, in general, the\n‘that’-clauses that appear in ordinary belief ascriptions\ndo not refer to sentence tokens.\n\nNow as it's formulated here, this argument doesn't rule out the view\nthat ‘that’-clauses refer to mentalese sentence types, but\nthe argument can be extended to rule out that view as well (e.g., one\nmight do this by talking not of an American and a Russian but of two\ncreatures with different internal languages of thought). I won't run\nthrough the details of this here, since, as we've seen,\nanti-platonists can't claim that ‘that’-clauses refer to\ntypes anyway, because types are abstract objects. But if we assume\nthat that version of the argument is cogent as well, then it follows\nthat ‘that’-clauses don't refer to sentences of any kind\nat all and, hence, that they must refer to\n propositions.[9]\n\nNow, notice that the issue so far has been purely semantic. What the\nabove argument suggests is that regardless of whether there are any\nsuch things as propositions, our ‘that’-clauses are best\ninterpreted as purporting to refer to such objects. Platonists then\nclaim that if this is correct, then there must be such things as\npropositions, because, clearly, many of our belief ascriptions are\ntrue. For instance, ‘Clinton believes that snow is white’\nis true; thus, if the above analysis of ‘that’-clauses is\ncorrect, and if our criterion of ontological commitment is correct, it\nfollows that there is such a thing as the proposition that snow is\nwhite.\n\nThis version of the singular term argument might seem even more\npowerful than the mathematical-object version of the singular term\nargument sketched in\n section 4.1,\n because in this case, it doesn't seem that there is as much room for\nparaphrase nominalism. We saw in\n section 4.1\n that there are a number of programs for paraphrasing the statements\nof mathematics, but there are no obvious strategies for paraphrasing\nordinary belief ascriptions. One might think this could be done by\ntaking sentences of the form ‘S believes that\np’ to mean ‘If there existed propositions, then\nS would believe that p’; but this sort of view\nis even less plausible here than it is in the mathematical case. It is\njust wildly implausible to suppose that when common folk say things\nlike ‘Clinton believes that his presidency was\nsuccessful’, they mean to be making hypothetical claims about\nwhat the person in question would believe in some alternate\nsituation.\n\nHowever, while paraphrase nominalism seems hopeless in the case of\npropositions, Balaguer (1998b) has argued that fictionalistic\nnominalism carries over very well to the case of propositions. More\nspecifically, fictionalists can say that ‘Clinton believes that\nsnow is white’ is strictly speaking not true (because its\n‘that’-clause is supposed to refer to a proposition, and\nthere are no such things as propositions) but that we can still use it\nto say something essentially accurate about Clinton's belief state,\nbecause there are facts about Clinton that make it the case that if\nthere existed propositions, then it would be true that he believes\nthat snow is white.\n",
    "section_title": "4.2 Propositions",
    "entry_title": "Platonism in Metaphysics",
    "hierarchy_title": "Platonism in Metaphysics || The Singular Term Argument || Propositions",
    "tokenized_text": [
        "singular",
        "term",
        "argument",
        "proposition",
        "proposition",
        "turn",
        "version",
        "singular",
        "term",
        "argument",
        "aimed",
        "establishing",
        "existence",
        "proposition",
        "important",
        "figure",
        "development",
        "argument",
        "frege",
        "relevant",
        "figure",
        "would",
        "nt",
        "endorse",
        "argument",
        "like",
        "one",
        "sketched",
        "include",
        "russell",
        "church",
        "quine",
        "kaplan",
        "kripke",
        "schiffer",
        "perry",
        "evans",
        "peacocke",
        "barwise",
        "perry",
        "bealer",
        "zalta",
        "katz",
        "salmon",
        "soames",
        "forbes",
        "crimmins",
        "perry",
        "richard",
        "crimmins",
        "recanati",
        "king",
        "braun",
        "saul",
        "relevant",
        "sentence",
        "belief",
        "ascription",
        "ie",
        "sentence",
        "like",
        "clinton",
        "belief",
        "snow",
        "white",
        "emily",
        "belief",
        "santa",
        "claus",
        "fat",
        "first",
        "point",
        "note",
        "sentence",
        "involve",
        "clauses",
        "clause",
        "simply",
        "word",
        "added",
        "front",
        "complete",
        "sentence",
        "eg",
        "snow",
        "white",
        "second",
        "point",
        "made",
        "clauses",
        "english",
        "singular",
        "term",
        "common",
        "way",
        "illustrate",
        "point",
        "see",
        "eg",
        "bealer",
        "schiffer",
        "appeal",
        "argument",
        "like",
        "following",
        "i",
        "clinton",
        "belief",
        "snow",
        "white",
        "therefore",
        "clinton",
        "belief",
        "something",
        "namely",
        "snow",
        "white",
        "argument",
        "seems",
        "valid",
        "platonist",
        "claim",
        "best",
        "tenable",
        "explanation",
        "fact",
        "involves",
        "commitment",
        "idea",
        "clause",
        "argument",
        "ie",
        "snow",
        "white",
        "singular",
        "term",
        "clauses",
        "singular",
        "term",
        "sort",
        "object",
        "refer",
        "well",
        "might",
        "seem",
        "refer",
        "fact",
        "state",
        "affair",
        "instance",
        "might",
        "seem",
        "snow",
        "white",
        "refers",
        "fact",
        "snow",
        "white",
        "however",
        "mistake",
        "least",
        "connection",
        "clauses",
        "appear",
        "belief",
        "report",
        "since",
        "belief",
        "false",
        "follows",
        "clauses",
        "belief",
        "report",
        "refer",
        "thing",
        "false",
        "eg",
        "sammy",
        "seven",
        "year",
        "old",
        "sentence",
        "sammy",
        "belief",
        "snow",
        "powdered",
        "sugar",
        "could",
        "true",
        "sentence",
        "true",
        "criterion",
        "ontological",
        "commitment",
        "clause",
        "refers",
        "real",
        "object",
        "refer",
        "fact",
        "obviously",
        "thing",
        "fact",
        "snow",
        "powdered",
        "sugar",
        "consideration",
        "suggest",
        "referent",
        "clauses",
        "appear",
        "belief",
        "ascription",
        "thing",
        "true",
        "false",
        "right",
        "seems",
        "object",
        "belief",
        "must",
        "either",
        "sentence",
        "proposition",
        "standard",
        "platonist",
        "view",
        "proposition",
        "consider",
        "argument",
        "claim",
        "need",
        "say",
        "word",
        "different",
        "kind",
        "sentential",
        "view",
        "one",
        "might",
        "endorse",
        "begin",
        "need",
        "distinguish",
        "sentence",
        "type",
        "sentence",
        "token",
        "appreciate",
        "difference",
        "consider",
        "following",
        "indented",
        "sentence",
        "cat",
        "cute",
        "cat",
        "cute",
        "two",
        "different",
        "token",
        "single",
        "sentence",
        "type",
        "thus",
        "token",
        "actual",
        "physical",
        "thing",
        "located",
        "specific",
        "place",
        "spacetime",
        "pile",
        "ink",
        "page",
        "structured",
        "appropriate",
        "way",
        "sound",
        "wave",
        "collection",
        "pixel",
        "computer",
        "screen",
        "something",
        "sort",
        "type",
        "hand",
        "tokened",
        "numerous",
        "time",
        "identical",
        "single",
        "token",
        "thus",
        "sentence",
        "type",
        "abstract",
        "object",
        "looking",
        "antiplatonist",
        "view",
        "clauses",
        "refer",
        "belief",
        "report",
        "say",
        "re",
        "sentence",
        "type",
        "say",
        "re",
        "sentence",
        "token",
        "second",
        "distinction",
        "need",
        "drawn",
        "sentence",
        "token",
        "external",
        "public",
        "sentence",
        "token",
        "internal",
        "private",
        "example",
        "external",
        "sentence",
        "token",
        "given",
        "last",
        "paragraph",
        "pile",
        "ink",
        "sound",
        "wave",
        "internal",
        "sentence",
        "token",
        "hand",
        "exists",
        "inside",
        "particular",
        "person",
        "s",
        "head",
        "widespread",
        "view",
        "due",
        "mainly",
        "jerry",
        "fodor",
        "adopted",
        "many",
        "others",
        "eg",
        "stich",
        "able",
        "perform",
        "cognitive",
        "task",
        "eg",
        "think",
        "remember",
        "information",
        "belief",
        "capable",
        "storing",
        "information",
        "head",
        "neural",
        "language",
        "often",
        "called",
        "mentalese",
        "language",
        "thought",
        "connection",
        "belief",
        "idea",
        "believe",
        "say",
        "snow",
        "white",
        "neural",
        "sentence",
        "stored",
        "head",
        "belief",
        "way",
        "opposed",
        "desire",
        "way",
        "way",
        "mean",
        "mentalese",
        "snow",
        "white",
        "give",
        "u",
        "two",
        "different",
        "antiplatonist",
        "alternative",
        "view",
        "belief",
        "report",
        "involve",
        "reference",
        "proposition",
        "first",
        "conceptualistic",
        "mentalistic",
        "view",
        "belief",
        "report",
        "involve",
        "reference",
        "sentence",
        "head",
        "mentalese",
        "sentence",
        "token",
        "second",
        "physicalistic",
        "view",
        "belief",
        "report",
        "involve",
        "reference",
        "external",
        "sentence",
        "token",
        "ie",
        "pile",
        "ink",
        "version",
        "view",
        "endorsed",
        "carnap",
        "davidson",
        "leeds",
        "number",
        "argument",
        "suggest",
        "ordinary",
        "belief",
        "report",
        "taken",
        "internal",
        "external",
        "sentence",
        "take",
        "proposition",
        "rehearse",
        "one",
        "argument",
        "argument",
        "go",
        "back",
        "least",
        "church",
        "suppose",
        "boris",
        "jerry",
        "live",
        "cold",
        "climate",
        "familiar",
        "snow",
        "thus",
        "believe",
        "snow",
        "white",
        "boris",
        "life",
        "russia",
        "speaks",
        "russian",
        "whereas",
        "jerry",
        "life",
        "minnesota",
        "speaks",
        "english",
        "consider",
        "following",
        "argument",
        "ii",
        "boris",
        "belief",
        "snow",
        "white",
        "jerry",
        "belief",
        "snow",
        "white",
        "therefore",
        "s",
        "least",
        "one",
        "thing",
        "boris",
        "jerry",
        "believe",
        "namely",
        "snow",
        "white",
        "argument",
        "seems",
        "clearly",
        "valid",
        "seems",
        "rule",
        "idea",
        "belief",
        "report",
        "sentence",
        "token",
        "order",
        "account",
        "validity",
        "argument",
        "take",
        "two",
        "clauses",
        "refer",
        "thing",
        "b",
        "sentence",
        "token",
        "could",
        "refer",
        "first",
        "could",
        "nt",
        "refer",
        "external",
        "sentence",
        "token",
        "matter",
        "sentence",
        "type",
        "associated",
        "natural",
        "language",
        "first",
        "clause",
        "refers",
        "sentence",
        "would",
        "presumably",
        "russian",
        "sentence",
        "since",
        "boris",
        "speaks",
        "russian",
        "ii",
        "second",
        "clause",
        "refers",
        "sentence",
        "would",
        "presumably",
        "english",
        "sentence",
        "since",
        "jerry",
        "speaks",
        "english",
        "iii",
        "two",
        "clauses",
        "refer",
        "external",
        "sentence",
        "token",
        "naturallanguage",
        "sentence",
        "type",
        "second",
        "refer",
        "mentalese",
        "sentence",
        "token",
        "first",
        "clause",
        "refers",
        "sentence",
        "would",
        "presumably",
        "boris",
        "s",
        "head",
        "ii",
        "second",
        "clause",
        "refers",
        "sentence",
        "would",
        "presumably",
        "jerry",
        "s",
        "head",
        "iii",
        "two",
        "clauses",
        "refer",
        "mentalese",
        "sentence",
        "token",
        "therefore",
        "seems",
        "follow",
        "clauses",
        "argument",
        "refer",
        "sentence",
        "token",
        "kind",
        "since",
        "ordinary",
        "belief",
        "ascription",
        "follows",
        "general",
        "clauses",
        "appear",
        "ordinary",
        "belief",
        "ascription",
        "refer",
        "sentence",
        "token",
        "s",
        "formulated",
        "argument",
        "nt",
        "rule",
        "view",
        "clauses",
        "refer",
        "mentalese",
        "sentence",
        "type",
        "argument",
        "extended",
        "rule",
        "view",
        "well",
        "eg",
        "one",
        "might",
        "talking",
        "american",
        "russian",
        "two",
        "creature",
        "different",
        "internal",
        "language",
        "thought",
        "wo",
        "nt",
        "run",
        "detail",
        "since",
        "ve",
        "seen",
        "antiplatonists",
        "ca",
        "nt",
        "claim",
        "clauses",
        "refer",
        "type",
        "anyway",
        "type",
        "abstract",
        "object",
        "assume",
        "version",
        "argument",
        "cogent",
        "well",
        "follows",
        "clauses",
        "nt",
        "refer",
        "sentence",
        "kind",
        "hence",
        "must",
        "refer",
        "proposition",
        "notice",
        "issue",
        "far",
        "purely",
        "semantic",
        "argument",
        "suggests",
        "regardless",
        "whether",
        "thing",
        "proposition",
        "clauses",
        "best",
        "interpreted",
        "purporting",
        "refer",
        "object",
        "platonist",
        "claim",
        "correct",
        "must",
        "thing",
        "proposition",
        "clearly",
        "many",
        "belief",
        "ascription",
        "true",
        "instance",
        "clinton",
        "belief",
        "snow",
        "white",
        "true",
        "thus",
        "analysis",
        "clauses",
        "correct",
        "criterion",
        "ontological",
        "commitment",
        "correct",
        "follows",
        "thing",
        "proposition",
        "snow",
        "white",
        "version",
        "singular",
        "term",
        "argument",
        "might",
        "seem",
        "even",
        "powerful",
        "mathematicalobject",
        "version",
        "singular",
        "term",
        "argument",
        "sketched",
        "section",
        "case",
        "nt",
        "seem",
        "much",
        "room",
        "paraphrase",
        "nominalism",
        "saw",
        "section",
        "number",
        "program",
        "paraphrasing",
        "statement",
        "mathematics",
        "obvious",
        "strategy",
        "paraphrasing",
        "ordinary",
        "belief",
        "ascription",
        "one",
        "might",
        "think",
        "could",
        "done",
        "taking",
        "sentence",
        "form",
        "belief",
        "p",
        "mean",
        "existed",
        "proposition",
        "would",
        "believe",
        "p",
        "sort",
        "view",
        "even",
        "le",
        "plausible",
        "mathematical",
        "case",
        "wildly",
        "implausible",
        "suppose",
        "common",
        "folk",
        "say",
        "thing",
        "like",
        "clinton",
        "belief",
        "presidency",
        "successful",
        "mean",
        "making",
        "hypothetical",
        "claim",
        "person",
        "question",
        "would",
        "believe",
        "alternate",
        "situation",
        "however",
        "paraphrase",
        "nominalism",
        "seems",
        "hopeless",
        "case",
        "proposition",
        "balaguer",
        "b",
        "argued",
        "fictionalistic",
        "nominalism",
        "carry",
        "well",
        "case",
        "proposition",
        "specifically",
        "fictionalists",
        "say",
        "clinton",
        "belief",
        "snow",
        "white",
        "strictly",
        "speaking",
        "true",
        "clause",
        "supposed",
        "refer",
        "proposition",
        "thing",
        "proposition",
        "still",
        "use",
        "say",
        "something",
        "essentially",
        "accurate",
        "clinton",
        "s",
        "belief",
        "state",
        "fact",
        "clinton",
        "make",
        "case",
        "existed",
        "proposition",
        "would",
        "true",
        "belief",
        "snow",
        "white"
    ]
}