{
    "main_text": "Love and the Ascent to the Beautiful\n4. Love and the Ascent to the Beautiful\n\nSocrates is adept at some parts of the art of love but cannot take his\nbeloveds all the way. So he is clearly in need of further instruction\nin the art of love. In the Symposium, this is provided to him\nby Diotima, whom he describes as “the one who taught me the art\nof love” (201d5). And what she teaches him, in a nutshell, is\nPlatonism. What the elenchus needs if it is to satisfy rather than\nfrustrate love, in other words, is the theory of Platonic Forms. What\nSocrates needs—and so ought to love—is Plato! The story of\nPlatonic love is, one might say, the story of the Platonizing of\nSocrates.\n\nIf what Socrates learned from Diotima was about all love, however, it\nwould be refuted by the very fact of Alcibiades, whose love for\nSocrates has not led him to love the beautiful itself. It would be\nequally refuted, indeed, by all the other symposiasts, none of whom\nhas been led there by his love. But Diotima’s love story is not\nso general. It is self-advertised as a story about “loving boys\ncorrectly (to orthôs paiderastein)”\n(211b5–6)—as a lesson in “the correct way to go or\nto be led by another to the art of love” (211b7-c1). To be sure,\nit doesn’t itself explicitly provide us with a story about how\nErôs can act as a force which retards development. But\nthat isn’t because Plato thought Erôs could not\nact as such a force—consider Alcibiades. Rather, it is because\nDiotima’s story is a story about successful or correct love.\n\nThe credibility of Diotima’s love story is another matter, of\ncourse. To many, it has seemed both incredible and distasteful,\nbecause it seems to say that beautiful individuals have only\ninstrumental value. When one has climbed the ladder, of which they are\nmerely the first rung, one should kick it—and them—away.\nBut is this message really Diotima’s?\n\nWhat we all love, according to Diotima, is the good—that is to\nsay, we want good things to be ours forever. But because we are\nmortal, the closest we can come to satisfying this desire is to\ninitiate an endless cycle of reproduction in which each new generation\nhas good things. We achieve this, in a famous phrase, by “giving\nbirth in beauty (tokos en kalô)” (206b7–8,\ne5). What does this mean? Like Athenian paiderasteia, Diotima\nrecognizes two fundamentally different kinds of love, two\nfundamentally different varieties of the desire to give birth in\nbeauty. In the case of heterosexual lovers, who are “pregnant in\nbody,” such giving birth consists in producing children who\nresemble, and so share in the beauty of their parents (209a3–4).\nHomosexual lovers, however, are a different story. What they give\nbirth to is “wisdom and the rest of virtue” (209b8). When\na man who is pregnant in soul finds a beautiful boy, Diotima says, it\n“makes him instantly teem with accounts of virtue”\n(209b8), or “beautiful accounts” (210a8). Giving birth to\nvirtue and giving birth to accounts of it are obviously different. But\nsome of the other phrases Diotima uses show us how to mitigate the\ndifference. For what homosexual lovers want is to give birth to\naccounts of virtue of a particular sort—ones that can be used in\n“the proper ordering of cities and households”\n(209a6–7), and so can “make young men better”\n(210c1–3).\n\nIf the lover’s accounts are to achieve this goal, however, they\nmustn’t be the product of distorting fantasy, as Nietzsche\nthinks so many of our moral concepts are and as some feminists think\nour concept of romantic love itself is. What is intended to insure\nthat they will not is their openness to reality—an openness\nguaranteed by the fact that in the course of his ascent the lover must\nstudy the beauty of ways of life and laws (210c3–5) and the\nbeauty of the sciences (c6–7). What he gains from these studies\nare the conceptual resources needed to see the world, including the\nhuman world, aright—to gain knowledge of it. This is not the\nproject an analysand takes up in psychoanalysis. Nor is it the one\nthat we less formally undertake when we reflect on our own love\nstories in hopes of understanding them (often a project provoked alas\nby an unhappy ending). It is instead the project of philosophy, as\nPlato conceives of it. That is why it culminates in “the birth\nof many gloriously beautiful accounts and theories in unstinting love\nof wisdom (philosophia)” (210d5–6). Yet the\ngrander project intersects with the analysand’s project and with\nours in an interesting way. The terms or concepts we use to tell our\nlove stories must themselves be coherent if the stories we use them to\ntell are themselves to be coherently livable.\n\nIn Plato’s view, this means that they must be the concepts the\ntrue lover uses once he has seen the beautiful itself—the\nconcepts whose ontological correlates are forms. If they are not, they\nwill be incoherent and the lover who employs them will find himself\nembroiled in a love story he does not understand, a love story whose\nincoherence the elenchus, or psychoanalysis, or just plain critical\nscrutiny will reveal. It is this incoherence, indeed, encountered at\nlower stages in the ascent, that leads the correct lover, under\npressure from his rational desire for truth and consistency, and the\npain of inconsistency, to climb to the next stage.\n\nWe can see Diotima, then, not only as revealing the other more\nabstract loves that a true lover of boys must have, but also as\nexploring the conditions concepts must meet if they are to figure in\ngenuinely coherent love stories. Her story isn’t about a lover\nwho abandons the individual boys he loves, but about someone who comes\nto love boys successfully by coming to love something else as\nwell.\n\nLike Diotima herself, we have been concentrating on what other things\na lover is led to love by his love for his beloved boy. We have said\nnothing about the changes explorations in this enlarged erotic field\neffect in the desires and feelings of the lover himself. But these,\ntoo, help us to see what happens to his love for his boy in the course\nof his explorations. What hooks the lover to begin with is love for a\nparticular body: “First, if the Leader leads aright, he should\nlove one body and beget beautiful accounts there”\n(210a6–8). At this stage, what the boy engages in the lover is\nhis sexual desire for physical beauty, albeit one which, in firm\nkeeping with the norms of Athenian paiderastia, is supposedly\naim-inhibited: instead of sexual intercourse, it leads to discussions\nabout beauty and to accounts of it. Here the beauty at issue is, in\nthe first instance, the boy who represents beauty itself to the\nlover. That is why, when the lover finally comes to see the\nbeautiful itself, “beauty will no longer seem to you to be\nmeasured by gold or raiment or beautiful boys or youths, which now you\nlook upon dumbstruck” (211d3–5). One effect of generating\naccounts of this beauty, however, is that the lover comes to\nsee his beloved’s beautiful body as one among many: if it is\nbeautiful, so are any other bodies the accounts fit. And this\ninitially cognitive discovery leads to a conative change:\n“Realizing this he is established as a lover of all beautiful\nbodies and relaxes this excessive preoccupation with one, thinking\nless of it and believing it to be a small matter”\n(210b4–6).\n\nIt is important in reading Diotima’s description of this change\nthat we see it as comparative and contrastive: the lover used to\novervalue his beloved (211d5–8, quoted below)—now\nhe values him appropriately. But valuing appropriately is\nstill valuing. The boy is still included in the class of beautiful\nbodies the lover now loves. It is also important to notice that\ncognitive and conative change are going hand-in-hand. To recognize\nthat his beloved is one among many, the lover’s love for him has\nto change. And that means that psychological resources within the\nlover—beyond his sexual responsiveness to physical\nbeauty—are coming into play. More of the lover is now involved\nin his love. Hence what his beloved might be thought to lose in\nexclusivity he gains in richness—and no doubt in endurance and\nreliability—of response. When his physical bloom fades, he will\nnow still be loved.\n\nBut love that is to escape frustration cannot stop with bodies. The\nattempt to formulate an account of love free from puzzles and immune\nto elenctic refutation must lead on from beautiful bodies to beautiful\nsouls, and so to the beautiful laws and practices that will improve\nsouls and make young men better. Again this cognitive achievement is\nmatched by a conative one. When the lover sees that all these\nbeautiful things are somehow akin in the beauty, he comes to think\nthat “bodily beauty is a small thing” (210c5–6), and\nso, as before, becomes less obsessed with it.\n\nAt the top of the scala amoris lies the beautiful itself, the\nfirst loved object that—like the “primary object of love”\n(prôton philon) in the Lysis\n(219d2-e4)—is not in any way gone beyond. Here, it seems, the\nlover at last finds something worthy of the obsessive attention he had\nonce lavished on his beloved boy (211d8–212a7). Nonetheless,\nobsession is out of place even here. For the beautiful itself can no\nmore satisfy the lover’s desires to eat and drink than his\nbeloved can. Here—as there—what he would do if it were\npossible must not be confused with what he can and does do. After all,\nthe lover himself cannot become immortal except by giving birth in the\nbeauty he has at last found. He does that, however, precisely by\narranging for his beloved to grow up, become truly virtuous, and be\nwith him in the contemplation of—and, to the extent that it is\npossible, the possession of—true beauty.\n",
    "section_title": "4. Love and the Ascent to the Beautiful",
    "entry_title": "Plato on Friendship and Eros",
    "hierarchy_title": "Plato on Friendship and Eros || Love and the Ascent to the Beautiful",
    "tokenized_text": [
        "love",
        "ascent",
        "beautiful",
        "love",
        "ascent",
        "beautiful",
        "socrates",
        "adept",
        "part",
        "art",
        "love",
        "take",
        "beloved",
        "way",
        "clearly",
        "need",
        "instruction",
        "art",
        "love",
        "symposium",
        "provided",
        "diotima",
        "describes",
        "one",
        "taught",
        "art",
        "love",
        "d",
        "teach",
        "nutshell",
        "platonism",
        "elenchus",
        "need",
        "satisfy",
        "rather",
        "frustrate",
        "love",
        "word",
        "theory",
        "platonic",
        "form",
        "socrates",
        "needsand",
        "ought",
        "loveis",
        "plato",
        "story",
        "platonic",
        "love",
        "one",
        "might",
        "say",
        "story",
        "platonizing",
        "socrates",
        "socrates",
        "learned",
        "diotima",
        "love",
        "however",
        "would",
        "refuted",
        "fact",
        "alcibiades",
        "whose",
        "love",
        "socrates",
        "led",
        "love",
        "beautiful",
        "would",
        "equally",
        "refuted",
        "indeed",
        "symposiast",
        "none",
        "led",
        "love",
        "diotima",
        "love",
        "story",
        "general",
        "selfadvertised",
        "story",
        "loving",
        "boy",
        "correctly",
        "orthôs",
        "paiderastein",
        "b",
        "as",
        "lesson",
        "correct",
        "way",
        "go",
        "led",
        "another",
        "art",
        "love",
        "bc",
        "sure",
        "explicitly",
        "provide",
        "u",
        "story",
        "erôs",
        "act",
        "force",
        "retard",
        "development",
        "plato",
        "thought",
        "erôs",
        "could",
        "act",
        "forceconsider",
        "alcibiades",
        "rather",
        "diotima",
        "story",
        "story",
        "successful",
        "correct",
        "love",
        "credibility",
        "diotima",
        "love",
        "story",
        "another",
        "matter",
        "course",
        "many",
        "seemed",
        "incredible",
        "distasteful",
        "seems",
        "say",
        "beautiful",
        "individual",
        "instrumental",
        "value",
        "one",
        "climbed",
        "ladder",
        "merely",
        "first",
        "rung",
        "one",
        "kick",
        "itand",
        "themaway",
        "message",
        "really",
        "diotima",
        "love",
        "according",
        "diotima",
        "goodthat",
        "say",
        "want",
        "good",
        "thing",
        "forever",
        "mortal",
        "closest",
        "come",
        "satisfying",
        "desire",
        "initiate",
        "endless",
        "cycle",
        "reproduction",
        "new",
        "generation",
        "good",
        "thing",
        "achieve",
        "famous",
        "phrase",
        "giving",
        "birth",
        "beauty",
        "tokos",
        "en",
        "kalô",
        "b",
        "e",
        "mean",
        "like",
        "athenian",
        "paiderasteia",
        "diotima",
        "recognizes",
        "two",
        "fundamentally",
        "different",
        "kind",
        "love",
        "two",
        "fundamentally",
        "different",
        "variety",
        "desire",
        "give",
        "birth",
        "beauty",
        "case",
        "heterosexual",
        "lover",
        "pregnant",
        "body",
        "giving",
        "birth",
        "consists",
        "producing",
        "child",
        "resemble",
        "share",
        "beauty",
        "parent",
        "a",
        "homosexual",
        "lover",
        "however",
        "different",
        "story",
        "give",
        "birth",
        "wisdom",
        "rest",
        "virtue",
        "b",
        "man",
        "pregnant",
        "soul",
        "find",
        "beautiful",
        "boy",
        "diotima",
        "say",
        "make",
        "instantly",
        "teem",
        "account",
        "virtue",
        "b",
        "beautiful",
        "account",
        "a",
        "giving",
        "birth",
        "virtue",
        "giving",
        "birth",
        "account",
        "obviously",
        "different",
        "phrase",
        "diotima",
        "us",
        "show",
        "u",
        "mitigate",
        "difference",
        "homosexual",
        "lover",
        "want",
        "give",
        "birth",
        "account",
        "virtue",
        "particular",
        "sortones",
        "used",
        "proper",
        "ordering",
        "city",
        "household",
        "a",
        "make",
        "young",
        "men",
        "better",
        "c",
        "lover",
        "account",
        "achieve",
        "goal",
        "however",
        "product",
        "distorting",
        "fantasy",
        "nietzsche",
        "think",
        "many",
        "moral",
        "concept",
        "feminist",
        "think",
        "concept",
        "romantic",
        "love",
        "intended",
        "insure",
        "openness",
        "realityan",
        "openness",
        "guaranteed",
        "fact",
        "course",
        "ascent",
        "lover",
        "must",
        "study",
        "beauty",
        "way",
        "life",
        "law",
        "c",
        "beauty",
        "science",
        "c",
        "gain",
        "study",
        "conceptual",
        "resource",
        "needed",
        "see",
        "world",
        "including",
        "human",
        "world",
        "arightto",
        "gain",
        "knowledge",
        "project",
        "analysand",
        "take",
        "psychoanalysis",
        "one",
        "le",
        "formally",
        "undertake",
        "reflect",
        "love",
        "story",
        "hope",
        "understanding",
        "often",
        "project",
        "provoked",
        "ala",
        "unhappy",
        "ending",
        "instead",
        "project",
        "philosophy",
        "plato",
        "conceives",
        "culminates",
        "birth",
        "many",
        "gloriously",
        "beautiful",
        "account",
        "theory",
        "unstinting",
        "love",
        "wisdom",
        "philosophia",
        "d",
        "yet",
        "grander",
        "project",
        "intersects",
        "analysand",
        "project",
        "interesting",
        "way",
        "term",
        "concept",
        "use",
        "tell",
        "love",
        "story",
        "must",
        "coherent",
        "story",
        "use",
        "tell",
        "coherently",
        "livable",
        "plato",
        "view",
        "mean",
        "must",
        "concept",
        "true",
        "lover",
        "us",
        "seen",
        "beautiful",
        "itselfthe",
        "concept",
        "whose",
        "ontological",
        "correlate",
        "form",
        "incoherent",
        "lover",
        "employ",
        "find",
        "embroiled",
        "love",
        "story",
        "understand",
        "love",
        "story",
        "whose",
        "incoherence",
        "elenchus",
        "psychoanalysis",
        "plain",
        "critical",
        "scrutiny",
        "reveal",
        "incoherence",
        "indeed",
        "encountered",
        "lower",
        "stage",
        "ascent",
        "lead",
        "correct",
        "lover",
        "pressure",
        "rational",
        "desire",
        "truth",
        "consistency",
        "pain",
        "inconsistency",
        "climb",
        "next",
        "stage",
        "see",
        "diotima",
        "revealing",
        "abstract",
        "love",
        "true",
        "lover",
        "boy",
        "must",
        "also",
        "exploring",
        "condition",
        "concept",
        "must",
        "meet",
        "figure",
        "genuinely",
        "coherent",
        "love",
        "story",
        "story",
        "lover",
        "abandon",
        "individual",
        "boy",
        "love",
        "someone",
        "come",
        "love",
        "boy",
        "successfully",
        "coming",
        "love",
        "something",
        "else",
        "well",
        "like",
        "diotima",
        "concentrating",
        "thing",
        "lover",
        "led",
        "love",
        "love",
        "beloved",
        "boy",
        "said",
        "nothing",
        "change",
        "exploration",
        "enlarged",
        "erotic",
        "field",
        "effect",
        "desire",
        "feeling",
        "lover",
        "help",
        "u",
        "see",
        "happens",
        "love",
        "boy",
        "course",
        "exploration",
        "hook",
        "lover",
        "begin",
        "love",
        "particular",
        "body",
        "first",
        "leader",
        "lead",
        "aright",
        "love",
        "one",
        "body",
        "beget",
        "beautiful",
        "account",
        "a",
        "stage",
        "boy",
        "engages",
        "lover",
        "sexual",
        "desire",
        "physical",
        "beauty",
        "albeit",
        "one",
        "firm",
        "keeping",
        "norm",
        "athenian",
        "paiderastia",
        "supposedly",
        "aiminhibited",
        "instead",
        "sexual",
        "intercourse",
        "lead",
        "discussion",
        "beauty",
        "account",
        "beauty",
        "issue",
        "first",
        "instance",
        "boy",
        "represents",
        "beauty",
        "lover",
        "lover",
        "finally",
        "come",
        "see",
        "beautiful",
        "beauty",
        "longer",
        "seem",
        "measured",
        "gold",
        "raiment",
        "beautiful",
        "boy",
        "youth",
        "look",
        "upon",
        "dumbstruck",
        "d",
        "one",
        "effect",
        "generating",
        "account",
        "beauty",
        "however",
        "lover",
        "come",
        "see",
        "beloved",
        "beautiful",
        "body",
        "one",
        "among",
        "many",
        "beautiful",
        "body",
        "account",
        "fit",
        "initially",
        "cognitive",
        "discovery",
        "lead",
        "conative",
        "change",
        "realizing",
        "established",
        "lover",
        "beautiful",
        "body",
        "relaxes",
        "excessive",
        "preoccupation",
        "one",
        "thinking",
        "le",
        "believing",
        "small",
        "matter",
        "b",
        "important",
        "reading",
        "diotima",
        "description",
        "change",
        "see",
        "comparative",
        "contrastive",
        "lover",
        "used",
        "overvalue",
        "beloved",
        "d",
        "quoted",
        "now",
        "value",
        "appropriately",
        "valuing",
        "appropriately",
        "still",
        "valuing",
        "boy",
        "still",
        "included",
        "class",
        "beautiful",
        "body",
        "lover",
        "love",
        "also",
        "important",
        "notice",
        "cognitive",
        "conative",
        "change",
        "going",
        "handinhand",
        "recognize",
        "beloved",
        "one",
        "among",
        "many",
        "lover",
        "love",
        "change",
        "mean",
        "psychological",
        "resource",
        "within",
        "loverbeyond",
        "sexual",
        "responsiveness",
        "physical",
        "beautyare",
        "coming",
        "play",
        "lover",
        "involved",
        "love",
        "hence",
        "beloved",
        "might",
        "thought",
        "lose",
        "exclusivity",
        "gain",
        "richnessand",
        "doubt",
        "endurance",
        "reliabilityof",
        "response",
        "physical",
        "bloom",
        "fade",
        "still",
        "loved",
        "love",
        "escape",
        "frustration",
        "stop",
        "body",
        "attempt",
        "formulate",
        "account",
        "love",
        "free",
        "puzzle",
        "immune",
        "elenctic",
        "refutation",
        "must",
        "lead",
        "beautiful",
        "body",
        "beautiful",
        "soul",
        "beautiful",
        "law",
        "practice",
        "improve",
        "soul",
        "make",
        "young",
        "men",
        "better",
        "cognitive",
        "achievement",
        "matched",
        "conative",
        "one",
        "lover",
        "see",
        "beautiful",
        "thing",
        "somehow",
        "akin",
        "beauty",
        "come",
        "think",
        "bodily",
        "beauty",
        "small",
        "thing",
        "c",
        "becomes",
        "le",
        "obsessed",
        "top",
        "scala",
        "amoris",
        "lie",
        "beautiful",
        "first",
        "loved",
        "object",
        "thatlike",
        "primary",
        "object",
        "love",
        "prôton",
        "philon",
        "lysis",
        "de",
        "is",
        "way",
        "gone",
        "beyond",
        "seems",
        "lover",
        "last",
        "find",
        "something",
        "worthy",
        "obsessive",
        "attention",
        "lavished",
        "beloved",
        "boy",
        "da",
        "nonetheless",
        "obsession",
        "place",
        "even",
        "beautiful",
        "satisfy",
        "lover",
        "desire",
        "eat",
        "drink",
        "beloved",
        "hereas",
        "therewhat",
        "would",
        "possible",
        "must",
        "confused",
        "lover",
        "become",
        "immortal",
        "except",
        "giving",
        "birth",
        "beauty",
        "last",
        "found",
        "however",
        "precisely",
        "arranging",
        "beloved",
        "grow",
        "become",
        "truly",
        "virtuous",
        "contemplation",
        "ofand",
        "extent",
        "possible",
        "possession",
        "oftrue",
        "beauty"
    ]
}