{
    "main_text": "Introduction\n1. Introduction\n\nA good poem helps to change the shape and significance of the universe,\nhelps to extend everyone’s knowledge of himself and the world around him\n—Dylan\n Thomas[1]\n\n\nWhen we think of a philosophical analysis of poetry, something like a\ntreatise on aesthetics comes to mind. At a minimum, we would expect a\nrigorous examination of the following: the characteristics that define\npoetry; the differences between kinds of poetry (epic, tragic, lyric,\ncomic, and so forth); and the senses in which poetry is and is not\nbound to representation, imitation, expression (which are possible\nmeanings of the classical Greek word “mimesis”) and\n fiction.[2]\n These complicated terms themselves require careful definition.\nEqually rigorous and systematic remarks about the differences between\npoetry and other art forms, such as music and painting, would be in\norder, as would reflection on the relation between orally delivered\npoetry (indeed, if we are to include performance, poetry that is in\none way or another enacted) and poetry communicated through the\nwritten word. Aristotle’s Poetics is an early, and now\nclassic, philosophical exploration of poetry along these sorts of\nlines.\n\nPlato’s extensive discussions of poetry frustrate these expectations.\nHe did not write a treatise on the subject—indeed, he wrote no\ntreatises, and confined his thought to “dramatic”\ndialogues that are themselves shaped poetically—and the remarks\nhe offers us both meander unsystematically, even within a single\ndialogue, and branch off in what seem like strange directions, such as\ninto discussions about the corruption of self to which poetry\nallegedly exposes its audience. And yet Plato clearly thought that\nsomething of enormous importance hangs on his assessment of poetry,\nsomething that goes significantly beyond getting the details of the\nsubject pinned down in a philosophically respectable fashion. One of\nthe most famous lines in the culminating sections of one of his most\nfamous dialogues announces that “there is an old quarrel between\nphilosophy and poetry” (Rep. 607b5–6), in support\nof which Plato quotes bits of several obscure but furious\npolemics—presumably directed by poets against\nphilosophers—such as the accusation that the opponent is a\n“yelping bitch shrieking at her master” and “great\nin the empty eloquence of fools”.\n [3]\n Indeed, much of the final book of the Republic is an attack\non poetry, and there is no question but that a quarrel between\nphilosophy and poetry is a continuing theme throughout Plato’s\ncorpus.\n\nThe scope of the quarrel, especially in the Republic, also\nindicates that for Plato what is at stake is a clash between what we\nmight call comprehensive world-views; it seems that matters of grave\nimportance in ethics, politics, metaphysics, theology, and\nepistemology are at stake. He leads up to the famous line about the\nquarrel by identifying the addressees of his critique as the\n“praisers of Homer who say that this poet educated Greece, and\nthat in the management and education of human affairs it is worthwhile\nto take him up for study and for living, by arranging one’s whole life\naccording to this poet” (606e1–5). The praisers of Homer\ntreat him as the font of wisdom. Plato agrees that Homer is indeed the\neducator of Greece, and immediately adds that Homer is “the most\npoetic and first of the tragic poets.”  Plato is setting\nhimself against what he takes to be the entire outlook—in\ncontemporary but not Plato’s parlance, the entire “philosophy of\nlife”—he believes Homer and his followers have\nsuccessfully propagated. And since Homer shaped the popular culture of\nthe times, Plato is setting himself against popular culture as he knew\nit. Not just that: the quarrel is not simply between philosophy and\nHomer, but philosophy and poetry. Plato has in his sights all of\n“poetry,” contending that its influence is pervasive and\noften harmful, and that its premises about nature and the divine are\nmistaken. He is addressing not just fans of Homer but fans of the sort\nof thing that Homer does and conveys. The critique is presented as a\ntrans-historical one. It seems that Plato was the first to articulate\nthe quarrel in so sweeping a\n fashion.[4] \n It is noteworthy that in the Apology (23e), Socrates’\naccusers are said to include the poets, whose cause Meletus\nrepresents.\n\nIt is not easy to understand what Plato means by poetry, why it is an\nopponent, whether it is dangerous because of its form or content or\nboth, and whether there is much of ongoing interest or relevance in\nhis account. Would his critique apply to, say, Shakespeare’s\ntragedies? To E. E. Cummings’ or T. S. Eliot’s poetry? These questions\nare complicated by the fact that Plato was not (or, not primarily)\nthinking of poetry as a written text read in silence; he had in mind\nrecitations or performances, often experienced in the context of\ntheater. Still further, when Socrates and Plato conducted their\ninquiries, poetry was far more influential than what Plato calls\n“philosophy.” Given the resounding success of Plato’s\nadvocacy of “philosophy,” it is very easy to forget that\nat the time he was advocating a (historically) new project in a\ncontext swirling with controversy about the relative value of such\nprojects (and indeed about what “philosophy” means). By\ncontrast, poetry seems relatively marginal in today’s large commercial\nand liberal societies, in spite of the energetic efforts of figures\nsuch as the recent American national Poet Laureate Robert Pinsky,\nwhereas media of which Plato knew nothing—such as television,\nvideos, and the cinema, literary forms such as the novel, and\ninformation systems such as the World Wide Web—exercise\ntremendous influence. Television and movie actors enjoy a degree of\nstatus and wealth in modern society that transcends anything known in\nthe ancient world. Is Plato’s critique marginalized along with\npoetry?\n\nIn spite of the harshness, and in some ways the bluntness of Plato’s\ncritique of poetry, he not only put his finger on deep issues of\nongoing interest, but also leavened his polemic in a number of\nintriguing and subtle ways—most obviously, by writing philosophy\nin a way that can, with proper qualifications, itself be called\npoetic. The “quarrel between philosophy and poetry” is\njustly famed and pondered: what is it about?\n\nWhen we turn to the second theme under consideration, viz., rhetoric,\nwe find ourselves even more puzzled initially. What do philosophers\nhave to say about rhetoric?  Generally speaking, very little\nqua philosophers. Like all reflective people, philosophers\ndislike rhetoric as it is commonly practiced, bemoan the decline of\npublic speech into mere persuasion and demagoguery, and generally\nthink of themselves as avoiding rhetoric in favor of careful analysis\nand argument. “Rhetoric” tends to have a very negative\nconnotation, and for the most part means “mere\nrhetoric.”  As an object of academic study, the subject of\nrhetoric seems best left to English professors who specialize in the\nlong history of manuals on techniques of persuasion and such.\nConsequently, philosophers, especially in modernity, have had little\nto say about rhetoric. By contrast, Aristotle devoted a book to the\ntopic. And Plato struggles with rhetoric—or sophistry as it is\nsometimes also called, although the two are not necessarily\nidentical—repeatedly. We recall that Socrates was put to death\nin part because he was suspected of being a sophist, a clever\nrhetorician who twists words and makes the weaker argument into the\nstronger and teaches others to do the\n same.[5] \n Plato’s polemic against the sophists was so persuasive that, in\nconjunction with a well established and ongoing popular hostility\ntowards sophistry (a hostility of which Socrates was, ironically, also\nthe object), we have come to use “sophist” as a term of\nopprobrium meaning something like “mere rhetorician.” In\nPlato’s dialogues there is unquestionably an ongoing quarrel between\nphilosophy on the one hand and rhetoric and sophistry on the other,\nand it too is justly famed and pondered. What is it about?\n\nOnce again, the question is surprisingly difficult. It is not easy to\nunderstand why the topic is so important to Plato, what the essential\nissues in the quarrel are, and whether rhetoric is always a bad thing.\nWe do recognize commendable examples of rhetoric—say, Pericles’\nFuneral Oration, Lincoln’s Gettysburg Address, or Churchill’s rousing\nspeeches during World War II. These were rhetorical, but were they\nmerely rhetorical, let alone sophistical? Still further, Plato’s\nSocrates is not above speaking to his interlocutors rhetorically at\ntimes, even sophistically (some of his arguments against Thrasymachus\nin book I of the Republic have been suspected of falling into\nthe latter category, and Socrates’ interlocutors are occasionally\nreported as feeling that he has played some kind of verbal trick on\nthem). And are not Plato’s dialogues themselves rhetorical in\nsignificant senses of the term?\n\nThese remarks prompt yet another question. However interesting the\ntopics of poetry and rhetoric may be, when we read Plato, why group\nthem together? Few people today would imagine that there is any\ninteresting relation between poetry and rhetoric. To think of great\npoets as “rhetoricians” seems bizarre; and most (popular)\nrhetoricians do not seem to know the first thing about poetry. Yet\nPlato himself associates the two very closely: at Gorgias\n502c he characterizes poetry as a kind of rhetoric. Thus Plato\nprovides our warrant for investigating the topics together. This\nlinkage between poetry and rhetoric is of course controversial, and\nwill be discussed below.\n\nQuite clearly, our themes are very large in scope, and indeed nearly\nevery one of Plato’s dialogues is relevant to one or more of them. The\npresent essay will confine itself to just four dialogues, the\nIon, Republic, Gorgias, and\nPhaedrus. I will discuss them in that order, and in the final\nsection of the essay shall briefly examine the famous question of the\npoetic and rhetorical dimension of Plato’s own writings.\n\nI shall look for connections between our four dialogues, though I do\nnot believe that our chosen texts present a picture of poetry and\nrhetoric that is altogether unified (indeed, this could not be claimed\neven of the Republic taken by itself). I will put aside the\nquestion about which dialogue Plato composed at which time, along with\nassumptions about the possible “development” of Plato’s\nviews from “earlier” to “later” dialogues.\nThis is an example of an interpretive (or as it is sometimes called, a\n“hermeneutical”) assumption; every reader of Plato\nnecessarily commits to interpretive assumptions. The debate about\nwhich assumptions are best is an ongoing one, but not germane to the\npresent\n discussion.[6]\n It suffices here to state the relevant assumptions made in this\ndiscussion.\n\nThe identity of “Socrates” is contested; we have no\nwritings by the historical figure, only writings by a number of\nauthors that in some sense or other—and the senses vary a great\ndeal—are either about him or creatively adapt his name and\naspects of his story. In referring to Socrates, I shall mean only the\nfigure as represented by Plato; nothing follows, for present purposes,\nabout the historical accuracy of Plato’s depiction. Further, it is not\nthe case that the views Plato puts into the mouth of his Socrates are\nnecessarily espoused by Plato himself; they may or may not be those of\nPlato. Since Plato did not write a treatise in his own voice, telling\nus what his views are, it is impossible to know with certainty which\nviews he espouses (at least on the basis of the works he composed). In\nseveral cases, one of which will be examined in the final section of\nthis essay, it seems reasonably clear that Plato cannot be\nespousing without qualification a view that his Socrates is endorsing.\nWith these principles firmly in mind, however, I shall occasionally\nrefer (as I already have) to Plato as presenting this or that view.\nFor as author of all the statements and drama of the\ndialogues, he does indeed present the views in question; and on\noccasion it is convenient and simpler to say he is advocating this or\nthat position (for example, the position that there is an ancient\nquarrel between philosophy and poetry).\n",
    "section_title": "1. Introduction",
    "entry_title": "Plato on Rhetoric and Poetry",
    "hierarchy_title": "Plato on Rhetoric and Poetry || Introduction",
    "tokenized_text": [
        "introduction",
        "introduction",
        "good",
        "poem",
        "help",
        "change",
        "shape",
        "significance",
        "universe",
        "help",
        "extend",
        "everyone",
        "knowledge",
        "world",
        "around",
        "dylan",
        "thomas",
        "think",
        "philosophical",
        "analysis",
        "poetry",
        "something",
        "like",
        "treatise",
        "aesthetic",
        "come",
        "mind",
        "minimum",
        "would",
        "expect",
        "rigorous",
        "examination",
        "following",
        "characteristic",
        "define",
        "poetry",
        "difference",
        "kind",
        "poetry",
        "epic",
        "tragic",
        "lyric",
        "comic",
        "forth",
        "sens",
        "poetry",
        "bound",
        "representation",
        "imitation",
        "expression",
        "possible",
        "meaning",
        "classical",
        "greek",
        "word",
        "mimesis",
        "fiction",
        "complicated",
        "term",
        "require",
        "careful",
        "definition",
        "equally",
        "rigorous",
        "systematic",
        "remark",
        "difference",
        "poetry",
        "art",
        "form",
        "music",
        "painting",
        "would",
        "order",
        "would",
        "reflection",
        "relation",
        "orally",
        "delivered",
        "poetry",
        "indeed",
        "include",
        "performance",
        "poetry",
        "one",
        "way",
        "another",
        "enacted",
        "poetry",
        "communicated",
        "written",
        "word",
        "aristotle",
        "poetics",
        "early",
        "classic",
        "philosophical",
        "exploration",
        "poetry",
        "along",
        "sort",
        "line",
        "plato",
        "extensive",
        "discussion",
        "poetry",
        "frustrate",
        "expectation",
        "write",
        "treatise",
        "subjectindeed",
        "wrote",
        "treatise",
        "confined",
        "thought",
        "dramatic",
        "dialogue",
        "shaped",
        "poeticallyand",
        "remark",
        "offer",
        "u",
        "meander",
        "unsystematically",
        "even",
        "within",
        "single",
        "dialogue",
        "branch",
        "seem",
        "like",
        "strange",
        "direction",
        "discussion",
        "corruption",
        "self",
        "poetry",
        "allegedly",
        "expose",
        "audience",
        "yet",
        "plato",
        "clearly",
        "thought",
        "something",
        "enormous",
        "importance",
        "hang",
        "assessment",
        "poetry",
        "something",
        "go",
        "significantly",
        "beyond",
        "getting",
        "detail",
        "subject",
        "pinned",
        "philosophically",
        "respectable",
        "fashion",
        "one",
        "famous",
        "line",
        "culminating",
        "section",
        "one",
        "famous",
        "dialogue",
        "announces",
        "old",
        "quarrel",
        "philosophy",
        "poetry",
        "rep",
        "b",
        "support",
        "plato",
        "quote",
        "bit",
        "several",
        "obscure",
        "furious",
        "polemicspresumably",
        "directed",
        "poet",
        "philosopherssuch",
        "accusation",
        "opponent",
        "yelping",
        "bitch",
        "shrieking",
        "master",
        "great",
        "empty",
        "eloquence",
        "fool",
        "indeed",
        "much",
        "final",
        "book",
        "republic",
        "attack",
        "poetry",
        "question",
        "quarrel",
        "philosophy",
        "poetry",
        "continuing",
        "theme",
        "throughout",
        "plato",
        "corpus",
        "scope",
        "quarrel",
        "especially",
        "republic",
        "also",
        "indicates",
        "plato",
        "stake",
        "clash",
        "might",
        "call",
        "comprehensive",
        "worldviews",
        "seems",
        "matter",
        "grave",
        "importance",
        "ethic",
        "politics",
        "metaphysics",
        "theology",
        "epistemology",
        "stake",
        "lead",
        "famous",
        "line",
        "quarrel",
        "identifying",
        "addressee",
        "critique",
        "praisers",
        "homer",
        "say",
        "poet",
        "educated",
        "greece",
        "management",
        "education",
        "human",
        "affair",
        "worthwhile",
        "take",
        "study",
        "living",
        "arranging",
        "one",
        "whole",
        "life",
        "according",
        "poet",
        "e",
        "praisers",
        "homer",
        "treat",
        "font",
        "wisdom",
        "plato",
        "agrees",
        "homer",
        "indeed",
        "educator",
        "greece",
        "immediately",
        "add",
        "homer",
        "poetic",
        "first",
        "tragic",
        "poets",
        "plato",
        "setting",
        "take",
        "entire",
        "outlookin",
        "contemporary",
        "plato",
        "parlance",
        "entire",
        "philosophy",
        "life",
        "he",
        "belief",
        "homer",
        "follower",
        "successfully",
        "propagated",
        "since",
        "homer",
        "shaped",
        "popular",
        "culture",
        "time",
        "plato",
        "setting",
        "popular",
        "culture",
        "knew",
        "quarrel",
        "simply",
        "philosophy",
        "homer",
        "philosophy",
        "poetry",
        "plato",
        "sight",
        "poetry",
        "contending",
        "influence",
        "pervasive",
        "often",
        "harmful",
        "premise",
        "nature",
        "divine",
        "mistaken",
        "addressing",
        "fan",
        "homer",
        "fan",
        "sort",
        "thing",
        "homer",
        "conveys",
        "critique",
        "presented",
        "transhistorical",
        "one",
        "seems",
        "plato",
        "first",
        "articulate",
        "quarrel",
        "sweeping",
        "fashion",
        "noteworthy",
        "apology",
        "e",
        "socrates",
        "accuser",
        "said",
        "include",
        "poet",
        "whose",
        "cause",
        "meletus",
        "represents",
        "easy",
        "understand",
        "plato",
        "mean",
        "poetry",
        "opponent",
        "whether",
        "dangerous",
        "form",
        "content",
        "whether",
        "much",
        "ongoing",
        "interest",
        "relevance",
        "account",
        "would",
        "critique",
        "apply",
        "say",
        "shakespeare",
        "tragedy",
        "e",
        "e",
        "cummings",
        "t",
        "s",
        "eliot",
        "poetry",
        "question",
        "complicated",
        "fact",
        "plato",
        "primarily",
        "thinking",
        "poetry",
        "written",
        "text",
        "read",
        "silence",
        "mind",
        "recitation",
        "performance",
        "often",
        "experienced",
        "context",
        "theater",
        "still",
        "socrates",
        "plato",
        "conducted",
        "inquiry",
        "poetry",
        "far",
        "influential",
        "plato",
        "call",
        "philosophy",
        "given",
        "resounding",
        "success",
        "plato",
        "advocacy",
        "philosophy",
        "easy",
        "forget",
        "time",
        "advocating",
        "historically",
        "new",
        "project",
        "context",
        "swirling",
        "controversy",
        "relative",
        "value",
        "project",
        "indeed",
        "philosophy",
        "mean",
        "contrast",
        "poetry",
        "seems",
        "relatively",
        "marginal",
        "today",
        "large",
        "commercial",
        "liberal",
        "society",
        "spite",
        "energetic",
        "effort",
        "figure",
        "recent",
        "american",
        "national",
        "poet",
        "laureate",
        "robert",
        "pinsky",
        "whereas",
        "medium",
        "plato",
        "knew",
        "nothingsuch",
        "television",
        "video",
        "cinema",
        "literary",
        "form",
        "novel",
        "information",
        "system",
        "world",
        "wide",
        "webexercise",
        "tremendous",
        "influence",
        "television",
        "movie",
        "actor",
        "enjoy",
        "degree",
        "status",
        "wealth",
        "modern",
        "society",
        "transcends",
        "anything",
        "known",
        "ancient",
        "world",
        "plato",
        "critique",
        "marginalized",
        "along",
        "poetry",
        "spite",
        "harshness",
        "way",
        "bluntness",
        "plato",
        "critique",
        "poetry",
        "put",
        "finger",
        "deep",
        "issue",
        "ongoing",
        "interest",
        "also",
        "leavened",
        "polemic",
        "number",
        "intriguing",
        "subtle",
        "waysmost",
        "obviously",
        "writing",
        "philosophy",
        "way",
        "proper",
        "qualification",
        "called",
        "poetic",
        "quarrel",
        "philosophy",
        "poetry",
        "justly",
        "famed",
        "pondered",
        "turn",
        "second",
        "theme",
        "consideration",
        "viz",
        "rhetoric",
        "find",
        "even",
        "puzzled",
        "initially",
        "philosopher",
        "say",
        "rhetoric",
        "generally",
        "speaking",
        "little",
        "qua",
        "philosopher",
        "like",
        "reflective",
        "people",
        "philosopher",
        "dislike",
        "rhetoric",
        "commonly",
        "practiced",
        "bemoan",
        "decline",
        "public",
        "speech",
        "mere",
        "persuasion",
        "demagoguery",
        "generally",
        "think",
        "avoiding",
        "rhetoric",
        "favor",
        "careful",
        "analysis",
        "argument",
        "rhetoric",
        "tends",
        "negative",
        "connotation",
        "part",
        "mean",
        "mere",
        "rhetoric",
        "object",
        "academic",
        "study",
        "subject",
        "rhetoric",
        "seems",
        "best",
        "left",
        "english",
        "professor",
        "specialize",
        "long",
        "history",
        "manual",
        "technique",
        "persuasion",
        "consequently",
        "philosopher",
        "especially",
        "modernity",
        "little",
        "say",
        "rhetoric",
        "contrast",
        "aristotle",
        "devoted",
        "book",
        "topic",
        "plato",
        "struggle",
        "rhetoricor",
        "sophistry",
        "sometimes",
        "also",
        "called",
        "although",
        "two",
        "necessarily",
        "identicalrepeatedly",
        "recall",
        "socrates",
        "put",
        "death",
        "part",
        "suspected",
        "sophist",
        "clever",
        "rhetorician",
        "twist",
        "word",
        "make",
        "weaker",
        "argument",
        "stronger",
        "teach",
        "others",
        "plato",
        "polemic",
        "sophist",
        "persuasive",
        "conjunction",
        "well",
        "established",
        "ongoing",
        "popular",
        "hostility",
        "towards",
        "sophistry",
        "hostility",
        "socrates",
        "ironically",
        "also",
        "object",
        "come",
        "use",
        "sophist",
        "term",
        "opprobrium",
        "meaning",
        "something",
        "like",
        "mere",
        "rhetorician",
        "plato",
        "dialogue",
        "unquestionably",
        "ongoing",
        "quarrel",
        "philosophy",
        "one",
        "hand",
        "rhetoric",
        "sophistry",
        "justly",
        "famed",
        "pondered",
        "question",
        "surprisingly",
        "difficult",
        "easy",
        "understand",
        "topic",
        "important",
        "plato",
        "essential",
        "issue",
        "quarrel",
        "whether",
        "rhetoric",
        "always",
        "bad",
        "thing",
        "recognize",
        "commendable",
        "example",
        "rhetoricsay",
        "pericles",
        "funeral",
        "oration",
        "lincoln",
        "gettysburg",
        "address",
        "churchill",
        "rousing",
        "speech",
        "world",
        "war",
        "ii",
        "rhetorical",
        "merely",
        "rhetorical",
        "let",
        "alone",
        "sophistical",
        "still",
        "plato",
        "socrates",
        "speaking",
        "interlocutor",
        "rhetorically",
        "time",
        "even",
        "sophistically",
        "argument",
        "thrasymachus",
        "book",
        "republic",
        "suspected",
        "falling",
        "latter",
        "category",
        "socrates",
        "interlocutor",
        "occasionally",
        "reported",
        "feeling",
        "played",
        "kind",
        "verbal",
        "trick",
        "plato",
        "dialogue",
        "rhetorical",
        "significant",
        "sens",
        "term",
        "remark",
        "prompt",
        "yet",
        "another",
        "question",
        "however",
        "interesting",
        "topic",
        "poetry",
        "rhetoric",
        "may",
        "read",
        "plato",
        "group",
        "together",
        "people",
        "today",
        "would",
        "imagine",
        "interesting",
        "relation",
        "poetry",
        "rhetoric",
        "think",
        "great",
        "poet",
        "rhetorician",
        "seems",
        "bizarre",
        "popular",
        "rhetorician",
        "seem",
        "know",
        "first",
        "thing",
        "poetry",
        "yet",
        "plato",
        "associate",
        "two",
        "closely",
        "gorgias",
        "c",
        "characterizes",
        "poetry",
        "kind",
        "rhetoric",
        "thus",
        "plato",
        "provides",
        "warrant",
        "investigating",
        "topic",
        "together",
        "linkage",
        "poetry",
        "rhetoric",
        "course",
        "controversial",
        "discussed",
        "quite",
        "clearly",
        "theme",
        "large",
        "scope",
        "indeed",
        "nearly",
        "every",
        "one",
        "plato",
        "dialogue",
        "relevant",
        "one",
        "present",
        "essay",
        "confine",
        "four",
        "dialogue",
        "ion",
        "republic",
        "gorgias",
        "phaedrus",
        "discus",
        "order",
        "final",
        "section",
        "essay",
        "shall",
        "briefly",
        "examine",
        "famous",
        "question",
        "poetic",
        "rhetorical",
        "dimension",
        "plato",
        "writing",
        "shall",
        "look",
        "connection",
        "four",
        "dialogue",
        "though",
        "believe",
        "chosen",
        "text",
        "present",
        "picture",
        "poetry",
        "rhetoric",
        "altogether",
        "unified",
        "indeed",
        "could",
        "claimed",
        "even",
        "republic",
        "taken",
        "put",
        "aside",
        "question",
        "dialogue",
        "plato",
        "composed",
        "time",
        "along",
        "assumption",
        "possible",
        "development",
        "plato",
        "view",
        "earlier",
        "later",
        "dialogue",
        "example",
        "interpretive",
        "sometimes",
        "called",
        "hermeneutical",
        "assumption",
        "every",
        "reader",
        "plato",
        "necessarily",
        "commits",
        "interpretive",
        "assumption",
        "debate",
        "assumption",
        "best",
        "ongoing",
        "one",
        "germane",
        "present",
        "discussion",
        "suffices",
        "state",
        "relevant",
        "assumption",
        "made",
        "discussion",
        "identity",
        "socrates",
        "contested",
        "writing",
        "historical",
        "figure",
        "writing",
        "number",
        "author",
        "sense",
        "otherand",
        "sens",
        "vary",
        "great",
        "dealare",
        "either",
        "creatively",
        "adapt",
        "name",
        "aspect",
        "story",
        "referring",
        "socrates",
        "shall",
        "mean",
        "figure",
        "represented",
        "plato",
        "nothing",
        "follows",
        "present",
        "purpose",
        "historical",
        "accuracy",
        "plato",
        "depiction",
        "case",
        "view",
        "plato",
        "put",
        "mouth",
        "socrates",
        "necessarily",
        "espoused",
        "plato",
        "may",
        "may",
        "plato",
        "since",
        "plato",
        "write",
        "treatise",
        "voice",
        "telling",
        "u",
        "view",
        "impossible",
        "know",
        "certainty",
        "view",
        "espouses",
        "least",
        "basis",
        "work",
        "composed",
        "several",
        "case",
        "one",
        "examined",
        "final",
        "section",
        "essay",
        "seems",
        "reasonably",
        "clear",
        "plato",
        "espousing",
        "without",
        "qualification",
        "view",
        "socrates",
        "endorsing",
        "principle",
        "firmly",
        "mind",
        "however",
        "shall",
        "occasionally",
        "refer",
        "already",
        "plato",
        "presenting",
        "view",
        "author",
        "statement",
        "drama",
        "dialogue",
        "indeed",
        "present",
        "view",
        "question",
        "occasion",
        "convenient",
        "simpler",
        "say",
        "advocating",
        "position",
        "example",
        "position",
        "ancient",
        "quarrel",
        "philosophy",
        "poetry"
    ]
}