{
    "main_text": "The middle dialogues: Justice and other virtues || The desire for self-perfection\n3.3 The desire for self-perfection\n\r\nThe Symposium and the Phaedrus are two dialogues\r\nthat focus on the individual soul and pay no attention to communal\r\nlife at all. Instead, they concentrate on self-preservation,\r\nself-improvement, and self-completion. The Symposium is often\r\ntreated as a dialogue that predates the Republic, most of all\r\nbecause it mentions neither the immortality nor the tripartition of\r\nthe soul. But its dramatic staging – the praise of Eros by a\r\ncompany of symposiasts – is not germane to the otherworldly and\r\nascetic tendencies of the Gorgias and the Phaedo. In\r\naddition, Plato has good reasons for leaving aside a discussion of the\r\nsoul’s separability from the body in the Symposium (a\r\nfeature it shares with the much later Philebus). He aims to\r\nshow in the Symposium that love is an incentive, not only for all humans but\r\nfor all other living beings as well. Contrary to all previous\r\nspeakers, Socrates denies that Eros is a god because the gods are in\r\na state of perfection. Love, by contrast, is a desire by needy\r\ncreatures (endeeis) for the beautiful and the good\r\n(199c–201c). Socrates thereby corrects the previous\r\nspeakers’ confusion of love itself with the beloved object. This\r\nimportant insight is presented not as Socrates’ own but as the\r\nupshot of a ‘lecture on the nature of love by the wise priestess\r\nDiotima’ (201d–212b): Eros is a powerful demon, a being\r\nbetween (metaxu) what is mortal and what is immortal, an ever\r\nneedy hunter of the beautiful. Human beings share that demonic\r\ncondition, for they are neither good nor bad but desire the good and\r\nthe beautiful, the possession of which would constitute happiness for\r\nthem. Because all people want happiness, they pursue the good as well\r\nas they can (205a–206b). In each case, they desire the particular\r\nkinds of objects that they hope will fulfill their needs. Such\r\nfulfillment is not a passive possession; it is, rather, the\r\nappropriation of the objects of love that are deemed to be essential\r\nin the struggle for self-preservation, self-completion, and\r\nself-fulfillment (207d): “For among animals the principle is the\r\nsame as with us, and mortal nature seeks so far as possible to live\r\nforever and be immortal. And this is possible in one way only: by\r\nreproduction, because it leaves behind a new young one in place of the\r\nold.” There is, then, a constant need for self-restoration and\r\nself-improvement by procreation in the quest for an ‘earthly\r\nimmortality’ manifest in all living things (206e et\r\npass.). This need is explained by Diotima with an impressive\r\ndepiction of the constant flux that all organisms undergo, which, in the\r\ncase of human beings, not only affects their physical constitution but\r\ntheir moral and intellectual condition as well. Without constant\r\nreplenishment, none of them even stays the same over time\r\n(207c-208b).\n\r\nIn the case of human beings, these needs express themselves in\r\ndifferent ways. The search for ‘self-eternalization’ may\r\nresult in, or even be fulfilled by, the production of biological\r\nchildren or of so-called ‘children of the mind’ (e.g.,\r\nworks of art), or even by the creation of order in the city that is\r\nthen guided by the virtues of justice and moderation (209a–e).\r\nDiotima’s lecture is finally crowned by a depiction of the\r\nfamous scala amoris – the explanation of the refinement\r\nand sublimation that a person experiences when recognizing higher and\r\nhigher kinds of beauty (210a–212a). Starting with the love of\r\none beautiful body, the individual gradually learns to appreciate not\r\nonly all physical beauty but also the beauty of the mind, and in the\r\nend, she gets a glimpse of the supreme kind of beauty; namely, the\r\nvision of the Form of the Beautiful itself – a beauty that is\r\nneither relative, nor changeable, nor a matter of degree.\n\r\nBecause beauty of the higher kind is tied to virtue and is attained\r\nby the comprehension of what is common in laws and public\r\ninstitutions, it is clear that Plato does not have purely aesthetic\r\nvalues in mind but the principles of good order that are ultimately\r\ntied to the Form of the Beautiful/Good. The difference between the\r\nRepublic’s and the Symposium’s accounts\r\nlies in the fact that the scala amoris treats physical beauty\r\nas an incentive to the higher and better, an incentive that, in\r\nprinciple, affects every human being. There is no talk of a painful\r\nliberation from the bonds of the senses or of a turn-around of the\r\nentire soul that is reserved only for the better educated. Brief as\r\nthe Symposium’s explanation of happiness is, it shows\r\nthree things: First, all human beings aim for their own\r\nself-preservation and -perfection. Second, this drive finds its\r\nexpression in the products of their work, in creativity. Third, their\r\nrespective activities are instigated by each person’s own\r\nparticular desire for the beautiful. There is no indication that\r\nindividuals must act as part of a community. Though the communitarian\r\naspect of the good and beautiful comes to the fore in the high praise\r\nof the products of the legendary legislators (209e–210a), the\r\nultimate assent to the Beautiful itself is up to the individual. That\r\nmessage of the Symposium is not unique in Plato’s\r\nworks. The Lysis shares its basic assumption concerning the\r\nintermediary state of human nature between good and bad, and it\r\nregards need (endeia) as the basis of friendship.\r\nDue to the aporetic character of that dialogue, its lesson remains\r\nsomewhat obscure, but it is obvious enough that it shares the\r\nSymposium’s general anthropological\r\npresuppositions.\n\r\nThe idea that eros is the incentive to sublimation and\r\nself-completion is further pursued in the Phaedrus. Although\r\nthe close relationship between the two dialogues is generally\r\nacknowledged, the Phaedrus is commonly regarded as a much\r\nlater work. Not only does it accept the Republic’s\r\npsychological doctrine of a tri-partite soul, it also advocates the\r\nimmortality of the soul – doctrines that are conspicuously\r\nabsent in the Symposium. But this difference seems due to a\r\ndifference in perspective rather than to a change of mind.\r\nThe discussion in the Symposium is deliberately confined to\r\nthe conditions of self-immortalization in this life, while\r\nthe Phaedrus takes the discussion beyond the\r\nconfines of this life. If it shares the Republic’s\r\ndoctrine of a division of the soul into three parts, it does so for\r\nreasons of its own: The three parts of the soul in the\r\nPhaedrus are not supposed to justify the separation of people\r\ninto three classes. They explain, rather, the different routes taken\r\nby individuals in their search for beauty and their levels of success.\r\nIf the Phaedrus goes beyond the Symposium, it does\r\nso in order to show how the enchantment by beauty can be combined with\r\nan element of Plato’s philosophy that seems quite alien to the\r\nnotions of self-improvement and sublimation through the love of\r\nbeauty. That element is abruptly identified as dialectic, the\r\nsystematic method of collection and division that is characteristic of\r\nPlato’s later work. At first sight, it might seem that the\r\ndialogue’s topic, Eros, is hardly the right tie to keep together\r\nthe dialogue’s two disparate parts – i.e., the highly\r\npoetical depiction of the enchantment by beauty and the ensuing\r\nheavenly voyage to a hyperouraneous place, and Plato’s\r\nsubsequent, quite pedestrian, methodological explanations of the\r\npresuppositions of rhetoric (249b–c). But although the coherence\r\nof the Phaedrus cannot be argued for in full here, the notion\r\nthat the Phaedrus is disjointed does not do justice to the\r\ndialogue’s careful composition and overall aim.\n\r\nRhetoric, its purpose and value, is, in fact, the dialogue’s topic\r\nright from the start. The misuse of rhetoric is exemplified by the\r\nspeech attributed to the orator Lysias, a somewhat contrived plea to\r\nfavor a non-lover rather than a lover. Socrates’ retort points\r\nup Lysias’ presuppositions: that love is a kind of sickness, an\r\nirrational craving for the pleasures of the body; that a lover tries\r\nto dominate and enslave the beloved physically, materially and\r\nmentally; and, most importantly, that the lover tries to deprive the\r\nbeloved of philosophy. Once restored to his senses, the lover will shun\r\nhis former beloved and break all his promises. This one-sided view of\r\nEros is corrected in Socrates’ second speech: Eros, properly\r\nunderstood, is not a diseased state of mind but a kind of\r\n‘divine madness’ (theia mania). To explain the\r\nnature of this madness, Socrates employs the comparison of the\r\ntripartite soul to a charioteer with a pair of winged horses, an\r\nobedient white one and an unruly black one. The crucial difference\r\nbetween the Phaedrus’ tripartition and that in the\r\nRepublic lies in this: Instead of a long and arduous\r\nliberation through education, the Phaedrus envisages a\r\nliberation through the uplifting force of love, a love that is –\r\njust as it is in the Symposium – instigated by physical\r\nbeauty. That is what first makes the soul grow wings and soar in the\r\npursuit of a corresponding deity, to the point where it will attain\r\ngodlike insights. The best-conditioned souls – those where the\r\ncharioteer has full control over his horses – get a glimpse of\r\ntrue being, including the nature of the virtues and of the good\r\n(247c–e). Depending on the quality of each soul, the quality of\r\nthe beauty pursued will also determine the cycle of reincarnations\r\nthat is in store for each soul after death (248c–249c).\n",
    "section_title": "3.3 The desire for self-perfection",
    "entry_title": "Plato’s Ethics: An Overview",
    "hierarchy_title": "Plato’s Ethics: An Overview || The middle dialogues: Justice and other virtues || The desire for self-perfection",
    "tokenized_text": [
        "middle",
        "dialogue",
        "justice",
        "virtue",
        "desire",
        "selfperfection",
        "desire",
        "selfperfection",
        "symposium",
        "phaedrus",
        "two",
        "dialogue",
        "focus",
        "individual",
        "soul",
        "pay",
        "attention",
        "communal",
        "life",
        "instead",
        "concentrate",
        "selfpreservation",
        "selfimprovement",
        "selfcompletion",
        "symposium",
        "often",
        "treated",
        "dialogue",
        "predates",
        "republic",
        "mention",
        "neither",
        "immortality",
        "tripartition",
        "soul",
        "dramatic",
        "staging",
        "praise",
        "eros",
        "company",
        "symposiast",
        "germane",
        "otherworldly",
        "ascetic",
        "tendency",
        "gorgias",
        "phaedo",
        "addition",
        "plato",
        "good",
        "reason",
        "leaving",
        "aside",
        "discussion",
        "soul",
        "separability",
        "body",
        "symposium",
        "feature",
        "share",
        "much",
        "later",
        "philebus",
        "aim",
        "show",
        "symposium",
        "love",
        "incentive",
        "human",
        "living",
        "being",
        "well",
        "contrary",
        "previous",
        "speaker",
        "socrates",
        "denies",
        "eros",
        "god",
        "god",
        "state",
        "perfection",
        "love",
        "contrast",
        "desire",
        "needy",
        "creature",
        "endeeis",
        "beautiful",
        "good",
        "cc",
        "socrates",
        "thereby",
        "corrects",
        "previous",
        "speaker",
        "confusion",
        "love",
        "beloved",
        "object",
        "important",
        "insight",
        "presented",
        "socrates",
        "upshot",
        "lecture",
        "nature",
        "love",
        "wise",
        "priestess",
        "diotima",
        "db",
        "eros",
        "powerful",
        "demon",
        "metaxu",
        "mortal",
        "immortal",
        "ever",
        "needy",
        "hunter",
        "beautiful",
        "human",
        "being",
        "share",
        "demonic",
        "condition",
        "neither",
        "good",
        "bad",
        "desire",
        "good",
        "beautiful",
        "possession",
        "would",
        "constitute",
        "happiness",
        "people",
        "want",
        "happiness",
        "pursue",
        "good",
        "well",
        "ab",
        "case",
        "desire",
        "particular",
        "kind",
        "object",
        "hope",
        "fulfill",
        "need",
        "fulfillment",
        "passive",
        "possession",
        "rather",
        "appropriation",
        "object",
        "love",
        "deemed",
        "essential",
        "struggle",
        "selfpreservation",
        "selfcompletion",
        "selffulfillment",
        "d",
        "among",
        "animal",
        "principle",
        "u",
        "mortal",
        "nature",
        "seek",
        "far",
        "possible",
        "live",
        "forever",
        "immortal",
        "possible",
        "one",
        "way",
        "reproduction",
        "leaf",
        "behind",
        "new",
        "young",
        "one",
        "place",
        "old",
        "constant",
        "need",
        "selfrestoration",
        "selfimprovement",
        "procreation",
        "quest",
        "earthly",
        "immortality",
        "manifest",
        "living",
        "thing",
        "e",
        "et",
        "pass",
        "need",
        "explained",
        "diotima",
        "impressive",
        "depiction",
        "constant",
        "flux",
        "organism",
        "undergo",
        "case",
        "human",
        "being",
        "affect",
        "physical",
        "constitution",
        "moral",
        "intellectual",
        "condition",
        "well",
        "without",
        "constant",
        "replenishment",
        "none",
        "even",
        "stay",
        "time",
        "cb",
        "case",
        "human",
        "being",
        "need",
        "express",
        "different",
        "way",
        "search",
        "selfeternalization",
        "may",
        "result",
        "even",
        "fulfilled",
        "production",
        "biological",
        "child",
        "socalled",
        "child",
        "mind",
        "eg",
        "work",
        "art",
        "even",
        "creation",
        "order",
        "city",
        "guided",
        "virtue",
        "justice",
        "moderation",
        "ae",
        "diotima",
        "lecture",
        "finally",
        "crowned",
        "depiction",
        "famous",
        "scala",
        "amoris",
        "explanation",
        "refinement",
        "sublimation",
        "person",
        "experience",
        "recognizing",
        "higher",
        "higher",
        "kind",
        "beauty",
        "aa",
        "starting",
        "love",
        "one",
        "beautiful",
        "body",
        "individual",
        "gradually",
        "learns",
        "appreciate",
        "physical",
        "beauty",
        "also",
        "beauty",
        "mind",
        "end",
        "get",
        "glimpse",
        "supreme",
        "kind",
        "beauty",
        "namely",
        "vision",
        "form",
        "beautiful",
        "beauty",
        "neither",
        "relative",
        "changeable",
        "matter",
        "degree",
        "beauty",
        "higher",
        "kind",
        "tied",
        "virtue",
        "attained",
        "comprehension",
        "common",
        "law",
        "public",
        "institution",
        "clear",
        "plato",
        "purely",
        "aesthetic",
        "value",
        "mind",
        "principle",
        "good",
        "order",
        "ultimately",
        "tied",
        "form",
        "beautifulgood",
        "difference",
        "republic",
        "symposium",
        "account",
        "lie",
        "fact",
        "scala",
        "amoris",
        "treat",
        "physical",
        "beauty",
        "incentive",
        "higher",
        "better",
        "incentive",
        "principle",
        "affect",
        "every",
        "human",
        "talk",
        "painful",
        "liberation",
        "bond",
        "sens",
        "turnaround",
        "entire",
        "soul",
        "reserved",
        "better",
        "educated",
        "brief",
        "symposium",
        "explanation",
        "happiness",
        "show",
        "three",
        "thing",
        "first",
        "human",
        "being",
        "aim",
        "selfpreservation",
        "perfection",
        "second",
        "drive",
        "find",
        "expression",
        "product",
        "work",
        "creativity",
        "third",
        "respective",
        "activity",
        "instigated",
        "person",
        "particular",
        "desire",
        "beautiful",
        "indication",
        "individual",
        "must",
        "act",
        "part",
        "community",
        "though",
        "communitarian",
        "aspect",
        "good",
        "beautiful",
        "come",
        "fore",
        "high",
        "praise",
        "product",
        "legendary",
        "legislator",
        "ea",
        "ultimate",
        "assent",
        "beautiful",
        "individual",
        "message",
        "symposium",
        "unique",
        "plato",
        "work",
        "lysis",
        "share",
        "basic",
        "assumption",
        "concerning",
        "intermediary",
        "state",
        "human",
        "nature",
        "good",
        "bad",
        "regard",
        "need",
        "endeia",
        "basis",
        "friendship",
        "due",
        "aporetic",
        "character",
        "dialogue",
        "lesson",
        "remains",
        "somewhat",
        "obscure",
        "obvious",
        "enough",
        "share",
        "symposium",
        "general",
        "anthropological",
        "presupposition",
        "idea",
        "eros",
        "incentive",
        "sublimation",
        "selfcompletion",
        "pursued",
        "phaedrus",
        "although",
        "close",
        "relationship",
        "two",
        "dialogue",
        "generally",
        "acknowledged",
        "phaedrus",
        "commonly",
        "regarded",
        "much",
        "later",
        "work",
        "accept",
        "republic",
        "psychological",
        "doctrine",
        "tripartite",
        "soul",
        "also",
        "advocate",
        "immortality",
        "soul",
        "doctrine",
        "conspicuously",
        "absent",
        "symposium",
        "difference",
        "seems",
        "due",
        "difference",
        "perspective",
        "rather",
        "change",
        "mind",
        "discussion",
        "symposium",
        "deliberately",
        "confined",
        "condition",
        "selfimmortalization",
        "life",
        "phaedrus",
        "take",
        "discussion",
        "beyond",
        "confines",
        "life",
        "share",
        "republic",
        "doctrine",
        "division",
        "soul",
        "three",
        "part",
        "reason",
        "three",
        "part",
        "soul",
        "phaedrus",
        "supposed",
        "justify",
        "separation",
        "people",
        "three",
        "class",
        "explain",
        "rather",
        "different",
        "route",
        "taken",
        "individual",
        "search",
        "beauty",
        "level",
        "success",
        "phaedrus",
        "go",
        "beyond",
        "symposium",
        "order",
        "show",
        "enchantment",
        "beauty",
        "combined",
        "element",
        "plato",
        "philosophy",
        "seems",
        "quite",
        "alien",
        "notion",
        "selfimprovement",
        "sublimation",
        "love",
        "beauty",
        "element",
        "abruptly",
        "identified",
        "dialectic",
        "systematic",
        "method",
        "collection",
        "division",
        "characteristic",
        "plato",
        "later",
        "work",
        "first",
        "sight",
        "might",
        "seem",
        "dialogue",
        "topic",
        "eros",
        "hardly",
        "right",
        "tie",
        "keep",
        "together",
        "dialogue",
        "two",
        "disparate",
        "part",
        "ie",
        "highly",
        "poetical",
        "depiction",
        "enchantment",
        "beauty",
        "ensuing",
        "heavenly",
        "voyage",
        "hyperouraneous",
        "place",
        "plato",
        "subsequent",
        "quite",
        "pedestrian",
        "methodological",
        "explanation",
        "presupposition",
        "rhetoric",
        "bc",
        "although",
        "coherence",
        "phaedrus",
        "argued",
        "full",
        "notion",
        "phaedrus",
        "disjointed",
        "justice",
        "dialogue",
        "careful",
        "composition",
        "overall",
        "aim",
        "rhetoric",
        "purpose",
        "value",
        "fact",
        "dialogue",
        "topic",
        "right",
        "start",
        "misuse",
        "rhetoric",
        "exemplified",
        "speech",
        "attributed",
        "orator",
        "lysias",
        "somewhat",
        "contrived",
        "plea",
        "favor",
        "nonlover",
        "rather",
        "lover",
        "socrates",
        "retort",
        "point",
        "lysias",
        "presupposition",
        "love",
        "kind",
        "sickness",
        "irrational",
        "craving",
        "pleasure",
        "body",
        "lover",
        "try",
        "dominate",
        "enslave",
        "beloved",
        "physically",
        "materially",
        "mentally",
        "importantly",
        "lover",
        "try",
        "deprive",
        "beloved",
        "philosophy",
        "restored",
        "sens",
        "lover",
        "shun",
        "former",
        "beloved",
        "break",
        "promise",
        "onesided",
        "view",
        "eros",
        "corrected",
        "socrates",
        "second",
        "speech",
        "eros",
        "properly",
        "understood",
        "diseased",
        "state",
        "mind",
        "kind",
        "divine",
        "madness",
        "theia",
        "mania",
        "explain",
        "nature",
        "madness",
        "socrates",
        "employ",
        "comparison",
        "tripartite",
        "soul",
        "charioteer",
        "pair",
        "winged",
        "horse",
        "obedient",
        "white",
        "one",
        "unruly",
        "black",
        "one",
        "crucial",
        "difference",
        "phaedrus",
        "tripartition",
        "republic",
        "lie",
        "instead",
        "long",
        "arduous",
        "liberation",
        "education",
        "phaedrus",
        "envisages",
        "liberation",
        "uplifting",
        "force",
        "love",
        "love",
        "symposium",
        "instigated",
        "physical",
        "beauty",
        "first",
        "make",
        "soul",
        "grow",
        "wing",
        "soar",
        "pursuit",
        "corresponding",
        "deity",
        "point",
        "attain",
        "godlike",
        "insight",
        "bestconditioned",
        "soul",
        "charioteer",
        "full",
        "control",
        "horse",
        "get",
        "glimpse",
        "true",
        "including",
        "nature",
        "virtue",
        "good",
        "ce",
        "depending",
        "quality",
        "soul",
        "quality",
        "beauty",
        "pursued",
        "also",
        "determine",
        "cycle",
        "reincarnation",
        "store",
        "soul",
        "death",
        "cc"
    ]
}