{
    "main_text": "A Taxonomy of Positions\n2. A Taxonomy of Positions\n\nThere are not very many alternatives to platonism. One can reject the\nexistence of things like numbers and universals altogether. Or one can\nmaintain that there do exist such things as numbers and universals,\nand instead of saying that they are abstract objects, one can say that\nthey are mental objects of some sort (usually, the claim is that they\nare ideas in our heads) or physical objects of some sort. Thus, the\nfour mainstream views here are as follows (and keep in mind that\nanti-platonists can pursue different strategies with respect to\ndifferent kinds of alleged abstract objects, taking one view of, say,\nnumbers, and another view of properties or propositions).\n\nPlatonism: This is the view described in\n section 1.\n\n\nImmanent Realism: Advocates of this view agree with\nplatonists that there do exist such things as mathematical objects\n— or universals, or whatever category of alleged abstract\nobjects we're talking about — and that these things are\nindependent of us and our thinking; but immanent realists differ from\nplatonists in holding that these objects exist in the physical world.\nDepending on the kind of object under discussion — i.e., whether\nwe're talking about mathematical objects or properties or what have\nyou — the details of this view will be worked out differently.\nIn connection with properties, the standard immanent-realist view is\nthat properties like redness exist only in the physical world, in\nparticular, in actual red things, as nonspatial parts or aspects of\nthose things (this view traces back to Aristotle; in contemporary\ntimes, it has been defended by Armstrong (1978)). There is certainly\nsome initial plausibility to this idea: if you are looking at a red\nball, and you think that in addition to the ball, its redness exists,\nthen it seems a bit odd to say (as platonists do) that its redness\nexists outside of spacetime. After all, the ball is sitting right here\nin spacetime and we can see that it's red; so it seems initially\nplausible to think that if the redness exists at all, then it exists\nin the ball. As we will see below, however, there are serious problems\nwith this view.\n\nIn connection with numbers, one strategy is to take numbers to be\nuniversals of some sort — e.g., one might take them to be\nproperties of piles of physical objects, so that, for instance, the\nnumber 3 would be a property of, e.g., a pile of three books —\nand to take an immanent realist view of universals. (This sort of view\nhas been defended by Armstrong (1978).) But views of this kind have\nnot been very influential in the philosophy of mathematics. A more\nprominent strategy for taking number talk to be about the physical\nworld is to take it to be about actual piles of physical objects,\nrather than properties of piles. Thus, for instance, one might\nmaintain that to say that 2 + 3 = 5 is not really to say something\nabout specific entities (numbers); rather, it is to say that whenever\nwe push a pile of two objects together with a pile of three objects,\nwe will wind up with a pile of five objects — or something along\nthese lines. Thus, on this view, arithmetic is just a very general\nnatural science. A view of this sort was developed by Mill (1843) and,\nmore recently, a similar view has been defended by Philip Kitcher\n(1984). It should be noted, however, that while there are certainly\nphysicalist themes running through the views of Mill and Kitcher, it\nis not clear that either of them should be interpreted as an immanent\nrealist. Kitcher is probably best classified as a kind of anti-realist\n(I'll say a bit more about this in\n section 4.1),\n and it's not entirely clear how Mill ought to be classified, relative\nto our taxonomy, because it's not clear how he would answer the\nquestion, “Are there numbers, and if so, what are\nthey?”\n\nFinally, Penelope Maddy (1990) has also developed a sort of immanent\nrealist view of mathematics. Concentrating mainly on set theory, Maddy\nmaintains that sets of physical objects are located in space and time,\nright where their members are located. But Maddian sets cannot be\nidentified with the physical matter that constitutes their members. On\nMaddy's view, corresponding to every physical object, there is a huge\ninfinity of sets (e.g., the set containing the given object, the set\ncontaining that set, and so on) that are all distinct from one another\nbut which all share the same matter and the same spatiotemporal\nlocation. Thus, on this view, there is more to a set than the physical\nstuff that makes up its members, and so Maddy might be better\ninterpreted as endorsing a nonstandard version of platonism. \n\n\nConceptualism (also called psychologism and\nmentalism, depending on the sorts of objects under\ndiscussion): This is the view that there do exist numbers — or\nproperties, or propositions, or whatever — but that they do not\nexist independently of us; instead, they are mental objects; in\nparticular, the claim is usually that they are something like ideas in\nour heads. As we will see below, this view has serious problems and\nnot very many people endorse it. Nonetheless, it has had periods of\npopularity in the history of philosophy. It is very often thought that\nLocke held a conceptualistic view of universals, and prior to the\ntwentieth century, this was the standard view of concepts and\npropositions. In the philosophy of mathematics, psychologistic views\nwere popular in the late nineteenth century (the most notable\nproponent being the early Husserl (1891)) and even in the first part\nof the twentieth century with the advent of psychologistic\nintuitionism (Brouwer 1912 and 1948, and Heyting 1956). Finally, Noam\nChomsky (1965) has endorsed a mentalistic view of sentences and other\nlinguistic objects, and he has been followed here by others, most\nnotably, Fodor (1975, 1987).\n\nIt should also be noted here that one can claim that the existence of\nnumbers (or propositions or whatever) is dependent on us\nhumans without endorsing a psychologistic view of the relevant\nentities. For one can combine this claim with the idea that the\nobjects in question are abstract objects. In other words, one might\nclaim — and some have claimed — that numbers (or\npropositions or whatever) are mind-dependent abstract objects, i.e.,\nobjects that exist outside of the mind, and outside of space and time,\nbut which only came into being because of the activities of human\nbeings. Liston (2003–04), Cole (2009), and Bueno (2009) endorse\nviews of this general kind in connection with mathematical objects;\nSchiffer (2003, chapter 2), Soames (2014), and King (2014) endorse\nviews like this of propositions; and Salmon (1998) and Thomasson\n(1999) endorse views like this of fictional objects.\n\n\nNominalism (also called anti-realism): This is the\nview that there are no such things as numbers, or universals, or\nwhatever sort of alleged abstract objects are under discussion. Thus,\nfor instance, a nominalist about properties would say that while there\nare such things as red balls and red houses, there is no such thing as\nthe property of redness, over and above the red balls and red houses.\nAnd a nominalist about numbers would say that while there are such\nthings as piles of three stones, and perhaps “3-ideas”\nexisting in people's heads, there is no such thing as the number 3. As\nwe will see below, there are many different versions of each of these\nkinds of nominalism, but for now, we don't need anything more than\nthis general formulation of the view. (Sometimes\n‘nominalism’ is used to denote the view that there are no\nsuch things as abstract objects; on this usage,\n‘nominalism’ is synonymous with\n‘anti-platonism’, and views like immanent realism count as\nversions of nominalism. In contrast, on the usage employed in this\nessay, ‘nominalism’ is essentially synonymous with\n‘anti-realism’, and so views like immanent realism will\nnot count as versions of nominalism here.)\n\n\nPrima facie, it might seem that nominalism, or anti-realism,\nis further from the platonist view than immanent realism and\nconceptualism are for the simple reason that the latter two views\nadmit that there do exist such things as numbers (or universals, or\nwhatever). It is important to note, however, that nominalists agree\nwith platonists on an important point that immanent realists and\nconceptualists reject; in particular, nominalists (in agreement with\nplatonists) endorse the following thesis:\n\n(S) If there were such things as numbers (or universals, or whatever\nsort of alleged abstract objects we're talking about), then they would\nbe abstract objects; that is, they would be non-spatiotemporal,\nnon-physical, and non-mental.\n\n\nThis is an extremely important point, because it turns out that there\nare some very compelling arguments (which we will discuss) in favor of\n(S). As a result, there are very few advocates of immanent realism and\nconceptualism, especially in connection with mathematical objects and\npropositions. There is wide-spread agreement about what numbers and\npropositions would be if there were such things (namely, abstract\nobjects) but very little agreement as to whether there do exist such\nthings. Thus, today, the controversial question here is a purely\nontological one: Are there any such things as abstract objects (e.g.,\nmathematical objects, propositions, and so on)?\n\nIt is worth noting that while there are only four mainstream views\nhere (viz., platonism, immanent realism, conceptualism, and\nnominalism) a fifth view deserves mention, namely,\nMeinongianism (see Meinong (1904)). On this view, every\nsingular term — e.g., ‘Clinton’, ‘3’,\nand ‘Sherlock Holmes’ — picks out an object that has\nsome sort of being (that subsists, or that is, in\nsome sense) but only some of these objects have full-blown existence.\nAccording to Meinongianism, sentences that platonists take to be about\nabstract objects — sentences like ‘3 is prime’ and\n‘Red is a color’ — express truths about objects that\ndon't exist.\n\nMeinongianism has been almost universally rejected by philosophers.\nThe standard argument against it (see, e.g., Quine (1948), p. 3, and\nLewis (1990)) is that it does not provide a view that is clearly\ndistinct from platonism and merely creates the illusion of a different\nview by altering the meaning of the term ‘exist’. The idea\nhere is that on the standard meaning of ‘exist’, any\nobject that has any being at all exists, and so according to standard\nusage, Meinongianism entails that numbers and universals exist; but\nthis view clearly doesn't take such things to exist in spacetime and\nso, the argument concludes, Meinongianism entails that numbers and\nuniversals are abstract objects — just as platonism does.\n\nIt is worth noting, however, that while Meinongianism has mostly been\nrejected, it does have some more contemporary advocates, most notably,\nRoutley (1980), Parsons (1980), and Priest (2003, 2005).\n",
    "section_title": "2. A Taxonomy of Positions",
    "entry_title": "Platonism in Metaphysics",
    "hierarchy_title": "Platonism in Metaphysics || A Taxonomy of Positions",
    "tokenized_text": [
        "taxonomy",
        "position",
        "taxonomy",
        "position",
        "many",
        "alternative",
        "platonism",
        "one",
        "reject",
        "existence",
        "thing",
        "like",
        "number",
        "universal",
        "altogether",
        "one",
        "maintain",
        "exist",
        "thing",
        "number",
        "universal",
        "instead",
        "saying",
        "abstract",
        "object",
        "one",
        "say",
        "mental",
        "object",
        "sort",
        "usually",
        "claim",
        "idea",
        "head",
        "physical",
        "object",
        "sort",
        "thus",
        "four",
        "mainstream",
        "view",
        "follows",
        "keep",
        "mind",
        "antiplatonists",
        "pursue",
        "different",
        "strategy",
        "respect",
        "different",
        "kind",
        "alleged",
        "abstract",
        "object",
        "taking",
        "one",
        "view",
        "say",
        "number",
        "another",
        "view",
        "property",
        "proposition",
        "platonism",
        "view",
        "described",
        "section",
        "immanent",
        "realism",
        "advocate",
        "view",
        "agree",
        "platonist",
        "exist",
        "thing",
        "mathematical",
        "object",
        "universal",
        "whatever",
        "category",
        "alleged",
        "abstract",
        "object",
        "re",
        "talking",
        "thing",
        "independent",
        "u",
        "thinking",
        "immanent",
        "realist",
        "differ",
        "platonist",
        "holding",
        "object",
        "exist",
        "physical",
        "world",
        "depending",
        "kind",
        "object",
        "discussion",
        "ie",
        "whether",
        "re",
        "talking",
        "mathematical",
        "object",
        "property",
        "detail",
        "view",
        "worked",
        "differently",
        "connection",
        "property",
        "standard",
        "immanentrealist",
        "view",
        "property",
        "like",
        "redness",
        "exist",
        "physical",
        "world",
        "particular",
        "actual",
        "red",
        "thing",
        "nonspatial",
        "part",
        "aspect",
        "thing",
        "view",
        "trace",
        "back",
        "aristotle",
        "contemporary",
        "time",
        "defended",
        "armstrong",
        "certainly",
        "initial",
        "plausibility",
        "idea",
        "looking",
        "red",
        "ball",
        "think",
        "addition",
        "ball",
        "redness",
        "exists",
        "seems",
        "bit",
        "odd",
        "say",
        "platonist",
        "redness",
        "exists",
        "outside",
        "spacetime",
        "ball",
        "sitting",
        "right",
        "spacetime",
        "see",
        "s",
        "red",
        "seems",
        "initially",
        "plausible",
        "think",
        "redness",
        "exists",
        "exists",
        "ball",
        "see",
        "however",
        "serious",
        "problem",
        "view",
        "connection",
        "number",
        "one",
        "strategy",
        "take",
        "number",
        "universal",
        "sort",
        "eg",
        "one",
        "might",
        "take",
        "property",
        "pile",
        "physical",
        "object",
        "instance",
        "number",
        "would",
        "property",
        "eg",
        "pile",
        "three",
        "book",
        "take",
        "immanent",
        "realist",
        "view",
        "universal",
        "sort",
        "view",
        "defended",
        "armstrong",
        "view",
        "kind",
        "influential",
        "philosophy",
        "mathematics",
        "prominent",
        "strategy",
        "taking",
        "number",
        "talk",
        "physical",
        "world",
        "take",
        "actual",
        "pile",
        "physical",
        "object",
        "rather",
        "property",
        "pile",
        "thus",
        "instance",
        "one",
        "might",
        "maintain",
        "say",
        "really",
        "say",
        "something",
        "specific",
        "entity",
        "number",
        "rather",
        "say",
        "whenever",
        "push",
        "pile",
        "two",
        "object",
        "together",
        "pile",
        "three",
        "object",
        "wind",
        "pile",
        "five",
        "object",
        "something",
        "along",
        "line",
        "thus",
        "view",
        "arithmetic",
        "general",
        "natural",
        "science",
        "view",
        "sort",
        "developed",
        "mill",
        "recently",
        "similar",
        "view",
        "defended",
        "philip",
        "kitcher",
        "noted",
        "however",
        "certainly",
        "physicalist",
        "theme",
        "running",
        "view",
        "mill",
        "kitcher",
        "clear",
        "either",
        "interpreted",
        "immanent",
        "realist",
        "kitcher",
        "probably",
        "best",
        "classified",
        "kind",
        "antirealist",
        "ll",
        "say",
        "bit",
        "section",
        "s",
        "entirely",
        "clear",
        "mill",
        "ought",
        "classified",
        "relative",
        "taxonomy",
        "s",
        "clear",
        "would",
        "answer",
        "question",
        "number",
        "finally",
        "penelope",
        "maddy",
        "also",
        "developed",
        "sort",
        "immanent",
        "realist",
        "view",
        "mathematics",
        "concentrating",
        "mainly",
        "set",
        "theory",
        "maddy",
        "maintains",
        "set",
        "physical",
        "object",
        "located",
        "space",
        "time",
        "right",
        "member",
        "located",
        "maddian",
        "set",
        "identified",
        "physical",
        "matter",
        "constitutes",
        "member",
        "maddy",
        "s",
        "view",
        "corresponding",
        "every",
        "physical",
        "object",
        "huge",
        "infinity",
        "set",
        "eg",
        "set",
        "containing",
        "given",
        "object",
        "set",
        "containing",
        "set",
        "distinct",
        "one",
        "another",
        "share",
        "matter",
        "spatiotemporal",
        "location",
        "thus",
        "view",
        "set",
        "physical",
        "stuff",
        "make",
        "member",
        "maddy",
        "might",
        "better",
        "interpreted",
        "endorsing",
        "nonstandard",
        "version",
        "platonism",
        "conceptualism",
        "also",
        "called",
        "psychologism",
        "mentalism",
        "depending",
        "sort",
        "object",
        "discussion",
        "view",
        "exist",
        "number",
        "property",
        "proposition",
        "whatever",
        "exist",
        "independently",
        "u",
        "instead",
        "mental",
        "object",
        "particular",
        "claim",
        "usually",
        "something",
        "like",
        "idea",
        "head",
        "see",
        "view",
        "serious",
        "problem",
        "many",
        "people",
        "endorse",
        "nonetheless",
        "period",
        "popularity",
        "history",
        "philosophy",
        "often",
        "thought",
        "locke",
        "held",
        "conceptualistic",
        "view",
        "universal",
        "prior",
        "twentieth",
        "century",
        "standard",
        "view",
        "concept",
        "proposition",
        "philosophy",
        "mathematics",
        "psychologistic",
        "view",
        "popular",
        "late",
        "nineteenth",
        "century",
        "notable",
        "proponent",
        "early",
        "husserl",
        "even",
        "first",
        "part",
        "twentieth",
        "century",
        "advent",
        "psychologistic",
        "intuitionism",
        "brouwer",
        "heyting",
        "finally",
        "noam",
        "chomsky",
        "endorsed",
        "mentalistic",
        "view",
        "sentence",
        "linguistic",
        "object",
        "followed",
        "others",
        "notably",
        "fodor",
        "also",
        "noted",
        "one",
        "claim",
        "existence",
        "number",
        "proposition",
        "whatever",
        "dependent",
        "u",
        "human",
        "without",
        "endorsing",
        "psychologistic",
        "view",
        "relevant",
        "entity",
        "one",
        "combine",
        "claim",
        "idea",
        "object",
        "question",
        "abstract",
        "object",
        "word",
        "one",
        "might",
        "claim",
        "claimed",
        "number",
        "proposition",
        "whatever",
        "minddependent",
        "abstract",
        "object",
        "ie",
        "object",
        "exist",
        "outside",
        "mind",
        "outside",
        "space",
        "time",
        "came",
        "activity",
        "human",
        "being",
        "liston",
        "cole",
        "bueno",
        "endorse",
        "view",
        "general",
        "kind",
        "connection",
        "mathematical",
        "object",
        "schiffer",
        "chapter",
        "soames",
        "king",
        "endorse",
        "view",
        "like",
        "proposition",
        "salmon",
        "thomasson",
        "endorse",
        "view",
        "like",
        "fictional",
        "object",
        "nominalism",
        "also",
        "called",
        "antirealism",
        "view",
        "thing",
        "number",
        "universal",
        "whatever",
        "sort",
        "alleged",
        "abstract",
        "object",
        "discussion",
        "thus",
        "instance",
        "nominalist",
        "property",
        "would",
        "say",
        "thing",
        "red",
        "ball",
        "red",
        "house",
        "thing",
        "property",
        "redness",
        "red",
        "ball",
        "red",
        "house",
        "nominalist",
        "number",
        "would",
        "say",
        "thing",
        "pile",
        "three",
        "stone",
        "perhaps",
        "ideas",
        "existing",
        "people",
        "s",
        "head",
        "thing",
        "number",
        "see",
        "many",
        "different",
        "version",
        "kind",
        "nominalism",
        "nt",
        "need",
        "anything",
        "general",
        "formulation",
        "view",
        "sometimes",
        "nominalism",
        "used",
        "denote",
        "view",
        "thing",
        "abstract",
        "object",
        "usage",
        "nominalism",
        "synonymous",
        "antiplatonism",
        "view",
        "like",
        "immanent",
        "realism",
        "count",
        "version",
        "nominalism",
        "contrast",
        "usage",
        "employed",
        "essay",
        "nominalism",
        "essentially",
        "synonymous",
        "antirealism",
        "view",
        "like",
        "immanent",
        "realism",
        "count",
        "version",
        "nominalism",
        "prima",
        "facie",
        "might",
        "seem",
        "nominalism",
        "antirealism",
        "platonist",
        "view",
        "immanent",
        "realism",
        "conceptualism",
        "simple",
        "reason",
        "latter",
        "two",
        "view",
        "admit",
        "exist",
        "thing",
        "number",
        "universal",
        "whatever",
        "important",
        "note",
        "however",
        "nominalist",
        "agree",
        "platonist",
        "important",
        "point",
        "immanent",
        "realist",
        "conceptualists",
        "reject",
        "particular",
        "nominalist",
        "agreement",
        "platonist",
        "endorse",
        "following",
        "thesis",
        "thing",
        "number",
        "universal",
        "whatever",
        "sort",
        "alleged",
        "abstract",
        "object",
        "re",
        "talking",
        "would",
        "abstract",
        "object",
        "would",
        "nonspatiotemporal",
        "nonphysical",
        "nonmental",
        "extremely",
        "important",
        "point",
        "turn",
        "compelling",
        "argument",
        "discus",
        "favor",
        "result",
        "advocate",
        "immanent",
        "realism",
        "conceptualism",
        "especially",
        "connection",
        "mathematical",
        "object",
        "proposition",
        "widespread",
        "agreement",
        "number",
        "proposition",
        "would",
        "thing",
        "namely",
        "abstract",
        "object",
        "little",
        "agreement",
        "whether",
        "exist",
        "thing",
        "thus",
        "today",
        "controversial",
        "question",
        "purely",
        "ontological",
        "one",
        "thing",
        "abstract",
        "object",
        "eg",
        "mathematical",
        "object",
        "proposition",
        "worth",
        "noting",
        "four",
        "mainstream",
        "view",
        "viz",
        "platonism",
        "immanent",
        "realism",
        "conceptualism",
        "nominalism",
        "fifth",
        "view",
        "deserves",
        "mention",
        "namely",
        "meinongianism",
        "see",
        "meinong",
        "view",
        "every",
        "singular",
        "term",
        "eg",
        "clinton",
        "sherlock",
        "holmes",
        "pick",
        "object",
        "sort",
        "subsists",
        "sense",
        "object",
        "fullblown",
        "existence",
        "according",
        "meinongianism",
        "sentence",
        "platonist",
        "take",
        "abstract",
        "object",
        "sentence",
        "like",
        "prime",
        "red",
        "color",
        "express",
        "truth",
        "object",
        "nt",
        "exist",
        "meinongianism",
        "almost",
        "universally",
        "rejected",
        "philosopher",
        "standard",
        "argument",
        "see",
        "eg",
        "quine",
        "p",
        "lewis",
        "provide",
        "view",
        "clearly",
        "distinct",
        "platonism",
        "merely",
        "creates",
        "illusion",
        "different",
        "view",
        "altering",
        "meaning",
        "term",
        "exist",
        "idea",
        "standard",
        "meaning",
        "exist",
        "object",
        "exists",
        "according",
        "standard",
        "usage",
        "meinongianism",
        "entail",
        "number",
        "universal",
        "exist",
        "view",
        "clearly",
        "nt",
        "take",
        "thing",
        "exist",
        "spacetime",
        "argument",
        "concludes",
        "meinongianism",
        "entail",
        "number",
        "universal",
        "abstract",
        "object",
        "platonism",
        "worth",
        "noting",
        "however",
        "meinongianism",
        "mostly",
        "rejected",
        "contemporary",
        "advocate",
        "notably",
        "routley",
        "parson",
        "priest"
    ]
}