{
    "main_text": "The Art and Psychology of Love Explained\n5. The Art and Psychology of Love Explained\n\nIn the Phaedrus we find a more detailed account of the\npsychology and art of love than in the Symposium. This\naccount will be our exclusive focus. The soul, whether divine or\nhuman, Socrates claims, is like “the natural union of a team of\nwinged horses and their charioteer” (246a6–7). But whereas\nin a divine soul all three elements are “good and come from good\nstock,” in a human soul the white horse (familiar from\nRepublic IV as the honor-loving spirited element) is\n“beautiful and good, and of similar stock,” while the\nblack one (the Republic’s appetitive element) is\n“the opposite and of the opposite stock,” so that\n“the driving in our case is necessarily difficult and\ntroublesome” (a7-b4). When spirit together with the charioteer\n(the Republic’s rational element, there too identified\nwith what is truly human rather than bestial in us\n(588b10–589a4)) “leads us towards what is best and is in\ncontrol,” we possess moderation\n(sôphrosunê) (237e2–3). But when\n“appetite drags us irrationally towards pleasures and rules in\nus, its rule is called excess (hubris)”\n(238a1–2). Of this excess, gluttony is one species, but erotic\nlove another (238b7-c4). This is the bad kind of love—Pandemotic\nin the Symposium—that Lysias rightly disparages in the\nspeech Phaedrus admires and reads to Socrates (230e6–234c5).\n\nIn Socrates’ view, however, there is also another kind of love,\nnamely, “the madness of a man who, on seeing beauty here on\nearth, and being reminded of true beauty, becomes winged, and\nfluttering with eagerness to fly upwards, but unable to leave the\nground, looks upwards like a bird, and takes no heed of things\nbelow—and that is what causes him to be regarded as mad”\n(249d5-e1). This madman is the philosopher of the Symposium,\nwho when he falls in love with a boy is led by his love to ascend by\nstages to the form of the beautiful. What makes his madness a divine\ngift, however, is that the ascent is now revealed as involving\nrecollection of a prior pre-natal ascent taken in the company of a\ngod.\n\nFrom the rich literary account of this ascent, we need to take away\njust one idea: souls have different psychological structures depending\non which god they followed, since this sets an upper limit on how much\nof the forms they see, and so how much they can subsequently\nrecollect. Since gaining access to forms nourishes and strengthens the\nrational element in the soul (248b5-c2), this also helps determine\ntheir motivational structure: the stronger their reason is, the more\nlikely it will be to succeed in controlling the other elements in the\nsoul.\n\nFollowers of Zeus, for example, choose someone to love whose soul\nresembles their patron god. So they seek someone who is\n“naturally disposed to philosophy and leadership, and when they\nhave found him and fall in love they do everything to make him\nphilosophical” (252e1–5). Nonetheless, the falling itself\ninvolves a huge psychological upheaval. The black horse of appetite\nimmediately urges towards sexual intercourse. The white\nhorse—“constrained then as always by shame”\n(254a2)—holds itself back. Eventually, however, the black horse\nforces both the charioteer and the white horse “to move towards\nthe beloved and mention to him the delights of sex”\n(a5–7). Again they balk, “indignant at being forced to do\nterrible and improper things” (b1). But finally, “when\nthere is no limit to their plight, they follow its lead, giving in and\nagreeing to do what it tells them” (b2–3). As they come\nclose to the beloved, however, to initiate intercourse, the flashing\nface of the beloved reminds the charioteer of the beautiful itself, so\nthat his memory “again sees it standing together with temperance\non a holy pedestal” (b5–7). He becomes frightened and\n“in sudden reverence falls on his back, and is forced at the\nsame time to pull back the reins so violently as to bring the horses\ndown on their haunches, the one willingly, because of it lack of\nresistance to him, but the unruly horse much against its will”\n(b7-c3). Eventually, “when the same thing happens to the evil\nhorse many times, it allows the charioteer with his foresight to\nlead” (e5–7). If this control of appetite by reason and\nspirit continues—even when the boy has accepted his lover and\nembraces, kisses, and lies down with him—and draws them to\n“a well-ordered life and to philosophy,” they are\nblessedly happy here on earth, and, if they live such a life for three\nsuccessive incarnations, they re-grow their wings and re-join the\nentourage of their god (255e2-b7).\n\nWhen followers of Ares fall in love, on the other hand, they\n“adopt a lower way of living, not philosophical, but\nhonor-loving” (256b7-c1). When they are drinking together, for\nexample, or are careless in some other way, “the licentious\nhorses in the two of them catch their souls off guard,” and\nsince the man’s recollection of beauty is dimmer and is not\nrekindled by philosophical conversation, they end up having sex\ntogether—something “the masses regard as the happiest\nchoice of all” (c1–5). Nonetheless, they don’t have\nsex very often, because “what they are doing has not been\napproved by their whole mind” (c6–7). So while the degree\nof their love and happiness is less than the philosophical pair and,\non their death, “they leave the body without wings,” still\nthey have an impulse, coming from love, to try to gain them. Hence\nthey aren’t punished in the next life, but helped on the way to\nfuture happiness together (c7-e2).\n\nThe love that is divine madness is a good thing, therefore, especially\nwhen, “accompanied by philosophical discussions (erôta\nmeta philosophôn logôn)” (257b6), it leads to\nthe beautiful itself and the other forms, which are what we—as\nmost of all the rational element in our souls—truly love and\ncrave. The question is what makes a discussion philosophical? What\nmakes it of the sort to be included in the true art of love that the\nphilosopher who loves the beautiful itself practices? The answer now\nproposed is that it must be a technê or craft, and so\nmust have the defining characteristics of one. As applied to love\nitself, for example, it must begin with a definition of love, and\nreach its conclusions by ordering its discussion in relation to it\n(263d5-e3). And this definition, in turn, must be established by what\nSocrates refers to as collection and division (266b3–4).\n\nCollection is a process of “perceiving together and bringing\ninto one form items that are scattered in many places”\n(265d3–4). It is a process that we, unlike other animals, are\nable to engage in it, because our souls include a rational element\nthat has prior acquaintance with forms: “a soul that never\n[prenatally] saw what is true cannot take a human shape, since a human\nbeing must understand what is said by relation to a form that is\nreached from many sense-perceptions being collected into one by\nreasoning” (249b5-c1). (It is useful to compare this description\nwith the one given in Aristotle, Posterior Analytics II.\n19.)\n\nOnce a form has been reached in this way, division begins. This is a\nmatter of “cutting the form up again, by relation to\n[sub-]forms, by relation to its natural joints” (265e1-2). As an\nexample, Socrates cites the case of love itself:\n\njust as a single body naturally has its parts in pairs, with both\nmembers of each pair having the same name, and labeled respectively\nleft and right, so the two speeches regarded madness as naturally a\nsingle form in us. The one [Socrates’ reorganized version of\nLysias’ attack on love] cut off the part on the left side, then\ncutting it again, and not giving up until it had found among the parts\na love which is, as we say, “left-handed,” and abused it\nwith full justice, while the other speech [Socrates’ own defense\nof love] led us to the parts of madness on the right-hand side, and\ndiscovering and exhibiting a love which shares the same name as the\nother, but is divine, it praised it as a cause of our greatest goods.\n(265e4–266b1)\n\n\nThus, while each speech tells only half the story, the two together\nshow how correct division should proceed. The goal, however,\nisn’t just truth or correctness, but explanatory adequacy. Thus\nif the form in question “is simple, we should\nconsider…what natural capacity it has for acting and on what,\nor for being acted upon and by what,” and if it is complex, we\nshould count its sub-forms, and consider the same things about them as\nabout the simple ones (270d3–7). That Socrates—the\narchetypal searcher for explanatory definitions (Euthyphro\n6d9-e6)—should pronounce himself “a lover of these\ndivisions and collections” is no surprise, therefore\n(266b3–4).\n\nPhilosophy aims at true definitions and true stories based on them.\nBut it also aims at persuasion, since the philosophical lover wants to\npersuade his boy to follow him on the path to the forms. Philosophy\nand rhetoric must thus go together, which means that rhetoric, too,\nmust be developed as a technê. It must, first,\ndistinguish and give definitions of the various kinds of souls and\nkinds of speeches, revealing their respective capacities and\nsusceptibilities, and, second, “coordinate each kind of soul\nwith the kind of speech appropriate to it, explaining why one kind of\nsoul is necessarily convinced by one kind of speech, while another is\nnot” (271b1–5). Mastery of such a science, however,\nrequires one further thing: “the student must observe these\nthings as they are in real life, and actually being put into practice,\nand be able to follow them with keen perception” (d8-e1). It\nisn’t enough, in other words, to know what kinds of speeches\naffect what kinds of soul, the philosophical rhetorician must also\nknow that this man in front of him is of such and such a kind, and be\nable to talk in the kind of way that will prove convincing to him\n(e2–272b2).\n",
    "section_title": "5. The Art and Psychology of Love Explained",
    "entry_title": "Plato on Friendship and Eros",
    "hierarchy_title": "Plato on Friendship and Eros || The Art and Psychology of Love Explained",
    "tokenized_text": [
        "art",
        "psychology",
        "love",
        "explained",
        "art",
        "psychology",
        "love",
        "explained",
        "phaedrus",
        "find",
        "detailed",
        "account",
        "psychology",
        "art",
        "love",
        "symposium",
        "account",
        "exclusive",
        "focus",
        "soul",
        "whether",
        "divine",
        "human",
        "socrates",
        "claim",
        "like",
        "natural",
        "union",
        "team",
        "winged",
        "horse",
        "charioteer",
        "a",
        "whereas",
        "divine",
        "soul",
        "three",
        "element",
        "good",
        "come",
        "good",
        "stock",
        "human",
        "soul",
        "white",
        "horse",
        "familiar",
        "republic",
        "iv",
        "honorloving",
        "spirited",
        "element",
        "beautiful",
        "good",
        "similar",
        "stock",
        "black",
        "one",
        "republic",
        "appetitive",
        "element",
        "opposite",
        "opposite",
        "stock",
        "driving",
        "case",
        "necessarily",
        "difficult",
        "troublesome",
        "ab",
        "spirit",
        "together",
        "charioteer",
        "republic",
        "rational",
        "element",
        "identified",
        "truly",
        "human",
        "rather",
        "bestial",
        "u",
        "ba",
        "lead",
        "u",
        "towards",
        "best",
        "control",
        "posse",
        "moderation",
        "sôphrosunê",
        "e",
        "appetite",
        "drag",
        "u",
        "irrationally",
        "towards",
        "pleasure",
        "rule",
        "u",
        "rule",
        "called",
        "excess",
        "hubris",
        "a",
        "excess",
        "gluttony",
        "one",
        "specie",
        "erotic",
        "love",
        "another",
        "bc",
        "bad",
        "kind",
        "lovepandemotic",
        "symposiumthat",
        "lysias",
        "rightly",
        "disparages",
        "speech",
        "phaedrus",
        "admires",
        "read",
        "socrates",
        "ec",
        "socrates",
        "view",
        "however",
        "also",
        "another",
        "kind",
        "love",
        "namely",
        "madness",
        "man",
        "seeing",
        "beauty",
        "earth",
        "reminded",
        "true",
        "beauty",
        "becomes",
        "winged",
        "fluttering",
        "eagerness",
        "fly",
        "upwards",
        "unable",
        "leave",
        "ground",
        "look",
        "upwards",
        "like",
        "bird",
        "take",
        "heed",
        "thing",
        "belowand",
        "cause",
        "regarded",
        "mad",
        "de",
        "madman",
        "philosopher",
        "symposium",
        "fall",
        "love",
        "boy",
        "led",
        "love",
        "ascend",
        "stage",
        "form",
        "beautiful",
        "make",
        "madness",
        "divine",
        "gift",
        "however",
        "ascent",
        "revealed",
        "involving",
        "recollection",
        "prior",
        "prenatal",
        "ascent",
        "taken",
        "company",
        "god",
        "rich",
        "literary",
        "account",
        "ascent",
        "need",
        "take",
        "away",
        "one",
        "idea",
        "soul",
        "different",
        "psychological",
        "structure",
        "depending",
        "god",
        "followed",
        "since",
        "set",
        "upper",
        "limit",
        "much",
        "form",
        "see",
        "much",
        "subsequently",
        "recollect",
        "since",
        "gaining",
        "access",
        "form",
        "nourishes",
        "strengthens",
        "rational",
        "element",
        "soul",
        "bc",
        "also",
        "help",
        "determine",
        "motivational",
        "structure",
        "stronger",
        "reason",
        "likely",
        "succeed",
        "controlling",
        "element",
        "soul",
        "follower",
        "zeus",
        "example",
        "choose",
        "someone",
        "love",
        "whose",
        "soul",
        "resembles",
        "patron",
        "god",
        "seek",
        "someone",
        "naturally",
        "disposed",
        "philosophy",
        "leadership",
        "found",
        "fall",
        "love",
        "everything",
        "make",
        "philosophical",
        "e",
        "nonetheless",
        "falling",
        "involves",
        "huge",
        "psychological",
        "upheaval",
        "black",
        "horse",
        "appetite",
        "immediately",
        "urge",
        "towards",
        "sexual",
        "intercourse",
        "white",
        "horse",
        "constrained",
        "always",
        "shame",
        "a",
        "holds",
        "back",
        "eventually",
        "however",
        "black",
        "horse",
        "force",
        "charioteer",
        "white",
        "horse",
        "move",
        "towards",
        "beloved",
        "mention",
        "delight",
        "sex",
        "a",
        "balk",
        "indignant",
        "forced",
        "terrible",
        "improper",
        "thing",
        "b",
        "finally",
        "limit",
        "plight",
        "follow",
        "lead",
        "giving",
        "agreeing",
        "tell",
        "b",
        "come",
        "close",
        "beloved",
        "however",
        "initiate",
        "intercourse",
        "flashing",
        "face",
        "beloved",
        "reminds",
        "charioteer",
        "beautiful",
        "memory",
        "see",
        "standing",
        "together",
        "temperance",
        "holy",
        "pedestal",
        "b",
        "becomes",
        "frightened",
        "sudden",
        "reverence",
        "fall",
        "back",
        "forced",
        "time",
        "pull",
        "back",
        "rein",
        "violently",
        "bring",
        "horse",
        "haunch",
        "one",
        "willingly",
        "lack",
        "resistance",
        "unruly",
        "horse",
        "much",
        "bc",
        "eventually",
        "thing",
        "happens",
        "evil",
        "horse",
        "many",
        "time",
        "allows",
        "charioteer",
        "foresight",
        "lead",
        "e",
        "control",
        "appetite",
        "reason",
        "spirit",
        "continueseven",
        "boy",
        "accepted",
        "lover",
        "embrace",
        "kiss",
        "lie",
        "himand",
        "draw",
        "wellordered",
        "life",
        "philosophy",
        "blessedly",
        "happy",
        "earth",
        "live",
        "life",
        "three",
        "successive",
        "incarnation",
        "regrow",
        "wing",
        "rejoin",
        "entourage",
        "god",
        "eb",
        "follower",
        "are",
        "fall",
        "love",
        "hand",
        "adopt",
        "lower",
        "way",
        "living",
        "philosophical",
        "honorloving",
        "bc",
        "drinking",
        "together",
        "example",
        "careless",
        "way",
        "licentious",
        "horse",
        "two",
        "catch",
        "soul",
        "guard",
        "since",
        "man",
        "recollection",
        "beauty",
        "dimmer",
        "rekindled",
        "philosophical",
        "conversation",
        "end",
        "sex",
        "togethersomething",
        "mass",
        "regard",
        "happiest",
        "choice",
        "c",
        "nonetheless",
        "sex",
        "often",
        "approved",
        "whole",
        "mind",
        "c",
        "degree",
        "love",
        "happiness",
        "le",
        "philosophical",
        "pair",
        "death",
        "leave",
        "body",
        "without",
        "wing",
        "still",
        "impulse",
        "coming",
        "love",
        "try",
        "gain",
        "hence",
        "punished",
        "next",
        "life",
        "helped",
        "way",
        "future",
        "happiness",
        "together",
        "ce",
        "love",
        "divine",
        "madness",
        "good",
        "thing",
        "therefore",
        "especially",
        "accompanied",
        "philosophical",
        "discussion",
        "erôta",
        "meta",
        "philosophôn",
        "logôn",
        "b",
        "lead",
        "beautiful",
        "form",
        "weas",
        "rational",
        "element",
        "soulstruly",
        "love",
        "crave",
        "question",
        "make",
        "discussion",
        "philosophical",
        "make",
        "sort",
        "included",
        "true",
        "art",
        "love",
        "philosopher",
        "love",
        "beautiful",
        "practice",
        "answer",
        "proposed",
        "must",
        "technê",
        "craft",
        "must",
        "defining",
        "characteristic",
        "one",
        "applied",
        "love",
        "example",
        "must",
        "begin",
        "definition",
        "love",
        "reach",
        "conclusion",
        "ordering",
        "discussion",
        "relation",
        "de",
        "definition",
        "turn",
        "must",
        "established",
        "socrates",
        "refers",
        "collection",
        "division",
        "b",
        "collection",
        "process",
        "perceiving",
        "together",
        "bringing",
        "one",
        "form",
        "item",
        "scattered",
        "many",
        "place",
        "d",
        "process",
        "unlike",
        "animal",
        "able",
        "engage",
        "soul",
        "include",
        "rational",
        "element",
        "prior",
        "acquaintance",
        "form",
        "soul",
        "never",
        "prenatally",
        "saw",
        "true",
        "take",
        "human",
        "shape",
        "since",
        "human",
        "must",
        "understand",
        "said",
        "relation",
        "form",
        "reached",
        "many",
        "senseperceptions",
        "collected",
        "one",
        "reasoning",
        "bc",
        "useful",
        "compare",
        "description",
        "one",
        "given",
        "aristotle",
        "posterior",
        "analytics",
        "ii",
        "form",
        "reached",
        "way",
        "division",
        "begin",
        "matter",
        "cutting",
        "form",
        "relation",
        "sub",
        "form",
        "relation",
        "natural",
        "joint",
        "e",
        "example",
        "socrates",
        "cite",
        "case",
        "love",
        "single",
        "body",
        "naturally",
        "part",
        "pair",
        "member",
        "pair",
        "name",
        "labeled",
        "respectively",
        "left",
        "right",
        "two",
        "speech",
        "regarded",
        "madness",
        "naturally",
        "single",
        "form",
        "u",
        "one",
        "socrates",
        "reorganized",
        "version",
        "lysias",
        "attack",
        "love",
        "cut",
        "part",
        "left",
        "side",
        "cutting",
        "giving",
        "found",
        "among",
        "part",
        "love",
        "say",
        "lefthanded",
        "abused",
        "full",
        "justice",
        "speech",
        "socrates",
        "defense",
        "love",
        "led",
        "u",
        "part",
        "madness",
        "righthand",
        "side",
        "discovering",
        "exhibiting",
        "love",
        "share",
        "name",
        "divine",
        "praised",
        "cause",
        "greatest",
        "good",
        "eb",
        "thus",
        "speech",
        "tell",
        "half",
        "story",
        "two",
        "together",
        "show",
        "correct",
        "division",
        "proceed",
        "goal",
        "however",
        "truth",
        "correctness",
        "explanatory",
        "adequacy",
        "thus",
        "form",
        "question",
        "simple",
        "considerwhat",
        "natural",
        "capacity",
        "acting",
        "acted",
        "upon",
        "complex",
        "count",
        "subforms",
        "consider",
        "thing",
        "simple",
        "one",
        "d",
        "socratesthe",
        "archetypal",
        "searcher",
        "explanatory",
        "definition",
        "euthyphro",
        "de",
        "should",
        "pronounce",
        "lover",
        "division",
        "collection",
        "surprise",
        "therefore",
        "b",
        "philosophy",
        "aim",
        "true",
        "definition",
        "true",
        "story",
        "based",
        "also",
        "aim",
        "persuasion",
        "since",
        "philosophical",
        "lover",
        "want",
        "persuade",
        "boy",
        "follow",
        "path",
        "form",
        "philosophy",
        "rhetoric",
        "must",
        "thus",
        "go",
        "together",
        "mean",
        "rhetoric",
        "must",
        "developed",
        "technê",
        "must",
        "first",
        "distinguish",
        "give",
        "definition",
        "various",
        "kind",
        "soul",
        "kind",
        "speech",
        "revealing",
        "respective",
        "capacity",
        "susceptibility",
        "second",
        "coordinate",
        "kind",
        "soul",
        "kind",
        "speech",
        "appropriate",
        "explaining",
        "one",
        "kind",
        "soul",
        "necessarily",
        "convinced",
        "one",
        "kind",
        "speech",
        "another",
        "b",
        "mastery",
        "science",
        "however",
        "requires",
        "one",
        "thing",
        "student",
        "must",
        "observe",
        "thing",
        "real",
        "life",
        "actually",
        "put",
        "practice",
        "able",
        "follow",
        "keen",
        "perception",
        "de",
        "enough",
        "word",
        "know",
        "kind",
        "speech",
        "affect",
        "kind",
        "soul",
        "philosophical",
        "rhetorician",
        "must",
        "also",
        "know",
        "man",
        "front",
        "kind",
        "able",
        "talk",
        "kind",
        "way",
        "prove",
        "convincing",
        "eb"
    ]
}