{
    "main_text": "A Feature of Momentary Experience || Rejections of the Simple Picture\n1.2 Rejections of the Simple Picture\n\nThe last great nineteenth century utilitarian moral philosopher, Henry\nSidgwick, failed to find any constant felt feature in his experience\nof pleasure. He therefore proposed that “pleasure” picks\nout momentary experiences not by any specific introspected quality but\nrather by their intrinsic desirability, as may be cognitively\napprehended at the time of experiencing (Sidgwick 1907, pp.\n125–31, 111–5). He thus took the concept of pleasure to be\nirreducibly evaluative and normative, but still to apply to\nexperience; experience is pleasant to the extent it wholly grounds\nreasons to desire, seek, or actualize it merely in how it feels.\nMid-twentieth-century British and American philosophers departed still\nfarther from the simple picture and associated empiricist traditions,\ninfluenced in part by behaviorism in psychology.\n\nGilbert Ryle (1949, 1954a, 1954b) accordingly argued that\n“pleasure” designates no occurrent experiences at all, but\n(in a central use) heedfully performed activities fulfilling unopposed\ndispositional inclinations and (in others) equally dispositional\ndisturbances of, or else liabilities to, such\n dispositions.[4]\n The preferred first of these was a near transposition of Aristotle’s\naccount of pleasure (in NE VII) as the unimpeded conduct of\nactivities into the language of dispositions to behavior or action\n(since heed, or attention, was also taken dispositionally).\nRyle’s logical dispositionalism was soon rejected (Nowell-Smith\n1954, Penelhum 1957, Armstrong 1968, Lyons 1980). His constructive\nsuggestion that pleasure be understood as a form of heed, attention,\nor interest builds on Aristotle’s observation that pleasure\nstrengthens specific activities in competition with others and his\narguing from this that pleasure varies in kind with the different\nactivities on which it depends, each being strengthened by its own\npleasures but weakened by others and also weakened by its own pains\n(NE X, 5:1175b1–24). On Ryle’s view, this is\nbecause to do something with pleasure just is to do it wholeheartedly\nand with one’s absorption in it undistracted by other activities\nor by feelings of any kind.\n\nJustin Gosling, insightfully appraising the Ryle-inspired literature\ntoward the end of its run, argued that it had largely missed the\nethical and psychological importance of pleasure by neglecting the\nconceptually central cases of positive emotion and mood. (For a\nforthright denial of pleasant occurrent mood, see Taylor 1963.) He\nconcluded that our being pleased in these ways shows pleasure to be,\nin a relaxed way of speaking, a feeling, after all, and that the\nconcept is extended from these cases to include enjoyments that may\nplease one at the time or else cause or dispose one to be pleased\nlater. Wanting things for their own sake, which hedonists often seek\nto explain in terms of their being pleasant, is actually connected to\nthe central cases through its often being caused by being pleased at\nsome prospect. While Gosling used such distinctions to block some\narguments for hedonist theses, he also defended the importance of\npleasure in both moral psychology and ethics (1969, chapters 9 and\n10). \n\nElizabeth Anscombe, like Ryle and his followers, rejected any account\non which pleasure is a context-independent ‘internal\nimpression’, whether affective or sensory. But while Ryle\nsubstituted a neoAristotelian account of enjoyments to fit his\n‘anti-Cartesian’ philosophy of mind, her main reason was\nthat any such feeling or sensation would be quite beside what she took\nto be the concept’s explanatory and reason-implying use. She\ninfluentially judged the concept so obscure and problematic that\ntheories placing weight upon it, such as hedonistic utilitarianism,\nshould be rejected out of hand. John Rawls, quoting her even more\ninfluentially, did just that, abandoning utilitarianism for a more\nconstructivist and less realist approach to\n ethics.[5]\n\nAnscombe (interpreting and expanding on her very brief remarks on\npleasure, guided by the larger context of her 1963/1957 and also by\nher later 1981d/1978) reasoned that since ascribing pleasure gives a\nreason for action, and reasons for action are intelligible only given\na context of intelligible evaluation and motivation that no feeling of\nthe moment could supply, pleasure cannot be anything picked out only\nby how it feels in the moment and regardless of its larger context.\nAttributing pleasure to a subject, rather, involves understanding what\nit is for a subject to regard and behave toward something as good\n(however nonconceptually represented) and this in turn involves\nbackground knowledge of the ways something may intelligibly be\nconsidered good and an object of voluntary pursuit. Thus the\npossession of the concept of pleasure presupposes the presence of a\nrich and contextually embedded concept of the good that no mere\nmomentary qualitative experience could supply. Therefore no such\nexperience could serve as the origin of our concept of pleasure or of\nour concept of good, as empiricists aiming to account for these\nconcepts as acquired from a feeling of pleasure had supposed.\n\nBennett Helm, beginning in the 1990s, developed a positive view much\nin the spirit of Anscombe’s sparse critical remarks, although\nperhaps different in\n detail.[6]\n For Helm (2002), pleasures and pains alike are ‘felt\nevaluations’ that impress themselves on our feeling (in contrast\nto our activity in evaluative judgment) by virtue of larger patterns\nof evaluation, emotion, and motivation they partially constitute. Our\nfeeling pleasure or pain is just our having our attention and\nmotivation directed in this way (1994, 2001a, 2001b, 2009).\n\nWhile Helm’s view of pleasure and pain accommodates\nAnscombe’s constraint that pleasure provide holistically\nintelligible reasons for action and also fits his larger agenda, it\nimplausibly makes a kitten’s or an infant’s hurting from a\nbruised limb or deriving pleasure from nursing depend on their having\nappropriate large patterns of background concerns including, as he\ntells us, in cases of bodily pain, background concerns for the\nintegrity of their bodies (2002, pp. 24–27). If such a\nlarger pattern of concern for one’s body is necessary for the\naffective component of pain, both should together fade away in, for\nexample, a terminally ill patient who now wants mainly a speedy\nnatural death, rather than the continuance of whatever bodily\nintegrity remains. To the extent that someone has predominantly such a\npattern of desire and emotion, it would seem, on this view, that\nsensory pain (or, as Helm has it, the stimulation that would otherwise\nhave been painful) must, as signaling the approach of the desired end,\nbe if not purely then at least on balance pleasant. And in the\nunconflicted limiting case, we need not offer palliative analgesia for\nrelief of pain, since experiencing pain is supposedly unintelligible\nlacking an appropriate larger pattern of desires and emotions. Lacking\nthis, as Helm claims in renewing the ancient Stoic claim about the\nsage under torture, one’s writhing and screaming fail to signify\nthat one is suffering pain (2002, p. 24). No need for morphine to\npalliate any such seeming pain of our patient, it seems. And Richard\nMoran would add that morphine should be equally useless for providing\nthe solace of pleasure, as this similarly always depends on\nappropriately connecting with a patient’s cognitively complex\nnormative space of skills and reasons (Moran 2002, pp. 209–14).\nSuch views may have testable consequences. They may predict that broad\nattitude changes accompany effective antidepresssant therapy and, less\nplausibly, all transient enjoyments and lightening of mood. \n\nBut as Helm perhaps halfway acknowledges by deferring in passing to\nbiological constraints, we may not be as unitary and governed by a\ncoherent pattern of feelings, desires, and evaluative judgments as he\nseems officially to propose. Pleasure and pain sometimes seem to\nimpose themselves on us absent any connection with any large pattern\nof evaluations we can identify with, but rather from below, out of\nproportion to any plausible role in larger patterns of preexisting\nconcerns and standing desires, as when we spontaneously take pleasure\nin a fragrance, sunset, or landscape –or just find\nourselves, unaccountably, in a good mood. In such cases, at least, it\nseems plausible that our relevant concerns and practical reasons are\nsmall and local, centered on the pleasure and perhaps a perception\n(Sidgwick 1907, 127-31, 110-113; Goldstein 1980, 1989, 2002) or\nappearance (Plato and Aristotle, according to Jessica Moss 2012) of\nits goodness, rather than necessarily embedded in a much larger\npackage deal. Even if pleasure is or involves a functional role of\nsome kind, this may be a relatively small and local one of a kind\nshared with simpler animals, constituted by intrinsic functions of\nbrain and\n mind.[7]\n\nHedonists in the grip of the simple picture regard pleasure-seeking as\nuniquely intelligible and demand that all motivated action and all\nreasons for action be fitted to this mold. Opponents who privilege a\nholistic model of evaluation and deliberation may demand, instead,\nthat all feeling be made intelligible in its terms. We should be\nequally skeptical of both demands and also of the claims for special\nand exclusive intelligibility on which they trade. It appears that\naffective experience is present in infants who have as yet no large\npattern of desires and concerns and also in dying people who have lost\nany relevant ones or even the capacity for them. The default\npresumption seems to be that in many cases such as these and of\nordinary ‘simple pleasures’ and of elevated mood as well\nno relevant large integrated pattern of evaluative attitudes or of\naesthetic aptitudes need obtain. We thus have some reason to return to\nsomething closer to the simple picture that retains its momentary\nexperiential core.\n",
    "section_title": "1.2 Rejections of the Simple Picture",
    "entry_title": "Pleasure",
    "hierarchy_title": "Pleasure || A Feature of Momentary Experience || Rejections of the Simple Picture",
    "tokenized_text": [
        "feature",
        "momentary",
        "experience",
        "rejection",
        "simple",
        "picture",
        "rejection",
        "simple",
        "picture",
        "last",
        "great",
        "nineteenth",
        "century",
        "utilitarian",
        "moral",
        "philosopher",
        "henry",
        "sidgwick",
        "failed",
        "find",
        "constant",
        "felt",
        "feature",
        "experience",
        "pleasure",
        "therefore",
        "proposed",
        "pleasure",
        "pick",
        "momentary",
        "experience",
        "specific",
        "introspected",
        "quality",
        "rather",
        "intrinsic",
        "desirability",
        "may",
        "cognitively",
        "apprehended",
        "time",
        "experiencing",
        "sidgwick",
        "pp",
        "thus",
        "took",
        "concept",
        "pleasure",
        "irreducibly",
        "evaluative",
        "normative",
        "still",
        "apply",
        "experience",
        "experience",
        "pleasant",
        "extent",
        "wholly",
        "ground",
        "reason",
        "desire",
        "seek",
        "actualize",
        "merely",
        "feel",
        "midtwentiethcentury",
        "british",
        "american",
        "philosopher",
        "departed",
        "still",
        "farther",
        "simple",
        "picture",
        "associated",
        "empiricist",
        "tradition",
        "influenced",
        "part",
        "behaviorism",
        "psychology",
        "gilbert",
        "ryle",
        "a",
        "b",
        "accordingly",
        "argued",
        "pleasure",
        "designates",
        "occurrent",
        "experience",
        "central",
        "use",
        "heedfully",
        "performed",
        "activity",
        "fulfilling",
        "unopposed",
        "dispositional",
        "inclination",
        "others",
        "equally",
        "dispositional",
        "disturbance",
        "else",
        "liability",
        "disposition",
        "preferred",
        "first",
        "near",
        "transposition",
        "aristotle",
        "account",
        "pleasure",
        "ne",
        "vii",
        "unimpeded",
        "conduct",
        "activity",
        "language",
        "disposition",
        "behavior",
        "action",
        "since",
        "heed",
        "attention",
        "also",
        "taken",
        "dispositionally",
        "ryle",
        "logical",
        "dispositionalism",
        "soon",
        "rejected",
        "nowellsmith",
        "penelhum",
        "armstrong",
        "lyon",
        "constructive",
        "suggestion",
        "pleasure",
        "understood",
        "form",
        "heed",
        "attention",
        "interest",
        "build",
        "aristotle",
        "observation",
        "pleasure",
        "strengthens",
        "specific",
        "activity",
        "competition",
        "others",
        "arguing",
        "pleasure",
        "varies",
        "kind",
        "different",
        "activity",
        "depends",
        "strengthened",
        "pleasure",
        "weakened",
        "others",
        "also",
        "weakened",
        "pain",
        "ne",
        "x",
        "b",
        "ryle",
        "view",
        "something",
        "pleasure",
        "wholeheartedly",
        "one",
        "absorption",
        "undistracted",
        "activity",
        "feeling",
        "kind",
        "justin",
        "gosling",
        "insightfully",
        "appraising",
        "ryleinspired",
        "literature",
        "toward",
        "end",
        "run",
        "argued",
        "largely",
        "missed",
        "ethical",
        "psychological",
        "importance",
        "pleasure",
        "neglecting",
        "conceptually",
        "central",
        "case",
        "positive",
        "emotion",
        "mood",
        "forthright",
        "denial",
        "pleasant",
        "occurrent",
        "mood",
        "see",
        "taylor",
        "concluded",
        "pleased",
        "way",
        "show",
        "pleasure",
        "relaxed",
        "way",
        "speaking",
        "feeling",
        "concept",
        "extended",
        "case",
        "include",
        "enjoyment",
        "may",
        "please",
        "one",
        "time",
        "else",
        "cause",
        "dispose",
        "one",
        "pleased",
        "later",
        "wanting",
        "thing",
        "sake",
        "hedonist",
        "often",
        "seek",
        "explain",
        "term",
        "pleasant",
        "actually",
        "connected",
        "central",
        "case",
        "often",
        "caused",
        "pleased",
        "prospect",
        "gosling",
        "used",
        "distinction",
        "block",
        "argument",
        "hedonist",
        "thesis",
        "also",
        "defended",
        "importance",
        "pleasure",
        "moral",
        "psychology",
        "ethic",
        "chapter",
        "elizabeth",
        "anscombe",
        "like",
        "ryle",
        "follower",
        "rejected",
        "account",
        "pleasure",
        "contextindependent",
        "internal",
        "impression",
        "whether",
        "affective",
        "sensory",
        "ryle",
        "substituted",
        "neoaristotelian",
        "account",
        "enjoyment",
        "fit",
        "anticartesian",
        "philosophy",
        "mind",
        "main",
        "reason",
        "feeling",
        "sensation",
        "would",
        "quite",
        "beside",
        "took",
        "concept",
        "explanatory",
        "reasonimplying",
        "use",
        "influentially",
        "judged",
        "concept",
        "obscure",
        "problematic",
        "theory",
        "placing",
        "weight",
        "upon",
        "hedonistic",
        "utilitarianism",
        "rejected",
        "hand",
        "john",
        "rawls",
        "quoting",
        "even",
        "influentially",
        "abandoning",
        "utilitarianism",
        "constructivist",
        "le",
        "realist",
        "approach",
        "ethic",
        "anscombe",
        "interpreting",
        "expanding",
        "brief",
        "remark",
        "pleasure",
        "guided",
        "larger",
        "context",
        "also",
        "later",
        "d",
        "reasoned",
        "since",
        "ascribing",
        "pleasure",
        "give",
        "reason",
        "action",
        "reason",
        "action",
        "intelligible",
        "given",
        "context",
        "intelligible",
        "evaluation",
        "motivation",
        "feeling",
        "moment",
        "could",
        "supply",
        "pleasure",
        "anything",
        "picked",
        "feel",
        "moment",
        "regardless",
        "larger",
        "context",
        "attributing",
        "pleasure",
        "subject",
        "rather",
        "involves",
        "understanding",
        "subject",
        "regard",
        "behave",
        "toward",
        "something",
        "good",
        "however",
        "nonconceptually",
        "represented",
        "turn",
        "involves",
        "background",
        "knowledge",
        "way",
        "something",
        "may",
        "intelligibly",
        "considered",
        "good",
        "object",
        "voluntary",
        "pursuit",
        "thus",
        "possession",
        "concept",
        "pleasure",
        "presupposes",
        "presence",
        "rich",
        "contextually",
        "embedded",
        "concept",
        "good",
        "mere",
        "momentary",
        "qualitative",
        "experience",
        "could",
        "supply",
        "therefore",
        "experience",
        "could",
        "serve",
        "origin",
        "concept",
        "pleasure",
        "concept",
        "good",
        "empiricist",
        "aiming",
        "account",
        "concept",
        "acquired",
        "feeling",
        "pleasure",
        "supposed",
        "bennett",
        "helm",
        "beginning",
        "s",
        "developed",
        "positive",
        "view",
        "much",
        "spirit",
        "anscombe",
        "sparse",
        "critical",
        "remark",
        "although",
        "perhaps",
        "different",
        "detail",
        "helm",
        "pleasure",
        "pain",
        "alike",
        "felt",
        "evaluation",
        "impress",
        "feeling",
        "contrast",
        "activity",
        "evaluative",
        "judgment",
        "virtue",
        "larger",
        "pattern",
        "evaluation",
        "emotion",
        "motivation",
        "partially",
        "constitute",
        "feeling",
        "pleasure",
        "pain",
        "attention",
        "motivation",
        "directed",
        "way",
        "a",
        "b",
        "helm",
        "view",
        "pleasure",
        "pain",
        "accommodates",
        "anscombe",
        "constraint",
        "pleasure",
        "provide",
        "holistically",
        "intelligible",
        "reason",
        "action",
        "also",
        "fit",
        "larger",
        "agenda",
        "implausibly",
        "make",
        "kitten",
        "infant",
        "hurting",
        "bruised",
        "limb",
        "deriving",
        "pleasure",
        "nursing",
        "depend",
        "appropriate",
        "large",
        "pattern",
        "background",
        "concern",
        "including",
        "tell",
        "u",
        "case",
        "bodily",
        "pain",
        "background",
        "concern",
        "integrity",
        "body",
        "pp",
        "larger",
        "pattern",
        "concern",
        "one",
        "body",
        "necessary",
        "affective",
        "component",
        "pain",
        "together",
        "fade",
        "away",
        "example",
        "terminally",
        "ill",
        "patient",
        "want",
        "mainly",
        "speedy",
        "natural",
        "death",
        "rather",
        "continuance",
        "whatever",
        "bodily",
        "integrity",
        "remains",
        "extent",
        "someone",
        "predominantly",
        "pattern",
        "desire",
        "emotion",
        "would",
        "seem",
        "view",
        "sensory",
        "pain",
        "helm",
        "stimulation",
        "would",
        "otherwise",
        "painful",
        "must",
        "signaling",
        "approach",
        "desired",
        "end",
        "purely",
        "least",
        "balance",
        "pleasant",
        "unconflicted",
        "limiting",
        "case",
        "need",
        "offer",
        "palliative",
        "analgesia",
        "relief",
        "pain",
        "since",
        "experiencing",
        "pain",
        "supposedly",
        "unintelligible",
        "lacking",
        "appropriate",
        "larger",
        "pattern",
        "desire",
        "emotion",
        "lacking",
        "helm",
        "claim",
        "renewing",
        "ancient",
        "stoic",
        "claim",
        "sage",
        "torture",
        "one",
        "writhing",
        "screaming",
        "fail",
        "signify",
        "one",
        "suffering",
        "pain",
        "p",
        "need",
        "morphine",
        "palliate",
        "seeming",
        "pain",
        "patient",
        "seems",
        "richard",
        "moran",
        "would",
        "add",
        "morphine",
        "equally",
        "useless",
        "providing",
        "solace",
        "pleasure",
        "similarly",
        "always",
        "depends",
        "appropriately",
        "connecting",
        "patient",
        "cognitively",
        "complex",
        "normative",
        "space",
        "skill",
        "reason",
        "moran",
        "pp",
        "view",
        "may",
        "testable",
        "consequence",
        "may",
        "predict",
        "broad",
        "attitude",
        "change",
        "accompany",
        "effective",
        "antidepresssant",
        "therapy",
        "le",
        "plausibly",
        "transient",
        "enjoyment",
        "lightening",
        "mood",
        "helm",
        "perhaps",
        "halfway",
        "acknowledges",
        "deferring",
        "passing",
        "biological",
        "constraint",
        "may",
        "unitary",
        "governed",
        "coherent",
        "pattern",
        "feeling",
        "desire",
        "evaluative",
        "judgment",
        "seems",
        "officially",
        "propose",
        "pleasure",
        "pain",
        "sometimes",
        "seem",
        "impose",
        "u",
        "absent",
        "connection",
        "large",
        "pattern",
        "evaluation",
        "identify",
        "rather",
        "proportion",
        "plausible",
        "role",
        "larger",
        "pattern",
        "preexisting",
        "concern",
        "standing",
        "desire",
        "spontaneously",
        "take",
        "pleasure",
        "fragrance",
        "sunset",
        "landscape",
        "or",
        "find",
        "unaccountably",
        "good",
        "mood",
        "case",
        "least",
        "seems",
        "plausible",
        "relevant",
        "concern",
        "practical",
        "reason",
        "small",
        "local",
        "centered",
        "pleasure",
        "perhaps",
        "perception",
        "sidgwick",
        "goldstein",
        "appearance",
        "plato",
        "aristotle",
        "according",
        "jessica",
        "moss",
        "goodness",
        "rather",
        "necessarily",
        "embedded",
        "much",
        "larger",
        "package",
        "deal",
        "even",
        "pleasure",
        "involves",
        "functional",
        "role",
        "kind",
        "may",
        "relatively",
        "small",
        "local",
        "one",
        "kind",
        "shared",
        "simpler",
        "animal",
        "constituted",
        "intrinsic",
        "function",
        "brain",
        "mind",
        "hedonist",
        "grip",
        "simple",
        "picture",
        "regard",
        "pleasureseeking",
        "uniquely",
        "intelligible",
        "demand",
        "motivated",
        "action",
        "reason",
        "action",
        "fitted",
        "mold",
        "opponent",
        "privilege",
        "holistic",
        "model",
        "evaluation",
        "deliberation",
        "may",
        "demand",
        "instead",
        "feeling",
        "made",
        "intelligible",
        "term",
        "equally",
        "skeptical",
        "demand",
        "also",
        "claim",
        "special",
        "exclusive",
        "intelligibility",
        "trade",
        "appears",
        "affective",
        "experience",
        "present",
        "infant",
        "yet",
        "large",
        "pattern",
        "desire",
        "concern",
        "also",
        "dying",
        "people",
        "lost",
        "relevant",
        "one",
        "even",
        "capacity",
        "default",
        "presumption",
        "seems",
        "many",
        "case",
        "ordinary",
        "simple",
        "pleasure",
        "elevated",
        "mood",
        "well",
        "relevant",
        "large",
        "integrated",
        "pattern",
        "evaluative",
        "attitude",
        "aesthetic",
        "aptitude",
        "need",
        "obtain",
        "thus",
        "reason",
        "return",
        "something",
        "closer",
        "simple",
        "picture",
        "retains",
        "momentary",
        "experiential",
        "core"
    ]
}