{
    "main_text": "Ethics and Politics\n6. Ethics and Politics\n\n\nPlutarch shares the view of Hellenistic philosophers that philosophy\nis a way of life. He is much concerned to advocate the life according\nto Plato, and to show that such life is possible and indeed happy (Adv.\nCol. 1107E, Non posse suaviter vivi 1086C-D). He\ncriticizes Stoics and Epicureans for proposing misguided ethical ideals\n(e.g. An recte dictum sit latenter esse vivendum 1129F-1130E).\nPlutarch's strong concern with ethics is reflected also in his\nLives, which focus on the character of a historical figure.\nCentral to these is how man's nature (physis) can be\neducated so that a certain state of character is formed\n(êthos; Pericles 38, Alcibiades 2.1, De\nsera 551E-F, 552C-D; Russell 1973, 105-106, 117). Plutarch's\nespecially strong interest in ethics among the sub-fields of philosophy\nis characteristic of his age. The two most prominent of\nPlutarch's Stoic contemporaries or near-contemporaries, Epictetus\nand Seneca, devote most of their attention in their writings to ethics,\nand this is the case also with the Peripatetic Aristocles of Messene\n(1st c. CE?), the author of some eight books on ethics (Suda\ns.v. Aristocles). To some extent, this especially strong\ninterest in ethics goes back to Antiochus (1st c. BCE).\nPlutarch and the Peripatetic Aristocles identify ethical formation as\nthe ultimate goal of philosophy, yet Plutarch at least differs from Antiochus in\nthat he founds his ethics on metaphysics, largely based on his\ninterpretation of the Timaeus outlined above (sect. 4.1). It is because Plutarch\nmaintains the existence of an intelligible world, which has shaped the\nsensible world including humans, that he rejects the ethics of both\nStoics and Epicureans. On the basis of the Phaedrus and the\nTimaeus, Plutarch maintains that both the human intellect and the\nhuman soul stem from the intelligible realm, the indivisible and the\ndivisible being respectively, which shapes our human nature accordingly\n(cf. Plat. Quest. 1001C).\n\nPlutarch argues that the crucial difference between the Platonic and\nthe Stoic understanding of virtue is grounded in their different\nconceptions of soul as the source of human agency (De virtute\nmorali 441C-E). While for the Stoics soul is reason only,\nPlutarch defends the conception of soul outlined in the\nRepublic (esp. book 4), which presents the soul as consisting\nof rational and non-rational parts. As explained above (sect. 4), this\nfits well with Plutarch's interpretation of the creation of the\nworld, according to which the pre-cosmic non-rational world soul is\ninformed by the reason (logos) of the divine demiurge, yet\nthis is not sufficient to eliminate its natural non-rationality. The\nnon-rational aspect of the human soul accounts for emotions and bodily\ndesires (Opsomer 1994, 41). In fact, however, Plutarch does not lump\ntogether bodily desires and emotions as constituting an\nundifferentiated non-rational part. Given the theory of\nRepublic 4, Plutarch distinguishes spirit, as responsible for\nemotions, from appetite, which is responsible for bodily desires. But he\nclasses them together to the extent that both are dependent upon\nreason, sensitive to, and nurtured by, it (De virtute morali\n443C-D; Plat. Quest. 1008A-B). Plutarch describes virtue\n(without mentioning appetite) as the state in which reason succeeds in\nmanaging emotion and drives it in the right direction (De virtute\nmorali 443B-D, 444B-C, 451C-E), while vice arises when emotion is\nnot properly informed by reason (443D). Plutarch defines virtue as the\nstate in which emotion is present as matter and reason as form (440D),\na definition inspired by Nicomachean Ethics 1104b13–30 (cf.\nAspasius, In Ethica Nicomachea 42.20–25). Plutarch's\ndefinition of virtue matches his account of how the world came into\nbeing, when matter was informed by reason. As with the world soul,\nsimilarly with the human soul in Plutarch's view, the impact of reason is possible because\nthe soul, or part thereof, can heed what reason dictates.\n\nInterestingly, Plutarch does not refer to the Timaeus to support his theory\nof the tripartite soul, but rather to Aristotle (De virtute morali 442B-C), whom\nPlutarch, like most ancient and modern commentators, recognizes as\nadopting essential aspects of Plato's doctrine. The essential\nfeature that Aristotle shares with Plato is the belief in rational and\nnon-rational aspects of the soul. This accounts for unself-controlled\nactions that, Plutarch thinks, prove how mistaken is the Stoic\nconception of human agency as deriving from reason alone. Plutarch also\nrelies largely on Aristotle's Nicomachean Ethics with\nregard to the nature of virtue. He describes virtue as being an extreme\nof excellence (akrotês), which however lies in a mean,\ndetermined by reason, between two opposite emotions (De virtute\nmorali 443D-444D; Nicomachean Ethics 1107a6-8). Plutarch\nargues that there can be no virtue without some emotion. Without some\namount of fear, Plutarch contends, there can be no courage, for\ninstance (De virtute morali 451E-452A); courage, he claims, is the virtue\nthat one acquires when, in a state of fear, one manages to\nsubordinate fear to a goal set by reason, such as fighting for\none's country; in this sense, emotion is an ally to reason in\nconstituting virtue (cf. De tranq. animi 471D). Plutarch\nsuggests this specifically in the case of anger becoming bravery\n(De ira fr. 148 Sandbach). Anger, when moderated and guided by\nreason, can also motivate reasonable and due vengeance (De\nsera 551A-B).\n\nSince virtue is the state (hexis 443D) in which emotion is\nguided by reason, it follows that virtue requires training in how to\nmake emotion right. Plutarch devotes an entire treatise to that\nsubject (De profectibus in virtute). He defends, against the\nStoics, the view that progress in virtue is possible (ignoring the\nrelevant views of Epictetus, Dissertations I.4 and Seneca,\nLetters to Lucilius 75.8). Education in virtue can be\nprovided by parents and teachers, by the example of the virtuous\nactions of the people around us (De communibus notitiis\n1069A), by the law of the cities (De virtute morali 452D),\nand also by philosophy, poetry and history (De profectibus\n79B-80B). Plutarch tries indeed to offer such an education in virtue\nthrough his writings that have practical orientation, such as On\nthe Control of Anger, On Curiosity, How Could you Tell a Flatterer\nfrom a Friend, Precepts of Marriage, To an Uneducated Ruler (see\nVan Hoof 2010), which are similar in spirit with the works of\nPhilodemus On Property Management, On the Good Ruler according to\nHomer and Seneca's Letters to Lucilius. Plutarch\nmaintains that the pervasion of emotion by reason should be thorough,\nwhich is why he claims that the temperate person is less virtuous than\nthe practically wise one (phronimos), who does the good\nwithout wavering (De virtute morali 445C-D;\ncf. Nicomachean Ethics 1151b23–1152a3), as a temperate\nperson might. To the extent that virtue reflects the operation of\nreason in the human soul, which is capable of following reason,\nvirtue, Plutarch argues, is natural to us. He argues that nature\nitself attracts us (oikeiousa) to things which are natural\nfor us to strive for, but these include also life, health, beauty,\nwhich Plutarch considers as completing happiness\n(symplêrotika, De communibus notitiis\n1060B-E). Plutarch censures the Stoics because they argue that the\nfinal human end is to live in accordance with nature, but, he claims,\nthey contradict themselves when they admit only virtue as being good,\nneglecting all other things which are, by everyone's admission, good\nfor us, such as health. Plutarch, like Antiochus, maintains that the\nhuman final end includes the satisfaction of primary demands of the\nbody, a doctrine Plutarch finds in Aristotle, Xenocrates and Polemo\n(De communibus notitiis 1069E-F).\n\nThis, however, is not the only conception of happiness that Plutarch\nadvocates. While he argues against the Stoics that a life of thinking\nonly, devoid of all affection, cannot be happy (De tranq.\nanimi 468D), he also defends an alternative end for human life,\nwhich consists in a life of theoria (an Aristotelian term\nmeaning contemplative knowing) or, in Plutarch's words,\nepopteia (a religious term referring to the final vision\nachieved in initiation ceremonies for mystery religions; De\nIside 382D-E; cf. Quaestiones Convivales\n718d). Formally, the end that Plutarch advocates for human beings is,\nas he says, a life similar to god (De sera 550D-E). This end\nis suggested in the several eschatological stories found in Plutarch's\nwork, which suggest that a human being can transcend the sensible\nworld and become united with the divine (see Alt 1993,\n185–204). This doctrine, which has its roots in the\nPhaedo, the Theaetetus and Republic X, is\nagain to be understood against Plutarch's interpretation of the\ncosmogony of the Timaeus. The “younger gods” of\nthe Timaeus imitate the demiurge in constructing human\nbeings' and the other animals' bodies and souls (40b-d, 42e), and this\nis also the case with nature, which strives to imitate the creator and\nbecome like him (De facie 944; Helmig 2005,\n21–23). This assimilation with god (homoiôsis)\namounts to the complete domination of the intelligible aspect of\nhumans over the sensible one. Humans are invited to follow the cosmic\nexample and in this sense to live in accordance with nature too. To\nachieve this, one should let his intellect rule and get beyond having\nany emotions.  This amounts to having and exercising theoretical\nvirtue alone, which pertains to the intellect (Non posse suaviter\nvivi 1092E). The practical virtues that pertain to the embodied\nsoul are achieved, according to Plutarch, through the subordination of\nemotion to reason (Tyrwitt frs. p. 68 Sandbach). Plutarch's\ndistinction between a life of happiness through theorizing or\ncontemplation and a practical life of happiness is made in his On\nMoral Virtue, apparently inspired by the relevant Aristotelian\ndistinction in Nicomachean Ethics. Plutarch suggests that his\ntheoretical ideal does not only require a distinct kind of virtue but\nalso determines a distinct kind of happiness. In this Plutarch\nanticipates Plotinus' distinction of two kinds of ethical life, a\npolitical and a theoretical one. For Plutarch, however, the\ntheoretical ideal of the philosopher involves a political dimension\ntoo, which is to help their fellow citizens and the city with his\nreasoning, as is suggested in the Republic, and he criticizes\nboth Stoics and Epicureans for refusing to engage in politics (De\nStoic. rep.  1033A–1034C, Adv. Col.\n1126B–1127E, Ad Princ. Inerud. 780C–F).\n",
    "section_title": "6. Ethics and Politics",
    "entry_title": "Plutarch",
    "hierarchy_title": "Plutarch || Ethics and Politics",
    "tokenized_text": [
        "ethic",
        "politics",
        "ethic",
        "politics",
        "plutarch",
        "share",
        "view",
        "hellenistic",
        "philosopher",
        "philosophy",
        "way",
        "life",
        "much",
        "concerned",
        "advocate",
        "life",
        "according",
        "plato",
        "show",
        "life",
        "possible",
        "indeed",
        "happy",
        "adv",
        "col",
        "e",
        "non",
        "posse",
        "suaviter",
        "vivi",
        "cd",
        "criticizes",
        "stoic",
        "epicurean",
        "proposing",
        "misguided",
        "ethical",
        "ideal",
        "eg",
        "recte",
        "dictum",
        "sit",
        "latenter",
        "esse",
        "vivendum",
        "fe",
        "plutarch",
        "s",
        "strong",
        "concern",
        "ethic",
        "reflected",
        "also",
        "life",
        "focus",
        "character",
        "historical",
        "figure",
        "central",
        "man",
        "s",
        "nature",
        "physis",
        "educated",
        "certain",
        "state",
        "character",
        "formed",
        "êthos",
        "pericles",
        "alcibiades",
        "de",
        "serum",
        "ef",
        "cd",
        "russell",
        "plutarch",
        "s",
        "especially",
        "strong",
        "interest",
        "ethic",
        "among",
        "subfields",
        "philosophy",
        "characteristic",
        "age",
        "two",
        "prominent",
        "plutarch",
        "s",
        "stoic",
        "contemporary",
        "nearcontemporaries",
        "epictetus",
        "seneca",
        "devote",
        "attention",
        "writing",
        "ethic",
        "case",
        "also",
        "peripatetic",
        "aristocles",
        "messene",
        "st",
        "c",
        "ce",
        "author",
        "eight",
        "book",
        "ethic",
        "suda",
        "sv",
        "aristocles",
        "extent",
        "especially",
        "strong",
        "interest",
        "ethic",
        "go",
        "back",
        "antiochus",
        "st",
        "c",
        "bce",
        "plutarch",
        "peripatetic",
        "aristocles",
        "identify",
        "ethical",
        "formation",
        "ultimate",
        "goal",
        "philosophy",
        "yet",
        "plutarch",
        "least",
        "differs",
        "antiochus",
        "found",
        "ethic",
        "metaphysics",
        "largely",
        "based",
        "interpretation",
        "timaeus",
        "outlined",
        "sect",
        "plutarch",
        "maintains",
        "existence",
        "intelligible",
        "world",
        "shaped",
        "sensible",
        "world",
        "including",
        "human",
        "reject",
        "ethic",
        "stoic",
        "epicurean",
        "basis",
        "phaedrus",
        "timaeus",
        "plutarch",
        "maintains",
        "human",
        "intellect",
        "human",
        "soul",
        "stem",
        "intelligible",
        "realm",
        "indivisible",
        "divisible",
        "respectively",
        "shape",
        "human",
        "nature",
        "accordingly",
        "cf",
        "plat",
        "quest",
        "c",
        "plutarch",
        "argues",
        "crucial",
        "difference",
        "platonic",
        "stoic",
        "understanding",
        "virtue",
        "grounded",
        "different",
        "conception",
        "soul",
        "source",
        "human",
        "agency",
        "de",
        "virtute",
        "morali",
        "ce",
        "stoic",
        "soul",
        "reason",
        "plutarch",
        "defends",
        "conception",
        "soul",
        "outlined",
        "republic",
        "esp",
        "book",
        "present",
        "soul",
        "consisting",
        "rational",
        "nonrational",
        "part",
        "explained",
        "sect",
        "fit",
        "well",
        "plutarch",
        "s",
        "interpretation",
        "creation",
        "world",
        "according",
        "precosmic",
        "nonrational",
        "world",
        "soul",
        "informed",
        "reason",
        "logo",
        "divine",
        "demiurge",
        "yet",
        "sufficient",
        "eliminate",
        "natural",
        "nonrationality",
        "nonrational",
        "aspect",
        "human",
        "soul",
        "account",
        "emotion",
        "bodily",
        "desire",
        "opsomer",
        "fact",
        "however",
        "plutarch",
        "lump",
        "together",
        "bodily",
        "desire",
        "emotion",
        "constituting",
        "undifferentiated",
        "nonrational",
        "part",
        "given",
        "theory",
        "republic",
        "plutarch",
        "distinguishes",
        "spirit",
        "responsible",
        "emotion",
        "appetite",
        "responsible",
        "bodily",
        "desire",
        "class",
        "together",
        "extent",
        "dependent",
        "upon",
        "reason",
        "sensitive",
        "nurtured",
        "de",
        "virtute",
        "morali",
        "cd",
        "plat",
        "quest",
        "ab",
        "plutarch",
        "describes",
        "virtue",
        "without",
        "mentioning",
        "appetite",
        "state",
        "reason",
        "succeeds",
        "managing",
        "emotion",
        "drive",
        "right",
        "direction",
        "de",
        "virtute",
        "morali",
        "bd",
        "bc",
        "ce",
        "vice",
        "arises",
        "emotion",
        "properly",
        "informed",
        "reason",
        "d",
        "plutarch",
        "defines",
        "virtue",
        "state",
        "emotion",
        "present",
        "matter",
        "reason",
        "form",
        "d",
        "definition",
        "inspired",
        "nicomachean",
        "ethic",
        "b",
        "cf",
        "aspasius",
        "ethica",
        "nicomachea",
        "plutarch",
        "s",
        "definition",
        "virtue",
        "match",
        "account",
        "world",
        "came",
        "matter",
        "informed",
        "reason",
        "world",
        "soul",
        "similarly",
        "human",
        "soul",
        "plutarch",
        "s",
        "view",
        "impact",
        "reason",
        "possible",
        "soul",
        "part",
        "thereof",
        "heed",
        "reason",
        "dictate",
        "interestingly",
        "plutarch",
        "refer",
        "timaeus",
        "support",
        "theory",
        "tripartite",
        "soul",
        "rather",
        "aristotle",
        "de",
        "virtute",
        "morali",
        "bc",
        "plutarch",
        "like",
        "ancient",
        "modern",
        "commentator",
        "recognizes",
        "adopting",
        "essential",
        "aspect",
        "plato",
        "s",
        "doctrine",
        "essential",
        "feature",
        "aristotle",
        "share",
        "plato",
        "belief",
        "rational",
        "nonrational",
        "aspect",
        "soul",
        "account",
        "unselfcontrolled",
        "action",
        "plutarch",
        "think",
        "prove",
        "mistaken",
        "stoic",
        "conception",
        "human",
        "agency",
        "deriving",
        "reason",
        "alone",
        "plutarch",
        "also",
        "relies",
        "largely",
        "aristotle",
        "s",
        "nicomachean",
        "ethic",
        "regard",
        "nature",
        "virtue",
        "describes",
        "virtue",
        "extreme",
        "excellence",
        "akrotês",
        "however",
        "lie",
        "mean",
        "determined",
        "reason",
        "two",
        "opposite",
        "emotion",
        "de",
        "virtute",
        "morali",
        "dd",
        "nicomachean",
        "ethic",
        "a",
        "plutarch",
        "argues",
        "virtue",
        "without",
        "emotion",
        "without",
        "amount",
        "fear",
        "plutarch",
        "contends",
        "courage",
        "instance",
        "de",
        "virtute",
        "morali",
        "ea",
        "courage",
        "claim",
        "virtue",
        "one",
        "acquires",
        "state",
        "fear",
        "one",
        "manages",
        "subordinate",
        "fear",
        "goal",
        "set",
        "reason",
        "fighting",
        "one",
        "s",
        "country",
        "sense",
        "emotion",
        "ally",
        "reason",
        "constituting",
        "virtue",
        "cf",
        "de",
        "tranq",
        "animi",
        "d",
        "plutarch",
        "suggests",
        "specifically",
        "case",
        "anger",
        "becoming",
        "bravery",
        "de",
        "ira",
        "fr",
        "sandbach",
        "anger",
        "moderated",
        "guided",
        "reason",
        "also",
        "motivate",
        "reasonable",
        "due",
        "vengeance",
        "de",
        "serum",
        "ab",
        "since",
        "virtue",
        "state",
        "hexis",
        "d",
        "emotion",
        "guided",
        "reason",
        "follows",
        "virtue",
        "requires",
        "training",
        "make",
        "emotion",
        "right",
        "plutarch",
        "devotes",
        "entire",
        "treatise",
        "subject",
        "de",
        "profectibus",
        "virtute",
        "defends",
        "stoic",
        "view",
        "progress",
        "virtue",
        "possible",
        "ignoring",
        "relevant",
        "view",
        "epictetus",
        "dissertation",
        "i",
        "seneca",
        "letter",
        "lucilius",
        "education",
        "virtue",
        "provided",
        "parent",
        "teacher",
        "example",
        "virtuous",
        "action",
        "people",
        "around",
        "u",
        "de",
        "communibus",
        "notitiis",
        "a",
        "law",
        "city",
        "de",
        "virtute",
        "morali",
        "d",
        "also",
        "philosophy",
        "poetry",
        "history",
        "de",
        "profectibus",
        "bb",
        "plutarch",
        "try",
        "indeed",
        "offer",
        "education",
        "virtue",
        "writing",
        "practical",
        "orientation",
        "control",
        "anger",
        "curiosity",
        "could",
        "tell",
        "flatterer",
        "friend",
        "precept",
        "marriage",
        "uneducated",
        "ruler",
        "see",
        "van",
        "hoof",
        "similar",
        "spirit",
        "work",
        "philodemus",
        "property",
        "management",
        "good",
        "ruler",
        "according",
        "homer",
        "seneca",
        "s",
        "letter",
        "lucilius",
        "plutarch",
        "maintains",
        "pervasion",
        "emotion",
        "reason",
        "thorough",
        "claim",
        "temperate",
        "person",
        "le",
        "virtuous",
        "practically",
        "wise",
        "one",
        "phronimos",
        "good",
        "without",
        "wavering",
        "de",
        "virtute",
        "morali",
        "cd",
        "cf",
        "nicomachean",
        "ethic",
        "ba",
        "temperate",
        "person",
        "might",
        "extent",
        "virtue",
        "reflects",
        "operation",
        "reason",
        "human",
        "soul",
        "capable",
        "following",
        "reason",
        "virtue",
        "plutarch",
        "argues",
        "natural",
        "u",
        "argues",
        "nature",
        "attracts",
        "u",
        "oikeiousa",
        "thing",
        "natural",
        "u",
        "strive",
        "include",
        "also",
        "life",
        "health",
        "beauty",
        "plutarch",
        "considers",
        "completing",
        "happiness",
        "symplêrotika",
        "de",
        "communibus",
        "notitiis",
        "be",
        "plutarch",
        "censure",
        "stoic",
        "argue",
        "final",
        "human",
        "end",
        "live",
        "accordance",
        "nature",
        "claim",
        "contradict",
        "admit",
        "virtue",
        "good",
        "neglecting",
        "thing",
        "everyone",
        "s",
        "admission",
        "good",
        "u",
        "health",
        "plutarch",
        "like",
        "antiochus",
        "maintains",
        "human",
        "final",
        "end",
        "includes",
        "satisfaction",
        "primary",
        "demand",
        "body",
        "doctrine",
        "plutarch",
        "find",
        "aristotle",
        "xenocrates",
        "polemo",
        "de",
        "communibus",
        "notitiis",
        "ef",
        "however",
        "conception",
        "happiness",
        "plutarch",
        "advocate",
        "argues",
        "stoic",
        "life",
        "thinking",
        "devoid",
        "affection",
        "happy",
        "de",
        "tranq",
        "animi",
        "d",
        "also",
        "defends",
        "alternative",
        "end",
        "human",
        "life",
        "consists",
        "life",
        "theoria",
        "aristotelian",
        "term",
        "meaning",
        "contemplative",
        "knowing",
        "plutarch",
        "s",
        "word",
        "epopteia",
        "religious",
        "term",
        "referring",
        "final",
        "vision",
        "achieved",
        "initiation",
        "ceremony",
        "mystery",
        "religion",
        "de",
        "iside",
        "de",
        "cf",
        "quaestiones",
        "convivales",
        "d",
        "formally",
        "end",
        "plutarch",
        "advocate",
        "human",
        "being",
        "say",
        "life",
        "similar",
        "god",
        "de",
        "serum",
        "de",
        "end",
        "suggested",
        "several",
        "eschatological",
        "story",
        "found",
        "plutarch",
        "s",
        "work",
        "suggest",
        "human",
        "transcend",
        "sensible",
        "world",
        "become",
        "united",
        "divine",
        "see",
        "alt",
        "doctrine",
        "root",
        "phaedo",
        "theaetetus",
        "republic",
        "x",
        "understood",
        "plutarch",
        "s",
        "interpretation",
        "cosmogony",
        "timaeus",
        "younger",
        "god",
        "timaeus",
        "imitate",
        "demiurge",
        "constructing",
        "human",
        "being",
        "animal",
        "body",
        "soul",
        "bd",
        "e",
        "also",
        "case",
        "nature",
        "strives",
        "imitate",
        "creator",
        "become",
        "like",
        "de",
        "facie",
        "helmig",
        "assimilation",
        "god",
        "homoiôsis",
        "amount",
        "complete",
        "domination",
        "intelligible",
        "aspect",
        "human",
        "sensible",
        "one",
        "human",
        "invited",
        "follow",
        "cosmic",
        "example",
        "sense",
        "live",
        "accordance",
        "nature",
        "achieve",
        "one",
        "let",
        "intellect",
        "rule",
        "get",
        "beyond",
        "emotion",
        "amount",
        "exercising",
        "theoretical",
        "virtue",
        "alone",
        "pertains",
        "intellect",
        "non",
        "posse",
        "suaviter",
        "vivi",
        "e",
        "practical",
        "virtue",
        "pertain",
        "embodied",
        "soul",
        "achieved",
        "according",
        "plutarch",
        "subordination",
        "emotion",
        "reason",
        "tyrwitt",
        "fr",
        "p",
        "sandbach",
        "plutarch",
        "s",
        "distinction",
        "life",
        "happiness",
        "theorizing",
        "contemplation",
        "practical",
        "life",
        "happiness",
        "made",
        "moral",
        "virtue",
        "apparently",
        "inspired",
        "relevant",
        "aristotelian",
        "distinction",
        "nicomachean",
        "ethic",
        "plutarch",
        "suggests",
        "theoretical",
        "ideal",
        "require",
        "distinct",
        "kind",
        "virtue",
        "also",
        "determines",
        "distinct",
        "kind",
        "happiness",
        "plutarch",
        "anticipates",
        "plotinus",
        "distinction",
        "two",
        "kind",
        "ethical",
        "life",
        "political",
        "theoretical",
        "one",
        "plutarch",
        "however",
        "theoretical",
        "ideal",
        "philosopher",
        "involves",
        "political",
        "dimension",
        "help",
        "fellow",
        "citizen",
        "city",
        "reasoning",
        "suggested",
        "republic",
        "criticizes",
        "stoic",
        "epicurean",
        "refusing",
        "engage",
        "politics",
        "de",
        "stoic",
        "rep",
        "ac",
        "adv",
        "col",
        "be",
        "ad",
        "princ",
        "inerud",
        "cf"
    ]
}