{
    "main_text": "Plutarch's Platonism\n2. Plutarch's Platonism\n\n\nPlutarch lived in the wake of the revival of the dogmatic\ninterpretation of Plato begun by Antiochus and Eudorus in the\n1st c. BCE, which in a way he continues. Plutarch, however,\nshows a more complex philosophical profile, apparently through\ndeveloping the version of Academic skepticism defended by Antiochus'\ncontemporary Philo of Larissa and also (slightly later) Cicero. He\nstrives for a synthesis of the skeptical interpretation of Plato,\ndefended by the Academic skeptics Arcesilaus, Carneades and Philo,\nwith that of Antiochus' dogmatic interpretation, according to which\nPlato held doctrines of his own. Thus Plutarch objects to the\ndistinction that Antiochus suggested between Socratic and Platonic\nphilosophy and the corresponding division of Plato's dialogues into\nSocratic/aporetic and Platonic/doctrinal (Cicero, Academica\nI.15–17). For Plutarch, rather Plato accommodates harmoniously\nboth an aporetic and a doctrinal element in his philosophy. According\nto Plutarch, the aporetic element in Plato encourages a way of\nsearching for the truth without prejudices or a priori commitments,\nand this practically amounts to a dialectical inquiry, arguing either\nside of a given question; but this dialectical spirit does not deny\nthe possibility of reaching firm conclusions, or even the possibility\nof achieving secure knowledge. According to Plutarch, Plato had\nreached such conclusions in his dialogues, which can be identified as\nPlato's doctrines and yet he still preserved the spirit of unceasing\ninquiry, embedded in the dialogue form itself, by not holding them in\na way which closed off reconsideration and further inquiry. This is\nwhy Plutarch advocates an epistemology that integrates both the\nsuspension of judgment (i.e., the rejection of dogmatism) and a\ndefense of the possibility of acquiring true knowledge (see below,\nsect. 3). On this basis Plutarch defends the unity of the Academy,\ngoing all the way back to Plato, which Antiochus had considered as\nhaving been disrupted with the advent of Academic Skepticism, in lost\ntreatises, such as On the Unity of the Academy since Plato,\nOn the Difference Between Pyrrhoneans and Academics (see\nAdversus Colotem 1121F-1122E, Platonic Question I;\nwith Opsomer 1998, 127–133). Plutarch actually tried to\ndisengage the term ‘Academic’ from implying exclusive\ncommitment to the skeptical construal of Plato. Suspension of\njudgment, he thinks, is rather an established method of philosophical\nresearch followed by several illustrious ancient philosophers\n(Heraclitus, Parmenides, Socrates, Plato), rather than an innovation\nof Arcesilaus (Adv. Col. 1121F-1122A). For Plutarch, the\nAcademic both appreciates Plato's aporetic spirit and still values his\ndoctrines. Similar in this respect appears to be the position of the\nanonymous author of the (1st c. CE?) Commentary on the\nTheaetetus and of Plutarch's friend Favorinus, the addressee of\nhis On the Principle of Cold (cf. ibid. 955C, see Opsomer\n1997, Opsomer 1998, 26–82, 213–240).\n\nIn accordance with this conception of Platonism, Plutarch himself\nwrites dialogues, which, like Plato's, are either dramatic\n(e.g. De cohibenda ira), narrated (e.g. De sera numinis\nvindicta), or mixed (De genio Socratis); see the\ntypology of Platonic dialogues in Diogenes Laertius 3.50). As in\nPlato, in Plutarch's dialogues too the speakers give long speeches in\nfavor of a certain view (Russell 1973, 34–36). It is often\nunclear, however, with what view Plutarch sympathizes, despite the\nfact that sometimes he appears as character in some dialogues\n(e.g. On the E at Delphi). Besides, Plutarch, following Plato\nagain, often uses myths, metaphors, and analogies. The work On\nIsis and Osiris is particularly interesting in this regard. In it\nPlutarch relates the myth of the two Egyptian deities, yet he\ninterprets it allegorically as a story informative about god, being,\nand creation (Ziegler 1951, 206–208). Of special interest are\nthe eschatological myths in Plutarch, as they integrate cosmological,\npsychological, and ethical considerations. This is the case with the\nmyth narrated in On The Face Which Appears in the Orb of the\nMoon, which centers on the role of the moon in the world and its\nrole in the life of souls (see Cherniss, Plutarch Moralia,\nvol. XII, Loeb, Introduction). Analogous is the case of the work\nOn the Delays of the Divine Vengeance, where Plutarch sets\nout to defend divine providence, yet, following Plato's claim of\npresenting only a likely account (eikôs mythos) in the\nTimaeus, he claims to be offering only what seems likely to\nhim about divine actions (549E-F), and also like Plato, Plutarch\nstructures his work into argument (logos) and a narrative\n(mythos). These authorial practices present a problem for the\nscholar who wants to identify Plutarch's own philosophical views, just\nas they do with Plato's own dialogues. The works that unambiguously\npresent Plutarch's opinions on exegetical and philosophical matters\nare On the Generation of Soul in the Timaeus, and\nPlatonic Questions, while the others must be used with\ncaution, for the reasons given above, or because of their polemical\naim and tone (see Opsomer 2007).\n\nPlutarch represents a synthesis also with regard to his philosophical\ninterests. On the one hand he shares Antiochus' emphasis on ethics,\nyet on the other he focuses considerably on metaphysics, which was\nrevived by Eudorus (end of 1st c. BCE) and flourished with\nNeo-Pythagorean Platonists such as Moderatus (1st\nc. CE). Like them, Plutarch (as noted above) pays special attention to\nthe Timaeus, which from then on became the keystone of\nPlatonism. Plutarch is particularly interested in the generation of\nthe soul, and he devotes an entire treatise to discussing one short\npassage, Timaeus 35a1–36b5 (On the Generation of\nSoul in the Timaeus; see Cherniss, Plutarch Moralia,\nLoeb vol. XIII.1, 133–149, Hershbell 1987). It is not an\nexaggeration to say that Plutarch's interpretation of the\nTimaeus shapes his entire philosophy. This is because\nPlutarch apparently endorses the idea suggested in the\nTimaeus that the universe is a unified whole with humans\nbeing an integral part of this unity, which means that both the\nphysical world and natural phenomena as well as human beings and human\nsociety should be approached from a cosmic/metaphysical point of\nview. In the case of natural phenomena, this means that explanations\nshould make reference to intelligible causes (De primo\nfrigido 948B-C) which account for the nature of things in the\nworld, while in the case of human beings, their nature and their final\nend in life, that is, their happiness cannot be determined unless one\nunderstands that the human constitution is similar to that of the\nworld, consisting of body, soul, and intellect (De facie\n943A, 945A, De virtute morali 441D).  Plutarch systematically\nemploys the analogy between worldly macrocosm and human microcosm,\nsuggested in the Timaeus, which is important also in Stoicism\n(see below, sect. 5, 6).\n\nPlutarch is also familiar with Neo-Pythagorean and Aristotelian\nphilosophies. Interest in both Pythagorean ideas and Aristotelianism\nwere in vogue at the end of the 1st century BCE and during\nthe 1st century CE, when Plutarch writes. There is a wave\nof Neo–Pythagorean treatises written at this time, such as those\nof ps–Archytas, Euryphamus, Theages (see Dillon 1977,\n341–361, 1988b, 119–122, Centrone 1990), while Plutarch's\ncontemporary Moderatus attempted to systematize Pythagorean ideas as\nbackground to Plato (he wrote a work Pythagorean Doctrines in\nmany books; Stephanus Byzantius, s.v. Gadeira, Porphyry,\nLife of Pythagoras 48; Dillon 1977,\n344–351). Aristotelian philosophy, on the other hand, was\nrevived by Peripatetics and Platonists alike during this period. In\nthe Peripatetic camp this is the time when Andronicus of Rhodes was\nactive, being responsible for a complete edition of Aristotle's works\nat the end of the 1st century BCE, while Xenarchus of\nSeleukeia was critically engaged with Aristotle's physics. But already\nbefore them, Antiochus and Cicero had been well acquainted with\nAristotle's works, the former arguing that Aristotle was in essential\nagreement with Plato, at least in ethical theory (Cicero,\nAcademica I.17, De finibus V.12). Antiochus'\nstudents Aristo (of Alexandria) and Cratippus regarded themselves as\nPeripatetics (Index Academicorum col. 35.2-17 Dorandi), while\nthe Platonust Eudorus did not hesitate to use Aristotle in order to\nidentify Pythagorean metaphysical principles in Plato (Alexander,\nIn Met. 58.25–59.8 with reference to Aristotle\nMetaphysics 988a8–17). Plutarch was familiar with\nseveral Aristotelian treatises from all periods of his writing career\n(cf. Adv. Col. 1115B-C) and, quite interestingly, he\npreserves numerous fragments from lost Aristotelian works (see Ross,\nAristotelis Fragmenta Selecta, Karamanolis 2006,\n89–92). Plutarch's attitude to Pythagoreanism and Aristotle is\ncomplex and sophisticated.  Plutarch's cosmic principles, the One and\nthe Indefinite Dyad (De defectu oraculorum 428F-429A),\nallegedly found in the Timaeus, had long been considered\nPythagorean in origin. Plutarch shows his familiarity with\nPythagoreanism in the second (and rather cryptic) part of On the\nGeneration of the Soul in Timaeus, where he seeks to explain the\nnature and role of numbers and ratios in the Timaeus making\nrepeated references to Pythagoreans. Plutarch also integrates into\nPlatonism other Pythagorean elements, such as number symbolism (De\nE 387F, De def. or. 429D-430B), abstinence from meat\n(On the Eating of Flesh; De esu carnium), and a belief in the\nrationality of animals (On the Cleverness of Animals, Beasts are\nRational; Bruta Animalia Ratione Uti), probably because he\nconsiders them implied in, or compatible with, statements made in\nPlato (e.g. in the Phaedo, Timaeus). With regard to\nAristotle, Plutarch is more cautious than Antiochus; he considers some\nof Aristotle's doctrines to be an articulation or development of\nPlatonic philosophy (e.g. Aristotle's ethics, logic and science; see\nTeodorsson 1999), and espouses them as being Platonic (e.g. De\nvirtute morali 442B-C, De an. procr. 1023E). However, he\nalso criticizes Aristotle for contradicting Plato's presumed doctrines\n(e.g. on the Forms and on the constitution of the world;\nAdv. Col. 1114F-1115C; see Karamanolis 2006,\n85–126).\n\nHence it is wrong to portray Plutarch as an eclectic philosopher (e.g.\nZiegler 1951, 940, F. Babbitt, Plutarch's Moralia,\nIntroduction, vol. I, Loeb 1927, xiv, Becchi 1981), who occasionally\ncompromises his Platonism in order to carry out his polemic\n(Dörrie 1971, Donini 1988b, 131, 1999, 16–19). Rather\nPlutarch uses philosophers such as Aristotle only instrumentally in\norder to advance through them what he perceives as Plato's doctrines\n(Karamanolis 2006, 92–109). Plutarch shares with Antiochus\n(Cicero, Academica I.17–19, 33–34) the view that\nPlato's philosophy is subject to articulation and development through\nhis successors in the Platonist tradition, but also to\nmisinterpretation and distortion. On this view, Xenocrates, Polemo and\nAristotle developed and articulated Platonic philosophy, though not\nwithout faults, while the Stoics and Epicureans were instead guilty of\nsystematic distortion. Plutarch is not a populariser either (Babbitt op. cit.).\nRather, Plutarch's work shows great complexity and sophistication and\nevinces the spirit of a meticulous interpreter, who ventures to\nadvance innovative views, such as on the creation of the soul, on\nhuman constitution, as well as on ethics and poetics (see below,\nsects. 6 and 7). It is also unfair to say of Plutarch that he was\n“no original thinker” (Ziegler 1951,\n938–939). Plutarch lived in an age in which philosophy had taken\nthe form of exegesis of classical philosophical texts, but through\nthis exegetical process philosophers in late antiquity (such as\nPlotinus and the commentators on Plato and Aristotle) crystallize and\nvoice their own views on crucial philosophical questions. Indeed\nPlutarch takes some very interesting lines on metaphysics, psychology,\nand ethics, which became influential in later generations of\nPlatonists, such as Plotinus and Porphyry (see below, sect. 4, 5,\n6).\n",
    "section_title": "2. Plutarch's Platonism",
    "entry_title": "Plutarch",
    "hierarchy_title": "Plutarch || Plutarch's Platonism",
    "tokenized_text": [
        "plutarch",
        "s",
        "platonism",
        "plutarch",
        "s",
        "platonism",
        "plutarch",
        "lived",
        "wake",
        "revival",
        "dogmatic",
        "interpretation",
        "plato",
        "begun",
        "antiochus",
        "eudorus",
        "st",
        "c",
        "bce",
        "way",
        "continues",
        "plutarch",
        "however",
        "show",
        "complex",
        "philosophical",
        "profile",
        "apparently",
        "developing",
        "version",
        "academic",
        "skepticism",
        "defended",
        "antiochus",
        "contemporary",
        "philo",
        "larissa",
        "also",
        "slightly",
        "later",
        "cicero",
        "strives",
        "synthesis",
        "skeptical",
        "interpretation",
        "plato",
        "defended",
        "academic",
        "skeptic",
        "arcesilaus",
        "carneades",
        "philo",
        "antiochus",
        "dogmatic",
        "interpretation",
        "according",
        "plato",
        "held",
        "doctrine",
        "thus",
        "plutarch",
        "object",
        "distinction",
        "antiochus",
        "suggested",
        "socratic",
        "platonic",
        "philosophy",
        "corresponding",
        "division",
        "plato",
        "s",
        "dialogue",
        "socraticaporetic",
        "platonicdoctrinal",
        "cicero",
        "academica",
        "i",
        "plutarch",
        "rather",
        "plato",
        "accommodates",
        "harmoniously",
        "aporetic",
        "doctrinal",
        "element",
        "philosophy",
        "according",
        "plutarch",
        "aporetic",
        "element",
        "plato",
        "encourages",
        "way",
        "searching",
        "truth",
        "without",
        "prejudice",
        "priori",
        "commitment",
        "practically",
        "amount",
        "dialectical",
        "inquiry",
        "arguing",
        "either",
        "side",
        "given",
        "question",
        "dialectical",
        "spirit",
        "deny",
        "possibility",
        "reaching",
        "firm",
        "conclusion",
        "even",
        "possibility",
        "achieving",
        "secure",
        "knowledge",
        "according",
        "plutarch",
        "plato",
        "reached",
        "conclusion",
        "dialogue",
        "identified",
        "plato",
        "s",
        "doctrine",
        "yet",
        "still",
        "preserved",
        "spirit",
        "unceasing",
        "inquiry",
        "embedded",
        "dialogue",
        "form",
        "holding",
        "way",
        "closed",
        "reconsideration",
        "inquiry",
        "plutarch",
        "advocate",
        "epistemology",
        "integrates",
        "suspension",
        "judgment",
        "ie",
        "rejection",
        "dogmatism",
        "defense",
        "possibility",
        "acquiring",
        "true",
        "knowledge",
        "see",
        "sect",
        "basis",
        "plutarch",
        "defends",
        "unity",
        "academy",
        "going",
        "way",
        "back",
        "plato",
        "antiochus",
        "considered",
        "disrupted",
        "advent",
        "academic",
        "skepticism",
        "lost",
        "treatise",
        "unity",
        "academy",
        "since",
        "plato",
        "difference",
        "pyrrhoneans",
        "academic",
        "see",
        "adversus",
        "colotem",
        "fe",
        "platonic",
        "question",
        "opsomer",
        "plutarch",
        "actually",
        "tried",
        "disengage",
        "term",
        "academic",
        "implying",
        "exclusive",
        "commitment",
        "skeptical",
        "construal",
        "plato",
        "suspension",
        "judgment",
        "think",
        "rather",
        "established",
        "method",
        "philosophical",
        "research",
        "followed",
        "several",
        "illustrious",
        "ancient",
        "philosopher",
        "heraclitus",
        "parmenides",
        "socrates",
        "plato",
        "rather",
        "innovation",
        "arcesilaus",
        "adv",
        "col",
        "fa",
        "plutarch",
        "academic",
        "appreciates",
        "plato",
        "s",
        "aporetic",
        "spirit",
        "still",
        "value",
        "doctrine",
        "similar",
        "respect",
        "appears",
        "position",
        "anonymous",
        "author",
        "st",
        "c",
        "ce",
        "commentary",
        "theaetetus",
        "plutarch",
        "s",
        "friend",
        "favorinus",
        "addressee",
        "principle",
        "cold",
        "cf",
        "ibid",
        "c",
        "see",
        "opsomer",
        "opsomer",
        "accordance",
        "conception",
        "platonism",
        "plutarch",
        "writes",
        "dialogue",
        "like",
        "plato",
        "s",
        "either",
        "dramatic",
        "eg",
        "de",
        "cohibenda",
        "ira",
        "narrated",
        "eg",
        "de",
        "serum",
        "numinis",
        "vindicta",
        "mixed",
        "de",
        "genio",
        "socratis",
        "see",
        "typology",
        "platonic",
        "dialogue",
        "diogenes",
        "laertius",
        "plato",
        "plutarch",
        "s",
        "dialogue",
        "speaker",
        "give",
        "long",
        "speech",
        "favor",
        "certain",
        "view",
        "russell",
        "often",
        "unclear",
        "however",
        "view",
        "plutarch",
        "sympathizes",
        "despite",
        "fact",
        "sometimes",
        "appears",
        "character",
        "dialogue",
        "eg",
        "e",
        "delphi",
        "besides",
        "plutarch",
        "following",
        "plato",
        "often",
        "us",
        "myth",
        "metaphor",
        "analogy",
        "work",
        "isi",
        "osiris",
        "particularly",
        "interesting",
        "regard",
        "plutarch",
        "relates",
        "myth",
        "two",
        "egyptian",
        "deity",
        "yet",
        "interprets",
        "allegorically",
        "story",
        "informative",
        "god",
        "creation",
        "ziegler",
        "special",
        "interest",
        "eschatological",
        "myth",
        "plutarch",
        "integrate",
        "cosmological",
        "psychological",
        "ethical",
        "consideration",
        "case",
        "myth",
        "narrated",
        "face",
        "appears",
        "orb",
        "moon",
        "center",
        "role",
        "moon",
        "world",
        "role",
        "life",
        "soul",
        "see",
        "cherniss",
        "plutarch",
        "moralia",
        "vol",
        "xii",
        "loeb",
        "introduction",
        "analogous",
        "case",
        "work",
        "delay",
        "divine",
        "vengeance",
        "plutarch",
        "set",
        "defend",
        "divine",
        "providence",
        "yet",
        "following",
        "plato",
        "s",
        "claim",
        "presenting",
        "likely",
        "account",
        "eikôs",
        "mythos",
        "timaeus",
        "claim",
        "offering",
        "seems",
        "likely",
        "divine",
        "action",
        "ef",
        "also",
        "like",
        "plato",
        "plutarch",
        "structure",
        "work",
        "argument",
        "logo",
        "narrative",
        "mythos",
        "authorial",
        "practice",
        "present",
        "problem",
        "scholar",
        "want",
        "identify",
        "plutarch",
        "s",
        "philosophical",
        "view",
        "plato",
        "s",
        "dialogue",
        "work",
        "unambiguously",
        "present",
        "plutarch",
        "s",
        "opinion",
        "exegetical",
        "philosophical",
        "matter",
        "generation",
        "soul",
        "timaeus",
        "platonic",
        "question",
        "others",
        "must",
        "used",
        "caution",
        "reason",
        "given",
        "polemical",
        "aim",
        "tone",
        "see",
        "opsomer",
        "plutarch",
        "represents",
        "synthesis",
        "also",
        "regard",
        "philosophical",
        "interest",
        "one",
        "hand",
        "share",
        "antiochus",
        "emphasis",
        "ethic",
        "yet",
        "focus",
        "considerably",
        "metaphysics",
        "revived",
        "eudorus",
        "end",
        "st",
        "c",
        "bce",
        "flourished",
        "neopythagorean",
        "platonist",
        "moderatus",
        "st",
        "c",
        "ce",
        "like",
        "plutarch",
        "noted",
        "pay",
        "special",
        "attention",
        "timaeus",
        "became",
        "keystone",
        "platonism",
        "plutarch",
        "particularly",
        "interested",
        "generation",
        "soul",
        "devotes",
        "entire",
        "treatise",
        "discussing",
        "one",
        "short",
        "passage",
        "timaeus",
        "ab",
        "generation",
        "soul",
        "timaeus",
        "see",
        "cherniss",
        "plutarch",
        "moralia",
        "loeb",
        "vol",
        "xiii",
        "hershbell",
        "exaggeration",
        "say",
        "plutarch",
        "s",
        "interpretation",
        "timaeus",
        "shape",
        "entire",
        "philosophy",
        "plutarch",
        "apparently",
        "endorses",
        "idea",
        "suggested",
        "timaeus",
        "universe",
        "unified",
        "whole",
        "human",
        "integral",
        "part",
        "unity",
        "mean",
        "physical",
        "world",
        "natural",
        "phenomenon",
        "well",
        "human",
        "being",
        "human",
        "society",
        "approached",
        "cosmicmetaphysical",
        "point",
        "view",
        "case",
        "natural",
        "phenomenon",
        "mean",
        "explanation",
        "make",
        "reference",
        "intelligible",
        "cause",
        "de",
        "primo",
        "frigido",
        "bc",
        "account",
        "nature",
        "thing",
        "world",
        "case",
        "human",
        "being",
        "nature",
        "final",
        "end",
        "life",
        "happiness",
        "determined",
        "unless",
        "one",
        "understands",
        "human",
        "constitution",
        "similar",
        "world",
        "consisting",
        "body",
        "soul",
        "intellect",
        "de",
        "facie",
        "a",
        "a",
        "de",
        "virtute",
        "morali",
        "d",
        "plutarch",
        "systematically",
        "employ",
        "analogy",
        "worldly",
        "macrocosm",
        "human",
        "microcosm",
        "suggested",
        "timaeus",
        "important",
        "also",
        "stoicism",
        "see",
        "sect",
        "plutarch",
        "also",
        "familiar",
        "neopythagorean",
        "aristotelian",
        "philosophy",
        "interest",
        "pythagorean",
        "idea",
        "aristotelianism",
        "vogue",
        "end",
        "st",
        "century",
        "bce",
        "st",
        "century",
        "ce",
        "plutarch",
        "writes",
        "wave",
        "neopythagorean",
        "treatise",
        "written",
        "time",
        "psarchytas",
        "euryphamus",
        "theages",
        "see",
        "dillon",
        "b",
        "centrone",
        "plutarch",
        "s",
        "contemporary",
        "moderatus",
        "attempted",
        "systematize",
        "pythagorean",
        "idea",
        "background",
        "plato",
        "wrote",
        "work",
        "pythagorean",
        "doctrine",
        "many",
        "book",
        "stephanus",
        "byzantius",
        "sv",
        "gadeira",
        "porphyry",
        "life",
        "pythagoras",
        "dillon",
        "aristotelian",
        "philosophy",
        "hand",
        "revived",
        "peripatetic",
        "platonist",
        "alike",
        "period",
        "peripatetic",
        "camp",
        "time",
        "andronicus",
        "rhodes",
        "active",
        "responsible",
        "complete",
        "edition",
        "aristotle",
        "s",
        "work",
        "end",
        "st",
        "century",
        "bce",
        "xenarchus",
        "seleukeia",
        "critically",
        "engaged",
        "aristotle",
        "s",
        "physic",
        "already",
        "antiochus",
        "cicero",
        "well",
        "acquainted",
        "aristotle",
        "s",
        "work",
        "former",
        "arguing",
        "aristotle",
        "essential",
        "agreement",
        "plato",
        "least",
        "ethical",
        "theory",
        "cicero",
        "academica",
        "i",
        "de",
        "finibus",
        "v",
        "antiochus",
        "student",
        "aristo",
        "alexandria",
        "cratippus",
        "regarded",
        "peripatetic",
        "index",
        "academicorum",
        "col",
        "dorandi",
        "platonust",
        "eudorus",
        "hesitate",
        "use",
        "aristotle",
        "order",
        "identify",
        "pythagorean",
        "metaphysical",
        "principle",
        "plato",
        "alexander",
        "met",
        "reference",
        "aristotle",
        "metaphysics",
        "a",
        "plutarch",
        "familiar",
        "several",
        "aristotelian",
        "treatise",
        "period",
        "writing",
        "career",
        "cf",
        "adv",
        "col",
        "bc",
        "quite",
        "interestingly",
        "preserve",
        "numerous",
        "fragment",
        "lost",
        "aristotelian",
        "work",
        "see",
        "ross",
        "aristotelis",
        "fragmenta",
        "selecta",
        "karamanolis",
        "plutarch",
        "s",
        "attitude",
        "pythagoreanism",
        "aristotle",
        "complex",
        "sophisticated",
        "plutarch",
        "s",
        "cosmic",
        "principle",
        "one",
        "indefinite",
        "dyad",
        "de",
        "defectu",
        "oraculorum",
        "fa",
        "allegedly",
        "found",
        "timaeus",
        "long",
        "considered",
        "pythagorean",
        "origin",
        "plutarch",
        "show",
        "familiarity",
        "pythagoreanism",
        "second",
        "rather",
        "cryptic",
        "part",
        "generation",
        "soul",
        "timaeus",
        "seek",
        "explain",
        "nature",
        "role",
        "number",
        "ratio",
        "timaeus",
        "making",
        "repeated",
        "reference",
        "pythagoreans",
        "plutarch",
        "also",
        "integrates",
        "platonism",
        "pythagorean",
        "element",
        "number",
        "symbolism",
        "de",
        "e",
        "f",
        "de",
        "def",
        "db",
        "abstinence",
        "meat",
        "eating",
        "flesh",
        "de",
        "esu",
        "carnium",
        "belief",
        "rationality",
        "animal",
        "cleverness",
        "animal",
        "beast",
        "rational",
        "bruta",
        "animalia",
        "ratione",
        "uti",
        "probably",
        "considers",
        "implied",
        "compatible",
        "statement",
        "made",
        "plato",
        "eg",
        "phaedo",
        "timaeus",
        "regard",
        "aristotle",
        "plutarch",
        "cautious",
        "antiochus",
        "considers",
        "aristotle",
        "s",
        "doctrine",
        "articulation",
        "development",
        "platonic",
        "philosophy",
        "eg",
        "aristotle",
        "s",
        "ethic",
        "logic",
        "science",
        "see",
        "teodorsson",
        "espouses",
        "platonic",
        "eg",
        "de",
        "virtute",
        "morali",
        "bc",
        "de",
        "procr",
        "e",
        "however",
        "also",
        "criticizes",
        "aristotle",
        "contradicting",
        "plato",
        "s",
        "presumed",
        "doctrine",
        "eg",
        "form",
        "constitution",
        "world",
        "adv",
        "col",
        "fc",
        "see",
        "karamanolis",
        "hence",
        "wrong",
        "portray",
        "plutarch",
        "eclectic",
        "philosopher",
        "eg",
        "ziegler",
        "f",
        "babbitt",
        "plutarch",
        "s",
        "moralia",
        "introduction",
        "vol",
        "loeb",
        "xiv",
        "becchi",
        "occasionally",
        "compromise",
        "platonism",
        "order",
        "carry",
        "polemic",
        "dörrie",
        "donini",
        "b",
        "rather",
        "plutarch",
        "us",
        "philosopher",
        "aristotle",
        "instrumentally",
        "order",
        "advance",
        "perceives",
        "plato",
        "s",
        "doctrine",
        "karamanolis",
        "plutarch",
        "share",
        "antiochus",
        "cicero",
        "academica",
        "i",
        "view",
        "plato",
        "s",
        "philosophy",
        "subject",
        "articulation",
        "development",
        "successor",
        "platonist",
        "tradition",
        "also",
        "misinterpretation",
        "distortion",
        "view",
        "xenocrates",
        "polemo",
        "aristotle",
        "developed",
        "articulated",
        "platonic",
        "philosophy",
        "though",
        "without",
        "fault",
        "stoic",
        "epicurean",
        "instead",
        "guilty",
        "systematic",
        "distortion",
        "plutarch",
        "populariser",
        "either",
        "babbitt",
        "op",
        "cit",
        "rather",
        "plutarch",
        "s",
        "work",
        "show",
        "great",
        "complexity",
        "sophistication",
        "evinces",
        "spirit",
        "meticulous",
        "interpreter",
        "venture",
        "advance",
        "innovative",
        "view",
        "creation",
        "soul",
        "human",
        "constitution",
        "well",
        "ethic",
        "poetics",
        "see",
        "sect",
        "also",
        "unfair",
        "say",
        "plutarch",
        "original",
        "thinker",
        "ziegler",
        "plutarch",
        "lived",
        "age",
        "philosophy",
        "taken",
        "form",
        "exegesis",
        "classical",
        "philosophical",
        "text",
        "exegetical",
        "process",
        "philosopher",
        "late",
        "antiquity",
        "plotinus",
        "commentator",
        "plato",
        "aristotle",
        "crystallize",
        "voice",
        "view",
        "crucial",
        "philosophical",
        "question",
        "indeed",
        "plutarch",
        "take",
        "interesting",
        "line",
        "metaphysics",
        "psychology",
        "ethic",
        "became",
        "influential",
        "later",
        "generation",
        "platonist",
        "plotinus",
        "porphyry",
        "see",
        "sect"
    ]
}