{
    "main_text": "Philosophy of Physics\n4. Philosophy of Physics\n\nConcerning the epistemological status of mechanics, Poincaré\npositions himself, as in his discussion of geometry, as holding a\nposition between empiricism and a priorism (Poincaré 1902: 111;\n2017: 71). The principles of mechanics certainly have, according to\nPoincaré, an empirical origin, but they nonetheless surpass the\nbounds of strict empiricism since the experience that leads us to an\nexperimental result rests on the repetition of a phenomenon and\ntherefore requires physical or empirical induction (Poincaré\n1902: 26; 2017: 3). Generalizations are either a hypothesis, a law, or\na confirmable thesis obtained by the fact that each result of\nempirical physics can be generalized in different ways. Indeed, we are\nobligated to simplify the experimental data and the criterion of\nsimplicity is relative to the analytical apparatus we employ, so\nconsequently, simplicity may be only be “apparent.” Such\nanalysis of experimental data may even force us to adjust the\nexperiment. Reflecting on the generalization process shows that it\npresupposes a belief in the unity and simplicity of nature\n(Poincaré 1902: 159–165; 2017: 105–108). However,\nthis is only the most general kind of presupposition that is required.\nThe hypothesis of the law of inertia, for example, cannot be obtained\nexcept with respect to the preexisting category of the differential\nequation, which thus replaces the physical induction that leads to a\nsimple experimental fact.\n\nPoincaré distinguished empirical laws from conventional\nprinciples. How does one move from “simple” empirical\nlaws, understood as confirmable hypotheses, to principles as\nthe result of a conventional decision to withdraw a confirmable\nhypothesis from the judgment of experience? In mechanics he employs\nthe same methodological procedure as in geometry with regard to\nclasses of displacements and groups:\n\n\nWhen a law has received a sufficient confirmation from experiment, we\nmay adopt two attitudes: Either we may leave this law in the fray; it\nwill then remain subject to incessant revision, which without any\ndoubt will end by demonstrating that it is only approximate. Or else\nwe may elevate it into a principle by adopting conventions.\n(Poincaré 1905b: 165–166; 1913b: 335)\n\n\nThus, in outline, a generalization scheme in physics is presented as\nfollows: From the phenomenon we move by physical induction to the\nexperimental result and, thanks to differential equations, to the laws\nand the general hypotheses which, by a common decision of the\nscientific community, can be elevated finally to a principle.\nCertainly this is only a general scheme and the concrete process of a\ngeneralization could include many variations. The difference between\nthe geometric axiom as a “disguised definition” and the\nphysical law as a principle seems to define Poincaré’s\nepistemological criterion that distinguishes geometry from mechanics\nfrom the ontological point of view. In geometry, the convenient\nconventions (or definitions) are chosen as a function of objects\n(solid bodies, rays) which are not the objects of the geometry.\nFurthermore, in geometry we presuppose the category of group, so\ngeometry requires a double conventional abstraction. In mechanics, the\nconventions are useful and apply to physical objects (Poincaré\n1902: 152; 2017: 100). In this context we presuppose the categories of\nempirical or physical induction and of differential equations as\nnecessary preconditions for doing science. Poincaré’s\napproach therefore integrates specifically Kantian elements, the idea\nthat there are preconditions, while still completely eliminating the\ntranscendental basis of these components that we find in Kant’s\nthought.\n\nPoincaré’s argument in favor of the necessary\ntransmission of the conventional character of geometry to physics is\nbased on an analogy, which shows another important relationship\nbetween geometry and physics. The methodological function of\ntransformation groups with respect to the representative space\ncorresponds to the function of geometry with respect to physics. The\nanalogy runs as follows: Just as the law of displacements may\ncorrespond only approximately to the law of groups and is consequently\nconsidered to be the result of two component changes, the first being\na displacement, and the second a qualitative alteration, so\nPoincaré regards the physical “complex” relation\nbetween two bodies \\(A\\) and \\(B\\) as\nthe result of two components. The first is regarded as a\n“simple” geometrical principle, while the second is itself\ncomposed of two “epistemological laws.” The bodies \\(A\\)\nand \\(B\\) are related to figures\n\\(A'\\); and \\(B'\\) of the geometrical space so that \n\n\\[ R(A,B) \\leftrightarrow R'(A',B') \\wedge r_A (A,A') \\wedge r_B (B,B') \\]\n\n\n\\(R'\\) being a “properly” geometrical proposition, and the\n\\(r_i\\) expressing the relationships between objects of the\nrepresentative space and the geometrical space, such as the relation\nbetween solid bodies and motion invariants. Poincaré declares\nthat by changing the relations \\(r_i\\), the geometrical proposition\n\\(R'(A', B')\\) could even serve to describe the relationship between\ntwo different physical bodies (see Poincaré 1905b:\n166–67; 1913b: 336). Poincaré thereby rules out any\napplication of geometry to physics based on a structural isomorphism\nwith a presupposed reality (Mette 1986: 75–80).\n\nThe conventional elements in physical theories were often\nmisunderstood by Poincaré’s contemporaries. So, for\nexample, his affirmation that neither of the two propositions\n‘The earth turns round’ and ‘The earth does not turn\nround’ is “more true than the other in the kinematic\nsense,” is not a rehabilitation of Ptolemy’s system, but\nthe consequence of the fact that in physics, the empirical systematic\n(not epistemic) under-determination of theories is limited by unifying\nconsiderations: “A physical theory is by so much the more true,\nas it puts in evidence more true relations.” So, the ‘The\nearth turns round’ has a richer content expressed by the\n“flattening of the earth, the rotation of Foucault’s\npendulum, the gyration of cyclones, the trade-winds, and who knows\nwhat else?” (Poincaré 1905b: 184–85; 1913b: 353).\nHowever, in physics proper—that is, in optics and in\nelectrodynamics—the conventional elements seem to be further\nweakened:\n\n\nWe come across a different kind of hypothesis and fully perceive its\nproductivity. Undoubtedly, the theories seem at first sight fragile\nand the history of science shows us how fleeting they are. However,\nthey do not entirely die out and something remains of each of them. It\nis this something that we must try to sort out, for there and only\nthere is true reality (Poincaré 1902: 26; 2017:\n3–30).\n\n\nIn fact, Poincaré’s model of explanation, founded on a\nminimum of well-confirmed hypotheses erected into principles and from\nwhich any meaningful propositions can be deduced, is called into\nquestion by Maxwell’s approach. In view of the crisis in physics\nthat was brewing toward the end of the 19th century,\nPoincaré’s general position will not work without posing\nproblems with respect to concrete principles. We will briefly mention\nthe most interesting case, that of the application of the principle of\nrelativity to electrodynamics, which is one of the most discussed\nsubjects by historians (e.g., Goldberg 1967; Paty 1993; Miller 1996a;\nZahar 2001; Darrigol 2004; Rouché 2008; Walter 2011, DiSalle\n2014)—not least because Poincaré and Einstein did not\ncite each other on relativity despite the fact that Einstein read\nPoincaré’s Science and Hypothesis before 1905\nand Poincaré wrote Einstein a recommendation letter sometime\nafter their only meeting at the first Solvay Congress in 1911 (Walter\n2007: chap. 59.3). What is uncontroversial is that Poincaré\ndiscovered salient points of the special theory of relativity, such as\nan operational definition of clock-synchronization to the first order\nin \\(v/c\\), and a relativistic formula of the composition of speed,\nthe determination of the structure of the Lorentz-group.\n\nSince the Maxwell-Lorentz equations for electromagnetics are not\nGalileo-covariant, the classical principle of relativity according to\nwhich measurement in one inertial reference frame can be converted to\nanother by Galilean transformation is called into question. Using in\nhis famous St. Louis lecture of 1904 the designation (physical)\n“principle of relativity” (Poincaré 1905a: 607),\nwhich does not apply “to finite equations that are directly\nobserved, but to differential equations” (Poincaré 1913a:\n103; 1963: 19), Poincaré reports that Lorentz introduces the\nconjectures (i.e., the ad hoc hypotheses) of “local\ntime” and of “uniform contraction in the direction of\nmotion” in an attempt to save the principle in its application\nto the electromagnetic domain (see Poincaré 1905b: 132 ff.;\n1913b: 305 ff.). It was indeed Poincaré (1906) who made\nLorentz’s theory fully compatible with the relativity principle.\nWe are thus naturally inclined, remarks Poincaré, to admit the\npostulate of relativity in every domain. In postulating the principle\nas a “general law of Nature” (Poincaré 1906: 495),\nits extended form finds its origin in the Galilean principle, and its\nmotivation in its compatibility with a theory explaining why no\nexperiment is able to inform us of the earth’s motion relative\nto the ether. So, the principle is an element of a work in progress\ncontaining several conjectures and there is the possibility that it\nwill lose its soundness (Poincaré 1905b: 146; 1913b: 319).\n\nIn fact, there are now two principles: the old one, which was made\nimmune to revision by considering it as a conventional\nprinciple and which serves to construct geometrical space via the\ntransformation group that is the mathematical expression of the\npsychological principle of the free mobility of “rigid”\nbodies, and the new one, where the invariance concerns differential\nequations and where the geometry could now be rooted in the Lorentz\ngroup at the price of accepting a four-dimensional spacetime with\nindefinite metric (see Gray 2012: 111; Walter 2009). So, it seems that\nPoincaré’s old conventional construction of space where\nhe prefers Euclidean geometry on the basis of considerations of\nsimplicity and commodity must be subsumed to a new convention on\nspace-time. Indeed, Poincaré never abandons Galilean spacetime\nbut it is not even clear if before 1912 the principle of special\nrelativity with Lorentz covariance (instead of with Galilean\ncovariance) was confirmed well enough to be unassailable by experiment\nand to make the principle with Galilean covariance unfruitful (Walter\n2009). This situation is what Larry Sklar has called\n“transient” underdetermination,\n\n\nthat is, theories which are not empirically equivalent but\nare equally (or at least reasonably) well confirmed by all the\nevidence we happen to have in hand at the moment (see Stanford 2009\nand Sklar 1975: 380)\n\n\nwhile waiting to make a decision in face of new results.\n",
    "section_title": "4. Philosophy of Physics",
    "entry_title": "Henri Poincaré",
    "hierarchy_title": "Henri Poincaré || Philosophy of Physics",
    "tokenized_text": [
        "philosophy",
        "physic",
        "philosophy",
        "physic",
        "concerning",
        "epistemological",
        "status",
        "mechanic",
        "poincaré",
        "position",
        "discussion",
        "geometry",
        "holding",
        "position",
        "empiricism",
        "priorism",
        "poincaré",
        "principle",
        "mechanic",
        "certainly",
        "according",
        "poincaré",
        "empirical",
        "origin",
        "nonetheless",
        "surpass",
        "bound",
        "strict",
        "empiricism",
        "since",
        "experience",
        "lead",
        "u",
        "experimental",
        "result",
        "rest",
        "repetition",
        "phenomenon",
        "therefore",
        "requires",
        "physical",
        "empirical",
        "induction",
        "poincaré",
        "generalization",
        "either",
        "hypothesis",
        "law",
        "confirmable",
        "thesis",
        "obtained",
        "fact",
        "result",
        "empirical",
        "physic",
        "generalized",
        "different",
        "way",
        "indeed",
        "obligated",
        "simplify",
        "experimental",
        "data",
        "criterion",
        "simplicity",
        "relative",
        "analytical",
        "apparatus",
        "employ",
        "consequently",
        "simplicity",
        "may",
        "apparent",
        "analysis",
        "experimental",
        "data",
        "may",
        "even",
        "force",
        "u",
        "adjust",
        "experiment",
        "reflecting",
        "generalization",
        "process",
        "show",
        "presupposes",
        "belief",
        "unity",
        "simplicity",
        "nature",
        "poincaré",
        "however",
        "general",
        "kind",
        "presupposition",
        "required",
        "hypothesis",
        "law",
        "inertia",
        "example",
        "obtained",
        "except",
        "respect",
        "preexisting",
        "category",
        "differential",
        "equation",
        "thus",
        "replaces",
        "physical",
        "induction",
        "lead",
        "simple",
        "experimental",
        "fact",
        "poincaré",
        "distinguished",
        "empirical",
        "law",
        "conventional",
        "principle",
        "one",
        "move",
        "simple",
        "empirical",
        "law",
        "understood",
        "confirmable",
        "hypothesis",
        "principle",
        "result",
        "conventional",
        "decision",
        "withdraw",
        "confirmable",
        "hypothesis",
        "judgment",
        "experience",
        "mechanic",
        "employ",
        "methodological",
        "procedure",
        "geometry",
        "regard",
        "class",
        "displacement",
        "group",
        "law",
        "received",
        "sufficient",
        "confirmation",
        "experiment",
        "may",
        "adopt",
        "two",
        "attitude",
        "either",
        "may",
        "leave",
        "law",
        "fray",
        "remain",
        "subject",
        "incessant",
        "revision",
        "without",
        "doubt",
        "end",
        "demonstrating",
        "approximate",
        "else",
        "may",
        "elevate",
        "principle",
        "adopting",
        "convention",
        "poincaré",
        "b",
        "b",
        "thus",
        "outline",
        "generalization",
        "scheme",
        "physic",
        "presented",
        "follows",
        "phenomenon",
        "move",
        "physical",
        "induction",
        "experimental",
        "result",
        "thanks",
        "differential",
        "equation",
        "law",
        "general",
        "hypothesis",
        "common",
        "decision",
        "scientific",
        "community",
        "elevated",
        "finally",
        "principle",
        "certainly",
        "general",
        "scheme",
        "concrete",
        "process",
        "generalization",
        "could",
        "include",
        "many",
        "variation",
        "difference",
        "geometric",
        "axiom",
        "disguised",
        "definition",
        "physical",
        "law",
        "principle",
        "seems",
        "define",
        "poincaré",
        "epistemological",
        "criterion",
        "distinguishes",
        "geometry",
        "mechanic",
        "ontological",
        "point",
        "view",
        "geometry",
        "convenient",
        "convention",
        "definition",
        "chosen",
        "function",
        "object",
        "solid",
        "body",
        "ray",
        "object",
        "geometry",
        "furthermore",
        "geometry",
        "presuppose",
        "category",
        "group",
        "geometry",
        "requires",
        "double",
        "conventional",
        "abstraction",
        "mechanic",
        "convention",
        "useful",
        "apply",
        "physical",
        "object",
        "poincaré",
        "context",
        "presuppose",
        "category",
        "empirical",
        "physical",
        "induction",
        "differential",
        "equation",
        "necessary",
        "precondition",
        "science",
        "poincaré",
        "approach",
        "therefore",
        "integrates",
        "specifically",
        "kantian",
        "element",
        "idea",
        "precondition",
        "still",
        "completely",
        "eliminating",
        "transcendental",
        "basis",
        "component",
        "find",
        "kant",
        "thought",
        "poincaré",
        "argument",
        "favor",
        "necessary",
        "transmission",
        "conventional",
        "character",
        "geometry",
        "physic",
        "based",
        "analogy",
        "show",
        "another",
        "important",
        "relationship",
        "geometry",
        "physic",
        "methodological",
        "function",
        "transformation",
        "group",
        "respect",
        "representative",
        "space",
        "corresponds",
        "function",
        "geometry",
        "respect",
        "physic",
        "analogy",
        "run",
        "follows",
        "law",
        "displacement",
        "may",
        "correspond",
        "approximately",
        "law",
        "group",
        "consequently",
        "considered",
        "result",
        "two",
        "component",
        "change",
        "first",
        "displacement",
        "second",
        "qualitative",
        "alteration",
        "poincaré",
        "regard",
        "physical",
        "complex",
        "relation",
        "two",
        "body",
        "a",
        "b",
        "result",
        "two",
        "component",
        "first",
        "regarded",
        "simple",
        "geometrical",
        "principle",
        "second",
        "composed",
        "two",
        "epistemological",
        "laws",
        "body",
        "a",
        "b",
        "related",
        "figure",
        "a",
        "b",
        "geometrical",
        "space",
        "r",
        "b",
        "leftrightarrow",
        "r",
        "b",
        "wedge",
        "r_a",
        "wedge",
        "r_b",
        "b",
        "b",
        "r",
        "properly",
        "geometrical",
        "proposition",
        "r_i",
        "expressing",
        "relationship",
        "object",
        "representative",
        "space",
        "geometrical",
        "space",
        "relation",
        "solid",
        "body",
        "motion",
        "invariant",
        "poincaré",
        "declares",
        "changing",
        "relation",
        "r_i",
        "geometrical",
        "proposition",
        "r",
        "b",
        "could",
        "even",
        "serve",
        "describe",
        "relationship",
        "two",
        "different",
        "physical",
        "body",
        "see",
        "poincaré",
        "b",
        "b",
        "poincaré",
        "thereby",
        "rule",
        "application",
        "geometry",
        "physic",
        "based",
        "structural",
        "isomorphism",
        "presupposed",
        "reality",
        "mette",
        "conventional",
        "element",
        "physical",
        "theory",
        "often",
        "misunderstood",
        "poincaré",
        "contemporary",
        "example",
        "affirmation",
        "neither",
        "two",
        "proposition",
        "earth",
        "turn",
        "round",
        "earth",
        "turn",
        "round",
        "true",
        "kinematic",
        "sense",
        "rehabilitation",
        "ptolemy",
        "system",
        "consequence",
        "fact",
        "physic",
        "empirical",
        "systematic",
        "epistemic",
        "underdetermination",
        "theory",
        "limited",
        "unifying",
        "consideration",
        "physical",
        "theory",
        "much",
        "true",
        "put",
        "evidence",
        "true",
        "relations",
        "earth",
        "turn",
        "round",
        "richer",
        "content",
        "expressed",
        "flattening",
        "earth",
        "rotation",
        "foucault",
        "pendulum",
        "gyration",
        "cyclone",
        "tradewinds",
        "know",
        "else",
        "poincaré",
        "b",
        "b",
        "however",
        "physic",
        "properthat",
        "optic",
        "electrodynamicsthe",
        "conventional",
        "element",
        "seem",
        "weakened",
        "come",
        "across",
        "different",
        "kind",
        "hypothesis",
        "fully",
        "perceive",
        "productivity",
        "undoubtedly",
        "theory",
        "seem",
        "first",
        "sight",
        "fragile",
        "history",
        "science",
        "show",
        "u",
        "fleeting",
        "however",
        "entirely",
        "die",
        "something",
        "remains",
        "something",
        "must",
        "try",
        "sort",
        "true",
        "reality",
        "poincaré",
        "fact",
        "poincaré",
        "model",
        "explanation",
        "founded",
        "minimum",
        "wellconfirmed",
        "hypothesis",
        "erected",
        "principle",
        "meaningful",
        "proposition",
        "deduced",
        "called",
        "question",
        "maxwell",
        "approach",
        "view",
        "crisis",
        "physic",
        "brewing",
        "toward",
        "end",
        "th",
        "century",
        "poincaré",
        "general",
        "position",
        "work",
        "without",
        "posing",
        "problem",
        "respect",
        "concrete",
        "principle",
        "briefly",
        "mention",
        "interesting",
        "case",
        "application",
        "principle",
        "relativity",
        "electrodynamics",
        "one",
        "discussed",
        "subject",
        "historian",
        "eg",
        "goldberg",
        "paty",
        "miller",
        "a",
        "zahar",
        "darrigol",
        "rouché",
        "walter",
        "disalle",
        "not",
        "least",
        "poincaré",
        "einstein",
        "cite",
        "relativity",
        "despite",
        "fact",
        "einstein",
        "read",
        "poincaré",
        "science",
        "hypothesis",
        "poincaré",
        "wrote",
        "einstein",
        "recommendation",
        "letter",
        "sometime",
        "meeting",
        "first",
        "solvay",
        "congress",
        "walter",
        "chap",
        "uncontroversial",
        "poincaré",
        "discovered",
        "salient",
        "point",
        "special",
        "theory",
        "relativity",
        "operational",
        "definition",
        "clocksynchronization",
        "first",
        "order",
        "vc",
        "relativistic",
        "formula",
        "composition",
        "speed",
        "determination",
        "structure",
        "lorentzgroup",
        "since",
        "maxwelllorentz",
        "equation",
        "electromagnetics",
        "galileocovariant",
        "classical",
        "principle",
        "relativity",
        "according",
        "measurement",
        "one",
        "inertial",
        "reference",
        "frame",
        "converted",
        "another",
        "galilean",
        "transformation",
        "called",
        "question",
        "using",
        "famous",
        "st",
        "louis",
        "lecture",
        "designation",
        "physical",
        "principle",
        "relativity",
        "poincaré",
        "a",
        "apply",
        "finite",
        "equation",
        "directly",
        "observed",
        "differential",
        "equation",
        "poincaré",
        "a",
        "poincaré",
        "report",
        "lorentz",
        "introduces",
        "conjecture",
        "ie",
        "ad",
        "hoc",
        "hypothesis",
        "local",
        "time",
        "uniform",
        "contraction",
        "direction",
        "motion",
        "attempt",
        "save",
        "principle",
        "application",
        "electromagnetic",
        "domain",
        "see",
        "poincaré",
        "b",
        "ff",
        "b",
        "ff",
        "indeed",
        "poincaré",
        "made",
        "lorentz",
        "theory",
        "fully",
        "compatible",
        "relativity",
        "principle",
        "thus",
        "naturally",
        "inclined",
        "remark",
        "poincaré",
        "admit",
        "postulate",
        "relativity",
        "every",
        "domain",
        "postulating",
        "principle",
        "general",
        "law",
        "nature",
        "poincaré",
        "extended",
        "form",
        "find",
        "origin",
        "galilean",
        "principle",
        "motivation",
        "compatibility",
        "theory",
        "explaining",
        "experiment",
        "able",
        "inform",
        "u",
        "earth",
        "motion",
        "relative",
        "ether",
        "principle",
        "element",
        "work",
        "progress",
        "containing",
        "several",
        "conjecture",
        "possibility",
        "lose",
        "soundness",
        "poincaré",
        "b",
        "b",
        "fact",
        "two",
        "principle",
        "old",
        "one",
        "made",
        "immune",
        "revision",
        "considering",
        "conventional",
        "principle",
        "serf",
        "construct",
        "geometrical",
        "space",
        "via",
        "transformation",
        "group",
        "mathematical",
        "expression",
        "psychological",
        "principle",
        "free",
        "mobility",
        "rigid",
        "body",
        "new",
        "one",
        "invariance",
        "concern",
        "differential",
        "equation",
        "geometry",
        "could",
        "rooted",
        "lorentz",
        "group",
        "price",
        "accepting",
        "fourdimensional",
        "spacetime",
        "indefinite",
        "metric",
        "see",
        "gray",
        "walter",
        "seems",
        "poincaré",
        "old",
        "conventional",
        "construction",
        "space",
        "prefers",
        "euclidean",
        "geometry",
        "basis",
        "consideration",
        "simplicity",
        "commodity",
        "must",
        "subsumed",
        "new",
        "convention",
        "spacetime",
        "indeed",
        "poincaré",
        "never",
        "abandon",
        "galilean",
        "spacetime",
        "even",
        "clear",
        "principle",
        "special",
        "relativity",
        "lorentz",
        "covariance",
        "instead",
        "galilean",
        "covariance",
        "confirmed",
        "well",
        "enough",
        "unassailable",
        "experiment",
        "make",
        "principle",
        "galilean",
        "covariance",
        "unfruitful",
        "walter",
        "situation",
        "larry",
        "sklar",
        "called",
        "transient",
        "underdetermination",
        "theory",
        "empirically",
        "equivalent",
        "equally",
        "least",
        "reasonably",
        "well",
        "confirmed",
        "evidence",
        "happen",
        "hand",
        "moment",
        "see",
        "stanford",
        "sklar",
        "waiting",
        "make",
        "decision",
        "face",
        "new",
        "result"
    ]
}