{
    "main_text": "Conceptual Matters || Obligation, Morality, and Practical Reason\n2.3 Obligation, Morality, and Practical Reason\n\nAs in the five historically significant theories surveyed in the\nprevious section, the presumption has continued to be that the answer\nto the problem of political obligation must be stated in moral terms.\nWhen T. H. Green set out in 1879 “to discover the true ground or\njustification for obedience to law,” for example, he was looking\nfor more than prudence alone can provide. “You ought to obey the\nlaw because you will suffer if you do not” may be a powerful\nreason for obedience, but it is not a reason that speaks to\nGreen’s concern with “the moral function or object served\nby law…” (1986, p. 13). For Green, and for almost\neveryone else who has pondered it, the problem of political obligation\nis a moral problem, and the obligation in question is a kind of moral\nobligation. To have a political obligation, then, is to have a moral\nduty to obey the law.\n\nMargaret Gilbert has recently challenged this moralized\ncharacterization of political obligation (Gilbert 2006; Gilbert 2013).\nShe maintains that a political obligation is a genuine obligation, by\nwhich she means that it provides a person subject to it with a\nsufficient, though not necessarily conclusive, reason for action that\ntrumps considerations of inclination or self-interest. However,\nGilbert distinguishes between two kinds of genuine obligations, or two\nsenses of the term “obligation,” the first synonymous with\nbeing the subject of a moral requirement and the second with\n“owing” something to another (2013, pp. 391–2).\nObligation in this second sense describes a normative relationship\nbetween two or more parties, one that can be created via a suitable\nact of will; for example, by what Gilbert calls an exercise of joint\ncommitment. It is the second sense of obligation that Gilbert\nmaintains we ought to employ in our analysis of the problem of\npolitical obligation, understood here as the challenge of accounting\nfor the obligations people owe one another as co-members of a given\npolity. That does not preclude the development of a theory concerning\nwhen moral requirements outweigh or defeat people’s political\nobligations, of course. The theory of political obligation itself,\nhowever, ought to be de-moralized.\n\nOne upshot of Gilbert’s account is that it entirely separates\nthe existence of political obligations from the justice or injustice\nof the political community’s institutions and laws. On her\naccount, individuals can acquire genuine obligations in the sense of\nowing something to another even when their suitable act of willing is\ncoerced or the content of what they agree to owe another is immoral.\nWith respect to political obligation, then, neither state coercion\n(i.e., the absence of voluntary consent) nor the injustice of a\nstate’s laws or institutions precludes its citizens’\nacquisition of a genuine obligation to obey its laws. But why think\nthat a promise extracted at gun point generates any reason to do that\nwhich one promised, or that a voluntary agreement to torture babies\ngenerates a genuine (albeit not conclusive) obligation to do so? Or,\nif coerced or immoral owing-obligations are genuine but always\ndefeated or trumped by moral-requirement-obligations, one might wonder\nwhy we should posit their separate existence at all? One possibility\nis that doing so is necessary to render intelligible the response of\nthe promisee when the coerced promisor reneges on her promise; we can\nunderstand why the promisee feels betrayed even if we do not think he\nis justified in feeling that way. This response, however, treats\nGilbert’s account of political obligation as an explanatory\ntheory, not a justificatory one (Lefkowitz 2007; for a response, see\nGilbert 2013, pp. 406–7).\n\nGilbert aside, theorists of political obligation characterize it as a\nmoral duty to obey the law. As such, it provides a person with a\ncategorical reason for action, one that does not depend on her\ninclinations or self-interest. Political obligation is also typically\nunderstood to be content-independent; that is, to be a duty\nto obey the law as such, or simply because it is the law [Hart 1982,\npp. 254–55]. Where a person has a duty to obey the law, the fact\nthat the law requires her to X suffices to provide her with a reason\nto X, independent of any judgment she may make regarding the merits of\nperforming X. The problem of political obligation, then, is not simply\nthe question of whether a person has a reason to do that which the law\nwould have her do. Often a person will have prudential reasons to do\nso, and she may have moral obligations to perform or not perform\nspecific acts independent of their being legally required or\nproscribed, as in the case of forbearing from murder. Rather, the\nquestion concerns the conditions, if any, in which the fact that the\nlaw requires a person to act thus-and-so imposes a moral obligation on\nher to act as the law directs. The content-independence of political\nobligation reflects the fact that what stands in need of justification\nis the polity’s right to its subjects’ obedience; to their\nacting as it directs because it so directs them.\n\nHow best to understand the content-independence of political\nobligation, and indeed, whether we ought to conceive of a duty to obey\nthe law in this way, remain live questions. For example, Stefan\nSciaraffa argues that in introducing the idea of content-independence,\nH.L.A. Hart relies on Paul Grice’s distinction between natural\nand non-natural meaning. Statements with a non-natural meaning provide\nthose to whom they are addressed with a particular kind of reason to\nform some belief or perform some act A, namely the intention of the\nagent who uttered the statement that they form that belief or perform\nthat act. The phrase ‘content-independent reason’ is a\n(misleading) label for this particular kind of reason. Or as Sciaraffa\nputs the point, “an agent has a content-independent reason to\nphi if and only if someone’s intent that she phi is a reason for\nher to phi” (2009, p. 234). N.P. Adams counters that a reason is\ncontent-independent if and only if “it has a container as a\nconstituent part and changing the content of that container does not\ndetermine whether the agent has that reason and does not determine the\nweight of that reason” (2017, p. 149). Speech-acts such as\ncommands and promises are paradigmatic examples of containers. It is\nthe status of an agent as morally entitled to direct another to\nperform some act, apart from any other considerations that count in\nfavor of performing it, that provide the person so directed with a\nreason to perform that act. Sciaraffa and Adams draw on their\nrespective accounts of content-independence to offer rejoinders to\nPeter Markwick’s criticisms of (a common interpretation of)\ncontent-independence (Markwick 2000). Laura Valentini maintains that\n“if property P, invoked to justify the authority of law, is not\ndisplayed by legal commands robustly across variations in\ntheir content, then P cannot justify an obligation to obey the law\nbecause it is the law” (2018, p. 141). She then argues that\nwhile certain common approaches to justifying political obligation,\nsuch as consent, can satisfy this understanding of\ncontent-independence, others, such as fair play, cannot. Finally,\nGeorge Klosko contends that we ought to reject altogether the claim\nthat political obligation is content-independent (Klosko 2011; see\nAdams, Valentini, for responses).\n\nHow can the state’s mere willing that a person perform a certain\nact create a moral obligation to do so? One response is to construe\nthe successful exercise of practical authority not as the creation of\nmoral obligations ex nihilo but as a justified claim to\ndeference to the state’s judgment regarding what its subjects\nhave independent reason to do. The characterization of this deference\nwithin a person’s deliberation is a matter of some dispute. H.\nL. A. Hart and Joseph Raz, for example, argue that law is preemptive;\nlaw does not merely offer a consideration for or against a potential\ncourse of action, to be weighed against any and all other relevant\nconsiderations. Rather, law aims to exclude from an agent’s\ndeliberation at least some of the considerations favoring or opposing\nthe conduct at issue, considerations that in the absence of the law it\nwould be permissible to take into account (Raz 1979, chaps. 1 and 2).\nRival views of the manner in which political obligation functions in a\nperson’s deliberation reject the exclusionary element of\nRaz’s account of the duty to obey the law, arguing that\npolitical obligations are simply weighty moral reasons that are\nbalanced against all of the other reasons a person has to perform or\nnot perform a given act (Perry 1989). On neither account, though, is a\nperson’s political obligation taken to provide her with an\nabsolute duty to obey the law. Raz, for example, notes that law need\nnot exclude all of the first-order reasons a person might have for\nperforming a given act (1986, p. 46). Nor does he claim that the\nfirst-order reason the law provides for not performing a given act\nwill always outweigh or defeat non-excluded first-order reasons a\nperson has to perform that act. In other words, the duty to obey the\nlaw is a prima facie or pro tanto reason for action,\nfrom which it follows that the bearer of a political obligation may\nnot always have a conclusive or all-things-considered reason to act as\nthe law demands.\n\nTheorists of political obligation typically ascribe two further\nfeatures to the moral duty they seek to defend. First, the duty to\nobey the law is general both in the sense that it is a duty to obey\nthe entire body of law in a given jurisdiction and in the sense that\nthe duty is borne by all those living within that jurisdiction. Note\nthat a general moral duty to obey the law is consistent with variation\nin the legal obligations different subjects bear. For example, a given\nstate may impose on all and only its male citizens a duty to register\nfor a military draft, in which case the full set of legal obligations\nborne by men in this state will differ from the full set borne by\nwomen. Nevertheless, citizens of both sexes may be subject to a\ngeneral political obligation, meaning that they have a moral duty to\nfulfill all of their legal obligations. Raz, however, denies that the\nsubjects of any existing state or indeed anything remotely like it\nhave a general duty to obey the law; rather, law’s authority is\npiecemeal, both with respect to who has a moral duty to obey a\nparticular law and with respect to the number of laws within a given\nlegal system that enjoy authority over anyone.\n\nThe second feature commonly ascribed to political obligations is that\nthey are typically conceived of as being owed only to the\nparticular political/legal society that claims primary or exclusive\njurisdiction over a person. Following John Simmons’s influential\nanalysis, this has come to be known as “the particularity\nrequirement.” Political obligation, Simmons maintains, carries\nan implicit connection to citizenship, which means that those who are\nengaged in the political obligation debate “are only interested\nin those moral requirements [including obligations and duties] which\nbind an individual to one particular political community, set\nof institutions, etc.” (1979, p. 31; but cf. Edmundson 2004, p.\n232, and Walton, 2013). As indicated below, in §4.4, the main\nobjection to natural duty theories of political obligation is that\nthey cannot account for this particularity.\n",
    "section_title": "2.3 Obligation, Morality, and Practical Reason",
    "entry_title": "Political Obligation",
    "hierarchy_title": "Political Obligation || Conceptual Matters || Obligation, Morality, and Practical Reason",
    "tokenized_text": [
        "conceptual",
        "matter",
        "obligation",
        "morality",
        "practical",
        "reason",
        "obligation",
        "morality",
        "practical",
        "reason",
        "five",
        "historically",
        "significant",
        "theory",
        "surveyed",
        "previous",
        "section",
        "presumption",
        "continued",
        "answer",
        "problem",
        "political",
        "obligation",
        "must",
        "stated",
        "moral",
        "term",
        "t",
        "h",
        "green",
        "set",
        "discover",
        "true",
        "ground",
        "justification",
        "obedience",
        "law",
        "example",
        "looking",
        "prudence",
        "alone",
        "provide",
        "ought",
        "obey",
        "law",
        "suffer",
        "may",
        "powerful",
        "reason",
        "obedience",
        "reason",
        "speaks",
        "green",
        "concern",
        "moral",
        "function",
        "object",
        "served",
        "law",
        "p",
        "green",
        "almost",
        "everyone",
        "else",
        "pondered",
        "problem",
        "political",
        "obligation",
        "moral",
        "problem",
        "obligation",
        "question",
        "kind",
        "moral",
        "obligation",
        "political",
        "obligation",
        "moral",
        "duty",
        "obey",
        "law",
        "margaret",
        "gilbert",
        "recently",
        "challenged",
        "moralized",
        "characterization",
        "political",
        "obligation",
        "gilbert",
        "gilbert",
        "maintains",
        "political",
        "obligation",
        "genuine",
        "obligation",
        "mean",
        "provides",
        "person",
        "subject",
        "sufficient",
        "though",
        "necessarily",
        "conclusive",
        "reason",
        "action",
        "trump",
        "consideration",
        "inclination",
        "selfinterest",
        "however",
        "gilbert",
        "distinguishes",
        "two",
        "kind",
        "genuine",
        "obligation",
        "two",
        "sens",
        "term",
        "obligation",
        "first",
        "synonymous",
        "subject",
        "moral",
        "requirement",
        "second",
        "owing",
        "something",
        "another",
        "pp",
        "obligation",
        "second",
        "sense",
        "describes",
        "normative",
        "relationship",
        "two",
        "party",
        "one",
        "created",
        "via",
        "suitable",
        "act",
        "example",
        "gilbert",
        "call",
        "exercise",
        "joint",
        "commitment",
        "second",
        "sense",
        "obligation",
        "gilbert",
        "maintains",
        "ought",
        "employ",
        "analysis",
        "problem",
        "political",
        "obligation",
        "understood",
        "challenge",
        "accounting",
        "obligation",
        "people",
        "owe",
        "one",
        "another",
        "comembers",
        "given",
        "polity",
        "preclude",
        "development",
        "theory",
        "concerning",
        "moral",
        "requirement",
        "outweigh",
        "defeat",
        "people",
        "political",
        "obligation",
        "course",
        "theory",
        "political",
        "obligation",
        "however",
        "ought",
        "demoralized",
        "one",
        "upshot",
        "gilbert",
        "account",
        "entirely",
        "separate",
        "existence",
        "political",
        "obligation",
        "justice",
        "injustice",
        "political",
        "community",
        "institution",
        "law",
        "account",
        "individual",
        "acquire",
        "genuine",
        "obligation",
        "sense",
        "owing",
        "something",
        "another",
        "even",
        "suitable",
        "act",
        "willing",
        "coerced",
        "content",
        "agree",
        "owe",
        "another",
        "immoral",
        "respect",
        "political",
        "obligation",
        "neither",
        "state",
        "coercion",
        "ie",
        "absence",
        "voluntary",
        "consent",
        "injustice",
        "state",
        "law",
        "institution",
        "precludes",
        "citizen",
        "acquisition",
        "genuine",
        "obligation",
        "obey",
        "law",
        "think",
        "promise",
        "extracted",
        "gun",
        "point",
        "generates",
        "reason",
        "one",
        "promised",
        "voluntary",
        "agreement",
        "torture",
        "baby",
        "generates",
        "genuine",
        "albeit",
        "conclusive",
        "obligation",
        "coerced",
        "immoral",
        "owingobligations",
        "genuine",
        "always",
        "defeated",
        "trumped",
        "moralrequirementobligations",
        "one",
        "might",
        "wonder",
        "posit",
        "separate",
        "existence",
        "one",
        "possibility",
        "necessary",
        "render",
        "intelligible",
        "response",
        "promisee",
        "coerced",
        "promisor",
        "renege",
        "promise",
        "understand",
        "promisee",
        "feel",
        "betrayed",
        "even",
        "think",
        "justified",
        "feeling",
        "way",
        "response",
        "however",
        "treat",
        "gilbert",
        "account",
        "political",
        "obligation",
        "explanatory",
        "theory",
        "justificatory",
        "one",
        "lefkowitz",
        "response",
        "see",
        "gilbert",
        "pp",
        "gilbert",
        "aside",
        "theorist",
        "political",
        "obligation",
        "characterize",
        "moral",
        "duty",
        "obey",
        "law",
        "provides",
        "person",
        "categorical",
        "reason",
        "action",
        "one",
        "depend",
        "inclination",
        "selfinterest",
        "political",
        "obligation",
        "also",
        "typically",
        "understood",
        "contentindependent",
        "duty",
        "obey",
        "law",
        "simply",
        "law",
        "hart",
        "pp",
        "person",
        "duty",
        "obey",
        "law",
        "fact",
        "law",
        "requires",
        "x",
        "suffices",
        "provide",
        "reason",
        "x",
        "independent",
        "judgment",
        "may",
        "make",
        "regarding",
        "merit",
        "performing",
        "x",
        "problem",
        "political",
        "obligation",
        "simply",
        "question",
        "whether",
        "person",
        "reason",
        "law",
        "would",
        "often",
        "person",
        "prudential",
        "reason",
        "may",
        "moral",
        "obligation",
        "perform",
        "perform",
        "specific",
        "act",
        "independent",
        "legally",
        "required",
        "proscribed",
        "case",
        "forbearing",
        "murder",
        "rather",
        "question",
        "concern",
        "condition",
        "fact",
        "law",
        "requires",
        "person",
        "act",
        "thusandso",
        "imposes",
        "moral",
        "obligation",
        "act",
        "law",
        "directs",
        "contentindependence",
        "political",
        "obligation",
        "reflects",
        "fact",
        "stand",
        "need",
        "justification",
        "polity",
        "right",
        "subject",
        "obedience",
        "acting",
        "directs",
        "directs",
        "best",
        "understand",
        "contentindependence",
        "political",
        "obligation",
        "indeed",
        "whether",
        "ought",
        "conceive",
        "duty",
        "obey",
        "law",
        "way",
        "remain",
        "live",
        "question",
        "example",
        "stefan",
        "sciaraffa",
        "argues",
        "introducing",
        "idea",
        "contentindependence",
        "hla",
        "hart",
        "relies",
        "paul",
        "grice",
        "distinction",
        "natural",
        "nonnatural",
        "meaning",
        "statement",
        "nonnatural",
        "meaning",
        "provide",
        "addressed",
        "particular",
        "kind",
        "reason",
        "form",
        "belief",
        "perform",
        "act",
        "namely",
        "intention",
        "agent",
        "uttered",
        "statement",
        "form",
        "belief",
        "perform",
        "act",
        "phrase",
        "contentindependent",
        "reason",
        "misleading",
        "label",
        "particular",
        "kind",
        "reason",
        "sciaraffa",
        "put",
        "point",
        "agent",
        "contentindependent",
        "reason",
        "phi",
        "someone",
        "intent",
        "phi",
        "reason",
        "phi",
        "p",
        "np",
        "adam",
        "counter",
        "reason",
        "contentindependent",
        "container",
        "constituent",
        "part",
        "changing",
        "content",
        "container",
        "determine",
        "whether",
        "agent",
        "reason",
        "determine",
        "weight",
        "reason",
        "p",
        "speechacts",
        "command",
        "promise",
        "paradigmatic",
        "example",
        "container",
        "status",
        "agent",
        "morally",
        "entitled",
        "direct",
        "another",
        "perform",
        "act",
        "apart",
        "consideration",
        "count",
        "favor",
        "performing",
        "provide",
        "person",
        "directed",
        "reason",
        "perform",
        "act",
        "sciaraffa",
        "adam",
        "draw",
        "respective",
        "account",
        "contentindependence",
        "offer",
        "rejoinder",
        "peter",
        "markwick",
        "criticism",
        "common",
        "interpretation",
        "contentindependence",
        "markwick",
        "laura",
        "valentini",
        "maintains",
        "property",
        "p",
        "invoked",
        "justify",
        "authority",
        "law",
        "displayed",
        "legal",
        "command",
        "robustly",
        "across",
        "variation",
        "content",
        "p",
        "justify",
        "obligation",
        "obey",
        "law",
        "law",
        "p",
        "argues",
        "certain",
        "common",
        "approach",
        "justifying",
        "political",
        "obligation",
        "consent",
        "satisfy",
        "understanding",
        "contentindependence",
        "others",
        "fair",
        "play",
        "finally",
        "george",
        "klosko",
        "contends",
        "ought",
        "reject",
        "altogether",
        "claim",
        "political",
        "obligation",
        "contentindependent",
        "klosko",
        "see",
        "adam",
        "valentini",
        "response",
        "state",
        "mere",
        "willing",
        "person",
        "perform",
        "certain",
        "act",
        "create",
        "moral",
        "obligation",
        "one",
        "response",
        "construe",
        "successful",
        "exercise",
        "practical",
        "authority",
        "creation",
        "moral",
        "obligation",
        "ex",
        "nihilo",
        "justified",
        "claim",
        "deference",
        "state",
        "judgment",
        "regarding",
        "subject",
        "independent",
        "reason",
        "characterization",
        "deference",
        "within",
        "person",
        "deliberation",
        "matter",
        "dispute",
        "h",
        "l",
        "a",
        "hart",
        "joseph",
        "raz",
        "example",
        "argue",
        "law",
        "preemptive",
        "law",
        "merely",
        "offer",
        "consideration",
        "potential",
        "course",
        "action",
        "weighed",
        "relevant",
        "consideration",
        "rather",
        "law",
        "aim",
        "exclude",
        "agent",
        "deliberation",
        "least",
        "consideration",
        "favoring",
        "opposing",
        "conduct",
        "issue",
        "consideration",
        "absence",
        "law",
        "would",
        "permissible",
        "take",
        "account",
        "raz",
        "chap",
        "rival",
        "view",
        "manner",
        "political",
        "obligation",
        "function",
        "person",
        "deliberation",
        "reject",
        "exclusionary",
        "element",
        "raz",
        "account",
        "duty",
        "obey",
        "law",
        "arguing",
        "political",
        "obligation",
        "simply",
        "weighty",
        "moral",
        "reason",
        "balanced",
        "reason",
        "person",
        "perform",
        "perform",
        "given",
        "act",
        "perry",
        "neither",
        "account",
        "though",
        "person",
        "political",
        "obligation",
        "taken",
        "provide",
        "absolute",
        "duty",
        "obey",
        "law",
        "raz",
        "example",
        "note",
        "law",
        "need",
        "exclude",
        "firstorder",
        "reason",
        "person",
        "might",
        "performing",
        "given",
        "act",
        "p",
        "claim",
        "firstorder",
        "reason",
        "law",
        "provides",
        "performing",
        "given",
        "act",
        "always",
        "outweigh",
        "defeat",
        "nonexcluded",
        "firstorder",
        "reason",
        "person",
        "perform",
        "act",
        "word",
        "duty",
        "obey",
        "law",
        "prima",
        "facie",
        "pro",
        "tanto",
        "reason",
        "action",
        "follows",
        "bearer",
        "political",
        "obligation",
        "may",
        "always",
        "conclusive",
        "allthingsconsidered",
        "reason",
        "act",
        "law",
        "demand",
        "theorist",
        "political",
        "obligation",
        "typically",
        "ascribe",
        "two",
        "feature",
        "moral",
        "duty",
        "seek",
        "defend",
        "first",
        "duty",
        "obey",
        "law",
        "general",
        "sense",
        "duty",
        "obey",
        "entire",
        "body",
        "law",
        "given",
        "jurisdiction",
        "sense",
        "duty",
        "borne",
        "living",
        "within",
        "jurisdiction",
        "note",
        "general",
        "moral",
        "duty",
        "obey",
        "law",
        "consistent",
        "variation",
        "legal",
        "obligation",
        "different",
        "subject",
        "bear",
        "example",
        "given",
        "state",
        "may",
        "impose",
        "male",
        "citizen",
        "duty",
        "register",
        "military",
        "draft",
        "case",
        "full",
        "set",
        "legal",
        "obligation",
        "borne",
        "men",
        "state",
        "differ",
        "full",
        "set",
        "borne",
        "woman",
        "nevertheless",
        "citizen",
        "sex",
        "may",
        "subject",
        "general",
        "political",
        "obligation",
        "meaning",
        "moral",
        "duty",
        "fulfill",
        "legal",
        "obligation",
        "raz",
        "however",
        "denies",
        "subject",
        "existing",
        "state",
        "indeed",
        "anything",
        "remotely",
        "like",
        "general",
        "duty",
        "obey",
        "law",
        "rather",
        "law",
        "authority",
        "piecemeal",
        "respect",
        "moral",
        "duty",
        "obey",
        "particular",
        "law",
        "respect",
        "number",
        "law",
        "within",
        "given",
        "legal",
        "system",
        "enjoy",
        "authority",
        "anyone",
        "second",
        "feature",
        "commonly",
        "ascribed",
        "political",
        "obligation",
        "typically",
        "conceived",
        "owed",
        "particular",
        "politicallegal",
        "society",
        "claim",
        "primary",
        "exclusive",
        "jurisdiction",
        "person",
        "following",
        "john",
        "simmons",
        "influential",
        "analysis",
        "come",
        "known",
        "particularity",
        "requirement",
        "political",
        "obligation",
        "simmons",
        "maintains",
        "carry",
        "implicit",
        "connection",
        "citizenship",
        "mean",
        "engaged",
        "political",
        "obligation",
        "debate",
        "interested",
        "moral",
        "requirement",
        "including",
        "obligation",
        "duty",
        "bind",
        "individual",
        "one",
        "particular",
        "political",
        "community",
        "set",
        "institution",
        "etc",
        "p",
        "cf",
        "edmundson",
        "p",
        "walton",
        "indicated",
        "main",
        "objection",
        "natural",
        "duty",
        "theory",
        "political",
        "obligation",
        "account",
        "particularity"
    ]
}