{
    "main_text": "Changing Political Realities and Changing Concepts of Political Representation\n2. Changing Political Realities and Changing Concepts of Political Representation\n\nAs mentioned earlier, theoretical discussions of political\nrepresentation have focused mainly on the formal procedures of\nauthorization and accountability within nation states, that is, on\nwhat Pitkin called formalistic representation. However, such a focus\nis no longer satisfactory due to international and domestic political\ntransformations. [For an extensive discussion of international and\ndomestic transformations, see Mark Warren and Dario Castioglione\n(2004).] Increasingly international, transnational and\nnon-governmental actors play an important role in advancing public\npolicies on behalf of democratic citizens—that is, acting as\nrepresentatives for those citizens. Such actors “speak\nfor,” “act for” and can even “stand for”\nindividuals within a nation-state. It is no longer desirable to limit\none’s understanding of political representation to elected\nofficials within the nation-state. After all, increasingly state\n“contract out” important responsibilities to non-state\nactors, e.g. environmental regulation. As a result, elected officials\ndo not necessarily possess “the capacity to act,” the\ncapacity that Pitkin uses to identify who is a representative. So, as\nthe powers of nation-state have been disseminated to international and\ntransnational actors, elected representatives are not necessarily the\nagents who determine how policies are implemented. Given these\nchanges, the traditional focus of political representation, that is,\non elections within nation-states, is insufficient for understanding\nhow public policies are being made and implemented. The complexity of\nmodern representative processes and the multiple locations of\npolitical power suggest that contemporary notions of accountability\nare inadequate. Grant and Keohane (2005) have recently updated notions\nof accountability, suggesting that the scope of political\nrepresentation needs to be expanded in order to reflect contemporary\nrealities in the international arena. Michael Saward (2009) has\nproposed an innovative type of criteria that should be used for\nevaluating non-elective representative claims. John Dryzek and Simon\nNiemayer(2008) has proposed an alternative conception of\nrepresentation, what he calls discursive representation, to reflect\nthe fact that transnational actors represent discourses, not real\npeople. By discourses, they mean “a set of categories and\nconcepts embodying specific assumptions, judgments, contentions,\ndispositions, and capabilities.” The concept of discursive\nrepresentation can potentially redeem the promise of deliberative\ndemocracy when the deliberative participation of all affected by a\ncollective decision is infeasible. \n\nDomestic transformations also reveal the need to update contemporary\nunderstandings of political representation. Associational life —\nsocial movements, interest groups, and civic associations—is\nincreasingly recognized as important for the survival of\nrepresentative democracies. The extent to which interest groups write\npublic policies or play a central role in implementing and regulating\npolicies is the extent to which the division between formal and\ninformal representation has been blurred. The fluid relationship\nbetween the career paths of formal and informal representatives also\nsuggests that contemporary realities do not justify focusing mainly on\nformal representatives. Mark Warren’s concept of citizen\nrepresentatives (2008) opens up a theoretical framework for exploring\nhow citizens represent themselves and serve in representative\ncapacities. \n\nGiven these changes, it is necessary to revisit our conceptual\nunderstanding of political representation, specifically of democratic\nrepresentation. For as Jane Mansbridge has recently noted, normative\nunderstandings of representation have not kept up with recent\nempirical research and contemporary democratic practices. In her\nimportant article “Rethinking Representation” Mansbridge\nidentifies four forms of representation in modern democracies:\npromissory, anticipatory, gyroscopic and surrogacy. Promissory\nrepresentation is a form of representation in which representatives\nare to be evaluated by the promises they make to constituents during\ncampaigns. Promissory representation strongly resembles Pitkin’s\ndiscussion of formalistic representation. For both are primarily\nconcerned with the ways that constituents give their consent to the\nauthority of a representative. Drawing on recent empirical work,\nMansbridge argues for the existence of three additional forms of\nrepresentation. In anticipatory representation, representatives focus\non what they think their constituents will reward in the next election\nand not on what they promised during the campaign of the previous\nelection. Thus, anticipatory representation challenges those who\nunderstand accountability as primarily a retrospective activity. In\ngyroscopic representation, representatives “look within”\nto derive from their own experience conceptions of interest and\nprinciples to serve as a basis for their action. Finally, surrogate\nrepresentation occurs when a legislator represents constituents\noutside of their districts. For Mansbridge, each of these different\nforms of representation generates a different normative criterion by\nwhich representatives should be assessed. All four forms of\nrepresentation, then, are ways that democratic citizens can be\nlegitimately represented within a democratic regime. Yet none of the\nlatter three forms representation operates through the formal\nmechanisms of authorization and accountability. Recently, Mansbridge\n(2009) has gone further by suggesting that political science has\nfocused too much on the sanctions model of accountability and that\nanother model, what she calls the selection model, can be more\neffective at soliciting the desired behavior from representatives.\nAccording to Mansbridge, a sanction model of accountability presumes\nthat the representative has different interests from the represented\nand that the represented should not only monitor but reward the good\nrepresentative and punish the bad. In contrast, the selection model of\naccountability presumes that representatives have self-motivated and\nexogenous reasons for carrying out the represented’s wishes. In\nthis way, Mansbridge broadens our understanding of accountability to\nallow for good representation to occur outside of formal sanctioning\nmechanisms.\n\nMansbridge’s rethinking of the meaning of representation holds\nan important insight for contemporary discussions of democratic\nrepresentation. By specifying the different forms of representation\nwithin a democratic polity, Mansbridge teaches us that we should refer\nto the multiple forms of democratic representation.\nDemocratic representation should not be conceived as a monolithic\nconcept. Moreover, what is abundantly clear is that democratic\nrepresentation should no longer be treated as consisting simply in a\nrelationship between elected officials and constituents within her\nvoting district. Political representation should no longer be\nunderstood as a simple principal-agent relationship. Andrew Rehfeld\nhas gone farther, maintaining that political representation should no\nlonger be territorially based. In other words, Rehfeld (2005) argues\nthat constituencies, e.g. electoral districts, should not be\nconstructed based on where citizens live.\n\nLisa Disch (2011) also complicates our understanding of democratic\nrepresentation as a principal-agent relationship by uncovering a\ndilemma that arises between expectations of democratic responsiveness\nto constituents and recent empirical findings regarding the context\ndependency of individual constituents’ preferences. In response\nto this dilemma, Disch proposes a mobilization conception of political\nrepresentation and develops a systemic understanding of reflexivity as\nthe measure of its legitimacy.\n\nBy far, one of the most important shifts in the literature on\nrepresentation has been the “constructivist turn.”\nConstructivist approaches to representation emphasize the\nrepresentative’s role in creating and framing the identities and\nclaims of the represented. Here Michael Saward’s The\nRepresentative Claim is exemplary. For Saward, representation\nentails a series of relationships: “A maker of representations\n(M) puts forward a subject (S) which stands for an object (O) which is\nrelated to a referent (R) and is offered to an audience (A)”\n(2006, 302). Instead of presuming a pre-existing set of interests of\nthe represented that representatives “bring into” the\npolitical arena, Saward stresses how representative claim-making is a\n“deeply culturally inflected practice.” Saward explicitly\ndenies that theorists can know what are the interests of the\nrepresented. For this reason, the represented should have the ultimate\nsay in judging the claims of the representative. The task of the\nrepresentative is to create claims that will resonate with appropriate\naudiences.\n\nSaward therefore does not evaluate representatives by the extent to\nwhich they advance the preferences or interests of the represented.\nInstead he focuses on the institutional and collective conditions in\nwhich claim-making takes place. The constructivist turn examines the\nconditions for claim-making, not the activities of particular\nrepresentatives.\n\nSaward’s “constructivist turn” has generated a new\nresearch direction for both political theorists and empirical\nscientists. For example, Lisa Disch (2015) considers whether the\nconstructivist turn is a “normative dead” end, that is,\nwhether the epistemological commitments of constructivism that deny\nthe ability to identify interests will undermine the normative\ncommitments to democratic politics. Disch offers an alternative\napproach, what she calls “the citizen standpoint”. This\nstandpoint does not mean taking at face value whomever or whatever\ncitizens regard as representing them. Rather, it is “an\nepistemological and political achievement that does not exist\nspontaneously but develops out of the activism of political movements\ntogether with the critical theories and transformative empirical\nresearch to which they give rise” (2015, 493). (For other\ncritical engagements with Saward’s work, see Schaap et al, 2012\nand Nässtrom, 2011). \n",
    "section_title": "2. Changing Political Realities and Changing Concepts of Political Representation",
    "entry_title": "Political Representation",
    "hierarchy_title": "Political Representation || Changing Political Realities and Changing Concepts of Political Representation",
    "tokenized_text": [
        "changing",
        "political",
        "reality",
        "changing",
        "concept",
        "political",
        "representation",
        "changing",
        "political",
        "reality",
        "changing",
        "concept",
        "political",
        "representation",
        "mentioned",
        "earlier",
        "theoretical",
        "discussion",
        "political",
        "representation",
        "focused",
        "mainly",
        "formal",
        "procedure",
        "authorization",
        "accountability",
        "within",
        "nation",
        "state",
        "pitkin",
        "called",
        "formalistic",
        "representation",
        "however",
        "focus",
        "longer",
        "satisfactory",
        "due",
        "international",
        "domestic",
        "political",
        "transformation",
        "extensive",
        "discussion",
        "international",
        "domestic",
        "transformation",
        "see",
        "mark",
        "warren",
        "dario",
        "castioglione",
        "increasingly",
        "international",
        "transnational",
        "nongovernmental",
        "actor",
        "play",
        "important",
        "role",
        "advancing",
        "public",
        "policy",
        "behalf",
        "democratic",
        "citizensthat",
        "acting",
        "representative",
        "citizen",
        "actor",
        "speak",
        "act",
        "even",
        "stand",
        "individual",
        "within",
        "nationstate",
        "longer",
        "desirable",
        "limit",
        "one",
        "understanding",
        "political",
        "representation",
        "elected",
        "official",
        "within",
        "nationstate",
        "increasingly",
        "state",
        "contract",
        "important",
        "responsibility",
        "nonstate",
        "actor",
        "eg",
        "environmental",
        "regulation",
        "result",
        "elected",
        "official",
        "necessarily",
        "posse",
        "capacity",
        "act",
        "capacity",
        "pitkin",
        "us",
        "identify",
        "representative",
        "power",
        "nationstate",
        "disseminated",
        "international",
        "transnational",
        "actor",
        "elected",
        "representative",
        "necessarily",
        "agent",
        "determine",
        "policy",
        "implemented",
        "given",
        "change",
        "traditional",
        "focus",
        "political",
        "representation",
        "election",
        "within",
        "nationstates",
        "insufficient",
        "understanding",
        "public",
        "policy",
        "made",
        "implemented",
        "complexity",
        "modern",
        "representative",
        "process",
        "multiple",
        "location",
        "political",
        "power",
        "suggest",
        "contemporary",
        "notion",
        "accountability",
        "inadequate",
        "grant",
        "keohane",
        "recently",
        "updated",
        "notion",
        "accountability",
        "suggesting",
        "scope",
        "political",
        "representation",
        "need",
        "expanded",
        "order",
        "reflect",
        "contemporary",
        "reality",
        "international",
        "arena",
        "michael",
        "saward",
        "proposed",
        "innovative",
        "type",
        "criterion",
        "used",
        "evaluating",
        "nonelective",
        "representative",
        "claim",
        "john",
        "dryzek",
        "simon",
        "niemayer",
        "proposed",
        "alternative",
        "conception",
        "representation",
        "call",
        "discursive",
        "representation",
        "reflect",
        "fact",
        "transnational",
        "actor",
        "represent",
        "discourse",
        "real",
        "people",
        "discourse",
        "mean",
        "set",
        "category",
        "concept",
        "embodying",
        "specific",
        "assumption",
        "judgment",
        "contention",
        "disposition",
        "capabilities",
        "concept",
        "discursive",
        "representation",
        "potentially",
        "redeem",
        "promise",
        "deliberative",
        "democracy",
        "deliberative",
        "participation",
        "affected",
        "collective",
        "decision",
        "infeasible",
        "domestic",
        "transformation",
        "also",
        "reveal",
        "need",
        "update",
        "contemporary",
        "understanding",
        "political",
        "representation",
        "associational",
        "life",
        "social",
        "movement",
        "interest",
        "group",
        "civic",
        "associationsis",
        "increasingly",
        "recognized",
        "important",
        "survival",
        "representative",
        "democracy",
        "extent",
        "interest",
        "group",
        "write",
        "public",
        "policy",
        "play",
        "central",
        "role",
        "implementing",
        "regulating",
        "policy",
        "extent",
        "division",
        "formal",
        "informal",
        "representation",
        "blurred",
        "fluid",
        "relationship",
        "career",
        "path",
        "formal",
        "informal",
        "representative",
        "also",
        "suggests",
        "contemporary",
        "reality",
        "justify",
        "focusing",
        "mainly",
        "formal",
        "representative",
        "mark",
        "warren",
        "concept",
        "citizen",
        "representative",
        "open",
        "theoretical",
        "framework",
        "exploring",
        "citizen",
        "represent",
        "serve",
        "representative",
        "capacity",
        "given",
        "change",
        "necessary",
        "revisit",
        "conceptual",
        "understanding",
        "political",
        "representation",
        "specifically",
        "democratic",
        "representation",
        "jane",
        "mansbridge",
        "recently",
        "noted",
        "normative",
        "understanding",
        "representation",
        "kept",
        "recent",
        "empirical",
        "research",
        "contemporary",
        "democratic",
        "practice",
        "important",
        "article",
        "rethinking",
        "representation",
        "mansbridge",
        "identifies",
        "four",
        "form",
        "representation",
        "modern",
        "democracy",
        "promissory",
        "anticipatory",
        "gyroscopic",
        "surrogacy",
        "promissory",
        "representation",
        "form",
        "representation",
        "representative",
        "evaluated",
        "promise",
        "make",
        "constituent",
        "campaign",
        "promissory",
        "representation",
        "strongly",
        "resembles",
        "pitkin",
        "discussion",
        "formalistic",
        "representation",
        "primarily",
        "concerned",
        "way",
        "constituent",
        "give",
        "consent",
        "authority",
        "representative",
        "drawing",
        "recent",
        "empirical",
        "work",
        "mansbridge",
        "argues",
        "existence",
        "three",
        "additional",
        "form",
        "representation",
        "anticipatory",
        "representation",
        "representative",
        "focus",
        "think",
        "constituent",
        "reward",
        "next",
        "election",
        "promised",
        "campaign",
        "previous",
        "election",
        "thus",
        "anticipatory",
        "representation",
        "challenge",
        "understand",
        "accountability",
        "primarily",
        "retrospective",
        "activity",
        "gyroscopic",
        "representation",
        "representative",
        "look",
        "within",
        "derive",
        "experience",
        "conception",
        "interest",
        "principle",
        "serve",
        "basis",
        "action",
        "finally",
        "surrogate",
        "representation",
        "occurs",
        "legislator",
        "represents",
        "constituent",
        "outside",
        "district",
        "mansbridge",
        "different",
        "form",
        "representation",
        "generates",
        "different",
        "normative",
        "criterion",
        "representative",
        "assessed",
        "four",
        "form",
        "representation",
        "way",
        "democratic",
        "citizen",
        "legitimately",
        "represented",
        "within",
        "democratic",
        "regime",
        "yet",
        "none",
        "latter",
        "three",
        "form",
        "representation",
        "operates",
        "formal",
        "mechanism",
        "authorization",
        "accountability",
        "recently",
        "mansbridge",
        "gone",
        "suggesting",
        "political",
        "science",
        "focused",
        "much",
        "sanction",
        "model",
        "accountability",
        "another",
        "model",
        "call",
        "selection",
        "model",
        "effective",
        "soliciting",
        "desired",
        "behavior",
        "representative",
        "according",
        "mansbridge",
        "sanction",
        "model",
        "accountability",
        "presumes",
        "representative",
        "different",
        "interest",
        "represented",
        "represented",
        "monitor",
        "reward",
        "good",
        "representative",
        "punish",
        "bad",
        "contrast",
        "selection",
        "model",
        "accountability",
        "presumes",
        "representative",
        "selfmotivated",
        "exogenous",
        "reason",
        "carrying",
        "represented",
        "wish",
        "way",
        "mansbridge",
        "broadens",
        "understanding",
        "accountability",
        "allow",
        "good",
        "representation",
        "occur",
        "outside",
        "formal",
        "sanctioning",
        "mechanism",
        "mansbridge",
        "rethinking",
        "meaning",
        "representation",
        "hold",
        "important",
        "insight",
        "contemporary",
        "discussion",
        "democratic",
        "representation",
        "specifying",
        "different",
        "form",
        "representation",
        "within",
        "democratic",
        "polity",
        "mansbridge",
        "teach",
        "u",
        "refer",
        "multiple",
        "form",
        "democratic",
        "representation",
        "democratic",
        "representation",
        "conceived",
        "monolithic",
        "concept",
        "moreover",
        "abundantly",
        "clear",
        "democratic",
        "representation",
        "longer",
        "treated",
        "consisting",
        "simply",
        "relationship",
        "elected",
        "official",
        "constituent",
        "within",
        "voting",
        "district",
        "political",
        "representation",
        "longer",
        "understood",
        "simple",
        "principalagent",
        "relationship",
        "andrew",
        "rehfeld",
        "gone",
        "farther",
        "maintaining",
        "political",
        "representation",
        "longer",
        "territorially",
        "based",
        "word",
        "rehfeld",
        "argues",
        "constituency",
        "eg",
        "electoral",
        "district",
        "constructed",
        "based",
        "citizen",
        "live",
        "lisa",
        "disch",
        "also",
        "complicates",
        "understanding",
        "democratic",
        "representation",
        "principalagent",
        "relationship",
        "uncovering",
        "dilemma",
        "arises",
        "expectation",
        "democratic",
        "responsiveness",
        "constituent",
        "recent",
        "empirical",
        "finding",
        "regarding",
        "context",
        "dependency",
        "individual",
        "constituent",
        "preference",
        "response",
        "dilemma",
        "disch",
        "proposes",
        "mobilization",
        "conception",
        "political",
        "representation",
        "develops",
        "systemic",
        "understanding",
        "reflexivity",
        "measure",
        "legitimacy",
        "far",
        "one",
        "important",
        "shift",
        "literature",
        "representation",
        "constructivist",
        "turn",
        "constructivist",
        "approach",
        "representation",
        "emphasize",
        "representative",
        "role",
        "creating",
        "framing",
        "identity",
        "claim",
        "represented",
        "michael",
        "saward",
        "representative",
        "claim",
        "exemplary",
        "saward",
        "representation",
        "entail",
        "series",
        "relationship",
        "maker",
        "representation",
        "put",
        "forward",
        "subject",
        "stand",
        "object",
        "related",
        "referent",
        "r",
        "offered",
        "audience",
        "instead",
        "presuming",
        "preexisting",
        "set",
        "interest",
        "represented",
        "representative",
        "bring",
        "political",
        "arena",
        "saward",
        "stress",
        "representative",
        "claimmaking",
        "deeply",
        "culturally",
        "inflected",
        "practice",
        "saward",
        "explicitly",
        "denies",
        "theorist",
        "know",
        "interest",
        "represented",
        "reason",
        "represented",
        "ultimate",
        "say",
        "judging",
        "claim",
        "representative",
        "task",
        "representative",
        "create",
        "claim",
        "resonate",
        "appropriate",
        "audience",
        "saward",
        "therefore",
        "evaluate",
        "representative",
        "extent",
        "advance",
        "preference",
        "interest",
        "represented",
        "instead",
        "focus",
        "institutional",
        "collective",
        "condition",
        "claimmaking",
        "take",
        "place",
        "constructivist",
        "turn",
        "examines",
        "condition",
        "claimmaking",
        "activity",
        "particular",
        "representative",
        "saward",
        "constructivist",
        "turn",
        "generated",
        "new",
        "research",
        "direction",
        "political",
        "theorist",
        "empirical",
        "scientist",
        "example",
        "lisa",
        "disch",
        "considers",
        "whether",
        "constructivist",
        "turn",
        "normative",
        "dead",
        "end",
        "whether",
        "epistemological",
        "commitment",
        "constructivism",
        "deny",
        "ability",
        "identify",
        "interest",
        "undermine",
        "normative",
        "commitment",
        "democratic",
        "politics",
        "disch",
        "offer",
        "alternative",
        "approach",
        "call",
        "citizen",
        "standpoint",
        "standpoint",
        "mean",
        "taking",
        "face",
        "value",
        "whomever",
        "whatever",
        "citizen",
        "regard",
        "representing",
        "rather",
        "epistemological",
        "political",
        "achievement",
        "exist",
        "spontaneously",
        "develops",
        "activism",
        "political",
        "movement",
        "together",
        "critical",
        "theory",
        "transformative",
        "empirical",
        "research",
        "give",
        "rise",
        "critical",
        "engagement",
        "saward",
        "work",
        "see",
        "schaap",
        "et",
        "al",
        "nässtrom"
    ]
}