{
    "main_text": "Reasoning and Formal Methods\n6. Reasoning and Formal Methods\n\nPart III begins with a preamble warning the reader not to accord too\nmuch importance to formal rules of reasoning.\n\n\nThe majority of people’s errors, as we have already said\nelsewhere [i.e., on p. 9], depend more on reasoning based on false\nprinciples, than from reasoning incorrectly from their principles. We\nrarely allow ourselves to be misled by arguments that are defective\nmerely because the conclusion is badly drawn. And those who could not\nrecognize a fallacy by the light of reason alone would usually not be\nable to understand the rules behind it, much less to apply them.\n(Logic, 135; also see III.9, 157 and IV.20, 203)\n\n\nHere the authors stress that a good logic is a means for acquiring\nknowledge rather than a tool for organizing it into premises and\nconclusion. The final point is that when ideas are made properly clear\nand distinct, the natural light of reason requires no assistance from\nrules. We had been previously warned that primary utility of formal\nrules consists in the exercise of the natural light that might come\nfrom working through them. The authors continued that evaluation by\npointing out that the chapter titles can guide readers in omitting\nthis relatively unimportant “exercise” if they wish\n(Logic, 10). They thus regard Part IV on method as more\nimportant than Part III on formal reasoning.\n\nThe classification of syllogisms for formal treatment depends on the\nclassification of propositions although the latter is in the service\nof the former. The Logic accordingly classifies simple\ncategorical propositions into four forms: universal affirmatives (All\nS is P), universal negatives (No S is\nP), particular affirmatives (Some S is P)\nand particular negatives (Some S is not P). Simple\ncategorical syllogisms are arguments with a major premise, a minor\npremise, and a conclusion. They contain only three terms. The major\npremise has the “middle” term and the attribute of the\nconclusion (the “major” term), while the minor premise has\nthe middle term and the subject of the conclusion (the\n“minor” term). In Part II, the Logic prepares for\nthis by adopting the theory of categorical propositions, classifying\nthem in terms of quantity as universal, particular, or singular, and\nin terms of quality as affirmative or negative. It takes the\ntraditional stand that singular propositions function logically like\nuniversals, so all simple propositions have one of the following four\nforms:\n\nA:\nAll S is P\nE:\nNo S is P\nI:\nSome S is P\nO:\nSome S is not P\n\n\nAlso following the tradition, the Logic treats the\nquantifiers “all” and “some” as part of the\nsubject, so that “all men” and “some men” are\nlogically significant units. In explaining the rules of conversion for\nsubject and predicate terms, in Part II, chapter 17 they argue that\npredicates are implicitly quantified: when one says “All lions\nare animals”, one does not normally think that all lions are\nall the animals, but only some of the animals. So\n“All S is P” in general means “All\nS is (some) P” (II.17, 130).\n\nConsider, for example this syllogism.\n\n\nEvery good prince is loved by his subjects.\nEvery pious king is a good prince.\nTherefore every pious king is loved by his subjects. (III.2,\n137)\n\n\n\nHere, the term “good prince” is the middle term, because\nit appears in both premises but not in the conclusion. Traditional\nlogic categorizes forms of syllogisms according to their\n“mood” and their “figure”. The mood is the\narrangement of the three propositions in the\n A E I O forms.\n The figure is the arrangement of the major, minor, and middle terms\nin the three propositions.\n\nMost propositions, however, are more complex than this classification\nsuggests, for subjects and predicates need not be simple. In the\nproposition “God who is invisible created the world which is\nvisible”, both the subject and predicate include subordinate\nclauses that appear to contain propositions (II.5–8). Because of\nthe overall subject-predicate structure of all propositions, embedded\npropositions must be located in the subject or predicate. Because\npropositions can be complex, so can syllogisms. That becomes important\nin Part III when rules of inference are discussed, because all\npropositions, including conditionals and disjunctives, are forced into\nstandard categorical forms. The treatment of verbal propositions,\nthen, requires that subjects and predicates have unlimited complexity.\nThere is, therefore, no basic inventory of simple linguistic parts\npermitting a recursive analysis, as in the modern classification of\nvariables, function or predicate symbols, and logical symbols. On the\nclassical view the proposition has a simple organic unity from the\noutside and a reiterable complexity from the inside. This again shows\nthe importance of the authors’ commitment to the priority of\nthought over linguistic expressions of thought. Complexity is to be\nresolved in mental propositions by careful and attentive thinking\ninstead of by perspicuous verbal notation.\n\nWith this treatment of classification in hand, the Logic\nproceeds to examine rules of formal inference. In traditional logic,\nthe rules for syllogism are connected with rules for the conversion of\npropositions which in turn are connected with the distribution of\nterms. A term is distributed if it is “taken\nuniversally” or refers to all the individuals it denotes;\notherwise it is undistributed (Kneale & Kneale 1962 [1984: 272]).\nAs Parsons (2006: 61) puts it, the denotation of a term is its\nextension on its own, whereas its reference is its extension in a\nproposition. Thus the term “prince” denotes (i.e., is\npredicable of) all princes, but in the proposition “Some princes\nare just”, the quantifier “Some” restricts its\nextension in the proposition (its reference) to a subset of its\nextension on its own (denotation). According to the rules for\ndistribution stated by medieval logicians, the subject terms of\nuniversal propositions and the predicates of negative propositions are\ndistributed or taken universally throughout their extension; all other\nterms are undistributed. The Logic subsumes a streamlined\nversion of these rules in chapters 17–20 of Part II, in its\nexplanation of the conversion of propositions, accounting for them in\nterms of the comprehensions and extensions of the terms (II.17,\n130–31).\n\nChapter 3 of Part III gives six rules for valid simple categorical\nsyllogisms. These rules conform to standard medieval logic, but they\nare derived from the Part II rules mentioned above for converting\npropositions. The first two rules for syllogisms govern the\ndistribution of terms.\n\n\nRule 1: The middle term cannot be taken particularly twice,\nbut must be taken universally at least once.\nRule 2: The terms of the conclusion cannot be taken more\nuniversally in the conclusion than in the premises. (III.3,\n139–40)\n\n\n\nThe remaining four rules express the standard views that\n\nat least one premise must be affirmative,\nthe conclusion must be affirmative if both premises are\naffirmative,\nif one premise is negative the conclusion must be negative,\nand\nnothing follows from two particular premises (III.3,\n141–42).\n\n\nChapter 4 begins a series of chapters that develops more specific\nrules for correctly drawing inferences. The three propositions of a\nsyllogism can be in one of the\n four A E I O categories.\n This mathematically yields sixty-four arrangements into syllogisms:\nAAA, AAE, AAI, AAO, AEA, … OOO. Of these, only fifty-four are\ncompatible with the six general rules for syllogisms. When these moods\nare duly arranged into figures, further rules are required to\ndetermine which have true premises and conclusions (III.4). The\nLogic thus emphasizes soundness over\nvalidity—presumably because arguments with false conclusions are\n“useless” in application. Much of the\nLogic’s subsequent importance as a work in formal logic\nis owing to what Kneale and Kneale (1962 [1984: 319]) refer to as the\n“quasi-mathematical” rigor with which these rules are\nderived and stated.\n\nChapter 9 moves on to complex syllogisms. These involve a complex\nconclusion in which the terms “are not always joined in their\nentirety to the middle term in each of the premises, but only to a\npart of one of these terms”. This example is provided in which\nthe attribute of the conclusion is split across the attributes of the\npremises:\n\n\nThe sun is an insensible thing.\nThe Persians worshipped the sun.\nTherefore the Persians worshipped an insensible thing.\n(III.9,158)\n\n\n\nTraditional logic texts (and the first edition of the Logic)\nmethodically discuss how to reduce complex syllogisms to simple ones.\nLater editions of the Logic abbreviate this\n“pedantry” in favor of a general principle for reducing\ncomplex syllogisms, or actually, to evaluate them directly without an\nexplicit reduction. The general principle is that the conclusion\nmust be contained in the premises. The principle is applied by\nmaking a characteristic Cartesian move. One is to come up with a\n“better known” proposition from which the conclusion\nfollows—the “containing” proposition (III.10,163).\nThen one needs another proposition that shows that the conclusion is\nindeed contained in the containing proposition—this is the\n“applicative” proposition. Recall that the comprehension\nof a term contains all the attributes constituting it while the\nextension contains the objects that have those attributes.\n\nThe application of the general principle is not governed by any\nfurther rules; that would defeat its purpose. Instead, in Chapter 11 a\nseries of examples is provided showing the general principle in\naction. Evidently, working through the examples is meant to provide an\nexercise in the direct deployment of their faculty for rationally\n“seeing” which inferences are valid. It is noteworthy that\nthe examples proceed by taking the conclusion, the\n“question”, to be true. The authors are thus more\ninterested in the soundness of useful arguments than they are in the\nmore theoretical notion of validity. For a detailed examination of the\ngeneral principle in action see Pariente (1985) and Wahl (2018).\n\nThe next chapters proceed to consider “conjunctive”\nsyllogisms. Such syllogisms include, for example, a conditional\nproposition in a premise or the conclusion or a disjunction in the\nmajor premise. No new formal rules are introduced to deal with these.\nInstead, the Logic again runs through many examples which are\ntreated by inspection (as we now say) making use of “the natural\nlight of reason” (III.9, 158, see also p. 23). This is\nunderstandable given the scope of the general principle established in\nthe preceding chapters.\n\nChapters 19 and 20 conclude Part III with an extended treatment of\nfallacious reasoning in learned contexts as well as in everyday life.\nSophisms and fallacies are taxonomized, copiously illustrated, and\nattributed to specific flaws of intellectual character in those who\npropagate them. These chapters occupy nearly as many pages as the\nmaterial on formal reasoning. With updated examples, these chapters\ncould compete with textbooks currently in use in college courses on\n“informal logic”.\n",
    "section_title": "6. Reasoning and Formal Methods",
    "entry_title": "Port Royal Logic",
    "hierarchy_title": "Port Royal Logic || Reasoning and Formal Methods",
    "tokenized_text": [
        "reasoning",
        "formal",
        "method",
        "reasoning",
        "formal",
        "method",
        "part",
        "iii",
        "begin",
        "preamble",
        "warning",
        "reader",
        "accord",
        "much",
        "importance",
        "formal",
        "rule",
        "reasoning",
        "majority",
        "people",
        "error",
        "already",
        "said",
        "elsewhere",
        "ie",
        "p",
        "depend",
        "reasoning",
        "based",
        "false",
        "principle",
        "reasoning",
        "incorrectly",
        "principle",
        "rarely",
        "allow",
        "misled",
        "argument",
        "defective",
        "merely",
        "conclusion",
        "badly",
        "drawn",
        "could",
        "recognize",
        "fallacy",
        "light",
        "reason",
        "alone",
        "would",
        "usually",
        "able",
        "understand",
        "rule",
        "behind",
        "much",
        "le",
        "apply",
        "logic",
        "also",
        "see",
        "iii",
        "iv",
        "author",
        "stress",
        "good",
        "logic",
        "mean",
        "acquiring",
        "knowledge",
        "rather",
        "tool",
        "organizing",
        "premise",
        "conclusion",
        "final",
        "point",
        "idea",
        "made",
        "properly",
        "clear",
        "distinct",
        "natural",
        "light",
        "reason",
        "requires",
        "assistance",
        "rule",
        "previously",
        "warned",
        "primary",
        "utility",
        "formal",
        "rule",
        "consists",
        "exercise",
        "natural",
        "light",
        "might",
        "come",
        "working",
        "author",
        "continued",
        "evaluation",
        "pointing",
        "chapter",
        "title",
        "guide",
        "reader",
        "omitting",
        "relatively",
        "unimportant",
        "exercise",
        "wish",
        "logic",
        "thus",
        "regard",
        "part",
        "iv",
        "method",
        "important",
        "part",
        "iii",
        "formal",
        "reasoning",
        "classification",
        "syllogism",
        "formal",
        "treatment",
        "depends",
        "classification",
        "proposition",
        "although",
        "latter",
        "service",
        "former",
        "logic",
        "accordingly",
        "classifies",
        "simple",
        "categorical",
        "proposition",
        "four",
        "form",
        "universal",
        "affirmative",
        "p",
        "universal",
        "negative",
        "p",
        "particular",
        "affirmative",
        "p",
        "particular",
        "negative",
        "p",
        "simple",
        "categorical",
        "syllogism",
        "argument",
        "major",
        "premise",
        "minor",
        "premise",
        "conclusion",
        "contain",
        "three",
        "term",
        "major",
        "premise",
        "middle",
        "term",
        "attribute",
        "conclusion",
        "major",
        "term",
        "minor",
        "premise",
        "middle",
        "term",
        "subject",
        "conclusion",
        "minor",
        "term",
        "part",
        "ii",
        "logic",
        "prepares",
        "adopting",
        "theory",
        "categorical",
        "proposition",
        "classifying",
        "term",
        "quantity",
        "universal",
        "particular",
        "singular",
        "term",
        "quality",
        "affirmative",
        "negative",
        "take",
        "traditional",
        "stand",
        "singular",
        "proposition",
        "function",
        "logically",
        "like",
        "universal",
        "simple",
        "proposition",
        "one",
        "following",
        "four",
        "form",
        "p",
        "e",
        "p",
        "p",
        "p",
        "also",
        "following",
        "tradition",
        "logic",
        "treat",
        "quantifier",
        "part",
        "subject",
        "men",
        "men",
        "logically",
        "significant",
        "unit",
        "explaining",
        "rule",
        "conversion",
        "subject",
        "predicate",
        "term",
        "part",
        "ii",
        "chapter",
        "argue",
        "predicate",
        "implicitly",
        "quantified",
        "one",
        "say",
        "lion",
        "animal",
        "one",
        "normally",
        "think",
        "lion",
        "animal",
        "animal",
        "p",
        "general",
        "mean",
        "p",
        "ii",
        "consider",
        "example",
        "syllogism",
        "every",
        "good",
        "prince",
        "loved",
        "subject",
        "every",
        "pious",
        "king",
        "good",
        "prince",
        "therefore",
        "every",
        "pious",
        "king",
        "loved",
        "subject",
        "iii",
        "term",
        "good",
        "prince",
        "middle",
        "term",
        "appears",
        "premise",
        "conclusion",
        "traditional",
        "logic",
        "categorizes",
        "form",
        "syllogism",
        "according",
        "mood",
        "figure",
        "mood",
        "arrangement",
        "three",
        "proposition",
        "e",
        "form",
        "figure",
        "arrangement",
        "major",
        "minor",
        "middle",
        "term",
        "three",
        "proposition",
        "proposition",
        "however",
        "complex",
        "classification",
        "suggests",
        "subject",
        "predicate",
        "need",
        "simple",
        "proposition",
        "god",
        "invisible",
        "created",
        "world",
        "visible",
        "subject",
        "predicate",
        "include",
        "subordinate",
        "clause",
        "appear",
        "contain",
        "proposition",
        "ii",
        "overall",
        "subjectpredicate",
        "structure",
        "proposition",
        "embedded",
        "proposition",
        "must",
        "located",
        "subject",
        "predicate",
        "proposition",
        "complex",
        "syllogism",
        "becomes",
        "important",
        "part",
        "iii",
        "rule",
        "inference",
        "discussed",
        "proposition",
        "including",
        "conditionals",
        "disjunctives",
        "forced",
        "standard",
        "categorical",
        "form",
        "treatment",
        "verbal",
        "proposition",
        "requires",
        "subject",
        "predicate",
        "unlimited",
        "complexity",
        "therefore",
        "basic",
        "inventory",
        "simple",
        "linguistic",
        "part",
        "permitting",
        "recursive",
        "analysis",
        "modern",
        "classification",
        "variable",
        "function",
        "predicate",
        "symbol",
        "logical",
        "symbol",
        "classical",
        "view",
        "proposition",
        "simple",
        "organic",
        "unity",
        "outside",
        "reiterable",
        "complexity",
        "inside",
        "show",
        "importance",
        "author",
        "commitment",
        "priority",
        "thought",
        "linguistic",
        "expression",
        "thought",
        "complexity",
        "resolved",
        "mental",
        "proposition",
        "careful",
        "attentive",
        "thinking",
        "instead",
        "perspicuous",
        "verbal",
        "notation",
        "treatment",
        "classification",
        "hand",
        "logic",
        "proceeds",
        "examine",
        "rule",
        "formal",
        "inference",
        "traditional",
        "logic",
        "rule",
        "syllogism",
        "connected",
        "rule",
        "conversion",
        "proposition",
        "turn",
        "connected",
        "distribution",
        "term",
        "term",
        "distributed",
        "taken",
        "universally",
        "refers",
        "individual",
        "denotes",
        "otherwise",
        "undistributed",
        "kneale",
        "kneale",
        "parson",
        "put",
        "denotation",
        "term",
        "extension",
        "whereas",
        "reference",
        "extension",
        "proposition",
        "thus",
        "term",
        "prince",
        "denotes",
        "ie",
        "predicable",
        "prince",
        "proposition",
        "prince",
        "quantifier",
        "restricts",
        "extension",
        "proposition",
        "reference",
        "subset",
        "extension",
        "denotation",
        "according",
        "rule",
        "distribution",
        "stated",
        "medieval",
        "logician",
        "subject",
        "term",
        "universal",
        "proposition",
        "predicate",
        "negative",
        "proposition",
        "distributed",
        "taken",
        "universally",
        "throughout",
        "extension",
        "term",
        "undistributed",
        "logic",
        "subsumes",
        "streamlined",
        "version",
        "rule",
        "chapter",
        "part",
        "ii",
        "explanation",
        "conversion",
        "proposition",
        "accounting",
        "term",
        "comprehension",
        "extension",
        "term",
        "ii",
        "chapter",
        "part",
        "iii",
        "give",
        "six",
        "rule",
        "valid",
        "simple",
        "categorical",
        "syllogism",
        "rule",
        "conform",
        "standard",
        "medieval",
        "logic",
        "derived",
        "part",
        "ii",
        "rule",
        "mentioned",
        "converting",
        "proposition",
        "first",
        "two",
        "rule",
        "syllogism",
        "govern",
        "distribution",
        "term",
        "rule",
        "middle",
        "term",
        "taken",
        "particularly",
        "twice",
        "must",
        "taken",
        "universally",
        "least",
        "rule",
        "term",
        "conclusion",
        "taken",
        "universally",
        "conclusion",
        "premise",
        "iii",
        "remaining",
        "four",
        "rule",
        "express",
        "standard",
        "view",
        "least",
        "one",
        "premise",
        "must",
        "affirmative",
        "conclusion",
        "must",
        "affirmative",
        "premise",
        "affirmative",
        "one",
        "premise",
        "negative",
        "conclusion",
        "must",
        "negative",
        "nothing",
        "follows",
        "two",
        "particular",
        "premise",
        "iii",
        "chapter",
        "begin",
        "series",
        "chapter",
        "develops",
        "specific",
        "rule",
        "correctly",
        "drawing",
        "inference",
        "three",
        "proposition",
        "syllogism",
        "one",
        "four",
        "e",
        "category",
        "mathematically",
        "yield",
        "sixtyfour",
        "arrangement",
        "syllogism",
        "aaa",
        "aae",
        "aai",
        "aao",
        "aea",
        "ooo",
        "fiftyfour",
        "compatible",
        "six",
        "general",
        "rule",
        "syllogism",
        "mood",
        "duly",
        "arranged",
        "figure",
        "rule",
        "required",
        "determine",
        "true",
        "premise",
        "conclusion",
        "iii",
        "logic",
        "thus",
        "emphasizes",
        "soundness",
        "validitypresumably",
        "argument",
        "false",
        "conclusion",
        "useless",
        "application",
        "much",
        "logic",
        "subsequent",
        "importance",
        "work",
        "formal",
        "logic",
        "owing",
        "kneale",
        "kneale",
        "refer",
        "quasimathematical",
        "rigor",
        "rule",
        "derived",
        "stated",
        "chapter",
        "move",
        "complex",
        "syllogism",
        "involve",
        "complex",
        "conclusion",
        "term",
        "always",
        "joined",
        "entirety",
        "middle",
        "term",
        "premise",
        "part",
        "one",
        "term",
        "example",
        "provided",
        "attribute",
        "conclusion",
        "split",
        "across",
        "attribute",
        "premise",
        "sun",
        "insensible",
        "thing",
        "persian",
        "worshipped",
        "sun",
        "therefore",
        "persian",
        "worshipped",
        "insensible",
        "thing",
        "iii",
        "traditional",
        "logic",
        "text",
        "first",
        "edition",
        "logic",
        "methodically",
        "discus",
        "reduce",
        "complex",
        "syllogism",
        "simple",
        "one",
        "later",
        "edition",
        "logic",
        "abbreviate",
        "pedantry",
        "favor",
        "general",
        "principle",
        "reducing",
        "complex",
        "syllogism",
        "actually",
        "evaluate",
        "directly",
        "without",
        "explicit",
        "reduction",
        "general",
        "principle",
        "conclusion",
        "must",
        "contained",
        "premise",
        "principle",
        "applied",
        "making",
        "characteristic",
        "cartesian",
        "move",
        "one",
        "come",
        "better",
        "known",
        "proposition",
        "conclusion",
        "followsthe",
        "containing",
        "proposition",
        "iii",
        "one",
        "need",
        "another",
        "proposition",
        "show",
        "conclusion",
        "indeed",
        "contained",
        "containing",
        "propositionthis",
        "applicative",
        "proposition",
        "recall",
        "comprehension",
        "term",
        "contains",
        "attribute",
        "constituting",
        "extension",
        "contains",
        "object",
        "attribute",
        "application",
        "general",
        "principle",
        "governed",
        "rule",
        "would",
        "defeat",
        "purpose",
        "instead",
        "chapter",
        "series",
        "example",
        "provided",
        "showing",
        "general",
        "principle",
        "action",
        "evidently",
        "working",
        "example",
        "meant",
        "provide",
        "exercise",
        "direct",
        "deployment",
        "faculty",
        "rationally",
        "seeing",
        "inference",
        "valid",
        "noteworthy",
        "example",
        "proceed",
        "taking",
        "conclusion",
        "question",
        "true",
        "author",
        "thus",
        "interested",
        "soundness",
        "useful",
        "argument",
        "theoretical",
        "notion",
        "validity",
        "detailed",
        "examination",
        "general",
        "principle",
        "action",
        "see",
        "pariente",
        "wahl",
        "next",
        "chapter",
        "proceed",
        "consider",
        "conjunctive",
        "syllogism",
        "syllogism",
        "include",
        "example",
        "conditional",
        "proposition",
        "premise",
        "conclusion",
        "disjunction",
        "major",
        "premise",
        "new",
        "formal",
        "rule",
        "introduced",
        "deal",
        "instead",
        "logic",
        "run",
        "many",
        "example",
        "treated",
        "inspection",
        "say",
        "making",
        "use",
        "natural",
        "light",
        "reason",
        "iii",
        "see",
        "also",
        "p",
        "understandable",
        "given",
        "scope",
        "general",
        "principle",
        "established",
        "preceding",
        "chapter",
        "chapter",
        "conclude",
        "part",
        "iii",
        "extended",
        "treatment",
        "fallacious",
        "reasoning",
        "learned",
        "context",
        "well",
        "everyday",
        "life",
        "sophism",
        "fallacy",
        "taxonomized",
        "copiously",
        "illustrated",
        "attributed",
        "specific",
        "flaw",
        "intellectual",
        "character",
        "propagate",
        "chapter",
        "occupy",
        "nearly",
        "many",
        "page",
        "material",
        "formal",
        "reasoning",
        "updated",
        "example",
        "chapter",
        "could",
        "compete",
        "textbook",
        "currently",
        "use",
        "college",
        "course",
        "informal",
        "logic"
    ]
}