{
    "main_text": "Productive Difference\n4. Productive Difference\n\nThe concept of difference as a productive mechanism, rather than a\nnegation of identity, is also a hallmark of postmodernism in\nphilosophy.  Gilles Deleuze deploys this concept throughout his work,\nbeginning with Nietzsche and Philosophy (1962, in English\n1983), where he sets Nietzsche against the models of thinking at work\nin Kant and Hegel. Here, he proposes to think against reason\nin resistance to Kant's assertion of the self-justifying authority of\nreason alone (Deleuze 1983 [1962], 93). In a phrase echoed by\nFoucault, he states that the purpose of his critique of reason\n“is not justification but a different way of feeling: another\nsensibility” (Deleuze 1983 [1962], 94). Philosophical critique,\nhe declares, is an encounter between thought and what forces it into\naction: it is a matter of sensibility rather than a tribunal where\nreason judges itself by its own laws (see Kant 1787, 9). Furthermore,\nthe critique of reason is not a method, but is achieved by\n“culture” in the Nietzschean sense: training, discipline,\ninventiveness, and a certain cruelty (see Nietzsche 1887). Since\nthought cannot activate itself as thinking, Deleuze says it\nmust suffer violence if it is to awaken and move. Art, science, and\nphilosophy deploy such violence insofar as they are transformative\nand experimental. \n\nAgainst Hegel, Deleuze asserts that while dialectic is structured by\nnegation and opposition within a posited identity, “difference\nis the only principle of genesis or production” (Deleuze 1983\n[1962], 157). Opposition occurs on the same logical plane, but\ndifference moves across planes and levels, and not only in one\ndirection. Furthermore, where Hegel takes the work of the negative to\nbe dialectic's driving power, Deleuze declares that difference is\nthinkable only as repetition repeating itself (as in Nietzsche's\neternal return), where difference affirms itself in eternally\ndiffering  from itself. Its movement is productive, but\nwithout logical opposition, negation, or necessity. Instead, chance\nand multiplicity are repeated, just as a dice-throw repeats the\nrandomness of the throw along with every number. On the other hand,\ndialectic cancels out chance and affirms the movement of the negative\nas a working out of identity, as in the Science of Logic\nwhere being in its immediacy is posited as equal only to itself\n(Hegel 1812, 82). For Deleuze, however, sensibility introduces an\naleatory moment into thought's development, making accidentality and\ncontingency conditions for thinking. These conditions upset logical\nidentity and opposition, and place the limit of thinking beyond any\ndialectical system.\n\nIn Difference and Repetition (1968, in English 1994),\nDeleuze develops his project in multiple directions. His work, he\nsays, stems from the convergence of two lines of research: the\nconcept of difference without negation, and the concept of\nrepetition, in which physical and mechanical repetitions are masks\nfor a hidden differential that is disguised and displaced. His major\nfocus is a thoroughgoing critique of representational thinking,\nincluding identity, opposition, analogy, and resemblance (Deleuze\n1994 [1968], 132). For Deleuze, “appearances of” are not\nrepresentations, but sensory intensities free of subjective or\nobjective identities (Deleuze 1994 [1968], 144). Without these\nidentities, appearances are simulacra of an non-apparent differential\nhe calls the “dark precursor” or “the in-itself of\ndifference” (Deleuze 1994 [1968], 119). This differential is\nthe non-sensible being of the sensible, a being not\nidentical to the sensible, or to itself, but irreducibly problematic\ninsofar as it forces us to encounter the sensible as\n“given.” \n\nFurthermore, any move against representational thinking impinges upon\nthe identity of the subject. Where Kant founds the representational\nunity of space and time upon the formal unity of consciousness (Kant\n1787, 135-137), difference re-distributes intuitions of past,\npresent, and future, fracturing consciousness into multiple states\nnot predicable of a single subject. Intensive qualities are\nindividuating by themselves, says Deleuze, and individuality is not\ncharacteristic of a self or an ego, but of a differential forever\ndividing itself and changing its configuration (Deleuze 1994 [1968],\n246, 254, 257). In Nietzschean fashion, the “I” refers\nnot to the unity of consciousness, but to a multitude of simulacra\nwithout an identical subject for whom this multitude\nappears. Instead, subjects arise and multiply as\n“effects” of the intensive qualities saturating space and\ntime. This leads Deleuze to postulate multiple faculties for\nsubjectivity, which are correlates of the sensible insofar as it\ngives rise to feeling, thought, and action. “Each faculty,\nincluding thought, has only involuntary adventures,” he says,\nand “involuntary operation remains embedded in the\nempirical” (Deleuze 1994 [1968], 145). Subjectively, the\nparadox of the differential breaks up the faculties' common function\nand places them before their own limits: thought before the\nunthinkable, memory before the immemorial, sensibility before the\nimperceptible, etc. (Deleuze 1994, 227). This fracturing and\nmultiplying of the subject, he notes, leads to the realization that\n“schizophrenia is not only a human fact but also a possibility\nfor thought” (Deleuze 1994 [1968], 148), thus expanding the\nterm into a philosophical concept, beyond its clinical\napplication.\n\nThe dissolution of the subject and its implications for society is\nthe theme of Anti-Oedipus: Capitalism and Schizophrenia,\nwhich Deleuze published with Félix Guattari in 1972 (in\nEnglish 1983). The book, in large part, is written against an\nestablished intellectual orthodoxy of the political Left in France\nduring the 1950s and 1960s, an orthodoxy consisting of Marx, Freud,\nand structuralist concepts applied to them by Louis Althusser and\nJacques Lacan. Deleuze and Guattari argue that this mixture is still\nlimited by representational thinking, including concepts of\nproduction based upon lack, and concepts of alienation based upon\nidentity and negation. Furthermore, the Oedipus concept in\npsychoanalysis, they say, institutes a theater of desire in which the\npsyche is embedded in a family drama closed off from the\nextra-familial and extra-psychic forces at work in society. They\ncharacterize these forces as “desiring machines” whose\nfunction is to connect, disconnect, and reconnect with one another\nwithout meaning or intention. \n\nThe authors portray society as a series of\n“territorializations” or inscriptions upon the\n“body without organs,”or the free-flowing matter of\nintensive qualities filling space in their varying degrees. The first\ninscriptions are relations of kinship and filiation structuring\nprimitive societies, often involving the marking and scarring of\nhuman bodies. As an interruption and encoding of “flows,”\nthe primitive inscriptions constitute a nexus of desiring machines,\nboth technical and social, whose elements are humans and their\norgans. The full body of society is the sacred earth, which\nappropriates to itself all social products as their natural or divine\nprecondition, and to whom all members of society are bound by direct\nfiliation (Deleuze 1983 [1962], 141-42). These first inscriptions are\nthen de-territorialized and re-coded by the “despotic\nmachine,” establishing new relations of alliance and filiation\nthrough the body of the ruler or emperor, who alone stands in direct\nfiliation to the deity (Deleuze 1983 [1962], 192) and who institutes\nthe mechanism of the state upon pre-existing social arrangements.\nFinally, capitalism de-territorializes the inscriptions of the\ndespotic machine and re-codes all relations of alliance and filiation\ninto flows of money (Deleuze 1983 [1962], 224-27). The organs of\nsociety and the state are appropriated into the functioning of\ncapital, and humans become secondary to the filiation of money with\nitself.\n\nDeleuze and Guattari see in the capitalist money system “an\naxiomatic of abstract quantities that keeps moving further and\nfurther in the direction of the deterritorialization of the\nsocius” (Deleuze and Guattari 1983 [1972], 33), which is to say\nthat capital is inherently schizophrenic. However, because capital\nalso re-territorializes all flows into money, schizophrenia remains\ncapitalism's external limit. Nevertheless, it is precisely that limit\nagainst which thinking can subject capitalism to philosophical\ncritique. Psychoanalysis, they say, is part of the reign of capital\nbecause it re-territorializes the subject as “private”\nand “individual,” instituting psychic identity through\nimages of the Oedipal family. However, the Oedipal triangle is merely\na representational simulacrum of kinship and filiation, re-coded\nwithin a system of debt and payment. In this system, they insist,\nflows of desire have become mere representations of desire, cut off\nfrom the body without organs and the extra-familial mechanisms of\nsociety. A radical critique of capital cannot therefore be\naccomplished by psychoanalysis, but requires\na schizoanalysis “to overturn the theater of\nrepresentation into the order of desiring-production” (Deleuze\n1983 [1962], 271). Here, the authors see a revolutionary potential in\nmodern art and science, where, in bringing about the\n“new,” they circulate de-coded and de-territorialized\nflows within society without automatically re-coding them into money\n(Deleuze and Guattari 1983 [1972], 379). In this revolutionary\naspect, Anti-Oedipus reads as a statement of the desire that\ntook to the streets of Paris in May of 1968, and which continues,\neven now, to make itself felt in intellectual life.  \n",
    "section_title": "4. Productive Difference",
    "entry_title": "Postmodernism",
    "hierarchy_title": "Postmodernism || Productive Difference",
    "tokenized_text": [
        "productive",
        "difference",
        "productive",
        "difference",
        "concept",
        "difference",
        "productive",
        "mechanism",
        "rather",
        "negation",
        "identity",
        "also",
        "hallmark",
        "postmodernism",
        "philosophy",
        "gilles",
        "deleuze",
        "deploys",
        "concept",
        "throughout",
        "work",
        "beginning",
        "nietzsche",
        "philosophy",
        "english",
        "set",
        "nietzsche",
        "model",
        "thinking",
        "work",
        "kant",
        "hegel",
        "proposes",
        "think",
        "reason",
        "resistance",
        "kant",
        "s",
        "assertion",
        "selfjustifying",
        "authority",
        "reason",
        "alone",
        "deleuze",
        "phrase",
        "echoed",
        "foucault",
        "state",
        "purpose",
        "critique",
        "reason",
        "justification",
        "different",
        "way",
        "feeling",
        "another",
        "sensibility",
        "deleuze",
        "philosophical",
        "critique",
        "declares",
        "encounter",
        "thought",
        "force",
        "action",
        "matter",
        "sensibility",
        "rather",
        "tribunal",
        "reason",
        "judge",
        "law",
        "see",
        "kant",
        "furthermore",
        "critique",
        "reason",
        "method",
        "achieved",
        "culture",
        "nietzschean",
        "sense",
        "training",
        "discipline",
        "inventiveness",
        "certain",
        "cruelty",
        "see",
        "nietzsche",
        "since",
        "thought",
        "activate",
        "thinking",
        "deleuze",
        "say",
        "must",
        "suffer",
        "violence",
        "awaken",
        "move",
        "art",
        "science",
        "philosophy",
        "deploy",
        "violence",
        "insofar",
        "transformative",
        "experimental",
        "hegel",
        "deleuze",
        "asserts",
        "dialectic",
        "structured",
        "negation",
        "opposition",
        "within",
        "posited",
        "identity",
        "difference",
        "principle",
        "genesis",
        "production",
        "deleuze",
        "opposition",
        "occurs",
        "logical",
        "plane",
        "difference",
        "move",
        "across",
        "plane",
        "level",
        "one",
        "direction",
        "furthermore",
        "hegel",
        "take",
        "work",
        "negative",
        "dialectic",
        "s",
        "driving",
        "power",
        "deleuze",
        "declares",
        "difference",
        "thinkable",
        "repetition",
        "repeating",
        "nietzsche",
        "s",
        "eternal",
        "return",
        "difference",
        "affirms",
        "eternally",
        "differing",
        "movement",
        "productive",
        "without",
        "logical",
        "opposition",
        "negation",
        "necessity",
        "instead",
        "chance",
        "multiplicity",
        "repeated",
        "dicethrow",
        "repeat",
        "randomness",
        "throw",
        "along",
        "every",
        "number",
        "hand",
        "dialectic",
        "cancel",
        "chance",
        "affirms",
        "movement",
        "negative",
        "working",
        "identity",
        "science",
        "logic",
        "immediacy",
        "posited",
        "equal",
        "hegel",
        "deleuze",
        "however",
        "sensibility",
        "introduces",
        "aleatory",
        "moment",
        "thought",
        "s",
        "development",
        "making",
        "accidentality",
        "contingency",
        "condition",
        "thinking",
        "condition",
        "upset",
        "logical",
        "identity",
        "opposition",
        "place",
        "limit",
        "thinking",
        "beyond",
        "dialectical",
        "system",
        "difference",
        "repetition",
        "english",
        "deleuze",
        "develops",
        "project",
        "multiple",
        "direction",
        "work",
        "say",
        "stem",
        "convergence",
        "two",
        "line",
        "research",
        "concept",
        "difference",
        "without",
        "negation",
        "concept",
        "repetition",
        "physical",
        "mechanical",
        "repetition",
        "mask",
        "hidden",
        "differential",
        "disguised",
        "displaced",
        "major",
        "focus",
        "thoroughgoing",
        "critique",
        "representational",
        "thinking",
        "including",
        "identity",
        "opposition",
        "analogy",
        "resemblance",
        "deleuze",
        "deleuze",
        "appearance",
        "representation",
        "sensory",
        "intensity",
        "free",
        "subjective",
        "objective",
        "identity",
        "deleuze",
        "without",
        "identity",
        "appearance",
        "simulacrum",
        "nonapparent",
        "differential",
        "call",
        "dark",
        "precursor",
        "initself",
        "difference",
        "deleuze",
        "differential",
        "nonsensible",
        "sensible",
        "identical",
        "sensible",
        "irreducibly",
        "problematic",
        "insofar",
        "force",
        "u",
        "encounter",
        "sensible",
        "given",
        "furthermore",
        "move",
        "representational",
        "thinking",
        "impinges",
        "upon",
        "identity",
        "subject",
        "kant",
        "found",
        "representational",
        "unity",
        "space",
        "time",
        "upon",
        "formal",
        "unity",
        "consciousness",
        "kant",
        "difference",
        "redistributes",
        "intuition",
        "past",
        "present",
        "future",
        "fracturing",
        "consciousness",
        "multiple",
        "state",
        "predicable",
        "single",
        "subject",
        "intensive",
        "quality",
        "individuating",
        "say",
        "deleuze",
        "individuality",
        "characteristic",
        "self",
        "ego",
        "differential",
        "forever",
        "dividing",
        "changing",
        "configuration",
        "deleuze",
        "nietzschean",
        "fashion",
        "refers",
        "unity",
        "consciousness",
        "multitude",
        "simulacrum",
        "without",
        "identical",
        "subject",
        "multitude",
        "appears",
        "instead",
        "subject",
        "arise",
        "multiply",
        "effect",
        "intensive",
        "quality",
        "saturating",
        "space",
        "time",
        "lead",
        "deleuze",
        "postulate",
        "multiple",
        "faculty",
        "subjectivity",
        "correlate",
        "sensible",
        "insofar",
        "give",
        "rise",
        "feeling",
        "thought",
        "action",
        "faculty",
        "including",
        "thought",
        "involuntary",
        "adventure",
        "say",
        "involuntary",
        "operation",
        "remains",
        "embedded",
        "empirical",
        "deleuze",
        "subjectively",
        "paradox",
        "differential",
        "break",
        "faculty",
        "common",
        "function",
        "place",
        "limit",
        "thought",
        "unthinkable",
        "memory",
        "immemorial",
        "sensibility",
        "imperceptible",
        "etc",
        "deleuze",
        "fracturing",
        "multiplying",
        "subject",
        "note",
        "lead",
        "realization",
        "schizophrenia",
        "human",
        "fact",
        "also",
        "possibility",
        "thought",
        "deleuze",
        "thus",
        "expanding",
        "term",
        "philosophical",
        "concept",
        "beyond",
        "clinical",
        "application",
        "dissolution",
        "subject",
        "implication",
        "society",
        "theme",
        "antioedipus",
        "capitalism",
        "schizophrenia",
        "deleuze",
        "published",
        "félix",
        "guattari",
        "english",
        "book",
        "large",
        "part",
        "written",
        "established",
        "intellectual",
        "orthodoxy",
        "political",
        "left",
        "france",
        "s",
        "s",
        "orthodoxy",
        "consisting",
        "marx",
        "freud",
        "structuralist",
        "concept",
        "applied",
        "louis",
        "althusser",
        "jacques",
        "lacan",
        "deleuze",
        "guattari",
        "argue",
        "mixture",
        "still",
        "limited",
        "representational",
        "thinking",
        "including",
        "concept",
        "production",
        "based",
        "upon",
        "lack",
        "concept",
        "alienation",
        "based",
        "upon",
        "identity",
        "negation",
        "furthermore",
        "oedipus",
        "concept",
        "psychoanalysis",
        "say",
        "institute",
        "theater",
        "desire",
        "psyche",
        "embedded",
        "family",
        "drama",
        "closed",
        "extrafamilial",
        "extrapsychic",
        "force",
        "work",
        "society",
        "characterize",
        "force",
        "desiring",
        "machine",
        "whose",
        "function",
        "connect",
        "disconnect",
        "reconnect",
        "one",
        "another",
        "without",
        "meaning",
        "intention",
        "author",
        "portray",
        "society",
        "series",
        "territorialization",
        "inscription",
        "upon",
        "body",
        "without",
        "organ",
        "freeflowing",
        "matter",
        "intensive",
        "quality",
        "filling",
        "space",
        "varying",
        "degree",
        "first",
        "inscription",
        "relation",
        "kinship",
        "filiation",
        "structuring",
        "primitive",
        "society",
        "often",
        "involving",
        "marking",
        "scarring",
        "human",
        "body",
        "interruption",
        "encoding",
        "flow",
        "primitive",
        "inscription",
        "constitute",
        "nexus",
        "desiring",
        "machine",
        "technical",
        "social",
        "whose",
        "element",
        "human",
        "organ",
        "full",
        "body",
        "society",
        "sacred",
        "earth",
        "appropriates",
        "social",
        "product",
        "natural",
        "divine",
        "precondition",
        "member",
        "society",
        "bound",
        "direct",
        "filiation",
        "deleuze",
        "first",
        "inscription",
        "deterritorialized",
        "recoded",
        "despotic",
        "machine",
        "establishing",
        "new",
        "relation",
        "alliance",
        "filiation",
        "body",
        "ruler",
        "emperor",
        "alone",
        "stand",
        "direct",
        "filiation",
        "deity",
        "deleuze",
        "institute",
        "mechanism",
        "state",
        "upon",
        "preexisting",
        "social",
        "arrangement",
        "finally",
        "capitalism",
        "deterritorializes",
        "inscription",
        "despotic",
        "machine",
        "recodes",
        "relation",
        "alliance",
        "filiation",
        "flow",
        "money",
        "deleuze",
        "organ",
        "society",
        "state",
        "appropriated",
        "functioning",
        "capital",
        "human",
        "become",
        "secondary",
        "filiation",
        "money",
        "deleuze",
        "guattari",
        "see",
        "capitalist",
        "money",
        "system",
        "axiomatic",
        "abstract",
        "quantity",
        "keep",
        "moving",
        "direction",
        "deterritorialization",
        "socius",
        "deleuze",
        "guattari",
        "say",
        "capital",
        "inherently",
        "schizophrenic",
        "however",
        "capital",
        "also",
        "reterritorializes",
        "flow",
        "money",
        "schizophrenia",
        "remains",
        "capitalism",
        "s",
        "external",
        "limit",
        "nevertheless",
        "precisely",
        "limit",
        "thinking",
        "subject",
        "capitalism",
        "philosophical",
        "critique",
        "psychoanalysis",
        "say",
        "part",
        "reign",
        "capital",
        "reterritorializes",
        "subject",
        "private",
        "individual",
        "instituting",
        "psychic",
        "identity",
        "image",
        "oedipal",
        "family",
        "however",
        "oedipal",
        "triangle",
        "merely",
        "representational",
        "simulacrum",
        "kinship",
        "filiation",
        "recoded",
        "within",
        "system",
        "debt",
        "payment",
        "system",
        "insist",
        "flow",
        "desire",
        "become",
        "mere",
        "representation",
        "desire",
        "cut",
        "body",
        "without",
        "organ",
        "extrafamilial",
        "mechanism",
        "society",
        "radical",
        "critique",
        "capital",
        "therefore",
        "accomplished",
        "psychoanalysis",
        "requires",
        "schizoanalysis",
        "overturn",
        "theater",
        "representation",
        "order",
        "desiringproduction",
        "deleuze",
        "author",
        "see",
        "revolutionary",
        "potential",
        "modern",
        "art",
        "science",
        "bringing",
        "new",
        "circulate",
        "decoded",
        "deterritorialized",
        "flow",
        "within",
        "society",
        "without",
        "automatically",
        "recoding",
        "money",
        "deleuze",
        "guattari",
        "revolutionary",
        "aspect",
        "antioedipus",
        "read",
        "statement",
        "desire",
        "took",
        "street",
        "paris",
        "may",
        "continues",
        "even",
        "make",
        "felt",
        "intellectual",
        "life"
    ]
}