{
    "main_text": "The Practice View of Action\n4. The Practice View of Action\n\nIn an early, influential, and Wittgenstein-influenced paper, John\nRawls introduced the notion of a practice as a generalization\nor extension of the notion of a game (Rawls 1955). The important\nfeature of a practice for our purposes is that it introduces statuses\nwhich are internal to it. For instance, in baseball, such statuses\nmight include being a ‘foul’, a ‘strike’, and\nso on; whatever what you’re doing looks like, it can’t be a (baseball)\nfoul if you’re not playing baseball. A practice thereby introduces\nstandards; since something is a ‘home run’ only by virtue\nof the fact that what is being played is baseball, there are\nstandards, given by the rules of baseball, to which a home run has to\nlive up. A practice also introduces reasons which are internal to it;\nthese reasons may be means-end or calculative reasons (as when the\nrules specify the object of the game: in baseball, as Yogi Berra\nfamously put it, to win, by scoring more points than the opposing\nteam), or reasons of other kinds. (In squash, that the other player’s\nhead is between your racquet and the ball is a reason to call a\n‘let’, but not because it is the best way to win; if you\nwere to exercise your option of hitting your opponent in the head, you\nwould win the point. In squash, calculative reasons are modulated by\ngentlemanly reasons.)\n\nTamar Schapiro has extended Rawls’s treatment, developing it into a\ntheory of action (Schapiro 2001; she attributes the view to Kant, but\nagain the historical question will not be taken up). On her view,\n‘actions’ are just moves in the completely generic\npractice; that is, ‘action’ is a status within the generic\npractice in something like the way that ‘move’ is a status\nwithin chess. Schapiro does not name the generic practice, but because\nit will be convenient to have a short way of referring to it, let’s\ncall it ‘Intendo’. Intendo is the game you are playing\nwhenever you do anything at all; ‘agent’ is thus the\ngeneric role in the generic game (the analog of ‘player,’\nin chess or baseball). Practices specify standards and reasons, and so\n‘practical reason’ turns out to be a practice status as\nwell. Intendo consequently determines what forms practical reasons can\ntake, and so patterns of practical inference are to be read off of\nwhat turns out to be the theory of action.\n\nPractical reasons are practical only if they could be brought\nto bear on some decision resulting in action; being an action is a\nstatus (the generic move) within Intendo; so there could be no\npractical reasons coming from outside the practice of Intendo. (Other,\nmore local practices have to accommodate reasons that come from\noutside the practice; for instance, in chess, the object of the game\nis to win, but I may have personal reasons for not playing to win.)\nTherefore, if you can show that Intendo imposes some standard on its\nreasons (for instance, and to anticipate, that they have to be\nuniversalizable), then you will have shown that all reasons have to\nmeet it.\n\nAn important metaethical question about practical reasoning has to do\nwith the modality (roughly, the force) of the family of operators that\nincludes ‘may’, ‘must’, ‘should’,\nand so on, when what is at issue is what you have reason to do. (Call\nthis the ‘modality of freedom’.) Schapiro’s approach\nprovides a surprising answer to this question: the modality of freedom\nis that of the ‘can’ in ‘Can he do\nthat?’ – said of someone who has just run the bases\nbackwards. Freedom of the will ranges over the allowable moves in the\ngame of Intendo.\n\nIn extending Rawls’s view, Schapiro has departed from it in some ways.\nRawls thought that ‘relatively few actions of the moral life are\ndefined by practices’ (op. cit., 32n), and worried about the\nconservatism implicit in taking ‘the social practices of [each\nperson’s] society to provide the standard of justification for his\nactions’ (32). On Schapiro’s view, being an action tout\ncourt is a status in Intendo, and being a reason is a status in\nIntendo. Rawls objected to the ‘summary’ conception of\nrules characteristic of utilitarianism, that it allowed only\n‘one office and so no offices at all’ (28). But in\nIntendo, the sole office or role is that of ‘agent’. Rawls took it\nto be ‘essential to the notion of a practice that the rules are\npublicly known and understood as definitive’ (24). This cannot\nbe true of Intendo; if what reasons for action could be was public\nknowledge, and understood as definitive, there would not be a cottage\nindustry of philosophers arguing about the forms of practical\nreasoning. And finally, the Wittgensteinian roots of Rawls’s treatment\nsuggest that he would have been skeptical of a strategy that turned on\nfinding the deepest common features of all practices. The notion of a\npractice, again, is an extension of the notion of a game, and\nWittgenstein famously pointed out that there is no nontrivial feature\ncommon to all games (see Section 3.4, on language games, in the entry\non\n Ludwig Wittgenstein).\n However, to point out that Schapiro’s position differs from Rawls’s\nis of course not thereby to criticize it; rather, it is to warn\nagainst too quickly assuming her position to inherit all of the\nstructural features of the older and more familiar one.\n\nSchapiro’s article eyes a finish line that is some version of Kantian\nmorality. She writes that ‘if it is right to think of universal\nlaws on the model of practice rules, then the law of freedom can be\nthought of as an indeterminate practice rule, one which simply\nrequires us to make every movement as if it were to count as a move in\nsome possible global practice’ (108); this is a paraphrase, in\nthe vocabulary of this theory, of the Kantian demand that one act only\non maxims of which one could will that they be universal laws. The\npatterns of practical reasoning are to be those acknowledged by\nKantian theory of practical rationality, and the substantive moral\nconsequences, those endorsed by Kantian moral theory.\n\nSchapiro’s position is motivated in the first place by the history of\naction theory. She identifies two older conceptions of action, a\nconsequence-oriented view, on which actions are simply ways of\nproducing effects in a given, natural world, and an expressivist view,\non which actions function more or less as evaluative pronouncements.\nThe practice view of action is meant to capture the truth in each of\nthese, while avoiding their defects; it is, as it were, their Hegelian\nsynthesis. But Schapiro is also motivated by an appreciation of the\nimportance and value to us of a world enriched by practice statuses.\nIt is not just that the predecessor theories are wrong about what an\naction is; it is that forgoing the textured world created by our\npractices would be a terrible mistake. Korsgaard, we saw, developed\nher action-theoretic account of practical rationality\npsychologistically, and one might have jumped to the conclusion that\npsychologism was a deep feature of the Kantian position. However,\nwhile Schapiro’s position is not motivated by\nanti-psychologism, it is nonetheless non-psychologistic. When you\nassess the reasons a practice generates, you can leave the psychology\nof the players out of it. For instance, when the king is in check,\nthen the chess player has a reason to move it out of check; you don’t\nlook inside anyone’s head, as it were, to determine that, but rather,\nat the constitutive rules of chess.\n\nAs before, if the Kantian moral conclusions are to be binding, then\nnot only must the practice conception entail the Kantian conclusions,\nbut the practice conception of action must be shown to be nonoptional.\nThe game of baseball gives its players reasons, but you can always\nchoose not to play in the first place, and you can choose to stop\nplaying; what’s more, the rules of baseball themselves bring baseball\ngames to a close. In either case, the reasons of baseball do not\n– or cease to – apply to you. Intendo must therefore be a\ngame that you cannot walk away from. But why can’t you simply stop\nplaying Intendo, and start producing – not perhaps\n‘actions’, but activity of some other kind – that is\nnot practice-governed? We have already gestured at one answer: the\nimportance of living in a practice-informed world. One further answer\nSchapiro might give is that you can’t do that – where\nthe modality of the ‘can’t’ is the modality of freedom.\n(Since reasons are a practice status, questions having to do with\npractical reason do not arise for the alternative forms of activity.)\n\n\nThe question is especially pressing in view of a further philosophical\nmotivation for Schapiro’s project. Non-ideal theory is concerned with\nguidelines for action and moral thinking in a world that is not very\nmoral at all, and Schapiro 2006 takes up a traditional Kantian test\ncase, that of the murderer at the door. Kantian moral theory prohibits\nlying, and in a world in which there were no murderers, perhaps that\nwould be fine; but here he is, asking if his intended victim, to whom\nyou have just served a cup of tea, is at home. The casuistical\nexercise is that of providing an explanation, consistent with the\nmoral theory, of the legitimacy of lying to him, and Schapiro’s\nsolution draws on the idea that moral reasons, like all reasons for\naction, are statuses in the game of Intendo. If the murderer at the\ndoor is refusing to play the game, then your own moves cannot be\nresponses to his moves in the game. In this case, honesty meant as a\ncontribution to the ‘co-legislation game’ (the game that\nproperly played Intendo turns out to be) is simply not an option. And\nif proper honesty is not an available move, perhaps other moves are\navailable to you.\n\nThe tension is this: On the one hand, you must act out of the moral\nlaw because you cannot opt out of the game of Intendo; that is why\nmorality is binding. On the other hand, however, you may lie to the\nmurderer at the door, because he has opted out of the game of\nIntendo. Schapiro provides a label for what she intends as a way of\nsplitting the difference: the murderer is betraying the\ngeneric practice without opting out of it. But the\ndistinction marked by the label is as yet unexplained. The further\ndevelopment of the practice view will be shaped by the need to\naccommodate these apparently conflicting theoretical constraints.\n",
    "section_title": "4. The Practice View of Action",
    "entry_title": "Practical Reason and the Structure of Actions",
    "hierarchy_title": "Practical Reason and the Structure of Actions || The Practice View of Action",
    "tokenized_text": [
        "practice",
        "view",
        "action",
        "practice",
        "view",
        "action",
        "early",
        "influential",
        "wittgensteininfluenced",
        "paper",
        "john",
        "rawls",
        "introduced",
        "notion",
        "practice",
        "generalization",
        "extension",
        "notion",
        "game",
        "rawls",
        "important",
        "feature",
        "practice",
        "purpose",
        "introduces",
        "status",
        "internal",
        "instance",
        "baseball",
        "status",
        "might",
        "include",
        "foul",
        "strike",
        "whatever",
        "look",
        "like",
        "baseball",
        "foul",
        "playing",
        "baseball",
        "practice",
        "thereby",
        "introduces",
        "standard",
        "since",
        "something",
        "home",
        "run",
        "virtue",
        "fact",
        "played",
        "baseball",
        "standard",
        "given",
        "rule",
        "baseball",
        "home",
        "run",
        "live",
        "practice",
        "also",
        "introduces",
        "reason",
        "internal",
        "reason",
        "may",
        "meansend",
        "calculative",
        "reason",
        "rule",
        "specify",
        "object",
        "game",
        "baseball",
        "yogi",
        "berra",
        "famously",
        "put",
        "win",
        "scoring",
        "point",
        "opposing",
        "team",
        "reason",
        "kind",
        "squash",
        "player",
        "head",
        "racquet",
        "ball",
        "reason",
        "call",
        "let",
        "best",
        "way",
        "win",
        "exercise",
        "option",
        "hitting",
        "opponent",
        "head",
        "would",
        "win",
        "point",
        "squash",
        "calculative",
        "reason",
        "modulated",
        "gentlemanly",
        "reason",
        "tamar",
        "schapiro",
        "extended",
        "rawls",
        "treatment",
        "developing",
        "theory",
        "action",
        "schapiro",
        "attribute",
        "view",
        "kant",
        "historical",
        "question",
        "taken",
        "view",
        "action",
        "move",
        "completely",
        "generic",
        "practice",
        "action",
        "status",
        "within",
        "generic",
        "practice",
        "something",
        "like",
        "way",
        "move",
        "status",
        "within",
        "chess",
        "schapiro",
        "name",
        "generic",
        "practice",
        "convenient",
        "short",
        "way",
        "referring",
        "let",
        "call",
        "intendo",
        "intendo",
        "game",
        "playing",
        "whenever",
        "anything",
        "agent",
        "thus",
        "generic",
        "role",
        "generic",
        "game",
        "analog",
        "player",
        "chess",
        "baseball",
        "practice",
        "specify",
        "standard",
        "reason",
        "practical",
        "reason",
        "turn",
        "practice",
        "status",
        "well",
        "intendo",
        "consequently",
        "determines",
        "form",
        "practical",
        "reason",
        "take",
        "pattern",
        "practical",
        "inference",
        "read",
        "turn",
        "theory",
        "action",
        "practical",
        "reason",
        "practical",
        "could",
        "brought",
        "bear",
        "decision",
        "resulting",
        "action",
        "action",
        "status",
        "generic",
        "move",
        "within",
        "intendo",
        "could",
        "practical",
        "reason",
        "coming",
        "outside",
        "practice",
        "intendo",
        "local",
        "practice",
        "accommodate",
        "reason",
        "come",
        "outside",
        "practice",
        "instance",
        "chess",
        "object",
        "game",
        "win",
        "may",
        "personal",
        "reason",
        "playing",
        "win",
        "therefore",
        "show",
        "intendo",
        "imposes",
        "standard",
        "reason",
        "instance",
        "anticipate",
        "universalizable",
        "shown",
        "reason",
        "meet",
        "important",
        "metaethical",
        "question",
        "practical",
        "reasoning",
        "modality",
        "roughly",
        "force",
        "family",
        "operator",
        "includes",
        "may",
        "must",
        "issue",
        "reason",
        "call",
        "modality",
        "freedom",
        "schapiro",
        "approach",
        "provides",
        "surprising",
        "answer",
        "question",
        "modality",
        "freedom",
        "said",
        "someone",
        "run",
        "base",
        "backwards",
        "freedom",
        "range",
        "allowable",
        "move",
        "game",
        "intendo",
        "extending",
        "rawls",
        "view",
        "schapiro",
        "departed",
        "way",
        "rawls",
        "thought",
        "relatively",
        "action",
        "moral",
        "life",
        "defined",
        "practice",
        "op",
        "cit",
        "n",
        "worried",
        "conservatism",
        "implicit",
        "taking",
        "social",
        "practice",
        "person",
        "society",
        "provide",
        "standard",
        "justification",
        "action",
        "schapiro",
        "view",
        "action",
        "tout",
        "court",
        "status",
        "intendo",
        "reason",
        "status",
        "intendo",
        "rawls",
        "objected",
        "summary",
        "conception",
        "rule",
        "characteristic",
        "utilitarianism",
        "allowed",
        "one",
        "office",
        "office",
        "intendo",
        "sole",
        "office",
        "role",
        "agent",
        "rawls",
        "took",
        "essential",
        "notion",
        "practice",
        "rule",
        "publicly",
        "known",
        "understood",
        "definitive",
        "true",
        "intendo",
        "reason",
        "action",
        "could",
        "public",
        "knowledge",
        "understood",
        "definitive",
        "would",
        "cottage",
        "industry",
        "philosopher",
        "arguing",
        "form",
        "practical",
        "reasoning",
        "finally",
        "wittgensteinian",
        "root",
        "rawls",
        "treatment",
        "suggest",
        "would",
        "skeptical",
        "strategy",
        "turned",
        "finding",
        "deepest",
        "common",
        "feature",
        "practice",
        "notion",
        "practice",
        "extension",
        "notion",
        "game",
        "wittgenstein",
        "famously",
        "pointed",
        "nontrivial",
        "feature",
        "common",
        "game",
        "see",
        "section",
        "language",
        "game",
        "entry",
        "ludwig",
        "wittgenstein",
        "however",
        "point",
        "schapiro",
        "position",
        "differs",
        "rawls",
        "course",
        "thereby",
        "criticize",
        "rather",
        "warn",
        "quickly",
        "assuming",
        "position",
        "inherit",
        "structural",
        "feature",
        "older",
        "familiar",
        "one",
        "schapiro",
        "article",
        "eye",
        "finish",
        "line",
        "version",
        "kantian",
        "morality",
        "writes",
        "right",
        "think",
        "universal",
        "law",
        "model",
        "practice",
        "rule",
        "law",
        "freedom",
        "thought",
        "indeterminate",
        "practice",
        "rule",
        "one",
        "simply",
        "requires",
        "u",
        "make",
        "every",
        "movement",
        "count",
        "move",
        "possible",
        "global",
        "practice",
        "paraphrase",
        "vocabulary",
        "theory",
        "kantian",
        "demand",
        "one",
        "act",
        "maxim",
        "one",
        "could",
        "universal",
        "law",
        "pattern",
        "practical",
        "reasoning",
        "acknowledged",
        "kantian",
        "theory",
        "practical",
        "rationality",
        "substantive",
        "moral",
        "consequence",
        "endorsed",
        "kantian",
        "moral",
        "theory",
        "schapiro",
        "position",
        "motivated",
        "first",
        "place",
        "history",
        "action",
        "theory",
        "identifies",
        "two",
        "older",
        "conception",
        "action",
        "consequenceoriented",
        "view",
        "action",
        "simply",
        "way",
        "producing",
        "effect",
        "given",
        "natural",
        "world",
        "expressivist",
        "view",
        "action",
        "function",
        "le",
        "evaluative",
        "pronouncement",
        "practice",
        "view",
        "action",
        "meant",
        "capture",
        "truth",
        "avoiding",
        "defect",
        "hegelian",
        "synthesis",
        "schapiro",
        "also",
        "motivated",
        "appreciation",
        "importance",
        "value",
        "u",
        "world",
        "enriched",
        "practice",
        "status",
        "predecessor",
        "theory",
        "wrong",
        "action",
        "forgoing",
        "textured",
        "world",
        "created",
        "practice",
        "would",
        "terrible",
        "mistake",
        "korsgaard",
        "saw",
        "developed",
        "actiontheoretic",
        "account",
        "practical",
        "rationality",
        "psychologistically",
        "one",
        "might",
        "jumped",
        "conclusion",
        "psychologism",
        "deep",
        "feature",
        "kantian",
        "position",
        "however",
        "schapiro",
        "position",
        "motivated",
        "antipsychologism",
        "nonetheless",
        "nonpsychologistic",
        "ass",
        "reason",
        "practice",
        "generates",
        "leave",
        "psychology",
        "player",
        "instance",
        "king",
        "check",
        "chess",
        "player",
        "reason",
        "move",
        "check",
        "look",
        "inside",
        "anyone",
        "head",
        "determine",
        "rather",
        "constitutive",
        "rule",
        "chess",
        "kantian",
        "moral",
        "conclusion",
        "binding",
        "must",
        "practice",
        "conception",
        "entail",
        "kantian",
        "conclusion",
        "practice",
        "conception",
        "action",
        "must",
        "shown",
        "nonoptional",
        "game",
        "baseball",
        "give",
        "player",
        "reason",
        "always",
        "choose",
        "play",
        "first",
        "place",
        "choose",
        "stop",
        "playing",
        "rule",
        "baseball",
        "bring",
        "baseball",
        "game",
        "close",
        "either",
        "case",
        "reason",
        "baseball",
        "cease",
        "apply",
        "intendo",
        "must",
        "therefore",
        "game",
        "walk",
        "away",
        "simply",
        "stop",
        "playing",
        "intendo",
        "start",
        "producing",
        "perhaps",
        "action",
        "activity",
        "kind",
        "practicegoverned",
        "already",
        "gestured",
        "one",
        "answer",
        "importance",
        "living",
        "practiceinformed",
        "world",
        "one",
        "answer",
        "schapiro",
        "might",
        "give",
        "modality",
        "modality",
        "freedom",
        "since",
        "reason",
        "practice",
        "status",
        "question",
        "practical",
        "reason",
        "arise",
        "alternative",
        "form",
        "activity",
        "question",
        "especially",
        "pressing",
        "view",
        "philosophical",
        "motivation",
        "schapiro",
        "project",
        "nonideal",
        "theory",
        "concerned",
        "guideline",
        "action",
        "moral",
        "thinking",
        "world",
        "moral",
        "schapiro",
        "take",
        "traditional",
        "kantian",
        "test",
        "case",
        "murderer",
        "door",
        "kantian",
        "moral",
        "theory",
        "prohibits",
        "lying",
        "world",
        "murderer",
        "perhaps",
        "would",
        "fine",
        "asking",
        "intended",
        "victim",
        "served",
        "cup",
        "tea",
        "home",
        "casuistical",
        "exercise",
        "providing",
        "explanation",
        "consistent",
        "moral",
        "theory",
        "legitimacy",
        "lying",
        "schapiro",
        "solution",
        "draw",
        "idea",
        "moral",
        "reason",
        "like",
        "reason",
        "action",
        "status",
        "game",
        "intendo",
        "murderer",
        "door",
        "refusing",
        "play",
        "game",
        "move",
        "response",
        "move",
        "game",
        "case",
        "honesty",
        "meant",
        "contribution",
        "colegislation",
        "game",
        "game",
        "properly",
        "played",
        "intendo",
        "turn",
        "simply",
        "option",
        "proper",
        "honesty",
        "available",
        "move",
        "perhaps",
        "move",
        "available",
        "tension",
        "one",
        "hand",
        "must",
        "act",
        "moral",
        "law",
        "opt",
        "game",
        "intendo",
        "morality",
        "binding",
        "hand",
        "however",
        "may",
        "lie",
        "murderer",
        "door",
        "opted",
        "game",
        "intendo",
        "schapiro",
        "provides",
        "label",
        "intends",
        "way",
        "splitting",
        "difference",
        "murderer",
        "betraying",
        "generic",
        "practice",
        "without",
        "opting",
        "distinction",
        "marked",
        "label",
        "yet",
        "unexplained",
        "development",
        "practice",
        "view",
        "shaped",
        "need",
        "accommodate",
        "apparently",
        "conflicting",
        "theoretical",
        "constraint"
    ]
}