{
    "main_text": "The Ethics of Belief\n7. The Ethics of Belief\n\nClifford’s Rule is a vivid presentation of an influential and\nlong tradition in philosophy that carries the name of Evidentialism.\nWe can understand Evidentialism as the thesis that:\n\nE.\nFor all persons S and propositions p and times\nt, S ought to believe that p at t\nif and only if believing p fits S’s evidence\nat t.\n\n\nClearly enough, pragmatic arguments run afoul of (E), since pragmatic\narguments are employed either when the evidence is inconclusive, or it\nis conclusively adverse. Consider the latter case first. Earlier it\nwas mentioned that Pascal’s Wager is the most famous example of\na theistic pragmatic argument. Pascal in fact has not one version of\nthe Wager in his Pensées (1660) but four. The third\nversion of the Wager is what Ian Hacking (1972) entitles the\n“Argument from Dominating Expectation,” and it employs the\nExpectation rule. We can represent it by letting p stand for\na positive probability greater than zero and less than one-half, and\nletting EU stand for “expected utility,” and employing\nF2–F4 as finite values:\n\n\n\n\nGod exists\n\n   (p)\n~(God exists)\n\n  (1−p)\n \n\nBelieve\np, ∞\n1 − p, F2\nEU = ∞ \n\n~(Believe)\np, F3\n1 − p, F4\nEU = finite value  \n\n\nNo matter how unlikely it is that God exists, as long as there is some\npositive non-zero probability that he does, believing is one’s\nbest bet:\n\nFor any person S, and alternatives α and β\navailable to S, if the expected utility of α exceeds\nthat of β, S should choose α. And,\nBelieving in God carries more expected utility than does not\nbelieving. Therefore,\nOne should believe in God.\n\n\nBecause of its ingenious employment of infinite utility, the third\nversion has become what most philosophers think of as Pascal’s\nWager. The appeal of the third version for theistic apologists is its\nready employment as a worst-case device. Suppose there were a strong\nimprobability argument for atheism. With the third version the theist\nhas an escape: it can still be rational to believe, even if the belief\nis itself unreasonable, since inculcating theistic belief is an action\nwith an infinite expected utility. This use as a worst-case device is\nsomething like a trump card that can be thrown down defeating what had\nappeared as a stronger hand. Pascal’s third version clearly\nviolates (E).\n\nNow consider James’s Will to Believe argument. As we saw,\nJames’s contention is that any hypothesis that’s part of a\ngenuine option, and that’s intellectually open, may be believed,\neven in the absence of sufficient evidence. No rule of morality or\nrationality, James argues, is violated if one accepts a hypothesis\nthat’s genuine and open. If James is correct, then (E) should be\nreplaced with:\n\nE′.\nFor all persons S and propositions p and\ntimes t, if believing p fits S’s\nevidence at t, then S ought to believe that\np at t.\n\n\nAccording to (E′) if the evidence is adequate, then the question\nis settled. If there’s a preponderance of support for\np, then one is required to believe p. Where the\nevidence speaks, one must listen and obey. (E′) differs from (E)\nin part since it says nothing about those occasions in which the\nevidence is silent, or is inadequate. If one assigns p a\nprobability of one-half, then there’s not a preponderance of\nevidence in support of p. (E′) says nothing about\nbelieving p in that case. Principle (E), on the other hand,\nforbids believing p in that case. While a proponent of\ntheistic pragmatic arguments cannot swear allegiance to (E), she can,\nclearly enough, adhere to (E′). Let’s call (E) Strong\nEvidentialism, and (E′) Weak Evidentialism. So, an employer of\ntheistic pragmatic arguments can conform to Weak Evidentialism, but\nnot Strong Evidentialism.\n\nIs there a good reason to prefer Weak Evidentialism to Strong (in\naddition to James’s argument)? A promising argument in support\nof the moral and rational permissibility of employing pragmatic\nreasons in belief-formation is erected upon the base of what we might\ncall the Duty Argument (or perhaps more precisely, the Duty\nArgument scheme):\n\nIt is necessary that (no one is (overall) irrational in doing what\nhe’s morally obligated to do). And,\nIt is possible that (doing α is a moral obligation).\nSo,\nIt is possible that (doing α is (overall) rational).\n\n\nThe Duty Argument employs the box and diamond in the standard fashion\nas operators for, respectively, conceptual necessity and possibility.\nThe alpha is just a placeholder for actions, or kinds of actions. The\nlocution “(overall) rational” or “(overall)\nirrational” presupposes that there are various kinds of\nrationality, including moral rationality, epistemic rationality, and\nprudential\n rationality.[10]\n The idea that there are various kinds of rationality, or put any way,\nthat one can be under conflicting obligations at a particular time,\nrecognizes that dilemmas are possible. One can be obligated to do\nvarious things even when it’s not possible to do all of them.\nOverall rationality is the all-things-considered perspective. It is\nwhat one ultimately should do, having taken into account the various\nobligations one is under at a particular time. Overall rationality, or\nall-things-considered rationality (ATC rationality), is, in W.D.\nRoss’s terms, one’s actual duty in the particular\ncircumstances, even if one has other conflicting prima facie\nduties. The Duty Argument can be formulated without presupposing that\nthere are various kinds of rationality, by replacing the principle\nthat no one is ever irrational in doing her moral duty, with\nthe principle that moral obligations take precedence whenever a\ndilemma of obligations occurs. In any case the Duty Argument\nassumes that if in doing something one is not ATC irrational, then it\nfollows that one is ATC rational in doing it.\n\nThe relevance of the Duty Argument is this. The action of forming and\nsustaining a belief upon pragmatic grounds can replace α. That\nis, pragmatic belief formation could be one’s moral duty.\nConsider the following four cases in which pragmatic belief formation\nis, arguably, morally required:\n\n\nDevious ETs: Suppose you are abducted by very powerful and\nadvanced extraterrestrials, who demonstrate their intent and power to\ndestroy the Earth. Moreover, these fiendish ETs offer but one chance\nof salvation for humankind – you acquire and maintain a belief\nfor which you lack adequate evidence. You adroitly point out that you\ncannot just will such a belief, especially since you know of no good\nreason to think it true. Devilish in their anticipation and in their\ntechnology, the ETs produce a device that can directly produce the\nrequisite belief in willing subjects, a serum, say, or a supply of\none-a-day doxastic-producing pills. It is clear that you would do no\nwrong by swallowing a pill or injecting the serum, and, hence,\nbringing about and maintaining belief in a proposition for which you\nlack adequate evidence, done to save humankind. Indeed, it is clear\nthat you are in fact obligated to bring about the requisite belief,\neven though you lack adequate evidence for it.\n\nPain case: Jones knows that expecting an event to be painful is\nstrongly correlated with an increase in the intensity of felt pain (as\nopposed to having no expectation, or expecting the event to be\nrelatively painless). Jones is about to have a boil lanced, and\nbelieving that she is obligated to minimize pain, she forms the belief\nthat the procedure will be painless. She does so even though she lacks\nevidence that such procedures are in fact typically painless. Because\nof her action, the event is in fact less painful than it would\notherwise have been.\n\nSmall child: Suppose you are the parent or custodian of a small\nchild, who has been hurt. You know that studies support the thesis\nthat the felt pain reported by patients is typically higher in cases\nin which the patient expected the event to be painful than in cases\nwhere the patient did not have that expectation. You have no idea\nabout the relative pain associated with a particular medical procedure\nthat the child is about undergo. The child asks you if the procedure\nwill be painful. Desiring to lower the pain the child will feel, you\ntell the child that the procedure will not hurt, hoping that the child\nwill form a belief not supported by the evidence, but thereby lowering\nthe child’s felt pain.\n\nDoctor case: Dr. Jones knows that the prognosis for\nSmith’s recovery is poor, but if she acts on that knowledge by\ntelling Smith of his poor prognosis, she may well strip Smith of hope.\nJones believes that maintaining hope is vital for quality of life.\nOverall, Jones decides it is better not to inform Smith just how poor\nthe prognosis is and she does not disabuse Smith of her evidentially\nunsupported belief.\n\n\nThese four cases provide possible scenarios in which pragmatic belief\nformation, or suborning pragmatic belief formation in others, is\nmorally required.\n\nAlthough controversial, the Duty Argument, if sound, would provide\ngood reason for thinking that there are occasions in which it is\npermissible, both rationally and morally, to form beliefs based upon\npragmatic reasons even in the absence of adequate evidence. If the\nDuty Argument is sound, then (E) is false.\n\nThe Duty Argument presupposes that there are various kinds of\nrationality. Many Evidentialists, as well as many opponents of\nEvidentialism, also assume that there are various kinds of\nrationality. What if however there is only one kind or standard of\nrationality? What impact would that have on the debate? Susanna Rinard\nargues that it is best to reject the idea that there are various kinds\nor standards of rationality, and replace that idea with an equal\ntreatment idea that all states – whether doxastic or not –\nface a single standard of rationality (Rinard 2017). Equal treatment\nof states – states like carrying an umbrella, or walking the\ndog, or voting for this candidate over that, or forming a belief in\nGod – provides greater theoretical simplicity than does the idea\nthat there are various standards or kinds of rationality. Equal\nTreatment also better explains the methodological attraction of\nsimplicity in science than does the idea that there are various kinds\nof rationality, Rinard argues. If the equal treatment of all states\nidea is correct, then doxastic states would face the same standard of\nrationality as states of action. The Equal Treatment idea provides an\nadditional objection to Evidentialism insofar as Evidentialism implies\nthat beliefs are subject to one standard, while other states are\nsubject to another standard.\n\nWhether it is via Rinard’s Equal Treatment argument, or the Duty\nArgument, there is, arguably, good reason to reject Evidentialism.\n",
    "section_title": "7. The Ethics of Belief",
    "entry_title": "Pragmatic Arguments and Belief in God",
    "hierarchy_title": "Pragmatic Arguments and Belief in God || The Ethics of Belief",
    "tokenized_text": [
        "ethic",
        "belief",
        "ethic",
        "belief",
        "clifford",
        "rule",
        "vivid",
        "presentation",
        "influential",
        "long",
        "tradition",
        "philosophy",
        "carry",
        "name",
        "evidentialism",
        "understand",
        "evidentialism",
        "thesis",
        "e",
        "person",
        "proposition",
        "p",
        "time",
        "ought",
        "believe",
        "p",
        "believing",
        "p",
        "fit",
        "evidence",
        "t",
        "clearly",
        "enough",
        "pragmatic",
        "argument",
        "run",
        "afoul",
        "e",
        "since",
        "pragmatic",
        "argument",
        "employed",
        "either",
        "evidence",
        "inconclusive",
        "conclusively",
        "adverse",
        "consider",
        "latter",
        "case",
        "first",
        "earlier",
        "mentioned",
        "pascal",
        "wager",
        "famous",
        "example",
        "theistic",
        "pragmatic",
        "argument",
        "pascal",
        "fact",
        "one",
        "version",
        "wager",
        "pensées",
        "four",
        "third",
        "version",
        "wager",
        "ian",
        "hacking",
        "entitles",
        "argument",
        "dominating",
        "expectation",
        "employ",
        "expectation",
        "rule",
        "represent",
        "letting",
        "p",
        "stand",
        "positive",
        "probability",
        "greater",
        "zero",
        "le",
        "onehalf",
        "letting",
        "eu",
        "stand",
        "expected",
        "utility",
        "employing",
        "ff",
        "finite",
        "value",
        "god",
        "exists",
        "p",
        "god",
        "exists",
        "p",
        "believe",
        "p",
        "p",
        "f",
        "eu",
        "believe",
        "p",
        "f",
        "p",
        "f",
        "eu",
        "finite",
        "value",
        "matter",
        "unlikely",
        "god",
        "exists",
        "long",
        "positive",
        "nonzero",
        "probability",
        "believing",
        "one",
        "best",
        "bet",
        "person",
        "alternative",
        "α",
        "β",
        "available",
        "expected",
        "utility",
        "α",
        "exceeds",
        "β",
        "choose",
        "α",
        "believing",
        "god",
        "carry",
        "expected",
        "utility",
        "believing",
        "therefore",
        "one",
        "believe",
        "god",
        "ingenious",
        "employment",
        "infinite",
        "utility",
        "third",
        "version",
        "become",
        "philosopher",
        "think",
        "pascal",
        "wager",
        "appeal",
        "third",
        "version",
        "theistic",
        "apologist",
        "ready",
        "employment",
        "worstcase",
        "device",
        "suppose",
        "strong",
        "improbability",
        "argument",
        "atheism",
        "third",
        "version",
        "theist",
        "escape",
        "still",
        "rational",
        "believe",
        "even",
        "belief",
        "unreasonable",
        "since",
        "inculcating",
        "theistic",
        "belief",
        "action",
        "infinite",
        "expected",
        "utility",
        "use",
        "worstcase",
        "device",
        "something",
        "like",
        "trump",
        "card",
        "thrown",
        "defeating",
        "appeared",
        "stronger",
        "hand",
        "pascal",
        "third",
        "version",
        "clearly",
        "violates",
        "e",
        "consider",
        "james",
        "believe",
        "argument",
        "saw",
        "james",
        "contention",
        "hypothesis",
        "part",
        "genuine",
        "option",
        "intellectually",
        "open",
        "may",
        "believed",
        "even",
        "absence",
        "sufficient",
        "evidence",
        "rule",
        "morality",
        "rationality",
        "james",
        "argues",
        "violated",
        "one",
        "accepts",
        "hypothesis",
        "genuine",
        "open",
        "james",
        "correct",
        "e",
        "replaced",
        "e",
        "person",
        "proposition",
        "p",
        "time",
        "believing",
        "p",
        "fit",
        "evidence",
        "ought",
        "believe",
        "p",
        "t",
        "according",
        "e",
        "evidence",
        "adequate",
        "question",
        "settled",
        "preponderance",
        "support",
        "p",
        "one",
        "required",
        "believe",
        "p",
        "evidence",
        "speaks",
        "one",
        "must",
        "listen",
        "obey",
        "e",
        "differs",
        "e",
        "part",
        "since",
        "say",
        "nothing",
        "occasion",
        "evidence",
        "silent",
        "inadequate",
        "one",
        "assigns",
        "p",
        "probability",
        "onehalf",
        "preponderance",
        "evidence",
        "support",
        "p",
        "e",
        "say",
        "nothing",
        "believing",
        "p",
        "case",
        "principle",
        "e",
        "hand",
        "forbids",
        "believing",
        "p",
        "case",
        "proponent",
        "theistic",
        "pragmatic",
        "argument",
        "swear",
        "allegiance",
        "e",
        "clearly",
        "enough",
        "adhere",
        "e",
        "let",
        "call",
        "e",
        "strong",
        "evidentialism",
        "e",
        "weak",
        "evidentialism",
        "employer",
        "theistic",
        "pragmatic",
        "argument",
        "conform",
        "weak",
        "evidentialism",
        "strong",
        "evidentialism",
        "good",
        "reason",
        "prefer",
        "weak",
        "evidentialism",
        "strong",
        "addition",
        "james",
        "argument",
        "promising",
        "argument",
        "support",
        "moral",
        "rational",
        "permissibility",
        "employing",
        "pragmatic",
        "reason",
        "beliefformation",
        "erected",
        "upon",
        "base",
        "might",
        "call",
        "duty",
        "argument",
        "perhaps",
        "precisely",
        "duty",
        "argument",
        "scheme",
        "necessary",
        "one",
        "overall",
        "irrational",
        "morally",
        "obligated",
        "possible",
        "α",
        "moral",
        "obligation",
        "possible",
        "α",
        "overall",
        "rational",
        "duty",
        "argument",
        "employ",
        "box",
        "diamond",
        "standard",
        "fashion",
        "operator",
        "respectively",
        "conceptual",
        "necessity",
        "possibility",
        "alpha",
        "placeholder",
        "action",
        "kind",
        "action",
        "locution",
        "overall",
        "rational",
        "overall",
        "irrational",
        "presupposes",
        "various",
        "kind",
        "rationality",
        "including",
        "moral",
        "rationality",
        "epistemic",
        "rationality",
        "prudential",
        "rationality",
        "idea",
        "various",
        "kind",
        "rationality",
        "put",
        "way",
        "one",
        "conflicting",
        "obligation",
        "particular",
        "time",
        "recognizes",
        "dilemma",
        "possible",
        "one",
        "obligated",
        "various",
        "thing",
        "even",
        "possible",
        "overall",
        "rationality",
        "allthingsconsidered",
        "perspective",
        "one",
        "ultimately",
        "taken",
        "account",
        "various",
        "obligation",
        "one",
        "particular",
        "time",
        "overall",
        "rationality",
        "allthingsconsidered",
        "rationality",
        "atc",
        "rationality",
        "wd",
        "ross",
        "term",
        "one",
        "actual",
        "duty",
        "particular",
        "circumstance",
        "even",
        "one",
        "conflicting",
        "prima",
        "facie",
        "duty",
        "duty",
        "argument",
        "formulated",
        "without",
        "presupposing",
        "various",
        "kind",
        "rationality",
        "replacing",
        "principle",
        "one",
        "ever",
        "irrational",
        "moral",
        "duty",
        "principle",
        "moral",
        "obligation",
        "take",
        "precedence",
        "whenever",
        "dilemma",
        "obligation",
        "occurs",
        "case",
        "duty",
        "argument",
        "assumes",
        "something",
        "one",
        "atc",
        "irrational",
        "follows",
        "one",
        "atc",
        "rational",
        "relevance",
        "duty",
        "argument",
        "action",
        "forming",
        "sustaining",
        "belief",
        "upon",
        "pragmatic",
        "ground",
        "replace",
        "α",
        "pragmatic",
        "belief",
        "formation",
        "could",
        "one",
        "moral",
        "duty",
        "consider",
        "following",
        "four",
        "case",
        "pragmatic",
        "belief",
        "formation",
        "arguably",
        "morally",
        "required",
        "devious",
        "ets",
        "suppose",
        "abducted",
        "powerful",
        "advanced",
        "extraterrestrial",
        "demonstrate",
        "intent",
        "power",
        "destroy",
        "earth",
        "moreover",
        "fiendish",
        "ets",
        "offer",
        "one",
        "chance",
        "salvation",
        "humankind",
        "acquire",
        "maintain",
        "belief",
        "lack",
        "adequate",
        "evidence",
        "adroitly",
        "point",
        "belief",
        "especially",
        "since",
        "know",
        "good",
        "reason",
        "think",
        "true",
        "devilish",
        "anticipation",
        "technology",
        "ets",
        "produce",
        "device",
        "directly",
        "produce",
        "requisite",
        "belief",
        "willing",
        "subject",
        "serum",
        "say",
        "supply",
        "oneaday",
        "doxasticproducing",
        "pill",
        "clear",
        "would",
        "wrong",
        "swallowing",
        "pill",
        "injecting",
        "serum",
        "hence",
        "bringing",
        "maintaining",
        "belief",
        "proposition",
        "lack",
        "adequate",
        "evidence",
        "done",
        "save",
        "humankind",
        "indeed",
        "clear",
        "fact",
        "obligated",
        "bring",
        "requisite",
        "belief",
        "even",
        "though",
        "lack",
        "adequate",
        "evidence",
        "pain",
        "case",
        "jones",
        "know",
        "expecting",
        "event",
        "painful",
        "strongly",
        "correlated",
        "increase",
        "intensity",
        "felt",
        "pain",
        "opposed",
        "expectation",
        "expecting",
        "event",
        "relatively",
        "painless",
        "jones",
        "boil",
        "lanced",
        "believing",
        "obligated",
        "minimize",
        "pain",
        "form",
        "belief",
        "procedure",
        "painless",
        "even",
        "though",
        "lack",
        "evidence",
        "procedure",
        "fact",
        "typically",
        "painless",
        "action",
        "event",
        "fact",
        "le",
        "painful",
        "would",
        "otherwise",
        "small",
        "child",
        "suppose",
        "parent",
        "custodian",
        "small",
        "child",
        "hurt",
        "know",
        "study",
        "support",
        "thesis",
        "felt",
        "pain",
        "reported",
        "patient",
        "typically",
        "higher",
        "case",
        "patient",
        "expected",
        "event",
        "painful",
        "case",
        "patient",
        "expectation",
        "idea",
        "relative",
        "pain",
        "associated",
        "particular",
        "medical",
        "procedure",
        "child",
        "undergo",
        "child",
        "asks",
        "procedure",
        "painful",
        "desiring",
        "lower",
        "pain",
        "child",
        "feel",
        "tell",
        "child",
        "procedure",
        "hurt",
        "hoping",
        "child",
        "form",
        "belief",
        "supported",
        "evidence",
        "thereby",
        "lowering",
        "child",
        "felt",
        "pain",
        "doctor",
        "case",
        "dr",
        "jones",
        "know",
        "prognosis",
        "smith",
        "recovery",
        "poor",
        "act",
        "knowledge",
        "telling",
        "smith",
        "poor",
        "prognosis",
        "may",
        "well",
        "strip",
        "smith",
        "hope",
        "jones",
        "belief",
        "maintaining",
        "hope",
        "vital",
        "quality",
        "life",
        "overall",
        "jones",
        "decides",
        "better",
        "inform",
        "smith",
        "poor",
        "prognosis",
        "disabuse",
        "smith",
        "evidentially",
        "unsupported",
        "belief",
        "four",
        "case",
        "provide",
        "possible",
        "scenario",
        "pragmatic",
        "belief",
        "formation",
        "suborning",
        "pragmatic",
        "belief",
        "formation",
        "others",
        "morally",
        "required",
        "although",
        "controversial",
        "duty",
        "argument",
        "sound",
        "would",
        "provide",
        "good",
        "reason",
        "thinking",
        "occasion",
        "permissible",
        "rationally",
        "morally",
        "form",
        "belief",
        "based",
        "upon",
        "pragmatic",
        "reason",
        "even",
        "absence",
        "adequate",
        "evidence",
        "duty",
        "argument",
        "sound",
        "e",
        "false",
        "duty",
        "argument",
        "presupposes",
        "various",
        "kind",
        "rationality",
        "many",
        "evidentialists",
        "well",
        "many",
        "opponent",
        "evidentialism",
        "also",
        "assume",
        "various",
        "kind",
        "rationality",
        "however",
        "one",
        "kind",
        "standard",
        "rationality",
        "impact",
        "would",
        "debate",
        "susanna",
        "rinard",
        "argues",
        "best",
        "reject",
        "idea",
        "various",
        "kind",
        "standard",
        "rationality",
        "replace",
        "idea",
        "equal",
        "treatment",
        "idea",
        "state",
        "whether",
        "doxastic",
        "face",
        "single",
        "standard",
        "rationality",
        "rinard",
        "equal",
        "treatment",
        "state",
        "state",
        "like",
        "carrying",
        "umbrella",
        "walking",
        "dog",
        "voting",
        "candidate",
        "forming",
        "belief",
        "god",
        "provides",
        "greater",
        "theoretical",
        "simplicity",
        "idea",
        "various",
        "standard",
        "kind",
        "rationality",
        "equal",
        "treatment",
        "also",
        "better",
        "explains",
        "methodological",
        "attraction",
        "simplicity",
        "science",
        "idea",
        "various",
        "kind",
        "rationality",
        "rinard",
        "argues",
        "equal",
        "treatment",
        "state",
        "idea",
        "correct",
        "doxastic",
        "state",
        "would",
        "face",
        "standard",
        "rationality",
        "state",
        "action",
        "equal",
        "treatment",
        "idea",
        "provides",
        "additional",
        "objection",
        "evidentialism",
        "insofar",
        "evidentialism",
        "implies",
        "belief",
        "subject",
        "one",
        "standard",
        "state",
        "subject",
        "another",
        "standard",
        "whether",
        "via",
        "rinard",
        "equal",
        "treatment",
        "argument",
        "duty",
        "argument",
        "arguably",
        "good",
        "reason",
        "reject",
        "evidentialism"
    ]
}