{
    "main_text": "Pragmatic Arguments and Belief\n8. Pragmatic Arguments and Belief\n\nThe idea that persons can voluntarily and directly choose what to\nbelieve is called “Doxastic Voluntarism”. According to\nDoxastic Voluntarism, believing is a direct act of the will, with many\nof the propositions we believe under our immediate control. A basic\naction is an action that a person intentionally does, without doing\nany other action. Jones’ moving of her finger is a basic action,\nsince she need not perform any other action to accomplish it. Her\nhanding the book from Smith to Brown is not basic, since she must\nintentionally do several things to accomplish it. According to\nDoxastic Voluntarism, some of our belief acquisitions are basic\nactions. We can will, directly and voluntarily, what to believe and\nthe beliefs thereby acquired are freely obtained and are not forced\nupon us. In short, one can believe at will. The proponent of Doxastic\nVoluntarism need not hold that every proposition is a candidate for\ndirect acquisition, as long as she holds that there are some\npropositions belief in which is under our direct control.\n\nIt is widely thought that Doxastic Voluntarism is implausible.\nOpponents of Doxastic Voluntarism can present a simple experiment\nagainst it: survey various propositions that you do not currently\nbelieve, and see if any lend themselves, directly and immediately, by\na basic act of the will, to belief. Certainly there are some beliefs\nthat one can easily cause oneself to have. Consider the proposition\nthat I am now holding a pencil. I can cause myself to believe that by\nsimply picking up a pencil. Or more generally, any proposition about\nmy own basic actions I can easily enough believe by performing the\naction. But my coming to believe is by means of some other basic\naction. Since I lack direct control over what I believe, and\nthere’s no reason to think that my lacking in this regard is\nsingular, Doxastic Voluntarism is implausible. Does the implausibility\nof Doxastic Voluntarism show that pragmatic belief-formation is also\nimplausible?\n\nNot at all: think of Pascal’s advice to act as if one already\nbelieves (by going to masses and by imitating the faithful) as a way\nof inculcating belief. Pragmatic belief-formation neither entails nor\npresupposes Doxastic Voluntarism. As long as there is indirect\ncontrol, or roundabout control, over the acquisition and maintenance\nof beliefs, pragmatic belief-formation is possible. What constitutes\nindirect control over the acquisition of beliefs? Consider actions\nsuch as entertaining a proposition, or ignoring a proposition, or\ncritically inquiring into the plausibility of this idea or that, or\naccepting a proposition. Each of these involves a propositional\nattitude, the adoption of which is under our direct control. Indirect\ncontrol occurs since accepting a proposition, say, or acting as if a\nproposition were true, very often results in believing that\nproposition. Insofar as there is a causal connection between the\npropositional attitudes we adopt, and the beliefs that are thereby\ngenerated, we can be said to have exercised indirect, or roundabout,\ncontrol over belief-formation.\n\nOne objection to the foregoing is that pragmatic arguments are, by and\nlarge, pointless because beliefs are, by their very nature,\npsychological states that aim for truth. That is, whenever one\nbelieves a proposition, one is disposed to feel that that proposition\nis probably the case. A person ordinarily cannot believe a proposition\nthat she takes to have a probability of less than one-half or whose\nprobability is uncertain since such propositional attitudes do not aim\nfor truth. The upshot of this objection is that strong evidentialism\nis unavoidable.\n\nIf it is true, as this objection holds, that believing a proposition\nordinarily involves being disposed to feel that the proposition is the\ncase then it does appear at first blush that pragmatic\nbelief-formation, as such, is ineffectual. But all that follows from\nthis fact, if such it be, is that some sort of belief-inducing\ntechnology will be necessary in order to facilitate the acquisition of\na proposition that is pragmatically supported. Now it is true that the\nmost readily available belief-inducing technologies –\nselectively using the evidence for instance – all involve a\ndegree of self-deception, since one ordinarily cannot attend only to\nthe favorable evidence in support of a particular proposition while\nneglecting the adverse evidence arrayed against it and, being\nconscious of all this, expect that one will acquire that belief. The\nfact that self-deception is a vital feature of the readily available\nbelief-formation technologies leads to another objection.\n\nThis second objection is that willfully engaging in self-deception\nrenders pragmatic belief-formation morally problematic and rationally\nsuspect, since willfully engaging in self-deception is the deliberate\nworsening of one’s epistemic situation. It is morally and\nrationally problematic to engage in pragmatic belief-formation,\ninsofar as belief-formation involves self-deception.\n\nThis second objection is powerful if sound, but we must be careful\nhere. First, while self-deception may be a serious problem with regard\nto inculcating a belief which one takes to be false, it does not seem\nto be a serious threat involving the inculcation of a belief which one\nthinks has as much evidence in its favor as against it, nor does it\nseem to be a threat when one takes the probability of the proposition\nto be indeterminate, since one could form the belief knowing full well\nthe evidential situation. Even if it is true that believing that p is\nbeing disposed to feel that p is the case, it does not follow\nthat believing that p involves being disposed to feel that p is\nthe case based on the evidence at hand. Second, this is an\nobjection not to pragmatic belief-formation per se, but an\nobjection to pragmatic belief-formation that involves self-deception.\nAlthough it may be true that the employment of self-deceptive\nbelief-inducing technologies is morally and rationally problematic,\nthis objection says nothing about those belief-inducing technologies\nthat do not involve self-deception. If there are belief-inducing\ntechnologies which are free of self-deception and which could generate\na belief on the basis of a pragmatic reason, then this objection\n fails.[11]\n\nIs there a belief-inducing technology available that does not involve\nself-deception? There is. Notice first there are two sorts of\nbelief-inducing technologies distinguishable: “low-tech”\ntechnologies and “high-tech” ones. Low-tech technologies\nconsist of propositional attitudes only, while high-tech ones employ\nnonpropositional techniques along with various propositional\nattitudes. The nonpropositional techniques could include actions like\nacting as if a certain proposition were true, and morally questionable\nones like hypnosis, or indoctrination, or subliminal suggestion.\nConsider a technology consisting of two components, the first of which\nis the acceptance of a proposition, while the second is a behavioral\nregimen of acting on that acceptance. Accepting a proposition, unlike\nbelieving, is an action that is characterized, in part, by one’s\nassenting to the proposition, whether one believes it or not. One\naccepts a proposition, when she assents to its truth and employs it as\na premise in her deliberations. One can accept a proposition that one\ndoes not believe. Indeed, we do this much of the time. For example,\nthink of the gambler’s fallacy. One might be disposed to believe\nthat the next toss of the fair coin must come up Tails, since it has\nbeen Heads on the previous seven tosses. Nevertheless, one ought not\nto accept that the next toss of a fair coin must come up Tails, or\nthat the probability that it will is greater than one-half.\nAcceptance, we should remember, unlike believing, is an action that is\nunder our direct control.\n\nIf one accepts a proposition, then one can also act upon the\nproposition. Acting upon a proposition is behaving as though it were\ntrue. The two-step regimen of accepting a proposition and then acting\nupon it is a common way of generating belief in that proposition. And,\nimportantly, there is no hint of self-deception tainting the\nprocess.\n\nOne might object that employing a belief-inducing technology at all,\nwhether low or high tech, is enough to entangle one in issues\nimplicating the rationality of the belief induced (see, for instance,\nGarber 2009). A friend of the pragmatic, however, might argue\nthat that this objection presupposes Strong Evidentialism, and\narguments found in William James, the Duty argument, the Equal\nTreatment argument, have already provided a dispositive ruling on that\nissue.\n",
    "section_title": "8. Pragmatic Arguments and Belief",
    "entry_title": "Pragmatic Arguments and Belief in God",
    "hierarchy_title": "Pragmatic Arguments and Belief in God || Pragmatic Arguments and Belief",
    "tokenized_text": [
        "pragmatic",
        "argument",
        "belief",
        "pragmatic",
        "argument",
        "belief",
        "idea",
        "person",
        "voluntarily",
        "directly",
        "choose",
        "believe",
        "called",
        "doxastic",
        "voluntarism",
        "according",
        "doxastic",
        "voluntarism",
        "believing",
        "direct",
        "act",
        "many",
        "proposition",
        "believe",
        "immediate",
        "control",
        "basic",
        "action",
        "action",
        "person",
        "intentionally",
        "without",
        "action",
        "jones",
        "moving",
        "finger",
        "basic",
        "action",
        "since",
        "need",
        "perform",
        "action",
        "accomplish",
        "handing",
        "book",
        "smith",
        "brown",
        "basic",
        "since",
        "must",
        "intentionally",
        "several",
        "thing",
        "accomplish",
        "according",
        "doxastic",
        "voluntarism",
        "belief",
        "acquisition",
        "basic",
        "action",
        "directly",
        "voluntarily",
        "believe",
        "belief",
        "thereby",
        "acquired",
        "freely",
        "obtained",
        "forced",
        "upon",
        "u",
        "short",
        "one",
        "believe",
        "proponent",
        "doxastic",
        "voluntarism",
        "need",
        "hold",
        "every",
        "proposition",
        "candidate",
        "direct",
        "acquisition",
        "long",
        "hold",
        "proposition",
        "belief",
        "direct",
        "control",
        "widely",
        "thought",
        "doxastic",
        "voluntarism",
        "implausible",
        "opponent",
        "doxastic",
        "voluntarism",
        "present",
        "simple",
        "experiment",
        "survey",
        "various",
        "proposition",
        "currently",
        "believe",
        "see",
        "lend",
        "directly",
        "immediately",
        "basic",
        "act",
        "belief",
        "certainly",
        "belief",
        "one",
        "easily",
        "cause",
        "oneself",
        "consider",
        "proposition",
        "holding",
        "pencil",
        "cause",
        "believe",
        "simply",
        "picking",
        "pencil",
        "generally",
        "proposition",
        "basic",
        "action",
        "easily",
        "enough",
        "believe",
        "performing",
        "action",
        "coming",
        "believe",
        "mean",
        "basic",
        "action",
        "since",
        "lack",
        "direct",
        "control",
        "believe",
        "reason",
        "think",
        "lacking",
        "regard",
        "singular",
        "doxastic",
        "voluntarism",
        "implausible",
        "implausibility",
        "doxastic",
        "voluntarism",
        "show",
        "pragmatic",
        "beliefformation",
        "also",
        "implausible",
        "think",
        "pascal",
        "advice",
        "act",
        "one",
        "already",
        "belief",
        "going",
        "mass",
        "imitating",
        "faithful",
        "way",
        "inculcating",
        "belief",
        "pragmatic",
        "beliefformation",
        "neither",
        "entail",
        "presupposes",
        "doxastic",
        "voluntarism",
        "long",
        "indirect",
        "control",
        "roundabout",
        "control",
        "acquisition",
        "maintenance",
        "belief",
        "pragmatic",
        "beliefformation",
        "possible",
        "constitutes",
        "indirect",
        "control",
        "acquisition",
        "belief",
        "consider",
        "action",
        "entertaining",
        "proposition",
        "ignoring",
        "proposition",
        "critically",
        "inquiring",
        "plausibility",
        "idea",
        "accepting",
        "proposition",
        "involves",
        "propositional",
        "attitude",
        "adoption",
        "direct",
        "control",
        "indirect",
        "control",
        "occurs",
        "since",
        "accepting",
        "proposition",
        "say",
        "acting",
        "proposition",
        "true",
        "often",
        "result",
        "believing",
        "proposition",
        "insofar",
        "causal",
        "connection",
        "propositional",
        "attitude",
        "adopt",
        "belief",
        "thereby",
        "generated",
        "said",
        "exercised",
        "indirect",
        "roundabout",
        "control",
        "beliefformation",
        "one",
        "objection",
        "foregoing",
        "pragmatic",
        "argument",
        "large",
        "pointless",
        "belief",
        "nature",
        "psychological",
        "state",
        "aim",
        "truth",
        "whenever",
        "one",
        "belief",
        "proposition",
        "one",
        "disposed",
        "feel",
        "proposition",
        "probably",
        "case",
        "person",
        "ordinarily",
        "believe",
        "proposition",
        "take",
        "probability",
        "le",
        "onehalf",
        "whose",
        "probability",
        "uncertain",
        "since",
        "propositional",
        "attitude",
        "aim",
        "truth",
        "upshot",
        "objection",
        "strong",
        "evidentialism",
        "unavoidable",
        "true",
        "objection",
        "hold",
        "believing",
        "proposition",
        "ordinarily",
        "involves",
        "disposed",
        "feel",
        "proposition",
        "case",
        "appear",
        "first",
        "blush",
        "pragmatic",
        "beliefformation",
        "ineffectual",
        "follows",
        "fact",
        "sort",
        "beliefinducing",
        "technology",
        "necessary",
        "order",
        "facilitate",
        "acquisition",
        "proposition",
        "pragmatically",
        "supported",
        "true",
        "readily",
        "available",
        "beliefinducing",
        "technology",
        "selectively",
        "using",
        "evidence",
        "instance",
        "involve",
        "degree",
        "selfdeception",
        "since",
        "one",
        "ordinarily",
        "attend",
        "favorable",
        "evidence",
        "support",
        "particular",
        "proposition",
        "neglecting",
        "adverse",
        "evidence",
        "arrayed",
        "conscious",
        "expect",
        "one",
        "acquire",
        "belief",
        "fact",
        "selfdeception",
        "vital",
        "feature",
        "readily",
        "available",
        "beliefformation",
        "technology",
        "lead",
        "another",
        "objection",
        "second",
        "objection",
        "willfully",
        "engaging",
        "selfdeception",
        "render",
        "pragmatic",
        "beliefformation",
        "morally",
        "problematic",
        "rationally",
        "suspect",
        "since",
        "willfully",
        "engaging",
        "selfdeception",
        "deliberate",
        "worsening",
        "one",
        "epistemic",
        "situation",
        "morally",
        "rationally",
        "problematic",
        "engage",
        "pragmatic",
        "beliefformation",
        "insofar",
        "beliefformation",
        "involves",
        "selfdeception",
        "second",
        "objection",
        "powerful",
        "sound",
        "must",
        "careful",
        "first",
        "selfdeception",
        "may",
        "serious",
        "problem",
        "regard",
        "inculcating",
        "belief",
        "one",
        "take",
        "false",
        "seem",
        "serious",
        "threat",
        "involving",
        "inculcation",
        "belief",
        "one",
        "think",
        "much",
        "evidence",
        "favor",
        "seem",
        "threat",
        "one",
        "take",
        "probability",
        "proposition",
        "indeterminate",
        "since",
        "one",
        "could",
        "form",
        "belief",
        "knowing",
        "full",
        "well",
        "evidential",
        "situation",
        "even",
        "true",
        "believing",
        "p",
        "disposed",
        "feel",
        "p",
        "case",
        "follow",
        "believing",
        "p",
        "involves",
        "disposed",
        "feel",
        "p",
        "case",
        "based",
        "evidence",
        "hand",
        "second",
        "objection",
        "pragmatic",
        "beliefformation",
        "per",
        "se",
        "objection",
        "pragmatic",
        "beliefformation",
        "involves",
        "selfdeception",
        "although",
        "may",
        "true",
        "employment",
        "selfdeceptive",
        "beliefinducing",
        "technology",
        "morally",
        "rationally",
        "problematic",
        "objection",
        "say",
        "nothing",
        "beliefinducing",
        "technology",
        "involve",
        "selfdeception",
        "beliefinducing",
        "technology",
        "free",
        "selfdeception",
        "could",
        "generate",
        "belief",
        "basis",
        "pragmatic",
        "reason",
        "objection",
        "fails",
        "beliefinducing",
        "technology",
        "available",
        "involve",
        "selfdeception",
        "notice",
        "first",
        "two",
        "sort",
        "beliefinducing",
        "technology",
        "distinguishable",
        "lowtech",
        "technology",
        "hightech",
        "one",
        "lowtech",
        "technology",
        "consist",
        "propositional",
        "attitude",
        "hightech",
        "one",
        "employ",
        "nonpropositional",
        "technique",
        "along",
        "various",
        "propositional",
        "attitude",
        "nonpropositional",
        "technique",
        "could",
        "include",
        "action",
        "like",
        "acting",
        "certain",
        "proposition",
        "true",
        "morally",
        "questionable",
        "one",
        "like",
        "hypnosis",
        "indoctrination",
        "subliminal",
        "suggestion",
        "consider",
        "technology",
        "consisting",
        "two",
        "component",
        "first",
        "acceptance",
        "proposition",
        "second",
        "behavioral",
        "regimen",
        "acting",
        "acceptance",
        "accepting",
        "proposition",
        "unlike",
        "believing",
        "action",
        "characterized",
        "part",
        "one",
        "assenting",
        "proposition",
        "whether",
        "one",
        "belief",
        "one",
        "accepts",
        "proposition",
        "assent",
        "truth",
        "employ",
        "premise",
        "deliberation",
        "one",
        "accept",
        "proposition",
        "one",
        "believe",
        "indeed",
        "much",
        "time",
        "example",
        "think",
        "gambler",
        "fallacy",
        "one",
        "might",
        "disposed",
        "believe",
        "next",
        "toss",
        "fair",
        "coin",
        "must",
        "come",
        "tail",
        "since",
        "head",
        "previous",
        "seven",
        "toss",
        "nevertheless",
        "one",
        "ought",
        "accept",
        "next",
        "toss",
        "fair",
        "coin",
        "must",
        "come",
        "tail",
        "probability",
        "greater",
        "onehalf",
        "acceptance",
        "remember",
        "unlike",
        "believing",
        "action",
        "direct",
        "control",
        "one",
        "accepts",
        "proposition",
        "one",
        "also",
        "act",
        "upon",
        "proposition",
        "acting",
        "upon",
        "proposition",
        "behaving",
        "though",
        "true",
        "twostep",
        "regimen",
        "accepting",
        "proposition",
        "acting",
        "upon",
        "common",
        "way",
        "generating",
        "belief",
        "proposition",
        "importantly",
        "hint",
        "selfdeception",
        "tainting",
        "process",
        "one",
        "might",
        "object",
        "employing",
        "beliefinducing",
        "technology",
        "whether",
        "low",
        "high",
        "tech",
        "enough",
        "entangle",
        "one",
        "issue",
        "implicating",
        "rationality",
        "belief",
        "induced",
        "see",
        "instance",
        "garber",
        "friend",
        "pragmatic",
        "however",
        "might",
        "argue",
        "objection",
        "presupposes",
        "strong",
        "evidentialism",
        "argument",
        "found",
        "william",
        "james",
        "duty",
        "argument",
        "equal",
        "treatment",
        "argument",
        "already",
        "provided",
        "dispositive",
        "ruling",
        "issue"
    ]
}