{
    "main_text": "Local contexts and the dynamic turn || Satisfaction in local contexts\n4.2 Satisfaction in local contexts\n\nAs previously noted, early work on presupposition was primarily\nfocused on definite descriptions, and definite descriptions have\ncontinued to be the paradigmatic example of a presupposition trigger\nin philosophical literature over the last fifty years. However, by the\nearly 1970s, more linguistically oriented work had expanded the\nempirical domain of presupposition theory from definite descriptions\nto other trigger types, including factives (Kiparsky and Kiparsky,\n1970), implicatives (Karttunen, 1971a), focus particles (Horn, 1969),\nverbs of judging (Fillmore, 1971) and sortal constraints (Thomason,\n1972). Stalnaker’s discussion of Karttunen’s semifactives provides an\nearly example of how this linguistic expansion of the empirical domain\nhas impacted philosophical work. Also by the early 1970s, linguists\nhad expanded the empirical domain in another direction. The\nphilosophical literature was largely oriented towards unembedded\npresupposition triggers and triggers under negation, but as we have\nalready mentioned, Morgan (1969) and Langendoen and Savin (1971)\ngeneralized the issue by considering arbitrary embeddings. However, it\nwas not until Karttunen (1973) that the full complexity of the\nprojection problem became apparent. By methodically considering\nprojection behavior construction by construction, Karttunen showed\nthat there was more variation in projection behavior than had been\npreviously described, making it quite clear that none of the extant\nFrege-Strawson derived systems could hope to cover every case, and\nthis ultimately led to the application of dynamic models of meaning to\nthe problem of presupposition projection.\n\nKarttunen (1973) presented a taxonomy of embedding constructions that\ndivided them into three classes: plugs, holes and\nfilters. Plugs comprise a class of predicates and operators\nwhich Karttunen claimed block the projection of presuppositions, while\nholes are a class of predicates and operators which allow\npresuppositions to project freely. So, for example, since “told\nthat” is a plug, according to\n Karttunen,[14]\n (25) is predicted not to presuppose that there is a King of France.\nOn the other hand, since “perhaps” is a hole, (26) is\npredicted to presuppose that there is a King of France.\n\n(25)\nMary told Jim that the King of France was bald.\n\n\n(26)\nPerhaps the King of France is bald.\n\n\nKarttunen’s filters include the binary logical connectives “if\nthen”, “and”, and “or”. The intuition\nbehind the filter metaphor is that these constructions allow only some\npresuppositions to project, others being caught in the filter, and we\nhave already seen examples of this phenomenon. Thus example (12)\nshowed that sometimes a presupposition in the consequent of a\nconditional does not project: here the presupposition that there was a\nknave is filtered out. But the same example includes an occurrence of\nthe definite “the tarts” in the consequent, and the\npresupposition that there are (or at least were) some tarts projects\nfrom the conditional. Karttunen concluded that the consequent of a\nconditional acts as a hole to some presuppositions, but filters out\nall those presuppositions which are entailed by the antecedent, or,\nmore generally, by a combination of the antecedent and contextually\nsupplied background information.\n\nKarttunen’s key example showing the role of context bears\nrepetition:\n\n(27)\nEither Geraldine is not a mormon or she has given up wearing her\nholy underwear.\n\n\nThe second half of (27) contains (at least) two presupposition\ntriggers: the definite description “her holy underwear”\nand the aspectual verb “give up”, which trigger the\npresuppositions that Geraldine used to have and wear holy underwear,\nrespectively. Karttunen’s filtering condition for disjunctions removes\nfrom the right disjunct any presuppositions that are entailed by a\ncombination of the context and the negation of the left disjunct. Now\nconsider a context supporting the proposition that all mormons have\nholy underwear which they wear regularly. It follows from this\nproposition and the negation of the left disjunct, i.e., the\nproposition that Geraldine is a mormon, that Geraldine has holy\nunderwear and has worn it regularly. But these are exactly the\npresuppositions triggered in the right disjunct, so they are filtered\nout. It follows that (27) has no presuppositions.\n\nKarttunen’s (1973) account is of interest not only for its triptych of\nplugs, holes and filters, but also because it sets the background for\na crucial shift of perspective in Karttunen (1974), and thence to the\ndynamic approaches to presupposition that have been dominant in recent\nyears. What remained unclear in the 1973 paper was the motivation for\nfiltering, i.e. why presuppositions should be filtered out when\nentailed by other material. Karttunen (1974) suggests an alternative\nconception based on the idea of local contexts of evaluation.\nThe idea is that the parts of a sentence are not necessarily evaluated\nwith respect to the same context as that in which the sentence as a\nwhole is evaluated: a local context may contain more\ninformation than the global context. For example, when\nevaluating a conjunction, the second conjunct is evaluated in a local\ncontext which contains not only the information in the global context,\nbut also whatever information was given by the first conjunct.\nKarttunen (1974) defines local contexts of evaluation for a range of\nconstructions, and suggests the following requirement: presuppositions\nalways need to be entailed (or “satisfied”, as he put it)\nin the local context in which the trigger is evaluated. Given this\nrequirement, the overall presuppositions of a sentence will just be\nwhatever propositions must be in a context of an utterance in order to\nguarantee that the requirements associated with presupposition\ntriggers are satisfied in their local contexts of interpretation.\n\nKarttunen spelled out how local satisfaction should be calculated\nseparately for each connective and operator he considered. However,\nrecent developments in Schlenker (2008) provide a general way of\ncalculating what the local context should be. In the following\nreformulation of Karttunen’s model we incorporate Schlenker’s insights\nalong the lines proposed by Beaver (2008).\n\nLet us say that some clause in a complex sentence is\nredundant relative to some context of utterance if you can\nreplace that clause by a tautology without affecting the amount of\nfactual information conveyed by the sentence in that context. For\nexample, in (28), the first conjunct is redundant in any context of\nutterance. Here, the same factual information would be conveyed by\n“Mary is Mary and Mary owns a sheep”, where the first\nconjunct is replaced by the tautology “Mary is Mary”.\n\n(28)\nMary owns an animal and Mary owns a sheep.\n\n\nNow let us say that a clause is left-redundant if it is\npossible to tell by looking at the material in the sentence to the\nleft of the clause that the clause is redundant. So “Mary owns\nan animal” is not left-redundant in (28) (except if the context\nof utterance already entails that Mary owns an animal), because there\nis no material before that clause, implying that it is impossible to\ntell by looking at material to the left of the clause that the clause\nis redundant. On the other hand, the same sentential fragment,\n“Mary owns an animal”, is left-redundant in (29) and also\nin (20):\n\n(29)\nMary owns a sheep and Mary owns an animal. (Truth-conditionally\nequivalent to: Mary owns a sheep and Mary is Mary)\n\n\n(30)\nIf Mary owns a sheep then Mary owns an animal.\n(Truth-conditionally equivalent to: If Mary owns a sheep then\nMary is Mary)\n\n\nNow we use this idea of left redundancy, which echoes the above van\nder Sandt analysis of the effect of fronting presuppositions, to\ndefine the crucial notion in Karttunen’s (1974) account.\n\nDefinition 8 (Karttunen/Schlenker: Presupposition via\nsatisfaction)\n\nA presupposition P is satisfied at point X\nin S iff P would be left-redundant if added at point\nX. A sentence presupposes whatever propositions must hold in\nglobal contexts of utterance such that each locally triggered\npresupposition is satisfied where its trigger occurs.\n\n\nAs an example, let us consider the presuppositions predicted for (27),\nrepeated below:\n\n(27)\nEither Geraldine is not a mormon or she has given up wearing her\nholy underwear.\n\n\nNote first that for all sentences of the form “A or\nB”, the negation of A is satisfied within the\nright disjunct. So “Geraldine is a mormon” is satisfied in\nthe right disjunct of (27). And more generally, anything entailed by a\ncombination of propositions in the context and the negation of the\nleft disjunct will be satisfied in the right disjunct. Now, let us\nconsider the clause “she has given up wearing her holy\nunderwear”: we take this to trigger the presupposition that\nGeraldine has had holy underwear that she wore. This presupposition\nwill be satisfied provided the global context of utterance, combined\nwith the negation of the left disjunct, entails that she has had holy\nunderwear that she wore. And classically this will be the case if and\nonly if the context supports the conditional “if Geraldine is a\nmormon, then she has had holy underwear that she wore” (which\nwould also be the case if the context supported something stronger).\nHence, this conditional is the presupposition Karttunen (1974)\npredicts for (27).\n\nOne notable property of Karttunen’s 1974 treatment of examples like\n(27), a property not found in his 1973 model, is that the\npresupposition predicted is conditionalized. That is, (27) is not\npredicted to presuppose that Geraldine has had holy underwear that she\nwore, but that if she is a mormon then she has had such underwear. We\nalready encountered such conditionalized presuppositions in our\ndiscussion of Strong Kleene; in fact, Strong Kleene predicts exactly\nthe same conditionalized presupposition in this case. Karttunen’s 1974\nmodel also predicts conditionalized presuppositions when the\npresupposition trigger is in the right conjunct of a conjunction, or\nin the consequent of a\n conditional.[15]\n Thus in (16a), repeated below, the presuppositions predicted are that\nthere is a king (since presuppositions triggered in the antecedent are\nnot conditionalized), and that if the king is angry, then there is a\nknave. In (16b), the conditional presupposition (that if there is a\nknave, then there is a knave) is trivial, so in effect there is no net\n presupposition.[16]\n\n(16a)\nIf the king is angry then the knave stole the tarts.\n(16b)\nIf there is a knave, then the knave stole the tarts.\n\n\nAlthough Karttunen’s (1974) model is distinct conceptually from any of\nits predecessors, we have already noted that it shares at least some\npredictions with Strong Kleene. An observation made by Peters (1979)\nshowed that the 1974 model is surprisingly closely related to the\nsemantic accounts of presupposition discussed above. In particular,\nPeters showed that Karttunen’s way of calculating presuppositions for\nthe truth conditional connectives is equivalent to what would be\nobtained within a three-valued logic, but with special non-symmetric\nconnectives. Here is a general way of defining the Peters Connectives,\ninspired both by Schlenker (2009; 2008) and George (2008):\n\nDefinition 9 (Middle Kleene/Peters connectives)\n\nGo from left to right through the sentence. For each argument\nX that takes a non-classical value, check whether on the\nbasis of material on its left, assigning an arbitrary classical value\nto X could conceivably have an effect on the overall value.\nIf so, the sentence as a whole lacks a classical truth value. If not,\njust assign X an arbitrary value, and carry on. If this\nprocedure allows all non-classical values to be filled in classically,\nthen the sentence can be assigned a classical value.\n\n\nFor example, this procedure makes a conjunction classical if both its\narguments are classical, false if the left conjunct is false, and\nundefined otherwise. Thus undefinedness of the left conjunct forces\nundefinedness of the entire conjunction, whereas undefinedness of the\nright conjunct only sometimes yields undefinedness of the entire\nconjunct, as seen in the following comparison of truth tables in\nvarious systems. The net effect is that presuppositions of the left\nconjunct project in the Middle Kleene system, just as in the Weak\nKleene system, but presuppositions of the right conjunct are\nconditionalized, just as in the Strong Kleene system. This behavior\nprecisely mirrors that of the Karttunen (1974) model.\n\nDefinition 10 (Trivalent truth tables for\nconjunction)\n\n\nWeak Kleene\n\n\n\nφ ∧ ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nf\nf\n✭ \n\n✭\n✭\n✭\n✭ \n \nMiddle Kleene/Peters\n\n\n\nφ ∧ ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nf\nf\nf \n\n✭\n✭\n✭\n✭ \n \nStrong Kleene\n\n\n\nφ ∧ ψ\nt\nf\n✭ \n\nt\nt\nf\n✭ \n\nf\nf\nf\nf \n\n✭\n✭\nf\n✭ \n  \n\n\nThe equivalence between Peters’ connectives and Karttunen’s model\npaved the way for a more complete reformulation of the Karttunen model\nin Karttunen and Peters (1977; 1979), where certain types of\npresupposition (which Karttunen and Peters regard as conventional\nimplicatures rather than presuppositions) are treated in a\ncompositional grammar fragment. This fragment uses two dimensions of\nmeaning, one for presupposition and one for assertion, and is\neffectively an implementation of the Peters connectives in a\nfour-valued logic; see Krahmer (1994); Krahmer (1998), Beaver (2001),\nand Beaver and Krahmer (2001) for discussion, and the latter for a\nfragment that mirrors that of Karttunen and Peters, but allows for\nricher interactions between presuppositions and\n quantifiers.[17]\n",
    "section_title": "4.2 Satisfaction in local contexts",
    "entry_title": "Presupposition",
    "hierarchy_title": "Presupposition || Local contexts and the dynamic turn || Satisfaction in local contexts",
    "tokenized_text": [
        "local",
        "context",
        "dynamic",
        "turn",
        "satisfaction",
        "local",
        "context",
        "satisfaction",
        "local",
        "context",
        "previously",
        "noted",
        "early",
        "work",
        "presupposition",
        "primarily",
        "focused",
        "definite",
        "description",
        "definite",
        "description",
        "continued",
        "paradigmatic",
        "example",
        "presupposition",
        "trigger",
        "philosophical",
        "literature",
        "last",
        "fifty",
        "year",
        "however",
        "early",
        "s",
        "linguistically",
        "oriented",
        "work",
        "expanded",
        "empirical",
        "domain",
        "presupposition",
        "theory",
        "definite",
        "description",
        "trigger",
        "type",
        "including",
        "factives",
        "kiparsky",
        "kiparsky",
        "implicatives",
        "karttunen",
        "a",
        "focus",
        "particle",
        "horn",
        "verb",
        "judging",
        "fillmore",
        "sortal",
        "constraint",
        "thomason",
        "stalnaker",
        "discussion",
        "karttunen",
        "semifactives",
        "provides",
        "early",
        "example",
        "linguistic",
        "expansion",
        "empirical",
        "domain",
        "impacted",
        "philosophical",
        "work",
        "also",
        "early",
        "s",
        "linguist",
        "expanded",
        "empirical",
        "domain",
        "another",
        "direction",
        "philosophical",
        "literature",
        "largely",
        "oriented",
        "towards",
        "unembedded",
        "presupposition",
        "trigger",
        "trigger",
        "negation",
        "already",
        "mentioned",
        "morgan",
        "langendoen",
        "savin",
        "generalized",
        "issue",
        "considering",
        "arbitrary",
        "embeddings",
        "however",
        "karttunen",
        "full",
        "complexity",
        "projection",
        "problem",
        "became",
        "apparent",
        "methodically",
        "considering",
        "projection",
        "behavior",
        "construction",
        "construction",
        "karttunen",
        "showed",
        "variation",
        "projection",
        "behavior",
        "previously",
        "described",
        "making",
        "quite",
        "clear",
        "none",
        "extant",
        "fregestrawson",
        "derived",
        "system",
        "could",
        "hope",
        "cover",
        "every",
        "case",
        "ultimately",
        "led",
        "application",
        "dynamic",
        "model",
        "meaning",
        "problem",
        "presupposition",
        "projection",
        "karttunen",
        "presented",
        "taxonomy",
        "embedding",
        "construction",
        "divided",
        "three",
        "class",
        "plug",
        "hole",
        "filter",
        "plug",
        "comprise",
        "class",
        "predicate",
        "operator",
        "karttunen",
        "claimed",
        "block",
        "projection",
        "presupposition",
        "hole",
        "class",
        "predicate",
        "operator",
        "allow",
        "presupposition",
        "project",
        "freely",
        "example",
        "since",
        "told",
        "plug",
        "according",
        "karttunen",
        "predicted",
        "presuppose",
        "king",
        "france",
        "hand",
        "since",
        "perhaps",
        "hole",
        "predicted",
        "presuppose",
        "king",
        "france",
        "mary",
        "told",
        "jim",
        "king",
        "france",
        "bald",
        "perhaps",
        "king",
        "france",
        "bald",
        "karttunen",
        "filter",
        "include",
        "binary",
        "logical",
        "connective",
        "intuition",
        "behind",
        "filter",
        "metaphor",
        "construction",
        "allow",
        "presupposition",
        "project",
        "others",
        "caught",
        "filter",
        "already",
        "seen",
        "example",
        "phenomenon",
        "thus",
        "example",
        "showed",
        "sometimes",
        "presupposition",
        "consequent",
        "conditional",
        "project",
        "presupposition",
        "knave",
        "filtered",
        "example",
        "includes",
        "occurrence",
        "definite",
        "tart",
        "consequent",
        "presupposition",
        "least",
        "tart",
        "project",
        "conditional",
        "karttunen",
        "concluded",
        "consequent",
        "conditional",
        "act",
        "hole",
        "presupposition",
        "filter",
        "presupposition",
        "entailed",
        "antecedent",
        "generally",
        "combination",
        "antecedent",
        "contextually",
        "supplied",
        "background",
        "information",
        "karttunen",
        "key",
        "example",
        "showing",
        "role",
        "context",
        "bear",
        "repetition",
        "either",
        "geraldine",
        "mormon",
        "given",
        "wearing",
        "holy",
        "underwear",
        "second",
        "half",
        "contains",
        "least",
        "two",
        "presupposition",
        "trigger",
        "definite",
        "description",
        "holy",
        "underwear",
        "aspectual",
        "verb",
        "give",
        "trigger",
        "presupposition",
        "geraldine",
        "used",
        "wear",
        "holy",
        "underwear",
        "respectively",
        "karttunen",
        "filtering",
        "condition",
        "disjunction",
        "remove",
        "right",
        "disjunct",
        "presupposition",
        "entailed",
        "combination",
        "context",
        "negation",
        "left",
        "disjunct",
        "consider",
        "context",
        "supporting",
        "proposition",
        "mormon",
        "holy",
        "underwear",
        "wear",
        "regularly",
        "follows",
        "proposition",
        "negation",
        "left",
        "disjunct",
        "ie",
        "proposition",
        "geraldine",
        "mormon",
        "geraldine",
        "holy",
        "underwear",
        "worn",
        "regularly",
        "exactly",
        "presupposition",
        "triggered",
        "right",
        "disjunct",
        "filtered",
        "follows",
        "presupposition",
        "karttunen",
        "account",
        "interest",
        "triptych",
        "plug",
        "hole",
        "filter",
        "also",
        "set",
        "background",
        "crucial",
        "shift",
        "perspective",
        "karttunen",
        "thence",
        "dynamic",
        "approach",
        "presupposition",
        "dominant",
        "recent",
        "year",
        "remained",
        "unclear",
        "paper",
        "motivation",
        "filtering",
        "ie",
        "presupposition",
        "filtered",
        "entailed",
        "material",
        "karttunen",
        "suggests",
        "alternative",
        "conception",
        "based",
        "idea",
        "local",
        "context",
        "evaluation",
        "idea",
        "part",
        "sentence",
        "necessarily",
        "evaluated",
        "respect",
        "context",
        "sentence",
        "whole",
        "evaluated",
        "local",
        "context",
        "may",
        "contain",
        "information",
        "global",
        "context",
        "example",
        "evaluating",
        "conjunction",
        "second",
        "conjunct",
        "evaluated",
        "local",
        "context",
        "contains",
        "information",
        "global",
        "context",
        "also",
        "whatever",
        "information",
        "given",
        "first",
        "conjunct",
        "karttunen",
        "defines",
        "local",
        "context",
        "evaluation",
        "range",
        "construction",
        "suggests",
        "following",
        "requirement",
        "presupposition",
        "always",
        "need",
        "entailed",
        "satisfied",
        "put",
        "local",
        "context",
        "trigger",
        "evaluated",
        "given",
        "requirement",
        "overall",
        "presupposition",
        "sentence",
        "whatever",
        "proposition",
        "must",
        "context",
        "utterance",
        "order",
        "guarantee",
        "requirement",
        "associated",
        "presupposition",
        "trigger",
        "satisfied",
        "local",
        "context",
        "interpretation",
        "karttunen",
        "spelled",
        "local",
        "satisfaction",
        "calculated",
        "separately",
        "connective",
        "operator",
        "considered",
        "however",
        "recent",
        "development",
        "schlenker",
        "provide",
        "general",
        "way",
        "calculating",
        "local",
        "context",
        "following",
        "reformulation",
        "karttunen",
        "model",
        "incorporate",
        "schlenker",
        "insight",
        "along",
        "line",
        "proposed",
        "beaver",
        "let",
        "u",
        "say",
        "clause",
        "complex",
        "sentence",
        "redundant",
        "relative",
        "context",
        "utterance",
        "replace",
        "clause",
        "tautology",
        "without",
        "affecting",
        "amount",
        "factual",
        "information",
        "conveyed",
        "sentence",
        "context",
        "example",
        "first",
        "conjunct",
        "redundant",
        "context",
        "utterance",
        "factual",
        "information",
        "would",
        "conveyed",
        "mary",
        "mary",
        "mary",
        "owns",
        "sheep",
        "first",
        "conjunct",
        "replaced",
        "tautology",
        "mary",
        "mary",
        "mary",
        "owns",
        "animal",
        "mary",
        "owns",
        "sheep",
        "let",
        "u",
        "say",
        "clause",
        "leftredundant",
        "possible",
        "tell",
        "looking",
        "material",
        "sentence",
        "left",
        "clause",
        "clause",
        "redundant",
        "mary",
        "owns",
        "animal",
        "leftredundant",
        "except",
        "context",
        "utterance",
        "already",
        "entail",
        "mary",
        "owns",
        "animal",
        "material",
        "clause",
        "implying",
        "impossible",
        "tell",
        "looking",
        "material",
        "left",
        "clause",
        "clause",
        "redundant",
        "hand",
        "sentential",
        "fragment",
        "mary",
        "owns",
        "animal",
        "leftredundant",
        "also",
        "mary",
        "owns",
        "sheep",
        "mary",
        "owns",
        "animal",
        "truthconditionally",
        "equivalent",
        "mary",
        "owns",
        "sheep",
        "mary",
        "mary",
        "mary",
        "owns",
        "sheep",
        "mary",
        "owns",
        "animal",
        "truthconditionally",
        "equivalent",
        "mary",
        "owns",
        "sheep",
        "mary",
        "mary",
        "use",
        "idea",
        "left",
        "redundancy",
        "echo",
        "van",
        "der",
        "sandt",
        "analysis",
        "effect",
        "fronting",
        "presupposition",
        "define",
        "crucial",
        "notion",
        "karttunen",
        "account",
        "definition",
        "karttunenschlenker",
        "presupposition",
        "via",
        "satisfaction",
        "presupposition",
        "p",
        "satisfied",
        "point",
        "x",
        "iff",
        "p",
        "would",
        "leftredundant",
        "added",
        "point",
        "x",
        "sentence",
        "presupposes",
        "whatever",
        "proposition",
        "must",
        "hold",
        "global",
        "context",
        "utterance",
        "locally",
        "triggered",
        "presupposition",
        "satisfied",
        "trigger",
        "occurs",
        "example",
        "let",
        "u",
        "consider",
        "presupposition",
        "predicted",
        "repeated",
        "either",
        "geraldine",
        "mormon",
        "given",
        "wearing",
        "holy",
        "underwear",
        "note",
        "first",
        "sentence",
        "form",
        "b",
        "negation",
        "satisfied",
        "within",
        "right",
        "disjunct",
        "geraldine",
        "mormon",
        "satisfied",
        "right",
        "disjunct",
        "generally",
        "anything",
        "entailed",
        "combination",
        "proposition",
        "context",
        "negation",
        "left",
        "disjunct",
        "satisfied",
        "right",
        "disjunct",
        "let",
        "u",
        "consider",
        "clause",
        "given",
        "wearing",
        "holy",
        "underwear",
        "take",
        "trigger",
        "presupposition",
        "geraldine",
        "holy",
        "underwear",
        "wore",
        "presupposition",
        "satisfied",
        "provided",
        "global",
        "context",
        "utterance",
        "combined",
        "negation",
        "left",
        "disjunct",
        "entail",
        "holy",
        "underwear",
        "wore",
        "classically",
        "case",
        "context",
        "support",
        "conditional",
        "geraldine",
        "mormon",
        "holy",
        "underwear",
        "wore",
        "would",
        "also",
        "case",
        "context",
        "supported",
        "something",
        "stronger",
        "hence",
        "conditional",
        "presupposition",
        "karttunen",
        "predicts",
        "one",
        "notable",
        "property",
        "karttunen",
        "treatment",
        "example",
        "like",
        "property",
        "found",
        "model",
        "presupposition",
        "predicted",
        "conditionalized",
        "predicted",
        "presuppose",
        "geraldine",
        "holy",
        "underwear",
        "wore",
        "mormon",
        "underwear",
        "already",
        "encountered",
        "conditionalized",
        "presupposition",
        "discussion",
        "strong",
        "kleene",
        "fact",
        "strong",
        "kleene",
        "predicts",
        "exactly",
        "conditionalized",
        "presupposition",
        "case",
        "karttunen",
        "model",
        "also",
        "predicts",
        "conditionalized",
        "presupposition",
        "presupposition",
        "trigger",
        "right",
        "conjunct",
        "conjunction",
        "consequent",
        "conditional",
        "thus",
        "a",
        "repeated",
        "presupposition",
        "predicted",
        "king",
        "since",
        "presupposition",
        "triggered",
        "antecedent",
        "conditionalized",
        "king",
        "angry",
        "knave",
        "b",
        "conditional",
        "presupposition",
        "knave",
        "knave",
        "trivial",
        "effect",
        "net",
        "presupposition",
        "a",
        "king",
        "angry",
        "knave",
        "stole",
        "tart",
        "b",
        "knave",
        "knave",
        "stole",
        "tart",
        "although",
        "karttunen",
        "model",
        "distinct",
        "conceptually",
        "predecessor",
        "already",
        "noted",
        "share",
        "least",
        "prediction",
        "strong",
        "kleene",
        "observation",
        "made",
        "peter",
        "showed",
        "model",
        "surprisingly",
        "closely",
        "related",
        "semantic",
        "account",
        "presupposition",
        "discussed",
        "particular",
        "peter",
        "showed",
        "karttunen",
        "way",
        "calculating",
        "presupposition",
        "truth",
        "conditional",
        "connective",
        "equivalent",
        "would",
        "obtained",
        "within",
        "threevalued",
        "logic",
        "special",
        "nonsymmetric",
        "connective",
        "general",
        "way",
        "defining",
        "peter",
        "connective",
        "inspired",
        "schlenker",
        "george",
        "definition",
        "middle",
        "kleenepeters",
        "connective",
        "go",
        "left",
        "right",
        "sentence",
        "argument",
        "x",
        "take",
        "nonclassical",
        "value",
        "check",
        "whether",
        "basis",
        "material",
        "left",
        "assigning",
        "arbitrary",
        "classical",
        "value",
        "x",
        "could",
        "conceivably",
        "effect",
        "overall",
        "value",
        "sentence",
        "whole",
        "lack",
        "classical",
        "truth",
        "value",
        "assign",
        "x",
        "arbitrary",
        "value",
        "carry",
        "procedure",
        "allows",
        "nonclassical",
        "value",
        "filled",
        "classically",
        "sentence",
        "assigned",
        "classical",
        "value",
        "example",
        "procedure",
        "make",
        "conjunction",
        "classical",
        "argument",
        "classical",
        "false",
        "left",
        "conjunct",
        "false",
        "undefined",
        "otherwise",
        "thus",
        "undefinedness",
        "left",
        "conjunct",
        "force",
        "undefinedness",
        "entire",
        "conjunction",
        "whereas",
        "undefinedness",
        "right",
        "conjunct",
        "sometimes",
        "yield",
        "undefinedness",
        "entire",
        "conjunct",
        "seen",
        "following",
        "comparison",
        "truth",
        "table",
        "various",
        "system",
        "net",
        "effect",
        "presupposition",
        "left",
        "conjunct",
        "project",
        "middle",
        "kleene",
        "system",
        "weak",
        "kleene",
        "system",
        "presupposition",
        "right",
        "conjunct",
        "conditionalized",
        "strong",
        "kleene",
        "system",
        "behavior",
        "precisely",
        "mirror",
        "karttunen",
        "model",
        "definition",
        "trivalent",
        "truth",
        "table",
        "conjunction",
        "weak",
        "kleene",
        "φ",
        "ψ",
        "f",
        "f",
        "f",
        "f",
        "f",
        "middle",
        "kleenepeters",
        "φ",
        "ψ",
        "f",
        "f",
        "f",
        "f",
        "f",
        "f",
        "strong",
        "kleene",
        "φ",
        "ψ",
        "f",
        "f",
        "f",
        "f",
        "f",
        "f",
        "f",
        "equivalence",
        "peter",
        "connective",
        "karttunen",
        "model",
        "paved",
        "way",
        "complete",
        "reformulation",
        "karttunen",
        "model",
        "karttunen",
        "peter",
        "certain",
        "type",
        "presupposition",
        "karttunen",
        "peter",
        "regard",
        "conventional",
        "implicatures",
        "rather",
        "presupposition",
        "treated",
        "compositional",
        "grammar",
        "fragment",
        "fragment",
        "us",
        "two",
        "dimension",
        "meaning",
        "one",
        "presupposition",
        "one",
        "assertion",
        "effectively",
        "implementation",
        "peter",
        "connective",
        "fourvalued",
        "logic",
        "see",
        "krahmer",
        "krahmer",
        "beaver",
        "beaver",
        "krahmer",
        "discussion",
        "latter",
        "fragment",
        "mirror",
        "karttunen",
        "peter",
        "allows",
        "richer",
        "interaction",
        "presupposition",
        "quantifier"
    ]
}