{
    "main_text": "Xenophanes of Colophon and Heraclitus of Ephesus\n3. Xenophanes of Colophon and Heraclitus of Ephesus\n\nLiving in the last years of the 6th c. and the beginning of\nthe 5th, Xenophanes and Heraclitus continue the Milesian\ninterest in the nature of the physical world, and both offer\ncosmological accounts; yet they go further than the Milesians not only\nthrough their focus on the human subject and the expanded range of\ntheir physical explanations, but by investigating the nature of\ninquiry itself. Both explore the possibility of human understanding\nand question its limits. Recent work on Xenophanes’ epistemology\nand his cosmology has made much of his scientific work clearer and\nmore impressive (Lesher 1992, Mourelatos 2008). He has, to a great\nextent, been rescued from his traditional status as a minor traveling\npoet-sage who railed against the glorification of athletes and made\nsome interesting comments about the relativity of human conceptions of\nthe gods. Instead, he has come to be seen as an original thinker in\nhis own right who influenced later philosophers trying to characterize\nthe realms of the human and the divine, and exploring the possibility\nthat human beings can gain genuine knowledge and wisdom, i.e., are\nable to have a god’s eye view of things and understand them\n(Curd 2013, Mogyoródi 2002 and 2006). \n\nXenophanes claims that all meteorological phenomena are clouds,\ncolored, moving, incandescent: rainbow, St. Elmo’s Fire, the\nsun, the moon. Clouds are fed by exhalations from the land and sea\n(mixtures of earth and water). The motions of earth and water, and\nhence of clouds, account for all the things we find around us. His\nexplanations of meteorological and heavenly phenomena lead to a\nnaturalistic science:\n\n\nShe whom they call Iris, this too is by nature (pephuke)\ncloud\n\npurple, and red, and greeny-yellow to behold. (DK21B32/LM8D39)\n\nXenophanes says that the star-like phenomena seen when aboard ship,\nwhich some call the Dioscuri, are cloudlets, glimmering because of\ntheir kind of motion. (DkA39/LM8D38)\n\n\nIn the 1980’s Alexander Mourelatos argued that Xenophanes\nemploys an important new pattern of explanation: X is really\nY, where Y reveals the true character of X.\nXenophanes signals this by the use of pephuke in\nDK21B32/LM8D39, and no doubt it (or some word like it) was there in\nthe original of DKA39/LMD36 as well. Xenophanes thus provides an\naccount of a phenomenon often taken to be a sign from the\ndivine—Iris as the messenger; the Dioscuri (St. Elmo’s\nfire) as comfort for sailors—that reduces it to a natural\noccurrence. \n\nThat meteorological phenomena are not divine is not all that\nXenophanes has to say about the gods. He notes anthropomorphic\ntendencies in conceptions of the gods (DKB14/LMD12: “Mortals\nsuppose that the gods are born, and have their own dress, voice, and\nbody;” DKB16/LMD13: “Ethiopians say that their gods are\nsnub-nosed and dark, Thracians, that theirs are grey-eyed and\nred-haired”). He also famously suggests that horses, oxen, and\nlions would have equine, bovine, and leonine gods (DKB15/LM14). Yet\nXenophanes also makes positive claims about the nature of the divine,\nincluding the claim that there is a single greatest god:\n\nOne god greatest among gods and men,\n\nResembling mortals neither in body nor in thought.\n\n… whole [he] sees, whole [he] thinks, and whole [he] hears,\n\nbut completely without toil he agitates all things by the\n\n   thought of his mind.\n\n… always he remains in the same (state), agitated not at all,\n\nnor is it fitting that he come and go to different places at different\ntimes. (DK B23, B24, B25, B26 / LM D16, 17, 18, 19)\n\n\nWhile indifferent to the affairs of human beings, Xenophanes’\ndivine being comprehends and controls a cosmos that is infused with\nthinking: it is understood, organized, and managed by divine\nintellection. Having removed the gods as bearers of knowledge to\nhumans, and denied that the divine takes an active interest in what\nmortals can or cannot know, Xenophanes asserts the conclusion to be\ndrawn from his naturalistic interpretation of phenomena: the gods are\nnot going to reveal anything to us; we are epistemologically\nautonomous and must rely on our own capacity for inquiry. That way, we\n“discover better,” as he says in DKB18/LMD53, a fragment\nthat is optimistic about the capacities of human intelligence (see\nLesher 1991):\n\nIndeed not even from the beginning did the gods indicate all things to\nmortals, but, in time, inquiring, they discover better.\n\n\nThis suggests that human thought can mimic divine understanding, at\nleast to some degree. Xenophanes’ own practice seems consistent\nwith the claims of DKB18/LMD53; his own inquiries and explanations led\nhim to unified explanations of terrestrial and celestial phenomena.\nYet DKB34/LMD49 suggests skepticism: \n\nAnd of course the clear and certain truth no man has seen,\n\nnor will there be anyone who knows about the gods and what I say about\nall things;\n\nfor even if, in the best case, he should chance to speak what is the\ncase,\n\nall the same, he himself does not know; but opinion is found over all.\n\n\nWhether this is global or limited skepticism is controversial (Lesher\n1992 and 1994 argues for a limited interpretation). Xenophanes\nstresses the difficulty of coming to certainty, particularly about\nthings beyond our direct experience. Nonetheless, in DKB35/LMD50 (a\ntantalizingly short fragment), Xenophanes says, “Let these thing\nbe accepted to be like the truth” (see Bryan 2012 for a full\ndiscussion).\n\nFamously obscure, accused by Plato of incoherence and by Aristotle of\ndenying the law of non-contradiction, Heraclitus writes in an\naphoristic style. His apparently paradoxical claims present\ndifficulties to any interpreter. Nevertheless, he raises important\nquestions about knowledge and the nature of the world. The opening of\nHeraclitus’ book refers to a “logos which holds\n forever.”[3]\n There is disagreement about exactly what Heraclitus meant by using\nthe term logos, but it is clear from DK22B1/LM9D1, D110, and\nR86 and DKB2/LM9D2 as well as DKB50/LMD46 and other fragments that he\nrefers to an objective law-like principle that governs the cosmos, and\nwhich it is possible (but difficult) for humans to come to understand.\nThere is a single order that directs all things (“all things are\none” DKB50/LMD46); this order is divine, and is sometimes\nconnected by humans with the traditional gods (it is “both\nunwilling and willing to be called by the name of Zeus”\nDKB32/LMD45). Just as Zeus, in the traditional view, controls\neverything from Olympus with a thunderbolt, so this single ordered\nsystem also steers and controls the whole cosmos, but from within. The\nsign of the unchanging order of the eternal system is fire—just\nas fire is always changing and always the same, the logos,\nitself permanent, contains the unchanging account that explains the\nalterations and transformations of the cosmos.\n\nThis plan or order that steers the cosmos is, itself, a rational\norder. This means not only that it is non-capricious and so\nintelligible (in the sense that humans can, at least in principle,\ncome to understand it), it is also an intelligent system: there is an\nintelligent plan at work, if only in the sense of the cosmos working\nitself out in accordance with rational\n principles.[4]\n Consider DKB114/LMD105:\n\nThose who would speak with understanding must ground themselves firmly\nin that which is common to all, just as a city does in its law, and\neven more firmly! For all human laws are nourished by one law, the\ndivine; for it rules as far at it wishes and suffices for all, and is\nstill more than enough.\n\n\nHeraclitus is not only claiming that human prescriptive law must\nharmonize with divine law, but he is also asserting that divine law\nencompasses both the universal laws of the cosmos itself and the\nparticular laws of humans. The cosmos itself is an intelligent,\neternal (and hence divine) system that orders and regulates itself in\nan intelligent way: the logos is the account of this\nself-regulation. We can come to grasp and understand at least part of\nthis divine system. This is not merely because we ourselves are part\nof (contained in) the system, but because we have, through our\ncapacity for intelligent thinking, the power to grasp the system as a\nwhole, through knowing the logos. How this grasping is\nsupposed to work is tantalizingly obscure. \n\nHeraclitus regards the cosmos as an ordered system like a language\nthat can be read or heard and understood by those who are attuned to\nit. That language is not just the physical evidence around us\n(“Eyes and ears are bad witnesses to those with barbarian\nsouls” DKB107/LMD33); the sheer accumulation of information is\nnot the same as wisdom (see the rebuke in DK22B40/LMD20, quoted\nabove). Although the evidence of the senses is important (see\nDKB55/LMD31),\ncareful and thoughtful inquiry is also necessary. Those who are lovers\nof wisdom must be good inquirers into many things (DKB35/LMD40; also\nDKB101/LM36: “I enquired into myself”) and must be able to\ngrasp how the phenomena are signs or evidence of the larger order; as\nHeraclitus notes in DKB123/LMD35, “nature is accustomed to hide\nitself,” and the evidence must be interpreted carefully. That\nevidence is the interplay of opposing states and forces, which\nHeraclitus points to by claims about the unity of opposites and the\nroles of strife in human life as well as in the cosmos. There are\nfragments that proclaim the unity or identity of opposites: the road\nup and down are one and the same (DKB60/LMD51), the path of writing is\nboth straight and crooked (DKB59/LMD52), sea water is very pure and\nvery foul (DKB61/LMD78). The famous river fragments (DKB49a/LMR9;\nDKB12/LMD65a, D102; DKB91a not in LM) question the identity of things\nover time, while a number of fragments point to the relativity of\nvalue judgments (DKB9, B82, B102 / LM D79, D81, D73).\nAnaximander’s orderly arrangement of just reciprocity governed\nby time is replaced by a system ruled by what Heraclitus calls war:\n“It is right to know that war is common and justice strife, and\nthat all things come to be through strife and are so ordained”\n(DKB80/LMD63). This strife or war is the set of changes and\nalterations that constitute the processes of the cosmos. These changes\nare regular and capable of being understood by one who can speak the\nlanguage of the logos and thus interpret it properly (see\nLong 2009). Although the evidence is confusing, it points to the\ndeeper regularities that constitute the cosmos, just as\nHeraclitus’ own remarks can seem obscure yet point to the truth.\nHeraclitus surely has his own message (and his delivery of it) in mind\nin DKB93/LM41, “The lord whose oracle is at Delphi neither\nspeaks nor conceals, but gives a sign.” \n\nOne of the earliest of the Greek philosophers to discuss the human\nsoul, Heraclitus’ claims about it, like his other views, are\nexpressed enigmatically. Yet it seems fairly clear that he treats soul\nas the seat of emotion, movement, and intellect. DKB107/LMD33 (quoted\nabove) indicates that understanding is a function of soul, and in\nDKB117/LMD104, the drunken man who must be led by a boy because he has\nlost control of his legs, and does not know where he goes or what he\ndoes. Drunkenness is the cause of all this: because his soul has\nbecome wet its powers are dampened down and become ineffective.\nDKB118/LMD103 asserts “gleam of light: dry soul, wisest and\nbest” (there is some uncertainty about the text). This suggests\nthat for Heraclitus, soul is a stuff that is affected by changes along\nthe hot/cold and wet/dry continua and that the a fiery, i.e., hotter\nsoul is best. Indeed in DKB36/LMD100, soul is listed as one of the\nstages of transformation of the cosmic stuffs: “it is death to\nsouls to become water, and to water death to become earth; from earth\nwater comes to be, from from water, soul.” Although Heraclitus\nsays that it is only divine nature that has complete understanding\n(DKB78/LMD74), his linking of fire with the logos and the\ndivine, along with his view that the best and wisest soul is hot and\ndry, suggests that humans who care for their souls and search for the\ntruth contained in the\nlogos can overcome human ignorance and approach the\nunderstanding that Heraclitus himself has obtained. (Betegh 2007,\n2009, 2013b and Dilcher 1995 discuss the nature and importance of soul\nfor Heraclitus; see also Granger 2000 and Kahn 1979.)\n",
    "section_title": "3. Xenophanes of Colophon and Heraclitus of Ephesus",
    "entry_title": "Presocratic Philosophy",
    "hierarchy_title": "Presocratic Philosophy || Xenophanes of Colophon and Heraclitus of Ephesus",
    "tokenized_text": [
        "xenophanes",
        "colophon",
        "heraclitus",
        "ephesus",
        "xenophanes",
        "colophon",
        "heraclitus",
        "ephesus",
        "living",
        "last",
        "year",
        "th",
        "c",
        "beginning",
        "th",
        "xenophanes",
        "heraclitus",
        "continue",
        "milesian",
        "interest",
        "nature",
        "physical",
        "world",
        "offer",
        "cosmological",
        "account",
        "yet",
        "go",
        "milesians",
        "focus",
        "human",
        "subject",
        "expanded",
        "range",
        "physical",
        "explanation",
        "investigating",
        "nature",
        "inquiry",
        "explore",
        "possibility",
        "human",
        "understanding",
        "question",
        "limit",
        "recent",
        "work",
        "xenophanes",
        "epistemology",
        "cosmology",
        "made",
        "much",
        "scientific",
        "work",
        "clearer",
        "impressive",
        "lesher",
        "mourelatos",
        "great",
        "extent",
        "rescued",
        "traditional",
        "status",
        "minor",
        "traveling",
        "poetsage",
        "railed",
        "glorification",
        "athlete",
        "made",
        "interesting",
        "comment",
        "relativity",
        "human",
        "conception",
        "god",
        "instead",
        "come",
        "seen",
        "original",
        "thinker",
        "right",
        "influenced",
        "later",
        "philosopher",
        "trying",
        "characterize",
        "realm",
        "human",
        "divine",
        "exploring",
        "possibility",
        "human",
        "being",
        "gain",
        "genuine",
        "knowledge",
        "wisdom",
        "ie",
        "able",
        "god",
        "eye",
        "view",
        "thing",
        "understand",
        "curd",
        "mogyoródi",
        "xenophanes",
        "claim",
        "meteorological",
        "phenomenon",
        "cloud",
        "colored",
        "moving",
        "incandescent",
        "rainbow",
        "st",
        "elmo",
        "fire",
        "sun",
        "moon",
        "cloud",
        "fed",
        "exhalation",
        "land",
        "sea",
        "mixture",
        "earth",
        "water",
        "motion",
        "earth",
        "water",
        "hence",
        "cloud",
        "account",
        "thing",
        "find",
        "around",
        "u",
        "explanation",
        "meteorological",
        "heavenly",
        "phenomenon",
        "lead",
        "naturalistic",
        "science",
        "call",
        "iris",
        "nature",
        "pephuke",
        "cloud",
        "purple",
        "red",
        "greenyyellow",
        "behold",
        "dkblmd",
        "xenophanes",
        "say",
        "starlike",
        "phenomenon",
        "seen",
        "aboard",
        "ship",
        "call",
        "dioscuri",
        "cloudlets",
        "glimmering",
        "kind",
        "motion",
        "dkalmd",
        "alexander",
        "mourelatos",
        "argued",
        "xenophanes",
        "employ",
        "important",
        "new",
        "pattern",
        "explanation",
        "x",
        "really",
        "reveals",
        "true",
        "character",
        "x",
        "xenophanes",
        "signal",
        "use",
        "pephuke",
        "dkblmd",
        "doubt",
        "word",
        "like",
        "original",
        "dkalmd",
        "well",
        "xenophanes",
        "thus",
        "provides",
        "account",
        "phenomenon",
        "often",
        "taken",
        "sign",
        "divineiris",
        "messenger",
        "dioscuri",
        "st",
        "elmo",
        "fire",
        "comfort",
        "sailorsthat",
        "reduces",
        "natural",
        "occurrence",
        "meteorological",
        "phenomenon",
        "divine",
        "xenophanes",
        "say",
        "god",
        "note",
        "anthropomorphic",
        "tendency",
        "conception",
        "god",
        "dkblmd",
        "mortal",
        "suppose",
        "god",
        "born",
        "dress",
        "voice",
        "body",
        "dkblmd",
        "ethiopian",
        "say",
        "god",
        "snubnosed",
        "dark",
        "thracian",
        "greyeyed",
        "redhaired",
        "also",
        "famously",
        "suggests",
        "horse",
        "ox",
        "lion",
        "would",
        "equine",
        "bovine",
        "leonine",
        "god",
        "dkblm",
        "yet",
        "xenophanes",
        "also",
        "make",
        "positive",
        "claim",
        "nature",
        "divine",
        "including",
        "claim",
        "single",
        "greatest",
        "god",
        "one",
        "god",
        "greatest",
        "among",
        "god",
        "men",
        "resembling",
        "mortal",
        "neither",
        "body",
        "thought",
        "whole",
        "see",
        "whole",
        "think",
        "whole",
        "hears",
        "completely",
        "without",
        "toil",
        "agitates",
        "thing",
        "thought",
        "mind",
        "always",
        "remains",
        "state",
        "agitated",
        "fitting",
        "come",
        "go",
        "different",
        "place",
        "different",
        "time",
        "dk",
        "b",
        "b",
        "b",
        "b",
        "lm",
        "d",
        "indifferent",
        "affair",
        "human",
        "being",
        "xenophanes",
        "divine",
        "comprehends",
        "control",
        "cosmos",
        "infused",
        "thinking",
        "understood",
        "organized",
        "managed",
        "divine",
        "intellection",
        "removed",
        "god",
        "bearer",
        "knowledge",
        "human",
        "denied",
        "divine",
        "take",
        "active",
        "interest",
        "mortal",
        "know",
        "xenophanes",
        "asserts",
        "conclusion",
        "drawn",
        "naturalistic",
        "interpretation",
        "phenomenon",
        "god",
        "going",
        "reveal",
        "anything",
        "u",
        "epistemologically",
        "autonomous",
        "must",
        "rely",
        "capacity",
        "inquiry",
        "way",
        "discover",
        "better",
        "say",
        "dkblmd",
        "fragment",
        "optimistic",
        "capacity",
        "human",
        "intelligence",
        "see",
        "lesher",
        "indeed",
        "even",
        "beginning",
        "god",
        "indicate",
        "thing",
        "mortal",
        "time",
        "inquiring",
        "discover",
        "better",
        "suggests",
        "human",
        "thought",
        "mimic",
        "divine",
        "understanding",
        "least",
        "degree",
        "xenophanes",
        "practice",
        "seems",
        "consistent",
        "claim",
        "dkblmd",
        "inquiry",
        "explanation",
        "led",
        "unified",
        "explanation",
        "terrestrial",
        "celestial",
        "phenomenon",
        "yet",
        "dkblmd",
        "suggests",
        "skepticism",
        "course",
        "clear",
        "certain",
        "truth",
        "man",
        "seen",
        "anyone",
        "know",
        "god",
        "say",
        "thing",
        "even",
        "best",
        "case",
        "chance",
        "speak",
        "case",
        "know",
        "opinion",
        "found",
        "whether",
        "global",
        "limited",
        "skepticism",
        "controversial",
        "lesher",
        "argues",
        "limited",
        "interpretation",
        "xenophanes",
        "stress",
        "difficulty",
        "coming",
        "certainty",
        "particularly",
        "thing",
        "beyond",
        "direct",
        "experience",
        "nonetheless",
        "dkblmd",
        "tantalizingly",
        "short",
        "fragment",
        "xenophanes",
        "say",
        "let",
        "thing",
        "accepted",
        "like",
        "truth",
        "see",
        "bryan",
        "full",
        "discussion",
        "famously",
        "obscure",
        "accused",
        "plato",
        "incoherence",
        "aristotle",
        "denying",
        "law",
        "noncontradiction",
        "heraclitus",
        "writes",
        "aphoristic",
        "style",
        "apparently",
        "paradoxical",
        "claim",
        "present",
        "difficulty",
        "interpreter",
        "nevertheless",
        "raise",
        "important",
        "question",
        "knowledge",
        "nature",
        "world",
        "opening",
        "heraclitus",
        "book",
        "refers",
        "logo",
        "hold",
        "forever",
        "disagreement",
        "exactly",
        "heraclitus",
        "meant",
        "using",
        "term",
        "logo",
        "clear",
        "dkblmd",
        "d",
        "r",
        "dkblmd",
        "well",
        "dkblmd",
        "fragment",
        "refers",
        "objective",
        "lawlike",
        "principle",
        "governs",
        "cosmos",
        "possible",
        "difficult",
        "human",
        "come",
        "understand",
        "single",
        "order",
        "directs",
        "thing",
        "thing",
        "one",
        "dkblmd",
        "order",
        "divine",
        "sometimes",
        "connected",
        "human",
        "traditional",
        "god",
        "unwilling",
        "willing",
        "called",
        "name",
        "zeus",
        "dkblmd",
        "zeus",
        "traditional",
        "view",
        "control",
        "everything",
        "olympus",
        "thunderbolt",
        "single",
        "ordered",
        "system",
        "also",
        "steer",
        "control",
        "whole",
        "cosmos",
        "within",
        "sign",
        "unchanging",
        "order",
        "eternal",
        "system",
        "firejust",
        "fire",
        "always",
        "changing",
        "always",
        "logo",
        "permanent",
        "contains",
        "unchanging",
        "account",
        "explains",
        "alteration",
        "transformation",
        "cosmos",
        "plan",
        "order",
        "steer",
        "cosmos",
        "rational",
        "order",
        "mean",
        "noncapricious",
        "intelligible",
        "sense",
        "human",
        "least",
        "principle",
        "come",
        "understand",
        "also",
        "intelligent",
        "system",
        "intelligent",
        "plan",
        "work",
        "sense",
        "cosmos",
        "working",
        "accordance",
        "rational",
        "principle",
        "consider",
        "dkblmd",
        "would",
        "speak",
        "understanding",
        "must",
        "ground",
        "firmly",
        "common",
        "city",
        "law",
        "even",
        "firmly",
        "human",
        "law",
        "nourished",
        "one",
        "law",
        "divine",
        "rule",
        "far",
        "wish",
        "suffices",
        "still",
        "enough",
        "heraclitus",
        "claiming",
        "human",
        "prescriptive",
        "law",
        "must",
        "harmonize",
        "divine",
        "law",
        "also",
        "asserting",
        "divine",
        "law",
        "encompasses",
        "universal",
        "law",
        "cosmos",
        "particular",
        "law",
        "human",
        "cosmos",
        "intelligent",
        "eternal",
        "hence",
        "divine",
        "system",
        "order",
        "regulates",
        "intelligent",
        "way",
        "logo",
        "account",
        "selfregulation",
        "come",
        "grasp",
        "understand",
        "least",
        "part",
        "divine",
        "system",
        "merely",
        "part",
        "contained",
        "system",
        "capacity",
        "intelligent",
        "thinking",
        "power",
        "grasp",
        "system",
        "whole",
        "knowing",
        "logo",
        "grasping",
        "supposed",
        "work",
        "tantalizingly",
        "obscure",
        "heraclitus",
        "regard",
        "cosmos",
        "ordered",
        "system",
        "like",
        "language",
        "read",
        "heard",
        "understood",
        "attuned",
        "language",
        "physical",
        "evidence",
        "around",
        "u",
        "eye",
        "ear",
        "bad",
        "witness",
        "barbarian",
        "soul",
        "dkblmd",
        "sheer",
        "accumulation",
        "information",
        "wisdom",
        "see",
        "rebuke",
        "dkblmd",
        "quoted",
        "although",
        "evidence",
        "sens",
        "important",
        "see",
        "dkblmd",
        "careful",
        "thoughtful",
        "inquiry",
        "also",
        "necessary",
        "lover",
        "wisdom",
        "must",
        "good",
        "inquirer",
        "many",
        "thing",
        "dkblmd",
        "also",
        "dkblm",
        "enquired",
        "must",
        "able",
        "grasp",
        "phenomenon",
        "sign",
        "evidence",
        "larger",
        "order",
        "heraclitus",
        "note",
        "dkblmd",
        "nature",
        "accustomed",
        "hide",
        "evidence",
        "must",
        "interpreted",
        "carefully",
        "evidence",
        "interplay",
        "opposing",
        "state",
        "force",
        "heraclitus",
        "point",
        "claim",
        "unity",
        "opposite",
        "role",
        "strife",
        "human",
        "life",
        "well",
        "cosmos",
        "fragment",
        "proclaim",
        "unity",
        "identity",
        "opposite",
        "road",
        "one",
        "dkblmd",
        "path",
        "writing",
        "straight",
        "crooked",
        "dkblmd",
        "sea",
        "water",
        "pure",
        "foul",
        "dkblmd",
        "famous",
        "river",
        "fragment",
        "dkbalmr",
        "dkblmda",
        "d",
        "dkba",
        "lm",
        "question",
        "identity",
        "thing",
        "time",
        "number",
        "fragment",
        "point",
        "relativity",
        "value",
        "judgment",
        "dkb",
        "b",
        "b",
        "lm",
        "d",
        "d",
        "d",
        "anaximander",
        "orderly",
        "arrangement",
        "reciprocity",
        "governed",
        "time",
        "replaced",
        "system",
        "ruled",
        "heraclitus",
        "call",
        "war",
        "right",
        "know",
        "war",
        "common",
        "justice",
        "strife",
        "thing",
        "come",
        "strife",
        "ordained",
        "dkblmd",
        "strife",
        "war",
        "set",
        "change",
        "alteration",
        "constitute",
        "process",
        "cosmos",
        "change",
        "regular",
        "capable",
        "understood",
        "one",
        "speak",
        "language",
        "logo",
        "thus",
        "interpret",
        "properly",
        "see",
        "long",
        "although",
        "evidence",
        "confusing",
        "point",
        "deeper",
        "regularity",
        "constitute",
        "cosmos",
        "heraclitus",
        "remark",
        "seem",
        "obscure",
        "yet",
        "point",
        "truth",
        "heraclitus",
        "surely",
        "message",
        "delivery",
        "mind",
        "dkblm",
        "lord",
        "whose",
        "oracle",
        "delphi",
        "neither",
        "speaks",
        "conceals",
        "give",
        "sign",
        "one",
        "earliest",
        "greek",
        "philosopher",
        "discus",
        "human",
        "soul",
        "heraclitus",
        "claim",
        "like",
        "view",
        "expressed",
        "enigmatically",
        "yet",
        "seems",
        "fairly",
        "clear",
        "treat",
        "soul",
        "seat",
        "emotion",
        "movement",
        "intellect",
        "dkblmd",
        "quoted",
        "indicates",
        "understanding",
        "function",
        "soul",
        "dkblmd",
        "drunken",
        "man",
        "must",
        "led",
        "boy",
        "lost",
        "control",
        "leg",
        "know",
        "go",
        "drunkenness",
        "cause",
        "soul",
        "become",
        "wet",
        "power",
        "dampened",
        "become",
        "ineffective",
        "dkblmd",
        "asserts",
        "gleam",
        "light",
        "dry",
        "soul",
        "wisest",
        "best",
        "uncertainty",
        "text",
        "suggests",
        "heraclitus",
        "soul",
        "stuff",
        "affected",
        "change",
        "along",
        "hotcold",
        "wetdry",
        "continuum",
        "fiery",
        "ie",
        "hotter",
        "soul",
        "best",
        "indeed",
        "dkblmd",
        "soul",
        "listed",
        "one",
        "stage",
        "transformation",
        "cosmic",
        "stuff",
        "death",
        "soul",
        "become",
        "water",
        "water",
        "death",
        "become",
        "earth",
        "earth",
        "water",
        "come",
        "water",
        "soul",
        "although",
        "heraclitus",
        "say",
        "divine",
        "nature",
        "complete",
        "understanding",
        "dkblmd",
        "linking",
        "fire",
        "logo",
        "divine",
        "along",
        "view",
        "best",
        "wisest",
        "soul",
        "hot",
        "dry",
        "suggests",
        "human",
        "care",
        "soul",
        "search",
        "truth",
        "contained",
        "logo",
        "overcome",
        "human",
        "ignorance",
        "approach",
        "understanding",
        "heraclitus",
        "obtained",
        "betegh",
        "b",
        "dilcher",
        "discus",
        "nature",
        "importance",
        "soul",
        "heraclitus",
        "see",
        "also",
        "granger",
        "kahn"
    ]
}