{
    "main_text": "Pragmatic presupposition\n3. Pragmatic presupposition\n\nProbably the most significant philosophical counterpoint to the\nFrege-Strawson approach to presupposition, other than the original\nnon-presuppositional work of Russell, is due to Stalnaker (1972, 1973,\n1974), and later clarified in Stalnaker\n (1998).[8]\n Stalnaker suggests that a pragmatic notion of presupposition is\nneeded, so that the proper object of philosophical study is not what\nwords or sentences presuppose, but what people presuppose when they\nare speaking. A pragmatic presupposition associated with a sentence is\na condition that a speaker would normally expect to hold in the common\nground between discourse participants when that sentence is\n uttered.[9]\n\nOne consequence of Stalnaker’s view is that, contra semantic\naccounts of presupposition, presupposition failure need not produce a\nsemantic catastrophe. There are, however, two weaker types of failure\nthat can occur: (i) a speaker uttering some sentence\nS can fail to assume that some proposition P is in\nthe common ground, even though most utterances of S would be\naccompanied by the presupposition that P; and (ii) a\nspeaker can presuppose something that is not in the common ground. We\nsee these two types of failure respectively in (15a), where there is\nno presupposition that Mullah Omar is alive, and (15b) where it is\npresupposed that Luke was alive.\n\n(15a)\nI don’t know that Mullah Omar is alive. I don’t know if he’s dead\neither. (General Dan McNeill, Reuters, 19 May 2008)\n(15b)\nVader didn’t know that Luke was alive, so he had no intentions of\nconverting Luke to the Sith. (Web example)\n\n\nThese examples involve a subclass of factive verbs called\n\"semifactives,\" which Karttunen (1971b) concluded only trigger a\npresupposition in some person and tense forms. As Karttunen himself\nrealized, such a stipulation is unmotivated. For Stalnaker’s pragmatic\naccount of presupposition, these examples are not problematic; the\nverb \"know\" need not presuppose that its complement is true. When an\naddressee hears the first sentence of (15a), he will realize that if\nit were in the common ground that Mullah Omar was alive, then the\nspeaker would know this, and so the speaker’s claim would be false.\nTherefore the hearer can reason that the speaker is not presupposing\nthe complement of “know” to be true. On the other hand,\nwhen a hearer is confronted by (15b), it is consistent to assume that\nLuke was alive. Since speakers using “know” typically\npresuppose the truth of the complement, we can assume that this is the\ncase here.\n\nStalnaker’s work was part of an avalanche of pragmatic attacks on the\nsemantic conception of presupposition. Working in the immediate\naftermath of Grice’s 1967 William James \n lectures[10],\n accounts like Atlas (1976; 1977; 1979), Atlas and Levinson (1981),\nKempson (1975), Wilson (1975), and Böer and Lycan (1976) all\npresent detailed arguments that presuppositions should be understood\nas something akin to conversational implicatures. Generally speaking,\nthese approaches justify presuppositional inferences by using the\nmaxims of relevance and quantity. Thus, for example, Atlas (1976)\nsuggests that an embedding of a definite under a negation will tend to\nproduce a meaning that is ruled out as insufficiently strong to\nsatisfy the maxim of quantity, unless it is strengthened by treating\nthe definite as if it had wide scope and could act referentially.\nContemporary descendants of this pragmatic tradition include Abbott\n(2000; 2006; 2008), Simons (2001; 2003; 2004; 2006; 2007), and\nSchlenker (2007; 2008). Both Abbott and Simons are at pains to\ndistinguish between different presupposition triggers, rather than\nlumping them all together. Thus Simons, for example, makes a case for\nderiving presuppositional inferences associated with factives and\naspectual adverbs using a combination of Stalnakerian and Gricean\nreasoning, allowing that typically anaphoric triggers like the\nadditive “too” might function conventionally. On the other\nhand, Schlenker’s pragmatic derivation of projection properties, using\nboth standard maxims and at least one rule specific to\n presuppositions[11],\n does not make fine-grained distinctions between presupposition\ntriggers.\n\nThere is a contrast among pragmatic approaches to presupposition as\nregards whether the source of presuppositions is discussed. The\napproaches mentioned in the preceding paragraph, which attempt to\nderive presuppositional inferences from general conversational\nprinciples, aim to explain both the source of presuppositions, and the\nphenomenon of projection. But Stalnaker made no attempt whatsoever to\nexplain where presuppositions came from, beyond indicating that they\nare inferential tendencies that might or might not be associated with\nsemantic presuppositions. This emphasis on the projection of\npresuppositions rather than their source, which holds also of the\ncontemporaneous work by Karttunen (1974; 1973), to which we shall turn\nshortly, lived on in much of the work influenced by these theories. It\nis particularly obvious in what we can collectively term\ncancellation-based theories of presupposition, led by Gazdar\n(1979a; 1979b), and including Soames (1979; 1982), Mercer (1987;\n1992), Gunji (1981), Marcu (1994), Horton (1987), Horton and Hirst\n(1988), Bridge (1991), and van der Sandt (1982; 1988).\n\nCancellation accounts can be traced back in spirit to Stalnaker’s\naccount of semifactives, discussed above, in which presuppositions are\ndefeated by competing conversational inferences: the general idea is\nsimply to make presuppositions into defaults, and wipe them out\nwhenever they would cause pragmatic embarrassment. Gazdar provided a\nremarkably straightforward formalization of this account, as well as\nextending to many other projection phenomena, based on a general\nprinciple he characterizes as “All the news that fits”. In\nGazdar’s model, the strategy for a hearer is first to identify sets of\nentailments, conversational implicatures, and presuppositions, and\nthen to try adding them to the speaker’s set of commitments.\n\nDefinition 5 (Gazdar: cancellation)\n\nImplicatures and entailments defeat presuppositions, so a hearer adds\nto his or her commitments only those presuppositions that are\ncompatible with both implicatures and entailments. All remaining\npresuppositions are cancelled.\n\n\nConsider (16a), and assume there are no relevant pre-existing\ncommitments:\n\n(16a)\nIf the king is angry, then the knave stole the tarts.\n(16b)\nIf there is a knave, then the knave stole the tarts.\n\n\nAccording to Gazdar, (16a) entails that if there is an angry king then\nthere is a knave and he stole some set of tarts. (This much all\ntheories agree on; some theories may predict stronger entailments.)\nThe set of implicatures would include the clausal implicature that the\nspeaker doesn’t know whether a king is angry, and doesn’t know whether\na knave stole tarts. The presuppositions (or “potential\npresuppositions”, in Gazdar’s terms) are that there is a unique\nking, a unique knave, and a unique set of tarts. The hearer proceeds\nby adding the entailments to (their representation of) the speaker’s\ncommitment set, then adding whatever implicatures fit in, and then\nadding the presuppositions that fit after that. In this case, all the\nentailments, implicatures, and presuppositions are consistent, and all\ncan be added without any being cancelled.\n\nBut now consider (16b), repeated from (12). Here there is an\nimplicature that the speaker doesn’t know whether there is a knave.\nThe hearer accepts this and other implicatures, and then considers the\npresuppositions that there is a knave and that there are some tarts.\nThe presupposition that there are tarts is unproblematic, and is\nadded, but the hearer cannot consistently add the presupposition that\nthere is a knave. So this presupposition is canceled, and (16b) does\nnot presuppose that there is a knave. Hence, according to Gazdar,\npresuppositions are sometimes blocked by conversational\nimplicatures.\n\nWithin the space of cancellation-based accounts of presupposition, it\nis hard to beat Gazdar’s for its conceptual and technical simplicity,\nand its empirical coverage. Some conceptual questions remain, however,\nsuch as why it should be that presuppositions are the last\nthings to be added in the process of updating commitments. Van der\nSandt’s (1982, 1988) reformulation of the cancellation model gives us\nan alternative way to think about this, by modeling projection in\nterms of whether presuppositions could have come first.\n\nDefinition 6 (Van der Sandt: cancellation)\n\nProject only those presuppositions that could be conjoined to the\nbeginning of the sentence while leaving the utterance consistent with\n(neo-Gricean) conversational\n principles.[12]\n\n\nThe intuitive idea underlying van der Sandt’s proposal is that\npresuppositions are given information, and in this sense\n“precede” their carrier sentences, if not de\nfacto then at least de jure, in the sense that the\ncontext would have legitimated their presence. In the case of (16),\nfronting the presupposition that there are some tarts yields the\nsentences in (17).\n\n(17a)\nThere are some tarts and if the king is angry then the knave stole\nthe tarts.\n(17b)\nThere are some tarts and if there is a knave, then the knave stole\nthe tarts.\n\n\nThe fronting of the presupposition does not lead to a clash with any\nGricean principles, so the presuppositions are predicted to project in\n(16a) and (16b). Similarly, fronting the presupposition that there is\na knave to (16a), as in (18a), produces no clash, so (16a) presupposes\nthat there is a knave. But adding the presupposition that there is a\nknave to (16b), as in (18b), does result in a clash: since (18b) is\ntruth-conditionally equivalent to the simple conjunction “there\nis a knave and the knave stole the tarts”, it is redundant,\nconflicting with the requirement of brevity in Grice’s Maxim of\nManner. On van der Sandt’s analysis, if fronting a presupposition\nwould produce a redundant result, then that presupposition cannot\nproject. So (16b) is correctly predicted not to presuppose that there\nis a knave.\n\n(18a)\nThere is a knave and if the king is angry then the knave stole the\ntarts.\n(18b)\nThere is a knave and if there is a knave, then the knave stole the\ntarts.\n\n\nIt should be noted, however, that even if (18b) is redundant, it is\narguably a felicitous discourse, and therefore some subtlety is needed\nin applying van der Sandt’s cancellation principle in the simplified\nform above. The issue is not simply whether a discourse is felicitous,\nbut whether there is any clash with the maxims. And this will of\ncourse depend on how exactly the maxims are formulated. But for the\npurposes of understanding the intention of van der Sandt’s analysis,\nwe can take it that though an utterance of (18b) could be felicitous,\nit would be a case of flouting (in Grice’s sense), a case\nwhere a maxim is disobeyed in order to preserve some greater\nconversational goal.\n\nA more recent pragmatic approach situates presuppositions in a wider\ntaxonomy of projective content based on the property of\nat-issueness. Once we’ve identified the QUD, we can identify\ncontent that is meant to be relevant towards answering it. In other\nwords, content that is at-issue. Simons et al (2010) propose that\nthis pragmatic property is relevant to projection such that only\nnot-at-issue content projects.\n\nDefinition 7 (Cancellation via at-issueness)\n\nProject only those presuppositions that are not-at-issue.\n\nConsider examples (19) and (20) from Beaver (2010). These examples\ninvolve the factive verb \"discover\", and hence are expected to trigger\na presupposition that its complement is true, i.e. that the\naddressee’s work is plagiarized. In (19), where \"discover\" is\nstressed, this presupposition seems to project, with the implication\nthat, absent the T.A. finding out what’s going on, the speaker is\nprepared to overlook the plagiarism. In this case, we might say that\nwhat is at-issue is the question of whether the T.A. finds out about\nthe plagiarism. However, in (20), where stress in on \"plagiarized\", it\nis far less clear whether the speaker believes the addressee’s work is\nplagiarized. This can be explained if stress on \"plagiarized\" is\nmarking the proposition that the work is plagiarized as at-issue. So,\nthe generalization in Definition 7 predicts that this proposition does\nnot project.\n\n(19)\nIf the T.A. disCOVers that your work is plagiarized, I will be\nforced to notify the Dean.\n(20)\nIf the T.A. discovers that your work is PLAgiarized, I will be\nforced to notify the Dean.\n\n\nPragmatic approaches to presupposition take the burden of projection\noff conventional triggering and allow for discourse structure to\ninfluence projection when triggers are placed in different contexts.\nOne consequence of this view is that it can be applied\ncross-lingustically (e.g. Tonhauser et al 2013) without running into\nthe issue of language-specific conventionalized triggers. Additionally\nit allows us to account for the projection of expressions that don’t\ndisplay other properties that we associate with presupposition, for\nexample appositives, expressives and honorifics (Potts 2005). In other\nwords, there’s a reason why some things that aren’t presuppositions\nstill behave like them.\n\nA new trend of psycholinguistic research potentially offers some\npromising new evidence about the degree to which presuppositions are\nprocessed like pragmatic inferences or semantic entailments. The\nmethods in these studies typically rely on identifying at what point\nduring the processing of an utterance presuppositions become available\nto the listener. The line of reasoning goes like this: if\npresuppositions are conventionally encoded in their triggers and are\nconditions for contexts to update, they should arise immediately when\na trigger is used. However, if presuppositions are the result of\npragmatic reasoning, there should be a delay in their processing.\nWhile the results of these studies have been somewhat inconsistent,\nthey largely suggest that presuppositions are processed immediately.\nFor example, one of the experiments in Tiemann et al. (2011) finds\nthat presupposition triggers themselves carry a processing cost\nrelative to other non-presuppositional expressions. In an eye-tracking\nstudy, Kim (2008) finds that there are shifts in eye movements quite\nrapidly after the utterance of the trigger only. These\nstudies and the methodologies used in them are still relatively\nnew. However, empirical work on the processing of presuppositions\nremains a promising strand of research in determining the extent to\nwhich we can consider presuppositions to be conventional\n",
    "section_title": "3. Pragmatic presupposition",
    "entry_title": "Presupposition",
    "hierarchy_title": "Presupposition || Pragmatic presupposition",
    "tokenized_text": [
        "pragmatic",
        "presupposition",
        "pragmatic",
        "presupposition",
        "probably",
        "significant",
        "philosophical",
        "counterpoint",
        "fregestrawson",
        "approach",
        "presupposition",
        "original",
        "nonpresuppositional",
        "work",
        "russell",
        "due",
        "stalnaker",
        "later",
        "clarified",
        "stalnaker",
        "stalnaker",
        "suggests",
        "pragmatic",
        "notion",
        "presupposition",
        "needed",
        "proper",
        "object",
        "philosophical",
        "study",
        "word",
        "sentence",
        "presuppose",
        "people",
        "presuppose",
        "speaking",
        "pragmatic",
        "presupposition",
        "associated",
        "sentence",
        "condition",
        "speaker",
        "would",
        "normally",
        "expect",
        "hold",
        "common",
        "ground",
        "discourse",
        "participant",
        "sentence",
        "uttered",
        "one",
        "consequence",
        "stalnaker",
        "view",
        "contra",
        "semantic",
        "account",
        "presupposition",
        "presupposition",
        "failure",
        "need",
        "produce",
        "semantic",
        "catastrophe",
        "however",
        "two",
        "weaker",
        "type",
        "failure",
        "occur",
        "speaker",
        "uttering",
        "sentence",
        "fail",
        "assume",
        "proposition",
        "p",
        "common",
        "ground",
        "even",
        "though",
        "utterance",
        "would",
        "accompanied",
        "presupposition",
        "p",
        "ii",
        "speaker",
        "presuppose",
        "something",
        "common",
        "ground",
        "see",
        "two",
        "type",
        "failure",
        "respectively",
        "a",
        "presupposition",
        "mullah",
        "omar",
        "alive",
        "b",
        "presupposed",
        "luke",
        "alive",
        "a",
        "know",
        "mullah",
        "omar",
        "alive",
        "know",
        "dead",
        "either",
        "general",
        "dan",
        "mcneill",
        "reuters",
        "may",
        "b",
        "vader",
        "know",
        "luke",
        "alive",
        "intention",
        "converting",
        "luke",
        "sith",
        "web",
        "example",
        "example",
        "involve",
        "subclass",
        "factive",
        "verb",
        "called",
        "semifactives",
        "karttunen",
        "b",
        "concluded",
        "trigger",
        "presupposition",
        "person",
        "tense",
        "form",
        "karttunen",
        "realized",
        "stipulation",
        "unmotivated",
        "stalnaker",
        "pragmatic",
        "account",
        "presupposition",
        "example",
        "problematic",
        "verb",
        "know",
        "need",
        "presuppose",
        "complement",
        "true",
        "addressee",
        "hears",
        "first",
        "sentence",
        "a",
        "realize",
        "common",
        "ground",
        "mullah",
        "omar",
        "alive",
        "speaker",
        "would",
        "know",
        "speaker",
        "claim",
        "would",
        "false",
        "therefore",
        "hearer",
        "reason",
        "speaker",
        "presupposing",
        "complement",
        "know",
        "true",
        "hand",
        "hearer",
        "confronted",
        "b",
        "consistent",
        "assume",
        "luke",
        "alive",
        "since",
        "speaker",
        "using",
        "know",
        "typically",
        "presuppose",
        "truth",
        "complement",
        "assume",
        "case",
        "stalnaker",
        "work",
        "part",
        "avalanche",
        "pragmatic",
        "attack",
        "semantic",
        "conception",
        "presupposition",
        "working",
        "immediate",
        "aftermath",
        "grice",
        "william",
        "james",
        "lecture",
        "account",
        "like",
        "atlas",
        "atlas",
        "levinson",
        "kempson",
        "wilson",
        "böer",
        "lycan",
        "present",
        "detailed",
        "argument",
        "presupposition",
        "understood",
        "something",
        "akin",
        "conversational",
        "implicatures",
        "generally",
        "speaking",
        "approach",
        "justify",
        "presuppositional",
        "inference",
        "using",
        "maxim",
        "relevance",
        "quantity",
        "thus",
        "example",
        "atlas",
        "suggests",
        "embedding",
        "definite",
        "negation",
        "tend",
        "produce",
        "meaning",
        "ruled",
        "insufficiently",
        "strong",
        "satisfy",
        "maxim",
        "quantity",
        "unless",
        "strengthened",
        "treating",
        "definite",
        "wide",
        "scope",
        "could",
        "act",
        "referentially",
        "contemporary",
        "descendant",
        "pragmatic",
        "tradition",
        "include",
        "abbott",
        "simon",
        "schlenker",
        "abbott",
        "simon",
        "pain",
        "distinguish",
        "different",
        "presupposition",
        "trigger",
        "rather",
        "lumping",
        "together",
        "thus",
        "simon",
        "example",
        "make",
        "case",
        "deriving",
        "presuppositional",
        "inference",
        "associated",
        "factives",
        "aspectual",
        "adverb",
        "using",
        "combination",
        "stalnakerian",
        "gricean",
        "reasoning",
        "allowing",
        "typically",
        "anaphoric",
        "trigger",
        "like",
        "additive",
        "might",
        "function",
        "conventionally",
        "hand",
        "schlenker",
        "pragmatic",
        "derivation",
        "projection",
        "property",
        "using",
        "standard",
        "maxim",
        "least",
        "one",
        "rule",
        "specific",
        "presupposition",
        "make",
        "finegrained",
        "distinction",
        "presupposition",
        "trigger",
        "contrast",
        "among",
        "pragmatic",
        "approach",
        "presupposition",
        "regard",
        "whether",
        "source",
        "presupposition",
        "discussed",
        "approach",
        "mentioned",
        "preceding",
        "paragraph",
        "attempt",
        "derive",
        "presuppositional",
        "inference",
        "general",
        "conversational",
        "principle",
        "aim",
        "explain",
        "source",
        "presupposition",
        "phenomenon",
        "projection",
        "stalnaker",
        "made",
        "attempt",
        "whatsoever",
        "explain",
        "presupposition",
        "came",
        "beyond",
        "indicating",
        "inferential",
        "tendency",
        "might",
        "might",
        "associated",
        "semantic",
        "presupposition",
        "emphasis",
        "projection",
        "presupposition",
        "rather",
        "source",
        "hold",
        "also",
        "contemporaneous",
        "work",
        "karttunen",
        "shall",
        "turn",
        "shortly",
        "lived",
        "much",
        "work",
        "influenced",
        "theory",
        "particularly",
        "obvious",
        "collectively",
        "term",
        "cancellationbased",
        "theory",
        "presupposition",
        "led",
        "gazdar",
        "a",
        "b",
        "including",
        "soames",
        "mercer",
        "gunji",
        "marcu",
        "horton",
        "horton",
        "hirst",
        "bridge",
        "van",
        "der",
        "sandt",
        "cancellation",
        "account",
        "traced",
        "back",
        "spirit",
        "stalnaker",
        "account",
        "semifactives",
        "discussed",
        "presupposition",
        "defeated",
        "competing",
        "conversational",
        "inference",
        "general",
        "idea",
        "simply",
        "make",
        "presupposition",
        "default",
        "wipe",
        "whenever",
        "would",
        "cause",
        "pragmatic",
        "embarrassment",
        "gazdar",
        "provided",
        "remarkably",
        "straightforward",
        "formalization",
        "account",
        "well",
        "extending",
        "many",
        "projection",
        "phenomenon",
        "based",
        "general",
        "principle",
        "characterizes",
        "news",
        "fit",
        "gazdar",
        "model",
        "strategy",
        "hearer",
        "first",
        "identify",
        "set",
        "entailment",
        "conversational",
        "implicatures",
        "presupposition",
        "try",
        "adding",
        "speaker",
        "set",
        "commitment",
        "definition",
        "gazdar",
        "cancellation",
        "implicatures",
        "entailment",
        "defeat",
        "presupposition",
        "hearer",
        "add",
        "commitment",
        "presupposition",
        "compatible",
        "implicatures",
        "entailment",
        "remaining",
        "presupposition",
        "cancelled",
        "consider",
        "a",
        "assume",
        "relevant",
        "preexisting",
        "commitment",
        "a",
        "king",
        "angry",
        "knave",
        "stole",
        "tart",
        "b",
        "knave",
        "knave",
        "stole",
        "tart",
        "according",
        "gazdar",
        "a",
        "entail",
        "angry",
        "king",
        "knave",
        "stole",
        "set",
        "tart",
        "much",
        "theory",
        "agree",
        "theory",
        "may",
        "predict",
        "stronger",
        "entailment",
        "set",
        "implicatures",
        "would",
        "include",
        "clausal",
        "implicature",
        "speaker",
        "know",
        "whether",
        "king",
        "angry",
        "know",
        "whether",
        "knave",
        "stole",
        "tart",
        "presupposition",
        "potential",
        "presupposition",
        "gazdar",
        "term",
        "unique",
        "king",
        "unique",
        "knave",
        "unique",
        "set",
        "tart",
        "hearer",
        "proceeds",
        "adding",
        "entailment",
        "representation",
        "speaker",
        "commitment",
        "set",
        "adding",
        "whatever",
        "implicatures",
        "fit",
        "adding",
        "presupposition",
        "fit",
        "case",
        "entailment",
        "implicatures",
        "presupposition",
        "consistent",
        "added",
        "without",
        "cancelled",
        "consider",
        "b",
        "repeated",
        "implicature",
        "speaker",
        "know",
        "whether",
        "knave",
        "hearer",
        "accepts",
        "implicatures",
        "considers",
        "presupposition",
        "knave",
        "tart",
        "presupposition",
        "tart",
        "unproblematic",
        "added",
        "hearer",
        "consistently",
        "add",
        "presupposition",
        "knave",
        "presupposition",
        "canceled",
        "b",
        "presuppose",
        "knave",
        "hence",
        "according",
        "gazdar",
        "presupposition",
        "sometimes",
        "blocked",
        "conversational",
        "implicatures",
        "within",
        "space",
        "cancellationbased",
        "account",
        "presupposition",
        "hard",
        "beat",
        "gazdar",
        "conceptual",
        "technical",
        "simplicity",
        "empirical",
        "coverage",
        "conceptual",
        "question",
        "remain",
        "however",
        "presupposition",
        "last",
        "thing",
        "added",
        "process",
        "updating",
        "commitment",
        "van",
        "der",
        "sandt",
        "reformulation",
        "cancellation",
        "model",
        "give",
        "u",
        "alternative",
        "way",
        "think",
        "modeling",
        "projection",
        "term",
        "whether",
        "presupposition",
        "could",
        "come",
        "first",
        "definition",
        "van",
        "der",
        "sandt",
        "cancellation",
        "project",
        "presupposition",
        "could",
        "conjoined",
        "beginning",
        "sentence",
        "leaving",
        "utterance",
        "consistent",
        "neogricean",
        "conversational",
        "principle",
        "intuitive",
        "idea",
        "underlying",
        "van",
        "der",
        "sandt",
        "proposal",
        "presupposition",
        "given",
        "information",
        "sense",
        "precede",
        "carrier",
        "sentence",
        "de",
        "facto",
        "least",
        "de",
        "jure",
        "sense",
        "context",
        "would",
        "legitimated",
        "presence",
        "case",
        "fronting",
        "presupposition",
        "tart",
        "yield",
        "sentence",
        "a",
        "tart",
        "king",
        "angry",
        "knave",
        "stole",
        "tart",
        "b",
        "tart",
        "knave",
        "knave",
        "stole",
        "tart",
        "fronting",
        "presupposition",
        "lead",
        "clash",
        "gricean",
        "principle",
        "presupposition",
        "predicted",
        "project",
        "a",
        "b",
        "similarly",
        "fronting",
        "presupposition",
        "knave",
        "a",
        "a",
        "produce",
        "clash",
        "a",
        "presupposes",
        "knave",
        "adding",
        "presupposition",
        "knave",
        "b",
        "b",
        "result",
        "clash",
        "since",
        "b",
        "truthconditionally",
        "equivalent",
        "simple",
        "conjunction",
        "knave",
        "knave",
        "stole",
        "tart",
        "redundant",
        "conflicting",
        "requirement",
        "brevity",
        "grice",
        "maxim",
        "manner",
        "van",
        "der",
        "sandt",
        "analysis",
        "fronting",
        "presupposition",
        "would",
        "produce",
        "redundant",
        "result",
        "presupposition",
        "project",
        "b",
        "correctly",
        "predicted",
        "presuppose",
        "knave",
        "a",
        "knave",
        "king",
        "angry",
        "knave",
        "stole",
        "tart",
        "b",
        "knave",
        "knave",
        "knave",
        "stole",
        "tart",
        "noted",
        "however",
        "even",
        "b",
        "redundant",
        "arguably",
        "felicitous",
        "discourse",
        "therefore",
        "subtlety",
        "needed",
        "applying",
        "van",
        "der",
        "sandt",
        "cancellation",
        "principle",
        "simplified",
        "form",
        "issue",
        "simply",
        "whether",
        "discourse",
        "felicitous",
        "whether",
        "clash",
        "maxim",
        "course",
        "depend",
        "exactly",
        "maxim",
        "formulated",
        "purpose",
        "understanding",
        "intention",
        "van",
        "der",
        "sandt",
        "analysis",
        "take",
        "though",
        "utterance",
        "b",
        "could",
        "felicitous",
        "would",
        "case",
        "flouting",
        "grice",
        "sense",
        "case",
        "maxim",
        "disobeyed",
        "order",
        "preserve",
        "greater",
        "conversational",
        "goal",
        "recent",
        "pragmatic",
        "approach",
        "situates",
        "presupposition",
        "wider",
        "taxonomy",
        "projective",
        "content",
        "based",
        "property",
        "atissueness",
        "identified",
        "qud",
        "identify",
        "content",
        "meant",
        "relevant",
        "towards",
        "answering",
        "word",
        "content",
        "atissue",
        "simon",
        "et",
        "al",
        "propose",
        "pragmatic",
        "property",
        "relevant",
        "projection",
        "notatissue",
        "content",
        "project",
        "definition",
        "cancellation",
        "via",
        "atissueness",
        "project",
        "presupposition",
        "notatissue",
        "consider",
        "example",
        "beaver",
        "example",
        "involve",
        "factive",
        "verb",
        "discover",
        "hence",
        "expected",
        "trigger",
        "presupposition",
        "complement",
        "true",
        "ie",
        "addressee",
        "work",
        "plagiarized",
        "discover",
        "stressed",
        "presupposition",
        "seems",
        "project",
        "implication",
        "absent",
        "ta",
        "finding",
        "going",
        "speaker",
        "prepared",
        "overlook",
        "plagiarism",
        "case",
        "might",
        "say",
        "atissue",
        "question",
        "whether",
        "ta",
        "find",
        "plagiarism",
        "however",
        "stress",
        "plagiarized",
        "far",
        "le",
        "clear",
        "whether",
        "speaker",
        "belief",
        "addressee",
        "work",
        "plagiarized",
        "explained",
        "stress",
        "plagiarized",
        "marking",
        "proposition",
        "work",
        "plagiarized",
        "atissue",
        "generalization",
        "definition",
        "predicts",
        "proposition",
        "project",
        "ta",
        "discovers",
        "work",
        "plagiarized",
        "forced",
        "notify",
        "dean",
        "ta",
        "discovers",
        "work",
        "plagiarized",
        "forced",
        "notify",
        "dean",
        "pragmatic",
        "approach",
        "presupposition",
        "take",
        "burden",
        "projection",
        "conventional",
        "triggering",
        "allow",
        "discourse",
        "structure",
        "influence",
        "projection",
        "trigger",
        "placed",
        "different",
        "context",
        "one",
        "consequence",
        "view",
        "applied",
        "crosslingustically",
        "eg",
        "tonhauser",
        "et",
        "al",
        "without",
        "running",
        "issue",
        "languagespecific",
        "conventionalized",
        "trigger",
        "additionally",
        "allows",
        "u",
        "account",
        "projection",
        "expression",
        "display",
        "property",
        "associate",
        "presupposition",
        "example",
        "appositives",
        "expressives",
        "honorific",
        "potts",
        "word",
        "reason",
        "thing",
        "presupposition",
        "still",
        "behave",
        "like",
        "new",
        "trend",
        "psycholinguistic",
        "research",
        "potentially",
        "offer",
        "promising",
        "new",
        "evidence",
        "degree",
        "presupposition",
        "processed",
        "like",
        "pragmatic",
        "inference",
        "semantic",
        "entailment",
        "method",
        "study",
        "typically",
        "rely",
        "identifying",
        "point",
        "processing",
        "utterance",
        "presupposition",
        "become",
        "available",
        "listener",
        "line",
        "reasoning",
        "go",
        "like",
        "presupposition",
        "conventionally",
        "encoded",
        "trigger",
        "condition",
        "context",
        "update",
        "arise",
        "immediately",
        "trigger",
        "used",
        "however",
        "presupposition",
        "result",
        "pragmatic",
        "reasoning",
        "delay",
        "processing",
        "result",
        "study",
        "somewhat",
        "inconsistent",
        "largely",
        "suggest",
        "presupposition",
        "processed",
        "immediately",
        "example",
        "one",
        "experiment",
        "tiemann",
        "et",
        "al",
        "find",
        "presupposition",
        "trigger",
        "carry",
        "processing",
        "cost",
        "relative",
        "nonpresuppositional",
        "expression",
        "eyetracking",
        "study",
        "kim",
        "find",
        "shift",
        "eye",
        "movement",
        "quite",
        "rapidly",
        "utterance",
        "trigger",
        "study",
        "methodology",
        "used",
        "still",
        "relatively",
        "new",
        "however",
        "empirical",
        "work",
        "processing",
        "presupposition",
        "remains",
        "promising",
        "strand",
        "research",
        "determining",
        "extent",
        "consider",
        "presupposition",
        "conventional"
    ]
}