{
    "main_text": "The Milesians\n2. The Milesians\n\nIn his account of his predecessors’ searches for “causes\nand principles” of the natural world and natural phenomena,\nAristotle says that Thales of Miletus (a city in Ionia, on the west\ncoast of what is now Turkey) was the first to engage in such inquiry.\nHe seems to have lived around the beginning of the 6th c.\nBCE. Aristotle mentions that some people, before Thales, placed great\nimportance on water, but he credits Thales with declaring water to be\nthe first cause (Metaphysics 983b27–33), and he then\nlater raises the question of whether perhaps Hesiod was the first to\nlook for a cause of motion and change (984b23ff.). These suggestions\nare rhetorical: Aristotle does not seriously imply that those he\nmentions are engaged in the same sort of inquiry as he thinks Thales\nwas. Two other Greek thinkers from this very early period, Anaximander\nand Anaximenes, were also from Miletus, and although the ancient\ntradition that the three were related as master and pupil may not be\ncorrect, there are enough fundamental similarities in their views to\njustify treating them together. \n\nThe tradition claims that Thales predicted a solar eclipse in 585 BC\n(DK 11A5/LM 5P9, P10), introduced geometry into Greece from Egypt (DK\n11A11/LM 5P4, P5, R11), and produced some engineering marvels.\nAnaximander is reported to have invented the gnomon (the raised piece\nof a sundial whose shadow marks time); to have created a sphere of the\nheavens serving as an astronomical and cosmological model (DK 12A1/LM\n6P2, P4, P11); and to have been the first to draw a map of the\ninhabited world (DK 12A6/LM 6P6, D4). Regardless of whether these\nreports are correct (and in the case of Thales’ prediction they\nalmost certainly are not), they indicate something important about the\nMilesians: their interests in measuring and explaining celestial and\nterrestrial phenomena were as strong as their concern with the more\nabstract inquiries into the causes and principles of substance and\nchange attributed to them by Aristotle (Algra 1999, White 2002 and\n2008). They did not see so-called “scientific” and\n“philosophical” questions as belonging to separate\ndisciplines, requiring distinct methods of inquiry. The assumptions\nand principles that we (along with Aristotle) see as constituting the\nphilosophical foundations of their theories are, for the most part,\nimplicit in the claims that they make. Nevertheless, it is legitimate\nto treat the Milesians as having philosophical views, even though no\nclear statements of these views or specific arguments for them can be\nfound in the surviving fragments and testimonia. \n\nAristotle’s comments do not sound as if they were based on\nfirst-hand knowledge of Thales’ views, and the doxographical\nreports say that Thales did not write a book. Yet Aristotle is\nconfident that Thales belongs, even if honorifically, to that group of\nthinkers that he calls “inquirers into nature” and\ndistinguishes him from earlier poetical “myth-makers.” In\nBook I of Metaphysics, Aristotle claims that the earliest\nof these, among whom he places the Milesians, explained things only in\nterms of their matter (Met. I.3 983b6–18). This claim\nis anachronistic in that it presupposes Aristotle’s own novel\nview that a complete explanation must encompass four factors: what he\ncalled the material, efficient, formal, and final causes. Yet there is\nsomething in what Aristotle says. Aristotle links Thales’ claim\nthat the world rests on water with the view that water was the\narchē, or fundamental principle, and he adds that\n“that from which they come to be is a principle of all\nthings” (983b24–25; DK 11A12/LM 5D3, R9). He suggests that\nThales chose water because of its fundamental role in coming-to-be,\nnutrition, and growth, and claims that water is the origin of the\nnature of moist things. \n\nAristotle’s general assertion about the first thinkers who gave\naccounts of nature (and his specific discussion of Thales’\nreliance on water as a first principle) brings out a difficulty in\ninterpreting the early Presocratics. According to Aristotle’s\ngeneral account, the Presocratics claimed that there was a single\nenduring material stuff that is both the origin of all things and\ntheir continuing nature. Thus, on this view, when Thales says that the\nfirst principle is water, he should be understood as claiming both\nthat the original state of things was water and that even now (despite\nappearances), everything is really water in some state or another. The\nchange from the original state to the present one involves changes in\nthe material stuff such that although it may not now appear to be\nwater everywhere (but seems to be airier or earthier than water in its\nusual state, or its original one), there is no transformation of water\ninto a different kind of stuff (air or earth, for instance). Yet, when\nAristotle comes to give what details he can of Thales’ view, he\nsuggests only that for Thales, water was the first principle because\neverything comes from water. Water, then, was perhaps the original\nstate of things for Thales, and water is a necessary condition for\neverything that is generated naturally, but Aristotle’s summary\nof Thales’ view does not imply that Thales claimed that water\nendures through whatever changes have occurred since the original\nstate, and now just has some new or additional properties. Thales may\nwell have thought that certain characteristics of the original water\npersisted: in particular its capacity for motion (which must have been\ninnate in order to generate the changes from the original state). This\nis suggested by Thales’ reported claims that the lodestone (with\nits magnetic properties) and amber (which when rubbed exhibits powers\nof attraction through static electricity) have souls and that all\nthings are full of gods. Aristotle surmises that Thales identified\nsoul (that which makes a thing alive and thus capable of motion) with\nsomething in the whole universe, and so supposed that everything was\nfull of gods (DK11A22/LM5D10, D11a )—water, or soul, being a\ndivine natural principle. Certainly the claim that the lodestone has\nsoul suggests this account. Given that the analysis of change (both\nqualitative and substantial) in terms of a substratum that gains and\nloses properties is Aristotelian (although perhaps foreshadowed in\nPlato), it is not surprising that the earlier views were unclear on\nthis issue, and it is probable that the Milesian view did not clearly\ndistinguish the notions of an original matter and an enduring\nunderlying stuff (Graham 2006). \n\nThe reports about Thales show him employing a certain kind of\nexplanation: ultimately the explanation of why things are as they are\nis grounded in water as the basic stuff of the universe and the\nchanges that it undergoes through its own inherent nature. In this,\nThales marks a radical change from all other previous sorts of\naccounts of the world (both Greek and non-Greek). Like the other\nPresocratics, Thales sees nature as a complete and self-ordering\nsystem, and sees no reason to call on divine intervention from outside\nthe natural world to supplement his account—water itself may be\ndivine, but it is not something that intervenes in the natural world\nfrom outside (Gregory, 2013). While the evidence for Thales’\nnaturalistic account is circumstantial, this attitude can be directly\nverified for Anaximander. \n\nIn the one fragment that can be securely attributed to Anaximander\n(although the extent of the implied quotation is uncertain), he\nemphasizes the orderly nature of the universe, and indicates that the\norder is internal rather than imposed from outside. Simplicius, a\n6th c. CE commentator on Aristotle’s\nPhysics, writes: \n\nOf those who say that [the first principle] is one and moving and\nindefinite, Anaximander, son of Praxiades, a Milesian who became\nsuccessor and pupil to Thales, said that the indefinite (to\napeiron) is both principle (archē) and element\n(stoicheion) of the things that are, and he was the first to\nintroduce this name of the principle. He says that it is neither water\nnor any other of the so-called elements, but some other indefinite\n(apeiron) nature, from which come to be all the heavens and\nthe worlds in them; and those things, from which there is coming-to-be\nfor the things that are, are also those into which is their\npassing-away, in accordance with what must be. For they give penalty\n(dikê) and recompense to one another for their\ninjustice (adikia) in accordance with the ordering of\ntime—speaking of them in rather poetical terms. It is clear that\nhaving seen the change of the four elements into each other, he did\nnot think it fit to make some one of these underlying subject, but\nsomething else, apart from these. (Simplicius, Commentary on\nAristotle’s Physics 24, lines 13ff. = DK12A9/LM6P5, D6, D12\nand\n DKB1/LM6D6)[1]\n\n\nThus, there is an original (and originating) indefinite stuff, from\nwhich all the heavens and the worlds in them come to be. This claim\nprobably means that the original state of the universe was an\nindefinitely large mass of stuff that was also indefinite in its\n character.[2]\n This stuff then gave rise through its own inherent power to the\ningredients that themselves constitute the world as we perceive it.\n\n\nA testimony about Anaximander from Pseudo-Plutarch (DK12A10/LM6P6, D4)\nsays that “Something productive of hot and cold was separated\noff from the eternal at the genesis of this world and from this a\nsphere of flame grew around the air around the earth like the bark\naround a tree.” Neither the cause nor the precise process of\nseparation is explained, but it is probable that Anaximander would\nhave thought of motion as innate and so that the original source of\nchange was part of the character of the indefinite itself. The passage\nfrom Simplicius shows that Anaximander does not think that the eternal\nindefinite stuff gives rise directly to the cosmos as we know it.\nRather, relying on a semi-biological model, Anaximander claims that\nthe apeiron somehow generates the opposites hot and cold. Hot\nand cold are themselves stuffs with powers; and it is the actions of\nthese stuffs/powers that produce the things that come to be in our\nworld. The opposites act on, dominate, and contain each other,\nproducing a regulated structure; thus things pass away into those\nthings from which they came to be. It is this structured arrangement\nthat Anaximander refers to when he speaks of justice and reparation.\nOver the course of time, the cycles of the seasons, the rotations of\nthe heavens, and other sorts of cyclical change (including\ncoming-to-be and passing-away) are regulated and thus form a system.\nThis system, ruled by the justice of the ordering of time is in sharp\ncontrast with the chaotic and capricious world of the personified\nGreek gods who interfere in the workings of the heavens and in the\naffairs of human beings (Kahn 1985a, Vlastos 1947, Guthrie 1962). \n\nThe pattern that can be seen in Thales and Anaximander of an original\nstuff giving rise to the phenomena of the cosmos continues in the\nviews of the third of the Milesians, Anaximenes. He replaces\nAnaximander’s apeiron with air, thus eliminating the\nfirst stage of the coming-to-be of the cosmos (the something\nproductive of hot and cold). Rather, he returns to an originating\nstuff more like Thales’ water. In DK13A5/LM7D1 and D7\nAristotle’s associate Theophrastus, quoted by Simplicius,\nspeculates that Anaximenes chose air because he agreed that a basic\nprinciple must be neutral (as Anaximander’s apeiron is)\nbut not so lacking in properties that it seems to be nothing at all.\nAir can apparently take on various properties of color, temperature,\nhumidity, motion, taste, and smell. Moreover, according to\nTheophrastus, Anaximenes explicitly states the natural mechanism for\nchange; it is the condensation and rarefaction of air that naturally\ndetermine the particular characters of the things produced from the\noriginating stuff. Rarified, air becomes fire; more and more\ncondensed, it becomes progressively wind, cloud, water, earth, and\nfinally stones. “The rest,” says Theophrastus, “come\nto be from these.” Plutarch says that condensation and\nrarefaction are connected with cooling and heating, and he gives the\nexample of breath (DK13B1/LM7D8,R4). Releasing air from the mouth with\ncompressed lips produces cool air (as in cooling soup by blowing on\nit), but relaxed lips produce warm air (as when one blows on cold\nhands to warm them up). \n\nDoes the originating stuff persist through the changes that it\nundergoes in the generating processes? Aristotle’s account\nsuggests that it does, that Anaximenes, for instance, would have\nthought that stone was really air, although in an altered state, just\nas we might say that ice is really water, cooled to a point where it\ngoes from a liquid to a solid state. Because the water does not cease\nto be water when it is cooled and becomes ice, it can return to a\nliquid when heated and then become a gas when more heat is applied. On\nthis view, the Milesians were material monists, committed to the\nreality of a single material stuff that undergoes many alterations but\npersists through the changes (Barnes 1979, Guthrie 1962, Sedley 2007\nand 2009). Yet there are reasons to doubt that this was actually the\nMilesian view. It presumes that the early Greek thinkers anticipated\nAristotle’s general theory that change requires enduring\nunderlying substances that gain and lose properties. The earliest\nGreeks thought more in terms of powers (Vlastos 1947, Heidel 1906),\nand the metaphysical problem of what it is to be a substance was yet\nto be formulated. Clearly the Milesians were interested in the\noriginating stuff from which the world developed (Anaximander and\nAnaximenes are explicit about transformations of such an eternal\noriginating stuff), but the view that this endured as a single\nsubstratum may not have been theirs. Rather, it has been suggested by\nGraham (1997 and 2006; Mourelatos 2008) that the Milesians were not,\nin Aristotle’s sense, material monists. On this view, the\noriginal/originating stuff is transformed into other substances.\nAnaximenes, for instance, may have thought that the change from air to\nwater does not involve the persistence of air as any sort of\nsubstratum. There is no special role that air plays in the theory\nexcept that it is the originating stuff and so first in an analysis of\nthe law-like cyclical changes that produce various stuffs as the\ncosmos develops (Graham 2006, ch. 4). Such an interpretation suggests\nhow different the Milesian conception of the world is from\nAristotle’s.\n",
    "section_title": "2. The Milesians",
    "entry_title": "Presocratic Philosophy",
    "hierarchy_title": "Presocratic Philosophy || The Milesians",
    "tokenized_text": [
        "milesians",
        "milesians",
        "account",
        "predecessor",
        "search",
        "cause",
        "principle",
        "natural",
        "world",
        "natural",
        "phenomenon",
        "aristotle",
        "say",
        "thales",
        "miletus",
        "city",
        "ionia",
        "west",
        "coast",
        "turkey",
        "first",
        "engage",
        "inquiry",
        "seems",
        "lived",
        "around",
        "beginning",
        "th",
        "c",
        "bce",
        "aristotle",
        "mention",
        "people",
        "thales",
        "placed",
        "great",
        "importance",
        "water",
        "credit",
        "thales",
        "declaring",
        "water",
        "first",
        "cause",
        "metaphysics",
        "b",
        "later",
        "raise",
        "question",
        "whether",
        "perhaps",
        "hesiod",
        "first",
        "look",
        "cause",
        "motion",
        "change",
        "bff",
        "suggestion",
        "rhetorical",
        "aristotle",
        "seriously",
        "imply",
        "mention",
        "engaged",
        "sort",
        "inquiry",
        "think",
        "thales",
        "two",
        "greek",
        "thinker",
        "early",
        "period",
        "anaximander",
        "anaximenes",
        "also",
        "miletus",
        "although",
        "ancient",
        "tradition",
        "three",
        "related",
        "master",
        "pupil",
        "may",
        "correct",
        "enough",
        "fundamental",
        "similarity",
        "view",
        "justify",
        "treating",
        "together",
        "tradition",
        "claim",
        "thales",
        "predicted",
        "solar",
        "eclipse",
        "bc",
        "dk",
        "alm",
        "p",
        "p",
        "introduced",
        "geometry",
        "greece",
        "egypt",
        "dk",
        "alm",
        "p",
        "p",
        "r",
        "produced",
        "engineering",
        "marvel",
        "anaximander",
        "reported",
        "invented",
        "gnomon",
        "raised",
        "piece",
        "sundial",
        "whose",
        "shadow",
        "mark",
        "time",
        "created",
        "sphere",
        "heaven",
        "serving",
        "astronomical",
        "cosmological",
        "model",
        "dk",
        "alm",
        "p",
        "p",
        "p",
        "first",
        "draw",
        "map",
        "inhabited",
        "world",
        "dk",
        "alm",
        "p",
        "d",
        "regardless",
        "whether",
        "report",
        "correct",
        "case",
        "thales",
        "prediction",
        "almost",
        "certainly",
        "indicate",
        "something",
        "important",
        "milesians",
        "interest",
        "measuring",
        "explaining",
        "celestial",
        "terrestrial",
        "phenomenon",
        "strong",
        "concern",
        "abstract",
        "inquiry",
        "cause",
        "principle",
        "substance",
        "change",
        "attributed",
        "aristotle",
        "algra",
        "white",
        "see",
        "socalled",
        "scientific",
        "philosophical",
        "question",
        "belonging",
        "separate",
        "discipline",
        "requiring",
        "distinct",
        "method",
        "inquiry",
        "assumption",
        "principle",
        "along",
        "aristotle",
        "see",
        "constituting",
        "philosophical",
        "foundation",
        "theory",
        "part",
        "implicit",
        "claim",
        "make",
        "nevertheless",
        "legitimate",
        "treat",
        "milesians",
        "philosophical",
        "view",
        "even",
        "though",
        "clear",
        "statement",
        "view",
        "specific",
        "argument",
        "found",
        "surviving",
        "fragment",
        "testimonia",
        "aristotle",
        "comment",
        "sound",
        "based",
        "firsthand",
        "knowledge",
        "thales",
        "view",
        "doxographical",
        "report",
        "say",
        "thales",
        "write",
        "book",
        "yet",
        "aristotle",
        "confident",
        "thales",
        "belongs",
        "even",
        "honorifically",
        "group",
        "thinker",
        "call",
        "inquirer",
        "nature",
        "distinguishes",
        "earlier",
        "poetical",
        "mythmakers",
        "book",
        "metaphysics",
        "aristotle",
        "claim",
        "earliest",
        "among",
        "place",
        "milesians",
        "explained",
        "thing",
        "term",
        "matter",
        "met",
        "i",
        "b",
        "claim",
        "anachronistic",
        "presupposes",
        "aristotle",
        "novel",
        "view",
        "complete",
        "explanation",
        "must",
        "encompass",
        "four",
        "factor",
        "called",
        "material",
        "efficient",
        "formal",
        "final",
        "cause",
        "yet",
        "something",
        "aristotle",
        "say",
        "aristotle",
        "link",
        "thales",
        "claim",
        "world",
        "rest",
        "water",
        "view",
        "water",
        "archē",
        "fundamental",
        "principle",
        "add",
        "come",
        "principle",
        "thing",
        "b",
        "dk",
        "alm",
        "d",
        "r",
        "suggests",
        "thales",
        "chose",
        "water",
        "fundamental",
        "role",
        "comingtobe",
        "nutrition",
        "growth",
        "claim",
        "water",
        "origin",
        "nature",
        "moist",
        "thing",
        "aristotle",
        "general",
        "assertion",
        "first",
        "thinker",
        "gave",
        "account",
        "nature",
        "specific",
        "discussion",
        "thales",
        "reliance",
        "water",
        "first",
        "principle",
        "brings",
        "difficulty",
        "interpreting",
        "early",
        "presocratics",
        "according",
        "aristotle",
        "general",
        "account",
        "presocratics",
        "claimed",
        "single",
        "enduring",
        "material",
        "stuff",
        "origin",
        "thing",
        "continuing",
        "nature",
        "thus",
        "view",
        "thales",
        "say",
        "first",
        "principle",
        "water",
        "understood",
        "claiming",
        "original",
        "state",
        "thing",
        "water",
        "even",
        "despite",
        "appearance",
        "everything",
        "really",
        "water",
        "state",
        "another",
        "change",
        "original",
        "state",
        "present",
        "one",
        "involves",
        "change",
        "material",
        "stuff",
        "although",
        "may",
        "appear",
        "water",
        "everywhere",
        "seems",
        "airier",
        "earthier",
        "water",
        "usual",
        "state",
        "original",
        "one",
        "transformation",
        "water",
        "different",
        "kind",
        "stuff",
        "air",
        "earth",
        "instance",
        "yet",
        "aristotle",
        "come",
        "give",
        "detail",
        "thales",
        "view",
        "suggests",
        "thales",
        "water",
        "first",
        "principle",
        "everything",
        "come",
        "water",
        "water",
        "perhaps",
        "original",
        "state",
        "thing",
        "thales",
        "water",
        "necessary",
        "condition",
        "everything",
        "generated",
        "naturally",
        "aristotle",
        "summary",
        "thales",
        "view",
        "imply",
        "thales",
        "claimed",
        "water",
        "endures",
        "whatever",
        "change",
        "occurred",
        "since",
        "original",
        "state",
        "new",
        "additional",
        "property",
        "thales",
        "may",
        "well",
        "thought",
        "certain",
        "characteristic",
        "original",
        "water",
        "persisted",
        "particular",
        "capacity",
        "motion",
        "must",
        "innate",
        "order",
        "generate",
        "change",
        "original",
        "state",
        "suggested",
        "thales",
        "reported",
        "claim",
        "lodestone",
        "magnetic",
        "property",
        "amber",
        "rubbed",
        "exhibit",
        "power",
        "attraction",
        "static",
        "electricity",
        "soul",
        "thing",
        "full",
        "god",
        "aristotle",
        "surmise",
        "thales",
        "identified",
        "soul",
        "make",
        "thing",
        "alive",
        "thus",
        "capable",
        "motion",
        "something",
        "whole",
        "universe",
        "supposed",
        "everything",
        "full",
        "god",
        "dkalmd",
        "da",
        "water",
        "soul",
        "divine",
        "natural",
        "principle",
        "certainly",
        "claim",
        "lodestone",
        "soul",
        "suggests",
        "account",
        "given",
        "analysis",
        "change",
        "qualitative",
        "substantial",
        "term",
        "substratum",
        "gain",
        "loses",
        "property",
        "aristotelian",
        "although",
        "perhaps",
        "foreshadowed",
        "plato",
        "surprising",
        "earlier",
        "view",
        "unclear",
        "issue",
        "probable",
        "milesian",
        "view",
        "clearly",
        "distinguish",
        "notion",
        "original",
        "matter",
        "enduring",
        "underlying",
        "stuff",
        "graham",
        "report",
        "thales",
        "show",
        "employing",
        "certain",
        "kind",
        "explanation",
        "ultimately",
        "explanation",
        "thing",
        "grounded",
        "water",
        "basic",
        "stuff",
        "universe",
        "change",
        "undergoes",
        "inherent",
        "nature",
        "thales",
        "mark",
        "radical",
        "change",
        "previous",
        "sort",
        "account",
        "world",
        "greek",
        "nongreek",
        "like",
        "presocratics",
        "thales",
        "see",
        "nature",
        "complete",
        "selfordering",
        "system",
        "see",
        "reason",
        "call",
        "divine",
        "intervention",
        "outside",
        "natural",
        "world",
        "supplement",
        "accountwater",
        "may",
        "divine",
        "something",
        "intervenes",
        "natural",
        "world",
        "outside",
        "gregory",
        "evidence",
        "thales",
        "naturalistic",
        "account",
        "circumstantial",
        "attitude",
        "directly",
        "verified",
        "anaximander",
        "one",
        "fragment",
        "securely",
        "attributed",
        "anaximander",
        "although",
        "extent",
        "implied",
        "quotation",
        "uncertain",
        "emphasizes",
        "orderly",
        "nature",
        "universe",
        "indicates",
        "order",
        "internal",
        "rather",
        "imposed",
        "outside",
        "simplicius",
        "th",
        "c",
        "ce",
        "commentator",
        "aristotle",
        "physic",
        "writes",
        "say",
        "first",
        "principle",
        "one",
        "moving",
        "indefinite",
        "anaximander",
        "son",
        "praxiades",
        "milesian",
        "became",
        "successor",
        "pupil",
        "thales",
        "said",
        "indefinite",
        "apeiron",
        "principle",
        "archē",
        "element",
        "stoicheion",
        "thing",
        "first",
        "introduce",
        "name",
        "principle",
        "say",
        "neither",
        "water",
        "socalled",
        "element",
        "indefinite",
        "apeiron",
        "nature",
        "come",
        "heaven",
        "world",
        "thing",
        "comingtobe",
        "thing",
        "also",
        "passingaway",
        "accordance",
        "must",
        "give",
        "penalty",
        "dikê",
        "recompense",
        "one",
        "another",
        "injustice",
        "adikia",
        "accordance",
        "ordering",
        "timespeaking",
        "rather",
        "poetical",
        "term",
        "clear",
        "seen",
        "change",
        "four",
        "element",
        "think",
        "fit",
        "make",
        "one",
        "underlying",
        "subject",
        "something",
        "else",
        "apart",
        "simplicius",
        "commentary",
        "aristotle",
        "physic",
        "line",
        "ff",
        "dkalmp",
        "d",
        "d",
        "dkblmd",
        "thus",
        "original",
        "originating",
        "indefinite",
        "stuff",
        "heaven",
        "world",
        "come",
        "claim",
        "probably",
        "mean",
        "original",
        "state",
        "universe",
        "indefinitely",
        "large",
        "mass",
        "stuff",
        "also",
        "indefinite",
        "character",
        "stuff",
        "gave",
        "rise",
        "inherent",
        "power",
        "ingredient",
        "constitute",
        "world",
        "perceive",
        "testimony",
        "anaximander",
        "pseudoplutarch",
        "dkalmp",
        "d",
        "say",
        "something",
        "productive",
        "hot",
        "cold",
        "separated",
        "eternal",
        "genesis",
        "world",
        "sphere",
        "flame",
        "grew",
        "around",
        "air",
        "around",
        "earth",
        "like",
        "bark",
        "around",
        "tree",
        "neither",
        "cause",
        "precise",
        "process",
        "separation",
        "explained",
        "probable",
        "anaximander",
        "would",
        "thought",
        "motion",
        "innate",
        "original",
        "source",
        "change",
        "part",
        "character",
        "indefinite",
        "passage",
        "simplicius",
        "show",
        "anaximander",
        "think",
        "eternal",
        "indefinite",
        "stuff",
        "give",
        "rise",
        "directly",
        "cosmos",
        "know",
        "rather",
        "relying",
        "semibiological",
        "model",
        "anaximander",
        "claim",
        "apeiron",
        "somehow",
        "generates",
        "opposite",
        "hot",
        "cold",
        "hot",
        "cold",
        "stuff",
        "power",
        "action",
        "stuffspowers",
        "produce",
        "thing",
        "come",
        "world",
        "opposite",
        "act",
        "dominate",
        "contain",
        "producing",
        "regulated",
        "structure",
        "thus",
        "thing",
        "pas",
        "away",
        "thing",
        "came",
        "structured",
        "arrangement",
        "anaximander",
        "refers",
        "speaks",
        "justice",
        "reparation",
        "course",
        "time",
        "cycle",
        "season",
        "rotation",
        "heaven",
        "sort",
        "cyclical",
        "change",
        "including",
        "comingtobe",
        "passingaway",
        "regulated",
        "thus",
        "form",
        "system",
        "system",
        "ruled",
        "justice",
        "ordering",
        "time",
        "sharp",
        "contrast",
        "chaotic",
        "capricious",
        "world",
        "personified",
        "greek",
        "god",
        "interfere",
        "working",
        "heaven",
        "affair",
        "human",
        "being",
        "kahn",
        "a",
        "vlastos",
        "guthrie",
        "pattern",
        "seen",
        "thales",
        "anaximander",
        "original",
        "stuff",
        "giving",
        "rise",
        "phenomenon",
        "cosmos",
        "continues",
        "view",
        "third",
        "milesians",
        "anaximenes",
        "replaces",
        "anaximander",
        "apeiron",
        "air",
        "thus",
        "eliminating",
        "first",
        "stage",
        "comingtobe",
        "cosmos",
        "something",
        "productive",
        "hot",
        "cold",
        "rather",
        "return",
        "originating",
        "stuff",
        "like",
        "thales",
        "water",
        "dkalmd",
        "d",
        "aristotle",
        "associate",
        "theophrastus",
        "quoted",
        "simplicius",
        "speculates",
        "anaximenes",
        "chose",
        "air",
        "agreed",
        "basic",
        "principle",
        "must",
        "neutral",
        "anaximander",
        "apeiron",
        "lacking",
        "property",
        "seems",
        "nothing",
        "air",
        "apparently",
        "take",
        "various",
        "property",
        "color",
        "temperature",
        "humidity",
        "motion",
        "taste",
        "smell",
        "moreover",
        "according",
        "theophrastus",
        "anaximenes",
        "explicitly",
        "state",
        "natural",
        "mechanism",
        "change",
        "condensation",
        "rarefaction",
        "air",
        "naturally",
        "determine",
        "particular",
        "character",
        "thing",
        "produced",
        "originating",
        "stuff",
        "rarified",
        "air",
        "becomes",
        "fire",
        "condensed",
        "becomes",
        "progressively",
        "wind",
        "cloud",
        "water",
        "earth",
        "finally",
        "stone",
        "rest",
        "say",
        "theophrastus",
        "come",
        "these",
        "plutarch",
        "say",
        "condensation",
        "rarefaction",
        "connected",
        "cooling",
        "heating",
        "give",
        "example",
        "breath",
        "dkblmd",
        "r",
        "releasing",
        "air",
        "mouth",
        "compressed",
        "lip",
        "produce",
        "cool",
        "air",
        "cooling",
        "soup",
        "blowing",
        "relaxed",
        "lip",
        "produce",
        "warm",
        "air",
        "one",
        "blow",
        "cold",
        "hand",
        "warm",
        "originating",
        "stuff",
        "persist",
        "change",
        "undergoes",
        "generating",
        "process",
        "aristotle",
        "account",
        "suggests",
        "anaximenes",
        "instance",
        "would",
        "thought",
        "stone",
        "really",
        "air",
        "although",
        "altered",
        "state",
        "might",
        "say",
        "ice",
        "really",
        "water",
        "cooled",
        "point",
        "go",
        "liquid",
        "solid",
        "state",
        "water",
        "cease",
        "water",
        "cooled",
        "becomes",
        "ice",
        "return",
        "liquid",
        "heated",
        "become",
        "gas",
        "heat",
        "applied",
        "view",
        "milesians",
        "material",
        "monists",
        "committed",
        "reality",
        "single",
        "material",
        "stuff",
        "undergoes",
        "many",
        "alteration",
        "persists",
        "change",
        "barnes",
        "guthrie",
        "sedley",
        "yet",
        "reason",
        "doubt",
        "actually",
        "milesian",
        "view",
        "presumes",
        "early",
        "greek",
        "thinker",
        "anticipated",
        "aristotle",
        "general",
        "theory",
        "change",
        "requires",
        "enduring",
        "underlying",
        "substance",
        "gain",
        "lose",
        "property",
        "earliest",
        "greek",
        "thought",
        "term",
        "power",
        "vlastos",
        "heidel",
        "metaphysical",
        "problem",
        "substance",
        "yet",
        "formulated",
        "clearly",
        "milesians",
        "interested",
        "originating",
        "stuff",
        "world",
        "developed",
        "anaximander",
        "anaximenes",
        "explicit",
        "transformation",
        "eternal",
        "originating",
        "stuff",
        "view",
        "endured",
        "single",
        "substratum",
        "may",
        "rather",
        "suggested",
        "graham",
        "mourelatos",
        "milesians",
        "aristotle",
        "sense",
        "material",
        "monists",
        "view",
        "originaloriginating",
        "stuff",
        "transformed",
        "substance",
        "anaximenes",
        "instance",
        "may",
        "thought",
        "change",
        "air",
        "water",
        "involve",
        "persistence",
        "air",
        "sort",
        "substratum",
        "special",
        "role",
        "air",
        "play",
        "theory",
        "except",
        "originating",
        "stuff",
        "first",
        "analysis",
        "lawlike",
        "cyclical",
        "change",
        "produce",
        "various",
        "stuff",
        "cosmos",
        "develops",
        "graham",
        "ch",
        "interpretation",
        "suggests",
        "different",
        "milesian",
        "conception",
        "world",
        "aristotle"
    ]
}