{
    "main_text": "Prichard’s Life\n1. Prichard’s Life\n\nBorn in London in 1871, the eldest child of Walter Stennett Prichard\n(a solicitor) and his wife Lucy, Harold Prichard attended Clifton\nCollege in Bristol and was admitted to New College, Oxford to study\nmathematics. But after taking First Class honours in mathematical\nmoderations (preliminary examinations) in 1891, he studied Greats\n(ancient history and philosophy) taking First Class Honours in 1894.\nHe also played tennis for Oxford against Cambridge. On leaving Oxford\nhe spent a brief period working for a firm of solicitors in London,\nbefore returning to Oxford where he spent the rest of his life, first\nas Fellow of Hertford College (1895–8) and then of Trinity\nCollege (1898–1924). He took early retirement from Trinity in\n1924 on grounds of temporary ill-health, but recovered and was elected\nto the White’s Professorship of Moral Philosophy in 1928. He\nretired in 1937 and died in 1947.\n\nPrichard is mainly known for his work in moral philosophy, but the\nfirst of his very few publications were in epistemology. His main\nintellectual debt was to his teacher John Cook Wilson, whose thinking\ncentered on topics in epistemology and what would now be called\nphilosophical logic, rather than in ethics. In 1909 Prichard published\nhis only book, Kant’s Theory of Knowledge, which was an\naccount of Kant’s Transcendental Idealism. This book criticized\nKant severely, and Prichard acknowledges that his main arguments\nagainst Kant originated from Cook Wilson. The book’s main\nconclusion is that ‘Knowledge is sui generis and\ntherefore a ‘theory’ of knowledge is impossible. Knowledge\nis knowledge, and any attempt to state it in terms of something else\nmust end in describing something which is not knowledge’ (p.\n245). This view that a ‘theory’ of knowledge is impossible\nhas its analogue in Prichard’s later argument that there can be\nno philosophical account of moral obligation of the sort that moral\nphilosophers have traditionally tried to provide.\n\nCook Wilson’s influence is also evident in Prichard’s\nargument against Kant’s view that we cannot know things in\nthemselves, but only know them as they present themselves, or appear,\nto us. Prichard inherits from Cook Wilson the view that any state of\nmind that affects the nature of its presentations cannot be knowledge.\nKnowledge can only be of what it does not affect; its object must be\nentirely independent. In Kant’s terms, then, the only possible\nobjects of knowledge are things in themselves. Appearances, assuming\nthat they are objects, cannot be known at all, but must be the object\nof some other state of mind.\n\nBut appearances are not objects. When two lines appear to converge,\nthere is, we might say, an appearance of convergence here, but we\nshould not understand this as the two lines presenting a appearance\nthat is convergent. Appearances can be neither convergent, nor\ndivergent; and they cannot be parallel either. More generally, spatial\nproperties cannot be properties of appearances, since no appearance\ncan be great or small, square or round, bent or straight. Prichard\ntherefore thinks of the noun ‘appearance’ is a source of\nconfusion, because it leads us to think of appearances as objects with\ntheir own ‘phenomenal’ properties, and thereby to ascribe\nto them properties that really belong (or perhaps only appear to\nbelong) to the object that so appears. Having fallen victim to this\nmistake, we then make the further mistake of supposing that we can\nnever cognize objects as they are, but only as they appear to be, and\nwe understand this last as cognition of the appearances rather than of\nthe objects. But an object can of course be the way it appears to be,\nand when it is, its so appearing makes it possible for us to know that\nit is so. So in knowing how things appear we sometimes know how they\nare – indeed, how they are ‘in themselves’.\n\nThe view that knowledge must be of what is independent is the second\nprong of Prichard’s persistent attacks on the notion of a\nsense-datum (and thereby on Russell, Moore and Price). A sense-datum,\nhe says, is supposed to be something of whose existence we know in\nevery case of perception. But sense-data are not supposed to have an\nindependent existence, and therefore the very conception of a\nsense-datum involves a contradiction. As Prichard came to see it, the\nbasic mistake made by defenders of a sense-datum theory is that of\nsupposing that perceiving is a form of knowing; all the other errors\nflow from this (Prichard 1938; see also his 1909, p. 99).\n\nPrichard continued to work and to lecture on topics in epistemology,\nin particular perception. He gave lectures on Modern Philosophy\n(Descartes, Locke, Berkeley and Hume) every year for the first five\nyears of his tenure of the White’s Professorship. Indeed he\nlectured as often on these topics as on moral philosophy. He wrote on\nthe perception of movement and the apprehension of time. He said,\ncharacteristically, that ‘the hearing a sound – a sound\nhaving as such a duration – and in general what is called the\nperceiving anything which has a duration – is absolutely\nunderivative and cannot be resolved into anything else’\n(Knowledge and Perception ed. Ross, 48). I cannot resist\nquoting also a passage from a lecture on perception which was not\npublished in Prichard’s lifetime, with the warning that Prichard\nwas known to trail his coat in lectures, in the hope of generating\nlively discussion (ibid., 59–60). ‘For as soon as\nwe compare our states or processes of seeing with one another or with\nother states or processes of perceiving we have to allow that we do\nnot see bodies. For example, it is certain that if\nwe see bodies we in some cases see a body move, but it is also\ncertain that we cannot possibly ever see a body move; for in\nspite of what the followers of Einstein say, motion is, and is always\nreally thought of as, absolute, relative motion being a contradiction\nin terms. (I should like, incidentally, but without any sense of\nshame, to offer this statement as a specimen of one of the few\nstatements of things which we can really be said to know.)\nAnd, motion being absolute, when we are said to be seeing a body move,\nwe cannot possibly be really doing so, since a stationary body would\npresent precisely the same appearance to us, provided our body was\nmoving in a certain way, so that in that case we should be seeing a\nbody move although in fact it was stationary.’\n\nPrichard was renowned in Oxford (and not only among philosophers) for\nthe simplicity and clarity of his writing style, though he published\nso little of what he wrote. There are also occasional moments of wry\nhumour such as his comment in a commemorative piece on Joseph:\n‘His best memorial, unlike that of many other teachers, perhaps\nconsists in the books that his pupils refrained from writing.’\nPrichard is standing here in a venerable Oxford tradition of not\npublishing oneself and discouraging others either by example and\nprecept (Cook Wilson, Prichard – but not in fact Joseph) or by\nfear (Austin). Prichard’s daughter wrote: ‘My father was\nalways so reluctant to publish’ (quoted in MacAdam 2002,\nxv).\n\nFinally, some anecdotes and personal testimony:\n\nAustin was much impressed by Prichard, whom he thought the most\nrigorous and minute thinker in Oxford (Berlin, 1973, 2). J. O. Urmson\ntold me that Austin had attended Prichard’s lectures as an\nundergraduate in the early 1930s, sat right at the front and asked\nvery many questions. Eventually Prichard wrote to Austin’s tutor\nin Balliol (I’m not sure who that was), asking him to persuade\nAustin either not to ask so many questions, or not to attend at all.\nBut Austin did neither of these things. Urmson himself wrote ‘As\na member of the very last generation of undergraduates to attend\nPrichard’s lectures and informal instruction, I learnt to admire\nhis patience as a teacher, his philosophical acuity and, above all,\nhis quite exceptional intellectual honesty and independence.’\n(This is in his introduction to his Prichard collection, reprinted in\nMacAdam, p. x.)\n\nC. D. Broad called Prichard ‘a man of immense ability whom I\nhave always regarded as the Oxford Moore’ (Cheney 1971, 14). It\nis also worth reporting Broad’s remarks about Prichard’s\nexamination of T. H. Green: ‘Seldom can the floor have been more\nthoroughly wiped with the remains of one who was at one time commonly\nregarded as a great thinker and who still enjoys a considerable\nreputation in some circles’ (1950, 557). The realist backlash\nagainst nineteenth century Oxford Idealism was complete.\n\nWittgenstein came to speak in Oxford in 1947, just before\nPrichard’s death. He had said he did not want to read a paper,\nbut was willing to respond to a paper given by some agreeable student.\nO. P. Wood, who was still an undergraduate (at Corpus Christi) was set\nup as the fall guy, and read a paper on the Cogito.\nWittgenstein, using the paper as a springboard for his own ideas,\nresponded at length. Prichard made several interventions, on each\noccasion very deliberately mispronouncing Wittgenstein’s name as\nWhittgensteen. Finally he rose again and said, in his high reedy voice\n‘Mr. Whittgensteen, Mr. Whittgensteen, you have not answered the\nquestion. Cogito ergo sum – I think therefore I am. Is\nit true, Mr Whittgensteen, is it true – I think therefore I\nam?’. Wittgenstein, exasperated, turned very icy and replied\n‘I think this is a very foolish old man; so I am –\nwhat?’. (This story comes from Peter Hacker, who heard it from\ntwo people who were there, J. O. Urmson and H. L. A. Hart. Hart\nthought that Wittgenstein’s reply was brilliant repartee; Urmson\nthought it unforgivably rude.)\n",
    "section_title": "1. Prichard’s Life",
    "entry_title": "Harold Arthur Prichard",
    "hierarchy_title": "Harold Arthur Prichard || Prichard’s Life",
    "tokenized_text": [
        "prichard",
        "life",
        "prichard",
        "life",
        "born",
        "london",
        "eldest",
        "child",
        "walter",
        "stennett",
        "prichard",
        "solicitor",
        "wife",
        "lucy",
        "harold",
        "prichard",
        "attended",
        "clifton",
        "college",
        "bristol",
        "admitted",
        "new",
        "college",
        "oxford",
        "study",
        "mathematics",
        "taking",
        "first",
        "class",
        "honour",
        "mathematical",
        "moderation",
        "preliminary",
        "examination",
        "studied",
        "great",
        "ancient",
        "history",
        "philosophy",
        "taking",
        "first",
        "class",
        "honour",
        "also",
        "played",
        "tennis",
        "oxford",
        "cambridge",
        "leaving",
        "oxford",
        "spent",
        "brief",
        "period",
        "working",
        "firm",
        "solicitor",
        "london",
        "returning",
        "oxford",
        "spent",
        "rest",
        "life",
        "first",
        "fellow",
        "hertford",
        "college",
        "trinity",
        "college",
        "took",
        "early",
        "retirement",
        "trinity",
        "ground",
        "temporary",
        "illhealth",
        "recovered",
        "elected",
        "white",
        "professorship",
        "moral",
        "philosophy",
        "retired",
        "died",
        "prichard",
        "mainly",
        "known",
        "work",
        "moral",
        "philosophy",
        "first",
        "publication",
        "epistemology",
        "main",
        "intellectual",
        "debt",
        "teacher",
        "john",
        "cook",
        "wilson",
        "whose",
        "thinking",
        "centered",
        "topic",
        "epistemology",
        "would",
        "called",
        "philosophical",
        "logic",
        "rather",
        "ethic",
        "prichard",
        "published",
        "book",
        "kant",
        "theory",
        "knowledge",
        "account",
        "kant",
        "transcendental",
        "idealism",
        "book",
        "criticized",
        "kant",
        "severely",
        "prichard",
        "acknowledges",
        "main",
        "argument",
        "kant",
        "originated",
        "cook",
        "wilson",
        "book",
        "main",
        "conclusion",
        "knowledge",
        "sui",
        "generis",
        "therefore",
        "theory",
        "knowledge",
        "impossible",
        "knowledge",
        "knowledge",
        "attempt",
        "state",
        "term",
        "something",
        "else",
        "must",
        "end",
        "describing",
        "something",
        "knowledge",
        "p",
        "view",
        "theory",
        "knowledge",
        "impossible",
        "analogue",
        "prichard",
        "later",
        "argument",
        "philosophical",
        "account",
        "moral",
        "obligation",
        "sort",
        "moral",
        "philosopher",
        "traditionally",
        "tried",
        "provide",
        "cook",
        "wilson",
        "influence",
        "also",
        "evident",
        "prichard",
        "argument",
        "kant",
        "view",
        "know",
        "thing",
        "know",
        "present",
        "appear",
        "u",
        "prichard",
        "inherits",
        "cook",
        "wilson",
        "view",
        "state",
        "mind",
        "affect",
        "nature",
        "presentation",
        "knowledge",
        "knowledge",
        "affect",
        "object",
        "must",
        "entirely",
        "independent",
        "kant",
        "term",
        "possible",
        "object",
        "knowledge",
        "thing",
        "appearance",
        "assuming",
        "object",
        "known",
        "must",
        "object",
        "state",
        "mind",
        "appearance",
        "object",
        "two",
        "line",
        "appear",
        "converge",
        "might",
        "say",
        "appearance",
        "convergence",
        "understand",
        "two",
        "line",
        "presenting",
        "appearance",
        "convergent",
        "appearance",
        "neither",
        "convergent",
        "divergent",
        "parallel",
        "either",
        "generally",
        "spatial",
        "property",
        "property",
        "appearance",
        "since",
        "appearance",
        "great",
        "small",
        "square",
        "round",
        "bent",
        "straight",
        "prichard",
        "therefore",
        "think",
        "noun",
        "appearance",
        "source",
        "confusion",
        "lead",
        "u",
        "think",
        "appearance",
        "object",
        "phenomenal",
        "property",
        "thereby",
        "ascribe",
        "property",
        "really",
        "belong",
        "perhaps",
        "appear",
        "belong",
        "object",
        "appears",
        "fallen",
        "victim",
        "mistake",
        "make",
        "mistake",
        "supposing",
        "never",
        "cognize",
        "object",
        "appear",
        "understand",
        "last",
        "cognition",
        "appearance",
        "rather",
        "object",
        "object",
        "course",
        "way",
        "appears",
        "appearing",
        "make",
        "possible",
        "u",
        "know",
        "knowing",
        "thing",
        "appear",
        "sometimes",
        "know",
        "indeed",
        "view",
        "knowledge",
        "must",
        "independent",
        "second",
        "prong",
        "prichard",
        "persistent",
        "attack",
        "notion",
        "sensedatum",
        "thereby",
        "russell",
        "moore",
        "price",
        "sensedatum",
        "say",
        "supposed",
        "something",
        "whose",
        "existence",
        "know",
        "every",
        "case",
        "perception",
        "sensedata",
        "supposed",
        "independent",
        "existence",
        "therefore",
        "conception",
        "sensedatum",
        "involves",
        "contradiction",
        "prichard",
        "came",
        "see",
        "basic",
        "mistake",
        "made",
        "defender",
        "sensedatum",
        "theory",
        "supposing",
        "perceiving",
        "form",
        "knowing",
        "error",
        "flow",
        "prichard",
        "see",
        "also",
        "p",
        "prichard",
        "continued",
        "work",
        "lecture",
        "topic",
        "epistemology",
        "particular",
        "perception",
        "gave",
        "lecture",
        "modern",
        "philosophy",
        "descartes",
        "locke",
        "berkeley",
        "hume",
        "every",
        "year",
        "first",
        "five",
        "year",
        "tenure",
        "white",
        "professorship",
        "indeed",
        "lectured",
        "often",
        "topic",
        "moral",
        "philosophy",
        "wrote",
        "perception",
        "movement",
        "apprehension",
        "time",
        "said",
        "characteristically",
        "hearing",
        "sound",
        "sound",
        "duration",
        "general",
        "called",
        "perceiving",
        "anything",
        "duration",
        "absolutely",
        "underivative",
        "resolved",
        "anything",
        "else",
        "knowledge",
        "perception",
        "ed",
        "ross",
        "resist",
        "quoting",
        "also",
        "passage",
        "lecture",
        "perception",
        "published",
        "prichard",
        "lifetime",
        "warning",
        "prichard",
        "known",
        "trail",
        "coat",
        "lecture",
        "hope",
        "generating",
        "lively",
        "discussion",
        "ibid",
        "soon",
        "compare",
        "state",
        "process",
        "seeing",
        "one",
        "another",
        "state",
        "process",
        "perceiving",
        "allow",
        "see",
        "body",
        "example",
        "certain",
        "see",
        "body",
        "case",
        "see",
        "body",
        "move",
        "also",
        "certain",
        "possibly",
        "ever",
        "see",
        "body",
        "move",
        "spite",
        "follower",
        "einstein",
        "say",
        "motion",
        "always",
        "really",
        "thought",
        "absolute",
        "relative",
        "motion",
        "contradiction",
        "term",
        "like",
        "incidentally",
        "without",
        "sense",
        "shame",
        "offer",
        "statement",
        "specimen",
        "one",
        "statement",
        "thing",
        "really",
        "said",
        "know",
        "motion",
        "absolute",
        "said",
        "seeing",
        "body",
        "move",
        "possibly",
        "really",
        "since",
        "stationary",
        "body",
        "would",
        "present",
        "precisely",
        "appearance",
        "u",
        "provided",
        "body",
        "moving",
        "certain",
        "way",
        "case",
        "seeing",
        "body",
        "move",
        "although",
        "fact",
        "stationary",
        "prichard",
        "renowned",
        "oxford",
        "among",
        "philosopher",
        "simplicity",
        "clarity",
        "writing",
        "style",
        "though",
        "published",
        "little",
        "wrote",
        "also",
        "occasional",
        "moment",
        "wry",
        "humour",
        "comment",
        "commemorative",
        "piece",
        "joseph",
        "best",
        "memorial",
        "unlike",
        "many",
        "teacher",
        "perhaps",
        "consists",
        "book",
        "pupil",
        "refrained",
        "writing",
        "prichard",
        "standing",
        "venerable",
        "oxford",
        "tradition",
        "publishing",
        "oneself",
        "discouraging",
        "others",
        "either",
        "example",
        "precept",
        "cook",
        "wilson",
        "prichard",
        "fact",
        "joseph",
        "fear",
        "austin",
        "prichard",
        "daughter",
        "wrote",
        "father",
        "always",
        "reluctant",
        "publish",
        "quoted",
        "macadam",
        "xv",
        "finally",
        "anecdote",
        "personal",
        "testimony",
        "austin",
        "much",
        "impressed",
        "prichard",
        "thought",
        "rigorous",
        "minute",
        "thinker",
        "oxford",
        "berlin",
        "j",
        "o",
        "urmson",
        "told",
        "austin",
        "attended",
        "prichard",
        "lecture",
        "undergraduate",
        "early",
        "s",
        "sat",
        "right",
        "front",
        "asked",
        "many",
        "question",
        "eventually",
        "prichard",
        "wrote",
        "austin",
        "tutor",
        "balliol",
        "sure",
        "asking",
        "persuade",
        "austin",
        "either",
        "ask",
        "many",
        "question",
        "attend",
        "austin",
        "neither",
        "thing",
        "urmson",
        "wrote",
        "member",
        "last",
        "generation",
        "undergraduate",
        "attend",
        "prichard",
        "lecture",
        "informal",
        "instruction",
        "learnt",
        "admire",
        "patience",
        "teacher",
        "philosophical",
        "acuity",
        "quite",
        "exceptional",
        "intellectual",
        "honesty",
        "independence",
        "introduction",
        "prichard",
        "collection",
        "reprinted",
        "macadam",
        "p",
        "x",
        "c",
        "d",
        "broad",
        "called",
        "prichard",
        "man",
        "immense",
        "ability",
        "always",
        "regarded",
        "oxford",
        "moore",
        "cheney",
        "also",
        "worth",
        "reporting",
        "broad",
        "remark",
        "prichard",
        "examination",
        "t",
        "h",
        "green",
        "seldom",
        "floor",
        "thoroughly",
        "wiped",
        "remains",
        "one",
        "one",
        "time",
        "commonly",
        "regarded",
        "great",
        "thinker",
        "still",
        "enjoys",
        "considerable",
        "reputation",
        "circle",
        "realist",
        "backlash",
        "nineteenth",
        "century",
        "oxford",
        "idealism",
        "complete",
        "wittgenstein",
        "came",
        "speak",
        "oxford",
        "prichard",
        "death",
        "said",
        "want",
        "read",
        "paper",
        "willing",
        "respond",
        "paper",
        "given",
        "agreeable",
        "student",
        "o",
        "p",
        "wood",
        "still",
        "undergraduate",
        "corpus",
        "christi",
        "set",
        "fall",
        "guy",
        "read",
        "paper",
        "cogito",
        "wittgenstein",
        "using",
        "paper",
        "springboard",
        "idea",
        "responded",
        "length",
        "prichard",
        "made",
        "several",
        "intervention",
        "occasion",
        "deliberately",
        "mispronouncing",
        "wittgenstein",
        "name",
        "whittgensteen",
        "finally",
        "rose",
        "said",
        "high",
        "reedy",
        "voice",
        "mr",
        "whittgensteen",
        "mr",
        "whittgensteen",
        "answered",
        "question",
        "cogito",
        "ergo",
        "sum",
        "think",
        "therefore",
        "true",
        "mr",
        "whittgensteen",
        "true",
        "think",
        "therefore",
        "wittgenstein",
        "exasperated",
        "turned",
        "icy",
        "replied",
        "think",
        "foolish",
        "old",
        "man",
        "story",
        "come",
        "peter",
        "hacker",
        "heard",
        "two",
        "people",
        "j",
        "o",
        "urmson",
        "h",
        "l",
        "a",
        "hart",
        "hart",
        "thought",
        "wittgenstein",
        "reply",
        "brilliant",
        "repartee",
        "urmson",
        "thought",
        "unforgivably",
        "rude"
    ]
}