{
    "main_text": "The Good, the Right, and the Obligatory\n3. The Good, the Right, and the Obligatory\n\nIt is characteristic of intuitionists to deny that the right can be\nderived from the good, and Prichard, as we have seen, was no\nexception. Some intuitionists think that the good can be derived from\nthe right, perhaps by thinking of the good as that which it is right\nto approve, admire, seek. Prichard does not take this sort of line\neither. For him, goodness is very different from rightness. Goodness\nseems to be a simple monadic property. The things that can have this\nproperty are states of affairs, people and actions. An act can be\nthought of as good, but whenever we do so, we are really thinking of\nits motive; a good act is one done from a good motive. Prichard\ndistinguished between the moral motive, which is a sense of\nobligation, and ordinary motives, which are desires. ‘Desire and\na sense of obligation are co-ordinate species of motive’ (15).\nThere is the act, the origination of a change, and there is the motive\nfor that act. Acts themselves are not good or bad. But we can think of\nthe act together with its motive, and think of such a thing as good or\nbad. Prichard used the term ‘action’ for this combination\nof act and motive (officially, but not always consistently). Acts\ncannot really be good or bad, but actions can (156–7).\n\nWe might protest that an act can surely be good if it has good\nconsequences: it is ‘instrumentally good’, that is, good\nas a means (though not good as an instrument; the term\n‘instrumental value’ is a snare). Prichard’s\nresponse to this is that being a means to a good is not a way of being\ngood.\n\nObligatoriness is completely different. It looks initially as if\nobligatoriness – being what one ought to do – is another\nmonadic property, distinct from goodness. If it is, the only things\nthat can have this property are acts. The motive with which an act is\ndone is irrelevant to its obligatoriness; one can do what one ought\nfor the wrong reason, or from a bad motive (11–12). Agents\ncannot have obligatoriness, and nor can outcomes. And to think of an\naction (in Prichard’s official sense) as obligatory is just\nevidence of confusion. If an action is what one ought to do, it is\nbecause the act involved, the origination, is what one ought to do.\nMotives themselves cannot be morally right or wrong. Nor can one have\nan obligation to act from a certain motive, for two reasons. First,\none is not able to choose to have a motive, and one can only have an\nobligation to do something that one is capable of choosing to do or\nnot to do. In general, we either have certain motives or we\ndon’t, and there is not a lot that we can do about it. (We can,\nof course, try to train ourselves up so that we are in a better\nposition next time.) Second, when we choose an action, the motive for\nwhich we will act if we do so act is already given (12). There is not,\nand cannot be, a separate motive for which we will choose the action.\nThe motive for choice is the motive for acting.\n\nBut in fact Prichard held, or at least came to hold, that\nobligatoriness is not a property of acts at all. An act that ought to\nbe done is one that is obligatory for some agent, one that that agent\nought to do, or that is his duty. These notions of duty, obligation,\nand ought really denote properties of agents. It is not so much the\naction that is obligatory as the agent that has the obligation to do\nit, or to act in that way. There is no obligatoriness out there,\nbelonging to the act that we are considering. A sense of obligation is\nnot a recognition of a property that the act has got, in addition to\nall its more normal properties. It is really a sense that one is\nobliged, or ought, to act in that way. One might think of this as a\nrelation, except that there is no act there yet for one to be related\nto in the obligated way. It is not a relation, then. But if one is\nobliged to act in this way, that will (as I said at the beginning) be\nbecause of – be constituted by – facts about the act and\nabout relations in which one stands to others or to oneself.\n\nWe can now see further reason for rejecting these two inferences:\n\nIf this action would be good, I ought to do it.\n\n\nIf this act would have a good result, I ought to do it.\n\n\nBoth inferences take us from a remark about an act or action to a\nremark about an agent. Prichard asks us what the principles of these\ninferences could possibly be.\n\nOf course Prichard does not just announce that obligatoriness is not a\nproperty of acts. He has two arguments. The first is that there are\nepistemic difficulties in supposing that acts are made obligatory by\nobjective matters of fact such as their own nature and the attendant\ncircumstances. Most of these things are things that we cannot truly\nknow to be the case, such as what results our action will have (at\nthis point Prichard is appealing to the theory of knowledge that he\ninherited from Cook Wilson). If so, we would hardly ever be able to\nknow what our duty was; and the thought that most of our duties are\nthings of which we cannot know is unbearable. This difficulty vanishes\nif we suppose that the ground for duty is not the objective nature of\nthe situation, but the way the agent supposes things to be. But if we\nmake that move, we suppose that the ground for duty lies in some fact\nabout the agent (that she so supposes), and this makes it much easier\nto think of the duty itself as attaching to the agent rather than to\nthe act. (On this argument and its peculiarities, see Dancy,\n2002.)\n\nPrichard’s second argument is equally idiosyncratic. We can have\nan obligation to do an action long before the action is done. If so,\nthe obligation cannot be a feature of the action, since it exists\nbefore the action does. It must be a feature of something else, if it\nis a feature of anything, and the obvious candidate is the agent.\n\nThis argument impressed Prichard. But Broad wrote ‘I find it\ndifficult to persuade myself that this argument is very\nformidable’ (1950, 555). I don’t myself think that the\nargument is especially formidable, exactly, but it does serve to\nprevent errors of various sorts, such as the error of thinking that\ndeciding what to do is like choosing chocolates from a box, as if the\nactions between which one is choosing are somehow laid out before one\nin their full particularity, waiting to be chosen, that is, done. In\nthe present case, the question is how to avoid the argument without\ngoing down Prichard’s route. It is true that there is no\nparticular action that we are now obliged to do tomorrow; what we are\nobliged to do is only to act in a certain way; there will be a wide\nvariety of actions that would meet that obligation, and we are not\nobliged to do one of them rather than any other. If we have to pay the\nmoney, it doesn’t matter, so far as that goes, how we go about\ndoing it. But how does this help us understand what it is that is\nobligatory – the owner of the obligatoriness, as it were? It\ncannot belong to ‘acting in a certain way’. The most we\ncould do would be to abandon the idea of obligatoriness as a character\nbelonging to ‘acting in a way’ and think instead of\nsomething like ‘it is obligatory that p’, where p stands\nfor ‘A Vs’. But even that doesn’t quite work, since\nit seems to specify a state of affairs or perhaps an event as\nobligatory, and this makes no sense at all. The only way to resolve\nthe impasse is to take Prichard’s way out and award the\nobligation to the agent, yielding ‘A is obliged to V’\n– which is where Prichard wanted to take us.\n\nSo when one senses an obligation one senses a character of oneself, a\nclaim on oneself to act in a certain way. And to sense an obligation\nall that is needed is to put oneself into the relevant situation and\nconsider the various ways of acting that are available, and the\nvarious relevant relations in which one stands to others and to\noneself. If this does not lead to a sense of obligation, there is\nnothing much else that can do it. Moral philosophy, certainly, offers\nno such resources, and the Mistake on which Moral Philosophy rests, to\nrevert to the title of Prichard’s famous article, is to suppose\notherwise.\n\nDespite all this, in the article in which Prichard addresses these\nissues (1932) he seems at one point to distinguish the obligatory from\nthe right, and to suppose that rightness is still to be understood as\na monadic property of the act, like goodness. If that is the correct\nreading, it introduces considerable complications. See Dancy (2002)\nfor comment.\n",
    "section_title": "3. The Good, the Right, and the Obligatory",
    "entry_title": "Harold Arthur Prichard",
    "hierarchy_title": "Harold Arthur Prichard || The Good, the Right, and the Obligatory",
    "tokenized_text": [
        "good",
        "right",
        "obligatory",
        "good",
        "right",
        "obligatory",
        "characteristic",
        "intuitionists",
        "deny",
        "right",
        "derived",
        "good",
        "prichard",
        "seen",
        "exception",
        "intuitionists",
        "think",
        "good",
        "derived",
        "right",
        "perhaps",
        "thinking",
        "good",
        "right",
        "approve",
        "admire",
        "seek",
        "prichard",
        "take",
        "sort",
        "line",
        "either",
        "goodness",
        "different",
        "rightness",
        "goodness",
        "seems",
        "simple",
        "monadic",
        "property",
        "thing",
        "property",
        "state",
        "affair",
        "people",
        "action",
        "act",
        "thought",
        "good",
        "whenever",
        "really",
        "thinking",
        "motive",
        "good",
        "act",
        "one",
        "done",
        "good",
        "motive",
        "prichard",
        "distinguished",
        "moral",
        "motive",
        "sense",
        "obligation",
        "ordinary",
        "motif",
        "desire",
        "desire",
        "sense",
        "obligation",
        "coordinate",
        "specie",
        "motive",
        "act",
        "origination",
        "change",
        "motive",
        "act",
        "act",
        "good",
        "bad",
        "think",
        "act",
        "together",
        "motive",
        "think",
        "thing",
        "good",
        "bad",
        "prichard",
        "used",
        "term",
        "action",
        "combination",
        "act",
        "motive",
        "officially",
        "always",
        "consistently",
        "act",
        "really",
        "good",
        "bad",
        "action",
        "might",
        "protest",
        "act",
        "surely",
        "good",
        "good",
        "consequence",
        "instrumentally",
        "good",
        "good",
        "mean",
        "though",
        "good",
        "instrument",
        "term",
        "instrumental",
        "value",
        "snare",
        "prichard",
        "response",
        "mean",
        "good",
        "way",
        "good",
        "obligatoriness",
        "completely",
        "different",
        "look",
        "initially",
        "obligatoriness",
        "one",
        "ought",
        "another",
        "monadic",
        "property",
        "distinct",
        "goodness",
        "thing",
        "property",
        "act",
        "motive",
        "act",
        "done",
        "irrelevant",
        "obligatoriness",
        "one",
        "one",
        "ought",
        "wrong",
        "reason",
        "bad",
        "motive",
        "agent",
        "obligatoriness",
        "outcome",
        "think",
        "action",
        "prichard",
        "official",
        "sense",
        "obligatory",
        "evidence",
        "confusion",
        "action",
        "one",
        "ought",
        "act",
        "involved",
        "origination",
        "one",
        "ought",
        "motif",
        "morally",
        "right",
        "wrong",
        "one",
        "obligation",
        "act",
        "certain",
        "motive",
        "two",
        "reason",
        "first",
        "one",
        "able",
        "choose",
        "motive",
        "one",
        "obligation",
        "something",
        "one",
        "capable",
        "choosing",
        "general",
        "either",
        "certain",
        "motif",
        "lot",
        "course",
        "try",
        "train",
        "better",
        "position",
        "next",
        "time",
        "second",
        "choose",
        "action",
        "motive",
        "act",
        "act",
        "already",
        "given",
        "separate",
        "motive",
        "choose",
        "action",
        "motive",
        "choice",
        "motive",
        "acting",
        "fact",
        "prichard",
        "held",
        "least",
        "came",
        "hold",
        "obligatoriness",
        "property",
        "act",
        "act",
        "ought",
        "done",
        "one",
        "obligatory",
        "agent",
        "one",
        "agent",
        "ought",
        "duty",
        "notion",
        "duty",
        "obligation",
        "ought",
        "really",
        "denote",
        "property",
        "agent",
        "much",
        "action",
        "obligatory",
        "agent",
        "obligation",
        "act",
        "way",
        "obligatoriness",
        "belonging",
        "act",
        "considering",
        "sense",
        "obligation",
        "recognition",
        "property",
        "act",
        "got",
        "addition",
        "normal",
        "property",
        "really",
        "sense",
        "one",
        "obliged",
        "ought",
        "act",
        "way",
        "one",
        "might",
        "think",
        "relation",
        "except",
        "act",
        "yet",
        "one",
        "related",
        "obligated",
        "way",
        "relation",
        "one",
        "obliged",
        "act",
        "way",
        "said",
        "beginning",
        "constituted",
        "fact",
        "act",
        "relation",
        "one",
        "stand",
        "others",
        "oneself",
        "see",
        "reason",
        "rejecting",
        "two",
        "inference",
        "action",
        "would",
        "good",
        "ought",
        "act",
        "would",
        "good",
        "result",
        "ought",
        "inference",
        "take",
        "u",
        "remark",
        "act",
        "action",
        "remark",
        "agent",
        "prichard",
        "asks",
        "u",
        "principle",
        "inference",
        "could",
        "possibly",
        "course",
        "prichard",
        "announce",
        "obligatoriness",
        "property",
        "act",
        "two",
        "argument",
        "first",
        "epistemic",
        "difficulty",
        "supposing",
        "act",
        "made",
        "obligatory",
        "objective",
        "matter",
        "fact",
        "nature",
        "attendant",
        "circumstance",
        "thing",
        "thing",
        "truly",
        "know",
        "case",
        "result",
        "action",
        "point",
        "prichard",
        "appealing",
        "theory",
        "knowledge",
        "inherited",
        "cook",
        "wilson",
        "would",
        "hardly",
        "ever",
        "able",
        "know",
        "duty",
        "thought",
        "duty",
        "thing",
        "know",
        "unbearable",
        "difficulty",
        "vanishes",
        "suppose",
        "ground",
        "duty",
        "objective",
        "nature",
        "situation",
        "way",
        "agent",
        "supposes",
        "thing",
        "make",
        "move",
        "suppose",
        "ground",
        "duty",
        "lie",
        "fact",
        "agent",
        "supposes",
        "make",
        "much",
        "easier",
        "think",
        "duty",
        "attaching",
        "agent",
        "rather",
        "act",
        "argument",
        "peculiarity",
        "see",
        "dancy",
        "prichard",
        "second",
        "argument",
        "equally",
        "idiosyncratic",
        "obligation",
        "action",
        "long",
        "action",
        "done",
        "obligation",
        "feature",
        "action",
        "since",
        "exists",
        "action",
        "must",
        "feature",
        "something",
        "else",
        "feature",
        "anything",
        "obvious",
        "candidate",
        "agent",
        "argument",
        "impressed",
        "prichard",
        "broad",
        "wrote",
        "find",
        "difficult",
        "persuade",
        "argument",
        "formidable",
        "think",
        "argument",
        "especially",
        "formidable",
        "exactly",
        "serve",
        "prevent",
        "error",
        "various",
        "sort",
        "error",
        "thinking",
        "deciding",
        "like",
        "choosing",
        "chocolate",
        "box",
        "action",
        "one",
        "choosing",
        "somehow",
        "laid",
        "one",
        "full",
        "particularity",
        "waiting",
        "chosen",
        "done",
        "present",
        "case",
        "question",
        "avoid",
        "argument",
        "without",
        "going",
        "prichard",
        "route",
        "true",
        "particular",
        "action",
        "obliged",
        "tomorrow",
        "obliged",
        "act",
        "certain",
        "way",
        "wide",
        "variety",
        "action",
        "would",
        "meet",
        "obligation",
        "obliged",
        "one",
        "rather",
        "pay",
        "money",
        "matter",
        "far",
        "go",
        "go",
        "help",
        "u",
        "understand",
        "obligatory",
        "owner",
        "obligatoriness",
        "belong",
        "acting",
        "certain",
        "way",
        "could",
        "would",
        "abandon",
        "idea",
        "obligatoriness",
        "character",
        "belonging",
        "acting",
        "way",
        "think",
        "instead",
        "something",
        "like",
        "obligatory",
        "p",
        "p",
        "stand",
        "v",
        "even",
        "quite",
        "work",
        "since",
        "seems",
        "specify",
        "state",
        "affair",
        "perhaps",
        "event",
        "obligatory",
        "make",
        "sense",
        "way",
        "resolve",
        "impasse",
        "take",
        "prichard",
        "way",
        "award",
        "obligation",
        "agent",
        "yielding",
        "obliged",
        "v",
        "prichard",
        "wanted",
        "take",
        "u",
        "one",
        "sens",
        "obligation",
        "one",
        "sens",
        "character",
        "oneself",
        "claim",
        "oneself",
        "act",
        "certain",
        "way",
        "sense",
        "obligation",
        "needed",
        "put",
        "oneself",
        "relevant",
        "situation",
        "consider",
        "various",
        "way",
        "acting",
        "available",
        "various",
        "relevant",
        "relation",
        "one",
        "stand",
        "others",
        "oneself",
        "lead",
        "sense",
        "obligation",
        "nothing",
        "much",
        "else",
        "moral",
        "philosophy",
        "certainly",
        "offer",
        "resource",
        "mistake",
        "moral",
        "philosophy",
        "rest",
        "revert",
        "title",
        "prichard",
        "famous",
        "article",
        "suppose",
        "otherwise",
        "despite",
        "article",
        "prichard",
        "address",
        "issue",
        "seems",
        "one",
        "point",
        "distinguish",
        "obligatory",
        "right",
        "suppose",
        "rightness",
        "still",
        "understood",
        "monadic",
        "property",
        "act",
        "like",
        "goodness",
        "correct",
        "reading",
        "introduces",
        "considerable",
        "complication",
        "see",
        "dancy",
        "comment"
    ]
}