{
    "main_text": "The Problem of Over-Demanding Beneficence\n4. The Problem of Over-Demanding Beneficence\n\n\nSome philosophers defend extremely demanding and far-reaching\nprinciples of obligatory beneficence. Peter Singer’s theory has been\nthe most widely discussed account. Singer has throughout his career\nbeen interested in how to reduce the evils of global harm and\nsuffering in the most effective manner. In his early work, Singer\ndistinguished between preventing evil and promoting good and contended\nthat persons in prosperous nations are morally obligated to prevent\nsomething bad or evil from happening if it is in their power to do so\nwithout having to sacrifice anything of comparable importance. The\nargument is that serious shortages of housing, food, and healthcare\nare harmful to human life and welfare and are preventable. If person P\nhas some capacity to prevent these evils—for example, by\ndonation to aid agencies—without loss of comparable item(s) of\nimportance, P acts unethically by not contributing to the alleviation\nof these shortages. Accordingly, in the face of preventable disease\nand poverty we are morally obligated to donate time or resources\ntoward their eradication until we reach a level at which, by giving\nmore, we would cause as much suffering to ourselves as we would\nrelieve through our gift. This demanding principle of beneficence\nrequires us to invest heavily in rescuing needy persons in the global\npopulation; merely donating at the level of local communities and\nnation states is insufficient. However, Singer leaves it open what\ncounts as being of comparable importance and as being an appropriate\nlevel of sacrifice.\n\n\nSinger’s principle implies that morality sometimes requires us\nto make enormous sacrifices. The demand is placed not only on\nindividuals with disposable incomes, but on all reasonably well-off\npersons, foundations, governments, corporations, etc. All parties have\nmoral obligations to refrain from spending resources on nonessential\nitems and to use the available resources or savings to lend assistance\nto those in urgent need. Frills, fashion, luxuries, and the like are\nnever to determine expenditures, and one is to give to the needy up to\nthe point that one (or one’s dependent) would be impoverished. Singer\ndoes not regard such conduct as an enormous moral sacrifice, but only\nas the discharge of a basic obligation of beneficence.\n\n\nSinger’s proposals have struck many as overly demanding,\nimpracticable, and a significant departure from the demands of ordinary\nmorality. This assessment has generated a number of criticisms, as well\nas defenses, of demanding principles of beneficence such as the one he\nproposes. Critics argue that a principle of beneficence that requires\npersons, governments, and corporations to seriously disrupt their\nprojects and plans in order to benefit the poor and underprivileged\nexceeds the demands of ordinary moral obligations and has no plausible\ngrounding in normative moral theory about obligations. They argue that\nthe line between the obligatory and the supererogatory has been\nunjustifiably erased by such a principle. In effect, the claim is that\nSinger’s aspirational moral ideal is an attempt to redraw\nestablished lines in morality that distinguish between moral obligation\nand supererogatory moral ideals.\n\n\nIn response to criticism Singer has attempted to reformulate his\nposition so that his theory of beneficence does not set an overly\ndemanding standard. He maintains that no clear justification exists for\nthe claim that obligations of ordinary morality do not contain a\ndemanding principle of beneficence, in particular a strong\nharm-prevention principle. He apparently would explain the lack of\nconcern often shown for poverty relief as a failure to draw the correct\nimplications from the very principles of beneficence that ordinary\nmorality embraces and that utilitarian moral theory justifies. Later in\nhis series of publications on the subject, Singer has attempted to take\naccount of objections that his principle sets an unduly high standard.\nHe has not given up his strong principle of beneficence, but he has\nsuggested that it might be morally wise and most productive to\npublicly advocate a lower standard—that is, a weakened\nprinciple of beneficence. He therefore has proposed a more guarded\nformulation of the principle, arguing that we should strive for\ndonations of a percentage of income, such as 10 per cent, which amounts\nto more than a token donation and yet also is not so high as to make us\nmiserable or turn us into moral saints. This standard, Singer suggests,\nis the minimum that we ought to do to conform to obligations of\nbeneficence.\n\n\nControversy continues in philosophy about how to analyze and\nevaluate the commitments of a principle of beneficence, including how\nto formulate limits that reduce required burdens on agents’ life plans\nand make meeting the obligations of beneficence a realistic\npossibility. Various writers have noted that even after many persons\nhave donated generous portions of their income, they could still donate\nmore while living decent lives; and, according a strong principle of\nbeneficence demands that they should donate more. Recent ethical theory\nshows that establishing the theoretical and practical standards of\ndonation and sacrifice is challenging, and perhaps an impossible\nideal.\n\n\nHowever, it does not follow that we should give up a principle of\nbeneficence. It only follows that establishing the moral limits of the\ndemands of beneficence is profoundly difficult. Liam Murphy has\ndiscussed a number of “limited principles of beneficence”\nand has proposed to fix the limits of individual beneficence to meet\nglobal problems of need by using a cooperative principle of fairness in\nwhich, in any given circumstance, it must first be determined what each\nreasonably affluent person must do to contribute a fair share to an\noptimal outcome. An individual is only required to aid others\nbeneficently at the level that would produce the best consequences if\nall in society were to give their fair share. One is not required to do\nmore even if others fail to act on their fair-share obligations of\nbeneficence, and it would be an unfair imposition of responsibility to\nask more of them. Unlike act-consequentialism, this theory does not\ndemand more of agents when non-complying agents fail to do their\npart.\n\n\nMurphy’s cooperative principle is intuitively attractive, but it may\nnot have the necessary moral punch to address issues such as global\npoverty. Murphy seems right to suggest that large-scale problems\nrequiring beneficence should be conceived as cooperative projects, but\nhis limit on individual obligations seems unlikely to have a practical\neffect of increasing international aid and the like beyond present\ncommitments and levels. If, as is to be expected in virtually all\nsituations of global poverty, others fail to comply with their\nfair-share obligations of beneficence as set out in this demanding\ntheory, it is not clear why each person’s obligation is set only by the\noriginal calculation of a single fair share. This is not to say that\nSinger’s approach is superior. The more demanding a principle is, the\nless likely are people to comply with its demands. Also, at an\nintuitive level, Murphy seems right that an individual’s obligations of\nbeneficence should not increase to fill gaps merely because others are\nfailing to meet their obligations.\n\n\nSinger has defended his arguments about beneficence, with a somewhat\nsympathetic response to Murphy. Singer seems concerned with which\nsocial conditions will motivate people to give, rather than\nwith attempting to determine obligations of beneficence with precision.\nHe responds to critics such as Murphy by conceding that perhaps the\nlimit we should publicly advocate as a level of giving is no\nmore than a person’s fair share of what is needed to relieve poverty\nand the like. Unless we draw the line here, we might not be able to\nmotivate people to give at all. A fair share seems to be a lower\nthreshold of one’s obligations than the obligations Singer originally\nenvisaged, but more realistic. The emphasis on motivation is presumably\nintended to provide a more subtle and convincing approach to increasing\ncharitable donations even though the nature and limits of beneficence\nshould be set by his utilitarian moral theory, as he has always\nproposed.\n\n\nWherever the line of precise limits of obligatory beneficence is\ndrawn, the line is likely to be revisionary of ordinary morality.\nSinger’s proposals, unlike Murphy’s, represent a revision of ordinary\nmorality’s requirements of beneficence. A variety of proposals\nregarding the limits of beneficence have been made by philosophers, but\nno agreement exists on even a single general principle. Given this\nsituation, some now doubt that ethical theory and practical\ndeliberation are equipped to establish precise conditions and limits of\nobligations of beneficence, especially when confronting problems of\nglobal poverty.\n",
    "section_title": "4. The Problem of Over-Demanding Beneficence",
    "entry_title": "The Principle of Beneficence in Applied Ethics",
    "hierarchy_title": "The Principle of Beneficence in Applied Ethics || The Problem of Over-Demanding Beneficence",
    "tokenized_text": [
        "problem",
        "overdemanding",
        "beneficence",
        "problem",
        "overdemanding",
        "beneficence",
        "philosopher",
        "defend",
        "extremely",
        "demanding",
        "farreaching",
        "principle",
        "obligatory",
        "beneficence",
        "peter",
        "singer",
        "theory",
        "widely",
        "discussed",
        "account",
        "singer",
        "throughout",
        "career",
        "interested",
        "reduce",
        "evil",
        "global",
        "harm",
        "suffering",
        "effective",
        "manner",
        "early",
        "work",
        "singer",
        "distinguished",
        "preventing",
        "evil",
        "promoting",
        "good",
        "contended",
        "person",
        "prosperous",
        "nation",
        "morally",
        "obligated",
        "prevent",
        "something",
        "bad",
        "evil",
        "happening",
        "power",
        "without",
        "sacrifice",
        "anything",
        "comparable",
        "importance",
        "argument",
        "serious",
        "shortage",
        "housing",
        "food",
        "healthcare",
        "harmful",
        "human",
        "life",
        "welfare",
        "preventable",
        "person",
        "p",
        "capacity",
        "prevent",
        "evilsfor",
        "example",
        "donation",
        "aid",
        "agencieswithout",
        "loss",
        "comparable",
        "item",
        "importance",
        "p",
        "act",
        "unethically",
        "contributing",
        "alleviation",
        "shortage",
        "accordingly",
        "face",
        "preventable",
        "disease",
        "poverty",
        "morally",
        "obligated",
        "donate",
        "time",
        "resource",
        "toward",
        "eradication",
        "reach",
        "level",
        "giving",
        "would",
        "cause",
        "much",
        "suffering",
        "would",
        "relieve",
        "gift",
        "demanding",
        "principle",
        "beneficence",
        "requires",
        "u",
        "invest",
        "heavily",
        "rescuing",
        "needy",
        "person",
        "global",
        "population",
        "merely",
        "donating",
        "level",
        "local",
        "community",
        "nation",
        "state",
        "insufficient",
        "however",
        "singer",
        "leaf",
        "open",
        "count",
        "comparable",
        "importance",
        "appropriate",
        "level",
        "sacrifice",
        "singer",
        "principle",
        "implies",
        "morality",
        "sometimes",
        "requires",
        "u",
        "make",
        "enormous",
        "sacrifice",
        "demand",
        "placed",
        "individual",
        "disposable",
        "income",
        "reasonably",
        "welloff",
        "person",
        "foundation",
        "government",
        "corporation",
        "etc",
        "party",
        "moral",
        "obligation",
        "refrain",
        "spending",
        "resource",
        "nonessential",
        "item",
        "use",
        "available",
        "resource",
        "saving",
        "lend",
        "assistance",
        "urgent",
        "need",
        "frill",
        "fashion",
        "luxury",
        "like",
        "never",
        "determine",
        "expenditure",
        "one",
        "give",
        "needy",
        "point",
        "one",
        "one",
        "dependent",
        "would",
        "impoverished",
        "singer",
        "regard",
        "conduct",
        "enormous",
        "moral",
        "sacrifice",
        "discharge",
        "basic",
        "obligation",
        "beneficence",
        "singer",
        "proposal",
        "struck",
        "many",
        "overly",
        "demanding",
        "impracticable",
        "significant",
        "departure",
        "demand",
        "ordinary",
        "morality",
        "assessment",
        "generated",
        "number",
        "criticism",
        "well",
        "defense",
        "demanding",
        "principle",
        "beneficence",
        "one",
        "proposes",
        "critic",
        "argue",
        "principle",
        "beneficence",
        "requires",
        "person",
        "government",
        "corporation",
        "seriously",
        "disrupt",
        "project",
        "plan",
        "order",
        "benefit",
        "poor",
        "underprivileged",
        "exceeds",
        "demand",
        "ordinary",
        "moral",
        "obligation",
        "plausible",
        "grounding",
        "normative",
        "moral",
        "theory",
        "obligation",
        "argue",
        "line",
        "obligatory",
        "supererogatory",
        "unjustifiably",
        "erased",
        "principle",
        "effect",
        "claim",
        "singer",
        "aspirational",
        "moral",
        "ideal",
        "attempt",
        "redraw",
        "established",
        "line",
        "morality",
        "distinguish",
        "moral",
        "obligation",
        "supererogatory",
        "moral",
        "ideal",
        "response",
        "criticism",
        "singer",
        "attempted",
        "reformulate",
        "position",
        "theory",
        "beneficence",
        "set",
        "overly",
        "demanding",
        "standard",
        "maintains",
        "clear",
        "justification",
        "exists",
        "claim",
        "obligation",
        "ordinary",
        "morality",
        "contain",
        "demanding",
        "principle",
        "beneficence",
        "particular",
        "strong",
        "harmprevention",
        "principle",
        "apparently",
        "would",
        "explain",
        "lack",
        "concern",
        "often",
        "shown",
        "poverty",
        "relief",
        "failure",
        "draw",
        "correct",
        "implication",
        "principle",
        "beneficence",
        "ordinary",
        "morality",
        "embrace",
        "utilitarian",
        "moral",
        "theory",
        "justifies",
        "later",
        "series",
        "publication",
        "subject",
        "singer",
        "attempted",
        "take",
        "account",
        "objection",
        "principle",
        "set",
        "unduly",
        "high",
        "standard",
        "given",
        "strong",
        "principle",
        "beneficence",
        "suggested",
        "might",
        "morally",
        "wise",
        "productive",
        "publicly",
        "advocate",
        "lower",
        "standardthat",
        "weakened",
        "principle",
        "beneficence",
        "therefore",
        "proposed",
        "guarded",
        "formulation",
        "principle",
        "arguing",
        "strive",
        "donation",
        "percentage",
        "income",
        "per",
        "cent",
        "amount",
        "token",
        "donation",
        "yet",
        "also",
        "high",
        "make",
        "u",
        "miserable",
        "turn",
        "u",
        "moral",
        "saint",
        "standard",
        "singer",
        "suggests",
        "minimum",
        "ought",
        "conform",
        "obligation",
        "beneficence",
        "controversy",
        "continues",
        "philosophy",
        "analyze",
        "evaluate",
        "commitment",
        "principle",
        "beneficence",
        "including",
        "formulate",
        "limit",
        "reduce",
        "required",
        "burden",
        "agent",
        "life",
        "plan",
        "make",
        "meeting",
        "obligation",
        "beneficence",
        "realistic",
        "possibility",
        "various",
        "writer",
        "noted",
        "even",
        "many",
        "person",
        "donated",
        "generous",
        "portion",
        "income",
        "could",
        "still",
        "donate",
        "living",
        "decent",
        "life",
        "according",
        "strong",
        "principle",
        "beneficence",
        "demand",
        "donate",
        "recent",
        "ethical",
        "theory",
        "show",
        "establishing",
        "theoretical",
        "practical",
        "standard",
        "donation",
        "sacrifice",
        "challenging",
        "perhaps",
        "impossible",
        "ideal",
        "however",
        "follow",
        "give",
        "principle",
        "beneficence",
        "follows",
        "establishing",
        "moral",
        "limit",
        "demand",
        "beneficence",
        "profoundly",
        "difficult",
        "liam",
        "murphy",
        "discussed",
        "number",
        "limited",
        "principle",
        "beneficence",
        "proposed",
        "fix",
        "limit",
        "individual",
        "beneficence",
        "meet",
        "global",
        "problem",
        "need",
        "using",
        "cooperative",
        "principle",
        "fairness",
        "given",
        "circumstance",
        "must",
        "first",
        "determined",
        "reasonably",
        "affluent",
        "person",
        "must",
        "contribute",
        "fair",
        "share",
        "optimal",
        "outcome",
        "individual",
        "required",
        "aid",
        "others",
        "beneficently",
        "level",
        "would",
        "produce",
        "best",
        "consequence",
        "society",
        "give",
        "fair",
        "share",
        "one",
        "required",
        "even",
        "others",
        "fail",
        "act",
        "fairshare",
        "obligation",
        "beneficence",
        "would",
        "unfair",
        "imposition",
        "responsibility",
        "ask",
        "unlike",
        "actconsequentialism",
        "theory",
        "demand",
        "agent",
        "noncomplying",
        "agent",
        "fail",
        "part",
        "murphy",
        "cooperative",
        "principle",
        "intuitively",
        "attractive",
        "may",
        "necessary",
        "moral",
        "punch",
        "address",
        "issue",
        "global",
        "poverty",
        "murphy",
        "seems",
        "right",
        "suggest",
        "largescale",
        "problem",
        "requiring",
        "beneficence",
        "conceived",
        "cooperative",
        "project",
        "limit",
        "individual",
        "obligation",
        "seems",
        "unlikely",
        "practical",
        "effect",
        "increasing",
        "international",
        "aid",
        "like",
        "beyond",
        "present",
        "commitment",
        "level",
        "expected",
        "virtually",
        "situation",
        "global",
        "poverty",
        "others",
        "fail",
        "comply",
        "fairshare",
        "obligation",
        "beneficence",
        "set",
        "demanding",
        "theory",
        "clear",
        "person",
        "obligation",
        "set",
        "original",
        "calculation",
        "single",
        "fair",
        "share",
        "say",
        "singer",
        "approach",
        "superior",
        "demanding",
        "principle",
        "le",
        "likely",
        "people",
        "comply",
        "demand",
        "also",
        "intuitive",
        "level",
        "murphy",
        "seems",
        "right",
        "individual",
        "obligation",
        "beneficence",
        "increase",
        "fill",
        "gap",
        "merely",
        "others",
        "failing",
        "meet",
        "obligation",
        "singer",
        "defended",
        "argument",
        "beneficence",
        "somewhat",
        "sympathetic",
        "response",
        "murphy",
        "singer",
        "seems",
        "concerned",
        "social",
        "condition",
        "motivate",
        "people",
        "give",
        "rather",
        "attempting",
        "determine",
        "obligation",
        "beneficence",
        "precision",
        "responds",
        "critic",
        "murphy",
        "conceding",
        "perhaps",
        "limit",
        "publicly",
        "advocate",
        "level",
        "giving",
        "person",
        "fair",
        "share",
        "needed",
        "relieve",
        "poverty",
        "like",
        "unless",
        "draw",
        "line",
        "might",
        "able",
        "motivate",
        "people",
        "give",
        "fair",
        "share",
        "seems",
        "lower",
        "threshold",
        "one",
        "obligation",
        "obligation",
        "singer",
        "originally",
        "envisaged",
        "realistic",
        "emphasis",
        "motivation",
        "presumably",
        "intended",
        "provide",
        "subtle",
        "convincing",
        "approach",
        "increasing",
        "charitable",
        "donation",
        "even",
        "though",
        "nature",
        "limit",
        "beneficence",
        "set",
        "utilitarian",
        "moral",
        "theory",
        "always",
        "proposed",
        "wherever",
        "line",
        "precise",
        "limit",
        "obligatory",
        "beneficence",
        "drawn",
        "line",
        "likely",
        "revisionary",
        "ordinary",
        "morality",
        "singer",
        "proposal",
        "unlike",
        "murphy",
        "represent",
        "revision",
        "ordinary",
        "morality",
        "requirement",
        "beneficence",
        "variety",
        "proposal",
        "regarding",
        "limit",
        "beneficence",
        "made",
        "philosopher",
        "agreement",
        "exists",
        "even",
        "single",
        "general",
        "principle",
        "given",
        "situation",
        "doubt",
        "ethical",
        "theory",
        "practical",
        "deliberation",
        "equipped",
        "establish",
        "precise",
        "condition",
        "limit",
        "obligation",
        "beneficence",
        "especially",
        "confronting",
        "problem",
        "global",
        "poverty"
    ]
}