{
    "main_text": "Overview\n1. Overview\n\nPrincipia Mathematica, the landmark work in formal logic\nwritten by\n Alfred North Whitehead\n and\n Bertrand Russell,\n was first published in three volumes in 1910, 1912 and 1913. A second\nedition appeared in 1925 (Volume I) and 1927 (Volumes II and III). In\n1962 an abbreviated issue (containing only the first 56 chapters)\nappeared in paperback.\n\nWritten as a defense of logicism (the thesis that mathematics\nis in some significant sense reducible to logic), the book was\ninstrumental in developing and popularizing modern mathematical logic.\nIt also served as a major impetus for research in the foundations of\nmathematics throughout the twentieth century. Along with\nAristotle’s Organon and Gottlob Frege’s\nBasic Laws of Arithmetic, it remains one of the most\ninfluential books on logic ever written.\n\nThis entry includes a presentation of the main definitions and\ntheorems used in the development of the logicist project in PM. The\nentry indicates a path through the whole work presenting the basic\nresults proved in Principia Mathematica (PM) in a somewhat\nmore contemporary notation, so as to make it easy to compare the\nsystem of Whitehead and Russell with that of Frege, the other most\nprominent advocate of logicism in the foundations of mathematics. The\naim of that program, as described by Russell in the opening lines of\nthe preface to his 1903 book The Principles of Mathematics,\nnamely to define mathematical notions in terms of logical notions, and\nto derive mathematical principles, so defined, from logical principles\nalone:\n\n\nThe present work has two main objects. One of these, the proof that\nall pure mathematics deals exclusively with concepts definable in\nterms of a very small number of fundamental concepts, and that all its\npropositions are deducible from a very small number of fundamental\nlogical principles, is undertaken in Parts II–VII of this work,\nand will be established by strict symbolic reasoning in Volume\nII.…The other object of this work, which occupies Part I., is\nthe explanation of the fundamental concepts which mathematics accepts\nas indefinable. This is a purely philosophical task…. (1903:\nxv)\n\n\nThough Frege’s system was subject to Russell’s Paradox,\nsubsequent examination of his system shows how much of the development\nof arithmetic is possible independently of the paradoxical elements of\nthe system. In particular, recent interest in Frege’s system has\nled to the isolation of what is called “Frege’s\nTheorem” as possible in a consistent fragment of Frege’s\noriginal system, and from it the goal of deriving arithmetic, as\nformalized in Peano’s Postulates. See the entry\n Frege’s theorem and foundations for arithmetic,\n which presents this aspect of Frege’s system in contemporary\nnotation.\n\nRussell had written The Principles of Mathematics (PoM),\nwhich presents the basic elements of his logicist program, before\ndiscovering Frege’s similar work in Foundations of\nArithmetic and Basic Laws of Arithmetic, in\nJune of 1902. As he describes in the Preface, Russell intended a\nformal presentation of his account in a “Volume II” of\nPoM. In 1903 he enlisted Alfred North Whitehead to join him in the\nwriting of this second volume, but soon the project turned into a new\nwork, Principia Mathematica, a massive three volume work,\nthat was not to be published until 1910 (Volume I), 1912 (Volume II)\nand 1913 (Volume III).\n\nThe system of PM differed significantly from Frege’s system, in\na large part because of the introduction of the theory of\ntypes whose purpose was to avoid the paradox that had affected\nFrege in a principled fashion. A second important difference from\nFrege’s system is that PM is based on a logic of relations of\nvarious numbers of arguments, whereas Frege’s system was based\non the notions of function and object, with even his distinctively\nlogical concepts being seen as functions (from a number of\nobjects to the truth values T and F, which are also objects in\nFrege’s system.) So, it might be said that PM is based on a\ntheory of ramified types of relations, in contrast to Frege’s\nsecond order predicate calculus with concepts. The most important step\nis to define set expressions in terms of higher-order functions. Thus\nthe paradoxical “Russell set”, the set of all sets which\nare not members of themselves, \\(\\{ x \\mid x \\notin x\\}\\), is defined by\nan expression involving functions that will violate the theory of\ntypes. The expression for the offending class is ruled out on the\nbasis of the theory of types, as is its seeming innocuous complement,\nthe set of all sets that are members of themselves, \\(\\{ x\n\\mid x \\in x\\}\\). In contemporary set theory \\(\\{ x \\mid x \\notin\nx\\}\\) is the universe of sets, which is not itself a set, and because\nno set is an element of itself, \\(\\{ x \\mid x \\in x\\}\\) is just the\nempty set. An additional cost of this method is that while for Frege\nsets are objects of the lowest types, there will be sets in the PM\ntheory in a simple theory of types, which distinguishes\nindividuals and sets of individuals and sets of sets of individuals,\netc. Even to derive a hierarchy of sets in the simple theory the\naxiom of reducibility is needed to guarantee that more\ncomplex “impredicative” definitions pick out sets of the\nsame simple type. Thus the “least upper bound” of a closed\ninterval of real numbers will identify a member of that set of a\nhigher order in the ramified theory. That this least upper bound will\nbe of the same simple type requires the axiom of reducibily. The cost\nof adopting the theory of types to avoid the paradox extends to\ndifficulties in constructing the natural numbers. While Russell\nfollows Frege in many important details, in particular in using\nFrege’s notion of the ancestral of the successor relation to\ndefine the natural numbers, other parts of the construction are\nimportantly different. Frege was able to define the successor of a\nnumber by using the set of its predecessors.  The number 2 is the set\ncontaining 0 and 1, and thus it has two members. They will, however,\nbe of different types in the hierarchy of simple types, and so the\nwhole set of natural numbers cannot be defined within the theory of\nsimple types. Since each step from 0 to 1, to 2, etc, raises the\nsimple types from 0 to 1 to 2, there will be no simple type of all the\nnatural numbers, so defined. Instead PM adopts the axiom of\ninfinity which assures the existence of an infinite number of\nindividuals, allowing for the construction of the natural numbers for\neach type above a lower bound of 3 or so (as numbers will be sets of\nequinumerous sets of individuals…).\n\nWith this turn to the ramified theory of types, along with the extra\naxioms of reducibility, and infinity, it is possible for PM to define\na version of Frege’s construction of the Natural Numbers so that\nthe “Peano axioms” can be proved from logic alone. This\ntakes up to section ∗120, well into Volume II. At\nthis point the alternative to “Frege’s Theorem” is\ncompleted, in the sense that we are presented with a consistent\ndevelopment of the natural numbers, based on a theory of higher-order\nlogic with a number of additional axioms. Philosophers soon followed\nLudwig Wittgenstein (1922) and disputed the idea that these additional\naxioms, the axioms of reducibility and infinity, are really logical\ntruths, and so denied that the logicist program of reducing arithmetic\nto logic was any more successful than Frege’s attempt had\nbeen.\n\nThe survey of PM will proceed through the remainder of Volume II and\nthrough Volume III, where the theories of rational and real numbers\nare developed. The contrast intended here is not with Frege’s\ntheories of rational and real numbers, which are present in\nGrundgesetze but are not seen as a natural extension of the\ntheory of natural numbers. Instead the contemporary account of natural\nnumbers and real numbers is seen as an elementary extension of the\naxiomatic Zermelo-Frankel set theory. A contemporary textbook in\naxiomatic set theory, such as Enderton (1977) or Suppes (1960), shows\nhow to construct rational numbers (and negative integers) as pairs of\nnatural numbers, thus 3/4 is constructed as the pair with the\noperations of addition and multiplication defined as operations on\npairs; thus \\(1/2 + 1/3 = 10/12 = 5/6\\). These positive rational\nnumbers are extended to the whole set by adding negative integers, and\nthen real numbers are defined as Dedekind cuts in the rational\nnumbers, i.e., the set of partitions of sets of rational numbers. The\narithmetic of real numbers is then defined for these constructions,\nand so with sets of real numbers the whole of analysis can be reduced\nto arithmetic. PM, however, avoids this “arithmetization”\nof analysis, but instead defines rational, real and in fact a huge\nclass of “relation numbers” as sets of isomorphic sets of\nrelations. Russell says later that he regrets that the theory of\nrelation numbers was not picked up by later set theorists, even though\nthis was some of his most original work in PM. The brief summary of\nthese later topics that we include below, can therefore be seen as a\nsummary of the interesting consequences of taking a different route to\nthe definition of natural numbers based on a logic of relations and\nproperties, rather than the set theory of contemporary foundations of\nmathematics. This entry is thus aimed at an explication of the unusual\norder of presentation of these results, in comparison with both Frege\nand contemporary set theory, and to illustrate these aspects of the\ntheory of relations that are not investigated by contemporary\nresearchers.\n",
    "section_title": "1. Overview",
    "entry_title": "Principia Mathematica",
    "hierarchy_title": "Principia Mathematica || Overview",
    "tokenized_text": [
        "overview",
        "overview",
        "principia",
        "mathematica",
        "landmark",
        "work",
        "formal",
        "logic",
        "written",
        "alfred",
        "north",
        "whitehead",
        "bertrand",
        "russell",
        "first",
        "published",
        "three",
        "volume",
        "second",
        "edition",
        "appeared",
        "volume",
        "volume",
        "ii",
        "iii",
        "abbreviated",
        "issue",
        "containing",
        "first",
        "chapter",
        "appeared",
        "paperback",
        "written",
        "defense",
        "logicism",
        "thesis",
        "mathematics",
        "significant",
        "sense",
        "reducible",
        "logic",
        "book",
        "instrumental",
        "developing",
        "popularizing",
        "modern",
        "mathematical",
        "logic",
        "also",
        "served",
        "major",
        "impetus",
        "research",
        "foundation",
        "mathematics",
        "throughout",
        "twentieth",
        "century",
        "along",
        "aristotle",
        "organon",
        "gottlob",
        "frege",
        "basic",
        "law",
        "arithmetic",
        "remains",
        "one",
        "influential",
        "book",
        "logic",
        "ever",
        "written",
        "entry",
        "includes",
        "presentation",
        "main",
        "definition",
        "theorem",
        "used",
        "development",
        "logicist",
        "project",
        "pm",
        "entry",
        "indicates",
        "path",
        "whole",
        "work",
        "presenting",
        "basic",
        "result",
        "proved",
        "principia",
        "mathematica",
        "pm",
        "somewhat",
        "contemporary",
        "notation",
        "make",
        "easy",
        "compare",
        "system",
        "whitehead",
        "russell",
        "frege",
        "prominent",
        "advocate",
        "logicism",
        "foundation",
        "mathematics",
        "aim",
        "program",
        "described",
        "russell",
        "opening",
        "line",
        "preface",
        "book",
        "principle",
        "mathematics",
        "namely",
        "define",
        "mathematical",
        "notion",
        "term",
        "logical",
        "notion",
        "derive",
        "mathematical",
        "principle",
        "defined",
        "logical",
        "principle",
        "alone",
        "present",
        "work",
        "two",
        "main",
        "object",
        "one",
        "proof",
        "pure",
        "mathematics",
        "deal",
        "exclusively",
        "concept",
        "definable",
        "term",
        "small",
        "number",
        "fundamental",
        "concept",
        "proposition",
        "deducible",
        "small",
        "number",
        "fundamental",
        "logical",
        "principle",
        "undertaken",
        "part",
        "iivii",
        "work",
        "established",
        "strict",
        "symbolic",
        "reasoning",
        "volume",
        "iithe",
        "object",
        "work",
        "occupies",
        "part",
        "i",
        "explanation",
        "fundamental",
        "concept",
        "mathematics",
        "accepts",
        "indefinable",
        "purely",
        "philosophical",
        "task",
        "xv",
        "though",
        "frege",
        "system",
        "subject",
        "russell",
        "paradox",
        "subsequent",
        "examination",
        "system",
        "show",
        "much",
        "development",
        "arithmetic",
        "possible",
        "independently",
        "paradoxical",
        "element",
        "system",
        "particular",
        "recent",
        "interest",
        "frege",
        "system",
        "led",
        "isolation",
        "called",
        "frege",
        "theorem",
        "possible",
        "consistent",
        "fragment",
        "frege",
        "original",
        "system",
        "goal",
        "deriving",
        "arithmetic",
        "formalized",
        "peano",
        "postulate",
        "see",
        "entry",
        "frege",
        "theorem",
        "foundation",
        "arithmetic",
        "present",
        "aspect",
        "frege",
        "system",
        "contemporary",
        "notation",
        "russell",
        "written",
        "principle",
        "mathematics",
        "pom",
        "present",
        "basic",
        "element",
        "logicist",
        "program",
        "discovering",
        "frege",
        "similar",
        "work",
        "foundation",
        "arithmetic",
        "basic",
        "law",
        "arithmetic",
        "june",
        "describes",
        "preface",
        "russell",
        "intended",
        "formal",
        "presentation",
        "account",
        "volume",
        "ii",
        "pom",
        "enlisted",
        "alfred",
        "north",
        "whitehead",
        "join",
        "writing",
        "second",
        "volume",
        "soon",
        "project",
        "turned",
        "new",
        "work",
        "principia",
        "mathematica",
        "massive",
        "three",
        "volume",
        "work",
        "published",
        "volume",
        "volume",
        "ii",
        "volume",
        "iii",
        "system",
        "pm",
        "differed",
        "significantly",
        "frege",
        "system",
        "large",
        "part",
        "introduction",
        "theory",
        "type",
        "whose",
        "purpose",
        "avoid",
        "paradox",
        "affected",
        "frege",
        "principled",
        "fashion",
        "second",
        "important",
        "difference",
        "frege",
        "system",
        "pm",
        "based",
        "logic",
        "relation",
        "various",
        "number",
        "argument",
        "whereas",
        "frege",
        "system",
        "based",
        "notion",
        "function",
        "object",
        "even",
        "distinctively",
        "logical",
        "concept",
        "seen",
        "function",
        "number",
        "object",
        "truth",
        "value",
        "f",
        "also",
        "object",
        "frege",
        "system",
        "might",
        "said",
        "pm",
        "based",
        "theory",
        "ramified",
        "type",
        "relation",
        "contrast",
        "frege",
        "second",
        "order",
        "predicate",
        "calculus",
        "concept",
        "important",
        "step",
        "define",
        "set",
        "expression",
        "term",
        "higherorder",
        "function",
        "thus",
        "paradoxical",
        "russell",
        "set",
        "set",
        "set",
        "member",
        "x",
        "mid",
        "x",
        "notin",
        "x",
        "defined",
        "expression",
        "involving",
        "function",
        "violate",
        "theory",
        "type",
        "expression",
        "offending",
        "class",
        "ruled",
        "basis",
        "theory",
        "type",
        "seeming",
        "innocuous",
        "complement",
        "set",
        "set",
        "member",
        "x",
        "mid",
        "x",
        "in",
        "x",
        "contemporary",
        "set",
        "theory",
        "x",
        "mid",
        "x",
        "notin",
        "x",
        "universe",
        "set",
        "set",
        "set",
        "element",
        "x",
        "mid",
        "x",
        "in",
        "x",
        "empty",
        "set",
        "additional",
        "cost",
        "method",
        "frege",
        "set",
        "object",
        "lowest",
        "type",
        "set",
        "pm",
        "theory",
        "simple",
        "theory",
        "type",
        "distinguishes",
        "individual",
        "set",
        "individual",
        "set",
        "set",
        "individual",
        "etc",
        "even",
        "derive",
        "hierarchy",
        "set",
        "simple",
        "theory",
        "axiom",
        "reducibility",
        "needed",
        "guarantee",
        "complex",
        "impredicative",
        "definition",
        "pick",
        "set",
        "simple",
        "type",
        "thus",
        "least",
        "upper",
        "bound",
        "closed",
        "interval",
        "real",
        "number",
        "identify",
        "member",
        "set",
        "higher",
        "order",
        "ramified",
        "theory",
        "least",
        "upper",
        "bound",
        "simple",
        "type",
        "requires",
        "axiom",
        "reducibily",
        "cost",
        "adopting",
        "theory",
        "type",
        "avoid",
        "paradox",
        "extends",
        "difficulty",
        "constructing",
        "natural",
        "number",
        "russell",
        "follows",
        "frege",
        "many",
        "important",
        "detail",
        "particular",
        "using",
        "frege",
        "notion",
        "ancestral",
        "successor",
        "relation",
        "define",
        "natural",
        "number",
        "part",
        "construction",
        "importantly",
        "different",
        "frege",
        "able",
        "define",
        "successor",
        "number",
        "using",
        "set",
        "predecessor",
        "number",
        "set",
        "containing",
        "thus",
        "two",
        "member",
        "however",
        "different",
        "type",
        "hierarchy",
        "simple",
        "type",
        "whole",
        "set",
        "natural",
        "number",
        "defined",
        "within",
        "theory",
        "simple",
        "type",
        "since",
        "step",
        "etc",
        "raise",
        "simple",
        "type",
        "simple",
        "type",
        "natural",
        "number",
        "defined",
        "instead",
        "pm",
        "adopts",
        "axiom",
        "infinity",
        "assures",
        "existence",
        "infinite",
        "number",
        "individual",
        "allowing",
        "construction",
        "natural",
        "number",
        "type",
        "lower",
        "bound",
        "number",
        "set",
        "equinumerous",
        "set",
        "individuals",
        "turn",
        "ramified",
        "theory",
        "type",
        "along",
        "extra",
        "axiom",
        "reducibility",
        "infinity",
        "possible",
        "pm",
        "define",
        "version",
        "frege",
        "construction",
        "natural",
        "number",
        "peano",
        "axiom",
        "proved",
        "logic",
        "alone",
        "take",
        "section",
        "well",
        "volume",
        "ii",
        "point",
        "alternative",
        "frege",
        "theorem",
        "completed",
        "sense",
        "presented",
        "consistent",
        "development",
        "natural",
        "number",
        "based",
        "theory",
        "higherorder",
        "logic",
        "number",
        "additional",
        "axiom",
        "philosopher",
        "soon",
        "followed",
        "ludwig",
        "wittgenstein",
        "disputed",
        "idea",
        "additional",
        "axiom",
        "axiom",
        "reducibility",
        "infinity",
        "really",
        "logical",
        "truth",
        "denied",
        "logicist",
        "program",
        "reducing",
        "arithmetic",
        "logic",
        "successful",
        "frege",
        "attempt",
        "survey",
        "pm",
        "proceed",
        "remainder",
        "volume",
        "ii",
        "volume",
        "iii",
        "theory",
        "rational",
        "real",
        "number",
        "developed",
        "contrast",
        "intended",
        "frege",
        "theory",
        "rational",
        "real",
        "number",
        "present",
        "grundgesetze",
        "seen",
        "natural",
        "extension",
        "theory",
        "natural",
        "number",
        "instead",
        "contemporary",
        "account",
        "natural",
        "number",
        "real",
        "number",
        "seen",
        "elementary",
        "extension",
        "axiomatic",
        "zermelofrankel",
        "set",
        "theory",
        "contemporary",
        "textbook",
        "axiomatic",
        "set",
        "theory",
        "enderton",
        "suppes",
        "show",
        "construct",
        "rational",
        "number",
        "negative",
        "integer",
        "pair",
        "natural",
        "number",
        "thus",
        "constructed",
        "pair",
        "operation",
        "addition",
        "multiplication",
        "defined",
        "operation",
        "pair",
        "thus",
        "positive",
        "rational",
        "number",
        "extended",
        "whole",
        "set",
        "adding",
        "negative",
        "integer",
        "real",
        "number",
        "defined",
        "dedekind",
        "cut",
        "rational",
        "number",
        "ie",
        "set",
        "partition",
        "set",
        "rational",
        "number",
        "arithmetic",
        "real",
        "number",
        "defined",
        "construction",
        "set",
        "real",
        "number",
        "whole",
        "analysis",
        "reduced",
        "arithmetic",
        "pm",
        "however",
        "avoids",
        "arithmetization",
        "analysis",
        "instead",
        "defines",
        "rational",
        "real",
        "fact",
        "huge",
        "class",
        "relation",
        "number",
        "set",
        "isomorphic",
        "set",
        "relation",
        "russell",
        "say",
        "later",
        "regret",
        "theory",
        "relation",
        "number",
        "picked",
        "later",
        "set",
        "theorist",
        "even",
        "though",
        "original",
        "work",
        "pm",
        "brief",
        "summary",
        "later",
        "topic",
        "include",
        "therefore",
        "seen",
        "summary",
        "interesting",
        "consequence",
        "taking",
        "different",
        "route",
        "definition",
        "natural",
        "number",
        "based",
        "logic",
        "relation",
        "property",
        "rather",
        "set",
        "theory",
        "contemporary",
        "foundation",
        "mathematics",
        "entry",
        "thus",
        "aimed",
        "explication",
        "unusual",
        "order",
        "presentation",
        "result",
        "comparison",
        "frege",
        "contemporary",
        "set",
        "theory",
        "illustrate",
        "aspect",
        "theory",
        "relation",
        "investigated",
        "contemporary",
        "researcher"
    ]
}