{
    "main_text": "History of and Significance of Principia Mathematica || Significance of Principia Mathematica\n2.2 Significance of Principia Mathematica\n\nAchieving Principia’s main goal proved to be a\nchallenge. An initial response among mathematicians and logicians in\nGermany and Poland was to decry the decline in standards of formal\nrigor set by Frege. This complaint was voiced by Frege himself, in a\nletter to Philip Jourdain in 1912:\n\n\n…I do not understand the English language well enough to be\nable to say definitely that Russell’s theory (Principia\nMathematica I, 54ff) agrees with my theory of functions of the\nfirst, second, etc. levels. It does seem so. But I do not understand\nall of it. It is not quite clear to me what Russell intends with his\ndesignation \\(\\phi \\bang \\hat{x}\\). I never know for sure whether he\nis speaking of a sign or of its content. (Frege 1980: 78)\n\n\nThis claim that the notion of “propositional function” is\nsubject to use-mention confusions has persisted to this day. This\nentry will present a modernized version of the syntax of PM, combined\nwith an account of the notation for types in the works of Alonzo\nChurch (1974, 1976). Modern theories of types allow for a coherent\nsyntax for higher-order languages which many find adequate to meet\nthese objections. The complaint about the formulation of the syntax of\nPM was repeated and a further difficulty was expressed by Gödel\n(1944) in his influential survey of PM:\n\n\nIt is to be regretted that this first comprehensive and thorough-going\npresentation of a mathematical logic and the derivation of mathematics\nfrom it [is] so greatly lacking in formal precision in the foundations\n(contained in ∗1–∗21 of\nPrincipia) that it presents in this respect a considerable step\nbackwards as compared with Frege. What is missing, above all, is a\nprecise statement of the syntax of the formalism. Syntactical\nconsiderations are omitted even in cases where they are necessary for\nthe cogency of the proofs, in particular in connection with the\n“incomplete symbols”. These are introduced not by explicit\ndefinition, but by rules describing how sentences containing them are\nto be translated into sentences not containing them. To be sure,\nhowever, that (or for what expressions) this translation is possible\nand uniquely determined and that (or to what extent) the rules of\ninference apply to the new kind of expressions, it is necessary to\nhave a survey of all possible expressions, and this can be furnished\nonly by syntactical considerations. (Gödel 1944 [1951: 126])\n\n\nThe issue with respect to defined expressions, including the\n“incomplete symbols” for classes and definite descriptions\nwhich are explained below, is still problematic for interpreting PM.\nThe difficulty is that certain defined expressions such as the\nnotation for definite descriptions, class abstracts and even the\nidentity symbol ‘\\(=\\)’, are not specified in the initial\ndescription of the syntax of the theory, nor are they shown to be\nvalidly used as instances of the axioms with their apparent syntax.\nThe method of “contextual definition” used in PM is\ndifficult to formulate rigorously and is not used in contemporary\nlogical theories. The modern presentation of PM in this entry includes\nthe symbols for descriptions and classes, thus differing from the\ncompletely rigorous presentations of Church (1976), for example, who\navoids both definite descriptions and class expressions, and takes\nidentity as an undefined primitive.\n\nDespite these reactions to the rigor of the presentation, PM\nnevertheless was studied carefully by those interested in the new\nsymbolic logic including David Hilbert and those in his school in\nGöttingen (see Ewald & Sieg 2013: 3 and Chwistek 1912).\nPrimarily at issue were the kinds of assumptions Whitehead and Russell\nneeded to complete their project. Although Principia\nsucceeded in providing detailed derivations of many major theorems in\nfinite and transfinite arithmetic, set theory, and elementary measure\ntheory, three axioms in particular were arguably non-logical in\ncharacter: the axioms of infinity, reducibility and the\n“multiplicative axiom” or Axiom of Choice. The axiom of\ninfinity in effect states that there exists an infinite number of\nobjects. Arguably it makes the kind of assumption generally thought to\nbe empirical rather than logical in nature. The multiplicative axiom,\nlater added to Zermelo’s axioms as the Axiom of Choice, asserts\nthe existence of a certain set containing one element from each member\nof a given set. Russell objected that without a rule guiding the\nchoice, such an axiom was not a logical principle. The axiom of\nreducibility was introduced as a means of overcoming the not\ncompletely satisfactory effects of the\n theory of types,\n the mechanism Russell and Whitehead used to restrict the notion of a\nwell-formed expression, thereby avoiding Russell’s paradox.\nAlthough technically feasible, many critics concluded that the axiom\nwas simply too ad hoc to be justified philosophically.\nInitially at least, Leon Chwistek (1912) believed that it led to a\ncontradiction. Kanamori sums up the sentiment of many readers: \n\n\nIn traumatic reaction to his paradox Russell had built a complex\nsystem of orders and types only to collapse it with his Axiom of\nReducibility, a fearful symmetry imposed by an artful dodger. (2009:\n411) \n\n\nIn the minds of many, the issue of whether mathematics could be\nreduced to logic, or whether it could be reduced only to set theory,\nthus remained open.\n\nIn response, Whitehead and Russell argued that both axioms were\ndefensible on inductive grounds. As they tell us in the Introduction\nto the first volume of Principia,\n\n\nself-evidence is never more than a part of the reason for accepting an\naxiom, and is never indispensable. The reason for accepting an axiom,\nas for accepting any other proposition, is always largely inductive,\nnamely that many propositions which are nearly indubitable can be\ndeduced from it, and that no equally plausible way is known by which\nthese propositions could be true if the axiom were false, and nothing\nwhich is probably false can be deduced from it. If the axiom is\napparently self-evident, that only means, practically, that it is\nnearly indubitable; for things have been thought to be self-evident\nand have yet turned out to be false. And if the axiom itself is nearly\nindubitable, that merely adds to the inductive evidence derived from\nthe fact that its consequences are nearly indubitable: it does not\nprovide new evidence of a radically different kind. Infallibility is\nnever attainable, and therefore some element of doubt should always\nattach to every axiom and to all its consequences. In formal logic,\nthe element of doubt is less than in most sciences, but it is not\nabsent, as appears from the fact that the paradoxes followed from\npremisses which were not previously known to require limitations.\n(1910: 62 [1925: 59])\n\n\nWhitehead and Russell were also disappointed by the book’s\nlargely indifferent reception on the part of many working\nmathematicians. As Russell writes,\n\n\nBoth Whitehead and I were disappointed that Principia\nMathematica was only viewed from a philosophical standpoint.\nPeople were interested in what was said about the contradictions and\nin the question whether ordinary mathematics had been validly deduced\nfrom purely logical premisses, but they were not interested in the\nmathematical techniques developed in the course of the\nwork.…Even those who were working on exactly the same subjects\ndid not think it worth while to find out what Principia\nMathematica had to say on them. I will give two illustrations:\nMathematische Annalen published about ten years after the\npublication of Principia a long article giving some of the\nresults which (unknown to the author) we had worked out in Part IV of\nour book. This article fell into certain inaccuracies which we had\navoided, but contained nothing valid which we had not already\npublished. The author was obviously totally unaware that he had been\nanticipated. The second example occurred when I was a colleague of\nReichenbach at the University of California. He told me that he had\ninvented an extension of mathematical induction which he called\n‘transfinite induction’. I told him that this subject was\nfully treated in the third volume of the Principia. When I\nsaw him a week later, he told me that he had verified this. (1959:\n86)\n\n\nDespite such concerns, PM proved to be remarkably influential in at\nleast three ways. First, it popularized modern mathematical logic to\nan extent undreamt of by its authors. By using a notation more\naccessible than that used by Frege, Whitehead, and Russell managed to\nconvey the remarkable expressive power of modern predicate logic in a\nway that previous writers had been unable to achieve. Second, by\nexhibiting so clearly the deductive power of the new logic, Whitehead\nand Russell were able to show how powerful the idea of a modern formal\nsystem could be, thus opening up new work in what soon was to be\ncalled metalogic. Third, Principia Mathematica re-affirmed\nclear and interesting connections between logicism and two of the main\nbranches of traditional philosophy, namely\n metaphysics \n and epistemology,\nthereby initiating new and interesting work in both of these\nareas.\n\nAs a result, not only did Principia introduce a wide range of\nphilosophically rich notions (including\n propositional function,\n logical construction, and\n type theory),\n it also set the stage for the discovery of crucial metatheoretic\nresults (including those of Kurt Gödel, Alonzo Church, Alan\nTuring and others). Just as importantly, it initiated a tradition of\ncommon technical work in fields as diverse as philosophy, mathematics,\nlinguistics, economics and computer science.\n\nToday a lack of agreement remains over the ultimate philosophical\ncontribution of Principia, with some authors holding that,\nwith the appropriate modifications, logicism remains a feasible\nproject. Others hold that the philosophical and technical\nunderpinnings of the project remain too weak or too confused to be of\ngreat use to the logicist. (For more detailed discussion, readers\nshould consult Quine 1963, 1966a, 1966b; Landini 1998, 2011; Linsky\n1999, 2011; Hale and Wright 2001; Burgess 2005; Hintikka 2009; and\nGandon 2012.)\n\nThere is also lack of agreement over the importance of the second\nedition of the book, which appeared in 1925 (Volume I) and (Volumes II\nand III were directly reprinted from the first edition in 1927). The\nrevisions were done by Russell, although Whitehead was given the\nopportunity to advise. In addition to the correction of minor errors\nthroughout the original text, changes to the new edition included a\nnew Introduction and three new appendices. (The appendices discuss the\ntheory of quantification, mathematical induction and the axiom of\nreducibility, and the principle of extensionality respectively.) The\nbook itself was reset more compactly, making page references to the\nfirst edition obsolete. Russell continued to make corrections as late\nas 1949 for the 1950 printing, the year he and Whitehead's widow\nfinally began to receive royalties.\n\nToday there is still debate over the ultimate value, or even the\ncorrect interpretation, of some of the revisions, revisions that were\nmotivated in large part by the work of some of Russell’s\nbrightest students, including Ludwig Wittgenstein and Frank\nRamsey. Appendix B has been notoriously problematic. The appendix\npurports to show how mathematical induction can be justified without\nuse of the axiom of reducibility; but as Alasdair Urquhart\nreports,\n\n\nThe first indication that something was seriously wrong appeared in\nGödel’s well known essay of 1944, “Russell’s\nMathematical Logic”. There, Gödel points out that line (3)\nof the demonstration of Russell’s proposition\n∗89·16 is an elementary logical blunder, while the\ncrucial ∗89·12 also appears to be highly questionable.\nIt still remained to be seen whether anything of Russell’s proof\ncould be salvaged, in spite of the errors, but John Myhill provided\nstrong evidence of a negative verdict by providing a model-theoretic\nproof in 1974 that no such proof as Russell’s can be given in\nthe ramified theory of types without the axiom of reducibility.\n(Urquhart 2012)\n\n\nLinsky (2011) provides a discussion, both of the Appendix itself and\nof the suggestion that by 1925 Russell may have been out of touch with\nrecent developments in the quickly changing field of mathematical\nlogic. He also addresses the suggestion, made by some commentators,\nthat Whitehead may have been opposed to the revisions, or at least\nindifferent to them, concluding that both charges are likely without\nfoundation. (Whitehead’s own comments, published in 1926 in\nMind, shed little light on the issue.)\n",
    "section_title": "2.2 Significance of Principia Mathematica",
    "entry_title": "Principia Mathematica",
    "hierarchy_title": "Principia Mathematica || History of and Significance of Principia Mathematica || Significance of Principia Mathematica",
    "tokenized_text": [
        "history",
        "significance",
        "principia",
        "mathematica",
        "significance",
        "principia",
        "mathematica",
        "significance",
        "principia",
        "mathematica",
        "achieving",
        "principia",
        "main",
        "goal",
        "proved",
        "challenge",
        "initial",
        "response",
        "among",
        "mathematician",
        "logician",
        "germany",
        "poland",
        "decry",
        "decline",
        "standard",
        "formal",
        "rigor",
        "set",
        "frege",
        "complaint",
        "voiced",
        "frege",
        "letter",
        "philip",
        "jourdain",
        "i",
        "understand",
        "english",
        "language",
        "well",
        "enough",
        "able",
        "say",
        "definitely",
        "russell",
        "theory",
        "principia",
        "mathematica",
        "ff",
        "agrees",
        "theory",
        "function",
        "first",
        "second",
        "etc",
        "level",
        "seem",
        "understand",
        "quite",
        "clear",
        "russell",
        "intends",
        "designation",
        "phi",
        "bang",
        "hat",
        "x",
        "never",
        "know",
        "sure",
        "whether",
        "speaking",
        "sign",
        "content",
        "frege",
        "claim",
        "notion",
        "propositional",
        "function",
        "subject",
        "usemention",
        "confusion",
        "persisted",
        "day",
        "entry",
        "present",
        "modernized",
        "version",
        "syntax",
        "pm",
        "combined",
        "account",
        "notation",
        "type",
        "work",
        "alonzo",
        "church",
        "modern",
        "theory",
        "type",
        "allow",
        "coherent",
        "syntax",
        "higherorder",
        "language",
        "many",
        "find",
        "adequate",
        "meet",
        "objection",
        "complaint",
        "formulation",
        "syntax",
        "pm",
        "repeated",
        "difficulty",
        "expressed",
        "gödel",
        "influential",
        "survey",
        "pm",
        "regretted",
        "first",
        "comprehensive",
        "thoroughgoing",
        "presentation",
        "mathematical",
        "logic",
        "derivation",
        "mathematics",
        "greatly",
        "lacking",
        "formal",
        "precision",
        "foundation",
        "contained",
        "principia",
        "present",
        "respect",
        "considerable",
        "step",
        "backwards",
        "compared",
        "frege",
        "missing",
        "precise",
        "statement",
        "syntax",
        "formalism",
        "syntactical",
        "consideration",
        "omitted",
        "even",
        "case",
        "necessary",
        "cogency",
        "proof",
        "particular",
        "connection",
        "incomplete",
        "symbol",
        "introduced",
        "explicit",
        "definition",
        "rule",
        "describing",
        "sentence",
        "containing",
        "translated",
        "sentence",
        "containing",
        "sure",
        "however",
        "expression",
        "translation",
        "possible",
        "uniquely",
        "determined",
        "extent",
        "rule",
        "inference",
        "apply",
        "new",
        "kind",
        "expression",
        "necessary",
        "survey",
        "possible",
        "expression",
        "furnished",
        "syntactical",
        "consideration",
        "gödel",
        "issue",
        "respect",
        "defined",
        "expression",
        "including",
        "incomplete",
        "symbol",
        "class",
        "definite",
        "description",
        "explained",
        "still",
        "problematic",
        "interpreting",
        "pm",
        "difficulty",
        "certain",
        "defined",
        "expression",
        "notation",
        "definite",
        "description",
        "class",
        "abstract",
        "even",
        "identity",
        "symbol",
        "specified",
        "initial",
        "description",
        "syntax",
        "theory",
        "shown",
        "validly",
        "used",
        "instance",
        "axiom",
        "apparent",
        "syntax",
        "method",
        "contextual",
        "definition",
        "used",
        "pm",
        "difficult",
        "formulate",
        "rigorously",
        "used",
        "contemporary",
        "logical",
        "theory",
        "modern",
        "presentation",
        "pm",
        "entry",
        "includes",
        "symbol",
        "description",
        "class",
        "thus",
        "differing",
        "completely",
        "rigorous",
        "presentation",
        "church",
        "example",
        "avoids",
        "definite",
        "description",
        "class",
        "expression",
        "take",
        "identity",
        "undefined",
        "primitive",
        "despite",
        "reaction",
        "rigor",
        "presentation",
        "pm",
        "nevertheless",
        "studied",
        "carefully",
        "interested",
        "new",
        "symbolic",
        "logic",
        "including",
        "david",
        "hilbert",
        "school",
        "göttingen",
        "see",
        "ewald",
        "sieg",
        "chwistek",
        "primarily",
        "issue",
        "kind",
        "assumption",
        "whitehead",
        "russell",
        "needed",
        "complete",
        "project",
        "although",
        "principia",
        "succeeded",
        "providing",
        "detailed",
        "derivation",
        "many",
        "major",
        "theorem",
        "finite",
        "transfinite",
        "arithmetic",
        "set",
        "theory",
        "elementary",
        "measure",
        "theory",
        "three",
        "axiom",
        "particular",
        "arguably",
        "nonlogical",
        "character",
        "axiom",
        "infinity",
        "reducibility",
        "multiplicative",
        "axiom",
        "axiom",
        "choice",
        "axiom",
        "infinity",
        "effect",
        "state",
        "exists",
        "infinite",
        "number",
        "object",
        "arguably",
        "make",
        "kind",
        "assumption",
        "generally",
        "thought",
        "empirical",
        "rather",
        "logical",
        "nature",
        "multiplicative",
        "axiom",
        "later",
        "added",
        "zermelo",
        "axiom",
        "axiom",
        "choice",
        "asserts",
        "existence",
        "certain",
        "set",
        "containing",
        "one",
        "element",
        "member",
        "given",
        "set",
        "russell",
        "objected",
        "without",
        "rule",
        "guiding",
        "choice",
        "axiom",
        "logical",
        "principle",
        "axiom",
        "reducibility",
        "introduced",
        "mean",
        "overcoming",
        "completely",
        "satisfactory",
        "effect",
        "theory",
        "type",
        "mechanism",
        "russell",
        "whitehead",
        "used",
        "restrict",
        "notion",
        "wellformed",
        "expression",
        "thereby",
        "avoiding",
        "russell",
        "paradox",
        "although",
        "technically",
        "feasible",
        "many",
        "critic",
        "concluded",
        "axiom",
        "simply",
        "ad",
        "hoc",
        "justified",
        "philosophically",
        "initially",
        "least",
        "leon",
        "chwistek",
        "believed",
        "led",
        "contradiction",
        "kanamori",
        "sum",
        "sentiment",
        "many",
        "reader",
        "traumatic",
        "reaction",
        "paradox",
        "russell",
        "built",
        "complex",
        "system",
        "order",
        "type",
        "collapse",
        "axiom",
        "reducibility",
        "fearful",
        "symmetry",
        "imposed",
        "artful",
        "dodger",
        "mind",
        "many",
        "issue",
        "whether",
        "mathematics",
        "could",
        "reduced",
        "logic",
        "whether",
        "could",
        "reduced",
        "set",
        "theory",
        "thus",
        "remained",
        "open",
        "response",
        "whitehead",
        "russell",
        "argued",
        "axiom",
        "defensible",
        "inductive",
        "ground",
        "tell",
        "u",
        "introduction",
        "first",
        "volume",
        "principia",
        "selfevidence",
        "never",
        "part",
        "reason",
        "accepting",
        "axiom",
        "never",
        "indispensable",
        "reason",
        "accepting",
        "axiom",
        "accepting",
        "proposition",
        "always",
        "largely",
        "inductive",
        "namely",
        "many",
        "proposition",
        "nearly",
        "indubitable",
        "deduced",
        "equally",
        "plausible",
        "way",
        "known",
        "proposition",
        "could",
        "true",
        "axiom",
        "false",
        "nothing",
        "probably",
        "false",
        "deduced",
        "axiom",
        "apparently",
        "selfevident",
        "mean",
        "practically",
        "nearly",
        "indubitable",
        "thing",
        "thought",
        "selfevident",
        "yet",
        "turned",
        "false",
        "axiom",
        "nearly",
        "indubitable",
        "merely",
        "add",
        "inductive",
        "evidence",
        "derived",
        "fact",
        "consequence",
        "nearly",
        "indubitable",
        "provide",
        "new",
        "evidence",
        "radically",
        "different",
        "kind",
        "infallibility",
        "never",
        "attainable",
        "therefore",
        "element",
        "doubt",
        "always",
        "attach",
        "every",
        "axiom",
        "consequence",
        "formal",
        "logic",
        "element",
        "doubt",
        "le",
        "science",
        "absent",
        "appears",
        "fact",
        "paradox",
        "followed",
        "premiss",
        "previously",
        "known",
        "require",
        "limitation",
        "whitehead",
        "russell",
        "also",
        "disappointed",
        "book",
        "largely",
        "indifferent",
        "reception",
        "part",
        "many",
        "working",
        "mathematician",
        "russell",
        "writes",
        "whitehead",
        "disappointed",
        "principia",
        "mathematica",
        "viewed",
        "philosophical",
        "standpoint",
        "people",
        "interested",
        "said",
        "contradiction",
        "question",
        "whether",
        "ordinary",
        "mathematics",
        "validly",
        "deduced",
        "purely",
        "logical",
        "premiss",
        "interested",
        "mathematical",
        "technique",
        "developed",
        "course",
        "workeven",
        "working",
        "exactly",
        "subject",
        "think",
        "worth",
        "find",
        "principia",
        "mathematica",
        "say",
        "give",
        "two",
        "illustration",
        "mathematische",
        "annalen",
        "published",
        "ten",
        "year",
        "publication",
        "principia",
        "long",
        "article",
        "giving",
        "result",
        "unknown",
        "author",
        "worked",
        "part",
        "iv",
        "book",
        "article",
        "fell",
        "certain",
        "inaccuracy",
        "avoided",
        "contained",
        "nothing",
        "valid",
        "already",
        "published",
        "author",
        "obviously",
        "totally",
        "unaware",
        "anticipated",
        "second",
        "example",
        "occurred",
        "colleague",
        "reichenbach",
        "university",
        "california",
        "told",
        "invented",
        "extension",
        "mathematical",
        "induction",
        "called",
        "transfinite",
        "induction",
        "told",
        "subject",
        "fully",
        "treated",
        "third",
        "volume",
        "principia",
        "saw",
        "week",
        "later",
        "told",
        "verified",
        "despite",
        "concern",
        "pm",
        "proved",
        "remarkably",
        "influential",
        "least",
        "three",
        "way",
        "first",
        "popularized",
        "modern",
        "mathematical",
        "logic",
        "extent",
        "undreamt",
        "author",
        "using",
        "notation",
        "accessible",
        "used",
        "frege",
        "whitehead",
        "russell",
        "managed",
        "convey",
        "remarkable",
        "expressive",
        "power",
        "modern",
        "predicate",
        "logic",
        "way",
        "previous",
        "writer",
        "unable",
        "achieve",
        "second",
        "exhibiting",
        "clearly",
        "deductive",
        "power",
        "new",
        "logic",
        "whitehead",
        "russell",
        "able",
        "show",
        "powerful",
        "idea",
        "modern",
        "formal",
        "system",
        "could",
        "thus",
        "opening",
        "new",
        "work",
        "soon",
        "called",
        "metalogic",
        "third",
        "principia",
        "mathematica",
        "reaffirmed",
        "clear",
        "interesting",
        "connection",
        "logicism",
        "two",
        "main",
        "branch",
        "traditional",
        "philosophy",
        "namely",
        "metaphysics",
        "epistemology",
        "thereby",
        "initiating",
        "new",
        "interesting",
        "work",
        "area",
        "result",
        "principia",
        "introduce",
        "wide",
        "range",
        "philosophically",
        "rich",
        "notion",
        "including",
        "propositional",
        "function",
        "logical",
        "construction",
        "type",
        "theory",
        "also",
        "set",
        "stage",
        "discovery",
        "crucial",
        "metatheoretic",
        "result",
        "including",
        "kurt",
        "gödel",
        "alonzo",
        "church",
        "alan",
        "turing",
        "others",
        "importantly",
        "initiated",
        "tradition",
        "common",
        "technical",
        "work",
        "field",
        "diverse",
        "philosophy",
        "mathematics",
        "linguistics",
        "economics",
        "computer",
        "science",
        "today",
        "lack",
        "agreement",
        "remains",
        "ultimate",
        "philosophical",
        "contribution",
        "principia",
        "author",
        "holding",
        "appropriate",
        "modification",
        "logicism",
        "remains",
        "feasible",
        "project",
        "others",
        "hold",
        "philosophical",
        "technical",
        "underpinnings",
        "project",
        "remain",
        "weak",
        "confused",
        "great",
        "use",
        "logicist",
        "detailed",
        "discussion",
        "reader",
        "consult",
        "quine",
        "a",
        "b",
        "landini",
        "linsky",
        "hale",
        "wright",
        "burgess",
        "hintikka",
        "gandon",
        "also",
        "lack",
        "agreement",
        "importance",
        "second",
        "edition",
        "book",
        "appeared",
        "volume",
        "volume",
        "ii",
        "iii",
        "directly",
        "reprinted",
        "first",
        "edition",
        "revision",
        "done",
        "russell",
        "although",
        "whitehead",
        "given",
        "opportunity",
        "advise",
        "addition",
        "correction",
        "minor",
        "error",
        "throughout",
        "original",
        "text",
        "change",
        "new",
        "edition",
        "included",
        "new",
        "introduction",
        "three",
        "new",
        "appendix",
        "appendix",
        "discus",
        "theory",
        "quantification",
        "mathematical",
        "induction",
        "axiom",
        "reducibility",
        "principle",
        "extensionality",
        "respectively",
        "book",
        "reset",
        "compactly",
        "making",
        "page",
        "reference",
        "first",
        "edition",
        "obsolete",
        "russell",
        "continued",
        "make",
        "correction",
        "late",
        "printing",
        "year",
        "whitehead",
        "s",
        "widow",
        "finally",
        "began",
        "receive",
        "royalty",
        "today",
        "still",
        "debate",
        "ultimate",
        "value",
        "even",
        "correct",
        "interpretation",
        "revision",
        "revision",
        "motivated",
        "large",
        "part",
        "work",
        "russell",
        "brightest",
        "student",
        "including",
        "ludwig",
        "wittgenstein",
        "frank",
        "ramsey",
        "appendix",
        "b",
        "notoriously",
        "problematic",
        "appendix",
        "purport",
        "show",
        "mathematical",
        "induction",
        "justified",
        "without",
        "use",
        "axiom",
        "reducibility",
        "alasdair",
        "urquhart",
        "report",
        "first",
        "indication",
        "something",
        "seriously",
        "wrong",
        "appeared",
        "gödel",
        "well",
        "known",
        "essay",
        "russell",
        "mathematical",
        "logic",
        "gödel",
        "point",
        "line",
        "demonstration",
        "russell",
        "proposition",
        "elementary",
        "logical",
        "blunder",
        "crucial",
        "also",
        "appears",
        "highly",
        "questionable",
        "still",
        "remained",
        "seen",
        "whether",
        "anything",
        "russell",
        "proof",
        "could",
        "salvaged",
        "spite",
        "error",
        "john",
        "myhill",
        "provided",
        "strong",
        "evidence",
        "negative",
        "verdict",
        "providing",
        "modeltheoretic",
        "proof",
        "proof",
        "russell",
        "given",
        "ramified",
        "theory",
        "type",
        "without",
        "axiom",
        "reducibility",
        "urquhart",
        "linsky",
        "provides",
        "discussion",
        "appendix",
        "suggestion",
        "russell",
        "may",
        "touch",
        "recent",
        "development",
        "quickly",
        "changing",
        "field",
        "mathematical",
        "logic",
        "also",
        "address",
        "suggestion",
        "made",
        "commentator",
        "whitehead",
        "may",
        "opposed",
        "revision",
        "least",
        "indifferent",
        "concluding",
        "charge",
        "likely",
        "without",
        "foundation",
        "whitehead",
        "comment",
        "published",
        "mind",
        "shed",
        "little",
        "light",
        "issue"
    ]
}