{
    "main_text": "The Significance of the Issue\n2. The Significance of the Issue\n\nThe issue’s significance can be seen by considering how the argument\nis embedded in the structure of Philosophical Investigations.\nImmediately prior to the introduction of the argument\n(§§241f), Wittgenstein suggests that the existence of the\nrules governing the use of language and making communication possible\ndepends on agreement in human behaviour—such as the uniformity\nin normal human reaction which makes it possible to train most\nchildren to look at something by pointing at it. (Unlike cats, which\nreact in a seemingly random variety of ways to pointing.) One function\nof the private language argument is to show that not only actual\nlanguages but the very possibility of language and concept formation\ndepends on the possibility of such agreement.\n\nAnother, related, function is to oppose the idea that metaphysical\nabsolutes are within our reach, that we can find at least part of the\nworld as it really is in the sense that any other way of conceiving\nthat part must be wrong (cf. Philosophical Investigations\np. 230). Philosophers are especially tempted to suppose that numbers\nand sensations are examples of such absolutes, self-identifying\nobjects which themselves force upon us the rules for the use of their\nnames. Wittgenstein discusses numbers in earlier sections on rules\n(185–242). Some of his points have analogues in his discussion\nof sensations, for there is a common underlying confusion about how\nthe act of meaning determines the future application of a formula or\nname. In the case of numbers, one temptation is to confuse the\nmathematical sense of ‘determine’ in which, say, the\nformula y = 2x determines the numerical value of\ny for a given value of x (in contrast with\ny > 2x, which does not) with a causal sense in\nwhich a certain training in mathematics determines that normal people\nwill always write the same value for y given both the first\nformula and a value for x—in contrast with creatures\nfor which such training might produce a variety of outcomes (cf.\n§189). This confusion produces the illusion that the result of an\nactual properly conducted calculation is the inevitable outcome of the\nmathematical determining, as though the formula’s meaning itself were\nshaping the course of events.\n\nIn the case of sensations, the parallel temptation is to suppose that\nthey are self-intimating. Itching, for example, seems like this: one\njust feels what it is directly; if one then gives the sensation a\nname, the rules for that name’s subsequent use are already determined\nby the sensation itself. Wittgenstein tries to show that this\nimpression is illusory, that even itching derives its identity only\nfrom a sharable practice of expression, reaction and use of language.\nIf itching were a metaphysical absolute, forcing its identity upon me\nin the way described, then the possibility of such a shared practice\nwould be irrelevant to the concept of itching: the nature of itching\nwould be revealed to me in a single mental act of naming it (the kind\nof mental act which Russell called ‘acquaintance’); all\nsubsequent facts concerning the use of the name would be irrelevant to\nhow that name was meant; and the name could be private. The private\nlanguage argument is intended to show that such subsequent facts could\nnot be irrelevant, that no names could be private, and that the notion\nof having the true identity of a sensation revealed in a single act of\nacquaintance is a confusion.\n\nThe suggestion that a language could be private in the way described\nappears most openly in the second of Bertrand Russell’s published\nlectures ‘The Philosophy of Logical Atomism’, where\nRussell says:\n\n\nIn a logically perfect language, there will be one word and no more\nfor every simple object, and everything that is not simple will be\nexpressed by a combination of words, by a combination derived, of\ncourse, from the words for the simple things that enter in, one word\nfor each simple component. A language of that sort will be completely\nanalytic, and will show at a glance the logical structure of the facts\nasserted or denied. … A logically perfect language, if it could\nbe constructed, would not only be intolerably prolix, but, as regards\nits vocabulary, would be very largely private to one speaker. That is\nto say, all the names that it would use would be private to that\nspeaker and could not enter into the language of another speaker.\n\n… A name, in the narrow logical sense of a word whose meaning\nis a particular, can only be applied to a particular with which the\nspeaker is acquainted, because you cannot name anything you are not\nacquainted with.\n\n… One can use ‘this’ as a name to stand for a\nparticular with which one is acquainted at the moment. We say\n‘This is white’. … But if you try to apprehend the\nproposition that I am expressing when I say ‘This is\nwhite’, you cannot do it. If you mean this piece of chalk as a\nphysical object, then you are not using a proper name. It is only when\nyou use ‘this’ quite strictly, to stand for an actual\nobject of sense [i.e., a sense-datum], that it is really a proper\nname. And in that it has a very odd property for a proper name, namely\nthat it seldom means the same thing two moments running and does not\nmean the same thing to the speaker and to the hearer.\n\n… [I]n order to understand a name for a particular, the only\nthing necessary is to be acquainted with that particular. When you are\nacquainted with that particular, you have a full, adequate and\ncomplete understanding of the name, and no further information is\nrequired.\n\n\nAlthough Wittgenstein does not explicitly say so, it is likely that\nthis is the inspiration of his argument: his writing is marked in many\nplaces by criticism of Russell, both explicit and otherwise. \n\nIn this context, we should take a moment to note a set of issues of\nincreasing interest, namely, ones found in Cora Diamond’s claim in\n‘Does Bismarck Have a Beetle In His Box’ that:\n\nThe Tractatus provides us with arguments against the\nRussellian idea of someone else’s private object, the beetle in\nBismarck’s box. It lets us see that any such beetle would have no role\nin language or thought, but it left unmolested the beetle in one’s own\nbox. Russell’s conception of how we can think about things in the\nminds of others was subjected to a critique, but the\nTractatus left unexamined a questionable conception of what\nit is for our words to be about things in our own minds. (p. 283)\n\nIt would not be until post-Tractarian work that Wittgenstein would\nturn his attention to question of private objects in one’s own\nmind.  Regarding Russell, as Diamond sees it, his commitment both to\nprivate objects and their possibility/admissibility comes primarily\nfrom his views on knowledge by acquaintance in contrast to knowledge\nby description, an important part of which is his holding that\n“…the chief importance of knowledge by description is\nthat it enables us to pass beyond the limits of our private\nexperience. In spite of the fact that we can only know truths which\nare wholly composed of terms which we have experienced in\nacquaintance, we can yet have knowledge by description of things which\nwe have never experienced” (quoted in Diamond [2000],\np. 267). Further, according to Diamond, it is Russell’s\nunderstanding and use of quantification that he employs to provide a\nway to get around the problem of not being acquainted with the\n‘private’ objects in the minds of others. While Bismarck\nknows by direct acquaintance the meaning of ‘This is\nexcruciating’ said of his sensation, another can only say,\n‘Bismarck’s sensation is excruciating’. However,\nthis can be meaningful once we understand that the its meaning is to\nbe analyzed in terms of, ‘Something is a sensation, had now by\nBismarck, and it is excruciating’ (p. 273). Once she has\nidentified the importance of the issue of privacy for Russell, and\nlaid out the details of his position, she is primarily concerned to\nshow how Wittgenstein’s views in the Tractatus\n(particularly on quantification, logical space, and there not being\nlogical objects that serve as the referents of terms such as\n‘some’ and ‘all’) undermine Russell’s\nposition on quantification and private objects in other people’s\nminds. Further, she argues, briefly, for the importance of there being\na ‘private language argument’ in the\nTractatus along two main lines. First, she takes it to be\nimportant for our understanding of Wittgenstein’s work and its\ndevelopment (and here her argument is firmly in line with her\nPyrrhonian and resolute reading of the Tractatus and its\ncontinuity with Wittgenstein’s later work). Second, she takes it to\nhave implications for Michael Dummett’s way of framing the realism and\nanti-realism issue, especially as it relates to the\nTractatus. Against Dummett, she sees the Tractatus\nas putting forward an anti-realist position, “…at any\nrate about other people’s private objects” (p. 284).\n\nAs this entry is focused on the private language considerations found\nprimarily in the Philosophical Investigations, we will not go\ninto further detail regarding Diamond’s argument. However, as\nnoted above, the issues she raises are of increasing interest both\ndirectly and indirectly. Directly, they are engaged by William\nChild’s recent ’Does the Tractatus contain a\nprivate language argument?’ in which he argues that Diamond is\nmore or less wrong across the board in her main contentions regarding\nthere being a private language argument in the Tractatus and\nher assessment of the Tractatus as anti-realist. His central\ncontention is that Diamond projects views attributable to the later\nWittgenstein into the Tractatus, particularly those\nconcerning naming and use. However, he also argues that\nWittgenstein’s 1929 views on sensation language\n‘challenge’ ‘new’ readings of\nthe Tractatus, such as Diamond’s, where by ‘new\nreadings’ he means ones that, “find in\nthe Tractatus an absence of positive philosophical doctrines,\na kind of quietism, and an explicitly therapeutic approach that have\ntraditionally been associated with Wittgenstein’s later\nphilosophy” (p. 143). \n\nIndirectly, Diamond’s piece is in line with an increasing interest in\nquestions of how to read Wittgenstein, such as those we noted above in\nour discussion of the resolute-substantial and\nPyrrhonian-non-Pyrrhonian ‘Wittgensteins’. The issues raised in these\ncontexts have further relevance for understanding other central\nWittgensteinian themes such as how best to respond to the temptations\nof solipsism (see Stern [2010] for a helpful overview of many of these\nissues; he does not discuss Diamond directly, but he does focus on the\nquestion of the development of Wittgenstein’s thought and, for\nexample, the question of solipsism in the context of private language\nconsiderations. Another recent example of interest in Wittgenstein’s\nphilosophical development, and explicitly one that concerns private\nlanguage, is Nielson [2008]). \n\nTo return to our exposition of the private language concerns found in\nthe Philosophical Investigations, in distinction from\nRussell’s work, for example, the idea of a private language is more\nusually hidden: the confusions supposed to belong to it allegedly\nunderlie a range of articulated philosophical notions and theories,\nwithout themselves being so articulated. The argument is thus perhaps\nmost profitably read as targeting, not any particular theory, but\nrather the motivation for considering a range of apparently\nindependent or even competing theories along with their associated\ntasks, problems and solutions.\n\nFor example, a still very common idea, often attributed to John Locke\nand openly embraced by Jerry Fodor in the nineteen seventies, is that\ninterpersonal spoken communication works by speakers’ translation of\ntheir internal mental vocabularies into sounds followed by hearers’\nre-translation into their own internal vocabularies. Again, Descartes\nconsidered himself able to talk to himself about his experiences while\nclaiming to be justified in saying that he does not know (or not until\nhe has produced a reassuring philosophical argument) anything at all\nabout an external world conceived as something independent of them.\nAnd he and others have thought: while I may make mistakes about the\nexternal world, I can infallibly avoid error if I confine my judgments\nto my immediate sensations. (Compare The Principles of\nPhilosophy, I, 9.) Again, many philosophers, including John\nStuart Mill, have supposed there to be a problem of other minds,\naccording to which I may reasonably doubt the legitimacy of applying,\nsay, sensation-words to beings other than myself.\n\nIn each of these examples, the implication is that the internal\nvehicle of my musings could in principle be private (as Kenny [1966,\np. 369] showed, this vehicle does not have to be a language\nfor the argument to apply to it): for these problems and theories even\nto make sense, sharability must be irrelevant to meaning and it must\nbe at least conceivable that my knowledge, even my understanding, is\nnecessarily confined to my own case. The implication is of course\noften denied. The terms of Fodor’s language of thought, for example,\nare supposed to be able to refer to public objects. But the question\nis, on what basis does this ability rest? However this question should\nbe answered, Fodor himself was concerned enough about Wittgenstein’s\nargument to try to show both that it did not apply to his views\nand—apparently superfluously—that it is not a good\nargument anyway (Fodor pp. 68–73). The matter is clearer with\nDescartes (compare Kenny 1966): for his sceptical question to be\nraised without being immediately self-defeating, he must hold it\npossible to identify his experiences inwardly—where\n‘inwardly’ means without relying on resources supplied by\nhis essential embodiment in a world whose existence is independent of\nhis own mind and accessible to others (e.g., such resources as the\nconcepts acquired in a normal upbringing). The question which\naccordingly looms large in the private language argument is: How is\nthis identification of one’s experiences to be achieved?\n\nHowever, it cannot be emphasized too strongly that the significance of\nthe private language argument does not rest on the scholarly detail of\nwhether this or that thinker can be correctly described as committed\nto the idea. The target is a way of thinking which generates\nphilosophical theories, not the theories themselves.\n",
    "section_title": "2. The Significance of the Issue",
    "entry_title": "Private Language",
    "hierarchy_title": "Private Language || The Significance of the Issue",
    "tokenized_text": [
        "significance",
        "issue",
        "significance",
        "issue",
        "issue",
        "significance",
        "seen",
        "considering",
        "argument",
        "embedded",
        "structure",
        "philosophical",
        "investigation",
        "immediately",
        "prior",
        "introduction",
        "argument",
        "f",
        "wittgenstein",
        "suggests",
        "existence",
        "rule",
        "governing",
        "use",
        "language",
        "making",
        "communication",
        "possible",
        "depends",
        "agreement",
        "human",
        "behavioursuch",
        "uniformity",
        "normal",
        "human",
        "reaction",
        "make",
        "possible",
        "train",
        "child",
        "look",
        "something",
        "pointing",
        "unlike",
        "cat",
        "react",
        "seemingly",
        "random",
        "variety",
        "way",
        "pointing",
        "one",
        "function",
        "private",
        "language",
        "argument",
        "show",
        "actual",
        "language",
        "possibility",
        "language",
        "concept",
        "formation",
        "depends",
        "possibility",
        "agreement",
        "another",
        "related",
        "function",
        "oppose",
        "idea",
        "metaphysical",
        "absolute",
        "within",
        "reach",
        "find",
        "least",
        "part",
        "world",
        "really",
        "sense",
        "way",
        "conceiving",
        "part",
        "must",
        "wrong",
        "cf",
        "philosophical",
        "investigation",
        "p",
        "philosopher",
        "especially",
        "tempted",
        "suppose",
        "number",
        "sensation",
        "example",
        "absolute",
        "selfidentifying",
        "object",
        "force",
        "upon",
        "u",
        "rule",
        "use",
        "name",
        "wittgenstein",
        "discus",
        "number",
        "earlier",
        "section",
        "rule",
        "point",
        "analogue",
        "discussion",
        "sensation",
        "common",
        "underlying",
        "confusion",
        "act",
        "meaning",
        "determines",
        "future",
        "application",
        "formula",
        "name",
        "case",
        "number",
        "one",
        "temptation",
        "confuse",
        "mathematical",
        "sense",
        "determine",
        "say",
        "formula",
        "x",
        "determines",
        "numerical",
        "value",
        "given",
        "value",
        "x",
        "contrast",
        "x",
        "causal",
        "sense",
        "certain",
        "training",
        "mathematics",
        "determines",
        "normal",
        "people",
        "always",
        "write",
        "value",
        "given",
        "first",
        "formula",
        "value",
        "xin",
        "contrast",
        "creature",
        "training",
        "might",
        "produce",
        "variety",
        "outcome",
        "cf",
        "confusion",
        "produce",
        "illusion",
        "result",
        "actual",
        "properly",
        "conducted",
        "calculation",
        "inevitable",
        "outcome",
        "mathematical",
        "determining",
        "though",
        "formula",
        "meaning",
        "shaping",
        "course",
        "event",
        "case",
        "sensation",
        "parallel",
        "temptation",
        "suppose",
        "selfintimating",
        "itching",
        "example",
        "seems",
        "like",
        "one",
        "feel",
        "directly",
        "one",
        "give",
        "sensation",
        "name",
        "rule",
        "name",
        "subsequent",
        "use",
        "already",
        "determined",
        "sensation",
        "wittgenstein",
        "try",
        "show",
        "impression",
        "illusory",
        "even",
        "itching",
        "derives",
        "identity",
        "sharable",
        "practice",
        "expression",
        "reaction",
        "use",
        "language",
        "itching",
        "metaphysical",
        "absolute",
        "forcing",
        "identity",
        "upon",
        "way",
        "described",
        "possibility",
        "shared",
        "practice",
        "would",
        "irrelevant",
        "concept",
        "itching",
        "nature",
        "itching",
        "would",
        "revealed",
        "single",
        "mental",
        "act",
        "naming",
        "kind",
        "mental",
        "act",
        "russell",
        "called",
        "acquaintance",
        "subsequent",
        "fact",
        "concerning",
        "use",
        "name",
        "would",
        "irrelevant",
        "name",
        "meant",
        "name",
        "could",
        "private",
        "private",
        "language",
        "argument",
        "intended",
        "show",
        "subsequent",
        "fact",
        "could",
        "irrelevant",
        "name",
        "could",
        "private",
        "notion",
        "true",
        "identity",
        "sensation",
        "revealed",
        "single",
        "act",
        "acquaintance",
        "confusion",
        "suggestion",
        "language",
        "could",
        "private",
        "way",
        "described",
        "appears",
        "openly",
        "second",
        "bertrand",
        "russell",
        "published",
        "lecture",
        "philosophy",
        "logical",
        "atomism",
        "russell",
        "say",
        "logically",
        "perfect",
        "language",
        "one",
        "word",
        "every",
        "simple",
        "object",
        "everything",
        "simple",
        "expressed",
        "combination",
        "word",
        "combination",
        "derived",
        "course",
        "word",
        "simple",
        "thing",
        "enter",
        "one",
        "word",
        "simple",
        "component",
        "language",
        "sort",
        "completely",
        "analytic",
        "show",
        "glance",
        "logical",
        "structure",
        "fact",
        "asserted",
        "denied",
        "logically",
        "perfect",
        "language",
        "could",
        "constructed",
        "would",
        "intolerably",
        "prolix",
        "regard",
        "vocabulary",
        "would",
        "largely",
        "private",
        "one",
        "speaker",
        "say",
        "name",
        "would",
        "use",
        "would",
        "private",
        "speaker",
        "could",
        "enter",
        "language",
        "another",
        "speaker",
        "name",
        "narrow",
        "logical",
        "sense",
        "word",
        "whose",
        "meaning",
        "particular",
        "applied",
        "particular",
        "speaker",
        "acquainted",
        "name",
        "anything",
        "acquainted",
        "one",
        "use",
        "name",
        "stand",
        "particular",
        "one",
        "acquainted",
        "moment",
        "say",
        "white",
        "try",
        "apprehend",
        "proposition",
        "expressing",
        "say",
        "white",
        "mean",
        "piece",
        "chalk",
        "physical",
        "object",
        "using",
        "proper",
        "name",
        "use",
        "quite",
        "strictly",
        "stand",
        "actual",
        "object",
        "sense",
        "ie",
        "sensedatum",
        "really",
        "proper",
        "name",
        "odd",
        "property",
        "proper",
        "name",
        "namely",
        "seldom",
        "mean",
        "thing",
        "two",
        "moment",
        "running",
        "mean",
        "thing",
        "speaker",
        "hearer",
        "n",
        "order",
        "understand",
        "name",
        "particular",
        "thing",
        "necessary",
        "acquainted",
        "particular",
        "acquainted",
        "particular",
        "full",
        "adequate",
        "complete",
        "understanding",
        "name",
        "information",
        "required",
        "although",
        "wittgenstein",
        "explicitly",
        "say",
        "likely",
        "inspiration",
        "argument",
        "writing",
        "marked",
        "many",
        "place",
        "criticism",
        "russell",
        "explicit",
        "otherwise",
        "context",
        "take",
        "moment",
        "note",
        "set",
        "issue",
        "increasing",
        "interest",
        "namely",
        "one",
        "found",
        "cora",
        "diamond",
        "claim",
        "bismarck",
        "beetle",
        "box",
        "tractatus",
        "provides",
        "u",
        "argument",
        "russellian",
        "idea",
        "someone",
        "else",
        "private",
        "object",
        "beetle",
        "bismarck",
        "box",
        "let",
        "u",
        "see",
        "beetle",
        "would",
        "role",
        "language",
        "thought",
        "left",
        "unmolested",
        "beetle",
        "one",
        "box",
        "russell",
        "conception",
        "think",
        "thing",
        "mind",
        "others",
        "subjected",
        "critique",
        "tractatus",
        "left",
        "unexamined",
        "questionable",
        "conception",
        "word",
        "thing",
        "mind",
        "p",
        "would",
        "posttractarian",
        "work",
        "wittgenstein",
        "would",
        "turn",
        "attention",
        "question",
        "private",
        "object",
        "one",
        "mind",
        "regarding",
        "russell",
        "diamond",
        "see",
        "commitment",
        "private",
        "object",
        "possibilityadmissibility",
        "come",
        "primarily",
        "view",
        "knowledge",
        "acquaintance",
        "contrast",
        "knowledge",
        "description",
        "important",
        "part",
        "holding",
        "the",
        "chief",
        "importance",
        "knowledge",
        "description",
        "enables",
        "u",
        "pas",
        "beyond",
        "limit",
        "private",
        "experience",
        "spite",
        "fact",
        "know",
        "truth",
        "wholly",
        "composed",
        "term",
        "experienced",
        "acquaintance",
        "yet",
        "knowledge",
        "description",
        "thing",
        "never",
        "experienced",
        "quoted",
        "diamond",
        "p",
        "according",
        "diamond",
        "russell",
        "understanding",
        "use",
        "quantification",
        "employ",
        "provide",
        "way",
        "get",
        "around",
        "problem",
        "acquainted",
        "private",
        "object",
        "mind",
        "others",
        "bismarck",
        "know",
        "direct",
        "acquaintance",
        "meaning",
        "excruciating",
        "said",
        "sensation",
        "another",
        "say",
        "bismarck",
        "sensation",
        "excruciating",
        "however",
        "meaningful",
        "understand",
        "meaning",
        "analyzed",
        "term",
        "something",
        "sensation",
        "bismarck",
        "excruciating",
        "p",
        "identified",
        "importance",
        "issue",
        "privacy",
        "russell",
        "laid",
        "detail",
        "position",
        "primarily",
        "concerned",
        "show",
        "wittgenstein",
        "view",
        "tractatus",
        "particularly",
        "quantification",
        "logical",
        "space",
        "logical",
        "object",
        "serve",
        "referent",
        "term",
        "undermine",
        "russell",
        "position",
        "quantification",
        "private",
        "object",
        "people",
        "mind",
        "argues",
        "briefly",
        "importance",
        "private",
        "language",
        "argument",
        "tractatus",
        "along",
        "two",
        "main",
        "line",
        "first",
        "take",
        "important",
        "understanding",
        "wittgenstein",
        "work",
        "development",
        "argument",
        "firmly",
        "line",
        "pyrrhonian",
        "resolute",
        "reading",
        "tractatus",
        "continuity",
        "wittgenstein",
        "later",
        "work",
        "second",
        "take",
        "implication",
        "michael",
        "dummett",
        "way",
        "framing",
        "realism",
        "antirealism",
        "issue",
        "especially",
        "relates",
        "tractatus",
        "dummett",
        "see",
        "tractatus",
        "putting",
        "forward",
        "antirealist",
        "position",
        "at",
        "rate",
        "people",
        "private",
        "object",
        "p",
        "entry",
        "focused",
        "private",
        "language",
        "consideration",
        "found",
        "primarily",
        "philosophical",
        "investigation",
        "go",
        "detail",
        "regarding",
        "diamond",
        "argument",
        "however",
        "noted",
        "issue",
        "raise",
        "increasing",
        "interest",
        "directly",
        "indirectly",
        "directly",
        "engaged",
        "william",
        "child",
        "recent",
        "tractatus",
        "contain",
        "private",
        "language",
        "argument",
        "argues",
        "diamond",
        "le",
        "wrong",
        "across",
        "board",
        "main",
        "contention",
        "regarding",
        "private",
        "language",
        "argument",
        "tractatus",
        "assessment",
        "tractatus",
        "antirealist",
        "central",
        "contention",
        "diamond",
        "project",
        "view",
        "attributable",
        "later",
        "wittgenstein",
        "tractatus",
        "particularly",
        "concerning",
        "naming",
        "use",
        "however",
        "also",
        "argues",
        "wittgenstein",
        "view",
        "sensation",
        "language",
        "challenge",
        "new",
        "reading",
        "tractatus",
        "diamond",
        "new",
        "reading",
        "mean",
        "one",
        "find",
        "tractatus",
        "absence",
        "positive",
        "philosophical",
        "doctrine",
        "kind",
        "quietism",
        "explicitly",
        "therapeutic",
        "approach",
        "traditionally",
        "associated",
        "wittgenstein",
        "later",
        "philosophy",
        "p",
        "indirectly",
        "diamond",
        "piece",
        "line",
        "increasing",
        "interest",
        "question",
        "read",
        "wittgenstein",
        "noted",
        "discussion",
        "resolutesubstantial",
        "pyrrhoniannonpyrrhonian",
        "wittgenstein",
        "issue",
        "raised",
        "context",
        "relevance",
        "understanding",
        "central",
        "wittgensteinian",
        "theme",
        "best",
        "respond",
        "temptation",
        "solipsism",
        "see",
        "stern",
        "helpful",
        "overview",
        "many",
        "issue",
        "discus",
        "diamond",
        "directly",
        "focus",
        "question",
        "development",
        "wittgenstein",
        "thought",
        "example",
        "question",
        "solipsism",
        "context",
        "private",
        "language",
        "consideration",
        "another",
        "recent",
        "example",
        "interest",
        "wittgenstein",
        "philosophical",
        "development",
        "explicitly",
        "one",
        "concern",
        "private",
        "language",
        "nielson",
        "return",
        "exposition",
        "private",
        "language",
        "concern",
        "found",
        "philosophical",
        "investigation",
        "distinction",
        "russell",
        "work",
        "example",
        "idea",
        "private",
        "language",
        "usually",
        "hidden",
        "confusion",
        "supposed",
        "belong",
        "allegedly",
        "underlie",
        "range",
        "articulated",
        "philosophical",
        "notion",
        "theory",
        "without",
        "articulated",
        "argument",
        "thus",
        "perhaps",
        "profitably",
        "read",
        "targeting",
        "particular",
        "theory",
        "rather",
        "motivation",
        "considering",
        "range",
        "apparently",
        "independent",
        "even",
        "competing",
        "theory",
        "along",
        "associated",
        "task",
        "problem",
        "solution",
        "example",
        "still",
        "common",
        "idea",
        "often",
        "attributed",
        "john",
        "locke",
        "openly",
        "embraced",
        "jerry",
        "fodor",
        "nineteen",
        "seventy",
        "interpersonal",
        "spoken",
        "communication",
        "work",
        "speaker",
        "translation",
        "internal",
        "mental",
        "vocabulary",
        "sound",
        "followed",
        "hearer",
        "retranslation",
        "internal",
        "vocabulary",
        "descartes",
        "considered",
        "able",
        "talk",
        "experience",
        "claiming",
        "justified",
        "saying",
        "know",
        "produced",
        "reassuring",
        "philosophical",
        "argument",
        "anything",
        "external",
        "world",
        "conceived",
        "something",
        "independent",
        "others",
        "thought",
        "may",
        "make",
        "mistake",
        "external",
        "world",
        "infallibly",
        "avoid",
        "error",
        "confine",
        "judgment",
        "immediate",
        "sensation",
        "compare",
        "principle",
        "philosophy",
        "many",
        "philosopher",
        "including",
        "john",
        "stuart",
        "mill",
        "supposed",
        "problem",
        "mind",
        "according",
        "may",
        "reasonably",
        "doubt",
        "legitimacy",
        "applying",
        "say",
        "sensationwords",
        "being",
        "example",
        "implication",
        "internal",
        "vehicle",
        "musing",
        "could",
        "principle",
        "private",
        "kenny",
        "p",
        "showed",
        "vehicle",
        "language",
        "argument",
        "apply",
        "problem",
        "theory",
        "even",
        "make",
        "sense",
        "sharability",
        "must",
        "irrelevant",
        "meaning",
        "must",
        "least",
        "conceivable",
        "knowledge",
        "even",
        "understanding",
        "necessarily",
        "confined",
        "case",
        "implication",
        "course",
        "often",
        "denied",
        "term",
        "fodor",
        "language",
        "thought",
        "example",
        "supposed",
        "able",
        "refer",
        "public",
        "object",
        "question",
        "basis",
        "ability",
        "rest",
        "however",
        "question",
        "answered",
        "fodor",
        "concerned",
        "enough",
        "wittgenstein",
        "argument",
        "try",
        "show",
        "apply",
        "view",
        "andapparently",
        "superfluouslythat",
        "good",
        "argument",
        "anyway",
        "fodor",
        "pp",
        "matter",
        "clearer",
        "descartes",
        "compare",
        "kenny",
        "sceptical",
        "question",
        "raised",
        "without",
        "immediately",
        "selfdefeating",
        "must",
        "hold",
        "possible",
        "identify",
        "experience",
        "inwardlywhere",
        "inwardly",
        "mean",
        "without",
        "relying",
        "resource",
        "supplied",
        "essential",
        "embodiment",
        "world",
        "whose",
        "existence",
        "independent",
        "mind",
        "accessible",
        "others",
        "eg",
        "resource",
        "concept",
        "acquired",
        "normal",
        "upbringing",
        "question",
        "accordingly",
        "loom",
        "large",
        "private",
        "language",
        "argument",
        "identification",
        "one",
        "experience",
        "achieved",
        "however",
        "emphasized",
        "strongly",
        "significance",
        "private",
        "language",
        "argument",
        "rest",
        "scholarly",
        "detail",
        "whether",
        "thinker",
        "correctly",
        "described",
        "committed",
        "idea",
        "target",
        "way",
        "thinking",
        "generates",
        "philosophical",
        "theory",
        "theory"
    ]
}