{
    "main_text": "The Main Interpretations || Propensity Interpretations\n3.5 Propensity Interpretations\n\nLike the frequency interpretations, propensity\ninterpretations regard probabilities as objective properties of\nentities in the real world. Probability is thought of as a physical\npropensity, or disposition, or tendency of a given type of physical\nsituation to yield an outcome of a certain kind, or to yield a long\nrun relative frequency of such an outcome.\n\nWhile Popper (1957) is often credited as being the pioneer of\npropensity interpretations, we already find the key idea in the\nwritings of Peirce (1910, 79–80): “I am, then, to define\nthe meaning of the statement that the probability, that if a\ndie be thrown from a dice box it will turn up a number divisible by\nthree, is one-third. The statement means that the die has a certain\n‘would-be’; and to say that the die has a\n‘would-be’ is to say that it has a property, quite\nanalogous to any habit that a man might have.” A\nman’s habit is a paradigmatic example of a disposition;\naccording to Peirce the die’s probability of landing 3 or 6 is\nan analogous disposition. We might think of various habits coming in\ndifferent degrees, measuring their various strengths. Analogously, the\ndie’s propensities to land various ways measure the strength of\nits dispositions to do so.\n\nPeirce continues: “Now in order that the full effect of the\ndie’s ‘would-be’ may find expression, it is\nnecessary that the die should undergo an endless series of throws from\nthe dice box”, and he imagines the relative frequency of the\nevent-type in question oscilating from one side of 1/3 to another.\nThis again anticipates Popper’s view. But an important\ndifference is that Peirce regards the propensity as a property of the\ndie itself, whereas Popper attributes the propensity to the entire\nchance set-up of throwing the die.\n\nPopper (1957) is motivated by the desire to make sense of single-case\nprobability attributions that one finds in quantum mechanics—for\nexample ‘the probability that this radium atom decays in 1600\nyears is 1/2’. He develops the theory further in (1959a). For\nhim, a probability \\(p\\) of an outcome of a certain type is a\npropensity of a repeatable experiment to produce outcomes of that type\nwith limiting relative frequency \\(p\\). For instance, when we say that\na coin has probability 1/2 of landing heads when tossed, we mean that\nwe have a repeatable experimental set-up — the tossing set-up\n— that has a propensity to produce a sequence of outcomes in\nwhich the limiting relative frequency of heads is 1/2. With its heavy\nreliance on limiting relative frequency, this position risks\ncollapsing into von Mises-style frequentism according to some critics.\nGiere (1973), on the other hand, explicitly allows single-case\npropensities, with no mention of frequencies: probability is just a\npropensity of a repeatable experimental set-up to produce sequences of\noutcomes. This, however, creates the opposite problem to\nPopper’s: how, then, do we get the desired connection between\nprobabilities and frequencies?\n\nIt is thus useful to follow Gillies (2000a, 2016) in distinguishing\nlong-run propensity theories and single-case\npropensity theories:\n\nA long-run propensity theory is one in which propensities are\nassociated with repeatable conditions, and are regarded as\npropensities to produce in a long series of repetitions of these\nconditions frequencies which are approximately equal to the\nprobabilities. A single-case propensity theory is one in which\npropensities are regarded as propensities to produce a particular\nresult on a specific occasion (2000a, 822).\n\n\nHacking (1965) and Gillies offer long-run (though not infinitely\nlong-run) propensity theories. Fetzer (1982, 1983) and Miller (1994)\noffer single-case propensity theories. So does Popper in a later work\n(1990), in which he regards propensities as “properties of\nthe whole physical situation and sometimes of the particular\nway in which a situation changes” (17). Note that\n‘propensities’ are categorically different things\ndepending on which sort of theory we are considering. According to the\nlong-run theories, propensities are tendencies to produce relative\nfrequencies with particular values, but the propensities are not\nmeasured by the probability values themselves; according to the\nsingle-case theories, the propensities are measured by the\nprobability values. According to Popper’s earlier view, for\nexample, a fair die has a propensity — an extremely\nstrong tendency — to land ‘3’ with long-run\nrelative frequency 1/6. The small value of 1/6 does not\nmeasure this tendency. According to Giere, on the other hand, the die\nhas a weak tendency to land ‘3’. The value of 1/6\ndoes measure this tendency.\n\nIt seems that those theories that tie propensities to frequencies do\nnot provide an admissible interpretation of the (full) probability\ncalculus, for the same reasons that relative frequencies do not. It is\nprima facie unclear whether single-case propensity theories\nobey the probability calculus or not. To be sure, one can\nstipulate that they do so, perhaps using that stipulation as\npart of the implicit definition of propensities. Still, it remains to\nbe shown that there really are such things — stipulating what a\nwitch is does not suffice to show that witches exist. Indeed, to\nclaim, as Popper does, that an experimental arrangement has a tendency\nto produce a given limiting relative frequency of a particular\noutcome, presupposes a kind of stability or uniformity in the workings\nof that arrangement (for the limit would not exist in a suitably\nunstable arrangement). But this is the sort of\n‘uniformity of nature’ presupposition that Hume argued\ncould not be known either a priori, or empirically. Now,\nappeals can be made to limit theorems — so called ‘laws of\nlarge numbers’ — whose content is roughly that under\nsuitable conditions, such limiting relative frequencies almost\ncertainly exist, and equal the single case propensities. Still, these\ntheorems make assumptions (e.g., that the trials are independent and\nidentically distributed) whose truth again cannot be known, and must\nmerely be postulated.\n\nPart of the problem here, say critics, is that we do not know enough\nabout what propensities are to adjudicate these issues. There is\nsome property of this coin tossing arrangement such that this\ncoin would land heads with a certain long-run frequency, say. But as\nHitchcock (2002) points out, “calling this property a\n‘propensity’ of a certain strength does little to indicate\njust what this property is.” Said another way, propensity\naccounts are accused of giving empty accounts of probability, à\nla Molière’s ‘dormative virtue’ (Sober 2000,\n64). Similarly, Gillies objects to single-case propensities on the\ngrounds that statements about them are untestable, and that they are\n“metaphysical rather than scientific” (825). Some might\nlevel the same charge even against long-run propensities, which are\nsupposedly distinct from the testable relative\nfrequencies.\n\nThis suggests that the propensity account has difficulty meeting the\napplicability to science criterion. Some propensity theorists (e.g.,\nGiere) liken propensities to physical magnitudes such as electrical\ncharge that are the province of science. But Hitchcock observes that\nthe analogy is misleading. We can only determine the general\nproperties of charge — that it comes in two varieties, that like\ncharges repel, and so on — by empirical investigation. What\ninvestigation, however, could tell us whether or not propensities are\nnon-negative, normalized and additive? (See also Eagle 2004.)\n\nMore promising, perhaps, is the idea that propensities are to play\ncertain theoretical roles, and that these place constraints on the way\nthey must behave, and hence what they could be (in the style of the\nRamsey/Lewis/‘Canberra plan’ approach to theoretical terms\n— see Lewis 1970 or Jackson 2000). The trouble here is that\nthese roles may pull in opposite directions, overconstraining\nthe problem. The first role, according to some, constrains them to\nobey the probability calculus (with finite additivity); the second\nrole, according to others, constrains them to violate it.\n\nOn the one hand, propensities are said to constrain the degrees of\nbelief, or credences, of a rational agent. Recall the\n‘applicability to rational beliefs’ criterion: an\ninterpretation should clarify the role that probabilities play in\nconstraining the credences of rational agents. One such putative role\nfor propensities is codified by Lewis’s ‘Principal\nPrinciple’. (See section 3.3.) The Principal Principle underpins\nan argument (Lewis 1980) that whatever they are, propensities must\nobey the usual probability calculus (with finite additivity). After\nall, it is argued, rational credences, which are guided by them,\ndo.\n\nOn the other hand, Humphreys (1985) gives an influential argument that\npropensities do not obey Kolmogorov’s probability\ncalculus. The idea is that the probability calculus implies\nBayes’ theorem, which allows us to reverse a\nconditional probability: \n\\[ P(A\\mid B) = \\frac{P(B\\mid A) \\cdot P(A)}{P(B)} \\]\n\n\nYet propensities seem to be measures of ‘causal\ntendencies’, and much as the causal relation is asymmetric, so\nthese propensities supposedly do not reverse. Suppose that we have a\ntest for an illness that occasionally gives false positives and false\nnegatives. A given sick patient may have a (non-trivial) propensity to\ngive a positive test result, but it apparently makes no sense to say\nthat a given positive test result has a (non-trivial) propensity to\nhave come from a sick patient. Thus, we have an argument that whatever\nthey are, propensities must not obey the usual probability\ncalculus. ‘Humphreys’ paradox’, as it is known, is\nreally an argument against any formal account of propensities that has\nas a theorem:\n\n(∗) if the probability of \\(B\\), given \\(A\\) exists, then the\nprobability of \\(A\\), given \\(B\\) exists,\n\n\nhowever one understands these conditional probabilities. The argument\nhas prompted Fetzer and Nute (in Fetzer 1981) to offer a\n“probabilistic causal calculus” that looks quite different\nfrom Kolmogorov’s\n calculus.[11]\n But one could respond more conservatively, as Lyon (2014) points out.\nFor example, Rényi’s axiomatization of primitive\nconditional probabilities does not have (∗) as a theorem, and\nthus propensities may conform to it despite Humphreys’ argument.\nNonetheless, Lyon offers “a more general problem for the\npropensity interpretation. There are all sorts of pairs of events that\nhave no propensity relations between them, and all three axiom\nsystems—Kolmogorov’s, Popper’s, and\nRényi’s—will sometimes force there to be\nconditional probabilities between them. This is not an argument that\nthere is no alternative axiom system that propensity theorists can\nadopt, but it is an argument that the three main contenders are not\nviable” (124).\n\nOr perhaps all this shows that the notion of ‘propensity’\nbifurcates: on the one hand, there are propensities that bear an\nintimate connection to relative frequencies and rational credences,\nand that obey the usual probability calculus (with finite additivity);\non the other hand, there are causal propensities that behave rather\ndifferently. In that case, there would be still more interpretations\nof probability than have previously been recognized.\n",
    "section_title": "3.5 Propensity Interpretations",
    "entry_title": "Interpretations of Probability",
    "hierarchy_title": "Interpretations of Probability || The Main Interpretations || Propensity Interpretations",
    "tokenized_text": [
        "main",
        "interpretation",
        "propensity",
        "interpretation",
        "propensity",
        "interpretation",
        "like",
        "frequency",
        "interpretation",
        "propensity",
        "interpretation",
        "regard",
        "probability",
        "objective",
        "property",
        "entity",
        "real",
        "world",
        "probability",
        "thought",
        "physical",
        "propensity",
        "disposition",
        "tendency",
        "given",
        "type",
        "physical",
        "situation",
        "yield",
        "outcome",
        "certain",
        "kind",
        "yield",
        "long",
        "run",
        "relative",
        "frequency",
        "outcome",
        "popper",
        "often",
        "credited",
        "pioneer",
        "propensity",
        "interpretation",
        "already",
        "find",
        "key",
        "idea",
        "writing",
        "peirce",
        "define",
        "meaning",
        "statement",
        "probability",
        "die",
        "thrown",
        "dice",
        "box",
        "turn",
        "number",
        "divisible",
        "three",
        "onethird",
        "statement",
        "mean",
        "die",
        "certain",
        "wouldbe",
        "say",
        "die",
        "wouldbe",
        "say",
        "property",
        "quite",
        "analogous",
        "habit",
        "man",
        "might",
        "have",
        "man",
        "habit",
        "paradigmatic",
        "example",
        "disposition",
        "according",
        "peirce",
        "die",
        "probability",
        "landing",
        "analogous",
        "disposition",
        "might",
        "think",
        "various",
        "habit",
        "coming",
        "different",
        "degree",
        "measuring",
        "various",
        "strength",
        "analogously",
        "die",
        "propensity",
        "land",
        "various",
        "way",
        "measure",
        "strength",
        "disposition",
        "peirce",
        "continues",
        "order",
        "full",
        "effect",
        "die",
        "wouldbe",
        "may",
        "find",
        "expression",
        "necessary",
        "die",
        "undergo",
        "endless",
        "series",
        "throw",
        "dice",
        "box",
        "imago",
        "relative",
        "frequency",
        "eventtype",
        "question",
        "oscilating",
        "one",
        "side",
        "another",
        "anticipates",
        "popper",
        "view",
        "important",
        "difference",
        "peirce",
        "regard",
        "propensity",
        "property",
        "die",
        "whereas",
        "popper",
        "attribute",
        "propensity",
        "entire",
        "chance",
        "setup",
        "throwing",
        "die",
        "popper",
        "motivated",
        "desire",
        "make",
        "sense",
        "singlecase",
        "probability",
        "attribution",
        "one",
        "find",
        "quantum",
        "mechanicsfor",
        "example",
        "probability",
        "radium",
        "atom",
        "decay",
        "year",
        "develops",
        "theory",
        "a",
        "probability",
        "p",
        "outcome",
        "certain",
        "type",
        "propensity",
        "repeatable",
        "experiment",
        "produce",
        "outcome",
        "type",
        "limiting",
        "relative",
        "frequency",
        "p",
        "instance",
        "say",
        "coin",
        "probability",
        "landing",
        "head",
        "tossed",
        "mean",
        "repeatable",
        "experimental",
        "setup",
        "tossing",
        "setup",
        "propensity",
        "produce",
        "sequence",
        "outcome",
        "limiting",
        "relative",
        "frequency",
        "head",
        "heavy",
        "reliance",
        "limiting",
        "relative",
        "frequency",
        "position",
        "risk",
        "collapsing",
        "von",
        "misesstyle",
        "frequentism",
        "according",
        "critic",
        "giere",
        "hand",
        "explicitly",
        "allows",
        "singlecase",
        "propensity",
        "mention",
        "frequency",
        "probability",
        "propensity",
        "repeatable",
        "experimental",
        "setup",
        "produce",
        "sequence",
        "outcome",
        "however",
        "creates",
        "opposite",
        "problem",
        "popper",
        "get",
        "desired",
        "connection",
        "probability",
        "frequency",
        "thus",
        "useful",
        "follow",
        "gillie",
        "a",
        "distinguishing",
        "longrun",
        "propensity",
        "theory",
        "singlecase",
        "propensity",
        "theory",
        "longrun",
        "propensity",
        "theory",
        "one",
        "propensity",
        "associated",
        "repeatable",
        "condition",
        "regarded",
        "propensity",
        "produce",
        "long",
        "series",
        "repetition",
        "condition",
        "frequency",
        "approximately",
        "equal",
        "probability",
        "singlecase",
        "propensity",
        "theory",
        "one",
        "propensity",
        "regarded",
        "propensity",
        "produce",
        "particular",
        "result",
        "specific",
        "occasion",
        "a",
        "hacking",
        "gillie",
        "offer",
        "longrun",
        "though",
        "infinitely",
        "longrun",
        "propensity",
        "theory",
        "fetzer",
        "miller",
        "offer",
        "singlecase",
        "propensity",
        "theory",
        "popper",
        "later",
        "work",
        "regard",
        "propensity",
        "property",
        "whole",
        "physical",
        "situation",
        "sometimes",
        "particular",
        "way",
        "situation",
        "change",
        "note",
        "propensity",
        "categorically",
        "different",
        "thing",
        "depending",
        "sort",
        "theory",
        "considering",
        "according",
        "longrun",
        "theory",
        "propensity",
        "tendency",
        "produce",
        "relative",
        "frequency",
        "particular",
        "value",
        "propensity",
        "measured",
        "probability",
        "value",
        "according",
        "singlecase",
        "theory",
        "propensity",
        "measured",
        "probability",
        "value",
        "according",
        "popper",
        "earlier",
        "view",
        "example",
        "fair",
        "die",
        "propensity",
        "extremely",
        "strong",
        "tendency",
        "land",
        "longrun",
        "relative",
        "frequency",
        "small",
        "value",
        "measure",
        "tendency",
        "according",
        "giere",
        "hand",
        "die",
        "weak",
        "tendency",
        "land",
        "value",
        "measure",
        "tendency",
        "seems",
        "theory",
        "tie",
        "propensity",
        "frequency",
        "provide",
        "admissible",
        "interpretation",
        "full",
        "probability",
        "calculus",
        "reason",
        "relative",
        "frequency",
        "prima",
        "facie",
        "unclear",
        "whether",
        "singlecase",
        "propensity",
        "theory",
        "obey",
        "probability",
        "calculus",
        "sure",
        "one",
        "stipulate",
        "perhaps",
        "using",
        "stipulation",
        "part",
        "implicit",
        "definition",
        "propensity",
        "still",
        "remains",
        "shown",
        "really",
        "thing",
        "stipulating",
        "witch",
        "suffice",
        "show",
        "witch",
        "exist",
        "indeed",
        "claim",
        "popper",
        "experimental",
        "arrangement",
        "tendency",
        "produce",
        "given",
        "limiting",
        "relative",
        "frequency",
        "particular",
        "outcome",
        "presupposes",
        "kind",
        "stability",
        "uniformity",
        "working",
        "arrangement",
        "limit",
        "would",
        "exist",
        "suitably",
        "unstable",
        "arrangement",
        "sort",
        "uniformity",
        "nature",
        "presupposition",
        "hume",
        "argued",
        "could",
        "known",
        "either",
        "priori",
        "empirically",
        "appeal",
        "made",
        "limit",
        "theorem",
        "called",
        "law",
        "large",
        "number",
        "whose",
        "content",
        "roughly",
        "suitable",
        "condition",
        "limiting",
        "relative",
        "frequency",
        "almost",
        "certainly",
        "exist",
        "equal",
        "single",
        "case",
        "propensity",
        "still",
        "theorem",
        "make",
        "assumption",
        "eg",
        "trial",
        "independent",
        "identically",
        "distributed",
        "whose",
        "truth",
        "known",
        "must",
        "merely",
        "postulated",
        "part",
        "problem",
        "say",
        "critic",
        "know",
        "enough",
        "propensity",
        "adjudicate",
        "issue",
        "property",
        "coin",
        "tossing",
        "arrangement",
        "coin",
        "would",
        "land",
        "head",
        "certain",
        "longrun",
        "frequency",
        "say",
        "hitchcock",
        "point",
        "calling",
        "property",
        "propensity",
        "certain",
        "strength",
        "little",
        "indicate",
        "property",
        "is",
        "said",
        "another",
        "way",
        "propensity",
        "account",
        "accused",
        "giving",
        "empty",
        "account",
        "probability",
        "à",
        "la",
        "molière",
        "dormative",
        "virtue",
        "sober",
        "similarly",
        "gillie",
        "object",
        "singlecase",
        "propensity",
        "ground",
        "statement",
        "untestable",
        "metaphysical",
        "rather",
        "scientific",
        "might",
        "level",
        "charge",
        "even",
        "longrun",
        "propensity",
        "supposedly",
        "distinct",
        "testable",
        "relative",
        "frequency",
        "suggests",
        "propensity",
        "account",
        "difficulty",
        "meeting",
        "applicability",
        "science",
        "criterion",
        "propensity",
        "theorist",
        "eg",
        "giere",
        "liken",
        "propensity",
        "physical",
        "magnitude",
        "electrical",
        "charge",
        "province",
        "science",
        "hitchcock",
        "observes",
        "analogy",
        "misleading",
        "determine",
        "general",
        "property",
        "charge",
        "come",
        "two",
        "variety",
        "like",
        "charge",
        "repel",
        "empirical",
        "investigation",
        "investigation",
        "however",
        "could",
        "tell",
        "u",
        "whether",
        "propensity",
        "nonnegative",
        "normalized",
        "additive",
        "see",
        "also",
        "eagle",
        "promising",
        "perhaps",
        "idea",
        "propensity",
        "play",
        "certain",
        "theoretical",
        "role",
        "place",
        "constraint",
        "way",
        "must",
        "behave",
        "hence",
        "could",
        "style",
        "ramseylewis",
        "canberra",
        "plan",
        "approach",
        "theoretical",
        "term",
        "see",
        "lewis",
        "jackson",
        "trouble",
        "role",
        "may",
        "pull",
        "opposite",
        "direction",
        "overconstraining",
        "problem",
        "first",
        "role",
        "according",
        "constrains",
        "obey",
        "probability",
        "calculus",
        "finite",
        "additivity",
        "second",
        "role",
        "according",
        "others",
        "constrains",
        "violate",
        "one",
        "hand",
        "propensity",
        "said",
        "constrain",
        "degree",
        "belief",
        "credence",
        "rational",
        "agent",
        "recall",
        "applicability",
        "rational",
        "belief",
        "criterion",
        "interpretation",
        "clarify",
        "role",
        "probability",
        "play",
        "constraining",
        "credence",
        "rational",
        "agent",
        "one",
        "putative",
        "role",
        "propensity",
        "codified",
        "lewis",
        "principal",
        "principle",
        "see",
        "section",
        "principal",
        "principle",
        "underpins",
        "argument",
        "lewis",
        "whatever",
        "propensity",
        "must",
        "obey",
        "usual",
        "probability",
        "calculus",
        "finite",
        "additivity",
        "argued",
        "rational",
        "credence",
        "guided",
        "hand",
        "humphreys",
        "give",
        "influential",
        "argument",
        "propensity",
        "obey",
        "kolmogorov",
        "probability",
        "calculus",
        "idea",
        "probability",
        "calculus",
        "implies",
        "bayes",
        "theorem",
        "allows",
        "u",
        "reverse",
        "conditional",
        "probability",
        "p",
        "amid",
        "b",
        "frac",
        "p",
        "bmid",
        "cdot",
        "p",
        "p",
        "b",
        "yet",
        "propensity",
        "seem",
        "measure",
        "causal",
        "tendency",
        "much",
        "causal",
        "relation",
        "asymmetric",
        "propensity",
        "supposedly",
        "reverse",
        "suppose",
        "test",
        "illness",
        "occasionally",
        "give",
        "false",
        "positive",
        "false",
        "negative",
        "given",
        "sick",
        "patient",
        "may",
        "nontrivial",
        "propensity",
        "give",
        "positive",
        "test",
        "result",
        "apparently",
        "make",
        "sense",
        "say",
        "given",
        "positive",
        "test",
        "result",
        "nontrivial",
        "propensity",
        "come",
        "sick",
        "patient",
        "thus",
        "argument",
        "whatever",
        "propensity",
        "must",
        "obey",
        "usual",
        "probability",
        "calculus",
        "humphreys",
        "paradox",
        "known",
        "really",
        "argument",
        "formal",
        "account",
        "propensity",
        "theorem",
        "probability",
        "b",
        "given",
        "a",
        "exists",
        "probability",
        "a",
        "given",
        "b",
        "exists",
        "however",
        "one",
        "understands",
        "conditional",
        "probability",
        "argument",
        "prompted",
        "fetzer",
        "nute",
        "fetzer",
        "offer",
        "probabilistic",
        "causal",
        "calculus",
        "look",
        "quite",
        "different",
        "kolmogorov",
        "calculus",
        "one",
        "could",
        "respond",
        "conservatively",
        "lyon",
        "point",
        "example",
        "rényi",
        "axiomatization",
        "primitive",
        "conditional",
        "probability",
        "theorem",
        "thus",
        "propensity",
        "may",
        "conform",
        "despite",
        "humphreys",
        "argument",
        "nonetheless",
        "lyon",
        "offer",
        "general",
        "problem",
        "propensity",
        "interpretation",
        "sort",
        "pair",
        "event",
        "propensity",
        "relation",
        "three",
        "axiom",
        "systemskolmogorov",
        "popper",
        "rényi",
        "swill",
        "sometimes",
        "force",
        "conditional",
        "probability",
        "argument",
        "alternative",
        "axiom",
        "system",
        "propensity",
        "theorist",
        "adopt",
        "argument",
        "three",
        "main",
        "contender",
        "viable",
        "perhaps",
        "show",
        "notion",
        "propensity",
        "bifurcates",
        "one",
        "hand",
        "propensity",
        "bear",
        "intimate",
        "connection",
        "relative",
        "frequency",
        "rational",
        "credence",
        "obey",
        "usual",
        "probability",
        "calculus",
        "finite",
        "additivity",
        "hand",
        "causal",
        "propensity",
        "behave",
        "rather",
        "differently",
        "case",
        "would",
        "still",
        "interpretation",
        "probability",
        "previously",
        "recognized"
    ]
}