{
    "main_text": "Real Relations in God\n3. Real Relations in God\n\nProcess theists generally regard the notion of creation ex\nnihilo, as explained above, as going hand-in-hand with the idea\nthat the relations between God and the world are one-way relations.\nGod creates, but the creatures lack all creative power, the one wholly\nuncreated, the other wholly uncreative (Hartshorne 1970, 9). It is not\nwithin the ability of any creature, according to this view, to make a\ndifference to God. Aquinas’s way of expressing this asymmetry is\nto say that the relation from God to the creatures is real (for it\nmakes a difference, all the difference, to them) whereas the relation\nfrom the creatures to God is rational, or in the mind only (for the\nexistence of the creatures makes no difference to the being of God)\n(Summa Theologica I, Q 13, a. 7). Aquinas borrows, and places\nin a Christian context, Aristotle’s terms of “pure\nact” and “unmoved mover” to apply to God. To say\nthat God is pure act is to say that anything God could be, God already\nis—there is no potentiality in God for any type of change. To\nsay that God is the unmoved mover is to say that the divine moves\nothers but is unmoved by another—this includes the idea that God\nis impassible, literally, without feeling or emotion.\n\nIn the view of process theism, the denial of real relations in God\nrenders classical theism paradoxical to the point of incoherence.\nAccording to classical theism, God has perfect knowledge of a\ncontingent and changing world, yet nothing in God could be other than\nit is. The one condition, however, contradicts the other (cf.\nHartshorne 1948, 13–14; Viney and Shields 2020, 147-150). If any\nevent is contingent then it could be otherwise—for example, this\nbird at this place and time is singing rather than sleeping; but if\nthe event could be otherwise, then God’s knowledge of the event\ncould be otherwise—knowing this bird at this place and time as\nsinging rather than as sleeping. The contingency implied for\nGod’s knowing is not that God might have been ignorant of\nsomething but that the thing that God knows might have been different.\nAn infallible knower necessarily knows whatever exists; it does not\nfollow, however, that what exists is necessary unless one\nadds the premise, taken from classical theism, that nothing in God\ncould be other than it is. Process theism jettisons the premise that\nthere is nothing contingent in God. The only other non-atheistic\nalternatives, say process theists, are to follow Aristotle and deny\nthat God knows the world or to follow Spinoza and deny that nothing in\nGod or in the world could be other than it is (Hartshorne 1976, 12).\nWhat is impossible is a God with no contingent aspects knowing a\ncontingent world.\n\nThe denial of real relations in God also has paradoxical consequences\nfor the concept of divine goodness. If God is unaffected by the\ncreatures, then God is impassible, not moved by their suffering.\nAnselm, in Proslogion chapter VIII, asks how God can be\ncompassionate towards the creatures without feeling sympathy for them.\nHis answer—in effect a kind of theological behaviorism\n(Dombrowski 2006, 140)—is that the creatures feel the effects of\ndivine compassion but that God feels nothing. This leaves unanswered\nhow non-sympathetic compassion is possible. Aquinas provides a less\nobviously question begging reply. He says that to love another is to\nwill the good of the other; God necessarily wills the good of the\nother, so God is love (Summa Theologica I, Q 20, a. 2).\nProcess theists do not deny that love requires willing the good of the\nother, but they maintain that it requires something more, or at very\nleast that there are greater forms of love of which willing the good\nof the other is a necessary aspect. Divine love is more than\nbeneficence; it includes sensitivity to the joys and sorrows of the\nbeloved. This idea is expressed in Whitehead’s depiction of God\nas “the great companion—the fellow-sufferer who\nunderstands” (Whitehead 1929 [1978, 351]). Hartshorne points out that\nAnselm’s God can give us “everything except the right to\nbelieve that there is one who, with infinitely subtle and appropriate\nsensitivity, rejoices in all our joys and sorrows in all our\nsorrows” (Hartshorne 1948, 54).\n\nClosely related to the problem of passionless love, for classical\ntheism, is the question of the world’s value. The denial of real\nrelations in God, coupled with the concept that the world and its\ncreatures have no value except as it is borrowed from God, implies\nthat that total reality described by God-and-the-world\ncontains no more value than that described by\nGod-without-the-world. This view has two unhappy\nconsequences. First, it implies that there is no value in God’s\ncreating the world—nothing is gained, or lost, in God’s\ndecision to create. Second, it implies that there is no value in\nGod’s interaction with the creatures. Process theists point out\nthat these ideas do not square with analogies drawn from human\nexperience. There is value in giving one’s love to another, as\nfor instance, bringing children into the world and loving them; there\nis also value in one’s love being received and returned, as when\nthe children mature and cherish relations with their parents. Yet, one\ncannot love another unless the other exists, or once existed. Thus, if\nthere is a value in love, it requires the existence of the\nother, not merely the idea of the existence of the\nother. Process theism rejects the counter-intuitive claim that\nthe world as actually existing has no more value than the world as\npossibly existing. By parity of reasoning, process theism rejects the\nview that it is no better for God to create the world than to\ncontemplate the possibility of creating it.\n\nPerhaps the most disastrous consequences of the denial of real\nrelations in God, as far as process theists are concerned, are the\nproblems that it poses for free will and creaturely suffering. For\nclassical theism, the creative or causal relation flows one way only,\nfrom God to the world. The world and its creatures\nare products of a unilateral divine decision that things should be one\nway rather than another. Hartshorne poses a dilemma for this view.\nEither biological parents are part creators of their children or they\nare not. If they are then God alone is not the creator. On the other\nhand, if parents are not genuine creators of their children then the\ncreatures never create anything and we don’t know what\n“create” means, for parents having children would seem to\nbe a paradigm of creation—note the word\n“procreative” (cf. Hartshorne 1987, 88–89).\nClassical theists accept precisely the implication that Hartshorne\nfinds absurd, namely, that the creatures never create anything. The\nThomist, for example, holds that one’s parents are not creative;\nthey are the vehicles whereby matter-energy is rearranged so as to\nform (not to create) a new human being. Strictly speaking, for\nAquinas, what God creates is your-parents-having-you. Your\nparents had no part in your creation.\n\nAquinas’s theory poses complications for human freedom. The\nreality described by your-parents-having-you includes the\ndecisions they make in having you. God, in creating that reality, also\ncreates those decisions. Aquinas says that God’s will is\nperfectly efficacious—that is, what God wills comes to pass.\nTherefore, your parents’ decisions in\nyour-parents-having-you must occur. Would this view of\ndecision making jeopardize human freedom? Aquinas, representing\nclassical theism, says no, but Hartshorne, representing process\ntheism, says yes. In Aquinas’s view, one’s free decisions\nhave two sufficient explanations, one’s own will and\nGod’s will. In other words, God brings it about not only\nthat one freely decides something, but what one\nfreely decides (Summa Theologica I, Q 19, a. 8). Process\ntheists counter that multiple freedom (whether between God and the\ncreatures or among the creatures) implies the possibility of wills\ncoming into conflict or being in harmony. Hartshorne says, “Risk\nand opportunity go together, not because God chooses to have it so,\nbut because opportunity without risk is meaningless or\ncontradictory” (Hartshorne 1970, 238). If this is true, then it\nmust be possible for the will of the creatures to be at cross purposes\nwith the divine will. We have already seen that classical theists and\nprocess theists agree that God wills the good of the creatures. Human\nbeings, however, do not always will their own good, or the good of\nother people. In those cases, on the classical view, God brings it\nabout that people freely decide not to will the good of others.\nProcess theists argue that this makes God responsible for evil and\nsuffering in a way that contradicts divine goodness. On the classical\nview, for example, the crimes that disfigure human history are the\nfault of human beings, but they are also God’s doing.\n\nClassical theists are not without responses to these criticisms. One\nwell-known reply, used by Augustine and Aquinas, is to invoke the\ndistinction between divine permission and divine causation of human\nwickedness and suffering. On this view, the evil in the world is\npermitted by God in order to bring about a greater good. For example,\nthe Exultet of the Easter Vigil, sometimes ascribed to Ambrose of\nMilan, speaks of the sin of Adam and Eve as a blessed fault (O\nfelix culpa!) that made possible the sacrificial death of Christ.\nProcess theists argue that there can be no distinction between\npermitting and causing in a being that creates the universe ex\nnihilo. On the principles of classical theism, whatever is\ndivinely “permitted” is also divinely created to be as it\nis (cf. Griffin 1976, 63–64 and 82–83)—this is one\nof the few points on which process theism agrees with John Calvin\n(Case-Winters, 1990, 71). On the process view, creaturely decisions\nare themselves acts of creation, which means that the universe is a\njoint product of God and the creatures. Process theists do not see\nhow, in creation ex nihilo, creaturely decisions that God\npermits are not orchestrated by God so as to fulfill the purposes God\nhas for them. Albert Einstein is reported to have said that God does\nnot play dice with the universe. Although he was not a classical\ntheist, his view on this issue is in accord with that philosophy. God\nmay, as it were, allow or permit the dice to fall where they may, but\nonly if they fall as God desires them to fall; this seems different in\nname only from playing with loaded dice. Hartshorne replies,\n“Einstein’s rejection of a ‘dice-throwing God’\nwas a great man’s error. And human individuals are some of the\ndice …” (Hartshorne 1967a, 113).\n",
    "section_title": "3. Real Relations in God",
    "entry_title": "Process Theism",
    "hierarchy_title": "Process Theism || Real Relations in God",
    "tokenized_text": [
        "real",
        "relation",
        "god",
        "real",
        "relation",
        "god",
        "process",
        "theist",
        "generally",
        "regard",
        "notion",
        "creation",
        "ex",
        "nihilo",
        "explained",
        "going",
        "handinhand",
        "idea",
        "relation",
        "god",
        "world",
        "oneway",
        "relation",
        "god",
        "creates",
        "creature",
        "lack",
        "creative",
        "power",
        "one",
        "wholly",
        "uncreated",
        "wholly",
        "uncreative",
        "hartshorne",
        "within",
        "ability",
        "creature",
        "according",
        "view",
        "make",
        "difference",
        "god",
        "aquinas",
        "way",
        "expressing",
        "asymmetry",
        "say",
        "relation",
        "god",
        "creature",
        "real",
        "make",
        "difference",
        "difference",
        "whereas",
        "relation",
        "creature",
        "god",
        "rational",
        "mind",
        "existence",
        "creature",
        "make",
        "difference",
        "god",
        "summa",
        "theologica",
        "q",
        "aquinas",
        "borrows",
        "place",
        "christian",
        "context",
        "aristotle",
        "term",
        "pure",
        "act",
        "unmoved",
        "mover",
        "apply",
        "god",
        "say",
        "god",
        "pure",
        "act",
        "say",
        "anything",
        "god",
        "could",
        "god",
        "already",
        "isthere",
        "potentiality",
        "god",
        "type",
        "change",
        "say",
        "god",
        "unmoved",
        "mover",
        "say",
        "divine",
        "move",
        "others",
        "unmoved",
        "anotherthis",
        "includes",
        "idea",
        "god",
        "impassible",
        "literally",
        "without",
        "feeling",
        "emotion",
        "view",
        "process",
        "theism",
        "denial",
        "real",
        "relation",
        "god",
        "render",
        "classical",
        "theism",
        "paradoxical",
        "point",
        "incoherence",
        "according",
        "classical",
        "theism",
        "god",
        "perfect",
        "knowledge",
        "contingent",
        "changing",
        "world",
        "yet",
        "nothing",
        "god",
        "could",
        "one",
        "condition",
        "however",
        "contradicts",
        "cf",
        "hartshorne",
        "viney",
        "shield",
        "event",
        "contingent",
        "could",
        "otherwisefor",
        "example",
        "bird",
        "place",
        "time",
        "singing",
        "rather",
        "sleeping",
        "event",
        "could",
        "otherwise",
        "god",
        "knowledge",
        "event",
        "could",
        "otherwiseknowing",
        "bird",
        "place",
        "time",
        "singing",
        "rather",
        "sleeping",
        "contingency",
        "implied",
        "god",
        "knowing",
        "god",
        "might",
        "ignorant",
        "something",
        "thing",
        "god",
        "know",
        "might",
        "different",
        "infallible",
        "knower",
        "necessarily",
        "know",
        "whatever",
        "exists",
        "follow",
        "however",
        "exists",
        "necessary",
        "unless",
        "one",
        "add",
        "premise",
        "taken",
        "classical",
        "theism",
        "nothing",
        "god",
        "could",
        "process",
        "theism",
        "jettisons",
        "premise",
        "nothing",
        "contingent",
        "god",
        "nonatheistic",
        "alternative",
        "say",
        "process",
        "theist",
        "follow",
        "aristotle",
        "deny",
        "god",
        "know",
        "world",
        "follow",
        "spinoza",
        "deny",
        "nothing",
        "god",
        "world",
        "could",
        "hartshorne",
        "impossible",
        "god",
        "contingent",
        "aspect",
        "knowing",
        "contingent",
        "world",
        "denial",
        "real",
        "relation",
        "god",
        "also",
        "paradoxical",
        "consequence",
        "concept",
        "divine",
        "goodness",
        "god",
        "unaffected",
        "creature",
        "god",
        "impassible",
        "moved",
        "suffering",
        "anselm",
        "proslogion",
        "chapter",
        "viii",
        "asks",
        "god",
        "compassionate",
        "towards",
        "creature",
        "without",
        "feeling",
        "sympathy",
        "answerin",
        "effect",
        "kind",
        "theological",
        "behaviorism",
        "dombrowski",
        "is",
        "creature",
        "feel",
        "effect",
        "divine",
        "compassion",
        "god",
        "feel",
        "nothing",
        "leaf",
        "unanswered",
        "nonsympathetic",
        "compassion",
        "possible",
        "aquinas",
        "provides",
        "le",
        "obviously",
        "question",
        "begging",
        "reply",
        "say",
        "love",
        "another",
        "good",
        "god",
        "necessarily",
        "will",
        "good",
        "god",
        "love",
        "summa",
        "theologica",
        "q",
        "process",
        "theist",
        "deny",
        "love",
        "requires",
        "willing",
        "good",
        "maintain",
        "requires",
        "something",
        "least",
        "greater",
        "form",
        "love",
        "willing",
        "good",
        "necessary",
        "aspect",
        "divine",
        "love",
        "beneficence",
        "includes",
        "sensitivity",
        "joy",
        "sorrow",
        "beloved",
        "idea",
        "expressed",
        "whitehead",
        "depiction",
        "god",
        "great",
        "companionthe",
        "fellowsufferer",
        "understands",
        "whitehead",
        "hartshorne",
        "point",
        "anselm",
        "god",
        "give",
        "u",
        "everything",
        "except",
        "right",
        "believe",
        "one",
        "infinitely",
        "subtle",
        "appropriate",
        "sensitivity",
        "rejoices",
        "joy",
        "sorrow",
        "sorrow",
        "hartshorne",
        "closely",
        "related",
        "problem",
        "passionless",
        "love",
        "classical",
        "theism",
        "question",
        "world",
        "value",
        "denial",
        "real",
        "relation",
        "god",
        "coupled",
        "concept",
        "world",
        "creature",
        "value",
        "except",
        "borrowed",
        "god",
        "implies",
        "total",
        "reality",
        "described",
        "godandtheworld",
        "contains",
        "value",
        "described",
        "godwithouttheworld",
        "view",
        "two",
        "unhappy",
        "consequence",
        "first",
        "implies",
        "value",
        "god",
        "creating",
        "worldnothing",
        "gained",
        "lost",
        "god",
        "decision",
        "create",
        "second",
        "implies",
        "value",
        "god",
        "interaction",
        "creature",
        "process",
        "theist",
        "point",
        "idea",
        "square",
        "analogy",
        "drawn",
        "human",
        "experience",
        "value",
        "giving",
        "one",
        "love",
        "another",
        "instance",
        "bringing",
        "child",
        "world",
        "loving",
        "also",
        "value",
        "one",
        "love",
        "received",
        "returned",
        "child",
        "mature",
        "cherish",
        "relation",
        "parent",
        "yet",
        "one",
        "love",
        "another",
        "unless",
        "exists",
        "existed",
        "thus",
        "value",
        "love",
        "requires",
        "existence",
        "merely",
        "idea",
        "existence",
        "process",
        "theism",
        "reject",
        "counterintuitive",
        "claim",
        "world",
        "actually",
        "existing",
        "value",
        "world",
        "possibly",
        "existing",
        "parity",
        "reasoning",
        "process",
        "theism",
        "reject",
        "view",
        "better",
        "god",
        "create",
        "world",
        "contemplate",
        "possibility",
        "creating",
        "perhaps",
        "disastrous",
        "consequence",
        "denial",
        "real",
        "relation",
        "god",
        "far",
        "process",
        "theist",
        "concerned",
        "problem",
        "pose",
        "free",
        "creaturely",
        "suffering",
        "classical",
        "theism",
        "creative",
        "causal",
        "relation",
        "flow",
        "one",
        "way",
        "god",
        "world",
        "world",
        "creature",
        "product",
        "unilateral",
        "divine",
        "decision",
        "thing",
        "one",
        "way",
        "rather",
        "another",
        "hartshorne",
        "pose",
        "dilemma",
        "view",
        "either",
        "biological",
        "parent",
        "part",
        "creator",
        "child",
        "god",
        "alone",
        "creator",
        "hand",
        "parent",
        "genuine",
        "creator",
        "child",
        "creature",
        "never",
        "create",
        "anything",
        "know",
        "create",
        "mean",
        "parent",
        "child",
        "would",
        "seem",
        "paradigm",
        "creationnote",
        "word",
        "procreative",
        "cf",
        "hartshorne",
        "classical",
        "theist",
        "accept",
        "precisely",
        "implication",
        "hartshorne",
        "find",
        "absurd",
        "namely",
        "creature",
        "never",
        "create",
        "anything",
        "thomist",
        "example",
        "hold",
        "one",
        "parent",
        "creative",
        "vehicle",
        "whereby",
        "matterenergy",
        "rearranged",
        "form",
        "create",
        "new",
        "human",
        "strictly",
        "speaking",
        "aquinas",
        "god",
        "creates",
        "yourparentshavingyou",
        "parent",
        "part",
        "creation",
        "aquinas",
        "theory",
        "pose",
        "complication",
        "human",
        "freedom",
        "reality",
        "described",
        "yourparentshavingyou",
        "includes",
        "decision",
        "make",
        "god",
        "creating",
        "reality",
        "also",
        "creates",
        "decision",
        "aquinas",
        "say",
        "god",
        "perfectly",
        "efficaciousthat",
        "god",
        "will",
        "come",
        "pas",
        "therefore",
        "parent",
        "decision",
        "yourparentshavingyou",
        "must",
        "occur",
        "would",
        "view",
        "decision",
        "making",
        "jeopardize",
        "human",
        "freedom",
        "aquinas",
        "representing",
        "classical",
        "theism",
        "say",
        "hartshorne",
        "representing",
        "process",
        "theism",
        "say",
        "yes",
        "aquinas",
        "view",
        "one",
        "free",
        "decision",
        "two",
        "sufficient",
        "explanation",
        "one",
        "god",
        "word",
        "god",
        "brings",
        "one",
        "freely",
        "decides",
        "something",
        "one",
        "freely",
        "decides",
        "summa",
        "theologica",
        "q",
        "process",
        "theist",
        "counter",
        "multiple",
        "freedom",
        "whether",
        "god",
        "creature",
        "among",
        "creature",
        "implies",
        "possibility",
        "will",
        "coming",
        "conflict",
        "harmony",
        "hartshorne",
        "say",
        "risk",
        "opportunity",
        "go",
        "together",
        "god",
        "chooses",
        "opportunity",
        "without",
        "risk",
        "meaningless",
        "contradictory",
        "hartshorne",
        "true",
        "must",
        "possible",
        "creature",
        "cross",
        "purpose",
        "divine",
        "already",
        "seen",
        "classical",
        "theist",
        "process",
        "theist",
        "agree",
        "god",
        "will",
        "good",
        "creature",
        "human",
        "being",
        "however",
        "always",
        "good",
        "good",
        "people",
        "case",
        "classical",
        "view",
        "god",
        "brings",
        "people",
        "freely",
        "decide",
        "good",
        "others",
        "process",
        "theist",
        "argue",
        "make",
        "god",
        "responsible",
        "evil",
        "suffering",
        "way",
        "contradicts",
        "divine",
        "goodness",
        "classical",
        "view",
        "example",
        "crime",
        "disfigure",
        "human",
        "history",
        "fault",
        "human",
        "being",
        "also",
        "god",
        "classical",
        "theist",
        "without",
        "response",
        "criticism",
        "one",
        "wellknown",
        "reply",
        "used",
        "augustine",
        "aquinas",
        "invoke",
        "distinction",
        "divine",
        "permission",
        "divine",
        "causation",
        "human",
        "wickedness",
        "suffering",
        "view",
        "evil",
        "world",
        "permitted",
        "god",
        "order",
        "bring",
        "greater",
        "good",
        "example",
        "exultet",
        "easter",
        "vigil",
        "sometimes",
        "ascribed",
        "ambrose",
        "milan",
        "speaks",
        "sin",
        "adam",
        "eve",
        "blessed",
        "fault",
        "felix",
        "culpa",
        "made",
        "possible",
        "sacrificial",
        "death",
        "christ",
        "process",
        "theist",
        "argue",
        "distinction",
        "permitting",
        "causing",
        "creates",
        "universe",
        "ex",
        "nihilo",
        "principle",
        "classical",
        "theism",
        "whatever",
        "divinely",
        "permitted",
        "also",
        "divinely",
        "created",
        "cf",
        "griffin",
        "this",
        "one",
        "point",
        "process",
        "theism",
        "agrees",
        "john",
        "calvin",
        "casewinters",
        "process",
        "view",
        "creaturely",
        "decision",
        "act",
        "creation",
        "mean",
        "universe",
        "joint",
        "product",
        "god",
        "creature",
        "process",
        "theist",
        "see",
        "creation",
        "ex",
        "nihilo",
        "creaturely",
        "decision",
        "god",
        "permit",
        "orchestrated",
        "god",
        "fulfill",
        "purpose",
        "god",
        "albert",
        "einstein",
        "reported",
        "said",
        "god",
        "play",
        "dice",
        "universe",
        "although",
        "classical",
        "theist",
        "view",
        "issue",
        "accord",
        "philosophy",
        "god",
        "may",
        "allow",
        "permit",
        "dice",
        "fall",
        "may",
        "fall",
        "god",
        "desire",
        "fall",
        "seems",
        "different",
        "name",
        "playing",
        "loaded",
        "dice",
        "hartshorne",
        "reply",
        "einstein",
        "rejection",
        "dicethrowing",
        "god",
        "great",
        "man",
        "error",
        "human",
        "individual",
        "dice",
        "hartshorne",
        "a"
    ]
}