{
    "main_text": "Dual Transcendence in Whitehead and Hartshorne || Hartshorne on existence and actuality\n4.2 Hartshorne on existence and actuality\n\nHartshorne develops the concept of dual transcendence by drawing a\ndistinction of logical type between, on the one hand, an\nindividual’s existence and enduring characteristics and, on the\nother hand, the actual states of the individual. Using an example dear\nto his ornithological interests, Hartshorne says, “That I shall\n(at least probably) exist tomorrow is one thing; that I shall exist\nhearing a blue jay call at noon is another” (Hartshorne 1962,\n63). The logical relationship between the two sentences “I shall\nexist tomorrow” and “I shall exist tomorrow as hearing a\nblue jay call at noon” is that the second cannot be inferred\nfrom the first, but the first can be inferred from the second. The\nrelation of entailment between the sentences is a function of the\ninformation provided in them. Both sentences speak of the\nindividual’s existence, but only the second sentence speaks of\nthe experience that the individual is having. Hartshorne argues that\nthis logical relation between the sentences reflects an ontological\ndifference between the bare fact of one’s existence and the\nactual states in which one exists. Existence, says Hartshorne, is\nabstract compared to actuality, which is the concrete. What is true of\nexistence is also true of one’s defining or enduring\ncharacteristics. The state of affairs described by “Hartshorne\nexisting as an ornithologist” is abstract compared to the state\nof affairs described by “Hartshorne existing as an ornithologist\nhearing a blue jay call at noon.” The more abstract statement\nleaves more details concerning the individual’s actuality to be\ndefined. Unless strict determinism is the case—which would\nrequire that there is only one future that is genuinely\npossible—the ornithologist can exist tomorrow without hearing a\nblue jay call at noon (perhaps he will hear another bird, or none at\nall).\n\nIn effect, Hartshorne lays out a three-fold distinction between\nwhat a thing is (its essence or defining characteristics),\nthat a thing is (its existence), and the particular\nmanner in which it exists (its actual states or actuality).\nHartshorne maintains that this distinction, familiar enough in\nordinary experience, is applicable to God and is the basis for\nspeaking of dual transcendence in deity. Between the cases of God and\nthe creatures, however, there are important differences. Human\nexistence and character are fragile and subject to variation.\nGod’s existence and character, on the other hand, are not\ninsecure, unstable, or transient; in a word, they are not contingent.\nHartshorne agrees with traditional theism that God exists without the\npossibility of not existing (sometimes called necessary existence or\nexistence a se) and that God is necessarily supreme in love,\nknowledge, and power. A closely related point is that, in the divine\ncase, existence and essence are identical, whereas they are not the\nsame thing in the creatures. Aquinas speaks of the “existential\ncomposition” of the creatures to indicate that no creature\nnecessarily exists. Hartshorne agrees with Aquinas about this. Since,\nin God, existence and essence are the same, Hartshorne customarily\nabbreviates the distinction among existence, essence, and actuality to\nthat between existence and actuality.\n\nThe importance of the distinction between existence and actuality is\nto demonstrate that the necessary aspects of deity do not preclude God\nhaving contingent aspects, provided they do not conflict with the\nnecessary ones. We saw previously, in the discussion of real\nrelations, that there must be contingent aspects of the divine being\nif it is to have perfect knowledge of contingent things. Aquinas\nresists this conclusion, in part, because he sees contingency as a\nkind of metaphysical virus that infects the very existence of the one\nof which it is a characteristic. He says that a being whose substance\nhas any admixture of potency is subject to decay (as in physical\ncreatures) or annihilation (as in the case of angels) (Summa\nContra Gentiles I, ch. 16, para. 2). The logical type distinction\nbetween existence and actuality ensures that contingencies in God pose\nno threat to the deity’s necessary existence. Thus, Hartshorne\nsays, “That God exists is one with his essence and is an\nanalytic truth … but how, or in what actual state of experience\nor knowledge or will, he exists is contingent in the same sense as is\nour own existence” (Hartshorne 1948, 87). It is also part of\nHartshorne’s theory that God’s character or essence is\nsupremely excellent. Thus, the contingencies in the divine actuality\ndo not include the possibilities of God being selfish, cruel, or\nwicked as they do in the human case.\n\nThe mention of angelic existence in the previous paragraph brings up a\npoint seldom noticed in discussions of process theism. Aquinas\napproximates the Hartshornean distinction between immutable existence\nand mutable actuality in what he says about the nature of angels.\n(Thomists might say that Hartshorne approximates Aquinas.) Aquinas\nholds that angels are not subject to natural decay or destruction for\nthey are incorporeal. Like God, their existence is not affected by the\nflow of time. They are, however, capable of certain kinds of change.\nWhile their existence is constant, they have free will and their\nknowledge can increase, and in a certain sense, they can move from\nplace to place. Aquinas says that between the unqualified\nchangelessness of God’s eternity and the qualified\nchangeableness of corporeal existence, there is the qualified\nimmutability of angelic being. The technical expression for this is\næviternity, which is the mean between the extremes of\neternity and time (Summa Theologica I, Q 19, a. 5). One is\nalmost tempted to say that God, as conceived by Hartshorne, is\næviternital, except for three important differences:\n(1) angelic existence is unaffected by time, but it is still\ncontingent, unlike the existence of Hartshorne’s God; (2)\nangelic freedom includes the freedom to be wicked and Hartshorne does\nnot view that as an option for God; (3) angels are entirely\nnonphysical, but Hartshorne argues, as we shall see, that God has a\nbody of sorts in the universe itself.\n\nHartshorne often refers to his theism as “neoclassical” to\nindicate both its affinities with and its departures from classical\ntheism—it retains much of what is “classical” in\nclassical theism, but adds something that is new (neo).\nClassical theism holds to the necessity, eternity, infinity,\nindependence, immutability, and impassibility of God. Hartshorne\nagrees that God can be so characterized, but only with respect to the\ndivine existence and essence. Hartshorne adds that\nGod’s actuality is contingent, temporal, finite,\ndependent, mutable, and passible. Indeed, Hartshorne agrees with\nWhitehead that all achieved value is necessarily finite in\nthe sense of not exhausting all that can be. Whitehead makes the point\nthat the limitation of God is a necessary condition of God’s\ngoodness.\n\n[God] gains his depth of actuality by his harmony of valuation. It is\nnot true that God is in all respects infinite. If He were, He would be\nevil as well as good. Also this unlimited fusion of evil with good\nwould mean mere nothingness. He is something decided and is thereby\nlimited. (Whitehead 1926 [1997, 153])\n\n\nIt is noteworthy that Whitehead does not say that God is not infinite,\nbut that God is not infinite in all respects. Thus, dual\ntranscendence does not entail that God is in no sense infinite.\nHartshorne locates the infinity of God primarily in the unlimited\ncapacity to influence, know, and care for the creatures in any\nconceivable world.\n\nOne may rightly demand an answer to the question: If God is finite in\nsome respects, what prevents there being a reality that surpasses God?\nHartshorne’s response is that there is indeed a possible reality\nthat surpasses God in any actual state of the divine existence, but\nwhat can surpass God is only a subsequent actual state of Godself.\nHartshorne calls on Gustav Fechner’s distinction between\n“surpassable by others, including self” and\n“surpassable, but only by self.” It is only the latter\nphrase, according to Hartshorne, that applies to God. This is what\nHartshorne calls R-perfection (for relative perfection), a form of\nperfection that permits a contingent actuality in God that is\nunsurpassed by all others, excluding self. This is by way of\ncontrast with A-perfection (for absolute perfection)—which\napplies to the divine existence and essence—which is to be\nunsurpassable by all others, including self. To speak of God\nas having dual transcendence is to say that God is both R-perfect and\nA-perfect, but in different respects. Thus, one of Hartshorne’s\npreferred definitions of God: “the self-surpassing surpasser of\nall” (Hartshorne 1948, 20).\n\nHartshorne’s version of dual transcendence is quite different\nfrom Whitehead’s. To be sure, Whitehead and Hartshorne are in\nfirm agreement, and are at pains to emphasize, that the relations\nbetween God and the world are symmetrical. In addition, both\nphilosophers regard God as supremely worshipful not only with respect\nto the divine absoluteness but also with respect to the divine\nrelativity. Indeed, one of the main objectives of Hartshorne’s\nbook The Divine Relativity (1948) is to show that only by\nhaving an eminent form of relativity can the deity qualify as\nworshipful. Nevertheless, Hartshorne conceives God as an individual\nwho endures through various actual states. In the technical language\nof Whitehead’s philosophy, this makes God a\n“society,” that is to say, a collection of actual entities\nextended in time, each member of which shares a defining\ncharacteristic, passed along from one moment to the next. All enduring\nobjects are societies of actual entities; moreover, no actual entity\nendures through various states. Whitehead’s God is not\nan enduring object but a single actual entity. To speak of\nWhitehead’s God as dipolar is to indicate that God has a\nphysical and a mental pole. This sense of “dipolar” is\ndifferent from the meaning that Hartshorne commonly gives the\nexpression. Hartshorne does not deny that actual entities are dipolar,\nnor does he deny that there are physical and mental aspects of deity,\nbut his God is dipolar in having an enduring character embodied in\nsuccessive states, the character being abstract compared to the\nconcrete actual states—this gives us a third meaning of\n“dipolar” (cf. Griffin’s rather different view on\nthe meanings of dipolarity in God, Griffin 2001a, 150). Hartshorne\nsays, “Unlike Whitehead, I … define God as an enduring\nsociety of actualities, not a single actuality. Here I think Whitehead\nwas just mistaken” (Hartshorne 1967b, 287).\n\nWhitehead indicated that he considered the possibility of God being an\nenduring object, and thus a society, but rejected it on the grounds\nthat God’s consequent nature loses nothing of the past whereas\nsocieties are characterized by partial loss of the past (Johnson 1983,\n9). This argument is curious, for it would seem to apply to actual\nentities as well as to societies. No non-divine actual entity\npreserves its entire past without distortion and loss; yet Whitehead\nattributes to deity—in the doctrine of objective immortality of\nthe past in God—what no other actual entity can accomplish. In\nreply to a question from Vergilius Ferm, Hartshorne notes that the\nunique excellence of retaining the past perfectly in memory must be no\nless true if God is an actual entity than if God is a society (Rome\n1964, 324). He argues that the consequent nature of God is itself\nabstract, for it is the generic property of being somehow\nactual or affected by others (Hartshorne 1972, 75–76).\nThus, Hartshorne proposes that Whitehead would be more true to his own\nmetaphysics by conceiving God as an enduring object, and thus as a\nsociety, rather than as a single actual entity. Hartshorne\nacknowledged that his own theory is not without its problems. Not\nleast of these is how to coordinate the concept of a divine temporal\nworld-line with the relativistic view of space-time in contemporary\nphysics (Hartshorne 1970, 123–125; Sia 1990, 276; cf. Griffin\n1992). Suffice it to say that the question whether God is best\nconceived as a single actual entity or as an enduring object is a\nmajor parting of the ways between process theists. Griffin, for\nexample, refers to the idea of God as a single everlasting actual\nentity as Whitehead’s “greatest blunder” (Griffin\n2001a, 152). Nevertheless, Whitehead’s view has a number of able\ndefenders, including Jorge Nobo and Palmyre Oomen (Nobo 1989; Oomen\n1998).\n",
    "section_title": "4.2 Hartshorne on existence and actuality",
    "entry_title": "Process Theism",
    "hierarchy_title": "Process Theism || Dual Transcendence in Whitehead and Hartshorne || Hartshorne on existence and actuality",
    "tokenized_text": [
        "dual",
        "transcendence",
        "whitehead",
        "hartshorne",
        "hartshorne",
        "existence",
        "actuality",
        "hartshorne",
        "existence",
        "actuality",
        "hartshorne",
        "develops",
        "concept",
        "dual",
        "transcendence",
        "drawing",
        "distinction",
        "logical",
        "type",
        "one",
        "hand",
        "individual",
        "existence",
        "enduring",
        "characteristic",
        "hand",
        "actual",
        "state",
        "individual",
        "using",
        "example",
        "dear",
        "ornithological",
        "interest",
        "hartshorne",
        "say",
        "shall",
        "least",
        "probably",
        "exist",
        "tomorrow",
        "one",
        "thing",
        "shall",
        "exist",
        "hearing",
        "blue",
        "jay",
        "call",
        "noon",
        "another",
        "hartshorne",
        "logical",
        "relationship",
        "two",
        "sentence",
        "shall",
        "exist",
        "tomorrow",
        "shall",
        "exist",
        "tomorrow",
        "hearing",
        "blue",
        "jay",
        "call",
        "noon",
        "second",
        "inferred",
        "first",
        "first",
        "inferred",
        "second",
        "relation",
        "entailment",
        "sentence",
        "function",
        "information",
        "provided",
        "sentence",
        "speak",
        "individual",
        "existence",
        "second",
        "sentence",
        "speaks",
        "experience",
        "individual",
        "hartshorne",
        "argues",
        "logical",
        "relation",
        "sentence",
        "reflects",
        "ontological",
        "difference",
        "bare",
        "fact",
        "one",
        "existence",
        "actual",
        "state",
        "one",
        "exists",
        "existence",
        "say",
        "hartshorne",
        "abstract",
        "compared",
        "actuality",
        "concrete",
        "true",
        "existence",
        "also",
        "true",
        "one",
        "defining",
        "enduring",
        "characteristic",
        "state",
        "affair",
        "described",
        "hartshorne",
        "existing",
        "ornithologist",
        "abstract",
        "compared",
        "state",
        "affair",
        "described",
        "hartshorne",
        "existing",
        "ornithologist",
        "hearing",
        "blue",
        "jay",
        "call",
        "noon",
        "abstract",
        "statement",
        "leaf",
        "detail",
        "concerning",
        "individual",
        "actuality",
        "defined",
        "unless",
        "strict",
        "determinism",
        "casewhich",
        "would",
        "require",
        "one",
        "future",
        "genuinely",
        "possiblethe",
        "ornithologist",
        "exist",
        "tomorrow",
        "without",
        "hearing",
        "blue",
        "jay",
        "call",
        "noon",
        "perhaps",
        "hear",
        "another",
        "bird",
        "none",
        "effect",
        "hartshorne",
        "lay",
        "threefold",
        "distinction",
        "thing",
        "essence",
        "defining",
        "characteristic",
        "thing",
        "existence",
        "particular",
        "manner",
        "exists",
        "actual",
        "state",
        "actuality",
        "hartshorne",
        "maintains",
        "distinction",
        "familiar",
        "enough",
        "ordinary",
        "experience",
        "applicable",
        "god",
        "basis",
        "speaking",
        "dual",
        "transcendence",
        "deity",
        "case",
        "god",
        "creature",
        "however",
        "important",
        "difference",
        "human",
        "existence",
        "character",
        "fragile",
        "subject",
        "variation",
        "god",
        "existence",
        "character",
        "hand",
        "insecure",
        "unstable",
        "transient",
        "word",
        "contingent",
        "hartshorne",
        "agrees",
        "traditional",
        "theism",
        "god",
        "exists",
        "without",
        "possibility",
        "existing",
        "sometimes",
        "called",
        "necessary",
        "existence",
        "existence",
        "se",
        "god",
        "necessarily",
        "supreme",
        "love",
        "knowledge",
        "power",
        "closely",
        "related",
        "point",
        "divine",
        "case",
        "existence",
        "essence",
        "identical",
        "whereas",
        "thing",
        "creature",
        "aquinas",
        "speaks",
        "existential",
        "composition",
        "creature",
        "indicate",
        "creature",
        "necessarily",
        "exists",
        "hartshorne",
        "agrees",
        "aquinas",
        "since",
        "god",
        "existence",
        "essence",
        "hartshorne",
        "customarily",
        "abbreviates",
        "distinction",
        "among",
        "existence",
        "essence",
        "actuality",
        "existence",
        "actuality",
        "importance",
        "distinction",
        "existence",
        "actuality",
        "demonstrate",
        "necessary",
        "aspect",
        "deity",
        "preclude",
        "god",
        "contingent",
        "aspect",
        "provided",
        "conflict",
        "necessary",
        "one",
        "saw",
        "previously",
        "discussion",
        "real",
        "relation",
        "must",
        "contingent",
        "aspect",
        "divine",
        "perfect",
        "knowledge",
        "contingent",
        "thing",
        "aquinas",
        "resists",
        "conclusion",
        "part",
        "see",
        "contingency",
        "kind",
        "metaphysical",
        "virus",
        "infects",
        "existence",
        "one",
        "characteristic",
        "say",
        "whose",
        "substance",
        "admixture",
        "potency",
        "subject",
        "decay",
        "physical",
        "creature",
        "annihilation",
        "case",
        "angel",
        "summa",
        "contra",
        "gentile",
        "ch",
        "para",
        "logical",
        "type",
        "distinction",
        "existence",
        "actuality",
        "ensures",
        "contingency",
        "god",
        "pose",
        "threat",
        "deity",
        "necessary",
        "existence",
        "thus",
        "hartshorne",
        "say",
        "god",
        "exists",
        "one",
        "essence",
        "analytic",
        "truth",
        "actual",
        "state",
        "experience",
        "knowledge",
        "exists",
        "contingent",
        "sense",
        "existence",
        "hartshorne",
        "also",
        "part",
        "hartshorne",
        "theory",
        "god",
        "character",
        "essence",
        "supremely",
        "excellent",
        "thus",
        "contingency",
        "divine",
        "actuality",
        "include",
        "possibility",
        "god",
        "selfish",
        "cruel",
        "wicked",
        "human",
        "case",
        "mention",
        "angelic",
        "existence",
        "previous",
        "paragraph",
        "brings",
        "point",
        "seldom",
        "noticed",
        "discussion",
        "process",
        "theism",
        "aquinas",
        "approximates",
        "hartshornean",
        "distinction",
        "immutable",
        "existence",
        "mutable",
        "actuality",
        "say",
        "nature",
        "angel",
        "thomists",
        "might",
        "say",
        "hartshorne",
        "approximates",
        "aquinas",
        "aquinas",
        "hold",
        "angel",
        "subject",
        "natural",
        "decay",
        "destruction",
        "incorporeal",
        "like",
        "god",
        "existence",
        "affected",
        "flow",
        "time",
        "however",
        "capable",
        "certain",
        "kind",
        "change",
        "existence",
        "constant",
        "free",
        "knowledge",
        "increase",
        "certain",
        "sense",
        "move",
        "place",
        "place",
        "aquinas",
        "say",
        "unqualified",
        "changelessness",
        "god",
        "eternity",
        "qualified",
        "changeableness",
        "corporeal",
        "existence",
        "qualified",
        "immutability",
        "angelic",
        "technical",
        "expression",
        "æviternity",
        "mean",
        "extreme",
        "eternity",
        "time",
        "summa",
        "theologica",
        "q",
        "one",
        "almost",
        "tempted",
        "say",
        "god",
        "conceived",
        "hartshorne",
        "æviternital",
        "except",
        "three",
        "important",
        "difference",
        "angelic",
        "existence",
        "unaffected",
        "time",
        "still",
        "contingent",
        "unlike",
        "existence",
        "hartshorne",
        "god",
        "angelic",
        "freedom",
        "includes",
        "freedom",
        "wicked",
        "hartshorne",
        "view",
        "option",
        "god",
        "angel",
        "entirely",
        "nonphysical",
        "hartshorne",
        "argues",
        "shall",
        "see",
        "god",
        "body",
        "sort",
        "universe",
        "hartshorne",
        "often",
        "refers",
        "theism",
        "neoclassical",
        "indicate",
        "affinity",
        "departure",
        "classical",
        "theismit",
        "retains",
        "much",
        "classical",
        "classical",
        "theism",
        "add",
        "something",
        "new",
        "neo",
        "classical",
        "theism",
        "hold",
        "necessity",
        "eternity",
        "infinity",
        "independence",
        "immutability",
        "impassibility",
        "god",
        "hartshorne",
        "agrees",
        "god",
        "characterized",
        "respect",
        "divine",
        "existence",
        "essence",
        "hartshorne",
        "add",
        "god",
        "actuality",
        "contingent",
        "temporal",
        "finite",
        "dependent",
        "mutable",
        "passible",
        "indeed",
        "hartshorne",
        "agrees",
        "whitehead",
        "achieved",
        "value",
        "necessarily",
        "finite",
        "sense",
        "exhausting",
        "whitehead",
        "make",
        "point",
        "limitation",
        "god",
        "necessary",
        "condition",
        "god",
        "goodness",
        "god",
        "gain",
        "depth",
        "actuality",
        "harmony",
        "valuation",
        "true",
        "god",
        "respect",
        "infinite",
        "would",
        "evil",
        "well",
        "good",
        "also",
        "unlimited",
        "fusion",
        "evil",
        "good",
        "would",
        "mean",
        "mere",
        "nothingness",
        "something",
        "decided",
        "thereby",
        "limited",
        "whitehead",
        "noteworthy",
        "whitehead",
        "say",
        "god",
        "infinite",
        "god",
        "infinite",
        "respect",
        "thus",
        "dual",
        "transcendence",
        "entail",
        "god",
        "sense",
        "infinite",
        "hartshorne",
        "locates",
        "infinity",
        "god",
        "primarily",
        "unlimited",
        "capacity",
        "influence",
        "know",
        "care",
        "creature",
        "conceivable",
        "world",
        "one",
        "may",
        "rightly",
        "demand",
        "answer",
        "question",
        "god",
        "finite",
        "respect",
        "prevents",
        "reality",
        "surpasses",
        "god",
        "hartshorne",
        "response",
        "indeed",
        "possible",
        "reality",
        "surpasses",
        "god",
        "actual",
        "state",
        "divine",
        "existence",
        "surpass",
        "god",
        "subsequent",
        "actual",
        "state",
        "godself",
        "hartshorne",
        "call",
        "gustav",
        "fechner",
        "distinction",
        "surpassable",
        "others",
        "including",
        "self",
        "surpassable",
        "self",
        "latter",
        "phrase",
        "according",
        "hartshorne",
        "applies",
        "god",
        "hartshorne",
        "call",
        "rperfection",
        "relative",
        "perfection",
        "form",
        "perfection",
        "permit",
        "contingent",
        "actuality",
        "god",
        "unsurpassed",
        "others",
        "excluding",
        "self",
        "way",
        "contrast",
        "aperfection",
        "absolute",
        "perfection",
        "which",
        "applies",
        "divine",
        "existence",
        "essencewhich",
        "unsurpassable",
        "others",
        "including",
        "self",
        "speak",
        "god",
        "dual",
        "transcendence",
        "say",
        "god",
        "rperfect",
        "aperfect",
        "different",
        "respect",
        "thus",
        "one",
        "hartshorne",
        "preferred",
        "definition",
        "god",
        "selfsurpassing",
        "surpasser",
        "hartshorne",
        "hartshorne",
        "version",
        "dual",
        "transcendence",
        "quite",
        "different",
        "whitehead",
        "sure",
        "whitehead",
        "hartshorne",
        "firm",
        "agreement",
        "pain",
        "emphasize",
        "relation",
        "god",
        "world",
        "symmetrical",
        "addition",
        "philosopher",
        "regard",
        "god",
        "supremely",
        "worshipful",
        "respect",
        "divine",
        "absoluteness",
        "also",
        "respect",
        "divine",
        "relativity",
        "indeed",
        "one",
        "main",
        "objective",
        "hartshorne",
        "book",
        "divine",
        "relativity",
        "show",
        "eminent",
        "form",
        "relativity",
        "deity",
        "qualify",
        "worshipful",
        "nevertheless",
        "hartshorne",
        "conceives",
        "god",
        "individual",
        "endures",
        "various",
        "actual",
        "state",
        "technical",
        "language",
        "whitehead",
        "philosophy",
        "make",
        "god",
        "society",
        "say",
        "collection",
        "actual",
        "entity",
        "extended",
        "time",
        "member",
        "share",
        "defining",
        "characteristic",
        "passed",
        "along",
        "one",
        "moment",
        "next",
        "enduring",
        "object",
        "society",
        "actual",
        "entity",
        "moreover",
        "actual",
        "entity",
        "endures",
        "various",
        "state",
        "whitehead",
        "god",
        "enduring",
        "object",
        "single",
        "actual",
        "entity",
        "speak",
        "whitehead",
        "god",
        "dipolar",
        "indicate",
        "god",
        "physical",
        "mental",
        "pole",
        "sense",
        "dipolar",
        "different",
        "meaning",
        "hartshorne",
        "commonly",
        "give",
        "expression",
        "hartshorne",
        "deny",
        "actual",
        "entity",
        "dipolar",
        "deny",
        "physical",
        "mental",
        "aspect",
        "deity",
        "god",
        "dipolar",
        "enduring",
        "character",
        "embodied",
        "successive",
        "state",
        "character",
        "abstract",
        "compared",
        "concrete",
        "actual",
        "statesthis",
        "give",
        "u",
        "third",
        "meaning",
        "dipolar",
        "cf",
        "griffin",
        "rather",
        "different",
        "view",
        "meaning",
        "dipolarity",
        "god",
        "griffin",
        "a",
        "hartshorne",
        "say",
        "unlike",
        "whitehead",
        "define",
        "god",
        "enduring",
        "society",
        "actuality",
        "single",
        "actuality",
        "think",
        "whitehead",
        "mistaken",
        "hartshorne",
        "b",
        "whitehead",
        "indicated",
        "considered",
        "possibility",
        "god",
        "enduring",
        "object",
        "thus",
        "society",
        "rejected",
        "ground",
        "god",
        "consequent",
        "nature",
        "loses",
        "nothing",
        "past",
        "whereas",
        "society",
        "characterized",
        "partial",
        "loss",
        "past",
        "johnson",
        "argument",
        "curious",
        "would",
        "seem",
        "apply",
        "actual",
        "entity",
        "well",
        "society",
        "nondivine",
        "actual",
        "entity",
        "preserve",
        "entire",
        "past",
        "without",
        "distortion",
        "loss",
        "yet",
        "whitehead",
        "attribute",
        "deityin",
        "doctrine",
        "objective",
        "immortality",
        "past",
        "godwhat",
        "actual",
        "entity",
        "accomplish",
        "reply",
        "question",
        "vergilius",
        "ferm",
        "hartshorne",
        "note",
        "unique",
        "excellence",
        "retaining",
        "past",
        "perfectly",
        "memory",
        "must",
        "le",
        "true",
        "god",
        "actual",
        "entity",
        "god",
        "society",
        "rome",
        "argues",
        "consequent",
        "nature",
        "god",
        "abstract",
        "generic",
        "property",
        "somehow",
        "actual",
        "affected",
        "others",
        "hartshorne",
        "thus",
        "hartshorne",
        "proposes",
        "whitehead",
        "would",
        "true",
        "metaphysics",
        "conceiving",
        "god",
        "enduring",
        "object",
        "thus",
        "society",
        "rather",
        "single",
        "actual",
        "entity",
        "hartshorne",
        "acknowledged",
        "theory",
        "without",
        "problem",
        "least",
        "coordinate",
        "concept",
        "divine",
        "temporal",
        "worldline",
        "relativistic",
        "view",
        "spacetime",
        "contemporary",
        "physic",
        "hartshorne",
        "sia",
        "cf",
        "griffin",
        "suffice",
        "say",
        "question",
        "whether",
        "god",
        "best",
        "conceived",
        "single",
        "actual",
        "entity",
        "enduring",
        "object",
        "major",
        "parting",
        "way",
        "process",
        "theist",
        "griffin",
        "example",
        "refers",
        "idea",
        "god",
        "single",
        "everlasting",
        "actual",
        "entity",
        "whitehead",
        "greatest",
        "blunder",
        "griffin",
        "a",
        "nevertheless",
        "whitehead",
        "view",
        "number",
        "able",
        "defender",
        "including",
        "jorge",
        "nobo",
        "palmyre",
        "oomen",
        "nobo",
        "oomen"
    ]
}