{
    "main_text": "The Commentator of Plato\n2. The Commentator of Plato\n\n\nThe center of Proclus’ extensive oeuvre is without\ndoubt his exegesis of Plato, as is shown by the large commentaries he\ndevoted to major dialogues. This Platonic focus is also evident in the\ncomposition of his systematic works. The Platonic\nTheology offers a systematic exposition of theology based on\nan interpretation of all relevant sections on the gods and their\nattributes in Plato’s dialogues, and in particular on the\nParmenides, considered as the most theological of all\ndialogues. Proclus probably commented on all dialogues included in the\ncurriculum of the school since Iamblichus. In addition Proclus wrote\nthe commentary on the Republic mentioned above. The curriculum\nconsisted of altogether 12 dialogues distributed into two cycles. The\nfirst cycle started with Alcibiades (on self-knowledge) and\nended with the Philebus (on the final cause of everything: the\ngood), comprising two dialogues on ethics (the Gorgias and the\nPhaedo), two on logic (the Cratylus and the\nTheaetetus), two on physics (the Sophist and the\nStatesman), and two on theology (the Phaedrus and the\nSymposium). The second cycle included the two perfect\ndialogues that were considered to encompass Plato’s whole\nphilosophy (In Tim. I 13.14–17), namely, the Timaeus\n(on physics) and the Parmenides (on theology).\n\n\nIn the form and method of his commentaries, Proclus is again\ninfluenced by Iamblichus. He assumes that each Platonic dialogue must\nhave one main theme (skopos) to which all parts of the\narguments ought to be related. To interpret the text, different\napproaches are possible (theological, mathematical, physical, ethical\nexegesis), but they are all interconnected according to the principle\n‘everything in everything’ (panta en pasin). Thus,\nthe Timaeus has in all its parts as its purpose the\nexplanation of nature (physiologia). Even the introductory\nsections, the summary of the discussion in the Republic and\nthe anticipation of the story about Atlantis, must be understood from\nthis point of view; for they contain, in the mode of ‘images and\nexamples,’ a description of the fundamental forces that are at\nwork in the physical world. Also the long treatise on human nature,\nwhich concludes Timaeus’ exposition, has ultimately a\ncosmological meaning, as the human animal is a microcosmos wherein all\nelements and all causes of the great universe are found. More\nproblematic was the determination of the skopos of the\nParmenides. In a long discussion with the whole hermeneutical\ntradition since middle-Platonism, Proclus defends a theological\ninterpretation of the dialogue. According to him, the dialectical\ndiscussion on the One and the Many (ta alla) reveals the first divine principles\nof all things.\n\n\nWith the exception of the commentary on the Cratylus, of\nwhich only a selection of notes from the original commentary\nis preserved, the exegetical works of Proclus have a clear structure.\nThey divide the Platonic text in different lemmata or cited passages,\ndiscussing first the doctrine exposed in the particular section\n(pragmata, later called theoria), next commenting on\nthe formulation of the argument (called lexis) [see\nFestugière 1963]. Whereas modern scholars usually accept a\ndevelopment in Plato’s thought and distinguish between an early,\nmiddle, and late Plato, the Neoplatonists take the Platonic corpus as\nthe expression of a divinely inspired and unitary philosophical doctrine.\nThis enables them to connect different Platonic dialogues into one\nsystem and to see numerous cross-references within the Platonic\noeuvre. What may seem to be contradictions between statements\nmade in different dialogues, can be explained by different pedagogical\ncontexts, some dialogues being rather maieutic than expository, some\nelenctic of the sophistic pseudo-science, some offering a dialectical\ntraining to young students.\n\n\nA Neoplatonic commentary offers much more than a faithful\ninterpretation of an authoritative text of Plato. Plato’s text\ngives the commentator an opportunity to develop his own views on the\nmost fundamental philosophical questions, the first principles, the\nidea of the Good, the doctrine of the Forms, the soul and its\nfaculties, nature, etc. As was said, the two culminating dialogues, the\nTimaeus and the Parmenides, offer together a\ncomprehensive view of the whole of Platonic philosophy: \n\n\nSince the whole philosophy is divided into the study of intelligibles and the\nstudy of things within the cosmos – and quite rightly so, as the\ncosmos too is twofold, the intelligible and the sensible, as Timaeus\nhimself will say in what follows (Timaeus 30c) – the\nParmenides comprehends the study (pragmateia) of the\nintelligibles and the Timaeus the study of things within\nthe cosmos. For the former teaches us all the divine orders and the\nlatter all processions of things within the cosmos. (In\nTim. I 12.30–13.7)\n\n\nThe interpretation of the\nParmenides thus prepares the way for the Platonic\nTheology, offering the systematic structure for a scientific\ndemonstration of the procession of all the orders of gods from the first\nprinciple. As Proclus explains at Theol. Plat. I 2,\np. 9.8–19, the Platonic Theology falls into three\nparts (after a long methodological introduction). The first part\n(Theol. Plat. I 13–29) is an investigation into the\ncommon notions (koinai ennoiai) of the gods as we\nfind them in Plato’s dialogues: it is a treatise on the divine\nnames and attributes. The second part (Theol. Plat.\nII–VI), which is incomplete, unfolds in a systematic way the procession\nof the divine hierarchies, from the One, that is the first god, to the\n‘higher kinds,’ i.e., angels, daimones, and\nheroes, while the third part, which is altogether missing, was supposed\nto deal with the individual hypercosmic and encosmic gods.\n\n\nBefore presenting his own views, Proclus usually critically evaluates the\nopinions and interpretations of his predecessors. In this respect,\nhis commentaries are a rich and indispensable source for the\nhistory of Middle and Neo-Platonism. Thus, in his Commentary on the\nTimaeus Proclus reports and criticizes the views of Atticus,\nNumenius, Longinus, Plotinus, Porphyry, Iamblichus, Theodorus of Asine\nand many others, ending usually in full agreement with the explanation\nof his master Syrianus. Besides, in explaining Plato’s text,\nProclus frequently seeks confirmation of his exegesis in the\nChaldaean Oracles or the Orphic tradition. As Syrianus (see Helmig\n2009), Proclus is often very critical of Aristotle and refutes his\ncriticism of Plato’s views. He is certainly not an advocate of\nthe “harmony of Plato and Aristotle,” which became the\nleading principle of the Alexandrian commentaries (of Ammonius and\nSimplicius). Proclus notes significant differences between the two\nphilosophers in epistemology (theory of abstraction vs. learning as\nrecollection), metaphysics (first principle, theory of Forms, theory of\nuniversals), physics (Plato’s Timaeus vs.\nAristotle’s Physics), political philosophy\n(Aristotle’s criticism of Plato’s Republic), and\nlanguage (Cratylus vs. De Interpretatione).\nAccording to Proclus, Plato is not only far superior to Aristotle in\nhis theology (as only Plato ascended beyond the intellect to posit the\nOne as the ineffable principle of all things), but in all other\nphilosophical disciplines, where we owe to him all important\ndiscoveries. Whereas the Peripatetics were accustomed to defend the\nsuperiority of Aristotle over Plato with reference to his impressive\nphysical project, Proclus considers the latter as inferior to the great\nachievement of Plato in the Timaeus (see Steel 2003).\nAristotle’s natural philosophy is the work of a zealous admirer,\na disciple who tried to be better than the master: \n\n\nIt seems to me that the excellent Aristotle emulated the teaching of Plato as far\nas possible when he structured the whole investigation about\nnature. (In Tim. I 6.21–24) \n \n\nFollowing Plato, Aristotle explains in his Physics the\ngeneral principles of natural things: form, matter, nature, the\nessence and principles of movement, time and place; again taking\ninspiration from the Timaeus, he studies in other works the\nspecific principles of the distinct regions of the physical world,\nthus in the De Caelo the celestial and the sublunary\nrealm, and in On generation and corruption and\nin Meteorologica the sublunary realm. In this domain, it\ncannot be denied, Aristotle did much more than his master. According\nto Proclus, however, he developed the subject ‘beyond what is\nneeded’. The same remark must be made about Aristotle’s\nextensive zoological research. Whereas Plato limited himself in\nthe Timaeus to an analysis of the fundamental principles of\nall living organisms, Aristotle gave most of his attention to the\nmaterial components of animals and scarcely, and only in few cases,\ndid he consider the organism from the perspective of the form. Plato,\non the contrary, when explaining the physical world, never got lost in\na detailed examination.\n",
    "section_title": "2. The Commentator of Plato",
    "entry_title": "Proclus",
    "hierarchy_title": "Proclus || The Commentator of Plato",
    "tokenized_text": [
        "commentator",
        "plato",
        "commentator",
        "plato",
        "center",
        "proclus",
        "extensive",
        "oeuvre",
        "without",
        "doubt",
        "exegesis",
        "plato",
        "shown",
        "large",
        "commentary",
        "devoted",
        "major",
        "dialogue",
        "platonic",
        "focus",
        "also",
        "evident",
        "composition",
        "systematic",
        "work",
        "platonic",
        "theology",
        "offer",
        "systematic",
        "exposition",
        "theology",
        "based",
        "interpretation",
        "relevant",
        "section",
        "god",
        "attribute",
        "plato",
        "dialogue",
        "particular",
        "parmenides",
        "considered",
        "theological",
        "dialogue",
        "proclus",
        "probably",
        "commented",
        "dialogue",
        "included",
        "curriculum",
        "school",
        "since",
        "iamblichus",
        "addition",
        "proclus",
        "wrote",
        "commentary",
        "republic",
        "mentioned",
        "curriculum",
        "consisted",
        "altogether",
        "dialogue",
        "distributed",
        "two",
        "cycle",
        "first",
        "cycle",
        "started",
        "alcibiades",
        "selfknowledge",
        "ended",
        "philebus",
        "final",
        "cause",
        "everything",
        "good",
        "comprising",
        "two",
        "dialogue",
        "ethic",
        "gorgias",
        "phaedo",
        "two",
        "logic",
        "cratylus",
        "theaetetus",
        "two",
        "physic",
        "sophist",
        "statesman",
        "two",
        "theology",
        "phaedrus",
        "symposium",
        "second",
        "cycle",
        "included",
        "two",
        "perfect",
        "dialogue",
        "considered",
        "encompass",
        "plato",
        "whole",
        "philosophy",
        "tim",
        "namely",
        "timaeus",
        "physic",
        "parmenides",
        "theology",
        "form",
        "method",
        "commentary",
        "proclus",
        "influenced",
        "iamblichus",
        "assumes",
        "platonic",
        "dialogue",
        "must",
        "one",
        "main",
        "theme",
        "skopos",
        "part",
        "argument",
        "ought",
        "related",
        "interpret",
        "text",
        "different",
        "approach",
        "possible",
        "theological",
        "mathematical",
        "physical",
        "ethical",
        "exegesis",
        "interconnected",
        "according",
        "principle",
        "everything",
        "everything",
        "panta",
        "en",
        "pasin",
        "thus",
        "timaeus",
        "part",
        "purpose",
        "explanation",
        "nature",
        "physiologia",
        "even",
        "introductory",
        "section",
        "summary",
        "discussion",
        "republic",
        "anticipation",
        "story",
        "atlantis",
        "must",
        "understood",
        "point",
        "view",
        "contain",
        "mode",
        "image",
        "example",
        "description",
        "fundamental",
        "force",
        "work",
        "physical",
        "world",
        "also",
        "long",
        "treatise",
        "human",
        "nature",
        "concludes",
        "timaeus",
        "exposition",
        "ultimately",
        "cosmological",
        "meaning",
        "human",
        "animal",
        "microcosmos",
        "wherein",
        "element",
        "cause",
        "great",
        "universe",
        "found",
        "problematic",
        "determination",
        "skopos",
        "parmenides",
        "long",
        "discussion",
        "whole",
        "hermeneutical",
        "tradition",
        "since",
        "middleplatonism",
        "proclus",
        "defends",
        "theological",
        "interpretation",
        "dialogue",
        "according",
        "dialectical",
        "discussion",
        "one",
        "many",
        "ta",
        "alla",
        "reveals",
        "first",
        "divine",
        "principle",
        "thing",
        "exception",
        "commentary",
        "cratylus",
        "selection",
        "note",
        "original",
        "commentary",
        "preserved",
        "exegetical",
        "work",
        "proclus",
        "clear",
        "structure",
        "divide",
        "platonic",
        "text",
        "different",
        "lemma",
        "cited",
        "passage",
        "discussing",
        "first",
        "doctrine",
        "exposed",
        "particular",
        "section",
        "pragmata",
        "later",
        "called",
        "theoria",
        "next",
        "commenting",
        "formulation",
        "argument",
        "called",
        "lexis",
        "see",
        "festugière",
        "whereas",
        "modern",
        "scholar",
        "usually",
        "accept",
        "development",
        "plato",
        "thought",
        "distinguish",
        "early",
        "middle",
        "late",
        "plato",
        "neoplatonist",
        "take",
        "platonic",
        "corpus",
        "expression",
        "divinely",
        "inspired",
        "unitary",
        "philosophical",
        "doctrine",
        "enables",
        "connect",
        "different",
        "platonic",
        "dialogue",
        "one",
        "system",
        "see",
        "numerous",
        "crossreference",
        "within",
        "platonic",
        "oeuvre",
        "may",
        "seem",
        "contradiction",
        "statement",
        "made",
        "different",
        "dialogue",
        "explained",
        "different",
        "pedagogical",
        "context",
        "dialogue",
        "rather",
        "maieutic",
        "expository",
        "elenctic",
        "sophistic",
        "pseudoscience",
        "offering",
        "dialectical",
        "training",
        "young",
        "student",
        "neoplatonic",
        "commentary",
        "offer",
        "much",
        "faithful",
        "interpretation",
        "authoritative",
        "text",
        "plato",
        "plato",
        "text",
        "give",
        "commentator",
        "opportunity",
        "develop",
        "view",
        "fundamental",
        "philosophical",
        "question",
        "first",
        "principle",
        "idea",
        "good",
        "doctrine",
        "form",
        "soul",
        "faculty",
        "nature",
        "etc",
        "said",
        "two",
        "culminating",
        "dialogue",
        "timaeus",
        "parmenides",
        "offer",
        "together",
        "comprehensive",
        "view",
        "whole",
        "platonic",
        "philosophy",
        "since",
        "whole",
        "philosophy",
        "divided",
        "study",
        "intelligibles",
        "study",
        "thing",
        "within",
        "cosmos",
        "quite",
        "rightly",
        "cosmos",
        "twofold",
        "intelligible",
        "sensible",
        "timaeus",
        "say",
        "follows",
        "timaeus",
        "c",
        "parmenides",
        "comprehends",
        "study",
        "pragmateia",
        "intelligibles",
        "timaeus",
        "study",
        "thing",
        "within",
        "cosmos",
        "former",
        "teach",
        "u",
        "divine",
        "order",
        "latter",
        "procession",
        "thing",
        "within",
        "cosmos",
        "tim",
        "interpretation",
        "parmenides",
        "thus",
        "prepares",
        "way",
        "platonic",
        "theology",
        "offering",
        "systematic",
        "structure",
        "scientific",
        "demonstration",
        "procession",
        "order",
        "god",
        "first",
        "principle",
        "proclus",
        "explains",
        "theol",
        "plat",
        "p",
        "platonic",
        "theology",
        "fall",
        "three",
        "part",
        "long",
        "methodological",
        "introduction",
        "first",
        "part",
        "theol",
        "plat",
        "investigation",
        "common",
        "notion",
        "koinai",
        "ennoiai",
        "god",
        "find",
        "plato",
        "dialogue",
        "treatise",
        "divine",
        "name",
        "attribute",
        "second",
        "part",
        "theol",
        "plat",
        "iivi",
        "incomplete",
        "unfolds",
        "systematic",
        "way",
        "procession",
        "divine",
        "hierarchy",
        "one",
        "first",
        "god",
        "higher",
        "kind",
        "ie",
        "angel",
        "daimones",
        "hero",
        "third",
        "part",
        "altogether",
        "missing",
        "supposed",
        "deal",
        "individual",
        "hypercosmic",
        "encosmic",
        "god",
        "presenting",
        "view",
        "proclus",
        "usually",
        "critically",
        "evaluates",
        "opinion",
        "interpretation",
        "predecessor",
        "respect",
        "commentary",
        "rich",
        "indispensable",
        "source",
        "history",
        "middle",
        "neoplatonism",
        "thus",
        "commentary",
        "timaeus",
        "proclus",
        "report",
        "criticizes",
        "view",
        "atticus",
        "numenius",
        "longinus",
        "plotinus",
        "porphyry",
        "iamblichus",
        "theodorus",
        "asine",
        "many",
        "others",
        "ending",
        "usually",
        "full",
        "agreement",
        "explanation",
        "master",
        "syrianus",
        "besides",
        "explaining",
        "plato",
        "text",
        "proclus",
        "frequently",
        "seek",
        "confirmation",
        "exegesis",
        "chaldaean",
        "oracle",
        "orphic",
        "tradition",
        "syrianus",
        "see",
        "helmig",
        "proclus",
        "often",
        "critical",
        "aristotle",
        "refutes",
        "criticism",
        "plato",
        "view",
        "certainly",
        "advocate",
        "harmony",
        "plato",
        "aristotle",
        "became",
        "leading",
        "principle",
        "alexandrian",
        "commentary",
        "ammonius",
        "simplicius",
        "proclus",
        "note",
        "significant",
        "difference",
        "two",
        "philosopher",
        "epistemology",
        "theory",
        "abstraction",
        "vs",
        "learning",
        "recollection",
        "metaphysics",
        "first",
        "principle",
        "theory",
        "form",
        "theory",
        "universal",
        "physic",
        "plato",
        "timaeus",
        "vs",
        "aristotle",
        "physic",
        "political",
        "philosophy",
        "aristotle",
        "criticism",
        "plato",
        "republic",
        "language",
        "cratylus",
        "vs",
        "de",
        "interpretatione",
        "according",
        "proclus",
        "plato",
        "far",
        "superior",
        "aristotle",
        "theology",
        "plato",
        "ascended",
        "beyond",
        "intellect",
        "posit",
        "one",
        "ineffable",
        "principle",
        "thing",
        "philosophical",
        "discipline",
        "owe",
        "important",
        "discovery",
        "whereas",
        "peripatetic",
        "accustomed",
        "defend",
        "superiority",
        "aristotle",
        "plato",
        "reference",
        "impressive",
        "physical",
        "project",
        "proclus",
        "considers",
        "latter",
        "inferior",
        "great",
        "achievement",
        "plato",
        "timaeus",
        "see",
        "steel",
        "aristotle",
        "natural",
        "philosophy",
        "work",
        "zealous",
        "admirer",
        "disciple",
        "tried",
        "better",
        "master",
        "seems",
        "excellent",
        "aristotle",
        "emulated",
        "teaching",
        "plato",
        "far",
        "possible",
        "structured",
        "whole",
        "investigation",
        "nature",
        "tim",
        "following",
        "plato",
        "aristotle",
        "explains",
        "physic",
        "general",
        "principle",
        "natural",
        "thing",
        "form",
        "matter",
        "nature",
        "essence",
        "principle",
        "movement",
        "time",
        "place",
        "taking",
        "inspiration",
        "timaeus",
        "study",
        "work",
        "specific",
        "principle",
        "distinct",
        "region",
        "physical",
        "world",
        "thus",
        "de",
        "caelo",
        "celestial",
        "sublunary",
        "realm",
        "generation",
        "corruption",
        "meteorologica",
        "sublunary",
        "realm",
        "domain",
        "denied",
        "aristotle",
        "much",
        "master",
        "according",
        "proclus",
        "however",
        "developed",
        "subject",
        "beyond",
        "needed",
        "remark",
        "must",
        "made",
        "aristotle",
        "extensive",
        "zoological",
        "research",
        "whereas",
        "plato",
        "limited",
        "timaeus",
        "analysis",
        "fundamental",
        "principle",
        "living",
        "organism",
        "aristotle",
        "gave",
        "attention",
        "material",
        "component",
        "animal",
        "scarcely",
        "case",
        "consider",
        "organism",
        "perspective",
        "form",
        "plato",
        "contrary",
        "explaining",
        "physical",
        "world",
        "never",
        "got",
        "lost",
        "detailed",
        "examination"
    ]
}