{
    "main_text": "Enlightenment Views on Progress\n3. Enlightenment Views on Progress \n\nThe writings on progress of the 18th century drew inspiration from the\nintellectual achievements of the 16th and 17th centuries. During this\ntime, Europe witnessed an explosion of scientific and mathematical\nactivity.  In the natural sciences, the main fields of investigation\nwere physics and astronomy.  Major figures included Copernicus\n(1473–1543), Galileo (1564–1642), Kepler (1571–1630), and Newton\n(1642–1727).  Newton synthesized the work of the previous thinkers to\nbring the behavior of bodies on earth and bodies in space under a\nsingle scientific law, the law of universal gravitation.  This law\nstates that two bodies attract each other in proportion to their\nmasses and in inverse proportion to the square of the distance between\nthem (Palmer 1965, 265–271).\n\n\nThe discoveries of these scientists had broad implications.  First of\nall, the success of the new physics in unifying distinct phenomena and\npredicting behavior vindicated an underlying paradigm of scientific\ninvestigation and explanation.  Second, the rapid gains encouraged an\noptimistic view of humans' capability to understand and shape\ntheir world.  Here was a clear example of a communal activity in which\none human built on and improved the work of his predecessor.  The\nactivity resulted in the discovery of a scientific law, the law of\nuniversal gravitation, of unprecedented power (Palmer 1965, 271–273).\n\nTwo thinkers of the French Enlightenment, Anne-Robert-Jacques Turgot, Baron de Laume (1727-81), and  Marie Jean Caritat, Marquis de Condorcet (1743-1794), integrated reflection on scientific discoveries into their writings on progress. Turgot, a minister to Louis XVI, produced two influential works, A Philosophical Review of the Successive Advances of the Human Mind and On Universal History.  Condorcet was inspired by Turgot to write Outlines of an historical view of the Progress of the human mind, a piece that echoes many of Turgot's convictions.  Although Condorcet wrote his essay in prison during the Terror, he, like Turgot, evinces optimism about the future of France and of humanity as a whole. \n\n\nBoth authors suggest that philosophical progress is the deepest\ncondition of scientific progress.  Influenced by British empiricism,\nTurgot and Condorcet assert that all human knowledge is grounded in\nexperience.  According to Turgot, the renaissance of science first\nrequired an empiricist turn, the abandoning of explanations appealing\nto faculties and essences.  The scientific experiment then found its\nplace as the centerpiece of the scientific method and the vehicle of\nfurther progress (Turgot 1750, 45; 1751, 100–01).  Condorcet\nreiterates these points and also provides a wealth of examples of\nrecent scientific discoveries (1795, 168–170).  Turgot and Condorcet\nagree that scientific progress is dependent on mathematical and\ntechnological progress, and vice versa (Turgot 1750, 45; Condorcet\n1795, 231).\n\n\nAlthough neither author rigorously defines human well-being, both\nbelieve that, over the long term, scientific discoveries and\npolitical freedom reinforce each other and together further it.\nTurgot considers the role that political institutions play in\nadvancing science.  He thinks that individual genius moves science\nforward.  Political institutions are important to scientific progress\ninsofar as they allow geniuses to flourish.  Variation in scientific\nachievement is to be explained not by the concentration of genius but\nby the institutions that either suppress or encourage it (1751, 88).\nDespotic government is bad for genius, while republics nurture it.\nCondorcet also remarks that free institutions are the native\nenvironment of scientific discovery (1795, 129).  In turn, the growth\nof scientific knowledge will advance political freedom (Turgot 1750,\n43).\n\n\nTurgot and Condorcet also hold that short-term decline can be part of\na pattern of long-term improvement.  In the intellectual realm, the\npath to truth is rocky, and errors are frequently the first result of\nreflection (Turgot 1750, 44; Condorcet 1795, 37–38).  For instance,\nthe false scientific philosophy of faculties and essences is born of\nreflection on phenomena.  In the realm of action, devastating events\nlike war and conquest can ultimately unite scattered groups of people\nand ameliorate political organization (Turgot 1751, 71–2; Condorcet\n1795, 51).  Moreover, Turgot argues that individuals and groups that\ncontribute to progress are often motivated by emotion or personal\ninterest (1751, 69–70).  The second observation is related to the\nfirst, since Turgot thinks that the agents of creative destruction are\nusually narrowly self-interested or emotion-driven.\n\n\nDespite their many common convictions, Condorcet and Turgot part ways\non the question of religion.  Turgot is generally positive about\nChristianity, while a significant part of Condorcet's essay\nconsists of polemics against religion and especially priests (1795,\n123–124).  Condorcet states that as scientific knowledge spreads, an\nenlightened population will throw off the shackles of religion and its\npriests and demand greater freedom.\n\n\nThe Scottish and French Enlightenment were roughly contemporaneous and\ngrappled with the same social phenomena. It is difficult to draw hard\nand fast contrasts between the two bodies of thought, and better to\nconsider individual authors.  So we turn to writings of David Hume\n(1711–1776), which are characterized by both naturalism and\nskepticism.  Hume's essays on political questions reflect his general\nphilosophical orientation.  Although he is less likely than Condorcet\nand Turgot to make sweeping comments about progress, he explores the\ntopic of social development in various interesting ways.\n\n\nIn “Of the Rise and Progress of the Arts and Sciences,”\nHume connects political and intellectual development.  He begins with\nthe presumption that scientific and artistic progress requires a\nbackground of political security.  From this claim, he argues that the\narts and sciences cannot arise in a society without the rule of law.\nHume also asserts that no monarchy can develop the rule of law on its\nown, while republics must develop the rule of law if they are to\nsurvive at all.  He concludes that the arts and sciences first emerge\nin republics, not monarchies (1777, 59–62).\n\n\nAlthough the arts and sciences have their rise in republics, they may\nbe transplanted into “civilized monarchies” (67) and\ncontinue to improve in that environment.  Civilized monarchies are\nthose that have learned the rule of law from neighboring republics.\nHume even says that the arts progress more quickly in civilized\nmonarchies than in republics, because they are useful for flattering\nmonarchs.  On the other hand, according to Hume, the general\npopulation is more impressed by scientific discoveries with obvious\ntechnological applications than by artistic creations.  Therefore the\nsciences progress more quickly in republics, in which the general\npublic holds power, than in monarchies (68–69).\n\n\nHume thinks that countries can affect each other's progress.\nFor instance, competition can spur greater progress, and isolation can\ncause a country to stall (64–5).  On the other hand, countries can\nintimidate each other into inactivity (76).  Hume also asserts that\nthe arts and sciences cannot progress indefinitely in a single\ncountry.  Once they reach a certain height, members of the next\ngeneration are too intimidated by their predecessors to strike out on\ntheir own (75–76).\n\n\nA second Scottish Enlightenment figure, Adam Smith (1723–1790), is\noften regarded as an economist, but in fact he began his career as a\nphilosopher.  His first work, The Theory of the Moral\nSentiments, addressed the philosophy of moral judgment and\naction.  It is therefore not surprising that the Wealth of\nNations, the work on economic growth for which he is best known,\nhas a deeper philosophical resonance.\n\n\nSmith's central observation is that, in economic life, it often\nhappens that individuals in pursuit of their self-interest\nnevertheless contribute to the common good (1776, 484–485).  It is as\nthough they are “led by an invisible hand” (485) to take\nsocially beneficial actions.  For instance, Smith argues that the\ndivision of labor is the spontaneous outcome of the human\n“propensity to truck, barter, and exchange one thing for\nanother” (14).  Humans engage in this activity for\nself-interested reasons.  But growth in the productivity of labor in a\nsociety is largely due to a greater division of labor (3).  It is\nbecause of a greater division of labor, Smith contends, that the\npoorest members of European countries are richer than the richest\nmembers of societies in other parts of the world (13).\n\n\nFailure to see the work of the invisible hand will lead to unwise\npolicies.  Smith says that, in the absence of government intervention,\nself-interest leads each nation to produce only the goods in which it\nhas a comparative advantage.  Self-interested behavior in the presence\nof government attempts to support domestic industries actually results\nin a worse outcome.  One goal of the book is admittedly practical: to\nattack mercantilism, the doctrine that dominated economic policy in\nEurope from the 16th century onward.  Mercantilism holds that\naggressive government intervention is the key to increasing national\nwealth.  Accordingly, during this time, the governments of Europe\nattempted to steer and promote domestic industries, most notably by\nplacing high tariffs on foreign imports (Palmer 1965, 102).  Smith\nargues against these policies. He writes that tariffs on imports harm\nthe nation as a whole, by misdirecting its resources (1776, 485–487).\nIn general, he says, the government should play a circumscribed role\nin the economic life of a country, confining itself to the protection\nof property rights, the support of a national defense force, and the\nprovision of a few other key public goods (745).\n\n\nSmith's emphasis on spontaneous improvement in economic life\nwarrants treating him as a theorist of progress.  But, given his\nworries about mercantilism, it is clear he thinks that this type of\ndevelopment is fragile.  Nations will not maximize their wealth unless\nthey have the wisdom to allow spontaneous growth to occur.  Smith\nintends the Wealth of Nations to help policy makers recognize\nthe phenomena that he believes to have correctly identified.\n\n\nThe thinkers of the Scottish and French Enlightenment authors are\nempiricists.  Unlike them, the German Enlightenment figure Immanuel\nKant (1724–1804) reasons in an a priori manner to the\nconclusion that humanity is progressing.  Kant's writings on progress\nconsist of a series of short pieces from the 1780s and 90s, including\n“Ideas toward a Universal History with Cosmopolitan\nIntent,” and “Perpetual Peace.” In addition to its\nreliance on a priori reasoning, Kant's work is noteworthy for\nits emphasis on world peace and its detailed description of the\ndomestic and international institutions needed for peaceful\nconditions.\n\n\nKant remarks that certain trends are compatible with progress, but\ncautions that no trajectory can be inferred with certainty from the\nfacts (1784, 50).  His a priori argument begins with the\npremise that all animals have natural faculties.  If nature is not to\nbe in vain, we must assume that the faculties of an animal can be\ndeveloped.  Unlike other animals, the human being cannot develop all\nof its faculties in a lifetime.  If the faculties given to humans are\nnot to be considered useless, then the only other possibility is that\nthe human race as a whole, over time, will develop all the human\nfaculties (1784, 42–44).  The progress from one era to another is\nmeasured by the development of human faculties during that time.\n\n\nKant thinks that human faculties can reach their fullest expression\nonly in free and peaceful circumstances (1784, 50), which in turn\nrequire a particular set of institutions.  A federation of republics\nwill mark the final stage of human development.  A republic is a state\nbased on the rule of law whose members are free and equal citizens\n(1795, 99).  A federation is a group of nations who have agreed to\nobserve rules of peaceful conduct in their mutual relations (1795,\n98ff).  Kant argues that the domestic and international features of\nthis institutional constellation will reinforce each other.  Republics\nwill not go to war with each other because a declaration of war\nrequires the consent of the public, who are reluctant to pay a\nwar's price (1795, 100).  In turn, domestic conditions will be\nimproved in the absence of a state's constant involvement in\nwars (1784, 49).\n\n\nThe details of the development toward the peaceful federation are\ngiven by Kant's universal history.  This narrative is presented\nas, at best, consistent with empirical evidence.  Kant argues that,\nfor the most part, human psychology and the natural environment,\nrather than human reason, could have driven the human race forward.\nFirst, he attributes progress to the “unsocial\nsociability” (1784, 44) of human beings.  Humans are social\nbecause they cannot develop their capabilities in isolation.  Yet they\nare unsocial because they always want to get their own way.  These\ncharacteristics lead them to form associations in which all vie for\n“status” (1784, 44).  These associations are the seeds of\nrepublics.  But progressive human activity need not be lacking in\nawareness.  Kant maintains that a philosophy of progress can\naccelerate progress (1784, 51).\n\n",
    "section_title": "3. Enlightenment Views on Progress ",
    "entry_title": "Progress",
    "hierarchy_title": "Progress || Enlightenment Views on Progress",
    "tokenized_text": [
        "enlightenment",
        "view",
        "progress",
        "enlightenment",
        "view",
        "progress",
        "writing",
        "progress",
        "th",
        "century",
        "drew",
        "inspiration",
        "intellectual",
        "achievement",
        "th",
        "th",
        "century",
        "time",
        "europe",
        "witnessed",
        "explosion",
        "scientific",
        "mathematical",
        "activity",
        "natural",
        "science",
        "main",
        "field",
        "investigation",
        "physic",
        "astronomy",
        "major",
        "figure",
        "included",
        "copernicus",
        "galileo",
        "kepler",
        "newton",
        "newton",
        "synthesized",
        "work",
        "previous",
        "thinker",
        "bring",
        "behavior",
        "body",
        "earth",
        "body",
        "space",
        "single",
        "scientific",
        "law",
        "law",
        "universal",
        "gravitation",
        "law",
        "state",
        "two",
        "body",
        "attract",
        "proportion",
        "mass",
        "inverse",
        "proportion",
        "square",
        "distance",
        "palmer",
        "discovery",
        "scientist",
        "broad",
        "implication",
        "first",
        "success",
        "new",
        "physic",
        "unifying",
        "distinct",
        "phenomenon",
        "predicting",
        "behavior",
        "vindicated",
        "underlying",
        "paradigm",
        "scientific",
        "investigation",
        "explanation",
        "second",
        "rapid",
        "gain",
        "encouraged",
        "optimistic",
        "view",
        "human",
        "capability",
        "understand",
        "shape",
        "world",
        "clear",
        "example",
        "communal",
        "activity",
        "one",
        "human",
        "built",
        "improved",
        "work",
        "predecessor",
        "activity",
        "resulted",
        "discovery",
        "scientific",
        "law",
        "law",
        "universal",
        "gravitation",
        "unprecedented",
        "power",
        "palmer",
        "two",
        "thinker",
        "french",
        "enlightenment",
        "annerobertjacques",
        "turgot",
        "baron",
        "de",
        "laume",
        "marie",
        "jean",
        "caritat",
        "marquis",
        "de",
        "condorcet",
        "integrated",
        "reflection",
        "scientific",
        "discovery",
        "writing",
        "progress",
        "turgot",
        "minister",
        "louis",
        "xvi",
        "produced",
        "two",
        "influential",
        "work",
        "philosophical",
        "review",
        "successive",
        "advance",
        "human",
        "mind",
        "universal",
        "history",
        "condorcet",
        "inspired",
        "turgot",
        "write",
        "outline",
        "historical",
        "view",
        "progress",
        "human",
        "mind",
        "piece",
        "echo",
        "many",
        "turgot",
        "s",
        "conviction",
        "although",
        "condorcet",
        "wrote",
        "essay",
        "prison",
        "terror",
        "like",
        "turgot",
        "evinces",
        "optimism",
        "future",
        "france",
        "humanity",
        "whole",
        "author",
        "suggest",
        "philosophical",
        "progress",
        "deepest",
        "condition",
        "scientific",
        "progress",
        "influenced",
        "british",
        "empiricism",
        "turgot",
        "condorcet",
        "assert",
        "human",
        "knowledge",
        "grounded",
        "experience",
        "according",
        "turgot",
        "renaissance",
        "science",
        "first",
        "required",
        "empiricist",
        "turn",
        "abandoning",
        "explanation",
        "appealing",
        "faculty",
        "essence",
        "scientific",
        "experiment",
        "found",
        "place",
        "centerpiece",
        "scientific",
        "method",
        "vehicle",
        "progress",
        "turgot",
        "condorcet",
        "reiterates",
        "point",
        "also",
        "provides",
        "wealth",
        "example",
        "recent",
        "scientific",
        "discovery",
        "turgot",
        "condorcet",
        "agree",
        "scientific",
        "progress",
        "dependent",
        "mathematical",
        "technological",
        "progress",
        "vice",
        "versa",
        "turgot",
        "condorcet",
        "although",
        "neither",
        "author",
        "rigorously",
        "defines",
        "human",
        "wellbeing",
        "believe",
        "long",
        "term",
        "scientific",
        "discovery",
        "political",
        "freedom",
        "reinforce",
        "together",
        "turgot",
        "considers",
        "role",
        "political",
        "institution",
        "play",
        "advancing",
        "science",
        "think",
        "individual",
        "genius",
        "move",
        "science",
        "forward",
        "political",
        "institution",
        "important",
        "scientific",
        "progress",
        "insofar",
        "allow",
        "genius",
        "flourish",
        "variation",
        "scientific",
        "achievement",
        "explained",
        "concentration",
        "genius",
        "institution",
        "either",
        "suppress",
        "encourage",
        "despotic",
        "government",
        "bad",
        "genius",
        "republic",
        "nurture",
        "condorcet",
        "also",
        "remark",
        "free",
        "institution",
        "native",
        "environment",
        "scientific",
        "discovery",
        "turn",
        "growth",
        "scientific",
        "knowledge",
        "advance",
        "political",
        "freedom",
        "turgot",
        "turgot",
        "condorcet",
        "also",
        "hold",
        "shortterm",
        "decline",
        "part",
        "pattern",
        "longterm",
        "improvement",
        "intellectual",
        "realm",
        "path",
        "truth",
        "rocky",
        "error",
        "frequently",
        "first",
        "result",
        "reflection",
        "turgot",
        "condorcet",
        "instance",
        "false",
        "scientific",
        "philosophy",
        "faculty",
        "essence",
        "born",
        "reflection",
        "phenomenon",
        "realm",
        "action",
        "devastating",
        "event",
        "like",
        "war",
        "conquest",
        "ultimately",
        "unite",
        "scattered",
        "group",
        "people",
        "ameliorate",
        "political",
        "organization",
        "turgot",
        "condorcet",
        "moreover",
        "turgot",
        "argues",
        "individual",
        "group",
        "contribute",
        "progress",
        "often",
        "motivated",
        "emotion",
        "personal",
        "interest",
        "second",
        "observation",
        "related",
        "first",
        "since",
        "turgot",
        "think",
        "agent",
        "creative",
        "destruction",
        "usually",
        "narrowly",
        "selfinterested",
        "emotiondriven",
        "despite",
        "many",
        "common",
        "conviction",
        "condorcet",
        "turgot",
        "part",
        "way",
        "question",
        "religion",
        "turgot",
        "generally",
        "positive",
        "christianity",
        "significant",
        "part",
        "condorcet",
        "s",
        "essay",
        "consists",
        "polemic",
        "religion",
        "especially",
        "priest",
        "condorcet",
        "state",
        "scientific",
        "knowledge",
        "spread",
        "enlightened",
        "population",
        "throw",
        "shackle",
        "religion",
        "priest",
        "demand",
        "greater",
        "freedom",
        "scottish",
        "french",
        "enlightenment",
        "roughly",
        "contemporaneous",
        "grappled",
        "social",
        "phenomenon",
        "difficult",
        "draw",
        "hard",
        "fast",
        "contrast",
        "two",
        "body",
        "thought",
        "better",
        "consider",
        "individual",
        "author",
        "turn",
        "writing",
        "david",
        "hume",
        "characterized",
        "naturalism",
        "skepticism",
        "hume",
        "s",
        "essay",
        "political",
        "question",
        "reflect",
        "general",
        "philosophical",
        "orientation",
        "although",
        "le",
        "likely",
        "condorcet",
        "turgot",
        "make",
        "sweeping",
        "comment",
        "progress",
        "explores",
        "topic",
        "social",
        "development",
        "various",
        "interesting",
        "way",
        "rise",
        "progress",
        "art",
        "science",
        "hume",
        "connects",
        "political",
        "intellectual",
        "development",
        "begin",
        "presumption",
        "scientific",
        "artistic",
        "progress",
        "requires",
        "background",
        "political",
        "security",
        "claim",
        "argues",
        "art",
        "science",
        "arise",
        "society",
        "without",
        "rule",
        "law",
        "hume",
        "also",
        "asserts",
        "monarchy",
        "develop",
        "rule",
        "law",
        "republic",
        "must",
        "develop",
        "rule",
        "law",
        "survive",
        "concludes",
        "art",
        "science",
        "first",
        "emerge",
        "republic",
        "monarchy",
        "although",
        "art",
        "science",
        "rise",
        "republic",
        "may",
        "transplanted",
        "civilized",
        "monarchy",
        "continue",
        "improve",
        "environment",
        "civilized",
        "monarchy",
        "learned",
        "rule",
        "law",
        "neighboring",
        "republic",
        "hume",
        "even",
        "say",
        "art",
        "progress",
        "quickly",
        "civilized",
        "monarchy",
        "republic",
        "useful",
        "flattering",
        "monarch",
        "hand",
        "according",
        "hume",
        "general",
        "population",
        "impressed",
        "scientific",
        "discovery",
        "obvious",
        "technological",
        "application",
        "artistic",
        "creation",
        "therefore",
        "science",
        "progress",
        "quickly",
        "republic",
        "general",
        "public",
        "hold",
        "power",
        "monarchy",
        "hume",
        "think",
        "country",
        "affect",
        "s",
        "progress",
        "instance",
        "competition",
        "spur",
        "greater",
        "progress",
        "isolation",
        "cause",
        "country",
        "stall",
        "hand",
        "country",
        "intimidate",
        "inactivity",
        "hume",
        "also",
        "asserts",
        "art",
        "science",
        "progress",
        "indefinitely",
        "single",
        "country",
        "reach",
        "certain",
        "height",
        "member",
        "next",
        "generation",
        "intimidated",
        "predecessor",
        "strike",
        "second",
        "scottish",
        "enlightenment",
        "figure",
        "adam",
        "smith",
        "often",
        "regarded",
        "economist",
        "fact",
        "began",
        "career",
        "philosopher",
        "first",
        "work",
        "theory",
        "moral",
        "sentiment",
        "addressed",
        "philosophy",
        "moral",
        "judgment",
        "action",
        "therefore",
        "surprising",
        "wealth",
        "nation",
        "work",
        "economic",
        "growth",
        "best",
        "known",
        "deeper",
        "philosophical",
        "resonance",
        "smith",
        "s",
        "central",
        "observation",
        "economic",
        "life",
        "often",
        "happens",
        "individual",
        "pursuit",
        "selfinterest",
        "nevertheless",
        "contribute",
        "common",
        "good",
        "though",
        "led",
        "invisible",
        "hand",
        "take",
        "socially",
        "beneficial",
        "action",
        "instance",
        "smith",
        "argues",
        "division",
        "labor",
        "spontaneous",
        "outcome",
        "human",
        "propensity",
        "truck",
        "barter",
        "exchange",
        "one",
        "thing",
        "another",
        "human",
        "engage",
        "activity",
        "selfinterested",
        "reason",
        "growth",
        "productivity",
        "labor",
        "society",
        "largely",
        "due",
        "greater",
        "division",
        "labor",
        "greater",
        "division",
        "labor",
        "smith",
        "contends",
        "poorest",
        "member",
        "european",
        "country",
        "richer",
        "richest",
        "member",
        "society",
        "part",
        "world",
        "failure",
        "see",
        "work",
        "invisible",
        "hand",
        "lead",
        "unwise",
        "policy",
        "smith",
        "say",
        "absence",
        "government",
        "intervention",
        "selfinterest",
        "lead",
        "nation",
        "produce",
        "good",
        "comparative",
        "advantage",
        "selfinterested",
        "behavior",
        "presence",
        "government",
        "attempt",
        "support",
        "domestic",
        "industry",
        "actually",
        "result",
        "worse",
        "outcome",
        "one",
        "goal",
        "book",
        "admittedly",
        "practical",
        "attack",
        "mercantilism",
        "doctrine",
        "dominated",
        "economic",
        "policy",
        "europe",
        "th",
        "century",
        "onward",
        "mercantilism",
        "hold",
        "aggressive",
        "government",
        "intervention",
        "key",
        "increasing",
        "national",
        "wealth",
        "accordingly",
        "time",
        "government",
        "europe",
        "attempted",
        "steer",
        "promote",
        "domestic",
        "industry",
        "notably",
        "placing",
        "high",
        "tariff",
        "foreign",
        "import",
        "palmer",
        "smith",
        "argues",
        "policy",
        "writes",
        "tariff",
        "import",
        "harm",
        "nation",
        "whole",
        "misdirecting",
        "resource",
        "general",
        "say",
        "government",
        "play",
        "circumscribed",
        "role",
        "economic",
        "life",
        "country",
        "confining",
        "protection",
        "property",
        "right",
        "support",
        "national",
        "defense",
        "force",
        "provision",
        "key",
        "public",
        "good",
        "smith",
        "s",
        "emphasis",
        "spontaneous",
        "improvement",
        "economic",
        "life",
        "warrant",
        "treating",
        "theorist",
        "progress",
        "given",
        "worry",
        "mercantilism",
        "clear",
        "think",
        "type",
        "development",
        "fragile",
        "nation",
        "maximize",
        "wealth",
        "unless",
        "wisdom",
        "allow",
        "spontaneous",
        "growth",
        "occur",
        "smith",
        "intends",
        "wealth",
        "nation",
        "help",
        "policy",
        "maker",
        "recognize",
        "phenomenon",
        "belief",
        "correctly",
        "identified",
        "thinker",
        "scottish",
        "french",
        "enlightenment",
        "author",
        "empiricist",
        "unlike",
        "german",
        "enlightenment",
        "figure",
        "immanuel",
        "kant",
        "reason",
        "priori",
        "manner",
        "conclusion",
        "humanity",
        "progressing",
        "kant",
        "s",
        "writing",
        "progress",
        "consist",
        "series",
        "short",
        "piece",
        "s",
        "including",
        "idea",
        "toward",
        "universal",
        "history",
        "cosmopolitan",
        "intent",
        "perpetual",
        "peace",
        "addition",
        "reliance",
        "priori",
        "reasoning",
        "kant",
        "s",
        "work",
        "noteworthy",
        "emphasis",
        "world",
        "peace",
        "detailed",
        "description",
        "domestic",
        "international",
        "institution",
        "needed",
        "peaceful",
        "condition",
        "kant",
        "remark",
        "certain",
        "trend",
        "compatible",
        "progress",
        "caution",
        "trajectory",
        "inferred",
        "certainty",
        "fact",
        "priori",
        "argument",
        "begin",
        "premise",
        "animal",
        "natural",
        "faculty",
        "nature",
        "vain",
        "must",
        "assume",
        "faculty",
        "animal",
        "developed",
        "unlike",
        "animal",
        "human",
        "develop",
        "faculty",
        "lifetime",
        "faculty",
        "given",
        "human",
        "considered",
        "useless",
        "possibility",
        "human",
        "race",
        "whole",
        "time",
        "develop",
        "human",
        "faculty",
        "progress",
        "one",
        "era",
        "another",
        "measured",
        "development",
        "human",
        "faculty",
        "time",
        "kant",
        "think",
        "human",
        "faculty",
        "reach",
        "fullest",
        "expression",
        "free",
        "peaceful",
        "circumstance",
        "turn",
        "require",
        "particular",
        "set",
        "institution",
        "federation",
        "republic",
        "mark",
        "final",
        "stage",
        "human",
        "development",
        "republic",
        "state",
        "based",
        "rule",
        "law",
        "whose",
        "member",
        "free",
        "equal",
        "citizen",
        "federation",
        "group",
        "nation",
        "agreed",
        "observe",
        "rule",
        "peaceful",
        "conduct",
        "mutual",
        "relation",
        "ff",
        "kant",
        "argues",
        "domestic",
        "international",
        "feature",
        "institutional",
        "constellation",
        "reinforce",
        "republic",
        "go",
        "war",
        "declaration",
        "war",
        "requires",
        "consent",
        "public",
        "reluctant",
        "pay",
        "war",
        "s",
        "price",
        "turn",
        "domestic",
        "condition",
        "improved",
        "absence",
        "state",
        "s",
        "constant",
        "involvement",
        "war",
        "detail",
        "development",
        "toward",
        "peaceful",
        "federation",
        "given",
        "kant",
        "s",
        "universal",
        "history",
        "narrative",
        "presented",
        "best",
        "consistent",
        "empirical",
        "evidence",
        "kant",
        "argues",
        "part",
        "human",
        "psychology",
        "natural",
        "environment",
        "rather",
        "human",
        "reason",
        "could",
        "driven",
        "human",
        "race",
        "forward",
        "first",
        "attribute",
        "progress",
        "unsocial",
        "sociability",
        "human",
        "being",
        "human",
        "social",
        "develop",
        "capability",
        "isolation",
        "yet",
        "unsocial",
        "always",
        "want",
        "get",
        "way",
        "characteristic",
        "lead",
        "form",
        "association",
        "vie",
        "status",
        "association",
        "seed",
        "republic",
        "progressive",
        "human",
        "activity",
        "need",
        "lacking",
        "awareness",
        "kant",
        "maintains",
        "philosophy",
        "progress",
        "accelerate",
        "progress"
    ]
}