{
    "main_text": "Promises and Other Fields || Promises and Consequentialism\n6.3 Promises and Consequentialism\n\nConsequentialism has always had a fraught relationship with promises\nand promissory obligation. It has been a traditional challenge to\nconsequentialist views, particularly earlier, act-based forms, to\nexplain promissory obligations, as they aren’t necessarily\n“felicific”, or productive of the most good. Of course,\nnot all consequentialist views are of this sort.\n\nConsequentialist theories of promissory obligation fall into two broad\ncamps: Act utilitarians are expectationalists—generally explain\npromissory obligations as arising from the negative consequences of\nbreaking the promise. Rule utilitarians are conventionalists, and\ndefend promissory obligations on the grounds that the rule of\npromise-keeping is productive of the best consequences.\n6.3.1 Act Utilitarianism\n\nAct utilitarians evaluate individual actions in light of the net\nutility produced by that action as compared to alternative actions.\nThe right action is that which promotes the maximum net utility. On\nthe face of it, this entirely general and comprehensive maxim leaves\nno room for considerations of prior promise. The fact that an agent\npromised someone something has no direct relevance to an act\nconsequentialist appraisal of that agent’s action at the time\nthe promise is meant to be kept. If breaking the promise would promote\nmore utility than keeping it, then the theory seems to mandate\nbreaking the promise.\n\nThis counter-intuitive result has been offered as a criticism of act\nutilitarianism since its inception. That act utilitarians have\ndifficulty in accounting for the force of promises is a touchstone for\ncritics (see Prichard 1949; Ross 1930; Hodgson 1967).\n\nBut act utilitarians do have some resources to accommodate our moral\nintuitions about promises, and the sort of theory they employ is held\nby more than just utilitarians .The act utilitarian explanation for\npromissory obligations is that these obligations arise from the\nnegative consequences that attend the breaking of promises, where\nthese negative consequences are, at least in part, created by the\neffects of the promise on the promisee, specifically, the creation in\nthe promisee of the expectation that the promisor will keep her\npromise. A sample list of utilitarianism that have either offered or\ndefended such a view: Bentham (A Comment on the Commentaries,\n1-1-6), Sidgwick (The Methods of Ethics, 1874 [1962:\n3–6]), Narveson (1967, 1971), Singer (1972), and Árdal\n(1968, 1976).\n\nIn support of this picture utilitarians argue that promises are the\nsorts of things which are generally made because the promisee wants\nthe thing promised, and so wants to be assured of getting it. Since a\npromise is designed to secure his trust, and that trust is then likely\nto be the source of much pain if it’s disappointed, it’s\nreasonable to assume that in most cases keeping one’s promise\nwill be productive of better consequences than breaking them, given\nthe expectations of the promisee. And there are other potential\nnegative consequences of breaking a promise (e.g., the loss of trust\nby one’s familiars, the general erosion of trust in the practice\nof promises) that utilitarians can add to the negative side of the\nledger. For an astute philosophical survey of Act Utilitarian\napproaches to promising see Atiyah (1981: 30–79), also Robins\n(1984: 140–143) and Vitek (1993: 61–70).\n\nAs mentioned above, the standard critique of the act utilitarian\ntheory of promissory obligations is that it doesn’t accord with\nour intuitive judgment that at least some promises that don’t\nproduce the maximum utility still ought to be kept. In claiming that\nutilitarianism has unacceptably counter-intuitive results in certain\ncases, this argument it is of a piece with most arguments against the\nview. One sort of counter-intuitive case that has received some\nattention is the so-called “Desert Island” case, where a\npromise is made in isolation (on a desert island) to someone who then\ndies. The question is whether there is any obligation to keep the\npromise, given that the promisee can’t have any expectations of\nits fulfillment (being dead) and that no-one else can know of the\npromise (see Nowell-Smith 1956; Narveson 1963: 210; Cargile 1964;\nNarveson 1967: 196–7). See the section on\n Problematic Promisees and the Uptake Condition (§5.1]\n above for more information.\n\nA more sophisticated problem outlined by Hodgson (1967: 38) and others\nis that a promising convention is broadly speaking incompatible with\nan act utilitarian society. This is so because such a convention\ncouldn’t get established (or couldn’t be sustained) if\npeople were aware that everyone was a consistent utility maximizer of\nthe act utilitarian sort. If this were the case people would put no\nstock in promises, knowing that when the time came to keep the\npromise, the promisor would simply apply the utilitarian calculus,\nwithout regard to the fact that he had previously\n“promised”, as this is what being an act utilitarian\nmeans.\n\nNote that the utilitarian cannot reply that we have failed to take\ninto account the expectations of the promisee in our case, because the\nclaim is that the promisee has no reason to generate any special\nexpectations that the promisor will do what she promises, precisely\nbecause he knows the promisor to be an act utilitarian, and\nconsequently knows that she will do what the utility calculus tells\nher is best, without thought of her promise. Of course, the promisee\nis free to generate some expectations that the promisor will keep her\npromise on the assumption that her promise is indicative of her at\nleast having the (present) intention to perform the promised act. But,\nas Raz (1972), Kolodny and Wallace (2003) and others point out, the\nadvising of the promisee of one’s mere intention to do the\npromised act is insufficient ground for the sorts of expectations that\nare meant to attend promises.\n\nMore recently there have been some efforts to rehabilitate act\nutilitarianism with regards to promissory obligations. Some theorists,\nlike Michael Smith (1994, 2011), propose that sophisticating the\ntheory with the addition of other values might allow it to accommodate\n“agent-relative” values like promise keeping (M. Smith\n2011: 208–215).\n\nOthers, like Alastair Norcross, offer a negative defense, arguing that\nthe sorts of counter-examples generally adduced to demonstrate the\nproblem don’t survive scrutiny (Norcross 2011). Norcross also\nproposes an indirect form of consequentialism, one where the decision\nprocedure consciously adopted by agents isn’t the same as theory\nitself. This sort of approach is outlined by Peter Railton (1984).\n6.3.2 Rule Utilitarianism\n\nThe sorts of difficulties that promises pose for act utilitarian\ntheories discussed above are at least in part the motivation for rule\nutilitarianism (see Rawls 1955 and Brandt 1979: 286–305). Rule\nutilitarians change the context of moral evaluation from individual\nacts to rules governing actions. The principle of utility is applied\nto rules and practices, rather than individual acts, and the best rule\nor practice is that produces the best over-all consequences. Some\nnotable rule utilitarians are Urmson (1953), Brandt (1959, 1979), and\nHooker (2000, 2011).\n\nOf special note here is Rawls’ 1955 paper we discussed above in\nthe context of conventionalism, “Two Concepts of Rules”,\nwhich advanced a rule-utilitarian defense of promissory obligations\nand helped to focus the debate on promising By changing the focus from\nact to rule, rule utilitarians are better able to explain our moral\nintuitions regarding individual cases of promise-keeping. But in\nparticular, rule utilitarians claim that their theory can make sense\nof the origin and maintenance of the practice of promising itself.\nUnlike an act utilitarian society, promising and trusting in promises\nmakes sense in a rule utilitarian society, because promisees can rest\nassured that promisors won’t do the local utility calculation to\ndetermine whether or not to keep their promises, but rather will obey\nthe rule of promising.\n\nOne problem for the rule utilitarian theory of promissory obligations\nis that it seems that utilitarian society couldn’t establish a\npractice of promising, because prior to the establishment of the rule,\npeople could have no expectations that promises would be kept. As\nsuch, those receiving the first promises would not be able to form the\nexpectations necessary to make the rule actually productive of the\nbest consequences. This is so because the consequential value of the\nrule of promise keeping depends on the expectations of promisees. Such\nexpectations are the grounds of trust, and trust is how promising\ngenerates its benefits (see Robins 1984: 142–3). In response,\nBrandt argues for what he calls ideal rule utilitarianism,\nwhich makes the frame of reference for rule consideration not the\nactual rules available, but the ideal rule, i.e., the rule that would\nbe optimific (productive of the best possible consequences), were it\nemployed. There is substantial criticism of this move (see Diggs\n1970). Again, an excellent (although now dated) survey of the\nrule-utilitarian approach to promising is found in Atiyah (1981:\n79–86).\n\nSince the turn of the century Brad Hooker has offered newer versions\nof Brandt-style rule-utilitarianism (he calls it\nrule-consequentialism) (2000, 2011) with an eye towards solving these\nsorts of problems. This work has in turn spawned another chapter in\nthis literature (see Eggleston 2007; Arneson 2005; Wall 2009; Cureton\n2015).\n\nAnd work continues on these issues, see Sinnott-Armstrong (2009), Gill\n(2012), Melenovsky (2017). For an excellent contemporary survey of\nthis issue, see Alida Liberman’s “Consequentialism and\nPromises” in the Oxford Handbook of Consequentialism\n(2020).",
    "section_title": "6.3 Promises and Consequentialism",
    "entry_title": "Promises",
    "hierarchy_title": "Promises || Promises and Other Fields || Promises and Consequentialism",
    "tokenized_text": [
        "promise",
        "field",
        "promise",
        "consequentialism",
        "promise",
        "consequentialism",
        "consequentialism",
        "always",
        "fraught",
        "relationship",
        "promise",
        "promissory",
        "obligation",
        "traditional",
        "challenge",
        "consequentialist",
        "view",
        "particularly",
        "earlier",
        "actbased",
        "form",
        "explain",
        "promissory",
        "obligation",
        "necessarily",
        "felicific",
        "productive",
        "good",
        "course",
        "consequentialist",
        "view",
        "sort",
        "consequentialist",
        "theory",
        "promissory",
        "obligation",
        "fall",
        "two",
        "broad",
        "camp",
        "act",
        "utilitarian",
        "expectationalistsgenerally",
        "explain",
        "promissory",
        "obligation",
        "arising",
        "negative",
        "consequence",
        "breaking",
        "promise",
        "rule",
        "utilitarian",
        "conventionalists",
        "defend",
        "promissory",
        "obligation",
        "ground",
        "rule",
        "promisekeeping",
        "productive",
        "best",
        "consequence",
        "act",
        "utilitarianism",
        "act",
        "utilitarian",
        "evaluate",
        "individual",
        "action",
        "light",
        "net",
        "utility",
        "produced",
        "action",
        "compared",
        "alternative",
        "action",
        "right",
        "action",
        "promotes",
        "maximum",
        "net",
        "utility",
        "face",
        "entirely",
        "general",
        "comprehensive",
        "maxim",
        "leaf",
        "room",
        "consideration",
        "prior",
        "promise",
        "fact",
        "agent",
        "promised",
        "someone",
        "something",
        "direct",
        "relevance",
        "act",
        "consequentialist",
        "appraisal",
        "agent",
        "action",
        "time",
        "promise",
        "meant",
        "kept",
        "breaking",
        "promise",
        "would",
        "promote",
        "utility",
        "keeping",
        "theory",
        "seems",
        "mandate",
        "breaking",
        "promise",
        "counterintuitive",
        "result",
        "offered",
        "criticism",
        "act",
        "utilitarianism",
        "since",
        "inception",
        "act",
        "utilitarian",
        "difficulty",
        "accounting",
        "force",
        "promise",
        "touchstone",
        "critic",
        "see",
        "prichard",
        "ross",
        "hodgson",
        "act",
        "utilitarian",
        "resource",
        "accommodate",
        "moral",
        "intuition",
        "promise",
        "sort",
        "theory",
        "employ",
        "held",
        "utilitarian",
        "the",
        "act",
        "utilitarian",
        "explanation",
        "promissory",
        "obligation",
        "obligation",
        "arise",
        "negative",
        "consequence",
        "attend",
        "breaking",
        "promise",
        "negative",
        "consequence",
        "least",
        "part",
        "created",
        "effect",
        "promise",
        "promisee",
        "specifically",
        "creation",
        "promisee",
        "expectation",
        "promisor",
        "keep",
        "promise",
        "sample",
        "list",
        "utilitarianism",
        "either",
        "offered",
        "defended",
        "view",
        "bentham",
        "comment",
        "commentary",
        "sidgwick",
        "method",
        "ethic",
        "narveson",
        "singer",
        "árdal",
        "support",
        "picture",
        "utilitarian",
        "argue",
        "promise",
        "sort",
        "thing",
        "generally",
        "made",
        "promisee",
        "want",
        "thing",
        "promised",
        "want",
        "assured",
        "getting",
        "since",
        "promise",
        "designed",
        "secure",
        "trust",
        "trust",
        "likely",
        "source",
        "much",
        "pain",
        "disappointed",
        "reasonable",
        "assume",
        "case",
        "keeping",
        "one",
        "promise",
        "productive",
        "better",
        "consequence",
        "breaking",
        "given",
        "expectation",
        "promisee",
        "potential",
        "negative",
        "consequence",
        "breaking",
        "promise",
        "eg",
        "loss",
        "trust",
        "one",
        "familiar",
        "general",
        "erosion",
        "trust",
        "practice",
        "promise",
        "utilitarian",
        "add",
        "negative",
        "side",
        "ledger",
        "astute",
        "philosophical",
        "survey",
        "act",
        "utilitarian",
        "approach",
        "promising",
        "see",
        "atiyah",
        "also",
        "robin",
        "vitek",
        "mentioned",
        "standard",
        "critique",
        "act",
        "utilitarian",
        "theory",
        "promissory",
        "obligation",
        "accord",
        "intuitive",
        "judgment",
        "least",
        "promise",
        "produce",
        "maximum",
        "utility",
        "still",
        "ought",
        "kept",
        "claiming",
        "utilitarianism",
        "unacceptably",
        "counterintuitive",
        "result",
        "certain",
        "case",
        "argument",
        "piece",
        "argument",
        "view",
        "one",
        "sort",
        "counterintuitive",
        "case",
        "received",
        "attention",
        "socalled",
        "desert",
        "island",
        "case",
        "promise",
        "made",
        "isolation",
        "desert",
        "island",
        "someone",
        "dy",
        "question",
        "whether",
        "obligation",
        "keep",
        "promise",
        "given",
        "promisee",
        "expectation",
        "fulfillment",
        "dead",
        "noone",
        "else",
        "know",
        "promise",
        "see",
        "nowellsmith",
        "narveson",
        "cargile",
        "narveson",
        "see",
        "section",
        "problematic",
        "promisee",
        "uptake",
        "condition",
        "information",
        "sophisticated",
        "problem",
        "outlined",
        "hodgson",
        "others",
        "promising",
        "convention",
        "broadly",
        "speaking",
        "incompatible",
        "act",
        "utilitarian",
        "society",
        "convention",
        "get",
        "established",
        "sustained",
        "people",
        "aware",
        "everyone",
        "consistent",
        "utility",
        "maximizer",
        "act",
        "utilitarian",
        "sort",
        "case",
        "people",
        "would",
        "put",
        "stock",
        "promise",
        "knowing",
        "time",
        "came",
        "keep",
        "promise",
        "promisor",
        "would",
        "simply",
        "apply",
        "utilitarian",
        "calculus",
        "without",
        "regard",
        "fact",
        "previously",
        "promised",
        "act",
        "utilitarian",
        "mean",
        "note",
        "utilitarian",
        "reply",
        "failed",
        "take",
        "account",
        "expectation",
        "promisee",
        "case",
        "claim",
        "promisee",
        "reason",
        "generate",
        "special",
        "expectation",
        "promisor",
        "promise",
        "precisely",
        "know",
        "promisor",
        "act",
        "utilitarian",
        "consequently",
        "know",
        "utility",
        "calculus",
        "tell",
        "best",
        "without",
        "thought",
        "promise",
        "course",
        "promisee",
        "free",
        "generate",
        "expectation",
        "promisor",
        "keep",
        "promise",
        "assumption",
        "promise",
        "indicative",
        "least",
        "present",
        "intention",
        "perform",
        "promised",
        "act",
        "raz",
        "kolodny",
        "wallace",
        "others",
        "point",
        "advising",
        "promisee",
        "one",
        "mere",
        "intention",
        "promised",
        "act",
        "insufficient",
        "ground",
        "sort",
        "expectation",
        "meant",
        "attend",
        "promise",
        "recently",
        "effort",
        "rehabilitate",
        "act",
        "utilitarianism",
        "regard",
        "promissory",
        "obligation",
        "theorist",
        "like",
        "michael",
        "smith",
        "propose",
        "sophisticating",
        "theory",
        "addition",
        "value",
        "might",
        "allow",
        "accommodate",
        "agentrelative",
        "value",
        "like",
        "promise",
        "keeping",
        "m",
        "smith",
        "others",
        "like",
        "alastair",
        "norcross",
        "offer",
        "negative",
        "defense",
        "arguing",
        "sort",
        "counterexamples",
        "generally",
        "adduced",
        "demonstrate",
        "problem",
        "survive",
        "scrutiny",
        "norcross",
        "norcross",
        "also",
        "proposes",
        "indirect",
        "form",
        "consequentialism",
        "one",
        "decision",
        "procedure",
        "consciously",
        "adopted",
        "agent",
        "theory",
        "sort",
        "approach",
        "outlined",
        "peter",
        "railton",
        "rule",
        "utilitarianism",
        "sort",
        "difficulty",
        "promise",
        "pose",
        "act",
        "utilitarian",
        "theory",
        "discussed",
        "least",
        "part",
        "motivation",
        "rule",
        "utilitarianism",
        "see",
        "rawls",
        "brandt",
        "rule",
        "utilitarian",
        "change",
        "context",
        "moral",
        "evaluation",
        "individual",
        "act",
        "rule",
        "governing",
        "action",
        "principle",
        "utility",
        "applied",
        "rule",
        "practice",
        "rather",
        "individual",
        "act",
        "best",
        "rule",
        "practice",
        "produce",
        "best",
        "overall",
        "consequence",
        "notable",
        "rule",
        "utilitarian",
        "urmson",
        "brandt",
        "hooker",
        "special",
        "note",
        "rawls",
        "paper",
        "discussed",
        "context",
        "conventionalism",
        "two",
        "concept",
        "rule",
        "advanced",
        "ruleutilitarian",
        "defense",
        "promissory",
        "obligation",
        "helped",
        "focus",
        "debate",
        "promising",
        "changing",
        "focus",
        "act",
        "rule",
        "rule",
        "utilitarian",
        "better",
        "able",
        "explain",
        "moral",
        "intuition",
        "regarding",
        "individual",
        "case",
        "promisekeeping",
        "particular",
        "rule",
        "utilitarian",
        "claim",
        "theory",
        "make",
        "sense",
        "origin",
        "maintenance",
        "practice",
        "promising",
        "unlike",
        "act",
        "utilitarian",
        "society",
        "promising",
        "trusting",
        "promise",
        "make",
        "sense",
        "rule",
        "utilitarian",
        "society",
        "promisee",
        "rest",
        "assured",
        "promisor",
        "local",
        "utility",
        "calculation",
        "determine",
        "whether",
        "keep",
        "promise",
        "rather",
        "obey",
        "rule",
        "promising",
        "one",
        "problem",
        "rule",
        "utilitarian",
        "theory",
        "promissory",
        "obligation",
        "seems",
        "utilitarian",
        "society",
        "establish",
        "practice",
        "promising",
        "prior",
        "establishment",
        "rule",
        "people",
        "could",
        "expectation",
        "promise",
        "would",
        "kept",
        "receiving",
        "first",
        "promise",
        "would",
        "able",
        "form",
        "expectation",
        "necessary",
        "make",
        "rule",
        "actually",
        "productive",
        "best",
        "consequence",
        "consequential",
        "value",
        "rule",
        "promise",
        "keeping",
        "depends",
        "expectation",
        "promisee",
        "expectation",
        "ground",
        "trust",
        "trust",
        "promising",
        "generates",
        "benefit",
        "see",
        "robin",
        "response",
        "brandt",
        "argues",
        "call",
        "ideal",
        "rule",
        "utilitarianism",
        "make",
        "frame",
        "reference",
        "rule",
        "consideration",
        "actual",
        "rule",
        "available",
        "ideal",
        "rule",
        "ie",
        "rule",
        "would",
        "optimific",
        "productive",
        "best",
        "possible",
        "consequence",
        "employed",
        "substantial",
        "criticism",
        "move",
        "see",
        "diggs",
        "excellent",
        "although",
        "dated",
        "survey",
        "ruleutilitarian",
        "approach",
        "promising",
        "found",
        "atiyah",
        "since",
        "turn",
        "century",
        "brad",
        "hooker",
        "offered",
        "newer",
        "version",
        "brandtstyle",
        "ruleutilitarianism",
        "call",
        "ruleconsequentialism",
        "eye",
        "towards",
        "solving",
        "sort",
        "problem",
        "work",
        "turn",
        "spawned",
        "another",
        "chapter",
        "literature",
        "see",
        "eggleston",
        "arneson",
        "wall",
        "cureton",
        "work",
        "continues",
        "issue",
        "see",
        "sinnottarmstrong",
        "gill",
        "melenovsky",
        "excellent",
        "contemporary",
        "survey",
        "issue",
        "see",
        "alida",
        "liberman",
        "consequentialism",
        "promise",
        "oxford",
        "handbook",
        "consequentialism"
    ]
}