{
    "main_text": "The consistency of arithmetic and analysis\n5. The consistency of arithmetic and analysis\n\n\nAfter his thesis work on ND and SC for pure logic, Gentzen continued\nhis plan of proving the consistency of arithmetic. The result was\nready by December 1934. What this very first proof was, is not known\nin detail. However, a letter to Bernays from 1938 indicates that the\nproof that Gentzen wrote down by the summer of 1935 was not this\noriginal one, but a second proof (see Menzler-Trott 2001, 79). This\nsecond proof was criticized by Bernays and Gödel who discussed it\nduring their Atlantic voyage to Princeton in September 1935. Gentzen's\nidea in the proof was as follows: first, take the\nconjunction-negation-universal quantification fragment of natural\ndeduction as the logic used in the formalization of arithmetic. Then\nwrite each rule instance so that the premisses and conclusion have the\nopen assumptions listed at left, with an arrow separating the\nconclusion, so, as sequents. This variant of ND is now called ND in SC\nstyle. Consider a sequent\nΓ → C. If its \nconclusion is an atomic formula, it is an equation between numbers. \nIn the worst case it is false, so then consider the list of \nassumptions. If one assumption is a conjunction, replace it by a \nconjunct of your choice, if a universal quantification, by an \ninstance. If it is a negation ¬A, replace the conclusion\nby A. If at any stage of this “reduction \nprocess” the conclusion of a sequent is a compound formula, you\nhave to consider any conjunct or any instance of universal \nquantification as a possible conclusion. In case of negation \n¬A as a conclusion, move A to the assumption \npart and replace the conclusion by 0 = 1. \nGentzen shows that by \nproceeding in this way under the assumption that the sequent in \nquestion is derivable, either a true equation is found as a \nconclusion, or a false equation as an assumption. Thus, there are no \nderivable sequents with all assumptions true and the conclusion \nfalse.\n\n\nIt was unclear to Gödel and Bernays what the proof assumed; they\nthought it assumed what is known in intuitionistic mathematics as the\nfan theorem, but this was false. Termination of Gentzen's reduction\nprocedure can be proved instead by induction on well-founded trees\n(“bar-induction”), a principle that was used by Gentzen on\nintuitive grounds. Anyway, the result of the criticism was that\nGentzen changed without further ado the proof into a third proof that\nuses the now famous principle of transfinite induction up to the first\nepsilon-number. This induction was presented through a coding that\nused decimal numbers. The concrete result of the changes for Gentzen's\npaper published in 1936 was not good, however: the logical calculus\nwas changed midway in an article of seventy-odd pages that became very\ndifficult to read. Therefore Gentzen gave yet another, by the present\ncount fourth proof of the consistency of arithmetic in 1938 (at the\nBernays archives of the ETH Zurich), this time based on the classical\nsequent calculus LK of 1933.  As mentioned, correspondence with\nBernays indicates that he thereby returned to the proof method that\nhad led to success in 1934. The use of transfinite induction is made\nclearly visible in the 1938 paper through an ordinal notation. Such\ninduction principles on Cantor's “second number class” are\ndiscussed in detail in Hilbert's 1925 lecture “Über das\nUnendliche” (“On the infinite”, published\n1926), a paper to which Gentzen referred.\n\n\nOne would have thought that that was that, but Gentzen had reason to \nproduce even a fourth proof of the consistency of arithmetic, in his \nlast paper published in 1943 but written before the war in 1939. He \nextended Peano arithmetic through transfinite ordinals and made the \ntransfinite induction principle part of this extended calculus. Then \nhe showed directly that transfinite induction up to the first \nepsilon-number ε0 is expressible but not provable \nin the system. Gödel's incompleteness theorem is thus proved in \na completely different way. The idea of the proof is, in brief terms,\nas follows: first it is laid down what it means to derive transfinite\ninduction to a specific ordinal number in the system. Secondly, \nordinal numbers below ε0 are associated to \nderivations. These are called “values”. It is then shown \nthat if transfinite induction to an ordinal number is derivable, this\nordinal number cannot be greater than the value of the derivation. \nTherefore transfinite induction to ε0 is not \nderivable.\n\n\nSince the induction principle can be expressed but not proved in \nordinary arithmetic, a formula unprovable in Peano arithmetic is \nfound. An easy consequence of Gentzen's version of the incompleteness\ntheorem is the consistency of Peano arithmetic, because anything \nwould be provable in an inconsistent system. Contrary to Gödel's\n“artificial” unprovable formula that was obtained through\na coding of the arithmetized provability predicate, Gentzen's \ntransfinite induction principle is a principle of \n“ordinary” mathematics.\n\n\nGentzen's last proof determined the “proof-theoretic \nordinal” of Peano arithmetic, namely the one that is needed to \nprove consistency, with the property that nothing less would suffice.\nThe work marked the beginning of ordinal proof theory. It was without\ndoubt the most remarkable foundational achievement in arithmetic \nafter Gödel's incompleteness theorems, but is still largely \nunknown—one can find many books about Gödel's theorems \nthat do not even mention Gentzen.\n\n\nGödel had, it seems, not thought of giving a consistency proof \nof arithmetic through the use of non-finitary but still constructive \nprinciples. In the late thirties, at least from 1938 on, he developed\nas a response to Gentzen's proof his own special interpretation of \nintuitionistic logic and arithmetic, what came to be known as the \nDialectica interpretation. It uses computable functionals to \ninterpret the proofs of intuitionistic arithmetic. Gödel \npublished the interpretation only in 1958, even though he had \npresented it in lectures in 1941. It is unknown if he discussed the \nmatter when he met Gentzen in December 1939.\n\n\nAt the request of Bernays, Ackermann reproduced Gentzen's proof in \nterms of Hilbert's \n epsilon-calculus\n in 1940. Ackermann's paper was the starting point of Kreisel's 1951 \n“no-counterexample” interpretation of arithmetic. It was \na surprise when the publication of Gödel's collected papers \nbrought to light his “Zilsel-lecture” in Vienna in 1938: \nhe outlines there this interpretation as a reformulation of Gentzen's\n1935 proof. (The matter is discussed in great detail in Tait (2005) \nwho himself had worked on the no-counterexample interpretation and \nits extension to analysis in the 1960s.)\n\n\nThe next obvious task in proof theory, after the proof of the \nconsistency of arithmetic, was to prove the consistency of analysis, \ni.e., of the theory of real numbers. Gentzen did some work in this \ndirection, but was then assigned to military service in the fall of \n1939. (He observed and reported the type, number, and direction of \naircraft that flew above the town of Brunswick, until he was hit by a\nnervous breakdown in early 1942.) From 1943 on he resumed the work on\nanalysis, but the difficulties intrinsic to the topic were great, as \nwere the practical difficulties of life caused by the war. Analysis \nwas to be formulated as a system of second-order arithmetic, which \nmeans that quantification is extended over number-theoretic \npredicates or, equivalently, over sets of natural numbers. \nSecond-order number theory is used in Gentzen's last paper, published\nin 1943, in which it is briefly shown that the principle of \ntransfinite induction up to ε0 is derivable in \nsecond-order number theory. \n\n\nMore than half a century has passed with no constructive proof of the\nconsistency of full second-order arithmetic in sight. Early pioneers \nin this field included Kurt Schütte and Gaisi Takeuti. The \nformer created in 1951 an infinitary sequent calculus to present \nconsistency proofs in a perspicuous way, the latter instead used a \nmore traditional Gentzen-style calculus (see Takeuti 1987).\n\n\nIn the current research in the proof theory of second-order \narithmetic, one studies what are known as subsystems of second-order \narithmetic. The strongest results as of today are, in a very brief \noutline, the following: let X range over number-theoretic \npredicates. A formula such as X(x) states that x \nhas the property expressed by X. We can now use first- and \n second-order logic\n to form compound formulas such as \n∀X(Xx ∨ ¬ \nXx). The collection of natural numbers for which \nsuch a formula with one universal second-order quantifier holds is \ncalled a \nΠ11-set \n(in this case, the whole of\nthe natural numbers). More generally, a comprehension axiom is of the\nform \n∃X∀x(Xx \n↔ B(x)). If the formula B has no \nsecond-order quantifiers, the axiom gives what is called arithmetic \ncomprehension or ACA. If B can have the form \n∀Y∃Z C(x) with no \nother second-order quantifiers, the special case of \nΠ12-comprehension \nis obtained. Consistency  proofs for a subsystem of second-order\n arithmetic with \nΠ12-comprehension \nhave been given by Toshiyasu Arai and Michael Rathjen in the\nmid-1990s.  (see Rathjen 1995 for these developments).\n",
    "section_title": "5. The consistency of arithmetic and analysis",
    "entry_title": "The Development of Proof Theory",
    "hierarchy_title": "The Development of Proof Theory || The consistency of arithmetic and analysis",
    "tokenized_text": [
        "consistency",
        "arithmetic",
        "analysis",
        "consistency",
        "arithmetic",
        "analysis",
        "thesis",
        "work",
        "nd",
        "sc",
        "pure",
        "logic",
        "gentzen",
        "continued",
        "plan",
        "proving",
        "consistency",
        "arithmetic",
        "result",
        "ready",
        "december",
        "first",
        "proof",
        "known",
        "detail",
        "however",
        "letter",
        "bernays",
        "indicates",
        "proof",
        "gentzen",
        "wrote",
        "summer",
        "original",
        "one",
        "second",
        "proof",
        "see",
        "menzlertrott",
        "second",
        "proof",
        "criticized",
        "bernays",
        "gödel",
        "discussed",
        "atlantic",
        "voyage",
        "princeton",
        "september",
        "gentzen",
        "s",
        "idea",
        "proof",
        "follows",
        "first",
        "take",
        "conjunctionnegationuniversal",
        "quantification",
        "fragment",
        "natural",
        "deduction",
        "logic",
        "used",
        "formalization",
        "arithmetic",
        "write",
        "rule",
        "instance",
        "premiss",
        "conclusion",
        "open",
        "assumption",
        "listed",
        "left",
        "arrow",
        "separating",
        "conclusion",
        "sequents",
        "variant",
        "nd",
        "called",
        "nd",
        "sc",
        "style",
        "consider",
        "sequent",
        "γ",
        "c",
        "conclusion",
        "atomic",
        "formula",
        "equation",
        "number",
        "worst",
        "case",
        "false",
        "consider",
        "list",
        "assumption",
        "one",
        "assumption",
        "conjunction",
        "replace",
        "conjunct",
        "choice",
        "universal",
        "quantification",
        "instance",
        "negation",
        "a",
        "replace",
        "conclusion",
        "a",
        "stage",
        "reduction",
        "process",
        "conclusion",
        "sequent",
        "compound",
        "formula",
        "consider",
        "conjunct",
        "instance",
        "universal",
        "quantification",
        "possible",
        "conclusion",
        "case",
        "negation",
        "a",
        "conclusion",
        "move",
        "assumption",
        "part",
        "replace",
        "conclusion",
        "gentzen",
        "show",
        "proceeding",
        "way",
        "assumption",
        "sequent",
        "question",
        "derivable",
        "either",
        "true",
        "equation",
        "found",
        "conclusion",
        "false",
        "equation",
        "assumption",
        "thus",
        "derivable",
        "sequents",
        "assumption",
        "true",
        "conclusion",
        "false",
        "unclear",
        "gödel",
        "bernays",
        "proof",
        "assumed",
        "thought",
        "assumed",
        "known",
        "intuitionistic",
        "mathematics",
        "fan",
        "theorem",
        "false",
        "termination",
        "gentzen",
        "s",
        "reduction",
        "procedure",
        "proved",
        "instead",
        "induction",
        "wellfounded",
        "tree",
        "barinduction",
        "principle",
        "used",
        "gentzen",
        "intuitive",
        "ground",
        "anyway",
        "result",
        "criticism",
        "gentzen",
        "changed",
        "without",
        "ado",
        "proof",
        "third",
        "proof",
        "us",
        "famous",
        "principle",
        "transfinite",
        "induction",
        "first",
        "epsilonnumber",
        "induction",
        "presented",
        "coding",
        "used",
        "decimal",
        "number",
        "concrete",
        "result",
        "change",
        "gentzen",
        "s",
        "paper",
        "published",
        "good",
        "however",
        "logical",
        "calculus",
        "changed",
        "midway",
        "article",
        "seventyodd",
        "page",
        "became",
        "difficult",
        "read",
        "therefore",
        "gentzen",
        "gave",
        "yet",
        "another",
        "present",
        "count",
        "fourth",
        "proof",
        "consistency",
        "arithmetic",
        "bernays",
        "archive",
        "eth",
        "zurich",
        "time",
        "based",
        "classical",
        "sequent",
        "calculus",
        "lk",
        "mentioned",
        "correspondence",
        "bernays",
        "indicates",
        "thereby",
        "returned",
        "proof",
        "method",
        "led",
        "success",
        "use",
        "transfinite",
        "induction",
        "made",
        "clearly",
        "visible",
        "paper",
        "ordinal",
        "notation",
        "induction",
        "principle",
        "cantor",
        "s",
        "second",
        "number",
        "class",
        "discussed",
        "detail",
        "hilbert",
        "s",
        "lecture",
        "über",
        "da",
        "unendliche",
        "infinite",
        "published",
        "paper",
        "gentzen",
        "referred",
        "one",
        "would",
        "thought",
        "gentzen",
        "reason",
        "produce",
        "even",
        "fourth",
        "proof",
        "consistency",
        "arithmetic",
        "last",
        "paper",
        "published",
        "written",
        "war",
        "extended",
        "peano",
        "arithmetic",
        "transfinite",
        "ordinal",
        "made",
        "transfinite",
        "induction",
        "principle",
        "part",
        "extended",
        "calculus",
        "showed",
        "directly",
        "transfinite",
        "induction",
        "first",
        "epsilonnumber",
        "ε",
        "expressible",
        "provable",
        "system",
        "gödel",
        "s",
        "incompleteness",
        "theorem",
        "thus",
        "proved",
        "completely",
        "different",
        "way",
        "idea",
        "proof",
        "brief",
        "term",
        "follows",
        "first",
        "laid",
        "mean",
        "derive",
        "transfinite",
        "induction",
        "specific",
        "ordinal",
        "number",
        "system",
        "secondly",
        "ordinal",
        "number",
        "ε",
        "associated",
        "derivation",
        "called",
        "value",
        "shown",
        "transfinite",
        "induction",
        "ordinal",
        "number",
        "derivable",
        "ordinal",
        "number",
        "greater",
        "value",
        "derivation",
        "therefore",
        "transfinite",
        "induction",
        "ε",
        "derivable",
        "since",
        "induction",
        "principle",
        "expressed",
        "proved",
        "ordinary",
        "arithmetic",
        "formula",
        "unprovable",
        "peano",
        "arithmetic",
        "found",
        "easy",
        "consequence",
        "gentzen",
        "s",
        "version",
        "incompleteness",
        "theorem",
        "consistency",
        "peano",
        "arithmetic",
        "anything",
        "would",
        "provable",
        "inconsistent",
        "system",
        "contrary",
        "gödel",
        "s",
        "artificial",
        "unprovable",
        "formula",
        "obtained",
        "coding",
        "arithmetized",
        "provability",
        "predicate",
        "gentzen",
        "s",
        "transfinite",
        "induction",
        "principle",
        "principle",
        "ordinary",
        "mathematics",
        "gentzen",
        "s",
        "last",
        "proof",
        "determined",
        "prooftheoretic",
        "ordinal",
        "peano",
        "arithmetic",
        "namely",
        "one",
        "needed",
        "prove",
        "consistency",
        "property",
        "nothing",
        "le",
        "would",
        "suffice",
        "work",
        "marked",
        "beginning",
        "ordinal",
        "proof",
        "theory",
        "without",
        "doubt",
        "remarkable",
        "foundational",
        "achievement",
        "arithmetic",
        "gödel",
        "s",
        "incompleteness",
        "theorem",
        "still",
        "largely",
        "unknownone",
        "find",
        "many",
        "book",
        "gödel",
        "s",
        "theorem",
        "even",
        "mention",
        "gentzen",
        "gödel",
        "seems",
        "thought",
        "giving",
        "consistency",
        "proof",
        "arithmetic",
        "use",
        "nonfinitary",
        "still",
        "constructive",
        "principle",
        "late",
        "thirty",
        "least",
        "developed",
        "response",
        "gentzen",
        "s",
        "proof",
        "special",
        "interpretation",
        "intuitionistic",
        "logic",
        "arithmetic",
        "came",
        "known",
        "dialectica",
        "interpretation",
        "us",
        "computable",
        "functionals",
        "interpret",
        "proof",
        "intuitionistic",
        "arithmetic",
        "gödel",
        "published",
        "interpretation",
        "even",
        "though",
        "presented",
        "lecture",
        "unknown",
        "discussed",
        "matter",
        "met",
        "gentzen",
        "december",
        "request",
        "bernays",
        "ackermann",
        "reproduced",
        "gentzen",
        "s",
        "proof",
        "term",
        "hilbert",
        "s",
        "epsiloncalculus",
        "ackermann",
        "s",
        "paper",
        "starting",
        "point",
        "kreisel",
        "s",
        "nocounterexample",
        "interpretation",
        "arithmetic",
        "surprise",
        "publication",
        "gödel",
        "s",
        "collected",
        "paper",
        "brought",
        "light",
        "zilsellecture",
        "vienna",
        "outline",
        "interpretation",
        "reformulation",
        "gentzen",
        "s",
        "proof",
        "matter",
        "discussed",
        "great",
        "detail",
        "tait",
        "worked",
        "nocounterexample",
        "interpretation",
        "extension",
        "analysis",
        "s",
        "next",
        "obvious",
        "task",
        "proof",
        "theory",
        "proof",
        "consistency",
        "arithmetic",
        "prove",
        "consistency",
        "analysis",
        "ie",
        "theory",
        "real",
        "number",
        "gentzen",
        "work",
        "direction",
        "assigned",
        "military",
        "service",
        "fall",
        "observed",
        "reported",
        "type",
        "number",
        "direction",
        "aircraft",
        "flew",
        "town",
        "brunswick",
        "hit",
        "nervous",
        "breakdown",
        "early",
        "resumed",
        "work",
        "analysis",
        "difficulty",
        "intrinsic",
        "topic",
        "great",
        "practical",
        "difficulty",
        "life",
        "caused",
        "war",
        "analysis",
        "formulated",
        "system",
        "secondorder",
        "arithmetic",
        "mean",
        "quantification",
        "extended",
        "numbertheoretic",
        "predicate",
        "equivalently",
        "set",
        "natural",
        "number",
        "secondorder",
        "number",
        "theory",
        "used",
        "gentzen",
        "s",
        "last",
        "paper",
        "published",
        "briefly",
        "shown",
        "principle",
        "transfinite",
        "induction",
        "ε",
        "derivable",
        "secondorder",
        "number",
        "theory",
        "half",
        "century",
        "passed",
        "constructive",
        "proof",
        "consistency",
        "full",
        "secondorder",
        "arithmetic",
        "sight",
        "early",
        "pioneer",
        "field",
        "included",
        "kurt",
        "schütte",
        "gaisi",
        "takeuti",
        "former",
        "created",
        "infinitary",
        "sequent",
        "calculus",
        "present",
        "consistency",
        "proof",
        "perspicuous",
        "way",
        "latter",
        "instead",
        "used",
        "traditional",
        "gentzenstyle",
        "calculus",
        "see",
        "takeuti",
        "current",
        "research",
        "proof",
        "theory",
        "secondorder",
        "arithmetic",
        "one",
        "study",
        "known",
        "subsystem",
        "secondorder",
        "arithmetic",
        "strongest",
        "result",
        "today",
        "brief",
        "outline",
        "following",
        "let",
        "x",
        "range",
        "numbertheoretic",
        "predicate",
        "formula",
        "x",
        "x",
        "state",
        "x",
        "property",
        "expressed",
        "x",
        "use",
        "first",
        "secondorder",
        "logic",
        "form",
        "compound",
        "formula",
        "x",
        "xx",
        "xx",
        "collection",
        "natural",
        "number",
        "formula",
        "one",
        "universal",
        "secondorder",
        "quantifier",
        "hold",
        "called",
        "πset",
        "case",
        "whole",
        "natural",
        "number",
        "generally",
        "comprehension",
        "axiom",
        "form",
        "xx",
        "xx",
        "b",
        "x",
        "formula",
        "b",
        "secondorder",
        "quantifier",
        "axiom",
        "give",
        "called",
        "arithmetic",
        "comprehension",
        "aca",
        "b",
        "form",
        "yz",
        "c",
        "x",
        "secondorder",
        "quantifier",
        "special",
        "case",
        "πcomprehension",
        "obtained",
        "consistency",
        "proof",
        "subsystem",
        "secondorder",
        "arithmetic",
        "πcomprehension",
        "given",
        "toshiyasu",
        "arai",
        "michael",
        "rathjen",
        "mids",
        "see",
        "rathjen",
        "development"
    ]
}