{
    "main_text": "Problems for the Naive Russellian theory\n5. Problems for the Naive Russellian theory\n\nNaive Russellianism faces several problems. In this section we shall\noffer a quick overview of some of the main problems and gesture\ntowards possible solutions.\n\nPragmatic principles. If the Naive Russellian wishes\nto give a pragmatic account of people’s ordinary judgments about\nthe differing truth-values of (1) and (4), she must clearly identify\nthe pragmatic principles that make these incorrect judgments so\npervasive. (Note: This problem will not face Braun’s version of\nNaive Russellianism in quite the same way.)\n\nH.P. Grice, the father of pragmatic implicatures, offered a very\ncompelling theory of conversational implicatures. (See Grice 1975,\n1978, 1981. See also the entry on\n implicature.)\n But it is unlikely to help the Naive Russellian. Information about\nthe way the believer believes what she believes cannot, it would seem,\nbe carried as a conversational implicature because such information is\nnot calculable by the conversational participants from what\nis said and the maxims, as Grice’s theory requires\nconversational implicatures to be. After all, that would require that,\nat some level, ordinary speakers realize that they are not saying all\nthey mean when they utter, under “ordinary circumstances,”\na sentence like (1). But that is implausible. (Schiffer, in his 1987,\nlevels a similar charge, although he does not explicitly present it in\nterms of Grice’s calculability condition; Salmon responds in his\n1989. See also Recanati 1993, chapter 17.)\n\nObvious permutations on Grice’s notion of conversational\nimplicature, like Morgan’s and Horn & Bayer’s notion\nof short-circuited conversational implicatures, won’t be of much\nuse either. (See Morgan 1978 and Horn & Bayer 1984.)\nShort-circuiting occurs when a nonliteral use becomes standardized.\nFor example, it is at least arguable that uses of ‘Can you pass\nthe salt?’, to take an example from Searle 1975, are standardly\nrequests for salt. According to Morgan and Horn and Bayer, this meant\ninformation is a conversational implicature. Ordinary speakers may not\nrecognize, even upon reflection, that they are speaking nonliterally\nbecause that nonliteral use has become conventionalized through\nrepetition. And even though ‘Do you have the ability to pass the\nsalt?’ and ‘Can you pass the salt?’ (at least\narguably) mean the same thing and hence utterances of them have the\nsame conversational implicating potential, because of past\nuses an utterance of the latter but not the former will naturally give\nrise to the request for the salt. Short-circuiting is unlikely to be\nof use to a Naive Russellian because it requires past uses that meet\nthe conditions for ordinary conversational implicature, those uses of\nwhich then become, through repetition, standardized. Those past uses,\nhowever, must pass the calculability condition, as they were ordinary\nconversational implicatures. But it is doubtful that there were at any\ntime widespread uses of propositional attitude reporting sentences\nthat met the necessary conditions for being conversational\nimplicatures, as it is highly dubious that ordinary speakers ever\nrealized that sentences like (1) and (4) say the same thing. Hence,\nthere was never the necessary past use as a standard conversational\nimplicature that could have become standardized.\n\nWe have argued that a proponent of (the standard version of) Naive\nRussellianism cannot employ Grice’s notion of conversational\nimplicature, or any obvious permutation thereof, to account for our\nFrege intuitions. What the Naive Russellian needs is a notion of a\npragmatic implicature that does not rely upon calculability and does\nnot require the propositions semantically encoded by the relevant\nutterances to play a role in the conscious psychological lives of the\nparticipants of the conversation. How could an implicature be\ngenerated under such conditions? The following is a suggestion.\n\nThere is a widespread conflation of belief contents and belief states.\nBecause ordinary folk do not clearly distinguish these two notions, it\npossible for them to use propositional attitude verbs that express a\nrelation to belief contents intending also to impart information about\nthe belief states of the subject of the report without realizing that\nthey are speaking nonliterally. As information concerning belief\nstates is useful in explaining, predicting, and rationalizing actions\n– something propositional attitude reporting sentences seem made\nto do – and belief contents and belief states are not clearly\ndistinguished, ordinary speakers unwittingly come to use such\nsentences to convey more than they express.\n\n\nAsymmetric relations. If names are\ninter-substitutable, and if (12) is true \n\n(12) Lois believes that Superman is stronger than Clark Kent.\n\n\nthen (13) and (14) must also be true.\n\n(13) Lois believes that Superman is stronger than Superman.\n\n(14) Lois believes that Clark Kent is stronger than Superman.\n\n\n\nCan it really be that (13) and (14) are true and that the typical\nstrong feeling that they are false is really just a matter of\npragmatic inappropriateness? The Naive Russellian seems to have little\nchoice but to offer a positive answer. \n\nIf (13) is true, then is it also true that Lois believes that Superman\nis stronger than himself, or can we differentiate this from the\nprevious claims? Maybe we can get ourselves to accept that Lois\nrationally believes that Superman is stronger than Superman. But how\ncould a thoughtful agent believe that something is stronger than\nitself? Surely that is a violation of the requirements of\nrationality.\n\nRegarding this last problem, Salmon 1992 and McKay 1991 compellingly\nargue that believing that Superman is stronger than Superman is\ndistinct from believing that Superman is stronger than himself because\nthe proposition that Superman is stronger than Superman is different\nfrom the proposition that Superman is stronger than himself, on the\ngrounds that being stronger than Superman is a different\nproperty from being stronger than oneself. The first is a\ntwo-place relation, with the identity pair <SUPERMAN, SUPERMAN>\nas relata; the second is a one-place, self-reflexive property. (For\nmore on the difference between xRy and xRx, under an assignment of the\nsame object to both variables x and y, see Fine 2007 \n\nPsychological explanation, predication, and\nrationalization. The explanatory, predictive, and\nrationalizing potential of (1) differs from that of (4). For example,\nan utterance of (4), if accepted as true, would typically lead one to\nexpect that, when Lois is looking for some heavy boxes to be moved in\nher office, sees Clark Kent (dressed in his Daily Planet\ngarb) standing by doing nothing, she would ask him to help, etc..\nThis, of course, is the wrong result. Lois does no such thing. The\nNaive Russellian thinks that an utterance of (4) is true in exactly\nthose conditions under which an utterance of (1) is true. But this, it\nmay be thought, is hard to square with the fact that they have such\nvery different explanatory, predictive, and rationalizing potential.\n(See Richard 1997 for a powerful presentation of this objection.)\n\nThe force of this objection rests on the first problem of pragmatic\nprinciples raised above. For if that problem is solved, then the\nsolution to the problems of psychological explanation, predication,\nand rationalization will follow on its wings. Insofar as utterances of\n(1) and (4) implicate different information about the way in which\nLois believes what she allegedly believes, it seems likely that there\nwill be a very natural account of the difference in their explanatory,\npredictive, and rationalizing potential, the difference in what is\npragmatically implicated will account for the differences noted in\nthis section. So the more fundamental problem facing the Naive\nRussellian is the problem of pragmatic principles.\n\nSchiffer’s iteration problem. In his 1987,\n2006, Schiffer argues that Naive Russellianism is implausible when it\ncomes to beliefs about other people’s beliefs. Lois, the Naive\nRussellian claims, is rational in believing a contradiction because\nshe has two modes of presentation of Superman such that she does not\nbelieve that they are modes of presentation of the same object. So,\nLois can rationally believe the singular propositions that Superman is\nstrong and that Superman is not strong at the same time because she\nbelieves the first in one way and the second in another way. But most\nof us believe that Lois believes that Superman is strong while\nbelieving that Lois does not believe that Clark Kent is strong. So,\ngiven Naive Russellianism, most of us then believe a proposition and\nits negation and we seem to not be guilty of irrationality for so\ndoing. But, argues Schiffer, the Naive Russellian cannot account for\nthis, as most of us do not have two distinct ways of thinking of\nSuperman (or Lois, for that matter) such that we do not realize that\nthey are ways of thinking of the same individual, as most of us are\nnot ignorant of the identity between Superman and Clark Kent. So, it\nseems that the Naive Russellian’s conditions for rationally\nbelieving a proposition and its negation are not met. (Salmon 1989,\n2006 contains responses to Schiffer’s objection. See also Braun\n2006.)\n",
    "section_title": "5. Problems for the Naive Russellian theory",
    "entry_title": "Propositional Attitude Reports",
    "hierarchy_title": "Propositional Attitude Reports || Problems for the Naive Russellian theory",
    "tokenized_text": [
        "problem",
        "naive",
        "russellian",
        "theory",
        "problem",
        "naive",
        "russellian",
        "theory",
        "naive",
        "russellianism",
        "face",
        "several",
        "problem",
        "section",
        "shall",
        "offer",
        "quick",
        "overview",
        "main",
        "problem",
        "gesture",
        "towards",
        "possible",
        "solution",
        "pragmatic",
        "principle",
        "naive",
        "russellian",
        "wish",
        "give",
        "pragmatic",
        "account",
        "people",
        "ordinary",
        "judgment",
        "differing",
        "truthvalues",
        "must",
        "clearly",
        "identify",
        "pragmatic",
        "principle",
        "make",
        "incorrect",
        "judgment",
        "pervasive",
        "note",
        "problem",
        "face",
        "braun",
        "version",
        "naive",
        "russellianism",
        "quite",
        "way",
        "hp",
        "grice",
        "father",
        "pragmatic",
        "implicatures",
        "offered",
        "compelling",
        "theory",
        "conversational",
        "implicatures",
        "see",
        "grice",
        "see",
        "also",
        "entry",
        "implicature",
        "unlikely",
        "help",
        "naive",
        "russellian",
        "information",
        "way",
        "believer",
        "belief",
        "belief",
        "would",
        "seem",
        "carried",
        "conversational",
        "implicature",
        "information",
        "calculable",
        "conversational",
        "participant",
        "said",
        "maxim",
        "grice",
        "theory",
        "requires",
        "conversational",
        "implicatures",
        "would",
        "require",
        "level",
        "ordinary",
        "speaker",
        "realize",
        "saying",
        "mean",
        "utter",
        "ordinary",
        "circumstance",
        "sentence",
        "like",
        "implausible",
        "schiffer",
        "level",
        "similar",
        "charge",
        "although",
        "explicitly",
        "present",
        "term",
        "grice",
        "calculability",
        "condition",
        "salmon",
        "responds",
        "see",
        "also",
        "recanati",
        "chapter",
        "obvious",
        "permutation",
        "grice",
        "notion",
        "conversational",
        "implicature",
        "like",
        "morgan",
        "horn",
        "bayer",
        "notion",
        "shortcircuited",
        "conversational",
        "implicatures",
        "much",
        "use",
        "either",
        "see",
        "morgan",
        "horn",
        "bayer",
        "shortcircuiting",
        "occurs",
        "nonliteral",
        "use",
        "becomes",
        "standardized",
        "example",
        "least",
        "arguable",
        "us",
        "pas",
        "salt",
        "take",
        "example",
        "searle",
        "standardly",
        "request",
        "salt",
        "according",
        "morgan",
        "horn",
        "bayer",
        "meant",
        "information",
        "conversational",
        "implicature",
        "ordinary",
        "speaker",
        "may",
        "recognize",
        "even",
        "upon",
        "reflection",
        "speaking",
        "nonliterally",
        "nonliteral",
        "use",
        "become",
        "conventionalized",
        "repetition",
        "even",
        "though",
        "ability",
        "pas",
        "salt",
        "pas",
        "salt",
        "least",
        "arguably",
        "mean",
        "thing",
        "hence",
        "utterance",
        "conversational",
        "implicating",
        "potential",
        "past",
        "us",
        "utterance",
        "latter",
        "former",
        "naturally",
        "give",
        "rise",
        "request",
        "salt",
        "shortcircuiting",
        "unlikely",
        "use",
        "naive",
        "russellian",
        "requires",
        "past",
        "us",
        "meet",
        "condition",
        "ordinary",
        "conversational",
        "implicature",
        "us",
        "become",
        "repetition",
        "standardized",
        "past",
        "us",
        "however",
        "must",
        "pas",
        "calculability",
        "condition",
        "ordinary",
        "conversational",
        "implicatures",
        "doubtful",
        "time",
        "widespread",
        "us",
        "propositional",
        "attitude",
        "reporting",
        "sentence",
        "met",
        "necessary",
        "condition",
        "conversational",
        "implicatures",
        "highly",
        "dubious",
        "ordinary",
        "speaker",
        "ever",
        "realized",
        "sentence",
        "like",
        "say",
        "thing",
        "hence",
        "never",
        "necessary",
        "past",
        "use",
        "standard",
        "conversational",
        "implicature",
        "could",
        "become",
        "standardized",
        "argued",
        "proponent",
        "standard",
        "version",
        "naive",
        "russellianism",
        "employ",
        "grice",
        "notion",
        "conversational",
        "implicature",
        "obvious",
        "permutation",
        "thereof",
        "account",
        "frege",
        "intuition",
        "naive",
        "russellian",
        "need",
        "notion",
        "pragmatic",
        "implicature",
        "rely",
        "upon",
        "calculability",
        "require",
        "proposition",
        "semantically",
        "encoded",
        "relevant",
        "utterance",
        "play",
        "role",
        "conscious",
        "psychological",
        "life",
        "participant",
        "conversation",
        "could",
        "implicature",
        "generated",
        "condition",
        "following",
        "suggestion",
        "widespread",
        "conflation",
        "belief",
        "content",
        "belief",
        "state",
        "ordinary",
        "folk",
        "clearly",
        "distinguish",
        "two",
        "notion",
        "possible",
        "use",
        "propositional",
        "attitude",
        "verb",
        "express",
        "relation",
        "belief",
        "content",
        "intending",
        "also",
        "impart",
        "information",
        "belief",
        "state",
        "subject",
        "report",
        "without",
        "realizing",
        "speaking",
        "nonliterally",
        "information",
        "concerning",
        "belief",
        "state",
        "useful",
        "explaining",
        "predicting",
        "rationalizing",
        "action",
        "something",
        "propositional",
        "attitude",
        "reporting",
        "sentence",
        "seem",
        "made",
        "belief",
        "content",
        "belief",
        "state",
        "clearly",
        "distinguished",
        "ordinary",
        "speaker",
        "unwittingly",
        "come",
        "use",
        "sentence",
        "convey",
        "express",
        "asymmetric",
        "relation",
        "name",
        "intersubstitutable",
        "true",
        "lois",
        "belief",
        "superman",
        "stronger",
        "clark",
        "kent",
        "must",
        "also",
        "true",
        "lois",
        "belief",
        "superman",
        "stronger",
        "superman",
        "lois",
        "belief",
        "clark",
        "kent",
        "stronger",
        "superman",
        "really",
        "true",
        "typical",
        "strong",
        "feeling",
        "false",
        "really",
        "matter",
        "pragmatic",
        "inappropriateness",
        "naive",
        "russellian",
        "seems",
        "little",
        "choice",
        "offer",
        "positive",
        "answer",
        "true",
        "also",
        "true",
        "lois",
        "belief",
        "superman",
        "stronger",
        "differentiate",
        "previous",
        "claim",
        "maybe",
        "get",
        "accept",
        "lois",
        "rationally",
        "belief",
        "superman",
        "stronger",
        "superman",
        "could",
        "thoughtful",
        "agent",
        "believe",
        "something",
        "stronger",
        "surely",
        "violation",
        "requirement",
        "rationality",
        "regarding",
        "last",
        "problem",
        "salmon",
        "mckay",
        "compellingly",
        "argue",
        "believing",
        "superman",
        "stronger",
        "superman",
        "distinct",
        "believing",
        "superman",
        "stronger",
        "proposition",
        "superman",
        "stronger",
        "superman",
        "different",
        "proposition",
        "superman",
        "stronger",
        "ground",
        "stronger",
        "superman",
        "different",
        "property",
        "stronger",
        "oneself",
        "first",
        "twoplace",
        "relation",
        "identity",
        "pair",
        "superman",
        "superman",
        "relatum",
        "second",
        "oneplace",
        "selfreflexive",
        "property",
        "difference",
        "xry",
        "xrx",
        "assignment",
        "object",
        "variable",
        "x",
        "see",
        "fine",
        "psychological",
        "explanation",
        "predication",
        "rationalization",
        "explanatory",
        "predictive",
        "rationalizing",
        "potential",
        "differs",
        "example",
        "utterance",
        "accepted",
        "true",
        "would",
        "typically",
        "lead",
        "one",
        "expect",
        "lois",
        "looking",
        "heavy",
        "box",
        "moved",
        "office",
        "see",
        "clark",
        "kent",
        "dressed",
        "daily",
        "planet",
        "garb",
        "standing",
        "nothing",
        "would",
        "ask",
        "help",
        "etc",
        "course",
        "wrong",
        "result",
        "lois",
        "thing",
        "naive",
        "russellian",
        "think",
        "utterance",
        "true",
        "exactly",
        "condition",
        "utterance",
        "true",
        "may",
        "thought",
        "hard",
        "square",
        "fact",
        "different",
        "explanatory",
        "predictive",
        "rationalizing",
        "potential",
        "see",
        "richard",
        "powerful",
        "presentation",
        "objection",
        "force",
        "objection",
        "rest",
        "first",
        "problem",
        "pragmatic",
        "principle",
        "raised",
        "problem",
        "solved",
        "solution",
        "problem",
        "psychological",
        "explanation",
        "predication",
        "rationalization",
        "follow",
        "wing",
        "insofar",
        "utterance",
        "implicate",
        "different",
        "information",
        "way",
        "lois",
        "belief",
        "allegedly",
        "belief",
        "seems",
        "likely",
        "natural",
        "account",
        "difference",
        "explanatory",
        "predictive",
        "rationalizing",
        "potential",
        "difference",
        "pragmatically",
        "implicated",
        "account",
        "difference",
        "noted",
        "section",
        "fundamental",
        "problem",
        "facing",
        "naive",
        "russellian",
        "problem",
        "pragmatic",
        "principle",
        "schiffer",
        "iteration",
        "problem",
        "schiffer",
        "argues",
        "naive",
        "russellianism",
        "implausible",
        "come",
        "belief",
        "people",
        "belief",
        "lois",
        "naive",
        "russellian",
        "claim",
        "rational",
        "believing",
        "contradiction",
        "two",
        "mode",
        "presentation",
        "superman",
        "believe",
        "mode",
        "presentation",
        "object",
        "lois",
        "rationally",
        "believe",
        "singular",
        "proposition",
        "superman",
        "strong",
        "superman",
        "strong",
        "time",
        "belief",
        "first",
        "one",
        "way",
        "second",
        "another",
        "way",
        "u",
        "believe",
        "lois",
        "belief",
        "superman",
        "strong",
        "believing",
        "lois",
        "believe",
        "clark",
        "kent",
        "strong",
        "given",
        "naive",
        "russellianism",
        "u",
        "believe",
        "proposition",
        "negation",
        "seem",
        "guilty",
        "irrationality",
        "argues",
        "schiffer",
        "naive",
        "russellian",
        "account",
        "u",
        "two",
        "distinct",
        "way",
        "thinking",
        "superman",
        "lois",
        "matter",
        "realize",
        "way",
        "thinking",
        "individual",
        "u",
        "ignorant",
        "identity",
        "superman",
        "clark",
        "kent",
        "seems",
        "naive",
        "russellian",
        "condition",
        "rationally",
        "believing",
        "proposition",
        "negation",
        "met",
        "salmon",
        "contains",
        "response",
        "schiffer",
        "objection",
        "see",
        "also",
        "braun"
    ]
}