{
    "main_text": "Some Recent Accounts of Structured Propositions || The Algebraic Approach\n3.3 The Algebraic Approach\n\nFinally, we turn to algebraic approaches. Though Bealer in some sense\nadopts an algebraic approach to propositions (see the above\ndiscussion), he apparently holds that propositions have no (set\ntheoretic or mereological) parts, and so doesn’t count as a\nstructured proposition theorist in the sense in which the term is used\nhere. Thus, we will consider here adherents to the algebraic approach\nwho do hold that the propositions yielded by their algebras are\ncomplex and have “parts”. Aside from Bealer [1979, 1982\nand 1993], work in this tradition includes Edward Zalta [1983 and\n1988], and Christopher Menzel [1993]. The focus here will be on the\nformulations in Edward Zalta [1988]. Though Zalta has an extensive,\naxiomatized theory of propositions, and ordinary and abstract\nindividuals, properties, and relations, we confine our attention here\nto his view about propositions. Still, since Zalta views propositions\nas zero-place relations, we will say something about his views on\nproperties and relations.\n\nAdvocates of the algebraic approach such as Zalta, like the\nneo-Russellians and the advocates of structured meaning approaches,\nthink that a good theory of propositions must allow for distinct,\nnecessarily equivalent propositions. Thus, he writes:\n\n“Necessarily equivalent propositions may be distinct. If the\ntheory of propositions is not fine-grained enough to distinguish\nnecessarily equivalent propositions, the ability to accurately\nrepresent belief is lost” (Zalta 1988, p. 57)\n\n\nTo appreciate how Zalta achieves the goal of having a fine-grained\ntheory of propositions, we begin by discussing how he views relations\ngenerally, since, as just mentioned, Zalta takes propositions to be\nzero-place relations (and properties to be one-place relations). Zalta\nholds that relations are “primitive entities”, by which he\nmeans that they are not to be explained or “defined” in\nterms of other entities/notions. But at least some relations are\ncomplex. For example, if we take a two-place relation (between\nobjects) Rxy and “plug” one of its\nargument places with the object b, we get the one-place\nrelation (property) Rxb (“bearing R\nto\n b”).[34]\n This one-place relation is complex, having b and R as\nparts. Similarly, if we take a three-place relation\nSxyz and “universalize” the\nthird argument position, we get a two place relation that we might\nrepresent thus: (z)Sxyz\n(“x and y (in that order) stand in S to\neverything”). Here again, the two-place relation is complex,\nhaving S and (something corresponding to)\n“universalization” as parts. Zalta’s idea is that\nproperties, relations and individuals can be “harnessed\ntogether” to form new, complex relations. In his axiomatized\ntheory of relations, Zalta introduces a comprehension schema for\nrelations (see Zalta [1988] p. 46) that insures that all manner of\ncomplex relations will be available. To insure that all instances of\nthe comprehension schema are true in all interpretations of his\naxiomatized theory, Zalta has these interpretations include the\nfollowing group of “logical functions”:\nPLUGi, NEG, COND, UNIVi,\nREFLi, j CONVi, j,\nVACi, NEC, WAS and WILL. Roughly (and suppressing\nreference to worlds and times) PLUGi is a function\nthat maps an n-place relation R and an object b\nto the n-1 place relation R′ such that\n< o1, …,\noi-1, oi+1,\n…, on > stand in\nR′ iff < o1, …,\noi-1, b,\noi+1, …,\non > stand in R. NEG is a\nfunction that maps an n-place relation R to an\nn-place relation R′ such that n things\nstand in R′ iff they don’t stand in\n R.[35]\n Thus the repeated application of these functions yields appropriate\nrelations to make true the instances of Zalta’s comprehension\nschema for relations. For example, consider the following two\ninstances of his comprehension schema (where ‘F′ is\na variable ranging over one-place relations; ‘b’ is\na name of an individual; and the other predicate letters are constants\nand so name particular\n relations):[36]\n\n(∃F)(Fx iff Rxb) \n\n(∃F)(Fx iff ~Px) \n\nIf we apply PLUG2 to the individual denoted by\n‘b’ and the (two-place) relation denoted by\n‘R’, we get a one-place relation that makes the\nfirst instance of the schema true; and if we apply NEG to the\ndenotation of ‘P’, we get a one-place relation that\nmakes the second instance true.\n\nAs we have mentioned, propositions are zero-place relations for Zalta.\nThus, PLUGi and the rest of the “logical\nfunctions” mentioned above can be applied to various entities to\nyield propositions. Thus the proposition expressed by a sentence like\n\n\nEd runs.\n\nis the result of applying the PLUG1 function to the\nproperty of running and Ed. This proposition consists of Ed saturating\nthe one argument place of the running property. Similarly, a sentence\nlike\n\nEd does not run.\n\nexpresses the proposition that is the result of applying\nPLUG1 to running and Ed as before, and then applying NEG to\nthe output of PLUG1. Finally, a sentence like\n\nEverything runs.\n\nexpresses the result of applying UNIV1 to the property of\nrunning. This idea that there is some group of “logical\nfunctions” whose repeated application to some other entities\nyield complex propositions (and relations) is characteristic of what\nare being called algebraic approaches.\n\nIt should be clear that necessarily equivalent sentences may express\ndistinct propositions on Zalta’s view. For example, the\nsentences ‘All brother are male siblings’ and ‘All\nbachelors are unmarried’ express propositions that are true in\nall possible worlds. But the first expresses a proposition that\nresults from applying COND to the properties of being a brother and\nbeing a male sibling, and applying REFL1,2 and then\nUNIV1 to the output of COND. The second does not, but\ninstead results from applying these functions in the same order to the\nproperties of being a bachelor and being unmarried. Further, it should\nbe clear that the semantic values of expressions are recoverable from\nthe propositions expressed by sentences in which they occur. E.g. both\nEd and the property of running, which are the semantic values of\n‘Ed’ and ‘runs’, are constituents of the\nproposition that Ed runs, which is expressed by ‘Ed runs’,\nsince this proposition consists of Ed saturating the one argument\nplace in the property of running.\n\nHaving sketched Zalta’s view of propositions it is worth\nmentioning a couple points about it. First, at least in some cases,\nwhat binds together the constituents of a proposition is in some sense\n“built into” one of the constituents of the proposition\nfor Zalta, (as we shall see below, the same is true for Frege and\nRussell). Consider again the sentence:\n\nEd runs.\n\nRecall that this sentence expresses the proposition that results from\napplying PLUG1 to Ed and the property of running. The\noutput is Ed saturating (“plugged into”) the one argument\nplace of the property of running. There are two things to notice about\nthis proposal. First, it is one of the constituents of the\nproposition, the running property, that binds the constituents of the\nproposition together. The proposition is held together in virtue of Ed\n“plugging” the one argument place in the running property.\nSecond, the proposition just is Ed “plugging”/possessing\nthat property!\n\nSuch a view immediately raises a worry about false propositions\n(discussed below in connection with Russell’s POM account of\npropositions). For one might argue as follows. Suppose Ed\ndoesn’t run. Then Ed doesn’t plug/saturate the one\nargument place in the property of running (i.e. doesn’t possess\nthis property). But Ed possessing the running property just is the\nproposition that Ed runs. Thus there is no proposition that Ed runs.\nSimilar reasoning shows that any other false proposition fails to\nexist. So there are no false propositions.\n\nObviously, Zalta does not want to be saddled with this result, and he\nisn’t. He holds that the even if Ed doesn’t run, there is\na proposition consisting of Ed saturating the argument place in the\nrunning property. That proposition simply isn’t true. To put the\npoint somewhat paradoxically, even if Ed doesn’t run, he\npossesses the property of running, so that we have our (false)\nproposition.\n\nTo some, Zalta will appear to have confused a proposition with what\nmakes it true. Ed possessing the running property isn’t the\nproposition that Ed runs, one might think. It is what makes that\nproposition true! Of course Zalta must deny this. Having identified\nthe proposition with the thing that other theorists take to be what\nmakes the proposition true, Zalta holds that nothing outside of the\nproposition makes it true:\n\nThe metaphysical truth or falsity of these logical complexes\n[propositions] is basic. If a proposition is true, there is nothing\nelse that “makes it true”. Its being true is just the way\nthings are (arranged). (Zalta [1988] p.56)\n\n\nSo the idea is that whether Ed runs or not, he saturates the one\nargument place in the running property, so that we have the\nproposition that Ed runs. If Ed does run, so that the proposition is\ntrue, it is just a basic, brute fact that the proposition is true.\n\nFinally, though we shall not go into it here, it is worth mentioning\nthat when Zalta gets to the semantics of verbs of propositional\nattitudes, it is not only the propositions considered thus far that\nare objects of the attitudes and make belief ascriptions true or\nfalse. Zalta ends up claiming that sentences embedded with respect to\nattitude verbs are ambiguous, sometimes expressing the sorts of\npropositions we are discussing, and sometimes expressing other\npropositions that instead of containing the individuals, properties\nand relations thus far discussed, contain senses of these individuals,\nproperties and relations. These senses are “abstract”\nindividuals and relations, instead of the ordinary individuals and\nrelations discussed thus far. Hence Zalta ends up with a theory of\nbelief ascriptions that invokes both fine-grained propositions and\nneo-Fregean senses. The interested reader should consult Zalta [1988].\n\n",
    "section_title": "3.3 The Algebraic Approach",
    "entry_title": "Structured Propositions",
    "hierarchy_title": "Structured Propositions || Some Recent Accounts of Structured Propositions || The Algebraic Approach",
    "tokenized_text": [
        "recent",
        "account",
        "structured",
        "proposition",
        "algebraic",
        "approach",
        "algebraic",
        "approach",
        "finally",
        "turn",
        "algebraic",
        "approach",
        "though",
        "bealer",
        "sense",
        "adopts",
        "algebraic",
        "approach",
        "proposition",
        "see",
        "discussion",
        "apparently",
        "hold",
        "proposition",
        "set",
        "theoretic",
        "mereological",
        "part",
        "count",
        "structured",
        "proposition",
        "theorist",
        "sense",
        "term",
        "used",
        "thus",
        "consider",
        "adherent",
        "algebraic",
        "approach",
        "hold",
        "proposition",
        "yielded",
        "algebra",
        "complex",
        "part",
        "aside",
        "bealer",
        "work",
        "tradition",
        "includes",
        "edward",
        "zalta",
        "christopher",
        "menzel",
        "focus",
        "formulation",
        "edward",
        "zalta",
        "though",
        "zalta",
        "extensive",
        "axiomatized",
        "theory",
        "proposition",
        "ordinary",
        "abstract",
        "individual",
        "property",
        "relation",
        "confine",
        "attention",
        "view",
        "proposition",
        "still",
        "since",
        "zalta",
        "view",
        "proposition",
        "zeroplace",
        "relation",
        "say",
        "something",
        "view",
        "property",
        "relation",
        "advocate",
        "algebraic",
        "approach",
        "zalta",
        "like",
        "neorussellians",
        "advocate",
        "structured",
        "meaning",
        "approach",
        "think",
        "good",
        "theory",
        "proposition",
        "must",
        "allow",
        "distinct",
        "necessarily",
        "equivalent",
        "proposition",
        "thus",
        "writes",
        "necessarily",
        "equivalent",
        "proposition",
        "may",
        "distinct",
        "theory",
        "proposition",
        "finegrained",
        "enough",
        "distinguish",
        "necessarily",
        "equivalent",
        "proposition",
        "ability",
        "accurately",
        "represent",
        "belief",
        "lost",
        "zalta",
        "p",
        "appreciate",
        "zalta",
        "achieves",
        "goal",
        "finegrained",
        "theory",
        "proposition",
        "begin",
        "discussing",
        "view",
        "relation",
        "generally",
        "since",
        "mentioned",
        "zalta",
        "take",
        "proposition",
        "zeroplace",
        "relation",
        "property",
        "oneplace",
        "relation",
        "zalta",
        "hold",
        "relation",
        "primitive",
        "entity",
        "mean",
        "explained",
        "defined",
        "term",
        "entitiesnotions",
        "least",
        "relation",
        "complex",
        "example",
        "take",
        "twoplace",
        "relation",
        "object",
        "rxy",
        "plug",
        "one",
        "argument",
        "place",
        "object",
        "b",
        "get",
        "oneplace",
        "relation",
        "property",
        "rxb",
        "bearing",
        "r",
        "b",
        "oneplace",
        "relation",
        "complex",
        "b",
        "r",
        "part",
        "similarly",
        "take",
        "threeplace",
        "relation",
        "sxyz",
        "universalize",
        "third",
        "argument",
        "position",
        "get",
        "two",
        "place",
        "relation",
        "might",
        "represent",
        "thus",
        "z",
        "sxyz",
        "x",
        "order",
        "stand",
        "everything",
        "twoplace",
        "relation",
        "complex",
        "something",
        "corresponding",
        "universalization",
        "part",
        "zalta",
        "idea",
        "property",
        "relation",
        "individual",
        "harnessed",
        "together",
        "form",
        "new",
        "complex",
        "relation",
        "axiomatized",
        "theory",
        "relation",
        "zalta",
        "introduces",
        "comprehension",
        "schema",
        "relation",
        "see",
        "zalta",
        "p",
        "insures",
        "manner",
        "complex",
        "relation",
        "available",
        "insure",
        "instance",
        "comprehension",
        "schema",
        "true",
        "interpretation",
        "axiomatized",
        "theory",
        "zalta",
        "interpretation",
        "include",
        "following",
        "group",
        "logical",
        "function",
        "plugi",
        "neg",
        "cond",
        "univi",
        "refli",
        "j",
        "convi",
        "j",
        "vaci",
        "nec",
        "roughly",
        "suppressing",
        "reference",
        "world",
        "time",
        "plugi",
        "function",
        "map",
        "nplace",
        "relation",
        "r",
        "object",
        "b",
        "n",
        "place",
        "relation",
        "r",
        "o",
        "oi",
        "oi",
        "stand",
        "r",
        "iff",
        "o",
        "oi",
        "b",
        "oi",
        "stand",
        "r",
        "neg",
        "function",
        "map",
        "nplace",
        "relation",
        "r",
        "nplace",
        "relation",
        "r",
        "n",
        "thing",
        "stand",
        "r",
        "iff",
        "stand",
        "r",
        "thus",
        "repeated",
        "application",
        "function",
        "yield",
        "appropriate",
        "relation",
        "make",
        "true",
        "instance",
        "zalta",
        "comprehension",
        "schema",
        "relation",
        "example",
        "consider",
        "following",
        "two",
        "instance",
        "comprehension",
        "schema",
        "f",
        "variable",
        "ranging",
        "oneplace",
        "relation",
        "b",
        "name",
        "individual",
        "predicate",
        "letter",
        "constant",
        "name",
        "particular",
        "relation",
        "f",
        "fx",
        "iff",
        "rxb",
        "f",
        "fx",
        "iff",
        "px",
        "apply",
        "plug",
        "individual",
        "denoted",
        "b",
        "twoplace",
        "relation",
        "denoted",
        "r",
        "get",
        "oneplace",
        "relation",
        "make",
        "first",
        "instance",
        "schema",
        "true",
        "apply",
        "neg",
        "denotation",
        "p",
        "get",
        "oneplace",
        "relation",
        "make",
        "second",
        "instance",
        "true",
        "mentioned",
        "proposition",
        "zeroplace",
        "relation",
        "zalta",
        "thus",
        "plugi",
        "rest",
        "logical",
        "function",
        "mentioned",
        "applied",
        "various",
        "entity",
        "yield",
        "proposition",
        "thus",
        "proposition",
        "expressed",
        "sentence",
        "like",
        "ed",
        "run",
        "result",
        "applying",
        "plug",
        "function",
        "property",
        "running",
        "ed",
        "proposition",
        "consists",
        "ed",
        "saturating",
        "one",
        "argument",
        "place",
        "running",
        "property",
        "similarly",
        "sentence",
        "like",
        "ed",
        "run",
        "express",
        "proposition",
        "result",
        "applying",
        "plug",
        "running",
        "ed",
        "applying",
        "neg",
        "output",
        "plug",
        "finally",
        "sentence",
        "like",
        "everything",
        "run",
        "express",
        "result",
        "applying",
        "univ",
        "property",
        "running",
        "idea",
        "group",
        "logical",
        "function",
        "whose",
        "repeated",
        "application",
        "entity",
        "yield",
        "complex",
        "proposition",
        "relation",
        "characteristic",
        "called",
        "algebraic",
        "approach",
        "clear",
        "necessarily",
        "equivalent",
        "sentence",
        "may",
        "express",
        "distinct",
        "proposition",
        "zalta",
        "view",
        "example",
        "sentence",
        "brother",
        "male",
        "sibling",
        "bachelor",
        "unmarried",
        "express",
        "proposition",
        "true",
        "possible",
        "world",
        "first",
        "express",
        "proposition",
        "result",
        "applying",
        "cond",
        "property",
        "brother",
        "male",
        "sibling",
        "applying",
        "refl",
        "univ",
        "output",
        "cond",
        "second",
        "instead",
        "result",
        "applying",
        "function",
        "order",
        "property",
        "bachelor",
        "unmarried",
        "clear",
        "semantic",
        "value",
        "expression",
        "recoverable",
        "proposition",
        "expressed",
        "sentence",
        "occur",
        "eg",
        "ed",
        "property",
        "running",
        "semantic",
        "value",
        "ed",
        "run",
        "constituent",
        "proposition",
        "ed",
        "run",
        "expressed",
        "ed",
        "run",
        "since",
        "proposition",
        "consists",
        "ed",
        "saturating",
        "one",
        "argument",
        "place",
        "property",
        "running",
        "sketched",
        "zalta",
        "view",
        "proposition",
        "worth",
        "mentioning",
        "couple",
        "point",
        "first",
        "least",
        "case",
        "bind",
        "together",
        "constituent",
        "proposition",
        "sense",
        "built",
        "one",
        "constituent",
        "proposition",
        "zalta",
        "shall",
        "see",
        "true",
        "frege",
        "russell",
        "consider",
        "sentence",
        "ed",
        "run",
        "recall",
        "sentence",
        "express",
        "proposition",
        "result",
        "applying",
        "plug",
        "ed",
        "property",
        "running",
        "output",
        "ed",
        "saturating",
        "plugged",
        "one",
        "argument",
        "place",
        "property",
        "running",
        "two",
        "thing",
        "notice",
        "proposal",
        "first",
        "one",
        "constituent",
        "proposition",
        "running",
        "property",
        "bind",
        "constituent",
        "proposition",
        "together",
        "proposition",
        "held",
        "together",
        "virtue",
        "ed",
        "plugging",
        "one",
        "argument",
        "place",
        "running",
        "property",
        "second",
        "proposition",
        "ed",
        "plugging",
        "possessing",
        "property",
        "view",
        "immediately",
        "raise",
        "worry",
        "false",
        "proposition",
        "discussed",
        "connection",
        "russell",
        "pom",
        "account",
        "proposition",
        "one",
        "might",
        "argue",
        "follows",
        "suppose",
        "ed",
        "run",
        "ed",
        "plugsaturate",
        "one",
        "argument",
        "place",
        "property",
        "running",
        "ie",
        "posse",
        "property",
        "ed",
        "possessing",
        "running",
        "property",
        "proposition",
        "ed",
        "run",
        "thus",
        "proposition",
        "ed",
        "run",
        "similar",
        "reasoning",
        "show",
        "false",
        "proposition",
        "fails",
        "exist",
        "false",
        "proposition",
        "obviously",
        "zalta",
        "want",
        "saddled",
        "result",
        "hold",
        "even",
        "ed",
        "run",
        "proposition",
        "consisting",
        "ed",
        "saturating",
        "argument",
        "place",
        "running",
        "property",
        "proposition",
        "simply",
        "true",
        "put",
        "point",
        "somewhat",
        "paradoxically",
        "even",
        "ed",
        "run",
        "posse",
        "property",
        "running",
        "false",
        "proposition",
        "zalta",
        "appear",
        "confused",
        "proposition",
        "make",
        "true",
        "ed",
        "possessing",
        "running",
        "property",
        "proposition",
        "ed",
        "run",
        "one",
        "might",
        "think",
        "make",
        "proposition",
        "true",
        "course",
        "zalta",
        "must",
        "deny",
        "identified",
        "proposition",
        "thing",
        "theorist",
        "take",
        "make",
        "proposition",
        "true",
        "zalta",
        "hold",
        "nothing",
        "outside",
        "proposition",
        "make",
        "true",
        "metaphysical",
        "truth",
        "falsity",
        "logical",
        "complex",
        "proposition",
        "basic",
        "proposition",
        "true",
        "nothing",
        "else",
        "make",
        "true",
        "true",
        "way",
        "thing",
        "arranged",
        "zalta",
        "p",
        "idea",
        "whether",
        "ed",
        "run",
        "saturates",
        "one",
        "argument",
        "place",
        "running",
        "property",
        "proposition",
        "ed",
        "run",
        "ed",
        "run",
        "proposition",
        "true",
        "basic",
        "brute",
        "fact",
        "proposition",
        "true",
        "finally",
        "though",
        "shall",
        "go",
        "worth",
        "mentioning",
        "zalta",
        "get",
        "semantics",
        "verb",
        "propositional",
        "attitude",
        "proposition",
        "considered",
        "thus",
        "far",
        "object",
        "attitude",
        "make",
        "belief",
        "ascription",
        "true",
        "false",
        "zalta",
        "end",
        "claiming",
        "sentence",
        "embedded",
        "respect",
        "attitude",
        "verb",
        "ambiguous",
        "sometimes",
        "expressing",
        "sort",
        "proposition",
        "discussing",
        "sometimes",
        "expressing",
        "proposition",
        "instead",
        "containing",
        "individual",
        "property",
        "relation",
        "thus",
        "far",
        "discussed",
        "contain",
        "sens",
        "individual",
        "property",
        "relation",
        "sens",
        "abstract",
        "individual",
        "relation",
        "instead",
        "ordinary",
        "individual",
        "relation",
        "discussed",
        "thus",
        "far",
        "hence",
        "zalta",
        "end",
        "theory",
        "belief",
        "ascription",
        "invokes",
        "finegrained",
        "proposition",
        "neofregean",
        "sens",
        "interested",
        "reader",
        "consult",
        "zalta"
    ]
}