{
    "main_text": "The Nature and Status of Propositions || Reply #1: Truth in a World vs. Truth at a World\n7.2 Reply #1: Truth in a World vs. Truth at a World.\n\nThe Easy Arguments rely on an assumption about entailment and truth,\nnamely:\n\n(Assumption A)\nIf a proposition \\(\\ltb p\\gtb\\) fails to entail a proposition\n\\(\\ltb q\\gtb\\), then it is possible for \\(\\ltb\np\\gtb\\) to be true while not-\\(q\\).\n\n\nThis assumption is needed to reason from premises about propositions\nfailing to entail other propositions about there being mental states\nor being concrete entities to the possible truth of those propositions\nin the absence of mental states and concrete entities.\n\nBut how could (A) fail? If a proposition fails to entail that \\(q\\),\ndoesn’t it follow that there is a possible world in which the\nformer is true and not-\\(q\\)?\n\nSome philosophers (Pollock 1985, King 2007) have argued that\nprinciples like (A) have two readings, one clearly acceptable but\nuseless to the Easy Arguments and the other useful to those arguments\nbut false. The two readings correspond to two ways of understanding\ntalk of truth with respect to possible worlds. One way for something\nto be true with respect to a world requires the truth-bearer to exist\nin the world and be true there. Another way is for the truth-bearer to\n“correctly describe” the world, where this does not\nrequire existing in the world. Pollock gives the example of a picture\ndepicting the non-existence of all pictures. The picture could\ncorrectly depict a situation even though the situation it depicts is\none in which the picture itself does not exist. Similarly, the\nMedieval philosopher Jean Buridan discusses the example of an\nutterance of ‘there are no negative utterances’. This\nutterance correctly describes a certain possible situation even though\nthat situation is one in which the utterance would not exist.\nFollowing Adams (1981), we may call the former way of being true with\nrespect to a world truth in a world and the latter truth\nat a world. The conceptualist may claim that propositions can be\ntrue at worlds without being true in them, by analogy with the\nexamples from Pollock and Buridan. A proposition like \\(\\ltb\\)there\nare no propositions\\(\\gtb\\) is true at certain possible worlds but\ntrue in none. Since we do not want to say that such propositions are\nnecessary, we must understand necessity as truth at every\npossible world. Correspondingly, to preserve the connections between\nentailment and necessity, we must understand entailment in terms of\nthe entailed proposition being true at every world at which the\nentailing proposition is true. Given all this, we can distinguish two\nreadings for Assumption A:\n\n(Reading 1)\nIf a proposition \\(\\ltb p\\gtb\\) fails to entail a proposition\n\\(\\ltb q\\gtb\\), then there is a possible world \\(W\\) such that \\(\\ltb\np\\gtb\\) is true in \\(W\\) and not-\\(q\\) at \\(W\\).\n\n\n(Reading 2)\nIf a proposition \\(\\ltb p\\gtb\\) fails to entail a proposition\n\\(\\ltb q\\gtb\\), then there is a possible world \\(W\\) such that \\(\\ltb\np\\gtb\\) is true at \\(W\\) and not-\\(q\\) at \\(W\\).\n\n\nGiven the understanding of entailment in terms of truth at a world,\nthe conceptualist will claim that Reading 1 is false, while Reading 2\nis true but useless to the Easy Arguments. Thus, the conclusions of\nthose arguments are blocked.\n\nThe plausibility of this response depends on having a good account of\nwhat truth at a world amounts to. But this, in turn, depends on issues\nin the metaphysics of modality.\n\nIf worlds are concrete particulars (“I and all my\nsurroundings”), as they are for David Lewis (1986), then we\ncould say that a proposition is true at a world if the\nproposition is about the entities that are parts of that world and is\ntrue, and true in a world if true at a world and also part of\nthat world. There may well be difficulties of explaining how a\nproposition could be part of more than one concrete world (and why it\nwould only be part of some concrete worlds but not all), but this\nframework seems to make conceptual room for the possibility\npropositions being true at worlds without being true in them.\n\nSuppose, however, that worlds were conceived as world stories, i.e.,\nas maximal consistent sets of propositions (see Section 2). How, then,\nmight truth at a world be understood? One approach, favored by Adams\n(1981), is to explain truth at a world in terms of truth in a world,\nunderstanding the latter to amount to truth were the world actual\n(were all its members true). On this approach, we would understand\nwhat is true at a world in terms of what is true in it, together with\ncertain facts about the actual world. However, the conceptualist\ncannot abide this approach. For, on this approach, the members of any\nworld are true in that world. But since the members of any and every\nworld are propositions, it would follow that, contrary to\nconceptualism, that it is necessary that there are propositions. A\nmore conceptualist-friendly approach is to reverse the order of\nexplanation, to explain truth in a world in terms of truth at a world\n+ existence in that world. How could truth at a world be understood? A\nnatural proposal is to understand it as membership in a world\nstory.\n\nDifficulties emerge with this proposal when we face the question of\nhow to understand consistency of world stories. There are maximal sets\nof propositions that are not possible worlds because they are not\nconsistent in the relevant sense. But the relevant sense is\nnot easily defined. Following Adams (1981), we might wish to use the\nconcept of possibility to gloss the notion of consistency: a set of\npropositions is consistent if and only if those propositions could all\nbe true together. This returns us to the problem noted in the previous\nparagraph: it again would turn out that necessarily there are\npropositions (even in mindless worlds).\n\nThe conceptualist might hope to take the relevant notion of\nconsistency as primitive and reject the gloss in terms of joint\npossible truth. Still, we should ask about the broader implications of\ndenying the joint possible truth of consistent world stories.\nConsider, for instance the notion of actuality. Only one of the many\npossible worlds is actual, although each is actual relative to itself.\nThe actual one, on the world story view, is the one all of whose\nmembers are true. But if this is what actuality for worlds amounts to,\nthen assuming possible worlds are possibly actual, it would follow\nthat for each possible world all its members could be true together.\nOught we to deny that possible worlds are possibly actual?\n\nThe conceptualist might hope to avoid these problems, without falling\nback on Lewis’s concrete realism about possible worlds, by\nunderstanding worlds in terms of properties or states of affairs,\nrather than propositions. Following Stalnaker (1976), one might think\nof worlds as properties which are ways things could have been.\nFollowing Plantinga (1974) and others, one might think of worlds as\nmaximal consistent states of affairs, where these are thought of as\ndistinct from propositions.\n\nHowever, this retrenchment may end up only shifting the Platonist\nworries elsewhere. To distinguish the ways that are possible\nworlds (or possible world-states) from those which are not, it is\ndifficult to avoid appealing to a gloss in terms of being possibly\ninstantiated: the possible worlds are not only maximal but they could\nbe instantiated. Taking this line would require conceding that in\nevery world there are properties. Something similar holds for the\nconception of possible worlds as maximal consistent states of\naffairs.\n\nOne might think, however, that Platonism about properties is less\nproblematic than Platonism about propositions. The former do not\nrepresent the world, whereas the latter, as truth-bearers, do (Jubien\n2001, King 2007). However, properties can apply or fail to apply to\nobjects, and can be said to be true or false of objects, and so it is\nnot clear that worries about representation clearly gain more traction\nfor propositions than for properties. Similar considerations apply to\nstates of affairs.\n\nDespite these worries, the conceptualist might be encouraged by the\nexample of singular propositions. Hasn’t the truth in vs. truth\nat distinction been useful in dealing with the modality of singular\npropositions? For example, consider any singular proposition about\nSocrates, e.g., the proposition that Socrates was a philosopher. Such\npropositions, plausibly, depend for their existence on the object they\nare directly about. One might therefore think that no singular\nproposition about Socrates could exist unless Socrates existed.\nConsider, then, the proposition that Socrates does not exist. It is\nclearly contingent that Socrates exists; things could have been\notherwise. But then the proposition that Socrates does not exist would\nappear to be possible without being possibly true. Unlike the examples\nfrom Pollock and Buridan, however, we cannot understand such\npossibility without possible truth in terms of expressing a possibly\ntrue proposition while not being possibly true itself. Propositions do\nnot express propositions, of course, and so we cannot understand their\npossibility without possible truth in this way (Plantinga 1981). What\nis it, then, for such a singular proposition to be possible but not\npossibly true? Answering this question was one of the key motivations\nin the development of the distinction between truth in and truth at a\nworld. But while Adams and others attempted to do this by thinking of\ntruth at a world as determined by what is true in that world together\nwith a certain set of facts about the actual world, the conceptualist\nhopes to kick aside the ladder of truth in a world altogether. Whether\nthis hope is reasonable or not is an important issue in contemporary\nwork on propositions. (Key recent discussions include King 2007,\nSoames 2010, and Merricks 2015).\n",
    "section_title": "7.2 Reply #1: Truth in a World vs. Truth at a World",
    "entry_title": "Propositions",
    "hierarchy_title": "Propositions || The Nature and Status of Propositions || Reply #1: Truth in a World vs. Truth at a World",
    "tokenized_text": [
        "nature",
        "status",
        "proposition",
        "reply",
        "truth",
        "world",
        "vs",
        "truth",
        "world",
        "reply",
        "truth",
        "world",
        "vs",
        "truth",
        "world",
        "easy",
        "argument",
        "rely",
        "assumption",
        "entailment",
        "truth",
        "namely",
        "assumption",
        "proposition",
        "ltb",
        "pgtb",
        "fails",
        "entail",
        "proposition",
        "ltb",
        "qgtb",
        "possible",
        "ltb",
        "pgtb",
        "true",
        "not",
        "q",
        "assumption",
        "needed",
        "reason",
        "premise",
        "proposition",
        "failing",
        "entail",
        "proposition",
        "mental",
        "state",
        "concrete",
        "entity",
        "possible",
        "truth",
        "proposition",
        "absence",
        "mental",
        "state",
        "concrete",
        "entity",
        "could",
        "fail",
        "proposition",
        "fails",
        "entail",
        "q",
        "follow",
        "possible",
        "world",
        "former",
        "true",
        "not",
        "q",
        "philosopher",
        "pollock",
        "king",
        "argued",
        "principle",
        "like",
        "two",
        "reading",
        "one",
        "clearly",
        "acceptable",
        "useless",
        "easy",
        "argument",
        "useful",
        "argument",
        "false",
        "two",
        "reading",
        "correspond",
        "two",
        "way",
        "understanding",
        "talk",
        "truth",
        "respect",
        "possible",
        "world",
        "one",
        "way",
        "something",
        "true",
        "respect",
        "world",
        "requires",
        "truthbearer",
        "exist",
        "world",
        "true",
        "another",
        "way",
        "truthbearer",
        "correctly",
        "describe",
        "world",
        "require",
        "existing",
        "world",
        "pollock",
        "give",
        "example",
        "picture",
        "depicting",
        "nonexistence",
        "picture",
        "picture",
        "could",
        "correctly",
        "depict",
        "situation",
        "even",
        "though",
        "situation",
        "depicts",
        "one",
        "picture",
        "exist",
        "similarly",
        "medieval",
        "philosopher",
        "jean",
        "buridan",
        "discus",
        "example",
        "utterance",
        "negative",
        "utterance",
        "utterance",
        "correctly",
        "describes",
        "certain",
        "possible",
        "situation",
        "even",
        "though",
        "situation",
        "one",
        "utterance",
        "would",
        "exist",
        "following",
        "adam",
        "may",
        "call",
        "former",
        "way",
        "true",
        "respect",
        "world",
        "truth",
        "world",
        "latter",
        "truth",
        "world",
        "conceptualist",
        "may",
        "claim",
        "proposition",
        "true",
        "world",
        "without",
        "true",
        "analogy",
        "example",
        "pollock",
        "buridan",
        "proposition",
        "like",
        "ltb",
        "propositions",
        "gtb",
        "true",
        "certain",
        "possible",
        "world",
        "true",
        "none",
        "since",
        "want",
        "say",
        "proposition",
        "necessary",
        "must",
        "understand",
        "necessity",
        "truth",
        "every",
        "possible",
        "world",
        "correspondingly",
        "preserve",
        "connection",
        "entailment",
        "necessity",
        "must",
        "understand",
        "entailment",
        "term",
        "entailed",
        "proposition",
        "true",
        "every",
        "world",
        "entailing",
        "proposition",
        "true",
        "given",
        "distinguish",
        "two",
        "reading",
        "assumption",
        "reading",
        "proposition",
        "ltb",
        "pgtb",
        "fails",
        "entail",
        "proposition",
        "ltb",
        "qgtb",
        "possible",
        "world",
        "w",
        "ltb",
        "pgtb",
        "true",
        "w",
        "not",
        "q",
        "w",
        "reading",
        "proposition",
        "ltb",
        "pgtb",
        "fails",
        "entail",
        "proposition",
        "ltb",
        "qgtb",
        "possible",
        "world",
        "w",
        "ltb",
        "pgtb",
        "true",
        "w",
        "not",
        "q",
        "w",
        "given",
        "understanding",
        "entailment",
        "term",
        "truth",
        "world",
        "conceptualist",
        "claim",
        "reading",
        "false",
        "reading",
        "true",
        "useless",
        "easy",
        "argument",
        "thus",
        "conclusion",
        "argument",
        "blocked",
        "plausibility",
        "response",
        "depends",
        "good",
        "account",
        "truth",
        "world",
        "amount",
        "turn",
        "depends",
        "issue",
        "metaphysics",
        "modality",
        "world",
        "concrete",
        "particular",
        "surroundings",
        "david",
        "lewis",
        "could",
        "say",
        "proposition",
        "true",
        "world",
        "proposition",
        "entity",
        "part",
        "world",
        "true",
        "true",
        "world",
        "true",
        "world",
        "also",
        "part",
        "world",
        "may",
        "well",
        "difficulty",
        "explaining",
        "proposition",
        "could",
        "part",
        "one",
        "concrete",
        "world",
        "would",
        "part",
        "concrete",
        "world",
        "framework",
        "seems",
        "make",
        "conceptual",
        "room",
        "possibility",
        "proposition",
        "true",
        "world",
        "without",
        "true",
        "suppose",
        "however",
        "world",
        "conceived",
        "world",
        "story",
        "ie",
        "maximal",
        "consistent",
        "set",
        "proposition",
        "see",
        "section",
        "might",
        "truth",
        "world",
        "understood",
        "one",
        "approach",
        "favored",
        "adam",
        "explain",
        "truth",
        "world",
        "term",
        "truth",
        "world",
        "understanding",
        "latter",
        "amount",
        "truth",
        "world",
        "actual",
        "member",
        "true",
        "approach",
        "would",
        "understand",
        "true",
        "world",
        "term",
        "true",
        "together",
        "certain",
        "fact",
        "actual",
        "world",
        "however",
        "conceptualist",
        "abide",
        "approach",
        "approach",
        "member",
        "world",
        "true",
        "world",
        "since",
        "member",
        "every",
        "world",
        "proposition",
        "would",
        "follow",
        "contrary",
        "conceptualism",
        "necessary",
        "proposition",
        "conceptualistfriendly",
        "approach",
        "reverse",
        "order",
        "explanation",
        "explain",
        "truth",
        "world",
        "term",
        "truth",
        "world",
        "existence",
        "world",
        "could",
        "truth",
        "world",
        "understood",
        "natural",
        "proposal",
        "understand",
        "membership",
        "world",
        "story",
        "difficulty",
        "emerge",
        "proposal",
        "face",
        "question",
        "understand",
        "consistency",
        "world",
        "story",
        "maximal",
        "set",
        "proposition",
        "possible",
        "world",
        "consistent",
        "relevant",
        "sense",
        "relevant",
        "sense",
        "easily",
        "defined",
        "following",
        "adam",
        "might",
        "wish",
        "use",
        "concept",
        "possibility",
        "gloss",
        "notion",
        "consistency",
        "set",
        "proposition",
        "consistent",
        "proposition",
        "could",
        "true",
        "together",
        "return",
        "u",
        "problem",
        "noted",
        "previous",
        "paragraph",
        "would",
        "turn",
        "necessarily",
        "proposition",
        "even",
        "mindless",
        "world",
        "conceptualist",
        "might",
        "hope",
        "take",
        "relevant",
        "notion",
        "consistency",
        "primitive",
        "reject",
        "gloss",
        "term",
        "joint",
        "possible",
        "truth",
        "still",
        "ask",
        "broader",
        "implication",
        "denying",
        "joint",
        "possible",
        "truth",
        "consistent",
        "world",
        "story",
        "consider",
        "instance",
        "notion",
        "actuality",
        "one",
        "many",
        "possible",
        "world",
        "actual",
        "although",
        "actual",
        "relative",
        "actual",
        "one",
        "world",
        "story",
        "view",
        "one",
        "whose",
        "member",
        "true",
        "actuality",
        "world",
        "amount",
        "assuming",
        "possible",
        "world",
        "possibly",
        "actual",
        "would",
        "follow",
        "possible",
        "world",
        "member",
        "could",
        "true",
        "together",
        "ought",
        "deny",
        "possible",
        "world",
        "possibly",
        "actual",
        "conceptualist",
        "might",
        "hope",
        "avoid",
        "problem",
        "without",
        "falling",
        "back",
        "lewis",
        "concrete",
        "realism",
        "possible",
        "world",
        "understanding",
        "world",
        "term",
        "property",
        "state",
        "affair",
        "rather",
        "proposition",
        "following",
        "stalnaker",
        "one",
        "might",
        "think",
        "world",
        "property",
        "way",
        "thing",
        "could",
        "following",
        "plantinga",
        "others",
        "one",
        "might",
        "think",
        "world",
        "maximal",
        "consistent",
        "state",
        "affair",
        "thought",
        "distinct",
        "proposition",
        "however",
        "retrenchment",
        "may",
        "end",
        "shifting",
        "platonist",
        "worry",
        "elsewhere",
        "distinguish",
        "way",
        "possible",
        "world",
        "possible",
        "worldstates",
        "difficult",
        "avoid",
        "appealing",
        "gloss",
        "term",
        "possibly",
        "instantiated",
        "possible",
        "world",
        "maximal",
        "could",
        "instantiated",
        "taking",
        "line",
        "would",
        "require",
        "conceding",
        "every",
        "world",
        "property",
        "something",
        "similar",
        "hold",
        "conception",
        "possible",
        "world",
        "maximal",
        "consistent",
        "state",
        "affair",
        "one",
        "might",
        "think",
        "however",
        "platonism",
        "property",
        "le",
        "problematic",
        "platonism",
        "proposition",
        "former",
        "represent",
        "world",
        "whereas",
        "latter",
        "truthbearers",
        "jubien",
        "king",
        "however",
        "property",
        "apply",
        "fail",
        "apply",
        "object",
        "said",
        "true",
        "false",
        "object",
        "clear",
        "worry",
        "representation",
        "clearly",
        "gain",
        "traction",
        "proposition",
        "property",
        "similar",
        "consideration",
        "apply",
        "state",
        "affair",
        "despite",
        "worry",
        "conceptualist",
        "might",
        "encouraged",
        "example",
        "singular",
        "proposition",
        "truth",
        "vs",
        "truth",
        "distinction",
        "useful",
        "dealing",
        "modality",
        "singular",
        "proposition",
        "example",
        "consider",
        "singular",
        "proposition",
        "socrates",
        "eg",
        "proposition",
        "socrates",
        "philosopher",
        "proposition",
        "plausibly",
        "depend",
        "existence",
        "object",
        "directly",
        "one",
        "might",
        "therefore",
        "think",
        "singular",
        "proposition",
        "socrates",
        "could",
        "exist",
        "unless",
        "socrates",
        "existed",
        "consider",
        "proposition",
        "socrates",
        "exist",
        "clearly",
        "contingent",
        "socrates",
        "exists",
        "thing",
        "could",
        "otherwise",
        "proposition",
        "socrates",
        "exist",
        "would",
        "appear",
        "possible",
        "without",
        "possibly",
        "true",
        "unlike",
        "example",
        "pollock",
        "buridan",
        "however",
        "understand",
        "possibility",
        "without",
        "possible",
        "truth",
        "term",
        "expressing",
        "possibly",
        "true",
        "proposition",
        "possibly",
        "true",
        "proposition",
        "express",
        "proposition",
        "course",
        "understand",
        "possibility",
        "without",
        "possible",
        "truth",
        "way",
        "plantinga",
        "singular",
        "proposition",
        "possible",
        "possibly",
        "true",
        "answering",
        "question",
        "one",
        "key",
        "motivation",
        "development",
        "distinction",
        "truth",
        "truth",
        "world",
        "adam",
        "others",
        "attempted",
        "thinking",
        "truth",
        "world",
        "determined",
        "true",
        "world",
        "together",
        "certain",
        "set",
        "fact",
        "actual",
        "world",
        "conceptualist",
        "hope",
        "kick",
        "aside",
        "ladder",
        "truth",
        "world",
        "altogether",
        "whether",
        "hope",
        "reasonable",
        "important",
        "issue",
        "contemporary",
        "work",
        "proposition",
        "key",
        "recent",
        "discussion",
        "include",
        "king",
        "soames",
        "merricks"
    ]
}