{
    "main_text": "Is Property a Philosophical Issue?\n3. Is Property a Philosophical Issue?\n\nWhat is it about property that engages the interest of philosophers?\nWhy should philosophers be interested in property?\n\nSome have suggested that they need not be. John Rawls argued that\nquestions about the system of ownership are secondary or derivative\nquestions, to be dealt with pragmatically rather than as issues in\npolitical philosophy (Rawls 1999, pp. 235–42). Although every society\nhas to decide whether the economy will be organized on the basis of\nmarkets and private ownership or on the basis of central collective\ncontrol, there was little that philosophers could contribute to these\ndebates. Philosophers, Rawls said, are better off discussing the\nabstract principles of justice that should constrain the establishment\nof any social institutions, than trying to settle a\npriori questions of social and economic strategy. His own\nsuggestions favoring the institutions of ‘a property-owning\ndemocracy’ are put forward more as intermediate principles than\nas fundamentals of justice.\n\nOn the other hand, with the growing attention that is being paid in\nthe discipline to public policy generally, it is difficult to deny\nthat questions about property can be posed in terms that are abstract\nenough for philosophers to address. Though Rawls counsels us to talk\nabout justice rather than property, in fact issues about property are\ninevitably implicated in some of the issues about justice that have\npreoccupied political philosophers in recent years. Certain property\ninstitutions may be better than others for justice. A system of\nmarkets and private property covering all or most of the resources in\nsociety will make it very difficult to ensure the steady application\nof principles like equality, distribution according to need, or even\nas some have argued—see e.g., Hayek 1976—distribution\naccording to desert. Some have argued that property rights in a market\neconomy ought to be treated as resistant to redistribution and perhaps\nas insensitive to distributive justice generally except possibly at\nthe moment of their initial allocation (see Nozick, 1974). If we take\nthis view and if we also take distributive issues seriously, we may\nhave to commit ourselves to a compromised or eclectic system rather\nthan a pure market system of private property.\n\nWhat about the ownership relation itself? Is there any inherent\nphilosophical interest in the nature of a person’s relation to\nmaterial resources? When someone says ‘X is mine’\nand X is an action, we see interesting questions about\nintentionality, free-will, and responsibility, which philosophers will\nwant to pursue. Or when someone says ‘X belongs to\nperson P,’ and X is an event, memory, or\nexperience, there are interesting questions about personal identity.\nBut when X is an apple or a piece of land or an automobile,\nthere does not appear to be any question of an inherent\nrelation between X and P which might arouse our\ninterest.\n\nThis was one of David Hume’s conclusions. There is nothing natural\nabout private property, wrote Hume. The ‘contrariety’ of\nour passions and the ‘looseness and easy transition [of material\nobjects] from one person to another’ mean that any situation in\nwhich I hold or use a resource is always vulnerable to disruption\n(Hume 1978 [1739], p. 488). Until possession is stabilized by social\nrules, there is no secure relation between person and thing. We may\nthink that there ought to be: we may think, for example, that a person\nhas a moral right to something that he has made and that society has\nan obligation to give legal backing to this moral right. But according\nto Hume, we have to ask what it is in general for society to set up\nand enforce rules of this kind, before we can reach any conclusions\nabout the normative significance of the relation between any\nparticular person and any particular thing.\n\nOur property is nothing but those goods, whose constant possession is\nestablish’d by the laws of society; that is, by the laws of justice.\nThose, therefore, who make use of the words property, or right, or\nobligation, before they have explain’d the origin of justice, or even\nmake use of them in that explication, are guilty of a very gross\nfallacy, and can never reason upon any solid foundation. A man’s\nproperty is some object related to him. This relation is not natural,\nbut moral, and founded on justice. Tis very preposterous, therefore,\nto imagine, that we can have any idea of property, without fully\ncomprehending the nature of justice, and shewing its origin in the\nartifice and contrivance of man. The origin of justice explains that\nof property. The same artifice gives rise to both. (ibid., p. 491)\n\n\nThe Humean view of property as a convention has been taken up by\nMurphy and Nagel (2004) as a basis for resisting the view, associated\nwith Nozick 1974, that property rights can pose any moral obstacle to\nprograms of tax and transfer or other forms of redistribution and\nsocial control. But the fact that something is conventional\ndoesn’t mean it can safely be treated as malleable or as\nsomething that can be overridden without cost. There is always a\nfurther question about the moral reasons that there are for holding\nconventions steady; and these reasons may actually echo other themes\nin the property debate.\n\nBefore Hume, the view that the issue of property begged questions\nabout the general basis of social organization was already\nforeshadowed in the political philosophy of Thomas Hobbes. Indeed\nHobbes regarded property as the key to political philosophy:\n‘[M]y first enquiry was to be from whence it proceeded, that any\nman should call any thing rather his Owne, th[a]n another\nmans’ (Hobbes 1983 [1647], pp. 26–7). For Hobbes, property\nrules were the product of authority—the acknowledged authority\nof a sovereign, whose commands could guarantee the peace and make it\nsafe for men to embark on social and economic activities that\noutstripped their ability to protect themselves using their own\nindividual strength. Hume, by contrast, was interested in the\npossibility that the relevant settlement might emerge as conventions\nfrom ordinary human interactions rather than as impositions by an\nacknowledged figure in authority (Hume 1978 [1739], p.\n490).[3]\n\nStill even if we concede that property is the product of social rules,\nand that normative thinking about the former must be preceded by\nnormative thinking about the latter, there might be facts about the\nhuman condition or our agency as embodied beings that provide\nphilosophical premises for an argument that property relations should\nbe established in one way rather than another. Clearly, there is at\nleast one material object with which a person does seem to have an\nintimate pre-legal relation that would bear some philosophical\nanalysis—namely, that person’s body. We are embodied beings and\nto a certain extent the use and control of our limbs, sensory organs\netc. is indispensable for our agency. Were a person to be deprived of\nthis control—were others to have the right to block or\nmanipulate the movements of his physical body—then his agency\nwould be truncated, and he would be incapable of using his powers of\nintention and action to make something he (and others) could regard as\na life for himself. Some modern authors, following John Locke, have\ntried to think about this in terms of an idea of self-ownership.\nAccording to G.A. Cohen (1995) a person owns himself when he has all\nthe control over his own body that a master would have over him were\nhe a slave. Now since a master is entitled to make comprehensive use\nof his slave for his own profit without owing any account or any\ncontribution to anyone else, it seems to follow from the idea of\nself-ownership that a person must be allowed to profit equally\ncomprehensively from the control of his own mental and bodily\nresources. Taking his cue from Nozick (1974) that taxation on earnings\nis a form of coerced labor (for others or for the state), Cohen\nconcludes that various egalitarian arrangements (like welfare paid for\nout of taxation) are incompatible with the self-ownership of the rich.\nIt looks like we have to choose between principles of equality and\nprinciples of self-ownership. Debate on this issue continues (Otsuka\n1998, Vrousalis 2011, and Sobel 2012): some argue that what we owe to\nothers must be figured out first before there can be any question of\nowning either our selves, our bodies, or other material resources;\nwhile others say that any attempt to make the argument in that order\nwill lead to counter-intuitive results (Nozick 1974, p. 234). Some\nrecent discussions have called into question the very idea of\nself-ownership (Rasmussen 2008 and Phillips 2013), denying that this\nconcept is necessary in order to capture the inviolability of the\nhuman person.\n\nThere is a further question whether self-ownership affords a basis for\nthinking about property in external objects other than my body? John\nLocke thought that it did (Locke 1988 [1689], II, para. 27). He\nsuggested that when I work on an object or cultivate a piece of land,\nI project something of my self-owned self into the thing. That\nsomething I have worked on embodies a part of me is a common enough\nsentiment, but it is difficult to give it a analytically precise\nsense. That an object is shaped the way it is may be an effect of my\nactions; but actions don’t seem to have the trans-temporal endurance\nto enable us to say that they remain present in the object\nafter the time of their performance. The idea of mixing one’s labor\nseems to be a piece of rhetoric which enhances other arguments for\nprivate property rather than an argument in its own right.\n\nOthers have speculated about an effect in the opposite\ndirection—not so much the incorporation of the self into the\nobject as the incorporation of the thing into the self (Radin 1982).\nThis was a theme in Hegel’s work, where there was a suggestion that\nowning property helped the individual to ‘supersede the mere\nsubjectivity of personality’ (Hegel [1821] 1991, 73); in plain\nEnglish, it gave them the opportunity to make concrete the plans and\nschemes that would otherwise just buzz around inside their heads, and\nto take responsibility for their intentions as the material they were\nworking on—a home or an sculptor’s block of\nmarble—registered the impact of the decisions they had made (see\nWaldron 1988, pp. 343–89). Even the utilitarian Jeremy Bentham\ntoyed with a version this idea. Though property, he said, depended on\npositive law, the law of property had an effect on the self that makes\nredistribution particularly objectionable. Law provided security for\nour expectations, and when that security came to be focused on a\nparticular object, that object formed part of the structure of one’s\nagency: ‘It is hence that we have the power of forming a general\nplan of conduct; it is hence that the successive instants which\ncompose the duration of life are not like isolated and independent\npoints, but become continuous parts of a whole’ (Bentham 1931\n[1802], p. 111).\n",
    "section_title": "3. Is Property a Philosophical Issue?",
    "entry_title": "Property and Ownership",
    "hierarchy_title": "Property and Ownership || Is Property a Philosophical Issue?",
    "tokenized_text": [
        "property",
        "philosophical",
        "issue",
        "property",
        "philosophical",
        "issue",
        "property",
        "engages",
        "interest",
        "philosopher",
        "philosopher",
        "interested",
        "property",
        "suggested",
        "need",
        "john",
        "rawls",
        "argued",
        "question",
        "system",
        "ownership",
        "secondary",
        "derivative",
        "question",
        "dealt",
        "pragmatically",
        "rather",
        "issue",
        "political",
        "philosophy",
        "rawls",
        "pp",
        "although",
        "every",
        "society",
        "decide",
        "whether",
        "economy",
        "organized",
        "basis",
        "market",
        "private",
        "ownership",
        "basis",
        "central",
        "collective",
        "control",
        "little",
        "philosopher",
        "could",
        "contribute",
        "debate",
        "philosopher",
        "rawls",
        "said",
        "better",
        "discussing",
        "abstract",
        "principle",
        "justice",
        "constrain",
        "establishment",
        "social",
        "institution",
        "trying",
        "settle",
        "priori",
        "question",
        "social",
        "economic",
        "strategy",
        "suggestion",
        "favoring",
        "institution",
        "propertyowning",
        "democracy",
        "put",
        "forward",
        "intermediate",
        "principle",
        "fundamental",
        "justice",
        "hand",
        "growing",
        "attention",
        "paid",
        "discipline",
        "public",
        "policy",
        "generally",
        "difficult",
        "deny",
        "question",
        "property",
        "posed",
        "term",
        "abstract",
        "enough",
        "philosopher",
        "address",
        "though",
        "rawls",
        "counsel",
        "u",
        "talk",
        "justice",
        "rather",
        "property",
        "fact",
        "issue",
        "property",
        "inevitably",
        "implicated",
        "issue",
        "justice",
        "preoccupied",
        "political",
        "philosopher",
        "recent",
        "year",
        "certain",
        "property",
        "institution",
        "may",
        "better",
        "others",
        "justice",
        "system",
        "market",
        "private",
        "property",
        "covering",
        "resource",
        "society",
        "make",
        "difficult",
        "ensure",
        "steady",
        "application",
        "principle",
        "like",
        "equality",
        "distribution",
        "according",
        "need",
        "even",
        "arguedsee",
        "eg",
        "hayek",
        "distribution",
        "according",
        "desert",
        "argued",
        "property",
        "right",
        "market",
        "economy",
        "ought",
        "treated",
        "resistant",
        "redistribution",
        "perhaps",
        "insensitive",
        "distributive",
        "justice",
        "generally",
        "except",
        "possibly",
        "moment",
        "initial",
        "allocation",
        "see",
        "nozick",
        "take",
        "view",
        "also",
        "take",
        "distributive",
        "issue",
        "seriously",
        "may",
        "commit",
        "compromised",
        "eclectic",
        "system",
        "rather",
        "pure",
        "market",
        "system",
        "private",
        "property",
        "ownership",
        "relation",
        "inherent",
        "philosophical",
        "interest",
        "nature",
        "person",
        "relation",
        "material",
        "resource",
        "someone",
        "say",
        "x",
        "mine",
        "x",
        "action",
        "see",
        "interesting",
        "question",
        "intentionality",
        "freewill",
        "responsibility",
        "philosopher",
        "want",
        "pursue",
        "someone",
        "say",
        "x",
        "belongs",
        "person",
        "p",
        "x",
        "event",
        "memory",
        "experience",
        "interesting",
        "question",
        "personal",
        "identity",
        "x",
        "apple",
        "piece",
        "land",
        "automobile",
        "appear",
        "question",
        "inherent",
        "relation",
        "x",
        "p",
        "might",
        "arouse",
        "interest",
        "one",
        "david",
        "hume",
        "conclusion",
        "nothing",
        "natural",
        "private",
        "property",
        "wrote",
        "hume",
        "contrariety",
        "passion",
        "looseness",
        "easy",
        "transition",
        "material",
        "object",
        "one",
        "person",
        "another",
        "mean",
        "situation",
        "hold",
        "use",
        "resource",
        "always",
        "vulnerable",
        "disruption",
        "hume",
        "p",
        "possession",
        "stabilized",
        "social",
        "rule",
        "secure",
        "relation",
        "person",
        "thing",
        "may",
        "think",
        "ought",
        "may",
        "think",
        "example",
        "person",
        "moral",
        "right",
        "something",
        "made",
        "society",
        "obligation",
        "give",
        "legal",
        "backing",
        "moral",
        "right",
        "according",
        "hume",
        "ask",
        "general",
        "society",
        "set",
        "enforce",
        "rule",
        "kind",
        "reach",
        "conclusion",
        "normative",
        "significance",
        "relation",
        "particular",
        "person",
        "particular",
        "thing",
        "property",
        "nothing",
        "good",
        "whose",
        "constant",
        "possession",
        "establish",
        "law",
        "society",
        "law",
        "justice",
        "therefore",
        "make",
        "use",
        "word",
        "property",
        "right",
        "obligation",
        "explain",
        "origin",
        "justice",
        "even",
        "make",
        "use",
        "explication",
        "guilty",
        "gross",
        "fallacy",
        "never",
        "reason",
        "upon",
        "solid",
        "foundation",
        "man",
        "property",
        "object",
        "related",
        "relation",
        "natural",
        "moral",
        "founded",
        "justice",
        "ti",
        "preposterous",
        "therefore",
        "imagine",
        "idea",
        "property",
        "without",
        "fully",
        "comprehending",
        "nature",
        "justice",
        "shewing",
        "origin",
        "artifice",
        "contrivance",
        "man",
        "origin",
        "justice",
        "explains",
        "property",
        "artifice",
        "give",
        "rise",
        "ibid",
        "p",
        "humean",
        "view",
        "property",
        "convention",
        "taken",
        "murphy",
        "nagel",
        "basis",
        "resisting",
        "view",
        "associated",
        "nozick",
        "property",
        "right",
        "pose",
        "moral",
        "obstacle",
        "program",
        "tax",
        "transfer",
        "form",
        "redistribution",
        "social",
        "control",
        "fact",
        "something",
        "conventional",
        "mean",
        "safely",
        "treated",
        "malleable",
        "something",
        "overridden",
        "without",
        "cost",
        "always",
        "question",
        "moral",
        "reason",
        "holding",
        "convention",
        "steady",
        "reason",
        "may",
        "actually",
        "echo",
        "theme",
        "property",
        "debate",
        "hume",
        "view",
        "issue",
        "property",
        "begged",
        "question",
        "general",
        "basis",
        "social",
        "organization",
        "already",
        "foreshadowed",
        "political",
        "philosophy",
        "thomas",
        "hobbes",
        "indeed",
        "hobbes",
        "regarded",
        "property",
        "key",
        "political",
        "philosophy",
        "first",
        "enquiry",
        "whence",
        "proceeded",
        "man",
        "call",
        "thing",
        "rather",
        "owne",
        "th",
        "n",
        "another",
        "man",
        "hobbes",
        "pp",
        "hobbes",
        "property",
        "rule",
        "product",
        "authoritythe",
        "acknowledged",
        "authority",
        "sovereign",
        "whose",
        "command",
        "could",
        "guarantee",
        "peace",
        "make",
        "safe",
        "men",
        "embark",
        "social",
        "economic",
        "activity",
        "outstripped",
        "ability",
        "protect",
        "using",
        "individual",
        "strength",
        "hume",
        "contrast",
        "interested",
        "possibility",
        "relevant",
        "settlement",
        "might",
        "emerge",
        "convention",
        "ordinary",
        "human",
        "interaction",
        "rather",
        "imposition",
        "acknowledged",
        "figure",
        "authority",
        "hume",
        "p",
        "still",
        "even",
        "concede",
        "property",
        "product",
        "social",
        "rule",
        "normative",
        "thinking",
        "former",
        "must",
        "preceded",
        "normative",
        "thinking",
        "latter",
        "might",
        "fact",
        "human",
        "condition",
        "agency",
        "embodied",
        "being",
        "provide",
        "philosophical",
        "premise",
        "argument",
        "property",
        "relation",
        "established",
        "one",
        "way",
        "rather",
        "another",
        "clearly",
        "least",
        "one",
        "material",
        "object",
        "person",
        "seem",
        "intimate",
        "prelegal",
        "relation",
        "would",
        "bear",
        "philosophical",
        "analysisnamely",
        "person",
        "body",
        "embodied",
        "being",
        "certain",
        "extent",
        "use",
        "control",
        "limb",
        "sensory",
        "organ",
        "etc",
        "indispensable",
        "agency",
        "person",
        "deprived",
        "controlwere",
        "others",
        "right",
        "block",
        "manipulate",
        "movement",
        "physical",
        "bodythen",
        "agency",
        "would",
        "truncated",
        "would",
        "incapable",
        "using",
        "power",
        "intention",
        "action",
        "make",
        "something",
        "others",
        "could",
        "regard",
        "life",
        "modern",
        "author",
        "following",
        "john",
        "locke",
        "tried",
        "think",
        "term",
        "idea",
        "selfownership",
        "according",
        "ga",
        "cohen",
        "person",
        "owns",
        "control",
        "body",
        "master",
        "would",
        "slave",
        "since",
        "master",
        "entitled",
        "make",
        "comprehensive",
        "use",
        "slave",
        "profit",
        "without",
        "owing",
        "account",
        "contribution",
        "anyone",
        "else",
        "seems",
        "follow",
        "idea",
        "selfownership",
        "person",
        "must",
        "allowed",
        "profit",
        "equally",
        "comprehensively",
        "control",
        "mental",
        "bodily",
        "resource",
        "taking",
        "cue",
        "nozick",
        "taxation",
        "earnings",
        "form",
        "coerced",
        "labor",
        "others",
        "state",
        "cohen",
        "concludes",
        "various",
        "egalitarian",
        "arrangement",
        "like",
        "welfare",
        "paid",
        "taxation",
        "incompatible",
        "selfownership",
        "rich",
        "look",
        "like",
        "choose",
        "principle",
        "equality",
        "principle",
        "selfownership",
        "debate",
        "issue",
        "continues",
        "otsuka",
        "vrousalis",
        "sobel",
        "argue",
        "owe",
        "others",
        "must",
        "figured",
        "first",
        "question",
        "owning",
        "either",
        "self",
        "body",
        "material",
        "resource",
        "others",
        "say",
        "attempt",
        "make",
        "argument",
        "order",
        "lead",
        "counterintuitive",
        "result",
        "nozick",
        "p",
        "recent",
        "discussion",
        "called",
        "question",
        "idea",
        "selfownership",
        "rasmussen",
        "phillips",
        "denying",
        "concept",
        "necessary",
        "order",
        "capture",
        "inviolability",
        "human",
        "person",
        "question",
        "whether",
        "selfownership",
        "affords",
        "basis",
        "thinking",
        "property",
        "external",
        "object",
        "body",
        "john",
        "locke",
        "thought",
        "locke",
        "ii",
        "para",
        "suggested",
        "work",
        "object",
        "cultivate",
        "piece",
        "land",
        "project",
        "something",
        "selfowned",
        "self",
        "thing",
        "something",
        "worked",
        "embodies",
        "part",
        "common",
        "enough",
        "sentiment",
        "difficult",
        "give",
        "analytically",
        "precise",
        "sense",
        "object",
        "shaped",
        "way",
        "may",
        "effect",
        "action",
        "action",
        "seem",
        "transtemporal",
        "endurance",
        "enable",
        "u",
        "say",
        "remain",
        "present",
        "object",
        "time",
        "performance",
        "idea",
        "mixing",
        "one",
        "labor",
        "seems",
        "piece",
        "rhetoric",
        "enhances",
        "argument",
        "private",
        "property",
        "rather",
        "argument",
        "right",
        "others",
        "speculated",
        "effect",
        "opposite",
        "directionnot",
        "much",
        "incorporation",
        "self",
        "object",
        "incorporation",
        "thing",
        "self",
        "radin",
        "theme",
        "hegel",
        "work",
        "suggestion",
        "owning",
        "property",
        "helped",
        "individual",
        "supersede",
        "mere",
        "subjectivity",
        "personality",
        "hegel",
        "plain",
        "english",
        "gave",
        "opportunity",
        "make",
        "concrete",
        "plan",
        "scheme",
        "would",
        "otherwise",
        "buzz",
        "around",
        "inside",
        "head",
        "take",
        "responsibility",
        "intention",
        "material",
        "working",
        "ona",
        "home",
        "sculptor",
        "block",
        "marbleregistered",
        "impact",
        "decision",
        "made",
        "see",
        "waldron",
        "pp",
        "even",
        "utilitarian",
        "jeremy",
        "bentham",
        "toyed",
        "version",
        "idea",
        "though",
        "property",
        "said",
        "depended",
        "positive",
        "law",
        "law",
        "property",
        "effect",
        "self",
        "make",
        "redistribution",
        "particularly",
        "objectionable",
        "law",
        "provided",
        "security",
        "expectation",
        "security",
        "came",
        "focused",
        "particular",
        "object",
        "object",
        "formed",
        "part",
        "structure",
        "one",
        "agency",
        "hence",
        "power",
        "forming",
        "general",
        "plan",
        "conduct",
        "hence",
        "successive",
        "instant",
        "compose",
        "duration",
        "life",
        "like",
        "isolated",
        "independent",
        "point",
        "become",
        "continuous",
        "part",
        "whole",
        "bentham",
        "p"
    ]
}