{
    "main_text": "Historical Overview\n2. Historical Overview\n\nThere are extensive discussions of property in the writings of Plato,\nAristotle, Aquinas, Hegel, Hobbes, Locke, Hume, Kant, Marx, and Mill.\nThe range of justificatory themes they consider is very broad, and I\nshall begin with a summary.\n\nThe ancient authors speculated about the relation between property and\nvirtue, a natural subject for discussion since justifying private\nproperty raises serious questions about the legitimacy of\nself-interested activity. Plato (Republic, 462b-c) argued\nthat collective ownership was necessary to promote common pursuit of\nthe common interest, and to avoid the social divisiveness that would\noccur ‘when some grieve exceedingly and others rejoice at the\nsame happenings.’ Aristotle responded by arguing that private\nownership promotes virtues like prudence and responsibility:\n‘[W]hen everyone has a distinct interest, men will not complain\nof one another, and they will make more progress, because every one\nwill be attending to his own business’ (Aristotle,\nPolitics, 1263a). Even altruism, said Aristotle, might be\nbetter promoted by focusing ethical attention on the way a person\nexercises his rights of private property rather than\nquestioning the institution itself (ibid.). Aristotle also reflected\non the relation between property and freedom, and the contribution\nthat ownership makes to a person’s being a free man and thus suitable\nfor citizenship. The Greeks took liberty to be a status defined by\ncontrast with slavery, and for Aristotle, to be free was to belong to\noneself, to be one’s own man, whereas the slave was by nature the\nproperty of another. Self-possession was connected with having\nsufficient distance from one’s desires to enable the practice of\nvirtuous self-control. On this account, the natural slave was unfree\nbecause his reason could not prescribe a rule to his bodily appetites.\nAristotle had no hesitation in extending this point beyond slavery to\nthe conditions of ‘the meaner sort of workman.’ Obsessed\nwith need, the poor are ‘too degraded’ to participate in\npolitics like free men. ‘You could no more make a city out of\npaupers,’ wrote Aristotle, ‘than out of slaves’\n(ibid., 1278a). They must be ruled like slaves, for otherwise their\npressing and immediate needs will issue in envy and violence. Some of\nthese themes have emerged more recently in civic republican theories,\nthough modern theories of citizenship tend to begin with a sense of\nwho should be citizens (all adult residents) and then proceed to argue\nthat they should all have property, rather than using existing wealth\nas an independent criterion for the franchise (King and Waldron\n1988).\n\nIn the medieval period, Thomas Aquinas continued discussion of the\nAristotlean idea that virtue might be expressed in the use that one\nmakes of one’s property. But Aquinas gave it a sharper edge. Not only\ndo the rich have moral obligations to act generously, but the poor\nalso have rights against the rich. Beginning from the premise that\n‘[a]ccording to the natural order established by Divine\nProvidence, inferior things are ordained for the purpose of succoring\nman’s needs…’ (Aquinas ST, p. 72), Aquinas\nargued that no division of resources based on human law can prevail\nover the necessities associated with destitution. This is a theme\nwhich recurs throughout our tradition—most notably in Locke’s\nFirst Treatise on Government, (Locke 1988 [1689], I, para.\n42)—as an essential qualification of whatever else is said about\nthe legitimacy of private property (Horne 1990).\n\nIn the early modern period, philosophers turned their attention to the\nway in which property might have been instituted, with Hobbes and Hume\narguing that there is no natural ‘mine’ or\n‘thine,’ and that property must be understood as the\ncreation of the sovereign state (Hobbes 1983 [1647]) or at the very\nleast the artificial product of a convention ‘enter’d into by\nall the members of the society to bestow stability on the possession\nof…external goods, and leave every one in the peaceable\nenjoyment of what he may acquire by his fortune and industry’\n(Hume 1978 [1739], p. 489). John Locke (1988 [1689]), on the other\nhand, was adamant that property could have been instituted in a state\nof nature without any special conventions or political decisions.\n\nLocke’s theory is widely regarded as the most interesting of the\ncanonical discussions of property. In part this is a result of how he\nbegan his account; because he took as his starting point that God gave\nthe world to men in common, he had to acknowledge from the outset that\nprivate entitlements pose a moral problem. How do we move from a\ncommon endowment to the ‘disproportionate and unequal Possession\nof the Earth’ that seems to go along with private property?\nUnlike some of his predecessors, Locke did not base his resolution of\nthis difficulty on any theory of universal (even tacit) consent.\nInstead, in the most famous passage of his chapter on property, he\ngave a moral defense of the legitimacy of unilateral\nappropriation.\n\nThough the Earth…be common to all Men, yet every Man has a\nProperty in his own Person. This no Body has any Right to but himself.\nThe Labour of his Body, and the Work of his Hands, we may say, are\nproperly his. Whatsoever then he removes out of the State that Nature\nhath provided, and left it in, he hath mixed his Labour with, and\njoyned to it something that is his own, and thereby makes it his\nProperty. It being by him removed from the common state Nature placed\nit in, it hath by this labour something annexed to it, that excludes\nthe common right of other Men. (Locke 1988 [1689], II, para. 27)\n\n\nThe interest of Locke’s account lies in the way he combines the\nstructure of a theory of first occupancy with an account of the\nsubstantive moral significance of labor. In the hands of writers like\nSamuel Pufendorf (1991 [1673], p. 84), First Occupancy theory\nproceeded on the basis that the first human user of a natural\nresource—a piece of land, for example—is distinguished\nfrom all others in that he did not have to displace anyone else in\norder to take possession. It did not particularly matter how\nhe took possession of it, or what sort of use he made of it: what\nmattered was that he began acting as its owner without dispossessing\nanyone else. Now although Locke used the logic of this account, it\ndid matter for him that the land was cultivated or in some\nother way used productively. (For this reason, he expressed doubts\nwhether indigenous hunters or nomadic peoples could properly be\nregarded as owners of the land over which they roamed.) This is partly\nbecause Locke identified the ownership of labor as something connected\nsubstantially to the primal ownership of self. But it was also because\nhe thought the productivity of labor would help answer some of the\ndifficulties which he saw in First Occupancy theory. Though the first\noccupier does not actually dispossess anyone, still his acquisition\nmay prejudice other’s interests if there is not, in Locke’s words,\n‘enough and as good left in common’ for them to enjoy\n(Locke 1988 [1689], II, para. 27). Locke’s answer to this difficulty\nwas to emphasize that appropriation by productive labor\nactually increased the amount of goods available in society for others\n(ibid., II, para. 37). There is also something like a strand of moral\ndesert in Locke’s theory: if one person fails to take advantage\nof an opportunity of resource-use or resource development, can that\nperson really complain or demand compensation when the opportunity is\ntaken up by someone else (de Jasay 2004)?\n\nImmanuel Kant’s work on property is more formal and abstract than\nLocke’s and—at least until recently-it was less\nwell-known. (But now see Byrd and Hruschka 2006 and Ripstein 2009.)\nKant began by emphasizing a general connection between property and\nagency, maintaining that there would be an affront to agency and thus\nto human personality, if some system were not arrived at which could\npermit useful objects to be used. He inferred from this that ‘it\nis a duty of right to act towards others so that what is external\n(usable) could also become someone’s’ (Kant 1991 [1797], p. 74)\nThough this legitimated unilateral appropriation, it did so only in a\nprovisional way. Since the appropriation of a resource as private\nproperty affects everyone else’s position (imposing duties on them\nthat they would otherwise not have), it cannot acquire full legitimacy\nby unilateral action: it must be ratified by an arrangement which\nrespects everyone’s interests in this matter. So the force of the\nprinciple requiring people to act so that external objects can be used\nas property also requires them to enter into a civil constitution,\nwhich will actually settle who is to be the owner of what on a basis\nthat is fair to all.\n\nG.W.F. Hegel’s account of property centers on the contribution\nproperty makes to the development of the self, ‘superseding and\nreplacing the subjective phase of personality’ (1967 [1821],\npara. 41a) and giving some sort of external reality to what would\notherwise be the mere idea of individual freedom. These rather obscure\nformulations were taken up also by the English idealists, most notably\nby T.H. Green (1941 [1895]), who emphasized the contribution that\nownership makes to ethical development, to the growth of the will and\na sense of responsibility. But neither of these writers thought of the\ndevelopment of the individual person as the be-all and end-all of\nproperty. In both cases it was thought of as a stage in the growth of\nsocial responsibility. Both saw the freedom embodied in property as\nultimately positive freedom—freedom to choose\nrationally and responsibly for the wider social good. In Karl Marx’s\nphilosophy, Hegel’s sense of there being several stages in the growth\nof positive freedom is framed in terms of stages of social development\nrather than stages of the growth of individuals (Marx 1972 [1862]).\nAnd for Marx, as for Plato, social responsibility in the exercise of\nprivate property rights is never enough. The whole trajectory of the\ndevelopment of modern society, says Marx, is towards large-scale\ncooperative labor. This may be masked by forms of property that treat\nvast corporations as private owners, but eventually this carapace will\nbe abandoned and collectivist economic relations will emerge and be\ncelebrated as such.\n\nThe general merits of private property versus socialism thus became a\nsubject of genuine debate in the nineteenth and twentieth centuries.\nJohn Stuart Mill, with his characteristic open-mindedness treated\ncommunism as a genuine option, and he confronted objections to the\ncollectivist ideal with the suggestion that the inequitable\ndistribution of property in actually existing capitalist societies\nalready partakes of many of these difficulties. He insisted however,\nthat private property be given a fair hearing as well:\n\nIf…the choice were to be made between Communism…and the\npresent state of society with all its sufferings and\ninjustices,…all the difficulties, great or small, of Communism\nwould be but as dust in the balance. But to make the comparison\napplicable, we must compare Communism at its best, with the regime of\nindividual property, not as it is, but as it might be made…The\nlaws of property have never yet conformed to the principles on which\nthe justification of private property rests. (Mill 1994[1848], pp.\n14–15)\n\n\nMill is surely right, at least so far as the aims of a philosophical\ndiscussion of property are concerned. Indeed, one way of looking at\nthe history we have just briefly surveyed is that it is the history of\nsuccessive attempts to tease out, from the mess of actually-existing\nmaldistribution and exploitation, some sense of the true principles on\nwhich the justification of an ideal system of private property would\nrest, and a sense too of other aspects of moral enterprise which such\nan institution might serve.\n",
    "section_title": "2. Historical Overview",
    "entry_title": "Property and Ownership",
    "hierarchy_title": "Property and Ownership || Historical Overview",
    "tokenized_text": [
        "historical",
        "overview",
        "historical",
        "overview",
        "extensive",
        "discussion",
        "property",
        "writing",
        "plato",
        "aristotle",
        "aquinas",
        "hegel",
        "hobbes",
        "locke",
        "hume",
        "kant",
        "marx",
        "mill",
        "range",
        "justificatory",
        "theme",
        "consider",
        "broad",
        "shall",
        "begin",
        "summary",
        "ancient",
        "author",
        "speculated",
        "relation",
        "property",
        "virtue",
        "natural",
        "subject",
        "discussion",
        "since",
        "justifying",
        "private",
        "property",
        "raise",
        "serious",
        "question",
        "legitimacy",
        "selfinterested",
        "activity",
        "plato",
        "republic",
        "bc",
        "argued",
        "collective",
        "ownership",
        "necessary",
        "promote",
        "common",
        "pursuit",
        "common",
        "interest",
        "avoid",
        "social",
        "divisiveness",
        "would",
        "occur",
        "grieve",
        "exceedingly",
        "others",
        "rejoice",
        "happenings",
        "aristotle",
        "responded",
        "arguing",
        "private",
        "ownership",
        "promotes",
        "virtue",
        "like",
        "prudence",
        "responsibility",
        "w",
        "hen",
        "everyone",
        "distinct",
        "interest",
        "men",
        "complain",
        "one",
        "another",
        "make",
        "progress",
        "every",
        "one",
        "attending",
        "business",
        "aristotle",
        "politics",
        "a",
        "even",
        "altruism",
        "said",
        "aristotle",
        "might",
        "better",
        "promoted",
        "focusing",
        "ethical",
        "attention",
        "way",
        "person",
        "exercise",
        "right",
        "private",
        "property",
        "rather",
        "questioning",
        "institution",
        "ibid",
        "aristotle",
        "also",
        "reflected",
        "relation",
        "property",
        "freedom",
        "contribution",
        "ownership",
        "make",
        "person",
        "free",
        "man",
        "thus",
        "suitable",
        "citizenship",
        "greek",
        "took",
        "liberty",
        "status",
        "defined",
        "contrast",
        "slavery",
        "aristotle",
        "free",
        "belong",
        "oneself",
        "one",
        "man",
        "whereas",
        "slave",
        "nature",
        "property",
        "another",
        "selfpossession",
        "connected",
        "sufficient",
        "distance",
        "one",
        "desire",
        "enable",
        "practice",
        "virtuous",
        "selfcontrol",
        "account",
        "natural",
        "slave",
        "unfree",
        "reason",
        "could",
        "prescribe",
        "rule",
        "bodily",
        "appetite",
        "aristotle",
        "hesitation",
        "extending",
        "point",
        "beyond",
        "slavery",
        "condition",
        "meaner",
        "sort",
        "workman",
        "obsessed",
        "need",
        "poor",
        "degraded",
        "participate",
        "politics",
        "like",
        "free",
        "men",
        "could",
        "make",
        "city",
        "pauper",
        "wrote",
        "aristotle",
        "slave",
        "ibid",
        "a",
        "must",
        "ruled",
        "like",
        "slave",
        "otherwise",
        "pressing",
        "immediate",
        "need",
        "issue",
        "envy",
        "violence",
        "theme",
        "emerged",
        "recently",
        "civic",
        "republican",
        "theory",
        "though",
        "modern",
        "theory",
        "citizenship",
        "tend",
        "begin",
        "sense",
        "citizen",
        "adult",
        "resident",
        "proceed",
        "argue",
        "property",
        "rather",
        "using",
        "existing",
        "wealth",
        "independent",
        "criterion",
        "franchise",
        "king",
        "waldron",
        "medieval",
        "period",
        "thomas",
        "aquinas",
        "continued",
        "discussion",
        "aristotlean",
        "idea",
        "virtue",
        "might",
        "expressed",
        "use",
        "one",
        "make",
        "one",
        "property",
        "aquinas",
        "gave",
        "sharper",
        "edge",
        "rich",
        "moral",
        "obligation",
        "act",
        "generously",
        "poor",
        "also",
        "right",
        "rich",
        "beginning",
        "premise",
        "ccording",
        "natural",
        "order",
        "established",
        "divine",
        "providence",
        "inferior",
        "thing",
        "ordained",
        "purpose",
        "succoring",
        "man",
        "needs",
        "aquinas",
        "st",
        "p",
        "aquinas",
        "argued",
        "division",
        "resource",
        "based",
        "human",
        "law",
        "prevail",
        "necessity",
        "associated",
        "destitution",
        "theme",
        "recurs",
        "throughout",
        "traditionmost",
        "notably",
        "locke",
        "first",
        "treatise",
        "government",
        "locke",
        "para",
        "as",
        "essential",
        "qualification",
        "whatever",
        "else",
        "said",
        "legitimacy",
        "private",
        "property",
        "horne",
        "early",
        "modern",
        "period",
        "philosopher",
        "turned",
        "attention",
        "way",
        "property",
        "might",
        "instituted",
        "hobbes",
        "hume",
        "arguing",
        "natural",
        "mine",
        "thine",
        "property",
        "must",
        "understood",
        "creation",
        "sovereign",
        "state",
        "hobbes",
        "least",
        "artificial",
        "product",
        "convention",
        "enter",
        "member",
        "society",
        "bestow",
        "stability",
        "possession",
        "ofexternal",
        "good",
        "leave",
        "every",
        "one",
        "peaceable",
        "enjoyment",
        "may",
        "acquire",
        "fortune",
        "industry",
        "hume",
        "p",
        "john",
        "locke",
        "hand",
        "adamant",
        "property",
        "could",
        "instituted",
        "state",
        "nature",
        "without",
        "special",
        "convention",
        "political",
        "decision",
        "locke",
        "theory",
        "widely",
        "regarded",
        "interesting",
        "canonical",
        "discussion",
        "property",
        "part",
        "result",
        "began",
        "account",
        "took",
        "starting",
        "point",
        "god",
        "gave",
        "world",
        "men",
        "common",
        "acknowledge",
        "outset",
        "private",
        "entitlement",
        "pose",
        "moral",
        "problem",
        "move",
        "common",
        "endowment",
        "disproportionate",
        "unequal",
        "possession",
        "earth",
        "seems",
        "go",
        "along",
        "private",
        "property",
        "unlike",
        "predecessor",
        "locke",
        "base",
        "resolution",
        "difficulty",
        "theory",
        "universal",
        "even",
        "tacit",
        "consent",
        "instead",
        "famous",
        "passage",
        "chapter",
        "property",
        "gave",
        "moral",
        "defense",
        "legitimacy",
        "unilateral",
        "appropriation",
        "though",
        "earthbe",
        "common",
        "men",
        "yet",
        "every",
        "man",
        "property",
        "person",
        "body",
        "right",
        "labour",
        "body",
        "work",
        "hand",
        "may",
        "say",
        "properly",
        "whatsoever",
        "remove",
        "state",
        "nature",
        "hath",
        "provided",
        "left",
        "hath",
        "mixed",
        "labour",
        "joyned",
        "something",
        "thereby",
        "make",
        "property",
        "removed",
        "common",
        "state",
        "nature",
        "placed",
        "hath",
        "labour",
        "something",
        "annexed",
        "excludes",
        "common",
        "right",
        "men",
        "locke",
        "ii",
        "para",
        "interest",
        "locke",
        "account",
        "lie",
        "way",
        "combine",
        "structure",
        "theory",
        "first",
        "occupancy",
        "account",
        "substantive",
        "moral",
        "significance",
        "labor",
        "hand",
        "writer",
        "like",
        "samuel",
        "pufendorf",
        "p",
        "first",
        "occupancy",
        "theory",
        "proceeded",
        "basis",
        "first",
        "human",
        "user",
        "natural",
        "resourcea",
        "piece",
        "land",
        "exampleis",
        "distinguished",
        "others",
        "displace",
        "anyone",
        "else",
        "order",
        "take",
        "possession",
        "particularly",
        "matter",
        "took",
        "possession",
        "sort",
        "use",
        "made",
        "mattered",
        "began",
        "acting",
        "owner",
        "without",
        "dispossessing",
        "anyone",
        "else",
        "although",
        "locke",
        "used",
        "logic",
        "account",
        "matter",
        "land",
        "cultivated",
        "way",
        "used",
        "productively",
        "reason",
        "expressed",
        "doubt",
        "whether",
        "indigenous",
        "hunter",
        "nomadic",
        "people",
        "could",
        "properly",
        "regarded",
        "owner",
        "land",
        "roamed",
        "partly",
        "locke",
        "identified",
        "ownership",
        "labor",
        "something",
        "connected",
        "substantially",
        "primal",
        "ownership",
        "self",
        "also",
        "thought",
        "productivity",
        "labor",
        "would",
        "help",
        "answer",
        "difficulty",
        "saw",
        "first",
        "occupancy",
        "theory",
        "though",
        "first",
        "occupier",
        "actually",
        "dispossess",
        "anyone",
        "still",
        "acquisition",
        "may",
        "prejudice",
        "interest",
        "locke",
        "word",
        "enough",
        "good",
        "left",
        "common",
        "enjoy",
        "locke",
        "ii",
        "para",
        "locke",
        "answer",
        "difficulty",
        "emphasize",
        "appropriation",
        "productive",
        "labor",
        "actually",
        "increased",
        "amount",
        "good",
        "available",
        "society",
        "others",
        "ibid",
        "ii",
        "para",
        "also",
        "something",
        "like",
        "strand",
        "moral",
        "desert",
        "locke",
        "theory",
        "one",
        "person",
        "fails",
        "take",
        "advantage",
        "opportunity",
        "resourceuse",
        "resource",
        "development",
        "person",
        "really",
        "complain",
        "demand",
        "compensation",
        "opportunity",
        "taken",
        "someone",
        "else",
        "de",
        "jasay",
        "immanuel",
        "kant",
        "work",
        "property",
        "formal",
        "abstract",
        "locke",
        "andat",
        "least",
        "recentlyit",
        "le",
        "wellknown",
        "see",
        "byrd",
        "hruschka",
        "ripstein",
        "kant",
        "began",
        "emphasizing",
        "general",
        "connection",
        "property",
        "agency",
        "maintaining",
        "would",
        "affront",
        "agency",
        "thus",
        "human",
        "personality",
        "system",
        "arrived",
        "could",
        "permit",
        "useful",
        "object",
        "used",
        "inferred",
        "duty",
        "right",
        "act",
        "towards",
        "others",
        "external",
        "usable",
        "could",
        "also",
        "become",
        "someone",
        "kant",
        "p",
        "though",
        "legitimated",
        "unilateral",
        "appropriation",
        "provisional",
        "way",
        "since",
        "appropriation",
        "resource",
        "private",
        "property",
        "affect",
        "everyone",
        "else",
        "position",
        "imposing",
        "duty",
        "would",
        "otherwise",
        "acquire",
        "full",
        "legitimacy",
        "unilateral",
        "action",
        "must",
        "ratified",
        "arrangement",
        "respect",
        "everyone",
        "interest",
        "matter",
        "force",
        "principle",
        "requiring",
        "people",
        "act",
        "external",
        "object",
        "used",
        "property",
        "also",
        "requires",
        "enter",
        "civil",
        "constitution",
        "actually",
        "settle",
        "owner",
        "basis",
        "fair",
        "gwf",
        "hegel",
        "account",
        "property",
        "center",
        "contribution",
        "property",
        "make",
        "development",
        "self",
        "superseding",
        "replacing",
        "subjective",
        "phase",
        "personality",
        "para",
        "a",
        "giving",
        "sort",
        "external",
        "reality",
        "would",
        "otherwise",
        "mere",
        "idea",
        "individual",
        "freedom",
        "rather",
        "obscure",
        "formulation",
        "taken",
        "also",
        "english",
        "idealist",
        "notably",
        "th",
        "green",
        "emphasized",
        "contribution",
        "ownership",
        "make",
        "ethical",
        "development",
        "growth",
        "sense",
        "responsibility",
        "neither",
        "writer",
        "thought",
        "development",
        "individual",
        "person",
        "beall",
        "endall",
        "property",
        "case",
        "thought",
        "stage",
        "growth",
        "social",
        "responsibility",
        "saw",
        "freedom",
        "embodied",
        "property",
        "ultimately",
        "positive",
        "freedomfreedom",
        "choose",
        "rationally",
        "responsibly",
        "wider",
        "social",
        "good",
        "karl",
        "marx",
        "philosophy",
        "hegel",
        "sense",
        "several",
        "stage",
        "growth",
        "positive",
        "freedom",
        "framed",
        "term",
        "stage",
        "social",
        "development",
        "rather",
        "stage",
        "growth",
        "individual",
        "marx",
        "marx",
        "plato",
        "social",
        "responsibility",
        "exercise",
        "private",
        "property",
        "right",
        "never",
        "enough",
        "whole",
        "trajectory",
        "development",
        "modern",
        "society",
        "say",
        "marx",
        "towards",
        "largescale",
        "cooperative",
        "labor",
        "may",
        "masked",
        "form",
        "property",
        "treat",
        "vast",
        "corporation",
        "private",
        "owner",
        "eventually",
        "carapace",
        "abandoned",
        "collectivist",
        "economic",
        "relation",
        "emerge",
        "celebrated",
        "general",
        "merit",
        "private",
        "property",
        "versus",
        "socialism",
        "thus",
        "became",
        "subject",
        "genuine",
        "debate",
        "nineteenth",
        "twentieth",
        "century",
        "john",
        "stuart",
        "mill",
        "characteristic",
        "openmindedness",
        "treated",
        "communism",
        "genuine",
        "option",
        "confronted",
        "objection",
        "collectivist",
        "ideal",
        "suggestion",
        "inequitable",
        "distribution",
        "property",
        "actually",
        "existing",
        "capitalist",
        "society",
        "already",
        "partakes",
        "many",
        "difficulty",
        "insisted",
        "however",
        "private",
        "property",
        "given",
        "fair",
        "hearing",
        "well",
        "ifthe",
        "choice",
        "made",
        "communismand",
        "present",
        "state",
        "society",
        "suffering",
        "injustice",
        "all",
        "difficulty",
        "great",
        "small",
        "communism",
        "would",
        "dust",
        "balance",
        "make",
        "comparison",
        "applicable",
        "must",
        "compare",
        "communism",
        "best",
        "regime",
        "individual",
        "property",
        "might",
        "madethe",
        "law",
        "property",
        "never",
        "yet",
        "conformed",
        "principle",
        "justification",
        "private",
        "property",
        "rest",
        "mill",
        "pp",
        "mill",
        "surely",
        "right",
        "least",
        "far",
        "aim",
        "philosophical",
        "discussion",
        "property",
        "concerned",
        "indeed",
        "one",
        "way",
        "looking",
        "history",
        "briefly",
        "surveyed",
        "history",
        "successive",
        "attempt",
        "tease",
        "mess",
        "actuallyexisting",
        "maldistribution",
        "exploitation",
        "sense",
        "true",
        "principle",
        "justification",
        "ideal",
        "system",
        "private",
        "property",
        "would",
        "rest",
        "sense",
        "aspect",
        "moral",
        "enterprise",
        "institution",
        "might",
        "serve"
    ]
}