{
    "main_text": "Modal Problems for Singular Propositions\n5. Modal Problems for Singular Propositions\n\nIn sections 2–4, we discussed three sets of argument for the thesis\nthat there are singular propositions. The first, the modal argument,\nwas broadly linguistic in nature and the other two, the arguments from\nindexicals and reduplication, were pyschological. But singular\npropositions also give rise to a number of important metaphysical\nproblems, in addition to those involving propositional attitudes and\napparent substitution failures already discussed. We end this essay by\ndiscussing two related problems: Modal problems and temporal\nproblems.\n\n\nConsider the following proposition. \n\n (7) George Bush does not exist.\n (The number designates the proposition actually expressed by\n‘George Bush does not exist’, not the sentence itself.)\nWhile (7) is false, it might have been true. But suppose (7) is a\nsingular proposition, involving George Bush as a constituent. Then\nthere are problems, given the following two principles.\n\n (P1) Necessarily, for all propositions p, had\np been true, then p would have\nexisted.\n\n (P2) Necessarily, if (7) were true, then George would not have existed.\n \n\nBoth principles are highly plausible. (P1) is plausible because\nbeing true is a property and there must be something that has\na property in order for that property to be instantiated. So, had it\nbeen that a given proposition were true, then there must have been\nsomething — namely, that proposition — that would have had\nthe property of being true. (P2) states the intuitive truth conditions\nof (7), being an instance of the modalized propositional equivalent of\nthe Tarski truth-schema s is true iff s. But these\nprinciples seem to entail that, if (7) is a singular proposition, then\nit is not possibly true. For suppose it were. Then there is a world\nw in which (7) is true. By (P1), (7) exists in\nw. But then all of its constituents exists in\nw as well, as a complex does not exist in a world\nunless all of its constituents exist in that world. But then George\nBush exists in w. So, by (P2), (7) is not true in\nw, which contradicts our original assumption that it\nis true in w. So, either (7) is not a singular\nproposition or it is not possibly true.\n\n\nThe basic structure of this argument derives from Alvin Plantinga's\nargument from his (1983) against what he called\nexistentialism, the thesis that all individual essences are\ndependent upon the individuals that instantiate them. Plantinga\nconcluded that a singular proposition about o can\nexist even though o does not exist. (See in\nparticular (1983, 8–9), where he argued that the notion of\nconstituency is too confused to allow us to conclude that the\nconstituent of a singular proposition must exist in a world for that\nproposition to exist in that world.) Plantinga also argued that the\nproperty being identical to o can exist\nwithout o, even though that property is constructed\nby λ-abstraction from the proposition [o\nis identical to o]. Plantinga would have been much\nbetter served, we believe, by denying that propositions like (7) are\nsingular propositions, on the grounds that, if they were, they would\nnot be possibly true. Instead, propositions like (7) contain\nindividual essences as constituents. (Plantinga should not conceive of\nan individual essence as constructs form an individual identity\nproperty, as that property is dependent on the individual that\ninstantiates it. Instead, an individual essence is either a primitive\nproperty stipulated to be necessarily related to the individual whose\nessence it is or would have been that can nonetheless exist\nunexemplified or the rigidification of some condition that the\nindividual uniquely satisfies, following Plantinga's response to the\nmodal argument above in section 2.) Let H be such an\nindividual essence of Bush. Then (7) is true just in case\nH is uninstantiated, the proposition [Bush is\npresident] is true just in case H and the property\nbeing president are coinstantiated, etc.. The pay-off\nis that (7)'s being true in a possible world does not violate (P1) and\n(P2), as there are possible worlds in which Bush's individual essence\nexists but is unexemplified.\n\n\nThere are several responses to Plantinga's argument, differing in\ntheir metaphysical underpinnings. The first involves the possibilist's\nthesis that there are individuals that are not actual. (See Lewis's\n(1986).) In that case, what exists in a world does not exhaust what\nexists simpliciter. Bush is around to serve as a constituent of a\nproposition, even with respect to worlds in which he does not exist,\nbecause he exists simpliciter by existing in other worlds. The\npossibilist can thus claim that the truth of (P1) does not entail\nthat, if p is true in w, then\np exists in w; rather, it only\nentails that p and all its constituents\nexists.\n\n\nMatters are more difficult if one is an actualist, subscribing to the\nthesis that absolutely everything is actual. Then, if one accepts the\nexistence of singular propositions, one has two options. First, one\nmight deny that propositions like (7) are possibly true, accepting\nthat necessarily everything necessarily exists, as Bernard Linsky and\nEdward Zalta, in their (1994) and Timothy Williamson, in his\n(2001), do. This position is only as plausible as the\nexplanation on offer of the intuitive contingency of ordinary objects\nlike Bush. If being and existence are necessary properties, then some\ncontingent property must be offered in place that can be used to\nexplain the intuition that (7) might have been true. Linsky and Zalta\nclaim that being concrete is a contingent property. They\nclaim that Bush might have been nonconcrete and that, when we consider\na world in which he is nonconcrete, we are inclined to say that he\ndoes not exist there. Although the virtues of this view are many, not\nthe least of which is the simple and straightforward modal logic it\nvalidates, we are very reluctant to accept that concreteness is a\ncontingent property. \n\n\nFinally, if one insists that propositions like (7) are singular\npropositions that are possibly true, then one must claim that (7) is\ntrue at worlds in which it does not exist, thus denying (P1). (Examples include \nAdams 1981, Deutsch 1994, Fine 1977 and\n1985, Fitch 1996, and Menzel 1991 and 1993.) A proposition\np is true in a world w just\nin case, were w actual, then p would\nhave been true. Call this inner truth. (P1) is true for inner\ntruth and there are no singular negative existential propositions like\n(7) that are true in any possible worlds. But there is another notion\nof truth with respect to a possible world that is associated with\ngenuine necessity and contingency. Adams describes this notions as\nfollows.\n\nA world-story [a maximal, consistent set of actually existing\npropositions] that includes no singular proposition about me\nconstitutes and describes a possible world in which I would not\nexist. It represents my possible non-existence, not by including the\nproposition that I do not exist but simply by omitting me. That I\nwould not exist if all the propositions it includes, and no other\nactual propositions, were true is not a fact internal to the world\nthat it describes, but an observation that we make from our vantage\npoint in the actual world, about the relation of that world story to\nan individual of the actual world. (1981, 22)\n\nThe world-story corresponding to a possibility where George Bush does\nnot exist does not, then, contain (7) as a member. Instead, (7) is\ntrue with respect to the possibility that world-story describes in\nvirtue of the world-story omitting mention of Bush altogether. From\nthe perspective of the actual world, and with its resources, we can\nsay that (7) is true at that possibility, even though, from the\nperspective of the possibility itself, there is complete silence about\nGeorge Bush. Call this outer truth.\n\nThe intuitive possible truth of (7) is an example of one side of our\nintuitions of the contingency of existence, being an example of the\npossible nonexistence of a thing that actually exists. An example of\nthe other side of those intuitions concerns the possible existence of\nsomething that does not actually exist. As a matter of fact, Natalie\nPortman and George Bush did not have any children together and so,\ngiven plausible essentialists intuitions, nothing that actually exists\ncould have been their child. But they could have had a child. Had\ncertain contingent happenings occurred, then there would have been a\nperson parented by Portman and Bush. So, (8) below is intuitively\ntrue.\n\n (8) Nothing that actually exists could have been parented by Portman\n and Bush, but it is possible that there is someone parented by\n Portman and Bush.\n\nThe possibilist maintains that what actually exists is a proper subset\nof what exists. So, while nothing in the domain of the actual world\ncould have been Portman and Bush's child, there are things in the most\ninclusive domain of quantification, which includes merely possible\nindividuals, that are parented by Portman and Bush in some possible\nworlds. On Plantinga's view, there is an uninstantiated individual\nessence that could have been instantiated and, had it been\ninstantiated, it would have been instantiated by something that was\nparented by Portman and Bush. On Linsky and Zalta's view, there is a\nnonconcrete individual that could have been concrete and, had it been\nconcrete, it would have been parented by Portman and Bush. All three\nviews, then, seem to easily account for the truth of something close\nto (8). (The last view must offer a slight revision of (8): While a\nnonconcrete individual actually exists and could have been parented by\nPortman and Bush, nothing that is actually concrete could have been\nparented by Portman and Bush.) Proponents of the last view considered\nabove, however, do not countenance merely possible individuals,\nuninstantiated individual essences, nor contingently nonconcrete\nindividuals. Instead they must give a different account of the second\nside of our intuitions that what exists is contingent. \n\n\nFollowing Adams 1981, proponents of our final view can claim that the\nactually existing quantified proposition [There is someone parented by\nPortman and Bush] is a member of a world-story corresponding to the\npossibility in which Portman and Bush have a child together, but no\natomic proposition of the form [o is parented by\nPortman and Bush] is a member of that set, as there is no such\nproposition that could have been true. (If there were such an atomic\nproposition, then there would be something that could have been\nparented by Portman and Bush, which there is not.) So, there are\nquantified propositions that are true at a possible world\nw even though there are no witnesses of those\npropositions — i.e., no corresponding singular propositions\n— true at w. This requires abandoning a general\nanalysis of the truth of quantified propositions to the truth of\natomic propositions. The best that a proponent of this account can say\nis that, had one of the possibilities in question been actual, then\nthere would have been such a singular proposition and so there would\nhave been a witness to the possibly true quantified proposition. But,\nas things actually are, the quantified proposition could have been\ntrue even though there is no singular proposition that could have been\ntrue.\n\n\n\nNone of the solutions considered in this section are without their\nproblems. The possibilist recognizes a distinction between existing\nand actually existing that requires a bloated ontology. Plantinga's\nsolution requires mysterious entities — individual essences that\ncould exist unexemplified and thus that are individuated independently\nof the individuals that instantiate them. Linsky and Zalta's solution\nruns contrary to the robust intuition that what individuals there\nhappen to be is a contingent matter and requires that ordinary\nexistents could exist as nonconcrete objects. And the final solution\nrequires a distinction between how matters stand in a possible world\nor from the perspective of that possible world and how matters stand\nat that world, which many find mysterious and claim to require an\nunpalatable form of realism about possible worlds. The account also\nrequires complicating one's quantified modal logic, as it entails that\nthere are theorems of classical quantificational logic (for example,\n∃x(a=x)) that are contingent, requiring either a\nrevision of classical quantificational logic, and a movement to a free\nlogic, in which case those problematic classical theorems are no\nlonger theorems, or a restriction on the standard Rule of\nNecessitation of standard modal logic, in which case there are\ncontingent logical truths. (For a more detailed discussion of the\nissues raised in this section, see the entry on the\n possibilism-actualism debate.)\n",
    "section_title": "5. Modal Problems for Singular Propositions",
    "entry_title": "Singular Propositions",
    "hierarchy_title": "Singular Propositions || Modal Problems for Singular Propositions",
    "tokenized_text": [
        "modal",
        "problem",
        "singular",
        "proposition",
        "modal",
        "problem",
        "singular",
        "proposition",
        "section",
        "discussed",
        "three",
        "set",
        "argument",
        "thesis",
        "singular",
        "proposition",
        "first",
        "modal",
        "argument",
        "broadly",
        "linguistic",
        "nature",
        "two",
        "argument",
        "indexicals",
        "reduplication",
        "pyschological",
        "singular",
        "proposition",
        "also",
        "give",
        "rise",
        "number",
        "important",
        "metaphysical",
        "problem",
        "addition",
        "involving",
        "propositional",
        "attitude",
        "apparent",
        "substitution",
        "failure",
        "already",
        "discussed",
        "end",
        "essay",
        "discussing",
        "two",
        "related",
        "problem",
        "modal",
        "problem",
        "temporal",
        "problem",
        "consider",
        "following",
        "proposition",
        "george",
        "bush",
        "exist",
        "number",
        "designates",
        "proposition",
        "actually",
        "expressed",
        "george",
        "bush",
        "exist",
        "sentence",
        "false",
        "might",
        "true",
        "suppose",
        "singular",
        "proposition",
        "involving",
        "george",
        "bush",
        "constituent",
        "problem",
        "given",
        "following",
        "two",
        "principle",
        "p",
        "necessarily",
        "proposition",
        "p",
        "p",
        "true",
        "p",
        "would",
        "existed",
        "p",
        "necessarily",
        "true",
        "george",
        "would",
        "existed",
        "principle",
        "highly",
        "plausible",
        "p",
        "plausible",
        "true",
        "property",
        "must",
        "something",
        "property",
        "order",
        "property",
        "instantiated",
        "given",
        "proposition",
        "true",
        "must",
        "something",
        "namely",
        "proposition",
        "would",
        "property",
        "true",
        "p",
        "state",
        "intuitive",
        "truth",
        "condition",
        "instance",
        "modalized",
        "propositional",
        "equivalent",
        "tarski",
        "truthschema",
        "true",
        "iff",
        "s",
        "principle",
        "seem",
        "entail",
        "singular",
        "proposition",
        "possibly",
        "true",
        "suppose",
        "world",
        "w",
        "true",
        "p",
        "exists",
        "w",
        "constituent",
        "exists",
        "w",
        "well",
        "complex",
        "exist",
        "world",
        "unless",
        "constituent",
        "exist",
        "world",
        "george",
        "bush",
        "exists",
        "w",
        "p",
        "true",
        "w",
        "contradicts",
        "original",
        "assumption",
        "true",
        "w",
        "either",
        "singular",
        "proposition",
        "possibly",
        "true",
        "basic",
        "structure",
        "argument",
        "derives",
        "alvin",
        "plantinga",
        "s",
        "argument",
        "called",
        "existentialism",
        "thesis",
        "individual",
        "essence",
        "dependent",
        "upon",
        "individual",
        "instantiate",
        "plantinga",
        "concluded",
        "singular",
        "proposition",
        "exist",
        "even",
        "though",
        "exist",
        "see",
        "particular",
        "argued",
        "notion",
        "constituency",
        "confused",
        "allow",
        "u",
        "conclude",
        "constituent",
        "singular",
        "proposition",
        "must",
        "exist",
        "world",
        "proposition",
        "exist",
        "world",
        "plantinga",
        "also",
        "argued",
        "property",
        "identical",
        "exist",
        "without",
        "even",
        "though",
        "property",
        "constructed",
        "λabstraction",
        "proposition",
        "identical",
        "plantinga",
        "would",
        "much",
        "better",
        "served",
        "believe",
        "denying",
        "proposition",
        "like",
        "singular",
        "proposition",
        "ground",
        "would",
        "possibly",
        "true",
        "instead",
        "proposition",
        "like",
        "contain",
        "individual",
        "essence",
        "constituent",
        "plantinga",
        "conceive",
        "individual",
        "essence",
        "construct",
        "form",
        "individual",
        "identity",
        "property",
        "property",
        "dependent",
        "individual",
        "instantiates",
        "instead",
        "individual",
        "essence",
        "either",
        "primitive",
        "property",
        "stipulated",
        "necessarily",
        "related",
        "individual",
        "whose",
        "essence",
        "would",
        "nonetheless",
        "exist",
        "unexemplified",
        "rigidification",
        "condition",
        "individual",
        "uniquely",
        "satisfies",
        "following",
        "plantinga",
        "s",
        "response",
        "modal",
        "argument",
        "section",
        "let",
        "h",
        "individual",
        "essence",
        "bush",
        "true",
        "case",
        "h",
        "uninstantiated",
        "proposition",
        "bush",
        "president",
        "true",
        "case",
        "h",
        "property",
        "president",
        "coinstantiated",
        "etc",
        "payoff",
        "s",
        "true",
        "possible",
        "world",
        "violate",
        "p",
        "p",
        "possible",
        "world",
        "bush",
        "s",
        "individual",
        "essence",
        "exists",
        "unexemplified",
        "several",
        "response",
        "plantinga",
        "s",
        "argument",
        "differing",
        "metaphysical",
        "underpinnings",
        "first",
        "involves",
        "possibilist",
        "s",
        "thesis",
        "individual",
        "actual",
        "see",
        "lewis",
        "s",
        "case",
        "exists",
        "world",
        "exhaust",
        "exists",
        "simpliciter",
        "bush",
        "around",
        "serve",
        "constituent",
        "proposition",
        "even",
        "respect",
        "world",
        "exist",
        "exists",
        "simpliciter",
        "existing",
        "world",
        "possibilist",
        "thus",
        "claim",
        "truth",
        "p",
        "entail",
        "p",
        "true",
        "w",
        "p",
        "exists",
        "w",
        "rather",
        "entail",
        "p",
        "constituent",
        "exists",
        "matter",
        "difficult",
        "one",
        "actualist",
        "subscribing",
        "thesis",
        "absolutely",
        "everything",
        "actual",
        "one",
        "accepts",
        "existence",
        "singular",
        "proposition",
        "one",
        "two",
        "option",
        "first",
        "one",
        "might",
        "deny",
        "proposition",
        "like",
        "possibly",
        "true",
        "accepting",
        "necessarily",
        "everything",
        "necessarily",
        "exists",
        "bernard",
        "linsky",
        "edward",
        "zalta",
        "timothy",
        "williamson",
        "position",
        "plausible",
        "explanation",
        "offer",
        "intuitive",
        "contingency",
        "ordinary",
        "object",
        "like",
        "bush",
        "existence",
        "necessary",
        "property",
        "contingent",
        "property",
        "must",
        "offered",
        "place",
        "used",
        "explain",
        "intuition",
        "might",
        "true",
        "linsky",
        "zalta",
        "claim",
        "concrete",
        "contingent",
        "property",
        "claim",
        "bush",
        "might",
        "nonconcrete",
        "consider",
        "world",
        "nonconcrete",
        "inclined",
        "say",
        "exist",
        "although",
        "virtue",
        "view",
        "many",
        "least",
        "simple",
        "straightforward",
        "modal",
        "logic",
        "validates",
        "reluctant",
        "accept",
        "concreteness",
        "contingent",
        "property",
        "finally",
        "one",
        "insists",
        "proposition",
        "like",
        "singular",
        "proposition",
        "possibly",
        "true",
        "one",
        "must",
        "claim",
        "true",
        "world",
        "exist",
        "thus",
        "denying",
        "p",
        "example",
        "include",
        "adam",
        "deutsch",
        "fine",
        "fitch",
        "menzel",
        "proposition",
        "p",
        "true",
        "world",
        "w",
        "case",
        "w",
        "actual",
        "p",
        "would",
        "true",
        "call",
        "inner",
        "truth",
        "p",
        "true",
        "inner",
        "truth",
        "singular",
        "negative",
        "existential",
        "proposition",
        "like",
        "true",
        "possible",
        "world",
        "another",
        "notion",
        "truth",
        "respect",
        "possible",
        "world",
        "associated",
        "genuine",
        "necessity",
        "contingency",
        "adam",
        "describes",
        "notion",
        "follows",
        "worldstory",
        "maximal",
        "consistent",
        "set",
        "actually",
        "existing",
        "proposition",
        "includes",
        "singular",
        "proposition",
        "constitutes",
        "describes",
        "possible",
        "world",
        "would",
        "exist",
        "represents",
        "possible",
        "nonexistence",
        "including",
        "proposition",
        "exist",
        "simply",
        "omitting",
        "would",
        "exist",
        "proposition",
        "includes",
        "actual",
        "proposition",
        "true",
        "fact",
        "internal",
        "world",
        "describes",
        "observation",
        "make",
        "vantage",
        "point",
        "actual",
        "world",
        "relation",
        "world",
        "story",
        "individual",
        "actual",
        "world",
        "worldstory",
        "corresponding",
        "possibility",
        "george",
        "bush",
        "exist",
        "contain",
        "member",
        "instead",
        "true",
        "respect",
        "possibility",
        "worldstory",
        "describes",
        "virtue",
        "worldstory",
        "omitting",
        "mention",
        "bush",
        "altogether",
        "perspective",
        "actual",
        "world",
        "resource",
        "say",
        "true",
        "possibility",
        "even",
        "though",
        "perspective",
        "possibility",
        "complete",
        "silence",
        "george",
        "bush",
        "call",
        "outer",
        "truth",
        "intuitive",
        "possible",
        "truth",
        "example",
        "one",
        "side",
        "intuition",
        "contingency",
        "existence",
        "example",
        "possible",
        "nonexistence",
        "thing",
        "actually",
        "exists",
        "example",
        "side",
        "intuition",
        "concern",
        "possible",
        "existence",
        "something",
        "actually",
        "exist",
        "matter",
        "fact",
        "natalie",
        "portman",
        "george",
        "bush",
        "child",
        "together",
        "given",
        "plausible",
        "essentialists",
        "intuition",
        "nothing",
        "actually",
        "exists",
        "could",
        "child",
        "could",
        "child",
        "certain",
        "contingent",
        "happening",
        "occurred",
        "would",
        "person",
        "parented",
        "portman",
        "bush",
        "intuitively",
        "true",
        "nothing",
        "actually",
        "exists",
        "could",
        "parented",
        "portman",
        "bush",
        "possible",
        "someone",
        "parented",
        "portman",
        "bush",
        "possibilist",
        "maintains",
        "actually",
        "exists",
        "proper",
        "subset",
        "exists",
        "nothing",
        "domain",
        "actual",
        "world",
        "could",
        "portman",
        "bush",
        "s",
        "child",
        "thing",
        "inclusive",
        "domain",
        "quantification",
        "includes",
        "merely",
        "possible",
        "individual",
        "parented",
        "portman",
        "bush",
        "possible",
        "world",
        "plantinga",
        "s",
        "view",
        "uninstantiated",
        "individual",
        "essence",
        "could",
        "instantiated",
        "instantiated",
        "would",
        "instantiated",
        "something",
        "parented",
        "portman",
        "bush",
        "linsky",
        "zalta",
        "s",
        "view",
        "nonconcrete",
        "individual",
        "could",
        "concrete",
        "concrete",
        "would",
        "parented",
        "portman",
        "bush",
        "three",
        "view",
        "seem",
        "easily",
        "account",
        "truth",
        "something",
        "close",
        "last",
        "view",
        "must",
        "offer",
        "slight",
        "revision",
        "nonconcrete",
        "individual",
        "actually",
        "exists",
        "could",
        "parented",
        "portman",
        "bush",
        "nothing",
        "actually",
        "concrete",
        "could",
        "parented",
        "portman",
        "bush",
        "proponent",
        "last",
        "view",
        "considered",
        "however",
        "countenance",
        "merely",
        "possible",
        "individual",
        "uninstantiated",
        "individual",
        "essence",
        "contingently",
        "nonconcrete",
        "individual",
        "instead",
        "must",
        "give",
        "different",
        "account",
        "second",
        "side",
        "intuition",
        "exists",
        "contingent",
        "following",
        "adam",
        "proponent",
        "final",
        "view",
        "claim",
        "actually",
        "existing",
        "quantified",
        "proposition",
        "someone",
        "parented",
        "portman",
        "bush",
        "member",
        "worldstory",
        "corresponding",
        "possibility",
        "portman",
        "bush",
        "child",
        "together",
        "atomic",
        "proposition",
        "form",
        "parented",
        "portman",
        "bush",
        "member",
        "set",
        "proposition",
        "could",
        "true",
        "atomic",
        "proposition",
        "would",
        "something",
        "could",
        "parented",
        "portman",
        "bush",
        "quantified",
        "proposition",
        "true",
        "possible",
        "world",
        "w",
        "even",
        "though",
        "witness",
        "proposition",
        "ie",
        "corresponding",
        "singular",
        "proposition",
        "true",
        "w",
        "requires",
        "abandoning",
        "general",
        "analysis",
        "truth",
        "quantified",
        "proposition",
        "truth",
        "atomic",
        "proposition",
        "best",
        "proponent",
        "account",
        "say",
        "one",
        "possibility",
        "question",
        "actual",
        "would",
        "singular",
        "proposition",
        "would",
        "witness",
        "possibly",
        "true",
        "quantified",
        "proposition",
        "thing",
        "actually",
        "quantified",
        "proposition",
        "could",
        "true",
        "even",
        "though",
        "singular",
        "proposition",
        "could",
        "true",
        "none",
        "solution",
        "considered",
        "section",
        "without",
        "problem",
        "possibilist",
        "recognizes",
        "distinction",
        "existing",
        "actually",
        "existing",
        "requires",
        "bloated",
        "ontology",
        "plantinga",
        "s",
        "solution",
        "requires",
        "mysterious",
        "entity",
        "individual",
        "essence",
        "could",
        "exist",
        "unexemplified",
        "thus",
        "individuated",
        "independently",
        "individual",
        "instantiate",
        "linsky",
        "zalta",
        "s",
        "solution",
        "run",
        "contrary",
        "robust",
        "intuition",
        "individual",
        "happen",
        "contingent",
        "matter",
        "requires",
        "ordinary",
        "existents",
        "could",
        "exist",
        "nonconcrete",
        "object",
        "final",
        "solution",
        "requires",
        "distinction",
        "matter",
        "stand",
        "possible",
        "world",
        "perspective",
        "possible",
        "world",
        "matter",
        "stand",
        "world",
        "many",
        "find",
        "mysterious",
        "claim",
        "require",
        "unpalatable",
        "form",
        "realism",
        "possible",
        "world",
        "account",
        "also",
        "requires",
        "complicating",
        "one",
        "s",
        "quantified",
        "modal",
        "logic",
        "entail",
        "theorem",
        "classical",
        "quantificational",
        "logic",
        "example",
        "x",
        "ax",
        "contingent",
        "requiring",
        "either",
        "revision",
        "classical",
        "quantificational",
        "logic",
        "movement",
        "free",
        "logic",
        "case",
        "problematic",
        "classical",
        "theorem",
        "longer",
        "theorem",
        "restriction",
        "standard",
        "rule",
        "necessitation",
        "standard",
        "modal",
        "logic",
        "case",
        "contingent",
        "logical",
        "truth",
        "detailed",
        "discussion",
        "issue",
        "raised",
        "section",
        "see",
        "entry",
        "possibilismactualism",
        "debate"
    ]
}