{
    "main_text": "Fregeanism and Russellianism\n1. Fregeanism and Russellianism\n\nWe will assume without argument a propositionalist semantics,\naccording to which sentences (in context) are assigned propositions as\ncontents which are the primary bearers of truth values, bearers of\nmodal properties like contingency and necessity, and objects of the\npropositional attitudes like believing, hoping, and saying. We can\ndistinguish two broad classes of theories about\npropositions. Proponents of the first, Fregean view accept Frege's\ndistinction between sense and reference and proponents of the second,\nRussellian view do not. If Fregeanism is true, all thought about\nconcrete individuals is indirect, mediated by senses that are\nindependent of those individuals. (Some maintain that Frege recognized\nde re senses — senses whose existence and identity is\ndependent upon their reference — as the contents of proper names,\nin which case he would not have subscribed to a Fregean theory, as\ncharacterized above.  The supplementary document\n\nEvans on Frege\n\n\n\ncontains further discussion.) The easiest way to get a grip on this is\nto think of senses as purely qualitative satisfaction conditions. Such\na condition determines an object in virtue of the qualities it\ninstantiates. According to Russellianism, on the other hand, we can\nthink about an individual directly; we can have a thought about an\nindividual by having that individual as an immediate constituent of\nthe thought. On the standard interpretation of Frege, individuals are\nnot constituents of propositions. Propositions are composed\nof senses, not individuals, and senses are individuated independently of any individual. If Fregeanism is true,\nthere are no singular propositions. If Russellianism is true, then\nsingular propositions play a crucial role in semantics and any complete theory of  thought.\n\n\nBefore discussing the reasons for and against singular propositions,\nwe begin with a brief discussion of the views of the historical Frege\nand Russell. The hope is that the discussion will provide a clearer\nunderstanding of the views outlined above.\n\nGottlob Frege famously distinguished between an\nexpression's reference and its sense. (The classic source is Frege\n1892/1948. The distinction was first introduced a year earlier in\n(1891). It is commonly thought, and Frege asserts as much, that the\nsense-reference distinction was not present in (1879/1967). But this\nearly work does contain a seeming anticipation of the distinction, as\nwell as the same argument from the opening paragraphs of (1892/1948)\nagainst the metalinguistic solution promoted in (1879/1967), which is\nextremely puzzling. We don't try to resolve the interpretative issues\nhere.) We focus on proper names, although Frege maintained that the\nsense-reference distinction applied to all expressions, including\nsentences, where the reference of a sentence is a truth value and its\nsense a thought. The reference of the name ‘Mark Twain’ is\nthe man Mark Twain himself, while its sense is a mode of presentation\nor way of thinking of that object.\n\n\nFrege argued for the distinctness of sense from reference as\nfollows. Suppose, for reductio, that the sole semantic value of the\nname ‘Mark Twain’ were its reference. Then, as the name\n‘Samuel Clemens’ is coreferential, the two names would be\nidentical in their semantic values. Given a plausible\nassumption of compositionality, the sentences ‘Mark Twain was a\nfamous American author’ and ‘Samuel Clemens was a famous\nAmerican author’ would then express the same proposition. But that\nis counterintuitive. It seems that fully competent speakers can\nbelieve what the one expresses without believing what the other\nexpresses. (Imagine our agent had an American literature class,\nhaving read Huck Finn and Tom Sawyer, in which\nbiographical facts were withheld. She will accept the first \nsentence and reject the second.) If this is so, then the two sentences\nexpress different propositions. And if they express different\npropositions, there must be some semantically relevant difference\nbetween the names ‘Mark Twain’ and ‘Samuel\nClemens’. As their references do not differ, sense is distinct\nfrom reference.\n\n\nAn expression's sense is intended to capture its cognitive\nvalue. The above argument is intended to show that \ncoreferential proper names can present the same object in different\nways and it can be a cognitive achievement to come to learn that the\nobject presented in those different ways is one and the\nsame. Reference alone, Frege persuasively argued, cannot capture\ncognitive value. Capturing the cognitive significance of an expression\nis a primary role senses played in Frege's system. But they also\nplayed several other roles as well: They are the primary bearers of\ntruth values, the indirect references of sentences and hence the\nobjects denoted by that clauses like ‘that Frege denied the\nexistence of singular propositions’, and the objects of\npropositional attitudes, most importantly. These roles give rise to\nthe following theses concerning the individuation of senses.\n\nTruth \nIf two sentences have different truth values, then they have different senses.\n\n\nAccept  For any pair of sentences,\ns1 and s2, if a competent\nspeaker can rationally, reflectively, and sincerely accept\ns1 while rejecting s2, then\ns1 and s2 have different\nsenses.\n\nAttitude \n For any pair of sentences, s1 and\ns2, and propositional attitude verb Vs, if\nthe truth of\n ⌈a\n Vs that\n s1⌉\n is consistent with the falsity of\n ⌈a\n Vs that \n s2⌉, then s1\nand s2 have different senses.\n\n\nFrege's case for the sense-reference distinction is also a case that\nsingular propositions are not the semantic contents of natural\nlanguage sentences and are not the objects of the propositional\nattitudes. Singular propositions are too coarse-grained to account for\nwhat a competent speaker understands in virtue of grasping the meaning\nof a sentence. But the content of a sentence is, intuitively, what an\nagent grasps when she understands a sentence and what she believes\nwhen she accepts it. Frege concluded that singular propositions are\nill-suited for the purposes of semantics and psychology, as they lead\nto violations of Accept and\nAttitude. (For further discussion, see the entry\n Frege.) \n\nBertrand Russell's views of language and thought are\nimportantly different from Frege's. (Russell held many distinct\nviews. We focus here on the Russell roughly from 1905 through 1912.)\nFirst, Russell held an acquaintance-based theory, according to which\nsome thought about individuals is direct, in the sense of involving\nsingular propositions involving those very individuals. Second,\nwhereas Frege introduced senses to help solve the puzzles discussed\nabove, Russell employed logical analysis and his theory of definite\ndescriptions. We take each point in turn.\n\n\nRussell maintained that an agent must be acquainted with every\nconstituent of a thought that she is in a position to entertain. Call\nthis the Acquaintance Principle. (The principle makes an\nappearance in (1905), but the view behind the principle is\nworked out in (1910) and (1912).) Russell thought that we are\nacquainted only with our occurrent sense data and universals (and he\nsometimes included the self, when he wasn't feeling skeptical of\nawareness of the self as an entity). So, Russell maintained that the\nonly singular propositions we can grasp are ones with those items as\nconstituents.\n\n\nWe can trace the fundamental source of Russell's restrictivism about\nacquaintance to the claim that one is acquainted only with that for\nwhich misidentification is rationally impossible. If it is possible\nfor one to be presented with o twice over and\nrationally not realize it as the same object, then one is not\nacquainted with o; one's thoughts about\no are, in that case, indirect. This line of reasoning\nrelies on the Fregean claim that identity confusions are to be\nexplained in terms of differences in thought constituents. Our English\nstudent's confusion regarding Mark Twain is thus to be explained in\nterms of different thoughts and hence different thought constituents\ncorresponding to the different ways of thinking about the man Mark\nTwain associated with the expressions ‘Mark Twain’ and\n‘Samuel Clemens’. This — that cases of\nmisidentification always involve differences in thought contents\n— marks an important point of agreement between Frege and\nRussell.\n\n\nNeo-Russellians are more permissive about the objects of acquaintance,\nincluding extra-mental particulars in this class. David Kaplan's\npioneering work (1977/1989) is typically the starting point, although\nRussell himself started out with such a position, maintaining, for\nexample, that Mont Blanc itself is a constituent of the thought that\nMont Blanc has snowfields. Neo-Russellians must deny the Fregean claim\nthat whenever misidentification is rationally possible, there is a\ndifference in thought constituents. They might still agree with\nFregean intuitions about the truth and falsity of propositional\nattitude ascribing sentences — agreeing, for example, that\n‘Peter believes that Mark Twain was a famous American\nauthor’ is true while ‘Peter believes that Samuel Clemens\nwas a famous American author’ is false — claiming that\nthis does not require a difference at the level of thought\nconstituents, following, for example, Mark Crimmins and John Perry\n(1989) or Mark Richard (1990). Such neo-Russellians claim that the\ntruth or falsity of a belief attitude ascribing sentence involves more\nthan just the agent of the report having among her beliefs the\nproposition expressed by the sentence embedded in the reporting\nsentence. Alternatively, the neo-Russellian might deny the Fregean\nintuitions about the truth and falsity of propositional attitude\nascribing sentences, following, for example, Nathan Salmon (1986) in\naccounting for those intuitions in nonsemantic terms. (For further\ndiscussion, see propositional\nattitude reports.)  Either way, however, given that\nmisidentification of extra-mental particulars is obviously possible,\nthe permissive theory of acquaintance requires denying the claim that\nall cases of misidentification involve differences in thought\nconstituents.\n\n\nWe have seen how Russell's adherence to the Acquaintance Principle\ntogether with his adoption of a Fregean attitude towards\nmisidentification led him to deny that we can think directly about\nextra-mental particulars. Russell admitted that there is an\nextra-mental reality filled with extra-mental particulars that we can\nand do think about. Like Frege, all such thought, Russell insisted, is\nindirect. But Russell did not follow Frege in introducing senses as\nthe mediators between individuals and our thought about them. Rather,\nRussell appealed to logical analysis through his theory of\ndescriptions. For Russell, all thought about extra-mental particulars\nis descriptive. In (1910), the canonical form such thought\ntook is the following: The thing that caused THIS\n[demonstratively referring to one's occurrent sense datum] is\nsuch-and-such, which is singular with respect to the sense datum\ndemonstrated. We can work up to this by seeing how Russell contrasted\nthree thoughts about Bismarck to the effect that he unified Germany\n(1910, 114–17). First, assuming acquaintance with the self, there is\nBismarck's own thought about himself. This thought is singular with\nrespect to Bismarck, having as its content the singular proposition\n[Bismarck unified Germany]. “But if a person who knew Bismarck\nmade a judgment about him, the case is different. What this person was\nacquainted with were certain sense data which he connected (rightly,\nwe will suppose) with Bismarck's body” (114). No human but\nBismarck, then, can grasp this singular proposition. Someone that has\nperceived Bismarck, say, Wilhelm II, has a thought with the following\nform, where BOB is the sense datum the agent has in virtue of his\nperception of Bismarck.\n\n <[the x: x has a body that is the cause of BOB]\n x unified Germany>\n\n\nThis proposition is particularized with respect to Bismarck, but\ndirect and thus singular only with respect to the occurrent sense\ndatum being demonstratively referred to. Finally, contrast this\njudgment with someone who has never perceived Bismarck but has only\nheard about him indirectly. Such agents cannot relate Bismarck\ndirectly to their sense data because, unlike Wilhelm, none of their\nsense data are caused by Bismarck's body. Hence, they must either\nthink of him purely qualitatively — as, say, the first\nChancellor of the German Empire, treating the German Empire\nas if it were a purely qualitative condition — or more\nindirectly, as the person written about in the books causing these\nsense data, thought standing in front of the books that are the source\nof the agents' thoughts about Bismarck. \n\n\nFor Russell, sense data are the direct objects of thought in terms of\nwhich we think about extra-mental reality under descriptions relating,\ntypically causally, those bits of reality to the directly referred to\nsense data. (It is worth noting that the basic idea does not require\nRussell's theory of perception. For example, John Searle, in (1983),\nhas a similar view according to which we think immediately about\nexperiences, which are not analyzed in terms of the mind's being\npresented with sense data. We then think of extra-mental objects as\nthe causes of such and such occurrent experiences.) For Russell, while\nthere are thoughts about particulars that are wholly qualitative and\nwholly general, the paradigm form our thought about external reality\ntakes is ultimately grounded in acquaintance, albeit acquaintance with\nsense data as opposed to extra-mental reality itself. This is in stark\ncontrast to the canonical form such thought takes in Frege's system,\nin which there is no direct reference to any individuals, including\nsense data, and all thought is entirely indirect. (For further\ndiscussion, see the entries\n Bertrand Russell,\n knowledge by acquaintance vs. description, and\n descriptions.)\n \nRussell rejected Frege's distinction between sense and reference\nand attempted to solve the problems motivating that distinction\nthrough logical analysis and scope distinctions. The resulting view is\none on which the proposition expressed by a sentence like ‘The\ninventor of bifocals was bald’ has neither a Fregean sense nor\nthe referent of the subject-position term as a constituent. Instead,\nRussell had propositional functions — functions from objects to\npropositions — in place of senses.  Yet at the bottom level such\na view seems to require singular propositions, which are the basic or\natomic propositions upon which the complex propositions are\nbuilt. Frege's atomic propositions are composed of senses while\nRussell's require individuals.\n",
    "section_title": "1. Fregeanism and Russellianism",
    "entry_title": "Singular Propositions",
    "hierarchy_title": "Singular Propositions || Fregeanism and Russellianism",
    "tokenized_text": [
        "fregeanism",
        "russellianism",
        "fregeanism",
        "russellianism",
        "assume",
        "without",
        "argument",
        "propositionalist",
        "semantics",
        "according",
        "sentence",
        "context",
        "assigned",
        "proposition",
        "content",
        "primary",
        "bearer",
        "truth",
        "value",
        "bearer",
        "modal",
        "property",
        "like",
        "contingency",
        "necessity",
        "object",
        "propositional",
        "attitude",
        "like",
        "believing",
        "hoping",
        "saying",
        "distinguish",
        "two",
        "broad",
        "class",
        "theory",
        "proposition",
        "proponent",
        "first",
        "fregean",
        "view",
        "accept",
        "frege",
        "s",
        "distinction",
        "sense",
        "reference",
        "proponent",
        "second",
        "russellian",
        "view",
        "fregeanism",
        "true",
        "thought",
        "concrete",
        "individual",
        "indirect",
        "mediated",
        "sens",
        "independent",
        "individual",
        "maintain",
        "frege",
        "recognized",
        "de",
        "sens",
        "sens",
        "whose",
        "existence",
        "identity",
        "dependent",
        "upon",
        "reference",
        "content",
        "proper",
        "name",
        "case",
        "would",
        "subscribed",
        "fregean",
        "theory",
        "characterized",
        "supplementary",
        "document",
        "evans",
        "frege",
        "contains",
        "discussion",
        "easiest",
        "way",
        "get",
        "grip",
        "think",
        "sens",
        "purely",
        "qualitative",
        "satisfaction",
        "condition",
        "condition",
        "determines",
        "object",
        "virtue",
        "quality",
        "instantiates",
        "according",
        "russellianism",
        "hand",
        "think",
        "individual",
        "directly",
        "thought",
        "individual",
        "individual",
        "immediate",
        "constituent",
        "thought",
        "standard",
        "interpretation",
        "frege",
        "individual",
        "constituent",
        "proposition",
        "proposition",
        "composed",
        "sens",
        "individual",
        "sens",
        "individuated",
        "independently",
        "individual",
        "fregeanism",
        "true",
        "singular",
        "proposition",
        "russellianism",
        "true",
        "singular",
        "proposition",
        "play",
        "crucial",
        "role",
        "semantics",
        "complete",
        "theory",
        "thought",
        "discussing",
        "reason",
        "singular",
        "proposition",
        "begin",
        "brief",
        "discussion",
        "view",
        "historical",
        "frege",
        "russell",
        "hope",
        "discussion",
        "provide",
        "clearer",
        "understanding",
        "view",
        "outlined",
        "gottlob",
        "frege",
        "famously",
        "distinguished",
        "expression",
        "s",
        "reference",
        "sense",
        "classic",
        "source",
        "frege",
        "distinction",
        "first",
        "introduced",
        "year",
        "earlier",
        "commonly",
        "thought",
        "frege",
        "asserts",
        "much",
        "sensereference",
        "distinction",
        "present",
        "early",
        "work",
        "contain",
        "seeming",
        "anticipation",
        "distinction",
        "well",
        "argument",
        "opening",
        "paragraph",
        "metalinguistic",
        "solution",
        "promoted",
        "extremely",
        "puzzling",
        "nt",
        "try",
        "resolve",
        "interpretative",
        "issue",
        "focus",
        "proper",
        "name",
        "although",
        "frege",
        "maintained",
        "sensereference",
        "distinction",
        "applied",
        "expression",
        "including",
        "sentence",
        "reference",
        "sentence",
        "truth",
        "value",
        "sense",
        "thought",
        "reference",
        "name",
        "mark",
        "twain",
        "man",
        "mark",
        "twain",
        "sense",
        "mode",
        "presentation",
        "way",
        "thinking",
        "object",
        "frege",
        "argued",
        "distinctness",
        "sense",
        "reference",
        "follows",
        "suppose",
        "reductio",
        "sole",
        "semantic",
        "value",
        "name",
        "mark",
        "twain",
        "reference",
        "name",
        "samuel",
        "clemens",
        "coreferential",
        "two",
        "name",
        "would",
        "identical",
        "semantic",
        "value",
        "given",
        "plausible",
        "assumption",
        "compositionality",
        "sentence",
        "mark",
        "twain",
        "famous",
        "american",
        "author",
        "samuel",
        "clemens",
        "famous",
        "american",
        "author",
        "would",
        "express",
        "proposition",
        "counterintuitive",
        "seems",
        "fully",
        "competent",
        "speaker",
        "believe",
        "one",
        "express",
        "without",
        "believing",
        "express",
        "imagine",
        "agent",
        "american",
        "literature",
        "class",
        "read",
        "huck",
        "finn",
        "tom",
        "sawyer",
        "biographical",
        "fact",
        "withheld",
        "accept",
        "first",
        "sentence",
        "reject",
        "second",
        "two",
        "sentence",
        "express",
        "different",
        "proposition",
        "express",
        "different",
        "proposition",
        "must",
        "semantically",
        "relevant",
        "difference",
        "name",
        "mark",
        "twain",
        "samuel",
        "clemens",
        "reference",
        "differ",
        "sense",
        "distinct",
        "reference",
        "expression",
        "s",
        "sense",
        "intended",
        "capture",
        "cognitive",
        "value",
        "argument",
        "intended",
        "show",
        "coreferential",
        "proper",
        "name",
        "present",
        "object",
        "different",
        "way",
        "cognitive",
        "achievement",
        "come",
        "learn",
        "object",
        "presented",
        "different",
        "way",
        "one",
        "reference",
        "alone",
        "frege",
        "persuasively",
        "argued",
        "capture",
        "cognitive",
        "value",
        "capturing",
        "cognitive",
        "significance",
        "expression",
        "primary",
        "role",
        "sens",
        "played",
        "frege",
        "s",
        "system",
        "also",
        "played",
        "several",
        "role",
        "well",
        "primary",
        "bearer",
        "truth",
        "value",
        "indirect",
        "reference",
        "sentence",
        "hence",
        "object",
        "denoted",
        "clause",
        "like",
        "frege",
        "denied",
        "existence",
        "singular",
        "proposition",
        "object",
        "propositional",
        "attitude",
        "importantly",
        "role",
        "give",
        "rise",
        "following",
        "thesis",
        "concerning",
        "individuation",
        "sens",
        "truth",
        "two",
        "sentence",
        "different",
        "truth",
        "value",
        "different",
        "sens",
        "accept",
        "pair",
        "sentence",
        "s",
        "s",
        "competent",
        "speaker",
        "rationally",
        "reflectively",
        "sincerely",
        "accept",
        "s",
        "rejecting",
        "s",
        "s",
        "s",
        "different",
        "sens",
        "attitude",
        "pair",
        "sentence",
        "s",
        "s",
        "propositional",
        "attitude",
        "verb",
        "v",
        "truth",
        "a",
        "v",
        "s",
        "consistent",
        "falsity",
        "a",
        "v",
        "s",
        "s",
        "s",
        "different",
        "sens",
        "frege",
        "s",
        "case",
        "sensereference",
        "distinction",
        "also",
        "case",
        "singular",
        "proposition",
        "semantic",
        "content",
        "natural",
        "language",
        "sentence",
        "object",
        "propositional",
        "attitude",
        "singular",
        "proposition",
        "coarsegrained",
        "account",
        "competent",
        "speaker",
        "understands",
        "virtue",
        "grasping",
        "meaning",
        "sentence",
        "content",
        "sentence",
        "intuitively",
        "agent",
        "grasp",
        "understands",
        "sentence",
        "belief",
        "accepts",
        "frege",
        "concluded",
        "singular",
        "proposition",
        "illsuited",
        "purpose",
        "semantics",
        "psychology",
        "lead",
        "violation",
        "accept",
        "attitude",
        "discussion",
        "see",
        "entry",
        "frege",
        "bertrand",
        "russell",
        "s",
        "view",
        "language",
        "thought",
        "importantly",
        "different",
        "frege",
        "s",
        "russell",
        "held",
        "many",
        "distinct",
        "view",
        "focus",
        "russell",
        "roughly",
        "first",
        "russell",
        "held",
        "acquaintancebased",
        "theory",
        "according",
        "thought",
        "individual",
        "direct",
        "sense",
        "involving",
        "singular",
        "proposition",
        "involving",
        "individual",
        "second",
        "whereas",
        "frege",
        "introduced",
        "sens",
        "help",
        "solve",
        "puzzle",
        "discussed",
        "russell",
        "employed",
        "logical",
        "analysis",
        "theory",
        "definite",
        "description",
        "take",
        "point",
        "turn",
        "russell",
        "maintained",
        "agent",
        "must",
        "acquainted",
        "every",
        "constituent",
        "thought",
        "position",
        "entertain",
        "call",
        "acquaintance",
        "principle",
        "principle",
        "make",
        "appearance",
        "view",
        "behind",
        "principle",
        "worked",
        "russell",
        "thought",
        "acquainted",
        "occurrent",
        "sense",
        "data",
        "universal",
        "sometimes",
        "included",
        "self",
        "nt",
        "feeling",
        "skeptical",
        "awareness",
        "self",
        "entity",
        "russell",
        "maintained",
        "singular",
        "proposition",
        "grasp",
        "one",
        "item",
        "constituent",
        "trace",
        "fundamental",
        "source",
        "russell",
        "s",
        "restrictivism",
        "acquaintance",
        "claim",
        "one",
        "acquainted",
        "misidentification",
        "rationally",
        "impossible",
        "possible",
        "one",
        "presented",
        "twice",
        "rationally",
        "realize",
        "object",
        "one",
        "acquainted",
        "one",
        "s",
        "thought",
        "case",
        "indirect",
        "line",
        "reasoning",
        "relies",
        "fregean",
        "claim",
        "identity",
        "confusion",
        "explained",
        "term",
        "difference",
        "thought",
        "constituent",
        "english",
        "student",
        "s",
        "confusion",
        "regarding",
        "mark",
        "twain",
        "thus",
        "explained",
        "term",
        "different",
        "thought",
        "hence",
        "different",
        "thought",
        "constituent",
        "corresponding",
        "different",
        "way",
        "thinking",
        "man",
        "mark",
        "twain",
        "associated",
        "expression",
        "mark",
        "twain",
        "samuel",
        "clemens",
        "case",
        "misidentification",
        "always",
        "involve",
        "difference",
        "thought",
        "content",
        "mark",
        "important",
        "point",
        "agreement",
        "frege",
        "russell",
        "neorussellians",
        "permissive",
        "object",
        "acquaintance",
        "including",
        "extramental",
        "particular",
        "class",
        "david",
        "kaplan",
        "s",
        "pioneering",
        "work",
        "typically",
        "starting",
        "point",
        "although",
        "russell",
        "started",
        "position",
        "maintaining",
        "example",
        "mont",
        "blanc",
        "constituent",
        "thought",
        "mont",
        "blanc",
        "snowfield",
        "neorussellians",
        "must",
        "deny",
        "fregean",
        "claim",
        "whenever",
        "misidentification",
        "rationally",
        "possible",
        "difference",
        "thought",
        "constituent",
        "might",
        "still",
        "agree",
        "fregean",
        "intuition",
        "truth",
        "falsity",
        "propositional",
        "attitude",
        "ascribing",
        "sentence",
        "agreeing",
        "example",
        "peter",
        "belief",
        "mark",
        "twain",
        "famous",
        "american",
        "author",
        "true",
        "peter",
        "belief",
        "samuel",
        "clemens",
        "famous",
        "american",
        "author",
        "false",
        "claiming",
        "require",
        "difference",
        "level",
        "thought",
        "constituent",
        "following",
        "example",
        "mark",
        "crimmins",
        "john",
        "perry",
        "mark",
        "richard",
        "neorussellians",
        "claim",
        "truth",
        "falsity",
        "belief",
        "attitude",
        "ascribing",
        "sentence",
        "involves",
        "agent",
        "report",
        "among",
        "belief",
        "proposition",
        "expressed",
        "sentence",
        "embedded",
        "reporting",
        "sentence",
        "alternatively",
        "neorussellian",
        "might",
        "deny",
        "fregean",
        "intuition",
        "truth",
        "falsity",
        "propositional",
        "attitude",
        "ascribing",
        "sentence",
        "following",
        "example",
        "nathan",
        "salmon",
        "accounting",
        "intuition",
        "nonsemantic",
        "term",
        "discussion",
        "see",
        "propositional",
        "attitude",
        "report",
        "either",
        "way",
        "however",
        "given",
        "misidentification",
        "extramental",
        "particular",
        "obviously",
        "possible",
        "permissive",
        "theory",
        "acquaintance",
        "requires",
        "denying",
        "claim",
        "case",
        "misidentification",
        "involve",
        "difference",
        "thought",
        "constituent",
        "seen",
        "russell",
        "s",
        "adherence",
        "acquaintance",
        "principle",
        "together",
        "adoption",
        "fregean",
        "attitude",
        "towards",
        "misidentification",
        "led",
        "deny",
        "think",
        "directly",
        "extramental",
        "particular",
        "russell",
        "admitted",
        "extramental",
        "reality",
        "filled",
        "extramental",
        "particular",
        "think",
        "like",
        "frege",
        "thought",
        "russell",
        "insisted",
        "indirect",
        "russell",
        "follow",
        "frege",
        "introducing",
        "sens",
        "mediator",
        "individual",
        "thought",
        "rather",
        "russell",
        "appealed",
        "logical",
        "analysis",
        "theory",
        "description",
        "russell",
        "thought",
        "extramental",
        "particular",
        "descriptive",
        "canonical",
        "form",
        "thought",
        "took",
        "following",
        "thing",
        "caused",
        "demonstratively",
        "referring",
        "one",
        "s",
        "occurrent",
        "sense",
        "datum",
        "suchandsuch",
        "singular",
        "respect",
        "sense",
        "datum",
        "demonstrated",
        "work",
        "seeing",
        "russell",
        "contrasted",
        "three",
        "thought",
        "bismarck",
        "effect",
        "unified",
        "germany",
        "first",
        "assuming",
        "acquaintance",
        "self",
        "bismarck",
        "s",
        "thought",
        "thought",
        "singular",
        "respect",
        "bismarck",
        "content",
        "singular",
        "proposition",
        "bismarck",
        "unified",
        "germany",
        "person",
        "knew",
        "bismarck",
        "made",
        "judgment",
        "case",
        "different",
        "person",
        "acquainted",
        "certain",
        "sense",
        "data",
        "connected",
        "rightly",
        "suppose",
        "bismarck",
        "s",
        "body",
        "human",
        "bismarck",
        "grasp",
        "singular",
        "proposition",
        "someone",
        "perceived",
        "bismarck",
        "say",
        "wilhelm",
        "ii",
        "thought",
        "following",
        "form",
        "bob",
        "sense",
        "datum",
        "agent",
        "virtue",
        "perception",
        "bismarck",
        "x",
        "x",
        "body",
        "cause",
        "bob",
        "x",
        "unified",
        "germany",
        "proposition",
        "particularized",
        "respect",
        "bismarck",
        "direct",
        "thus",
        "singular",
        "respect",
        "occurrent",
        "sense",
        "datum",
        "demonstratively",
        "referred",
        "finally",
        "contrast",
        "judgment",
        "someone",
        "never",
        "perceived",
        "bismarck",
        "heard",
        "indirectly",
        "agent",
        "relate",
        "bismarck",
        "directly",
        "sense",
        "data",
        "unlike",
        "wilhelm",
        "none",
        "sense",
        "data",
        "caused",
        "bismarck",
        "s",
        "body",
        "hence",
        "must",
        "either",
        "think",
        "purely",
        "qualitatively",
        "say",
        "first",
        "chancellor",
        "german",
        "empire",
        "treating",
        "german",
        "empire",
        "purely",
        "qualitative",
        "condition",
        "indirectly",
        "person",
        "written",
        "book",
        "causing",
        "sense",
        "data",
        "thought",
        "standing",
        "front",
        "book",
        "source",
        "agent",
        "thought",
        "bismarck",
        "russell",
        "sense",
        "data",
        "direct",
        "object",
        "thought",
        "term",
        "think",
        "extramental",
        "reality",
        "description",
        "relating",
        "typically",
        "causally",
        "bit",
        "reality",
        "directly",
        "referred",
        "sense",
        "data",
        "worth",
        "noting",
        "basic",
        "idea",
        "require",
        "russell",
        "s",
        "theory",
        "perception",
        "example",
        "john",
        "searle",
        "similar",
        "view",
        "according",
        "think",
        "immediately",
        "experience",
        "analyzed",
        "term",
        "mind",
        "s",
        "presented",
        "sense",
        "data",
        "think",
        "extramental",
        "object",
        "cause",
        "occurrent",
        "experience",
        "russell",
        "thought",
        "particular",
        "wholly",
        "qualitative",
        "wholly",
        "general",
        "paradigm",
        "form",
        "thought",
        "external",
        "reality",
        "take",
        "ultimately",
        "grounded",
        "acquaintance",
        "albeit",
        "acquaintance",
        "sense",
        "data",
        "opposed",
        "extramental",
        "reality",
        "stark",
        "contrast",
        "canonical",
        "form",
        "thought",
        "take",
        "frege",
        "s",
        "system",
        "direct",
        "reference",
        "individual",
        "including",
        "sense",
        "data",
        "thought",
        "entirely",
        "indirect",
        "discussion",
        "see",
        "entry",
        "bertrand",
        "russell",
        "knowledge",
        "acquaintance",
        "vs",
        "description",
        "description",
        "russell",
        "rejected",
        "frege",
        "s",
        "distinction",
        "sense",
        "reference",
        "attempted",
        "solve",
        "problem",
        "motivating",
        "distinction",
        "logical",
        "analysis",
        "scope",
        "distinction",
        "resulting",
        "view",
        "one",
        "proposition",
        "expressed",
        "sentence",
        "like",
        "inventor",
        "bifocals",
        "bald",
        "neither",
        "fregean",
        "sense",
        "referent",
        "subjectposition",
        "term",
        "constituent",
        "instead",
        "russell",
        "propositional",
        "function",
        "function",
        "object",
        "proposition",
        "place",
        "sens",
        "yet",
        "bottom",
        "level",
        "view",
        "seems",
        "require",
        "singular",
        "proposition",
        "basic",
        "atomic",
        "proposition",
        "upon",
        "complex",
        "proposition",
        "built",
        "frege",
        "s",
        "atomic",
        "proposition",
        "composed",
        "sens",
        "russell",
        "s",
        "require",
        "individual"
    ]
}