{
    "main_text": "The Traditional Solution\n6. The Traditional Solution\n\nIf the views considered thus far all fail, theists have no choice but\nto place the decisions and willings of rational creatures under\nGod’s creative authority. Only by so doing is it possible to\nrestore to him complete control over the course of events in the\nworld, and only in this way can he know as creator what world\nhe is creating, and so be omniscient. If all of our decisions and\nactions occur by God’s creative decree, then all possible worlds\nare made feasible for him. He can create as he wishes, with full\nassurance as to the outcome. And he can know how things will go, in\nparticular how we will decide and act, simply by knowing his own\nintentions as to what our decisions and actions will be. Clearly,\nthere are respects in which this approach is to be preferred. From the\nperspective of piety, the versions of the free will defense we have\nseen so far are all troublesome: they seem to place our concern for\nourselves above our regard for God, by maximizing our options at the\nexpense of his. One can readily anticipate the response that if\ncomplete sovereignty for God and libertarian freedom for his creatures\ncannot both be had, then the devout (not to say Godfearing)\nphilosopher would be well served to endorse the former, that anything\nless is not just out of keeping with the mainstream of theological\ntradition, but actually borders on blasphemy. Yet we have seen that\nfree creatures are of greater value than the unfree, if only because\ntheir greater likeness to God makes them a desirable enhancement to\ncreation. The question, then, is whether placing our decisions and\nactions under God’s creative fiat leaves in place\nanything of creaturely freedom, or of the free will defense.\n\nIt may seem obvious that neither can survive: that once the operations\nof creaturely wills are subordinated to God’s will, libertarian\nfreedom disappears, and with it any hope of absolving God of moral\nevil. But at least where freedom is concerned, traditional theology\nasserts the opposite. Augustine, for example, held that God moves our\nwills, working in us both to will and to do of his good pleasure, as\nscripture says (Phil. 2:13). Yet he insists that this does not\ndiminish our freedom, for if it did we would not be told in the same\npassage to work out our salvation in fear and trembling (On Grace\nand Free Will, 750). Similarly, Thomas Aquinas maintains that all\nof our doings, even those in which we sin, are on a par with the rest\nof creation in having God as their first cause. Only the defect of\nthose actions which is their sinfulness derives from us. Sin, he says,\nis like limping, in which the defective motion arises from the\ncrookedness of the limb, rather than the power of locomotion that\nimpels it (Summa Theologica I-II, Q. 79, Art 2). Like\nAugustine, moreover, Aquinas sees no conflict between God’s\nactivity as creator and ours as free creatures. On the contrary: he\nholds that God’s activity as first cause is actually the cause\nof our freedom, since he moves us in accordance with our voluntary\nnature (Summa Theologica I-II, Q. 18, Art 1, ad 3).\nWhat to make of these suggestions is, however, less than clear. In\nAugustine’s case it may be argued that his later writings\nabandon any earlier flirtation with libertarian ideas, so that the\nnotion of freedom endorsed in the passage referrred to above is in\nfact a version of what today is known as compatibilism (Baker 2003).\nWith Aquinas, however, the situation is less clear (Stump 2003, ch.\n9). Much turns on how it might be possible for God to move us in a way\nthat is truly consistent with our voluntary nature, where\n“voluntary is taken to signify libertarian freedom”. And\nit has to be said that Aquinas offers little by way of explanation.\nThere is, however, an interesting suggestion in the Summa Contra\nGentiles, where Thomas maintains that if the will were moved by\nan external principle as agent, the movement would be violent, and\nthen proceeds to the conclusion that God alone is able to\nmove the creaturely will as agent without violence, since he alone is\nthe cause and sustainer of its being, and thus is able to move it from\nwithin (Book III, Ch. 88).\n\nThere are two things that may be said in favor of this suggestion here\n(see also McCann 1995 and 2005, Shanley 1998, and Grant 2010 and\n2017). The first concerns libertarian free agency itself, which is\noften portrayed as a power by which we cause, or confer existence\nupon, our own actions. Such a view would not accord with\nAquinas’s claim that only God can move the creaturely will in\nthis way, and in fact it is hard to see how this portrayal of agency\ncan be right. If I confer existence on my decision to attend the\nconcert tonight, I must do so either through some act separate from\nthe decision, or as an aspect of the decision itself. If it is through\na separate act, the problem of freedom simply shifts its location. We\nhave to be convinced that this act in turn receives its existence from\nme, and we appear headed for a vicious regress. But neither does it\nseem possible for me to confer existence on my act of deciding as an\naspect of the act itself. For prior to the act’s appearance\nthere is nothing to do the conferring, and once it appears, the\nconferral is no longer needed. So whatever agency and voluntariness\nconsist in, it does not appear to be an ability to confer existence on\nour own actions. That is important, because it means that unless we\ncan find a way to ground libertarian freedom in the creative activity\nof God, the decisions and actions in which it is manifested are likely\nto have no cause, no accounting whatever — a situation\nfew philosophers are likely to find satisfying, and which hardly puts\nme in control of my act of\n deciding.[7]\n\nA second important consideration has to do with the relationship\nbetween God’s creative will and the things he creates. We are\nprone to think of this as an event-causal relation, in which God\nissues a kind of command, and the command in turn produces the\nmandated effect. Applied to our example, this would mean that God\ncreatively wills that I decide to attend the concert, and his willing\nthen causes me to decide. And of course this sounds exactly like what\nAquinas describes as the violent operation of an external principle.\nOn this scenario my deciding is passive, and hence involuntary,\nbecause God’s creative fiat is an event independent of\nmy decision, which by acting upon me robs me of my autonomy. I am\nreduced to a puppet manipulated by God, rather than a free agent.\nClearly, however, this scenario does not reflect the way Aquinas\nthinks creation works, and on that score there is reason to think\nAquinas is right. For consider again the causal relation alleged to\nobtain between God’s willing and mine. Whatever we take this to\nconsist in, it must exist contingently, for causal connections are not\nnecessary beings. But then this supposed causal connection must also\nbe created by God, and if that occurs through another process of\ncommand and causation, we would be facing another regress. The only\nway out is to hold that God directly creates the causal nexus\n— which is to say that in its creation, the nexus itself, not\nsome command, is the first manifestation of God’s\ncreative activity. But if God’s creative will can be directly\nefficacious in this task, then it can also be so in his creation of us\nand our actions. There is, then, no need for a nexus to explain the\nefficacy of God’s creative will, nor is there any causal\ndistance whatever between God and either us or our behavior. Rather,\nwe and all that we do have our being in God, and the first\nmanifestation of his creative activity regarding our decisions and\nactions is nothing short of the acts themselves. This is why it may be\nmisleading to call this traditional view by its common name,\n“theological determinism,” because the sort of\ndetermination involved in God’s providential ordering of\ncreation is very different than ordinary causal determination within\nthe created order.\n\nA useful analogy that may be drawn here is to the relationship between\nthe author of a story, and the characters within it. The author does\nnot enter into the story herself, nor does she act upon the\ncharacters in such a way as to force them to do the things they do.\nRather, she creates them in their doings, so that they are\nable to behave freely in the world of the novel. On the traditional\naccount, God’s relation to his creatures is similar. As creator,\nhe is the “first cause” of us and of our actions, but his\ncausality works in such a way that we are not acted upon, and\nso are able to exercise our wills freely in deciding and acting. If\nthis is correct, then as Aquinas at least seems to suggest,\nGod’s creative activity does not violate libertarian freedom,\nfor it does not count as an independent determining condition of\ncreaturely decision and action. On the contrary: assuming God’s\nown will is free, there is no event in heaven or earth that is\nindependent of my deciding to attend the concert tonight, and which\ncauses my decision. God’s creative activity does not act upon me\nor render me passive in any way, for it consists solely in God’s\nfreely giving himself over to being the ground of being for\nme and all that I do. Accordingly, I can still display libertarian\nfreedom. My decision is a spontaneous display of creaturely agency,\nfree in the libertarian sense because it does not occur through event\ncausality, and because in it I am fully and intentionally committed\nboth to deciding and to deciding exactly as I do. There are no further\nlegitimate requirements for libertarian freedom. There is, of course,\nsomething that cannot happen on this view: it is not possible for\nGod’s activity as creator to be devoted to my deciding to attend\nthe concert, and yet that I should forebear to decide at all, or\ndecide to do something else. But that is not because if I were to try\nit, I would find myself in a losing battle with God’s\nefficacious will. It is because there is no manifestation of that will\nregarding my decision short of the decision itself. The impossibility\nthat God’s will as creator and mine as creature should diverge\nsuggests trouble because we can view what goes on either from\nGod’s perspective or from mine. That suggests two events, and a\npotential conflict between them. Properly interpreted, however, the\ntraditional view appears to call for only one event, and as far as\nit is concerned, all the impossibility comes to is that I\ncannot at once both make a decision and not make it. To be incapable\nof the logically impossible is not a failure of freedom, libertarian\nor otherwise.\n\nSo far it has been argued that theological determinism, by virtue of\nthe nature of the determination involved (which may yield the result\nthat it is even misleading to describe it as determination at all),\nmay well be compatible with a basically libertarian view of free will.\nAn alternative for proponents of theological determinism is to accept\na classically compatibilist view of free will, according to which\nfreedom is compatible even with determination by causal factors within\nthe created order, so long as those causal factors are of the right\nsort. The most famous proponent of such a view is Jonathan Edwards,\nand such views are common in the contemporary free will literature.\nThis discussion will proceed by focusing on the libertarian view of\nthe will, but many of the same approaches can be taken by the\ncompatibilist as well.\n",
    "section_title": "6. The Traditional Solution",
    "entry_title": "Divine Providence",
    "hierarchy_title": "Divine Providence || The Traditional Solution",
    "tokenized_text": [
        "traditional",
        "solution",
        "traditional",
        "solution",
        "view",
        "considered",
        "thus",
        "far",
        "fail",
        "theist",
        "choice",
        "place",
        "decision",
        "willing",
        "rational",
        "creature",
        "god",
        "creative",
        "authority",
        "possible",
        "restore",
        "complete",
        "control",
        "course",
        "event",
        "world",
        "way",
        "know",
        "creator",
        "world",
        "creating",
        "omniscient",
        "decision",
        "action",
        "occur",
        "god",
        "creative",
        "decree",
        "possible",
        "world",
        "made",
        "feasible",
        "create",
        "wish",
        "full",
        "assurance",
        "outcome",
        "know",
        "thing",
        "go",
        "particular",
        "decide",
        "act",
        "simply",
        "knowing",
        "intention",
        "decision",
        "action",
        "clearly",
        "respect",
        "approach",
        "preferred",
        "perspective",
        "piety",
        "version",
        "free",
        "defense",
        "seen",
        "far",
        "troublesome",
        "seem",
        "place",
        "concern",
        "regard",
        "god",
        "maximizing",
        "option",
        "expense",
        "one",
        "readily",
        "anticipate",
        "response",
        "complete",
        "sovereignty",
        "god",
        "libertarian",
        "freedom",
        "creature",
        "devout",
        "say",
        "godfearing",
        "philosopher",
        "would",
        "well",
        "served",
        "endorse",
        "former",
        "anything",
        "le",
        "keeping",
        "mainstream",
        "theological",
        "tradition",
        "actually",
        "border",
        "blasphemy",
        "yet",
        "seen",
        "free",
        "creature",
        "greater",
        "value",
        "unfree",
        "greater",
        "likeness",
        "god",
        "make",
        "desirable",
        "enhancement",
        "creation",
        "question",
        "whether",
        "placing",
        "decision",
        "action",
        "god",
        "creative",
        "fiat",
        "leaf",
        "place",
        "anything",
        "creaturely",
        "freedom",
        "free",
        "defense",
        "may",
        "seem",
        "obvious",
        "neither",
        "survive",
        "operation",
        "creaturely",
        "will",
        "subordinated",
        "god",
        "libertarian",
        "freedom",
        "disappears",
        "hope",
        "absolving",
        "god",
        "moral",
        "evil",
        "least",
        "freedom",
        "concerned",
        "traditional",
        "theology",
        "asserts",
        "opposite",
        "augustine",
        "example",
        "held",
        "god",
        "move",
        "will",
        "working",
        "u",
        "good",
        "pleasure",
        "scripture",
        "say",
        "phil",
        "yet",
        "insists",
        "diminish",
        "freedom",
        "would",
        "told",
        "passage",
        "work",
        "salvation",
        "fear",
        "trembling",
        "grace",
        "free",
        "similarly",
        "thomas",
        "aquinas",
        "maintains",
        "doings",
        "even",
        "sin",
        "par",
        "rest",
        "creation",
        "god",
        "first",
        "cause",
        "defect",
        "action",
        "sinfulness",
        "derives",
        "u",
        "sin",
        "say",
        "like",
        "limping",
        "defective",
        "motion",
        "arises",
        "crookedness",
        "limb",
        "rather",
        "power",
        "locomotion",
        "impels",
        "summa",
        "theologica",
        "iii",
        "q",
        "art",
        "like",
        "augustine",
        "moreover",
        "aquinas",
        "see",
        "conflict",
        "god",
        "activity",
        "creator",
        "free",
        "creature",
        "contrary",
        "hold",
        "god",
        "activity",
        "first",
        "cause",
        "actually",
        "cause",
        "freedom",
        "since",
        "move",
        "u",
        "accordance",
        "voluntary",
        "nature",
        "summa",
        "theologica",
        "iii",
        "q",
        "art",
        "ad",
        "make",
        "suggestion",
        "however",
        "le",
        "clear",
        "augustine",
        "case",
        "may",
        "argued",
        "later",
        "writing",
        "abandon",
        "earlier",
        "flirtation",
        "libertarian",
        "idea",
        "notion",
        "freedom",
        "endorsed",
        "passage",
        "referrred",
        "fact",
        "version",
        "today",
        "known",
        "compatibilism",
        "baker",
        "aquinas",
        "however",
        "situation",
        "le",
        "clear",
        "stump",
        "ch",
        "much",
        "turn",
        "might",
        "possible",
        "god",
        "move",
        "u",
        "way",
        "truly",
        "consistent",
        "voluntary",
        "nature",
        "voluntary",
        "taken",
        "signify",
        "libertarian",
        "freedom",
        "said",
        "aquinas",
        "offer",
        "little",
        "way",
        "explanation",
        "however",
        "interesting",
        "suggestion",
        "summa",
        "contra",
        "gentile",
        "thomas",
        "maintains",
        "moved",
        "external",
        "principle",
        "agent",
        "movement",
        "would",
        "violent",
        "proceeds",
        "conclusion",
        "god",
        "alone",
        "able",
        "move",
        "creaturely",
        "agent",
        "without",
        "violence",
        "since",
        "alone",
        "cause",
        "sustainer",
        "thus",
        "able",
        "move",
        "within",
        "book",
        "iii",
        "ch",
        "two",
        "thing",
        "may",
        "said",
        "favor",
        "suggestion",
        "see",
        "also",
        "mccann",
        "shanley",
        "grant",
        "first",
        "concern",
        "libertarian",
        "free",
        "agency",
        "often",
        "portrayed",
        "power",
        "cause",
        "confer",
        "existence",
        "upon",
        "action",
        "view",
        "would",
        "accord",
        "aquinas",
        "claim",
        "god",
        "move",
        "creaturely",
        "way",
        "fact",
        "hard",
        "see",
        "portrayal",
        "agency",
        "right",
        "confer",
        "existence",
        "decision",
        "attend",
        "concert",
        "tonight",
        "must",
        "either",
        "act",
        "separate",
        "decision",
        "aspect",
        "decision",
        "separate",
        "act",
        "problem",
        "freedom",
        "simply",
        "shift",
        "location",
        "convinced",
        "act",
        "turn",
        "receives",
        "existence",
        "appear",
        "headed",
        "vicious",
        "regress",
        "neither",
        "seem",
        "possible",
        "confer",
        "existence",
        "act",
        "deciding",
        "aspect",
        "act",
        "prior",
        "act",
        "appearance",
        "nothing",
        "conferring",
        "appears",
        "conferral",
        "longer",
        "needed",
        "whatever",
        "agency",
        "voluntariness",
        "consist",
        "appear",
        "ability",
        "confer",
        "existence",
        "action",
        "important",
        "mean",
        "unless",
        "find",
        "way",
        "ground",
        "libertarian",
        "freedom",
        "creative",
        "activity",
        "god",
        "decision",
        "action",
        "manifested",
        "likely",
        "cause",
        "accounting",
        "whatever",
        "situation",
        "philosopher",
        "likely",
        "find",
        "satisfying",
        "hardly",
        "put",
        "control",
        "act",
        "deciding",
        "second",
        "important",
        "consideration",
        "relationship",
        "god",
        "creative",
        "thing",
        "creates",
        "prone",
        "think",
        "eventcausal",
        "relation",
        "god",
        "issue",
        "kind",
        "command",
        "command",
        "turn",
        "produce",
        "mandated",
        "effect",
        "applied",
        "example",
        "would",
        "mean",
        "god",
        "creatively",
        "will",
        "decide",
        "attend",
        "concert",
        "willing",
        "cause",
        "decide",
        "course",
        "sound",
        "exactly",
        "like",
        "aquinas",
        "describes",
        "violent",
        "operation",
        "external",
        "principle",
        "scenario",
        "deciding",
        "passive",
        "hence",
        "involuntary",
        "god",
        "creative",
        "fiat",
        "event",
        "independent",
        "decision",
        "acting",
        "upon",
        "robs",
        "autonomy",
        "reduced",
        "puppet",
        "manipulated",
        "god",
        "rather",
        "free",
        "agent",
        "clearly",
        "however",
        "scenario",
        "reflect",
        "way",
        "aquinas",
        "think",
        "creation",
        "work",
        "score",
        "reason",
        "think",
        "aquinas",
        "right",
        "consider",
        "causal",
        "relation",
        "alleged",
        "obtain",
        "god",
        "willing",
        "mine",
        "whatever",
        "take",
        "consist",
        "must",
        "exist",
        "contingently",
        "causal",
        "connection",
        "necessary",
        "being",
        "supposed",
        "causal",
        "connection",
        "must",
        "also",
        "created",
        "god",
        "occurs",
        "another",
        "process",
        "command",
        "causation",
        "would",
        "facing",
        "another",
        "regress",
        "way",
        "hold",
        "god",
        "directly",
        "creates",
        "causal",
        "nexus",
        "say",
        "creation",
        "nexus",
        "command",
        "first",
        "manifestation",
        "god",
        "creative",
        "activity",
        "god",
        "creative",
        "directly",
        "efficacious",
        "task",
        "also",
        "creation",
        "u",
        "action",
        "need",
        "nexus",
        "explain",
        "efficacy",
        "god",
        "creative",
        "causal",
        "distance",
        "whatever",
        "god",
        "either",
        "u",
        "behavior",
        "rather",
        "god",
        "first",
        "manifestation",
        "creative",
        "activity",
        "regarding",
        "decision",
        "action",
        "nothing",
        "short",
        "act",
        "may",
        "misleading",
        "call",
        "traditional",
        "view",
        "common",
        "name",
        "theological",
        "determinism",
        "sort",
        "determination",
        "involved",
        "god",
        "providential",
        "ordering",
        "creation",
        "different",
        "ordinary",
        "causal",
        "determination",
        "within",
        "created",
        "order",
        "useful",
        "analogy",
        "may",
        "drawn",
        "relationship",
        "author",
        "story",
        "character",
        "within",
        "author",
        "enter",
        "story",
        "act",
        "upon",
        "character",
        "way",
        "force",
        "thing",
        "rather",
        "creates",
        "doings",
        "able",
        "behave",
        "freely",
        "world",
        "novel",
        "traditional",
        "account",
        "god",
        "relation",
        "creature",
        "similar",
        "creator",
        "first",
        "cause",
        "u",
        "action",
        "causality",
        "work",
        "way",
        "acted",
        "upon",
        "able",
        "exercise",
        "will",
        "freely",
        "deciding",
        "acting",
        "correct",
        "aquinas",
        "least",
        "seems",
        "suggest",
        "god",
        "creative",
        "activity",
        "violate",
        "libertarian",
        "freedom",
        "count",
        "independent",
        "determining",
        "condition",
        "creaturely",
        "decision",
        "action",
        "contrary",
        "assuming",
        "god",
        "free",
        "event",
        "heaven",
        "earth",
        "independent",
        "deciding",
        "attend",
        "concert",
        "tonight",
        "cause",
        "decision",
        "god",
        "creative",
        "activity",
        "act",
        "upon",
        "render",
        "passive",
        "way",
        "consists",
        "solely",
        "god",
        "freely",
        "giving",
        "ground",
        "accordingly",
        "still",
        "display",
        "libertarian",
        "freedom",
        "decision",
        "spontaneous",
        "display",
        "creaturely",
        "agency",
        "free",
        "libertarian",
        "sense",
        "occur",
        "event",
        "causality",
        "fully",
        "intentionally",
        "committed",
        "deciding",
        "deciding",
        "exactly",
        "legitimate",
        "requirement",
        "libertarian",
        "freedom",
        "course",
        "something",
        "happen",
        "view",
        "possible",
        "god",
        "activity",
        "creator",
        "devoted",
        "deciding",
        "attend",
        "concert",
        "yet",
        "forebear",
        "decide",
        "decide",
        "something",
        "else",
        "try",
        "would",
        "find",
        "losing",
        "battle",
        "god",
        "efficacious",
        "manifestation",
        "regarding",
        "decision",
        "short",
        "decision",
        "impossibility",
        "god",
        "creator",
        "mine",
        "creature",
        "diverge",
        "suggests",
        "trouble",
        "view",
        "go",
        "either",
        "god",
        "perspective",
        "mine",
        "suggests",
        "two",
        "event",
        "potential",
        "conflict",
        "properly",
        "interpreted",
        "however",
        "traditional",
        "view",
        "appears",
        "call",
        "one",
        "event",
        "far",
        "concerned",
        "impossibility",
        "come",
        "make",
        "decision",
        "make",
        "incapable",
        "logically",
        "impossible",
        "failure",
        "freedom",
        "libertarian",
        "otherwise",
        "far",
        "argued",
        "theological",
        "determinism",
        "virtue",
        "nature",
        "determination",
        "involved",
        "may",
        "yield",
        "result",
        "even",
        "misleading",
        "describe",
        "determination",
        "may",
        "well",
        "compatible",
        "basically",
        "libertarian",
        "view",
        "free",
        "alternative",
        "proponent",
        "theological",
        "determinism",
        "accept",
        "classically",
        "compatibilist",
        "view",
        "free",
        "according",
        "freedom",
        "compatible",
        "even",
        "determination",
        "causal",
        "factor",
        "within",
        "created",
        "order",
        "long",
        "causal",
        "factor",
        "right",
        "sort",
        "famous",
        "proponent",
        "view",
        "jonathan",
        "edward",
        "view",
        "common",
        "contemporary",
        "free",
        "literature",
        "discussion",
        "proceed",
        "focusing",
        "libertarian",
        "view",
        "many",
        "approach",
        "taken",
        "compatibilist",
        "well"
    ]
}