{
    "main_text": "Sources, Ideas, Character of Writing, Terms: Christianity and Neoplatonism || Sources, Ideas, and Terms\n4.1 Sources, Ideas, and Terms\n\nThere is a major tension between Platonism and Christianity in\nDionysius’ writing. Luther expressed the negative side of this\ntension: “Dionysius is most pernicious; he platonizes more than\nhe Christianizes” (Babylonian Captivity of the Church\n(Weimarer Ausgabe 6, 562)). Von Balthasar has been more\npositive, seeing Dionysius’ Christianization of Neoplatonism\n“as a side-effect of his own properly theological\nendeavor”, namely, “the clear realized synthesis of truth\nand beauty, of theology and aesthetics” (The Glory of the\nLord, vol. 2, 148–9). Perhaps one may suggest that neither\nChristianity nor Platonism are side shows in Dionysius’ thought;\nThey are rather mutually important whole perspectives that do not get\nlost in the mix, no matter how subordinate Neoplatonism nonetheless\nmay be to Christianity for Dionysius himself. Dionysius’ central\nconcern is how a triune God, that he calls—among other\nthings—the thearchy (god-rule; god-beginning), who is utterly\nunknowable, unrestricted being, beyond individual substances, beyond\neven goodness, can become manifest to, in, and through the whole of\ncreation in order to bring back all things to the hidden darkness of\ntheir source. To this end Dionysius employs some major Neoplatonic\ninsights: (1) The abiding—procession—return or conversion\nof all things as the creative and receptive expression of what it\nmeans for anything created to be. In Proclus’ terms in the\nElements of Theology, prop. 35: “Every effect remains\nin its cause, proceeds from it, and converts to it”. This is a\nway of expressing the vertical connectedness of everything by\nidentity, difference, and the overcoming of difference by a return to\nidentity that constitutes the nature of anything that is caused. (2)\nThe hierarchical ordering of beings as an expression of both their\nnatural placements and their freedoms as well as the simultaneous\nimmediacy, without intermediary, of the unknown God’s presence\n(on hierarchy see CH 3). Each thing and order bears relation\nto the whole or manifests the whole, but “according to its own\ncapacity”, as the famous Neoplatonic saying puts it. A rock or a\nworm, for instance, is a window upon the entire universe if you only\nknow how to look.\n\nIn the case of (1), the contrast between Dionysius and Neoplatonism\nshould not be taken to be a contrast between free divine creation, on\nthe one hand, and supposed emanation or illumination by necessity, on\nthe other, for divine/ human freedom and creation out of\n“nothing” are conspicuous facets of Neoplatonic thought as\nwell. What we see in Dionysius is rather a new way of understanding\nthe abiding, outpouring, and return, not only concretely in relation\nto the various hierarchies, and structurally in relation to the\nvarious works (DN is more concerned with procession, for\ninstance, while EH, CH, and MT deal with\ndifferent levels of return), but also in relation to God’s\nprovidential love that, while remaining supereminently identical to\nitself, and precontaining everything within itself, nonetheless is the\ncreative power overflowing into its effects (procession) in order to\nbring them back into identity (return): “[The Cause of All] is\n‘all in all‘, as scripture affirms, and certainly he is to\nbe praised as being for all things the creator and originator, the One\nwho brings them to completion, their preserver, their protector, and\ntheir home, the power which returns them to itself, and all this in\nthe one single, irrepressible, and supreme act” (DN 1,\n7, 596c–597a).\n\nIn the case of (2) (hierarchy and divine presence), Dionysius\nemphasizes, much more so than the impression often suggested by\nNeoplatonism, the directness of creation. Every being, no\nmatter where it is placed in the scale of beings and no matter how\ndependent it might be on beings ontologically higher than it (e.g.,\nfor human beings, angels) is directly and immediately dependent upon\nGod in and for its existence. Again, the contrasts often drawn between\nNeoplatonism’s “flight of the alone to the alone”\nand Dionysius’ community of hierarchy or between the supposed\nNeoplatonic view that the One causes the existence of lower beings\nonly through the mediation of the higher, while Christianity sees\ncreation as immediate are simply false or too simplistic.\nPlotinus’ mysticism is not “solitary” in the sense\noften supposed and, for Plotinus, Porphyry, and Proclus, the One\ncauses existence immediately and most profoundly, whatever other\ninfluences enter into the complexity of existence. What we see in\nDionysius, by contrast, is a retention of one’s place in\nhierarchy and a very concrete return to identity—in the case of\nhuman beings, for instance, through scripture, ritual, and practical\nperformance to a deeper union with God rather than a simple, spatially\nconceived movement “up” the hierarchy. More broadly still,\nwe see in Dionysius’ thought new possibilities for thinking\nabout divine love, a love that combines beyond beingness and\nunrestricted being, transcendence and yet even a kind of\nhyperessential vulnerability in rather startling ways, new ways\nconsequently of thinking about both divine and human eros,\nabout affectivity (cf. Dionysius’ famous dictum about learning\nfrom sacred writers, or discovering the truth oneself, or not only\nlearning but “experiencing the divine things” (pathein\nta theia) (DN 2, 9); and compare Aristotle, fr. 15\n(Rose) and Hebrews 5:8), about the nature of signification\nand the limits of language (see section 4 below), about the theory of\nevil as privation and non-being, however dependent this is upon one of\nProclus’ opuscula (cf. DN 4, 18–35),\nabout the aesthetic richness of this world in the light of theology\nand the life of the Church, and even about the soul–body\nrelation, though anthropology is not a part of Dionysius’\nprimary concern (but see his comments at EH 404B, 433c,\n437a–440a, 441b, 553a ff, 565b–c).\n\nTwo examples will have to suffice here: (a) Dionysius’\nremarkable description of the ecstatic love of God and (b) his radical\ntransformation of the Neoplatonic intelligible and sensible\nworlds.\n\n(a) First, Dionysius evidently cannot accept in any single\nstraightforward sense the Neoplatonic notion of a One that excludes\nthe possibility of expressing trinity. He therefore links in a new way\nGod as unrestricted being with God as utterly beyond being or any\ndeterminate predications. At the same time in the DN he\nargues that the ecstasy of love, which moves as a unifying force\nthrough creation without departing from itself, is the divine nature.\nDionysius admits, in a note from Plato’s Phaedrus, that\nit is characteristic of yearning not to allow “lovers to belong\nto themselves but only to their loved ones” (DN 4, 13).\nThis is shown, he goes on to argue, by the providential care of the\ngreater for the lesser (a reference to Proclus’ divine\nprovidential love (eros pronoetikos) from the Commentary\non the First Alcibiades, #56), by the love of equals, and by that\nof the lesser for those better than them (a reference both to\nAristotle’s seminal treatment of friendship in the\nNicomachean Ethics and to Proclus’ returning or\nconverting love (eros epistreptikos) in the same Commentary\nabove), as also in the case of St. Paul’s famous dictum “I\nlive now, not I, but Christ lives in me” (Gal 2:20).\nMight then such a belonging to one’s beloved be characteristic\nof God, if perhaps in a different sense?\n\nDionysius continues as follows:\n\nWe must dare to say even this on behalf of the truth that the cause of\nall things himself, by his beautiful and good love for all things,\nthrough an overflowing of loving goodness, becomes outside of himself\n(exo heautou ginetai) by his providential care for all beings\nand is as it were, charmed (thelgetai) by goodness,\naffection (agapesis), and love (eros), and is\nled down (katagetai) from his place above all and\ntranscendent of all to dwell in all things in accordance with his\necstatic superessential power which does not depart from itself\n(DN 4, 13).\n\n\nThe very notion is, of course, remarkable, the notion, that is, of a\nkind of conjunction of opposites that strives to express the\ninexpressible magnitude of divine love and even to suggest power and\nvulnerability (or “almost” vulnerability: “as it\nwere, charmed (beguiled, enchanted)”), as well as the\npossibility of a genuine two-way relation between Creator and\ncreatures more in tune with Biblical thought. Yet the expression\nremains Greek, for the word thelgetai that Dionysius chooses\nis one that echoes the conclusion of Agathon’s speech in the\nSymposium where Agathon praises a Love that everyone\n“should hymn fairly, sharing in the song he sings that\nenchants/charms/beguiles (thelgon) the thought\n(phronema) of all gods and human beings” (197c).\nDionysius changes the context but does not really reverse the\npolarity: it is God who still—like human beings—is\nbeguiled by love and affection for beings and “led down”\nto dwell in them. Is this small detail and transposition merely\naccidental? It may well be, but in this context, the use of such a\nverb and thought is not accidental. Dionysius does not write as a\nChristian walled off from pagan thought or as if he were a Neoplatonic\nthinker in Christian disguise. Instead he provokes and delights in\nintertextuality at every point.\n\n(b) A second example is the precise nature of Dionysius’\ntransposition of Neoplatonic structure. Dionysius makes concrete and\naccessible the whole world of Neoplatonism in the human, but\nsacramental life of the Church, a world of ordinary people and things\nwhose significance can only be fully realized and perfected in the\ncelestial and supercelestial world.\n\nFor Classical Neoplatonism, especially in its Plotinian form, the real\ntruths that undergird or form the origins, beginnings\n(archai) of the world of ordinary experience are the three\nhypostases or realities of soul, intellect, and the One. The\nhypostases are necessary, above all, to account for our experience of\ndegrees of unity and organization. The life-world accessible to our\nsenses is an organized, animated world, and this needs a more\nintensive degree of unity to account for it, namely, the principle of\nlife, that is, soul and all souls. But even the world of soul is a\n“one and many”, organized from within yet also requiring a\nprinciple of unity and organization beyond itself. And the same is\ntrue even to a higher degree of intellect. Intellect is a\n“one-many”, an organized world of intellects, in each of\nwhich the whole of intellect is present. Each is a sort of holographic\nreality. And because intellect is still a world despite its more\nintensive unity than soul, it requires a unity beyond intellect and\nbeyond being to organize it and to form the groundless ground of its\nown being from which it has emerged.\n\nSo (1) in Neoplatonism, there are 3 hypostases, on the one hand,\nnamely, soul, intellect, and the One, and four cosmic or hypercosmic\ndimensions, on the other: (i) the sensible world as a world of things;\n(ii) the sensible world linked by the soul to the intelligible world;\n(iii) the intelligible world itself composed of all intellects; and\nfinally (iv) the One or the Good, from which everything has come. And\n(2) while everything has its appropriate “place” in this\nhypostatic hierarchy, the presence of the Good is so immediate and so\naccessible, that the presence is closer to each thing even than\nintellect or soul. This is equally true in both Plotinus and Proclus.\nFurthermore, (3) in order to explicate the derivation of each entity\nfrom what comes before it, it is not sufficient as some scholars have\nsupposed that Neoplatonism should just have multiplied intermediaries\nand indulged in an absurd proclivity for triads, such as Life, Wisdom,\nMind; Neoplatonism should rather be seen as a form of thought that\nattempts to meditate upon, read the signs in, and represent how, as\nprecisely as possible, all beings are derived from and relate to the\nOne, to examine and explicate their dependence, open-endedness, and\nradical interconnectedness without losing sight of the\nmultidimensional ordering of the universe (sensible/intelligible) and\nof the fact that even the simplicity of things that have no intellect\nor life, but only bare existence, springs from the power of the\nOne.\n\nWhat Dionysius manages to do is both to capture this spirit\nprofoundly, and, therefore, transform it, as well as to make it\nconcrete and accessible in the scriptural, sacramental, and ordinary\nexperiences of Christian practitioners. Instead of the 4 dimensions of\nthe Neoplatonic universe, Dionysius has the following: (1) the\nsensible world or Legal hierarchy, i.e., the world considered under\nthe aspect either of objective “thinginess” or of law,\nnamely, in the case of law, a world in which we are dependent upon\nprescriptions rather than upon any deeper understanding, a world in\nwhich the “mysteries” or hidden things (such as Baptism\nand the Eucharist) are mere mechanical ceremonies and the Scriptures\nare given only a literal meaning. For Dionysius (as for Plato), law is\nnecessary, but still deficient. The law of Moses, for instance,\n“gave only a veiled contemplation as to enlighten without harm\nweak capacities for sight” (EH 501c). Then (2) there\nfollows the ecclesiastical hierarchy, namely, the sensible world as\nthe limbs of the mystical body of Christ led by soul into the\nsignificance of the intelligible or celestial hierarchy, where the\nsymbols can begin to be read. Its mysteries, both sensible and\nintelligible, are the Scriptures and the Sacraments, its initiators\nthe priests, and its initiated the ones who receive them. From this\nperspective, Dionysius transforms Neoplatonism radically but at the\nsame time provokes entirely new possibilities in the structures he\ntransforms.\n",
    "section_title": "4.1 Sources, Ideas, and Terms",
    "entry_title": "Pseudo-Dionysius the Areopagite",
    "hierarchy_title": "Pseudo-Dionysius the Areopagite || Sources, Ideas, Character of Writing, Terms: Christianity and Neoplatonism || Sources, Ideas, and Terms",
    "tokenized_text": [
        "source",
        "idea",
        "character",
        "writing",
        "term",
        "christianity",
        "neoplatonism",
        "source",
        "idea",
        "term",
        "source",
        "idea",
        "term",
        "major",
        "tension",
        "platonism",
        "christianity",
        "dionysius",
        "writing",
        "luther",
        "expressed",
        "negative",
        "side",
        "tension",
        "dionysius",
        "pernicious",
        "platonizes",
        "christianizes",
        "babylonian",
        "captivity",
        "church",
        "weimarer",
        "ausgabe",
        "von",
        "balthasar",
        "positive",
        "seeing",
        "dionysius",
        "christianization",
        "neoplatonism",
        "sideeffect",
        "properly",
        "theological",
        "endeavor",
        "namely",
        "clear",
        "realized",
        "synthesis",
        "truth",
        "beauty",
        "theology",
        "aesthetic",
        "glory",
        "lord",
        "vol",
        "perhaps",
        "one",
        "may",
        "suggest",
        "neither",
        "christianity",
        "platonism",
        "side",
        "show",
        "dionysius",
        "thought",
        "rather",
        "mutually",
        "important",
        "whole",
        "perspective",
        "get",
        "lost",
        "mix",
        "matter",
        "subordinate",
        "neoplatonism",
        "nonetheless",
        "may",
        "christianity",
        "dionysius",
        "dionysius",
        "central",
        "concern",
        "triune",
        "god",
        "callsamong",
        "thingsthe",
        "thearchy",
        "godrule",
        "godbeginning",
        "utterly",
        "unknowable",
        "unrestricted",
        "beyond",
        "individual",
        "substance",
        "beyond",
        "even",
        "goodness",
        "become",
        "manifest",
        "whole",
        "creation",
        "order",
        "bring",
        "back",
        "thing",
        "hidden",
        "darkness",
        "source",
        "end",
        "dionysius",
        "employ",
        "major",
        "neoplatonic",
        "insight",
        "abidingprocessionreturn",
        "conversion",
        "thing",
        "creative",
        "receptive",
        "expression",
        "mean",
        "anything",
        "created",
        "proclus",
        "term",
        "element",
        "theology",
        "prop",
        "every",
        "effect",
        "remains",
        "cause",
        "proceeds",
        "convert",
        "way",
        "expressing",
        "vertical",
        "connectedness",
        "everything",
        "identity",
        "difference",
        "overcoming",
        "difference",
        "return",
        "identity",
        "constitutes",
        "nature",
        "anything",
        "caused",
        "hierarchical",
        "ordering",
        "being",
        "expression",
        "natural",
        "placement",
        "freedom",
        "well",
        "simultaneous",
        "immediacy",
        "without",
        "intermediary",
        "unknown",
        "god",
        "presence",
        "hierarchy",
        "see",
        "ch",
        "thing",
        "order",
        "bear",
        "relation",
        "whole",
        "manifest",
        "whole",
        "according",
        "capacity",
        "famous",
        "neoplatonic",
        "saying",
        "put",
        "rock",
        "worm",
        "instance",
        "window",
        "upon",
        "entire",
        "universe",
        "know",
        "look",
        "case",
        "contrast",
        "dionysius",
        "neoplatonism",
        "taken",
        "contrast",
        "free",
        "divine",
        "creation",
        "one",
        "hand",
        "supposed",
        "emanation",
        "illumination",
        "necessity",
        "divine",
        "human",
        "freedom",
        "creation",
        "nothing",
        "conspicuous",
        "facet",
        "neoplatonic",
        "thought",
        "well",
        "see",
        "dionysius",
        "rather",
        "new",
        "way",
        "understanding",
        "abiding",
        "outpouring",
        "return",
        "concretely",
        "relation",
        "various",
        "hierarchy",
        "structurally",
        "relation",
        "various",
        "work",
        "dn",
        "concerned",
        "procession",
        "instance",
        "eh",
        "ch",
        "mt",
        "deal",
        "different",
        "level",
        "return",
        "also",
        "relation",
        "god",
        "providential",
        "love",
        "remaining",
        "supereminently",
        "identical",
        "precontaining",
        "everything",
        "within",
        "nonetheless",
        "creative",
        "power",
        "overflowing",
        "effect",
        "procession",
        "order",
        "bring",
        "back",
        "identity",
        "return",
        "cause",
        "scripture",
        "affirms",
        "certainly",
        "praised",
        "thing",
        "creator",
        "originator",
        "one",
        "brings",
        "completion",
        "preserver",
        "protector",
        "home",
        "power",
        "return",
        "one",
        "single",
        "irrepressible",
        "supreme",
        "act",
        "dn",
        "ca",
        "case",
        "hierarchy",
        "divine",
        "presence",
        "dionysius",
        "emphasizes",
        "much",
        "impression",
        "often",
        "suggested",
        "neoplatonism",
        "directness",
        "creation",
        "every",
        "matter",
        "placed",
        "scale",
        "being",
        "matter",
        "dependent",
        "might",
        "being",
        "ontologically",
        "higher",
        "eg",
        "human",
        "being",
        "angel",
        "directly",
        "immediately",
        "dependent",
        "upon",
        "god",
        "existence",
        "contrast",
        "often",
        "drawn",
        "neoplatonism",
        "flight",
        "alone",
        "alone",
        "dionysius",
        "community",
        "hierarchy",
        "supposed",
        "neoplatonic",
        "view",
        "one",
        "cause",
        "existence",
        "lower",
        "being",
        "mediation",
        "higher",
        "christianity",
        "see",
        "creation",
        "immediate",
        "simply",
        "false",
        "simplistic",
        "plotinus",
        "mysticism",
        "solitary",
        "sense",
        "often",
        "supposed",
        "plotinus",
        "porphyry",
        "proclus",
        "one",
        "cause",
        "existence",
        "immediately",
        "profoundly",
        "whatever",
        "influence",
        "enter",
        "complexity",
        "existence",
        "see",
        "dionysius",
        "contrast",
        "retention",
        "one",
        "place",
        "hierarchy",
        "concrete",
        "return",
        "identityin",
        "case",
        "human",
        "being",
        "instance",
        "scripture",
        "ritual",
        "practical",
        "performance",
        "deeper",
        "union",
        "god",
        "rather",
        "simple",
        "spatially",
        "conceived",
        "movement",
        "hierarchy",
        "broadly",
        "still",
        "see",
        "dionysius",
        "thought",
        "new",
        "possibility",
        "thinking",
        "divine",
        "love",
        "love",
        "combine",
        "beyond",
        "beingness",
        "unrestricted",
        "transcendence",
        "yet",
        "even",
        "kind",
        "hyperessential",
        "vulnerability",
        "rather",
        "startling",
        "way",
        "new",
        "way",
        "consequently",
        "thinking",
        "divine",
        "human",
        "eros",
        "affectivity",
        "cf",
        "dionysius",
        "famous",
        "dictum",
        "learning",
        "sacred",
        "writer",
        "discovering",
        "truth",
        "oneself",
        "learning",
        "experiencing",
        "divine",
        "thing",
        "pathein",
        "ta",
        "theia",
        "dn",
        "compare",
        "aristotle",
        "fr",
        "rose",
        "hebrew",
        "nature",
        "signification",
        "limit",
        "language",
        "see",
        "section",
        "theory",
        "evil",
        "privation",
        "nonbeing",
        "however",
        "dependent",
        "upon",
        "one",
        "proclus",
        "opuscula",
        "cf",
        "dn",
        "aesthetic",
        "richness",
        "world",
        "light",
        "theology",
        "life",
        "church",
        "even",
        "soulbody",
        "relation",
        "though",
        "anthropology",
        "part",
        "dionysius",
        "primary",
        "concern",
        "see",
        "comment",
        "eh",
        "b",
        "c",
        "aa",
        "b",
        "a",
        "ff",
        "bc",
        "two",
        "example",
        "suffice",
        "dionysius",
        "remarkable",
        "description",
        "ecstatic",
        "love",
        "god",
        "b",
        "radical",
        "transformation",
        "neoplatonic",
        "intelligible",
        "sensible",
        "world",
        "first",
        "dionysius",
        "evidently",
        "accept",
        "single",
        "straightforward",
        "sense",
        "neoplatonic",
        "notion",
        "one",
        "excludes",
        "possibility",
        "expressing",
        "trinity",
        "therefore",
        "link",
        "new",
        "way",
        "god",
        "unrestricted",
        "god",
        "utterly",
        "beyond",
        "determinate",
        "predication",
        "time",
        "dn",
        "argues",
        "ecstasy",
        "love",
        "move",
        "unifying",
        "force",
        "creation",
        "without",
        "departing",
        "divine",
        "nature",
        "dionysius",
        "admits",
        "note",
        "plato",
        "phaedrus",
        "characteristic",
        "yearning",
        "allow",
        "lover",
        "belong",
        "loved",
        "one",
        "dn",
        "shown",
        "go",
        "argue",
        "providential",
        "care",
        "greater",
        "lesser",
        "reference",
        "proclus",
        "divine",
        "providential",
        "love",
        "eros",
        "pronoetikos",
        "commentary",
        "first",
        "alcibiades",
        "love",
        "equal",
        "lesser",
        "better",
        "reference",
        "aristotle",
        "seminal",
        "treatment",
        "friendship",
        "nicomachean",
        "ethic",
        "proclus",
        "returning",
        "converting",
        "love",
        "eros",
        "epistreptikos",
        "commentary",
        "also",
        "case",
        "st",
        "paul",
        "famous",
        "dictum",
        "live",
        "christ",
        "life",
        "gal",
        "might",
        "belonging",
        "one",
        "beloved",
        "characteristic",
        "god",
        "perhaps",
        "different",
        "sense",
        "dionysius",
        "continues",
        "follows",
        "must",
        "dare",
        "say",
        "even",
        "behalf",
        "truth",
        "cause",
        "thing",
        "beautiful",
        "good",
        "love",
        "thing",
        "overflowing",
        "loving",
        "goodness",
        "becomes",
        "outside",
        "exo",
        "heautou",
        "ginetai",
        "providential",
        "care",
        "being",
        "charmed",
        "thelgetai",
        "goodness",
        "affection",
        "agapesis",
        "love",
        "eros",
        "led",
        "katagetai",
        "place",
        "transcendent",
        "dwell",
        "thing",
        "accordance",
        "ecstatic",
        "superessential",
        "power",
        "depart",
        "dn",
        "notion",
        "course",
        "remarkable",
        "notion",
        "kind",
        "conjunction",
        "opposite",
        "strives",
        "express",
        "inexpressible",
        "magnitude",
        "divine",
        "love",
        "even",
        "suggest",
        "power",
        "vulnerability",
        "almost",
        "vulnerability",
        "charmed",
        "beguiled",
        "enchanted",
        "well",
        "possibility",
        "genuine",
        "twoway",
        "relation",
        "creator",
        "creature",
        "tune",
        "biblical",
        "thought",
        "yet",
        "expression",
        "remains",
        "greek",
        "word",
        "thelgetai",
        "dionysius",
        "chooses",
        "one",
        "echo",
        "conclusion",
        "agathon",
        "speech",
        "symposium",
        "agathon",
        "praise",
        "love",
        "everyone",
        "hymn",
        "fairly",
        "sharing",
        "song",
        "sings",
        "enchantscharmsbeguiles",
        "thelgon",
        "thought",
        "phronema",
        "god",
        "human",
        "being",
        "c",
        "dionysius",
        "change",
        "context",
        "really",
        "reverse",
        "polarity",
        "god",
        "stilllike",
        "human",
        "beingsis",
        "beguiled",
        "love",
        "affection",
        "being",
        "led",
        "dwell",
        "small",
        "detail",
        "transposition",
        "merely",
        "accidental",
        "may",
        "well",
        "context",
        "use",
        "verb",
        "thought",
        "accidental",
        "dionysius",
        "write",
        "christian",
        "walled",
        "pagan",
        "thought",
        "neoplatonic",
        "thinker",
        "christian",
        "disguise",
        "instead",
        "provokes",
        "delight",
        "intertextuality",
        "every",
        "point",
        "b",
        "second",
        "example",
        "precise",
        "nature",
        "dionysius",
        "transposition",
        "neoplatonic",
        "structure",
        "dionysius",
        "make",
        "concrete",
        "accessible",
        "whole",
        "world",
        "neoplatonism",
        "human",
        "sacramental",
        "life",
        "church",
        "world",
        "ordinary",
        "people",
        "thing",
        "whose",
        "significance",
        "fully",
        "realized",
        "perfected",
        "celestial",
        "supercelestial",
        "world",
        "classical",
        "neoplatonism",
        "especially",
        "plotinian",
        "form",
        "real",
        "truth",
        "undergird",
        "form",
        "origin",
        "beginning",
        "archai",
        "world",
        "ordinary",
        "experience",
        "three",
        "hypostasis",
        "reality",
        "soul",
        "intellect",
        "one",
        "hypostasis",
        "necessary",
        "account",
        "experience",
        "degree",
        "unity",
        "organization",
        "lifeworld",
        "accessible",
        "sens",
        "organized",
        "animated",
        "world",
        "need",
        "intensive",
        "degree",
        "unity",
        "account",
        "namely",
        "principle",
        "life",
        "soul",
        "soul",
        "even",
        "world",
        "soul",
        "one",
        "many",
        "organized",
        "within",
        "yet",
        "also",
        "requiring",
        "principle",
        "unity",
        "organization",
        "beyond",
        "true",
        "even",
        "higher",
        "degree",
        "intellect",
        "intellect",
        "onemany",
        "organized",
        "world",
        "intellect",
        "whole",
        "intellect",
        "present",
        "sort",
        "holographic",
        "reality",
        "intellect",
        "still",
        "world",
        "despite",
        "intensive",
        "unity",
        "soul",
        "requires",
        "unity",
        "beyond",
        "intellect",
        "beyond",
        "organize",
        "form",
        "groundless",
        "ground",
        "emerged",
        "neoplatonism",
        "hypostasis",
        "one",
        "hand",
        "namely",
        "soul",
        "intellect",
        "one",
        "four",
        "cosmic",
        "hypercosmic",
        "dimension",
        "sensible",
        "world",
        "world",
        "thing",
        "ii",
        "sensible",
        "world",
        "linked",
        "soul",
        "intelligible",
        "world",
        "iii",
        "intelligible",
        "world",
        "composed",
        "intellect",
        "finally",
        "iv",
        "one",
        "good",
        "everything",
        "come",
        "everything",
        "appropriate",
        "place",
        "hypostatic",
        "hierarchy",
        "presence",
        "good",
        "immediate",
        "accessible",
        "presence",
        "closer",
        "thing",
        "even",
        "intellect",
        "soul",
        "equally",
        "true",
        "plotinus",
        "proclus",
        "furthermore",
        "order",
        "explicate",
        "derivation",
        "entity",
        "come",
        "sufficient",
        "scholar",
        "supposed",
        "neoplatonism",
        "multiplied",
        "intermediary",
        "indulged",
        "absurd",
        "proclivity",
        "triad",
        "life",
        "wisdom",
        "mind",
        "neoplatonism",
        "rather",
        "seen",
        "form",
        "thought",
        "attempt",
        "meditate",
        "upon",
        "read",
        "sign",
        "represent",
        "precisely",
        "possible",
        "being",
        "derived",
        "relate",
        "one",
        "examine",
        "explicate",
        "dependence",
        "openendedness",
        "radical",
        "interconnectedness",
        "without",
        "losing",
        "sight",
        "multidimensional",
        "ordering",
        "universe",
        "sensibleintelligible",
        "fact",
        "even",
        "simplicity",
        "thing",
        "intellect",
        "life",
        "bare",
        "existence",
        "spring",
        "power",
        "one",
        "dionysius",
        "manages",
        "capture",
        "spirit",
        "profoundly",
        "therefore",
        "transform",
        "well",
        "make",
        "concrete",
        "accessible",
        "scriptural",
        "sacramental",
        "ordinary",
        "experience",
        "christian",
        "practitioner",
        "instead",
        "dimension",
        "neoplatonic",
        "universe",
        "dionysius",
        "following",
        "sensible",
        "world",
        "legal",
        "hierarchy",
        "ie",
        "world",
        "considered",
        "aspect",
        "either",
        "objective",
        "thinginess",
        "law",
        "namely",
        "case",
        "law",
        "world",
        "dependent",
        "upon",
        "prescription",
        "rather",
        "upon",
        "deeper",
        "understanding",
        "world",
        "mystery",
        "hidden",
        "thing",
        "baptism",
        "eucharist",
        "mere",
        "mechanical",
        "ceremony",
        "scripture",
        "given",
        "literal",
        "meaning",
        "dionysius",
        "plato",
        "law",
        "necessary",
        "still",
        "deficient",
        "law",
        "moses",
        "instance",
        "gave",
        "veiled",
        "contemplation",
        "enlighten",
        "without",
        "harm",
        "weak",
        "capacity",
        "sight",
        "eh",
        "c",
        "follows",
        "ecclesiastical",
        "hierarchy",
        "namely",
        "sensible",
        "world",
        "limb",
        "mystical",
        "body",
        "christ",
        "led",
        "soul",
        "significance",
        "intelligible",
        "celestial",
        "hierarchy",
        "symbol",
        "begin",
        "read",
        "mystery",
        "sensible",
        "intelligible",
        "scripture",
        "sacrament",
        "initiator",
        "priest",
        "initiated",
        "one",
        "receive",
        "perspective",
        "dionysius",
        "transforms",
        "neoplatonism",
        "radically",
        "time",
        "provokes",
        "entirely",
        "new",
        "possibility",
        "structure",
        "transforms"
    ]
}