{
    "main_text": "Recent Re-evaluations\n7. Recent Re-evaluations\n\nGiven the central position of Frege’s and Husserl’s work\nin modern analytic and ‘Continental’ philosophy, it is of\ncourse not surprising that critical re-appraisals of their\nanti-psychologism did not stop when the Psychologismus-Streit\nended around 1914. Here is a brief glimpse at more recent evaluations.\nInterestingly enough, many recent re-evaluations of\nturn-of-the-century antipsychologism conclude that Frege’s and\nHusserl’s arguments are question-begging. My aim again is to\ngive a brief overview of the range of responses, not to offer\nassessments. To do so would demand a much more extensive\ndiscussion.\n\nJ.J. Katz (1981, 175) agrees with Schlick and other early critics that\nFrege and Husserl are wrong to take psychological laws to be vague and\ninexact. Katz’s criticism echoes Schlick’s petitio\nprincipii charge: One\n\nmight well reply that not all psychological laws are vague and\ninexact; logical and mathematical laws are the psychological laws that\nare exceptions to what is otherwise the rule in psychology for now but\nthat in the future the rest of psychology will catch up (1981, 175).\n\n\nRecent critics also disagree with Frege’s and Husserl’s\nviews on the nature of logical laws. In the light of the development\nof philosophy and logic over the past 70 years, it is no longer\nevident that the laws of Frege’s and Husserl’s classical\nlogic are necessary and unique. The uniqueness assumption has become\nmore and more questionable as logicians have developed more and more\nlogics (e.g. intuitionist logic, dialethetic paraconsistent and\ndialectical logic, relevance logic). Not only have Frege and Husserl\nfailed to provide procedures for adjudicating between alternative\nlogics (Baker and Hacker 1989, 88), but it has also turned out that\neven the Principle of Non-Contradiction which both Frege and Husserl\nregarded as one of those ‘boundary stones set in an eternal\nfoundation, which our thought can overflow but never displace’,\ncan be violated — without leading to absolute inconsistency.\nIndeed it is violated in every dialethetic system of logic (Massey\n1991, 184).\n\nWhile some critics of Frege and Husserl are still willing to regard\nthe propositions of logic as ‘paradigms of necessary\ntruth’ (Baker and Hacker 1989, 87), others go further and deny\nlogical laws the status of necessary truths. A weaker form of this\ndenial accepts the notion of necessity as meaningful but holds that\nlogic falls short of necessity. A stronger form rejects the notion of\nnecessity altogether (cf. Pivcevic 1970, 38–41). \n\nThe weaker form is sketched in a paper by Gerald Massey (1991). Massey\nsuggests that ‘logic and mathematics … forfeited all\nclaims to the honorific title sciences of necessary truth when they\nadmitted Church’s thesis into their innersanctum’ (1991,\n186). According to Church’s thesis , there is no algorithm that\nis more powerful than a Turing machine. Or, put differently, every\nfunction that is computable at all, is computable on a Turing machine.\nThis thesis is presupposed in establishing very fundamental logical\nresults. It is used, for example in order to prove Church’s\ntheorem which says that there is no algorithmic decision procedure for\nfirst-order logic. Yet Church’s thesis is a mere hypothesis, and\na hypothesis that cannot be proven true. This is because the notion of\nalgorithm is not precisely definable; there is no limit to the variety\nthat an algorithmic routine might assume. Thus Church’s thesis\nmay indeed be false: someone might eventually come up with an\nalgorithm that computes some definite function f that no\nTuring machine can compute (Jeffrey 1989, 132; Massey 1991, 186).\n\nMassey also invokes the stronger form of the claim that logical truths\nare not necessary (1991, 188). According to this criticism, the very\nnotion of necessity which is presupposed in calling logical laws\n‘necessary truths’, is beset with difficulties. The\nargument leading to this conclusion was developed in a series of\nwell-known papers by Quine. Quine argued that the notions of\nanalyticity, necessity and aprioricity stand or fall together and that\nthe traditional distinction between analytic and synthetic truths is\nrelative rather than absolute. But once this distinction becomes\nrelative, necessity and aprioricity go by the board (Quine 1951, Engel\n1991, 268–70). Massey summarises the implications of\nQuine’s arguments succinctly:\n\nIf we reject the concept of necessity … we also forego the\nconcept of contingency. If it makes no sense to say that the truths of\nmathematics are necessary, it makes no better sense to say that those\nof psychology or any other so-called empirical science are contingent.\nBut if we may not employ necessity and contingency to demarcate the\ndeliverances of the empirical sciences from those of the formal\nsciences, how are we to distinguish them in any philosophically\ninteresting way? (1991, 188).\n\n\nA different line of attack on Frege’s and Husserl’s\nantipsychologism focuses on the premises that both authors share with\ntheir psychologistic opponents. The most important of such shared\npremises is the idea that the primary cognitive attitude of logic is\ndescriptive rather than prescriptive, that is, that logic describes\nobjects or objectivities (Sachverhalte). Of course Frege and\nHusserl, on the one hand, and their psychologistic foes, on the other\nhand, disagree over the nature of these objects and objectivities\n— for the psychologicists these are real or psychological,\nwhereas for Frege and Husserl they are ideal. But the fact remains\nthat both sides in the dispute see logic as essentially descriptive\n(for Husserl, see Gethmann 1989, 197; for Frege, see Baker and Hacker:\n1989, 88–90).\n\nCentral to Frege’s and Husserl’s criticism of psychologism\nis the idea that psychologism turns out to be a relativism of sorts.\nFrege goes no further than to point out this reduction of psychologism\nto relativism, and, for the reasons given above, he makes no attempt\nto refute relativism. However, Husserl marshals a number of arguments\nagainst both Protagorean relativism and species relativism. If these\narguments were successful, then psychologism would be unmasked as a\nself-refuting doctrine. A number of critics have tried to show that\nthey are not successful. \n\nAs concerns Husserl’s case against Protagorean relativism,\nHusserl himself admits that his arguments will only be convincing for\nthose philosophers who already accept that truth is absolute. Husserl\nis more ambitious with respect to species relativism. He believes that\nit can be shown that species relativism is a self-refuting doctrine\n(cf. Føllesdal 1958, 37–39; Sukale 1977,\n47–48).\n\nThe argument, according to which the species relativist misconstrues\nthe meaning of truth by allowing the same judgment to be both true and\nfalse, is clearly question-begging. Husserl’s argument boils\ndown to this: ‘It is contradictory to claim that truth is not\nabsolute because truth is absolute’ (Føllesdal 1958, 37).\nHusserl simply takes the absoluteness of truth as self-evident. He\nalso overlooks that, properly construed, the relativistic notion of\ntruth does not violate the Principle of Non-Contradiction. If truth is\ntaken as ‘truth-for-S’ (i.e. truth for a\nspecies), such that the hyphenisation is irreducible, then one and the\nsame judgment can be true-for-S1 and\nfalse-for-S2 without the Principle of\nNon-Contradiction being violated (Meiland 1977, 571). The further\nargument, according to which truth cannot be relative to species\nbecause truth is eternal, can obviously be rejected as a petitio\nprincipii as well. Finally, Husserl claims that if truth were\nrelative then so would be the existence of the world. Here too Husserl\ndoes little more than invoke self-evidence for his position. He takes\nit as self-evident that the existence of the world cannot be relative\nand he does not show that the opposite assumption is\nself-refuting.\n\nHusserl’s frequent reliance upon ‘apodictic\nself-evidence’ both as a weapon against the species relativist\nand as the source of insight into logical truths is itself beset with\ndifficulties. Husserl seems to think that apodictic self-evidence\ntakes the philosopher/logician beyond the realm of the factual, and\neven beyond the realm of psychology. But, as pointed out by Arne\nNaess, apodictic self-evidence cannot deliver on this promise:\n“… the assertion that he or any other has this evidence,\ndoes not belong to pure logic or any other pure or formal science. It\nbelongs to a factual science concerning the relation of logicians (and\nothers) to pure science. It is not necessary to conceive this to be\npsychology. It is enough … that it is a science of facts or\nmore generally, a science about the real rather than the ideal”\n(Naess 1954, 70). And thus, Naess concludes, the program of a pure\nlogic as a system of apodictic knowledge is “to be dismissed\n… As soon as a science is said to be science of or about\nsomething, there is a radical risk of error …” (Naess\n1954, 73).\n\nFinally, for both Frege and Husserl, Benno Erdmann is the chief\nculprit, that is, the main advocate of a form of psychologism that\nleads to species relativism. Interestingly enough, over the last\nthirty years, the critical re-evaluation of antipsychologism has even\nled to a partial rehabilitation of Erdmann’s\n‘psychologistic’ view of logic. As Jack Meiland (1976)\nconstrues Erdmann’s philosophy of logic, the psychological\ninterpretation of logical principles is meant to explain why we cannot\nconceive of radically different logical systems. The explanation is\nthat ‘logical laws express the conditions which govern our\nthinking in the sense of describing the limits of what we can\nthink’ (1976, 329). One of Husserl’s central objections to\nthis view is that logical principles like the Principle of\nNon-Contradiction can be denied by human individuals, and indeed have\nbeen denied, for example by Hegel. And thus Husserl concludes that\nlogical laws do not describe the limits of what is psychologically\nthinkable. However, Meiland suggests that Erdmann’s position is\nnot refuted by this argument. All Erdmann needs to reply is that while\nall human beings are able to utter the words ‘The Principle of\nNon-Contradiction is false’, they do not thereby think contrary\nto the principle or understand what they are saying (1976, 331). \n\nThe other central Husserlian objection to Erdmann’s psychologism\nis that if logical laws were psychological laws, then they would be\nabout mental acts, judgments, ideas and other psychological entities.\nIn other words, logical laws should have real content. But obviously,\nlogical laws have no such real content, and therefore the\npsychological approach to logic must be false. Again, Meiland provides\na defense for Erdmann. While it is true that laws of logic do not\nrefer to human beings and their psychology, they might still be\ntrue-for human beings in virtue of their psychology. Put differently,\nwe\n\nmust distinguish between what a statement is explicitly about and what\nit is true in virtue of. The Principle of Non-Contradiction is\nnormally stated without reference to human beings. But it is true for\nhuman beings in virtue of their nature, if the psycho-logistic theory\nis correct (Meiland 1976, 334–35).\n\n\nMeiland explains this idea by drawing on the relation between gravity\nand the laws of planetary motion:\n\nJust as the laws of planetary motion are not about gravity but are\ntrue in virtue of gravity, so too Erdmann could claim that the laws of\nlogic are not about the mind or about standard psychological\nproperties or of the nature of the mind (Meiland 1976, 334–35).\n\n\nDespite his spirited defence of Frege’s and Husserl’s\nfavourite whipping boy, Meiland believes that Erdmann’s\npsychologism must overcome some further difficulties before it can\nbecome fully respectable. The main problem is that Erdmann allows for\nthe possibility that the laws of logic could change, that there could\nbe a different logic, a logic that conflicts with our present one. Yet\nit is hard to see how Erdmann could be entitled to make such claim. On\nhis own premises, our present logic defines the limits of the\nthinkable. And this can only mean that a radically different logic\nmust be unthinkable for us. Put differently, Erdmann owes us an\nexplanation of how we could ever come to believe that a different\nlogic is possible (1976, 337).\n\nInterestingly enough, the challenge that Meiland directs at Erdmann\ncan be met. Remmel Nunn has suggested that Jerry Fodor’s\nfunctionalism provides us with a method for conceptualizing a\nsituation in which an entity is restricted to using one, and only one,\nset of formal principles even though a different set may be operative\nunder different conditions. According to functionalism humans can be\ncompared to computers. Humans come equipped with a built-in\n‘language of thought’, that is, a language that functions\nlike the machine table of a computer. Now a computer is not able to\ncompute formulae that are not among those in the vocabulary of its\nmachine table. But this does not mean that the machine table of any\ngiven computer is without alternatives, that ‘there cannot be\nsystems of logical laws which are inconsistent with those of a given\nautomaton’. Thus we can imagine that a given computer is so\ndesigned that it systematically makes (what we regard as) a formal\nmistake M. In this case, the machine would be unable to detect the\nmistake M, ‘for M would constitute one of the laws by which the\nautomaton detects errors’ (Nunn 1978, 347).\n\nIf we adopt some such analogy between humans and computers, Nunn\nsuggests, then we can make sense of the idea that our logic might not\nbe universal. If we think of our logic as being a central part of our\nlanguage of thought, and if we thus adopt the view that our logic is\npart of our machine table, then we must accept that our logic might\nnot be unique. True, we cannot state what a radically different logic\nwould look like. However, in order to vindicate Erdmann it is enough\nthat we can — by analogy — make sense of the possibility\nof such a logic (Nunn 1978, 347).\n",
    "section_title": "7. Recent Re-evaluations",
    "entry_title": "Psychologism",
    "hierarchy_title": "Psychologism || Recent Re-evaluations",
    "tokenized_text": [
        "recent",
        "reevaluations",
        "recent",
        "reevaluations",
        "given",
        "central",
        "position",
        "frege",
        "husserl",
        "work",
        "modern",
        "analytic",
        "continental",
        "philosophy",
        "course",
        "surprising",
        "critical",
        "reappraisals",
        "antipsychologism",
        "stop",
        "psychologismusstreit",
        "ended",
        "around",
        "brief",
        "glimpse",
        "recent",
        "evaluation",
        "interestingly",
        "enough",
        "many",
        "recent",
        "reevaluations",
        "turnofthecentury",
        "antipsychologism",
        "conclude",
        "frege",
        "husserl",
        "argument",
        "questionbegging",
        "aim",
        "give",
        "brief",
        "overview",
        "range",
        "response",
        "offer",
        "assessment",
        "would",
        "demand",
        "much",
        "extensive",
        "discussion",
        "jj",
        "katz",
        "agrees",
        "schlick",
        "early",
        "critic",
        "frege",
        "husserl",
        "wrong",
        "take",
        "psychological",
        "law",
        "vague",
        "inexact",
        "katz",
        "criticism",
        "echo",
        "schlick",
        "petitio",
        "principii",
        "charge",
        "one",
        "might",
        "well",
        "reply",
        "psychological",
        "law",
        "vague",
        "inexact",
        "logical",
        "mathematical",
        "law",
        "psychological",
        "law",
        "exception",
        "otherwise",
        "rule",
        "psychology",
        "future",
        "rest",
        "psychology",
        "catch",
        "recent",
        "critic",
        "also",
        "disagree",
        "frege",
        "husserl",
        "view",
        "nature",
        "logical",
        "law",
        "light",
        "development",
        "philosophy",
        "logic",
        "past",
        "year",
        "longer",
        "evident",
        "law",
        "frege",
        "husserl",
        "classical",
        "logic",
        "necessary",
        "unique",
        "uniqueness",
        "assumption",
        "become",
        "questionable",
        "logician",
        "developed",
        "logic",
        "eg",
        "intuitionist",
        "logic",
        "dialethetic",
        "paraconsistent",
        "dialectical",
        "logic",
        "relevance",
        "logic",
        "frege",
        "husserl",
        "failed",
        "provide",
        "procedure",
        "adjudicating",
        "alternative",
        "logic",
        "baker",
        "hacker",
        "also",
        "turned",
        "even",
        "principle",
        "noncontradiction",
        "frege",
        "husserl",
        "regarded",
        "one",
        "boundary",
        "stone",
        "set",
        "eternal",
        "foundation",
        "thought",
        "overflow",
        "never",
        "displace",
        "violated",
        "without",
        "leading",
        "absolute",
        "inconsistency",
        "indeed",
        "violated",
        "every",
        "dialethetic",
        "system",
        "logic",
        "massey",
        "critic",
        "frege",
        "husserl",
        "still",
        "willing",
        "regard",
        "proposition",
        "logic",
        "paradigm",
        "necessary",
        "truth",
        "baker",
        "hacker",
        "others",
        "go",
        "deny",
        "logical",
        "law",
        "status",
        "necessary",
        "truth",
        "weaker",
        "form",
        "denial",
        "accepts",
        "notion",
        "necessity",
        "meaningful",
        "hold",
        "logic",
        "fall",
        "short",
        "necessity",
        "stronger",
        "form",
        "reject",
        "notion",
        "necessity",
        "altogether",
        "cf",
        "pivcevic",
        "weaker",
        "form",
        "sketched",
        "paper",
        "gerald",
        "massey",
        "massey",
        "suggests",
        "logic",
        "mathematics",
        "forfeited",
        "claim",
        "honorific",
        "title",
        "science",
        "necessary",
        "truth",
        "admitted",
        "church",
        "thesis",
        "innersanctum",
        "according",
        "church",
        "thesis",
        "algorithm",
        "powerful",
        "turing",
        "machine",
        "put",
        "differently",
        "every",
        "function",
        "computable",
        "computable",
        "turing",
        "machine",
        "thesis",
        "presupposed",
        "establishing",
        "fundamental",
        "logical",
        "result",
        "used",
        "example",
        "order",
        "prove",
        "church",
        "theorem",
        "say",
        "algorithmic",
        "decision",
        "procedure",
        "firstorder",
        "logic",
        "yet",
        "church",
        "thesis",
        "mere",
        "hypothesis",
        "hypothesis",
        "proven",
        "true",
        "notion",
        "algorithm",
        "precisely",
        "definable",
        "limit",
        "variety",
        "algorithmic",
        "routine",
        "might",
        "assume",
        "thus",
        "church",
        "thesis",
        "may",
        "indeed",
        "false",
        "someone",
        "might",
        "eventually",
        "come",
        "algorithm",
        "computes",
        "definite",
        "function",
        "f",
        "turing",
        "machine",
        "compute",
        "jeffrey",
        "massey",
        "massey",
        "also",
        "invokes",
        "stronger",
        "form",
        "claim",
        "logical",
        "truth",
        "necessary",
        "according",
        "criticism",
        "notion",
        "necessity",
        "presupposed",
        "calling",
        "logical",
        "law",
        "necessary",
        "truth",
        "beset",
        "difficulty",
        "argument",
        "leading",
        "conclusion",
        "developed",
        "series",
        "wellknown",
        "paper",
        "quine",
        "quine",
        "argued",
        "notion",
        "analyticity",
        "necessity",
        "aprioricity",
        "stand",
        "fall",
        "together",
        "traditional",
        "distinction",
        "analytic",
        "synthetic",
        "truth",
        "relative",
        "rather",
        "absolute",
        "distinction",
        "becomes",
        "relative",
        "necessity",
        "aprioricity",
        "go",
        "board",
        "quine",
        "engel",
        "massey",
        "summarises",
        "implication",
        "quine",
        "argument",
        "succinctly",
        "reject",
        "concept",
        "necessity",
        "also",
        "forego",
        "concept",
        "contingency",
        "make",
        "sense",
        "say",
        "truth",
        "mathematics",
        "necessary",
        "make",
        "better",
        "sense",
        "say",
        "psychology",
        "socalled",
        "empirical",
        "science",
        "contingent",
        "may",
        "employ",
        "necessity",
        "contingency",
        "demarcate",
        "deliverance",
        "empirical",
        "science",
        "formal",
        "science",
        "distinguish",
        "philosophically",
        "interesting",
        "way",
        "different",
        "line",
        "attack",
        "frege",
        "husserl",
        "antipsychologism",
        "focus",
        "premise",
        "author",
        "share",
        "psychologistic",
        "opponent",
        "important",
        "shared",
        "premise",
        "idea",
        "primary",
        "cognitive",
        "attitude",
        "logic",
        "descriptive",
        "rather",
        "prescriptive",
        "logic",
        "describes",
        "object",
        "objectivity",
        "sachverhalte",
        "course",
        "frege",
        "husserl",
        "one",
        "hand",
        "psychologistic",
        "foe",
        "hand",
        "disagree",
        "nature",
        "object",
        "objectivity",
        "psychologicists",
        "real",
        "psychological",
        "whereas",
        "frege",
        "husserl",
        "ideal",
        "fact",
        "remains",
        "side",
        "dispute",
        "see",
        "logic",
        "essentially",
        "descriptive",
        "husserl",
        "see",
        "gethmann",
        "frege",
        "see",
        "baker",
        "hacker",
        "central",
        "frege",
        "husserl",
        "criticism",
        "psychologism",
        "idea",
        "psychologism",
        "turn",
        "relativism",
        "sort",
        "frege",
        "go",
        "point",
        "reduction",
        "psychologism",
        "relativism",
        "reason",
        "given",
        "make",
        "attempt",
        "refute",
        "relativism",
        "however",
        "husserl",
        "marshal",
        "number",
        "argument",
        "protagorean",
        "relativism",
        "specie",
        "relativism",
        "argument",
        "successful",
        "psychologism",
        "would",
        "unmasked",
        "selfrefuting",
        "doctrine",
        "number",
        "critic",
        "tried",
        "show",
        "successful",
        "concern",
        "husserl",
        "case",
        "protagorean",
        "relativism",
        "husserl",
        "admits",
        "argument",
        "convincing",
        "philosopher",
        "already",
        "accept",
        "truth",
        "absolute",
        "husserl",
        "ambitious",
        "respect",
        "specie",
        "relativism",
        "belief",
        "shown",
        "specie",
        "relativism",
        "selfrefuting",
        "doctrine",
        "cf",
        "føllesdal",
        "sukale",
        "argument",
        "according",
        "specie",
        "relativist",
        "misconstrues",
        "meaning",
        "truth",
        "allowing",
        "judgment",
        "true",
        "false",
        "clearly",
        "questionbegging",
        "husserl",
        "argument",
        "boil",
        "contradictory",
        "claim",
        "truth",
        "absolute",
        "truth",
        "absolute",
        "føllesdal",
        "husserl",
        "simply",
        "take",
        "absoluteness",
        "truth",
        "selfevident",
        "also",
        "overlook",
        "properly",
        "construed",
        "relativistic",
        "notion",
        "truth",
        "violate",
        "principle",
        "noncontradiction",
        "truth",
        "taken",
        "truthfors",
        "ie",
        "truth",
        "specie",
        "hyphenisation",
        "irreducible",
        "one",
        "judgment",
        "truefors",
        "falsefors",
        "without",
        "principle",
        "noncontradiction",
        "violated",
        "meiland",
        "argument",
        "according",
        "truth",
        "relative",
        "specie",
        "truth",
        "eternal",
        "obviously",
        "rejected",
        "petitio",
        "principii",
        "well",
        "finally",
        "husserl",
        "claim",
        "truth",
        "relative",
        "would",
        "existence",
        "world",
        "husserl",
        "little",
        "invoke",
        "selfevidence",
        "position",
        "take",
        "selfevident",
        "existence",
        "world",
        "relative",
        "show",
        "opposite",
        "assumption",
        "selfrefuting",
        "husserl",
        "frequent",
        "reliance",
        "upon",
        "apodictic",
        "selfevidence",
        "weapon",
        "specie",
        "relativist",
        "source",
        "insight",
        "logical",
        "truth",
        "beset",
        "difficulty",
        "husserl",
        "seems",
        "think",
        "apodictic",
        "selfevidence",
        "take",
        "philosopherlogician",
        "beyond",
        "realm",
        "factual",
        "even",
        "beyond",
        "realm",
        "psychology",
        "pointed",
        "arne",
        "naess",
        "apodictic",
        "selfevidence",
        "deliver",
        "promise",
        "assertion",
        "evidence",
        "belong",
        "pure",
        "logic",
        "pure",
        "formal",
        "science",
        "belongs",
        "factual",
        "science",
        "concerning",
        "relation",
        "logician",
        "others",
        "pure",
        "science",
        "necessary",
        "conceive",
        "psychology",
        "enough",
        "science",
        "fact",
        "generally",
        "science",
        "real",
        "rather",
        "ideal",
        "naess",
        "thus",
        "naess",
        "concludes",
        "program",
        "pure",
        "logic",
        "system",
        "apodictic",
        "knowledge",
        "dismissed",
        "soon",
        "science",
        "said",
        "science",
        "something",
        "radical",
        "risk",
        "error",
        "naess",
        "finally",
        "frege",
        "husserl",
        "benno",
        "erdmann",
        "chief",
        "culprit",
        "main",
        "advocate",
        "form",
        "psychologism",
        "lead",
        "specie",
        "relativism",
        "interestingly",
        "enough",
        "last",
        "thirty",
        "year",
        "critical",
        "reevaluation",
        "antipsychologism",
        "even",
        "led",
        "partial",
        "rehabilitation",
        "erdmann",
        "psychologistic",
        "view",
        "logic",
        "jack",
        "meiland",
        "construes",
        "erdmann",
        "philosophy",
        "logic",
        "psychological",
        "interpretation",
        "logical",
        "principle",
        "meant",
        "explain",
        "conceive",
        "radically",
        "different",
        "logical",
        "system",
        "explanation",
        "logical",
        "law",
        "express",
        "condition",
        "govern",
        "thinking",
        "sense",
        "describing",
        "limit",
        "think",
        "one",
        "husserl",
        "central",
        "objection",
        "view",
        "logical",
        "principle",
        "like",
        "principle",
        "noncontradiction",
        "denied",
        "human",
        "individual",
        "indeed",
        "denied",
        "example",
        "hegel",
        "thus",
        "husserl",
        "concludes",
        "logical",
        "law",
        "describe",
        "limit",
        "psychologically",
        "thinkable",
        "however",
        "meiland",
        "suggests",
        "erdmann",
        "position",
        "refuted",
        "argument",
        "erdmann",
        "need",
        "reply",
        "human",
        "being",
        "able",
        "utter",
        "word",
        "principle",
        "noncontradiction",
        "false",
        "thereby",
        "think",
        "contrary",
        "principle",
        "understand",
        "saying",
        "central",
        "husserlian",
        "objection",
        "erdmann",
        "psychologism",
        "logical",
        "law",
        "psychological",
        "law",
        "would",
        "mental",
        "act",
        "judgment",
        "idea",
        "psychological",
        "entity",
        "word",
        "logical",
        "law",
        "real",
        "content",
        "obviously",
        "logical",
        "law",
        "real",
        "content",
        "therefore",
        "psychological",
        "approach",
        "logic",
        "must",
        "false",
        "meiland",
        "provides",
        "defense",
        "erdmann",
        "true",
        "law",
        "logic",
        "refer",
        "human",
        "being",
        "psychology",
        "might",
        "still",
        "truefor",
        "human",
        "being",
        "virtue",
        "psychology",
        "put",
        "differently",
        "must",
        "distinguish",
        "statement",
        "explicitly",
        "true",
        "virtue",
        "principle",
        "noncontradiction",
        "normally",
        "stated",
        "without",
        "reference",
        "human",
        "being",
        "true",
        "human",
        "being",
        "virtue",
        "nature",
        "psychologistic",
        "theory",
        "correct",
        "meiland",
        "meiland",
        "explains",
        "idea",
        "drawing",
        "relation",
        "gravity",
        "law",
        "planetary",
        "motion",
        "law",
        "planetary",
        "motion",
        "gravity",
        "true",
        "virtue",
        "gravity",
        "erdmann",
        "could",
        "claim",
        "law",
        "logic",
        "mind",
        "standard",
        "psychological",
        "property",
        "nature",
        "mind",
        "meiland",
        "despite",
        "spirited",
        "defence",
        "frege",
        "husserl",
        "favourite",
        "whipping",
        "boy",
        "meiland",
        "belief",
        "erdmann",
        "psychologism",
        "must",
        "overcome",
        "difficulty",
        "become",
        "fully",
        "respectable",
        "main",
        "problem",
        "erdmann",
        "allows",
        "possibility",
        "law",
        "logic",
        "could",
        "change",
        "could",
        "different",
        "logic",
        "logic",
        "conflict",
        "present",
        "one",
        "yet",
        "hard",
        "see",
        "erdmann",
        "could",
        "entitled",
        "make",
        "claim",
        "premise",
        "present",
        "logic",
        "defines",
        "limit",
        "thinkable",
        "mean",
        "radically",
        "different",
        "logic",
        "must",
        "unthinkable",
        "u",
        "put",
        "differently",
        "erdmann",
        "owes",
        "u",
        "explanation",
        "could",
        "ever",
        "come",
        "believe",
        "different",
        "logic",
        "possible",
        "interestingly",
        "enough",
        "challenge",
        "meiland",
        "directs",
        "erdmann",
        "met",
        "remmel",
        "nunn",
        "suggested",
        "jerry",
        "fodor",
        "functionalism",
        "provides",
        "u",
        "method",
        "conceptualizing",
        "situation",
        "entity",
        "restricted",
        "using",
        "one",
        "one",
        "set",
        "formal",
        "principle",
        "even",
        "though",
        "different",
        "set",
        "may",
        "operative",
        "different",
        "condition",
        "according",
        "functionalism",
        "human",
        "compared",
        "computer",
        "human",
        "come",
        "equipped",
        "builtin",
        "language",
        "thought",
        "language",
        "function",
        "like",
        "machine",
        "table",
        "computer",
        "computer",
        "able",
        "compute",
        "formula",
        "among",
        "vocabulary",
        "machine",
        "table",
        "mean",
        "machine",
        "table",
        "given",
        "computer",
        "without",
        "alternative",
        "system",
        "logical",
        "law",
        "inconsistent",
        "given",
        "automaton",
        "thus",
        "imagine",
        "given",
        "computer",
        "designed",
        "systematically",
        "make",
        "regard",
        "formal",
        "mistake",
        "m",
        "case",
        "machine",
        "would",
        "unable",
        "detect",
        "mistake",
        "would",
        "constitute",
        "one",
        "law",
        "automaton",
        "detects",
        "error",
        "nunn",
        "adopt",
        "analogy",
        "human",
        "computer",
        "nunn",
        "suggests",
        "make",
        "sense",
        "idea",
        "logic",
        "might",
        "universal",
        "think",
        "logic",
        "central",
        "part",
        "language",
        "thought",
        "thus",
        "adopt",
        "view",
        "logic",
        "part",
        "machine",
        "table",
        "must",
        "accept",
        "logic",
        "might",
        "unique",
        "true",
        "state",
        "radically",
        "different",
        "logic",
        "would",
        "look",
        "like",
        "however",
        "order",
        "vindicate",
        "erdmann",
        "enough",
        "analogy",
        "make",
        "sense",
        "possibility",
        "logic",
        "nunn"
    ]
}