{
    "main_text": "Frege’s Antipsychologistic Arguments\n4. Frege’s Antipsychologistic Arguments\n\nConsider first Frege’s Grundlagen der Arithmetik\n(1884). One of Frege’s main thesis is that mathematics and logic\nare not part of psychology, and that the objects and laws of\nmathematics and psychology are not defined, illuminated, proven true,\nor explained by psychological observations and results. One of\nFrege’s central arguments for this thesis is the consideration\nthat whereas mathematics is the most exact of all sciences, psychology\nis imprecise and vague (1884, 38). Thus it is implausible to assume\nthat mathematics could possibly be based upon, or be a part of,\npsychology. A closely related further point is that we need to\ndistinguish between psychological ‘ideas’\n(Vorstellungen) and their objects. This distinction is\nespecially important when the latter are objective or ideal. Numbers,\nfor example, are objective and ideal entities, and thus they differ\nfundamentally from ideas. Ideas are always subjective and\nidiosyncratic. In this context Frege laments the fact that the term\n‘idea’ has also been used for objective, essentially\nnon-sensual, abstract and objective entities (1884, 37). Frege rejects\npsychological or physiological interpretations of the Kantian\ndistinctions between the a priori and the a posteriori, and the\nanalytic and the synthetic; as Frege has, it these distinctions\nconcern different ways in which judgments are justified or proven\ntrue, not different operations of the human mind (1884, 3). \n\nA central theme of the Grundlagen is a detailed criticism of\nMill’s philosophy of mathematics. Frege argues that mathematical\ntruths are not empirical truths and that numbers cannot be properties\nof aggregates of objects. First, Frege denies Mill’s claim that\nmathematical statements are about matters of fact. Frege’s\nobjection is that there is no physical fact of the matter to which the\nnumbers 0 or 777864 refer. Moreover, someone who learns how to\ncalculate does not thereby gain any new empirical knowledge (1884,\n9–11). Second, Frege insists that there is no general inductive\nlaw from which all mathematical sentences can be said to follow (1884,\n10). Third, while Frege grants Mill that some empirical knowledge may\nwell be necessary for us to learn mathematics, he points out that\nempirical knowledge cannot justify mathematical truths (1884, 12).\nFourth, Frege counters Mill’s claim according to which numbers\nare properties of aggregates of objects with the observations that\naggregates do not have — in and of themselves —\ncharacteristic manners in which they can be divided. Frege also points\nout that the numbers 0 and 1 are not aggregates at all. And finally,\nFrege accuses Mill of overlooking that numbers can be predicated of\nboth concrete and abstract objects (1884, 31).\n\nFrege continues his criticism of psychological logic in the\n‘Foreword’ of his Grundgesetze der Arithmetik\n(1893). He begins by pointing out that the word ‘law’ is\nambiguous: it can refer to descriptive or to prescriptive laws.\nExamples of the former are the laws of physics, examples of the latter\nare moral laws (1893, XV). Frege suggests that every descriptive law\ncan be reformulated as a prescription to think in accordance with it.\nFor instance, true descriptive laws ought to be accepted. Hence they\ncan be prefixed by the prescription: ‘accept the truth of\n…’. In other cases the prescription might be a set of\ninstructions on how to reach the truth stated in a descriptive law.\nFrege’s main point in all this is that whereas all\nprescriptive laws can be categorized as ‘laws of thought’\non the basis that they tell what we ought to think, only one\nkind of descriptive laws deserves to be come under the same heading:\nthe set of psychological descriptive laws (ibid.). \n\nFrege claims that in the realm of logic we find both descriptive and\nprescriptive laws, with the former being the foundation for the\nlatter. The point merits stressing since it is sometimes suggested\nthat for Frege the opposition between psychological laws and logical\nlaws is the is-ought opposition (e.g. Føllesdal 1958, 49). But\nnote that Frege writes:\n\n…every law that states what is can be apprehended as\nprescribing that one ought to think in accordance with it …\nThis holds of geometrical and physical laws no less than logical laws\n(1893, XV).\n\n\nThus logical laws are primarily descriptive laws even though, like\nother descriptive laws, they too can be reformulated or apprehended as\nprescriptive laws. These distinctions allow Frege to distinguish\nbetween two versions of ‘psychological logicians’: one\ngroup takes the laws of logic to be descriptive psychological laws,\nthe other group interprets the laws of logic as prescriptive laws\nbased on descriptive psychological laws. It is the ambiguity of the\nexpression ‘law of thought’ that invites these confusions\n(1893, XV).\n\nFrege’s main criticism of psychological logic is that it\nconflates ‘true’ and ‘being-taken-to-be-true’.\nTo begin with, Frege denies that prescriptions based on psychological\nlaws can qualify as proper logical laws. Such prescriptions can be no\nmore than demands to conform to current thinking habits. But they\ncannot be yardsticks by which these thinking habits can be evaluated\nas to their truth. Moreover, Frege points out that the descriptive\npsychological laws which for the psychological logician provide the\nbasis for (psycho-)logical prescriptions are laws of\n‘taking-to-be-true’: they state the conditions under which\nhumans accept the truth of judgments or the validity of inferences;\nbut they do not determine the conditions under which judgments are\ntrue and inferences valid. Here Frege is particularly scathing of the\npsychological logician Benno Erdmann who identifies truth with general\nconsensus. For Frege this move makes truth dependent upon\nwhat-is-taken-to-be-true. And it fails to give proper heed to the\ninsight that truth is independent of people’s agreement. It\nfollows that the laws of logic are not psychological laws: ‘If\nbeing true is thus independent of being acknowledged by somebody or\nother, then the laws of truth are not psychological laws: they are\nboundary stones set in an eternal foundation, which our thought can\noverflow but never displace’ (1893, XVI). Frege’s attack\non Erdmann does not end here. Erdmann is also taken to task for his\nsuggestion that logical laws might have mere ‘hypothetical\nnecessity’, that is, that they are relative to the human\nspecies. Frege maintains that if we were to encounter creatures who\ndeny the laws of logic, we would take them to be insane; and he\nanalyses Erdmann’s proposal as reducing, yet again, truth to\nwhat-is-taken-to-be-true (1893, XVI–XVII). At the same time, Frege\naccepts that the most fundamental logical laws cannot be justified.\nLogical justification comes to an end when we reach these laws.\nHowever, to argue that our nature or constitution forces us to abide\nby the laws of logic is no longer a logical justification; it\nis to incorrectly shift from logical to psychological or biological\nconsiderations (1893, XVI–XVII).\n\nFor Frege the opposition between truth and what-is-taking-to-be-true\nis closely linked to the distinction between accepting and rejecting\nthe realm of objective and non-real entities. Frege insists that the\nrealm of the non-real is not identical with the realm of the\npsychological and subjective. His example of objective,\nnon-psychological entities are numbers. Numbers are not ideas since\nthey are the same for all subjects (1893, XVIII). Moreover, Frege\ntries to convince us that the denial of the objectivity and\nnon-reality of numbers and concepts leads fairly directly into\nidealism and solipsism. Since psychological logicians try so hard to\nbreak down the distinction between the realms of the objective-ideal\nand the subjective-psychological, they easily are tempted to go\nfurther and challenge the borderline between the\nsubjective-psychological and the objective-real. The resulting\nstandpoint is idealism and solipsism: idealism since the only existing\nentities are ideas; solipsism since all ideas are relative to\nsubjects. And thus the possibility of communication is a further\nvictim of their efforts (1893, XIX). Again Frege is eager to show that\nErdmann’s logic is guilty of the charges. He therefore points\nout that Erdmann calls both hallucinated objects and numbers\n‘objects of an ideal nature’; that Erdmann fails to\ndistinguish between acts and contents of judgments; and that Erdmann\nlacks the conceptual resources to distinguish between ideas and\nrealities (1893, XX–XXIII). \n\nFrege’s alternative is of course to emphasize that\ncoming-to-know is an activity that grasps rather than\ncreates objects. This choice of terminology is meant to bring\nout that what we come to know is (usually) independent of us.\nAfter all, when we grasp a physical object like a pencil, the object\nis independent both of the act of grasping and of the human actor of\nthe grasping (1893, XXIV).\n\nFrege’s third anti-psychologistic discussion is his 1894-review\nof Husserl’s Philosophie der Arithmetik (1891). I shall\nnot here enter into the debate over whether it was Frege’s\ncriticism that turned Husserl away from psychologism (cf. Kusch 1995,\n12–13). Nor shall I try to adjudicate whether Frege’s\ncritique was justified. Suffice it here to point out that\nFrege’s review classifies Husserl as a psychological logician on\nthe grounds that Husserl treats the meanings of words, concepts and\nobjects as different kinds of ideas (1894, 316); that Husserl provides\npsychological-genetic accounts of the origins of abstract concepts\n(1894, 317); and that Husserl, like Erdmann, equivocates on the notion\nof idea: in some places in his book, concepts and objects are\nunderstood as subjective, in other places they are taken to be\nobjective (1894, 318). In his criticism of Husserl’s\npsychological explanation of the genesis of the number concept, Frege\ndoes not confine himself to contrasting Husserl’s theory with\nhis own account of numbers. He also points out that the various\npsychological processes which Husserl’s theory assumes are\nspurious. For instance, Frege denies that we can combine any arbitrary\ncontents into one idea without relating these contents to one another.\nHe also rejects Husserl’s claim that we can abstract from all\ndifferences between two contents and still retain their numerical\ndistinctness (1894, 316, 323). \n",
    "section_title": "4. Frege’s Antipsychologistic Arguments",
    "entry_title": "Psychologism",
    "hierarchy_title": "Psychologism || Frege’s Antipsychologistic Arguments",
    "tokenized_text": [
        "frege",
        "antipsychologistic",
        "argument",
        "frege",
        "antipsychologistic",
        "argument",
        "consider",
        "first",
        "frege",
        "grundlagen",
        "der",
        "arithmetik",
        "one",
        "frege",
        "main",
        "thesis",
        "mathematics",
        "logic",
        "part",
        "psychology",
        "object",
        "law",
        "mathematics",
        "psychology",
        "defined",
        "illuminated",
        "proven",
        "true",
        "explained",
        "psychological",
        "observation",
        "result",
        "one",
        "frege",
        "central",
        "argument",
        "thesis",
        "consideration",
        "whereas",
        "mathematics",
        "exact",
        "science",
        "psychology",
        "imprecise",
        "vague",
        "thus",
        "implausible",
        "assume",
        "mathematics",
        "could",
        "possibly",
        "based",
        "upon",
        "part",
        "psychology",
        "closely",
        "related",
        "point",
        "need",
        "distinguish",
        "psychological",
        "idea",
        "vorstellungen",
        "object",
        "distinction",
        "especially",
        "important",
        "latter",
        "objective",
        "ideal",
        "number",
        "example",
        "objective",
        "ideal",
        "entity",
        "thus",
        "differ",
        "fundamentally",
        "idea",
        "idea",
        "always",
        "subjective",
        "idiosyncratic",
        "context",
        "frege",
        "lament",
        "fact",
        "term",
        "idea",
        "also",
        "used",
        "objective",
        "essentially",
        "nonsensual",
        "abstract",
        "objective",
        "entity",
        "frege",
        "reject",
        "psychological",
        "physiological",
        "interpretation",
        "kantian",
        "distinction",
        "priori",
        "posteriori",
        "analytic",
        "synthetic",
        "frege",
        "distinction",
        "concern",
        "different",
        "way",
        "judgment",
        "justified",
        "proven",
        "true",
        "different",
        "operation",
        "human",
        "mind",
        "central",
        "theme",
        "grundlagen",
        "detailed",
        "criticism",
        "mill",
        "philosophy",
        "mathematics",
        "frege",
        "argues",
        "mathematical",
        "truth",
        "empirical",
        "truth",
        "number",
        "property",
        "aggregate",
        "object",
        "first",
        "frege",
        "denies",
        "mill",
        "claim",
        "mathematical",
        "statement",
        "matter",
        "fact",
        "frege",
        "objection",
        "physical",
        "fact",
        "matter",
        "number",
        "refer",
        "moreover",
        "someone",
        "learns",
        "calculate",
        "thereby",
        "gain",
        "new",
        "empirical",
        "knowledge",
        "second",
        "frege",
        "insists",
        "general",
        "inductive",
        "law",
        "mathematical",
        "sentence",
        "said",
        "follow",
        "third",
        "frege",
        "grant",
        "mill",
        "empirical",
        "knowledge",
        "may",
        "well",
        "necessary",
        "u",
        "learn",
        "mathematics",
        "point",
        "empirical",
        "knowledge",
        "justify",
        "mathematical",
        "truth",
        "fourth",
        "frege",
        "counter",
        "mill",
        "claim",
        "according",
        "number",
        "property",
        "aggregate",
        "object",
        "observation",
        "aggregate",
        "characteristic",
        "manner",
        "divided",
        "frege",
        "also",
        "point",
        "number",
        "aggregate",
        "finally",
        "frege",
        "accuses",
        "mill",
        "overlooking",
        "number",
        "predicated",
        "concrete",
        "abstract",
        "object",
        "frege",
        "continues",
        "criticism",
        "psychological",
        "logic",
        "foreword",
        "grundgesetze",
        "der",
        "arithmetik",
        "begin",
        "pointing",
        "word",
        "law",
        "ambiguous",
        "refer",
        "descriptive",
        "prescriptive",
        "law",
        "example",
        "former",
        "law",
        "physic",
        "example",
        "latter",
        "moral",
        "law",
        "xv",
        "frege",
        "suggests",
        "every",
        "descriptive",
        "law",
        "reformulated",
        "prescription",
        "think",
        "accordance",
        "instance",
        "true",
        "descriptive",
        "law",
        "ought",
        "accepted",
        "hence",
        "prefixed",
        "prescription",
        "accept",
        "truth",
        "case",
        "prescription",
        "might",
        "set",
        "instruction",
        "reach",
        "truth",
        "stated",
        "descriptive",
        "law",
        "frege",
        "main",
        "point",
        "whereas",
        "prescriptive",
        "law",
        "categorized",
        "law",
        "thought",
        "basis",
        "tell",
        "ought",
        "think",
        "one",
        "kind",
        "descriptive",
        "law",
        "deserves",
        "come",
        "heading",
        "set",
        "psychological",
        "descriptive",
        "law",
        "ibid",
        "frege",
        "claim",
        "realm",
        "logic",
        "find",
        "descriptive",
        "prescriptive",
        "law",
        "former",
        "foundation",
        "latter",
        "point",
        "merit",
        "stressing",
        "since",
        "sometimes",
        "suggested",
        "frege",
        "opposition",
        "psychological",
        "law",
        "logical",
        "law",
        "isought",
        "opposition",
        "eg",
        "føllesdal",
        "note",
        "frege",
        "writes",
        "every",
        "law",
        "state",
        "apprehended",
        "prescribing",
        "one",
        "ought",
        "think",
        "accordance",
        "hold",
        "geometrical",
        "physical",
        "law",
        "le",
        "logical",
        "law",
        "xv",
        "thus",
        "logical",
        "law",
        "primarily",
        "descriptive",
        "law",
        "even",
        "though",
        "like",
        "descriptive",
        "law",
        "reformulated",
        "apprehended",
        "prescriptive",
        "law",
        "distinction",
        "allow",
        "frege",
        "distinguish",
        "two",
        "version",
        "psychological",
        "logician",
        "one",
        "group",
        "take",
        "law",
        "logic",
        "descriptive",
        "psychological",
        "law",
        "group",
        "interprets",
        "law",
        "logic",
        "prescriptive",
        "law",
        "based",
        "descriptive",
        "psychological",
        "law",
        "ambiguity",
        "expression",
        "law",
        "thought",
        "invite",
        "confusion",
        "xv",
        "frege",
        "main",
        "criticism",
        "psychological",
        "logic",
        "conflates",
        "true",
        "beingtakentobetrue",
        "begin",
        "frege",
        "denies",
        "prescription",
        "based",
        "psychological",
        "law",
        "qualify",
        "proper",
        "logical",
        "law",
        "prescription",
        "demand",
        "conform",
        "current",
        "thinking",
        "habit",
        "yardstick",
        "thinking",
        "habit",
        "evaluated",
        "truth",
        "moreover",
        "frege",
        "point",
        "descriptive",
        "psychological",
        "law",
        "psychological",
        "logician",
        "provide",
        "basis",
        "psycho",
        "logical",
        "prescription",
        "law",
        "takingtobetrue",
        "state",
        "condition",
        "human",
        "accept",
        "truth",
        "judgment",
        "validity",
        "inference",
        "determine",
        "condition",
        "judgment",
        "true",
        "inference",
        "valid",
        "frege",
        "particularly",
        "scathing",
        "psychological",
        "logician",
        "benno",
        "erdmann",
        "identifies",
        "truth",
        "general",
        "consensus",
        "frege",
        "move",
        "make",
        "truth",
        "dependent",
        "upon",
        "whatistakentobetrue",
        "fails",
        "give",
        "proper",
        "heed",
        "insight",
        "truth",
        "independent",
        "people",
        "agreement",
        "follows",
        "law",
        "logic",
        "psychological",
        "law",
        "true",
        "thus",
        "independent",
        "acknowledged",
        "somebody",
        "law",
        "truth",
        "psychological",
        "law",
        "boundary",
        "stone",
        "set",
        "eternal",
        "foundation",
        "thought",
        "overflow",
        "never",
        "displace",
        "xvi",
        "frege",
        "attack",
        "erdmann",
        "end",
        "erdmann",
        "also",
        "taken",
        "task",
        "suggestion",
        "logical",
        "law",
        "might",
        "mere",
        "hypothetical",
        "necessity",
        "relative",
        "human",
        "specie",
        "frege",
        "maintains",
        "encounter",
        "creature",
        "deny",
        "law",
        "logic",
        "would",
        "take",
        "insane",
        "analysis",
        "erdmann",
        "proposal",
        "reducing",
        "yet",
        "truth",
        "whatistakentobetrue",
        "xvixvii",
        "time",
        "frege",
        "accepts",
        "fundamental",
        "logical",
        "law",
        "justified",
        "logical",
        "justification",
        "come",
        "end",
        "reach",
        "law",
        "however",
        "argue",
        "nature",
        "constitution",
        "force",
        "u",
        "abide",
        "law",
        "logic",
        "longer",
        "logical",
        "justification",
        "incorrectly",
        "shift",
        "logical",
        "psychological",
        "biological",
        "consideration",
        "xvixvii",
        "frege",
        "opposition",
        "truth",
        "whatistakingtobetrue",
        "closely",
        "linked",
        "distinction",
        "accepting",
        "rejecting",
        "realm",
        "objective",
        "nonreal",
        "entity",
        "frege",
        "insists",
        "realm",
        "nonreal",
        "identical",
        "realm",
        "psychological",
        "subjective",
        "example",
        "objective",
        "nonpsychological",
        "entity",
        "number",
        "number",
        "idea",
        "since",
        "subject",
        "xviii",
        "moreover",
        "frege",
        "try",
        "convince",
        "u",
        "denial",
        "objectivity",
        "nonreality",
        "number",
        "concept",
        "lead",
        "fairly",
        "directly",
        "idealism",
        "solipsism",
        "since",
        "psychological",
        "logician",
        "try",
        "hard",
        "break",
        "distinction",
        "realm",
        "objectiveideal",
        "subjectivepsychological",
        "easily",
        "tempted",
        "go",
        "challenge",
        "borderline",
        "subjectivepsychological",
        "objectivereal",
        "resulting",
        "standpoint",
        "idealism",
        "solipsism",
        "idealism",
        "since",
        "existing",
        "entity",
        "idea",
        "solipsism",
        "since",
        "idea",
        "relative",
        "subject",
        "thus",
        "possibility",
        "communication",
        "victim",
        "effort",
        "xix",
        "frege",
        "eager",
        "show",
        "erdmann",
        "logic",
        "guilty",
        "charge",
        "therefore",
        "point",
        "erdmann",
        "call",
        "hallucinated",
        "object",
        "number",
        "object",
        "ideal",
        "nature",
        "erdmann",
        "fails",
        "distinguish",
        "act",
        "content",
        "judgment",
        "erdmann",
        "lack",
        "conceptual",
        "resource",
        "distinguish",
        "idea",
        "reality",
        "xxxxiii",
        "frege",
        "alternative",
        "course",
        "emphasize",
        "comingtoknow",
        "activity",
        "grasp",
        "rather",
        "creates",
        "object",
        "choice",
        "terminology",
        "meant",
        "bring",
        "come",
        "know",
        "usually",
        "independent",
        "u",
        "grasp",
        "physical",
        "object",
        "like",
        "pencil",
        "object",
        "independent",
        "act",
        "grasping",
        "human",
        "actor",
        "grasping",
        "xxiv",
        "frege",
        "third",
        "antipsychologistic",
        "discussion",
        "review",
        "husserl",
        "philosophie",
        "der",
        "arithmetik",
        "shall",
        "enter",
        "debate",
        "whether",
        "frege",
        "criticism",
        "turned",
        "husserl",
        "away",
        "psychologism",
        "cf",
        "kusch",
        "shall",
        "try",
        "adjudicate",
        "whether",
        "frege",
        "critique",
        "justified",
        "suffice",
        "point",
        "frege",
        "review",
        "classifies",
        "husserl",
        "psychological",
        "logician",
        "ground",
        "husserl",
        "treat",
        "meaning",
        "word",
        "concept",
        "object",
        "different",
        "kind",
        "idea",
        "husserl",
        "provides",
        "psychologicalgenetic",
        "account",
        "origin",
        "abstract",
        "concept",
        "husserl",
        "like",
        "erdmann",
        "equivocates",
        "notion",
        "idea",
        "place",
        "book",
        "concept",
        "object",
        "understood",
        "subjective",
        "place",
        "taken",
        "objective",
        "criticism",
        "husserl",
        "psychological",
        "explanation",
        "genesis",
        "number",
        "concept",
        "frege",
        "confine",
        "contrasting",
        "husserl",
        "theory",
        "account",
        "number",
        "also",
        "point",
        "various",
        "psychological",
        "process",
        "husserl",
        "theory",
        "assumes",
        "spurious",
        "instance",
        "frege",
        "denies",
        "combine",
        "arbitrary",
        "content",
        "one",
        "idea",
        "without",
        "relating",
        "content",
        "one",
        "another",
        "also",
        "reject",
        "husserl",
        "claim",
        "abstract",
        "difference",
        "two",
        "content",
        "still",
        "retain",
        "numerical",
        "distinctness"
    ]
}