{
    "main_text": "Husserl’s Antipsychologistic Arguments\n5. Husserl’s Antipsychologistic Arguments\n\nHusserl’s criticism of psychologism in the Prolegomena\nof the Logische Untersuchungen was the key text in the\nGerman-speaking debate over psychologism during the first\ndecade-and-a-half of the twentieth century (Husserl 1900). The\nProlegomena fall roughly into three parts. Part One\nidentifies the sense in which logic is a ‘practical-normative\ndiscipline’ (Kunstlehre) (Chapters 1 and 2). Part Two\nargues at great length that the theoretical foundations of the logical\npractical-normative discipline are not psychological (Chapters 3 to\n10). And Part Three provides an overview over the true foundations of\nlogic as a practical-normative discipline (Chapter 11). I have\nreconstructed all three parts in some detail elsewhere (Kusch 1995,\n41–60), here I shall concentrate on Part Two. (Important recent\ndiscussions of Husserl’s arguments include Carr 2007, Hanna\n2008, Hopkins 2006, Moran 2008, Pelletier et al. 2008.)\n\nFrom Part One we here need only two ideas. First, logic as a\npractical-normative discipline vis-à-vis the sciences\nis a theory of science (Wissenschaftslehre). It evaluates the\nmethods of scientific justification, and in so doing it addresses the\nquestions: Under what (empirical) conditions can valid methods be used\nsuccessfully? What is the internal conceptual structure of each of the\nsciences, and how can they be demarcated from one another? And how can\nscientists avoid making mistakes? (§§5–11) Second,\nnormative disciplines have non-normative theoretical foundations\nbelonging to one or more non-normative theoretical discipline\n(§§14–16). \n\nHusserl begins his discussion of psychologism in Part Two with a\ncriticism of what one might call ‘normative\nanti-psychologism’, that is, the view that psychology and logic\nare divided by the is-ought distinction (§17). He sides with the\nproponents of psychologism who maintain that thought as it ought\nto occur is but a special case of thought as it in fact\noccurs. Nor is it right, Husserl thinks, to accuse psychologism\nof circularity; some critics of psychologism had argued that one\ncannot base normative logic on psychology since psychology itself has\nsome of its foundations in logic. But this misses an important\ndistinction. Psychology can either take the laws of logic as premises\nand axioms of its own theories, or it can rely on the laws of logic\nmerely as rules of method in accordance with which psychology\nmust proceed. If psychology did the former, psychologism would involve\na vicious circle. But psychology presupposes laws of logic only in the\nsecond, weaker, sense. And hence psychologism is not based upon a\nfatal circularity (§19).\n\nHaving dismissed these two older forms of antipsychologism, Husserl\nmoves on to present his own arguments. One main train of thought\ncenters on the three empiricist consequences of psychologism. They can\nbe reconstructed as follows:\n\n\nFirst Consequence: If logical rules were based upon\npsychological laws, then all logical rules would have to be as vague\nas the underlying psychological laws.\n\nRefutation: Not all logical rules are vague. And therefore\nnot all logical rules are based upon psychological laws.\n(§21).\n\nSecond Consequence: If laws of logic were psychological laws,\nthen they could not be known a priori. They would be more or less\nprobable rather than Valid, and justified only by reference to\nexperience.\n\nRefutation: Laws of logic are a priori, they are justified by\napodictic self-evidence, and valid rather than probable. And therefore\nlaws of logic are not psychological (§21). \n\nThird Consequence: If logical laws were psychological laws,\nthey would refer to psychological entities.\n\nRefutation: Logical laws do not refer to psychological\nentities. And therefore logical laws are not psychological laws\n(§23).\n\n\nHusserl also claims that psychologism fails to do justice to the idea\nthat truths are eternal. It is precisely because truths are eternal\nthat logical laws cannot be laws about states of affairs (be they\nmental or physical). Husserl attempts to prove this claim by showing\nthat the opposite assumption leads to paradoxes.\n\nTake a logical law like (*). \n\n(*) For every truth t, its contradictory opposite\n~t is no truth.\n\n\nAnd then assume (a)–(d):\n\n\n(a) Laws about states of affairs are laws about the coming to\nbe and passing away of states of affairs.\n\n(b) (*) is a truth.\n\n(c) (*) is a law about truths.\n\n(d) Laws about truths are laws about state of affairs.\n\n\nThen two paradoxical conclusions follow:\n\n\n(e) Laws about truths are laws about the coming to be and\npassing away of truths.\n\n(f) Laws about truths are laws about the coming to be and\npassing away of laws about truths (§24; Kusch 1995, 47).\n\n\nHusserl also seeks to show that psychological interpretations of the\nbasic logical principles and the laws of syllogistics are\nunsatisfactory. As far as the basic principles are concerned, Husserl\ntargets for example Spencer’s psychological rendering of the\nPrinciple of Non-Contradiction. He quotes Spencer as saying that\n\n…the appearance of any positive mode of consciousness cannot\nappear without excluding a correlative negative mode; and … the\nnegative mode cannot occur without excluding the correlative positive\nmode.\n\n\nIn Husserl’s view Spencer’s sentence is a tautology since\npositive and negative modes already form a pair of contradictory\nopposites. However, Husserl insists, the Principle of\nNon-Contradiction is no tautology (§26). Concerning\npsychologistic views of syllogistics, Husserl’s main target is\nthe Dutch psychologist and philosopher Gerardus Heymans. On the one\nhand, Husserl points out that if the laws of syllogistics were laws of\nthought, then we would never commit fallacies. On the other hand, a\npsychological interpretation of syllogistics cannot explain\nwhy some inferences are valid and others invalid\n(§31).\n\nLike Frege, Husserl ultimately seeks to refute psychologism by linking\nit closely to broader and (at the time) disreputable philosophical\npositions. But for Husserl the focus is less on subjective idealism\nand solipsism and more on skepticism and relativism. Husserl contends\nthat all forms of psychologism are forms of ‘species\nrelativism’, more precisely ‘anthropologism’. And he\ngoes on to argue that such relativism is ‘absurd’. In\norder to get to this general conclusion, Husserl begins by arguing\nagainst Protagorean relativism. While acknowledging that the true\nProtagorean relativist can never be argued out of his position,\nHusserl holds that we ‘normally disposed’ people can\nnevertheless see what is wrong with the Protagorean viewpoint: the\nsame sentence cannot be both true and false, and the Protagorean\nthesis, ‘truth is relative’, cannot itself be merely\nrelatively true. (§35). Species relativism (and thus\nanthropologism) is equally absurd, but a little harder to refute.\nHusserl marshals a number of arguments against species relativism; the\nmost important are (a) that since the Principle of\nNon-Contradiction is part of the meaning of truth, one and the same\nthought cannot be true for one species and false for another;\n(b) that truth are eternal and thus not temporally and\nspatially determined; and (c) that if truth were relative\nthen so would be the existence of the world. This is because the world\nis the correlate of the ideal system of all factual truths. If truth\nwere relative then there would be no such ideal system and thus no one\nunique world (§36). \n\nHaving convinced himself that anthropologism is self-refuting, Husserl\nturns in some detail to showing all forms of psychologism are forms of\nanthropologism (§38). The views of Erdmann and Sigwart receive\nmost of his attention. In Sigwart’s case, Husserl criticizes,\namongst other things, the view according to which it would be wrong to\nassume that a judgment could be true even if no intellect were ever\nthinking this judgment. Husserl objects with the thought that it is\npart of the meaning of the law of gravity that it is true for all\ntimes (even prior to its discovery) regardless of whether it happens\nto be thought by anyone or not (§39) In Erdmann’s case\nHusserl goes to even greater lengths in order to unearth what he\nregards as fatal flaws and inconsistencies. The central issue for\nHusserl is Erdmann’s claim that logical laws are merely\nhypothetically necessary, that is, that logical laws are necessary\nonly for members of the human species up until the present (§40).\nPerhaps the most important argument is that Erdmann’s position\nin inherently unstable: on the one hand, Erdmann argues for the\nhypothetical necessity, or species-relativity, of logical laws be\ninsisting that we cannot imagine alternatives to logical laws. On the\nother hand, Erdmann holds that therefore logical laws are\npsychological laws. Husserl objects that these two theses do not fit\ntogether since we can always imagine alternatives to psychological\nlaws (§41).\n\nThe last major step in Husserl’s overall argument is to show\nthat psychologism is based upon three — more or less easily\nrefutable — ‘prejudices’:\n\nFirst Prejudice: Prescriptions meant to regulate\npsychological events must be psychologically grounded.\n\n\nThis is wrong since logical prescriptions are fully grounded in logic\nas a theoretical, non-normative discipline (§41). \n\nSecond Prejudice: Logic is concerned with ideas, judgments,\ninferences and proofs, and all these are psychological phenomena.\nTherefore logic must be based on psychology.\n\n\nThat this is a prejudice, Husserl argues, can be seen from the fact\nthat a similar line of thought would lead one to the claim that\nmathematics is a branch of psychology. And he goes on to suggest that\nmathematical psychologism has already been refuted by the likes of\nLotze, Riehl, Frege and Natorp (§45).\n\nThird Prejudice: Judgments are recognized as true when one\nexperiences them as self-evident. But self-evidence is a psychological\nphenomenon, a feeling. Therefore logic must study the psychological\nconditions for the occurrences of that feeling, that is, it must find\nthe psychological laws that link the occurrence of that feeling to\nprior or coexisting mental events.\n\n\nTo this Husserl replies that purely logical sentences say nothing\nabout self-evidence and its conditions. Husserl makes three proposals\nconcerning self-evidence. First, self-evidence is the\nexperience, or a criterion, of truth. To experience\nthat an assertion corresponds to an experienced state of affairs is to\nhave self-evidence for that assertion. But self-evidence is no\nadditional ingredient of this experience. Second, truths are ideal\nspecies of the ideal genus truth, that is, truths are ideal\nparticulars. These ideal species are independent of whatever humans\nclaim to be self-evident. And third, when one person claims that\np is self-evident, whereas another person claims that\n~p is self-evident, then one of them is wrong. Put\ndifferently, truth is prior to self-evidence (§51).\n\n(For other detailed interpretations of Husserl’s arguments see\nTieszen 2008 and Hanna 2008.) \n",
    "section_title": "5. Husserl’s Antipsychologistic Arguments",
    "entry_title": "Psychologism",
    "hierarchy_title": "Psychologism || Husserl’s Antipsychologistic Arguments",
    "tokenized_text": [
        "husserl",
        "antipsychologistic",
        "argument",
        "husserl",
        "antipsychologistic",
        "argument",
        "husserl",
        "criticism",
        "psychologism",
        "prolegomenon",
        "logische",
        "untersuchungen",
        "key",
        "text",
        "germanspeaking",
        "debate",
        "psychologism",
        "first",
        "decadeandahalf",
        "twentieth",
        "century",
        "husserl",
        "prolegomenon",
        "fall",
        "roughly",
        "three",
        "part",
        "part",
        "one",
        "identifies",
        "sense",
        "logic",
        "practicalnormative",
        "discipline",
        "kunstlehre",
        "chapter",
        "part",
        "two",
        "argues",
        "great",
        "length",
        "theoretical",
        "foundation",
        "logical",
        "practicalnormative",
        "discipline",
        "psychological",
        "chapter",
        "part",
        "three",
        "provides",
        "overview",
        "true",
        "foundation",
        "logic",
        "practicalnormative",
        "discipline",
        "chapter",
        "reconstructed",
        "three",
        "part",
        "detail",
        "elsewhere",
        "kusch",
        "shall",
        "concentrate",
        "part",
        "two",
        "important",
        "recent",
        "discussion",
        "husserl",
        "argument",
        "include",
        "carr",
        "hanna",
        "hopkins",
        "moran",
        "pelletier",
        "et",
        "al",
        "part",
        "one",
        "need",
        "two",
        "idea",
        "first",
        "logic",
        "practicalnormative",
        "discipline",
        "visàvis",
        "science",
        "theory",
        "science",
        "wissenschaftslehre",
        "evaluates",
        "method",
        "scientific",
        "justification",
        "address",
        "question",
        "empirical",
        "condition",
        "valid",
        "method",
        "used",
        "successfully",
        "internal",
        "conceptual",
        "structure",
        "science",
        "demarcated",
        "one",
        "another",
        "scientist",
        "avoid",
        "making",
        "mistake",
        "second",
        "normative",
        "discipline",
        "nonnormative",
        "theoretical",
        "foundation",
        "belonging",
        "one",
        "nonnormative",
        "theoretical",
        "discipline",
        "husserl",
        "begin",
        "discussion",
        "psychologism",
        "part",
        "two",
        "criticism",
        "one",
        "might",
        "call",
        "normative",
        "antipsychologism",
        "view",
        "psychology",
        "logic",
        "divided",
        "isought",
        "distinction",
        "side",
        "proponent",
        "psychologism",
        "maintain",
        "thought",
        "ought",
        "occur",
        "special",
        "case",
        "thought",
        "fact",
        "occurs",
        "right",
        "husserl",
        "think",
        "accuse",
        "psychologism",
        "circularity",
        "critic",
        "psychologism",
        "argued",
        "one",
        "base",
        "normative",
        "logic",
        "psychology",
        "since",
        "psychology",
        "foundation",
        "logic",
        "miss",
        "important",
        "distinction",
        "psychology",
        "either",
        "take",
        "law",
        "logic",
        "premise",
        "axiom",
        "theory",
        "rely",
        "law",
        "logic",
        "merely",
        "rule",
        "method",
        "accordance",
        "psychology",
        "must",
        "proceed",
        "psychology",
        "former",
        "psychologism",
        "would",
        "involve",
        "vicious",
        "circle",
        "psychology",
        "presupposes",
        "law",
        "logic",
        "second",
        "weaker",
        "sense",
        "hence",
        "psychologism",
        "based",
        "upon",
        "fatal",
        "circularity",
        "dismissed",
        "two",
        "older",
        "form",
        "antipsychologism",
        "husserl",
        "move",
        "present",
        "argument",
        "one",
        "main",
        "train",
        "thought",
        "center",
        "three",
        "empiricist",
        "consequence",
        "psychologism",
        "reconstructed",
        "follows",
        "first",
        "consequence",
        "logical",
        "rule",
        "based",
        "upon",
        "psychological",
        "law",
        "logical",
        "rule",
        "would",
        "vague",
        "underlying",
        "psychological",
        "law",
        "refutation",
        "logical",
        "rule",
        "vague",
        "therefore",
        "logical",
        "rule",
        "based",
        "upon",
        "psychological",
        "law",
        "second",
        "consequence",
        "law",
        "logic",
        "psychological",
        "law",
        "could",
        "known",
        "priori",
        "would",
        "le",
        "probable",
        "rather",
        "valid",
        "justified",
        "reference",
        "experience",
        "refutation",
        "law",
        "logic",
        "priori",
        "justified",
        "apodictic",
        "selfevidence",
        "valid",
        "rather",
        "probable",
        "therefore",
        "law",
        "logic",
        "psychological",
        "third",
        "consequence",
        "logical",
        "law",
        "psychological",
        "law",
        "would",
        "refer",
        "psychological",
        "entity",
        "refutation",
        "logical",
        "law",
        "refer",
        "psychological",
        "entity",
        "therefore",
        "logical",
        "law",
        "psychological",
        "law",
        "husserl",
        "also",
        "claim",
        "psychologism",
        "fails",
        "justice",
        "idea",
        "truth",
        "eternal",
        "precisely",
        "truth",
        "eternal",
        "logical",
        "law",
        "law",
        "state",
        "affair",
        "mental",
        "physical",
        "husserl",
        "attempt",
        "prove",
        "claim",
        "showing",
        "opposite",
        "assumption",
        "lead",
        "paradox",
        "take",
        "logical",
        "law",
        "like",
        "every",
        "truth",
        "contradictory",
        "opposite",
        "t",
        "truth",
        "assume",
        "law",
        "state",
        "affair",
        "law",
        "coming",
        "passing",
        "away",
        "state",
        "affair",
        "b",
        "truth",
        "c",
        "law",
        "truth",
        "law",
        "truth",
        "law",
        "state",
        "affair",
        "two",
        "paradoxical",
        "conclusion",
        "follow",
        "e",
        "law",
        "truth",
        "law",
        "coming",
        "passing",
        "away",
        "truth",
        "f",
        "law",
        "truth",
        "law",
        "coming",
        "passing",
        "away",
        "law",
        "truth",
        "kusch",
        "husserl",
        "also",
        "seek",
        "show",
        "psychological",
        "interpretation",
        "basic",
        "logical",
        "principle",
        "law",
        "syllogistics",
        "unsatisfactory",
        "far",
        "basic",
        "principle",
        "concerned",
        "husserl",
        "target",
        "example",
        "spencer",
        "psychological",
        "rendering",
        "principle",
        "noncontradiction",
        "quote",
        "spencer",
        "saying",
        "the",
        "appearance",
        "positive",
        "mode",
        "consciousness",
        "appear",
        "without",
        "excluding",
        "correlative",
        "negative",
        "mode",
        "negative",
        "mode",
        "occur",
        "without",
        "excluding",
        "correlative",
        "positive",
        "mode",
        "husserl",
        "view",
        "spencer",
        "sentence",
        "tautology",
        "since",
        "positive",
        "negative",
        "mode",
        "already",
        "form",
        "pair",
        "contradictory",
        "opposite",
        "however",
        "husserl",
        "insists",
        "principle",
        "noncontradiction",
        "tautology",
        "concerning",
        "psychologistic",
        "view",
        "syllogistics",
        "husserl",
        "main",
        "target",
        "dutch",
        "psychologist",
        "philosopher",
        "gerardus",
        "heymans",
        "one",
        "hand",
        "husserl",
        "point",
        "law",
        "syllogistics",
        "law",
        "thought",
        "would",
        "never",
        "commit",
        "fallacy",
        "hand",
        "psychological",
        "interpretation",
        "syllogistics",
        "explain",
        "inference",
        "valid",
        "others",
        "invalid",
        "like",
        "frege",
        "husserl",
        "ultimately",
        "seek",
        "refute",
        "psychologism",
        "linking",
        "closely",
        "broader",
        "time",
        "disreputable",
        "philosophical",
        "position",
        "husserl",
        "focus",
        "le",
        "subjective",
        "idealism",
        "solipsism",
        "skepticism",
        "relativism",
        "husserl",
        "contends",
        "form",
        "psychologism",
        "form",
        "specie",
        "relativism",
        "precisely",
        "anthropologism",
        "go",
        "argue",
        "relativism",
        "absurd",
        "order",
        "get",
        "general",
        "conclusion",
        "husserl",
        "begin",
        "arguing",
        "protagorean",
        "relativism",
        "acknowledging",
        "true",
        "protagorean",
        "relativist",
        "never",
        "argued",
        "position",
        "husserl",
        "hold",
        "normally",
        "disposed",
        "people",
        "nevertheless",
        "see",
        "wrong",
        "protagorean",
        "viewpoint",
        "sentence",
        "true",
        "false",
        "protagorean",
        "thesis",
        "truth",
        "relative",
        "merely",
        "relatively",
        "true",
        "specie",
        "relativism",
        "thus",
        "anthropologism",
        "equally",
        "absurd",
        "little",
        "harder",
        "refute",
        "husserl",
        "marshal",
        "number",
        "argument",
        "specie",
        "relativism",
        "important",
        "since",
        "principle",
        "noncontradiction",
        "part",
        "meaning",
        "truth",
        "one",
        "thought",
        "true",
        "one",
        "specie",
        "false",
        "another",
        "b",
        "truth",
        "eternal",
        "thus",
        "temporally",
        "spatially",
        "determined",
        "c",
        "truth",
        "relative",
        "would",
        "existence",
        "world",
        "world",
        "correlate",
        "ideal",
        "system",
        "factual",
        "truth",
        "truth",
        "relative",
        "would",
        "ideal",
        "system",
        "thus",
        "one",
        "unique",
        "world",
        "convinced",
        "anthropologism",
        "selfrefuting",
        "husserl",
        "turn",
        "detail",
        "showing",
        "form",
        "psychologism",
        "form",
        "anthropologism",
        "view",
        "erdmann",
        "sigwart",
        "receive",
        "attention",
        "sigwart",
        "case",
        "husserl",
        "criticizes",
        "amongst",
        "thing",
        "view",
        "according",
        "would",
        "wrong",
        "assume",
        "judgment",
        "could",
        "true",
        "even",
        "intellect",
        "ever",
        "thinking",
        "judgment",
        "husserl",
        "object",
        "thought",
        "part",
        "meaning",
        "law",
        "gravity",
        "true",
        "time",
        "even",
        "prior",
        "discovery",
        "regardless",
        "whether",
        "happens",
        "thought",
        "anyone",
        "erdmann",
        "case",
        "husserl",
        "go",
        "even",
        "greater",
        "length",
        "order",
        "unearth",
        "regard",
        "fatal",
        "flaw",
        "inconsistency",
        "central",
        "issue",
        "husserl",
        "erdmann",
        "claim",
        "logical",
        "law",
        "merely",
        "hypothetically",
        "necessary",
        "logical",
        "law",
        "necessary",
        "member",
        "human",
        "specie",
        "present",
        "perhaps",
        "important",
        "argument",
        "erdmann",
        "position",
        "inherently",
        "unstable",
        "one",
        "hand",
        "erdmann",
        "argues",
        "hypothetical",
        "necessity",
        "speciesrelativity",
        "logical",
        "law",
        "insisting",
        "imagine",
        "alternative",
        "logical",
        "law",
        "hand",
        "erdmann",
        "hold",
        "therefore",
        "logical",
        "law",
        "psychological",
        "law",
        "husserl",
        "object",
        "two",
        "thesis",
        "fit",
        "together",
        "since",
        "always",
        "imagine",
        "alternative",
        "psychological",
        "law",
        "last",
        "major",
        "step",
        "husserl",
        "overall",
        "argument",
        "show",
        "psychologism",
        "based",
        "upon",
        "three",
        "le",
        "easily",
        "refutable",
        "prejudice",
        "first",
        "prejudice",
        "prescription",
        "meant",
        "regulate",
        "psychological",
        "event",
        "must",
        "psychologically",
        "grounded",
        "wrong",
        "since",
        "logical",
        "prescription",
        "fully",
        "grounded",
        "logic",
        "theoretical",
        "nonnormative",
        "discipline",
        "second",
        "prejudice",
        "logic",
        "concerned",
        "idea",
        "judgment",
        "inference",
        "proof",
        "psychological",
        "phenomenon",
        "therefore",
        "logic",
        "must",
        "based",
        "psychology",
        "prejudice",
        "husserl",
        "argues",
        "seen",
        "fact",
        "similar",
        "line",
        "thought",
        "would",
        "lead",
        "one",
        "claim",
        "mathematics",
        "branch",
        "psychology",
        "go",
        "suggest",
        "mathematical",
        "psychologism",
        "already",
        "refuted",
        "like",
        "lotze",
        "riehl",
        "frege",
        "natorp",
        "third",
        "prejudice",
        "judgment",
        "recognized",
        "true",
        "one",
        "experience",
        "selfevident",
        "selfevidence",
        "psychological",
        "phenomenon",
        "feeling",
        "therefore",
        "logic",
        "must",
        "study",
        "psychological",
        "condition",
        "occurrence",
        "feeling",
        "must",
        "find",
        "psychological",
        "law",
        "link",
        "occurrence",
        "feeling",
        "prior",
        "coexisting",
        "mental",
        "event",
        "husserl",
        "reply",
        "purely",
        "logical",
        "sentence",
        "say",
        "nothing",
        "selfevidence",
        "condition",
        "husserl",
        "make",
        "three",
        "proposal",
        "concerning",
        "selfevidence",
        "first",
        "selfevidence",
        "experience",
        "criterion",
        "truth",
        "experience",
        "assertion",
        "corresponds",
        "experienced",
        "state",
        "affair",
        "selfevidence",
        "assertion",
        "selfevidence",
        "additional",
        "ingredient",
        "experience",
        "second",
        "truth",
        "ideal",
        "specie",
        "ideal",
        "genus",
        "truth",
        "truth",
        "ideal",
        "particular",
        "ideal",
        "specie",
        "independent",
        "whatever",
        "human",
        "claim",
        "selfevident",
        "third",
        "one",
        "person",
        "claim",
        "p",
        "selfevident",
        "whereas",
        "another",
        "person",
        "claim",
        "p",
        "selfevident",
        "one",
        "wrong",
        "put",
        "differently",
        "truth",
        "prior",
        "selfevidence",
        "detailed",
        "interpretation",
        "husserl",
        "argument",
        "see",
        "tieszen",
        "hanna"
    ]
}