{
    "main_text": "Justice and Public Health || Public Health, Prevention, and Justice\n2.3 Public Health, Prevention, and Justice\n\nA distinct set of questions of justice arises because promoting public\nhealth involves a significant commitment to the prevention of disease\nand injury. This commitment to prevention is often seen as a defining\nfeature of public health institutions, even though public health\nagencies and services also engage in diagnosing and treating\nillnesses, with all the attendant clinical services that those\nactivities\n require.[8]\n Indeed, national health systems are increasingly understood to\ninclude both preventive functions and the delivery of personal medical\nservices. Often these functions and services are integrated under a\ncommon political or administrative structure. Depending on the\nspecific context in which population health is to be promoted,\nseparating population health services and functions from personal\nmedical care services and functions may or may not make sense. That\nsaid, policies and programs whose aim is to prevent illness and injury\nare paradigmatically the territory of public health. Certainly, no\nother social institution is recognized as so clearly having this\nremit.\n\nPerhaps the foundational moral question at issue in public\nhealth’s commitment to prevention is whether preventing disease\nand injury is more important, as important or less important than\ntreating disease and injury. If prevention and treatment are morally\nequivalent, such that preventing heart disease in one person is the\nmoral equivalent of treating heart disease in one person, then because\nit is generally cheaper to prevent disease than to treat it,\nprevention would, at least from an ethics standpoint, have a leg up in\nutilitarian accounts of what justice in public health requires.\nHowever, in practice, investments in treatment more often than not\nswamp investments in prevention. We have already noted the ethically\ncomplicated convention in economic analyses of discounting health\nbenefits and costs accrued in the future relative to current health\nbenefits and costs, paralleling the convention of discounting future\nfinancial costs and benefits. But it is not only in economic analyses\nthat this bias exists. Although in recent years there is arguably more\nemphasis on prevention in health policy, preventive public health\ninterventions continue to receive less funding and public support than\nmedical treatments. For example, despite the increasing focus on\nwellness in public policy and the workplace, both policymakers and the\npublic still tend to place a higher priority on ensuring that heart\npatients have access to surgery and medications than on programs to\nprevent heart disease through diet and\n exercise.[9]\n Is this privileging of treatment morally justified?\n\nAnswers to this question typically appeal to several related and\nsometimes conceptually unclear distinctions that are thought to be\nmorally relevant. These include the aforementioned distinction between\nfuture and current costs and benefits, the distinction between\nidentified and unidentified or statistical lives, and the distinction\nbetween currently existing and future persons. The impact of\npreventive interventions is more likely to be experienced in the\nfuture, while the impact of treatment interventions is typically\nexperienced in the near term. Whether people should disvalue future\nbenefits to themselves, relative to current benefits, is not clear.\nBecause current beneficiaries are often identifiable and future\nbeneficiaries typically are not, the differential valuing by\ntemporality is often associated with the distinction between\nidentified and statistical persons. The identified victim effect is\nthe term given to the widely observed psychological phenomenon in\nwhich people have a greater inclination to assist (and avoid harming)\npersons and groups who are known by name or are otherwise identifiable\nthan to assist (and avoid harming) persons and groups who will suffer\n(or already suffer) similar harm but are not (as yet) identifiable to\nthem in any socially meaningful way. These unidentified persons are\nthus “merely” statistics or statistical lives (pp.1–2;\nEyal et al. 2015; Jenni and Lowenstein 1997; Jonsen 1986; McKie and\nRichardson 2003; Small 2015).\n\nThe identified victim effect has clear implications for prevention vs.\ntreatment. Although resources for both treatment and prevention are\nboth generally allocated at the aggregate, population level, treatment\ninterventions are typically delivered to identifiable patients whose\nexperience of benefit will be witnessed by others, including the\nhealth professionals who care for them. By contrast, while prevention\ninterventions may be delivered to identifiable people, as in\nimmunization campaigns, they need not be. Consider, for example,\ninterventions like cigarette taxes that reduce tobacco consumption\namong large numbers of faceless and nameless people. Moreover, even\nwhen the people receiving the prevention intervention are\nidentifiable, as in vaccine campaigns, the identities of the sub-set\nof people who will benefit from the intervention remain unknowable;\nthey are statistical persons.\n\nDiverse moral defenses have been put forward for prioritizing the\nwell-being of identified persons over statistical persons (Hare 2015;\nSlote 2015; Verweij\n 2015),[10]\n and for the closely connected “rule of rescue,” a claim\nthat there is a moral imperative to prioritize helping those currently\nin dire\n need.[11]\n These defenses include the moral relevance of saving people from\nimminent death or disability, relieving suffering, and the role\nresponsibilities of clinicians. A distinctive consequentialist\nargument is also made that the welfare of all is enhanced when\neveryone knows that societal resources will be expended to rescue them\nif they are ever so imperiled (McKie and Richardson 2003).\n\nThose who find the identified victim effect ethically as well as\npsychologically compelling and who support the rule of rescue\ngenerally defend the view that public health policy decisions about\nallocation and priority setting should build in a bias in favor of\ntreatment. Others, on the other hand, maintain that we should reject\nthe rule of rescue and should not prioritize or assign greater value\nto identified than to statistical persons (Brock and Wikler, 2006,\n2009; Hope 2001, 2004; Otsuka 2015). For instance, some argue that the\nconsiderations that appear to count in favor of prioritizing\nidentified persons reduce to other moral considerations that apply\nequally to statistical persons – so prioritizing identified\npersons is, all else equal, unjustified (Brock 2015; Eyal 2015; Jecker\n2013). If this is correct, then the identified victim effect should be\noverlooked when allocating resources or setting priorities. If\nanything, we should worry that to prioritize the health of identified,\ncurrent persons over statistical, future persons fails to treat the\nlatter as moral equals (Jecker 2013,\n 2015).[12]\n\n\nSo far, we have restricted our discussion to already existing persons.\nWhether the benefits accrue in the present or the future, and to\nidentified or statistical persons, the beneficiaries all currently\nexist. A further complication arises when we consider preventive\nmeasures that primarily benefit future persons (Parfit 1987; see also\nthe entry on the\n non-identity problem).\n For instance, the eradication of polio or smallpox provides little\nbenefit to those who have already acquired immunity (either due to\nvaccination or contracting the disease). The primary beneficiaries of\nthese disease eradication programs are both vulnerable existing\npersons and future persons who will be born into a world without these\ndiseases. Indeed, arguments in favor of eradication efforts often\nappeal to the interests of future persons and intergenerational\njustice (Emerson 2010; 2014). Here, familiar questions re-emerge.\nShould we prioritize currently existing (identified or statistical)\npersons over future persons? If so, there are difficult additional\nquestions about how much more weight existing persons should\nreceive.\n\nA somewhat different set of issues emerge when public health efforts\nthat aim to benefit the future require the participation of those who\nare currently suffering from unjust unmet health needs. When, for\nexample, individuals and groups in lower and middle-income countries\nargue that there are more urgent health priorities than eliminating\nvarious diseases, is this just a variant of the failure to properly\nprioritize resources to reduce unjust health inequalities, or is there\nsomething distinctive about the resource allocation going to benefit\nfuture persons or about the involvement of the currently disadvantaged\nin the intervention designed to benefit future persons? (Rubincam and\nNaysmith 2009)\n\nSome but not all of the issues we have thus far reviewed are addressed\nin an influential analysis of questions of justice, prevention and\npublic health by Geoffrey Rose (1985; Rose et al. 2008). Rose’s\nanalysis focuses on the complex relationship between two by now\nfamiliar distinctions (prevention vs. cure or treatment and\nidentifiable vs. statistical beneficiaries), the amount of benefit an\nintervention confers, and on whom, and the cost of the intervention.\nRoss also examines two different approaches to prevention – the\n“high-risk strategy” and the “population\napproach.” The high-risk strategy involves identifying\nparticular individuals at heightened risk for some condition, such as\nheart attacks or strokes, and then intervening with various preventive\ntherapies such as statins to lower cholesterol. The population\napproach involves implementing prevention interventions that affect an\nentire population, and not just individuals identified as high risk.\nConsider soda taxes or regulations restricting the use of trans fats\nin processed foods. Rose articulates what he calls the\n‘prevention paradox’: when compared to high-risk strategy\ninterventions, population-wide interventions often afford relatively\nsmall benefits to each individual. However, although these\ninterventions only slightly decrease each individual’s risk,\naggregating this small benefit for each member of a very large\npopulation adds up to a very large benefit to population health that\nis sometimes larger and more efficiently secured than with an\nalternative, high-risk strategy (Rose 1985, 1993; Rose et al. 2008).\nThe extent to which we should prioritize the population approach will\ndepend on how one answers the questions discussed in this section\n– about statistical versus identified lives, the rule of rescue,\nand the standing of future persons.\n",
    "section_title": "2.3 Public Health, Prevention, and Justice",
    "entry_title": "Public Health Ethics",
    "hierarchy_title": "Public Health Ethics || Justice and Public Health || Public Health, Prevention, and Justice",
    "tokenized_text": [
        "justice",
        "public",
        "health",
        "public",
        "health",
        "prevention",
        "justice",
        "public",
        "health",
        "prevention",
        "justice",
        "distinct",
        "set",
        "question",
        "justice",
        "arises",
        "promoting",
        "public",
        "health",
        "involves",
        "significant",
        "commitment",
        "prevention",
        "disease",
        "injury",
        "commitment",
        "prevention",
        "often",
        "seen",
        "defining",
        "feature",
        "public",
        "health",
        "institution",
        "even",
        "though",
        "public",
        "health",
        "agency",
        "service",
        "also",
        "engage",
        "diagnosing",
        "treating",
        "illness",
        "attendant",
        "clinical",
        "service",
        "activity",
        "require",
        "indeed",
        "national",
        "health",
        "system",
        "increasingly",
        "understood",
        "include",
        "preventive",
        "function",
        "delivery",
        "personal",
        "medical",
        "service",
        "often",
        "function",
        "service",
        "integrated",
        "common",
        "political",
        "administrative",
        "structure",
        "depending",
        "specific",
        "context",
        "population",
        "health",
        "promoted",
        "separating",
        "population",
        "health",
        "service",
        "function",
        "personal",
        "medical",
        "care",
        "service",
        "function",
        "may",
        "may",
        "make",
        "sense",
        "said",
        "policy",
        "program",
        "whose",
        "aim",
        "prevent",
        "illness",
        "injury",
        "paradigmatically",
        "territory",
        "public",
        "health",
        "certainly",
        "social",
        "institution",
        "recognized",
        "clearly",
        "remit",
        "perhaps",
        "foundational",
        "moral",
        "question",
        "issue",
        "public",
        "health",
        "commitment",
        "prevention",
        "whether",
        "preventing",
        "disease",
        "injury",
        "important",
        "important",
        "le",
        "important",
        "treating",
        "disease",
        "injury",
        "prevention",
        "treatment",
        "morally",
        "equivalent",
        "preventing",
        "heart",
        "disease",
        "one",
        "person",
        "moral",
        "equivalent",
        "treating",
        "heart",
        "disease",
        "one",
        "person",
        "generally",
        "cheaper",
        "prevent",
        "disease",
        "treat",
        "prevention",
        "would",
        "least",
        "ethic",
        "standpoint",
        "leg",
        "utilitarian",
        "account",
        "justice",
        "public",
        "health",
        "requires",
        "however",
        "practice",
        "investment",
        "treatment",
        "often",
        "swamp",
        "investment",
        "prevention",
        "already",
        "noted",
        "ethically",
        "complicated",
        "convention",
        "economic",
        "analysis",
        "discounting",
        "health",
        "benefit",
        "cost",
        "accrued",
        "future",
        "relative",
        "current",
        "health",
        "benefit",
        "cost",
        "paralleling",
        "convention",
        "discounting",
        "future",
        "financial",
        "cost",
        "benefit",
        "economic",
        "analysis",
        "bias",
        "exists",
        "although",
        "recent",
        "year",
        "arguably",
        "emphasis",
        "prevention",
        "health",
        "policy",
        "preventive",
        "public",
        "health",
        "intervention",
        "continue",
        "receive",
        "le",
        "funding",
        "public",
        "support",
        "medical",
        "treatment",
        "example",
        "despite",
        "increasing",
        "focus",
        "wellness",
        "public",
        "policy",
        "workplace",
        "policymakers",
        "public",
        "still",
        "tend",
        "place",
        "higher",
        "priority",
        "ensuring",
        "heart",
        "patient",
        "access",
        "surgery",
        "medication",
        "program",
        "prevent",
        "heart",
        "disease",
        "diet",
        "exercise",
        "privileging",
        "treatment",
        "morally",
        "justified",
        "answer",
        "question",
        "typically",
        "appeal",
        "several",
        "related",
        "sometimes",
        "conceptually",
        "unclear",
        "distinction",
        "thought",
        "morally",
        "relevant",
        "include",
        "aforementioned",
        "distinction",
        "future",
        "current",
        "cost",
        "benefit",
        "distinction",
        "identified",
        "unidentified",
        "statistical",
        "life",
        "distinction",
        "currently",
        "existing",
        "future",
        "person",
        "impact",
        "preventive",
        "intervention",
        "likely",
        "experienced",
        "future",
        "impact",
        "treatment",
        "intervention",
        "typically",
        "experienced",
        "near",
        "term",
        "whether",
        "people",
        "disvalue",
        "future",
        "benefit",
        "relative",
        "current",
        "benefit",
        "clear",
        "current",
        "beneficiary",
        "often",
        "identifiable",
        "future",
        "beneficiary",
        "typically",
        "differential",
        "valuing",
        "temporality",
        "often",
        "associated",
        "distinction",
        "identified",
        "statistical",
        "person",
        "identified",
        "victim",
        "effect",
        "term",
        "given",
        "widely",
        "observed",
        "psychological",
        "phenomenon",
        "people",
        "greater",
        "inclination",
        "assist",
        "avoid",
        "harming",
        "person",
        "group",
        "known",
        "name",
        "otherwise",
        "identifiable",
        "assist",
        "avoid",
        "harming",
        "person",
        "group",
        "suffer",
        "already",
        "suffer",
        "similar",
        "harm",
        "yet",
        "identifiable",
        "socially",
        "meaningful",
        "way",
        "unidentified",
        "person",
        "thus",
        "merely",
        "statistic",
        "statistical",
        "life",
        "pp",
        "eyal",
        "et",
        "al",
        "jenni",
        "lowenstein",
        "jonsen",
        "mckie",
        "richardson",
        "small",
        "identified",
        "victim",
        "effect",
        "clear",
        "implication",
        "prevention",
        "vs",
        "treatment",
        "although",
        "resource",
        "treatment",
        "prevention",
        "generally",
        "allocated",
        "aggregate",
        "population",
        "level",
        "treatment",
        "intervention",
        "typically",
        "delivered",
        "identifiable",
        "patient",
        "whose",
        "experience",
        "benefit",
        "witnessed",
        "others",
        "including",
        "health",
        "professional",
        "care",
        "contrast",
        "prevention",
        "intervention",
        "may",
        "delivered",
        "identifiable",
        "people",
        "immunization",
        "campaign",
        "need",
        "consider",
        "example",
        "intervention",
        "like",
        "cigarette",
        "tax",
        "reduce",
        "tobacco",
        "consumption",
        "among",
        "large",
        "number",
        "faceless",
        "nameless",
        "people",
        "moreover",
        "even",
        "people",
        "receiving",
        "prevention",
        "intervention",
        "identifiable",
        "vaccine",
        "campaign",
        "identity",
        "subset",
        "people",
        "benefit",
        "intervention",
        "remain",
        "unknowable",
        "statistical",
        "person",
        "diverse",
        "moral",
        "defense",
        "put",
        "forward",
        "prioritizing",
        "wellbeing",
        "identified",
        "person",
        "statistical",
        "person",
        "hare",
        "slote",
        "verweij",
        "closely",
        "connected",
        "rule",
        "rescue",
        "claim",
        "moral",
        "imperative",
        "prioritize",
        "helping",
        "currently",
        "dire",
        "need",
        "defense",
        "include",
        "moral",
        "relevance",
        "saving",
        "people",
        "imminent",
        "death",
        "disability",
        "relieving",
        "suffering",
        "role",
        "responsibility",
        "clinician",
        "distinctive",
        "consequentialist",
        "argument",
        "also",
        "made",
        "welfare",
        "enhanced",
        "everyone",
        "know",
        "societal",
        "resource",
        "expended",
        "rescue",
        "ever",
        "imperiled",
        "mckie",
        "richardson",
        "find",
        "identified",
        "victim",
        "effect",
        "ethically",
        "well",
        "psychologically",
        "compelling",
        "support",
        "rule",
        "rescue",
        "generally",
        "defend",
        "view",
        "public",
        "health",
        "policy",
        "decision",
        "allocation",
        "priority",
        "setting",
        "build",
        "bias",
        "favor",
        "treatment",
        "others",
        "hand",
        "maintain",
        "reject",
        "rule",
        "rescue",
        "prioritize",
        "assign",
        "greater",
        "value",
        "identified",
        "statistical",
        "person",
        "brock",
        "wikler",
        "hope",
        "otsuka",
        "instance",
        "argue",
        "consideration",
        "appear",
        "count",
        "favor",
        "prioritizing",
        "identified",
        "person",
        "reduce",
        "moral",
        "consideration",
        "apply",
        "equally",
        "statistical",
        "person",
        "prioritizing",
        "identified",
        "person",
        "else",
        "equal",
        "unjustified",
        "brock",
        "eyal",
        "jecker",
        "correct",
        "identified",
        "victim",
        "effect",
        "overlooked",
        "allocating",
        "resource",
        "setting",
        "priority",
        "anything",
        "worry",
        "prioritize",
        "health",
        "identified",
        "current",
        "person",
        "statistical",
        "future",
        "person",
        "fails",
        "treat",
        "latter",
        "moral",
        "equal",
        "jecker",
        "far",
        "restricted",
        "discussion",
        "already",
        "existing",
        "person",
        "whether",
        "benefit",
        "accrue",
        "present",
        "future",
        "identified",
        "statistical",
        "person",
        "beneficiary",
        "currently",
        "exist",
        "complication",
        "arises",
        "consider",
        "preventive",
        "measure",
        "primarily",
        "benefit",
        "future",
        "person",
        "parfit",
        "see",
        "also",
        "entry",
        "nonidentity",
        "problem",
        "instance",
        "eradication",
        "polio",
        "smallpox",
        "provides",
        "little",
        "benefit",
        "already",
        "acquired",
        "immunity",
        "either",
        "due",
        "vaccination",
        "contracting",
        "disease",
        "primary",
        "beneficiary",
        "disease",
        "eradication",
        "program",
        "vulnerable",
        "existing",
        "person",
        "future",
        "person",
        "born",
        "world",
        "without",
        "disease",
        "indeed",
        "argument",
        "favor",
        "eradication",
        "effort",
        "often",
        "appeal",
        "interest",
        "future",
        "person",
        "intergenerational",
        "justice",
        "emerson",
        "familiar",
        "question",
        "reemerge",
        "prioritize",
        "currently",
        "existing",
        "identified",
        "statistical",
        "person",
        "future",
        "person",
        "difficult",
        "additional",
        "question",
        "much",
        "weight",
        "existing",
        "person",
        "receive",
        "somewhat",
        "different",
        "set",
        "issue",
        "emerge",
        "public",
        "health",
        "effort",
        "aim",
        "benefit",
        "future",
        "require",
        "participation",
        "currently",
        "suffering",
        "unjust",
        "unmet",
        "health",
        "need",
        "example",
        "individual",
        "group",
        "lower",
        "middleincome",
        "country",
        "argue",
        "urgent",
        "health",
        "priority",
        "eliminating",
        "various",
        "disease",
        "variant",
        "failure",
        "properly",
        "prioritize",
        "resource",
        "reduce",
        "unjust",
        "health",
        "inequality",
        "something",
        "distinctive",
        "resource",
        "allocation",
        "going",
        "benefit",
        "future",
        "person",
        "involvement",
        "currently",
        "disadvantaged",
        "intervention",
        "designed",
        "benefit",
        "future",
        "person",
        "rubincam",
        "naysmith",
        "issue",
        "thus",
        "far",
        "reviewed",
        "addressed",
        "influential",
        "analysis",
        "question",
        "justice",
        "prevention",
        "public",
        "health",
        "geoffrey",
        "rose",
        "rose",
        "et",
        "al",
        "rose",
        "analysis",
        "focus",
        "complex",
        "relationship",
        "two",
        "familiar",
        "distinction",
        "prevention",
        "vs",
        "cure",
        "treatment",
        "identifiable",
        "vs",
        "statistical",
        "beneficiary",
        "amount",
        "benefit",
        "intervention",
        "confers",
        "cost",
        "intervention",
        "ross",
        "also",
        "examines",
        "two",
        "different",
        "approach",
        "prevention",
        "highrisk",
        "strategy",
        "population",
        "approach",
        "highrisk",
        "strategy",
        "involves",
        "identifying",
        "particular",
        "individual",
        "heightened",
        "risk",
        "condition",
        "heart",
        "attack",
        "stroke",
        "intervening",
        "various",
        "preventive",
        "therapy",
        "statin",
        "lower",
        "cholesterol",
        "population",
        "approach",
        "involves",
        "implementing",
        "prevention",
        "intervention",
        "affect",
        "entire",
        "population",
        "individual",
        "identified",
        "high",
        "risk",
        "consider",
        "soda",
        "tax",
        "regulation",
        "restricting",
        "use",
        "trans",
        "fat",
        "processed",
        "food",
        "rose",
        "articulates",
        "call",
        "prevention",
        "paradox",
        "compared",
        "highrisk",
        "strategy",
        "intervention",
        "populationwide",
        "intervention",
        "often",
        "afford",
        "relatively",
        "small",
        "benefit",
        "individual",
        "however",
        "although",
        "intervention",
        "slightly",
        "decrease",
        "individual",
        "risk",
        "aggregating",
        "small",
        "benefit",
        "member",
        "large",
        "population",
        "add",
        "large",
        "benefit",
        "population",
        "health",
        "sometimes",
        "larger",
        "efficiently",
        "secured",
        "alternative",
        "highrisk",
        "strategy",
        "rose",
        "rose",
        "et",
        "al",
        "extent",
        "prioritize",
        "population",
        "approach",
        "depend",
        "one",
        "answer",
        "question",
        "discussed",
        "section",
        "statistical",
        "versus",
        "identified",
        "life",
        "rule",
        "rescue",
        "standing",
        "future",
        "person"
    ]
}