{
    "main_text": "Justice and Public Health || The Value of Health: Why Health Matters Morally\n2.1 The Value of Health: Why Health Matters Morally\n\nTheories of justice relevant to public health ethics operate with\naccounts of the value of health that often mark key differences\nbetween\n them.[4]\n In the case of utilitarian theorists, the value of health is often\nunderstood implicitly in terms of the contribution that health makes\nto utility or welfare. All health benefits are seen as contributing to\nwelfare and all harms to health as diminishing welfare. How health\nbenefits and harms should be conceptualized and therefore measured is\na matter of debate, as is the case with the parent categories of\nutility and welfare, more generally. We will briefly review some of\nthe health-specific debates in Section 2.2.\n\nEgalitarian theories of justice, including those most relevant to\npublic health ethics, continue to be profoundly influenced by Rawls.\n(See Rawls 1971, and the entry on\n John Rawls.)\n Health does not figure prominently in Rawls’ celebrated theory\nand is not included by him as a social primary good. (Rawls 1971, 62)\nOther theorists have, however, pursued what they understand to be the\nimplications of Rawls’s theory for health policy and public\nhealth. The most sustained and notable development of Rawlsian thought\ncomes from Norman Daniels. Daniels argues that the value of health as\nit matters to justice can be found in its critical connection to\nRawls’ principle of “fair equality of opportunity,”\nwhich for Rawls centers on social offices and positions. Daniels\nmaintains that health is of special importance to this principle. On\nthis view, enjoying health up to some threshold is integral for each\nto have a ‘normal opportunity range,’ or the array of life\nplans reasonable persons are likely to develop for themselves within a\nparticular society (Daniels 2008, p. 43). Thus, Daniels attempts to\naccount for the moral significance of health, including public health,\nin terms of its connection to opportunities rather than to welfare\n(Daniels 1985; 2001; 2008). In other words, on this sort of view,\nhealth is a matter of justice because of its integral role in allowing\nus or, in the case of ill health, preventing us from pursuing what we,\nas a matter of justice, should be able to pursue.\n\nIn part in response to Rawls, Amartya Sen pioneered an alternative\napproach to justice, which has as its central focus the ability and\npower of individuals – their capabilities – to reach\nstates of valuable functioning or well-being. Capability theory is\nconcerned with the freedom of individuals to pursue these states; the\njustice of social systems is to be judged by the extent to which this\nfreedom to be and do is promoted for all, a distinctly egalitarian\ncommitment. (See the entry on\n the capability approach.)\n The most prominent capability approach to justice, and one with\ndirect relevance to public health, is that of Martha Nussbaum.\nNussbaum identifies ten central human capabilities that a just society\nshould make available to its citizens. Bodily health is included\nwithin the ten, as is life, which she defines as “being able to\nlive to the end of a human life of normal length; not dying\nprematurely, or before one’s life is so reduced as to be not\nworth living” (Nussbaum 2006, 76). Health is understood as\nnecessary or partly constitutive of human dignity or a flourishing\nhuman life. For Nussbaum and other capability theorists, the\ncapability for health is thus of direct importance to justice, and not\nas it is for Daniels, for whom health is of strategic importance to\nfair opportunity.\n\nPowers and Faden have developed a different theory of structural\njustice that, like Nussbaum’s capability theory, also sees\nhealth as a direct matter of justice. However, while Nussbaum focuses\non health capabilities, Powers and Faden focus on health itself. Their\ntheory is anchored in an account of human well-being in which health\nis one of six core elements. Each element is defended because it is\ncharacteristically present in a decent human life and because it\nrequires an appropriate social structure for its secure realization\nand cannot be experienced by individuals relying solely on their own\nefforts. Powers’ and Faden’s egalitarian commitments are\nevidenced in their view that structural justice entails ensuring that\nall individuals, globally, experience these six well-being elements\nand the human rights that are grounded in them, commensurate with a\ndecent human life. They are also reflected in the theory’s focal\nconcern with unfair relations of power and advantage as well as with\nhuman rights and with the intimate relationship between unfairness,\nwell-being and human rights. (Powers and Faden 2019) Much of their\ntheory is taken up with interconnections between these moving parts of\nstructural injustice. Their view that a deprivation in one core\nelement of well-being like health is likely both a cause and a\nconsequence of deprivations in other elements of well-being has direct\nimplications for public health policy. So, too, does their view that\nunfair patterns of disadvantage and unfair power relations are a\npowerful driver of deprivations and human rights violations, which in\nturn usher in and exacerbate these forms of structural unfairness.\n\nEach of these different ways of explicating why health is a matter of\njustice – because health contributes to overall utility or\nwelfare, because of its strategic importance to fair opportunity,\nbecause it is a central human capability, or because health is a core\nelement of human well-being – provide reasons why national and\nglobal policy-setting structures should place a priority on\nhealth. Each provides justifications, some overlapping and some\ndistinctive, for extensive collective investment in public health\nservices and practices. They also have different implications for\npublic health policy. For example, arguments from fair opportunity\nunderscore the importance of, and arguably prioritize, interventions\nthat will protect or restore aspects of health that relate to normal\nopportunity ranges and societal prospects. Theories that focus on\ncapabilities for health and those that focus on securing health may\nhave different implications for how public health institutions should\nset targets and priorities, and certainly for how health policies\nshould be evaluated.  And theories that advocate for the\ninterconnectedness of health with other valued human states suggest a\nwider range of relevant outcomes for public health and public health\nethics than theories that focus only on health. And each is open, in\none way or another, to the familiar criticisms of utilitarian,\nRawlsian, capability and well-being theories.\n\nYet another approach to articulating the value of health, and thus of\npublic health, is found in the health and human rights literature\n(see Mann et al. 1994; Mann 1996; Beyrer et al. 2007; Beyrer and Pizer\n2007; Tasioulas and Vayena 2015a; Tasioulas and Vayena 2015b; Gostin and\nFriedman 2013). In the early 1990s, Jonathan Mann pioneered an\napproach to public health that explicitly framed health as a human\nrights issue, and human rights violations as public health issues.\nSubsequent work in the health and human rights tradition has been\ndominated by scholars and advocates in health law and public health\npractice, with strong links to activist and humanitarian\norganizations. (Gostin 2008, 2010) As a general matter, the health and\nhuman rights tradition relies on international declarations of human\nrights and human rights law as its foundation and does not probe the\nphilosophical underpinnings of human rights or their connection to\ntheories of justice. This is not because philosophical accounts of\nhuman rights are not congenial to the inclusion of health as a basic\nhuman right, however. Quite the opposite. Multiple rival candidates\nfor the justification of human rights, from interest-based theories\n(Powers and Faden 2019; Raz 1988; Griffin 2008; Beitz 2015) to\ncontrol-based theories (Darwall 2006; Hart 1982) to dignity-based\ntheories (Kamm 2007; Tasioulas 2015), can be interpreted to support\nthe inclusion of health as a human right. (See the entry on\n human rights.)\n Regardless of one’s explanation of the grounds of human rights,\nby claiming that individuals have a human right to health, health is\nmade a matter of justice, since each individual has an entitlement to\nhealth. Moreover, framing health as a human right is appealing in the\ncontext of discussions of public health ethics because this framing\nprovides a basis for making states, as the first guarantors of human\nrights, responsible for promoting and protecting the health of\nindividuals residing within their jurisdictions. However, just as\napproaching the value of health from the standpoint of different\ntheories of justice is open to the general criticisms associated with\neach theory, so accounting for health in terms of human rights is open\nto the broad challenges that apply to accounts of human rights more\ngenerally (Buchanan 2012; Sreenivasan 2012)\n",
    "section_title": "2.1 The Value of Health: Why Health Matters Morally",
    "entry_title": "Public Health Ethics",
    "hierarchy_title": "Public Health Ethics || Justice and Public Health || The Value of Health: Why Health Matters Morally",
    "tokenized_text": [
        "justice",
        "public",
        "health",
        "value",
        "health",
        "health",
        "matter",
        "morally",
        "value",
        "health",
        "health",
        "matter",
        "morally",
        "theory",
        "justice",
        "relevant",
        "public",
        "health",
        "ethic",
        "operate",
        "account",
        "value",
        "health",
        "often",
        "mark",
        "key",
        "difference",
        "case",
        "utilitarian",
        "theorist",
        "value",
        "health",
        "often",
        "understood",
        "implicitly",
        "term",
        "contribution",
        "health",
        "make",
        "utility",
        "welfare",
        "health",
        "benefit",
        "seen",
        "contributing",
        "welfare",
        "harm",
        "health",
        "diminishing",
        "welfare",
        "health",
        "benefit",
        "harm",
        "conceptualized",
        "therefore",
        "measured",
        "matter",
        "debate",
        "case",
        "parent",
        "category",
        "utility",
        "welfare",
        "generally",
        "briefly",
        "review",
        "healthspecific",
        "debate",
        "section",
        "egalitarian",
        "theory",
        "justice",
        "including",
        "relevant",
        "public",
        "health",
        "ethic",
        "continue",
        "profoundly",
        "influenced",
        "rawls",
        "see",
        "rawls",
        "entry",
        "john",
        "rawls",
        "health",
        "figure",
        "prominently",
        "rawls",
        "celebrated",
        "theory",
        "included",
        "social",
        "primary",
        "good",
        "rawls",
        "theorist",
        "however",
        "pursued",
        "understand",
        "implication",
        "rawls",
        "theory",
        "health",
        "policy",
        "public",
        "health",
        "sustained",
        "notable",
        "development",
        "rawlsian",
        "thought",
        "come",
        "norman",
        "daniel",
        "daniel",
        "argues",
        "value",
        "health",
        "matter",
        "justice",
        "found",
        "critical",
        "connection",
        "rawls",
        "principle",
        "fair",
        "equality",
        "opportunity",
        "rawls",
        "center",
        "social",
        "office",
        "position",
        "daniel",
        "maintains",
        "health",
        "special",
        "importance",
        "principle",
        "view",
        "enjoying",
        "health",
        "threshold",
        "integral",
        "normal",
        "opportunity",
        "range",
        "array",
        "life",
        "plan",
        "reasonable",
        "person",
        "likely",
        "develop",
        "within",
        "particular",
        "society",
        "daniel",
        "p",
        "thus",
        "daniel",
        "attempt",
        "account",
        "moral",
        "significance",
        "health",
        "including",
        "public",
        "health",
        "term",
        "connection",
        "opportunity",
        "rather",
        "welfare",
        "daniel",
        "word",
        "sort",
        "view",
        "health",
        "matter",
        "justice",
        "integral",
        "role",
        "allowing",
        "u",
        "case",
        "ill",
        "health",
        "preventing",
        "u",
        "pursuing",
        "matter",
        "justice",
        "able",
        "pursue",
        "part",
        "response",
        "rawls",
        "amartya",
        "sen",
        "pioneered",
        "alternative",
        "approach",
        "justice",
        "central",
        "focus",
        "ability",
        "power",
        "individual",
        "capability",
        "reach",
        "state",
        "valuable",
        "functioning",
        "wellbeing",
        "capability",
        "theory",
        "concerned",
        "freedom",
        "individual",
        "pursue",
        "state",
        "justice",
        "social",
        "system",
        "judged",
        "extent",
        "freedom",
        "promoted",
        "distinctly",
        "egalitarian",
        "commitment",
        "see",
        "entry",
        "capability",
        "approach",
        "prominent",
        "capability",
        "approach",
        "justice",
        "one",
        "direct",
        "relevance",
        "public",
        "health",
        "martha",
        "nussbaum",
        "nussbaum",
        "identifies",
        "ten",
        "central",
        "human",
        "capability",
        "society",
        "make",
        "available",
        "citizen",
        "bodily",
        "health",
        "included",
        "within",
        "ten",
        "life",
        "defines",
        "able",
        "live",
        "end",
        "human",
        "life",
        "normal",
        "length",
        "dying",
        "prematurely",
        "one",
        "life",
        "reduced",
        "worth",
        "living",
        "nussbaum",
        "health",
        "understood",
        "necessary",
        "partly",
        "constitutive",
        "human",
        "dignity",
        "flourishing",
        "human",
        "life",
        "nussbaum",
        "capability",
        "theorist",
        "capability",
        "health",
        "thus",
        "direct",
        "importance",
        "justice",
        "daniel",
        "health",
        "strategic",
        "importance",
        "fair",
        "opportunity",
        "power",
        "faden",
        "developed",
        "different",
        "theory",
        "structural",
        "justice",
        "like",
        "nussbaum",
        "capability",
        "theory",
        "also",
        "see",
        "health",
        "direct",
        "matter",
        "justice",
        "however",
        "nussbaum",
        "focus",
        "health",
        "capability",
        "power",
        "faden",
        "focus",
        "health",
        "theory",
        "anchored",
        "account",
        "human",
        "wellbeing",
        "health",
        "one",
        "six",
        "core",
        "element",
        "element",
        "defended",
        "characteristically",
        "present",
        "decent",
        "human",
        "life",
        "requires",
        "appropriate",
        "social",
        "structure",
        "secure",
        "realization",
        "experienced",
        "individual",
        "relying",
        "solely",
        "effort",
        "power",
        "faden",
        "egalitarian",
        "commitment",
        "evidenced",
        "view",
        "structural",
        "justice",
        "entail",
        "ensuring",
        "individual",
        "globally",
        "experience",
        "six",
        "wellbeing",
        "element",
        "human",
        "right",
        "grounded",
        "commensurate",
        "decent",
        "human",
        "life",
        "also",
        "reflected",
        "theory",
        "focal",
        "concern",
        "unfair",
        "relation",
        "power",
        "advantage",
        "well",
        "human",
        "right",
        "intimate",
        "relationship",
        "unfairness",
        "wellbeing",
        "human",
        "right",
        "power",
        "faden",
        "much",
        "theory",
        "taken",
        "interconnection",
        "moving",
        "part",
        "structural",
        "injustice",
        "view",
        "deprivation",
        "one",
        "core",
        "element",
        "wellbeing",
        "like",
        "health",
        "likely",
        "cause",
        "consequence",
        "deprivation",
        "element",
        "wellbeing",
        "direct",
        "implication",
        "public",
        "health",
        "policy",
        "view",
        "unfair",
        "pattern",
        "disadvantage",
        "unfair",
        "power",
        "relation",
        "powerful",
        "driver",
        "deprivation",
        "human",
        "right",
        "violation",
        "turn",
        "usher",
        "exacerbate",
        "form",
        "structural",
        "unfairness",
        "different",
        "way",
        "explicating",
        "health",
        "matter",
        "justice",
        "health",
        "contributes",
        "overall",
        "utility",
        "welfare",
        "strategic",
        "importance",
        "fair",
        "opportunity",
        "central",
        "human",
        "capability",
        "health",
        "core",
        "element",
        "human",
        "wellbeing",
        "provide",
        "reason",
        "national",
        "global",
        "policysetting",
        "structure",
        "place",
        "priority",
        "health",
        "provides",
        "justification",
        "overlapping",
        "distinctive",
        "extensive",
        "collective",
        "investment",
        "public",
        "health",
        "service",
        "practice",
        "also",
        "different",
        "implication",
        "public",
        "health",
        "policy",
        "example",
        "argument",
        "fair",
        "opportunity",
        "underscore",
        "importance",
        "arguably",
        "prioritize",
        "intervention",
        "protect",
        "restore",
        "aspect",
        "health",
        "relate",
        "normal",
        "opportunity",
        "range",
        "societal",
        "prospect",
        "theory",
        "focus",
        "capability",
        "health",
        "focus",
        "securing",
        "health",
        "may",
        "different",
        "implication",
        "public",
        "health",
        "institution",
        "set",
        "target",
        "priority",
        "certainly",
        "health",
        "policy",
        "evaluated",
        "theory",
        "advocate",
        "interconnectedness",
        "health",
        "valued",
        "human",
        "state",
        "suggest",
        "wider",
        "range",
        "relevant",
        "outcome",
        "public",
        "health",
        "public",
        "health",
        "ethic",
        "theory",
        "focus",
        "health",
        "open",
        "one",
        "way",
        "another",
        "familiar",
        "criticism",
        "utilitarian",
        "rawlsian",
        "capability",
        "wellbeing",
        "theory",
        "yet",
        "another",
        "approach",
        "articulating",
        "value",
        "health",
        "thus",
        "public",
        "health",
        "found",
        "health",
        "human",
        "right",
        "literature",
        "see",
        "mann",
        "et",
        "al",
        "mann",
        "beyrer",
        "et",
        "al",
        "beyrer",
        "pizer",
        "tasioulas",
        "vayena",
        "a",
        "tasioulas",
        "vayena",
        "b",
        "gostin",
        "friedman",
        "early",
        "s",
        "jonathan",
        "mann",
        "pioneered",
        "approach",
        "public",
        "health",
        "explicitly",
        "framed",
        "health",
        "human",
        "right",
        "issue",
        "human",
        "right",
        "violation",
        "public",
        "health",
        "issue",
        "subsequent",
        "work",
        "health",
        "human",
        "right",
        "tradition",
        "dominated",
        "scholar",
        "advocate",
        "health",
        "law",
        "public",
        "health",
        "practice",
        "strong",
        "link",
        "activist",
        "humanitarian",
        "organization",
        "gostin",
        "general",
        "matter",
        "health",
        "human",
        "right",
        "tradition",
        "relies",
        "international",
        "declaration",
        "human",
        "right",
        "human",
        "right",
        "law",
        "foundation",
        "probe",
        "philosophical",
        "underpinnings",
        "human",
        "right",
        "connection",
        "theory",
        "justice",
        "philosophical",
        "account",
        "human",
        "right",
        "congenial",
        "inclusion",
        "health",
        "basic",
        "human",
        "right",
        "however",
        "quite",
        "opposite",
        "multiple",
        "rival",
        "candidate",
        "justification",
        "human",
        "right",
        "interestbased",
        "theory",
        "power",
        "faden",
        "raz",
        "griffin",
        "beitz",
        "controlbased",
        "theory",
        "darwall",
        "hart",
        "dignitybased",
        "theory",
        "kamm",
        "tasioulas",
        "interpreted",
        "support",
        "inclusion",
        "health",
        "human",
        "right",
        "see",
        "entry",
        "human",
        "right",
        "regardless",
        "one",
        "explanation",
        "ground",
        "human",
        "right",
        "claiming",
        "individual",
        "human",
        "right",
        "health",
        "health",
        "made",
        "matter",
        "justice",
        "since",
        "individual",
        "entitlement",
        "health",
        "moreover",
        "framing",
        "health",
        "human",
        "right",
        "appealing",
        "context",
        "discussion",
        "public",
        "health",
        "ethic",
        "framing",
        "provides",
        "basis",
        "making",
        "state",
        "first",
        "guarantor",
        "human",
        "right",
        "responsible",
        "promoting",
        "protecting",
        "health",
        "individual",
        "residing",
        "within",
        "jurisdiction",
        "however",
        "approaching",
        "value",
        "health",
        "standpoint",
        "different",
        "theory",
        "justice",
        "open",
        "general",
        "criticism",
        "associated",
        "theory",
        "accounting",
        "health",
        "term",
        "human",
        "right",
        "open",
        "broad",
        "challenge",
        "apply",
        "account",
        "human",
        "right",
        "generally",
        "buchanan",
        "sreenivasan"
    ]
}